{
  "info": {
    "authors": [
      "H. Cem Bozsahin"
    ],
    "book": "Computational Linguistics",
    "id": "acl-J02-2002",
    "title": "The Combinatory Morphemic Lexicon",
    "url": "https://aclweb.org/anthology/J02-2002",
    "year": 2002
  },
  "references": [
    "acl-C88-1018",
    "acl-C90-2030",
    "acl-E89-1002",
    "acl-E99-1009",
    "acl-J91-4003",
    "acl-J93-4002",
    "acl-J96-1003",
    "acl-J96-3001",
    "acl-P87-1012",
    "acl-P88-1030",
    "acl-P89-1033",
    "acl-P91-1010",
    "acl-P96-1011",
    "acl-P97-1003",
    "acl-P98-1025"
  ],
  "sections": [
    {
      "heading": "The Combinatory Morphemic Lexicon Cem Bozsahin* Middle East Technical University",
      "text": [
        "Grammars that expect words from the lexicon may be at odds with the transparent projection of syntactic and semantic scope relations of smaller units.",
        "We propose a morphosyntacticframework based on Combinatory Categorial Grammar that provides flexible constituency, flexible category consistency, and lexical projection of morphosyntactic properties and attachment to grammar in order to establish a morphemic grammar-lexicon.",
        "These mechanisms provide enough expressive power in the lexicon to formulate semantically transparent specifications without the necessity to confine structure forming to words and phrases.",
        "For instance, bound morphemes as lexical items can have phrasal scope or word scope, independent of their attachment characteristics but consistent with their semantics.",
        "The controls can be attuned in the lexicon to language-particular properties.",
        "The result is a transparent interface of inflectional morphology, syntax, and semantics.",
        "We present a computational system and show the application of the framework to English and Turkish."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The study presented in this article is concerned with the integrated representation and processing of inflectional morphology, syntax, and semantics in a unified grammar architecture.",
        "An important issue in such integration is mismatches in morphological, syntactic, and semantic bracketings.",
        "The problem was first noted in derivational morphology.",
        "Williams (1981) provided examples from English; the semantic bracketings in (1a2a) are in conflict with the morphological bracketings in (1b2b).",
        "If the problem were confined to derivational morphology, we could avoid it by making derivational morphology part of the lexicon that does not interact with grammar.",
        "But this is not the case.",
        "Mismatches in morphosyntactic and semantic bracketing",
        "* Computer Engineering and Cognitive Science, Middle East Technical University, 06531 Ankara, Turkey.",
        "E-mail: bozsahin@metu.edu.tr.",
        "(2) a.",
        "-ingb.",
        "Godel Godel numbernumber -ing (1) a. hydro electric -ityb.",
        "hydro electric -ity",
        "~c 2002 Association for Computational Linguistics Computational LinguisticsVolume 28, Number 2 also abound.",
        "This article addresses such problems and their resolution in a computational system.1 Muller (1999, page 401) exemplifies the scope problem in German prefixes.",
        "(3a) is in conflict with the bracketing required for the semantics of the conjunct (3b).",
        "(3) a. Wenn [Ihr Lust]und [ noch nichts anderes vor- ]habt, ifyou pleasure and yet nothing else intend konnen wir sie javomFlughafen abholen can we them PARTICLE from.the airport pick up If you feel like it and have nothing else planned, we can pick them up at the airport.",
        "b. Ihr Lust habt UND noch nichts anderes vorhabt Similar problems can be observed in Turkish inflectional suffixes.",
        "In the coordination of tensed clauses, the tense attaches to the verb of the rightmost conjunct (4a) but applies to all conjuncts (4b).",
        "Delayed affixation appears to apply to all nominal inflections (4ce).",
        "(4) a. Zorunludepremsigortas [ yururlu^ge girmis ]ama mandatory earthquake insurance effectenter-ASP but [ tam anlamyla uygulanamams ]-t exactlyapply-NEG-ASP-TENSE Mandatory earthquake insurance had gone into effect, but it had not been enforced properly.",
        "b. yururlu^ge girmis-ti ama tam anlamyla uygulanamams-t c. Adam-n [ araba ve ev ]-i man-GEN car and house-POSS the mans house and car d. Araba-y [adam ve cocuk]-lar-agoster-di-m Car-ACC man and child-PLU-DAT show-TENSE-PERS1 (I) showed the car to the men and the children.",
        "e. Araba-y sen-in[dost ve tandk]-lar-n-agoster-di-m Car-ACC you-GEN friend and acq.-PLU-POSS-DAT showed (I) showed the car to the your friends and acquaintances.",
        "Phrasal scope of inflection can be seen in subordination and relativization as well.",
        "In (5a), the entire nominalized clause marked with the accusative case is the object of want.",
        "In (5b), the relative participle applies to the relative clause, which lacks an object.",
        "The objects case is governed by the subordinate verb, whose case requirements might differ from that of the matrix verb (5c).",
        "As we show later in this section, the coindexing mechanisms in word-based unification accounts of unbounded extraction face a conflict between the local and the nonlocal behavior of the relativized noun, mainly due to applying the relative participle -di^g-i to the verbal stem ver rather than the entire relative clause.",
        "A lexical entry for -di^g-i would resolve the conflict and capture the fact that it applies to nonsubjects uniformly.",
        "(5) a.",
        "Can[Aysenin kitab-oku-ma-s]-niste-di C.NOM A.-GEN book-ACC read-INF-AGR-ACC want-TENSE Can wanted Ayse to read the book.",
        "lit.",
        "Can wanted Ayses-reading-the-book.",
        "b. Ben[Mehmetin cocu^g-a/*-uver]-di^g-ikitab-oku-du-m I.NOM M-GEN child-DAT/*ACC give-REL.OP book-ACC read-TENSE-PERS1 I read the book that Mehmet gave to the child.",
        "c. Ben[Mehmetin kitab-ver]-di^g-icocu^g-u/*-agor-du-m"
      ]
    },
    {
      "heading": "I.NOM M-GEN book-ACC give-REL.OP child-ACC/*DAT see-TENSE-PERS1 I saw the child to whom Mehmet gave the book.",
      "text": [
        "The morphological/phrasal scope conflict of affixes is not particular to morphologically rich languages.",
        "Semantic composition of affixes in morphologically simpler languages poses problems with word (narrow) scope of inflections.",
        "For instance, fake trucks needs the semantics (plu(faketruck)), which corresponds to the surface bracketing [fake truck]-s, because it denotes the nonempty nonsingleton sets of things that are not trucks but fake trucks (Carpenter 1997).",
        "Four trucks, on the other hand, has the semantics (four(plu truck)), which corresponds to four [truck]-s, because it denotes the subset of nonempty nonsingleton sets of trucks with four members.",
        "The status of inflectional morphology among theories of grammar is far from settled, but, starting with Chomsky (1970), there seems to be an agreement that derivational morphology is internal to the lexicon.",
        "Lexical Functional Grammar (LFG) (Bresnan 1995) and earlier Government and Binding (GB) proposals e.g. (Anderson 1982) consider inflectional morphology to be part of syntax, but it has been delegated to the lexicon in Head-Driven Phase Structure Grammar (HPSG) (Pollard and Sag 1994, page 35) and in the Minimalist Program (Chomsky 1995, page 195).",
        "The representational status of the morpheme is even less clear.",
        "Parallel developments in computational studies of HPSG propose lexical rules to model inflectional morphology (Carpenter and Penn 1994).",
        "Computational models of LFG (Tomita 1988) and GB (Johnson 1988; Fong 1991), on the other hand, have been noncommittal regarding inflectional morphology.",
        "Finally, morphosyntactic aspects have always been a concern in Categorial Grammar (CG) (e.g., Bach 1983; Carpenter 1992; Dowty 1979; Heylen 1997; Hoeksema 1985; Karttunen 1989; Moortgat 1988b; Whitelock 1988), but the issues of constraining the morphosyntactic derivations and resolving the apparent mismatches have been relatively untouched in computational studies.",
        "We briefly look at Phrase Structure Grammars (PSGs), HPSG, and Multimodal CGs (MCGs) to see how word-based alternatives for morphosyntax would deal with",
        "Computational LinguisticsVolume 28, Number 2 the issues raised so far.",
        "For convenience, we call a grammar that expects words from the lexicon a lexemic grammar and a grammar that expects morphemes a morphemic grammar.",
        "A lexemic PSG provides a lexical interface for inflected words (X0s) such that a regular grammar subcomponent handles lexical insertion at X0 .2 In (4d), the right conjunct cocuk-lar-a is analyzed as N0 > cocuk-PLU-DAT (or N0 > N0, -DAT, N0, > N0,, -PLU, N0,, > Stem, as a regular grammar).",
        "Assuming a syncategorematic coordination schema, that is, X > X and X, the N0 in the left and right conjuncts of this example would not be of the same type.",
        "Revising the coordination schema such that only the root features coordinate would not be a solution either.",
        "In (4e), the relation of possession that is marked on the right conjunct must be carried over to the left conjunct as well.",
        "What is required for these examples is that the syntactic constituent X in the schema be analyzed as X-PLU(-POSS)-DAT, after N0 and N0 coordination.",
        "What we need then is not a lexemic but a morphemic organization in which bracketing of free and bound morphemes is regulated in syntax.",
        "The lexicon, of course, must now supply the ingredients of a morphosyntactic calculus.",
        "This leads to a theory in which semantic composition parallels morphosyntactic combination by virtue of bound morphemes being able to pick their domains just like words (above X0, if needed).",
        "A comparison of English and Turkish in this regard is noteworthy.",
        "The English relative pronouns that/whom and the Turkish relative participle -di^g-i would have exactly the same semantics when the latter is granted a representational status in the lexicon (see Section 6).",
        "Furthermore, rule-based PSGs project a rigid notion of surface constituency.",
        "Steed man (2000) argued, however, that syntactic processes such as identical element deletion under coordination call for flexible constituency, such as SO (subject-object) in the SVO & SO gapping pattern of English and SV (subject-verb) constituency in the OSV & SV pattern of Turkish.",
        "Nontraditional constituents are also needed in specifying semantically transparent constituency of words, affixes, clitics, and phrases.",
        "Constraint-based PSGs such as HPSG appeal to coindexation and feature passing via unification, rather than movement, to deal with such processes.",
        "HPSG also makes the commitment that inflectional morphology is internal to the lexicon, handled either by lexical rules (Pollard and Sag 1994) or by lexical inheritance (Miller and Sag 1997).",
        "We look at (5c) to highlight a problem with the stem-and-inflections view.",
        "As words enter syntax fully inflected, the sign of the verb ver-di^g-i in the relative clause (5c) would be as in (6a), in which the SUBCAT list of the verb stem is, as specified in the lexical entry for ver, unsaturated.",
        "The participle adds coindexation in MODJ JINDEX.",
        "The HPSG analysis of this example would be as in Figure 1.",
        "Although passing the agreement features of the head separately (Sehitoglu 1996) solves the case problem alluded to in (5c), however, structure sharing of the NPdat with the SLASH, INDEX, and CONTENT features of ver-di^g-i is needed for semantics (GIVEE), but this conflicts with the head features of the topmost NPacc in the tree.",
        "The relative participle as a lexical entry (e.g., (6b)) would resolve the problem with subcategorization because its SUBCAT list is empty (like the relative pronoun that in English), hence there would be no indirect dependence of the nonlocal SLASH feature and the local SUBCAT feature via semantics (CONTENT).",
        "Such morphemic alternatives are not considered in HPSG, however, and require a significant revision in the theory.",
        "Furthermore, HPSGs lexical 2 But see Creider, Hankamer, and Wood (1995), which argues that the morphotactics of human languages is not regular but linear context free.",
        "For instance, Frau has the category ^case^fem^sg^3p^declN, which underspecifies it for case and declension.",
        "Underspecification is dealt with in the grammar using inclusion postulates (e.g., (7)).",
        "The interaction of different modalities is regulated by distribution postulates.",
        "(7) ^caser F X^case^ F_ X ^nom^ F X^acct F_ X",
        "Lexical assignments to inflected words carry unary modalities: boys has the type ^plN, in contrast to ^sgN for boy.",
        "Although such regulation of inflectional features successfully mediates, for example, subject-verb agreement or NP-internal case agreement (as in German), it is essentially word-based, because type assignments are to inflected forms; morphemes do not carry types.",
        "This reliance on word types necessitates a lexical rulebased approach to some morphosyntactic processes that create indefinitely long words, such as ki-relativization in Turkish (see Section 6.5).",
        "But lexical rules for such processes risk nontermination (Sehitoglu and Bozsahin 1999).",
        "Our main point of departure from MCG accounts is the morphemic versus lexemic nature of the lexicon: The morphosyntactic and attachment modalities originate from the lexicon; they are not properties of the grammar (we elaborate more on this later).",
        "This paves the way to the morphemic lexicon by licensing type assignments to units smaller than words.",
        "Besides problems with lexical rules, the automata-theoretic power of MCGs is problematic: Unrestricted use of structural modalities and postulates leads to Turing completeness (Carpenter 1999).",
        "Indeed, one of the identifiable fragments of Mul149 Computational LinguisticsVolume 28, Number 2 Figure 1 HPSG analysis of (5c).",
        "timodal languages that is computationally tractable is Combinatory Categorial languages (Kruijff and Baldridge 2000), which we adopt as the basis for the framework presented here.",
        "We propose a morphosyntactic Combinatory Categorial Grammar (CCG) in which the grammar and the morphemic lexicon refer to morphosyntactic types rather than syntactic types.",
        "We first introduce the syntactic CCG in Section 2.",
        "Morphosyntactic CCG is described in Section 3.",
        "In Section 4, we look at the computational aspects of the framework.",
        "We then show its realization for some aspects of English (Section 5) and Turkish (Section 6).",
        "(9) Forward Application (>):4 X/Y: f Y: a - X: fa Backward Application (<): Y: a X\\Y: f - X: fa CCG (Steedman 1985, 1987, 1988; Szabolcsi 1983, 1987) is an extended version of AB that includes function composition (10), substitution, and type raising (11).",
        "These extensions make CCGs mildly context sensitive.",
        "(10) Forward Composition (> B): X/Y: f Y/Z: g - X/Z: ^x .f (gx) Backward Composition (<B): Y\\Z:g X\\Y: f - X\\Z: ^x .f (gx) (11) Forward Type Raising (>T):5 X: a - T/(T\\X): ^f.f [a] Backward Type Raising (<T): X: a - T\\(T/X): ^f.f [a]",
        "The lattice of diacritics for (a) Turkish and (b) English.",
        "instance, the set of number-marked nouns can be represented as nMN, where M is a morphosyntactic modality (equals) and n is a diacritic (for number).",
        "Books is of type nMN, but book is not.",
        "The type for books can be obtained morphosyntactically by assigning s (-PLU) the functor type A N\\ A N, where b stands for base.",
        "A syntactic type such as N\\N overgenerates.",
        "Another modality, < (up to and equals), allows wider domains in morphosyntactic typing.",
        "For instance,n < N represents the set of nouns marked on number or any other diacritic that is lower than number in a partial order (e.g., Figure 2).",
        "The inflectional paradigm of a language can be represented as a partial ordering using the modalities.8 For instance, if the paradigm is Base-Number-Case, we have ^(<bN)^^( <n N) ^ ^ ( <c N), where ^ (^) is the valuation function from the morphosyntactic type ^ to the set of strings that have the type ^.",
        "The M modality is more strict than < to provide finer control; although ^ ( <n N) ^ ^(<c N), ^(nMN)^~ ^ (cM N), because a noun can be number marked but not case marked or vice versa.",
        "Also, ^ ( Mi N) ^ ^ (<i N) for any diacritic i since, for instance, the set of nouns marked up to and including case includes case-marked, number-marked, and unmarked nouns.",
        "The lattice consistency condition is imposed on the set of diacritics to ensure category unity.9 In other words, the syntactic type X can be viewed as an abbreviation T for the morphosyntactic type < X where T is the universal upper bound.",
        "It is the",
        "8 See Heylen (1997) on use of unary modalities for a similar purpose in lexemic MCG.",
        "9 In a lattice L, x < y (morphosyntactically, x < y) is equivalent to the consistency properties x n y = x and x v y = y.",
        "We use the join operator for this check, thus it suffices to have a join semilattice.",
        "syntactic types for A,) (M corresponds to lattice condition =) (< corresponds to lattice condition ^) The set of complex morphosyntactic types: Bm, Am, ^ Bm, If X ^ Bm, and Y ^ Bm,, then X\\Y and X/Y ^ Bm, For instance, the infinitive marker ma in (14a) can be lexically specified to look a for untensed VPsfunctions onto < Sto yield a complex noun base (14b), which, as a consequence of nominalization (result type N), receives case to become an argument of the matrix verb.",
        "The adjective in fake truck, can be restricted to modify unmarked Ns to get the bracketing [fake truck]-, (14c).",
        "(14) a. Mehmet [ [ kitab-oku ]-ma ]-yi,tiyor M.NOM book-ACC read-INF-ACC wants Mehmet wants to read the book.",
        "b.",
        "-INF := ma ^ < N\\( <a S\\ < NPnom): ^f .f c. fake :=fake ^ < N/ < N: ^x.fakex Different attachment characteristics of words, affixes, and clitics must be factored into the prosodic domain as a counterpart of refining the morphosyntactic description.",
        "In Montague Grammar, every syntactic rule is associated with a certain mode of attachment, and this tradition is followed in MCG; attachment types are related with the slash (e.g., /w for wrapping), which is a grammatical modality.10 In the present framework, however, attachment is projected from the lexicon to the grammar as a prosodic property of the lexical items.11 The grammar is unimodal in the sense that / and \\ simply indicate the function-argument distinction in adjacent prosodic elements.",
        "The lexical projection of attachment further complements the notion of morphemic lexicon so that bound morphemes are no longer parasitic on words but have an independent 10 See Dowty (1996) and Steedman (1996) for a discussion of bringing nonconcatenative combination into grammar.",
        "11 There is a precedent of associating attachment characteristics with the prosodic element rather than the slash in CG (Hoeksema and Janda 1988).",
        "In Hoeksema and Jandas notation, arguments can be constrained on phonological properties and attachment.",
        "For instance, the English article a has its NP/N category spelled out as </CX/N,NP,Pref>, indicating a consonantal first segment for the noun argument and concatenation to the left.",
        "I have a pen.",
        "representational status of their own.",
        "We write o s to denote the attachment modality i (affixation, syntactic concatenation, cliticization) of the prosodic elements.",
        "Table 1 shows some lexical assignments for Turkish (e.g., the sign ^a s ^ X\\Y: characterizes a suffix).",
        "The morphosyntactic calculus of CCG is defined with the addition of morphosyntactic types and attachment modalities as follows (similarly, for other combinatory rules):",
        "(15) Forward Application (>):o s1 ^ X/ o; Y: f^j s2^ 02 Y: a",
        "The main functors argument specification (^1 of o; Y in (15)) determines the lattice condition in derivations .12 Hence the morphosyntactic decoration in lexical assignments propagates its lattice condition to grammar as in ^2^1^1 (cf. Heylen [1997], in which the grammar rule imposes a fixed partial order, e.g., X/Y combines with Z if 12 This coincides with Steedmans (1991b) observation that directionality of the main functors slash is also a property of the same argument.",
        "The main functor is the one whose result type determines the overall result type (i.e., X/Y in (15)).",
        "Computational LinguisticsVolume 28, Number 2 Z ^ Y).",
        "This is another prerequisite that must be fulfilled for the morphemic lexicon to project the lexical specification of scope.",
        "The grammar is not fixed on the attachment modality either (unlike a lexemic grammar, which is fixed on combination of words).",
        "Hence another requirement is the propagation of attachment to grammar.",
        "This is facilitated by the lexical types o s ^ ^: , where m is an attachment type.",
        "The attachment calculus o o F-a^k in (15), which reads attachment types i and j yield type k, relates attachment to prosodic combination in the grammar.13 It can be attuned to language-particular properties.",
        "We can specify some prosodic properties of the attachment calculus for Turkish as follows (~x indicates stress on the prosodic element x):"
      ]
    },
    {
      "heading": "BozsahinThe Combinatory Morphemic Lexicon",
      "text": [
        "The lexicalization of attachment modality helps to determine the prosodic domain of postconditions.",
        "For instance, for Turkish, vowel harmony does not apply over word boundaries, which can be enforced by applying it when the modality is ^a and ^c , but snot ^.",
        "Voicing applies to o and ^s, but not to o .",
        "The basic categories N, NP, S, S+t, and S_t carry agreement features of fixed arity (e.g., tense and person for S, S+t, and S^t, and case, number, person, and gender for N and NP).",
        "Positional encoding of such information as in Pulman (1996) allows efficient term unification for the propagation of these features.14 Term unification also handles the matching of complex categories in the CCG schema.",
        "For instance, o; A/(o22B \\ o; C) combines with 924B\\ 935C via (>) for B, C ^ As, if ^2 ^2 ^2, ^3 ^3 ^3 (^i ^ {< , ^ }).",
        "Apart from the matching of syntactic types and agreement, unification does no linguistic work in this framework, in contrast to structure-sharing in HPSG and slash passing in Unification CG (Calder, Klein, and Zeevat 1988).",
        "CCG is worst-case polynomially parsable (Vijay-Shanker and Weir 1993).",
        "This result depends on the finite schematization of type raising and bounded composition.",
        "Assuming a maximum valence of four in the lexicon (Steedman 2000a), composition (Bn) is bounded by n ^ 3.",
        "The refinement of the type raising schema (11) for finite schematization is shown in (17).",
        "(17) a.",
        "Revised Forward Type Raising (>T): NP: a - T/(T\\NP): ^f.f [a] b.",
        "Revised Backward Type Raising (<T): NP: a - T\\(T/NP): ^f .f [a]",
        "The finite schematization of type raising suggests that it can be delegated to the lexicon, for example, by a lexical rule that value-raises all functions onto NP to their type-raised variety, such as NP/N to (S/(S\\NP))/N.",
        "But this move presupposes the presence of such functions in the lexicon, that is, a language with determiners.",
        "To be transparent with respect to the lexicon, we make type raising and other unary schema (contraposition) available in the grammar.",
        "Since both are finite schemas in the revised formulation, the complexity result of Vijay-Shanker and Weir still holds.",
        "Checking the lattice condition as in (15) incurs a constant factor with a finite lattice.",
        "Type raising and composition cause the so-called spurious-ambiguity problem (Wittenburg 1987): Multiple analyses of semantically equivalent derivations are possible in parsing.",
        "This is shown to be desirable from the perspective of prosody; for example, different bracketings are needed to match intonational phrasing with syntactic structure (Steedman 1991).",
        "From the parsing perspective, the redundancy of analyses can be controlled by (1) grammar rewriting (Wittenburg 1987), (2) checking the chart for PAS equivalence (Karttunen 1989; Komagata 1997), (3) making the processor parsimonious on using long-distance compositions (Pareschi and Steedman 1987), or (4) parsing into normal forms (Eisner 1996; Hepple 1990b; Hepple and Morrill 1989; Konig 1989; Morrill 1999).",
        "We adopt Eisners method, which eliminates chains of compositions in O(1) time via tags in the grammar, before derivations are licensed.",
        "There is a switch that can be turned off during parsing to obtain all surface bracketings.",
        "14 Mediating agreement via unification, type subsumption, or set-valued indeterminacy has important consequences on underspecification, the domain of agreement, and the notion of like categories in coordination (see Johnson and Bayer 1995; Dalrymple and Kaplan 2000; Wechsler and Zlatic 2000).",
        "Rather than providing an elaborate agreement system, we note that Pulmans techniques provide the mechanism for implementing agreement as atomic unification, subsumption hierarchies represented as lattices, or set-valued features.",
        "The categorial ingredient of phrase-internal agreement can be provided by endotypic functors when necessary (see Sections 5 and 6).",
        "Computational LinguisticsVolume 28, Number 2 There is also a switch for checking the PAS equivalence, with the warning that the equivalence of two lambda expressions is undecidable.",
        "The parser is an adaptation of the Cocke-Kasami-Younger (CKY) algorithm (Aho and Ullman 1972, page 315), modified to handle unary rules as well: In the kth iteration of the CKY algorithm to build constituents of length k, the unary rules apply to the CKY table entries T[ ^;, ^;+k ], ; = 0,1, ... , n ^ k; that is, k-length results of binary rules are input to potential unary constituents of length k. In practice, this allows, for instance, a nominalized clause to be type-raised after it is derived as a category of type N. The remaining combinatory schema is already in Chomsky Normal Form, as required by CKY.",
        "The finite schematization of CCG rules and constant costs incurred by the normal form and lattice checking provide a straightforward extension of CKY-style context-free parsing for CCG.",
        "Komagata (1997) claims that the average complexity of CCG parsing is O(n3) even without the finite schematization of type raising (based on the parsing of 22 sentences consisting of around 20 words, with a lexicon of 200 entries and no derivation of semantics in the grammar; a morphological analyzer provided five analyses per second to the parser).",
        "Statistical techniques developed for lexicalized grammars (e.g., Collins 1997), readily apply to CCG to improve the average parsing performance in large-scale practical applications (Hockenmaier, Bierner, and Baldridge 2000).",
        "Both Collins and Hockenmeier, Bierner, and Baldridge used section 02-21 of the Wall Street Journal Corpus of Penn Treebank for training, which contains 40,886 words (70,151 lexical entries).",
        "A recent initiative (Oflazer, et al.",
        "2001) aims to provide such a resource of around one million words for Turkish.",
        "It encodes in the Treebank surface syntactic relations and the morphological breakdown of words.",
        "The latter is invaluable for training morphemic grammars and lexicons.",
        "In morpheme-based parsing, lattice conditions help eliminate the permutation problem in endotypic categories.",
        "Such categories are typical of inflectional morphemes.",
        "For instance, assume that three morphemes m1, m2, and m3 have endotypic categories (say N\\N), that they can appear only in this order, and that they are all optional.",
        "The",
        "The processing of kazmalar in three different architectures (see Example (19) for glosses).",
        "words, a lexemic grammar (e.g., Figure 3a) is computationally nontransparent when interpretation is a component of an NLP system.",
        "Regarding the first question, let us consider two architectures from the perspective of the lexicon for the purpose of morphology, morphemic syntax, and semantics interface.",
        "The architecture in Figure 3b incorporates the current proposal as an interpretive front end to a morphological analyzer such as Oflazers (1994), which delivers the analyses of words as a stream of morphemes out of which the bound morphemes have to be matched with their semantics from the affix lexicon to be interpretable in grammar.",
        "The advantage of this model is its efficiency; morphological parsing of words isin principlelinear context free; hence, finite-state techniques and their computational advantages readily apply.",
        "But the uninterpretable surface forms of bound morphemes must match with those of the affix lexicon, and this is not necessarily a one-to-one mapping because of multiple lexical assignments for capturing syntacticsemantic distinctions (e.g., dative case as a direct object, indirect object, or adjunct marker or i as a possessive and/or compound marker).",
        "Surface formsemantics pairing is not a trivial task, particularly in the case of lexically composite affixes, which require semantic composition as well as tokenization.",
        "The matching process needs to be aware of all the syntactic contexts in which certain affix sequences act as a unit, for example, relative participles and agreement markers (-di^g-i relative participle as -OP-POSS or -OP-AGR), possessive and compound markers, etc., for Turkish.",
        "The factorization of syntactic issues into a morphological analyzer would also make the separate morphological component nonmodular or expand its number of states to factor in these concerns (e.g., treating the -OP-POSS sequence as a state different from OP followed",
        "by -POSS, in which -POSS is not interpreted with the semantics of possession but that of agreement marking).",
        "Not knowing how many of the syntactic distinctions are handled by the morphological analyzer, a subsequent interpreter may need to reconsult the grammar if scoping problems arise.",
        "The architecture in Figure 3c describes the current implementation of the proposal.",
        "Bound morphemes are fed to the parser along with their interpretation.",
        "This model is preferred over that presented in Figure 3b for its simplicity in design and extendibility.",
        "16 The price is lesser efficiency due to context-free processing of inflectional morphology.",
        "By one estimate (Oflazer, Gocmen, and Bozsahin 1994), Turkish has 59 inflectional morphemes out of a total of 166 bound morphemes, and Oflazer (personal communication) notes that the average number of bound morphemes per word in unrestricted corpora is around 2.8, including derivational affixes.",
        "In a news corpus of 850,000 words, the average number of inflections per word is less than two (Oflazer et al.",
        "2001).",
        "This is tolerable for sentences of moderate length in terms of the extra burden it puts on the context-free parser.",
        "Table 2 shows the results of our tests with a Prolog implementation of the system on different kinds of constructions.",
        "The test cases included 10 lexical items on average, with an average parsing time of 0.32 seconds per sentence.",
        "A relatively long sentence (12 words, 21 morphemes) took 2.9 seconds to parse.",
        "The longest sentence (20 words, 37 morphemes) took 40 seconds.",
        "The lexicon for the experiment included 700 entries; 139 were free morphemes and 561 were bound morphemes compiled out of 105 allomorphic representations (including all the ambiguous interpretations of bound morphemes and the results of lexical rules).",
        "For a rough comparison with an existing NLP system with no disambiguation 16 The morphological analyzer would be in no better position to handle morphemesemantics pairing if the architecture in Figure 3b were implemented with an integrated lexicon of roots and affixes.",
        "For instance, -POSS would still require distinct states because of the difference in the semantics of possession and agreement marking coming from the lexicon.",
        "Computational LinguisticsVolume 28, Number 2 aids, Gungordu and Oflazer (1995) reported average parsing times of around 10 seconds per sentence for a lexicon of 24,000 free morphemes, and their morphological analyzer delivered around two analyses per second to a lexemic grammar.",
        "Oflazers later (1996) morphological analyzer contained an abstract morphotactic component of around 50 states for inflections, which resulted in compilation to 30,000 states and 100,000 transitions when the morphophonemic rules were added to the system.",
        "In conclusion, we note that the current proposal for a morphemic lexicon and grammar is compatible with both a separate morphological component (Figure 3b) and syntax-integrated inflectional morphology (Figure 3c).",
        "The architecture in Figure 3b may in fact be more suitable for inflecting languages (e.g., Russian) in which the surface forms of bound morphemes are difficult to isolate (e.g., meste, locative singular of mesto) but can be delivered as a sequence of morpheme labels by a morphological analyzer (e.g. mesto-SING-LOC) to be matched with the lexical type assignments to SING and -LOC for grammatical interpretation.",
        "It might be argued that in computational models of the type in Figure 3b, the lattice is not necessary, because the morphological analyzer embodies the tactical component.",
        "But not only tactical problems (cf.",
        "Example (18) and its discussion) but also transparent scoping in syntax and semantics is regulated by the use of lattice in type assignments, and that is our main concern.",
        "We show examples of such cases in the remainder of the article.",
        "Thus the nonredundant role of the lattice decouples the morphemic grammar lexicon from the kind of morphological analysis performed in the back end.",
        "5.",
        "Case Study: The English Plural In this section, we present a morphosyntactic treatment of the English plural morpheme.",
        "The lattice for English is shown in Figure 2b.",
        "We follow Carpenter (1997) in categorizing numerical modifiers and intersective adjectives as plural noun modifiers: four boys is interpreted as four(plu boy) and green boxes as green(plu box).",
        "This bracketing reflects the set of sets interpretation of the plural noun; four(plu boy) denotes the set of nonempty nonsingleton sets of boys with four members.",
        "The type assignments in (20) correctly interpret the interaction of the plural and these modifiers (cf. 21ab).",
        "The endotypic category of the plural also allows phrase-internal number agreement for languages that require it; the agreement can be regulated over the category N before the specifier is applied to the noun group to obtain NP.",
        "Computational LinguisticsVolume 28, Number 2 not as *four(plu(green box)), and four toy gus is interpreted as four(plu(toygun)), not as *plu(four(toygun)).",
        "These derivations preserve the domain of the modifiers and the plural without rebracketing."
      ]
    },
    {
      "heading": "6. Case Study: Turkish Morphosyntax",
      "text": [
        "There have been several computational studies to model morphologysyntax interaction in Turkish.",
        "These unification-based approaches represent varying degrees of integration.",
        "Gungordu and Oflazer (1995) isolates morphology from syntax by having separate modules (a finite-state transducer for the former, and an LFG component for the latter), that is, the syntax is lexemic.",
        "The morphological component is expected to handle all aspects of morphology, including inflections and derivations.",
        "In Sehitoglu and Bozsahin (1999), lexical rules implement inflectional morphology, and derivations are assumed to take place in the lexicon.",
        "Hoffmans (1995) categorial analysis of Turkish is also lexemic; all lexical entries are fully inflected.",
        "Interpretive components of these systems face the aforementioned difficulties because of their commitment to lexemic syntax.",
        "Inflectional morphology is incorporated into syntax in another categorial approach (Bozsahin and Gocmen 1995), but morphotactic constraints are modeled with nonmonotonic unification, such as nonexistence checks for features and overrides.",
        "The system cannot make finer distinctions in morphosyntactic types either.",
        "The result is an overgenerating and nontransparent integration of morphology and syntax because of the possibility of rebracketing and the unresolved representational basis of the lexicon.",
        "In this section, we outline the application of the proposed framework to Turkish.",
        "We analyze a large fragment of the language, without any claims for a comprehensive grammar.",
        "The phenomena modeled here exhibit particular morphosyntactic problems described in the preceding sections.",
        "We assume the binding theory in Steedman (1996), which is predicated over the PAS.",
        "In each section, we provide a brief empirical observation about the phenomenon, propose lexical type assignments, exemplify derivations of the parser, and briefly discuss the constraints imposed by morphosyntactic types.",
        "Because of space considerations, we sometimes use abbreviated forms in derivations such as the genitive affixs (N/(N\\N))\\N category for (<o N/(o^ Np\\ o^ Np))\\ <o Np, but the parser operates on full morphosyntactic representations."
      ]
    },
    {
      "heading": "6.1 Case Marking and Word Order",
      "text": [
        "Turkish is regarded as a free constituent order language; all permutations of the predicate and its arguments are grammatical in main clauses, being subject to constraints on discourse and semantic properties such as definiteness and referentiality of the argument and topicfocus distinctions.",
        "The mapping of surface functions to grammatical relations is mediated by case marking.",
        "Word order variation has lesser functionality in embedded clauses because embedded arguments are less accessible to surface discourse functions like topic and focus.",
        "Embedded clauses are verb final."
      ]
    },
    {
      "heading": "BozsahinThe Combinatory Morphemic Lexicon",
      "text": [
        "the arguments are determined not by directionality but by case in such languages.",
        "The category S\\NPnom\\NPacc resolves the ambiguity (24bc).",
        "b. sev (like) := ^s sev ^ <v S\\ < NPnom \\ < NPacc: ^x.",
        "^y.",
        "l i ke xy c. ver (give) := ^s ver ^ <v S\\ < NPnom\\ < NPdat\\ < NPacc: ^x.^y.^z.giveyxz d. < S\\ < NPnom\\ < NPacc : ^x.",
        "^y.l i ke xy - < S \\ < NPaccref \\ < NPnom : ^y.",
        "^x.",
        "l i ke xy e. -ACC := ^a i||u|u|yi|y|yu|yu ^ <c Nacc\\ <o N: ^f .f f. -LOC := ^a de |da |te |ta ^ ( <^ S/ <^ S)\\ <o N: ^x.^f.atfx Gapping behavior seems to indicate that Turkish is verb final, not just SOV.",
        "SO and OS syntactic types must be distinguished to account for SO & SOV, OS & OSV, *SO & OSV and *OS & SOV.",
        "The OS & OSV pattern requires the lexical category S\\NPacc\\NPnom for the verb (Bozsahin 2000b).",
        "SOV and OSV base orders can be captured uniquely in the lexicon in set-CCG notation as S\\{NPacc,NPnom}.",
        "Set-CCG is strongly equivalent to CCG (Baldridge 1999).",
        "We distinguish SOV and OSV lexically, however, because OSV requires referential objects (25ab).",
        "OSV is generated from SOV by a lexical rule (24d).",
        "This is genuine lexical ambiguity, because the two related entries differ in semantics (referentiality).",
        "(25) a. Kitab-adamoku-du",
        "Mehmet read the little green book, and the child, the newly arrived magazine.",
        "Our lexical type assignment to case morphemes (24ef) departs from other CCG analyses of case (e.g., Steedman 1985, 1991a, Bozsahin 1998).",
        "These studies correlate morphological case with type raising of arguments, in the case of Bozsahin (1998), via a value-raised category assignment to case morphemes.",
        "Evidence from NP-internal case agreement and case stacking (Kracht 1999) challenges the type-raising approach.",
        "Agreement phenomena require that case (which can be marked on articles, adjectives, and nouns) be regulated as an agreement feature within the category N before the case-marked argument looks for the verb via type raising.",
        "Kracht observes that, in case stacking, there may be other morphemes between two case morphemes.",
        "Thus, treating the two cases as composite affixes for the purpose of type raising is not feasible.",
        "If the first case type-raises the noun to say, T/(T\\NP), the second case would require a category, (T/(T\\NP))\\(T/(T\\NP)); that is, it is endotypic.",
        "Hence, an endotypic category for case (like other inflections in the paradigm) subsumes the type-raising analysis of case provided that type raising is available in the grammar, not necessarily anchored to case.",
        "We analyze case as an endotypic functor of type N\\N (24e)hence allow for phrase-internal agreement for languages that require it and provide type raising in grammar as in (27).",
        "Abandoning the type-raising analysis of case does not necessitate taking liberties in the directionality of the categories, such as the use of nondirectional slash (|) in multiset-CCG (Hoffman 1995).",
        "Contraposition and type raising in grammar",
        "The wide scope of case markers on subordinate clauses implies that the subordinate markers themselves must have phrasal scope as well.",
        "Since case is a nominal inflection, the category of a subordinate marker must be a function onto N. Its argument is IV for infinitives and NPagr\\IV for others, which require genitive subjects (34).",
        "This yields two families of functors for subordination.",
        "The verb-final characteristics of the embedded clauses is ensured by the backward-looking main functor of the subordinate marker.",
        "For morphosyntactic modality, the resulting nominalized predicate can receive only case, hence it has < N control.",
        "Verbal nouns refer to actions, and nominalizations refer to facts.",
        "Subordinate markers for the former are tenseless.",
        "A subordinate marker replaces the tense of the subordinate verb in nominalizations, yielding < S"
      ]
    },
    {
      "heading": "6.4 Relativization",
      "text": [
        "There are two strategies for forming relative clauses: the subject participle strategy (SP) and the nonsubject participle strategy (OP).",
        "SP is realized by the affixes -(y)An, -(y)AcAk, and -mIs, and OP by -dIk- and -(y)AcAk-.",
        "OP triggers agreement similar to that of possessive constructions between the subject and the predicate of the relative clause (39b).",
        "(39) a. kitab-oku-yan adam book-ACC read-SP man the man that read/reads the book b. adam-noku-du^g-ukitap man-GEN(AGR) read-OP-POSS(AGR) book the book that the man read 6.4.1 Lexical Types.",
        "The categories in (40) make explicit the unbounded nature of relativization; type raising and composition can combine an indefinitely large sequence of constituents onto S\\NP.",
        "(40) -SP:=o yan ^ (N?/ < N)\\( < S\\ < NPnom) : AP.",
        "Ax.",
        "AQ.a nd (Q[x]) (P[x] )",
        "We present a formulation of relativization without any use of empty categories, traces, or movement.",
        "We follow the Montagovian treatment of relative clauses as noun restrictors of the semantic type AP.",
        "AQ.",
        "a nd (Q[x]) (P [x] ), where P is the semantics of the relative clause and Q is the semantics of the predicate taking the relativized noun (x) as the argument.",
        "Montagovian analysis assumes a generalized quantifier (GQ) category for the determiner; that is, NP is the functor and VP is the argument.",
        "The determiner takes the relativized noun (and its semantically type-raised category) as an argument as well.",
        "In a language with determiners, the functor category of the overall NP can be made explicit by lexically value-raising the determiner with GQ semantics from, for example, NP/N to (S/(S\\NP))/N = (S/VP)/N.",
        "To achieve the same effect in a language that lacks determiners, we make NP the functor by lexically value-raising the relative participle from (N/N)\\(S\\NP) to (N?/N)\\(S\\NP), in which N?",
        "/N denotes a value-raised noun, since N?",
        "is a type-raised category.",
        "The category of the relative participle unfolds to ((S/(S\\NP))/N)\\(S\\NP) and (((S\\NP)/(S\\NP\\NP))/N)\\(S\\NP).",
        "Relativization is strictly head final in Turkish.",
        "This implies that all relative participles are backward-looking functors that differ only in case requirements (cf. English relatives, which require different directionality, e.g., (N\\N)/ (S\\NP) for subjects and (N\\N)/(S/NP) for nonsubjects).",
        "For morphosyntactic modality, the head noun has",
        "S: and (sleep (poss child man)) (anger man) The man whose child slept got angry.",
        "As these examples indicate, -SP and OP do not range over the verb stem in semantic scope; they cover the entire relative clause.",
        "The wide scope of -SP and OP resolves the inconsistency pointed out in the introduction (5bc), which was mainly due to coindexation in unification accounts and the lexemic nature of the lexicon.",
        "Isolating the relative participle inflections in a morphological component undermines the transparency of derivations.",
        "Note also that OP is categorially transparent to the arity of the verb; a DV must be reduced to an IV before OP applies to the verb complex (42c).",
        "This is possible only when OP has phrasal scope."
      ]
    },
    {
      "heading": "BozsahinThe Combinatory Morphemic Lexicon 6.5 Ki-relativization",
      "text": [
        "Ki-relativization is a morphosyntactic process that can generate indefinitely long words of relative pronouns and relative adjectives.",
        "-ki can be attached to case-marked nouns whose case relation is one of possession, time, or place (i.e., the genitive and the locative).",
        "Its effect is to create a nominal stem on which all inflections can start again (43ab).",
        "It produces relative pronouns (43c) and relative adjectives (43d) with the locative and relative pronouns with the genitive.",
        "(43) a. araba-da-ki car-LOC-REL the one in the car b. cocu^g-un ev-i-nde-ki-ler-in-ki child-GEN house-POSS-LOC2-REL-PLU-GEN-REL lit.",
        "The one that belongs to the ones that are in the childs house c. Benev-de-ki-nihickullan-ma-d-m I.NOM house-LOC-REL-ACC2 never use-NEG-TENSE-PERS.1s I never used the one at home.",
        "d. ev-de-kihediye house-LOC-REL present the presenti, the onei at home 6.5.1 Lexical Types.",
        "(44) a.",
        "-PROki:= ^a ki^ D l N\\cD Nloc:^x.^f.and(atPROx)(f[PRO]) (locative) b.",
        "-ADJki:= ^a ki ^ (D l N/ <nN)\\ D c Nloc: ^x.^y.^f.and(atxy)(f [y]) c. -PROki:= ^a ki^ D l N\\Nl :^x.^f.and(possPROx)(f[PRO]) gen (genitive) d. sabahki:= ^s sabahki ^ D l N/ <n N: ^x.^f.and(at morning x)(f[x])",
        "e. ki (that):=c ki ^ (N^\\ < N)/(< S\\ < NPnom) :^P.",
        "^x.^Q.and (Q[x]) (P[x] ) N^ge n is a shorthand for the N/(N\\N) category of a type-raised genitive.",
        "In (43c), pronominal one (PRO) cannot be bound to ev (44a).",
        "Adjectival interpretation (43d) associates the relative adjective with the relativized noun (44b).",
        "For morphosyntactic modality, ki-marked nouns behave like possessive-marked nouns in case marking, which requires strict control over the possessive (oD N).",
        "This presents a dilemma: Morphologically, -ki creates a nominal stem that can undergo all nominal inflections again, but, as (45a) indicates, the stem does not take the CASE (ACC, DAT, etc.)",
        "that is common to nouns unmarked on the possessive.",
        "Thus CASE2 in (45c) must refer to another diacritic (n-relbase, or D l) to eliminate (45b).",
        "This diacritic controls the result category of -ki.",
        "The value-raised varieties of (44ac) are assigned a type similar to the type of relative participles.",
        "Inherently temporal nouns such as sabah (morning) can take -ki",
        "the childi, the onei at the little house There is another ki in Turkish that forms nonrestrictive relative clauses as post modifiers.",
        "It is a Persian borrowing and follows the Indo-European pattern of relative clause formation (47).",
        "It can be distinguished from the bound morpheme -ki lexically.",
        "Its attachment characteristic is also different than that of -ki (44e).",
        "(47) Adam ki hepuyur man that always sleep-TENSE the man, who always sleeps",
        "The possessive markers result category is a functor because it enforces agreement with the type raised specifier.18 (48de) indicate that the genitive marker is a type raiser; the possessor scopes over the possessee.",
        "For morphosyntactic modality, the genitive marker can be attached to nouns that are inflected up to and including a possessive marker (< N).",
        "Moreover, nesting in possessives implies that the specifier may be a genitive.",
        "Hence, the stems category must be < N. But there is a finer control over the possessee arguments category, because it must be inflected with the possessive marker to signify relation of possession (cf. (48ab)).",
        "Semantically, the possessive must outscope nominal modification.",
        "For instance, (50a) has the PAS as indicated, hence both markers must range over a noun group, not just 18 An inert category such as N may be motivated by the prodrop phenomenon, in which the specifier may be dropped under pragmatically conditioned circumstances.",
        "But this analysis disregards the point that binding relations (hence semantics) still require the coindexation of the specifier with some overt referent, which can be inferred from the discourse.",
        "Such an interface phenomenon seems to be better suited for handling by interactions in the components of a multidimensional grammar, rather than as a purely syntactic phenomenon.",
        "interest rate of the bank We claim that plural compounds are lexically composite functions in a similar vein.",
        "This claim has some empirical support from the lexicalization of -leri as a third person plural possessive marker; see (55bc).",
        "It follows that -leri has the lexi19 I am grateful to the anonymous reviewer who proposed this alternative.",
        "N: comp(comp rate interest) (comp card credit) credit card interest rate f.kredi kart yllk faiz oran-g.*kredi kart faiz yllk oran-annual credit card annual interest rate"
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "Theoretical and computational commitment to word-based grammarand to regard inflectional morphology as a word-internal processputs artificial limits on specifying the syntactic and semantic domains of all meaning-bearing elements and on the transparent projection of scope from the lexicon.",
        "Designating words as minimal units of the lexicon is too constraining for many languages.",
        "This traditional notion is also challenged in current linguistic theorizing (e.g., Jackendoff 1997 and Keenan and Stabler 1997).",
        "Marslen-Wilson (1999) argues on psycholinguistic grounds that the lexicon must be morphemic even for morphologically simpler languages such as English.",
        "We have argued in this article that the key to the integration of inflectional morphology and syntax is granting representational status to morphemes, which, in a computational system, requires certain precautions.",
        "What we propose is enriching the expressive power of the combinatory morphemic lexicon to factor in morphosyntactic types and attachment modalities.",
        "Coupled with flexible constituency in the grammar and directionality information coming from the lexicon, these extensions provide the grammar with the information it requires to compute the transparent semantics of morphosyntactic phenomena.",
        "This flexibility causes neither inefficiency in parsing nor uncontrolled expressivity.",
        "The extensions do not affect the polynomial worst-case complexity results, and category unity is preserved by lattice consistency.",
        "The result is a morphemic grammarlexicon with computationally desirable features such as modularity and transparency.",
        "The system is available at ftp://ftp.lcsl.metu.edu.tr/pub/ tools/msccg."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "I am very grateful to four anonymous CL reviewers for extensive commentary and suggestions.",
        "Thanks to Wolf Konig and Stefan Muller for the data; and to Jason Baldridge, Gann Bierner, Aysenur Birturk, Ruken Cakici, Nissim Francez, Stasinos Konstantopoulos, Markus Kracht, Geert-Jan Kruijff, Alan Libert, Mark Steedman, Umit Turan and Deniz Zeyrek for comments, advice, and criticism."
      ]
    }
  ]
}
