{
  "info": {
    "authors": [
      "Do-Gil Lee",
      "Sang-Zoo Lee",
      "Hae-Chang Rim",
      "Heui-Seok Lim"
    ],
    "book": "Workshop on Asian Language Resources and International Standardization",
    "id": "acl-W02-1208",
    "title": "Automatic Word Spacing Using Hidden Markov Model for Refining Korean Text Corpora",
    "url": "https://aclweb.org/anthology/W02-1208",
    "year": 2002
  },
  "references": [
    "acl-J94-2001"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper proposes a word spacing model using a hidden Markov model (HMM) for refining Korean raw text corpora.",
        "Previous statistical approaches for automatic word spacing have used models that make use of inaccurate probabilities because they do not consider the previous spacing state.",
        "We consider word spacing problem as a classification problem such as Part-of-Speech (POS) tagging and have experimented with various models considering extended context.",
        "Experimental result shows that the performance of the model becomes better as the more context considered.",
        "In case of the same number of parameters are used with other method, it is proved that our model is more effective by showing the better results."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Automatic word spacing is a process to decide correct boundaries between words in a sentence containing spacing errors.",
        "In Korean, word spacing is very important to increase the readability and to communicate the accurate meaning of a text.",
        "For example, if a sentence O} t+1 -XI 7} 10 ~~ i j 7} V L}(Father entered theTH room)\" is written as \"a}tlj Xj-!Ti- of 7} V L}(Father entered the bag)\", then its meaning is changed a lot.",
        "There are many word spacing errors in documents on the Internet, which is the principal source of information.",
        "To deal with these documents properly, an automatic word spacing system is absolutely necessary.",
        "Besides, it plays an important role as a preprocessor of a morphological analyzer that is a fundamental tool for natural language processing applications, a postprocessor to restore line boundaries from an OCR, a postprocessor for continuous-syllable sentence from a speech recognition system, and one module for an orthographic error revision system.",
        "In Korean, spacing unit is Eojeol.",
        "Each Eojeol consists of one or more words and a word consists of one or more morphemes.",
        "Figure 1 represents their relationships for a sentence 01 a}71 x11_ 01 V ut\".",
        "According to the rules of Korean spelling, the main principle for word spacing is to split every word in a sentence.",
        "Because one morpheme may form a word and several morphemes too, there are confusing cases to distinguish among words.",
        "Even though postpositions belong to words, they should be concatenated with the preceding word.",
        "Besides, there are many conflicting (but can be permitted) cases with the principles.",
        "For example, spacing or concatenating individual nouns including a compound noun are both considered as right.",
        "As mentioned, word spacing is important for some reasons, but it is difficult for even man to space words correctly by spelling rules because of the characteristics of Korean and the inconsistent rules.",
        "Especially, it is much more confused in the case of having no influence on understanding the meaning of a sentence.",
        "In this paper, we propose a word spacing model 1 using an HMM.",
        "HMM is a widely used statistical model to solve various NLP problems such as POS tagging(Charniak et al., 1993; Merialdo, 1994; Kim et al., 1998a; Lee, 1999).",
        "We regard the word spacing problem as a classification problem such as the POS tagging problem.",
        "When using an HMM for automatic word spacing task, raw texts can be used as training 'Strictly speaking, our model described here is an Eojeol spacing model rather than a word spacing model because spacing unit of Korean is Eojeol.",
        "But we in this paper do not distinguish between Eojeol and word for convenience.",
        "Therefore, we use the term \"word\" as word, spacing unit in English.",
        "data.",
        "Therefore, we expect that HMM can be applied to the task effectively without bothering to construct training data."
      ]
    },
    {
      "heading": "2 Related Works",
      "text": [
        "Previous approaches for automatic word spacing can be classified into two groups: rule based approach and statistical approach.",
        "The rule-based approach uses lexical information and heuristic rules(Choi, 1997; Kim et al., 1998b; Kang, 1998; Kang, 2000).",
        "Lexical information consists of postposition and Eomi2 information, a list of spaced word examples, etc.",
        "Heuristic rules are composed of longest match or shortest match rule, morphological rules, and error patterns.",
        "This approach has disadvantage requiring higher computational complexity than the statistical approach.",
        "It also costs too much in constructing and maintaining lexical information.",
        "Most of rule-based systems use a morphological analyzer to recognize word boundaries.",
        "Another disadvantages of rule-based approach are resulted from using morphological analyzer.",
        "First, if ambiguous analyses are possible, frequent backtracking may be caused and many errors are propagated by an erroneous analysis.",
        "Second, results of automatic word spacing are highly dependent on the morphological analyzer; false word boundary recognition occurs if morphological analysis fails due to unknown words.",
        "In addition, if an erroneous word is successfully analyzed through overgeneration, the error cannot even be detected.",
        "Finally, if a word 2Eomi is a grammatical morpheme of Korean which is attached to verbal root spacing system is used as a preprocessor of a morphological analyzer, the same morphological analyzing process should be repeated twice.",
        "The statistical approach uses syllable statistics extracted from large amount of corpora to decide whether two adjacent syllables should be spaced or not(Shim, 1996; Shin and Park, 1997; Chung and Lee, 1999; Jeon and Park, 2000; Kang and Woo, 2001).",
        "In contrast to the rule-based approach, it does not require many costs to construct and to maintain statistics because they can be acquired automatically.",
        "It is more robust against unknown words than rule-based approach that uses a morphological analyzer.",
        "A statistical method proposed in Kang and Woo (2001) has shown the best performance so far.",
        "In this method, word spacing probability P(xi, xi+l), between two adjacent syllables xi and xi+1i is in Equation 1.",
        "If the probability is greater than 0.375, a space is inserted between xi and xi+1.",
        "In Equation 1, PR, PM, and PL denote the probability of a space being inserted in the right, middle, and left of the two syllables, respectively.",
        "They are calculated as follows:",
        "In the above equations, f req(x) denotes a frequency of a string x from training data, and SPACE denotes a white space.",
        "Similar to this method, other statistical systems usually use the word spacing probability estimated from every syllable bigram3 in the corpora.",
        "They calculate the probability by combining PR, PM, and PL and compare it with a certain threshold.",
        "If the probability is higher than the threshold, then a space is inserted between two syllables.",
        "It is reported that the performance is so sensitive to training data: it shows somewhat different performance according to similarity between input document and training data.",
        "And there is a crucial problem in the statistical method resulted from not considering the previous spacing state.",
        "For example, consider a sentence \" o -'TTzl T O L}\" of which correctly word spaced sentence is \" o T ,~1 L}\".",
        "According to Equation 1, the word spacing probability of \"-'F\" and \"O \" will be calculated as follows:",
        "But a space should have been inserted between \" zl\" and \"T\" in the correct sentence, we should use f req(SPACE, T, SPACE) instead of f req( -13=1-T, SPACE) in order to get the correct word spacing probability.",
        "This phenomenon comes from not considering the previous spacing state.",
        "To alleviate this problem, we can consider the previous spacing state that the system has decided before.",
        "But errors can be propagated from the previous false word spacing result.",
        "Eventually, to avoid such propagated errors, the system has to generate all possible interpretations from a given sentence and choose the best one.",
        "To choose the best state from all possible states, we use an HMM in this paper.",
        "3syllable bigram is defined to be any combination of two syllables with or without a space."
      ]
    },
    {
      "heading": "3 Word Spacing Model based on",
      "text": [
        "Hidden Markov Model POS tagging is the most representative area for HMM.",
        "Before explaining our word spacing model using HMM, let's consider the POS tagging model using an HMM.",
        "POS tagging function F(W) is to find the most likely sequence of POS tags T = (t1, t2, ... , tn) for a given sentence of words W = (W1i W2.... , Wn) and is defined in Equation 2:",
        "The probability P(T, W) is broken down into the following equations by using the chain rule:",
        "Markov assumptions (conditional independence) used in Equation 8 are that the probability of a current tag ti conditionally depends on only the previous K tags and that the probability of a current word wi conditionally depends on only the current tag.",
        "In Equation 8, P(ti I ti-K,i-1) is called transition probability and P(wi I ti) is called lexical probability.",
        "Models are classified in terms of K. The larger K is, the more context can be considered.",
        "Because of the data sparseness problem, bigram model (K is 1) and trigram model (K is 2) are used in general.",
        "The word spacing problem can be considered",
        "similar to POS tagging.",
        "We define a word spacing task as a task to find the most likely sequence of word spacing tags T = (t1,t2,...,tn) for a given sentence of syllables",
        "Word spacing tag is a tag to indicate whether the current syllable and the next one should be spaced or not.",
        "Tag, 1 means that a space should be put after the current syllable.",
        "Tag, 0 means that the current and the next syllable should not be spaced.",
        "For example, if we attach the word spacing tags to a sentence `0 -'V_ ~~ ~~~~~~(I can study)\", then it is tagged as \" o /0+_1-T1_/0+781__1/1+ --'T'- /1+ ~/O+ Ut/0+./111 .",
        "Our proposed word spacing model is to find the tag sequence T for maximizing the probability",
        "There are two Markov assumptions in Equation 13.",
        "One is that the probability of a current tag ti conditionally depends on only the previous K (word spacing) tags and the previous J syllables.",
        "The other is that the probability of a current syllable si conditionally depends on only the previous L tags, the current tag ti, and the previous I tags.",
        "This model is denoted by A(T(K.J), S(L.1)).",
        "Similar to the POS tagging model, P(ti ti-K,i-1, si-J,i_1) is called transition probability, and P(si ti_L,i, si_I,i_1) is called syllable probability in Equation 13.",
        "On the other hand, our word spacing model uses less strict Markov assumptions to consider a larger context.",
        "The larger the values of K, J, L, and I are, the more context can be considered.",
        "In order to avoid the data sparseness and excessively increasing parameters of a model, it is important to select proper values.",
        "In our current work, they are restricted as follows: 0<K,J,L,I<2 Thus, 3 x 3 x 3 x 3= 81 models are possible.",
        "But we do not use the case of (K, J) _ (0, 0) in the trasition probabilities.",
        "As a result, we actually use 72 models.",
        "It has not yet been known that which model is the best.",
        "We can verify this only by means of experiments.",
        "Some possible models and their equations are listed in Table 1.",
        "Probabilities can be estimated simply by the maximum likelihood estimator (MLE) from raw texts.",
        "The syllable probabilities and the transition probabilities of the model A(T(1:2), S(1:2)) are estimated as follows:",
        "To avoid zero probability, we just set very low value such as 0.00001 if an estimated probability",
        "I\" is a pseudo syllable which denotes the start of a sentence, and its tag is always 1.4 The",
        "most probable sequence of word spacing tags is efficiently computed by using the Viterbi algorithm."
      ]
    },
    {
      "heading": "4 Experimental Results",
      "text": [
        "We used balanced 21st Century Sejong Project's raw corpus of 26 million word size.",
        "As the balanced corpus is used as training data, we expect that the performance would not be sensitive too much to a certain document genre.",
        "The ETRI POS tagged corpus of 288,269 word size was used for evaluation.",
        "We modified the corpus with no word boundary form for automatic word spacing evaluation.",
        "We used three kinds of evaluation measures: syllable-unit accuracy (Pyl), word-unit recall (Rword), and word-unit precision (Porrd) The word-unit recall is the rate of the number of correctly spaced words compared to the number of total words in a test document.",
        "The word-unit precision measures how accurate the system's results are.",
        "The reason why we do not divide the syllable-unit accuracy as recall and precision is that the number of syllables in a document and that of the system created are the same.",
        "Each measure is defined as follows:",
        "Where, Scorrect is the number of correctly spaced syllables, Stotal is the total number of syllables in a document, Wcorrect is the number of correctly spaced words, WDtotal is the total number of words in a document, and WStotal is the total number of words created by a system.",
        "To investigate every model, we calculated the two accuracies for different K, J, L, and I. Accuracies for each model are listed in Table 2.",
        "According to the experimental results, we are sure that models considering more contexts show better results.",
        "The model A(T(2:2), S(1:2)) is the best for all measures.",
        "Note that some models show the better accuracies than the model A(T(2:2), S(2:2)), which uses the largest context.",
        "It seems that this is caused by sparseness of data.",
        "After evaluating the method of Kang and Woo (2001) for our training and test data, it shows 93.06% syllable-unit accuracy, 76.71% word-unit recall, and 67.80% word-unit precision.",
        "Compared with these results, our model shows much better performance.",
        "If I is two in A(S(K:J),T(L:l)), syllable trigrams are used.",
        "Although I is less than two (such as the model A(T(2:1), S(1:1), which uses syllable bigrams), our model is better than Kang and Woo (2001)'s.",
        "This fact tells us that our model is also more effective even when used the same number of parameters of the model.",
        "There are two questions that we want to know about the word spacing models: First, how much training data is required to get the best performance of a given model.",
        "Second, which model best fits a given training corpus.",
        "To answer these questions, we compare the performance of various models according to the size of training corpus in Figure 2.",
        "The left plot shows the syllable-unit precision and the right plot shows the word-unit precision.",
        "In the figure, \"HMM\" denotes the proposed model, and its number decides the model's type.",
        "\"Kang\" denotes Kang and Woo (2001)'s model.",
        "\"HMM2110\" uses syllable unigrams, \"HMM2111\" and \"Kang\" use syllable bigrams, and \"HMM2212\" uses syllable trigrams.",
        "The models used here are the models that show the best accuracies among the models that use same",
        "syllable ngrams.",
        "We can observe the changes of the accuracies according to the size of the training data.",
        "\"HMM2110\" using syllable unigrams converges quickly on small training data.",
        "\"HMM2111\" and \"Kang\" using syllable bigrams converge on much more training data.",
        "Note that \"HMM2212\" does not converge in these plots.",
        "Therefore, there is a possibility of improvement of this model's performance on more large training data.",
        "\"HMM2212\" shows lower performance than other models on small training data.",
        "The reason is that the data sparseness problem occurs."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "Recently, text resources available from the Internet have been rapidly increased.",
        "However, there are many word spacing errors in those resources, which cannot be used before correcting errors.",
        "Therefore, the need for automatic word spacing system to refine text corpora has been raised.",
        "In this paper, we have proposed an automatic word spacing model using an HMM.",
        "Our method is a statistical approach and does not require complex processes and costs in constructing and maintaining lexical information as in the rule-based approach.",
        "The proposed model can effectively solve the word spacing problem by using only syllable statistics automatically extracted from raw corpora.",
        "According to the experimental results, our model shows higher performance than the previous method even when using the same number of parameters.",
        "We used just MLE to estimate probability, but the more a model extends the context; the more the data sparseness problem may arise.",
        "In future work, we plan to adopt a smoothing technique to increase the performance.",
        "Further research on an effective evaluation method for conflicting cases is also necessary."
      ]
    }
  ]
}
