{
  "info": {
    "authors": [
      "Dragos Stefan Munteanu",
      "Daniel Marcu"
    ],
    "book": "Conference on Empirical Methods in Natural Language Processing",
    "id": "acl-W02-1037",
    "title": "Processing Comparable Corpora With Bilingual Suffix Trees",
    "url": "https://aclweb.org/anthology/W02-1037",
    "year": 2002
  },
  "references": [
    "acl-J93-2003",
    "acl-P95-1050",
    "acl-P98-1069",
    "acl-P99-1067",
    "acl-W99-0905"
  ],
  "sections": [
    {
      "text": [
        "words 50.000 sentences for each language.",
        "We obtained it by taking two non-parallel, nonaligned segments from the Hansard corpus.",
        "We also used GIZA' to automatically build a small bilingual lexicon of 6.900 entries using 5.000 sentences pairs (150.000 words for each language) .",
        "The parallel corpus was taken from the Proceedings of the European Parliament (EuroParl).",
        "Note that the parallel corpus belongs to a different domain than the comparable corpus.",
        "Also, the parallel corpus is extremely small.",
        "For low-density languages, such a corpus can be built manually.",
        "When given as input the comparable corpus described above and the bilingual lexicon of 6.900 entries, the algorithm described in Section 3 found 33.926 parallel sequences, with lengths between 3 and 7 words (we do not report here aligned sequences of less than 3 words).",
        "Out of 100 randomly selected sequences, 95% were judged to be correct.",
        "Some examples of the discovered alignments are shown in Figure 8.",
        "The system also found translations for 30 unknown French words.",
        "Of these, 9 are correct, which means a precision of 30%.",
        "Figure 9 shows some proposed translations and the context alignments on which they are based.",
        "For each of the two corpora, building the monolingual GST took only 1.5 minutes.",
        "The matching operation that yields the BST is the most time-consuming-it lasted 38 hours for the forward BST and 60 hours for the reverse BST.",
        "The extractions of all parallel phrases and of the translations took about 2 hours each.",
        "We ran the experiments on a Linux system with a Pentium 3 processor of 866Mhz."
      ]
    },
    {
      "heading": "6 Discussion and Future Work",
      "text": []
    },
    {
      "heading": "GST and BST construction",
      "text": [
        "The most important limitation of our method is that it can find and exploit only word alignments that are monotonic.",
        "This makes the system applicable primarily on language pairs which have similar word order, such as English-French and English-Chinese.",
        "A second, less severe limitation concerns the scalability of the algorithms .",
        "The GST and BST derivation algorithms that we implemented to date are not the most efficient.",
        "For example, Kurtz (1999) shows how to reduce space requirements of suffix trees.",
        "And Farach (1997) and Andersson et al.",
        "(1999) present construction algorithms which, for trees defined over large alphabets such as words, are more efficient than Ukkonen's algorithm (which we used in our implementation).",
        "The matching operation can be parallelized with linear speedup, since matching of a pair of branches is independent of the matching of any other pair.",
        "We plan to incorporate these improvements in future versions of our system.",
        "Learning new translations The translation precision that we obtained is lower than that reported in previous approaches.",
        "However, we attempted to solve a much harder problem: our algorithm does not take as input the list of unknown words, but learns automatically from the corpus both the unknown words and their translations.",
        "Therefore our results depend both on the degree of parallelism of the two corpora, and on their size.",
        "We expect that as we scale the algorithm to process corpora of billions of words, our precision will improve.",
        "As mentioned in section 4, our algorithm for learning new translations yields many context alignments, most of them corresponding to incorrect translations.",
        "Filtering out these incorrect translations is an important part of the algorithm.",
        "Our current filtering method, which is based on the length and content of the context alignment, is rather simple.",
        "The co-occurence methods used in the previous approaches could be of help here, by providing additional sources of evidence about the translations defined by our context alignments.",
        "Bootstrapping It is clear that our algorithm can bootstrap itself using the learned word translations.",
        "The additional word alignments could allow us to find more and longer parallel sequences, and thus better context alignments out of which will come yet more new translations.",
        "At the time of submission we have not yet implemented this bootstrapping procedure.",
        "In general, we find BSTs to be an extremely useful data structure that we believe will be of great use to other natural language researchers interested in aligning sequences defined over different alphabets."
      ]
    }
  ]
}
