{
  "info": {
    "authors": [
      "Christian Boitet",
      "Mathieu Mangeot-Lerebours",
      "Gilles Serasset"
    ],
    "book": "Workshop on NLP and XML NLPXML",
    "id": "acl-W02-1705",
    "title": "The PAPILLON Project: Cooperatively Building a Multilingual Lexical Data-Base to Derive Open Source Dictionaries and Lexicons",
    "url": "https://aclweb.org/anthology/W02-1705",
    "year": 2002
  },
  "references": [
    "acl-C94-1044"
  ],
  "sections": [
    {
      "text": [
        "The PAPILLON project: cooperatively building a multilingual lexical database to derive open source dictionaries & lexicons Christian BOITET(1), Mathieu MANGEOT(2) & Gilles SERASSET(1) (1) GTA, CLIPS, IMAG (2) National Institut of Informatics (NII) 385, av.",
        "d la bibliothqu, BP 53 2-1-2-1314, Hitotsubashi F-38041 Grnobl cdx 9, France Chiyoda-ku Tokyo 101-8430, Japan Christian.Boitt@imag.fr Mathiu.Mangot@imag.fr Abstract Th PAPILLON projct aims at crating a cooprativ, fr, prmannt, wb-orintd and prsonalizabl nvironmnt for the dvlopmnt and th consultation of a multilingual lxical databas.",
        "Th initial motivation is th lack of dictionaris, both for humans and machins, btwn Frnch and many Asian languags.",
        "In particular, although thr ar larg F-J papr usage dictionaris, thy ar usabl only by Japans litrats, as thy nvr contain both original (kanji/kana) and romaji writing.",
        "This applis as wll to Thai, Vitnams, Lao, tc.",
        "Introduction Th projct was initiatd in 2000 and launchd with th support of th Frnch mbassy and NII (Tokyo) in July 2000, and took rally shap in 2001, with a tchnical sminar in July 2001 at Grnobl, and concrt work (data gathring, tool building, tc.).",
        "Th macrostructur of Papillon is a st of monolingual dictionaris (on for ach languag) of word snss, calld \"lxis\", linkd through a cntral st of intrlingual links, calld \"axis\".",
        "This pivot macrostructur has bn dfind by Srasst (1994) and xprimntd by Blanc (1994) in th PARAX mockup.",
        "Th microstructur of th monolingual dictionaris is th \"DiCo\" structur, which is a simplification of Ml'tchuk's (1981;1987;1995) DC (xplanatory and Combinatory Dictionary) dsignd by Polgur (2000) & Ml'tchuk to mak it possibl to construct larg, dtaild and principld dictionaris in tractabl tim.",
        "1.",
        "Languages included in the project",
        "In 2000, th initial languags of th Papillon projct wr nglish, Frnch, Japans and Thai.",
        "Thai was includd bcaus thr had bn a succssful projct, SAIKAM (Ampornaramvth et al.",
        "1998; 2000), supportd by NII and NCTC, of building a Japans-Thai lxicon by voluntrs on th wb.",
        "Lao, Vitnams, and Malay hav bn addd in 2001 bcaus of active intrst of labs and individuals.",
        "Th star-lik macrostructur of Papillon maks it asy to add a nw languag.",
        "Also, th DiCo microstructur of ach monolingual dictionary is dfind by an XML schma, containing a large common cor and a small spcialization part (morphosyntactic catgoris, languag usag)."
      ]
    },
    {
      "heading": "2. Interlingual links",
      "text": [
        "Axis, also calld \"intrlingual accptions\", are not concpts, but simply intrlingual links btwn lxis, motivatd by translations found in xisting dictionaris or proposd by the contributors.",
        "In cas of discrpancis, 1 axi may b linkd with lxis of som languags only, .g.",
        "FR(mur# 1), N(wall# 1), RU(stna# 1), and t o othr axis by rfinmnt links:",
        "It is also possible to have 2 axies for the same \"concept\" at a certain stage in the life of the database, because the monolingual information is not yet detailed enough.",
        "Suppose the level of language (usual, specialized, vulgar, familiar...) is not yet given for FR(maladie#1), FR(affection#2), EN(disease#1), EN(affection#3).",
        "When this information will be put in each of the above 4 monolingual entries, we may merge the 2 axies and get:",
        "Axies may also be linked to \"external\" systems of semantic description.",
        "Each axie contains a (possibly empty) list for each such system, and the list of systems is open.",
        "The following are included at this stage; UNL UWs (universal words), ONTOS concepts, WordNet synsets, NTT semantic categories."
      ]
    },
    {
      "heading": "3. Building the content",
      "text": []
    },
    {
      "heading": "3.1. Recuperating existing resources",
      "text": [
        "Building the content of the data base has several aspects.",
        "To initiate it, the project starts from open source computerized data, called \"raw dictionaries\", which may be monolingual (4,000 French DiCo entries from UdM, 10,000 Thai entries from Kasetsart Univ.",
        "), bilingual (70,000 Japanese-English entries and 10,000 Japanese-French entries in J.Breen's JDICT XML format, 8000 Japanese-Thai entries in SAIKAM XML format, 120,000 English-Japanese entries in KDD-KATE LISP format), or multilingual (50,000 French-English-Malay entries in FEM XML format)."
      ]
    },
    {
      "heading": "3.2. Integrating the data into Papillon",
      "text": [
        "In the second phase, the \"raw dictionaries\" are transformed into a \"lexical soup\" in M.Mangeot's (2001) intermediary DML format (an XML schema and namespace).",
        "The transformation into almost empty DiCo entries and the creation of axies for the translational equivalences is semi-automatic.",
        "A tool has been programmed at NII for that task."
      ]
    },
    {
      "heading": "3.3. Enriching the data with contributions",
      "text": [
        "After that, it is hoped that many contributors will \"fill in\" the missing information.",
        "The basis for that third and continuous phase is a server for cooperative building of the data base, where each contributor has his/her own space, so that contributions can be validated and integrated into the DB by a group experts.",
        "Users can establish user groups with specific read and write access rights on their spaces.",
        "4.",
        "Consultation of the resulting data 4.1.",
        "Online consultation",
        "Consultation is meant to be free for anybody, and open source.",
        "Requests produce personalizable views of the data base, the most classical of which are fragments of bilingual dictionaries.",
        "However, it is also possible to produce multitarget entries, on the fly and offline.",
        "Users (consumers) are encouraged to become contributors.",
        "To contribute, one may propose a new word sense, a definition, an example of use, a translation, the translation of an example, a correction, etc., or an annotation on any accessible information: Every user can contribute with his own knowledge level.",
        "4.2.",
        "Download of entire files Users can also retrieve files, and can contribute to define new output formats.",
        "The files retrieved can contain structural, content-oriented tags.",
        "This open source orientation contrasts with the current usage of allowing users to retrieve files containing only presentation-oriented tags."
      ]
    },
    {
      "heading": "4.3. Coverage of the dictionary",
      "text": [
        "An interesting point is that the project wants to cover both general terms and terminological terms.",
        "Another one is that it contains a translation subproject, because definitions, examples, citations, etc.",
        "have to be translated into all languages of the collection.",
        "For this, the notion of complex lexie, already present to account for lexical collocations such as compound predicates (e.g. \"to kick the bucket\"), is extended to cover full sentences.",
        "Axies relating them are special because they can't in general relate them to external semantic systems such as WordNet.",
        "An exception is UNL: the UNL list for an axie may contain one UNL graph, produced automatically, manually, or semi-automatically.",
        "This graph may be automatically sent to available UNL \"deconverters\" to get draft translations.",
        "In th currnt stag, th projct has no lgal implmntation as a fundation, association, company, tc., although many participants have alrady stablishd official MOUs and othr typs of agrmnts on which to bas thir cooprativ work.",
        "Thr is a string committ of about 10-12 mmbrs, who rprsnt Papillon whr thy ar, and not th convrs.",
        "Thr is a st of tasks, and for ach task a working group and an advisory committ.",
        "On of th tasks is the managmnt of th projct.",
        "In btwn, thr is a coordinating group containing th hads of the tasks and chaird by th had of the managmnt task.",
        "Sponsors may not donat mony to th projct, which has no bank account.",
        "Rathr, thy are encouragd to donat data, to assign prsonal part tim to th projct, and to fund participating organizations and prsons as thy s fit.",
        "Conclusion Th thortical framworks forth whole databas, th macrostructur and the microstructur ar vry wll dfind.",
        "It constituts a solid basis forth implmntation.",
        "A lot of opn problms still hav to b addrssd forth Papillon projct to b a succss.",
        "In this rspct, th Papillon projct appars to b a vry intrsting xprimntation platform for a lot of NLP rsarch as data acquisition or human accss to lxical data, among othrs.",
        "All ths rsarch will improv th attraction of such a projct to th Intrnt usrs.",
        "This attraction is ncssary forth projct to go on, as it is highly dpndnt on its usrs motivations.",
        "This way, w will b abl to provid a vry intrsting multilingual lxical databas that we hop usful for a lot of prsons."
      ]
    },
    {
      "heading": "Rerefences",
      "text": []
    }
  ]
}
