{
  "info": {
    "authors": [
      "Fumiaki Sugaya",
      "Keiji Yasuda",
      "Toshiyuki Takezawa",
      "Seiichi Yamamoto"
    ],
    "book": "Workshop on Speech-To-Speech Translation: Algorithms and Systems",
    "id": "acl-W02-0715",
    "title": "Quality-Sensitive Test Set Selection for a Speech Translation System",
    "url": "https://aclweb.org/anthology/W02-0715",
    "year": 2002
  },
  "references": [],
  "sections": [
    {
      "text": [
        "by-one.",
        "The actual plotted broken line is averaged over 10 random trials.",
        "Figure 9 shows the relationship between iteration and the system’s TOEIC score.",
        "In this figure, the horizontal axis represents the iteration, and the vertical axis TOEIC score.",
        "The broken line and the solid line are plotted using the same denotation as that in Figure 8.",
        "In Figure 8, the solid line always lies on a lower position than the broken line.",
        "In Figure 9, from iteration 1 to around iteration 200, the broken line does not deviate from the actual system’s TOEIC score, which is 548.",
        "Considering these results, the test set optimized for TDMT is shown to be applicable for evaluating ATR-MATRIX."
      ]
    },
    {
      "heading": "5 Discussion",
      "text": [
        "In this section, we discuss the experimental results shown in Section 4.",
        "Looking at the broken lines in Figure 6 and Figure 8, test set reduction using random selection always causes an increase of t opt i.e., an increase in the scale of confidence interval.",
        "Therefore, this method causes the reliability of the evaluation result to deteriorate.",
        "Meanwhile, in the case of using the proposed method, looking at the solid lines on these figures, t opt is on the decline until around iteration 200.",
        "This means that we can achieve a more reliable evaluation result with a lower evaluation cost than when using the original test set.",
        "Here, looking at the solid lines in Figure 7 and Figure 9, the Co opt system’s TOEIC score is nearly stable until iteration 200, and it does not deviate from Co. As mentioned before, Co for Figure 7 is 708 and Co for Figure 9 is 548.",
        "Considering these results, the proposed method can reduce the 330-utterance test set to a 130- utterance test set while reducing the scale of confidence interval.",
        "In other words, the proposed method both reduces evaluation costs by 60% and improves reliability of the evaluation result.",
        "Looking at Equations (4) and (5), the scale of confidence interval is also influenced by n. When we allow the scale of confidence interval obtained from the original test set, we can use the proposed method’s reduction effect of t to compensate the 6 t 's increase by reducing n. In this case, the actual achievable cost reduction will be more than 60%."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "We proposed a test set selection method for evaluating a speech translation system.",
        "This method optimizes and drastically reduces the test set required by the translation paired comparison method.",
        "Translation paired comparison is an effective method for measuring a system’s performance as a TOEIC score.",
        "However, this method has excessive evaluation costs.",
        "Therefore, cost reduction for this evaluation method is an important subject for study.",
        "We applied the proposed method in an evaluation of ATR-MATRIX.",
        "Experimental results showed the effectiveness of the proposed method.",
        "This method reduced evaluation costs by more than 60% and also improved the reliability of the evaluation result."
      ]
    },
    {
      "heading": "Acknowledgement",
      "text": [
        "The research reported here was supported in part by a contract with the Telecommunications Advancement Organization of Japan entitled, \"A study of speech dialogue translation technology based on a large corpus.\""
      ]
    }
  ]
}
