{
  "info": {
    "authors": [
      "Utpal Sharma",
      "Jugal K. Kalita",
      "Rajib Das"
    ],
    "book": "Workshop on Morphological and Phonological Learning",
    "id": "acl-W02-0601",
    "title": "Unsupervised Learning of Morphology for Building Lexicon for a Highly Inflectional Language",
    "url": "https://aclweb.org/anthology/W02-0601",
    "year": 2002
  },
  "references": [
    "acl-J01-2001",
    "acl-P99-1034"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Words play a crucial role in aspects of natural language understanding such as syntactic and semantic processing.",
        "Usually, a natural language understanding system either already knows the words that appear in the text, or is able to automatically learn relevant information about a word upon encountering it.",
        "Usually, a capable system human or machine, knows a subset of the entire vocabulary of a language and morphological rules to determine attributes of words not seen before.",
        "Developing a knowledge base of legal words and morphological rules is an important task in computational linguistics.",
        "In this paper, we describe initial experiments following an approach based on unsupervised learning of morphology from a text corpus, especially developed for this purpose.",
        "It is a method for conveniently creating a dictionary and a morphology rule base, and is, especially suitable for highly inflectional languages like Assamese.",
        "Assamese is a major Indian language of the Indic branch of the Indo-European family of languages.",
        "It is used by around 15 million people."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "A child learns his or her native language by carefully analyzing sentences that he or she hears.",
        "He or she neither consults a dictionary nor gets any clear instructions on grammar or vocabulary.",
        "That he or she can relate the sentences to real world events and entities, is often very useful for this learning process.",
        "In the case of a computer program, the lack of such correlation must be compensated.",
        "The method that we describe here attempts to build a lexicon and learn morphological rules of a language by studying texts of the language and without any direct manual specification of the language.",
        "A motivation for the particular approach taken in this paper for morphological analysis is that in Assamese formation of derivatives from the root or base forms of words is ubiquitous, it being very inflectional.",
        "We believe that for further computational processing of Assamese text, it will be very useful to analyze words to identify the root form and the exact nature of derivation used in each case.",
        "To handle such a task, unsupervised learning of morphology is useful.",
        "Our algorithm uses techniques distinct from those described in [14].",
        "It must be noted that there is no known published computational linguistic work on Assamese at all.",
        "Ours is the first and only attempt to work computationally with Assamese, an important and a national language of India, but utterly neglected.",
        "Thus, the nature of the work reported here is pioneering.",
        "2 ✁✂✂✆✞✠✂✠ ☞ord d✠ri✎✆tion ✒roadly there are two kinds of derivations.",
        "✓irst, multiple root words can be combined to form c✕✗",
        "This often occurs with some change in spellings of the root words, e.g., ❈✦✤ ✯ ✦❋✬❍★ ✹ ❈✦✤✷❋✬❍★ ✽-IWT❘❆.",
        "❚ompound formation in the languages of the Indic branch is of two types namely, using ✢a✚✜hi and ✢a✗a✢ ✽[10], [11]❆.",
        "In this work, we do not target analysis of compounds.",
        "The second kind of derivation is by the use of affixe✢ ✽prefixes and suffixes❆.",
        "Affixation is sometimes differentiated into two types, namely i✚❛ec❜i✕✚al and ✜eri❝a❜i✕✚al",
        "Our system, however, treats them alike.",
        "❷an-guages of the Indic branch inherit many affixes from ❹anskrit, as well as have many affixes specific to each language.",
        "To begin with, we lay emphasis on processing suffixes since suffixes are more common in Assamese and embody significant linguistic information.",
        "❼ost common among the Assamese suffixes are inflectional suffixes called ❾i❾ha➀❜is ✽[4], [➂], [➃]❆ and are distinct from ❾i❾ha➀❜is of other Indic languages.",
        "In Indic languages, particularly in Assamese, in a large number of cases of application of suffixes, spelling changes do not occur.",
        "It is also important to note that a very common morphological phenomenon in Assamese is ✢e➆ue✚ce✢ ✕f ✢uf⑦xe✢ in a single word.",
        "✓or example, l➊r➋➀ei➌➋➀ei✚✕",
        "The frequent occurence of such sequences and the large number of suffixes in some of these sequences is a phenomenon that distinguishes Assamese from most other languages.",
        "In some cases Assamese also allows certain suffixes to be detached from the base part.",
        "i.e., write the suffix as a separate word following the root word.",
        "Assamese inherits ➞0 prefixes ✽u✙a✢ar➠as❆ from ❹anskrit ✽[4], [10], [11]❆.",
        "There are additional prefixes specific to Assamese.",
        "➡refixes in many cases change the meaning of words in such a way that the derived words may be treated as root words themselves.",
        "✓ew prefixes, viz., e⑨ ✜u⑨ ➢a, ✽these denote numbers one, two, and six of the ob➝ect❆ and ✚a ✽also its other forms - ✚e⑨ ✚➋⑨ ✚u⑨ ✚i⑨ etc., all of which denote negation❆ only qualifies the basic meaning of the root word.",
        "➤ ➥✠co✞➦o✂in➨ ☞ord✂ ✓rom the set of words in the input text, we identify cases where one word can be derived from another word by addition of some suffix ✽or prefix❆ in that set.",
        "We refer to such a case as a ➫decomposition➯, the former word a ➫derivative➯, the latter a ➫base➯ ✽or root❆, and the suffix a ➫rule➯.",
        "i.e.,",
        "We may be able to find more than one derivative for a single word from the same base by adding different rules.",
        "A base may be found to be a derivative with respect to another base.",
        "✓or example, suppose we have the words, a⑨ a❾⑨ ac⑨ a❾✜ ✽a⑨ ❾⑨ c and ✜ are strings possibly longer than a single character❆.",
        "We can represent these as the following.",
        "In the case of a❾✜, we would like to record the decomposition a❾ + ✜, since it reflects more decomposition information than the other alternative, when considered along with a❾ ✁ a + ❾.",
        "We summarize our algorithm below",
        "❞.",
        "✓or each word ✡ in ❷, identify another word ➚ in ❷ such that ✡ can be obtained by appending some ✽non-null❆ suffix ✌ to ➚.",
        "If there are multiple candidates for ➚, select the longest among them and record the decomposition",
        "If no ➚ can be identified for a ✡, ✡ is ➫unde-composed➯ .",
        "4.",
        "✓rom the decompositions identified above, ✑ for each base ➚ count the number of decompositions where it is a base.",
        "❚all it the base count of ➚, ➚✒✔.",
        "✑ for each suffix ✽rule❆, ✌, count the number of decompositions where it is a suffix.",
        "❚all it the rule frequency of ✌✘ ✤ ✚✜.",
        "➂.",
        "Discard the decompositions in which the rule has a ❝ery l✕✣ value ✥ of ✤ ✚✜.",
        "✥ can be ad-➝usted experimentally.",
        "We have used ✥ ✹ 1 in our experiments.",
        "Also, discard the decompositions in which the base has a ❝ery hi➠h value of ➚✒✔.",
        "✄✝❐➬e ★ ✪.",
        "✓or each word that could not be decomposed in phase 1 ✽some of which may have come out as base in some decomposition❆, try each of the rules identified in that phase.",
        "That is, see if a rule ✽suffix❆ is the ending part of an undecomposed word.",
        "✫ecord such decompositions, and the base forms.",
        "✄✝❐➬e ✭ ➃.",
        "✓or each word ✡ in ❷, identify the set of suffixes ✽rules❆ that appear with it and call it the charac❜eri✢❜ic of that word, ✰✲.",
        "Words are classified using their characteristics.",
        "Ex❐mple✴ [✵umbered according to the steps outlined above.]",
        "✵ote that in our experiment the input corpus uses ✫oman orthography.",
        "The mapping between the Assamese letters and the ✫oman letters is chosen so as to facilitate lossless translation between the two representations.",
        "The following example uses this orthography ✽though it reduces readability to an unaccustomed reader❆.",
        "➞.",
        "❹uppose the list of distinct words is,",
        "5.",
        "Discard the decompositions involving the suffixes k, and lm (since they have frequency",
        "a = 1).",
        "The base count of asm becomes 2, and k becomes 1.",
        "6.",
        "Decompositions",
        "In the first phase, we extract rules by using base forms that are known, i.e., words that are present in the list of words.",
        "After this analysis, there may be words which could not be decomposed.",
        "It is possible that some of these words are actually root words and cannot be decomposed.",
        "But there may be words that could not be decomposed because no base form exists in the list of words provided.",
        "So in the second phase, we consider the \"undecomposed\" words and see if any \"rule\" identified so far can be applied to decompose such a word, i.e., if ab is word that could not be decomposed so far, is there a rule b so that we can decompose ab as a + b?",
        "In fact multiple rules might be applicable for a single word.",
        "In such a case, in a language where suffix sequences are a common phenomenon, we should give preference to rules that are longer and can be obtained as a suffix sequence (See Section 8).",
        "Otherwise suffixes with higher frequencies may be given preference.",
        "With more base forms known following the second phase, we can repeat the first phase analysis, then the second phase analysis, and theoretically, so on.",
        "In the example given above, if we were to iterate the steps after the first pass, due to the word bhArt in the list now, we can decompose the hitherto undecomposed word bhArtk as bhArt + k and bhArte as bhArt + e. This gives us the new suffix e. Assuming e does not get discarded, we can decompose the word mAnuhe as mAnuh + e, obtaining the new word mAnuh.",
        "This process may be stopped when in a particular pass we do not detect any new rule or base.",
        "Phase 3 can then be undertaken to determine the nature of the words based on the suffixes that each takes.",
        "Reaching such a stage, however, does not imply that all possible decompositions have been detected.",
        "Since our method works by comparing related words, the presence or absence of certain words makes significant difference.",
        "For instance, if the input list of words in the example given above did not contain the word bhArtr, the base bhArt would not be obtained, and consequently the suffix e would not be obtained from bhArte, and further mAnuhe would not be decomposed.",
        "In general, providing a large number of words for analysis will cause more rules to be detected in phase 1, and with the larger number of rules so obtained, more base forms can be detected through phase 2.",
        "In practice, it is typical to expect texts in chunks in successive analysis runs.",
        "So, during implementation of the algorithm, we refine it so that while a new chunk of text is processed, the words in that text are analyzed along with the words existing in the lexicon.",
        "The focus is put on the new words and their effects.",
        "An analysis based simply on detection of presence of common substrings may fail to detect decompositions where the spelling of the derived word is not simply a concatenation of the base word and the suffix but a modification of that.",
        "The proportion of such words in a corpus may vary across languages, and so will the effectiveness of the above algorithm.",
        "In a language such as Assamese (as also in other Indic languages), it is seen that the modification of spelling is generally related to the actual pronunciation of the words and the suffixes.",
        "More specifically, the sounds of the ending part of the base word and the beginning of the suffix combine to form a sound which is represented in the result by another string of letters than the combination of the original letters.",
        "That is, a word ab may combine with a rule xy to form acy instead of abxy.",
        "We feel that some amount of phonological knowledge, either acquired by a learning method, or provided directly, may be used to detect and handle such cases.",
        "4 Information schema We accumulate the information extracted by the analysis process in two primary data structures a lexicon, and a rule base.",
        "In the lexicon we keep an entry for each word that has been encountered so far in various runs.",
        "Each entry contains the",
        "• the word, w • the base, b (`-' if the word is not decomposed) • the number of times it is encountered in text, wf\".",
        "• the number of times it participates as base in decompositions, be,, • other attributes",
        "Similarly, the rule base contains entries each of which comprises",
        "• the rule, s (i.e., suffix, or prefix) • the number of times it participates in different decompositions, r fs.",
        "• other attributes 5 Effect of additional text",
        "An effort to build a lexicon and enumerate morphological rules of a natural language, is unlikely to be complete in a single run of the algorithm.",
        "It is likely after processing a number of chunks of texts, no new rules are generated.",
        "However, base forms are likely to be discovered for a much longer time, and quite possibly, for ever, with new texts.",
        "But then, this is the truth about vocabulary!",
        "This expectation is borne out by the actual observations in our experiment with 111 chunks of texts depicted in Figure 1 and Figure 2.",
        "In Figure 1 we have considered the proportion of distinct unseen words (not base forms, however) to the total words in each text chunk, and in Figure 2 it is the proportion of distinct unseen rules to the total distinct rules in each text chunk."
      ]
    },
    {
      "heading": "6 Experimental results",
      "text": [
        "In Table 1 we present the quantitative summary of observations in an experiment with a corpus of 111 news articles containing over 49,000 words in all.",
        "These results cover only Phase I of the algorithm described.",
        "With Phase 1 processing only, about 77.2✟% of the words are decomposed of which 65.4% are correct decompositions.",
        "Of the undecomposed words, about 71% are actually root words that should not be decomposed.",
        "Of the around 29% words that should have been decomposed but were not, about 3% are compounds and we are not keen on decomposing anyway.",
        "In other words we missed about 26% (29 - 3) of possible decompositions.",
        "On applying two simple criteria to eliminate incorrect decompositions (point 5 in the algorithm), viz., decompositions that have root frequencies 20 or higher (because bases occuring with too many suffixes are very short words, usually one or two letters, and match the leading portion of longer words not related to them), and decompositions that have suffix frequencies only a = 1, about 64% of the decompositions were retained.",
        "Of these about 90.39% were correct decompositions.",
        "In the 36% decompositions that were discarded, less than 21% were correct decompositions.",
        "It should also be noted that of the 90% correct decompositions, 12.5% are incomplete in that there were more than",
        "two morphemes in the words some of which could not be separated.",
        "Intuitively the value of a should be low due to the \"conservative\" way of identifying suffixes in phase 1.",
        "In the experiment we have chosen a = 1 since while higher values only marginally improved the precision, the recall was worse; for a = 2 : precision = 91.76%, recall = 67.16% and for a = 3 : precision = 92.✟3%, recall = 65.11%.",
        "The recall is likely to improve for larger corpus.",
        "The choice of upper limit for the root frequency is, on the other hand, less rigid.",
        "We kept it 19.",
        "For a value 18, precision = 90.53%, recall = 70.3✟%; for a value 20, precision = 90.09%, recall = 70.60%; and for a value 21, precision = ✟9.97%, recall = 70.60%."
      ]
    },
    {
      "heading": "6.1 Results from Linguistica",
      "text": [
        "Upon running Linguistica ([14]) over the same corpus of 11450 distinct words, the output reported the analysis of only 6040 of the distinct input words, i.e., 52.75%.",
        "In these 6040 analysis the precision of decompositions is 92.05% (including about 24% correct but incomplete decompositions), and the recall is 40.62%.",
        "If we consider the fraction of the actual base words left rightly undecomposed together with the fraction of the derived words correctly decomposed, then this extended precision is 61.54%.",
        "In the results of our program, when no filtering is done then the extended precision is 67.5%, and when decompositions with suffix frequency 1 or base frequency above 19 are discarded, then the extended precision is 77.45%.",
        "7 Quality of decompositions Among the linguistically correct decompositions, our process leaves some decompositions incomplete, and also produces some \"false\" decompositions.",
        "An incomplete decomposition means detecting only some of the multiple suffixes occurring in sequence in a word.",
        "To reduce such cases the valid suffix sequences in the language can be identified and this knowledge can be used to (See Section ✟), say, break up suffixes identified by the basic algorithm into valid suffix parts.",
        "The false decompositions, in general, may happen due to cases such as",
        "• both a and ab are valid words but b is not a true \"rule\" in the language.",
        "We refer to this case as \"false rule\".",
        "An even more difficult case is that b is a true rule in the language, but not in the case of ab, i.e, ab is actually not derived from a.",
        "We refer to this case as \"false decomposition\".",
        "In the example presented earlier, the rule lm obtained from the decomposition klm = k + lm is a false rule.",
        "The decomposition kr = k + r is a false decomposition.",
        "• ab is a word and b is a known rule, but a is not the \"base\" of ab.",
        "We shall refer to this case as \"false base\".",
        "Here, the difficult case occurs when a is a valid word, but it has nothing to do with the word ab.",
        "This too is a case of \"false decomposition\".",
        "In the example presented earlier, the base brd obtained from the decomposition brdlE = brd + lE is a false base.",
        "In short, we have the problem of unconfirmed decompositions (i.e., whether the base forms, rules and decompositions are correct).",
        "To tackle this problem of unconfirmed decompositions we compute the probabilities that various entities, i.e., (base form, rule and decomposition) tuples are correct.",
        "For this, we assign a numeric \"confirmation\" value to each entity.",
        "A higher confirmation value of an entity indicates that it is more likely to be correct, and it is updated as the system processes more and more input.",
        "Qualitatively, we may apply the following heuristics to obtain the confirmation values of the entities:",
        "• The rules and decompositions discovered in phase 1 have a high confirmation value, since the base forms assumed in that phase are actually present in the text.",
        "• In phase 2 (where we discover base forms",
        "and decompositions) the confirmation value is low.",
        "Among such base forms and decompositions, the confirmation value is higher for rules (suffixes) which are long, say at least two consonants.",
        "Also, base forms identified in phase 2 have higher confirmation values if it participates in more such decompositions.",
        "• The confirmation value of a decomposition depends on the confirmation value of the base forms and the rules that are involved."
      ]
    },
    {
      "heading": "8 Identifying suffix sequences",
      "text": [
        "A language such as Assamese allows certain suffixes to occur together in sequence in words.",
        "For example, suffixes x, y and z may occur with a word w as wxzy.",
        "These suffixes may or may not appear in other arrangements.",
        "Identification of such sequences may help extract more linguistic information about the words.",
        "To classify words using the suffix characteristics, identification of valid suffix sequences can help in obtaining a kind of canonicalization of the suffix characteristic of a word.",
        "For example, if it is known that the suffix xzy is actually a sequence x, z, y, due to the words w and wxzy being in a corpus we associate only the suffix x with w and not xzy.",
        "The following simple algorithm can be used to identify valid suffix sequences in the language using the decompositions performed on the words in the input corpus",
        "1.",
        "Start from beginning of the lexicon sorted in reverse alphabetical order.",
        "Let a string variable s f x_seq contain a suffix sequence, and n_s f x contain the number of suffix components in s f x_seq.",
        "Initially s f x_seq con",
        "tains the NULL string, n_s f x contains 0, and next decomposition means the first decomposition.",
        "2.",
        "For the next decomposition encountered, say",
        "3.",
        "Take the base of the decomposition, wxz, and identify the entry for it in the subsequent part of the lexicon.",
        "If the base appears as a decomposed entry, say, wxz = wx + z, then s f x_seq �-- \"z \" + s f x_seq, n_sfx �-- n_sfx + 1 repeat this step 3 for the word wx.",
        "Else (i.e., if the base appears as an undecomposed entry), then if n_s f x > 1 then record the contents of s f x_seq as a valid sequence of suffixes.",
        "In our current example suppose we find that w is an undecomposed word in the lexicon.",
        "So we obtain the suffix sequence x z y.",
        "4.",
        "Go to step 2, unless the end of the lexicon is reached.",
        "In our experiment we have identified 488 sequences of suffixes.",
        "9 Word classification using affix",
        "knowledge We have carried out some experiments on classifying words based on the suffixes that have been encountered.",
        "These classes should resemble the various known linguistic categories of words.",
        "A brief account of our experiment is given below.",
        "Recall that we have called the set of suffixes for a word its characteristic.",
        "We consider suffixes that occur with a frequency of 10 or more.",
        "There were 81 such suffixes."
      ]
    },
    {
      "heading": "1. Direct classification based on characteristics:",
      "text": [
        "Form classes of words by exact matching of respective characteristics.",
        "This leads to too many classes of words, because in a corpus many words are likely to occur only with a subset of the set of linguistically valid suffixes for it.",
        "Our analysis forms the characteristic for a word on the basis of the suffixes that have been found with the word in that corpus.",
        "So if different words of the same linguistic category have different subsets of suffixes in the corpus, they are classified into different categories."
      ]
    },
    {
      "heading": "2. Identifying subsets of characteristics: One",
      "text": [
        "attempt to overcome the drawback of the above method is to assume that at least some words from each true linguistic category will occur with all or almost all valid suffixes for that category.",
        "This implies that the characteristics of all words which are actually of the same linguistic category will be subset of the characteristic of the word which has occurred with all possible suffixes.",
        "For example, w occurs with all possible suffixes for its linguistic category, and p and q with two different subsets of the suffixes with w. Then the characteristics of p and q will be subsets of the characteristic of w. Thus we classify w, p and q into the same class.",
        "Also note that after a characteristic (e.g., of p) has been found to be a subset of another (e.g., of w), other characteristics are not tested for being its (i.e., characteristic of p) subset.",
        "It turns out that words that occur with very few suffixes falls in more than one class.",
        "This is because in Assamese there are some suffixes that occur with words of multiple linguistic categories.",
        "3.",
        "Classification based on Closures of characteristics: The drawback of the idea of subsets described above is that for a linguistic category hardly any word occurs with all valid suffixes for that class.",
        "To overcome this we modified the idea to synthesize the master characteristic of each linguistic category by taking union of its tentative subsets that have occurred.",
        "We have called this synthesized master characteristic, a closure.",
        "To compute a closure we decide on a positive number k which we call the degree of closure.",
        "We start by selecting the largest of all characteristics, and assume that it is the closure.",
        "Then sequentially for each remaining characteristic, c, we determine if c has at least k elements common with the closure or c has less than k elements which are all common with the closure.",
        "If so, we update the closure by taking its union with c. If during one pass of such testing of characteristics the closure actually gets updated, we have to perform another pass considering the characteristics that failed the test in the previous pass(es).",
        "This continues till the closure is not updated in a particular pass.",
        "Then we proceed to generate another closure by starting with the largest characteristic from among the ones not included in the previous closures.",
        "Higher degree of closure leads to more categories to be identified.",
        "In our experiment, closure degree of 3 has resulted in 5 categories of words."
      ]
    },
    {
      "heading": "4. Classification based on mutual exclusion of",
      "text": [
        "suffixes: Another observation in this regard is that while there are certain suffixes that apply to words of multiple linguistic category, there are other suffixes which are specific to certain such categories.",
        "So we have tried another idea.",
        "In this, for each suffix s, we find out the set of suffixes which have occurred together with s by scanning through all the characteristics.",
        "This implies that for the remaining suffixes there is no evidence that they occur in the linguistic category where s applies.",
        "That is, they are excluded by s. Hence we partition the set of characteristics into two: one with characteristics which contain any suffix excluded by s, and another with the remaining characteristics.",
        "However, our experiment using this approach has so far produced too many categories of words.",
        "Though these categories do not very much map to the known linguistic categories, still it leads us to consider, what we might call hierarchical classification of words.",
        "Classification of words based on characteristics is likely to work better for linguistic categories that take more suffixes.",
        "Some of the problems faced in such classification is due to certain words being actually of multiple linguistic categories (word sense ambiguity).",
        "In Assamese this is comparatively rare, though not altogether absent.",
        "For example, kar in one sense means \"tax\" (a noun) and in another it means \"do\" (verb imperative)."
      ]
    },
    {
      "heading": "10 Conclusion",
      "text": [
        "We have presented results of ongoing unsupervised morphology learning experiments in Assamese, an Indic language.",
        "There are no published computational linguistic work in Assamese.",
        "There is no available corpus, and we had to build one for our experiments.",
        "There is not even one electronic dictionary in Assamese.",
        "Our work is preliminary, but with sufficient potential for the future."
      ]
    }
  ]
}
