{
  "info": {
    "authors": [
      "Huihsin Tseng",
      "Keh-Jiann Chen"
    ],
    "book": "SIGHAN Workshop on Chinese Language Processing",
    "id": "acl-W02-1811",
    "title": "Design of Chinese Morphological Analyzer",
    "url": "https://aclweb.org/anthology/W02-1811",
    "year": 2002
  },
  "references": [
    "acl-W02-0603"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This is a pilot study which aims at the design of a Chinese morphological analyzer which is in state to predict the syntactic and semantic properties of nominal, verbal and adjectival compounds.",
        "Morphological structures of compound words contain the essential information of knowing their syntactic and semantic characteristics.",
        "In particular, morphological analysis is a primary step for predicting the syntactic and semantic categories of out-of-vocabulary (unknown) words.",
        "The designed Chinese morphological analyzer contains three major functions, 1) to segment a word into a sequence of morphemes, 2) to tag the part-of-speech of those morphemes, and 3) to identify the morpho-syntactic relation between morphemes.",
        "We propose a method of using associative strength among morphemes, morpho-syntactic patterns, and syntactic categories to solve the ambiguities of segmentation and part-of-speech.",
        "In our evaluation report, it is found that the accuracy of our analyzer is 81%.",
        "5% errors are caused by the segmentation and 14% errors are due to part-of-speech.",
        "Once the internal information of a compound is known, it would be beneficial for the further researches of the prediction of a word meaning and its function."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "This is the first attempt to design a morphological analyzer to automatically analyze the morphological structures of Chinese compound words1.",
        "Morphological structures of compound words contain the essential information of knowing their syntactic and semantic characteristics.",
        "In particular, morphological analysis is a primary step for predicting the syntactic and semantic categories of out-of-vocabulary (unknown) words.",
        "The existence of unknown words is a major obstacle in Chinese natural language processing.",
        "Due to the 1 Compound words here include compounds in traditional Chinese linguistics and morphological complex words.",
        "As a result, we cannot collect all the unknown words and manually mark their syntactic categories and meanings.",
        "Our hypothesis to predict the category and the meaning of a word is basically based on Frege’s principle: “The meaning of the whole is a function of the meanings of the parts”.",
        "The meanings of morphemes are supposed to make up the meanings of the words.",
        "However, some words like idioms and proper nouns cannot be included in the principle.",
        "In general, unknown words could be divided into two different types: the type that has the property of semantic transparency, i.e. the words whose meanings can be derived from their morphemes and the type without meaning transparency, such as proper nouns.",
        "In this paper we are dealing with the compound words with semantic transparency only.",
        "For the type of compounds without semantic transparency, such as proper nouns, their morphemes and morphological structures do not provide useful information for predicting their syntactic and semantic categories.",
        "Therefore they are processed differently and independently.",
        "In addition, some regular types of compounds, such as numbers, dates, and determinant-measure compounds, are easily analyzed by matching their morphological structures with their regular expression grammars and the result can be used to predict their syntactic and semantic properties, so they will be handled by matching regular expressions at the stage of word segmentation.",
        "According to our observation, most Chinese compounds have semantic transparency except proper nouns, which means the meaning of an unknown word can be interpreted by their own morpheme components.",
        "The design of our morphological analyzer will focus on processing these compounds, but words without semantic transparency are excluded.",
        "It takes a compound word as input and produces the morphological structure of the word.",
        "The major functions are 1) to segment a word into a sequence of morphemes, 2) to tag the part-of-speech of those morphemes, and 3) to identify the morpho-syntactic relation between morphemes.",
        "Once the morpho-syntactic structure of a compound is known, the head morpheme provides the major clue for determining its syntactic and semantic category.",
        "It seems that a Chinese morphological analyzer is similar to a tagging program.",
        "Indeed both systems have to resolve the segmentation and tagging ambiguities.",
        "However the major difference is that the morphological analyzer does not have contextual information of each target word.",
        "In other words, morphological structures of compounds are context independent.",
        "We cannot apply the same methods, such as n-gram language models, to resolve the ambiguities.",
        "We proposed a method of using the associative strength among morphemes, morpho-syntactic patterns, and syntactic categories to solve the ambiguities.",
        "Detail algorithms for morpheme segmentation, part-of-speech, and morpho-syntactic relation assignment are discussed in Section 2.",
        "In the final section, we will evaluate the morphological analyzer by comparing its results with those obtained from the analyses of 5 linguists and discussing the categorization of errors found."
      ]
    },
    {
      "heading": "2. The Morphological Analyzer",
      "text": [
        "The morphological analyzer contains three functions: to segment a word, to tag the part-of-speech (POS) of morphemes, and to identify the relation between them."
      ]
    },
    {
      "heading": "2.1 Segmentation",
      "text": [
        "The goal of this process is to segment a compound word into a sequence of morphemes.",
        "Since there are ambiguous segmentations, simple dictionary lookup methods may not work well.",
        "For instance, the compound of meiguoren ( prefixes, 2 infixes and 648 suffixes.",
        "Some affixes of the table are multisyllabic.",
        "To segment an affix with higher priority will resolve most of the errors caused by the left-to-right longest matching algorithm.",
        "For instance, if tiaoshangqu ( Second, in order to resolve the problem of morpheme ambiguity, we need a list of probabilities which contains all the possible combinations of categorical rules and their probabilities.",
        "For instance, in the list the probability P(Na+Na|Na) = 0.4692 means that the categorical rule of combining two common nouns (Na+Na) to form a common noun (Na) has the probability 0.4692.",
        "The probability values of each categorical rule were estimated from the set of 11,322 unknown words extracted from Sinica Corpus 3.0.",
        "The syntactic category of each extracted word is known but its structure annotation is unknown.",
        "Therefore the probability of each categorical rule is roughly estimated by assuming that every ambiguous categorical combination of a word have equal probability.",
        "The process of computing the possibility of a combination is as follows: 1) We assign morphemes in a word with all their possible categories found in the dictionary and the affix table; for example, sheyingzhan ([[]] finds the probability of its categorical combination in the category low, the morphological analyzer might reject the category and suggest the unknown word prediction system to choose the next highest-scoring category in which the categorical combination has higher probability.",
        "In the case that the syntactic category of the compound word is known, we will let P(Caticompound) = 1 and the most probable part-of-speech combination will simply be the categorical rule Ruled such that P(RuleilCat) is maximized."
      ]
    },
    {
      "heading": "2.2.3 Morpho-syntactic relation between morphemes",
      "text": [
        "Once the information of segmentation and part-of-speech is ready, the morpho-syntactic relation between morphemes can be identified.",
        "According to Chao (1968) and Li&Thompson (1981), there are relations between morphemes in compounds such as \"modifier-hear\", \"predicate object\" and so on.",
        "The purpose of knowing morpho-syntactic relation between morphemes is to help decide the meaning of the target word.",
        "The morpho-syntactic relation between morphemes is grouped into the types listed in Table 5.",
        "Generally, the relation between morphemes is highly related to the category of an unknown word.",
        "So the relation we assign to morphemes must be based on the category of the word.",
        "When the unknown word is a noun, the relation between its morphemes is \"modifier-head\".",
        "If it's a verb, it will be more complicated.",
        "There are five relation types in verbs.",
        "The first one is \"verb-object\", such as chifan ( linguistic specialists have to manually verify the morphological structure of unknown words by filling out the survey.",
        "First, we randomly select 100 words as a testing set and the following three questions are answered by these five specialists.",
        "1) What's the category of the unknown word?",
        "2) What are the morpheme segmentations of the testing words?",
        "3) What is the syntactic tag of each morpheme?",
        "The definition of our \"standard answer\" is the answer the majority of the subjects give.",
        "For example, if three out of the five subjects consider the category of an unknown word X as VG, the standard answer of X would be VG If five subjects think unknown word X belongs to five different categories, we would ask one more language specialist for opinions to determine the category of this unknown word.",
        "The standard answer we obtained from this survey will be the standard answer of the morphological analyzer.",
        "The morphological analyzer contains three functions: to segment a word into morphemes, to tag pos, and to identify the relation between morphemes.",
        "The accuracy we mention here is the result from comparing the morphological result with the majority answer.",
        "Tithe total number of test set R – the total number of being the same with the \"Standard answer\" of X X=Subjectl, Subject2, Subject3, Subject4, Subjects, Morphological Analyzer",
        "After comparing the result of the morphological analyzer with the standard answers obtained from the five linguists, we come to the conclusion that the accuracy of the morphological analyzer is 81%.",
        "Out of all the errors, 5% is caused by segmentation on proper nouns and loanwords, such as bilinshan ( Furthermore, the reasons causing the error of relation identification are 1) the category predication's error, 2) the part-of-speech error, and 3) the lack of the relation type.",
        "Firstly, since the relation identifier is based on the result of the segmentation and pos, it is understandable that the error here is caused by previous functions.",
        "The category of qipai-jia ([["
      ]
    }
  ]
}
