{
  "info": {
    "authors": [
      "Chu-Ren Huang",
      "I-Ju E. Tseng",
      "Dylan B. S. Tsai"
    ],
    "book": "Workshop on SEMANET: Building and Using Semantic Networks",
    "id": "acl-W02-1106",
    "title": "Translating Lexical Semantic Relations: The First Step Towards Multilingual Wordnets",
    "url": "https://aclweb.org/anthology/W02-1106",
    "year": 2002
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Establishing correspondences between wordnets of different languages is essential to both multilingual knowledge processing and for bootstrapping wordnets of low-density languages.",
        "We claim that such correspondences must be based on lexical semantic relations, rather than top ontology or word translations.",
        "In particular, we define a translation equivalence relation as a bilingual lexical semantic relation.",
        "Such relations can then be part of a logical entailment predicting whether source language semantic relations will hold in a target language or not.",
        "Our claim is tested with a study of 210 Chinese lexical lemmas and their possible semantic relations links bootstrapped from the Princeton WordNet.",
        "The results show that lexical semantic relation translations are indeed highly precise when they are logically inferable."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "A semantic network is critical to knowledge processing, including all NLP and Semantic Web applications.",
        "The construction of semantic networks, however, is notoriously difficult for ‘small’ (or ‘low-density’) languages.",
        "For these languages, the poverty of language resources, and the lack of prospect of material gains for infrastructure work conspire to create a vicious circle.",
        "This means that the construction of a semantic network for any small language must start from scratch and faces inhibitive financial and linguistic challenges.",
        "In addition, semantic networks serve as reliable ontolog(ies) for knowledge processing only if their conceptual bases are valid and logically inferable across different languages.",
        "Take wordnets (Fellbaum 1998), the de facto standard for linguistic ontology, for example.",
        "Wordnets express ontology via a network of words linked by lexical semantic relations.",
        "Since these words are by definition the lexicon of each language, the wordnet design feature ensures versatility in faithfully and comprehensively representing the semantic content of each language.",
        "Hence, on one hand, these conceptual atoms reflect linguistic idiosyncrasies; on the other hand, the lexical semantic relations (LSR’s) receive universal interpretation across different languages.",
        "For example, the definition of relations such as synonymy or hypernymy is universal.",
        "The universality of the LSR’s is the foundation that allows wordnet to serve as a potential common semantic network representation for all languages.",
        "The premise is tacit in Princeton WordNet (WN), EuroWordNet (EWN, Vossen 1998), and MultiWordNet (MWN, Pianta et al.",
        "2002).",
        "It is also spelled out explicitly in the adaptation of LSR tests for Chinese (Huang et al.",
        "2001).",
        "Given that LSR’s are semantic primitives applicable to all language wordnets, and that the solution to the low-density problem in building language wordnets must involve bootstrapping from another language, LSR’s seem to be the natural units for such bootstrapping operations.",
        "The rich and structured semantic information described in WN and EWN can be transported through accurate translation if the conceptual relations defined by LSRs remain constant in both languages.",
        "In practice, such an application would also serve the dual purpose of creating a bilingual wordnet in the process.",
        "In this paper, we will examine the validity of cross-lingual LSR inferences by bootstrapping a Chinese Wordnet with WN.",
        "In practice, this small-scale experiment shows how a wordnet for a low-density language can be built through",
        "bootstrapping from an available wordnet.",
        "In theoretical terms, we explore the logical conditions for the cross-lingual inference of LSR's."
      ]
    },
    {
      "heading": "2. Translation Equivalents and Semantic Relations",
      "text": [
        "Note that two translation equivalents (TE) in a pair of languages stand in a lexical semantic relation.",
        "The most desirable scenario is that when the two TE’s are synonymous, such as the English ‘apple’ to the Mandarin ‘ping2guo3’.",
        "However, since the conceptual space is not segmented identically for all languages, TE’s may often stand in other relations to each other.",
        "For instance, the Mandarin ‘zuo1zhi5’ is a hypernym for both the English ‘desk’ and ‘table’.",
        "Suppose we postulate that the LSR’s between TE’s are exactly identical in nature to the monolingual LSR’s described in wordnets.",
        "This means that the lexical semantic relation introduced by translation can be combined with monolingual LRS’s.",
        "Predicting LSR’s in a target language based on source language data become a simple logical operation of combining relational functions when the LSR of translation equivalency is defined.",
        "This framework is illustrated in Diagram 1.",
        "CW1 represents our starting Chinese lemma which can be linked to EW1 through the translation LSR i.",
        "The linked EW1 can than provide a set of LSR predictions based on the English WN.",
        "Assume that we take the LSR x, which is linked to EW2.",
        "That LSR prediction is mapped back to Chinese when EW2 is translated to CW2 with a translation LSR ii.",
        "In this model, the relation y, between CW1 and CW2 is a functional combination of the three LSR’s i, x, and ii.",
        "However, it is well known that language translation involves more than semantic correspondences.",
        "Social and cultural factors also play a role in (human) choices of translation equivalents.",
        "It is not the aim of this paper to predict when or how these semantically non-identical translations arise.",
        "The aim is to see how much lexical semantic information is inferable across different languages, regardless of translational idiosyncrasies.",
        "In this model, the prediction relies crucially on the semantic information provided by the source language (e.g. English) lexical entry as well as the lexical semantic correspondence of a target language (e.g. Chinese) entry.",
        "The translation relations of the relational target pairs, although capable of introducing more idiosyncrasies, are not directly involved in the prediction.",
        "Hence we make the generalization that any discrepancy introduced at this level does not affect the logical relation of LSR prediction and adopt a working model described in Diagram 2.",
        "We only take into consideration those cases where the translation LSR ii is exactly equivalent, i.e., EW2 = CW2.",
        "This step also allows us to reduce the maximal number of LSR combination in each prediction to two.",
        "Thus we are able to better predict the contribution of each mono or bilingual LSR."
      ]
    },
    {
      "heading": "2.1 LRS Inference as Relational Combination",
      "text": [
        "With the semantic contribution of the translation equivalency defined as a (bilingual) LSR, the inference of LSR in the target language wordnet is a simple combination of semantic relations.",
        "The default and ideal situation is where the two TE’s are synonymous.",
        "In this case, the translation LSR is an identical relation; the LSR of the source language wordnet can be directly inherited.",
        "This is illustrated in Diagram 3.",
        "However, when the translation has a non-identical semantic relation, such as antonyms and hypernyms, then the LSR predicted is the combination of the bilingual relation and the monolingual relation.",
        "In this paper, we will concentrate on Hypernyms and Hyponyms.",
        "The choice is made because these two LSR’s are transitive relations by definition and allows clear logical predications when combined.",
        "The same, with some qualifications, may apply to the Holonym relations.",
        "Combinations of other LSR’s may not yield clear logical entailments.",
        "The scenarios involving Hyponymy and Hypernymy will be discussed in section 3.3.",
        "3.",
        "Cross-lingual LSR Inference: A Study based on English-Chinese Correspondences",
        "In this study, we start with a WN-based English-Chinese Translation Equivalents Database (TEDB)1.",
        "Each translation equivalents pair was based on a WN synset.",
        "For quality control, we mark each TE pair for its accuracy as well as the translation semantic relation.",
        "For this study, the 200 most frequently used Chinese words plus 10 adjectives are chosen (since there is no adjective among the top 200 words in Mandarin).",
        "Among the 210 input lemmas, 179 lemmas2 find translation equivalents in the TEDB and are mapped to 497 1 The translation equivalence database was hand-crafted by the CKIP WordNet team.",
        "For each of the 99642 English synset head words, three appropriate translation equivalents were chosen whenever possible.",
        "At the time when this study was carried out, 42606 TE’s were proofed and available 2 The input lemmas for which TE’s were unable to find are demonstratives or pronouns for nouns, and aspect markers for adverbs English synsets.",
        "The occurring distribution is as follows: 84 N’s with 195 times; 41 V’s with 161 times; 10 Adj’s with 47 times; and 47 Adv’s with 94 times.",
        "441 distinct English synsets are covered under this process, since some of the TE’s are for the same synset.",
        "This means that each input Chinese lemma linked to 2.4 English synsets in average.",
        "Based on the TEDB and English WN, the 179 mapped input Chinese lemmas expanded to 597 synonyms.",
        "And extending from the 441 English synsets, there are 1056 semantically related synsets in WN, which yields 1743 Chinese words with our TEDB."
      ]
    },
    {
      "heading": "3.1. Evaluation of the Semantics of Translation",
      "text": [
        "Six evaluative tags are assigned for the TEDB.",
        "Four of them are remarks for future processing.",
        "The LSR marked are",
        "• Synonymous: TE’s that are semantically equivalent.",
        "• Other Relation: TE’s that hold other semantic relations",
        "The result of evaluation of TE’s involving the 210 chosen lemma are given in Table 1.",
        "Illustrative examples of our evaluation are given below:",
        "1a) Synonymous: _IP-g qi4ye4 (N) // enterprise: an organization created for business ventures 1b) Incorrect: y ,T biao3shi4 (V) // ‘extend’, ‘offer’: make available; provide 1c) Other Relation: fiJR shi4chang3 (N) //",
        "‘market, securities_industry’: the securities markets in the aggregate Table 2 indicates the relations between the synonyms of an input lemma and the same English synset.",
        "Recall that our TEDB gives more than one Chinese translation equivalent to one English WN entry.",
        "Hence we can hypothesize that the set of Chinese translation equivalents form a synset.",
        "It is natural, then, to examine the semantic relations between other synset members and the original WN entry.",
        "Table 1 and 2 show a rather marked difference in terms of the correctness of the synonymy relation.",
        "This will be further explained later.",
        "From the data above, we observe two generalizations: First, polysemous lemmas have lower possibility of being synonymous to the corresponding English synset.",
        "In addition, we also observe that there is a tendency for some groups, i.e., groups with polysemy and with abstract meanings, to match synonymous English synsets.",
        "These findings are helpful in our further studies when constructing CWN, as well as in the application of TEDB."
      ]
    },
    {
      "heading": "3.2 Cross-lingual LSR predictions with synonymous translations",
      "text": [
        "The next step is to take the set of English LSR’s stipulated on a WN synset and transport them to its Chinese translation equivalents.",
        "We evaluated the validity of the inferred semantic relations in Chinese.",
        "In this study, we concentrated on three better-defined (and more frequently used) semantic relations: antonyms (ANT); hypernyms (HYP); and hyponyms (HPO).",
        "Here, we limit our examination to the Chinese lemmas that are both translation equivalents of an English WN entry and are considered to have synonymous semantic relations to that entry.",
        "The nominal and verbal statistics are given in Table 3 and Table 4 respectively.",
        "From the 148 nouns where the English and Chinese translation equivalents are also synonymous, there are 357 pairs of semantic relations that are marked in English WN and are therefore candidates for inferred relations in Chinese.",
        "On average, each nominal RC translation equivalent yields 2.41 inferable semantic relations.",
        "The precision of the inferred semantic relation is tabulated below.",
        "The study here shows that when no additional relational distance is introduced by translation (i.e. the 75.9% of nominal cases when TE’s are synonyms), up to 90% precision can be achieved for bilingual LSR inference.",
        "And among the semantic relations examined, antonymous relations are the most reliable when transportabled cross-linguistically.",
        "For the 112 verbs where the English and Chinese TE’s are synonymous, there are 155 pairs of semantic relations that are marked in WN and are therefore candidates for inferred relations in Chinese.",
        "In contrast to nominal translation equivalents, each pair of verbal TE only yields 1.38 inferable semantic relations.",
        "The precision of the inferred semantic relation is tabulated in Table 6.",
        "Similar to the results of nouns, antonymous relations appear reliable in the behaviors of verbs as well.",
        "As to the other types of relations, the correct rates seem to be slightly lower than nouns.",
        "The precision for English-to-Chinese semantic relation inference is 80% for verbs.",
        "The observed discrepancy in terms of semantic relations inference between nouns and verbs deserves in-depth examination.",
        "Firstly, the precision of nominal inference is 8.52% higher than verbal inference.",
        "Secondly, the contrast may not be attributed to a specific semantic relation.",
        "Both nouns and verbs have the same precision pattern for the three semantic relations that we studied.",
        "Inference of antonymous relations is highly reliable in both categories (both 100%).",
        "Hyponymous inference is second, and about 12% higher than hypernymous inference in each category (the difference is 11.64% for nouns and 12.42% for verbs).",
        "And, last but not least, the precision gaps between nouns and verbs, when applicable, are similar for different semantic relations (9.55% for hypernyms and 8.77% for hyponyms).",
        "All the above facts support the generalization that nominal semantic relations are more reliably inferred cross-linguistically than verbal semantic relations.",
        "A plausible explanation of this generalization is the difference in mutability of nominal and verbal meanings, as reported by Ahrens (1999).",
        "Ahrens demonstrated with off-line experiments that verb meanings are more mutable than noun meanings.",
        "She also reported that verb meanings have the tendency to change under coercive contexts.",
        "We may assume that making the cross-lingual transfer is a coercive context in terms of meaning identification.",
        "Taking the mutability into account, we can predict that since verb meanings are more likely than nouns to change under given coercive conditions, the changes will affect their semantic relations.",
        "Hence the precision for semantic relations inference is lower for verbs than for nouns.",
        "In the above discussion, we observed that the three semantic relations seem to offer clear generalizations with regard to the precision of the inferences, as shown in Table 7.",
        "Two generalizations emerge from the above data and call for explanation: First, inference of antonymous relations is highly reliable; second, inference of hypernymous relations is more reliable than inference of hyponymous relations.",
        "The fact that inference of antonymous relations is highly precise may be due to either of the following facts.",
        "Since the number of antonymic relations encoded is relatively few (only 22 all together), they may all be the most prototypical case.",
        "In addition, a pair of antonyms by definition differs in only one semantic feature and has the shortest semantic distance between them.",
        "In other words, an antonym (of any word) is simply a privileged (near) synonym whose meaning offers contrast at one particular semantic dimension.",
        "Since antonymy presupposes synonymous relations, it preserves the premise of our current semantic relation inference.",
        "The fact that hyponymous relations can be more reliably inferred cross-linguistically than hypernymous relations is somewhat surprising, since they are symmetric semantic relations.",
        "That is, if A is a hypernym of B, then B is a hyponym of A. Logically, there does not seem to be any reason for the two relations to have disjoint distributions when transported to another language.",
        "However, more careful study of the conceptual nature of the semantic relations yields a plausible explanation.",
        "We should take note of the two following facts: First, a hyponym link defined on an English word Y presupposes a conceptual class denoted by Y, and stipulates that Z is a kind of Y (see Diagram 4).",
        "Y= class identity Diagram 4. class vs. member identity (HPO) Second, a hypernym link defined on Y presupposes an identity class X which is NOT explicitly denoted, and stipulates that Y is a kind of X (see Diagram 5).",
        "Hence, it is possible that there is another valid conceptual class W in the target language that Y is a member of.",
        "And yet W is not equivalent to X.",
        "Class identity is NOT entailed.",
        "Y=member identity Diagram 5. class vs. member identity (HYP) Since our inference is based on the synonymous relation of the Chinese TE to the English word Y, the conceptual foundation of the semantic relation is largely preserved, and the inference has a high precision.",
        "The failure of inference can in most cases be attributed to the fact that the intended HYP has no synonymous TE in Chinese.",
        "To infer a hyponymous relation, however, we need to presuppose the trans-lingual equivalence of the conceptual class defined by HPO.",
        "And since our inference only presupposes the synonymous relation of Y and its TE, and says nothing about HPO, the success of inference of the hyponymous relation is than dependent upon an additional semantic condition.",
        "Hence that it will have lower precision can be expected.",
        "To sum up, our preliminary evaluation found that the precision of cross-lingual inference of semantic relation can be higher than 90% if the inference does not require other conceptual/semantic relations other than the synonymy of the translation equivalents.",
        "On the other hand, an additional semantic relation, such as the equivalence of the hypernym node in both languages when inferring hyponym relations, seems to bring down the precision rate by about 10%.",
        "3.3.",
        "When Translation Introduces an additional LSR In this section, we study the cases where translation introduces a hypernymous/ hyponymous LSR.",
        "These cases offer the real test to our proposal that TE’s be treated as bilingual LSR’s.",
        "The LSR inference here refuses non-vacuous combinations of two LSR’s.",
        "For 37 Chinese input lemmas that hold other relations with English synsets, 57 semantically related links were expanded.",
        "First, we investigated the situation when the English synset occurs as a hyponym of the Chinese input lemma (Diagram 6).",
        "Diagram 6.",
        "Predicting LSR, when English is the hyponym of Chinese translation 33 inferable relations satisfied above description.",
        "Among them, 8 falls in the entailment of figure",
        "6(a).",
        "Manual evaluation confirms the prediction.",
        "The other 25 cases are not logically inferable and do indeed show a range of different relations.",
        "The logically entailed HPO relation is exemplified below:",
        "Next, when an English synset is marked as a hypernym to the Chinese input lemma, logically, hypernymous relation is transitive (Diagram 7).",
        "Diagram 7.",
        "Predicting LSR, when English is the hypernym of Chinese translation We found 2 cases (actually expanded from the same synset) under this condition.",
        "• k shi3 HYP – > [leave] cause to be in a",
        "specified state HYP – > [get, make] give certain properties to something TE – ",
        "Note that the same Chinese word Q_ shi3 is used for both the head word and its hypernym.",
        "Hence, there are two possible interpretations of the data.",
        "The first possibility is that Chinese simply has a coarser-grain sense distinction in this case and the hypernym relation is incorrect.",
        "The second possibility is that the relation is self-hypernym (Fellbaum 1999).",
        "Since a fine-grain sense distinction is beyond the scope of the current paper, we will not decide on either interpretation.",
        "In sum, our lexical semantic relation model makes correct distinctions among inferable and non-inferable LSR’s.",
        "More specifically, it has a 100% prediction for hyponymous relations.",
        "For hypernymous relations even though the logical entailment could not be verified due to sparseness of data; it did correctly predict the portion of data that was logically non-inferable.",
        "We expect future studies with a wider set of data to confirm this prediction."
      ]
    },
    {
      "heading": "4. Conclusion",
      "text": [
        "In this paper, we proposed to treat the translation equivalents relations as a set of bilingual lexical semantic relations.",
        "This proposal allows us to process bilingual inference of LSR’s as simple functional combinations of semantic relations.",
        "The process itself greatly reduces the complexity of bootstrapping wordnets from a different language.",
        "We empirically supported our proposal by successfully applying it to the inference of Chinese LSR’s from English WN.",
        "The proposed approach requires bilingual TEDB’s that are marked with translation semantic relations.",
        "Although such TEDB’s are not widely available yet, they are necessary for cross-lingual language processing such as MT and IR, as well as for any type of knowledge processing.",
        "We hope that our approach can promote the construction of LSR-marked TEDB as well as multilingual wordnets."
      ]
    },
    {
      "heading": "References:",
      "text": []
    }
  ]
}
