{
  "info": {
    "authors": [
      "Kees van Deemter"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C90-3016",
    "title": "Structured Meanings in Computational Linguistics",
    "url": "https://aclweb.org/anthology/C90-3016",
    "year": 1990
  },
  "references": [
    "acl-C82-1028"
  ],
  "sections": [
    {
      "heading": "1 Introduction",
      "text": [
        "Many natural language processing systems employ truth conditional knowledge representations (`t-representations', etc.)",
        "to represent meanings of natural language expressions.",
        "T-representations have their strong and their weak sides.",
        "A strong side is logic: a relation of logical consequence can be defined between such representations.",
        "A weak side is expressive power: the capacity of t-representations to convey the subtleties of natural language is limited.",
        "For instance, let SI, be a sentence that is true on purely logical grounds; then it is predicted that any sentence S is synonymous with \"S and SL\" .",
        "This deficiency comes out clearest in propositional attitude constructions, i.e. constructions of the form 'x V that S', where V is an epistemic verb (`knows', `believes') and S a sentence.",
        "Truth conditional accounts of meaning (including intensional ones such as [Montague 1974]) predict wrongly that anybody who knows that S is bound to also know that \"S and SL\", since the two sentences are t-indistinguishable ([Peters and Saarinen 1982]).",
        "The same lack of expressive power dooms, for example, automatic translation on the basis of t-representations to failure: t-representations contain only information that is relevant for the truth or falsity of a sentence, dismissing all other information, such as mood, topic-comment structure, etc.",
        "([van Deciliter -891).",
        "This paper investigates a remedy for the expressive poverty of t-representations, namely to let syntactic structure participate in the notion of meaning.",
        "This old and persistent idea Karnap 19470, [Lewis 1972], [Cresswell 1.985]) was recently taken up in the Rosetta automatic translation program.",
        "We will show how R.osetta's concept of meaning overcomes some weaknesses of earlier proposals and how a relation of logical consequence can be defined on top of it."
      ]
    },
    {
      "heading": "2 An Old Idea: Structured Meanings",
      "text": [
        "It has been argued that no theory of meaning that is compositional and truth conditional can deal with propositional attitudes.",
        "For, whenever two expressions with different compositional (syntactic) structures boil down – via the semantic operations connected with their respective structures – to the same meaning, a person can fail to see the equivalence: he can carry out the operations in the wrong way, or too slowly ([Cresswell 1985]).",
        "Cresswell and others have concluded that syntactic structure has to take part in meaning representations: t-indistinguishable expressions may still have different meanings, due to differences in syntactic structure.",
        "D.Lewis, for instance, used semantically interpreted phrase markers (roughly: syntax trees with logical formulas attached to the nodes) as meanings for natural language expressions ([Lewis 1972]).",
        "However, this leads to an extremely strict notion of synonymy: Perhaps we would cut thereby meanings too finely.",
        "For instance, we will be unable to agree with someone who says that a double negation has the same meaning as the corresponding affirmative.",
        "( [Lewis 1972] Also, no relation of logical consequence has seen the light for any notion of structured meaning.",
        "In the sequel we will deal with the notion of meaning inherent in the Rosetta automatic translation project (e.g. [Landsbergen 1982], [Landsbergen 1985], [Landsbergen 1987], or [de Jong and Appelo 1987]).",
        "This notion of meaning – essentially an elaboration of the one proposed by Lewis – allows a suitably weaker notion of synonymy, and can also be provided with a notion of logical consequence.",
        "Thus, some of the weak sides of older \"structured meanings\" proposals are compensated for."
      ]
    },
    {
      "heading": "3 Structured Meanings in Rosetta",
      "text": [
        "Rosetta uses a variant of Montague grammar ([Montague 19741), in which each syntax rule has a semantic counterpart.",
        "Each node in the syntactic derivation tree (D-tree) for a sentence is associated with a semantic rule.",
        "Thus, each D-tree is associated with a semantic tree (M-tree), whose nodes are semantic rules and whose leaves are non-logical constants.",
        "By applying the semantic rules to their arguments, a logical formula can be calculated for each node in the M-tree that stands for its truthcondi-tional meaning.",
        "We will call this formula the corresponding formula of the node.",
        "Now in Rosetta, a sentence meaning is not, as in [Montague 1974,j identified with the formula that corresponds to the top node of an M-tree, but with the entire tree.",
        "Thus, syntactic structure in Rosetta becomes a part of meaning in much the same way as proposed by D.Lewis (see above).",
        "For instance, the English Noun Phrase 'Italian girl' and its Spanish equivalent `muchacha Italiana' might, if we simplify, both be represented by the same M-tree:",
        "where M2 stands for the sets of Italians, M3 stands for the set of girls and Ml stands for the operation of set intersection.",
        "MI is expressed by different syntax rules in English and Spanish: Ri n\": If a is an Adjective and # is a Noun, then a# is a Nom.",
        "R`jc.\": If a is an Adjective and # is a Noun, then 13 a' is a Nom, where a' is the adjective a, adjusted to number and gender of the noun #.",
        "By mapping both of these rules onto Ml, the two NPs are designated as translations of each other.",
        "Now M-trees in Rosetta are used as vehicles for interlingual translation, but we will view them as \"general pur-pose\" representations for the meanings of natural language expressions.",
        "Viewed in this way, the following definition of synonymy (notation: ',se') between D-trees (and, derivatively, for natural language expressions) is forthcoming: Synonymy (first version): Di.",
        "D2 *def – Di = Ri (al, an) and D2 = R2(b1, b,i), where R1 and R2 map onto the same meaning rule, and where it holds for all 1 < i < n that ai bi, or – D1 and D2 are basic expressions which map onto the same basic meaning.",
        "(Definition of synonymy for M-trees, at this stage, comes down to simple equality of the trees.)",
        "This notion of meaning takes syntactic structure into account, but does not \"cut meanings too finely\", since any two linguistic constructions can be designated as synonymous.",
        "For instance, Lewis' \"double nega-tion\" problem can be countered as follows: the syntax rules of double negation (Rd„0,1„,,,,,,,) and plain affirmation (R„f fir„,) can be mapped onto one and the same meaning rule, if the grammar writer decides that they are semantically indistinguishable.",
        "Alternatively, the semantic relation between a D-tree of the form ft-negation R-negation D and its constituent tree D may be accounted for if both trees are mapped onto one and the same M-tree.",
        "Effectively, this would come down to an extension of Rosetta with \"rules of synonymy\" for entire trees, rather than for individual syntax rules."
      ]
    },
    {
      "heading": "4 Inference with M-trees",
      "text": [
        "Arguably, our grip on the notion of meaning is incomplete if only the limiting case of structural equivalence is dealt with, leaving aside the more general case of structural consequence (1\\4).",
        "Under what conditions does, for instance, one belief follow from another?",
        "Rosetta's isomorphy-based notion of meaning seems ill-equipped to deal with inference, but we claim that an extrapolation is possible.",
        "A natural boundary conditions on =m is logical validity: no rule may lead from true premises to a false conclusion.",
        "Writing/-1-=' for the relation holding between M-trees if the formulas corresponding to their top-nodes stand in the relation of logical consequence, this gives: Validity: T„ Tb only if Ta Ti,.",
        "Given validity as an upper bound, we seek reasonable lower bounds on structural inference.",
        "It is not generally valid to allow that a tree has all its subtrees as structural consequences.",
        "(For instance, the 86 2 negation of a tree T does not have the subtree T as a consequence.)",
        "However, a solution can be found if we take the dual nature of our concept of meaning into account: M-trees combine structural and logical information.",
        "Therefore, if one tree is a subtree of another tree, and also a purely logical consequence of the bigger tree, then the inference is indisputable; for the inference is logically correct and there can be no difference in syntactic structure: Subtree Principle (1st version): If (i) Ta Tb and (ii) Tb is a subtree of T„ then T,, M Tb However, we have to exclude as \"pathological\" cases all those situations in which it is not one and the same subtree Tb that takes care of the logical and the structural side: we cannot allow inferences such as the following – where S abbreviates a \"paraphrase\" of namely a sentence that is logically, but not structurally, equivalent to S (see below) – even though they fulfil both conditions of the Subtree Principle:",
        "(1) (S V --,S) S (2) (--,S Si) & (S ---+ (S1 v S2)) Hy,:f Si V S2.",
        "These inferences are not structurally valid, given the structural differences between the conclusion and the relevant part of the premise.",
        "Let an atomic sentential fragment (asj) be a sentential M-tree no proper part of which is sentential itself.",
        "To be on the safe side, we might forbid that \"paraphases\" of asf's from the conclusion occur in the premisse: Subtree Principle (2\" version): If (i) T,, p Tb and (ii) is a subtree of Ta and (iii) If T1 is an asf that occurs essentially in T,, and.",
        "T2 is an asf that occurs essentially in Tb, then T1 is not a paraphrase of T2, then Ta Tb, where a paraphrase is a logical equivalent that falls short of structural equivalence: Paraphrase (1\" version): T1 is a paraphrase of T *Def TI T2 and T2 Ti but none of the two is a subtree of the other.",
        "The resulting logic is quite uncommon unless stronger lower hounds are given.",
        "For instance, if (ii) is a necessary condition, there cannot be any tree T such that .i‘f T. Consequently, the Deduction Theorem will not hold.",
        "Also, if (iii) is a necessary condition, then Conjunction Elimination fails to hold.",
        "In fact, it holds for all Si and 82 that Spg1S2 ,i\\f 82.",
        "To remedy this defect, (iii) may be weakened to allow logically inessential occurrences of paraphrases: Inessential occurrence: An occurrence of T in the premisse (conclusion) of an inference is inessential if the inference goes through when T is replaced by an arbitrary T everywhere in the premisse (conclusion).",
        "For instance, the occurrence of Sin (1) and (2) is essential, but its occurrence in S&S S is inessential and therefore harmless.",
        "As a result of this change, a restricted version of Conjunction Elimination holds, to the effect that a conjunction will structurally imply any of its conjuncts, provided the conclusion conjunct does not contain two asf's that are paraphrases of eachother.",
        "This concludes our formalization of the \"subtree\" intuition.",
        "If we want to cover more ground, we need a more liberal concept than the structural notion of one tree being a subtree of another.",
        "First, a more subtle structural notion may be employed.",
        "For instance, an inference from Each dog barks loudly to Each black dog barks must be allowed, it seems, even though none of the two M-trees is a part of the other.",
        "Therefore, a relation of constituent-wise comparability definition follows) is called for.",
        "It is important to note that the \"direction\" of the comparison (which of the two subsumes which) is irrelevant, since the logical requirement (i) determines the direction of the inference: Subtree Principle (3\"1 version): If (i) Tb and (ii) Ta Tb and (iii) (as above), then T,, =Af Tb.",
        "If the notation Pe, stands for the symmetrical relation that holds between two trees if one of them is a subtree of the other, this is the definition of the relation Comparability: Ta P.e'e '''Def n > 0 such that T„ = < T„i,...,T„„ > and T1, < Tel e••,Tern >, where either V Tai 3 Tbj : 'raj Tb; or V Tki 3 Tsai Tbj u T„i.",
        "Here, Ta = < > means that Tu can be decomposed (at an arbitrary level of the tree) as the sequence T„1,...,T„„.",
        "Example: The M-trees for Each black dog barks and Each dog barks stand in the relations and Pe., while the M-trees for Each dog barks loudly and Each black dog barks do not stand in the relation Pe., but they do stand in the relation Pdc.",
        "They are constituent-wise comparable, so since the first logically implies (H the second, the first must also have the second as a structural consequence (HO:",
        "Each black dog barks Tb",
        "Here, Ta T1, holds, for Ta = < B1, B2, Ta2 >, and T1, = < B1, 7),12, B3 >, while B2 is a subtree of T1,12 and B3 is a subtree of Ta2.",
        "End of Example Note that, by replacing the subtree notion by the symmetrical notion r4c, we now allow a conclusion to introduce asf's that do not occur in the premisse.",
        "For instance, under appropriate assumptions, it will hold that S ins S and SL, for logically true SL.",
        "This defect can be remedied simply if we add a clause that prevents a conclusion from containing any novel asf's (see (iv), below).",
        "So far, the Subtree Principle still formalizes a strictly structural approach.",
        "But there ought to be more than that.",
        "In the ideolect of a given language user, two grammar rules, or two lexical items, may be semantically related without any strictly structural notion being involved.",
        "Within the bounds of Validity and the Subtree Principle, the grammar writer is free to designate certain pairs of syntax rules or lexical items as semantically related.",
        "Since, again, the direction of the relation is irrelevant, this refinement can easily be built in into the definition of If this is done, the relation will also hold between Each mammal barks loudly and Each black dog barks, assuming that `mammal' and 'dog' are semantically related.",
        "Note, however, that these stipulations need not be the same for all language users: different stipulations of structural relatedness may reflect differences in linguistic competence ([Partee 19821).",
        "In short, our proposal implements the hypothesis that structural relations hold for everyone, while linguistic relations allow individual variation.",
        "If all the suggested improvements on the Subtree Principle are taken into account, one might venture the following definition of structural consequence: Subtree Principle(final version): T„ Tb *Def (i) Ta Tb and (ii) T„ iTb and (iii) If T1 is an asf that occurs essentially in Ta and T2 is an asf that occurs essentially in T1„ then T1 is not a paraphrase of T2, and (iv) all asf's of Tb occur in Ta.",
        "Since the notion of a subtree has now been replaced by constituent-wise comparability, the notion of a paraphrase must be redefined: Paraphrase (final version): T1 is a paraphrase of T2 Def T1 T2 and T2 T1 but T1 0, T2.",
        "Assuming that a notion of inference has been established along these lines, synonymy between M-trees can now be defined as mutual structural consequence (synonymy of D-trees is analogous): Synonymy (final version): T1 and T2 are synonymous *Def T1 T2 and T2 T1.",
        "If the clauses in the first or the second version of the Subtree Principle are taken as collectively sufficient and necessary, the defined notion of synonymy coincides with the original Rosetta notion of \"having the same M-tree\".",
        "(In this case, Td M Tb and Tb Ta Tb.)",
        "This conveniently simple situation breaks down in later versions of the Subtree Principle, where the relation of constituent-wise comparability is used.",
        "A simple example:",
        "(a) John walks and John walks slowly, and (b) John walks slowly and John walks.",
        "The Subtree Principle (3rd or final version) implies that (Ta T1,) & (7), .1k1 Ta), and therefore, (a) and (b) are predicted to be synonymous, despite the difference between their corresponding M-trees – which would have made them nonsynonymous in Rosetta's original notion of synonymy."
      ]
    },
    {
      "heading": "5 Applications and Limitations",
      "text": [
        "In section 4, we presented one among several possible ways in which a notion of structural consequence can",
        "be defined on the basis of Rosetta's M-trees.",
        "Now we will indicate briefly how M-trees can be applied to propositional attitudes and to natural language generation outside the context of automatic translation.",
        "But, there is a caveat, discussed under the header of \"mixed inference\".",
        "Propositional Attitudes.",
        "Given that meanings are M-trees, the natural solution to the problem of \"de ditto\" propositional attitudes is to let epistemic attitudes denote a relation between an individual and an M-tree.",
        "Consequently, if a person x knows that S, while S' and S share the same M-tree, then xis predicted to also know that 5'.",
        "Since this amounts to a much stronger relation of synonymy than logical equivalence (t-equivalence), the problems noted in the introduction do not arise.",
        "The general situation is that if x knows that S and S =M S\", then it is predicted that x also knows that S\".",
        "Natural Language Generation.",
        "Even outside the domain of automatic translation, M-trees can be used for natural language generation.",
        "For example, in a natural language question-answering application, the M-tree derived from the input-question can serve as a basis for generation, after some operations on the original M-tree, in which a yes-no question is changed into an affirmative or negative answer, for instance.",
        "In most applications where there is no M-tree available, other means than M-trees can be used.",
        "For instance, when the user of a query system asks assistance from the computer's help facility, pre-stored natural language text can replace M-trees.",
        "Mixed Inference.",
        "We have seen that inference on the basis of M-trees is feasible, but how about inference on the basis of premises, some of which are purely logical while others are fully dressed M-trees?",
        "Two obvious approaches (where denotes mixed inference, and T1; is a variable over those M-trees having .1, corresponding to their top nodes) are (i) 0, T , x H (x is the corresponding formula of T's top node), (ii) i'=\", T2 'c d, VT : .1■1 Neither solution is satisfying: the first leaves T's linguistic structure unused; and the second, which quantifies over all the possible ways in which l can be expressed, is computationally intractable.",
        "The problem with mixed inference illustrates the one weak side of structured meanings: they let linguistic structure contribute to the meaning of an expression, but it is impossible to say (in model theoretic terms) what it contributes."
      ]
    },
    {
      "heading": "6 References",
      "text": [
        "[Carnap 1947] Carnap,R.",
        "Meaning and Necessity.",
        "[Cresswell 1985] Cresswell, M.J.",
        "Structured Meanings.",
        "The Semantics of Propositional Attitudes.",
        "MIT Press, Cam-bridge,Mass.",
        "[van Deemter -89] Structured Meanings Revisited, IPO Manuscript 693-11, to appear in Bunt and van flout (eds.)",
        "Language Technology.",
        "Foris, Dordrecht.",
        "[de Jong and Appelo 1987] de Jong,F.",
        "Ap-pelo,L.",
        "Synonymy and Translation, 1987 In: Proceedings of the 6th.",
        "Amsterdam Colloquium.",
        "[Landsbergen 1982] Landsbergen,J.",
        "Machine Translation Based on Logically Isomorphic Montague Grammars.",
        "Proceedings OGLING 1982.",
        "[Landsbergen 1985] Landsbergen,J.",
        "Isomorphic Grammars and their use in the ROSETTA Translation System.",
        "Philips Research M.S.",
        "12.950.",
        "In King,M.",
        "(ed.",
        "), Machine Translation: the state of the art.",
        "Edinburgh University Press.",
        "[Landsbergen 1987] Landsbergen,J.",
        "Montague Grammar and Machine Translation, in Whitelock,P.",
        "et al. (eds.)",
        "Linguistic Theory and Computer Applications, Acad.",
        "Press, London.",
        "(Lewis 1972] General Semantics, in D.Davidson and G.Harman (eds.)",
        "Semantics of Natural Language.",
        "Reidel, Dordrecht.",
        "[Montague 1974] Montague,R.",
        "The Proper Treatment of Quantification in Ordinary English.",
        "In R.H.Thoniason (ed.",
        "), Formal Philosophy.",
        "Yale University Press, New Haven and London.",
        "[Partee 1982] Partee,B.",
        "Belief Sentences and the Limits of Semantics.",
        "In Peters and Saarinen (eds.)",
        "[Peters and Saarinen 1982] Peters,S.",
        "and Saarinen,E.",
        "(eds.)",
        "Processes, Beliefs and Questions, D.Reidei, Dordrecht."
      ]
    }
  ]
}
