{
  "info": {
    "authors": [
      "John A. Bateman"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C90-2003",
    "title": "Finding Translation Equivalents: An Application of Grammatical Metaphor",
    "url": "https://aclweb.org/anthology/C90-2003",
    "year": 1990
  },
  "references": [
    "acl-E89-1038",
    "acl-H89-1022"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper I describe how a significant class of cases that would involve (possibly complex) structural transfer in machine translation can be handled avoiding transfer.",
        "This is achieved by applying a semantic organization developed for monolingual text generation that is sufficiently abstract to remain invariant, within theoretically specifiable limits, across different languages.",
        "The further application of a mechanism motivated from within monolingual text generation, 'grammatical metaphor', then allows candidate appropriate translations to be isolated.",
        "The incorporation of these essentially monolingual mechanisms within the machine translation process promises to significantly improve translational capabilities; examples of this are presented for English and German."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Historically there has rather little interaction between work in text generation and machine translation (MT) -- even though language generation needs to be an integral component of any complete MT system.",
        "Current text generation systems are, however, achieving results which can be beneficially applied in the MT context.",
        "In this paper, I describe one such area of possible interaction between mechanisms developed for monolingual text generation and the requirements of MT.",
        "In particular, the increasing concern that text generation theories show for higher levels of semantics and its realization in linguistic form makes it possible to move away from lower-level, 'structural' transfer between languages.",
        "In fact, some of the semantic specifications now being uncovered within text generation arc sufficiently abstract as to capture significant informational invariances across languages.",
        "Sophisticated monolingual generation components are able to generate appropriate linguistic structures from such abstract informational specifications.",
        "This avoids, in many cases, problems of (possibly complex) structural transfer.",
        "There is no reason a priori for the *Much of the work reported here was carried out with the financial support of the Institut fi'ir Ange Nv and t e Informations-forschung at the University of the Saarland, S;rutrbrficken; additional support was provided by AFOS rt contract F49620-87C-0005, and in part by DARPA contract MDA903-87-C-641.",
        "The opinions in this report are solely those of the author.",
        "Thanks are clue to Erich Steiner, Ji3rg Schutz, and Cecile Paris for significant contributions.",
        "linguistic structures generated by monolingual generators for distinct languages for a given abstract semantic specification to be structurally similar: therefore, translations that involve very diverse structures are readily obtainable if they are semantically motivated.",
        "Monolingual generation components of the type described are also independently motivated by language processing tasks that do not involve MT and so are in any case required.",
        "Providing for their usage within the MT context also is therefore doubly beneficial.",
        "The particular mechanism developed within text generation that I will apply to MT problems here is that of grammatical metaphor (Halliday, 1985); grammatical metaphor was originally developed within the tradition of Systemic-Functional Linguistics and is now beginning to be applied within the PENMAN text generation system (Mann and Matthiessen, 1985; The Penman Project, 1989).",
        "Systemic-functional linguistics posits sets of mappings between semantic information to be expressed and grammatical features.",
        "One class of mappings is termed 'congruent', in that it offers an unmarked realization of a semantic concept type e.g., that a processual semantic entity is realized as a verbal constituent in the grammar while a further class of mappings is `noncongruenr, in that it enables marked correspondences between semantics and grammar – e.g., in nominalizations where a processual semantic entity is realized as a nominal constituent in the grammar.",
        "Below I show how the set of linguistic structures related by grammatical metaphor form a useful equivalence class for M'I': i.e., when seeking an appropriate translation for some sentence, one will often be found in the set of target language sentences formed by generating from the corresponding abstract semantic specification invoking grammatical metaphor for variations in the structures generated.",
        "To show how this works in more detail, I first describe the level of abstract semantic information that is currently used within the PENMAN system ----- this we term the upper model and the user interface to the text generation system that it supports ----- which is called SPL.",
        "Second, I provide more concrete examples of two distinct kinds of grammatical metaphor that we can now implement computationally.",
        "And finally, I go on to show their application to MT using examples from English and German."
      ]
    },
    {
      "heading": "2 The Upper Model and SPL",
      "text": [
        "The PENMAN upper model organizes the 'propositional type' meanings that need to be expressed in text; it provides a general semantic taxonomy of classes of experiences and objects.",
        "This classification can also be seen as an inheritance hierarchy that organizes concepts according to how they may be expressed.",
        "For example, the inheritance of certain roles defines the types of participants that processes may have and the types of qualities that may be ascribed to particular objects, while class-subclass relations capture generalizations about possible grammatical and lexical realizations of concepts.",
        "Significantly, this orientation towards supporting grammatical realization renders the upper model independent of particular domains -- the semantic taxonomy offers an organization that is required for any domain if it is to support natural language generation.",
        "Rather fine distinctions are drawn by the current upper model, which contains approximately 200 concepts; details are provided in Bateman, Kasper, Moore, and Whitney (1990).",
        "The upper model supports specifications of sentence 'meaning' that may serve as input to a text generation system (Kasper, 1989a), or as output from an analysis component (Kasper, 1989b).",
        "Such specifications, which are expressed in the PENMAN Sentence Plan Language (SPL), abstract beyond many syntactic variations; they capture basic meanings – defined in terms of the upper model – that may be given a variety of linguistic realizations depending on other, specifiable, criteria.",
        "One consequence of the abstractness of this representation is that many sentences taken from distinct languages that would require complex structural transfer for translation simply share a common SPL representation, thus requiring no transfer at all.",
        "However, it is important to note that this is motivated by a commonality in linguistic function when a sufficiently abstract standpoint is taken rather than on any claims of universality; further details on the theoretical status of the shared representations are presented in Bateman (1989).",
        "We will see examples of the avoidance of structural transfer in Section 5.",
        "A simple example of an SPL specification using the upper model is shown below.",
        "This shows the SPL specification for the sentence: (1) Mary cut her finger.",
        ":actee (finger / body-part :inalienable-possession-inverse mary)) The labels cut, mary, and finger are instan-tial variables which may provide lexical information; each of these has to be assigned to a type (directed-action, person, body-part) drawn from the generalized meanings defined in the upper model.",
        "Relationships between entities are specified by means of roles (: actor, :actee, :inalienable-possession-inverse), which are also defined in the upper model.",
        "We could, therefore, gloss the meaning of this expression as a directed-action of an actor which affects one of the inalienable-possessions of that actor.' The positioning of the general types and relationships within the upper model provides much of the information that a grammar needs for constraining possible surface realizations.2"
      ]
    },
    {
      "heading": "3 Grammatical Metaphors",
      "text": [
        "A powerful property of the relationship between the upper model and the grammar is the existence of grammatical metaphor.",
        "Grammatical metaphor occurs when meanings are realized through 'nontypical' selections of grammatical features; such realizations can be described systematically and bring their own distinctive contributions to the meaning expressed (for a general typology, see Ravelli, 1985).",
        "Two types of grammatical metaphor which we are beginning to be able to control computationally are rankshifting and complexity metaphors.",
        "Figure 1 shows the first grammatical decisions that must be made when beginning generation of a grammatical unit according to a systemic-functional grammar such as that used within PENMAN.",
        "For each meaning to be expressed, grammatical decisions must first be made as to the rank of the grammatical unit that will be used i.e., clauses, groups (nominal, verbal, adverbial and prepositional), words, and morphemes – and the complexity of that grammatical unit – i.e., whether the unit is a single unit or some combination of similar units (e.g., conjunction).",
        "Traditionally, the mapping between meanings to be expressed and these grammatical choices has been rather inflexible and limited to congruent realizations; i.e., by and large, a process-type meaning (activity, state, etc.)",
        "would be realized by a selection of a simple clause, an object-type meaning by a selection of nominal, etc.",
        "Grammatical metaphor makes explicit the fact that this relationship between meaning and grammatical form is considerably more flexible and many noncongruent realizations are possible.",
        "Consider, for example, the SPL specification for example sentence (2) The discharge of electricity resulted in a breakdown of the system.",
        "((c0 / cause-effect :domain discharge :range breakdown) (discharge / directed-action :actee (electricity / substance)) (breakdown / nondirected-action :actor (system / object))) When the grammatical alternatives of the grammar are considered, rather than automatically selecting 1 Definitions of most of these upper model terms are given in Bateman, Kasper, Moore and Whitney (1990).",
        "1 have extended the actual classification given there by including inverse relations where necessary and by increasing the level of detail of description for the purposes of discussion.",
        "In addition, as with all the SPL examples given in this paper, I have made the simplification of removing specifications of all non-upper model related information since these are not relevant for the present discussion.",
        "2 The additional information necessary to produce a unique utterance is factored in SFL into three functional components: the logical, textual, and interpersonal `metafunction'.",
        "The information in the SPL is drawn from a fourth component: the experiential metafunction.",
        "Only by combining meanings from all four components are sufficient constraints provided for a unique utterance (Matthiessen, 1987:258).",
        "In Sections 3-5, we see examples of variations in the constraints of the logical metafunction, and in the Conclusion I return briefly to the textual metafunction.",
        "Interpersonal constraints have been assumed constant throughout.",
        "some 'topmost' node for immediate assignment to clause rank, the mechanism of rankshifting grammatical metaphor interposes a decision procedure which selects an input term most appropriate for realization as a clause.",
        "Similar decisions are made concerning each rank in the grammar and the complexity at each rank.",
        "This gives rise to the following possibilities for expression (focusing for the moment just on the expression of the cause-effect relationship and approximately preserving the textual organization):",
        "A further range of variation of this kind subsumes the problems of norninalization.",
        "This is equally relevant to our current example.",
        "For example, the SPL specification of the discharge situation alone could, simply by altering the rank at which it is to be realized, support the following variations: rank realization (V-N1) clause electricity was discharged (V-N2) nominal group electricity being discharged (V-N3) discharge of electricity (V-N4) electricity's discharge We can take this further: the relationship between the process and the actee of electricity can be realized within the modification systems of the nominal group at an even finer level; this gives (cf. Halliday, 1985:160): (epithet) (classifier) These are all options provided by the current PENMAN grammar.",
        "Example sentence (2) is then a combination of variation (V-C2) at clause rank and (V-N3) at nominal rank.",
        "These are all options provided by the current PENMAN grammar.",
        "Example sentence (2) is then a combination of variation (V-C2) at clause rank and further similar variations at nominal rank."
      ]
    },
    {
      "heading": "4 The Application to MT",
      "text": [
        "We can also characterize certain kinds of variation observable across languages in translation equivalents in exactly the terms provided by rankshifting and complexity grammatical metaphors.",
        "For example, a German translation equivalent to example sentence (1) would be: (3) Mary schnitt sick in den Finger.",
        "(1) and (3) present problems for transfer because the number of participants and surface sentence structures differ.",
        "This requires that the processes involved be assigned to different classes and structural transfer rules are then necessary to relate the translational possibilities.",
        "However, the state of affairs in (1) and (3) can be described in terms of the same upper model categories regardless of the particular language considered, and this permits the generation of (3) from the same SPL specification as (1).",
        "Each monolingual grammar and lexicon will already directly control the congruent assignment of terms in the SPE to ranks of the grammar, although this assignment will differ across languages just as it differs within languages when noncongruent assignments are made by the rankshifting grammatical metaphor mechanism.",
        "Thus, for (3), the first concept consumed during generation – which thereby becomes the 'head' of the highest level structure, i.e.: the process of the clause is the directed-action cutting (schneiden); the second concept is the actor relationship between the process and the person Mary ---- this is realized by a simple nominative Subject (in the absence of other textual constraints that might effect voice, diathesis, etc.",
        "); the third concept consumed is the relationship of inalienable-possession between Mary and finger – this governs the selection of beneficiary and its realization as a reflexive pronoun; the fourth is the actee relationship holding between the body-part finger and cutting – this is realized as the prepositional head of a prepositional group; and, finally, the fifth concept consumed is the concept finger itself which gives the dependent nominal within the prepositional group.",
        "This contrasts to the case for (1), where assignment of SPL terms to ranks follows.",
        "the order: cutting:clause, :actor mary:nominal, : actee finger:nominal, :inalienable-possession-inverse nary: nominal modifier.",
        "The grammar of English 'knows' that the :actee / : inalienable-possession combination can be realized as a nominal group (her finger), while the German grammar needs to 'know' that the combination requires both a nominal group (sich) and a location specification (in den Finger).",
        "This information is entirely motivated by individual language-internal considerations; both grammars and lexicons are entirely monolingual and independent of each other and of their use for translation.",
        "An SPL expression can therefore receive a variety of linguistic realizations, even across distinct languages.",
        "This extension to multilinguality does not",
        "add to the complexity of the realization mechanism, since the grammatical metaphor mechanism which supports it is already required for monolingual generation; once a monolingual grammar for any language is in place, these realizational possibilities for MT follow also.. Grammatical metaphor thus provides a mechanism by which a syntactically neutral SPL specification licenses a set of metaphorically related realizations in any language for which an appropriate grammar has been constructed.' A contextually suitable translation is then often found in the set of sentences related by grammatical metaphor that a target language supports.",
        "The kind of translational mapping this provides is shown in Figure 2.",
        "5 Further examples of the utility of the mechanism for MT"
      ]
    },
    {
      "heading": "5.1 Verb and prepositional phrase combinations",
      "text": [
        "A likely German translational equivalent for example sentence (2) above is:4 (4) Weg ender elektrischen Entladung brach das System zusammen.",
        "Again, the structures of the two sentences are quite different – a simple process in (2) seems to have been decomposed into a prepositional phrase in (4) – and this would require complex structural transfer.",
        "However, the SPL provided for sentence (2) already entails both realizations: the clause structure of (4) is identical to variation type (V-C4) of the metaphor set.5 All that needs to be altered is the lexical information pointed at by the instantial variables."
      ]
    },
    {
      "heading": "5.2 Nominalizations",
      "text": [
        "The principles of grammatical metaphor also apply across languages within nominal phrases.",
        "For example, in the translation pair of sentences (2) and (4), we can also see a difference in the structure of the corresponding nominal phrases: discharge of electricity and elekirische Entladung.",
        "In terms of the possible realization variants for this nominal phrase: the English has selected (V-N3), the German (V-N5).",
        "The same holds for the other process in the pair concerning the system breakdown.",
        "Here again, therefore, the metaphor set contains appropriate translations whose structures are rather different."
      ]
    },
    {
      "heading": "5.3 Realizations of modality",
      "text": [
        "Consider the following translation pair (Schiitz, 1989), which is again problematic in a transfer-based framework that relies on representations less abstract than that of the upper model and SPL because the structures are very different:",
        "(5) John is likely to implement the algorithm (6) John implementiert wahrscheinlich den Algorithmus (5) and (6) both share a common SPL representation: C implement",
        "As before, several differential realizations of this SPL can be generated by allowing the grammatical metaphor mechanisms to order the consumption of terms as heads at differing ranks in the grammar.",
        "For example, the orderings [D A B C], [A D B C] and [A B C D] support clause structures with the following dependency organizations respectively, showing realizations of the statement of probability at clause complex rank, verbal group rank, and circumstantial adjunct rank:",
        "John] will [4 probably] implement implement] [5 the algorithm]] [3 the algorithm]] John] implementiert [4 wahrscheinlich] [3 den Algorithmus]] What would previously have required rather complex transfer mechanisms, therefore, is here an automatic consequence of the realizational mechanisms."
      ]
    },
    {
      "heading": "5.4 Acrosstext/grammar",
      "text": [
        "the boundary As a final example of the generality of the mechanisms described here (for further examples, see Bateman, 1989), it is also possible to consider dependency relations defined above the clause complex as possible targets.",
        "The 'highest' rank assignment for the cause-effect relationship suggested so far has been that of clause complex; this is the highest rank available in the grammar.",
        "However, in current work in the PENMAN group on Rhetorical Structure Theory (RST: Mann and Thompson, 1987), there is the possibility of extending this view to consider the dependency relationships defined across sentences in texts.",
        "If the following translation pair were desirable, for example, then we see precisely this kind of variation multilingually:",
        "(7) After you had explained your views, I could see them much better.",
        "(8) Du erkliirtest deine Position.",
        "Danach verstand ich sie viel besser.",
        ".1.13251•=1.117.•■ Focusing on the temporal/causal relationship expressed between the two situations described, both sentences can receive the combined SPL and RST specification:",
        "Sentence (8) preserves the realization of the RST relation at the text level and so produces two independent sentences.",
        "The next available strategy for realization is within the grammar, at clause rank with complexing.",
        "This realization is adopted in the English variant (7).",
        "Again, therefore, the metaphor-set provides a powerful link between translationally equivalent texts, even beyond the boundaries of the grammar.",
        "Work on this will continue as our development of RST and text organization continues."
      ]
    },
    {
      "heading": "6 Conclusion: Future directions",
      "text": [
        "Following from earlier experiments in the integration of Machine Translation (MT) and text generation (Bateman, Kasper, Schutz, and Steiner, 1989), we have found that the combination of two components of the Systemic-Functional Linguistic (SFL) model of language (Halliday, 1985; Matthiessen, 1987), such as are being developed for computational use within the PENMAN text generation system, significantly reduces the need for structural transfer in machine translation (MT) without requiring deep modelling of specific domains.",
        "These two components may be described thus: e a linguistically motivated organization of general semantic distinctions that are not highly language-specific and that hold across both differing domains and differing languages – this level of organization is realized computationally within the PENMAN system as the upper model; a particular class of mapping relations between this abstract semantic organization and linguistic form – these mappings are motivated by the notion of 'grammatical metaphor'.",
        "The examples of the previous section made the point that the level of grammatical metaphorical realization is not preserved during translation, but the set of possibilities defined by grammatical metaphor provides strong candidates for high quality translation equivalents.",
        "However, since SPL forms decommit from so much of the surface syntax, it is necessary to control the range of linguistic realizations that are compatible with the constraints SPL specifications represent.",
        "The types of control that are necessary already constitute major areas of active research within the PENMAN text generation project, where the principal type of constraint under development is textual.",
        "It is reasonable to assume that textual organization, including the particular patterns of thematic development adopted by a text, is one type of meaning which needs to be preserved in translation.",
        "Metaphorically related clauses often have rather different textual organizations and so particular choices of clause may be motivated by the need to achieve particular thematic developments.",
        "A rather more global kind of textual constraint is that created by the 'style' of a text as a whole.",
        "Thus, for example, the translation process should not select as translation equivalents sentences whose stylistic import were radically divergent.",
        "This, however, can only be established on the basis of analyses of what constitutes an appropriate text style for a particular communicative situation.",
        "This is being addressed in text generation in terms of the SFL notion of register (Bateman and Paris, 1989), and its application to MT is pursued in Paris (forthcoming).",
        "The relevance of textual constraints is also not limited to the simple types of grammatical metaphor illustrated in this paper; for example, there are also `metaphors of transitivity' which change the process-type involved, e.g.:",
        "Variations such as these provide significantly different thematization options.",
        "In certain cases, therefore, in order to achieve a particular thematic development for a text in a given language, this kind of metaphor may be the only means available for achieving a syntactically thematizeable constituent.",
        "This type of grammatical metaphor can also be motivated by the need to preserve A ktionsart (cf. Vendler, 1967).",
        "In the following translation pair, for example, we need to change the transitivity type of the predicate in order to preserve the accomplishment Aktionsart.6",
        "(11) Wir erarbeiteten uns die Theorie (12) We worked ourselves into the theory",
        "Finally, the lexical entries of certain languages may also restrict the types of alternatives that are available.",
        "If one language simply does not have a lexical item for realizing a meaning at a given rank, then another rank will be pursued.",
        "Many of the mechanisms that need to be supported for these capabilities to be achieved are equally relevant in the generation of texts from single languages.",
        "We expect, therefore, that the results we are obtaining in a monolingual setting particularly those concerned with the creation of texts, rather than sentences – will generalize well to application in multilingual environments such as MT."
      ]
    }
  ]
}
