{
  "info": {
    "authors": [
      "Erik-Jan Van Der Linden",
      "Wessel Kraaij"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C90-2043",
    "title": "Ambiguity Resolution and the Retrieval of Idioms: Two Approaches",
    "url": "https://aclweb.org/anthology/C90-2043",
    "year": 1990
  },
  "references": [
    "acl-J89-1001",
    "acl-P84-1058"
  ],
  "sections": [
    {
      "text": [
        "Ambiguity resolution and the retrieval of idioms: two approaches.",
        "Erik-Jan van der LindenWessel Kraaij Institute for Language Technology and Al"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "When an idiomatic expression is encountered during natural language processing, the ambiguity between its idiomatic and non-idiomatic meaning has to be resolved.",
        "Rather than including both meanings in further processing, a conventionality-principle could be applied.",
        "This results in best-first processing of the idiomatic analysis.",
        "Two models are discussed fot the lexical representation of idioms.",
        "One extends the notion continuation class from two-level morphology, the other is a localist, conneetionist model.",
        "The connectionist model has an important advantage over the continuation class model: the conventionality principle follows naturally from the architecture of the connectionist model.",
        "Keywords: idiom processing, ambiguity resulution, two level morphology, connectionism."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In this paper we discuss the resolution of the ambiguity between the non-idiomatic and the idiomatic reading of a phrase that is possibly idiomatic.",
        "A choice between these readings can be made using various kinds of linguistic information, but we claim that it can be made on the basis of the mere fact that one of the analyses is idiomatic, and that this choice does not have to be stipulated explicitly, but follows naturally from the architecture of the lexicon and the retrieval process, if an appropriate model of the lexicon is used.",
        "In section (2), we firstly state our approach to natural language processing (NLP) in general.",
        "Next (3), we document the claim that idioms should be store'!",
        "in the lexicon as holistic lexical units, and discuss the processing of idioms (4).",
        "Then we present two models for the lexical representation and retrieval of idioms: one extends the notion continuation class of the two-level model (Koskenniemi 1983) (5); the other is a simple localist connectionist model (6).",
        "In this paper we limit ourselves to aspects relevant for our `lexical' approach.",
        "We will not discuss such issues as semantic decomposability (Gibbs and Nayak 1989) of idioms (but see van der Linden 1989, for a model of incremental syntactic/semantic processing of idioms in Categorial Grammar, and a more elaborate discussion of the issues mentioned in (3.1)).",
        "2 General approach to NLP In case of ambiguity, the NL processor has to choose between a number of possible analyses.",
        "In order to determine which one is most likely, all analyses can be examined using a breadth-first or depth-first strategy.",
        "However, this results in a time and space consuming process.",
        "Incremental best-first examination of `promising' analyses seems more appropriate, and seems to be a property of human language processing (cf. Thibadeau, Just and Carpenter 1982).",
        "However, this approach leaves us with the question what criteria should be applied to select one of the analyses for further examination.",
        "In this paper we examine one aspect of this general question, namely the choice between an idiomatic and a non-idiomatic analysis."
      ]
    },
    {
      "heading": "3 Idioms and the lexicon",
      "text": []
    },
    {
      "heading": "3.1 Linguistics",
      "text": [
        "Within the literature `Traditional wisdom dictates that an idiom is by definition a constituent or series of constituents where interpretation is not a compositional function of the interpretation of its parts.'",
        "(Gazdar et al.",
        "1985, p 327).",
        "I Rather than giving a definition of idioms that states what the meaning of an idiom isn't, we prefer a definition that states what the meaning is (van der Linden 1989).",
        "Idioms are multi-lexemic expressions, the meaning of which is a property of the whole expression.",
        "'Cf.",
        "Wood (1986): an idiom is 'wholly non-compositional in meaning'.",
        "Some attempts have, however, been made to assign the meaning of an idiom to the parts of the idiom.",
        "These can roughly be divided in two: - assignment of the idiomatic meaning of the expression to one of the parts of the idiom, and no meaning to the other part (Ruhl, cited in Wood 1986).",
        "In the case of kick the bucket, the meaning die is assigned to kick, and no meaning to the other part.",
        "This raises the question however, why one cannot say Pat rested the bucket to mean Pat rested (Wasow et al.",
        "1983).",
        "- assignment of idiomatic interpretations to all parts.",
        "Compositional combination of these meanings results in an idiomatic meaning for the whole expression (Gazdar et al.",
        "1985).",
        "This analysis has a number of problems.",
        "Gazdar et al.",
        "use partial functions to avoid combination of an idiomatic functor with a non-idiomatic argument, but do not explain how to avoid combination of a non idiomatic functor with an idiomatic argument.",
        "In our view this can only be solved by introducing partial arguments, to our knowledge a non-existing notion, or by accepting that all functors are partial, which is not common in linguistics.",
        "We conclude that the meaning of an idiom is a property of the whole expression, and should be represented in the lexicon.",
        "2"
      ]
    },
    {
      "heading": "3.2 Psycholinguistics",
      "text": [
        "The same observation arises from psycholinguistic research.",
        "Idioms are stored and accessed as lexical items, not from some special list that is distinct from the lexicon3 (Swinney and Cutler 1979).",
        "Furthermore, idioms are stored as holistic entries in the mental lexicon (Swinney and Cutler 1979; Lancker and Canter 1980; Lancker, Canter and Terbeek 1981; cf. the notion 'configuration' in Cacciari and Tabossi 1988)."
      ]
    },
    {
      "heading": "4 Processing idioms",
      "text": [
        "A toy implementation of the lexicon structure and the algorithm has been made in C. ip A connectionist model The second model we present here for the lexical representation and retrieval of idioms is an extension of a simple localist connectionist model for the resolution of lexical ambiguity (Cottrell 1988 7).",
        "The model (2) consists of four levels.",
        "Units at the lowest level represent the smallest units of form.",
        "These units activate units on the level that represents syntactic discriminations, which in turn activate units on the semantic level.",
        "The semantic features activate relational nodes in the semantic network.",
        "Within levels, inhibitory links may occur; between levels excitatory links may exist.",
        "However, there are no inhibitory links within the semantic network.",
        "The meaning of idioms is represented as all other relational nodes in the semantic network.",
        "On the level of semantic features, the idiom is represented by a unit that has a gate function similar to so-called SIGMA-PI units (Rumelhart and McClelland 1986, p. 73): in order for such a unit A to receive activation, all units excitating A bottom-up should be active.",
        "If one of the units connected to a unit A is not active, A does not receive activation.",
        "Thus when the first word of an idiom is encountered, the idiom is not activated, because the other word(s) is (are) not active.",
        "However, once all relevant lexemes have been encountered in the input, it becomes active.",
        "Note that an external syntactic module excitates one of the nodes in case of syntactic ambiguity.",
        "Since there is inore than one syntactic unit activating the idiom, the overall activation of the idiom becomes higher than competing nodes representing non-idiomatic meanings.",
        "Or, to put it differently, the idiom represents the simplest hypothesis that accounts for the meaning of the lexemes in the input.",
        "7 For an introduction to conne.ctionist models, see Rumelhart and McClelland (1986); for a critical evaluation see Fodor and Phylyshyn (1988).",
        "The idiom is the strongest competitor, and inhibits the non-idiomatic readings.",
        "Without need for feedback from outside the model, the conventionality principle is thus modeled as a natural consequence of the architecture of the model.",
        "The connectionist model has been implemented in C with the use of the Rochester Connectionist Simulator (Goddard et al.",
        "1989).",
        "In the appendix we give a description of technical details of this implementation."
      ]
    },
    {
      "heading": "7 Concluding remarks",
      "text": [
        "Ambiguity in the case of idiomatic phrases can be resolved on the basis of the conventionality principle.",
        "When compared to strategies as used in Stock (1989), both models presented here have the advantage that they don't process idioms until all relevant lexical material has been encountered in the input and operate in a best-first fashion.",
        "Therefore they contribute to the efficiency of the parsing process.",
        "The connectionist model has one further advantage: the conventionality principle results naturally from the architecture of the model, and does not have to be stipulated explicitely.",
        "The obvious disadvantage of this model is the necessity for parallel hardware for realistic implementations.",
        "Future research will include the true integration with a syntactic module.",
        "Then, it will also be able to take the precise syntactic form of idiomatic phrases into account."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The authors would like to thank Walter Daelemans and the visitors of the Colloquium \"Computer and Lexicon\" 12 & 13 Oct, 1989, Utrecht for their useful comments.",
        "Wietske Sijtsma commented on English grammaticality and style."
      ]
    }
  ]
}
