{
  "info": {
    "authors": [
      "Cornelia Zelinsky-Wibbelt"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C90-3053",
    "title": "The Semantic Representation of Spatial Configurations: A Conceptual Motivation for Generation in Machine Translation",
    "url": "https://aclweb.org/anthology/C90-3053",
    "year": 1990
  },
  "references": [
    "acl-C86-1071",
    "acl-E89-1024",
    "acl-J87-3004",
    "acl-J89-3002"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper deals with the automatic translation of prepositions, which are highly polysemous.",
        "Moreover, the same real situation is often expressed by different prepositions in different languages.",
        "We proceed from the hypothesis that different usage patterns are due to different conceptualizations of the same real situation.",
        "Following cognitive principles of spatial conceptualization, we design, a semantic interpretation process for spatial relations in which our translation system uses semantic features derived from a semantic sort hierarchy.",
        "Thus we can differentiate subtle distinctions between spatially significant configurations."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "This paper deals with a general phenomenon of (machine) translation.",
        "The same real situation is often expressed differently in different languages.",
        "This is especially true for situations which are expressed by prepositions.",
        "We hold that different usage patterns resulting from this fact are due to different conceptualizations of the same real situation.",
        "The motivation for this phenomenon is given by the theory of Cognitive Grammar: Proceeding front the hypothesis of basic cognitive domains (cf. Langacker I988.pp.54) it is possible to define all and only the properties which may become salient in spatial conceptualizations of entities and thus distinguish sufficiently one spatial conceptualization from another.",
        "Basic cognitive domains refer to basic cognitive capacities as, e.g., the ability to conceptualize space and time.",
        "They are basic, because in any hierarchy schematizing conceptual complexity they constitute the lowest level and thereby the range of the conceptual complexity.",
        "They are the most general cognitive capacities and are fixed in certain sensomotoric as well as logical schemata, and as we have said, in some languages of the world they are morphologically manifested.",
        "This is in line with ontologies based on prototype semantics, as they have been developed by Dahlgren (1986,1989), Hobbs (1987), Moens (1989)), Miller & Johnson-Laird (1976) for word sense disambiguation in different NLP systems.",
        "A hierarchy of semantic sorts is defined over basic cognitive domains, which is used for lexical representation, thus facilitating transfer (cf. Zelinsky-Wibbelt 1988, 1989).",
        "We design a semantic interpretation process for spatial relations in which our translation system uses semantic features derived from the semantic sort hierarchy.",
        "The implementation of this interpretation process is based on assumptions about the cognitive process of configuring spatially significant entities by operating on conceptual representations of word meanings.",
        "The EUROTRA-D CAT2 system shows that with the definition of word meanings with respect to cognitive domains, we can interpret subtle distinctions between spatially significant configurations in an economic and elegant way.",
        "2.",
        "Schematization as the spatial organization of entities",
        "The main point we want to illustrate with the translation of prepositions is how certain circumstances and purposes of an utterance instantiate important principles of conceptualization.",
        "We will consider particularly pragmatic factors resulting front the specific environment of the language and the situation of utterance; we will investigate how these pragmatic factors determine the relevance, salience and typicality of the entities constituting the conceived situation.",
        "Moreover, we consider these meaning constituting factors which depend on the culture-specific environment of the language user to be conceptual motivations of meaning in the broadest sense, namely in the sense that abstract situations, which may not be perceived sensorically are conceived in terms of concrete, sensorically perceivable situations.",
        "This perceptually driven conceptualization of abstract scenes, by which metaphors are created and interpreted, cannot, however, be considered in this paper (We deal with this phenomenon in Zelinsky-Wibbelt 1989b and Zelinsky-Wibbelt forthcoming).",
        "Prepositions are called relational expressions because they express how the conceptualizer profiles the relation between two participants: between the moving of moveable trajector, usually referred to by the NP mentioned first, and the more stationary backgrounded landmark, usually referred to by the second NP.",
        "In this assymetrical partitioning of the real scene, the relation between trajector and landmark is profiled in that the trajector is located with respect to the landmark.",
        "The asymmetric relation between trajector and landmark becomes obvious when we try to turn the relationship around as in the following examples: The cat is on the mat./\"'The mat is under the cat.",
        "Industry is situated on the Rhine./*The Rhine is situated on industry.",
        "Assuming that language does not express reality but how we conceive of reality, the semantic distinctions made by language with respect to our spatial environment do not necessarily agree with the entity's real spatial extension, but with its conceptual scheinatization.",
        "Schematization is the fundamental principle underlying the linguistic expressions of spatial configurations (cf. 'Palmy 1983:225).",
        "It is the selection of those properties which become salient with the conceptualization of a scene, while the non-salient properties do not participate in this process.",
        "This means that in addition to prepositions being highly polysemous, most entities are lexically vague with respect to their possible spatial properties which they may realize in the respective configurations.",
        "The process of schematization is led by the following related principles which instantiate certain spatial properties: By the salience principle we prefer to associate an entity with a certain shape of one of its parts in a given relation.",
        "For instance in the conceptualization of the sentence \"the children are riding on the bus\" \"bus\" does not refer to the whole entity, which is three-dimensional, but only to its two-dimensional floor.",
        "This becomes salient by the typical relation assumed between the entities, which implies the localization of the trajector within the space occupied by the landmark (place=(tr=part_of_lm)).",
        "This is an example of IDEALIZATION by which we focus on the salient dimension(s) of an entity and abstract from the non-salient dimensions, in this case the vertical dimension.",
        "The INTRINsic ORIENTATION of \"bus\", which is FRONTAL, is also abstracted away from in this example; within this relation it is salient that the bus has an interior bottom which functions as a SURFACE.",
        "The relevance principle implies that dependent on the communicative goals we can choose one of disjoint prepositions for a specific spatial configuration.",
        "The communicative goals depend on the speaker's viewpoint, which in turn depends on the situation of utterance.",
        "The following example might illustrate this principle: Imagine a scene in which Mary is inside the building of a supermarket.",
        "If the speaker is far away from the scene he would designate Mary's location by saying \"Mary is at the supermarket\", thus expressing that his idealization of the three-dimensional extension of the supermarket to a point: by using the preposition \"at\" he asserts that Mary's position coincides with that of the supermarket.",
        "If the speaker, however, is himself on the premises of the supermarket, he would designate Mary's location by saying \"Mary is in the supermarket\" thus referring to the three-dimensional extension of the building of the supermarket functioning as an ENCLOSURE.",
        "Thus different utterance situations result in disjoint conceptualizations and hence different expressions of the same real situation.",
        "The tolerance principle controls the pragmatic conditions under which expressions chosen by the speaker are adequate.",
        "This principle may for instance control whether idealization of trajector and landmark to a point, as in the above given example, is adequate with respect to the specific position of the speaker.",
        "The tolerance principle also controls the specific range of PLASTICITY of a relation.",
        "PLASTICITY is the general possibility of stretching the boundaries of a spatial schematization type with respect to the range of possible scenes conforming to it.",
        "Thus \"in front of\" may be used even if the located entity is not exactly in front of but also beside another entity (cf. Herskovits 1988), as indicated in the following schema, where by focal adjustment we may view X to be located in front of Y within the given orientation:",
        "The typicality principle implies the designation of a spatial configuration in dependance of typical relations existing between the entities.",
        "In our example \"The children are riding on the bus\", the motion verb implies the discourse situation which instantiates the typical relation to be that the children are located inside of the bus and not on top of it.",
        "The typicality principle also makes possible the interpretation of an entity's INTRINSIC or TYPICAL orientation as the default case, if information to the contrary is lacking.",
        "For instance, human bodies, churches and other buildings have an intrinsic frontal orientation and a prominent vertical axis.",
        "Other properties by which we can distinguish different spatial configurations are the BOUNDARY CONDITIONS of an entity, including whether it is COUNT or MASS, but they may also be related to the SHAPE properties; that is, it may be of importance whether an ENCLOSURE is BOUNDED like a Suitcase, PARTIALLY BOUNDED like a bowl, or UNBOUNDED like an area.",
        "Moreover, the BOUNDARY CONDITIONS imply whether the entity is temporally UNBOUNDED like a STATE or an ACTIVITY or temporally BOUNDED like an ACHIEVEMENT or an ACCOMPLISHMENT (cf. Vendler 1967 and Dowty 1979 for this classification; for the explication of the spatio-temporal analogy cf. e.g. Talmy 1983;pp.255).",
        "The GRANULARITY of an entity.",
        "This refers to an entity's subdivision, which may be conceptualized with a more finegrained or more coarsegrained resolution.",
        "The process of schematization results in the asymmetric relation between trajector and landmark.",
        "This means that prepositions are two-place predicates (which is an old assumption of formal semantics; cf. also Hawkins 1985.61).",
        "The relational concept - the trajector's spatial disposition - is designated by the preposition.",
        "Let us now organize the relations developing between trajector and landmark with respect to how they condition each other and how they result from the relevance, salience, and typicality of the entities constituting the conceived situation.",
        "This will be the precondition for implementing these relations in the form of rules in our translation system.",
        "In figure I we represent those relations which we assume to determine obligatorily the process of conceptualizing the spatial configuration of entities.",
        "We start with the relational concept which is part of the interpretation of the source language and which keeps constant during translation.",
        "Discourse situation Universal relation The discourse situation may be An interlingually constant PLACE relation is pre-provided by the verbal predicate supposed that implies the global space in which of the sentence.",
        "the trajector is localized with respect to the landmark.",
        "Trajector and landmark The discourse situation instantiates certain spatial properties of trajector and landmark.",
        "Language specific relation As a consequence of the spatial properties of trajector and landmark the language specific relation is conceptualized.",
        "As the sentence is about moTtoN, with the Depending on the situation of MOTION, with the PLACE of the trajector within the space _ _, trajector within the space of the landmark, and the of the landmark, the bus has the normal, – -, normal VEHICLE function of the bus being salient, typical function of a LARCH VEIIICLE; the TRANSPORTABILITY of the children is the together with this the SURFACE of the typical property in this relation.",
        "floor become salient.",
        "Language specific relation (on) The salient part of the landmark being the SURFACE of its floor and the typical property of the trajector being its TRANSPORTABILITY, the relation of support is conceptualized..",
        "Let us now exemplify how these properties and relations get instantiated with an English speaker's conceptualization of our example sentence \"The children are riding on the bus\" on the basis of the German source sentence.",
        "In figure 2 we give an overview of this.",
        "In the configuration of the designated spatial scene \"the bus\" establishes the landmark.",
        "Its spatial conceptualization is the condition for the relational concept designated by \"on\": Depending on the action of \"riding\" and the TYPICAL FUNCTION of \"bus\" being that of a LARGE VEHICLE, the TRANSPORTABILITY becomes the typical property of the trajector, which is realized by the \"children\" (see rule 9 below): This view of the entities excludes all other schematizations from being possible (e.g., that in which the children are on top of the bus).",
        "An additional condition for this schematization is the information about the PLACE relation, which keeps constant during translation and which implies the fact that the trajector is located within the space occupied by the landmark.",
        "in this configuration the SURFACE of the floor of the bus becomes salient, because it is relatively large, thus instantiating the relation of SUPPORT to be conceptualized between \"children\" and \"bus\" (see rule 11 below).",
        "A conceptualization where the surroundings become more salient has to he expressed by the preposition \"in\", which designates the relation of INCLUSION as for example in \"the customer in the taxi\"."
      ]
    },
    {
      "heading": "3. The process of schematization",
      "text": [
        "within a unification based environment Our implementation is done in the CAT2 system (cf. Sharp 1988), an extension of the MT prototype (cf. Arnold et al.",
        "1986) formerly used in EL/ROTRA.",
        "Although differing primarily in the implementation, the basic translation philosophy has been preserved.",
        "The translation procedure is stratificational in that it is split up into the translation between several linguistically motivated levels, representing constituency, syntactic functions and semantic relations.",
        "In this paper we are only concerned with the semantic level, the Interface Structure (IS), which should contain the semantic information required for transfer, analysis and synthesis.",
        "For a more detailed description of the current CAT2 system and the current IS conception see Sharp 1988, Zelinsky-Wibbelt 1988 and 1989, and Steiner et al.",
        "1988.",
        "Let us now relate the process of schematization to generating a representation by stepwise rule application, where the rules include the instantiations of the schematization principles given in section 2 (\"sf\" stands for semantic feature, \";\" for disjunction, \"pred\" for predicate, \"arg\" for argument, and \"mod\" for modifier).",
        "The language-specific semantic representation which unifies with the correct preposition is generated in the respective target language component.",
        "We illustrate the translation of our example sentence \"Die Kinder fahren ins Bus\" into \"The children are riding on the bus\".",
        "In order to keep the representation clear we give the rules in a very simplified version, containing only the information relevant in this context, namely the information about the typicality, salience, and relevance of basic cognitive domains and domain-specific typical functions: German lexical rules: (I) (pred,(cat=prep,lu=in,place=(tr=part_of_lm)).[*].",
        "Feature co-occurrence rules:",
        "(2) (?,(cat=pp,place=A)).[(pred,(cat=prep,place=A)),*I.",
        "Transfer rules: (3) (mod,(ca t=pp,place=A)) (mod,(cat-pp,place-A )).I*J. English lexical rules: (4) (pred,(catrm,lu=bus, sf=(typical Junction=large_vehicle))).(*].",
        "(5) (pred,(cat=n,lu-child,sf=(animate=human))).[*].",
        "(6) (pred,(cat=prep,lu---on,relevant,support)).[*].",
        "(7) (pred,(cat=v,lu=ride,",
        "sfr(activity=motion), arg1={sf=(animate=hurnan)))).",
        "[•].",
        "Feature co-occurrence rules:",
        "(8) (7,(cat-mp,sf.A)).[(pred,(cat=n,sf-A)),*].",
        "(9) (?,(cat=s)).",
        "[",
        "(pred,(cat.v,sf---(activity=notion))), (arg I ,(cat--np,sfe(salient=transportable, idealization-three-dimensional))), (mod,(cat=pp,place=(tr=part_ofjm), sfofnp-(salientshape-surface, idealization=two-dimensional, typicalfunction=largevehicle)))),*].",
        "Rule (3) guarantees that the information about PLACE.",
        "which is preserved during translation, is transferred.",
        "Rules (5) to (7) are lexical rules denoting basic cognitive domains, whereas rule (4) denotes a typical function of a domain-specific entity.",
        "Both knowledge types are used in sentence rule (9), which effects that in sentences in which the verb inherently predicates a MOTION and has a PP-Modifier with an NP argument whose designated object - the landmark - typically functions as a LARGE VEHICLE, TRANSPORTABILITY is instantiated as the salient property of the first NP argument of the verb, the trajector.",
        "What can then be instantiated is the idealization of the PP's NP-argument to a TWO-DIMENSIONAL SURFACE which is its salient part.",
        "Now the schematization type may be generated by rule (I I).",
        "This rule effects that in a spatial configuration with a typically TRANSPORTABLE trajector and a landmark which has a surface as its salient part, the relevant concept relating both trajector and landmark is that of SUPPORT, which unifies with the lexical rule (6) for the preposition on.",
        "The result of the generation process is represented in a simplified version in figure 3.",
        "predicate cat=v activity=motion argumentl cat=np index=n typical=transportable predicate cat=prep relevant=sopport modifier cat=pp place=Ctr=partof_Un) sfof_np=(salient_shape=surface) argumentl argivent2 cat.np cat=np type=empty shape=surface index=n typical=transportable idealization.three-dimensional Figure 3 Spatial configuration as the result of unification While in this example the discourse situation was given intrasententially by the action of riding, it will often only be given extrascntentially.",
        "This opens an area for future research, which will also comprise interaction with a knowledge base.",
        "Acknowledgements I would like to thank Wiebke Ramm, Randall Sharp, and JOrg SchOtz, as well as many other colleagues whom I cannot mention here for helpful discussions."
      ]
    }
  ]
}
