{
  "info": {
    "authors": [
      "Michael R. Brent"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P90-1016",
    "title": "A Simplified Theory of Tense Representations and Constraints on Their Composition",
    "url": "https://aclweb.org/anthology/P90-1016",
    "year": 1990
  },
  "references": [
    "acl-J88-2002",
    "acl-J88-2003",
    "acl-J88-2004",
    "acl-J88-2005",
    "acl-J88-2006",
    "acl-P85-1003",
    "acl-P86-1003"
  ],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "This paper proposes a set of representations for tenses and a. set of constraints on how they can be combined in adjunct clauses.",
        "The semantics we propose explains the possible meanings of tenses in a variety of sentential contexts.",
        "It also supports an elegant constraint on tense combination in adjunct clauses.",
        "These semantic representations provide insights into the interpretations of tenses, and the constraints provide a source of syntactic disambiguation that has not previously been demonstrated.",
        "We demonstrate an implemented disambiguator for a certain class of three-clause sentences based on our theory."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "This paper proposes a set of representations for tenses and a set of constraints on how they can be combined.",
        "These representations provide insights into the interpretation of tenses, and the constraints provide a source of syntactic disambiguation that has not previously been demonstrated.",
        "The sentences investigated in this paper contain multiple clauses connected by temporal/causal connectives, words like once, by the lime, when, and before.",
        "(1) shows that the tenses of multi-clause sentences affect their acceptability.",
        "This raises several important",
        "questions.",
        "Which tense combinations are acceptable and which are not?",
        "Why do they have the status they do?",
        "How can observations like (1) be used to leverage problems like syntactic disambiguation and knowledge representation?",
        "The representations and constraints proposed here answer these questions.",
        "Specifically, they provide explanations in terms of the meanings of the tenses.",
        "We propose an explanatory theory and demonstrate an implementation which successfully disambiguates a class of three-clause sentences.",
        "The issues raised by (1) are significant for computational linguistics on several accounts.",
        "First, an understanding of the constraints on tense combinations can be used to support syntactic disambiguation.",
        "For example, consider the alternative parses shown textually in (2) and graphically in Figure -1.",
        "The first parse in both",
        "(2) a. OK [s Jon will learn Is that he won s] when Rachel arrivess]",
        "(2) and Figure -1, where the adjunct clause starting with when is attached high, is fine; the second, where it is attached low, is unacceptable.",
        "Figure 1 demonstrates our parser discriminating between the acceptable and unacceptable parses of (2).",
        "The details of the representation cannot be understood until later, but it can be seen that different compositions of the tenses in the two parses result in marking the top node of the second parse as bad.",
        "The contrast between example (2) and example (3) shows that whether the preferred attachment depends on the tenses of the clauses.",
        "Examples (2) and (3) show",
        "(3) a.",
        "[s Jon will learn [s that he had won s] by",
        "the time Rachel arrived s] Read as: By the lime Rachel arrived, Jon will /earn that he had won",
        "that there are interesting interactions among tenses, and",
        "that a good theory of these interactions would be useful for syntactic disambiguation.",
        "Such a theory, and an implementation of a disambiguator based on it, are the subjects of this paper.",
        "In addition to its potential for syntactic disambiguation, a theory of these temporal adjunction phenomena is may guide the construction of model-theoretic interpretations of the temporal and causal relations among events.",
        "Finally, people clearly have a lot of knowledge about the interaction among tenses.",
        "By making this knowledge explicit, we are likely to open new, unforeseen avenues to improving the performance of natural language processing devices."
      ]
    },
    {
      "heading": "1.1 Context",
      "text": [
        "The subjects of tense and temporal representation have generated a great deal of interest in artificial intelligence, computational linguistics, linguistics, and philosophy.",
        "Work in these areas addresses a variety of interesting questions which can be broadly divided into two types: questions about representing the temporal knowledge conveyed by natural language, and questions about representing rote of tense in sentential grammar.",
        "The former questions have often been addressed by attempting to construct a model-theoretic semantics of certain temporally significant linguistic constructions.",
        "Important work in this area includes Dowty (1979), Allen (1984), Dowty (1986), Hinrichs (1986), Moens (1987), and Hinrichs (1988).",
        "Much of the recent work in this area has used some version of Reichenbach's (1947) representation of tenses as a starting point.'",
        "The questions about the role of tense in sentential grammar, and in particular about its effect on the acceptability of various sentence types, has been addressed by a different set of researchers.",
        "This work, which also uses Reichenbach as a starting point, is well represented by Hornstein (1990) and Comrie (1985), and the works cited therein.",
        "In this paper, we focus on how tenses affect the acceptability of sentences, but we attempt to explain their effect in terms of their interpretations.",
        "While we explain certain observations about the acceptability of sentences in terms of interpretations, we do not attempt to develop a theory of the temporal interpretation of natural language.'",
        "Earlier attempts to explain the phenomena under study here include Hornstein (1977), Hornstein (1981), Yip (1986), and Hornstein (1990).",
        "In the current paper, we attempt to remove some semantic underdetermination and some theoretical redundancy that we have 'Hinrichs, 1986; Harper and Charniak, 1987; Hinrichs, 1988; Moens and Steedman, 1988; Nakhimovsky, 1988; Pas-soneau, 1988; and Webber, 1988 21n particular, the important issue of tense as discourse anaphor is not addressed.",
        "(See Hinrichs, 1986; Moens, 1987; Hinrichs, 1988; Nakhimovsky, 1988; and Webber, 1988.)",
        "Further, we do not have a theory of the interaction of temporal interpretation with aspect.",
        "(See Dowty, 1979; Dowty, 1986; Moens, 1987; Moens and Steedman, 1988; Nakhimovsky, 1988; and Passoneau, 1988.)",
        "found in these works.",
        "Section 5 provides a more detailed comparison with Yip (1986) and Hornstein (1990).",
        "Along with Hornstein and Yip, Harper and Charniak (1987) also propose a set of rules to account for the acceptability of tense combinations in adjunct constructions.",
        "However, their primary interest is in representing the temporal knowledge that can be conveyed by natural language.",
        "As a result, they explicitly choose not to use their semantic system to construct an explanation for their adjunction rules; rather they propose their adjunction rules as syntactic descriptions.",
        "By contrast, the current paper focuses primarily on developing a semantic explanation of tense compatibility.",
        "Although we do not offer specific variations on the model-theoretic approach, we hope that our work will further it indirectly.",
        "At a minimum, since many model theoretic approaches use Reichenbach's (1947) tense representations, our insights into those representations may be significant.",
        "Further, we hope that our constrained rules for composing those individual tense structures will provide a richer set of representations on which model theoretic approaches can be built."
      ]
    },
    {
      "heading": "1.2 Preview",
      "text": [
        "The remainder of this paper proceeds as follows.",
        "Section 2 introduces the representations for individual tenses.",
        "Section 3 presents the method of composing tenses from different clauses, and a general constraints that applies to such composition.'",
        "Section 4 demonstrates the computer program implementing this theory.",
        "Section 5 steps back from the technical details to assess the contributions of this paper and compare it to closely related works.",
        "Finally, Section 6 sums up the conclusions drawn throughout the paper.4"
      ]
    },
    {
      "heading": "2 The Representation of Individual Tenses",
      "text": [
        "In order to construct a theory explaining which tenses can be combined we need a representation of the tenses.",
        "The representation used here is variant of that used by Hornstein (1990), who bases it on Comrie (1985).",
        "It is a Neo-Reichenbachian representation (Reichenbach, 1966) in that its simple tense structures (STSs) relate the following three entities: the time of the event named by the verb, denoted by \"E\", the time of speech, denoted by \"S\", and a reference time, denoted by \"R\".",
        "The reference time R is used to locate an event with respect to another event in sentences like (lb) above.",
        "(A mechanism for connecting tenses via the R point will be 3 Brent (1989) presents two additional constraints on tense composition.",
        "4 While English alone has been studied in detail, preliminary investigation supports the expectation that the theory will extend to Romance and Germanic languages.",
        "One of the most obvious difference between Romance and Germanic languages is addressed in Brent (1989).",
        "detailed in Section 3.)",
        "Each STS consists of a relation between S and R and one between R and E; S and E are not directly related.",
        "For any directly related time points X and Y, at most one of four possible relations holds between them.",
        "These are written as in Table 1.",
        "Although we use the same notation as Hornstein (1990), we view it as merely notation for fundamentally semantic relations, whereas he appears to view the syntax as primary.",
        "For the purposes of constraining tense combination there appear to be six basic tenses5 (Table 2).",
        "We assign STS representations to tenses as shown in Table 2.",
        "One of the main contributions of this paper over previous attempts will be its ability to completely determine the assignments of Table 2 in terms of the semantics of the representations and the meanings of actual tenses.",
        "The assignment of STSs to tenses shown in Table 2 can be derived from the possible interpretations of various tenses.",
        "Before arguing that Table 2 can be derived, we note that it is at least consistent with the interpretations of the tenses.",
        "Suppose that underscore is interpreted as temporal precedence and comma as simultaneity (As in Hornstein, 1990.",
        "Under this interpretation the various tense structures correspond to the evident meanings of the tenses.",
        "For example, the STS of the past tense is \"ER R_S.\"",
        "That is, the event referred to by the clause is simultaneous with some reference point R, which precedes the time of speech (E = R < S).",
        "It follows that the event precedes the time of speech, which corresponds to the evident meaning of the past tense.",
        "On the other hand, the proposed semantics for comma and underscore cannot completely determine the assignments shown in Table 2, because Table 2 distinguishes X,Y and Y,X, \"The constraints on tense combination appear to be entirely independent of whether or not the tensed verb bears progressive morphology.",
        "but the semantics does not assign them distinct meanings.",
        "That situation is remedied by introducing a new and slightly more complex interpretation for comma, as described in (4).",
        "(4) Interpretation of \"X,Y\": a. Y does not precede X. b. X is simultaneous with Y, in the absence of evidence that X precedes Y.",
        "(Such evidence can come from other tenses, adverbs, or connectives, as described below.)",
        "c. X precedes Y, in the presence of supporting evidence from other tenses, adverbs, or connectives.",
        "The reinterpretation of comma as precedence due to the presence of an adverb is illustrated in (5).",
        "Although { 5 leave for LA { OK tomorrow",
        "am leaving yesterday leave is in the present tense, it is interpreted as a future because of the adverb tomorrow.",
        "The fact that adjectives can cause the present tense to be reinterpreted as a future but not as a past indicates that its STS must be SR R,E, not any of the permutations like S,R ER, If the present had SR E,R as its STS then E,R could be reinterpreted such that E < R S, a past.",
        "Similar arguments can be made for the other STSs in Table 2.",
        "Further, evidence that both tenses from other clauses and temporal/causal connectives can cause comma to be reinterpreted as precedence will be presented below.",
        "Note that (4) does not mean that \"X,Y\" is interpreted as \"X is prior to or simultaneous with Y\".",
        "Rather, a particular occurrence of \"X,Y\" always has exactly one of the following two interpretations: 1) X is simultaneous with Y; 2) X is prior to Y.",
        "\"X,Y\" is never ambiguous between the two.6"
      ]
    },
    {
      "heading": "3 Causal/Temporal Adjunct Clauses",
      "text": [
        "In this section we introduce a composition operation on STSs, and a major constraint on composition.",
        "It is important to keep in mind that we are discussing only causal/temporal adjunct clauses.",
        "In particular, we are not considering complement clauses, as in \"Rachel knows that Jon played the fool yesterday.\""
      ]
    },
    {
      "heading": "3.1 Tense Composition and Semantic Consistency",
      "text": [
        "When one clause is adjoined to another by a temporal/causal connective like once, by the time, when, or before the acceptability of the resulting sentence depends in part on the tenses of the two clauses.",
        "This is demonstrated by (1).",
        "In fact, of the 36 possible ordered pairs 'This is different from Yip (1986), where comma is crucially interpreted as ambiguous between the two readings.",
        "of tenses only nine are acceptable when put in adjunct constructions like (1).",
        "(The nine acceptable tense pairs are listed in Table 3.)",
        "20 of the 27 unacceptable ones, but none of the nine acceptable ones, have the following character: their adjunct-clause SR relation is inconsistent with their matrix-clause SR relation, and cannot be reinterpreted according to (4) in a way that makes it consistent.",
        "This can be understood in terms of the merging of the adjunct SR relation with that of the matrix, yielding a combined tense structure (CTS) that has only the matrix SR, relation.",
        "Besides explaining the acceptability status of many CTSs, the idea of merging the adjunct SR relation into that of the matrix makes sense in terms of the representational schema.",
        "In particular, the idea that the adjunct's 11 point should be identified with that of the matrix through causal/temporal adjunction is consistent with the representational schema which uses R as a reference point for relating one event to another.",
        "Furthermore, since \"S\" is a deictic point representing the time of speech (more accurately, the time of proposition), and since both clauses represent propositions made in the same context, it makes sense that they should have the same S point.",
        "Once the S and R points of the adjunct clause have been identified with that of the matrix clause, it makes sense that sentences where the matrix asserts one order for the shared S and R. points while the adjunct asserts another order would be irregular.",
        "Before attempting to formalize these intuitively appealing ideas, let us consider an example.",
        "The notation for CTSs is as follows: the STS of the matrix clause is written above that of the adjunct clause and, if possible, the identified S and R points are aligned and connected by vertical bars, as shown in (6).7"
      ]
    },
    {
      "heading": "RE FUTURE (WIN) R,E PRESENT (ARRIVE)",
      "text": [
        "(6) is the CTS for sentence (lb).",
        "Although the SR relation for the present tense adjunct is not identical to that of the future tense matrix clause, the adjunct can be reconciled with that of the matrix clause if the S,R is interpreted as precedence, S < R. Notice that sentence (lb) is, in fact, interpreted such that the arriving occurs in the future, even though the verb is in the present tense.",
        "Because of the two possible interpretations of the comma relation proposed in (4), a single representation accounts for the passibility of interpreting the present as a future.",
        "Further, by making the (still informal) restriction on tense composition a semantic one, we use the same mechanism to account for tense compatibility.",
        "Now consider an unacceptable example.",
        "(la) has Ian tense structures shown in typewriter face are actual output from our program.",
        "When they are reported as the tense structure for a particular sentence, then the program generated them in response to that sentence.",
        "For more on the implementation, see Section 4. the CTS shown in (7).",
        "Note how the matrix clause as",
        "serts that the (shared) R point precedes the (shared) S point, while the adjunct clause asserts that the R point is simultaneous with the S point.",
        "The adjunct clause could be reinterpreted according to (4) such that the R point follows the S point, but this would not help – the assertions on the two levels would still be inconsistent.",
        "In general, if the SR relation on the matrix and adjunct tiers of the CTS do not have the same left-to-right order then their meanings cannot be reconciled.8 We have proposed that the adjunct SR relation must be consistent with the matrix SR relation, argued that this constraint is intuitively appealing and consonant with the representational system as a whole, and shown an example.",
        "Despite the intuitive appeal, there are two hypotheses here that should be made explicit: first, that the SR relation of the adjunct clause is merged with that of the matrix when temporal/causal adjuncts are interpreted; and second, that CTSs containing contradictory assertions as a result of that merger are experienced as unacceptable, not merely implausible.",
        "We codify those two hypotheses as follows: Adjunct Clause Information Restriction (ACIR): \"Adjunct clauses that introduce new SR information into the CTS are unacceptable.\""
      ]
    },
    {
      "heading": "3.2 Interpretation of C T Ss",
      "text": [
        "The interpretation of comma offered in (4), in combination with the ACIR, explained the incompatibility of 20 tense combinations in causal/temporal adjunct constructions.",
        "Thus the new interpretation has important consequences for the SR portion of the CTS, the portion referred to by the ACIR.",
        "We now explore its consequences for the RE portion of the CTS.",
        "According to the ACIR a CTS contains only a single SR relation, that provided by the matrix clause.",
        "Since both the matrix event (E,aat) and the adjunct event (E) bear temporal relations to their shared R point, it follows that they may be comparable.",
        "For example, the structure shown in (8b) is interpreted as Emat < R = Ea di by default.",
        "(Our program prints out the default Erna – Edi comparison for valid CTSs, but they have been suppressed up to now.",
        "In addition, Table 3 lists all tense combinations that yield acceptable CTSs according to the Emat ordering of their 'This is shown in greater detail in Brent (1989).",
        "Also, note that Hornstein (1990) takes this condition on the form of the CTSs as primary instead of reducing it to their meanings.",
        "For discussion of the differences, see Section 5.",
        "(8) a. Jon had won the game when Rachel arrived b.",
        "(",
        "default interpretation.)",
        "Sentence (8a) does indeed imply that the matrix event (Jon's winning) occurred before the adjunct event (Rachel's arriving).",
        "If the comma in \"Emat IR\" could be reinterpreted as temporal precedence then, instead of Erna/ R = Eaco, we would have Etna, <R and E.di R; Erna and E1 would be incomparable.",
        "Brent (1989) proposed a constraint ruling out CTSs that do not yield an Erna* – Eadj comparison.",
        "The reason for that proposal was the unacceptability9 of sentences like (9).",
        "Now consider the following reformu",
        "(9) a. Jon had won the game when Rachel had arrived b.",
        "(",
        "This reformulation allows the same constraint both to narrow the possible interpretations of constructions like (8) and to explain the problematic status of constructions like (9).",
        "Reexamining (8), Eado,R cannot be reinterpreted because to do so would violate the Interpretation Constraint; Emat_R cannot be reinterpreted because underscore has only the precedence interpretation.",
        "Thus (8) has only a single interpretation.",
        "Now consider CTSs with Emat,R and Eadj, R, and in (10c).",
        "Their default interpretation will be Em,t R = Eadj.",
        "But by picking appropriate temporal/causal °For present purposes it does not matter whether sentences like (9) are regarded as strictly ungrammatical or merely reliably infelicitous.",
        "connectives or pragmatic contexts we can force either comma to be reinterpreted, yielding Eadj R = Emat as in (10a), Ernm < R = E„dj as in (10b).10 Of course, the",
        "(10) a. OK Jon quit his job after Rachel left him b. OK Rachel left Jon before he quit his job c. ("
      ]
    },
    {
      "heading": "E,R R_S PAST I I I E(m)=E(a) E,R R_S PAST)",
      "text": [
        "Interpretation Constraint prevents both commas from being simultaneously reinterpreted.",
        "We have shown that the interpretation of comma offered in (4) provides a flexibility in the interpretation of CTSs that is required data such as (10).",
        "Further, it restricts the interpretation of constructions like (8), where one of the clauses is in a perfect tense.",
        "Although we cannot fully explore the interpretive range of such perfect constructions here, the restriction on them has intuitive appeal."
      ]
    },
    {
      "heading": "4 The Computer Model",
      "text": [
        "This section describes our implementation of the theory described above.",
        "The implementation serves two purposes.",
        "First, we use it as a tool to verify the behavior of the theory and explore the effects of variations in it.",
        "Second, the implementation demonstrates the use of our tense theory in syntactic disambiguation.",
        "Our program operates on parse trees, building complex tense structures out of simple ones and determining whether or not those CTSs are acceptable, according to the constraints on tense combination.",
        "This program was linked to a simple feature-grammar parser, allowing it to take sentences as input.'",
        "In addition to building the CTS for a sentence, the program lists the apparent Eniat – Eatt relation for the CTSs it accepts, and the constraints violated by the CTSs it rejects.",
        "Its behavior on several of the examples from Section 1 is shown below.",
        "Examples (la) and (lb) show the effects of the Adjunct Clause Information Restriction on the acceptability of sentences.",
        "(la) * Rachel won the game when Jon arrives (compute-tense-structures (parse '(Rachel +ed win the game when Jon +e arrive))) 20See also Moens and Steedman, 1988 regarding when clauses.",
        "''Because morphology is quite distant from our interest in tense, the parser has no morphological component.",
        "Instead, input sentences have their tense morphemes, such as +ed, separated and preposed.",
        "A morphological parser could easily return the components in this order.",
        "+ed represents the past-tense morpheme, +3 the present-tense morpheme, and 4-en the past participle morpheme."
      ]
    },
    {
      "heading": "S,R R,E PRESENT (ARRIVE))",
      "text": [
        "Examples (2) and (3) show how a sentence with two possible adjunction sites for the adjunct clause can produce two CTSs.",
        "The unacceptability of the CTSs resulting from one of the adjunction sites disambiguates the sentences.",
        "In sentence (2) it is high attachment, to the matrix clause, that is acceptable; in sentence (3), low attachment to the complement clause.",
        "Figure -1, page 2, shows the two possible parses of (2) output by our program.",
        "One of them is automatically labeled ungrammatical with an asterisk on its CTS.",
        "Note that the composition of tenses from subcategorized complement clauses, as opposed to adjunct clauses are not investigated here, but rather adopted from Hornstein (1990)."
      ]
    },
    {
      "heading": "5 Discussion",
      "text": [
        "In this section we compare the preceding solutions to the temporal/causal adjunction problem with those offered in Yip (1986) and Hornstein (1990)."
      ]
    },
    {
      "heading": "5.1 Semantics of Simple Tense Structures",
      "text": [
        "Two other works, Yip (1986) and Hornstein (1990), have developed theories of the effect of tense on the acceptability of temporal/causal adjunct constructions.",
        "Both of these are at least partially rooted in the meanings of the tenses, and both use representations for simple tense structures that are similar to the ones used here.",
        "However, they both have difficulty in justifying the assignment of STSs to tenses.",
        "Yip assumes that comma is ambiguous between < and =.",
        "Notice that this is different from the default interpretation suggested here, whereby a given comma in a given tense structure has exactly one interpretation at any one time.",
        "Yip's assumptions are critical for the explanatory power of his argument, which won't go through using a default interpretation.",
        "According to Yip's interpretation, \"Jon is running\" and \"Jon runs\" ought to be ambiguous between the present and the future, but they clearly are not.",
        "Both describe events or sets of events that necessarily must include the time of speech.",
        "This problem is exacerbated by Yip's proposal that the present tense be assigned two STSs, one equivalent to \"S,R R,E\" , the one used here, and the other \"E,R R,S\".",
        "This proposal, along with the ambiguous interpretation of comma, would predict that the present tense could be interpreted as meaning the same thing as nearly any other tense.",
        "For example, the present could be interpreted as equivalent to the past perfect, if both commas in its \"E,R R,S\" STS received the reading E < R< S. Hornstein (1990) uses the simultaneity interpretation of comma exclusively in assigning STSs to tenses.",
        "Thus there is no semantic reason, in Hornstein's model, why the present tense should have \"S,R R,E\" rather than \"S,R E,R\".",
        "Furthermore, reinterpretation of comma is not invoked to explain the fact that the present tense is reinterpreted as referring to the future when it is adjoined to a future clause or modified by a future adverb.",
        "Instead, a syntactic rewrite rule that changes X,Y to X_Y under these conditions is used.",
        "However, in the absence of semantic constraint, it is not clear why that rule is better than one that switches order too, rewriting Y,X to X..Y.",
        "This alternative rewrite rule would be consistent with the observations if every X,Y in every STS were switched to Y,X.",
        "Since X,Y and Y,X are interpreted in the same way in Hornstein's theory, there is no reason not to make these two changes.",
        "That is to say, Hornstein's theory does not explain why the STSs and the rewrite rule are the way they are, rather than some other way.",
        "Yip could not correctly derive his STS/tense mapping from the meanings of the tenses because he allowed each STS to have too many different meanings in the simple, unmodified situations.",
        "Even so, these meanings were too narrow for his constraint on adjunction, so he was forced to propose that the present has two STSs.",
        "This only made the underdetermination of the meanings of simple sentences worse.",
        "Hornstein, on the other hand, did not allow enough variation in the meanings of the simple tense structures.",
        "As a result, many of his possible STSs had equivalent meanings, and there was no way to prefer one over the other.",
        "This was exacerbated by the fact that he used non-semantic constraints on adjunction, reducing the amount of constraint that the acceptability data on adjunctions could provide for the assignment of STSs to tenses.",
        "This paper takes an intermediate position.",
        "Comma is interpreted as simultaneity in the unmodified case, but can be interpreted as precedence in appropriate environments.",
        "Since the constraints on adjunction are semantically based, the interpretations of adjunct constructions provide evidence for the assignments of STSs to tenses that we use."
      ]
    },
    {
      "heading": "5.2 Semantics of Combined Tense Structures",
      "text": [
        "In addition to allowing semantics to uniquely determine the assignment of STSs to tenses, our default-based interpretation of comma explains a problem acknowledged in Hornstein (1990).",
        "If comma is interpreted as strict simultaneity, as Hornstein initially proposes, then the structure in (10c) must be interpreted as Ernst = R= Eau.",
        "However, as noted above, neither sentence (10a) nor sentence (10b) has this interpretation.",
        "Hornstein alludes to a different form of reinterpretation",
        "of ER to account for examples like (10).",
        "However, his mechanism for the interpretation of Emat Eadj ordering in CTSs is unrelated to his semantics for STSs or his constraints on their combination.",
        "Our explanation, by contrast, uses the same mechanism, the default-based semantics of comma, in every portion of the theory.",
        "Reinterpretation of comma in the SR relation accounts for the compatibility of the present tense with future adverbs and future matrix clauses.",
        "Reinterpretation of comma in ER relations accounts for the flexible interpretation of sentences like those in (10)."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "This paper describes two contributions to the theory of temporal/causal adjunction beyond those of Yip (1986), Brent (1989), and Hornstein (1990).",
        "First, we propose the asymmetric, default-based interpretation of comma described in (4).",
        "This leads to a uniform, semantically based theory explaining the assignments of STSs to tenses shown in Table 2, the incompatibility of many tense pairs in causal/temporal adjunction, and the interpretations of combined tense structures in a variety of situations.",
        "In particular, the default based interpretation of comma has benefits both in the interpretation of SR relations (adverbs and clausal adjuncts) and ER relations (event order in CTSs).",
        "Few of the theoretical observations or hypotheses presented in this paper constitute radical departures from previous assaults on the same problem.",
        "Rather, this paper has worked out inconsistencies and redundancies in earlier attempts.",
        "Besides theoretical work, we presented a computer implementation and showed that it can be used to do structural disambiguation of a certain class of sentences.",
        "Although our contribution to syntactic disambiguation only solves a small part of that huge problem, we expect that a series of constrained syntactic/semantic theories of the kind proposed hear will yield significant progress.",
        "Finally, the adjustments we have suggested to the interpretation of comma in both simple tense structures and combined tense structures should contribute to the work of the many researchers using Reichenbachian representations.",
        "In particular, constrained combination of tense structures ought to provide a richer set of representations on which to expand model-theoretic approaches to interpretation."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "Thanks to Bob Berwick and Norbert Hornstein for their detailed readings and invaluable comments on many versions of this work."
      ]
    }
  ]
}
