{
  "info": {
    "authors": [
      "Ikuo Kudo"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C90-3083",
    "title": "Local Cohesive Knowledge for a Dialogue-Machine Translation System",
    "url": "https://aclweb.org/anthology/C90-3083",
    "year": 1990
  },
  "references": [
    "acl-C86-1024"
  ],
  "sections": [
    {
      "text": [
        "Abstract In a natural dialogue, there are many disturbances in the context level because of interruptions and inserted sentences.",
        "In spite of such phenomena, cohesion is a very important idea for understanding the context correctly.",
        "In our approach, cohesive knowledge which judges cohesion between sentences is given to the system and then the knowledge is used to find cohesion in disarranged context.",
        "It is also applied to interpret anaphora, ellipsis and pro-forms in the context.",
        "In order to do so, we define the knowledge and use its definition to abstract .knowledge from a linguistics database almost automatically."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "When we build a machine translation system for dialogues, we must face a lot of contextual-phenomena such as ellipses, anaphoras and pro-forms.",
        "In a dialogue these phenomena are more complicated because of many disturbances such as interruptions, inserted sentences and utterance disorder.",
        "The phenomena have not been treated on the computer though these phenomena influence the context-dependent problems such as ellipses, anaphoras, pro-forms and referent-transfers.",
        "In this paper, we propose a context processing mechanism which fits for the disarranged phenomena, and describe the linguistic knowledge, called \"local cohesive knowledge\", which is a constraint for grasping the contextual relationship.",
        "In Section 2 we will give examples which are dependent on the context and then describe the cause of difficulty in processing them.",
        "In Section 3 we propose \"local cohesive knowledge\" and apply the mechanism in a dialogue-machine translation system in Section 4."
      ]
    },
    {
      "heading": "2. Contextual Robustness in Dialogues",
      "text": [
        "Context-dependent problems such as ellipses, anaphoras, pro-forms and referent-transfers, present complications as shown in Figure 1.",
        "(1) Anaphora: the previous utterance is the same, however, \"it\" points to the different terms, \"the registration fee\" in Example (1) and \"the conference\" in Example (2).",
        "Therefore context is complicated.",
        "In Example 1, the sequences of questions are disordered.",
        "In Example 2, the answer is a negation for the sentence, \"I would like ...\".",
        "(2) Ellipsis: in Example 3, there is an ellipsis in a Japanese sentence, (2) \"motte inai no desu ga.\" The Example 1 : sentence disorder (1) I low much is the rekist colon fee?",
        "1 would life to attend the conference.",
        "(2) It's 200$.",
        "Example 2 : sentential negation (I) I would like to attend the con ference.flow much is the registration fee?",
        "(2) I'm sorry.",
        "It closed.",
        "Example 3 : (in Japanese) (I) kurejitto huado (credit card) no (of) namae (name) a (OBJ) oshiete kudasai (Could you tell).",
        "= Could you tell me the name of your credit card ?)",
        "(2) sumimasen (I'm sorry).",
        "motto (have) inai (nob) no desu go (Copula) .",
        "I'm sorry.",
        "I don't have a credit card.]",
        "Example 4: (in Japanese) (1) tourokuryou (registration fee) wa (topic) en (yen) de (by) shiharatte yoroshii des:hou ka (can I pay).",
        "= Can I pay the registration fee in yen?]",
        "(2) doru (U.S. dollars) de (in) 0 Ile g(I is hi music (pro-form = We would like you to pay).",
        "ellipsis depends on the context and means 'credit card'; it is both a focus and an object (OBJ).",
        "(3) Pro-form: in Example 4 (2), \"onegaishimasu\" is a pro-form and means 'We would like you to pay' in Japanese.",
        "The meaning is dependent on the context.",
        "We call processing the disarranged phenomena \"contextual robustnessfl\".",
        "In order to process such phenomena, it is necessary to understand cohesion in a context correctly.",
        "3.",
        "Local cohesive knowledge",
        "We define cohesion in the view of computational linguistics.",
        "Here cohesion regulates whether two sentences are connected or not.",
        "However it does not regulate a relationship between two sentences.",
        "That is, cohesion is a constraint for two sentences.",
        "[ The definition of \"local cohesive knowledge\" In our approach, \"cohesion\" is grasped in a context with \"local cohesive knowledge\".",
        "It includes not only the constraints for \"local cohesionr2\" but also its results such as interpretations of ellipses, anaphoras, pro-forms and referent-transfers.",
        "Therefore if constraints arc satisfied, the interpretations are obtained.",
        "Therefore \"local cohesive knowledge\" has two parts, \"constraints for cohesion\" and \"inter-pretations\", as follows.",
        "(Constraints for local cohesion) > (interpretation) 11.",
        "Ordinarily, robustness means an ungrammatically sentence, However \"contextual robustness\" is used for the discourse level.",
        "t2.",
        "We treat the contextual phenomena which occur locally, thus we use the term, \"local cohesion\".",
        "The constraints are described as follows.",
        "verb).",
        "< X1,Y1,Z1.",
        ",verb2 < X2,Y2,Z2 In the \"verb].",
        "< Xl.,Y1,Z1>\", \"X1\", \"Yl\" and \"Z1\" means the case elements of \"verb).\"; subjective (SUBJ) objective (OBJ) and second objective (OBJ2) cases.",
        "If two sentences are satisfied with these constraints, they are called \"local cohesion\" here.",
        "As shown in Figure 2, there are 18 types, determined by three constraints for verbs and six constraints for nouns.",
        "Type I: the same verbs and the same nouns .",
        "For example, \"Could you send me a paper?\" \" I sent you the paper yesterday.\" Both of the verbs in the question sentence and the answer sentence are the same words, \"send\".",
        "Also, its object is the same word, \"paper\".",
        "This constraint is described as follows.",
        "send< Xl,paper, Z1> , send< X2,paper,Z2 > This constraint means that if two sentences include \"send\" and its object, \"paper\", the sentences are cohesive.",
        "Therefore the following sentences are cohesive because they satisfy the same constraint.",
        "problems such as anaphoras, ellipses, pro-forms and referent-transfers.",
        "Local cohesive knowledge has interpretation.",
        "If the constraints are satisfied, its interpretation is obtained.",
        "Examples are shown in Figure3 (b) and (c).",
        "(b) Interpretation of an anaphora: for example, \"Could you send me a paper?\" \" I will send it to you.",
        "\" (c) Interpretation of an ellipsis: for example,",
        "\"Could you send me a paper?\" \" I will send ✓ to you.\" ; v means an ellipsis.",
        "In Japanese dialogues, such an ellipsis is found often.)",
        "4.",
        "Context processing with local cohesive knowledge",
        "I will now explain the mechanism which is useful for \"contextual robustness\", and interpret contextual phenomena such as anaphoras, ellipses and pro-forms.",
        "A flow of the system is shown in Figure 4.",
        "Inputted sentences are analyzed with grammar rules and lexicons, based on Lexical-functional Grammar (LFG) (1), and then intermediate representations ( F-structures of LFG ) are obtained.",
        "An intermediate representation is converted into its skeleton, because it has too much information to process for a context, in Figure 5.",
        "It is used to unify with \"local cohesive knowledge\" in the context processing.",
        "The algorithm of the context processing mechanism is as follows.",
        "(1) Make a pair of skeletons: to check the local cohesion, bring the skeletons of the previous utterance and make a pair of skeletons.",
        "(2) Check the local cohesion: look up the table of \"local cohesive knowledge\" as a key of the pair of skeletons.",
        "If the pair satisfies the constraints of \"local cohesive knowledge\", the pair is cohesive and then the",
        "interpretations of ellipses, anaphoras, pro-forms and referent-transfers are obtained with \"local cohesive knowledge\".",
        "5.",
        "The experiment When we built the system, one of the most important problems was how to produce the knowledge.",
        "We defined the local cohesive knowledge and used its definition to extract knowledge from a linguistics database almost automatically.",
        "We have a linguistic database which includes 60 keyboard dialogues.",
        "The dialogues include 70,000 words in total and the number of different words is more than 3000.",
        "These dialogues are analyzed and managed by a linguistic database (2).",
        "We extracted local cohesive knowledge from 60 dialogues which include 350 verbs and 1000 nouns.",
        "First we made a table which includes each verb and its noun.",
        "Then we extracted constraints of local cohesive knowledge to make the pair' from the table.",
        "Constraint pattern (a), as shown in Figure 3, was obtained automatically from the data and patterns (b) and (c) were generated from pattern (a).",
        "We obtained 24531 assertions of \"local cohesive knowledge\" for types 1, 2 and 3, and 651 assertions of \"local cohesive knowledge\" for types 7, 8 and 9, We have learned that local cohesive knowledge is very sparse.",
        "Therefore the volume of \"local cohesive knowledge\" is not a problem.",
        "• We have implemented the framework as a module of a",
        "lb) tell <X1, another )credit card), Z1 >, have< X2, it> , = > 'it' a 'credit card', 10 tell< X1 , number loredit.card),1.1>, have <X2, 0 >, > 0 'credit card'.",
        "context process in a dialogue machine-translation system.",
        "The system is built on a LEG-based machine-translation system (3).",
        "It has 200 grammar rules and more than 3000 words.",
        "It transfers Japanese sentences into English ones.",
        "It was implemented in Quintus Prolog on a SUN-4 system and its program size was 3.4MB.",
        "An example is shown in Figure 5.",
        "(1) kurejitto kaado (credit card) no (of) namae (name) o (0)3J) oshiete kudasai (Could you tell).",
        "=-/ Could you tell me the name of credit card?]",
        "(2) motte (have) inai (not) no desu ga (copula).",
        "[ I don't have a credit card.",
        "In the sentence (2) there is an ellipsis.",
        "It means \"kurejitto kaado (credit card)\".",
        "It points to the modifier in the previous sentence, \"kurejitto kaado no namae ( name of credit card)”.",
        "In this approach, as a results of analysis, the skeletons of two sentences are obtained as shown in Figure 5.",
        "The pair of skeletons are satisfied with the local cohesive knowledge (c) in Figure 5.",
        "Then the ellipsis is obtained as a 'credit card'."
      ]
    },
    {
      "heading": "6. CONCLUSIONS",
      "text": [
        "To build a \"contextual robustness” system, we proposed a context-processing mechanism which analyzed the context with \"local cohesive knowledge\".",
        "In order to apply the model into a machine-translation system, the knowledge needs to be produced effectively.",
        "Therefore we defined 18 types of \"local cohesive knowledge\" and used this definition to abstract knowledge from a linguistics database almost automatically.",
        "Some of the 18 types were implemented on a machine translation system.",
        "The other types were not generated, because they includes synonyms.",
        "In the future, we will construct them with a thesaurus and also extend the context processing algorithm to process more complicated phenomena such as parallel phrases."
      ]
    },
    {
      "heading": "ACKNOWLEDGEMENTS",
      "text": [
        "The author would like to thank Akira Kurematsu, president of Alit and 11 itoshi }Ida for their constant encouragement,.",
        "Also thanks 'I'suyoshi Morimoto, Kentarou Ogura, Kazuo Hashimoto, Naomi Inoue: and Naoko Shinozalci for ATR Linguistics Database."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
