{
  "info": {
    "authors": [
      "Didier Bronisz",
      "Thomas Grossi",
      "Francois Jean-Marie"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C90-1006",
    "title": "Advice-Giving Dialogue\" An Integrated System",
    "url": "https://aclweb.org/anthology/C90-1006",
    "year": 1990
  },
  "references": [
    "acl-E87-1031",
    "acl-E89-1021"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper we present the implementation of an advice-giving system for financial investment for the final phase of the project ESTEAM-3161.",
        "This system integrates multiple agents in a single architecture allowing cooperation between a natural language dialoguer, \"intelligent\" data base access modules, and a problem solver in the financial domain.",
        "Using a user model, this system adapts the mixed initiative dialogue during both the formulation of the problem and its resolution by the expert.",
        "A novice user thus has access to expert knowledge despite the weakness of his own knowledge."
      ]
    },
    {
      "heading": "1 The Demonstrator",
      "text": [
        "In its final phase, the project was oriented towards the development of a demonstration prototype, incorporating various ESTEAM-316 research results and showing the feasibility of an AGES.",
        "The Cooperation Architecture is a conceptual framework for AGES design and a set of mechanisms to support implementation of that design.",
        "It is a cooperation architecture because it supports the active cooperation of independent components or modules of the AGES; it is thus the means for integration.",
        "Furthermore, it supports the integration of heterogeneous modules through encapsulation of modules as agents, and by providing module–module cooperation using any of three standard interaction models.",
        "Our dialogue module integrates various subsystems, for example, a natural-language and intention recognition module, an expression generation module and a dialogue planning and management module.",
        "Great advances have been made in each of these domains but at present we are dealing only with the tip of the iceberg.",
        "In the project ESTEAM-316 we chose not to address specific issues such as explanation in great detail (there are many researchers already addressing these problems), but to build a general integrated system aimed at recognizing the user's intentions and answering him in an 'This work was supported in part by the Commission of the European Communities as ESPRIT project 316 (ESTEAM316).",
        "understandable way with expert knowledge.",
        "We will show how this system is able to incorporate modules which are more specialized in certain domains (problem solver or cooperative data base access)."
      ]
    },
    {
      "heading": "2 The Agents",
      "text": []
    },
    {
      "heading": "The cooperation architecture",
      "text": [
        "To provide a design method and to support the efficient implementation of AGES, we have built a special architecture.",
        "The architecture aims to keep separate the design and implementation of internal Agent features from external features handling cooperative interaction.",
        "The architectural approach to communication allows Agents to share tasks by problem decomposition and to share knowledge by using special Agents for Data and Knowledge Base Management.",
        "The main problems tackled in defining the architecture concern:",
        "• support for the integration of heterogeneous Agents; • control mechanisms for managing the interactions between Agents solving subproblems; • efficient communication between Agents which share or exchange information."
      ]
    },
    {
      "heading": "The Problem Solver",
      "text": [
        "The Problem Solver citehanet incorporates the results of two major research efforts: logic-based modeling and encoding, and explanation generation based on proof trees.",
        "The Problem Solver is the module which solves the user's problem(s) in a financial domain and provides proof trees that the Dialogue Manager can use to generate explanations.",
        "This Problem Solver module is based upon a knowledge representation formalism which integrates and object-oriented approach and logic, and is implemented in Prolog [1,4"
      ]
    },
    {
      "heading": "The Cooperative Answering Module",
      "text": [
        "In the context of traditional applications devoted to company management, like payroll computation, people or programs who have to access data in a",
        "Database have a very precise definition of the data they want to access.",
        "There are many other applications where people want to access data in order to make a decision, or to solve a problem whose solution cannot be found applying a simple algorithm.",
        "An important feature of this context, from the point of view of data retrieval, is that users don't have a precise idea of the data which can help them to solve a problem, or to make a decision.",
        "The objective of the Cooperative Answering module is to simulate the behavior of a person who wants to help as much as possible an interlocutor who asks them a question.",
        "That is, to try to understand why this interlocutor asks this question, and to determine what additional interesting information, not explicitly requested, could be provided in addition to the answer[3]."
      ]
    },
    {
      "heading": "the Dialogue Manager",
      "text": [
        "In the final integrated AGES demonstrator, the main problems are controlling the cooperative functioning of several distinct sources of knowledge, finding ways of representing and reasoning about diverse matters, and integrating the different contributions to perform intelligently a single task, namely advice-giving.",
        "The role of the Dialogue Manager is to provide a \"friendly\", comprehensible user interface that makes available to the user all the expertise of the various modules of the system in a flexible, uniform fashion [4,6,7].",
        "We present in the next section a simple scenario in order to provide its functionalities."
      ]
    },
    {
      "heading": "3 A sample dialogue",
      "text": [
        "Let us consider the following session.",
        "1 System : Hello, tell me about your investment plan.",
        "2 User : I'd like to buy a car in two years.",
        "3 System : Ok. An investment plan comprises three subparts: an emergency fund, a fixed-term investment and a long-term investment.",
        "How much do you want to invest?",
        "4 User : $20,000.",
        "5 System : Let's begin with the emergency fund.",
        "How much do you want to put into an emergency fund?",
        "6 User : Let's talk about my car first.",
        "7 System : Ok. How much money do you want to put into the fixed-term investment?",
        "8 User Oh, let's say $7,500.",
        "9 System : I recommend that you put the money into a liquid security.",
        "Would you like me to propose one?",
        "10 User : Yes.",
        "11 System : Put your money into a 4.5 % savings account at Sofibanque.",
        "Let's return to the emergency fund, now.",
        "How much do you want to put in it?",
        "12 User : $5,000.",
        "13 System: Tell me also the delay.",
        "with an emergency fund of $5,000 and a fixed-term investment of $7,500, it only leaves $7,500 for a long term investment.",
        "If you want to put $10,000, then you should modify something else in your plan.",
        "$20,000, with $2,500 in an emergency fund with a delay of 2 days, $7,500 in a fixed-term investment to buy a car in two years, and $10,000 in an long-term investment.",
        "Is that right?",
        "32 User : That's fine 33 System: Ok.",
        "Goodbye!",
        "!"
      ]
    },
    {
      "heading": "Analysis",
      "text": [
        "From this dialogue, we can easily demonstrate the different points we mentioned above.",
        "• In sentence 6 the user prefers to begin the discussion with the fixed-term investment, while the system began the discussion with the emergency fund.",
        "The system changes the order of the different topics according to the will of the user and the feasibility of such an exchange.",
        "o In sentence 12, the user does not say \"The amount of the emergency fund is $5000\" but only \"$5000\".",
        "The system must understand such an elliptical response.",
        "In the same way, the system does not ask \"Tell me the delay of the emergency fund of your Investment plan?\" but only \"Tell me the delay?\".",
        "Normally, the two participants hide a lot of information.",
        "They just give sufficient information to have an unambiguous dialogue.",
        "But having a partial knowledge necessitates being able to confirm sometimes what has been understood.",
        "In sentence 7, the system asks the user for a confirmation of the value of the fixed-term investment (2 years) which was previously given by him in the sentence 2.",
        "The system has understood that buying a car is equivalent to having a fixed-term investment, but it asks him to verify this supposition.",
        "o In sentence 24 the user begins a digression in order to have an explanation about a new term introduced by the system in asking for a value.",
        "The system has to recognize this new user's intention, cope with (it may be longer than a two-turn dialogue (User, system) as in the discussion of a given solution) and come back to the previous dialogue.",
        "o In sentence 10 the user accepts the system's offer to come up with a detailed investment plan, while in sentence 16 he decides to find out about other possibilities."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "The integrated system elaborated in the project ESTEAM-316 is a demonstrator incorporating as much of the technology developed within Esteam as possible.",
        "This experience comes from research in the areas of Knowledge Representation, Cooperative Answering, Intentional Answering, Deductive Databases and Mixed-Initiative interfaces (also see the deliverables and the prototypes issuing from the project).",
        "The imitation of human behavior in the domain of the advice-giving remains very delicate and elaborate but we believe we have made a significant contribution."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We want to thank our partners within Esteam-316: CSELT in Torino, CERT in Toulouse and Philips in Brussels."
      ]
    }
  ]
}
