{
  "info": {
    "authors": [
      "Norman Badler",
      "Mark Steedman",
      "Bonnie Lynn Webber"
    ],
    "book": "International Workshop on Natural Language Generation",
    "id": "acl-W90-0125",
    "title": "Narrated Animation: A Case for Generation",
    "url": "https://aclweb.org/anthology/W90-0125",
    "year": 1990
  },
  "references": [
    "acl-C90-2068",
    "acl-H89-2055"
  ],
  "sections": [
    {
      "heading": "1 Introduction",
      "text": [
        "Our project rests on the belief that computer animation in the form of narrated animated simulations can provide an engaging, effective and flexible medium for instructing agents of varying capabilities to perform tasks that make varying demands in workplaces of varying layout.",
        "To this end, we have been designing and implementing an integrated system which combines",
        "• animated agents which can demonstrate the behavior to be emulated; • automatic generation of appropriate Natural Language narration which can explain what is being done and why.",
        "To date, our primary concern with Natural Language has been as input to the system, in line with the strong claim we make in [I] that moving task animation beyond direct graphical manipulation forces one to Natural Language as the only instruction source accessible to other users than the current community of manually skilled (or programming-wise) animators.",
        "(To this end, we have been analysing constructions commonly found in NL instructions, in terms of their representational requirements [3].",
        "However here our point of discussion is NL Generation.",
        "What makes us such eager consumers of advances and technology in this area is that animated simulations without narration (ultimately, spoken narration) is only half the story.",
        "As researchers studying plan inference have shown [2], it may be well-nigh impossible to infer an agent's intentions simply by observing his or her actions alone.' And we know that the ability to perform an action effectively in a range of environments requires understanding its intention, not just the physical motions used in some performance.",
        "Thus, communicating intentions is as important to effective task instruction as demonstrating physical skills.",
        "Sharing the burden of communication between Natural Language and graphics, as Feiner and McKeown have noted [4], takes advantage of the best of both possible worlds.",
        "While some parts of our system are further along than others, no work at all has yet been done on generation.",
        "However, we have tried to take account of the needs of generation in designing the system, so that we will not have painted ourselves in a hole from the start.",
        "We clearly and hope to get further ideas and direction from this meeting.",
        "Basically, the system has been designed so that the generator will receive information from three sources (see Figure 1.",
        "):",
        "• the partial global plan (an incrementally computed description of what the animated agent is meant to do and why); • the basic animation commands (for particulars of what's happening \"now\") • the visualization plan (for what can the viewer see).",
        "The resulting narrative is thus meant to satisfy the joint communicative goals of providing an overall context in which to view the events on the \"screen\" and explaining the reasons for particular events that are happening, thereby transcending the merely visible portion of any event, to augment and reinforce observable behavior.",
        "For a more detailed description of the system and further discussion of instructions and task performance, the reader is referred to [1]."
      ]
    }
  ]
}
