{
  "info": {
    "authors": [
      "Stuart C. Shapiro"
    ],
    "book": "Theoretical Issues in Natural Language Processing",
    "id": "acl-T78-1031",
    "title": "Path-Based and Node-Based Inference in Semantic Networks",
    "url": "https://aclweb.org/anthology/T78-1031",
    "year": 1978
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Two styles of performing inference in semantic networks are presented and compared.",
        "Path-based inference allows an arc or a path of arcs between two given nodes to be inferred from the existence of another specified path between the same two nodes.",
        "Path-based inference rules may be written using a binary relational calculus notation.",
        "Node-based inference allows a structure of nodes to be inferred from the existence of an instance of a pattern of node structures.",
        "Node-based inference rules can be constructed in a semantic network using a variant of a predicate calculus notation.",
        "Path-based inference is more efficient, while node-based inference is more general.",
        "A method is described of combining the two styles in a single system in order to take advantage of the strengths of each.",
        "Applications of path-based inference rules to the representation of the extensional equivalence of intensional concepts, and to the explication of inheritance in hierarchies are sketched."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Semantic networks have developed since the mid sixties [10;11] as a formalism for the representation of knowledge.",
        "Methods have also been developing for performing deductive inference on the knowledge represented in the network.",
        "In this paper, we will compare two styles of inference that are used in semantic networks, path-based inference and node-based inference.",
        "In sections 2 and 3, these terms will be explained and references to systems that use them will be provided.",
        "In sections 4 and 5, the advantages and disadvantages of each will be discussed.",
        "Sections 6, 7 and 8 will show how they can be used to complement each other in a single semantic network system, how path-based inference can help represent the extensional equivalence of intensional concepts, and how a formalism for writing path-based inference rules can be used to explicate the notion of \"inheritance\" in a semantic network."
      ]
    },
    {
      "heading": "2. Path-Based Inference",
      "text": [
        "Let us refer to a relation (perforce binary) that is represented by an arc in a network as an arc-relation.",
        "If R is an arc-relation, an arc labelled R from node a to node b represents that the relationship aRb holds.",
        "It may be that this arc is not present in the network, but aRb may be inferred from other information present in the network and one or more inference rules.",
        "If the other information in the network is a specified path of arcs from a to b, we will refer to the inference as path-based.",
        "The ways in which such paths may be specified will be developed as this paper proceeds.",
        "The two clearest examples of the general use of path-based inference are in SAMENLAQ II (18] and Protosynthex III (13].",
        "Both these systems use what might be called \"relational\" networks rather than \"semantic\" networks since arc-relations include conceptual relations as well as structural relations (see (14] for a discussion of the difference).",
        "For example, in Protosynthex III there is an arc labelled COMMANDED from the node representing Napoleon to the node representing the French army, and in SAMENLAQ II an arc labelled EAST.OF goes from the node for Albany to the node for Buffalo.",
        "Both systems use relational calculus expressions to form path-based inference rules.",
        "The following relational operators are employed (we here use a variant of the earlier notations):",
        "1.",
        "Relational Converse -- If R is a relation, RC is its converse.",
        "So, lix,y(xRCy yRx).",
        "2.",
        "Relational Composition -- If R and S are relations, R/S is R composed with S. So, Vx,y(xR/Sy <–> Ha(xRs 6 aSy)).",
        "3.",
        "Domain Restriction -- If R and S are relations, (S a)R is the relation R with its domain restricted to those objects that bear the relation S to a.",
        "So, Vx,y,z(x(S z)Ry <–> (xSa 6 xRy)).",
        "4.",
        "Range Restriction -- If R and S",
        "are relations, R(S a) is the relation R with its range restrict-to those objects that bear the relation S to a.",
        "So,"
      ]
    },
    {
      "heading": "5. Relational Intersection -- If R",
      "text": [
        "and S are relations, R6S is the intersection of R and S. So,",
        "In SAMENLAQ II, path-based inference rules are entered by using the relational operators to give alternate definitions of simple arc labels.",
        "For example (again in a variant notation):",
        "FATHER.OF 4 (GENDER MALE)PARENT.OF declares that a father is a male parent.",
        "SIR [11] is another relational network system that uses path-based inference.",
        "Although the original expressed inference rules in the form of general LISP functions, the reproduction in [16, Chap.",
        "7] uses the notion of path grammars.",
        "The relation operators listed above are augmented with R*, meaning zero or more occurrences of R composed with itself, R+, meaning one or more occurrences of R composed with itself, and RvS, meaning the union of R and S. The following relations are used: x EQUIV y x SUBSET y x MEMBER y x POSSESS y chies have been abused as well as used.",
        "In Section 8, we will propose a method authors can use to describe their hier-chies precisely."
      ]
    },
    {
      "heading": "3. Node-Based Inference",
      "text": [
        "Several semantic network systems incorporate methods of representing general rules in a semantic network version of predicate calculus.",
        "Among these systems are those of Shapiro [14;15;17], Kay [7], Hendrix [6], Schubert [12], and Fikes and Hendrix [3].",
        "Figure 2 shows such a network deduction rule representing yx[xEMAN -ay(yeWOMAN & xLOVESY)].",
        "Figure 3 shows a rule for",
        "The network formalism employed is that of Shapiro [15;17].",
        "These deduction rules employ pattern nodes (P1, P2, P3, P4, P5, P6, P7), each one of which represents a pattern of nodes that might occur in the network.",
        "We will therefore call this kind of inference rule a node-based inference rule.",
        "Pattern nodes are related to each other by rule nodes, each of which represent a propositional operator, or, equivalently, an inference mechanism.",
        "For example, R2 represents the rule that if an instance of P1 occurs in the network, an instance of R1 with the same substitution means x and y are the same individual means x is a subset of y means x is a member of the set y means x owns a member of the set y x POSSESS-BY-EACH y means every member of the set x owns a member of the set y.",
        "To determine if x POSSESS y, the network is searched using the following rule:",
        "The widest use of path-based inference is in ISA hierarchies.",
        "Fig.",
        "1 is based on probably the most famous ISA hierarchy, that of Collins and Quillian [2].",
        "The two important rules here are",
        "As McDermott [8] points out, ISA hierar",
        "for x may be deduced.",
        "Quantification is represented in this notation by an arc-relation between a rule node and the variable nodes bound in the rule.",
        "For example, x is bound by a universal quantifier in R2 and y is bound by an existential quantifier in Rl.",
        "To see how a node-based inference proceeds, consider the network of Figure 4 in conjunction with the rule of Figure 3, and say that we wish to decide if A SUPPORTS C. The network that would represent that A SUPPORTS C matches P7 with the variable binding [x/A, r/SUPPORTS, a/C].",
        "P4 in the binding [r/SUPPORTS] is matched against the network and is found to successfully match Ml.",
        "P5[x/A, r/SUPPORTS, y/y] and P6[y/y, r/SUPPORTS, z/C) are then both matched against the network and each succeeds with a consistent binding of y to B.",
        "The rule thus succeeds and A SUPPORTS C is deduced.",
        "(Details of the bindings and the match routine are given in [15].)",
        "It should be noted that set inclusion was represented by an arc (ISA) in Section 2, but set membership is being represented by a node (with a MEMBER, CLASS \"case frame\") in this section.",
        "The nodal representation is required by node-based inference rules and is consistent with the notion that everything that the network \"knows\", and every concept to which the network can refer is represented by a node.",
        "4.",
        "Advantages of Node-Based Inference The advantages of node-based inference stem from the generality of the syntax of node-based inference rules.",
        "Path-based rules are limited to binary relations, have a restricted quantification structure and require that an arc between two nodes be implied by a path between the same two nodes.",
        "Rule R2 of Figure 2 could not be written as a path-based rule, and, although the transitivity of SUPPORTS could be expressed by a path-based rule (SUPPORTS •- SUPPORTS+), the \"second order\" rule R4 of Figure 3 could not.",
        "Let us briefly consider how rule R4 is constructed, whether it really is or is not a second order rule, and why it could not be expressed as a path-based rule.",
        "Rule R4 supplies a rule for use with transitive relations.",
        "In order to assert that a relation is transitive (e.g. assertion node M1 of Figure 4), the relation must be represented as a node, rather than as an arc.",
        "This also allows quantification over such relations, since in all node-based inference rule formalisms variables may only be substituted for nodes, not for arcs.",
        "Since the relation is a node, another node must be used to show the relationship of the relation to its arguments (e.g. nodes M2 and M3 in Figure 4).",
        "Thus, R4 is really a first order rule derived from the second order rule yr[rcTRANSITIVE yx,y,z(xry £ yra xrz)] by reducing r to an individual variable and introducing a higher order relation, AVO, whose second argument is a conceptual relation and whose other arguments are conceptual individuals.",
        "So R4 is more accurately seen as the first order rule VrIreTRANSITIVE Vx,y,z(AVO(x,r,y) AVO(y,r,z) AVO(x,r,a))].",
        "In this view, the predicates of semantic networks are not the nodes representing conceptual relations, but the different case frames.",
        "Rule R4 cannot be represented as a path-based rule because it is a rule about the relation AVO, and AVO is a trinary, rather than a binary relation.",
        "Although some node-based inference rules cannot be expressed by path-based inference rules, it is easy to see that any path-based inference rule can be expressed by a node-based inference rule, as long as we are willing to replace some arc-relations by nodes and higher order predicates.",
        "5.",
        "Advantages of Path-Based Inference The major advantage of path-based inference is efficiency.",
        "Carrying out a path-based inference involves merely checking that a specified path exists in the network between two given nodes (plus,",
        "perhaps, some side paths to specified nodes required by domain and range restrictions).",
        "This is a well understood and relatively efficient operation, especially compared to the backtracking, intersection, or unification operations required to check the consistency of variable substitutions in node-based inference rules.",
        "Moreover, path following seems to many people to be what semantic networks were originally designed for.",
        "The major search algorithm of Quillian's Semantic Memory is a bidirectional search for a path connecting two nodes [10, p. 249).",
        "Also, the ability to do path tracing is a motivation underlying ISA hierarchies, and is why the Collins and Quillian results [2] gained such attention.",
        "These efficiencies are lost by replacing path-based inference rules by node-based inference rules."
      ]
    },
    {
      "heading": "6. Combining Path-Based and Node-Based Inference",
      "text": [
        "We begin the task of unifying path-based and node-based inferences by noting the formal equivalence between an arc-relation and a two case case frame.",
        "Figure 5 illustrates this using ISA vs. SUB-SUP.",
        "Figure 5a shows the use of the ISA arc-relation to represent that canaries are birds.",
        "Figure 5b represents the same relationship by a SUB-SUP case frame, and has the advantage that the relationship is represented by a node, M4.",
        "Figure 5c is a redrawing of 5b, using the arc label SUB-to represent the relation SUBC.",
        "(It is generally understood in semantic network formalisms that whenever an arc representing a relation R goes from some node n to some node m, there is also an arc representing RC going from m to n).",
        "Figure 5c clarifies the notion that we may think of an indtance of a two case case frame (such as M4) as both an arc and a node if we are willing to recalibrate the measurement of time it takes to follow one arc-relation to be the time it takes to follow two arcs.",
        "We can replace all instances of ISA in the path-based inference rules of Section 2 by the composition SUB-/SUP and still have valid rules except that we now have paths on the left of the \"4-\" symbol.",
        "Let us, therefore, extend our syntax of path-based inference rules to allow a path of arc compositions on the left of the \"+\" symbol.",
        "The rule ISA 4 ISA* states that whenever there is a path of ISA arcs from node n to mode m, we can infer a \"virtual\" ISA arc directly from n to m which we may, if we wish, actually add to the network.",
        "Similarly, let the rule SUB-/SUP 4 (SUB-/SUP)* state that whenever a path of alternating SUB and SUP arcs goes from node n to node m, we can infer a \"virtual\" node with SUB to n and SUP to m which we may, if we wish, actually add to the network.",
        "We now have a formalism for specifying path-based inference rules in a network formalism that represents binary conceptual relations by two case case frames.",
        "This would allow, for example, for a more unified representation in the SNIFFER system (3), in which node-based inference rules are implemented and built-in path based inference rules are used for set membership and set inclusion, both of which are represented only by arc-relations.",
        "The formalism presented here would allow set membership and set inclusion assertions to be represented by nodes, permitting other assertions to reference them, without giving up the efficiency of built-in routines to implement the set inclusion hierarchies.",
        "We desire, however, a more general unification of path-based and node-based inferences.",
        "There are two basic routines used to implement node-based inferences (although specific implementations may differ).",
        "One is the match routine that is given a pattern node and finds instances of it in the network, and the other is the routine that interprets the quantifiers and connectives to carry out the actual deduction.",
        "The match routine can be enhanced to make use of path-based inference rules.",
        "Consider a typical match routine used in the deduction in Section 3 of A SUPPORTS C from the network of Figure 4 and the rule of Figure 3, and let us introduce the notation that if P is a path of arcs and n is a node, P[n] represents the set of nodes found by following the path P from the node n. In the example, the match routine was given the pattern P4 to match in the binding [r/SUPPORTS].",
        "It was able to find M1 by intersecting CLASSC[TRANSITIVE) with MEMBERC[SUPPORTS].",
        "Now, let us suppose that the path-based inference rule CLASS 4 CLASS/(SUB-/SUP)* has been declared in such a way that the match routine could use it.",
        "The match routine would intersect MEMBER [SUPPORTS] with (CLASS/(SUB-/SUP)*)CITRANSITIVEI and be able to find a virtual node asserting that SUPPORTS is TRANSITIVE even if a long chain of set inclusions separated them.",
        "The proposal, therefore, is this: any arc-relation in a semantic network may be defined in terms of a path-based inference rule which the match routine is capable of using when finding instances of pattern",
        "nodes.",
        "This completes the general unification of path-based and node-based inference we desired.",
        "Since path-based inference is embedded in the match routine, while node-based inference requires the quantifier and connective interpreter, the difference is reminiscent of the difference between subconscious inference and conscious reasoning.",
        "7.",
        "Application to Extensional Equivalence of Intensional Concepts A basic assumption of semantic networks is that each concept is represented by a single node and that all information about a concept is reachable from its node.",
        "Yet, since Woods' discussion [20], most semantic network authors have agreed that a node represents an intensional, rather than an extensional concept.",
        "How should we handle the information that two different intensional concepts are extensionally equivalent?",
        "Let us illustrate this by a story (entirely fictional).",
        "For the last year we have heard of a renowned surgeon in town, Dr. Smith, known for his brilliance and dexterity, who saved the life of the famous actress Maureen Gelt by a difficult heart transplant operation.",
        "Meanwhile, at several social gatherings, we have met someone by the name of John Smith, about five feet, six inches tall, black hair and beard, generally disheveled and clumsy.",
        "We now discover, much to our amazement that John Smith and Dr. Smith are one and the same!",
        "In our semantic network, we have one node for Dr. Smith connected to his attributes, and another for John Smith connected to his attributes.",
        "What are we to do?",
        "Although we now know that John Smith saved the life of Maureen Gelt and that Dr. Smith has black hair, surely we cannot retrieve that information as fast as that Dr. Smith is a surgeon and that John Smith is 5'6\" tall.",
        "If we were to combine the two nodes by taking all the arcs from one node, tying them to the other and throwing away the first, we would lose this distinction.",
        "We must introduce an assertion, say an EQUIV-EQUIV case frame, that represents the fact that Dr. Smith and John Smith, different intensional concepts, are extensionally the same.1 How are we to use this assertion?",
        "Ignoring for the moment referentially opaque contexts (\"We didn't know that John Smith was Dr.",
        "Smith.",
        "\"), how can we express the rule that if n EQUIV-/EQUIV m. than anything true of n is true of m?",
        "Our node based inference rules cannot express this rule because expressing \"anything true of n\" requires quantifying over those higher order case frame predicates such as",
        "use lambda abstraction as Schubert does [12).",
        "Each nary higher order predicate involving some node becomes a unary predicate by replacing that node by a lambda variable.",
        "Thus, \"Dr. Smith saved Maureen Gelt's life\" becomes an instance of the unary predicate X(x)[x saved Maureen Gelt's life) applied to Dr. Smith.",
        "Using a PRED-ARG case frame, it is easy to represent the rule",
        "The trouble with this solution is, how are we to retrieve this information as a fact about Maureen Gelt?",
        "Must we also store A(x)[Dr. Smith saved x's life] (Maureen Gelt)?",
        "This duplication is unsatisfying.",
        "An alternative is to include in the path-based inference rule defining each arc-relation the path (EQUIV-/EQUIV)*• For example, AGENT ' AGENTPEQUIV-/EQUIV)*, and CLASS CLASSMEQUIV-/EQUIV)*PSUB-/SUP)*)*• Although this solution requires more rules than the lambda abstraction solution, and the rules look complicated, it avoids the duplication of the same assertion in different forms and the postulation of conceptual predicates such as A(x)(x saved Maureen Gelt's life].",
        "Hays' cognitive networks [4;5] include a scheme similar to the one proposed here.",
        "Each assertion about Dr. Smith would refer to a different node, each with an MST (manifestation) arc to a common node.",
        "This node would represent the in tension of Dr. Smith, while the others represent Dr. Smith as surgeon, Dr. Smith as saviour of Maureen Gelt, etc.",
        "Presumably, when Hays' network learns of the identity of Dr. Smith with John Smith, a new node is introduced with MST arcs from both Dr. Smith and John Smith.",
        "Dr. Smith and John Smith are then seen as two manifestations of the newly integrated Dr. John Smith.",
        "Hays presumably uses an MST*/(MSTC)* path where we propose an (EQUIV-/EQUIV)* path.",
        "Blocking referentially opaque contexts seems to require introducing relational complement.",
        "For any path P and nodes x and y, let xPy hold just in case a path P from x to y does not exist in the network.",
        "We might block referentially opaque contexts by including the domain or range restriction (OBJ-/VERB/MEMBER-/CLASS OPAQUE) 8.",
        "Application to the Explication of Inheritance As was mentioned in Section 2, many 2Actually, Hays' networks have not yet been implemented, and I have been warned [R. Fritzson, personal communication] that the implementation may differ from what I have supposed.",
        "AVO in the arc definitions.",
        "semantic networks include inheritance (ISA) hierarchies.",
        "Often these are at best vague and at worst inconsistent.",
        "We propose that the inheritance properties of these hierarchies be clearly defined by path-based inference rules using the syntax we are presenting here or some other well defined syntax.",
        "We do not say that all systems should be able to input and interpret such rules, but only that authors use such rules to explain clearly to their readers how their hierarchies work.",
        "Before this proposal is feasible, we must be able to handle two more situations-The first is the exception principle, first expressed by Raphael [11, p.85] and succinctly stated by Winograd as, \"Any property true of a concept in the hierarchy is implicitly true of anything linked below it, unless explicitly contradicted at the lower level\" (19, p.197].",
        "To allow for this, let us introduce an exception operator.",
        "If P and Q are paths and x and y are nodes, let xP\\Qy hold just in case there is a path described by P from x to y and no path of equal or shorter length described by Q from x to y.",
        "To see that this suffices to handle the exception principle, consider the hierarchy of Figure 6, where, to make things more interesting, we have postulated a variety of flying penguins.",
        "We have also taken the liberty of explicitly representing that CAN-FLY and CAN-NOT-FLY are negations of each other.",
        "The rule for inheritance in this hierarchy is",
        "The other situation we must discuss is \"almost transitive\" relations such as SIBLING SIBLING is certainly symmetric, but it cannot be transitive since it is irreflexive.",
        "Yet your sibling's sibling is your sibling as long as he/she is not yourself.",
        "This is what we mean by \"almost transitive.\"",
        "Note that for any relation, R, R*6(R4) is the identity relation.",
        "Let us call it I.",
        "Then for any relation P, let PR be PC!.",
        "PR is the irreflexive restriction of P We can use this to define SIBLING as SIBLING ' (SIBLINGvSIBLINGC)*R. We suggest that the syntax for path-based inference rules is now complete enough to explicate the inheritance rules of various hierarchies.",
        "The complete syntax will be summarized in the next section 9.",
        "Summary We have presented and compared two styles of inference in semantic networks, path-based inference and node-based inference.",
        "The former is more efficient, while the latter is more general.",
        "We showed the equivalence of an arc-relation to a two case case frame, and described how path-based inference could be incorporated into the match routine of a node-based inference mechanism, thereby combining the strengths of the two inference styles.",
        "We discussed the use of equivalence paths to represent the extensional equivalence of intensional concepts.",
        "Finally, we urged authors of inheritance hierarchies to explicate their hierarchies by displaying the path-based inference rules that govern inheritance in them.",
        "We also presented a syntax for path-based inference rules which can be summarized as follows: 1.",
        "A path is either an arc-relation or a path as described in part 2 enclosed in parentheses.",
        "Parentheses may be omitted whenever an ambiguity does not result.",
        "2.",
        "If P and Q are paths and x, y, and z are nodes, paths may be formed as follows: a. Converse: if P is a path from x to y, PC is a path from y to x. b.",
        "Composition: if P is .a path from x to a and Q is a path from a to y, P/Q is a path from x to y.",
        "c. Composition zero or more times: If P composed with itself zero or more times describes a path from x to y, P* is a path from x to y. d. Composition one or more times: If P composed with itself one or more times is a path from x to y, is a path from x to y.",
        "e. Union: If P is a path from x to y or Q is a path from x to y, PvQ is a path from x to y. f. Intersection: If P is a path from x to y and Q is a path from x to y, P6Q is a path from x to y. g. Complement: from x to y,",
        "i.",
        "Exception: If P is a path from x to y and there is no path Q of length equal to or less than the length of P, P\\Q is a path from x to y. j. Domain restriction: If P is a",
        "If there is no path P P is a path from x to restriction: If P is x to y and x0y, PR is x to y.",
        "path from x to y and Q is a path from x to z, (Q z)P is a path from x to y.",
        "k. Range restriction: If P is a path from x to y and Q is a path from y to z, P(Q z) is a path from x to y.",
        "3.",
        "A path-based inference rule is of the",
        "form <defined path> .0- <defining path> where <defining path> is any path described by parts 1 or 2 above, and <defined path> is either a) a single arc-relation, or b) a composition of n arc relations for some fixed n, i.e. using only \"/\", not \"*\" or \"+\".",
        "The rule is interpreted to mean that if the <defining path> goes from some node x to some node y then: a) the arc that is the <defined path> is inferred to exist from x to y; b) the n arcs that are the <defined path> and n-1 new intermediate nodes are inferred to exist from x to y."
      ]
    }
  ]
}
