{
  "info": {
    "authors": [
      "Jeffrey Heinz",
      "Chetan Rawal",
      "Herbert G. Tanner"
    ],
    "book": "Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies",
    "id": "acl-P11-2011",
    "title": "Tier-based Strictly Local Constraints for Phonology",
    "url": "https://aclweb.org/anthology/P11-2011",
    "year": 2011
  },
  "references": [
    "acl-P97-1040"
  ],
  "sections": [
    {
      "text": [
        "Jeffrey Heinz, Chetan Rawal and Herbert G. Tanner",
        "Beginning with Goldsmith (1976), the phonological tier has a long history in phonological theory to describe non-local phenomena.",
        "This paper defines a class of formal languages, the Tier-based Strictly Local languages, which begin to describe such phenomena.",
        "Then this class is located within the Subregular Hierarchy (McNaughton and Papert, 1971).",
        "It is found that these languages contain the Strictly Local languages, are star-free, are incomparable with other known sub-star-free classes, and have other interesting properties."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The phonological tier is a level of representation where not all speech sounds are present.",
        "For example, the vowel tier of the Finnish word päivää 'Hello' is simply the vowels in order without the consonants: äiää.",
        "Tiers were originally introduced to describe tone systems in languages (Goldsmith, 1976), and subsequently many variants of the theory were proposed (Clements, 1976; Vergnaud, 1977; McCarthy, 1979; Poser, 1982; Prince, 1984; Mester, 1988; Odden, 1994; Archangeli and Pulleyblank, 1994; Clements and Hume, 1995).",
        "Although these theories differ in their details, they each adopt the premise that representational levels exist which exclude certain speech sounds.",
        "Computational work exists which incorporates and formalizes phonological tiers (Kornai, 1994; Bird, 1995; Eisner, 1997).",
        "There are also learning algorithms which employ them (Hayes and Wilson, 2008; Goldsmith and Riggle, to appear).",
        "However, there is no work of which the authors are aware that addresses the expressivity or properties of tier-based patterns in terms of formal language theory.",
        "This paper begins to fill this gap by denning Tier-Based Strictly Local (TSL) languages, which generalize the Strictly Local languages (McNaughton and Papert, 1971).",
        "It is shown that TSL languages are necessarily star-free, but are incomparable with other known sub-star-free classes, and that natural groups of languages within the class are string extension learnable (Heinz, 2010b; Kasprzik and Kotzing, 2010).",
        "Implications and open questions for learn-ability and Optimality Theory are also discussed.",
        "Section 2 reviews notation and key concepts.",
        "Section 3 reviews major subregular classes and their relationships.",
        "Section 4 defines the TSL languages, relates them to known subregular classes, and section 5 discusses the results.",
        "Section 6 concludes."
      ]
    },
    {
      "heading": "2. Preliminaries",
      "text": [
        "We assume familiarity with set notation.",
        "A finite alphabet is denoted E. Let Era, E^ra, E* denote all sequences over this alphabet of length n, of length less than or equal to n, and of any finite length, respectively.",
        "The empty string is denoted A and \\ w\\ denotes the length of word w. For all strings w and all nonempty strings u, \\w\\u denotes the number of occurrences of « in w. For instance, \\aaaa\\aa = 3.",
        "A language L is a subset of E*.",
        "The concatenation of two languages L1L2 = {uv :ueLi and v G L2}.",
        "For L Ç E* and a G E, we often write La instead oïL{a}.",
        "We define generalized regular expressions (GREs) recursively.",
        "GREs include A, 0 and each letter of E. If R and S are GREs then RS, R + S, R x S, R, and R* are also GREs.",
        "The language of a GRE is denned as follows.",
        "L(0) = 0.",
        "For all er G SU {A}, L(a) = {a}.",
        "If R and S* are regular expressions then L(RS) = L(R)L(S), L(R + S) = L{R) U L(S), and_ L{R x S) = L(R) n L(S).",
        "Also, L(R) = E* – L(E) and L(iT) = L(E)*.",
        "For example, the GRE 0 denotes the language E*.",
        "A language is regular iff there is a GRE defining it.",
        "A language is star-free iff there is a GRE defining it which contains no instances of the Kleene star (*).",
        "It is well known that the star-free languages (1) are a proper subset of the regular languages, (2) are closed under Boolean operations, and (3) have multiple characterizations, including logical and algebraic ones (McNaughton and Papert, 1971).",
        "String m is a factor of string w iff 3x, y G E* such that w = xuy.",
        "If also \\u\\ = k then u is a k-factor oîw.",
        "For example, ab is a 2-factor oïaaabbb.",
        "The function Fk maps words to the set of fc-factors within them.",
        "For example, F2(abc) = {ab, be}.",
        "The domain Fk is generalized to languages L ç E* in the usual way: Fk(L) = UweLFk(w).",
        "We also consider the function which counts fc-factors up to some threshold t.",
        "For example F2^{aaaaab) = {(aa, 3), (ab, 1)}.",
        "A string u = o\\02 • • • Cfc is a subsequence of a string «; iff w G XVi XV2X* • • • EVfcE*.",
        "Since |«| = kwc also say « is ak-subsequence oîw.",
        "For example, a& is a 2-subsequence of caccccccccbcc.",
        "By definition A is a subsequence of every string in E*.",
        "The function P<^ maps words to the set of subsequences up to length k found in those words.",
        "For example P<2(a6c) = {A, a, b, c, ab, ac, be}.",
        "As above, the domains of Fktt and P<k are extended to languages in the usual way."
      ]
    },
    {
      "heading": "3. Subregular Hierarchies",
      "text": [
        "Several important subregular classes of languages have been identified and their inclusion relationships have been established (McNaughton and Papert, 1971; Simon, 1975; Rogers and Pullum, to",
        "Figure 1 : Proper inclusion relationships among subregular language classes (indicated from left to right).",
        "This paper establishes the TSL class and its place in the figure.",
        "appear; Rogers et al., 2010).",
        "Figure 1 summarizes those earlier results as well as the ones made in this paper.",
        "This section defines the Strictly Local (SL), Locally Threshold Testable (LTT) and Piecewise Testable (PT) classes.",
        "The Locally Testable (LT) languages and the Strictly Piecewise (SP) languages are discussed by Rogers and Pullum (to appear) and Rogers et al.",
        "(2010), respectively.",
        "Readers are referred to these papers for additional details on all of these classes.",
        "The Tier-based Strictly Local (TSL) class is defined in Section 4.",
        "Definition 1 A language L is Strictly fc-Local iff there exists a finite set S Ç Fk ( x E* x ) such that",
        "The symbols x and x invoke left and right word boundaries, respectively.",
        "A language is said to be Strictly Local iff there is some k for which it is Strictly fc-Local.",
        "For example, let E = {a, b, c} and L = aa*(b + c).",
        "Then L is Strictly 2-Local because for S = { x a, ab, ac, aa, 6 x, c x } and every w G L, every 2-factor of x w x belongs to S.",
        "The elements of S can be thought of as the permissible fc-factors and the elements inFfc(xE*x) – S are the forbidden fc-factors.",
        "For example, bb and x6 are forbidden 2-factors for L = aa*(b + c).",
        "More generally, any SL language L excludes exactly those words with any forbidden factors; i.e., L is the intersection of the complements of sets defined to be those words which contain a forbidden factor.",
        "Note the set of forbidden factors is finite.",
        "This provides another characterization of SL languages (given below in Theorem 1).",
        "Formally, let the container of w G xE*x be",
        "For example, C(xa) = aE*.",
        "Then, by the immediately preceding argument, Theorem 1 is proven.",
        "Theorem 1 Consider any Strictly k-Local language L. Then there exists a finite set offorbidden factors S Ç Ffc(xE*x) such that L = r\\we§ C{w).",
        "Definition 2 A language L is Locally i-Threshold fc-Testable iff3t,k G N such that\\/w,v G E*, if Fk,t(w) = Fk,t(v) then w G L <^ v G L.",
        "A language is Locally Threshold Testable iff there is some k and i for which it is Locally i-Threshold fc-Testable.",
        "Definition 3 A language L is Piecewise fc-Testable iff 3k G N such thatVw,v G E*, if P<k(w) = P<k(v) then w G L <^ v G L.",
        "A language is Piecewise Testable iff there is some k for which it is Piecewise fc-Testable."
      ]
    },
    {
      "heading": "4. Tier-based Strictly Local Languages",
      "text": [
        "This section provides the main results of this paper.",
        "4.1 Definition",
        "The definition of Tier-based Strictly Local languages is similar to the one for SL languages with the exception that forbidden fc-factors only apply to elements on a tier TÇS, all other symbols are ignored.",
        "In order to define the TSL languages, it is necessary to introduce an \"erasing\" function (sometimes called string projection), which erases symbols not on the tier.",
        "where Ui = ai iff ai G T and Ui = A otherwise.",
        "For example, if S = {a, b, c} and T = {b, c} then Eriaabaaacaaabaa) = beb.",
        "A string u = a\\ ■ ■ ■ an G x T* x is a factor on tier T of a string w iff u is a factor of Et{w).",
        "Then the TSL languages are denned as follows.",
        "Definition 4 A language L is Strictly fc-Local on Tier Tiff there exists a tier T Ç E and finite set 5 Ç Ffc(xT*x) such that",
        "Again, S represents the permissible fc-factors on the tier T, and elements in Ffc(xT*x) – S represent the forbidden fc-factors on tier T. A language L is a Tier-based Strictly Local iff it is Strictly fc-Local on Tier T for some T ç S and k G N.",
        "To illustrate, let S = {a,b,c}, T = {b, c}, and S = {x6, xc, be, cb, 6x, cx}.",
        "Elements of S are the permissible fc-factors on tier T. Elements of F2(xT*x) - S = {bb,cc} are the forbidden factors on tier T. The language this describe includes words like aabaaacaaabaa, but excludes words like aabaaabaaacaa since bb is a forbidden 2-factor on tier T. This example captures the nature of longdistance dissimilation patterns found in phonology (Suzuki, 1998; Frisch et al., 2004; Heinz, 2010a).",
        "Let Ln stand for this particular dissimilatory language.",
        "Like SL languages, TSL languages can also be characterized in terms of the forbidden factors.",
        "Let the tier-based container oîw G xT* x be Ct(w) =",
        "In the case where w begins (ends) with a word boundary symbol then the first (last) E* in the previous GRE must be replaced with (E – T)*.",
        "Theorem 2 For any L G TSL, let T,k,S be the tier, length, and permissible factors, respectively, and S the forbidden factors.",
        "Then L = f)W£S CT{w).",
        "Proof The structure of the proof is identical to the one for Theorem 1.",
        "□",
        "This section establishes that TSL languages properly include SL languages and are properly star-free.",
        "Theorem 3 shows SL languages are necessarily TSL.",
        "Theorems 4 and 5 show that TSL languages are not necessarily LTT nor PT, but Theorem 6 shows that TSL languages are necessarily star-free.",
        "Theorem 3 SL languages are TSL.",
        "Proof Inclusion follows immediately from the definitions by setting the tier T = E. □ The fact that TSL languages properly include SL ones follows from the next theorem.",
        "Theorem 4 TSL languages are not LTT.",
        "Proof It is sufficient to provide an example of a TSL language which is not LTT.",
        "Consider any threshold t and length k. Consider the TSL language Ld discussed in Section 4.1, and consider the words w = akbakbakcak and v = akbakcakbak",
        "Clearly w £ Ld and v G Ld- However, Fixity*) = Ffc(xvx); i.e., they have the same fc-factors.",
        "In fact for any factor / G Ffc(x«;x), it is the case that \\w\\f = \\v\\f.",
        "Therefore F^xiwk) = Ffc)t(xt»x).",
        "If Ld were LTT, it would follow by definition that either both w,v G Ln or neither w, v belong to Ld, which is clearly false.",
        "Hence Ln ^ LTT.",
        "□ Theorem 5 TSL languages are not PT.",
        "Proof As above, it is sufficient to provide an example of a TSL language which is not PT.",
        "Consider any length k and the language Ld.",
        "Let w = ak(bakbakcakcak)k and v = ak(bakcakbakcak)k",
        "Clearly w ^ Ld and v G Ld- But observe that P<k{w) = P<k(v).",
        "Hence, even though the two words have exactly the same k-subsequences (for any k), both words are not in Ld- It follows that Ld does not belong to PT.",
        "□",
        "Although TSL languages are neither LTT nor PT, Theorem 6 establishes that they are star-free.",
        "Theorem 6 TSL languages are star-free.",
        "Proof Consider any language L which is Strictly k-Local on Tier T for some T Ç E and k G N. By Theorem 2, there exists a finite set S ç F^(xT* x) such that L = Ciwe§ Ct{w).",
        "Since the star-free languages are closed under finite intersection and complement, it is sufficient to show that Ct{w) is star-free for all w G xT*x.",
        "This is a regular expression without the Kleene-star.",
        "In the cases where w begins (ends) with a word boundary symbol, the first (last) 0 in the GRE above should be replaced with 0T0.",
        "Since every Ct{w) can be expressed as a GRE without the Kleene-star, every TSL language is star-free.",
        "□",
        "Together Theorems 1-4 establish that TSL languages generalize the SL languages in a different way than the LT and LTT languages do (Figure 1).",
        "There are two other properties of TSL languages worth mentioning.",
        "First, TSL languages are closed under suffix and prefix.",
        "This follows immediately because no word w of any TSL language contains any forbidden factors on the tier and so neither does any prefix or suffix of w. SL and SP languages-but not LT or PT ones-also have this property, which has interesting algebraic consequences (Fu et al., 2011).",
        "Next, consider that the choice of T ç E and fceN define systematic classes of languages which are TSL.",
        "Let Cx,k denote such a class.",
        "It follows immediately that Lt,u is a string extension class (Heinz, 2010b).",
        "A string extension class is one which can be defined by a function / whose domain is E* and whose codomain is the set of all finite subsets of some set A.",
        "A grammar G is a particular finite subset of A and the language of the grammar is all words which / maps to a subset of G. For Cx,k, the grammar can be thought of as the set of permissible factors on tier T and the function is w I – > Ffc(x_E,y(tü)x).",
        "In other words, every word is mapped to the set of fc-factors present on tier T. (So here the codomain-the possible grammars-is the powerset of Fk ( x T* x ).)",
        "String extension classes have quite a bit of structure, which faciliates learning (Heinz, 2010b; Kasprzik and Kotzing, 2010).",
        "They are closed under intersection, and have a lattice structure under the partial ordering given by the inclusion relation (C).",
        "Additionally, these classes are identifiable in the limit from positive data (Gold, 1967) by an incremental learner with many desirable properties.",
        "In the case just mentioned, the tier is known in advance.",
        "Learners which identify in the limit a class of TSL languages with an unknown tier but known k exist in principle (since such a class is of finite size), but it is unknown whether any such learner is efficient in the size of the input sample.",
        "5 Discussion",
        "Having established the main results, this section discusses some implications for phonology in general, Optimality Theory in particular, and future research.",
        "There are three classes of phonotactic constraints in phonology: local segmental patterns, longdistance segmental patterns, and stress patterns (Heinz, 2007).",
        "Local segmental patterns are SL (Heinz, 2010a).",
        "Long-distance segmental phono-tactic patterns are those derived from processes of consonant harmony and disharmony and vowel harmony.",
        "Below we show each of these patterns belong to TSL.",
        "For exposition, assume Yi={l,r,i,ö,u,o}.",
        "Phonotactic patterns derived from attested longdistance consonantal assimilation patterns (Rose and Walker, 2004; Hansson, 2001) are SP; on the other hand, phonotactic patterns derived from attested long-distance consonantal Assimilation patterns (Suzuki, 1998) are not (Heinz, 2010a).",
        "However, both belong to TSL.",
        "Assimilation is obtained by forbidding disagreeing factors on the tier.",
        "For example, forbidding Ir and rl on the liquid tier T = {l,r} yields only words which do not contain both [1] and [r].",
        "Dissimilation is obtained by forbidding agreeing factors on the tier; e.g. forbidding 11 and rr on the liquid tier yields a language of the same character as Ld-",
        "The phonological literature distinguishes three kinds of vowel harmony patterns: those without neutral vowels, those with opaque vowels and those with transparent vowels (Bakovic, 2000; Nevins, 2010).",
        "Formally, vowel harmony patterns without neutral vowels are the same as assimilatory consonant harmony.",
        "For example, a case of back harmony can be described by forbidding disagreeing factors {iu, io, öu, öo, ui, uö, oi, oö} on the vowel tier T ={i,ö,u,o}.",
        "If a vowel is opaque, it does not harmonize but begins its own harmony domain.",
        "For example if [i] is opaque, this can be described by forbidding factors {iu, io öu, öo, uö, oö} on the vowel tier.",
        "Thus words like lulolilö are acceptable because oi is a permissible factor.",
        "If a vowel is transparent, it neither harmonizes nor begins its own harmony domain.",
        "For example if [i] is transparent (as in Finnish), this can be described by removing it from the tier; i.e. by forbidding factors {öu, öo, uö, oö} on tier T ={ö,u,o}.",
        "Thus words like lulolilu are acceptable since [i] is not on the relevant tier.",
        "The reasonable hypothesis which follows from this discussion is that all humanly possible segmental phonotactic patterns are TSL (since TSL contains SL).",
        "Additionally, the fact that Lt,u is closed under intersection has interesting consequences for Optimality Theory (OT) (Prince and Smolensky, 2004).",
        "The intersection of two languages drawn from the same string extension class is only as expensive as the intersection of finite sets (Heinz, 2010b).",
        "It is known that the generation problem in OT is NP-hard (Eisner, 1997; Idsardi, 2006) and that the NP-hardness is due to the problem of intersecting arbitrarily many arbitrary regular sets (Heinz et al., 2009).",
        "It is unknown whether intersecting arbitrarily many TSL sets is expensive, but the results here suggest that it may only be the intersections across distinct Cx,k classes that are problematic.",
        "In this way, this work suggests a way to factor OT constraints characterizable as TSL languages in a manner originally suggested by Eisner (1997).",
        "Future work includes determining automata-theoretic characterizations of TSL languages and procedures for deciding whether a regular set belongs to TSL, and if so, for what T and k. Also, the erasing function may be used to generalize other subregular classes."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "The TSL languages generalize the SL languages and have wide application within phonology.",
        "Even though virtually all segmental phonotactic constraints present in the phonologies of the world's languages, both local and non-local, fall into this class, it is striking how highly restricted (sub-star-free) and well-structured the TSL languages are."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We thank the anonymous reviewers for carefully checking the proofs and for their constructive criticism.",
        "We also thank the participants in the Fall 2010 Formal Models in Phonology seminar at the University of Delaware for valuable discussion, especially Jie Fu.",
        "This research is supported by grant #1035577 from the National Science Foundation."
      ]
    }
  ]
}
