{
  "info": {
    "authors": [
      "Tadahiko Kumamoto",
      "Yukiko Kawai",
      "Katsumi Tanaka"
    ],
    "book": "Proceedings of the 2nd Workshop on Computational Approaches to Subjectivity and Sentiment Analysis (WASSA 2.011)",
    "id": "acl-W11-1711",
    "title": "Improving a Method for Quantifying Readers' Impressions of News Articles with a Regression Equation",
    "url": "https://aclweb.org/anthology/W11-1711",
    "year": 2011
  },
  "references": [
    "acl-N04-1026",
    "acl-P02-1053"
  ],
  "sections": [
    {
      "text": [
        "Improving a Method for Quantifying Readers' Impressions of News Articles",
        "with a Regression Equation",
        "Tadahiko Kumamoto Yukiko Kawai",
        "Chiba Institute of Technology Kyoto Sangyo University",
        "2-17-1, Tsudanuma, Narashino, Motoyama, Kamigamo,",
        "Chiba 275-0016, Japan Kita-Ku, Kyoto 603-8555,",
        "Japan",
        "Kyoto University Yoshida-Honmachi,",
        "Sakyo-Ku, Kyoto 606-8501,",
        "In this paper, we focus on the impressions that people gain from reading articles in Japanese newspapers, and we propose a method for extracting and quantifying these impressions in real numbers.",
        "The target impressions are limited to those represented by three bipolar scales, \"Happy - Sad,\" \"Glad - Angry,\" and \"Peaceful - Strained,\" and the strength of each impression is computed as a real number between 1 and 7.",
        "First, we implement a method for computing impression values of articles using an impression lexicon.",
        "This lexicon represents a correlation between the words appearing in articles and the influence of these words on the readers' impressions, and is created from a newspaper database using a word co-occurrence based method.",
        "We considered that some gaps would occur between values computed by such an unsupervised method and those judged by the readers, and we conducted experiments with 900 subjects to identify what gaps actually occurred.",
        "Consequently, we propose a new approach that uses regression equations to correct impression values computed by the method.",
        "Our investigation shows that accuracy is improved by a range of 23.2% to 42.7% by using regression equations."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In recent years, many researchers have been attempting to model the role of emotion in interactions between people or between people and computers, and to establish how to make computers recognize and express emotions (Picard, 1997; Massaro, 1998; Bartneck, 2001).",
        "However, there have not been many studies that have extracted the impressions that people form after seeing or listening to text and multimedia content.",
        "For multimedia content such as music and images, several impression-based retrieval methods have been proposed for locating paintings and pieces of music that convey impressions similar to those registered by users (Sato et al., 2000; Kumamoto, 2005; Takayama et al., 2005).",
        "By comparison, there are only a few studies that have extracted the readers' impressions gained from text such as news articles, novels, and poems (Kiyoki et al., 1994; Kumamoto and Tanaka, 2005; Lin et al., 2008).",
        "In this paper, we focus on the impressions that people gain from reading articles in Japanese newspapers, and we propose a method for extracting and quantifying these impressions in real numbers.",
        "The target impressions are limited to those represented by three bipolar scales, \"Happy - Sad,\" \"Glad - Angry,\" and \"Peaceful - Strained,\" and the strength of each impression is computed as a real number between 1 and 7 denoting a position on the corresponding scale.",
        "Then, interpretation of the position is grounded based on a seven-point scale.",
        "For example, on the scale \"Happy - Sad,\" the score 1 equals \"Happy,\" the middle score 4 denotes \"Neither happy nor sad,\" and the score 7 equals \"Sad.\"",
        "Ifthe impression value of an article is 2.5, then the average reader will experience an intermediate impression between \"Comparatively happy (2)\" and \"A little happy (3)\" from reading the article.",
        "First, we assumed that words causing a certain impression from articles co-occur often with impression words that express that impression, and do not co-occur very often with impression words that express the opposite impression.",
        "Proceeding with this assumption, we implemented a method for analyzing co-occurrence relationships between words in every article extracted from a newspaper database.",
        "We then created an impression lexicon.",
        "This lexicon represents a correlation between the words appearing in articles and the influence of these words on the readers' impressions.",
        "We then implemented a method that computes impression values of articles using the lexicon.",
        "We considered that some gaps occur between values computed by such an unsupervised method and those judged by the readers, and we conducted experiments with 900 subjects to identify what gaps actually occurred.",
        "In these experiments, each subject read ten news articles and estimated her/his impressions of each article using the three bipolar scales.",
        "Thereafter, for each scale, we drew a scatter diagram to identify the potential correspondence relationships between the values computed by the method and those judged by the subjects.",
        "As a result, we found that the correspondence relationships could be approximately represented by cubic and quintic regression equations.",
        "We, therefore, propose a new approach that uses regression equations to correct impression values computed by the method.",
        "The rest of this paper is organized as follows.",
        "In Section 2, we present related work.",
        "In Section 3, we present the design of the three bipolar scales, a method for the automated construction of an impression lexicon, and a method for computing impression values of articles using this lexicon.",
        "In Section 4, we analyze the correspondence relationships between values computed using the lexicon and those judged by the readers, and based on the results of this analysis, we propose a method of using regression equations to correct impression values computed using the lexicon.",
        "In Section 5, we investigate how far accuracy can be improved by using the regression equations.",
        "Finally, in Section 6, we conclude the paper."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "There are many studies that identify information givers' emotions from some sort of information that they have transmitted (Cowie et al., 2001; Forbes-Riley and Litman, 2004; Kleinsmith and Bianchi-Berthouze, 2007).",
        "On the other hand, there are only a few studies that have extracted the impressions which information receivers gain from the text that they have received (Kiyoki et al., 1994; Kumamoto and Tanaka, 2005; Lin et al., 2008).",
        "Kiyoki et al.",
        "(1994) have proposed a mathematical model of meanings, and this model allows a semantic relation to be established between words according to a given context.",
        "Their method uses a mathematical model and creates a semantic space for selecting the impression words thatappropriately express impressions of text according to a given context.",
        "In other words, this method does not quantify impressions of text, but just selects one or more impression words expressing the impressions.",
        "Thus, their aim differs from ours.",
        "Lin et al.",
        "(2008) have proposed a method for classifying news articles into emotion categories from the reader's perspective.",
        "They have adopted a machine learning approach to build a classifier for the method.",
        "That is, they obtained Chinese news articles from a specific news site on the web which allows a user to cast a vote for one of eight emotions, \"happy,\" \"sad,\" \"angry,\" \"surprising,\" \"boring,\" \"heartwarming,\" \"awesome,\" and \"useful.\"",
        "They collected 37,416 news articles along with their voting statistics, and developed a support vector machine-based classifier using 25,975 of them as training data.",
        "However, their method just classifies articles into emotion classes and does not quantify the reader's emotions.",
        "Thus, their aim also differs from ours.",
        "Kumamoto and Tanaka (2005) have proposed a word co-occurrence-based method for quantifying readers' impressions of news articles in real numbers.",
        "However, this method is similar to Turney's method (Turney, 2002), and it is considered to be a Japanese version of this method in the broad sense.",
        "Turney's method is one for classifying various genres of written reviews into \"recommended\" or \"not recommended.\"",
        "His method extracts phrases with specific patterns from text, and calculates pointwise mutual information PMI(i, \"excellent\") between a phrase i and the reference word \"excellent,\" and PMI(i, \"poor\") between the same phrase i and the reference word \"poor.\"",
        "Then, PMI(i, w) is calculated based on a co-occurrence relationship between i and w. Next, the semantic orientation (SO) of the phrase i is obtained by calculating the difference between PMI(i, \"excellent\") and PMI(i, \"poor\").",
        "Finally, SO of the text is determined by averaging the SO of all the phrases.",
        "In contrast, Kumamoto et al.",
        "'s method quantifies impressions in real numbers, and it can deal with impressions represented by two bipolar scales, \"Sad - Glad\" and \"Angry -Pleased.\"",
        "For that purpose, reference words are selected for each scale.",
        "Since all the reference words are Japanese, Kumamoto et al.,'s method extracts readers' impressions from Japanese articles only.",
        "Also, conditional probabilities are used instead of PMI.",
        "Since these methods fit our assumption that words causing a certain impression of articles co-occur often with the impression words that express that impression, and do not co-occur very often with impression words that express the opposite impression, we decided to implement a new method based on Kumamoto et al.",
        "'s method.",
        "3 Computing impression values of news articles using an impression lexicon",
        "Kumamoto (2010) has designed six bipolar scales suitable for representing impressions of news articles: \"Happy - Sad,\" \"Glad - Angry,\" \"Interesting -Uninteresting,\" \"Optimistic - Pessimistic,\" \"Peaceful - Strained,\" and \"Surprising - Common.\"",
        "First, he conducted nine experiments, in each of which 100 subjects read ten news articles and estimated their impressions on a scale from 1 to 5 for each of 42 impression words.",
        "These 42 impression words were manually selected from a Japanese thesaurus (Ohno and Hamanishi, 1986) as words that can express impressions of news articles.",
        "Next, factor analysis was applied to the data obtained in the experiments, and consequently the 42 words were divided into four groups: negative words, positive words, two words that were \"uninteresting\" and \"common,\" and two words that were \"surprising\" and \"unexpected.\"",
        "In the meantime, after cluster analysis of the data, the 42 words were divided into ten groups.",
        "Based on the results of both analyses, the author created the six bipolar scales presented above.",
        "However, he showed that impressions on the \"Surprising - Common\" scale differed greatly among individuals in terms of their perspective.",
        "In addition, he insisted that processing according to the background knowledge, interest, and character of individuals was required to deal with the impressions represented by the two scales \"Interesting - Uninteresting\" and \"Optimistic - Pessimistic.\"",
        "Therefore, we decided not to use these three scales at the present stage, and adopted the remaining three scales, \"Happy - Sad,\" \"Glad - Angry,\" and \"Peaceful - Strained.\"",
        "An impression lexicon plays an important role in computing impressions of news articles.",
        "In this paper, we describe the implementation of a method for automatically constructing an impression lexicon based on Kumamoto et al.",
        "'s method as described earlier.",
        "First, while two contrasting reference words are used for each scale in their method, two contrasting sets, each consisting ofmultiple reference words, are used in this paper.",
        "Next, let the set of reference words which expresses an impression at the left of a scale be SL, and let the set of reference words which expresses an impression at the right of the scale be SR.",
        "Articles including one or more reference words in SL or SR are all extracted from a newspaper database, and the number of reference words belonging to each set is counted in each article.",
        "For this we used the 2002 to 2006 editions of the Yomiuri Newspaper Text Database as the newspaper database.",
        "Then, let the articles in each of which the number of reference words belonging to SL is larger than the number of reference words belonging to SR be AL, and let the number of articles in AL be NL.",
        "Let the articles in each of which the number of reference words belonging to SL is smaller than the number of reference words belonging to SR be AR, and let the number of articles in AR be NR.",
        "Next, all words are extracted from each of AL and AR except for particles, adnominal words, and demonstratives, and the document frequency of each word is measured.",
        "Then, let the document frequency in AL of a word w be NL(w), and let the document frequency in AR of a word w be NR(w).",
        "The revised conditional probabilities of a word w are defined as follows.",
        "These formula are slightly different from the conditional probabilities used in their method, and only articles that satisfy the assumptions described above are used in order to calculate PL(w) and PR(w).",
        "Finally, the impression value v(w) of a word w is calculated using these PL(w) and PR(w) as follows.",
        "That is, a weighted interior division ratio v(w) of PL(w) and PR(w) is calculated using these formulas, and stored as an impression value of w in the scale \"SL - SR\" in an impression lexicon.",
        "Note that WL and WR denote weights, and the larger NL and NR are, the heavier WL and WR are.",
        "The numbers of entries in the impression lexicon constructed as above are shown in Table 1 together with the values of WL and WR obtained.",
        "Further, the two contrasting sets of reference words, which were used in creating the impression lexicon, are enumerated in Table 2 for each scale.",
        "These words were determined after a few of trial and error and are based on two criteria, namely (i) it is a verb or adjective that expresses either of two contrasting impressions represented by a scale, and (ii) as far as possible, it does not suggest other types of impressions.",
        "For each scale, the impression value of an article is calculated as follows.",
        "First, the article is segmented into words using \"Juman\" (Kurohashi et al., 1994), one of the most powerful Japanese morphological analysis systems, and an impression value for each word is obtained by consulting the impression lexicon constructed as described in 3.2.",
        "Seventeen rules that we designed are then applied to the Juman output.",
        "For example, there is a rule that a phrase of a negative form like \"sakujo-shi-nai (do not erase)\" should not be divided into a verb \"shi (do),\" a suffix \"nai (not),\" and an action noun \"sakujo (erasion)\" but should be treated as a single verb \"sakujo-shi-nai (do-not-erase).\"",
        "There is also a rule that an assertive phrase such as \"hoomuran-da (is a home run)\" should not be divided into a copula \"da (is)\" and a noun \"hoomuran (a home run)\" but should form a single copula \"hoomuran-da (isa-home-run).\"",
        "Further, there is a rule that a phrase with a prefix, such as \"sai-charenji (re-challenge)\" should not be divided into a prefix \"sai (re)\" and an action noun \"charenji (challenge)\" but should form a single action noun \"sai-charenji (re-challenge).\"",
        "All the rules are applied to the Juman output in creating an impression lexicon and computing the impression values of news articles.",
        "Finally, an average of the impression values obtained for all the words except for particles, adnominal words, and demonstratives is calculated and presented as an impression value of the article.",
        "Scales",
        "# of entries",
        "Wr",
        "Happy - Sad",
        "387,428",
        "4.90",
        "3.80",
        "Glad - Angry",
        "350,388",
        "4.76",
        "3.82",
        "Peaceful - Strained",
        "324,590",
        "3.91",
        "4.67",
        "Happy",
        "-Sad",
        "tanoshii (happy), tanoshimu (enjoy), tanosimida (look forward to), tanoshigeda (joyous)",
        "kanashii (sad), kanashimu (suffer sadness), kanashimida (feel sad), kanashigeda (look sad)",
        "Glad",
        "- Angry",
        "ureshii (glad), yorokobashii (blessed), yorokobu (feel delight)",
        "ikaru/okoru (get angry), ikidooru (become irate), gekidosuru (get enraged)",
        "Peaceful - Strained",
        "nodokada (peaceful), nagoyakada (friendly), sobokuda (simple), an-shinda (feel easy)",
        "kinpakusuru (strained), bukimida (scared), fuanda (be anxious), os-oreru (fear)"
      ]
    },
    {
      "heading": "4. Correcting computed impression values",
      "text": [
        "4.1 Analyzing a correspondence relationship between computed and manually rated values",
        "We considered that some gaps would occur between impression values computed by an unsupervised method such as the one we used and those of the readers.",
        "We, therefore, conducted experiments in which a total of 900 people participated as subjects, and identified what gaps actually occurred.",
        "First, we conducted experiments with 900 subjects, and obtained data that described correspondence relationships between news articles and impressions to be extracted from the articles.",
        "That is, the 900 subjects were randomly divided into nine equal groups, each group consisting of50 males and 50 females, and 90 articles which were selected from the 2002 edition of the Mainichi Newspaper Text Database were randomly divided into nine equal parts.",
        "Then, each subject was asked to read the ten articles presented in a random order and rate each of them using three seven-point bipolar scales presented in a random order.",
        "The scales we used were",
        "Strained,\" and the subjects were asked to assess, on a scale of 1 to 7, the intensity of each impression, represented by each scale, from reading a target article.",
        "For example, on the scale \"Happy - Sad,\" the score 1 equaled \"Happy,\" the middle score 4 denoted \"Neither happy nor sad,\" and the score 7 equaled \"Sad.\"",
        "After the experiments, for each scale, we calculated an average of the 100 values rated for every article.",
        "We regarded this average as the impression value to be extracted from the article.",
        "Note that, in these experiments, we presented only the first paragraphs of the original news articles to the subjects.",
        "This procedure was derived from the fact that people can understand the outline of a news article by just reading the first paragraph of the article, as well as the fact that impressions of an article may change in every paragraph.",
        "Development of a method for following the change of impressions in an article will be a future project.",
        "Next, impression values for the first paragraphs of the 90 articles were computed by the method we implemented in 3.3, where the first paragraphs were identical to those presented to the subjects in the experiments.",
        "Note that, according to the definition of our equations, these impression values are close to 1 when impressions on the left of a scale are felt strongly, and are close to 0 when impressions on the right of a scale are felt strongly.",
        "We therefore used the following formula and converted the computed value into a value between 1.0 and 7.0.",
        "Next, for each scale, we drew a scatter diagram to identify the potential correspondence relationship between these converted values and the averages obtained in the experiments, as illustrated in Figure 1.",
        "We can see from any of the scatter diagrams that the impression values manually rated by the subjects are positively correlated with those automatically computed by the method we implemented.",
        "In fact, their coefficients of correlation are 0.76, 0.84, and 0.78 from the case at the top of the figure, which are all high.",
        "This not only means that, as an overall trend, the underlying assumption of this paper is satisfied, but also indicates that the correspondence relationships can be represented by regression equations.",
        "4.2 Correcting computed impression values with regression equations",
        "Next, we applied regression analysis to the converted values and the averages, where the converted values were used as the explanatory variable, and the averages were used as the objective variable.",
        "In this regression analysis, various regression models (Kan, 2000) such as linear function, logarithmic function, logistic curve, quadratic function, cubic function, quartic function, and quintic function were used on",
        "(c) In the case of \"Peaceful - Strained\" Figure 1: Scatter diagrams and regression equations.",
        "a trial basis.",
        "As a result, the regression equation, which had the highest coefficient of determination, was determined as an optimal function denoting the correspondence relationship between the converted values and the averages in each scale.",
        "This means that, for each scale, the impression value of an article was more accurately obtained by correcting a value computed by the method we implemented using the corresponding regression equation.",
        "already illustrated on the corresponding scatter diagrams in Figure 1.",
        "Their coefficients of determination were 0.63, 0.81, 0.64, respectively, which were higher than 0.5 in all scales.",
        "This means that the results of regression analysis were good.",
        "In addition, we can see from Figure 1 that each regression equation fits the shape of the corresponding scatter diagram."
      ]
    },
    {
      "heading": "5. Performance Evaluation",
      "text": [
        "First, we estimated the accuracy of the proposed method for learned data.",
        "For that, we used the data obtained in the experiments described in 4.1, and investigated how far gaps between the computed values and the averages of the manually rated values were reduced by using the regression equations.",
        "The results are shown in Table 3.",
        "In this table, DBefore denotes the Euclidean distance between the computed values without correction and the averages for the 90 articles, and DAfter denotes the Euclidean distance between the values corrected with the corresponding regression equation and the averages for the 90 articles.",
        "Then Ratel was calculated as an improvement rate by the following formula:",
        "Dßefore - DAft er",
        "Table 3 shows fairly high improvement rates in all the scales, and hence we find that accuracy is improved by using the regression equations.",
        "In particular, DAfter for the scale \"Glad - Angry\" is less than 0.5 or a half of a step and is sufficiently small.",
        "Next, we calculated the accuracy of the method (Kumamoto and Tanaka, 2005) on which the proposed method is based, and compared it with that of the proposed method.",
        "The results are shown in Table 4.",
        "In this table, DBaseiine denotes the Euclidean",
        "Converted Values",
        "Converted Values",
        "Scales",
        "Dßefore",
        "DAfter",
        "Ratel",
        "Happy - Sad",
        "0.94",
        "0.67",
        "29.0%",
        "Glad - Angry",
        "0.83",
        "0.47",
        "42.7%",
        "Peaceful",
        "0.82",
        "0.63",
        "23.2%",
        "- Strained",
        "-",
        ".",
        "* V iL» ♦",
        "-",
        "-",
        "Table 4: Comparison with a baseline method.",
        "Table 5: Estimation of overall accuracy based on fivefold _ cross-validation.",
        "DBaseline",
        "distance between the values computed by the baseline method and the averages for the 90 articles, and DProposed is equivalent to DAfter in Table 3.",
        "Then Rate2 is calculated as an improvement rate by the following formula:",
        "Table 4 also shows that fairly high improvement rates were obtained in all the scales.",
        "Note that the baseline method was implemented in the following way.",
        "First, a pair of reference words was prepared for each scale.",
        "Actually, the pair \"tanoshii (happy)\" and \"kanashii (sad)\" was used for the scale \"Happy - Sad\"; the pair \"ureshii (glad)\" and \"ikaru/okoru (get angry)\" for the scale \"Glad - Angry\"; and \"nodokada (peaceful)\" and \"kinpakusuru (strained)\" for the scale \"Peaceful - Strained.\"",
        "Next, an impression lexicon for the baseline method was constructed from the news articles which were used to construct our impression lexicon.",
        "The results shown in Tables 3 and 4 prove that the proposed method has a high level of accuracy for the articles used in obtaining the regression equations.",
        "As the next step, we estimated the accuracy of the proposed method for unlearned data.",
        "For that, we performed fivefold cross-validation using the data obtained in 4.1.",
        "First, the data were randomly divided into five equal parts, each part consisting of data for 18 articles.",
        "Next, a learned data set was created arbitrarily from four of the five parts, or data for 72 articles, and an unlearned data set was created from the remaining part, or data for 18 articles.",
        "Regression analysis was then applied to the learned data set.",
        "As a result, an optimal regression equation that expressed a correspondence relationship between the computed values and the averages of the manually rated values in the learned data set was obtained for each scale.",
        "Next, we calculated the Euclidean distance between the averages for 18 articles in the unlearned data set and the values which were computed from the 18 articles themselves and corrected with the corresponding optimal regression equation.",
        "The results are shown in Table 5.",
        "In this table, DMean, DMax, and DMin denote the mean, maximum, and minimum values of the five Euclidean distances calculated from a total of five unlearned data sets, respectively.",
        "Comparing DProposed in Table 4 and DMean in Table 5, we find that they are almost equivalent.",
        "This means that the proposed method is also effective for unlearned data.",
        "Finally, we investigated how the accuracy of the proposed method was influenced by the size of the newspaper database used in constructing an impression lexicon.",
        "First, using each of the 2002 to 2006 editions, the 2005 to 2006 editions, and the 2006 edition only, impression lexicons were constructed.",
        "Three regression equations were then obtained for each lexicon in the same way.",
        "Next, for each scale, we calculated the Euclidean distance between the values which were computed from all the 90 articles using each lexicon and corrected with the corresponding regression equation, and the averages obtained in 4.1.",
        "The results are shown in Table 6.",
        "Table 6 shows that the accuracy of the proposed method is reduced slightly as the size of newspaper database becomes smaller.",
        "Conversely, this suggests that the accuracy of the proposed method can be improved as the size of newspaper database increases.",
        "We would like to verify this suggestion in the near future.",
        "Scales",
        "DBaseline",
        "DProposed",
        "Rate2",
        "Happy - Sad Glad - Angry",
        "0.99",
        "0.67",
        "32.3%",
        "Scales",
        "DMean",
        "DMax",
        "DMin",
        "0.82",
        "0.47",
        "42.7%",
        "Happy - Sad",
        "0.69",
        "0.78",
        "0.57",
        "Peaceful",
        "1.00",
        "0.63",
        "37.0%",
        "Glad - Angry",
        "0.49",
        "0.58",
        "0.42",
        "- Strained",
        "Peaceful - Strained",
        "0.64",
        "0.81",
        "0.50",
        "Scales",
        "Editions",
        "2002-2006",
        "2005-2006",
        "2006",
        "Happy - Sad",
        "0.67",
        "0.69",
        "0.73",
        "Glad - Angry",
        "0.47",
        "0.50",
        "0.54",
        "Peaceful",
        "0.63",
        "0.65",
        "0.69",
        "- Strained"
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "This paper has proposed a method for quantitatively identifying the impressions that people gain from reading Japanese news articles.",
        "The key element of the proposed method lies in a new approach that uses regression equations to correct impression values computed from news articles by an unsupervised method.",
        "Our investigation has shown that accuracy for learned data is improved by a range of 23.2% to 42.7% by using regression equations, and that accuracy for unlearned data is almost equivalent to the accuracy for learned data.",
        "Note that, in this paper, the target impressions are limited to those represented by three bipolar scales, \"Happy - Sad,\" \"Glad - Angry,\" and \"Peaceful - Strained,\" and the strength of each impression is computed as a real number between 1 and 7 denoting a position on the corresponding scale.",
        "Our main future work is described below.",
        "Since the proposed method uses a word co-occurrence based method to construct an impression lexicon, it may not be effective for other types of scale.",
        "We therefore need to examine and consider what kinds of scales are suitable for the proposed method.",
        "Personal adaptation is important in methods dealing with impressions created by such artworks as music and paintings.",
        "In order to develop a method for more accurately quantifying readers' impressions of news articles, we will also tackle this personal adaptation problem.",
        "Further, we plan to integrate the proposed method into a search engine, a recommendation system, and an electronic book reader, and to verify the effectiveness of readers' impressions of news articles in creating a ranking index for information retrieval and recommendation, or in determining the type of emotional speech used in reading an e-paper."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "A part of this work was sponsored by National Institute of Information and Communications Technology (NICT), Japan, and was achieved under the project named \"Evaluating Credibility of Web Information.\""
      ]
    }
  ]
}
