{
  "info": {
    "authors": [
      "Joseph Reisinger",
      "Marius Paşca"
    ],
    "book": "Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies",
    "id": "acl-P11-1120",
    "title": "Fine-Grained Class Label Markup of Search Queries",
    "url": "https://aclweb.org/anthology/P11-1120",
    "year": 2011
  },
  "references": [
    "acl-C92-2082",
    "acl-D07-1072",
    "acl-D07-1086",
    "acl-N07-1018",
    "acl-P06-1101",
    "acl-P08-1078",
    "acl-P10-1044",
    "acl-W06-1673"
  ],
  "sections": [
    {
      "text": [
        "Joseph Reisinger*",
        "Marius Pasca",
        "Google Inc. 1600 Amphitheatre Parkway Mountain View, California 94043",
        "We develop a novel approach to the semantic analysis of short text segments and demonstrate its utility on a large corpus of Web search queries.",
        "Extracting meaning from short text segments is difficult as there is little semantic redundancy between terms; hence methods based on shallow semantic analysis may fail to accurately estimate meaning.",
        "Furthermore search queries lack explicit syntax often used to determine intent in question answering.",
        "In this paper we propose a hybrid model of semantic analysis combining explicit class-label extraction with a latent class PCFG.",
        "This class-label correlation (CLC) model admits a robust parallel approximation, allowing it to scale to large amounts of query data.",
        "We demonstrate its performance in terms of (1) its predicted label accuracy on polysemous queries and (2) its ability to accurately chunk queries into base constituents."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Search queries are generally short and rarely contain much explicit syntax, making query understanding a purely semantic endeavor.",
        "Furthermore, as in noun-phrase understanding, shallow lexical semantics is often irrelevant or misleading; e.g., the query [tropical breeze cleaners] has little to do with island vacations, nor are desert birds relevant to [1970 road runner], which refers to a car model.",
        "This paper introduces class-label correlation (clc), a novel unsupervised approach to extract* Contributions made during an internship at Google.",
        "ing shallow semantic content that combines class-based semantic markup (e.g., road runner is a car model) with a latent variable model for capturing weakly compositional interactions between query constituents.",
        "Constituents are tagged with IsA class labels from a large, automatically extracted lexicon, using a probabilistic context free grammar (PCFG).",
        "Correlations between the resulting label^term distributions are captured using a set of latent production rules specified by a hierarchical Dirichlet Process (Teh et al., 2006) with latent data groupings.",
        "Concretely, the IsA tags capture the inventory of potential meanings (e.g., jaguar can be labeled as european car or large cat) and relevant constituent spans, while the latent variable model performs sense and theme disambiguation (e.g., [jaguar habitat] would lend evidence for the large cat label).",
        "In addition to broad sense disambiguation, clc can distinguish closely related usages, e.g., the use of dell in [dell motherboard replacement] and [dell stock price].",
        "Furthermore, by employing IsA class labeling as a preliminary step, cl c can account for common non-compositional phrases, such as big apple unlike systems relying purely on lexical semantics.",
        "Additional examples can be found later, in Figure 5.",
        "In addition to improving query understanding, potential applications of clc include: (1) relation extraction (Baeza-Yates and Tiberi, 2007), (2) query substitutions or broad matching (Jones et al., 2006), and (3) classifying other short textual fragments such as SMS messages or tweets.",
        "We implement a parallel inference procedure for clc and evaluate it on a sample of 500M search queries along two dimensions: (1) query constituent chunking precision (i.e., how accurate are the inferred spans breaks; cf., Bergsma and Wang (2007); Tan and Peng (2008)), and (2) class label assignment precision (i.e., given the query intent, how relevant are the inferred class labels), paying particular attention to cases where queries contain ambiguous constituents.",
        "clc compares favorably to several simpler submodels, with gains in performance stemming from coarse-graining related class labels and increasing the number of clusters used to capture between-label correlations.",
        "(Paper organization): Section 2 discusses relevant background, Section 3 introduces the clc model, Section 4 describes the experimental setup employed, Section 5 details results, Section 6 introduces areas for future work and Section 7 concludes."
      ]
    },
    {
      "heading": "2. Background",
      "text": [
        "Query understanding has been studied extensively in previous literature.",
        "Li (2010) defines the semantic structure of noun-phrase queries as intent heads (attributes) coupled with some number of intent modifiers (attribute values), e.g., the query [alice in wonderland 2010 cast] is comprised of an intent head cast and two intent modifiers alice in wonderland and 2010.",
        "In this work we focus on semantic class markup of query constituents, but our approach could be easily extended to account for query structure as well.",
        "Popescu et al.",
        "(2010) describe a similar class-label-based approach for query interpretation, explicitly modeling the importance of each label for a given entity.",
        "However, details of their implementation were not publicly available, as of publication of this paper.",
        "For simplicity, we extract class labels using the seed-based approach proposed by Van Durme and Pa§ca (2008) (in particular Pa§ca (2010)) which generalizes Hearst (1992).",
        "Talukdar and Pereira (2010) use graph-based semi-supervised learning to acquire class-instance labels; Wang et al.",
        "(2009) introduce a similar CRF-based approach but only apply it to a small number of verticals (i.e., Computing andElec-tronics or Clothing and Shoes).",
        "Snow et al.",
        "(2006) describe a learning approach for automatically acquiring patterns indicative of hypernym (IsA) relations.",
        "Semantic class label lexicons derived from any of these approaches can be used as input to clc.",
        "Several authors have studied query clustering in the context of information retrieval (e.g., Beeferman and Berger, 2000).",
        "Our approach is novel in this regard, as we cluster queries in order to capture correlations between span labels, rather than explicitly for query understanding.",
        "Tratz and Hovy (2010) propose a taxonomy for classifying and interpreting noun-compounds, focusing specifically on the relationships holding between constituents.",
        "Our approach yields similar topical decompositions of noun-phrases in queries and is completely unsupervised.",
        "Jones et al.",
        "(2006) propose an automatic method for query substitution, i.e., replacing a given query with another query with the similar meaning, overcoming issues with poor paraphrase coverage in tail queries.",
        "Correlations mined by our approach are readily useful for downstream query substitution.",
        "Bergsma and Wang (2007) develop a supervised approach to query chunking using 500 hand-segmented queries from the AOL corpus.",
        "Tan and Peng (2008) develop a generative model of query segmentation that makes use of a language model and concepts derived from Wikipedia article titles.",
        "c lc differs fundamentally in that it learns concept label markup in addition to segmentation and uses in-domain concepts derived from queries themselves.",
        "This work also differs from both of these studies significantly in scope, training on 500M queries instead of just 500.",
        "At the level of class-label markup, our model is related to Bayesian PCFGs (Liang et al., 2007; Johnson et al., 2007b), and is a particular realization of an Adaptor Grammar (Johnson et al., 2007a; Johnson, 2010).",
        "Szpektor et al.",
        "(2008) introduce a model of contextual preferences, generalizing the notion of selectional preference (cf. Ritter et al., 2010) to arbitrary terms, allowing for context-sensitive inference.",
        "Our approach differs in its use of class-instance labels for generalizing terms, a necessary step for dealing with the lack of syntactic information in queries.",
        "query clusters label clusters seaside towns building materials label pcfg",
        "brighton vinyl Windows query constituents",
        "Figure 1: Overview of clc markup generation for the query [brighton vinyl windows].",
        "Arrows denote multinomial distributions.",
        "class label^query span recreational facilities^jacuzzi rural areas swales destinations^wales seaside towns^brighton building materials^ vinyl windows consumer goods^european clothing",
        "Table 1: Example production rules collected using the semi-supervised approach of Van Durme and Paşca (2008)."
      ]
    },
    {
      "heading": "3. Latent Class-Label Correlation",
      "text": [
        "Input to clc consists of raw search queries and a partial grammar mapping class labels to query spans (e.g., building materials^vinyl windows).",
        "clc infers two additional latent productions types on top of these class labels: (1) a potentially infinite set of label clusters (frf coarse-graining the raw input label productions V, and (2) a finite set of query clusters 0C specifying distributions over label clusters; see Figure 1 for an overview.",
        "Operationally, clc is implemented as a Hierarchical Dirichlet Process (HDP; Teh et al., 2006) with latent groups coupled with a Probabilistic Context Free Grammar (PCFG) likelihood function (Figure 2).",
        "We motivate our use of an HDP latent class model instead of a full PCFG with binary productions by the fact that the space of possible binary rule combinations is prohibitively large (561K base labels; 314B binary rules).",
        "The next sections discuss the three main components of clc: §3.1 the raw IsA class labels, §3.2 the PCFG likelihood, and §3.3 the HDP with latent groupings.",
        "IsA class labels (hypernyms) V are extracted from a large corpus of raw Web text using the method proposed by Van Durme and Pa§ca (2008) and extended by Pa§ca (2010).",
        "Manually specified patterns are used to extract a seed set of class labels and the resulting label lists are reranked using cluster purity measures.",
        "561K labels for base noun phrases are collected.",
        "Table 1 shows an example set of class labels extracted for several common noun phrases.",
        "Similar repositories of IsA labels, extracted using other methods, are available for experimental purposes (Talukdar and Pereira, 2010).",
        "In addition to extracted rules, the clc grammar is augmented with a set of null rules, one per unigram, ensuring that every query has a valid parse.",
        "In addition to the observed class-label production rules, clc incorporates two sets of latent production rules coupled via an HDP (Figure 1).",
        "Class label^query span productions extracted from raw text are clustered into a set of latent label production clusters L = [l\\,..., Zoo }.",
        "Each label production cluster lk defines a multinomial distribution over class labels V parametrized by 0^.",
        "Conceptually, <$>\\ captures a set of class labels with similar productions that are found in similar queries, for example the class labels states, northeast states, u.s. states, state areas, eastern states, and certain states might be included in the same coarse-grained cluster due to similarities in their productions.",
        "Each query q G Q is assigned to a latent query cluster cq G C{ci,... ,co}, which defines a distribution over label production clusters L, denoted <0?.",
        "Query clusters capture broad correlations between label production clusters and are necessary for performing sense disambiguation and capturing selectional preference.",
        "Query clusters and label production clusters are linked using a single HDP, allowing the number of label clusters to vary over the course of Gibbs sampling, based on the variance of the underlying data (Section 3.3).",
        "Viewed as a grammar, clc only contains unary rules mapping labels to query spans; production correlations are captured directly by the query cluster, unlike in HDP-PCFG (Liang et al., 2007), as branching parses over the en-",
        "label clusters",
        "Figure 2: Generative process and graphical model for clc.",
        "The top section of the model is the standard HDP prior; the middle section is the additional machinery necessary for modeling latent groupings and the bottom section contains the indicators for the latent class model.",
        "PCFG likelihood is not shown.",
        "tire label sparse are intractably large.",
        "Given a query q, a query cluster assignment cq and a set of label production clusters L, we define a parse of q to be a sequence of productions tq forming a parse tree consuming all the tokens in q.",
        "As with Bayesian PCFGs (Johnson, 2010), the probability of a tree tq is the product of the probabilities of the production rules used to construct it where Rq is the set of production rules used to derive tq, P(r\\(/>L ) is the probability of r given its label cluster assignment lr, and P(lr \\4>C'q) is the probability of label cluster lr in query cluster c.",
        "The probability of a query q is the sum of the probabilities of the parse trees that can generate it, where {t\\y(t) = q} is the set of trees with q as their yield (i.e., generate the string of tokens in q).",
        "We complete the Bayesian generative specification of clc with an HDP prior linking <F and <<L. The HDP is a Bayesian generative model ofshared structure for grouped data (Teh et al., 2006).",
        "A set of base clusters ß – GEM(y) is drawn from a Dirichlet Process with base measure 7 using the stick-breaking construction, and clusters for each group k,",
        "7 - hdp-lg base-measure smoother; higher values lead to more uniform mass over label clusters.",
        "aC - Query cluster smoothing; higher values lead to more uniform mass over label clusters.",
        "aL - Label cluster smoothing; higher values lead",
        "to more label diversity within clusters.",
        "I - Query cluster assignment smoothing; higher values lead to more uniform assignment.",
        "Table 2: clc-hdp-lg hyperparameters.",
        "<C – DP(ß), are drawn from a separate Dirichlet Process with base measure ß, defined over the space of label clusters.",
        "Data in each group k are conditionally independent given ß.",
        "Intuitively, ß defines a common \"menu\" of label clusters, and each query cluster <C defines a separate distribution over the label clusters.",
        "In order to account for variable query-cluster assignment, we extend the HDP model with latent groupings nq – Dir(£) for each query.",
        "The resulting Hierarchical Dirichlet Process with Latent Groups (hdp-lg) can be used to define a set of query clusters over a set of (potentially infinite) base label clusters (Figure 2).",
        "Each query cluster <C (latent group) assigns weight to different subsets of the available label clusters <L, capturing correlations between them at the query level.",
        "Each query q maintains a distribution over query clusters nq, capturing its affinity for each latent group.",
        "The full generative specification of clc is shown in Figure 2; hyperparameters are shown in Table 2.",
        "In addition to the full joint clc model, we evaluate several simpler models:",
        "Indices",
        "Cardinality",
        "HDP base measure Query cluster Label cluster",
        "ß",
        "<L",
        " – GEM(y)",
        " – DP(aC, ß)",
        " – Dirichlet(aL)",
        "i e \\C| k e \\L\\",
        "\\L\\ to \\l\\ to \\V \\",
        "Query cluster ind",
        "nq",
        "cq",
        "- Dirichlet(^)",
        " – nq",
        "q e\\Q\\ q e\\Q\\",
        "\\C \\ 1",
        "Label cluster ind Label ind",
        "zq,t lq,t",
        " – L",
        "t e q,q e \\Q\\ t e q,q e \\Q\\",
        "1 1",
        "1. clc-base - no query clusters, one label per label cluster.",
        "2. clc-dpmm - no query clusters, DPMM(aC) distribution over labels.",
        "3. clc-hdp-lg - full hdp-lg model with \\C\\ query clusters over a potentially infinite number of query clusters.",
        "as well as various hyperparameter settings.",
        "We perform inference in clc via Gibbs sampling, leveraging Multinomial-Dirichlet conjugacy to integrate out n, 4>c and <L (Teh et al., 2006; Johnson et al., 2007b).",
        "The remaining indicator variables c, z and l are sampled iteratively, conditional on all other variable assignments.",
        "Although there are an exponential number of parse trees for a given query, this space can be sampled efficiently using dynamic programming (Finkel et al., 2006; Johnson et al., 2007b) In order to apply clc to Web-scale data, we implement an efficient parallel approximate Gibbs sampler in the MapReduce framework Dean and Ghemawat (2004).",
        "Each Gibbs iteration consists of a single MapReduce step for sampling, followed by an additional MapReduce step for computing marginal counts.",
        "Relevant assignments c, z and l are stored locally with each query and are distributed across compute nodes.",
        "Each node is responsible only for resampling assignments for its local set of queries.",
        "Marginals are fetched opportunistically from a separate distributed hash server as they are needed by the sampler.",
        "Each Map step computes a single Gibbs step for 10% of the available data, using the marginals computed at the previous step.",
        "By resampling only 10% of the available data each iteration, we minimize the potentially negative effects of using the previous step's marginal distribution."
      ]
    },
    {
      "heading": "4. Experimental Setup 4.1 Query Corpus",
      "text": [
        "Our dataset consists of a sample of 450M English queries submitted by anonymous Web users to",
        "Query length",
        "Figure 3: Distribution in the query corpus, broken down by query length (red/solid=all queries; blue/dashed=queries with ambiguous spans); most queries contain between 2-6 tokens.",
        "Google.",
        "The queries have an average of 3.81 tokens per query (1.7B tokens).",
        "Single token queries are removed as the model is incapable of using context to disambiguate their meaning.",
        "Figure 3 shows the distribution of remaining queries.",
        "During training, we include 10 copies of each query (4.5B queries total), allowing an estimate of the Bayes average posterior from a single Gibbs sample.",
        "Query markup is evaluated for phrase-chunking precision (Section 5.1) and label precision (Section 5.2) by human raters across two different samples: (1) an unbiased sample from the original corpus, and (2) a biased sample of queries containing ambiguous spans.",
        "Two raters scored a total of 10K labels from 800 spans across 300 queries.",
        "Span labels were marked as incorrect (0.0), badspan (0.0), ambiguous (0.5), or correct (1.0), with numeric scores for label precision as indicated.",
        "Chunking precision is measured as the percentage of labels not marked as badspan.",
        "We report two sets of precision scores depending on how null labels are handled: Strict evaluation treats null-labeled spans as incorrect, while Normal evaluation removes null-labeled spans from the precision calculation.",
        "Normal evaluation was included since the simpler models (e.g., clc-base) tend to produce a significantly higher number of null assignments.",
        "Model evaluations were broken down into maximum a posteriori (MAP) and Bayes average estimates.",
        "MAP estimates are calculated as the single most likely label/cluster assignment across all query copies; all assignments in the sample are averaged",
        "(",
        "\\",
        "_",
        "___",
        "Gibbs iterations",
        "Figure 4: Convergence rates of clc-base (red/solid), clc-hdp-lg 100C,40L (green/dashed), clc-hdp-lg 1000C,40L (blue/dotted) in terms of % of query cluster swaps, label cluster swaps and null rule assignments.",
        "to obtain the Bayes average precision estimate.5 Results",
        "A total of five variants of clc were evaluated with different combinations of |C | and HDP prior concentration aC (controlling the effective number of label clusters).",
        "Referring to models in terms of their parametrizations is potentially confusing.",
        "Therefore, we will make use of the fact that models with aC = 1 yielded roughly 40 label clusters on average, and models with aC = 0.1 yielded roughly 200 label clusters, naming model variants simply by the number of query and label clusters: (1) clc-base, (2) clc-dpmm 1C-40L, (3) clc-hdp-lg 100C-40L, (4) clc-hdp-lg 1000C-40L, and (5) clc-hdp-lg 1000C-200L.",
        "Figure 4 shows the model convergence for clc-base, clc-hdp-lg 100C-40L, and clc-hdp-lg 1000C-40L.",
        "Chunking precision scores for each model are shown in Table 3 (average % of labels not marked badspan).",
        "clc-hdp-lg 1000C-40L has the highest precision across both MAP and Bayes estimates ( – 93%% accuracy), followed by clc-hdp-lg 1000C-200L (-90% accuracy) and clc-dpmm 1C-40L ( – 85%).",
        "clc-base performed the worst by a significant margin ( – 78%), indicating that label coarse-graining is more important than query clustering for chunking accuracy.",
        "No significant differences in label chunking accuracy were found between Bayes and MAp inference.",
        "The full clc-hdp-lg model variants obtain higher label precision than the simpler models, with clc-hdp-lg 1000C-40L achieving the highest precision of the three ( – 63% accuracy).",
        "Increasing the number of label clusters too high, however, significantly reduces precision: clc-hdp-lg 1000C-200L obtains only – 51% accuracy.",
        "However, comparing to clc-dpmm 1C-40L and clc-base demonstrates that the addition of label clusters and query clusters both lead to gains in label precision.",
        "These relative rankings are robust across strict and normal evaluation regimes.",
        "The breakdown over MAP and Bayes posterior estimation is less clear when considering label precision: the simpler models clc-base and clc-dpmm 1C-40L perform significantly worse than Bayes when using MAP estimation, while in clc-hdp-lg the reverse holds.",
        "There is little evidence for correlation between precision and query length (weak, not statistically significant negative correlation using Spearman's p).",
        "This result is interesting as the relative prevalence of natural language queries increases with query length, potentially degrading performance.",
        "However, we did find a strong positive correlation between precision and the number of labels productions applicable to a query, i.e., production rule fertility is a potential indicator of semantic quality.",
        "Finally, the histogram column in Table 3 shows the distribution of rater responses for each model.",
        "In general, the more precise models tend to have a significantly lower proportion of missing spans Model Chunking Label Precision Ambiguous Label Precision Spearman's p Class-Label Correlation Base",
        "•",
        "\\",
        "♦ «",
        " – – ■",
        "v",
        "■ ■ ■ ■",
        "v",
        "♦ – ",
        "v_♦",
        "_N",
        "* - ■ .",
        "■ ■ ■ ■",
        "B",
        "■ – – ",
        "Table 3: Chunking and label precision across five models.",
        "Confidence intervals are standard error; sparklines show distribution of precision scores (left is zero, right is one).",
        "Hist shows the distribution of human rating response (log y scale): green/first is correct, blue/second is ambiguous, cyan/third is missing and red/fourth is incorrect.",
        "Spearman's p columns give label precision correlations with query length (weak negative correlation) and the number of applicable labels (weak to strong positive correlation); dots indicate significance.",
        "(blue/second bar; due to null rule assignment) in additional to more correct (green/first) and fewer incorrect (red/fourth) spans.",
        "We repeat the analysis of label precision on a subset of queries containing one of the manually-selected polysemous spans shown in Table 4.",
        "The clc-hdp-lg based models still significantly outperform the simpler models, but unlike in the broader setting, clc-hdp-lg 100C-40L significantly outperforms clc-hdp-lg 1000C-40L, indicating that lower query cluster granularity helps address polysemy (Table 3).",
        "Figure 5 gives examples of both high-precision and low-precision queries markups inferred by clc-hdp-lg.",
        "In general, clc performs well on queries with clear intent head/intent modifier structure (Li, acapella, alamo, apple, atlas, bad, bank, batman, beloved, black forest, bravo, bush, canton, casino, champion, club, comet, concord, dallas, diamond, driver, english, ford, gamma, ion, lemon, manhattan, navy, pa, palm, port, put, resident evil, ronaldo, sacred heart, saturn, seven, solution, sopranos, sparta, supra, texas, village, wolf, young",
        "Table 4: Samples from a list of 90 manually selected ambiguous spans used to evaluate model performance under polysemy.",
        "2010).",
        "More complex queries, such as [never know until you try quotes] or [how old do you have to be a bartender in new york] do not fit this model; however, expanding the set of extracted labels to also cover instances such as never know until you try would mitigate this problem, motivating the use of n-gram language models with semantic markup.",
        "A large number of mistakes made by clc are",
        "Bayes@10",
        "78.7±1.U",
        "35.8i1.2u.",
        "I 35.4i2.0",
        "U_",
        "33.2i1.9",
        "U_",
        "-0.13",
        "0.51*",
        "Bayes@20",
        "78.7±1.U",
        "37.7i1.2u,",
        "35.8i1.2u.",
        "i 35.4i2.0",
        "Uj",
        "33.2i1.9",
        "U,",
        "-0.13",
        "0.51*",
        "MAP",
        "76.3±2.2 U",
        "33.3i2.2u.",
        "31.8i2.2u,",
        ".1 36.2i4.0",
        "Li",
        "33.2i3.8",
        "U,",
        "-0.13",
        "0.52*",
        "Class-Label",
        "Correlation DPMM 1C 40L",
        "Bayes@10",
        "84.9±0.4 ,J",
        "46.6i0.6u_,",
        "44.3i0.5 \\ – /",
        "1 36.0i1.1",
        "\\_,",
        "33.7i1.0",
        "u.",
        "-0.05",
        "0.25",
        "Bayes@20",
        "84.8±0.4 ,_l",
        "47.4±0.5 l.",
        "45.2i0.5 l.",
        "1 37.8i1.0",
        "\\_",
        "35.5i1.0",
        "u-",
        "-0.02",
        "0.23",
        "MAP",
        "84.1±0.8 J",
        "42.6i1.0i_,",
        "40.5i0.9 l.",
        "i 11.2i1.3",
        "L_",
        "10.6i1.3",
        "L_",
        "-0.03",
        "0.12",
        "Class-Label",
        "Correlation HDP-LG 100C 40L",
        "Bayes@10",
        "83.8±0.4 J",
        "55.6i0.5^",
        "51.0i0.5 1",
        "l 55.6i1.0",
        "47.7i1.0",
        "Lj-",
        "0.03",
        "0.44*",
        "Bayes@20",
        "83.6±0.4 ,J",
        "56.9±0.5 ^",
        "52.3i0.5",
        "1 57.4i1.0",
        "49.8i0.9",
        "Ui",
        "0.04",
        "0.41*",
        "MAP",
        "82.7±0.5 ,J",
        "58.5i0.5__,",
        "53.6i0.5 ^",
        "i 60.4i1.1",
        "\\_r",
        "51.5i1.0",
        "U\\",
        "0.02",
        "0.41*",
        "Class-Label",
        "Correlation HDP-LG 1000C",
        "40L",
        "Bayes@10",
        "93.1±0.2 J",
        "61.1±0.3^",
        "60.0i0.3 1",
        "1 43.2i0.9",
        "\\_a",
        "40.2i0.9",
        "La",
        "-0.06",
        "0.26*",
        "Bayes@20",
        "92.8±0.2 J",
        "62.6±0.3^",
        "61.7i0.3 1",
        "1 44.9i0.8",
        "\\_-",
        "42.2i0.8",
        "L>",
        "-0.10",
        "0.27*",
        "MAP",
        "92.7±0.2 J",
        "63.7±0.3^",
        "62.7i0.3 1",
        "l 44.1 i0.9",
        "\\_a",
        "41.1i0.9",
        "La",
        "-0.12",
        "0.28*",
        "Class-Label",
        "Correlation HDP-LG 1000C",
        "200L",
        "Bayes@10",
        "90.3±0.5 J",
        "50.9±0.8 w",
        "48.6i0.7 1",
        "■1 45.8i1.5",
        "L.",
        "42.5i1.3",
        "L_",
        "-0.10",
        "0.13",
        "Bayes@20",
        "89.9±0.5 J",
        "50.2±0.7 ^",
        "48.0i0.7 v__",
        "i 44.4i1.4",
        "Lj",
        "41.3i1.3",
        "L-",
        "-0.08",
        "0.11",
        "MAP",
        "90.0±0.6 J",
        "51.0i0.8-_,",
        "48.9i0.8 I",
        ".1 49.2i1.5",
        "46.0i1.4",
        "-0.07",
        "0.04",
        "O Q.",
        "postage cost dvd royal mail baltimore marathon road closures crossroads calgary furniture life\" insurance cash surrender value club Peterborough that have internal rhyme the dollar getting stronger 2008 meatball digitizing medical records",
        "lî.",
        "uconn basketball game black forest pie pictures",
        "Figure 5: Examples of high-and low-precision query markups inferred by clc-hdp-lg.",
        "Black text is the original query; lines indicate potential spans; small text shows potential labels colored and numbered by label cluster; small bar shows percentage of assignments to that label cluster.",
        "due to named-entity categories with weak semantics such as rock bands or businesses (e.g., [tropical breeze cleaners], [cosmic railroad band] or [sopranos cigars]).",
        "When the named entity is common enough, it is detected by the rule set, but for the long tail of named entities this is not the case.",
        "One potential solution is to use a stronger notion of selectional preference and slot-filling, rather than just relying on correlation between labels.",
        "Other examples of common errors include interpreting weymouth in [weymouth train time table] as a town in Massachusetts instead of a town in the UK (lack of domain knowledge), and using lower quality semantic labels (e.g., neighboring countries for france, or great retailers for target)."
      ]
    },
    {
      "heading": "6. Discussion and Future Work",
      "text": [
        "Adding both latent label clusters (DPMM) and latent query clusters (extending to HDP-LG) improve chunking and label precision over the baseline clc-base system.",
        "The label clusters are important because they capture intra-group correlations between class labels, while the query clusters are important for capturing intergroup correlations.",
        "However, the algorithm is sensitive to the relative number of clusters in each case: Too many labels/label clusters relative to the number of query clusters make it difficult to learn correlations (O(n) query clusters are required to capture pairwise interactions).",
        "Too many query clusters, on the other hand, make the model intractable computationally.",
        "The HDP automates selecting the number of clusters, but still requires manual hyperparameter setting.",
        "(Future Work) Many query slots have weak semantics and hence are misleading for clc.",
        "For example [pacific breeze cleaners] or [dale hartley subaru] should be parsed such that the type of the leading slot is determined not by its direct content, but by its context; seeing subaru or cleaners after a noun-phrase slot is a strong indicator of its type (dealership or shop name).",
        "The current clc model only couples these slots through their correlations in query clusters, not directly through relative position or context.",
        "Binary productions in the PCFG or a discriminative learning model would help address this.",
        "Finally, we did not measure label coverage with respect to a human evaluation set; coverage is useful as it indicates whether our inferred semantics are biased with respect to human norms."
      ]
    },
    {
      "heading": "7. Conclusions",
      "text": [
        "We introduced clc, a set of latent variable PCFG models for semantic analysis of short textual segments.",
        "clc captures semantic information in the form of interactions between clusters of automatically extracted class-labels, e.g., finding that place-names commonly co-occur with business-names.",
        "We applied clc to a corpus containing 500M search queries, demonstrating its scalability and straightforward parallel implementation using frameworks like MapReduce or Hadoop.",
        "clc was able to chunk queries into spans more accurately and infer more precise labels than several sub-models even across a highly ambiguous query subset.",
        "The key to obtaining these results was coarse-graining the input class-label set and using a latent variable model to capture interactions between coarse-grained labels."
      ]
    }
  ]
}
