{
  "info": {
    "authors": [
      "Svetlana Stoyanchev",
      "Paul Piwek"
    ],
    "book": "Proceedings of the SIGDIAL 2011 Conference",
    "id": "acl-W11-2040",
    "title": "The CODA System for Monologue-to-Dialogue Generation",
    "url": "https://aclweb.org/anthology/W11-2040",
    "year": 2011
  },
  "references": [
    "acl-N10-1086",
    "acl-P09-1075",
    "acl-P11-2042",
    "acl-W01-1605"
  ],
  "sections": [
    {
      "text": [
        "Centre for Research in Computing",
        "This paper describes an implemented monolingual Text-to-Text generation system.",
        "The system takes monologue and transforms it to two-participant dialogue.",
        "The system uses mappings between discourse relations in text and dialogue acts in dialogue.",
        "These mappings are extracted from a parallel monologue and dialogue corpus."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "This paper describes the CODA system, a Text-to-Text generation system that converts text parsed with discourse relations (Mann and Thompson, 1988) into information-delivering dialogue between two characters.",
        "By information-delivering dialogue, we mean dialogue (akin to that used by Plato) that is used primarily to convey information and possibly also to make an argument; this in contrast with dramatic dialogue which focuses on character development and narrative.",
        "Several empirical studies show that delivering information as dialogue, rather than monologue, can be particularly effective for education (Craig et al., 2000; Lee et al., 1998) and persuasion (Suzuki and Yamada, 2004).",
        "Information-delivering dialogue also lends itself well for presentation through computer-animated agents (Prendinger and",
        "Ishizuka, 2004).",
        "With most information locked up in text (books, newspapers, leaflets, etc.",
        "), automatic generation of dialogue from text in monologue makes it possible to convert information into dialogue on demand.",
        "In contrast to previous Text-to-Dialogue systems (Piwek et al., 2007), the CODA system is data-driven and modular.",
        "The system is composed of three modules: Dialogue Modeller, Verbalizer, and Dialogue Merger.",
        "The Dialogue modeller determines appropriate dialogue act sequences that can be used for converting a segment of input text containing a single discourse relation into dialogue.",
        "The module is data-oriented in that the mappings it uses between discourse structure and dialogue act sequences have been derived from the CODA parallel monologue/dialogue corpus (Stoyanchev and Piwek, 2010).",
        "The Verbalizer converts text segments together with a specification of the target dialogue act types into dialogue utterances.",
        "The Dialogue modeller and verbaliser components overgenerate possible outputs for each discourse relation in monologue.",
        "The Dialogue Merger component selects one of the proposed outputs for each text segment of the input and merges them into a single coherent dialogue."
      ]
    },
    {
      "heading": "2. System Design",
      "text": [
        "In this section we describe the three components of the system: dialogue modeller, verbalizer, and dialogue merger.",
        "Before we look at each of the modules, we, however, first need to specify more precisely what the input for our system is.",
        "The system expects text that has already been annotated with a discourse structure.",
        "There have been recent encouraging advances in the automatic parsing of discourse structure, e.g., see duVerle and Prendinger (2009), but the state-of-the-art is not yet at a point where it provides sufficiently reliable inputs for our purposes.",
        "To demonstrate the functionality of our system without relying on still imperfect discourse parsing, we use the RST-parsed Wall Street Journal corpus as input (Carlson et al., 2001).",
        "Throughout the remainder of this section, we use the outputs for each of the modules in Table 1 as a running example.",
        "The Dialogue Modeller component takes as input a snippet of monologue text annotated with discourse structure.",
        "For each input Discourse Relation structure (DR), the dialogue modeller outputs a set ofdia-logue act (DA) sequences appropriate for expressing the same information, but now in dialogue form.",
        "The Dialogue modeller uses a configuration XML file to look up possible DA sequences for the input DA sequence",
        "YesNoQ; Explain",
        "YesNoQ; Yes; Explain",
        "Explain; ComplexQ; Explain",
        "ComplexQ; Explain",
        "Explain; YesNoQ; Resp-Answer-Yes",
        "Explain; Contradict",
        "Factoid-Info-Req;Factoid-Resp;Explain Exlain; Resp-Agree;Explain discourse structure.",
        "In the current system configuration we extract these mappings from the CODA parallel corpus of professionally authored dialogues and parallel monologues.",
        "We use the eight most frequent DA sequences (see Table2) that occur on the dialogue side of discourse relations in the parallel dataset.",
        "Each discourse relation is mapped to one or more DA sequences with a score indicating frequency of this mapping in the CODA corpus.",
        "The dialogue modeller can be customised with mappings from other sources such as a different corpus, manually authored mappings or a mapping arrived at through experimental methods.",
        "The current version of the dialogue modeller supports input with only one level of discourse structure annotation.",
        "As a result, all input structures contain parts made of two segments and one discourse relation between these segments.",
        "In the future work, we plan to implement a dialogue modeller that accepts more complex (nested) discourse structures.",
        "The verbalizer is rule-based and has three types of rules: discourse relation (DR)-specific, generic, and canned.",
        "All of the rules take as input a monologue segment and a target dialogue act.",
        "DR-specific rules also use the discourse relation and segment nuclear-ity of the input segment.",
        "The verbalization rules are ordered according to their priority with DR-specific rules having a higher priority.",
        "Generic and DR-specific rules use the CMU question generation tool (Heilman and Smith, 2010) in combination with syntactic and lexical manipulation rules.",
        "Canned text rules are used to generate An-swerYes, Agree and Clarify dialogue acts by probabilistic selection from a set of utterances extracted from the CODA corpus.",
        "For example, the Agree dialogue act is verbalized as one of the statements: I agree with you; I agree; I couldn't agree more; I completely agree; Absolutely; Very true; Right; True.",
        "Probabilistic selection from a list allows us to generate non-repetitive dialogues.",
        "The system is extendible, such that new rules can be easily added to the implementation.",
        "Input",
        "MANNER-MEANS [In September, Ashland settled the long-simmering dispute] [by agreeing to pay Iran $325 million.]",
        "Dialogue Modeller",
        "1.",
        "(ComplexQ; Explain)",
        "2.",
        "(Explain; ComplexQ; Explain)",
        "3.",
        "(Explain; YesNoQ; Explain)",
        "Verbalizer DA Seql",
        "A: How did Ashland settle the long-simmering dispute in September?",
        "B: By agreeing to pay Iran $325 million.",
        "Verbalizer DA Seq2",
        "A: In September, Ashland settled the long-simmering dispute.",
        "B: How?",
        "A: By agreeing to pay Iran $325 million.",
        "Verbalizer DA Seq3",
        "A: In September, Ashland settled",
        "the long-simmering dispute.",
        "B: By agreeing to pay Iran $325",
        "million?",
        "A: Correct.",
        "Dialogue Merger",
        "Select one of the DA sequences based on overall dialogue",
        "The Dialogue Merger component takes as input verbalized dialogue act sequences.",
        "The tasks of the Dialogue Merger include: 1) selecting the best verbalized sequence and 2) assigning speaker roles (teacher or student) to dialogue turns.",
        "We aim to create diverse dialogues, in particular, by avoiding repetitive use of the same dialogue act sequences.",
        "This is achieved as follows.",
        "Selection of DA sequence is incremental, considering one relation at a time.",
        "For each relation, the dialogue merger selects a dialogue act sequence that has been successfully verbalized by the verbalizer and which, so far, has been used the smallest number of times (out of all the sequences that have been used up to this point).",
        "Although in the original authored dialogues, both teacher and student ask questions and give explanations, in our preliminary experiments observers made negative comments about mixing initiative between the student and the teacher in the generated dialogues.",
        "In the current version, the speaker roles are assigned based on the dialogue act.",
        "All questions and clarification requests are assigned to the student and other dialogue acts are assigned to the teacher.",
        "As an additional post-processing step, to maintain perspective in the dialogue, we change pronouns in the dialogue turns.",
        "The turns assigned to the teacher character remain unchanged.",
        "The turns assigned to the student character change the perspective: non-possessive pronouns are inverted, e.g. you – I, we – us, my – your."
      ]
    },
    {
      "heading": "3. Conclusions and Further Work",
      "text": [
        "In this paper, we described a Text-to-Dialogue generation system that converts text annotated with discourse relations into dialogue.",
        "The system is modular, data-driven, and takes advantage of state-of-the-art question generation tools.",
        "Our evaluation of the dialogue modeller and verbalizer components described in (Piwek and Stoyanchev, 2011) shows that both accuracy and fluency of generated dialogues are not worse than that of human-written dialogues.",
        "We plan to release the CODA Text-to-Dialogue system as open source code later this year.",
        "The system can be used as a starting point for researchers interested in evaluating NLP tools for question generation, dialogue modelling and paraphrasing in a dialogue generation task."
      ]
    }
  ]
}
