{
  "info": {
    "authors": [
      "Daniël de Kok",
      "Barbara Plank",
      "Gertjan van Noord"
    ],
    "book": "Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies",
    "id": "acl-P11-2034",
    "title": "Reversible Stochastic Attribute-Value Grammars",
    "url": "https://aclweb.org/anthology/P11-2034",
    "year": 2011
  },
  "references": [
    "acl-A00-2021",
    "acl-C00-1085",
    "acl-J97-4005",
    "acl-N03-2021",
    "acl-P02-1035",
    "acl-P04-1014",
    "acl-P05-1011",
    "acl-P09-2025",
    "acl-P99-1069",
    "acl-T75-1004",
    "acl-W05-1510",
    "acl-W06-1661",
    "acl-W07-1203",
    "acl-W07-2201"
  ],
  "sections": [
    {
      "text": [
        "Daniel de Kok Barbara Plank Gertjan van Noord",
        "d.j.a.de.kok@rug.nl b.plank@rug.nl g.j.m.van.noord@rug.nl",
        "An attractive property of attribute-value grammars is their reversibility.",
        "Attribute-value grammars are usually coupled with separate statistical components for parse selection and fluency ranking.",
        "We propose reversible stochastic attribute-value grammars, in which a single statistical model is employed both for parse selection and fluency ranking."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Reversible grammars were introduced as early as 1975 by Martin Kay (1975).",
        "In the eighties, the popularity of attribute-value grammars (AVG) was in part motivated by their inherent reversible nature.",
        "Later, AVG were enriched with a statistical component (Abney, 1997): stochastic AVG (SAVG).",
        "Training a SAVG is feasible if a stochastic model is assumed which is conditioned on the input sentences (Johnson et al., 1999).",
        "Various parsers based on this approach now exist for various languages (Toutanova et al., 2002; Riezler et al., 2002; van",
        "Clark and Curran, 2004; Forst, 2007).",
        "SAVG can be applied for generation to select the most fluent realization from the set of possible realizations (Velldal et al., 2004).",
        "In this case, the stochastic model is conditioned on the input logical forms.",
        "Such generators exist for various languages as well (Velldal and Oepen, 2006; Nakanishi and Miyao, 2005; Cahill et al., 2007; de Kok and van Noord, 2010).",
        "If an AVG is applied both to parsing and generation, two distinct stochastic components are required, one for parsing, and one for generation.",
        "To some extent this is reasonable, because some features are only relevant in a certain direction.",
        "For instance, features that represent aspects of the surface word order are important for generation, but irrelevant for parsing.",
        "Similarly, features which describe aspects of the logical form are important for parsing, but irrelevant for generation.",
        "Yet, there are also many features that are relevant in both directions.",
        "For instance, for Dutch, a very effective feature signals a direct object NP in fronted position in main clauses.",
        "If a main clause is parsed which starts with a NP, the disambiguation component will favor a subject reading of that NP.",
        "In generation, the fluency component will favor subject fronting over object fronting.",
        "Clearly, such shared preferences are not accidental.",
        "In this paper we propose reversible SAVG in which a single stochastic component is applied both in parsing and generation.",
        "We provide experimental evidence that such reversible SAVG achieve similar performance as their directional counterparts.",
        "A single, reversible model is to be preferred over two distinct models because it explains why preferences in a disambiguation component and a fluency component, such as the preference for subject fronting over object fronting, are shared.",
        "A single, reversible model is furthermore of practical interest for its simplicity, compactness, and maintainability.",
        "As an important additional advantage, reversible models are applicable for tasks which combine aspects of parsing and generation, such as word-graph parsing and paraphrasing.",
        "In situations where only a small amount of training data is available for parsing or generation, cross-pollination improves the performance of a model.",
        "If preferences are shared between parsing and generation, it follows that a generator could benefit from parsing data and vice versa.",
        "We present experimental results indicating that in such a bootstrap scenario a reversible model achieves better performance."
      ]
    },
    {
      "heading": "2. Reversible SAVG",
      "text": [
        "As Abney (1997) shows, we cannot use relatively simple techniques such as relative frequencies to obtain a model for estimating derivation probabilities in attribute-value grammars.",
        "As an alternative, he proposes a maximum entropy model, where the probability of a derivation d is defined as:",
        "fi(d) is the frequency of feature fi in derivation d. A weight Ai is associated with each feature fi.",
        "In (1), Z is a normalizer which is defined as follows, where Q is the set of derivations defined by the grammar:",
        "Training this model requires access to all derivations Q allowed by the grammar, which makes it hard to implement the model in practice.",
        "Johnson et al.",
        "(1999) alleviate this problem by proposing a model which conditions on the input sentence s: p(d\\s).",
        "Since the number of derivations for a given sentence s is usually finite, the calculation of the normalizer is much more practical.",
        "Conversely, in generation the model is conditioned on the input logical form l, p(d\\l) (Velldal et al., 2004).",
        "In such directional stochastic attribute-value grammars, the probability of a derivation d given an input x (a sentence or a logical form) is defined as:",
        "with Z(x) as (Q(x) are all derivations for input x):",
        "Consequently, the constraint put on feature values during training only refers to derivations with the same input.",
        "If X is the set of inputs (for parsing, all sentences in the treebank; for generation, all logical forms), then we have:",
        "xex den(x)",
        "Here we assume a uniform distribution for p (x).",
        "Let j (d) be a function which returns 0 if the derivation d is inconsistent with the treebank, and 1 in case the derivation is correct.",
        "p(x, d) is now defined in such a way that it is 0 for incorrect derivations, and uniform for correct derivations for a given input:",
        "^d'en(x)j (d )Directional SAVG make parsing and generation practically feasible, but require separate models for parse disambiguation and fluency ranking.",
        "Since parsing and generation both create derivations that are in agreement with the constraints implied by the input, a single model can accompany the attribute-value grammar.",
        "Such a model estimates the probability of a derivation d given a set of constraints c, p(d\\c).",
        "We use conditional maximum entropy models to estimate p(d\\c):",
        "We derive a reversible model by training on data for parse disambiguation and fluency ranking simultaneously.",
        "In contrast to directional models, we impose the two constraints per feature given in figure 1: one on the feature value with respect to the sentences S in the parse disambiguation treebank and the other on the feature value with respect to logical forms L in the fluency ranking treebank.",
        "As a result of the constraints on training defined in figure 1, the feature weights in the reversible model distinguish, at the same time, good parses from bad parses as well as good realizations from bad realizations."
      ]
    },
    {
      "heading": "3. Experimental setup and evaluation",
      "text": [
        "To evaluate reversible SAVG, we conduct experiments in the context of the Alpino system for Dutch.",
        "ieL den(i)",
        "Alpino provides a wide-coverage grammar, lexicon and parser (van Noord, 2006).",
        "Recently, a sentence realizer has been added that uses the same grammar and lexicon (de Kok and van Noord, 2010).",
        "In the experiments, the cdbl part of the Alpino Treebank (van der Beek et al., 2002) is used as training data (7,154 sentences).",
        "The WR-P-P-H part (2,267 sentences) of the LASSY corpus (van Noord et al., 2010), which consists of text from the Trouw 2001 newspaper, is used for testing.",
        "The features that we use in the experiment are the same features which are available in the Alpino parser and generator.",
        "In the following section, these features are described in some detail.",
        "Word adjacency.",
        "Two word adjacency features are used as auxiliary distributions (Johnson and Rie-zler, 2000).",
        "The first feature is the probability of the sentence according to a word trigram model.",
        "The second feature is the probability of the sentence according to a tag trigram model that uses the part-of-speech tags assigned by the Alpino system.",
        "In both models, linear interpolation smoothing for unknown trigrams, and Laplacian smoothing for unknown words and tags is applied.",
        "The trigram models have been trained on the Twente Nieuws Corpus corpus (approximately 110 million words), excluding the Trouw 2001 corpus.",
        "In conventional parsing tasks, the value of the word trigram model is the same for all derivations of a given input sentence.",
        "Lexical frames.",
        "Lexical analysis is applied during parsing to find all possible subcategorization frames for the tokens in the input sentence.",
        "Since some frames occur more frequently in good parses than others, we use feature templates that record the frames that were used in a parse.",
        "An example of such a feature is: \"'to play' serves as an intransitive verb\".",
        "We also use an auxiliary distribution of word and frame combinations that was trained on a large corpus of automatically annotated sentences (436 million words).",
        "The values of lexical frame features are constant for all derivations in sentence realization, unless the frame is not specified in the logical form.",
        "Dependency relations.",
        "There are also feature templates which describe aspects of the dependency structure.",
        "For each dependency, three types of dependency features are extracted.",
        "Examples of such features are \"a pronoun is used as the subject of a verb\", \"the pronoun 'she' is used as the subject of a verb\", \"the noun 'beer' is used as the object of the verb 'drink'\".",
        "In addition, features are used which implement auxiliary distributions for selectional preferences, as described in Van No-ord (2007).",
        "In conventional realization tasks, the values of these features are constant for all derivations for a given input representation.",
        "Syntactic features.",
        "Syntactic features include features which record the application of each grammar rule, as well as features which record the application of a rule in the context of another rule.",
        "An example of the latter is 'rule 167 is used to construct the second daughter of a derivation constructed by rule 233'.",
        "In addition, there are features describing more complex syntactic patterns such as: fronting of subjects and other noun phrases, orderings in the middle field, long-distance dependencies, and parallelism of conjuncts in coordination.",
        "Earlier we assumed that a treebank is a set of correct derivations.",
        "In practice, however, a treebank only contains an abstraction of such derivations (in our case sentences with corresponding dependency structures), thus abstracting away from syntactic details needed in a parse disambiguation model.",
        "As in Osborne (2000), the derivations for the parse disambiguation model are created by parsing the training corpus.",
        "In the current setting, up to at most 3000 derivations are created for every sentence.",
        "These derivations are then compared to the gold standard dependency structure to judge the quality of the parses.",
        "For a given sentence, the parses with the highest concept accuracy (van Noord, 2006) are considered correct, the rest is treated as incorrect.",
        "For fluency ranking we also need access to full derivations.",
        "To ensure that the system is able to generate from the dependency structures in the treebank, we parse the corresponding sentence, and select the parse with the dependency structure that corresponds most closely to the dependency structure in the treebank.",
        "The resulting dependency structures are fed into the Alpino chart generator to construct derivations for each dependency structure.",
        "The derivations for which the corresponding sentences are closest to the original sentence in the treebank are marked correct.",
        "Due to a limit on generation time, some longer sentences and corresponding dependency structures were excluded from the data.",
        "As a result, the average sentence length was 15.7 tokens, with a maximum of 26 tokens.",
        "To compare a realization to the correct sentence, we use the General Text Matcher (GTM) method (Melamed et al., 2003; Cahill, 2009).",
        "Models are trained by taking an informative sample of Q(c) for each c in the training data (Osborne, 2000).",
        "This sample consists of at most 100 randomly selected derivations.",
        "Frequency-based feature selection is applied (Ratnaparkhi, 1999).",
        "A feature f partitions Q(c), if there are derivations d and dd in Q(c) such that f (c, d) = f (c, d').",
        "A feature is used if it partitions the informative sample of Q(c) for at least two c. Table 1 lists the resulting characteristics of the training data for each model.",
        "We estimate the parameters of the conditional maximum entropy models using TinyEst, with a Gaussian (l2) prior distribution (p = 0, a = 1000) to reduce overfitting (Chen and Rosenfeld, 1999)."
      ]
    },
    {
      "heading": "4. Results",
      "text": [
        "Table 2 shows the results for parse disambiguation.",
        "The table also provides lower and upper bounds: the baseline model selects an arbitrary parse per sentence; the oracle chooses the best available parse.",
        "Figure 2 shows the learning curves for the directional parsing model and the reversible model.",
        "Table 2: Concept Accuracy scores and f-scores in terms of named dependency relations for the parsing-specific model versus the reversible model.",
        "The results show that the general, reversible, model comes very close to the accuracy obtained by the dedicated, parsing specific, model.",
        "Indeed, the tiny difference is not statistically significant.",
        "We compute statistical significance using the Approximate Randomization Test (Noreen, 1989).",
        "Table 3 compares the reversible model with a directional fluency ranking model.",
        "Figure 3 shows the learning curves for the directional generation model and the reversible model.",
        "The reversible model achieves similar performance as the directional model (the difference is not significant).",
        "To show that a reversible model can actually profit from mutually shared features, we report on an experiment where only a small amount of generation",
        "Model",
        "CA (%)",
        "f-score (%)",
        "Baseline",
        "75.88",
        "76.28",
        "Oracle",
        "94.86",
        "95.09",
        "Parse model",
        "90.93",
        "91.28",
        "Reversible",
        "90.87",
        "91.21",
        "Proportion parse training data",
        "Figure 2: Learning curve for directional and reversible models for parsing.",
        "The reversible model uses all training data for generation.",
        "Figure 3: Learning curves for directional and reversible models for generation.",
        "The reversible models uses all training data for parsing.",
        "Model GTM training data is available.",
        "In this experiment, we manually annotated 234 dependency structures from the cdbl part of the Alpino Treebank, by adding correct realizations.",
        "In many instances, there is more than one fluent realization.",
        "We then used this data to train a directional fluency ranking model and a reversible model.",
        "The results for this experiment are shown in Table 4.",
        "Since the reversible model outperforms the directional model we conclude that indeed fluency ranking benefits from parse disambiguation data."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "We proposed reversible SAVG as an alternative to directional SAVG, based on the observation that syntactic preferences are shared between parse disambiguation and fluency ranking.",
        "This framework is not purely of theoretical interest, since the experiments show that reversible models achieve accuracies that are similar to those of directional models.",
        "Moreover, we showed that a fluency ranking model trained on a small data set can be improved by complementing it with parse disambiguation data.",
        "The integration of knowledge from parse disambiguation and fluency ranking could be beneficial for tasks which combine aspects of parsing and generation, such as word-graph parsing or paraphrasing.",
        "Table 4: Fluency ranking using a small amount of annotated fluency ranking training data (difference is significant at p < 0.05)."
      ]
    }
  ]
}
