{
  "info": {
    "authors": [
      "Riza Theresa Batista-Navarro",
      "Sophia Ananiadou"
    ],
    "book": "Proceedings of BioNLP 2011 Workshop",
    "id": "acl-W11-0210",
    "title": "Building a Coreference-Annotated Corpus from the Domain of Biochemistry",
    "url": "https://aclweb.org/anthology/W11-0210",
    "year": 2011
  },
  "references": [
    "acl-M95-1001",
    "acl-M98-1029"
  ],
  "sections": [
    {
      "text": [
        "Riza Theresa Batista-Navarro''\"\" and Sophia Ananiadou12tt",
        "National Centre for Text Mining, University of Manchester, United Kingdom School of Computer Science, University of Manchester, United Kingdom Department of Computer Science, University of the Philippines Diliman, Philippines",
        "One of the reasons for which the resolution of coreferences has remained a challenging information extraction task, especially in the biomedical domain, is the lack of training data in the form of annotated corpora.",
        "In order to address this issue, we developed the HANAPIN corpus.",
        "It consists of full-text articles from biochemistry literature, covering entities of several semantic types: chemical compounds, drug targets (e.g., proteins, enzymes, cell lines, pathogens), diseases, organisms and drug effects.",
        "All of the co-referring expressions pertaining to these semantic types were annotated based on the annotation scheme that we developed.",
        "We observed four general types of coreferences in the corpus: sortal, pronominal, abbreviation and numerical.",
        "Using the MASI distance metric, we obtained 84% in computing the inter-annotator agreement in terms of Krip-pendorff's alpha.",
        "Consisting of 20 full-text, open-access articles, the corpus will enable other researchers to use it as a resource for their own coreference resolution methodologies."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Coreferences are linguistic expressions referring to the same real-world entity (Jurafsky and Martin, 2009).",
        "The process of grouping all co-referring expressions in text into respective coreference chains is known as coreference resolution.",
        "It was introduced as one of the tasks of the sixth Message Understanding Conference (MUC-6) in 1995 (Grishman and",
        "Sundheim, 1995) and is one of the information extraction tasks which have remained a challenge to this day.",
        "One of the reasons it is still considered an unresolved problem especially in the biomedical domain is the lack of coreference-annotated corpora which are needed for developing coreference resolution systems.",
        "There exist only a handful of biomedical corpora which are annotated with coreference information.",
        "We have conducted a review of each of them, taking into consideration their sizes, document composition, domain, types of markable entities, types of coreference annotated, availability, and reliability in terms of inter-annotator agreement.",
        "Of these, only two corpora have been used in coreference resolution systems developed outside the research group that annotated them: MEDSTRACT (Castano et al., 2002), and the MEDCo corpus of abstracts which was used by the different teams who participated in the Coreference Supporting Task of the BioNLP 2011 Shared Task.",
        "These two corpora are widely used, despite the fact that they are composed only of abstracts.",
        "Previous studies have shown the advantages of utilising full-text articles rather than abstracts in information extraction systems (Shah et al., 2003; Schumie et al., 2004; Cohen et al., 2010a).",
        "Furthermore, recent research on fact extraction (McIntosh and Curran, 2009) has demonstrated the need for processing full-text articles when identifying coref-erent expressions pertaining to biomedical entities.",
        "However, coreference-annotated corpora composed of full-text articles are not readily accessible.",
        "Currently, only the FlySlip corpus (Gasperin et al., 2007) is available for download.",
        "In this corpus, only gene-related entities were considered for coref-erence annotation.",
        "Thus, there is a need for developing full-text corpora with coreference annotations for more semantic types.",
        "This is currently being addressed by the CRAFT project (Cohen et al., 2010b) which seeks to develop a corpus of full-text articles with coreference annotations for more types of entities; it was not explicitly stated, however, exactly which types are being covered.",
        "Similarly, we are developing a corpus of full-text articles with corefer-ence annotations, but to further the aim of covering as many semantic types as possible, we selected a domain that covers a variety of semantic concepts.",
        "Research literature from this biochemistry subdomain, marine natural products chemistry, contains references pertaining to chemical compounds, organisms, drug targets such as proteins, enzymes, nucleic acids, tissues, cells, cell components, cell lines and pathogens, drug effects, as well as diseases.",
        "We cover a number of entity types with the intention of providing more insight into how to disambiguate co-referring expressions of different semantic types.",
        "An annotation scheme was developed, taking into consideration the coreference types which have been observed from the corpus, namely: sortal, pronominal, numerical and abbreviation.",
        "Three chemistry graduates were employed to annotate the corpus.",
        "To determine the reliability of the resulting annotations, we measured inter-annotator agreement in terms of Krippendorff's alpha."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "Coreference is often associated with the phenomenon of anaphora which is characterised by an expression (called an anaphor) that points back to an entity previously mentioned in the same discourse (called antecedent).",
        "Anaphora resolution is the process of determining the antecedent of an anaphor.",
        "While the output of anaphora resolution is a set of anaphor-antecedent pairs, that of corefer-ence resolution is a set of coreference chains which can be treated as equivalence classes.",
        "Despite this difference, an overlap between them may be observed in several cases.",
        "Often, a number of anaphor-antecedent pairs from a discourse are coreferential or refer to the same entity in the same domain, and may be placed in the same coreference chain.",
        "For this reason, we also included in our review of biomedical corpora those which were annotated with anaphora information and refer to them henceforth as coreference-annotated corpora.",
        "We determined the types of coreference annotated in each corpus we have reviewed, adapting Mitkov's classification of anaphora (Mitkov et al., 2000) which is also applicable to coreference.",
        "Nominal coreference is characterised by co-referring expressions pertaining to a noun.",
        "It is further divided into pronominal coreference and sortal coreference which use a pronoun and a lexical noun phrase, respectively, as co-referring expressions.",
        "Unlike nominal coreference, verbal coreference is characterised by co-referring expressions pertaining to verbs.",
        "Both nominal and verbal coreference can be broadly categorised according to the kind of relation as direct or indirect.",
        "In direct corefer-ence, co-referring expressions are related by identity, synonymy or specialisation; in indirect corefer-ence, they are related by associative relations such as meronymy or holonymy for nouns, and troponymy or entailment for verbs.",
        "Annotation of indirect coreference is usually more challenging as it requires more specialised domain knowledge.",
        "Presently, there are five (5) different biomedical corpora which are annotated with coreference information: MEDSTRACT (Castano et al., 2002), MEDCo, FlySlip (Gasperin et al., 2007), the Colorado Richly Annotated Full Text (CRAFT) corpus (Cohen et al., 2010b) and DrugNerAr (Segura-",
        "Bedmar et al., 2009).",
        "The MEDCo corpus has two subsets, one consisting of abstracts (which we shall refer to as MEDCo-",
        "A) and another consisting of full papers (MEDCo-",
        "B) .",
        "The results of our review of all five corpora are presented in Table 1.",
        "Included in the last row (HANAPIN) are the attributes of the corpus that we have developed for comparison with existing corpora.",
        "Three of them, MEDSTRACT, MEDCo and",
        "DrugNerAr, adapted an annotation scheme similar http://nlp.i2r.a-star.edu.sg/medco.html 'sullf'fu .7 0.",
        "lyblelyble tlylab lyble tlylab lybletlylabrelely) iclab iclab nai iclab nai iclabnaieicl lil li l e v li l e v li l e v b li bai bai rra bai rra bairrabb",
        "fts) fp CS OS CpcS OS CpctfOSwCp",
        "ct ctee ir ir actctreal mi miltio anscNIsanscNIs umanEpeumanEpehutraGtyhutraGty tio ntiti umpocump ts acts ers rs ract tra ape pers",
        "S S S - ote S",
        "UC UC UC maeci nto UC",
        "M M M dospe On M noricaviat to that of the Message Understanding Conference scheme or MUCCS (Hirschman, 1997).",
        "Using the Standard Generalized Markup Language (SGML) as annotation format, MUCCS creates a link between co-referring expressions by setting the value of an attribute of the referring element to the ID of the referent.",
        "The same mechanism is used in the annotation of MEDSTRACT, MEDCo and DrugNerAr, but with respective extensions to account for more specific relations (e.g., appositive relation in the case of MEDCo).",
        "On the contrary, rather than linking the referring expression to its referent, an annotator explicitly places co-referring expressions in the same coreference chain with OntoNotes, the scheme adapted in annotating the CRAFT corpus.",
        "FlySlip can be considered unique in terms of its annotation scheme as it adapted a domain-specific scheme which was necessary since indirect corefer-ences were annotated.",
        "All corpora are available in the form of a mark-up language (SGML or XML).",
        "The five corpora can be grouped into three according to general domain: molecular biology (MED-",
        "STRACT and MEDCo), genomics (FlySlip and",
        "CRAFT), and pharmacology (DrugNerAr).",
        "MED-STRACT and MEDCo both have coreference annotations for semantic types from the UMLS and the GENIA ontology, respectively, which can be broadly categorised into compound, organism, protein, gene and cell.",
        "Each of the FlySlip and DrugNerAr corpora, on the other hand, have annotations for only one general semantic type: gene-related entities and drugs, respectively.",
        "CRAFT is unique in this respect as its developers seek to annotate all co-referring expressions regardless of semantic type; the semantic types that have been encountered so far have not yet been reported, however.",
        "In terms of coreference types for which annotations have been added, CRAFT is the only corpus with annotations for verbal coreference; all the rest have annotations only for pronominal and/or sortal coreference.",
        "With respect to coreference types according to relation, FlySlip is the only corpus with annotations for indirect coreference.",
        "MEDCo-B, FlySlip and CRAFT are three existing corpora which are comprised of full-text articles.",
        "Among them, only FlySlip is currently publicly available.",
        "The corpus that we have developed, which we call the HANAPIN corpus, is also intended for public release in the near future and covers five general semantic types.",
        "In the annotation scheme which was designed and used in HANAPIN, two additional coreference types were considered: abbreviations and numerical coreferences which are commonly used in chemistry research literature.",
        "These coreference types and the annotation scheme are further described in the succeeding section."
      ]
    },
    {
      "heading": "3. Methodology",
      "text": [
        "Taking into consideration that the corpus should consist of full-text articles which can be distributed to the public, we gathered full-text articles from the journal Marine Drugs which is under the PubMed Central Open Access subset.",
        "The said journal covers subject areas such as marine natural products, medicine analysis, marine pharmacology, pharmaceutical biology, marine drugs development and marine biotechnology, among many others.",
        "From all of its articles from 2003 to 2009, we randomly selected twenty (20) which seemed to be a reasonable size considering that only five months were allocated for the annotation of the corpus, and that a previous study on biomedical corpora (Cohen et al., 2005) has shown that a corpus can possibly be widely used despite its small size.",
        "The experimental sections of the articles were not annotated as they contain very detailed descriptions of the methods carried out by the authors; according to a study (Shah et al., 2003), these usually contain technical data, instruments and measurements - types of information which are currently not of much interest to researchers doing biomedical information extraction, although they may be in the future.",
        "The corpus contains a total of 1,027 sentences or 27, 358 words.",
        "The coreferences observed in the corpus were categorised into four general nominal types: pronominal, sortal, numerical and abbreviation.",
        "Table 2 presents the subtypes of sortal and pronominal coreference, as well as examples for all types.",
        "We have decided not to take into account verbal and indirect coreferences; only nominal and direct coref-erences have been considered for the first release of the corpus.",
        "This type of coreference is characterised by a pronoun referring to a noun phrase.",
        "The pronoun is used as a substitute to a noun.",
        "We have further identified the following subtypes of pronominal coreference: demonstrative, personal, indefinite, distributive and relative.",
        "Also referred to as lexical noun phrase corefer-ence, sortal coreference is characterised by a noun phrase consisting of a head noun and its modifiers.",
        "The subtypes of sortal coreference which have been identified include: definite, indefinite, demonstrative, distributive, predicate nominative and apposi-tive.",
        "In chemistry research literature, a number is conventionally used to refer to a chemical entity which was introduced using the same number.",
        "Oftentimes, a range of numbers is also used to refer to a number of compounds previously mentioned.",
        "In annotating the HANAPIN corpus, abbreviations were also considered as co-referring expressions.",
        "We distinguish them from the other corefer-ence types to make the corpus of benefit to developers of abbreviation identification algorithms as well.",
        "The annotation scheme used in MEDCo (which was based on MUCCS) was adapted and modified for the annotation of the HANAPIN corpus.",
        "We have selected the MEDCo scheme as it already differentiates between the pronominal and identity (equivalent to sortal) types, whereas MUCCS has only the identity type.",
        "There was a need, however, to extend the MEDCo scheme to further specialise the corefer-ence types.",
        "The XML Concordancer (XConc) toolwas used in annotating the corpus.",
        "Configuring the said tool for our needs is straightforward as it only involved the customisation of a Document Type Definition (DTD) file.",
        "As a preliminary step, the scheme required that all terms which can be categorised into any of the",
        "General Coreference Type",
        "Subtype",
        "Examples",
        "demonstrative",
        "this, that, these, those",
        "personal",
        "it, they, its, their, theirs",
        "pronominal",
        "indefinite",
        "another, few, other, some, all, any",
        "distributive",
        "both, such, each, either, neither",
        "relative",
        "which, that, whose",
        "definite",
        "the loihichelins",
        "indefinite",
        "an alkaloid, a mycalamide",
        "sortal",
        "demonstrative",
        "this metabolite, these compounds",
        "distributive",
        "both compounds",
        "predicate nominative",
        "\"Galactans are polysaccharides...\"",
        "appositive",
        "\"Radiosumin, an N-methyl dipeptide...\"",
        "N.A.",
        "\"The structures of 1 and 2...\"",
        "numerical",
        "\"Compounds 1-3 inhibit...\"",
        "N.A.",
        "\"...as a membrane type 1 matrix",
        "abbreviation",
        "metalloproteinase (MT1-MMP) inhibitor.",
        "Compound 1 inhibitedMT1-MMP with...\"",
        "SBrhrouah hioactivity-quided chemical investigation of the frpthyl acetate^jj^sojuhlejlra^tio^-minor analogues of >jaspa mide<H, including Fthe new natural p\\oih\\cts^^ttS>jaspamide Q<ti35rin<i >fl<Hgjfc (>?<5EEI and >3<5ÊÉ) (Figure 1)",
        "faE!ln this papci, wç<tds<iil>eis()t<ilk)ivrs^iu(lui<iI elucidation, and bioloqical activity of : the nmv :jasp,.midi> dgrivative'^Hgl<âgr°&bath<llh-ef ^MrhicMol carry a modified ▻2-bromoabrine (N-methyl try ptophan)<B residue compared to BaspaniidegîEg (Fl<fl||0 ■_",
        "Figure 1: Sample annotations as shown in the XConc annotation tool.",
        "The sentences in this example come from one of the documents in the HANAPIN corpus, the Marine Drugs article with PubMed ID 19841723.",
        "For illustrative purposes, the first sentence in the example was slightly modified to demonstrate the use of the cons element.",
        "following semantic types be annotated:",
        "An annotator proceeds to the annotation of co-referring expressions after annotating all terms within a document.",
        "If an expression was found to be co-referring with another term, the annotator assigns the ID of the latter as the value of the idref attribute of the former.",
        "If the referring expression, however, is a noun phrase and not a term that was previously annotated during term annotation, it is marked as a ref element and then linked to its referent.",
        "Annotators delimit these expressions by including the necessary modifiers of the co-referring element (e.g., the new jaspamide derivatives instead of just jaspamide derivatives).",
        "A coreference type which could be any of pronominal, numerical, abbreviation, and sortal (further categorised into definite, indefinite, demonstrative, distributive, predicate nominative and appositive) is also assigned as the value of the type attribute of each link created.",
        "We decided not to further divide pronominal coref-erence into its subtypes as it became apparent during the annotation dry runs that there is only a handful of pronominal coreferences.",
        "Figure 1 shows co-referring expressions (connected by arrows) linked by the mechanism just described.",
        "Listed below are some of the main points of the annotation guidelines:",
        "1.",
        "A referring expression may be linked to multiple referents.",
        "2.",
        "The more specific one between two co-referring expressions is considered as the referent.",
        "This means that there might be cases when the referent occurs later than the referring expression.",
        "For example, R3 0:the new natural products is the co-referring expression and C5:jaspamide Q and R is the referent in Figure 1.",
        "3.",
        "In cases where there are multiple choices for the referent of a referring expression, the closest one may be chosen as long as it is (or will be) linked to the other choice expressions.",
        "4.",
        "There are cases when more than one type of coreference applies.",
        "For example, in Figure 1, the new natural products is both an appositive and a definite noun phrase.",
        "In such cases, the appositive and predicate nominative types take precedence over the other sortal types.",
        "</sentence> </sertence> tivity-guided chemical investigation of the",
        "sem=\"chem\">ethyl acetate</term> ion minor analogues of \" sem=\"chem\">jaspamide</term>, including idrefl=\"C5\" type=\"appos\">the new natural products</ref> idrefl=\"T67\" type=\"num\">3</ref>) (Figure 1) were obtained.",
        "\">In this paperj we describe isolation, structural elucidation, I activity of idrefl=\"C5\" type=\"definite\">the new \"TS8\" sem=\"chem\">jaspamide derivatives</term> idref 1=\"R11\" type=\"pron\">both</ref> of idrefl=\"R10\" type=\"pron\">which</ref> carry a modified \" sem=\"chem\">2-bromoabrine (N-methyltryptophan)</term= red to",
        "\" sem=\"chem\">jaspamide</term> £ id ref 1=\" T7 0 \" t y pe=\" n u m\" >!</ ref > ).",
        "One could process the XML code (provided in Figure 2 for the reader's reference) to obtain the following coreference chains:",
        "1.",
        "{R30:the new natural products, C5:jaspamide Q and R, R10:the new jaspamide derivatives, R11:which, R12:both}",
        "The complete annotation guidelines will be publicly released together with the annotated corpus."
      ]
    },
    {
      "heading": "1.. chemical compound",
      "text": []
    },
    {
      "heading": "2.. organism",
      "text": []
    },
    {
      "heading": "3.. drug effect",
      "text": []
    },
    {
      "heading": "4.. disease",
      "text": [
        "5. drug target (further categorised into: protein, enzyme, nucleic acid, tissue, cell, cell component, cell line, pathogen)",
        "For each markable, the annotator creates a term element which is assigned an ID and one of the semantic types above.",
        "The scheme supports the annotation of embedded terms, as well as terms in a discontinuous text region.",
        "The former entails placing a term element within another.",
        "The latter is done by dividing the discontinuous text into fragments and annotating each fragment in the same manner as an ordinary term element.",
        "The fragment elements are then grouped together as a constituent element (cons).",
        "Figure 1 presents a sample annotation of a discontinuous term (constituent C5) as viewed in",
        "XConc."
      ]
    },
    {
      "heading": "4. Results",
      "text": [
        "The three annotators were asked to complete the coreference annotations within five months.",
        "A biweekly meeting was held to address questions and issues which could not be addressed or resolved by means of the online project forum.",
        "As the HANAPIN corpus is the first of its kind from the biochemistry domain and aims to cover several semantic as well as coreference types, it is ofinterest to determine which of the types are most prevalent.",
        "To do this we computed statistics over the annotations (Figure 3).",
        "For each type, we obtained the average over the annotations from the three coders.",
        "There is a total of 395 coreference chains (not including singleton chains or those with only one mention) in the entire corpus.",
        "The coreference chains are of the following semantic types: chemical compounds (70.89%), drug targets (12.66% that accounts for proteins, cell lines, pathogens, enzymes, cells, cell parts, nucleic acids and tissues), organisms (9.87%), drug effects (3.29%), and diseases (3.29%).",
        "Among the drug targets, the most prevalent are proteins, cell lines and pathogens.",
        "A total of 760 coreference links have been found in the corpus.",
        "The most common among the types is the numerical one (46%), followed by the sortal type (33% that accounts for the definite, indefinite, demonstrative, appositive, predicate nominative and distributive types).",
        "Less common are the pronominal type (11%) and abbreviation (10%).",
        "Among the sortal coreferences, the most common are the definite and indefinite types, followed by the demonstrative type.",
        "Semantic Types",
        "Coreference Types",
        "Following Passoneau's proposed method for computing reliability for coreference annotation (Pas-soneau, 2004), we computed for the reliability of the corpus in terms of Krippendorff's alpha, a coefficient of agreement that allows for partial disagreement with the use of a distance metric based on the similarity between coreference chains.",
        "Passoneau's first proposed distance metric (dp) assigns 0 for identity, 0.33 for subsumption, 0.67 for intersection and 1 for disjunction.",
        "There are, however, alternative distance metrics that consider the sizes of the coreference chains, such as Jaccard's coefficient of community (dj) and Dice's coincidence index (dD ) which can be computed as follows (Art-stein and Peosio, 2004):",
        "A new distance metric called Measuring Agreement on Set-valued Items (MASI) was then later proposed by Passoneau.",
        "It is obtained by getting the product of the original distance metric dp and Jac-card's coefficient dJ.",
        "Initially using Passoneau's first proposed distance metric dP in computing for Krippendorff's alpha, we obtained an average of 75% over all documents in the HANAPIN corpus.",
        "Computing for alpha using the MASI distance metric gives 84%.",
        "Though there is no value of alpha that has been established to be an absolute indication of high agreement, previous works cited by Krippendorff have shown that values of alpha less than 67% indicate unreliability (Krippendorff, 1980).",
        "We can therefore regard the obtained values of alpha as satisfactory."
      ]
    },
    {
      "heading": "5. Conclusion and Future Work",
      "text": [
        "A coreference-annotated corpus from the domain of biochemistry, consisting of full-text articles, has been developed.",
        "It was annotated following guidelines which covered coreference and semantic types that have not been covered in other biomedical corpora before.",
        "This was done to further the aim of providing researchers with more insight into the phenomenon of coreference in a cross-disciplinary domain.",
        "Results show that in this biochemistry domain, the most common types of coreference being used by authors are the numerical and sortal types.",
        "Verbal and indirect coreferences, however, have not been considered at this stage; the annotation of these types can be explored as part of future work on the corpus.",
        "To measure reliability of the corpus, we determined inter-annotator agreement on all documents by computing for the value of Krippendorff's alpha.",
        "Using Passoneau's first proposed distance metric and the MASI distance metric, we obtained satisfactory values of 75% and 84%, respectively.",
        "The corpus and annotation guidelines will be released to the public to encourage and enable more researchers to develop improved biomedical coreference resolution methodologies.",
        "Acknowledgements",
        "The UK National Centre for Text Mining is funded by the UK Joint Information Systems Committee (JISC).",
        "The authors would also like to acknowledge the Office of the Chancellor, in collaboration with the Office of the Vice-Chancellor for Research and Development, of the University of the Philippines Diliman for funding support through the Outright Research Grant.",
        "The authors also thank Paul Thompson for his feedback on the annotation guidelines, and the anonymous reviewers for their helpful comments."
      ]
    }
  ]
}
