{
  "info": {
    "authors": [
      "Sebastian Riedel",
      "Andrew McCallum"
    ],
    "book": "Proceedings of BioNLP Shared Task 2011 Workshop",
    "id": "acl-W11-1807",
    "title": "Robust Biomedical Event Extraction with Dual Decomposition and Minimal Domain Adaptation",
    "url": "https://aclweb.org/anthology/W11-1807",
    "year": 2011
  },
  "references": [
    "acl-D10-1001",
    "acl-N10-1123",
    "acl-P05-1022",
    "acl-P08-2026",
    "acl-P11-1163",
    "acl-W09-1402",
    "acl-W09-1406",
    "acl-W11-1801",
    "acl-W11-1802",
    "acl-W11-1803",
    "acl-W11-1804",
    "acl-W11-1808"
  ],
  "sections": [
    {
      "text": [
        "Robust Biomedical Event Extraction with Dual Decomposition and Minimal",
        "Domain Adaptation",
        "Sebastian Riedel Andrew McCallum",
        "We present a joint model for biomedical event extraction and apply it to four tracks of the BioNLP 2011 Shared Task.",
        "Our model decomposes into three sub-models that concern (a) event triggers and outgoing arguments, (b) event triggers and incoming arguments and (c) protein-protein bindings.",
        "For efficient decoding we employ dual decomposition.",
        "Our results are very competitive: With minimal adaptation of our model we come in second for two of the tasks – right behind a version of the system presented here that includes predictions of the Stanford event extractor as features.",
        "We also show that for the Infectious Diseases task using data from the Genia track is a very effective way to improve accuracy."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "This paper presents the UMass entry to the BioNLP 2011 shared task (Kim et al., 2011a).",
        "We introduce a simple joint model for the extraction of biomedical events, and show competitive results for four tracks of the competition.",
        "Our model subsumes three tractable sub-models, one for extracting event triggers and outgoing edges, one for event triggers and incoming edges and one for protein-protein bindings.",
        "Fast and accurate joint inference is provided by combining optimizing methods for these three submodels via dual decomposition (Komodakis et al., 2007; Rush et al., 2010).",
        "Notably, our model constitutes the first joint approach that explicitly predicts which protein should share the same binding event.",
        "So far this has either been done through postprocessing heuristics (Björne et al., 2009; Riedel et 2010) .",
        "Our model is very competitive.",
        "For Genia (GE) Task 1 (Kim et al., 2011b) we achieve the second-best results.",
        "In addition, the best-performing FAUST system (Riedel et al., 2011) is a variant of the model presented here.",
        "Its advantage stems from the fact that it uses predictions of the Stanford system (Mc-Closky et al., 2011a; McClosky et al., 2011b), and hence performs model combination.",
        "The same holds for the Infectious Diseases (ID) track (Pyysalo et al., 2011) , where we come in as second right behind the FAUST system.",
        "For the Epigenetics and Post-translational Modifications (EPI) track (Ohta et al., 2011) we achieve the 4th rank, partly because we did not aim to extract speculations, negations or cellular locations.",
        "Finally, for Genia Task 2 we rank 3rd – with the 1st rank achieved by the FAUST system.",
        "In the following we will briefly describe our model and inference algorithm, as far as this is possible in limited space.",
        "Then we show our results on the three tasks and conclude.",
        "Note we will assume familiarity with the task, and refer the reader to the shared task overview paper for more details."
      ]
    },
    {
      "heading": "2. Biomedical Event Extraction",
      "text": [
        "Our goal is to extract biomedical events as shown in figure 1a).",
        "To formulate the search for such structures as an optimization problem, we represent structures through a set of binary variables.",
        "Our representation is inspired by previous work (Riedel et al., 2009; Björne et al., 2009) and based on a projection of events to a labelled graph over tokens in the",
        "Ç Regulation ~)",
        "Phosphorylation ^) Binding )",
        "phosphorylation of TRAF2 inhibits binding to the CD40",
        "Figure 1: (a) sentence with target event structure; (b) projection to labelled graph.",
        "sentence, as seen figure 1b).",
        "We will first present some basic notation to simplify our exposition.",
        "For each sentence x we have a set candidate trigger words Trig (x), and a set of candidate proteins Prot (x).",
        "We will generally use the indices i and l to denote members of Trig (x), the indices p, q for members of Prot (x) and the index j for members of Cand (x) = Trig (x) U Prot (x).",
        "We label each candidate trigger i with an event Type t G T (with None G T), and use the binary variable ei;t to indicate this labeling.",
        "We use binary variables ai1r to indicate that between i and l there is an edge labelled r G R (with None G R).",
        "The representation so far has been used in previous work (Riedel et al., 2009; Björne et al., 2009).",
        "Its shortcoming is that it does not capture whether two proteins are arguments of the same binding event, or arguments of two binding events with the same trigger.",
        "To overcome this problem, we introduce binary \"same Binding\" variables bPA that are active whenever there is a binding event that has both p and q as arguments.",
        "Our inference algorithm will also need, for each trigger i and protein pair p, q, a binary variable ti)P;q that indicates that at i there is a binding event with arguments p and q.",
        "All ti)P;q are summarized in t.",
        "Constructing events from solutions (e, a, b) can be done almost exactly as described by Björne et al.",
        "(2009).",
        "However, while Björne et al.",
        "(2009) group arguments according to ad-hoc rules based on dependency paths from trigger to argument, we simply query the variables bPA."
      ]
    },
    {
      "heading": "3. Model",
      "text": [
        "We use the following objective to score the structures we like to extract:",
        "with local scoring functions sT (i, t) d=ef(wt, fr (i,t)), sr (i,j,r) = (wr, fR (i,j,r)) and sb (p, q) = (wb, fB (p, q)).",
        "Ourmodel scores all parts ofthe structure in isolation.",
        "It is a joint model due to the three types of constraints we enforce.",
        "The first type acts on trigger labels and their outgoing edges.",
        "It includes constraints such as \"an active label at trigger i requires at least one active outgoing Theme argument\".",
        "The second type enforces consistency between trigger labels and their incoming edges.",
        "That is, if an incoming edge has a label that is not None, the trigger must not be labelled None either.",
        "The third type of constraints ensures that when two proteins p and q are part of the same binding (as indicated by bP;q = 1), there needs to be a binding event at some trigger i that has p and q as arguments.",
        "We will denote the set of structures (e, a, b) that satisfy all above constraints as Y.",
        "To learn w we choose the passive-aggressive online learning algorithm (Crammer and Singer, 2003).",
        "As loss function we apply a weighted sum of false positives and false negative labels and edges.",
        "The weighting scheme penalizes false negatives 3.8 times more than false positives.",
        "For feature vector fT (i, t) we use a collection of representations for the token i: word-form, lemma, POS tag, syntactic heads, syntactic children; membership in two dictionaries used by Riedel et al.",
        "(2009).For fR (a; r) we use representations of the token pair (i, j) inspired by Miwa et al.",
        "(2010) .",
        "They contain: labelled and unlabeled n-gram dependency paths; edge and vertex walk features (Miwa et al., 2010), argument and trigger modifiers and heads, words in between (for close distance i and j).",
        "For fB (b; p, q) we use a small subset of the token pair representations in fR.",
        "Algorithm 1 Dual Decomposition, require:",
        "R: max.",
        "iteration, (Xt: stepsizes bestlncoming ( – A) bestOutgoing (cout (A, /x)) bestBinding (cbind (/x))",
        "A.",
        "a.",
        "ßi,j,k Xt Theme ti,j,fc)",
        "until no A, /x changed or t > R return(e, a, b)",
        "Inference in our model amounts to solving arg max s (e, a, b) .",
        "Our approach to finding the maximizer is dual decomposition (Komodakis et al., 2007; Rush et al., 2010), a technique that allows us to exploit efficient search algorithms for tractable substructures of our problem.",
        "We divide the problem into three sub-problems: (1) finding the highest-scoring trigger labels and edges (e, a) such that constraints on triggers and their outgoing edges are fulfilled; (2) finding the highest-scoring trigger labels and edges (ae, aa) such that constraints on triggers and their incoming edges are fulfilled; (3) finding the highest-scoring pairs of proteins b to appear in the same binding, and make binding event trigger decisions t for these.",
        "Due to space constraints we only state that the first two problems can be solved exactly in O (n + nm) time while the last needs O (mn).",
        "Here n is the number of trigger candidates and m the number of proteins.",
        "The subroutines to solve these three sub-problems are combined in algorithm 1 – an instantiation of subgradient descent on the dual of an LP relaxation of problem 1.",
        "In the first three steps in the main loop of this algorithm, the individual sub-problems are solved.",
        "Note that to each subroutine a parameter is passed.",
        "For example, when finding the structure (ea, aa) that maximizes the objective under the incoming edge constraints, we pass the parameter – A.",
        "This parameter represents a set of penalties to be added to the objective used for the subproblem.",
        "In this case we have penalties – Ai>e to be added to the scores of trigger-label pairs (i, e), and penalties – Aitj>r to be added for labelled edges i – j.",
        "One way to understand dual decomposition is as iterative tuning of the penalties such that eventually all individual solutions are consistent with each other.",
        "In our case this would mean, among other things, that the solutions (e, a) and (ea, aa) are identical.",
        "This tuning happens in the second part of the main loop which updates the dual variables A and /x.",
        "We see, for example, how the penalties Ai>e are decreased by ei;e – ai;e scaled by a step-size at.",
        "Effectively this change to Ai>e will decrease the score of ai;e within bestIn ( – A) by at if ai)e was true while ei;e was false in the current solutions.",
        "If ai>e was false but ei>e was true, the score is increased by at.",
        "If both agree, no change is needed.",
        "Consistency between solutions also means that the binding decisions in b and t are consistent with the rest of the solution.",
        "This is achieved in algorithm 1 through tuning of the dual variables / but we omit details for brevity.",
        "For completeness we state how the penalties used for solving the other subproblems are set based on the dual variables A and /x.",
        "We set c^f (A, /x) = Ai;t +",
        "#t,Bind Ep,q khvq; for the case that j G Prot (x) we",
        "otherwise coijtr (A, /x) = Ai)j;r .",
        "For bestBind (c)",
        "After basic tokenization and sentence segmentation, we generate a set of protein head tokens Prot (x) for each sentence x based on protein span definitions from the shared task.",
        "To ensure tokens contain not more than one protein we split them at protein boundaries.",
        "Parsing is performed using the Charniak-Johnson parser (Charniak and Johnson, 2005) with the self-trained biomedical parsing abst.=abstract; full=full text.",
        "model of McClosky and Charniak (2008).",
        "Finally, based on the set of trigger words in the training data, we generate a set of candidate triggers Trig (x)."
      ]
    },
    {
      "heading": "4. Results",
      "text": [
        "We apply the same model to the GE, ID and EPI tracks, with minor modifications in order to deal with the different event type sets T and role sets R of each track.",
        "Training and testing together took between 30 (EPI) to 120 (GE) minutes using a single-core implementation.",
        "Our results for GE task 1 and 2 can be seen in table 1.",
        "We also show results for abstracts only (abst.",
        "), and for full text only (full).",
        "Note that binding events (BIND) and general regulation events (REG) seem to be harder to extract in full text.",
        "Somewhat surprisingly, for simple events (SVT) the opposite holds.",
        "We also like to point out that for full text extraction we rank first – the second best FAUST system achieves an F1 score of 52.67.",
        "The Infectious Diseases track differs from the Genia track in two important ways.",
        "First, it introduces the event type Process that is allowed to have no arguments at all.",
        "Second, it comes with significantly less training data (152 vs 908 documents).",
        "We can accommodate the first difference by making simple changes in our inference algorithms.",
        "For example, for Process events we do not force the algorithm to pick a Theme argument.",
        "To compensate for the lack of training data we simply add data from the GE track.",
        "This is reasonable because annotations overlap quite significantly.",
        "In table 2 we show the impact of mixing different amounts of ID data (I) and GE data (G) into the training set.",
        "We point out that adding the ID training set twice, and the GENIA set once, leads to the best performance (I/G=2/1).",
        "Remarkably, the F1 score for Process increases by including data, although this data does not include any such events.",
        "This may stem from a shared model of None arguments that is improved with more data.",
        "For this track a different set of events is to be predicted.",
        "However, it is straightforward to adapt our model and algorithms to this setting.",
        "For brevity we only report our total results here and omit a table with details.",
        "The first metric (ALL) includes negation, speculation and cellular location targets.",
        "We omitted these in our model and hence our result of 33.52 F1 is relatively weak.",
        "For the metric that neglects these aspects (CORE), we achieve 64.15 F1 and come in 4th.",
        "Note that in this metric the FAUST system, based on the model presented here, comes in as very close second."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "We have presented a robust joint model for event extraction from biomedical text that performs well across all tasks.",
        "Remarkably, no feature set or parameter tuning was necessary to achieve this.",
        "We also show substantial improvements for the ID task by adding GENIA data into the training set."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "This work was supported in part by the Center for Intelligent Information Retrieval.",
        "The University of Massachusetts gratefully acknowledges the support of Defense Advanced Research Projects Agency (DARPA) Machine Reading Program under Air Force Research Laboratory (AFRL) prime contract no.",
        "FA8750-09-C-0181.",
        "Any opinions, findings, and conclusion or recommendations expressed in this material are those of the authors and do not necessarily reflect the view of the",
        "DARPA, AFRL, or the US government.",
        "SVT",
        "BIND",
        "REG",
        "TOT",
        "I/G",
        "BIND",
        "REG",
        "PRO",
        "TOT",
        "Task 1",
        "73.5",
        "48.8",
        "43.8",
        "55.2",
        "DEV",
        "1/0",
        "18.6",
        "27.1",
        "34.3",
        "41.5",
        "Task 1 (abst.)",
        "71.5",
        "50.8",
        "45.5",
        "56.1",
        "DEV",
        "0/1",
        "18.2",
        "26.8",
        "0.00",
        "35.5",
        "Task 1 (full)",
        "79.2",
        "44.4",
        "40.1",
        "53.1",
        "DEV",
        "1/1",
        "20.0",
        "33.1",
        "49.3",
        "47.2",
        "Task 2",
        "71.4",
        "38.6",
        "39.1",
        "51.0",
        "DEV",
        "2/1",
        "20.0",
        "34.5",
        "52.0",
        "48.5",
        "able 1: Results",
        "for the",
        "GE track, task",
        "1 and 2;",
        "TEST",
        "2/1",
        "34.6",
        "46.4",
        "62.3",
        "53.4"
      ]
    }
  ]
}
