{
  "info": {
    "authors": [
      "Francisco Zamora-Martinez",
      "Maria Jose Castro-Bleda"
    ],
    "book": "Proceedings of the Sixth Workshop on Statistical Machine Translation",
    "id": "acl-W11-2162",
    "title": "CEU-UPV English-Spanish system for WMT11",
    "url": "https://aclweb.org/anthology/W11-2162",
    "year": 2011
  },
  "references": [
    "acl-D09-1074",
    "acl-J03-1002",
    "acl-J03-3002",
    "acl-J93-2003",
    "acl-P02-1038",
    "acl-P03-1021",
    "acl-P06-2093",
    "acl-P07-2045",
    "acl-P10-1086",
    "acl-W04-3250",
    "acl-W07-0733",
    "acl-W10-1731"
  ],
  "sections": [
    {
      "text": [
        "Francisco Zamora-Martmez M.J. Castro-Bleda",
        "D. Fisica, Matematica, y Computation D. Sistemas Informaticos y Computation",
        "Universidad CEU-Cardenal Herrera Alfara del Patriarca (Valencia), Spain",
        "fzamora@dsic.upv.es",
        "Universitat Politecnica de Valencia Valencia, Spain",
        "mcastro@dsic.upv.es",
        "This paper describes the system presented for the English-Spanish translation task by the collaboration between CEU-UCH and UPV for 2011 WMT.",
        "A comparison of independent phrase-based translation models interpolation for each available training corpora were tested, giving an improvement of 0.4 BLEU points over the baseline.",
        "Output N-best lists were rescored via a target Neural Network Language Model.",
        "An improvement of one BLEU point over the baseline was obtained adding the two features, giving 31.5 BLEU and 57.9 TER for the primary system, computed over lowercased and detokenized outputs.",
        "The system was positioned second in the final ranking."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The goal of Statistical Machine Translation (SMT) is to translate a sentence between two languages.",
        "Giving the source language sentence f, it would be translated to an equivalent target language sentence e. The most extended formalization is done via log-linear models (Papineni et al., 1998; Och and Ney, 2002) as follows:",
        "where hk (f, e) is a score function representing an important feature for the translation of f into e, K is the number of models (or features) and Ak are the weights of the log-linear combination.",
        "Typically, the weights Ak are optimized during the tuning stage with the use of a development set.",
        "SMT systems rely on a bilingual sentence aligned training corpus.",
        "These sentences are aligned at the word level (Brown et al., 1993), and after that, different hk feature functions are trained.",
        "In some practical cases, the out-of-domain training data is larger than the in-domain training data.",
        "In these cases the target Language Model (LM) is composed of a linear interpolation of independent LMs, one for each available training domain or corpus.",
        "Nevertheless, the training of phrase-based translation models is an open problem in these cases.",
        "Some recent works (Resnik and Smith, 2003; Ya-suda et al., ; Koehn and Schroeder, 2007; Matsoukas et al., 2009; Foster et al., 2010; Sanchis-Trilles and Casacuberta, 2010) related to corpus weighting, make use of data selection, data weighting, and translation model adaptation to overcome this problem.",
        "In this work, we explore a simple corpus weighting technique to interpolate any number of different phrase tables.",
        "Two different approaches are tested, obtaining similar performance.",
        "On the one hand, a count-based smoothing technique that applies a weight to the counting of phrases and lexical links depending on the relevance of each corpus.",
        "On the other hand, a linear interpolation of independent trained phrase tables.",
        "Another important feature of this work is the use of Neural Network Language Models been successfully applied in some connectionist approaches to language modeling (Bengio et al., 2003; Castro-Bleda and Prat, 2003; Schwenk et al., 2006;",
        "Schwenk, 2010).",
        "The advantage of these NN LMs is the projection of words on a continuous space were the probabilities of n-grams are learned.",
        "A Neural Network (NN) is proposed to learn both the word projections and the n-gram probabilities.",
        "The presented system combines a standard, state-of-the-art SMT system with a NN LM via log-linear combination and N best output re-scoring.",
        "We chose to participate in the English-Spanish direction."
      ]
    },
    {
      "heading": "2. Translation models",
      "text": [
        "A standard phrase-based translation model is composed of the following five hk features:",
        "• inverse phrase translation probability p(f |e)",
        "• inverse lexical weighting 1(f |e)",
        "• direct phrase translation probability p(e|f )",
        "• direct lexical weighting 1(e|f )",
        "• phrase penalty (always e = 2.718).",
        "We rely only on the first four features.",
        "They are computed from word alignments at the sentence level, by counting over the alignments, and using the inverse and direct lexical dictionaries.",
        "Given a pair of phrases, f on the source language and e in the target language, the phrase translation probabilities are computed by relative frequency as:",
        "Give a word f o the source la guage, a d a word e in the target language, the lexical translation distribution is computed again by relative frequency as:",
        "count(f,e)",
        "count(f,e) v UJ count(f ',e)",
        "Given the previous lexical translation distribution, two phrase pairs f and e, and a, the word alignment between the source word positions i = 1,..., n and the target word positions j = 1,..., m, the inverse lexical weighting is computed as:",
        "and the direct lexical weighting is computed as:"
      ]
    },
    {
      "heading": "3. Weighting different translation models",
      "text": [
        "The proposed modifications of the phrase-based translation models are similar to (Foster et al., 2010; Matsoukas et al., 2009), but in this case the weighting is simpler and focused at the corpus level.",
        "If we have T different training sets, we could define ßt as the weight of the set t, for 1 < t < T. The word alignments are computed via Giza++ (Och and Ney, 2003) over the concatenation of all the training material available for the translation models (in this case, Europarl, News-Commentary, and United Nations).",
        "After that, we could recompute the lexical translation distribution using the weights information, and compute the phrase-based translation models taking into account these weights.",
        "The count function will be redefined to take into account only information of the corresponding training set.",
        "The weight ßt is applied to the count function, in order to modify the corpus effect on the probability of each phrase pair alignment, and each word pair alignment.",
        "First, we modify the lexical translation distribution in this way:",
        "(f ) = Etßtcountt(f,e)",
        "WU]e) EtßtEe' countt(f,e') w(e|f ) = Et ßtcountt(f,e)( |f ) Et ßtYff countt(f',e)",
        "having a global lexical translation distribution for the alignment between words.",
        "Second, we modify the phrase translation probabilities for each direction, remaining without modification the lexical weightings:",
        "Et ßtcountt(f, e)",
        "Et ßtEj countt(f,e')",
        "Et ßtcountt(f,e) Et ßtE/' countt(f ',e)",
        "and the direct lexical weighting:"
      ]
    },
    {
      "heading": "4. Neural Network Language Models",
      "text": [
        "In SMT the most useful language models are n-grams (Bahl etal., 1983; Jelinek, 1997; Bahl etal., 1983).",
        "They compute the probability of each word given the context of the n – 1 previous words:",
        "When some phrase/word count is not found, count is set to zero.",
        "In this case, we compute independently the translation models for each training set.",
        "We have T models, one for each set.",
        "The final translation models are obtained by means of a linear interpolation of each independent translation model.",
        "If some phrase pair is not found, the translation model is set to have zero probability.",
        "First, we redefine the lexical translation distribution.",
        "In this case we have w1, w2,..., wT lexical dictionaries:",
        "Then, we could compute the linear interpolation of phrase translation probabilities as follows:",
        "t Ej' countt(f,e')",
        "And finally, the inverse lexical weighting is obtained as:",
        "where S is the sequence of words for which we want compute the probability, and si G S, from a vocabulary Q.",
        "A NN LM is a statistical LM which follows equation (2) as n-grams do, but where the probabilities that appear in that expression are estimated with a naturally fits under the probabilistic interpretation of the outputs of the NNs: if a NN, in this case a MLP, is trained as a classifier, the outputs associated to each class are estimations of the posterior probabilities of the defined classes (Bishop, 1995).",
        "The training set for a LM is a sequence s1s2 ... of words from a vocabulary Q.",
        "In order to train a NN to predict the next word given a history of length n – 1, each input word must be encoded.",
        "A natural representation is a local encoding following a \"1-of-|Q|\" scheme.",
        "The problem of this encoding for tasks with large vocabularies (as is typically the case) is the huge size of the resulting NN.",
        "We have solved this problem following the ideas of (Bengio et al., 2003; Schwenk, 2007), learning a distributed representation for each word.",
        "Figure 1 illustrates the architecture of the feed-forward NN used to estimate the NN LM.",
        "This n-gram NN LM predicts the posterior probability of each word of the vocabulary given the n – 1 previous words.",
        "A single forward pass of the MLP gives p(w|si – n+1... si – 1) for every word w G Q.",
        "After training the projection layer is replaced by a table look-up.",
        "Figure 1: Architecture of the continuous space NN LM during training.",
        "The input words are si-n+1, ..., s^-i (in this example, the input words are Sis, si-2, and si-1for a 4-gram).",
        "I, P, H, and O are the input, projection, hidden, and output layer, respectively, of the MLP.",
        "The major advantage of the connectionist approach is the automatic smoothing performed by the neural network estimators.",
        "This smoothing is done via a continuous space representation of the input words.",
        "Learning the probability of n-grams, together with their representation in a continuous space (Bengio et al., 2003), is an appropriate approximation for large vocabulary tasks.",
        "However, one of the drawbacks of such approach is the high computational cost entailed whenever the NN LM is computed directly, with no simplification whatsoever.",
        "For this reason, the vocabulary size will be restricted in the experiments presented in this work."
      ]
    },
    {
      "heading": "5. Experiments",
      "text": [
        "The baseline SMT system is built with the open-source SMT toolkit Moses (Koehn et al., 2007), in its standard setup.",
        "The decoder includes a log-linear model comprising a phrase-based translation model, a language model, a lexicalized distortion model and word and phrase penalties.",
        "The weights of the log-linear interpolation were optimized by means of MERT (Och, 2003), using the News-Commentary test set of the 2008 shared task as a development set.",
        "The phrase-based translation model uses the con-",
        "Table 1: Spanish corpora statistics.",
        "NC stands for News-Commentary and UN for United Nations, while |Q| stands for vocabulary size, and M/K for millions/thousands of elements.",
        "All numbers are computed with tokenized and lowercased data.",
        "catenation of News-Commentary, United Nations, and Europarl corpora, to estimate the four translation model features.",
        "The baseline LM was a regular n-gram LM with Kneser-Ney smoothing (Kneser and Ney, 1995) and interpolation by means of the SRILM toolkit (Stol-cke, 2002).",
        "Specifically, we trained a 6-gram LM on United Nations, a 5-gram on Europarl and News-Shuffled, and a 4-gram on News-Commentary.",
        "Once these LMs had been built, they were interpolated so as to maximize the perplexity of the News-Commentary test set of the 2009 shared task.",
        "The final model was pruned out using a threshold of 10 – 8.",
        "This was done so according to preliminary research.",
        "Three different weights for the count smoothing technique described in section 3.1 were tested.",
        "For the interpolation model of section 3.2, we select the weights minimizing the perplexity of the corresponding three LMs (Europarl, NC, and UN) over the News2008 set.",
        "Table 2 summarizes these weights.",
        "NN LM was trained with all the corpora described in Table 1, using a weighted replacement algorithm to modify the impact of each corpus in the training algorithm.",
        "The weights were the same that for the standard LM.",
        "In order to reduce the complexity of the NN LM.",
        "Set",
        "# Lines",
        "# Words",
        "|Q|",
        "NC v6",
        "159K",
        "4.44M",
        "80K",
        "News-Shuffled",
        "9.17M",
        "269M",
        "596K",
        "Europarl v6",
        "1.94M",
        "55M",
        "177K",
        "UN",
        "6.22M",
        "214M",
        "579K",
        "Total",
        "21.93M",
        "678M",
        "1.03M",
        "System",
        "Europarl",
        "NC",
        "UN",
        "Smooth1",
        "0.35",
        "0.35",
        "0.30",
        "Smooth2",
        "0.40",
        "0.40",
        "0.20",
        "Smooth3",
        "0.15",
        "0.80",
        "0.05",
        "Linear",
        "0.35",
        "0.35",
        "0.30",
        "the model, the input vocabulary of the NN LM was restricted using only words that appears more than 10 times in the corpora.",
        "The vocabulary is formed by the 107 607 more frequent words, with two additional inputs: one to represent the words out of this vocabulary, and another for the begin-of-sentence cue.",
        "The output of the NN LM was restricted much more, using only a shortlist (Schwenk, 2007) of the 10K more frequent words, plus the end-of-sentence cue.",
        "The rest ofwords are collected by an additional output in the neural network.",
        "When the probability of an out-of-shortlist word is required, its probability is computed multiplying this additional output activation by the unigram probability distribution of every out-of-shortlist word.",
        "This implies that 10.7% of the running words of the News2009 set, and 11.1% of the running words of the News2011 official test set, will be considered as out-of-shortlist words for",
        "A 6-gram NN LM was trained for this task, based in previous works (Zamora-Martinez and Sanchis-Trilles, 2010).",
        "Four NN LMs with different values for the projection of each word (128, 192, 256, 320) were linearly combined for the final NN LM.",
        "Each NN LM had 320 units in the hidden layer.",
        "The combination weights were computed maximizing the perplexity over the News2009 set.",
        "The training procedure was conducted by means of the stochastic back-propagation algorithm with weight decay, with a replacement of 300K training samples and 200K validation samples in each training epoch, selecting the random sample using a different distribution weight for each corpus.",
        "The validation set was the News2009 set.",
        "The networks were stopped after 99, 70, 53, and 42 epochs respectively (unfortunately, without achieving convergence, due to the competition timings).",
        "This resulted in very few training samples compared with the size of the training set: 29M in the best case, versus more than 500M of the full set.",
        "The training of the NN LMs was accomplished with the April toolkit (Espanna-Boquera et al., 2007; Zamora-Martinez et al., 2009).",
        "The perplexity achieved by the 6-gram NN LM in the Spanish News2009 set was 281, versus 145 obtained with the standard 6-gram language model with interpolation and Kneser-Ney smoothing (Kneser and Ney, 1995).",
        "The number of sentences in the N best list was set to 2 000 unique output sentences.",
        "Results can be seen in Table 3.",
        "In order to assess the reliability of such results, we computed pairwise improvement intervals as described in (Koehn, 2004), by means of bootstrapping with 1 000 bootstrap iterations and at a 95% confidence level.",
        "Such confidence test reported the improvements to be statistically significant.",
        "A difference of more than 0.",
        "3 points of BLEU is considered significant in the pairwise comparison.",
        "The final results leads to 31.5 points of BLEU, positioning this system as second in the final classification."
      ]
    },
    {
      "heading": "6. Conclusions and future work",
      "text": [
        "The presented CEU-UPV system, using phrase translation models combinations and NN LMs, leads an improvement of 0.4 points of BLEU in the two cases: the count smoothing approach (Smooth3 system) and the linear interpolation approach (Linear system).",
        "The incorporation of NN LMs in both systems gets an additional improvement of 0.5 BLEU points for the Smooth3 system, and 0.6 BLEU points for the Linear system.",
        "The final result for the primary system is 31.5 BLEU points.",
        "The combination of translation models could be enhanced optimizing the ßt weights over the BLEU score.",
        "Currently the weights are manually set for the Smooth[1,2,3] systems, and fixed to the LM weights for the Linear system.",
        "Nevertheless, both approaches achieve similar results.",
        "Finally, it is important to emphasize that the use ofNN LMs implies an interesting improvement, though this year's gain is lower than that obtained by our 2010 system.",
        "News2010",
        "News2011",
        "System",
        "BLEU",
        "TER",
        "BLEU",
        "TER",
        "Baseline",
        "29.2",
        "60.0",
        "30.5",
        "58.9",
        "Smooth1",
        "29.3",
        "59.9",
        " – ",
        " – ",
        "Smooth2",
        "29.2",
        "59.9",
        " – ",
        " – ",
        "Smooth3",
        "29.5",
        "59.6",
        "30.9",
        "58.5",
        "+ NN LM",
        "29.9",
        "59.2",
        "31.4",
        "58.0",
        "Linear",
        "29.5",
        "59.5",
        "30.9",
        "58.7",
        "+ NN LM",
        "30.2",
        "58.8",
        "31.5",
        "57.9"
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work has been partially supported by the Spanish Goverment under project TIN2010-1958."
      ]
    }
  ]
}
