{
  "info": {
    "authors": [
      "Ai Azuma",
      "Yuji Matsumoto"
    ],
    "book": "EMNLP",
    "id": "acl-D11-1058",
    "title": "Multilayer Sequence Labeling",
    "url": "https://aclweb.org/anthology/D11-1058",
    "year": 2011
  },
  "references": [
    "acl-D08-1070",
    "acl-D09-1005",
    "acl-J93-2004",
    "acl-P02-1034",
    "acl-W06-1673",
    "acl-W95-0107"
  ],
  "sections": [
    {
      "text": [
        "Ai Azuma Yuji Matsumoto",
        "Graduate School of Information Science Nara Institute of Science and Technology Ikoma, Nara 630-0192, Japan {ai-a,matsu}@is.naist.jp",
        "In this paper, we describe a novel approach to cascaded learning and inference on sequences.",
        "We propose a weakly joint learning model on cascaded inference on sequences, called multilayer sequence labeling.",
        "In this model, inference on sequences is modeled as cascaded decision.",
        "However, the decision on a sequence labeling sequel to other decisions utilizes the features on the preceding results as marginalized by the probabilistic models on them.",
        "It is not novel itself, but our idea central to this paper is that the probabilistic models on succeeding labeling are viewed as indirectly depending on the probabilistic models on preceding analyses.",
        "We also propose two types of efficient dynamic programming which are required in the gradient-based optimization of an objective function.",
        "One of the dynamic programming algorithms resembles back propagation algorithm for multilayer feed-forward neural networks.",
        "The other is a generalized version of the forward-backward algorithm.",
        "We also report experiments of cascaded part-of-speech tagging and chunking of English sentences and show effectiveness of the proposed method."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Machine learning approach is widely used to classify instances into discrete categories.",
        "In many tasks, however, some set of interrelated labels should be decided simultaneously.",
        "Such tasks are called structured prediction.",
        "Sequence labeling is the simplest subclass of structured prediction problems.",
        "In sequence labeling, the most likely one among all the possible label sequences is predicted for a given input.",
        "Although sequence labeling is the simplest subclass, a lot of real-world tasks are modeled as problems of this simplest subclass.",
        "In addition, it might offer valuable insight and a toehold for more general and complex structured prediction problems.",
        "Many models have been proposed for sequence labeling tasks, such as Hidden Markov Models (HMM), Conditional Random Fields (CRF) (Lafferty et al., 2001), Max-Margin Markov Networks (Taskar et al., 2003) and others.",
        "These models have been applied to lots of practical tasks in natural language processing (NLP), bioinformatics, speech recognition, and so on.",
        "And they have shown great success in recent years.",
        "In real-world tasks, it is often needed to cascade multiple predictions.",
        "A cascade of predictions here means the situation in which some of predictions are made based upon the results of other predictions.",
        "Sequence labeling is not an exception.",
        "For example, in NLP, we perform named entity recognition or base-phrase chunking for given sentences based on part-of-speech (POS) labels predicted by another sequence labeler.",
        "Natural languages are especially interpreted to have a hierarchy of sequential structures on different levels of abstraction.",
        "Therefore, many tasks in NLP are modeled as a cascade of sequence predictions.",
        "If a prediction is based upon the result of another prediction, we call the former upper stage and the latter lower stage.",
        "Methods pursued for a cascade of predictions including sequence predictions, of course-, are desired to perform certain types of capability.",
        "One desired capability is rich forward information propagation, that is, the learning and estimation on each stage of predictions should utilize rich information of the results of lower stages whenever possible.",
        "\"Rich information\" here includes next bests and confidence information of the results of lower stages.",
        "Another is backward information propagation, that is, the rich annotated data on an upper stage should affect the models on lower stages retroactively.",
        "Many current systems for a cascade of sequence predictions adopt a simple 1-best feed-forward approach.",
        "They simply take the most likely output at each prediction stage and transfer it to the next upper stage.",
        "Such a framework can maximize reusability of existing sequence labeling systems.",
        "On the other hand, it exhibits a strong tendency to propagate errors to upper labelers.",
        "Typical improvement on the 1 best approach is to keep k-best results in the cascade of predictions.",
        "However, the larger k becomes, the more difficult it is to enumerate and maintain the k-best results.",
        "It is particularly prominent in sequence labeling.",
        "The essence of this orientation is that the labeler on an upper stage utilizes the information of all the possible output candidates on lower stages.",
        "However, the size of the output space can become quite large in sequence labeling.",
        "It effectively forbids explicit enumeration of all possible outputs, so it is required to represent all the labeling possibilities compactly or employ some approximation schemes.",
        "Several studies are in this direction.",
        "In the method proposed in Finkel et al.",
        "(2006), a cascades of sequence predictions is viewed as a Bayesian network, and sample sequences are drawn at each stage according to the output distribution.",
        "The samples are then used to estimate the entire distribution of the cascade.",
        "In the method proposed in Bunescu (2008), an upper labeler uses the probabilities marginalized on the parts of the output sequences on lower stages as weights for the features.",
        "The weighted features are integrated in the model of the labeler on the upper stage.",
        "A k-best approach (e.g., (Collins and Duffy, 2002)) and the methods mentioned above are effective to improve the forward information propagation.",
        "However, they can never contribute on backward information propagation.",
        "To improve the both directions of information propagation, Some studies propose the joint learning of multiple sequence labelers.",
        "Sutton et al.",
        "(2007) proposes the joint learning method in case where multiple labels are assigned to each time slice of the input sequences.",
        "It enables simultaneous learning and estimation of multiple sequence labelings on the same input sequences, where time slices of the outputs of all the out sequences are regularly aligned.",
        "However, it puts the distribution of states into Bayesian networks with cyclic dependencies, and exact inference is not tractable in such a model in general.",
        "Therefore, it requires some approximate inference algorithms in learning or predictions.",
        "Moreover, it only considers the cases where labels of an input sequence and all output sequences are regularly aligned.",
        "It is not clear how to build a joint labeling model which handles irregular output label sequences like semi-Markov models (Sarawagi and Cohen, 2005).",
        "In this paper, we propose a middle ground for a cascade of sequence predictions.",
        "The proposed method adopts the basic idea of Bunescu (2008).",
        "We first assume that the model on all the sequence labeling stages is probabilistic one.",
        "In modeling of an upper stage, a feature is weighted by the marginal probability of the fragment of the outputs from a lower stage.",
        "However, this is not novel itself because it is just a paraphrase of Bunescu's core idea.",
        "Our intuition behind the proposed method is as follows.",
        "Features integrated in the model on each stage are weighted by the marginal probabilities of the fragments of the outputs on lower stages.",
        "So, if the output distributions on lower stages change, the marginal probabilities of any fragments also change, and this in turn can change the value of the features on the upper stage.",
        "In other words, the features on an upper stage indirectly depend on the models on the lower stages.",
        "Based on this intuition, the learning procedure of the model on an upper stage can affect not only direct model parameters, but also the weights of the features by changing the model on the lower stages.",
        "Supervised learning based on annotated data on an upper stage may affect the model or model parameters on the lower stages.",
        "It could be said that the information of annotation data on an upper stage is propagated back to the model on lower stages.",
        "In the next section, we describe the formal notation of our model.",
        "In Section 3, we propose an optimization procedure according to the intuition noted above.",
        "In Section 4, we report an experimental result of our method.",
        "The proposed method shows some improvements on a real-world task in comparison with ordinary methods."
      ]
    },
    {
      "heading": "2. Formalization",
      "text": [
        "In this section, we introduce the formal notation of our model.",
        "Hereafter, for the sake of simplicity, we only describe the simplest case in which there are just two stages, one lower stage ofsequence labeling named L\\ and one upper stage of sequence labeling named L2.",
        "In Li, the most likely one among a set of possible sequences is predicted for a given input x. L2 is also a sequence labeling stage for the same input x and the output of L1.",
        "No assumption is made on the structure of x.",
        "The information of x is totally encoded in feature functions.",
        "It is only assumed that the output spaces of both L1 and L2 are conditioned on the initial input x.",
        "First of all, we describe the formalization of the probabilistic model for L1 .",
        "The model for L1 per se is the same as ordinary ones for sequence labeling.",
        "For a given input x, consider a directed acyclic graph (DAG) Gi = (Vi, Ei).",
        "A source of a DAG G is a node whose in-degree is equal to zero.",
        "A sink of a DAG G is nodes whose out-degree is equal to zero.",
        "Let src(G), snk(G) denote the set of source and sink nodes in G, respectively.",
        "A successful path of a DAG G is defined as a directed path on G whose starting node is a source and end node is a sink.",
        "If y denotes a path on a DAG, let y also denote the set of all the arcs appearing on y for the sake of shorthand.",
        "We denote the set of all the possible successful paths on G1 by Y1.",
        "The space of the output candidates for L1 is exactly equal to Y1.",
        "For the modeling of L1, it is assumed that features of the form /(1,fc1,ei,x> S R (k1 S K1,e1 S E1) are allowed to be used.",
        "Here, K1 is the index set of the feature types for L1.",
        "Such a feature can capture an aspect of the correlation between adjacent nodes.",
        "We call this kind of features input features for L1 .",
        "This naming is used to distinguish them from another kind of features defined on L1 , which comes later.",
        "Although features on V1 can be also defined, they are totally omitted in this paper for brevity.",
        "Hereafter, if a symbol has subscripts, then missing subscript indicates a set that range over the omitted subscript.",
        "For example, f(i,ei,x> =",
        "f(1,x> = {/(1)fc1,e1 ,x>}^ed^eE!, and so on.The probabilistic model on L1 forms the log-linear model, that is,",
        "where #(1)k1> S R (k1 S K1) is the weight for the feature of the same index k1, and the k1 -th element operator (• ) denotes the inner product with respect to the subscripts commonly missing in both operands.",
        "Z1 is the partition function for Pi, defined as",
        "It is worth noting that this formalization subsumes both directed and undirected linear-chain graphical models, which are the most typical models for sequence labeling, including HMM and CRF.",
        "That is, if the elements of V1 are aligned into regular time slices, and the nodes in each time slice are associated with possible assignments oflabels for that time, we obtain the representation equivalent to the ordinary linear-chain graphical models, in which all possible label assignments for each state are expanded.",
        "In such configuration, all the possible successful paths defined in our notation have strict one-to-one correspondence to all the possible joint assignments of labels in linear-chain graphical models.",
        "We purposely employ this DAG-based notation because; it is convenient to describe the models and algorithms for our purpose, it allows for labels to stay in arbitrary time as in semi-Markov models, and it is easily extended to models for a set of trees instead of sequences by replacing the graph-based notation with hypergraph-based notation.",
        "Next, we formalize the probabilistic model on the upper stage L2.",
        "Like L1, consider a DAG G2 = ( V2, E2) conditioned on the input x, and the set of all the possible successful paths on G2, denoted Y2.",
        "The space of the output candidates for L2 becomes",
        "Y2.",
        "The form of the features available in designing the probabilistic model for L2, denoted by P2, is the key of this paper.",
        "A feature on an arc e2 G E2 can access local characteristics of the confidence-rated superposition of the Li's outputs, in addition to the information of the input x.",
        "To formulate local characteristics of the superposition of the Li 's outputs, we first define output features of L1, denoted by h(i,k'1 ,ei> G R (kl G K'i, ei G Ei).",
        "Here, Ki is the index set of the output feature types of Li.",
        "Before the output features are integrated into the model for L2, they all are confidence-rated with respect to Pi, that is, each output feature h^i k/ ei> is numerically rated by the estimated probabilities summed over the sequences emitting that feature.",
        "More formally, all the Li's output features are integrated in features for P2 in the form of the marginalized output features, which are defined as follows;",
        "Here, the notation ^yi^ei represents the summation over sequences consistent with an arc ei G Ei, that is, the summation over the set {yi G Yi | ei G yi}.",
        "bp denotes the indicator function for a predicate P. The input features for P2on an arc e2 G E2 are permitted to arbitrarily combine the information of x and the Li 's marginalized output features hi, in addition to the local characteristics of the arc at hand e2.",
        "In summary, an input feature for L2 on an arc e2 G E2 is ofthe form where K2 is the index set of the input feature types for L2.",
        "To make the optimization procedure feasible, smoothness condition on any L2's input feature is assumed with respect to all the Li 's output features, that is, <2>fc2>e2,x> is always guaranteed to exist for vki, ei, k2, e2.",
        "For example, additions and multiplications between some elements of hhi(Oi ) can appear in the definition of L2's input features.",
        "For given input features f^2x> (hi(Oi)) and parameters ^(2)k2> G R (k2 G K2), the probabilistic model for L2 is defined as follows;",
        "The definition of P2 (6) reveals one of the most important points in this paper.",
        "P2 is viewed not only as the function of the ordinary direct parameters O2 but also as the function of Oi , which represents the parameters for the Li's model, through the intermediate variables hi.",
        "So optimization procedure on P2may affect the determination of the values not only of the direct parameters O2 but also of the indirect ones Oi .",
        "If the result of Li is reduced to the single golden output yi, i.e. Pi(yi| x) – byi=yi, the definitions above boil down to the formulation of the simple 1-best feed forward architecture."
      ]
    },
    {
      "heading": "3. Optimization Algorithm",
      "text": [
        "In this section, we describe optimization procedure for the model formulated in the previous section.",
        "Let D = {(x, (Gi, yi), (G2, y2))m}m=i)2)... ,M denote annotated data for the supervised learning of the model.",
        "Here, (G1, yi) is a pair of a DAG and correctly annotated successful sequence for Li .",
        "The same holds for (G2, y2).",
        "For given D, we can define the conditional log-likelihood function on Li and L2 respectively, that is,",
        "Here, a1, a2 are the variances of the prior distributions of the parameters.",
        "For the sake of simplicity, we set the prior distribution as the zero-mean uni-variance Gaussian.",
        "To optimize the both probabilistic models P1 and P2 jointly, we also define the joint conditional log-likelihood function",
        "The parameter values to be learned are the ones that (possibly locally) maximize this objective function.",
        "Note that this objective function is not guaranteed to be globally convex.",
        "We employ gradient-based parameter optimization here.",
        "Optimization procedure repeatedly searches a direction in the parameter space which is ascendent with respect to the objective function, and updates the parameter values into that direction by small advances.",
        "Many existing optimization routines like steepest descent or conjugation gradient do that job only by giving the objective value and gradients on parameter values to be updated.",
        "So, the optimization problem here boils down to the calculation of the objective value and gradients on given parameter values.",
        "Before entering the detailed description of the algorithm for calculating the objective function and gradients, we note the functional relations among the objective function and previously defined variables.",
        "The diagram shown in Figure 1 illustrates the functional relations among the parameters, input and output feature functions, models, and objective function.",
        "The variables at the head of a directed arrow in the figure is directly defined in terms of the ones at the tail of the same arrow.",
        "The value of the objective function on given parameter values can be calculated in order of the arrows shown in the diagram.",
        "On the other hand, the parameter gradients are calculated step-by-step in reverse order ofthe arrows.",
        "The functional relations illustrated in the Figure 1 ensure some forms of the chain rule of differentiation among the variables.",
        "The chain rule is iteratively used to decompose the calculation of the gradients into a divide-and-conquer fashion.",
        "These two directions of stepwise computation are analogous to the forward and back propagation for multilayer feedforward neural networks, respectively.",
        "Algorithm 1 shows the whole picture of the gradient-based optimization procedure for our model.",
        "We first describe the flow to calculate the objective value for a given parameters 0i and 02, which is shown from line 2 through 4 in Algorithm 1.",
        "The values of marginalized output features h(1)X) can be calculated by (3).",
        "Because they are the simple marginals of features, the ordinary forward-backward algorithm (hereafter, abbreviated as \"FB\") on G1 offers an efficient way to calculate their values.",
        "Although nothing definite about the forms of the input features for L2 is presented in this paper, f(2>x> can be calculated once the values of h(1;x> have been obtained.",
        "Finally, L1, L2 and then L are easy to calculate because they are no different from the ordinary log-likelihood computation.",
        "Now we describe the algorithm to calculate the parameter gradients,",
        "Line 5 through line 7 in Algorithm 1 describe the gradient computation.",
        "The terms and in (11) become the same forms that appear in the ordinary CRF optimization, i.e., the difference between the empirical frequencies of the features and the model expectations of them,",
        "These calculations are performed by the ordinary FB on G1 and G2, respectively.",
        "Using the chain rule of differentiation derived from the functional relations illustrated in Figure 1, the remaining term Algorithm 1 Gradient-based optimization of the model parameters Input: 01, 02Output: arg max L",
        "1: while 01 or 02 changes significantly do 7: calculate ffi by (18) with Algorithm 2",
        "in (11) can be decomposed as follows;",
        "Note that Leibniz's notation here denotes a Jacobian with the index sets omitted in the numerator and the denominator, for example,",
        "And also recall that dot operators here stand for the inner product with respect to the index sets commonly omitted in both operands, for example, can be transformed as follows;",
        "P2(e2 |X; 01, 02), the marginal probability on e2, can be obtained as a by-product of the F-B for (12).",
        "As described in the previous section, it is assumed that the values of the second factor |h'x) is guaranteed to exists for any given 01 , and the procedure for calculating them is fixed in advance.",
        "The procedure for some of concrete features is exemplified in the previous section.",
        "From the definition of h 1 (3), each element of the third factor of (13) -j^- becomes",
        "There exists efficient dynamic programming to calculate the covariance value (17) (without goint into that detail because it is very similar to the one shown later in this paper), and of course we can run such dynamic programming for vfc/1 G K, e1 G E1.",
        "However, the size of the Jacobian -j^ is equal to x |E1| x Since it is too large in many tasks likely to arise in practice, we should avoid to calculate all the elements of this Jacobian in a straightforward way.",
        "Instead of such naive computation, if the values of J-^2 and a<2x) are obtained, then we",
        "eiGyi dh",
        "h'i)ei>.",
        "In other",
        "words, o,fL2 becomes the covariance between the kith input feature for Li and the hypothetical fea",
        "h(i,ei>.",
        "The final problem is to derive an efficient way to compute the first term of (18).",
        "The second term of (18) can be calculated by the ordinary F-B because it consists ofthe marginals ofarc features.",
        "There are two derivations of the algorithm for calculating the first term.",
        "We describe briefly the both derivations.",
        "One is a variant of the F-B on the expectation semi-ring proposed in Li and Eisner (2009).",
        "First, the F-B is generalized to the expectation semi-ring with respect to the hypothetical feature h'i ei>, and by summing up the marginals of the feature vectors f'i,ei)X> on all the arcs under the distribution of the semi-ring, then we obtain the expectation ofthe feature vector f'i)ei)X> on the semi-ring potential.",
        "This expectation is equal to the first term of (18).",
        "Another derivation is to apply the automatic differentiation (AD)(Wengert, 1964; Corliss et al., 2002) on the F-B calculating EPi [F'i yi)X>].",
        "It exploits the fact that Epi [F'iequal to the first term of (18), R is a dummy parameter, and",
        "Ziiexp(#i ' F'i)yi)x> + AH|iyi>).",
        "It is easy to derive the F-B for calculating the value Epi [F'i yi)X>] .",
        "AD transforms this F-B into another algorithm for calculating the differentiation w.r.t.",
        "A evaluated at the point A = 0.",
        "This transformation is achieved in an automatic manner, by replacing all appearances of A in the F-B with a dual number A + e. The dual number is a variant of the complex number, with a kind of the imaginary unit e with the property e = 0.",
        "Like the usual complex",
        "where A G",
        "Pi(yi|x) if numbers, the arithmetic operations and the exponential function are generalized to the dual numbers, and the ordinary F-B is also generalized to the dual numbers.",
        "The imaginary part of the resulting values is equal to the needed differentiation.",
        "Anyway, these two derivations lead to the same algorithm, and the resulting algorithm is shown as Algorithm 2.",
        "The final line in the loop of Algorithm 1 can be implemented by various optimization routines and line search algorithms.",
        "The time and space complexity to compute the objective and gradient values for given parameter vectors 61, 62 is the same as that for that for Bunescu (2008), up to a constant factor.",
        "Because the calculation of the objective function is essentially the same as that for Bunescu (2008), and in gradient computation, the time complexity of Algorithm 1 is the same as that for the ordinary F-B (up to a constant factor), and the proposed optimization procedure is only required to store additional scalar values h'i ei> on each Gi's arc."
      ]
    },
    {
      "heading": "4. Experiment",
      "text": [
        "We examined effectiveness of the method proposed in this paper on a real task.",
        "The task is to annotate the POS tags and to perform base-phrase chunking on English sentences.",
        "Base-phrase chunking is a task to classify continuous subsequences of words into syntactic categories.",
        "This task is performed by annotating a chunking label on each word (Ramshaw and Marcus, 1995).",
        "The types of chunking label consist of \"Begin-Category\", which represents the beginning of a chunk, \"Inside-Category\", which represents the inside of a chunk, and \"Other.\"",
        "Usually, POS labeling runs first before base-phrase chunking is performed.",
        "Therefore, this task is a typical interesting case where a sequence labeling depends on the output from other sequence labelers.",
        "The data used for our experiment consist of English sentences from the Penn Treebank project (Marcus et al., 1993) consisting of 10948 sentences and 259104 words.",
        "We divided them into two groups, training data consisting of 8936 sentences and 211727 words and test data consisting of 2012 ture hh.",
        "Algorithm 2 Forward-backward Algorithm for Calculating Feature Covariances",
        "1: for vvi G src(Gi), avi < – 1, a'vi < – 1 2: for all vi G Vi in a topological order do",
        "xGsnk(Gi)",
        "8: for all vi G Vi in a reverse topological order do",
        "x G next",
        "13: for all (ui, vi) G Ei do",
        "sentences and 47377 words.",
        "The number ofthe POS label types is equal to 45.",
        "The number of the label types used in base-phrase chunking is equal to 23.",
        "We compare the proposed method to two existing sequence labeling methods as baselines.",
        "The POS labeler is the same in all the three methods used in this experiment.",
        "This labeler is a simple CRF and learned by ordinary optimization procedure.",
        "One baseline method is the 1-best pipeline method.",
        "A simple CRF model is learned for the chunking labeling, on the input sentences and the most likely POS label sequences predicted by the already learned POS labeler.",
        "We call this method \"CRF + CRF.\"",
        "The other baseline method has a CRF model for the chunking labeling, which uses the marginalized features offered by the POS labeler.",
        "However, the parameters of the POS labeler are fixed in the training of the chunking model.",
        "This method corresponds to the method proposed proposed method is the same as \"CRF + CRF-MF\", except that the both labelers are jointly trained by the procedure described in Section 3.",
        "We call this proposed method \"CRF + CRF-BP\" (\"BP\" for \"back propagation\").",
        "In \"CRF + CRF-BP,\" the objective function for joint learning (10) is not guaranteed to be convex, so optimization procedure is sensible to the initial configuration of the model parameters.",
        "In this experiment, we set the parameter values learned by \"CRF + CRF-MF\" as the initial values for the training of the \"CRF + CRF-BP\" method.",
        "Feature templates used in this experiment are listed in Table 1.",
        "Although we only described the formalization and optimization procedure of the models with arc features, We use node features in the experiment.",
        "CRF + CRF",
        "CRF",
        "+ CRF-MF",
        "CRF",
        "+CRF-BP",
        "POS labeling",
        "95.6",
        "(95.6)",
        "95.8",
        "Base-phrase chunking",
        "92.1",
        "92.7",
        "93.1",
        "=== Node feature templates === Node is source Node is sink",
        "Input word on the same time slice",
        "Suffix of input word on the same time slice, n characters (n G [1,2,3]) Initial word character is capitalized^ All word characters are capitalized^",
        "Input word included in the vocabulary of POS Tt (T G {(All possible POS labels)}) Input word contains numberst POS label*_ === Arc feature templates === Tail node is source Head node is sink",
        "Corresponding ordered pair of POS labels*",
        "Table 1: List of feature templates.",
        "All node features are combined with the corresponding node label (POS or chunking label) feature.",
        "All arc features are combined with the feature of the corresponding arc label pair.",
        "t features are instantiated on each time slice in five character window.",
        "* features are not used in POS labeler, and marginalized as output features for \"CRF + CRF-MF\" and \"CRF + CRF-BP.\"",
        "tioned.",
        "In Table 2, bold numbers indicate significant improvement over the baseline models with a = 0.05.",
        "From Table 2, the proposed method significantly outperforms two baseline methods on chunking performance.",
        "Although the improvement on POS labeling performance by the proposed method \"CRF + CRF-BP\" is not significant, it might show that optimization procedure provides some form of backward information propagation in comparison to"
      ]
    },
    {
      "heading": "5. Conclusions",
      "text": [
        "In this paper, we adopt the method to weight features on an upper sequence labeling stage by the marginalized probabilities estimated by the model on lower stages.",
        "We also point out that the model on an upper stage is considered to depend on the model on lower stages indirectly.",
        "In addition, we propose optimization procedure that enables the joint optimization of the multiple models on the different level of stages.",
        "We perform an experiment on a real-world task, and our method significantly outperforms existing methods.",
        "We examined the effectiveness of the proposed method only on one task in comparison to just a few existing methods.",
        "In the future, we hope to compare our method to other competing methods like joint learning approaches in terms of both accuracy and computational efficiency, and perform extensive experiments on various tasks."
      ]
    }
  ]
}
