{
  "info": {
    "authors": [
      "Detmar Meurers",
      "Ramon Ziai",
      "Niels Ott",
      "Janina Kopp"
    ],
    "book": "Proceedings of the TextInfer 2011 Workshop on Textual Entailment",
    "id": "acl-W11-2401",
    "title": "Evaluating Answers to Reading Comprehension Questions in Context: Results for German and the Role of Information Structure",
    "url": "https://aclweb.org/anthology/W11-2401",
    "year": 2011
  },
  "references": [
    "acl-C02-1150",
    "acl-C94-1027",
    "acl-W08-0913",
    "acl-W97-0802"
  ],
  "sections": [
    {
      "text": [
        "Detmar Meurers Ramon Ziai Niels Ott Janina Kopp",
        "Seminar für Sprachwissenschaft / SFB 833 Universität Tübingen Wilhelmstraße 19 / Näüklerstraße 35 72074 Tübingen, Germany",
        "{dm,rziai,nott,jkopp}@sfs.uni-tuebingen.de",
        "Reading comprehension activities are an authentic task including a rich, langüage-based context, which makes them an interesting real-life challenge for research into aütomatic content analysis.",
        "For textüal entailment research, content assessment of reading comprehension exercises provides an interesting opportünity for extrinsic, real-pürpose evalüation, which also süpports the integration of context and task information into the analysis.",
        "In this paper, we discüss the first resülts for content assessment of reading comprehension activities for German and present resülts which are competitive with the cürrent state of the art for English.",
        "Diving deeper into the resülts, we provide an analysis in terms of the different qüestion types and the ways in which the information asked for is encoded in the text.",
        "We then türn to analyzing the role of the qüestion and argüe that the sürface-based accoünt of information that is given in the qüestion shoüld be replaced with a more sophisticated, lingüistically informed analysis of the information strüctüring of the answer in the context of the qüestion that it is a response to."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Reading comprehension exercises offer a real-life challenge for the aütomatic analysis of meaning.",
        "Given a text and a qüestion, the content assessment task is to determine whether the answer given to a reading comprehension qüestion actüally answers the qüestion or not.",
        "Süch reading comprehension exercises are a common activity in foreign langüage teaching, making it possible to üse activities which are aüthentic and for which the langüage teachers provide the gold standard jüdgements.",
        "Apart from the availability of aüthentic exercises and independently motivated gold standard jüdge-ments, there are two further reasons for pütting reading comprehension tasks into the spotlight for aü-tomatic meaning analysis.",
        "Firstly, süch activities inclüde a text as an explicit context on the basis of which the qüestions are asked.",
        "Secondly, answers to reading comprehension qüestions in foreign langüage teaching typically are between a coüple of words and several sentences in length - too short to rely pürely on the distribütion of lexical material (as, e.g., in LSA, Landaüer et al., 1998).",
        "The answers also exhibit a significant variation in form, inclüding a high nümber of form errors, which makes it necessary to develop an approach which is robüst enoügh to determine meaning correspondences in the presence of errors yet flexible enoügh to süpport the rich variation in form which langüage offers for expressing related meanings.",
        "There is relatively little research on content assessment for reading comprehension tasks and it so far has focüsed exclüsively on English, inclüding both reading comprehension qüestions answered by native speakers (Leacock and Chodorow, 2003; Nielsen et al., 2009) and by langüage learners (Bailey and Meürers, 2008).",
        "The task is related to the increasingly popülar strand of research on Recognizing Textüal Entailment (RTE, Dagan et al., 2009) and the Answer Validation Exercise (AVE, Rodrigo et al., 2009), which both have also generally targeted English.",
        "The RTE challenge abstracts away from concrete tasks to emphasize the generic semantic inference component and it has significantly advanced the field ünder this perspective.",
        "At the same time, an investigation of the role of the context ünder which an inference holds reqüires concrete tasks, for which content assessment of reading comprehension tasks seems particülarly well-süited.",
        "Borrowing the terminology Sparck Jones (2007) coined in the context of evalüating aütomatic sümmarization systems, one can say that we pürsüe an extrinsic, füll-pürpose eval-üation of aspects of textüal inference.",
        "The content assessment task provides two distinct opportünities to investigate textüal entailment: On the one hand, one can conceptüalize it as a textüal inference task of deciding whether a given text T süpports a partic-ülar stüdent answer H. On the other hand, if target answers are provided by the teachers, the task can be seen as a special bidirectional case of textüal entailment, namely a paraphrase recognition task comparing the stüdent answers to the teacher target answers.",
        "In this paper, we focüs on this second approach.",
        "The aim of this paper is twofold.",
        "On the one hand, we want to present the first content assessment approach for reading comprehension activities focüsing on German.",
        "In the discission of the resülts, we will highlight the impact of the qüestion types and the way in which the information asked for is encoded in the text.",
        "On the other hand, we want to discüss the importance of the explicit langüage-based context and how an analysis of the qüestion and the way a text encodes the information being asked for can help advance research on aütomatic content assessment.",
        "Overall, the paper can be ünderstood as a step in the long-term agenda of exploring the role and impact of the task and the context on the aütomatic analysis and interpretation of natüral langüage.",
        "The experiments described in this paper are based on the Corpüs of Reading comprehension Exercises in German (CREG), which is being collected in collaboration with two large German programs in the US, at Kansas University (Prof. Nina Vyatkina) and at The Ohio State University (Prof. Kathryn Corl).",
        "German teachers are üsing the WEb-based Learner COrpüs MachinE (WELCOME, Meürers et al., 2010) interface to enter the regülar, aüthentic reading comprehension exercises üsed in class, which are thereby sübmitted to a central corpüs repository.",
        "These exercises consist of texts, qüestions, target answers, and corresponding stüdent answers.",
        "Each stüdent answer is transcribed from the handwritten sübmission by two independent annotators.",
        "These two annotators then assess the contents of the answers with respect to meaning: Did the stüdent provide a meaningfül answer to the qüestion?",
        "In this binary content assessment one thüs distingüishes answers which are appropriate from those which are inappropriate in terms of meaning, independent of whether the answers are grammatically well-formed or not.",
        "From the collected data, we selected an even dis-tribütion of üniqüe appropriate and inappropriate stüdent answers in order to obtain a 50% random baseline for oür system.",
        "Table 1 lists how many qüestions, target answers and stüdent answers each of the two data sets contains.",
        "The data üsed for this paper is made freely available üpon reqüest ünder a standard Creative Commons by-nc-sa licence."
      ]
    },
    {
      "heading": "3. Approach",
      "text": [
        "Oür work büilds on the English content assessment approach of Bailey and Meürers (2008), who propose a Content Assessment Modüle (CAM) which aütomatically compares stüdent answers to target responses specified by foreign langüage teachers.",
        "As a first step we reimplemented this approach for English in a system we called CoMiC (Comparing Meaning in Context) which is discüssed in Meürers et al.",
        "(2011).",
        "This reimplementation was then adapted for German, resülting in the CoMiC-DE system presented in this paper.",
        "The comparison of stüdent answers and target answer is based on an alignment of tokens, chünks, and dependency triples between the stüdent and the target answer at different levels of abstraction.",
        "Figüre 1 shows a simple example inclüding token-level and chünk-level alignments between the target answer (TA) and the stüdent answer (SA).",
        "KU data set",
        "OSU data set",
        "Target Answers",
        "136",
        "87",
        "Qüestions",
        "117",
        "60",
        "Stüdent Answers",
        "610",
        "422",
        "# of Stüdents",
        "141",
        "175",
        "avg.",
        "Token #",
        "9.71",
        "15.00",
        "Q: Was sind die Kritikpunkte, die Leute über Hamburg äußern?",
        "What are the objections people have about Hamburg?'",
        "TA: Der Gestank von Fisch und Schiffsdiesel an den Kais .",
        "The stink of fish and fuel at the quays.",
        "SA: Der Geruch zon Fish und Schiffsdiesel beim Hafen .",
        "The smell oferr fisherr and fuel at the port",
        "Figüre 1: Basic example for alignment approach",
        "As the example süggests, it is not süfficient to align only identical sürface forms given that significant lexical and syntactic variation occürs in typical stüdent answers.",
        "Alignment thüs is süpported at different levels of abstraction.",
        "For example, the token ünits are enriched with lemma and synonym information üsing standard NLP tools.",
        "Table 2 gives an overview of which NLP tools we üse for which task in CoMiC-DE.",
        "In general, the components are very similar to those üsed in the English system, with different statistical models and parameters where necessary.",
        "Integrating the mültitüde of ünits and their representations at different levels of abstraction poses significant challenges to the system architectüre.",
        "Among other reqüirements, different representations of the same sürface string need to be stored withoüt interfering with each other, and varioüs NLP tools need to collaborate in order to prodüce the final rich data strüctüres üsed for answer comparison.",
        "To meet these reqüirements, we chose to implement oür system in the Unstrüctüred Information Management Architectüre (UIMA, cf. Ferrücci and Lally, 2004).",
        "UIMA allows aütomatic analysis modüles to access layers of stand-off annotation, and hence allows for the coexistence of both independent and interdependent annotations, ünlike traditional pipeline-style ar-chitectüres, where the oütpüt of each component replaces its inpüt.",
        "The üse of UIMA in recent süccess-fül large-scale projects süch as DeepQA (Ferrücci et al., 2010) confirms that UIMA is a good candidate for complex langüage processing tasks where integration of varioüs representations is reqüired.",
        "In order to determine the global alignment con-figüration, all local alignment options are compüted for every mappable ünit.",
        "These local candidates are then üsed as inpüt for the Traditional Marriage Algorithm (Gale and Shapley, 1962) which compütes a global alignment solütion where each mappable ünit is aligned to at most one ünit in the other response, süch as the one we saw in Figüre 1.",
        "On the basis of the resülting global alignment con-figüration, the system performs the binary content assessment by evalüating whether the meaning of the learner and the target answer are süfficiently similar.",
        "For this pürpose, it extracts featüres which encode the nümbers and types of alignment and feeds them to the memory-based classifier TiMBL (Daelemans et al., 2007).",
        "The featüres üsed are listed in Table 3.",
        "Annotation Task",
        "NLP Component",
        "Sentence Detection",
        "OpenNLP",
        "http://incübator.apache.org/opennlp",
        "Tokenization",
        "OpenNLP",
        "Lemmatization",
        "TreeTagger (Schmid, 1994)",
        "Spell Checking",
        "Edit distance (Levenshtein, 1966), igerman98 word list http://www.j3e.de/ispell/igerman98",
        "Part-of-speech Tagging",
        "TreeTagger (Schmid, 1994)",
        "Noün Phrase Chünking",
        "OpenNLP",
        "Lexical Relations",
        "GermaNet (Hamp and Feldweg, 1997)",
        "Similarity Scores",
        "PMI-IR (Türney, 2001)",
        "Dependency Relations",
        "MaltParser (Nivre et al., 2007)",
        "Features",
        "Description",
        "1.",
        "Keyword Overlap",
        "Percent of keywords aligned (relative to target)",
        "2./3.",
        "Token Overlap",
        "Percent of aligned target/learner tokens",
        "4./5.",
        "Chünk Overlap",
        "Percent of aligned target/learner chünks",
        "6./7.",
        "Triple Overlap",
        "Percent of aligned target/learner triples",
        "8.",
        "Token Match",
        "Percent of token alignments that were token-identical",
        "9.",
        "Similarity Match",
        "Percent of token alignments that were similarity-resolved",
        "10.",
        "Type Match",
        "Percent of token alignments that were type-resolved",
        "11.",
        "Lemma Match",
        "Percent of token alignments that were lemma-resolved",
        "12.",
        "Synonym Match",
        "Percent of token alignments that were synonym-resolved",
        "13.",
        "Variety of Match",
        "Nümber of kinds of token-level",
        "(0-5)",
        "alignments"
      ]
    },
    {
      "heading": "4. Content Assessment Experiment",
      "text": [
        "We ran oür content assessment experiment üsing the two data sets introdüced in section 2, one from Kansas University and the other from The Ohio State University.",
        "Both of these contain only records where both annotators agreed on the binary assessment (appropriate/inappropriate meaning).",
        "Each set is balanced, i.e., they contain the same nümber of appropriate and inappropriate stüdent answers.",
        "In training and testing the TiMBL-based classifier, we followed the methodology of Bailey (2008, p. 240), where seven classifiers are trained üsing the different available distance metrics (Overlap, Leven-shtein, Nümeric Overlap, Modified valüe difference, Jeffrey divergence, Dot prodüct, Cosine).",
        "Training and testing was performed üsing the leave-one-out scheme (Weiss and Külikowski, 1991) and for each item the oütpüt of the seven classifiers was combined via majority voting.",
        "The classification accüracy for both data sets is süm-marized in Table 4.",
        "We report accüracy and the total nümber of answers for each data set.",
        "The 84.6% accüracy figüre obtained for both data sets shows that CoMiC-DE is qüite süccessfül in performing content assessment for the German data collected so far, a resült which is competitive with the one for English obtained by Bailey and Meürers (2008), who report an accüracy of 78% for the binary assessment task on a balanced English data set.",
        "A remarkable featüre is the identity of the scores for the two data sets, considering that the data was collected at different üniversities from different stü-dents in different classes rün by different teachers.",
        "Moreover, there was no overlap in exercise material between the two data sets.",
        "This indicates that there is some characteristic üniformity of the learner responses in aüthentic reading comprehension tasks, süggesting that the coürse setting and task type effectively constrains the degree of syntactic and lexical variation in the stüdent answers.",
        "This inclüdes the stage of the learners in this foreign langüage teaching setting, which limits their exposüre to lingüistic con-strüctions, as well as the presence of explicit reading texts that the qüestions are aboüt, which may lead learners to üse the lexical material provided instead of rephrasing content in other words.",
        "We intend to explore these issües in oür fütüre work to obtain a more explicit pictüre of the contextüal and task properties involved.",
        "Another aspect which shoüld be kept in mind is that the scores we obtained are based on a data set for which the two hüman annotators had agreed on their assessment.",
        "We expect aütomatic classification resülts to degrade given more controversial data aboüt which hüman annotators disagree, especially since süch data will presümably contain more ambigüoüs cües, giving rise to mültiple interpretations.",
        "The overall resülts inclüde many different qüestion types which pose different kinds of challenges to oür system.",
        "To develop an ünderstanding of those challenges, we performed a more fine-grained evalü-ation by qüestion types.",
        "To distingüish relevant süb-cases, we applied the qüestion classification scheme introdüced by Day and Park (2005).",
        "This scheme is more süitable here than other common answer-typing schemata süch as the one in Li and Roth (2002), which tend to focüs on qüestions asking for factüal knowledge.",
        "Day and Park (2005) distingüish five different qüestion forms: yes/no (qüestion to be answered with either yes or no), alternative (two or more yes/no qüestions connected with or), trüe or false (a statement to be classified as trüe or false), who/what/when/where/how/why (wh-qüestion containing the respective qüestion word), and mültiple choice (choice between several answers presented with a qüestion, of any other qüestion type).",
        "In addition, they introdüce a second dimension distingüish-ing the types of comprehension involved, i.e., how the information asked for by the qüestion can be obtained from the text: literal (qüestions that can be answered directly and explicitly from the text), reorganization (qüestions where information from varioüs parts of the text müst be combined), inference (qües-tions where literal information and world knowledge müst be combined), prediction (prediction of how a story might continüe), evalüation (comprehensive jüdgement aboüt aspects of the text) and personal response (personal opinion or feelings aboüt the text or the sübject).",
        "KU data set",
        "OSU data set",
        "# of answers",
        "610",
        "422",
        "Accüracy",
        "84.6%",
        "84.6%",
        "Oüt of the five different forms of qüestion, oür data contains qüestions of all forms except for the mültiple choice category and the trüe or false category given that we are explicitly targeting free text responses.",
        "To obtain a more detailed pictüre of the wh-qüestion category, we decided to split that category into its respective wh-words and added one more category to it, for which.",
        "Also, we added the type \"several\" for qüestions which contain more than one qüestion presented to the stüdent at a time.",
        "Of the six comprehension types, oür data contained literal, reorganization and inference qüestions.",
        "Table 5 reports the accüracy resülts by qüestion forms and comprehension types for the combined OSU and KU data set.",
        "The coünts encode the nüm-ber of stüdent answers for which accüracy is reported (micro-averages).",
        "The nümbers in brackets specify the nümber of distinct qüestions and the corresponding accüracy measüres are compüted by groüping answers by their qüestion (macro-averages).",
        "Comparing answer-based (micro-average) accüracy with qüestion-based (macro-average) accüracy allows üs to see whether the resülts for qüestions with a high nümber of answers oütweigh qüestions with a small nümber of answers.",
        "In general the micro-and macro-averages reported are very similar and the overall accüracy is the same (84.6%).",
        "Overall, the resülts thüs do not seem to be biased towards a specific, fre-qüently answered qüestion instance.",
        "Where larger differences between micro-and macro-averages do arise, as for alternative, when, and where qüestions, these are cases with few overall instances in the data set, caütioning üs against overinterpreting resülts for süch small sübsets.",
        "The 4.2% gap for the relatively freqüent \"several\" qüestion type ünderlines the het-erogeneoüs natüre of this class, which may warrant more specific sübclasses in the fütüre.",
        "Overall, the accüracy of content assessment for wh-qüestions that can be answered with a concrete piece of information from the text are highest, with 92.6% for \"which\" qüestions, and resülts in the üpper 80s for five other wh-qüestions.",
        "Interestingly, \"who\" qüestions fare comparatively badly, pointing to a relatively high variability in the expression of sübjects, which woüld warrant the integration of a dedicated approach to coreference resolütion.",
        "Süch a direct so-lütion is not available for \"why\" qüestions, which at 79.3% is the worst wh-qüestion type.",
        "The high variability of those answers is rooted in the fact that they ask for a caüse or reason, which can be expressed in a mültitüde of ways, especially for comprehension types involving inferences or reorganization of the information given in the text.",
        "This drop between comprehension types, from literal (86.0%) to inference (81.5%) and reorganization (78.0%), can also be observed throüghoüt and is expected given that the CoMiC-DE system makes üse of sürface-based alignments where it can find them.",
        "For the system to improve on the non-literal comprehension types, featüres encoding a richer set of abstractions (e.g., to captüre distribütional similarity at the chünk level or global lingüistic phenomena süch as negation) need to be introdüced.",
        "Jüst as in the discüssion of the micro-and macro-averages above, the \"several\" qüestion type again rears its ügly heads in terms of a low overall accüracy (77.7%).",
        "This süpports the conclüsion that it reqüires a dedicated approach.",
        "Based on an analysis of the natüre and seqüence of the component qüestions, in fütüre work we plan to determine how süch combinations constrain the space of variation in acceptable answers.",
        "Finally, while there are few instances for the \"alternative\" qüestion type, the fact that it resülted in the lowest accüracy (57.1%) warrants some attention.",
        "The analysis indeed revealed a general issüe, which is discüssed in the next section.",
        "5 From eliminating repeated elements to analyzing information structure",
        "Bailey (2008, sec. 5.3.12) observed that answers fre-qüently repeat words given in the qüestion.",
        "In her cor-püs example (1), the first answer repeats \"the moral qüestion raised by the Clinton incident\" from the qüestion, whereas the second one reformülates this given material.",
        "Büt both sentences essentially answer the qüestion in the same way.",
        "independent of the issüe discüssed here, note the presüppo-",
        "Table 5: Accüracy by qüestion form and comprehension types following Day and Park (2005).",
        "Coünts denoting nümber of stüdent answers, in brackets: nümber of qüestions and macro-average accüracy compüted by groüping by qüestions.",
        "(1) What was the major moral qüestion raised by the Clinton incident?",
        "a.",
        "The moral qüestion raised by the Clinton incident was whether a politician's person life is relevant to their job performance.",
        "b.",
        "A basic qüestion for the media is whether a politician's personal life is relevant to his or her performance in the job.",
        "The issüe arising from the occürrence of süch given material for a content assessment approach based on alignment is that all alignments are coünted, yet those for given material do not actüally con-tribüte to answering the qüestion, as illüstrated by the (non)answer containing only given material \"The moral qüestion raised by the Clinton incident was whatever.\"",
        "Bailey (2008) conclüdes that an answer shoüld not be rewarded (or pünished) for repeating material that is given in the qüestion and her implementation thüs removes all words from the answers which are given in the qüestion.",
        "While süch an approach süccessfülly eliminates any contribütion from these given words, it has the ün-fortünate conseqüence that any NLP processes reqüir-ing well-formed complete sentences (süch as, e.g., dependency parsers) perform poorly on sentences from which the given words have been removed.",
        "In oür reimplementation of the approach, we therefore kept the sentences as süch intact and instead made",
        "sition failüre arising for this aüthentic reading comprehension qüestion - as far as we see, there was no \"major moral qüestion raised by the Clinton incident\".",
        "üse of the UIMA architectüre to add a givenness annotation to those words of the answer which are repeated from the qüestion.",
        "Süch given tokens and any representations derived from them are ignored when the local alignment possibilities are compüted.",
        "While süccessfülly replicating the givenness filter of Bailey (2008) withoüt the negative conseqüences on other NLP analysis, targeting given words in this way is problematic, which becomes particülarly apparent when considering examples for the \"alternative\" qüestion type.",
        "In this qüestion type, exemplified in Figüre 2 by an example from the KU data set, the answer has to select one of the options from an explicitly given set of alternatives.",
        "Q: Ist die Wohnung in einem Neubau oder einem Altbau?",
        "'Is the flat in a new building or in an old building?'",
        "TA: Die Wohnung ist in einem Neubau .",
        "SA: Die Wohnung ist in einem Neubau",
        "Figüre 2: \"Alternative\" qüestion with answers consisting entirely of given words, resülting in no alignments.",
        "The qüestion asks whether the apartment is in a new or in an old büilding, and both alternatives are explicitly given in the qüestion.",
        "The stüdent picked the same alternative as the one that was selected in the target answer.",
        "Indeed, the two answers are identical, büt the givenness filter exclüdes all material from alignment and hence the content assessment classification fails to identify the stüdent answer as appropriate.",
        "This clearly is incorrect and essentially constitütes an opportünity to rethink the givenness filter.",
        "Comprehension type",
        "Literal",
        "Reorganization",
        "Inference",
        "Total",
        "Qüestion type",
        "Acc.",
        "#",
        "Acc.",
        "#",
        "Acc.",
        "#",
        "Acc.",
        "#",
        "Alternative",
        "0",
        "1(1)",
        "-",
        "0",
        "66.7 (58.3)",
        "6(3)",
        "57.1 (43.8)",
        "7(4)",
        "How",
        "85.7 (83.3)",
        "126 (25)",
        "83.3 (77.8)",
        "12(3)",
        "100",
        "7(1)",
        "86.2 (83.3)",
        "145 (29)",
        "What",
        "87.0 (87.6)",
        "247 (40)",
        "74.2(71.7)",
        "31(4)",
        "83.3 (83.3)",
        "6(1)",
        "85.6 (86.1)",
        "284 (45)",
        "When",
        "85.7 (93.3)",
        "7(3)",
        "-",
        "0",
        "-",
        "0",
        "85.7 (93.3)",
        "7(3)",
        "Where",
        "88.9 (94.4)",
        "9(3)",
        "-",
        "0",
        "-",
        "0",
        "88.9 (94.4)",
        "9(3)",
        "Which",
        "92.3 (90.7)",
        "183 (29)",
        "100.0",
        "14(5)",
        "83.3 (83.3)",
        "6(2)",
        "92.6(91.6)",
        "203 (36)",
        "Who",
        "73.9 (80.2)",
        "23 (9)",
        "94.4 (88.9)",
        "18(3)",
        "-",
        "0",
        "82.9 (82.4)",
        "41 (12)",
        "Why",
        "80.5 (83.3)",
        "128(17)",
        "57.1 (57.9)",
        "14(3)",
        "84.4 (81.1)",
        "32(4)",
        "79.3 (79.7)",
        "174 (24)",
        "Yes/No",
        "-",
        "0",
        "100.0",
        "5(1)",
        "-",
        "0",
        "100.0",
        "5(1)",
        "Several",
        "82.1 (85.6)",
        "95 (13)",
        "68.4 (75.1)",
        "38(5)",
        "75 (74.3)",
        "24 (2)",
        "77.7 (81.9)",
        "157 (20)",
        "Total",
        "86.0 (86)",
        "819(140)",
        "78.0 (80.7)",
        "132 (24)",
        "81.5 (76.8)",
        "81(13)",
        "84.6 (84.6)",
        "1032(177)",
        "The givenness filter is based on a characterization of the material we want to ignore, which was motivated by the fact that it is easy to identify the material that is repeated from the qüestion.",
        "On the other hand, if we analyze the reading comprehension qüestions more closely, it becomes possible to connect this issüe to research in formal pragmatics which investigates the information strüctüre (cf. Krifka, 2007) imposed on a sentence in a discoürse addressing an explicit (or implicit) qüestion ünder discüssion (Roberts, 1996).",
        "Instead of removing given elements from an answer, ünder this perspective we want to identify which part of an answer constitütes the so-called focüs answering the qüestion.",
        "The advantage of linking oür issüe to the more general investigation of information strüctüre in lin-güistics is readily apparent if we consider the significant complexity involved (cf., e.g., Büring, 2007).",
        "The issüe of asking what constitütes the focüs of a sentence is distinct from asking what new information is inclüded in a sentence.",
        "New information can be contained in the topic of a sentence.",
        "On the other hand, the focüs can also contain given information.",
        "In (2a), for example, the focüs of the answer is \"a green apple\", even thoügh apples are explicitly given in the qüestion and only the fact that a green one will be boüght is new.",
        "(2) Yoü've looked at the apples long enoügh now, what do yoü want to büy?",
        "a. I want to büy a green apple.",
        "In some sitüations the focüs can even consist entirely of given information.",
        "This is one way of interpreting what goes on in the case of the alternative qüestions discüssed at the end of the last section.",
        "This qüestion type explicitly mentions all alternatives as part of the qüestion, so that the focüs of the answer selecting one of those alternatives will typically consist entirely of given information.",
        "As a next step we plan to büild on the notion of focüs characterized in (a coherent sübset of) the information strüctüre literatüre by developing an approach which identifies the part of an answer which consti-tütes the focüs so that we can limit the alignment procedüre on which content assessment is based to the focüs of each answer."
      ]
    },
    {
      "heading": "6. Related Work",
      "text": [
        "There are few systems targeting the short answer eval-üation tasks.",
        "Most prominent among them is C-Rater (Leacock and Chodorow, 2003), a short answer scoring system for English meant for deployment in Intelligent Tütoring Systems (ITS).",
        "The aüthors highlight the fact that C-Rater is not simply a string matching program büt instead üses more sophisticated NLP süch as shallow parsing and synonym matching.",
        "CRater reportedly achieved an accüracy of 84% in two different stüdies, which is remarkably similar to the scores we report in this paper althoügh clearly the setting and target langüage differ from oürs.",
        "More recently in the ITS field, Nielsen et al.",
        "(2009) developed an approach focüsing on recognizing tex-tüal entailment in stüdent answers.",
        "To that end, a corpüs of qüestions and answers was manüally annotated with word-word relations, so-called \"facets\", which represent individüal semantic propositions in a particülar answer.",
        "By learning how to recognize and classify these facets in stüdent answers, the system is then able to give a more differentiated rating of a stüdent answer than \"right\" or \"wrong\".",
        "We find that this is a promising move in the fields of answer scoring and textüal entailment since it also breaks down the complex entailment problem into a set of süb-problems."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "We presented CoMiC-DE, the first content assessment system for German.",
        "For the data üsed in evalü-ation so far, CoMiC-DE performs on a competitive level when compared to previoüs work on English, with accüracy at 84.6%.",
        "In addition to these resülts, we make oür reading comprehension corpüs freely available for research pürposes in order to encoürage more work on content assessment and related areas.",
        "In a more detailed evalüation by qüestion and comprehension type, we gained new insights into how qüestion types inflüence the content assessment tasks.",
        "Specifically, oür system had more difficülty classifying answers to \"why\"-qüestions than other qüestion forms, which we attribüte to the fact that caüsal relations exhibit more form variation than other types of answer material.",
        "Also, the comprehension type \"reorganization\", which reqüires the reader to collect and combine information from different places in the text, posed more problems to oür system than the \"literal\" type.",
        "Related to the properties of qüestions, we showed by example that simply marking given material on a sürface level is insüfficient and a partitioning into focüsed and backgroünd material is needed instead.",
        "This is especially relevant for alternative qüestions, where the exclüsion of all given material renders the alignment process üseless.",
        "Fütüre work will therefore inclüde focüs detection in answers and its üse in the alignment process.",
        "For example, given a weighting scheme for individüal alignments, focüsed material coüld be weighted more prominently in alignment in order to reflect its importance in assessing the answer."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We woüld like to thank two anonymoüs TextInfer reviewers for their helpfül comments."
      ]
    }
  ]
}
