{
  "info": {
    "authors": [
      "Chi-kiu Lo",
      "Dekai Wu"
    ],
    "book": "Proceedings of Fifth Workshop on Syntax, Semantics and Structure in Statistical Translation",
    "id": "acl-W11-1002",
    "title": "Structured vs. Flat Semantic Role Representations for Machine Translation Evaluation",
    "url": "https://aclweb.org/anthology/W11-1002",
    "year": 2011
  },
  "references": [
    "acl-E06-1031",
    "acl-E06-1032",
    "acl-J05-1004",
    "acl-N04-1030",
    "acl-P02-1040",
    "acl-P09-1034",
    "acl-P11-1023",
    "acl-W05-0904",
    "acl-W05-0909",
    "acl-W06-3114",
    "acl-W07-0738",
    "acl-W10-1703",
    "acl-W10-3807"
  ],
  "sections": [
    {
      "text": [
        "Chi-kiu Lo and Dekai Wu",
        "HKUST",
        "Human Language Technology Center Dept.",
        "of Computer Science and Engineering Hong Kong University of Science and Technology",
        "{jackielo|dekai}@cs.ust.hk",
        "We argue that failing to capture the degree of contribution of each semantic frame in a sentence explains puzzling results in recent work on the MEANT family of semantic MT evaluation metrics, which have disturbingly indicated that dissociating semantic roles and fillers from their predicates actually improves correlation with human adequacy judgments even though, intuitively, properly segregating event frames should more accurately reflect the preservation of meaning.",
        "Our analysis finds that both properly structured and flattened representations fail to adequately account for the contribution of each semantic frame to the overall sentence.",
        "We then show that the correlation of HMEANT, the human variant of MEANT, can be greatly improved by introducing a simple length-based weighting scheme that approximates the degree of contribution of each semantic frame to the overall sentence.",
        "The new results also show that, without flattening the structure of semantic frames, weighting the degree of each frame's contribution gives HMEANT higher correlations than the previously best-performing flattened model, as well as HTER."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In this paper we provide a more concrete answer to the question: what would be a better representation, structured or flat, of the roles in semantic frames to be used in a semantic machine translation (MT) evaluation metric?",
        "We compare recent studies on the MEANT family of semantic role labeling (SRL) based MT evaluation metrics (Lo and Wu, 2010a,b, 2011a,b) by (1) contrasting their variations in semantic role representation and observing disturbing comparative results indicating that segregating the event frames in structured role representation actually damages correlation against human adequacy judgments and (2) showing how SRL based MT evaluation can be improved beyond the current state-of-the-art compared to previous MEANT variants as well as HTER, through the introduction of a simple weighting scheme that reflects the degree of contribution of each semantic frame to the overall sentence.",
        "The weighting scheme we propose uses a simple length-based heuristic that reflects the assumption that a semantic frame that covers more tokens contributes more to the overall sentence translation.",
        "We demonstrate empirically that when the degree of each frame's contribution to its sentence is taken into account, the properly structured role representation is more accurate and intuitive than the flattened role representation for SRL MT evaluation metrics.",
        "For years, the task of measuring the performance of MT systems has been dominated by lexical n-gram based machine translation evaluation metrics, such as BLEU (Papineni et al., 2002), NIST (Doddington, 2002), METEOR (Banerjee and Lavie, 2005), PER (Tillmann et al., 1997), CDER (Leusch et al., 2006) and WER (Nießen et al., 2000).",
        "These metrics are excellent at ranking overall systems by averaging their scores over entire documents.",
        "However, as MT systems improve, the shortcomings of such metrics are becoming more apparent.",
        "Though containing roughly the correct words, MT output at the sentence remains often quite incomprehensible, and fails to preserve the meaning of the input.",
        "This results from the fact that n-gram based metrics are not as reliable at ranking the adequacy of translations of individual sentences, and are particularly poor at reflecting translation quality improvements involving more meaningful word sense or semantic frame decisions – which human judges have no trouble distinguishing.",
        "Callison-Burch et al.",
        "(2006) and Koehn and Monz (2006), for example, study situations where BLEU strongly disagrees with human judgment of translation quality.",
        "Newer avenues of research seek substitutes for n-gram based MT evaluation metrics that are better at evaluating translation adequacy, particularly at the sentence level.",
        "One line of research emphasizes more the structural correctness of translation.",
        "Liu and Gildea (2005) propose STM, a metric based on syntactic structure, that addresses the failure of lexical similarity based metrics to evaluate translation grammaticality.",
        "However, the problem remains that a grammatical translation can achieve a high syntax-based score yet still make significant errors arising from confusion of semantic roles.",
        "On the other hand, despite the fact that non-automatic, manually evaluated metrics, such as HTER (Snover et al., 2006), are more adequacy oriented exhibit much higher correlation with human adequacy judgment, their high labor cost prohibits widespread use.",
        "There has also been work on explicitly evaluating MT adequacy by aggregating over a very large set of linguistic features (Gimenez and Marquez, 2007, 2008) and textual entailment (Padó et al., 2009)."
      ]
    },
    {
      "heading": "2. SRL based MT evaluation metrics",
      "text": [
        "A blueprint for more direct assessment of meaning preservation across translation was outlined by Lo and Wu (2010a), in which translation utility is manually evaluated with respect to the accuracy of semantic role labels.",
        "A good translation is one from which human readers may successfully understand at least the basic event structure – \"who did what to whom, when, where and why\" (Pradhan et al., 2004)-which represents the most essential meaning of the source utterances.",
        "Adopting this principle, the MEANT family of metrics compare the semantic frames in reference translations against those that can be reconstructed from machine translation output.",
        "Preliminary results reported in (Lo and Wu, 2010b) confirm that the blueprint model outperforms BLEU and similar n-gram oriented evaluation metrics in correlation against human adequacy judgments, but does not fare as well as HTER.",
        "The more complete study of Lo and Wu (2011a) introduces MEANT and its human variants HMEANT, which implement an extended version of blueprint methodology.",
        "Experimental results show that HMEANT correlates against human adequacy judgments as well as the more expensive HTER, even though HMEANT can be evaluated using low-cost untrained monolingual semantic role annotators while still maintaining high inter-annotator agreement (both are far superior to BLEU or other surface oriented evaluation metrics).",
        "The study also shows that replacing the human semantic role labelers with an automatic shallow semantic parser yields an approximation that is still vastly superior to BLEU while remaining about 80% as closely correlated with human adequacy judgments as HTER.",
        "Along with additional improvements to the accuracy of the MEANT family of metrics, Lo and Wu (2011b) study the impact of each individual semantic role to the metric's correlation against human adequacy judgments, as well as the time cost for humans to reconstruct the semantic frames and compare the translation accuracy of the role fillers.",
        "In general, the MEANT family of SRL MT evaluation metrics (Lo and Wu, 2011a,b) evaluate the translation utility as follows.",
        "First, semantic role labeling is performed (either manually or automatically) on both the reference translation (REF) and the machine translation output (MT) to obtain the semantic frame structure.",
        "Then, the semantic predicates, roles and fillers reconstructed from the MT output are compared to those in the reference translations.",
        "The number of correctly and partially correctly annotated arguments of each type in each frame of the MT output are collected in this step:",
        "Cij = # correct ARG i of PRED i in MT Pitj = # partially correct ARG j of PRED i in MT Mij = total # ARG j of PRED i in MT Ri , j = total # ARG j of PRED i in REF",
        "In the following three subsections, we describe how the translation utility is calculated using these counts in (a) the original blueprint model, (b) the first version of HMEANT and MEANT using structured role representations, and (c) the more accu-",
        "Figure 1: The structured role representation for the blueprint SRL-based MT evaluation metric as proposed in Lo and Wu (2010a,b), with arguments aggregated into core and adjunct classes.",
        "rate flattened-role implementation of HMEANT and MEANT",
        "Figure 1 depicts the semantic role representation in the blueprint model of SRL MT evaluation metric proposed by Lo and Wu (2010a,b).",
        "Each sentence consists of a number of frames, and each frame consists of a predicate and two classes of arguments, either core or adjunct.",
        "The frame precision/recall is the weighted sum of the number of correctly translated roles (where arguments are grouped into the core and adjunct classes) in a frame normalized by the weighted sum of the total number of all roles in that frame in the MT/REF respectively.",
        "The sentence precision/recall is the sum of the frame precision/recall for all frames averaged by the total number of frames in the MT/REF respectively.",
        "The SRL evaluation metric is then defined in terms of f-score in order to balance the sentence precision and recall.",
        "More precisely, assuming the above definitions of Cij, Pij, Mij and Rij, the sentence precision and recall are defined as follows.",
        "precision # frames in MT # frames in REF",
        "Figure 2: The structured role representation for the MEANT family of metrics as proposed in Lo and Wu (2011a).",
        "where iopred is the weight for predicates, and wtwhere t G {core, adj} is the weight for core arguments and adjunct arguments.",
        "These weights represent the degree of contribution of the predicate and different classes of arguments (either core or adjunct) to the overall meaning of the semantic frame they attach to.",
        "In addition, wpartial is a weight controlling the degree to which \"partially correct\" translations are penalized.",
        "All the weights can be automatically estimated by optimizing the correlation with human adequacy judgments.",
        "We conjecture that the reason for the low correlation with human adequacy judgments of this model as reported in Lo and Wu (2010b) is that the abstraction of arguments actually reduces the representational power of the original predicate-argument structure in SRL.",
        "Under this representation, all the arguments in the same class, e.g. all adjunct arguments, are weighted uniformly.",
        "The assumption that all types of arguments in the same class have the same degree of contribution to their frame is obviously wrong, and the empirical results confirm that the assumption is too coarse.",
        "Figure 2 shows the structured role representation used in the MEANT family of metrics as proposed in Lo and Wu (2011a), which avoids aggregating arguments into core and adjunct classes.",
        "The design of the MEANT family of metrics addresses the incorrect assumption in the blueprint model by assuming each type of argument has a unique weight representing its degree of contribution to the overall sentence translation.",
        "Thus, the number of dimensions of precision # frames in REF the weight vector is increased to allow an independent weight to be assigned to each type of argument.",
        "Unlike the previous representation in the blueprint model, there is no aggregation of arguments into core and adjunct classes.",
        "Each sentence consists of a number of frames, and each frame consists of a predicate and a number of arguments of type j.",
        "Under the new approach, the frame precision/recall is the weighted sum of the number of correctly translated roles in a frame normalized by the weighted sum of the total number of all roles in that frame in the MT/REF respectively.",
        "Similar to the previous blueprint representation, the sentence precision/recall is the sum of the frame precision/recall for all frames averaged by the total number offrames in the MT/REF respectively.",
        "More precisely, following the previous definitions of Cij, Pij, My, Rij, Wpred and Wpartial, the sentence precision and recall are redefined as follows.",
        "ttlpred + y\"] j Wj (Cij +WpartialPij )",
        "#frames in MT",
        "Wpred + y] .",
        "Wj (Cij +WpartialPi,j )",
        "where Wj is the weight for the arguments of type j.",
        "These weights represent the degree of contribution of different types of arguments to the overall meaning of their semantic frame.",
        "Figure 3 depicts the flat role representation used in the more accurate variants of MEANT as proposed in Lo and Wu (2011b).",
        "This representation is motivated by the studies of the impact of individual semantic role.",
        "The highly significant difference between this flat representation and both of the previous two structured role representations is that the semantic frames in the sentence are no longer segregated.",
        "The flat role representation desegregates the frame structure, resulting in a flat, single level structure.",
        "Therefore, there is no frame precision/recall.",
        "The sentence precision/recall is the weighted sum of the number of correctly translated roles in all frames normalized by the weighted sum of the total number of roles in all frames in the MT/REF respectively.",
        "More precisely, again assuming the previous definitions of Ci}j, Pi}j, Mitj, Ritj and wpartial, the sentence precision and recall are redefined as follows.",
        "Cpred = total # correctly translated predicates Mpred = total # predicates in MT Rpred = total # predicates in REF",
        "«VdCpred + j Wji^^Cij + Wpartial))",
        "WpredCpred + i Wj (^2i(C'i:j + WpartialPi,j))",
        "WpredÄpred + j W (Ei Ri,j)",
        "Note that there is a small modification of the definition of wpred and Wj.",
        "Instead of the degree of contribution to the overall meaning of the semantic frame that the roles attached to, wpredand Wj now represent the degree of contribution of the predicate and the arguments of type j to the overall meaning of the entire sentence.",
        "It is worth noting that the semantic role features in the ULC metric proposed by Gimenez and Marquez (2008) also employ a flat feature-based representation of semantic roles.",
        "However, the definition of those semantic role features adopts a different methodology for determining the role fillers' translation accuracy, which prevents a controlled consistent environment for the comparative experiments that the present work focuses on."
      ]
    },
    {
      "heading": "3. Experimental setup",
      "text": [
        "The evaluation data for our experiments consists of 40 sentences randomly drawn from the DARPA GALE program Phase 2.5 newswire evaluation corpus containing Chinese input sentence, English reference translations, and the machine translation from three different state-of-the-art GALE systems.",
        "The Chinese and the English reference translation have both been annotated with gold standard PropBank (Palmer et al., 2005) semantic role labels.",
        "The weights Wpred, Wcore, Wadj, Wj and Wpartial can be estimated by optimizing correlation against human adequacy judgments, using any of the many standard optimization search techniques.",
        "In the work of Lo and",
        "Figure 3: The flat role representation for the MEANT family of metrics as proposed in Lo and Wu (2011b).",
        "Wu (2011b), the correlations of all individual roles with the human adequacy judgments were found to be non-negative, therefore we found grid search to be quite adequate for estimating the weights.",
        "We use linear weighting because we would like to keep the metric's interpretation simple and intuitive.",
        "Following the benchmark assessment in NIST MetricsMaTr2010 (Callison-Burch etal., 2010), we assess the performance of the semantic MT evaluation metric at the sentence level using the summed-diagonal-of-confusion-matrix score.",
        "The human adequacy judgments were obtained by showing all three MT outputs together with the Chinese source input to a human reader.",
        "The human reader was instructed to order the sentences from the three MT systems according to the accuracy of meaning in the translations.",
        "For the MT output, we ranked the sentences from the three MT systems according to their evaluation metric scores.",
        "By comparing the two sets of rankings, a confusion matrix is formed.",
        "The summeddiagonal ofconfusionmatrix is the percentage of the total count when a particular rank by the metric's score exactly matches the human judgments.",
        "The range of possible values of summed diagonal of confusion matrix is [0,1], where 1 means all the systems' ranks determined by the metric are identical with that of the human judgments and 0 means all the systems' ranks determined by the metric are different from that of the human judgment.",
        "Since the summed diagonal of confusion matrix scores only assess the absolute ranking accuracy, we also report the Kendall's t rank correlation coefficients, which measure the correlation of the proposed metric against human judgments with respect to their relative ranking of translation adequacy.",
        "A higher the value for t indicates the more similar the ranking by the evaluation metric to the human judgment.",
        "The range of possible values of correlation",
        "Table 1: Sentence-level correlations against human adequacy judgments as measured by Kendall's t and summed diagonal of confusion matrix as used in MetricsMaTr 2010.",
        "\"SRL - blueprint\" is the blueprint model described in section 2.1.",
        "\"HMEANT (structured)\" is HMEANT using the structured role representation described in section 2.2.",
        "\"HMEANT (flat)\" is HMEANT using the flat",
        "role representation described in section 2.3.",
        "Metric | Kendall | MetricsMaTr coefficient is [-1,1], where 1 means the systems are ranked in the same order as the human judgment and 1 means the systems are ranked in the reverse order as the human judgment."
      ]
    },
    {
      "heading": "4. Round 1: Flat beats structured",
      "text": [
        "Our first round of comparative results quantita-tivelyassess whetherastructuredrole representation (that properly preserves the semantic frame structure, which is typically hierarchically nested in compositional fashion) outperforms the simpler (but less intuitive, and certainly less linguistically satisfying) flat role representation.",
        "As shown in table 1, disturbingly, HMEANT using flat role representations yields higher correlations against human adequacy judgments than using structured role representations, regardless of whether role types are aggregated into core and adjunct classes.",
        "The results are consistent for both Kendall's tau correlation coefficient and Met-ricsMaTr's summed diagonal of confusion matrix.",
        "HMEANT using a flat role representation achieved a Kendall's tau correlation coefficient and summed diagonal of confusion matrix score of 0.4685 and 0.5583 respectively, which is superior to both",
        "Figure 4: The new proposed structured role representation, incorporating a weighting scheme reflecting the degree of contribution of each semantic frame to the overall sentence.",
        "HMEANT using a structured role representation (0.4324 and 0.5083 respectively) and the blueprint model (0.3784 and 0.4667 respectively).",
        "Error analysis, in light of these surprising results, strongly suggests that the problem lies in the design which uniformly averages the frame precision/recall over all frames in a sentence when computing the sentence precision/recall.",
        "This essentially assumes that each frame in a sentence contributes equally to the overall meaning in the sentence translation.",
        "Such an assumption is trivially wrong and could well hugely degrade the advantages of using a structured role representation for semantic MT evaluation.",
        "This suggests that the structured role representation could be improved by also capturing the degree of contribution of each frame to the overall sentence translation."
      ]
    },
    {
      "heading": "5. Capturing the importance of each frame",
      "text": [
        "To address the problem in the previous models, we introduce a weighting scheme to reflect the degree of contribution of each semantic frame to the overall sentence.",
        "However, unlike the contribution of each role to a frame, the contribution of each frame to the overall sentence cannot be estimated across sentences.",
        "This is because unlike semantic roles, which can be identified by their types, frames do not necessarily have easily defined types, and their construction is also different from sentence to sentence so that the positions of their predicates in the sentence are the only way to identify the frames.",
        "However, the degree of contribution of each frame does not depend on the position of the predicate in the sentence.",
        "For example, the two sentences I met Tom when I was going home and When I was walking home, I saw Tom have similar meanings.",
        "The verbs met and saw are the predicates of the key event frames which contribute more to the overall sentences, whereas going and walking are the predicates of the minor nested event frames (in locative manner roles of the key event frames) and contribute less to the overall sentences.",
        "However, the two sentences are realized with different surface constructions, and the two key frames are in different positions.",
        "Therefore, the weights learned from one sentence cannot directly be applied to the other sentence.",
        "Instead of estimating the weight of each frame using optimization techniques, we make an assumption that a semantic frame filled with more word tokens expresses more concepts and thus contributes more to the overall sentence.",
        "Following this assumption, we determine the weights of each semantic frame by its span coverage in the sentence.",
        "In other words, the weight of each frame is the percentage of word tokens it covers in the sentence.",
        "Figure 4 depicts the structured role representation with the proposed new frame weighting scheme.",
        "The significant difference between this representation and the structured role representation in the MEANT variants proposed in Lo and Wu (2011a) is that each frame is now assigned an independent weight, which is its span coverage in the MT/REF when obtaining the frame precision/recall respectively.",
        "As in Lo and Wu (2011a), each sentence consists of a number of frames, and each frame consists of a predicate and a number of arguments of type j.",
        "Each type of argument is assigned an independent weight to represent its degree of contribution to the overall meaning of the semantic frame they attached to.",
        "The frame precision/recall is the weighted sum of the number of correctly translated roles in a frame normalized by the weighted sum of the number of all roles in that frame in the MT/REF.",
        "The sentence precision/recall is the weighted sum of the frame precision/recall for all frames normalized by the weighted sum of the total number of frames in MT/REF respectively.",
        "More precisely, again assuming the earprecision lier definitions of Ci j, Pi j, Mi j, Ri j, wpred and Wpartiai in section 2, the sentence precision and recall are redefined as follows.",
        "# tokens filled in frame i of MT total # tokens in MT # tokens filled in frame i of REF total # tokens in REF",
        "-J2i Wj Mi-j -J2i Wj Ri.j",
        "where mi and ri are the weights for frame i, in the MT/REF respectively.",
        "These weights estimate the degree of contribution of each frame to the overall meaning of the sentence."
      ]
    },
    {
      "heading": "6. Round 2: Structured beats flat",
      "text": [
        "We now assess the performance of the new proposed structured role representation, by comparing it with the previous models under the same experimental setup as in section 4.",
        "We have also run contrastive experiments against BLEU and HTER under the same experimental conditions.",
        "In addition, to investigate the consistency of results for the automated variants of MEANT, we also include comparative experiments where shallow semantic parsing (ASSERT) replaces human semantic role labelers for each model of role representation.",
        "Figure 5 shows an example where HMEANT with the frame weighting scheme outperforms HMEANT using other role representations in correlation against human adequacy judgments.",
        "IN is the Chinese source input.",
        "REF is the corresponding reference translation.",
        "MT1, MT2 and MT3 are the three corresponding MT output.",
        "The human adequacy judgments for this set of translation are that MT1>MT3>MT2.",
        "HMEANT with the proposed frame weighting predicts the same ranking order as the human adequacy judgment, while HMEANT with the flat role representation and HMEANT with the structured role representation without frame weighting both predict MT3>MT1>MT2.",
        "There are four semantic frames in IN while there are only three semantic frames in the REF.",
        "This is because the predicate j|rfi£ in IN is translated in REF as had which is not a predicate.",
        "However, for the same frame, both MT1 and MT2 translated ARG1 7fffl% H|n] into the predicate affect, while MT3 did not translate the predicate jêfi£ and translated the ARG1 ^ SJf^Hln] into the noun phrase adverse impact.",
        "Therefore, using the flat role representation or the previous structured role representation which assume all frames have an identical degree of contribution to the overall sentence translation, MT1's and MT2's sentence precision is greatly penalized for having one more extra frame than the reference.",
        "In contrast, applying the frame weighting scheme, the degree of contribution of each frame is adjusted by its token coverage.",
        "Therefore, the negative effect of the less important extra frames is minimized, allowing the positive effect of correctly translating more roles in more important frames to be more appropriately reflected.",
        "Table 2 shows that HMEANT with the proposed new frame weighting scheme correlates more closely with human adequacy judgments than HMEANT using the previous alternative role representations.",
        "The results from Kendall's tau correlation coefficient and MetricsMaTr's summed diagonal of confusion matrix analysis are consistent.",
        "HMEANT using the frame-weighted structured role representation achieved a Kendall's tau correlation coefficient and summed diagonal of confusion matrix score of 0.2865 and 0.575 respectively, bettering both HMEANT using the flat role representation (0.4685 and 0.5583) and HMEANT using the previous un-frame-weighted structured role representation (0.4324 and 0.5083).",
        "HMEANT using the improved structured role representation also outperforms other commonly used MT evaluation metrics.",
        "It correlates with human adequacy judgments more closely than HTER (0.4324 and 0.425 in Kendall's tau correlation coefficient and summed diagonal of confusion matrix, respectively).",
        "It also correlates with human adequacy judgments significantly more closely than BLEU (0.1982 and 0.425).",
        "Turning to the variants that replace human SRL with automated SRL, table 2 shows that MEANT",
        "Figure 5: Example input sentence along with reference and machine translations, annotated with semantic frames in Propbank format.",
        "The MT output is annotated with semantic frames by minimally trained humans.",
        "HMEANT with the new frame-weighted structured role representation successfully ranks the MT output in an order that matches with human adequacy judgments (MT1>MT3>MT2), whereas HMEANT with a flat role representation or the previous un-frame-weighted structured role representation fails to rank MT1 and MT3 in an order that matches with human adequacy judgments.",
        "See section 6 for details.",
        "Table 2: Sentence-level correlations against human adequacy judgments as measured by Kendall's t and summed diagonal of confusion matrix as used in MetricsMaTr 2010.",
        "\"SRL - blueprint\", \"HMEANT (structured)\" and \"HMEANT (flat)\" are the same as in table 1.",
        "\"MEANT (structured)\" and \"MEANT (flat)\" use automatic rather than human SRL.",
        "\"MEANT (frame)\" and \"HMEANT (frame)\" are MEANT/HMEANT using the structured role representation with the frame weighting scheme described in section 5.___ using the new frame-weighted structured role representation yields an approximation that is about 81% as closely correlated with human adequacyjudgment as HTER, and is better than all previous MEANT variants using alternative role representations.",
        "All results consistently confirm that using a structured role representation with the new frame weighting scheme, which captures the event structure and an approximate degree of contribution of each frame to the overall sentence, outperforms using a flat role representation for SRL based MT evaluation metrics."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "We have shown how the MEANT family of SRL based MT evaluation metrics is significantly improved beyond the state-of-the-art for both HTER and previous variants of MEANT, through the introduction of a simple but well-motivated weighting scheme to reflect the degree of contribution of each semantic frame to the overall sentence translation.",
        "Following the assumption that a semantic frame filled with more word tokens tends to express more concepts, the new model weight each frame by its span coverage.",
        "Consistent experimental results have been demonstrated under conditions utilizing both human and automatic SRL.",
        "Under the new frame weighted representation, properly nested structured semantic frame representations regain an empirically preferred position over the less intuitive and linguistically unsatisfying flat role representations.",
        "One future direction of this work will be to compare MEANT against the feature based and string based representations of semantic relations in ULC.",
        "Such a comparison could yield a more complete credit/blame perspective on the representation model when operating under the condition of using automatic SRL.",
        "Another interesting extension of this work would be to investigate the discriminative power of the MEANT family of metrics to distinguish distances in translation adequacy.",
        "In this paper we confirmed that the MEANT family of metrics are stable in correlation with human ranking judgments of translation adequacy.",
        "Further studies could focus on the correlation of the MEANT family of metrics against human scoring.",
        "We also plan to experiment on meta-evaluating MEANT on a larger scale in other genres and for other language pairs."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This material is based upon work supported in part by the Defense Advanced Research Projects Agency (DARPA) under GALE Contract Nos.",
        "HR0011-06-C-0022 and HR0011-06-C-0023 and by the Hong Kong Research Grants Council (RGC) research grants GRF621008, GRF612806, DAG03/04.EG09, findings and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the Defense Advanced Research Projects Agency.",
        "Metric",
        "Kendall",
        "MetricsMaTr",
        "HMEANT (frame)",
        "0.4865",
        "0.575",
        "HMEANT (flat)",
        "0.4685",
        "0.5583",
        "HMEANT (structured)",
        "0.4324",
        "0.5083",
        "HTER",
        "0.4324",
        "0.425",
        "SRL - blueprint",
        "0.3784",
        "0.4667",
        "MEANT (frame)",
        "0.3514",
        "0.4333",
        "MEANT (structured)",
        "0.3423",
        "0.425",
        "MEANT (flat)",
        "0.3333",
        "0.425",
        "BLEU",
        "0.1982",
        "0.425"
      ]
    }
  ]
}
