{
  "info": {
    "authors": [
      "Vivek Srikumar",
      "Dan Roth"
    ],
    "book": "EMNLP",
    "id": "acl-D11-1012",
    "title": "A Joint Model for Extended Semantic Role Labeling",
    "url": "https://aclweb.org/anthology/D11-1012",
    "year": 2011
  },
  "references": [
    "acl-D09-1047",
    "acl-D10-1001",
    "acl-J05-1004",
    "acl-J08-2002",
    "acl-J08-2005",
    "acl-J09-2002",
    "acl-N09-1018",
    "acl-N09-1037",
    "acl-N09-3017",
    "acl-N10-1115",
    "acl-P05-1022",
    "acl-P07-1072",
    "acl-P08-1068",
    "acl-P09-1039",
    "acl-W02-1001",
    "acl-W04-2401",
    "acl-W04-2412",
    "acl-W04-2705",
    "acl-W04-3212",
    "acl-W04-3220",
    "acl-W05-0620",
    "acl-W06-1616",
    "acl-W06-2106",
    "acl-W07-2005",
    "acl-W07-2051",
    "acl-W08-2122",
    "acl-W09-1119"
  ],
  "sections": [
    {
      "text": [
        "Vivek Srikumar and Dan Roth",
        "This paper presents a model that extends semantic role labeling.",
        "Existing approaches independently analyze relations expressed by verb predicates or those expressed as nominal-izations.",
        "However, sentences express relations via other linguistic phenomena as well.",
        "Furthermore, these phenomena interact with each other, thus restricting the structures they articulate.",
        "In this paper, we use this intuition to define a joint inference model that captures the interdependencies between verb semantic role labeling and relations expressed using prepositions.",
        "The scarcity of jointly labeled data presents a crucial technical challenge for learning a joint model.",
        "The key strength of our model is that we use existing structure predictors as black boxes.",
        "By enforcing consistency constraints between their predictions, we show improvements in the performance of both tasks without retraining the individual models."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The identification of semantic relations between sentence constituents has been an important task in NLP research.",
        "It finds applications in various natural language understanding tasks that require complex inference going beyond the surface representation.",
        "In the literature, semantic role extraction has been studied mostly in the context of verb predicates, using the Propbank annotation of Palmer et al.",
        "(2005), and also for nominal predicates, using the Nombank corpus of Meyers et al.",
        "(2004).",
        "However, sentences express semantic relations through other linguistic phenomena.",
        "For example, consider the following sentence:",
        "(1) The field goal by Brien changed the game in the fourth quarter.",
        "Verb centered semantic role labeling would identify the arguments of the predicate change as (a) The field goal by Brien (A0, the causer of the change), (b) the game (A1, the thing changing), and (c) in the fourth quarter (temporal modifier).",
        "However, this does not tell us that the scorer of the field goal was Brien, which is expressed by the preposition by.",
        "Also, note that the in indicates a temporal relation, which overlaps with the verb's analysis.",
        "In this paper, we propose an extension of the standard semantic role labeling task to include relations expressed by lexical items other than verbs and nom-inalizations.",
        "Further, we argue that there are interactions between the different phenomena which suggest that there is a benefit in studying them together.",
        "However, one key challenge is that large jointly labeled corpora do not exist.",
        "This motivates the need for novel learning and inference schemes that address the data problem and can still benefit from the interactions among the phenomena.",
        "This paper has two main contributions.",
        "1.",
        "From the machine learning standpoint, we propose a joint inference scheme to combine existing structure predictors for multiple linguistic phenomena.",
        "We do so using hard constraints that involve only the labels of the phenomena.",
        "The strength of our model is that it is easily extensible, since adding new phenomena does not require fully retraining the joint model from scratch.",
        "Furthermore, our approach minimizes the need for extensive jointly labeled corpora and, instead, uses existing predictors as black boxes.",
        "2.",
        "From an NLP perspective, we motivate the extension of semantic role labeling beyond verbs and nominalizations.",
        "We instantiate our joint model for the case of extracting preposition and verb relations together.",
        "Our model uses existing systems that identify verb semantic roles and preposition object roles and jointly predicts the output of the two systems in the presence of linguistic constraints that enforce coherence between the predictions.",
        "We show that using constraints to combine models improves the performance on both tasks.",
        "Furthermore, since the constraints depend only on the labels of the two tasks and not on any specific dataset, our experiments also demonstrate that enforcing them allows for better domain adaptation.",
        "The rest of the paper is organized as follows: We motivate the need for extending semantic role labeling and the necessity for joint inference in Section 2.",
        "In Section 3, we describe the component verb SRL and preposition role systems.",
        "The global model is defined in Section 4.",
        "Section 5 provides details on the coherence constraints we use and demonstrates the effectiveness of the joint model through experiments.",
        "Section 6 discusses our approach in comparison to existing work and Section 7 provides concluding remarks."
      ]
    },
    {
      "heading": "2. Problem Definition and Motivation",
      "text": [
        "Semantic Role Labeling has been extensively studied in the context of verbs and nominalizations.",
        "While this analysis is crucial to understanding a sentence, it is clear that in many natural language sentences, information is conveyed via other lexical items.",
        "Consider, for example, the following sentences:",
        "(2) Einstein's theory of relativity changed physics.",
        "(3) The plays of Shakespeare are widely read.",
        "(4) The bus, which was heading for Nairobi in Kenya, crashed in the Kabale district of Uganda.",
        "The examples contain information that cannot be captured by analyzing the verbs and the nominaliza-tions.",
        "In sentence (2), the possessive form tells us that the theory of relativity was discovered by Einstein.",
        "Furthermore, the theory is on the subject of relativity.",
        "The usage of the preposition ofis different in sentence (3), where it indicates a creator-creation relationship.",
        "In the last sentence, the same preposition tells us that the Kabale district is located in Uganda.",
        "Prepositions, compound nouns, possessives, adjectival forms and punctuation marks often express relations, the identification of which is crucial for text understanding tasks like recognizing textual entailment, paraphrasing and question answering.",
        "The relations expressed by different linguistic phenomena often overlap.",
        "For example, consider the following sentence:",
        "(5) Construction of the library began in 1968.",
        "The relation expressed by the nominalization construction recognizes the library as the argument of the predicate construct.",
        "However, the same analysis can also be obtained by identifying the sense of the preposition of, which tells us that the subject of the preposition is a nominalization of the underlying verb.",
        "A similar redundancy can be observed with analyses of the verb began and the preposition in.",
        "The above example motivates the following key intuition: The correct interpretation of a sentence is the one that gives a consistent analysis across all the linguistic phenomena expressed in it.",
        "An inference mechanism that simultaneously predicts the structure for different phenomena should account for consistency between the phenomena.",
        "A model designed to address this has the following desiderata:",
        "1.",
        "It should account for the dependencies between phenomena.",
        "2.",
        "It should be extensible to allow easy addition of new linguistic phenomena.",
        "3.",
        "It should be able to leverage existing state-of-the-art models with minimal use of jointly labeled data, which is expensive to obtain.",
        "Systems that are trained on each task independently do not account for the interplay between them.",
        "One approach for tackling this is to define pipelines, where the predictions for one of the tasks acts as the input for another.",
        "However, a pipeline does not capture the two-way dependency between the tasks.",
        "Training a fully joint model from scratch is also unrealistic because it requires text that is annotated with all the tasks, thus making joint training implausible from a learning theoretic perspective (See Punyakanok et al.",
        "(2005) for a discussion about the learning theoretic requirements of joint training.)"
      ]
    },
    {
      "heading": "3. Tasks and Individual Systems",
      "text": [
        "Before defining our proposed model that captures the requirements listed in the previous section, we introduce the tasks we consider and their independently trained systems that we improve using the joint system.",
        "Though the model proposed here is general and can be extended to several linguistic phenomena, in this paper, we focus on relations expressed by verbs and prepositions.",
        "This section describes the tasks, the data sets we used for our experiments and the current state-of-the-art systems for these tasks.",
        "We use the following sentence as our running example to illustrate the phenomena: The company calculated the price trends on the major stock markets on Monday.",
        "Prepositions indicate a relation between the attachment point of the preposition and its object.",
        "As we have seen, the same preposition can indicate different types of relations.",
        "In the literature, the polysemy of prepositions is addressed by The Preposition Project of Litkowski and Hargraves (2005), which is a large lexical resource for English that labels prepositions with their sense.",
        "This sense inventory formed the basis of the SemEval-2007 task of preposition word sense disambiguation of Litkowski and Hargraves (2007).",
        "In our example, the first on would be labeled with the sense 8(3) which identifies the object of the preposition as the topic, while the second instance would be labeled as 17(8), which indicates that argument is the day of the occurrence.",
        "The preposition sense inventory, while useful to identify the fine grained distinctions between preposition usage, defines a unique sense label for each preposition by indexing the definitions of the prepositions in the Oxford Dictionary of English.",
        "For example, in the phrase at noon, the at would be labeled with the sense 2(2), while the preposition in I will see you in an hour will be labeled 4(3).",
        "Note that both these (and also the second on in our running example) indicate a temporal relation, but are assigned different labels based on the preposition.",
        "To counter this problem we collapsed preposition senses that are semantically similar to define a new label space, which we refer to as Preposition Roles.",
        "We retrained classifiers for preposition sense for the new label space.",
        "Before describing the preposition role dataset, we briefly describe the datasets and the features for the sense problem.",
        "The best performing system at the SemEval-2007 shared task of preposition sense disambiguation (Ye and Baldwin (2007)) achieves a mean precision of 69.3% for predicting the fine grained senses.",
        "Tratz and Hovy (2009) and Hovy et al.",
        "(2010) attained significant improvements in performance using features derived from the preposition's neighbors in the parse tree.",
        "We extended the feature set defined in the former for our independent system.",
        "Table 1 summarizes the rules for identifying the syntactically related words for each preposition.",
        "We used dependencies from the easy-first dependency parser of Goldberg and Elhadad (2010).",
        "For each word extracted from these rules, the features include the word itself, its lemma, the POS tag, synonyms and hypernyms of the first WordNet sense and an indicator for capitalization.",
        "These features improved the accuracy of sense identification to 75.1% on the SemEval test set.",
        "In addition, we also added the following new features for eachword:",
        "1.",
        "Indicators for gerunds and nominalizations of verbs.",
        "2.",
        "The named entity tag (Person, Location or Organization) associated with a word, if any.",
        "We Id.",
        "1.",
        "2.",
        "3.",
        "4.",
        "5.",
        "Head noun/verb that dominates the preposition along with its modifiers Head noun/verb that is dominated by the preposition along with its modifiers Subject, negator and object(s) of the immediately dominating verb Heads of sibling prepositions Words withing a window of 5 centered at the preposition",
        "Table 1: Features for preposition relation from Tratz and Hovy (2009).",
        "These rules were used to identify syntactically related words for each preposition.",
        "used the state-of-the-art named entity tagger of Ratinov and Roth (2009) to label the text.",
        "3.",
        "Gazetteer features, which are active if a word is a part of a phrase that belongs to a gazetteer list.",
        "We used the gazetteer lists which were used by the NER system.",
        "We also used the CBC word clusters of Pantel and Lin (2002) as additional gazetteers and Brown cluster features as used by Ratinov and Roth (2009) and Koo et al.",
        "(2008).",
        "Dahlmeier et al.",
        "(2009) annotated senses for the prepositions at, for, in, of, on, to and with in the sections 2-4 and 23 of the Wall Street Journal portion of the Penn Treebank.",
        "We trained sense classifiers on both datasets using the Averaged Perceptron algorithm with the one-vs-all scheme using the Learning Based Java framework of Rizzolo and Roth (2010).",
        "Table 2 reports the performance of our sense disambiguation systems for the Treebank prepositions.",
        "As mentioned earlier, we collapsed the sense labels onto the newly defined preposition role labels.",
        "Table 3 shows this label set along with frequencies of the labels in the Treebank dataset.",
        "According to this labeling scheme, the first on in our running example will be labeled TOPIC and the second one will",
        "Table 2: Preposition sense performance.",
        "This table reports accuracy of sense prediction on the prepositions that have been annotated for the Penn Treebank dataset.",
        "be labeled Temporal.",
        "We retrained the sense disambiguation system to predict preposition roles.",
        "When trained on the Treebank data, our system attains an accuracy of 67.82% on Section 23 of the Treebank.",
        "We use this system as our independent baseline for preposition role identification.",
        "The goal of verb Semantic Role Labeling (SRL) is to identify the predicate-argument structure defined by verbs in sentences.",
        "The CoNLL Shared Tasks of 2004 and 2005 (See Carreras and Marquez (2004) , Carreras and Marquez (2005)) studied the identification of the predicate-argument structure of verbs using the PropBank corpus of Palmer et al.",
        "(2005) .",
        "Punyakanok et al.",
        "(2008) and Toutanova et al.",
        "(2008) used global inference to ensure that the predictions across all arguments of the same predicate are coherent.",
        "We reimplemented the system of Punyakanok et al.",
        "(2008), which we briefly describe here, to serve as our baseline verb semantic role labeler .",
        "We refer the reader to the original paper for further details.",
        "Train",
        "Test set",
        "Treebank Sec. 23",
        "SemEval",
        "Penn Treebank SemEval",
        "61.41 47.00",
        "38.22 78.25",
        "Role",
        "Train",
        "Test",
        "Activity",
        "57",
        "23",
        "Attribute",
        "119",
        "51",
        "beneficiary",
        "78",
        "17",
        "Cause",
        "255",
        "116",
        "Concomitant",
        "156",
        "74",
        "EndCondition",
        "88",
        "66",
        "Experiencer",
        "88",
        "42",
        "Instrument",
        "37",
        "19",
        "Location",
        "1141",
        "414",
        "MediumOfCommunication",
        "39",
        "30",
        "Numeric/Level",
        "301",
        "174",
        "ObjectOfVerb",
        "365",
        "112",
        "Other",
        "65",
        "49",
        "PartWhole",
        "485",
        "133",
        "Participant/ Accompanier",
        "122",
        "58",
        "PhysicalSupport",
        "32",
        "18",
        "Possessor",
        "195",
        "56",
        "ProfessionalAspect",
        "24",
        "10",
        "Recipient",
        "150",
        "70",
        "Species",
        "240",
        "58",
        "Temporal",
        "582",
        "270",
        "Topic",
        "148",
        "54",
        "The verb SRL system of Punyakanok et al.",
        "(2008) consists of four stages - candidate generation, argument identification, argument classification and inference.",
        "The candidate generation stage involves using the heuristic of Xue and Palmer (2004) to generate an over-complete set of argument candidates for each predicate.",
        "The identification stage uses a classifier to prune the candidates.",
        "In the argument classification step, the candidates that remain after the identification step are assigned scores for the SRL arguments using a multiclass classifier.",
        "One of the labels of the classifier is 0, which indicates that the candidate is, in fact, not an argument.",
        "The inference step produces a combined prediction for all argument candidates of a verb proposition by enforcing global constraints.",
        "The inference enforces the following structural and linguistic constraints: (1) Each candidate can have at most one label.",
        "(2) No duplicate core arguments.",
        "(3) No overlapping or embedding arguments.",
        "(4) Given the predicate, some argument classes are illegal.",
        "(5) If a candidate is labeled as an R-arg, then there should be one labeled as arg.",
        "(6) If a candidate is labeled as a C-arg, there should be one labeled arg that occurs before the C-arg.",
        "Instead of using the identifier to filter candidates for the classifier, in our SRL system, we added the identifier to the global inference and enforced consistency constraints between the identifier and the argument classifier predictions - the identifier should predict that a candidate is an argument if, and only if, the argument classifier does not predict the label 0.",
        "This change is in keeping with the idea of using joint inference to combine independently learned systems, in this case, the argument identifier and the role classifier.",
        "Furthermore, we do not need to explicitly tune the identifier for high recall.",
        "We phrase the inference task as an integer linear program (ILP) following the approach developed in Roth and Yih (2004).",
        "Integer linear programs were used by Roth and Yih (2005) to add general constraints for inference with conditional random fields.",
        "ILPs have since been used successfully in many NLP applications involving complex structures - Punyakanok et al.",
        "(2008) for semantic role labeling, Riedel and Clarke (2006) and Martins et al.",
        "(2009) for dependency parsing and several others.",
        "Let vfa be the Boolean indicator variable that denotes that the ith argument candidate for a predicate is assigned a label a and let 0Ca represent the score assigned by the argument classifier for this decision.",
        "Similarly, let v denote the identifier decision for the ith argument candidate of the predicate and 0 denote its identifier score.",
        "Then, the objective of inference is to maximize the total score of the assignment",
        "Here, vC and v denote all the argument classifier and identifier variables respectively.",
        "This maximization is subject to the constraints described above, which can be transformed to linear (in)equalities.",
        "We denote these constraints as CSRL.",
        "In addition to CSRL which were defined by Punyakanok et al.",
        "(2008), we also have the constraints linking the predictions of the identifier and classifier:",
        "Inference in our baseline SRL system is, thus, the maximization of the objective defined in (1) subject to constraints CSRL, the identifier-classifier constraints defined in (2) and the restriction of the variables to take values in {0,1}.",
        "To train the classifiers, we used parse trees from the Charniak and Johnson (2005) parser with the same feature representation as in the original system.",
        "We trained the classifiers on the standard Propbank training set using the one-vs-all extension of the average Perceptron algorithm.",
        "As with the preposition roles, we implemented our system using Learning Based Java of Rizzolo and Roth (2010).",
        "We normalized all classifier scores using the soft-max function.",
        "Compared to the 76.29% F1 score reported by Punyakanok et al.",
        "(2008) using single parse tree predictions from the parser, our system obtained 76.22% F1 score on section 23 of the Penn Treebank."
      ]
    },
    {
      "heading": "4. A Joint Model for Verbs and Prepositions",
      "text": [
        "We now introduce our model that captures the needs identified in Section 2.",
        "The approach we develop in this paper follows the one proposed by Roth and Yih (2004) of training individual models and combining them at inference time.",
        "Our joint model is a Constrained Conditional Model (See Chang et al.",
        "(2011)), which allows us to build upon existing learned models using declarative constraints.",
        "We represent our component inference problems as integer linear program instances.",
        "As we saw in Section 3.2, the inference for SRL is instantiated as an ILP problem.",
        "The problem of predicting preposition roles can be easily transformed into an ILP instance.",
        "Let vRr denote the decision variable that encodes the prediction that the preposition p is assigned a role r and let 6Rr denote its score.",
        "Let vR denote all the role variables for a sentence.",
        "Then role prediction is equivalent to the following maximization problem:",
        "In general, let p denote a linguistic structure prediction task of interest and let P denote all such tasks.",
        "Let Zp denote the set of labels that the parts of the structure associated with phenomenon p can take.",
        "For example, for the SRL argument classification component, the parts of the structure are all the candidates that need to be labeled for a given sentence and the set Zp is the set of all argument labels.",
        "For each phenomenon p G P, we use vp to denote its set of inference variables for a given sentence.",
        "Each inference variable vpZ y G vp corresponds to the prediction that the part y has the label Z in the final structure.",
        "Each variable is associated with a score @PZ that is obtained from a learned score predictor.",
        "Let Cp denote the structural constraints that are \"local\" to the phenomenon.",
        "Thus, for verb SRL, these would be the constraints defined in the previous section, and for preposition role, the only local constraint would be the constraint (4) defined above.",
        "The independent inference problem for the phenomenon p is the following integer program:",
        "As a technical point, this defines one inference problem per sentence, rather than per predicate as in the verb SRL system of Punyakanok et al.",
        "(2008).",
        "This simple extension enabled Surdeanu et al.",
        "(2007) to study the impact ofincorporating cross-predicate constraints for verb SRL.",
        "In this work, this extension allows us to incorporate cross-phenomena inference.",
        "We consider the problem of jointly predicting several phenomena incorporating linguistic knowledge that enforce consistency between the output labels.",
        "Suppose pi and p2 are two phenomena.",
        "If zpi is a label associated with the former and zp2, zp2, • • • are labels associated with the latter, we consider constraints of the form",
        "We expand this language of constraints by allowing the specification of preconditions for a constraint to apply.",
        "This allows us to enforce constraints of the form \"If an argument that starts with the preposition 'at' is labeled AM-TMP, then the preposition can be labeled either Numeric/Level or Temporal.\"",
        "This constraint is universally quantified for all arguments that satisfy the precondition of starting with the preposition at.",
        "Given a first-order constraint in this form and an input sentence, suppose the inference variable vipi is a grounding of zpi and vp2, vp2, • • • are groundings of the right hand labels such that the preconditions are satisfied, then the constraint can be phrased as the following linear inequality.",
        "In the context of the preposition role and verb SRL, we consider constraints between labels for a preposition and SRL argument candidates that begin with that preposition.",
        "This restriction forms the precondition for all the joint constraints considered in this paper.",
        "Since the joint constraints involve only the labels, they can be derived either manually from the definition of the tasks or using statistical relation learning techniques.",
        "In addition to mining constraints of the form (9), we also use manually specified joint constraints.",
        "The constraints used in our experiments are described further in Section 5.",
        "In general, let J denote a set of pairwise joint constraints.",
        "The joint inference problem can be phrased as that of maximizing the score of the assignment subject to the structural constraints of each phenomenon (Cp) and the joint linguistic constraints (J).",
        "However, since, the individual tasks were not trained on the same datasets, the scoring functions need not be in the same numeric scale.",
        "In our model, each label Z for a phenomenon p is associated with a scoring function OpP for a part y.",
        "To scale the scoring functions, we associate each label with a parameter XPZ.",
        "This gives us the following integer linear program for joint inference:",
        "Here, v is the vector of inference variables which is obtained by stacking all the inference variables of each phenomena.",
        "For our experiments, we use a cutting plane solver to solve the integer linear program as in Riedel (2009).",
        "This allows us to solve the inference problem without explicitly having to instantiate all the joint constraints.",
        "Given the individual models and the constraints, we only need to learn the scaling parameters XPZ.",
        "Note that the number of scaling parameters is the total number of labels.",
        "When we jointly predict verb SRL and preposition role, we have 22 preposition roles (from table 3), one SRL identifier label and 54 SRL argument classifier labels.",
        "Thus we learn only 77 parameters for our joint model.",
        "This means that we only need a very small dataset that is jointly annotated with all the phenomena.",
        "We use the Structure Perceptron ofCollins (2002) to learn the scaling weights.",
        "Note that for learning the scaling weights, we need each label to be associated with a real-valued feature.",
        "Given an assignment of the inference variables v, the value of the feature corresponding to the label Z of task p is given by the sum of scores of all parts in the structure for p that have been assigned this label, i.e. £ vP y •OPP y.",
        "This feature is computed for the gold and the predicted structures and is used for updating the weights."
      ]
    },
    {
      "heading": "5. Experiments",
      "text": [
        "In this section, we describe our experimental setup and evaluate the performance of our approach.",
        "The research question addressed by the experiments is the following: Given independently trained systems for verb SRL and preposition roles, can their performance be improved using joint inference between the two tasks?",
        "To address this, we report the results of the following two experiments:",
        "1.",
        "First, we compare the joint system against the baseline systems and with pipelines in both directions.",
        "In this setting, both base systems are trained on the Penn Treebank data.",
        "2.",
        "Second, we show that using joint inference can provide strong a performance gain even when the underlying systems are trained on different domains.",
        "In all experiments, we report the F1 measure for the verb SRL performance using the CoNLL 2005 evaluation metric and the accuracy for the preposition role labeling task.",
        "For both the verb SRL and preposition roles, we used the first 500 sentences of section 2 of the Penn Treebank corpus to train our scaling parameters.",
        "For the first set of experiments, we trained our underlying systems on the rest of the available Penn Treebank training data for each task.",
        "For the adaptation experiment, we train the role classifier on the Se-mEval data (restricted to the same Treebank prepositions).",
        "In both cases, we report performance on section 23 of the Treebank.",
        "We mined consistency constraints from the sections 2, 3 and 4 of the Treebank data.",
        "As mentioned in Section 4.1, we considered joint constraints relating preposition roles to verb argument candidates that start with the preposition.",
        "We identified the following types of constraints: (1) For each preposition, the set of invalid verb arguments and preposition roles.",
        "(2) For each preposition role, the set of allowed verb argument labels if the role occurred more than ten times in the data, and (3) For each verb argument, the set of allowed preposition roles, similarly with a support of ten.",
        "Note that, while the constraints were obtained from jointly labeled data, the constraints could be written down because they encode linguistic intuition about the labels.",
        "The following is a constraint extracted from the data, which applies to the preposition with:",
        "srlarg(A2) – prep-role(Attribute) V prep-role(Cause) V prep-role(Instrument) V prep-role(ObjectOfVerb) V prep-role(PartWhole) V prep-role(Participant/Accompainer) V prep-role(Professional Aspect).",
        "This constraint says that if any candidate that starts with with is labeled as an A2, then the preposition can be labeled only with one of the roles on the right hand side.",
        "Some of the mined constraints have negated variables to enforce that a role or an argument label should not be allowed.",
        "These can be similarly converted to linear inequalities.",
        "See Rizzolo and Roth (2010) for a further discussion about converting logical expressions into linear constraints.",
        "In addition to these constraints that were mined from data, we also enforce the following handwritten constraints: (1) If the role of a verb attached preposition is labeled TEMPORAL, then there should be a verb predicate for which this prepositional phrase is labeled AM-TMP.",
        "(2) For verb attached prepositions, if the preposition is labeled with one of Activity, EndCondition, Instrument or ProfessionalAspect, there should be at least one predicate for which the corresponding prepositional phrase is not labeled 0.",
        "The conversion of the first constraint to a linear inequality is similar to the earlier cases.",
        "For each of the roles in the second constraint, let r denote a role variable that assigns the label to some preposition.",
        "Suppose there are n SRL candidates across all verb predicates begin with that preposition, and let si,s2, • • • ,sn denote the SRL variables that assign these candidates to the label 0.",
        "Then the second constraint corresponds to the following inequality:",
        "First, we compare our approach to the performance of the baseline independent systems and to pipelines in both directions in Table 4.",
        "For one pipeline, we added the prediction of the baseline preposition role system as an additional feature to both the identifier and the argument classifier for argument candidates that start with a preposition.",
        "Similarly, for the second pipeline, we added the SRL predictions as features for prepositions that were the first word of an SRL argument.",
        "In all cases, we performed fivefold cross validation to train the classifiers.",
        "The results show that both pipelines improve performance.",
        "This justifies the need for a joint system because the pipeline can improve only one of the tasks.",
        "The last line of the table shows that the joint inference system improves upon both the baselines.",
        "We achieve this improvement without retraining the underlying models, as done in the case of the pipelines.",
        "On analyzing the output of the systems, we found that the SRL precision improved by 2.75% but the",
        "Table 4: Performance of the joint system, compared to the individual systems and the pipelines.",
        "All performance measures are reported on Section 23 of the Penn Treebank.",
        "The verb SRL systems were trained on sections 2-21, while the preposition role classifiers were trained on sections 2-4.",
        "For the joint inference system, the scaling parameters were trained on the first 500 sentences of section 2, which were held out.",
        "All the improvements in this table are statistically significant at the 0.05 level.",
        "recall decreased by 0.98%, contributing to the overall F1 improvement.",
        "The decrease in recall is due to the joint hard constraints that prohibit certain assignments to the variables which would have otherwise been possible.",
        "Note that, for a given sentence, even if the joint constraints affect only a few argument candidates directly, they can alter the labels of the other candidates via the \"local\" SRL constraints.",
        "Consider the following example of the system output which highlights the effect of the constraints.",
        "(6) Weatherford said market conditions led to the cancellation of the planned exchange.",
        "The independent preposition role system incorrectly identifies the to as a Location.",
        "The semantic role labeling component identifies the phrase to the cancellation of the planned exchange as the A2 of the verb led.",
        "One of the constraints mined from the data prohibits the label Location for the preposition to if the argument it starts is labeled A2.",
        "This forces the system to change the preposition label to the correct one, namely EndCondition.",
        "Both the independent and the joint systems also label the preposition of as ObjectOfVerb, which indicates that the phrase the planned exchange is the object of the deverbal noun cancellation.",
        "Our second experiment compares the performance of the preposition role classifier that has been trained on the SemEval dataset with and without joint constraints.",
        "Note that Table 2 in Section 3, shows the drop in performance when applying the preposition sense classifier.",
        "We see that the SemEval-trained preposition role classifier (baseline in the table) achieves an accuracy of 53.29% when tested on the Treebank dataset.",
        "Using this classifier jointly with the verb SRL classifier via joint constraints gets an improvement of almost 3 percent in accuracy.",
        "Table 5: Performance of the SemEval-trained preposition role classifier, when tested on the Treebank dataset with and without joint inference with the verb SRL system.",
        "The improvement, in this case is statistically significant at the 0.01 level using the sign test.",
        "The primary reason for this improvement, even without retraining the classifier, is that the constraints are defined using only the labels of the systems.",
        "This avoids the standard adaptation problems of differing vocabularies and unseen features."
      ]
    },
    {
      "heading": "6. Discussion and Related work",
      "text": [
        "Roth and Yih (2004) formulated the problem of extracting entities and relations as an integer linear program, allowing them to use global structural constraints at inference time even though the component classifiers were trained independently.",
        "In this paper, we use this idea to combine classifiers that were trained for two different tasks on different datasets using constraints to encode linguistic knowledge.",
        "In the recent years, we have seen several joint models that combine two or more NLP tasks .",
        "Andrew et al.",
        "(2004) studied verb subcategorization and sense disambiguation of verbs by treating it as a problem of learning with partially labeled structures and proposed to use EM to train the joint model.",
        "Finkel and Manning (2009) modeled the task of named entity recognition together with parsing.",
        "Meza-Ruiz and Riedel (2009) modeled verb SRL, predicate identification and predicate sense recognition jointly using Markov Logic.",
        "Henderson et al.",
        "(2008) was designed for jointly learning to predict syntactic and semantic dependencies.",
        "Dahlmeier et al.",
        "(2009) addressed the problem of jointly learning verb SRLand preposition sense using the Penn Treebank annotation that was introduced in that work.",
        "The key difference between these and the model presented in this paper lies in the simplicity of our model and its easy extensibility because it leverages existing trained systems.",
        "Moreover, our model has the advantage that the complexity ofthe joint parameters is small, hence does not require a large jointly labeled dataset to train the scaling parameters.",
        "Setting",
        "SRL",
        "Preposition Role",
        "(F1)",
        "(Accuracy)",
        "Baseline SRL",
        "76.22",
        "-",
        "Baseline Prep.",
        "-",
        "67.82",
        "Prep.",
        " – SRL",
        "76.84",
        "-",
        "SRL – Prep.",
        "-",
        "68.55",
        "Joint inference",
        "77.07",
        "68.39",
        "Setting",
        "Preposition Role",
        "(Accuracy)",
        "Baseline",
        "53.29",
        "Joint inference",
        "56.22",
        "Our approach is conceptually similar to that of Rush et al.",
        "(2010), which combined separately trained models by enforcing agreement using global inference and solving its linear programming relaxation.",
        "They applied this idea to jointly predict dependency and phrase structure parse trees and on the task of predicting full parses together with part-of-speech tags.",
        "The main difference in our approach is that we treat the scaling problem as a separate learning problem in itself and train a joint model specifically for rescaling the output of the trained systems.",
        "The SRL combination system of Surdeanu et al.",
        "(2007) studied the combination of three different SRL systems using constraints and also by training secondary scoring functions over the individual systems.",
        "Their approach is similar to the one presented in this paper in that, unlike standard reranking, as in Collins (2000), we entertain all possible solutions during inference, while reranking approaches train a discriminative scorer for the top-K solutions of an underlying system.",
        "Unlike the SRL combination system, however, our approach spans multiple phenomena.",
        "Moreover, in contrast to their re-scoring approaches, we do not define joint features drawn from the predictions of the underlying components to define our global model.",
        "We consider the tasks verb SRL and preposition roles and combine their predictions to provide a richer semantic annotation of text.",
        "This approach can be easily extended to include systems that predict structures for other linguistic phenomena because we do not retrain the underlying systems.",
        "The semantic relations can be enriched by incorporating more linguistic phenomena such as nominal SRL, defined by the Nombank annotation scheme of Meyers et al.",
        "(2004), the preposition function analysis of O'Hara and Wiebe (2009) and noun compound analysis as defined by Girju (2007) and Girju et al.",
        "(2009) and others.",
        "This presents an exciting direction for future work."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "This paper presents a strategy for extending semantic role labeling without the need for extensive retraining or data annotation.",
        "While standard semantic role labeling focuses on verb and nominal relations, sentences can express relations using other lexical items also.",
        "Moreover, the different relations interact with each other and constrain the possible structures that they can take.",
        "We use this intuition to define a joint model for inference.",
        "We instantiate our model using verb semantic role labeling and preposition role labeling and show that, using linguistic constraints between the tasks and minimal joint learning, we can improve the performance of both tasks.",
        "The main advantage of our approach is that we can use existing trained models without retraining them, thus making it easy to extend this work to include other linguistic phenomena."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The authors thank the members of the Cognitive Computation Group at the University of Illinois for insightful discussions and the anonymous reviewers for valuable feedback.",
        "This research is supported by the Defense Advanced Research Projects Agency (DARPA) Machine Reading Program under Air Force Research Laboratory (AFRL) prime contract no.",
        "FA8750-09-C-0181.",
        "Any opinions, ndings, and conclusion or recommendations expressed in this material are those of the authors and do not necessarily reect the view of the DARPA, AFRL, or the US government."
      ]
    }
  ]
}
