{
  "info": {
    "authors": [
      "Carolina Parada",
      "Mark Dredze",
      "Abhinav Sethy",
      "Ariya Rastrow"
    ],
    "book": "Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies",
    "id": "acl-P11-1072",
    "title": "Learning Sub-Word Units for Open Vocabulary Speech Recognition",
    "url": "https://aclweb.org/anthology/P11-1072",
    "year": 2011
  },
  "references": [
    "acl-N09-1024",
    "acl-N10-1025",
    "acl-W04-2902"
  ],
  "sections": [
    {
      "text": [
        "Carolina Parada, Mark Dredze, Abhinav Sethy, and Ariya Rastrow",
        "Human Language Technology Center of Excellence, Johns Hopkins University 3400 N Charles Street, Baltimore, MD, USA",
        "IBM T.J. Watson Research Center, Yorktown Heights, NY, USA",
        "Large vocabulary speech recognition systems fail to recognize words beyond their vocabulary, many of which are information rich terms, like named entities or foreign words.",
        "Hybrid word/sub-word systems solve this problem by adding sub-word units to large vocabulary word based systems; new words can then be represented by combinations of subword units.",
        "Previous work heuristically created the sub-word lexicon from phonetic representations of text using simple statistics to select common phone sequences.",
        "We propose a probabilistic model to learn the subword lexicon optimized for a given task.",
        "We consider the task of out of vocabulary (OOV) word detection, which relies on output from a hybrid model.",
        "A hybrid model with our learned sub-word lexicon reduces error by 6.3% and 7.6% (absolute) at a 5% false alarm rate on an English Broadcast News and MIT Lectures task respectively."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Most automatic speech recognition systems operate with a large but limited vocabulary, finding the most likely words in the vocabulary for the given acoustic signal.",
        "While large vocabulary continuous speech recognition (LVCSR) systems produce high quality transcripts, they fail to recognize out of vocabulary (OOV) words.",
        "Unfortunately, OOVs are often information rich nouns, such as named entities and foreign words, and mis-recognizing them can have a disproportionate impact on transcript coherence.",
        "Hybrid word/sub-word recognizers can produce a sequence of sub-word units in place of OOV words.",
        "Ideally, the recognizer outputs a complete word for in-vocabulary (IV) utterances, and sub-word units for OOVs.",
        "Consider the word \"Slobodan\", the given name of the former president of Serbia.",
        "As an uncommon English word, it is unlikely to be in the vocabulary of an English recognizer.",
        "While a LVCSR system would output the closest known words (e.x.",
        "\"slow it dawn\"), a hybrid system could output a sequence of multi-phoneme units: s_l_ow, b_ax, d_ae_n.",
        "The latter is more useful for automatically recovering the word's orthographic form, identifying that an OOV was spoken, or improving performance of a spoken term detection system with OOV queries.",
        "In fact, hybrid systems have improved OOV spoken term detection (Mamou et al., 2007; Parada et al., 2009), achieved better phone error rates, especially in OOV regions (Rastrow et al., 2009b), and obtained state-of-the-art performance for OOV detection (Parada et al., 2010).",
        "Hybrid recognizers vary in a number of ways: sub-word unit type: variable-length phoneme units (Rastrow et al., 2009a; Bazzi and Glass, 2001) or joint letter sound sub-words (Bisani and Ney, 2005); unit creation: data-driven or linguistically motivated (Choueiter, 2009); and how they are incorporated in LVCSR systems: hierarchical (Bazzi, 2002) or flat models (Bisani and Ney, 2005).",
        "In this work, we consider how to optimally create sub-word units for a hybrid system.",
        "These units are variable-length phoneme sequences, although in principle our work can be use for other unit types.",
        "Previous methods for creating the sub-word lexicon have relied on simple statistics computed from the phonetic representation of text (Rastrow et al., 2009a).",
        "These units typically represent the most frequent phoneme sequences in English words.",
        "However, it isn't clear why these units would produce the best hybrid output.",
        "Instead, we introduce a probabilistic model for learning the optimal units for a given task.",
        "Our model learns a segmentation of a text corpus given some side information: a mapping between the vocabulary and a label set; learned units are predictive of class labels.",
        "In this paper, we learn sub-word units optimized for OOV detection.",
        "OOV detection aims to identify regions in the LVCSR output where OOVs were uttered.",
        "Towards this goal, we are interested in selecting units such that the recognizer outputs them only for OOV regions while prefering to output a complete word for in-vocabulary regions.",
        "Our approach yields improvements over state-of-the-art results.",
        "We begin by presenting our log-linear model for learning sub-word units with a simple but effective inference procedure.",
        "After reviewing existing OOV detection approaches, we detail how the learned units are integrated into a hybrid speech recognition system.",
        "We show improvements in OOV detection, and evaluate impact on phone error rates."
      ]
    },
    {
      "heading": "2. Learning Sub-Word Units",
      "text": [
        "Given raw text, our objective is to produce a lexicon of sub-word units that can be used by a hybrid system for open vocabulary speech recognition.",
        "Rather than relying on the text alone, we also utilize side information: a mapping of words to classes so we can optimize learning for a specific task.",
        "The provided mapping assigns labels Y to the corpus.",
        "We maximize the probability of the observed labeling sequence Y given the text W: P(Y|W).",
        "We assume there is a latent segmentation S of this corpus which impacts Y.",
        "The complete data likelihood becomes: P(Y|W) = E<?",
        "P(Y,S|W) during training.",
        "Since we are maximizing the observed Y, segmentation S must discriminate between different possible labels.",
        "We learn variable-length multi-phone units by segmenting the phonetic representation ofeachword in the corpus.",
        "Resulting segments form the subword lexicon.",
        "Learning input includes a list of words to segment taken from raw text, a mapping between words and classes (side information indicating whether token is IV or OOV), a pronunciation dictionary D, and a letter to sound model (L2S), such as the one described in Chen (2003).",
        "The corpus W is the list of types (unique words) in the raw text input.",
        "This forces each word to have a unique segmentation, shared by all common tokens.",
        "Words are converted into phonetic representations according to their most likely dictionary pronunciation; non-dictionary words use the L2S model.",
        "Inspired by the morphological segmentation model of Poon et al.",
        "(2009), we assume P (Y, S | W ) is a log-linear model parameterized by A:",
        "where ua(Y,S,W) defines the score of the proposed segmentation S for words W and labels Y according to model parameters A. Sub-word units a compose S, where each a is a phone sequence, including the full pronunciation for vocabulary words; the collection of as form the lexicon.",
        "Each unit a is present in a segmentation with some context c = <r) of the form (f)ia(f)r. Features based on the context and the unit itself parameterize ua.",
        "In addition to scoring a segmentation based on features, we include two priors inspired by the Minimum Description Length (MDL) principle suggested by Poon et al.",
        "(2009).",
        "The lexicon prior favors smaller lexicons by placing an exponential prior with negative weight on the length of the lexicon a |a|, where |a| is the length of the unit a in number of phones.",
        "Minimizing the lexicon prior favors a trivial lexicon of only the phones.",
        "The corpus prior counters this effect, an exponential prior with negative weight on the number of units in each word's segmentation, where is the segmentation length and is the length of the word in phones.",
        "Learning strikes a balance between the two priors.",
        "Using these definitions, the segmentation score ua(Y, S, W) is given as:",
        "Figure 1: Units and bigram phone context (in parenthesis) for an example segmentation of the word \"slobodan\".",
        "fa,y (S, Y) are the co-occurrence counts of the pair (a, y) where a is a unit under segmentation S and y is the label.",
        "fcyy (S, Y) are the co-occurrence counts for the context c and label y under S. The model parameters are A = [Xa,y, Acy : Va, c, y}.",
        "The negative weights for the lexicon (a) and corpus priors (ß) are tuned on development data.",
        "The normalizer Z sums over all possible segmentations and labels:",
        "Consider the example segmentation for the word \"slobodan\" withpronunciation s ,l,ow,b,ax,d,ae,n (Figure 1).",
        "The bigram phone context as a four-tuple appears below each unit; the first two entries correspond to the left context, and last two the right context.",
        "The example corpus (Figure 2) demonstrates how unit features fCT>y and context features fc>y are computed."
      ]
    },
    {
      "heading": "3. Model Training",
      "text": [
        "Learning maximizes the log likelihood of the observed labels Y * given the words W :",
        "We use the Expectation-Maximization algorithm, where the expectation step predicts segmentations S",
        "Labeled corpus: president/y = 0 milosevic/y = 1 Context-feature:Value",
        "Figure 2: A small example corpus with segmentations and corresponding features.",
        "The notation m_ih/1:1 represents unit/label:feature-value.",
        "Overlapping context features capture rich segmentation regularities associated with each class.",
        "given the model's current parameters A (§3.1), and the maximization step updates these parameters using gradient ascent.",
        "The partial derivatives of the objective (4) with respect to each parameter are:",
        "The gradient takes the usual form, where we encourage the expected segmentation from the current model given the correct labels to equal the expected segmentation and expected labels.",
        "The next section discusses computing these expectations.",
        "Inference is challenging since the lexicon prior renders all word segmentations interdependent.",
        "Consider a simple two word corpus: cesar (s ,iy,z,er), and cesium (s ,iy,z,iy,ax,m).",
        "Numerous segmentations are possible; each word has 2N-1 possible segmentations, where N is the number of phones in its pronunciation (i.e., 2 x 2 = 256).",
        "However, if we decide to segment the first word as: {s_iy, z_er}, then the segmentation for \"cesium\":{s_iy, z_iy_ax_m} will incur a lexicon prior penalty for including the new segment z_iy_ax_m.",
        "If instead we segment \"cesar\" as {s_iy_z, er}, the segmentation {s_iy, z_iy_ax_m} incurs double penalty for the lexicon prior (since we are including two new units in the lexicon: s_iy and z_iy_ax_m).",
        "This dependency requires joint segmentation ofthe entire corpus, which is intractable.",
        "Hence, we resort to approximations of the expectations in Eq.",
        "(5).",
        "One approach is to use Gibbs Sampling: iterating through each word, sampling a new segmentation conditioned on the segmentation of all other words.",
        "The sampling distribution requires enumerating all possible segmentations for each word (2N-1) and computing the conditional probabilities for each segmentation: P(S| Y*, W) = P(Y*, S|W)/P(Y*|W) (the features are extracted from the remaining words in the corpus).",
        "Using M sampled segmentations S1, S2,... Sm we compute Es|y*,w[fi\\ as follows:",
        "Similarly, to compute ESY\\W we sample a segmentation and a label for each word.",
        "We compute the joint probability of P (Y, S |W ) for each segmentation-label pair using Eq.",
        "(1).",
        "A sampled segmentation can introduce new units, which may have higher probability than existing ones.",
        "Using these approximations in Eq.",
        "(5), we update the parameters using gradient ascent:",
        "where 7 > 0 is the learning rate.",
        "To obtain the best segmentation, we use deterministic annealing.",
        "Sampling operates as usual, except that the parameters are divided by a value, which starts large and gradually drops to zero.",
        "To make burn in faster for sampling, the sampler is initialized with the most likely segmentation from the previous iteration.",
        "To initialize the sampler the first time, we set all the parameters to zero (only the priors have non-zero values) and run deterministic annealing to obtain the first segmentation of the corpus.",
        "Sampling a segmentation for the corpus requires computing the normalization constant (3), which contains a summation over all possible corpus segmentations.",
        "Instead, we approximate this constant by sampling words independently, keeping fixed all other segmentations.",
        "Still, even sampling a single word's segmentation requires enumerating probabilities for all possible segmentations.",
        "We sample a segmentation efficiently using dynamic programming.",
        "We can represent all possible segmentations for a word as a finite state machine (FSM) (Figure 3), where arcs weights arise from scoring the segmentation's features.",
        "This weight is the negative log probability of the resulting model after adding the corresponding features and priors.",
        "However, the lexicon prior poses a problem for this construction since the penalty incurred by a new unit in the segmentation depends on whether that unit is present elsewhere in that segmentation.",
        "For example, consider the segmentation for the word ANJANI : AA_N, JH, AAJNT, IY.",
        "If none of these units are in the lexicon, this segmentation yields the lowest prior penalty since it repeats the unit AA_N.",
        "This global dependency means paths must encode the full unit history, making computing forward-backward probabilities inefficient.",
        "Our solution is to use the Metropolis-Hastings algorithm, which samples from the true distribution P (Y, S | W) by first sampling a new label and segmentation (y', s') from a simpler proposal distribution Q(Y, S| W).",
        "The new assignment (y', s') is accepted with probability:",
        "We choose the proposal distribution Q(Y, S|W) as Eq.",
        "(1) omitting the lexicon prior, removing the challenge for efficient computation.",
        "The probability of accepting a sample becomes:",
        "We sample a path from the FSM by running the forward-backward algorithm, where the backward computations are carried out explicitly, and the forward pass is done through sampling, i.e. we traverse the machine only computing forward probabilities for arcs leaving the sampled state.",
        "Once we sample a segmentation (and label) we accept it according to Eq.",
        "(6) or keep the previous segmentation ifrejected.",
        "Alg.",
        "1 shows our full sub-word learning procedure, where sampleSL(Alg.",
        "2) samples a segmentation and label sequence for the entire corpus from P (Y, S | W ), and sampleS samples a segmentation from P(S|Y*, W).",
        "Algorithm 1 Training Input: Lexicon L from training text W, Dictionary D, Mapping M, L2S pronunciations, Annealing temp T. Initialization:",
        "S0 = random segmentation for each word in L.",
        "Si = bestSegmentation(T, Ai-1, Si-1).",
        "for k = 1 to NumSamples do",
        "S = bestSegmentation(T, AK, S0) Output: Lexicon Lo from S"
      ]
    },
    {
      "heading": "4. OOV Detection Using Hybrid Models",
      "text": [
        "To evaluate our model for learning sub-word units, we consider the task of out-of-vocabulary (OOV) word detection.",
        "OOV detection for ASR output can be categorized into two broad groups: 1) hybrid (filler) models: which explicitly model OOVs using either filler, sub-words, or generic word models (Bazzi, 2002; Schaaf, 2001; Bisani and Ney, 2005; Klakow et al., 1999; Wang, 2009); and 2) confidence-based approaches: which label unreliable regions as OOVs based on different confidence scores, such as acoustic scores, language models, and lattice scores (Lin et al., 2007; Burget et al., 2008; Sun et al., 2001; Wessel et al., 2001).",
        "In the next section we detail the OOV detection approach we employ, which combines hybrid and ( skm, ymk ) = Sample segmentation/label pair for word wm according to Q(S, Y | W ) confidence-based models, achieving state-of-the art performance for this task.",
        "We use the state-of-the-art OOV detection model of Parada et al.",
        "(2010), a second order CRF with features based on the output of a hybrid recognizer.",
        "This detector processes hybrid recognizer output, so we can evaluate different sub-word unit lexicons for the hybrid recognizer and measure the change in OOV detection accuracy.",
        "Our model (§2.1) can be applied to this task by using a dictionary D to label words as IV (yj = 0 if Wi G D) and OOV (yj = 1 if Wj </ D).",
        "This results in a labeled corpus, where the labeling sequence Y indicates the presence of out-of-vocabulary words (OOVs).",
        "For comparison we evaluate a baseline method (Rastrow et al., 2009b) for selecting units.",
        "Given a sub-word lexicon, the word and sub-words are combined to form a hybrid language model (LM) to be used by the LVCSR system.",
        "This hybrid LM captures dependencies between word and sub-words.",
        "In the LM training data, all OOVs are represented by the smallest number of sub-words which corresponds to their pronunciation.",
        "Pronunciations for all OOVs are obtained using grapheme to phone models (Chen, 2003).",
        "Since sub-words represent OOVs while building the hybrid LM, the existence of sub-words in ASR output indicate an OOV region.",
        "A simple solution to the OOV detection problem would then be reduced to a search for the sub-words in the output of the ASR system.",
        "The search can be on the one-best transcripts, lattices or confusion networks.",
        "While lattices contain more information, they are harder to process; confusion networks offer a trade-off between richness (posterior probabilities are already computed) and compactness (Mangu et al., 1999).",
        "Two effective indications of OOVs are the existence of sub-words (Eq.",
        "7) and high entropy in a network region (Eq.",
        "8), both of which are used as features in the model of Parada et al.",
        "(2010).",
        "tj is the current bin in the confusion network and a is a sub-word in the hybrid dictionary.",
        "Improving the sub-word unit lexicon, improves the quality of the confusion networks for OOV detection."
      ]
    },
    {
      "heading": "5. Experimental Setup",
      "text": [
        "We used the data set constructed by Can et al.",
        "(2009) (OOVCORP) for the evaluation of Spoken Term Detection of OOVs since it focuses on the OOV problem.",
        "The corpus contains 100 hours of transcribed Broadcast News English speech.",
        "There are 1290 unique OOVs in the corpus, which were selected with a minimum of 5 acoustic instances per word and short OOVs inappropriate for STD (less than 4 phones) were explicitly excluded.",
        "Example OOVs include: NATALIE, PUTIN, QAEDA, HOLLOWAY, COROLLARIES, HYPERLINKED, etc.",
        "This resulted in roughly 24K (2%) OOV tokens.",
        "For LVCSR, we used the IBM Speech Recognition Toolkit (Soltau et al., 2005) to obtain a transcript of the audio.",
        "Acoustic models were trained on 300 hours of HUB4 data (Fiscus et al., 1998) and utterances containing OOV words as marked in OOVCORP were excluded.",
        "The language model was trained on 400M words from various text sources with a 83K word vocabulary.",
        "The LVCSR system's WER on the standard RT04 BN test set was 19.4%.",
        "Excluded utterances amount to 100hrs.",
        "These were divided into 5 hours of training for the OOV detector and 95 hours of test.",
        "Note that the OOV detector training set is different from the LVCSR training set.",
        "We also use a hybrid LVCSR system, combining word and sub-word units obtained from either our approach or a state-of-the-art baseline approach (Rastrow et al., 2009a) (§5.2).",
        "Our hybrid system's lexicon has 83K words and 5K or 10K sub-words.",
        "Note that the word vocabulary is common to both systems and only the sub-words are selected using either approach.",
        "The word vocabulary used is close to most modern LVCSR system vocabularies for English Broadcast News; the resulting OOVs are more challenging but more realistic (i.e. mostly named entities and technical terms).",
        "The 1290 words are OOVs to both the word and hybrid systems.",
        "In addition we report OOV detection results on a MIT lectures data set (Glass et al., 2010) consisting of 3 Hrs from two speakers with a 1.5% OOV rate.",
        "These were divided into 1 Hr for training the OOV detector and 2 Hrs for testing.",
        "Note that the LVCSR system is trained on Broadcast News data.",
        "This out-of-domain test-set help us evaluate the cross-domain performance of the proposed and baseline hybrid systems.",
        "OOVs in this data set correspond mainly to technical terms in computer science and math.",
        "e.g.",
        "ALGORITHM, DEBUG, COMPILER, LISP.",
        "For learning the sub-words we randomly selected from training 5,000 words which belong to the 83K vocabulary and 5,000 OOVs.",
        "For development we selected an additional 1,000 IV and 1,000 OOVs.",
        "This was used to tune our model hyper parameters (set to a = – 1, ß = – 20).",
        "There is no overlap of OOVs in training, development and test sets.",
        "All feature weights were initialized to zero and had a Gaussian prior with variance a = 100.",
        "Each of the words in training and development was converted to their most-likely pronunciation using the dictionary for IV words or the L2S model for OOVs.",
        "The learning rate was Yk = (k+i+Ay, where k is the iteration, A is the stability constant (set to 0.1K), Y = 0.4, and t = 0.6.",
        "We used K = 40 iterations for learning and 200 samples to compute the expectations in Eq.",
        "5.",
        "The sampler was initialized by sampling for 500 iterations with deterministic annealing for a temperature varying from 10 to 0 at 0.1 intervals.",
        "Final segmentations were obtained using 10, 000 samples and the same temperature schedule.",
        "We limit segmentations to those including units of at most 5 phones to speed sampling with no significant degradation in performance.",
        "We observed improved performance by disallowing whole word units.",
        "We used Rastrow et al.",
        "(2009a) as our baseline unit selection method, a data driven approach where the language model training text is converted into phones using the dictionary (or a letter-to-sound model for OOVs), and a N-gram phone LM is estimated on this data and pruned using a relative entropy based method.",
        "The hybrid lexicon includes resulting sub-words - ranging from unigrams to 5-gram phones, and the 83K word lexicon.",
        "We obtain confusion networks from both the word and hybrid LVCSR systems.",
        "We align the LVCSR transcripts with the reference transcripts and tag each confusion region as either IV or OOV.",
        "The OOV detector classifies each region in the confusion network as IV/OOV.",
        "We report OOV detection accuracy using standard detection error tradeoff (DET) curves (Martin et al., 1997).",
        "DET curves measure tradeoffs between false alarms (x-axis) and misses (y-axis), and are useful for determining the optimal operating point for an application; lower curves are better.",
        "Following Parada et al.",
        "(2010) we separately evaluate unobserved OOVs."
      ]
    },
    {
      "heading": "6. Results",
      "text": [
        "We compare the performance of a hybrid system with baseline units (§5.2) and one with units learned by our model on OOV detection and phone error rate.",
        "We present results using a hybrid system with 5k and 10k sub-words.",
        "We evaluate the CRF OOV detector with two different feature sets.",
        "The first uses only Word Entropy and Sub-word Posterior (Eqs.",
        "7 and 8) (Figure 4).",
        "The second (context) uses the extended context features of Parada et al.",
        "(2010) (Figure 5).",
        "Specifically, we include all trigrams obtained from the best hypothesis of the recognizer (a window of 5 words around current confusion bin).",
        "Predictions at different FA rates are obtained by varying a probability threshold.",
        "At a 5% FA rate, our system (This Paper 5k) reduces the miss OOV rate by 6.3% absolute over the baseline (Baseline 5k) when evaluating all OOVs.",
        "For unobserved OOVs, it achieves 3.6% absolute improvement.",
        "A larger lexicon (Baseline 10k and This Paper 10k ) shows similar relative improvements.",
        "Note that the features used so far do not necessarily provide an advantage for unobserved versus observed OOVs, since they ignore the decoded word/sub-word sequence.",
        "In fact, the performance on unobserved OOVs is better.",
        "OOV detection improvements can be attributed to increased coverage of OOV regions by the learned sub-words compared to the baseline.",
        "Table 1 shows the percent of Hits: sub-word units predicted in OOV regions, and False Alarms: sub-word units predicted for in-vocabulary words.",
        "We can see that the proposed system increases the Hits by over 8% absolute, while increasing the False Alarms by 0.3%.",
        "Interestingly, the average sub-word length for the proposed units exceeded that of the baseline units by 0.3 phones (Baseline 5K average length was 2.92, while that of This Paper 5K was 3.2).",
        "(a) (b) Figure 4: DET curves for OOV detection using baseline hybrid systems for different lexicon size and proposed discriminative hybrid system on OOVCORP data set.",
        "Evaluation on unobserved OOVs (a) and all OOVs (b).",
        "■ This Paper (10k) + context-features",
        "Figure 5: Effect of adding context features to baseline and discriminative hybrid systems on OOVCORP data set.",
        "Evaluation on unobserved OOVs (a) and all OOVs (b).",
        "Consistent with previously published results, including context achieves large improvement in performance.",
        "The proposed hybrid system (This Paper 10k + context-features) still improves over the baseline (Baseline 10k + context-features), however the relative gain is reduced.",
        "In this case, we obtain larger gains for unobserved OOVs which benefit less from the context clues learned in training.",
        "Lastly, we report OOV detection performance on MIT Lectures.",
        "Both the sub-word lexicon and the LVCSR models were trained on Broadcast News data, helping us evaluate the robustness of learned sub-words across domains.",
        "Note that the OOVs in these domains are quite different: MIT Lectures' OOVs correspond to technical computer science and math terms, while in Broadcast News they are mainly named-entities.",
        "Figure 6 and 7 show the OOV detection results in the MIT Lectures data set.",
        "For unobserved OOVs, the proposed system (This Paper 10k) reduces the miss OOV rate by 7.6% with respect to the baseline (Baseline 10k) at a 5% FA rate.",
        "Similar to Broadcast News results, we found that the learned sub-words provide larger coverage of OOV regions in MIT Lectures domain.",
        "These results suggest that the proposed sub-words are not simply modeling the training OOVs (named-entities) better than the baseline sub-words, but also describe better novel unexpected words.",
        "Furthermore, including context features does not seem as helpful.",
        "We conjecture that this is due to the higher WER and the less structured nature of the domain: i.e. ungrammatical sentences, disfluencies, incomplete sentences, making it more difficult to predict OOVs based on context.",
        "^\\",
        " – Baseline (5k) This Paper (5k)",
        "--Baseline (10k)",
        "- - This Paper (10k)",
        "\\\\\\ \\",
        "Vs.",
        "ö\\ \\ * %\\ \\ * %\\ \\",
        "s \\ \\",
        " – Baseline (5k) This Paper (5k)",
        "--Baseline (10k)",
        "- - This Paper (10k)",
        "1",
        "■<-^",
        "\\",
        "V«.",
        "- - Baseline (10k)",
        " – Baseline (10k) + context-features",
        "■■■ This Paper (10k)",
        "- - This Paper (10k) + context-features",
        "Hybrid System",
        "Hits",
        "FAs",
        "Baseline (5k) This Paper (5k)",
        "18.25 26.78",
        "1.49 1.78",
        "Baseline (10k) This Paper (10k)",
        "24.26 28.96",
        "1.82 1.92",
        "(a) (b) Figure 6: DET curves for OOV detection using baseline hybrid systems for different lexicon size and proposed discriminative hybrid system on MIT Lectures data set.",
        "Evaluation on unobserved OOVs (a) and all OOVs (b).",
        "This Paper (10k) + context-features",
        "Figure 7: Effect of adding context features to baseline and discriminative hybrid systems on MIT Lectures data set.",
        "Evaluation on unobserved OOVs (a) and all OOVs (b).",
        "We consider the hybrid lexicon's impact on Phone Error Rate (PER) with respect to the reference transcription.",
        "The reference phone sequence is obtained by doing forced alignment of the audio stream to the reference transcripts using acoustic models.",
        "This provides an alignment of the pronunciation variant of each word in the reference and the recognizer's one-best output.",
        "The aligned words are converted to the phonetic representation using the dictionary.",
        "Table 2 presents PERs for the word and different hybrid systems.",
        "As previously reported (Rastrow et al., 2009b), the hybrid systems achieve better PER, specially in OOV regions since they predict sub-word units for OOVs.",
        "Our method achieves modest improvements in PER compared to the hybrid baseline.",
        "No statistically significant improvements in PER were observed on MIT Lectures."
      ]
    },
    {
      "heading": "7. Conclusions",
      "text": [
        "Our probabilistic model learns sub-word units for hybrid speech recognizers by segmenting a text corpus while exploiting side information.",
        "Applying our method to the task of OOV detection, we obtain an absolute error reduction of 6.3% and 7.6% at a 5% false alarm rate on an English Broadcast News and MIT Lectures task respectively, when compared to a baseline system.",
        "Furthermore, we have confirmed previous work that hybrid systems achieve better phone accuracy, and our model makes modest improvements over a baseline with a similarly sized sub-word lexicon.",
        "We plan to further explore our new lexicon's performance for other languages and tasks, such as OOV spoken term detection."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We gratefully acknowledge Bhuvaha Ramabhadran for many insightful discussions and the anonymous reviewers for their helpful comments.",
        "This work was funded by a Google PhD Fellowship.",
        " – Baseline (10k)",
        ".",
        " – Baseline (10k) + context-features -- This Paper (10k)",
        "- - This Paper (10k) + context-features",
        "System",
        "OOV",
        "IV",
        "All",
        "Word",
        "1.62",
        "6.42",
        "8.04",
        "Hybrid: Baseline (5k)",
        "1.56",
        "6.44",
        "8.01",
        "Hybrid: Baseline (10k)",
        "1.51",
        "6.41",
        "7.92",
        "Hybrid: This Paper (5k) Hybrid: This Paper (10k)",
        "1.52 1.45",
        "6.42 6.39",
        "7.94 7.85"
      ]
    }
  ]
}
