{
  "info": {
    "authors": [
      "Kallirroi Georgila",
      "Ron Artstein",
      "Angela Nazarian",
      "Michael Rushforth",
      "David R. Traum",
      "Katia Sycara"
    ],
    "book": "Proceedings of the SIGDIAL 2011 Conference",
    "id": "acl-W11-2030",
    "title": "An Annotation Scheme for Cross-Cultural Argumentation and Persuasion Dialogues",
    "url": "https://aclweb.org/anthology/W11-2030",
    "year": 2011
  },
  "references": [
    "acl-J87-1002"
  ],
  "sections": [
    {
      "text": [
        "Kallirroi Georgila^, Ron Artstein^, Angela Nazarian^ Michael Rushforth^* David Traum^, Katia Sycara*",
        "We present a novel annotation scheme for cross-cultural argumentation and persuasion dialogues.",
        "This scheme is an adaptation of existing coding schemes on negotiation, following a review of literature on cross-cultural differences in negotiation styles.",
        "The scheme has been refined through application to coding both two-party and multi-party negotiation dialogues in three different domains, and is general enough to be applicable to different domains with few if any extensions.",
        "Dialogues annotated with the scheme have been used to successfully learn culture-specific dialogue policies for argumentation and persuasion."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In both cooperative and non-cooperative negotiation the nature of the arguments used can be crucial for the outcome of the negotiation.",
        "Argumentation and persuasion are basic elements of negotiation.",
        "Moreover, different cultures favor different types of arguments (Koch, 1983; Han and Shavitt, 1994; Zaharna, 1995; Brett and Gelfand, 2006).",
        "For example, it is claimed that Western individualistic cultures favor arguments based on logic over arguments that appeal to emotions.",
        "On the other hand, people from Eastern collectivistic cultures are more likely to use arguments in which the beneficiary is not themselves.",
        "Furthermore, Arab cultures tend to favor more indirect ways of argumentation and expression (Koch, 1983; Zaharna, 1995).",
        "* Now at the University of Texas at San Antonio.",
        "In order to analyze negotiation in detail, including aspects such as persuasion, negotiation, and cross-cultural differences, we have developed a novel annotation scheme.",
        "General purpose annotation schemes such as DAMSL (Core and Allen, 1997) and DIT++ (Bunt, 2006) represent moves in the dialogue but do not capture enough details of the interaction to distinguish between different styles of persuasion and argumentation, especially cross-cultural differences.",
        "Our goal for developing this coding scheme is two-fold.",
        "First, we aim to fill the gap in the literature of cross-cultural argumentation and persuasion.",
        "To our knowledge this is the first annotation scheme designed specifically for coding cross-cultural argumentation and persuasion strategies.",
        "Previous work on cross-cultural negotiation, e.g. Brett and Gelfand (2006), has not focused on argumentation or persuasion in particular.",
        "Also, previous work on argumentation, e.g. Prakken (2008), has not attempted to capture cross-cultural differences in argumentation and persuasion strategies.",
        "Second, we use this coding scheme to annotate negotiation dialogues to automatically learn argumentation and persuasion dialogue policies for different cultures (Georgila and Traum, 2011)."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "The topic of negotiation has widely been studied across various fields including social and behavioral science (Kern et al., 2005), and computer science (Sidner, 1994; Rose and Torrey, 2004).",
        "Our specific focus is on the role of argumentation and persuasion.",
        "Sycara (1990) studied the role of argumentation in negotiation with regard to the role of arguments in changing the decision process of the interlocutor.",
        "Most attempts have focused on studying the structure of argumentation and persuasion, often using formal logic (Cohen, 1987; Prakken, 2008).",
        "Dung (1995) showed that argumentation can be viewed as a special form of logic programming with negation as failure.",
        "An argumentation scheme is defined as a structure or template for forming an argument.",
        "Schemes are necessary for identifying arguments, finding missing premises, analyzing arguments, and evaluating arguments (Pollock, 1995;",
        "Katzav and Reed, 2004; Walton et al., 2008).",
        "Recently, there has been some work on using machine learning techniques for automatically interpreting (George et al., 2007) and generating arguments (Zukerman, 2001).",
        "Note also the work of Pi-wek (2008) who performed a study on how arguments can be presented as fictive dialogues.",
        "Finally, there are a few persuasive dialogue systems, e.g. Daphne (Grasso et al., 2000) and BIAS (Bayesian Interactive Argumentation System) (Zukerman, 2001).",
        "There is a vast amount of research on cultural effects on negotiation.",
        "Brett and Gelfand (2006) identify three aspects in cross-cultural negotiation: individualism vs. collectivism, egalitarianism vs. hierarchy, and low context vs. high context communication.",
        "Typically Western individuals are individualistic, egalitarian, and use low context communication while Eastern individuals are collectivistic, hierarchical, and use high context communication.",
        "Although there has been a considerable amount of work on building agents that can negotiate (Traum et al., 2003; Rose and Torrey, 2004), little has been done towards building agents that can take into account culture aspects of negotiation (Cassell, 2009;",
        "Paruchuri et al., 2009; Traum, 2009).",
        "Our literature review on cross-cultural argumentation and persuasion showed that there are comparatively few papers related to cross-cultural argumentation and persuasion in dialogue.",
        "Most work on cross-cultural studies is based on survey experiments rather than dialogue analysis.",
        "Below we summarize the works that we were influenced by the most.",
        "Peng and Nisbett (1999) studied the way Chinese vs. European-American people reason about contradiction.",
        "By contradiction, here, we mean opposing pieces of information.",
        "Chinese individuals adopt a dialectical or compromise approach by retaining basic elements of the opposing perspectives.",
        "European-American people select one of the perspectives as correct and dismiss the opposing ones.",
        "Koch (1983) linguistically analyzed several persuasive texts in contemporary Arabic in which there was both repetition of form and repetition of content.",
        "She found that Arabs use repetition as a means for persuasion.",
        "This strategy is called \"presentation as proof\" or \"argumentation by presentation\".",
        "Thus in Arabic argumentation it is the presentation of an idea that is persuasive, not the logical structure of proof which Westerners see behind the words.",
        "Za-harna (1995) examined how the Arab and American cultures have two distinct perspectives for viewing the role of language, for structuring persuasive messages, and for communicating effectively with their audiences.",
        "For Arabs emphasis is on form over function, affect over accuracy, and image over meaning, which is in line with the work of Koch (1983).",
        "Finally, Cialdini's work (1998) identified six principles of persuasion: reciprocation (tendency to return favors), scarcity (associated with high value), authority (tendency to follow authority figures), social proof (one is looking to the behavior of other individuals to determine her own actions), liking (one tends to do things for people that she likes), and commitment and consistency (one has difficulty to reverse her commitments)."
      ]
    },
    {
      "heading": "3. Our Annotation Scheme",
      "text": [
        "We have developed a novel scheme for coding cross-cultural argumentation and persuasion strategies.",
        "This scheme is based on the literature review presented in section 2.2, as well as our own analysis of three very different kinds of negotiation (section 4).",
        "To develop this annotation scheme, we started by adapting existing coding schemes on negotiation developed by Pruitt and Lewis (1975), Carnevale et al.",
        "(1981), and Sidner (1994).",
        "We were also influenced by the work of Prakken on argumentation and dialogue (2008), and the work of Cialdini (1998) on persuasion (see section 2.2).",
        "Our annotation scheme was further refined by iteratively applying it to three different negotiation domains.",
        "In our coding scheme, we use three dimensions for annotating an utterance: speech act, topic, and response or reference to a previous utterance.",
        "We have divided our codes for speech acts in categories.",
        "Below we can see each category and the codes that are included in it with explanatory examples, mostly drawn from the florist-grocer dialogues described in section 4.1.",
        "start-topic Let's talk about the design.",
        "end-topic We are done with the design.",
        "redirect-topic We need to get back to the task.",
        "This category includes providing and requesting information, broken down into three kinds of information that are about the negotiation (priority, value, preference) as well as a fourth category (fact) which can be further subdivided, depending on the issue being negotiated (e.g. for the toy domain in section 4.3, there are specializations for origin, function, and utility of the toy).",
        "request-info.priority Which issue is the most important to you?",
        "requestJnfo.value How much money will I get if I give you this?",
        "requestJnfo.preference What do you think about the blue color?",
        "requestJnfo.fact What will happen to the flowers if the temperature gets higher?",
        "provide_info.priority I care most about temperature.",
        "provideJnfo.value You get $50 more if you agree to lower the temperature by one degree.",
        "provide_info.preference I like design A.",
        "pr.ovide_info.fact (just a simple fact, neither preference nor priority nor value) So one ofthem will be yours and one mine.",
        "note_similarities We both need the temperature to be relatively low.",
        "note_differences It seems that you want design A and I prefer design C.",
        "project_othersposition So you want an equal distribution ofrent.",
        "request_clarification I am not getting any more money with more customers coming in?",
        "provide_clarification Not necessarily.",
        "request_confirmation Did you say 68 degrees?",
        "self_clarification (when the speaker tries to expand on her ideas) Because when I thought temperature, I was thinking temperature for the products, not temperature for the atmosphere.",
        "We use the following format for an offer:",
        "quest_offer\", generally only the directness field is used.",
        "Type can take the following values: \"standard\", \"tradeoff\", \"compromise\", \"concession\", and \"retraction\".",
        "The difference between \"compromise\" and \"concession\" is subtle.",
        "\"Concession\" means that \"I don't really want to do this but I'll do it because there is no other way\".",
        "\"Compromise\" is like splitting the difference and it does not imply that the speaker does not like the option.",
        "Beneficiary can be \"me\", \"you\", \"both\", \"else\", or \"null\".",
        "By beneficiary we mean who the offer or argument would be good for (see also section 3.7).",
        "So for example, if one's argument is \"it will be too cold for the customers\" then \"beneficiary=else\".",
        "Directness can be \"direct\" or \"indirect\".",
        "An offer or argument is \"indirect\" when it needs to be inferred.",
        "For example, when the grocer says \"well let's say there are lots of other local florists competing for your prices\", she means that this is why advertising is important, but this needs some kind of inference, so the argument is indirect.",
        "Below we can see examples of various types of offers (the beneficiary and directness dimensions are omitted for brevity).",
        "offer.standard How about 62 degrees?",
        "offer.tradeoff (between different issues) I'll agree on 64 degrees if you agree on design A.",
        "offer.compromise Well should we just say 50/50?",
        "offer.concession There is no other way so I agree on 64 degrees.",
        "offer.retraction I changed my mind, I don't want design A.",
        "request_offer What temperature do you suggest?",
        "accept Okay, 62 degrees is fine.",
        "or Yes, I said 62 degrees.",
        "reject 62 degrees is too low for me.",
        "or No, I didn't",
        "say that.",
        "acknowledge I see.",
        "Note that \"accept\" is used for accepting offers and confirmation requests but also for agreement, for example, when one interlocutor agrees with the argument of the other interlocutor.",
        "\"Reject\" is used for rejecting offers and confirmation requests but also for disagreement.",
        "An argument follows the following format: (role).(type).(beneficiary).(directness).",
        "The role can be \"provide_argument\", \"attack_argument\", \"rebut_argument\", \"undercut_argument\", and \"ac-cept_defeat\".",
        "Beneficiary and directness are defined as in section 3.5.",
        "Below we can see examples ofdif-ferent argument roles.",
        "provide_argument The temperature must be low for",
        "my flowers to stay fresh.",
        "attack_argument (without necessarily providing a counter-argument) What you say does not make sense.",
        "rebut_argument (provide a counter-argument) Yes, but my customers wouldn't want to shop in such a low temperature.",
        "undercut_argument (invalidate an argument) You don't need a low temperature in the shop.",
        "Your flowers can be refrigerated to stay fresh.",
        "accept-defeat You are right, I could use a refrigerator.",
        "We have identified the following argument types: ideology (what is \"right\"), logic, fairness, precedent, God's will, promise for the future, honor, duty, identity, authority, refer to relationship, appeal to feelings, social responsibility, assurance (abstract promises), stories/metaphors, ordinance, design (aesthetics and functionality), effect/consequence, cost/means.",
        "These types are mostly inspired by our literature review (see section 2.2), as well as our observations in the domains that we used for developing the annotation scheme.",
        "An example logical argument is \"my flowers need low temperatures to stay fresh\".",
        "An example argument that appeals to fairness is \"I helped you last time so it's fair to help me now\".",
        "Arguments that appeal to logic are more likely to appear in individualistic cultures.",
        "Arguments that appeal to duty, honor, social responsibility, ideology, and fairness are more common in collectivistic cultures.",
        "Stories/metaphors are very common in Arab cultures (Koch, 1983; Zaharna, 1995).",
        "repetition I prefer design A. I said design A.",
        "heavy_commitment $50 is all I can give, not a cent more.",
        "weak_commitment Let's assume that we agree on this and continue.",
        "meta_task_discussion (try to figure out the task) You are the grocer and I am the florist.",
        "self-contradiction Speaker A: I like design C. Speaker A (later): Design C is terrible.",
        "showconcern I understand that this solution would not be good for you.",
        "putdown You are stubborn.",
        "show_frustration I'm really sick and tired of this.",
        "threat Ifyou don't accept my offer I won't do business with you again.",
        "miscellaneous Yes, flowers are beautiful."
      ]
    },
    {
      "heading": "4. Applications of the Annotation Scheme on Various Corpora",
      "text": [
        "In order to prove its generality we applied this coding scheme to three different negotiation domains.",
        "The first domain was dialogues between American undergraduates playing the role of a florist and a grocer who share a retail space.",
        "The dialogues were collected by Laurie R. Weingart, Jeanne M. Brett, and Mary C. Kern at Northwestern University.",
        "The florist and the grocer negotiate on four issues: the design of the space, the temperature, the rent, and their advertising policy.",
        "Using the above coding scheme we annotated 21 dialogues.",
        "Example annotations of speech acts are given in Figure 1, as well as the examples in section 3, above.",
        "The final scheme was the result of several cycles of dialogue annotations and revisions of the coding manual.",
        "We used the florist-grocer annotations to measure inter-annotator reliability between four annotators.",
        "In three cycles of annotation, we measured agreement on speech acts only and complex speech acts were unified, for example, all the \"provide_argument\" are treated as a single category.",
        "Krippendorff's a (Krippendorff, 1980) rose from",
        "After analyzing these results we noticed that the main problems in terms of inter-annotator reliability were the confusion between \"accept\" and \"acknowledge\" (e.g. the utterance \"yeah\" could be either, depending on the context), and the confusion between \"provide_argument.logic\", \"pro-vide_argument.effect\", and \"provideJnfo\".",
        "So we revised the manual as follows: in order for something to be annotated as \"accept\" vs. \"acknowledge\" we need to look forward in the dialogue; if an argument's type is both \"logic\" and \"effect\" then \"effect\" supersedes; \"provide _info\" is just provision of a piece of information with no argumentative role.",
        "In this second domain (Traum et al., 2008), we annotated role-play dialogues in English between a US Army captain and a Spanish doctor in Iraq.",
        "We have annotated five dialogues so far.",
        "An example is given in Figure 2.",
        "Finally, in the third domain groups of four people negotiate in English, Spanish, and Arabic about how to name a toy.",
        "The dialogues were part of the UTEP-ICT Cross-Cultural dialogue corpus (Herrera et al., 2010).",
        "We have annotated five dialogues in English and three in Arabic so far, and are currently working on Spanish.",
        "An example is given in Figure 3.",
        "The \"redirectJopic\" act was added based on this domain (to cover cases where one person consciously redirects the group's attention to the task when they drift off-topic for an extended period of time).",
        "Also, we added three domain-specific specializations of \"provideJnfo.fact\" and \"requestJnfo.fact\": \"pro-vide_info.fact.function\" (discussion about what one can do with the toy or things that it does or has, e.g. a secret compartment); \"provide_info.fact.origin\" (where the toy was manufactured or bought); \"re-questJnfo.fact.utility\" (a person prompts the others for ideas or examples of how the toy could be used and marketed)."
      ]
    },
    {
      "heading": "5. Discussion",
      "text": [
        "We believe that this annotation scheme can be used for analyzing and modeling the fine differences of argumentation and negotiation styles, cross-task, and cross-culture, as well as providing a basis for artificial agents to engage in differentiated negotiation behavior.",
        "Our first use of the annotated florist-grocer dialogues was for learning dialogue policies using simulated users and Reinforcement Learning (RL) (Georgila and Traum, 2011).",
        "To facilitate RL we had to make a few simplifications, for example, focus only on the temperature issue.",
        "In particular, we built policies for individualistic vs. altruistic florists (and grocers).",
        "Our results in simulation were consistent with our reward functions, i.e. the florist individualist agreed on low temperatures while interacting with the grocer altruist, the florist altruist agreed on high temperatures vs. the grocer individualist, etc.",
        "Details are given in (Georgila and Traum, 2011)."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "We presented a novel annotation scheme for cross-cultural argumentation and persuasion dialogues.",
        "This scheme is based on a review of literature on cross-cultural argumentation and persuasion, and adaptation of existing coding schemes on negotiation.",
        "Our annotation scheme is also based on our observations from its application to coding both two-party and multi-party negotiation dialogues in three different domains, and is general enough to be applicable to different domains with minor or no modifications at all.",
        "Furthermore, dialogues annotated with the scheme have been used to successfully learn culture-specific dialogue policies for argumentation and persuasion."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This research was funded by a MURI award through ARO grant number W911NF-08-1-0301.",
        "We are grateful to Laurie R. Weingart, Jeanne M. Brett, and Mary C. Kern who provided us with the florist-grocer dialogues, and to David A. Herrera, David G. Novick, and Dusan Jan who developed the UTEP-ICT corpus, as well as Hussein Sadek for transcriptions and translations of the Arabic dialogues.",
        "Florist: How does that work for you?",
        "(request_info.preference) Grocer: Well, personally for the grocery I think it is better to have a higher temperature.",
        "(pro-vide_argument.logic.me.indirect) Grocer: Just because I want the customers to feel comfortable.",
        "(elaborate) Florist: Okay.",
        "(acknowledge) Grocer: And also if it is warm, people are more apt to buy cold drinks to keep themselves comfortable and cool.",
        "(elaborate) Florist: That's true.",
        "(accept) Florist: But what about your products staying fresh?",
        "Don't they have to stay fresh or otherwise?",
        "(re-but_argument.logic.you.direct) Captain: I think if you just made the compromise, we could provide so much for you if you just agreed to let us move the clinic.",
        "(offer.standard.you.direct) Doctor: Look I need to get back to my patients.",
        "They're dying now.",
        "They're dying.",
        "(show_frustration) Captain: They wouldn't be dying if you let us move the clinic to the US Army base with the additional medical support.",
        "(provide_argument.logic.else.direct) Doctor: Well they wouldn't be dying if I was there.",
        "(rebut_argument.logic.else.direct) Doctor: Why don't you provide us with additional medical support and get out of our lives?",
        "(re-quest_offer.direct) Speaker 3: Blue pal.",
        "(offer.standard.null.direct) Speaker 4: Blue pal.",
        "(acknowledge) Speaker 2: Blue pal.",
        "(acknowledge) Speaker 4: That sounds pretty good.",
        "I actually like the idea.",
        "(accept) Speaker 1: What if it's a different color?",
        "(provide_argument.logic.null.direct) Speaker 2: Yeah, what if it's like pink and purple... (elaborate) Speaker 4: Uh I like blue pal.",
        "I think that one's pretty cool... (provideJnfo.preference) Speaker 2: Something pal like your pal.",
        "(offer.standard.null.direct) Speaker 4: Blue pal the singing singing pal the singing pal the singing and dancing buddy.",
        "The beast you don't want to get angry.",
        "(offer.standard.null.direct) Speaker 2: That's too long.",
        "(reject) Speaker 2: It has to be short.",
        "(provide_argument.logic.null.direct) Speaker 1: Furball.",
        "(offer.standard.null.direct) Speaker 4: A short name... Actually a good really long name might work because everything out there is short... (rebut_argument.logic.nuU.direct)"
      ]
    }
  ]
}
