{
  "info": {
    "authors": [
      "Elizabeth White",
      "K. Bretonnel Cohen",
      "Larry Hunter"
    ],
    "book": "Proceedings of BioNLP 2011 Workshop",
    "id": "acl-W11-0217",
    "title": "Hypothesis and Evidence Extraction from Full-Text Scientific Journal Articles",
    "url": "https://aclweb.org/anthology/W11-0217",
    "year": 2011
  },
  "references": [
    "acl-W09-1325"
  ],
  "sections": [
    {
      "text": [
        "The CISP Annotation Schema Uncovers Hypotheses and Explanations in",
        "Full-Text Scientific Journal Articles",
        "Elizabeth White, K. Bretonnel Cohen, and Lawrence Hunter",
        "Increasingly, as full-text scientific papers are becoming available, scientific queries have shifted from looking for facts to looking for arguments.",
        "Researchers want to know when their colleagues are proposing theories, outlining evidentiary relations, or explaining discrepancies.",
        "We show here that sentence-level annotation with the CISP schema adapts well to a corpus of biomedical articles, and we present preliminary results arguing that the CISP schema is uniquely suited to recovering common types of scientific arguments about hypotheses, explanations, and evidence."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In the scientific domain, the deluge of full-text publications is driving researchers to find better techniques for extracting or summarizing the main claims and findings in a paper.",
        "Many researchers have noted that the sentences of a paper play a small set of different rhetorical roles (Teufel and Moens, 1999; Blais et al., 2007; Agarwal and Yu, 2009).",
        "We are investigating the rhetorical roles of sentences in the CRAFT corpus, a set of 97 full-text papers that we have annotated using the CISP schema.",
        "Hand alignment of the resulting annotations suggests that patterns in these CISP-annotated sentences correspond to common argumentative gambits in scientific writing."
      ]
    },
    {
      "heading": "2. Methods",
      "text": [
        "The CRAFT corpus is a set of 97 full-text papers describing the function of genes in the Mouse Genome",
        "Informatics database (Blake et al., 2011).",
        "These documents have already been annotated with syntactic information (parse trees and part-of-speech tags), linguistic phenomena (coreference), and semantic entities (genes, chemicals, cell lines, biological functions and molecular processes), making the corpus a rich resource for extracting or inferring information from full scientific papers.",
        "The CISP schema (Soldatova and Liakata, 2007; Liakata et al., 2009) contains 11 categories, and several of the categories describe the intentions of the authors, making it well suited for markup of argumentation.",
        "We chose to narrow these down to 9 categories (excluding Model and Object) during annotation training; our guidelines are shown in Figure 1.",
        "We expect this schema to describe the pragmatics in the text well, while still offering the potential for high interannotator agreement due to a manageable number of categories.",
        "The process of marking the sentences in the CRAFT corpus according to the CISP guidelines took one annotator about four months."
      ]
    },
    {
      "heading": "3. Results and Discussion",
      "text": [
        "Six of the 97 CRAFT papers do not follow the standard IMRaD paper structure (one was a review article, and five combined Results and Discussion); these documents were eliminated from this analysis.",
        "Annotation of the 91 remaining CRAFT papers resulted in 20676 sentences.",
        "The distribution of the annotated classes is shown in Table 1.",
        "Our use of the CISP schema exposes an approach for recovering two types of explanatory arguments.",
        "The first sets the context with a sequence of Background sentences, followed by a Hypothesis, Motivation, or Goal; this echoes a motif found by Swales (1990) and Teufel and Moens (1999).",
        "We also find another pattern that consists of a combination ofRe-sults and Observations, either preceded or followed by a Conclusion; Teufel and Moens (1999) also find exemplars of this maneuver, and note that it parallels Swales' notion of occupying a niche in the research world.",
        "Hand alignment of CISP annotations in Introduction and Result sections suggests that a finite state machine may be capable of modeling the transitions between CISP sentence types in these arguments, and machine learning approaches to represent these and other patterns with hidden Markov models or conditional random fields are underway.",
        "CISP Type",
        "Count",
        "Percentage",
        "Hypothesis",
        "1050",
        "5.08",
        "Goal",
        "992",
        "4.80",
        "Motivation",
        "928",
        "4.49",
        "Background",
        "2838",
        "13.73",
        "Method",
        "637",
        "3.08",
        "Experiment",
        "5270",
        "25.49",
        "Result",
        "5471",
        "26.46",
        "Observation",
        "1168",
        "5.65",
        "Conclusion",
        "2322",
        "11.23",
        "Total",
        "20676",
        "100.0"
      ]
    }
  ]
}
