{
  "info": {
    "authors": [
      "Xiaojiang Huang",
      "Xiaojun Wan",
      "Jianguo Xiao"
    ],
    "book": "Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies",
    "id": "acl-P11-2114",
    "title": "Comparative News Summarization Using Linear Programming",
    "url": "https://aclweb.org/anthology/P11-2114",
    "year": 2011
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Xiaojiang Huang Xiaojun Wan* Jianguo Xiao",
        "Institute of Computer Science and Technology, Peking University, Beijing 100871, China Key Laboratory of Computational Linguistic (Peking University), MOE, China",
        "{huangxiaojiang, wanxiaojun, xiaojianguo}@icst.pku.edu.cn",
        "Comparative News Summarization aims to highlight the commonalities and differences between two comparable news topics.",
        "In this study, we propose a novel approach to generating comparative news summaries.",
        "We formulate the task as an optimization problem of selecting proper sentences to maximize the comparativeness within the summary and the representativeness to both news topics.",
        "We consider semantic-related cross-topic concept pairs as comparative evidences, and consider topic-related concepts as representative evidences.",
        "The optimization problem is addressed by using a linear programming model.",
        "The experimental results demonstrate the effectiveness of our proposed model."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Comparative News Summarization aims to highlight the commonalities and differences between two comparable news topics.",
        "It can help users to analyze trends, draw lessons from the past, and gain insights about similar situations.",
        "For example, by comparing the information about mining accidents in Chile and China, we can discover what leads to the different endings and how to avoid those tragedies.",
        "Comparative text mining has drawn much attention in recent years.",
        "The proposed works differ in the domain of corpus, the source of comparison and the representing form of results.",
        "So far, most researches focus on comparing review opinions of products (Liu et al., 2005; Jindal and Liu, 2006a;",
        "* Corresponding author",
        "Jindal and Liu, 2006b; Lerman and McDonald, 2009; Kim and Zhai, 2009).",
        "A reason is that the aspects in reviews are easy to be extracted and the comparisons have simple patterns, e.g. positive vs. negative.",
        "A few other works have also tried to compare facts and views in news article (Zhai et al., 2004) and Blogs (Wang et al., 2009).",
        "The comparative information can be extracted from explicit comparative sentences (Jindal and Liu, or mined implicitly by matching up features of objects in the same aspects (Zhai et al., 2004; Liu 2006).",
        "The comparisons can be represented by charts (Liu et al., 2005), word clusters (Zhai et al., 2004), key phrases(Sun et al., 2006), and summaries which consist of pairs of sentences or text sections (Kim and Zhai, 2009; Lerman and McDonald, 2009; Wang et al., 2009).",
        "Among these forms, the comparative summary conveys rich information with good readability, so it keeps attracting interest in the research community.",
        "In general, document summarization can be performed by extraction or abstraction (Mani, 2001).",
        "Due to the difficulty of natural sentence generation, most automatic summarization systems are extraction-based.",
        "They select salient sentences to maximize the objective functions of generated summaries (Carbonell and Goldstein, 1998; McDonald, 2007; Lerman and 2009).",
        "The major difference between the traditional summarization task and the comparative summarization task is that traditional summarization task places equal emphasis on all kinds of information in the source, while comparative summarization task only focuses on the comparisons between objects.",
        "News is one of the most important channels for acquiring information.",
        "However, it is more difficult to extract comparisons in news articles than in reviews.",
        "The aspects are much diverse in news.",
        "They can be the time of the events, the person involved, the attitudes of participants, etc.",
        "These aspects can be expressed explicitly or implicitly in many ways.",
        "For example, \"storm\" and \"rain\" both talk about \"weather\", and thus they can form a potential comparison.",
        "All these issues raise great challenges to comparative summarization in the news domain.",
        "In this study, we propose a novel approach for comparative news summarization.",
        "We consider comparativeness and representativeness as well as redundancy in an objective function, and solve the optimization problem by using linear programming to extract proper comparable sentences.",
        "More specifically, we consider a pair of sentences comparative if they share comparative concepts; we also consider a sentence representative if it contains important concepts about the topic.",
        "Thus a good comparative summary contains important comparative pairs, as well as important concepts about individual topics.",
        "Experimental results demonstrate the effectiveness of our model, which outperforms the baseline systems in quality of comparison identification and summarization."
      ]
    },
    {
      "heading": "2. Problem Definition 2.1 Comparison",
      "text": [
        "A comparison identifies the commonalities or differences among objects.",
        "It basically consists of four components: the comparee (i.e. what is compared), the standard (i.e. to what the compare is compared), the aspect (i.e. the scale on which the comparee and standard are measured), and the result (i.e. the predicate that describes the positions of the comparee and standard).",
        "For example, \"Chile is richer than Haiti. \"",
        "is a typical comparison, where the comparee is \"Chile\"; the standard is \"Haiti\"; the comparative aspect is wealth, which is implied by \"richer\"; and the result is that Chile is superior to Haiti.",
        "A comparison can be expressed explicitly in a comparative sentence, or be described implicitly in a section of text which describes the individual characteristics of each object point-by-point.",
        "For example, the following text Haiti is an extremely poor country.",
        "Chile is a rich country.",
        "also suggests that Chile is richer than Haiti.",
        "The task of comparative news summarization is to briefly sum up the commonalities and differences between two comparable news topics by using human readable sentences.",
        "The summarization system is given two collections of news articles, each of which is related to a topic.",
        "The system should find latent comparative aspects, and generate descriptions of those aspects in a pairwise way, i.e. including descriptions of two topics simultaneously in each aspect.",
        "For example, when comparing the earthquake in Haiti with the one in Chile, the summary should contain the intensity of each temblor, the damages in each disaster area, the reactions of each government, etc.",
        "Formally, let t\\ and t2 be two comparable news topics, and D\\ and D2 be two collections of articles about each topic respectively.",
        "The task of comparative summarization is to generate a short abstract which conveys the important comparisons {< ti,t2,rn,T2i >}, where m and r2i are descriptions about topic t\\ and t2 in the same latent aspect ai respectively.",
        "The summary can be considered as a combination of two components, each of which is related to a news topic.",
        "It can also be subdivided into several sections, each of which focuses on a major aspect.",
        "The comparisons should have good quality, i.e., be clear and representative to both topics.",
        "The coverage of comparisons should be as wide as possible, which means the aspects should not be redundant because of the length limit."
      ]
    },
    {
      "heading": "3. Proposed Approach",
      "text": [
        "It is natural to select the explicit comparative sentences as comparative summary, because they express comparison explicitly in good qualities.",
        "However, they do not appear frequently in regular news articles so that the coverage is limited.",
        "Instead, it is more feasible to extract individual descriptions of each topic over the same aspects and then generate comparisons.",
        "To discover latent comparative aspects, we consider a sentence as a bag of concepts, each of which has an atom meaning.",
        "If two sentences have same concepts in common, they are likely to discuss the same aspect and thus they may be comparable with each other.",
        "For example, Lionel Messi named FIFA Word Player of the Year 2010.",
        "Cristiano Ronalo Crowned FIFA Word Player of the Year 2009.",
        "The two sentences compare on the \"FIFA Word Player of the Year\", which is contained in both sentences.",
        "Furthermore, semantic related concepts can also represent comparisons.",
        "For example, \"snow\" and \"sunny\" can indicate a comparison on \"weather\"; \"alive\" and \"death\" can imply a comparison on \"rescue result\".",
        "Thus the pairs of semantic related concepts can be considered as evidences of comparisons.",
        "A comparative summary should contain as many comparative evidences as possible.",
        "Besides, it should convey important information in the original documents.",
        "Since we model the text with a collection of concept units, the summary should contain as many important concepts as possible.",
        "An important concept is likely to be mentioned frequently in the documents, and thus we use the frequency as a measure of a concept's importance.",
        "Obviously, the more accurate the extracted concepts are, the better we can represent the meaning of a text.",
        "However, it is not easy to extract semantic concepts accurately.",
        "In this study, we use words, named entities and bigrams to simply represent concepts, and leave the more complex concept extraction for future work.",
        "Based on the above ideas, we can formulate the summarization task as an optimization problem.",
        "Formally, let Ci = {cij } be the set of concepts in the document set Di, (i = 1, 2).",
        "Each concept cij has a weight wij G R. ocij G {0,1} is a binary variable indicating whether the concept cij is presented in the summary.",
        "A cross-topic concept pair < c\\j, c2k > has a weight Ujk G R that indicates whether it implies a important comparison.",
        "opjk is a binary variable indicating whether the pair is presented in the summary.",
        "Then the objective function score of a comparative summary can be estimated as follows:",
        "The first component of the function estimates the comparativeness within the summary and the second component estimates the representativeness to both topics.",
        "A G [0,1] is a factor that balances these two factors.",
        "In this study, we set A = 0.55.",
        "The weights of concepts are calculated as follows:",
        "where tfij is the term frequency of the concept cij in the document set Di, and idfij is the inverse document frequency calculated over a background corpus.",
        "The weights of concept pairs are calculated as follows:",
        "where rel(cij,c2k) is the semantic relevance between two concepts, and it is calculated using the algorithms basing on WordNet (Pedersen et al., 2004).",
        "If the relevance is higher than the threshold t (0.2 in this study), then the concept pair is considered as an evidence of comparison.",
        "Note that a concept pair will not be presented in the summary unless both the concepts are presented, i.e.",
        "opjk < ocij opjk < oc2k",
        "In order to avoid bias towards the concepts which have more related concepts, we only count the most important relation of each concept, i.e.",
        "The algorithm selects proper sentences to maximize the objective function.",
        "Formally, let Si = {sik} be the set of sentences in Di, ocsijk be a binary variable indicating whether concept cij occurs in sentence sik, and osik be a binary variable indicating whether sik is presented in the summary.",
        "If sik is selected in the summary, then all the concepts in it are presented in the summary, i.e.",
        "Meanwhile, a concept will not be present in the summary unless it is contained in some selected sentences, i.e.",
        "ocij < ocsijk • osik",
        "Finally, constraint:",
        "the summary should satisfy a length where lik is the length of sentence sik, and L is the maximal summary length.",
        "The optimization of the defined objective function under above constraints is an integer linear programming (ILP) problem.",
        "Though the ILP problems are generally NP-hard, considerable works have been done and several software solutions have been released to solve them efficiently."
      ]
    },
    {
      "heading": "4. Experiment",
      "text": [
        "Because of the novelty of the comparative news summarization task, there is no existing data set for evaluating.",
        "We thus create our own.",
        "We first choose five pairs of comparable topics, then retrieve ten related news articles for each topic using the Google News search engine.",
        "Finally we write the comparative summary for each topic pair manually.",
        "The topics are showed in table 1.",
        "We evaluate the models with following measures: Comparison Precision / Recall / F-measure:",
        "let aa and am be the numbers of all aspects involved in the automatically generated summary and manually written summary respectively; ca be the number of human agreed comparative aspects in the automatically generated summary.",
        "The comparison precision (CP), comparison recall (CR) and comparison F-measure (CF) are defined as follows:",
        "Ca .",
        "ROUGE: the ROUGE is a widely used metric in summarization evaluation.",
        "It measures summary quality by counting overlapping units between the candidate summary and the reference summary (Lin and Hovy, 2003).",
        "In the experiment, we report the f-measure values of ROUGE-1, ROUGE-2 and ROUGE-SU4, which count overlapping unigrams, bigrams and skip-4-grams respectively.",
        "To evaluate whether the summary is related to both topics, we also split each comparative summary into two topic-related parts, evaluate them respectively, and report the mean of the two ROUGE values (denoted as MROUGE).",
        "Non-Comparative Model (NCM): The non-comparative model treats the task as a traditional summarization problem and selects the important sentences from each document collection.",
        "The model is adapted from our approach by setting X = 0 in the objection function 1.",
        "Co-Ranking Model (CRM): The co-ranking model makes use of the relations within each topic and relations across the topics to reinforce scores of the comparison related sentences.",
        "The model is adapted from (Wan et al., 2007).",
        "The SS, WW and SW relationships are replaced by relationships between two sentences within each topic and relationships between two sentences from different topics.",
        "ID",
        "Topic 1",
        "Topic 2",
        "1",
        "Haiti Earth quake",
        "Chile Earthquake",
        "2",
        "Chile Mining Acci-",
        "New Zealand Mining",
        "dent",
        "Accident",
        "3",
        "Iraq Withdrawal",
        "Afghanistan",
        "Withdrawal",
        "4",
        "Apple iPad 2",
        "BlackBerry Playbook",
        "5",
        "2006 FIFA World Cup",
        "2010 FIFA World Cup",
        "We apply all the systems to generate comparative summaries with a length limit of 200 words.",
        "The evaluation results are shown in table 2.",
        "Compared with baseline models, our linear programming based comparative model (denoted as LPCM) achieves best scores over all metrics.",
        "It is expected to find that the NCM model does not perform well in this task because it does not focus on the comparisons.",
        "The CRM model utilizes the similarity between two topics to enhance the score of comparison related sentences.",
        "However, it does not guarantee to choose pairwise sentences to form comparisons.",
        "The LPCM model focus on both comparativeness and representativeness at the same time, and thus it achieves good performance on both comparison extraction and summarization.",
        "Figure 1 shows an example of comparative summary generated by using the CLPM model.",
        "The summary describes several comparisons between two FIFA World Cups in 2006 and 2010.",
        "Most of the comparisons are clear and representative."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "In this study, we propose a novel approach to summing up the commonalities and differences between two news topics.",
        "We formulate the task as an optimization problem of selecting sentences to maximize the score of comparative and representative evidences.",
        "The experiment results show that our model is effective in comparison extraction and summarization.",
        "In future work, we will utilize more semantic information such as localized latent topics to help capture comparative aspects, and use machine learning technologies to tune weights of concepts."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "Beijing Nova Program (2008B03) and NCET (NCET-08-0006).",
        "The 2006 Fifa World Cup drew to a close on Sunday with Italy claiming their fourth crown after beating France in a penalty shoot-out.",
        "Zidane won the Golden Ball over Italians Fabio Cannavaro and Andrea Pirlo.",
        "Lukas Podolski was named the inaugural Gillette Best Young Player.",
        "Germany striker Miroslav Klose was the Golden Shoe winner for the tournament's leading scorer.",
        "England's fans brought more colour than their team.",
        "Spain have won the 2010 FIFA World Cup South Africa final, defeating Netherlands 1-0 with a wonderful goal from Andres Iniesta deep into extra-time.",
        "Uruguay star striker Diego Forlan won the Golden",
        "Ball Award as he was named the best player of the tournament at the FIFA World Cup 2010 in South",
        "Africa.",
        "German youngster Thomas Mueller got double delight after his side finished third in the tournament as he was named Young Player of the World Cup",
        "Among the winners were goalkeeper and captain Iker",
        "Casillas who won the Golden Glove Award.",
        "Only four of the 212 matches played drew more that 40,000 fans."
      ]
    }
  ]
}
