{
  "info": {
    "authors": [
      "Yue Zhang",
      "Joakim Nivre"
    ],
    "book": "Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies",
    "id": "acl-P11-2033",
    "title": "Transition-based Dependency Parsing with Rich Non-local Features",
    "url": "https://aclweb.org/anthology/P11-2033",
    "year": 2011
  },
  "references": [
    "acl-D07-1013",
    "acl-D07-1101",
    "acl-D07-1111",
    "acl-D07-1123",
    "acl-D08-1016",
    "acl-D08-1059",
    "acl-D09-1127",
    "acl-E06-1011",
    "acl-P05-1012",
    "acl-P09-1039",
    "acl-P10-1110",
    "acl-W02-1001",
    "acl-W06-0121",
    "acl-W06-2933",
    "acl-W07-2218",
    "acl-W09-3825"
  ],
  "sections": [
    {
      "text": [
        "Yue Zhang Joakim Nivre",
        "Computer Laboratory Department of Linguistics and Philology",
        "yue.zhang@cl.cam.ac.uk j oakim.nivre@lingfil.uu.se",
        "Transition-based dependency parsers generally use heuristic decoding algorithms but can accommodate arbitrarily rich feature representations.",
        "In this paper, we show that we can improve the accuracy of such parsers by considering even richer feature sets than those employed in previous systems.",
        "In the standard Penn Treebank setup, our novel features improve attachment score form 91.4% to 92.9%, giving the best results so far for transition-based parsing and rivaling the best results overall.",
        "For the Chinese Treebank, they give a significant improvement of the state of the art.",
        "An open source release of our parser is freely available."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Transition-based dependency parsing (Yamada and Matsumoto, 2003; Nivre et al., 2006b; Zhang and Clark, 2008; Huang and Sagae, 2010) utilize a deterministic shift-reduce process for making structural predictions.",
        "Compared to graph-based dependency parsing, it typically offers linear time complexity and the comparative freedom to define non-local features, as exemplified by the comparison between MaltParser and MSTParser (Nivre et al., 2006b; McDonald et al., 2005; McDonald and Nivre, 2007).",
        "Recent research has addressed two potential disadvantages of systems like MaltParser.",
        "In the aspect of decoding, beam-search (Johansson and al., 2009) and partial dynamic-programming (Huang and Sagae, 2010) have been applied to improve upon greedy one-best search, and positive results were reported.",
        "In the aspect of training, global structural learning has been used to replace local learning on each decision (Zhang and Clark, 2008; Huang et al., 2009), although the effect of global learning has not been separated out and studied alone.",
        "In this short paper, we study a third aspect in a statistical system: feature definition.",
        "Representing the type of information a statistical system uses to make predictions, feature templates can be one of the most important factors determining parsing accuracy.",
        "Various recent attempts have been made to include non-local features into graph-based dependency parsing (Smith and Eisner, 2008; Martins et al., 2009; Koo and Collins, 2010).",
        "Transition-based parsing, by contrast, can easily accommodate arbitrarily complex representations involving nonlocal features.",
        "Complex non-local features, such as bracket matching and rhythmic patterns, are used in transition-based constituency parsing (Zhang and Clark, 2009; Wang et al., 2006), and most transition-based dependency parsers incorporate some nonlocal features, but current practice is nevertheless to use a rather restricted set of features, as exemplified by the default feature models in MaltParser (Nivre et al., 2006a).",
        "We explore considerably richer feature representations and show that they improve parsing accuracy significantly.",
        "In standard experiments using the Penn Treebank, our parser gets an unlabeled attachment score of 92.9%, which is the best result achieved with a transition-based parser and comparable to the state of the art.",
        "For the Chinese Treebank, our parser gets a score of 86.0%, the best reported result so far."
      ]
    },
    {
      "heading": "2. The Transition-based Parsing Algorithm",
      "text": [
        "In a typical transition-based parsing process, the input words are put into a queue and partially built structures are organized by a stack.",
        "A set of shift-reduce actions are defined, which consume words from the queue and build the output parse.",
        "Recent research have focused on action sets that build projective dependency trees in an arc-eager (Nivre et al., 2006b; Zhang and Clark, 2008) or arc-standard (Yamada and Matsumoto, 2003; Huang and Sagae, 2010) process.",
        "We adopt the arc-eager system, for which the actions are:",
        "• Shift, which removes the front of the queue and pushes it onto the top of the stack;",
        "• Reduce, which pops the top item off the stack;",
        "• Le ft Arc, which pops the top item off the stack, and adds it as a modifier to the front of the queue;",
        "• RightArc, which removes the front of the queue, pushes it onto the stack and adds it as a modifier to the top of the stack.",
        "Further, we follow Zhang and Clark (2008) and Huang et al.",
        "(2009) and use the generalized percep-tron (Collins, 2002) for global learning and beam-search for decoding.",
        "Unlike both earlier global-learning parsers, which only perform unlabeled parsing, we perform labeled parsing by augmenting the Le ft Arc and RightArc actions with the set of dependency labels.",
        "Hence our work is in line with Titov and Henderson (2007) in using labeled transitions with global learning.",
        "Moreover, we will see that label information can actually improve link accuracy."
      ]
    },
    {
      "heading": "3. Feature Templates",
      "text": [
        "At each step during a parsing process, the parser configuration can be represented by a tuple (S, N, A), where S is the stack, N is the queue of incoming words, and A is the set of dependency arcs that have been built.",
        "Denoting the top of stack",
        "'it is very likely that the type of features explored in this paper would be beneficial also for the arc-standard system, although the exact same feature templates would not be applicable because of differences in the parsing order.",
        "from single words from word pairs",
        "SowpNowp; SowpNow; SpwNpwp; SpwpNpp; SppNpwp; SqwNqw; SppNpp",
        "from three words",
        "N0pNlPN2p; SopNopNlP; SQhpS0pN0p; SppSpipNop; SppSprpNop; S0pNopN0ip",
        "Table 1 : Baseline feature templates.",
        "w - word; p - pos-tag.",
        "distance",
        "Spwd; Sopd; Npwd; Nopd; SowNowd; SppNppd; S0wvr; S0pvr; Spwvn Sppvy, Npwvn Nppvn unigrams Sohw: SohP; Spl; Soiw; Soip; Soil;",
        "third-order label set",
        "Table 2: New feature templates.",
        "w - word; p - pos-tag; v\\, vr - valency; I dependency label, si, sr - labelset.",
        "with S*o, the front items from the queue with A^o, A^i, and N2, the head of So (if any) with Sph, the leftmost and rightmost modifiers of So (if any) with Spi and Spr, respectively, and the leftmost modifier of A^o (if any) with Npi, the baseline features are shown in Table 1.",
        "These features are mostly taken from Zhang and Clark (2008) and Huang and Sagae (2010), and our parser reproduces the same accuracies as reported by both papers.",
        "In this table, w and p represents the word and pos-tag, respectively.",
        "For example, SppNpwp represents the feature template that takes the word and pos-tag of A^, and combines it with the word of So.",
        "In this short paper, we extend the baseline feature templates with the following:",
        "Distance between So and No",
        "Direction and distance between a pair of head and modifier have been used in the standard feature templates for maximum spanning tree parsing (McDonald et al., 2005).",
        "Distance information has also been used in the easy-first parser of (Goldberg and Elhadad, 2010).",
        "For a transition-based parser, direction information is indirectly included in the LeftArc and RightArc actions.",
        "We add the distance between S0 and N0 to the feature set by combining it with the word and pos-tag of S0 and N0, as shown in Table 2.",
        "It is worth noticing that the use of distance information in our transition-based model is different from that in a typical graph-based parser such as MSTParser.",
        "The distance between S0 and N0 will correspond to the distance between a pair of head and modifier when an LeftArc action is taken, for example, but not when a Shift action is taken.",
        "Valency of S0 and N0",
        "The number of modifiers to a given head is used by the graph-based submodel of Zhang and Clark",
        "Sagae and Tsujii (2007).",
        "We include similar information in our model.",
        "In particular, we calculate the number of left and right modifiers separately, calling them left valency and right valency, respectively.",
        "Left and right valencies are represented by viand vrin Table 2, respectively.",
        "They are combined with the word and pos-tag of S0 and N0 to form new feature templates.",
        "Again, the use of valency information in our transition-based parser is different from the aforementioned graph-based models.",
        "In our case, valency information is put into the context of the shift-reduce process, and used together with each action to give a score to the local decision.",
        "Unigram information for S0h, S0i, S0r and N0i",
        "The head, left/rightmost modifiers of S0 and the leftmost modifier of N0 have been used by most arc-eager transition-based parsers we are aware of through the combination of their pos-tag with information from S0 and N0.",
        "Such use is exemplified by the feature templates \"from three words\" in Table 1.",
        "We further use their word and pos-tag information as \"unigram\" features in Table 2.",
        "Moreover, we include the dependency label information in the unigram features, represented by l in the table.",
        "Unigram label information has been used in MaltParser (Nivre et al., 2006a; Nivre, 2006).",
        "Third-order features of S0 and N0 Higher-order context features have been used by graph-based dependency parsers to improve accuracies (Carreras, 2007; Koo and Collins, 2010).",
        "We include information of third order dependency arcs in our new feature templates, when available.",
        "In Table 2, S0h2, S012, S0r2 and N012 refer to the head of S0h, the second leftmost modifier and the second rightmost modifier of S0, and the second leftmost modifier of N0, respectively.",
        "The new templates include unigram word, pos-tag and dependency labels of S0/12, S012, S0r2 and N012, as well as pos-tag combinations with S0 and N0.",
        "Set of dependency labels with S0 and N0 As a more global feature, we include the set of unique dependency labels from the modifiers of S0and N0.",
        "This information is combined with the word and pos-tag of S0 and N0 to make feature templates.",
        "In Table 2, si and sr stands for the set of labels on the left and right of the head, respectively."
      ]
    },
    {
      "heading": "4. Experiments",
      "text": [
        "Our experiments were performed using the Penn Treebank (ptb) and Chinese Treebank (ctb) data.",
        "We follow the standard approach to split ptb3, using sections 2-21 for training, section 22 for development and 23 for final testing.",
        "Bracketed sentences from ptb were transformed into dependency formats using the Penn2Malt tool.",
        "Following Huang and Sagae (2010), we assign pos-tags to the training data using ten-way jackknifing.",
        "We used our implementation of the Collins (2002) tagger (with 97.3% accuracy on a standard Penn Treebank test) to perform pos-tagging.",
        "For all experiments, we set the beam size to 64 for the parser, and report unlabeled and labeled attachment scores (UAS, LAS) and un-labeled exact match (UEM) for evaluation.",
        "Table 3: The effect of new features on the development set for English.",
        "UAS = unlabeled attachment score; UEM = unlabeled exact match.",
        "Table 4: Final test accuracies for English.",
        "UAS = unla-beled attachment score; UEM = unlabeled exact match; LAS = labeled attachment score.",
        "Table 3 shows the effect of new features on the development test data for English.",
        "We start with the baseline features in Table 1, and incrementally add the distance, valency, unigram, third-order and label set feature templates in Table 2.",
        "Each group of new feature templates improved the accuracies over the previous system, and the final accuracy with all new features was 93.14% in unlabeled attachment score.",
        "Table 4 shows the final test results of our parser for English.",
        "We include in the table results from the pure transition-based parser of Zhang and Clark (2008) (row 'Z&C08 transition'), the dynamic-programming arc-standard parser of Huang and Sagae (2010) (row 'H&S10'), and graph-based models including MSTParser (McDonald and Pereira, 2006), the baseline feature parser of Koo et al.",
        "(2008) (row 'K08 baeline'), and the two models of Koo and Collins (2010).",
        "Our extended parser significantly outperformed the baseline parser, achiev-",
        "Table 5: Final test accuracies for Chinese.",
        "UAS = unla-beled attachment score; UEM = unlabeled exact match; LAS = labeled attachment score.",
        "ing the highest attachment score reported for a transition-based parser, comparable to those of the best graph-based parsers.",
        "Our experiments were performed on a Linux platform with a 2GHz CPU.",
        "The speed of our baseline parser was 50 sentences per second.",
        "With all new features added, the speed dropped to 29 sentences per second.",
        "As an alternative to Penn2Malt, bracketed sentences can also be transformed into Stanford dependencies (De Marneffe et al., 2006).",
        "Our parser gave trained and evaluated on Stanford basic dependencies, which are projective dependency trees.",
        "Cer et al.",
        "(2010) report results on Stanford collapsed dependencies, which allow a word to have multiple heads and therefore cannot be produced by a regular dependency parser.",
        "Their results are relevant although not directly comparable with ours.",
        "Table 5 shows the results of our final parser, the pure transition-based parser of Zhang and Clark (2008), and the parser of Huang and Sagae (2010) on Chinese.",
        "We take the standard split of ctb and use gold segmentation and pos-tags for the input.",
        "Our scores for this test set are the best reported so far and significantly better than the previous systems."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "We have shown that enriching the feature representation significantly improves the accuracy of our transition-based dependency parser.",
        "The effect of the new features appears to outweigh the effect of combining transition-based and graph-based models, reported by Zhang and Clark (2008), as well as the effect of using dynamic programming, as in-Huang and Sagae (2010).",
        "This shows that feature definition is a crucial aspect of transition-based parsing.",
        "In fact, some of the new feature templates in this paper, such as distance and valency, are among those which are in the graph-based submodel of Zhang and Clark (2008), but not the transition-based submodel.",
        "Therefore our new features to some extent achieved the same effect as their model combination.",
        "The new features are also hard to use in dynamic programming because they add considerable complexity to the parse items.",
        "feature",
        "UAS",
        "UEM",
        "baseline",
        "92.18%",
        "45.76%",
        "+distance",
        "92.25%",
        "46.24%",
        "+valency",
        "92.49%",
        "47.65%",
        "+unigrams",
        "92.89%",
        "48.47%",
        "+third-order",
        "93.07%",
        "49.59%",
        "+label set",
        "93.14%",
        "50.12%",
        "UAS",
        "UEM",
        "LAS",
        "Z&C08 transition H&S10",
        "this paper extended",
        "84.3% 85.2% 86.0%",
        "32.8% 33.7% 36.9%",
        "84.4%",
        "UAS",
        "UEM",
        "LAS",
        "Z&C08 transition",
        "91.4%",
        "41.8%",
        " – ",
        "H&S10",
        "91.4%",
        " – ",
        " – ",
        "this paper baseline",
        "91.4%",
        "42.5%",
        "90.1%",
        "this paper extended",
        "92.9%",
        "48.0%",
        "91.8%",
        "MSTParser",
        "91.5%",
        "42.5%",
        " – ",
        "K08 standard",
        "92.0%",
        " – ",
        " – ",
        "K&C 10 model 1",
        "93.0%",
        " – ",
        " – ",
        "K&C10model2",
        "92.9%",
        " – ",
        " – ",
        "Enriched feature representations have been studied as an important factor for improving the accuracies of graph-based dependency parsing also.",
        "Recent research including the use of loopy belief network (Smith and Eisner, 2008), integer linear programming (Martins et al., 2009) and an improved dynamic programming algorithm (Koo and Collins, 2010) can be seen as methods to incorporate nonlocal features into a graph-based model.",
        "An open source release of our parser, together with trained models for English and Chinese, are freely available."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We thank the anonymous reviewers for their useful comments.",
        "Yue Zhang is supported by the European Union Seventh Framework Programme (FP7-ICT-2009-4) under grant agreement no.",
        "247762."
      ]
    }
  ]
}
