{
  "info": {
    "authors": [
      "Muhammad Abdul-Mageed",
      "Mona Diab"
    ],
    "book": "Proceedings of the 5th Linguistic Annotation Workshop",
    "id": "acl-W11-0413",
    "title": "Subjectivity and Sentiment Annotation of Modern Standard Arabic Newswire",
    "url": "https://aclweb.org/anthology/W11-0413",
    "year": 2011
  },
  "references": [
    "acl-C04-1200",
    "acl-J94-2004",
    "acl-P99-1032",
    "acl-W06-2915",
    "acl-W09-3012",
    "acl-W10-1401"
  ],
  "sections": [
    {
      "text": [
        "Subjectivity and Sentiment Annotation of Modern Standard Arabic",
        "Newswire",
        "Mona T. Diab",
        "Center for Computational Learning Systems, Columbia University, NYC, USA",
        "Subjectivity and sentiment analysis (SSA) is an area that has been witnessing a flurry of novel research.",
        "However, only few attempts have been made to build SSA systems for morphologically-rich languages (MRL).",
        "In the current study, we report efforts to partially bridge this gap.",
        "We present a newly labeled corpus of Modern Standard Arabic (MSA) from the news domain manually annotated for subjectivity and domain at the sentence level.",
        "We summarize our linguistically-motivated annotation guidelines and provide examples from our corpus exemplifying the different phenomena.",
        "Throughout the paper, we discuss expression of subjectivity in natural language, combining various previously scattered insights belonging to many branches of linguistics."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "As the volume of web data continues to phenomenally increase, researchers are becoming more interested in mining that data and making the information therein accessible to end-users in various innovative ways.",
        "As a result, searches and processing of data beyond the limiting level of surface words are becoming increasingly important (Diab et al., 2009).",
        "The sentiment expressed in Web data specifically continues to be of high interest and value to internet users, businesses, and governmental bodies.",
        "Thus, the area of Subjectivity and sentiment analysis (SSA) has been witnessing a flurry of novel research.",
        "Subjectivity in natural language refers to aspects of language used to express opinions, feelings, evaluations, and speculations (Banfield, 1982; Wiebe, 1994) and it, thus, incorporates sentiment.",
        "The process of subjectivity classification refers to the task of classifying texts into either Objective (e.g., More than 1000 tourists have visited Tahrir Square, in downtown Cairo, last week.)",
        "or Subjective.",
        "Subjective text is further classified with sentiment or polarity.",
        "For sentiment classification, the task refers to identifying whether a subjective text is positive (e.g., The Egyptian revolution was really impressive!",
        "), negative (e.g., The bloodbaths that took place in Tripoli were horrifying!",
        "), neutral (e.g., The company may release the software next month.",
        "), and, sometimes, mixed (e.g., I really like this labtop, but it is prohibitively expensive.).",
        "SSA sometimes incorporates identifying the holder(s), target(s), and strength (e.g., low, medium, high) of the expressed sentiment.",
        "In spite of the great interest in SSA, only few studies have been conducted on morphologically-rich languages (MRL) (i.e., languages in which significant information concerning syntactic units and relations are expressed at the word-level (Tsarfaty et al., 2010)).",
        "Arabic, Hebrew, Turkish, Czech, and Basque are examples of MRLs.",
        "SSA work on MRLs has been hampered by lack of annotated data.",
        "In the current paper we report efforts to manually annotate a corpus of Modern Standard Arabic (MSA), a morphologically-rich variety of Arabic, e.g., (Diab et al., 2007; Habash et al., 2009).",
        "The corpus is a collection of documents from the newswire genre covering several domains such as politics and sports.",
        "We label the data at the sentence level.",
        "Our annotation guidelines explicitly incorporate linguistically-motivated information.",
        "The rest of the paper is organized as follows: In Section 2, we motivate work on the news genre.",
        "In Section 3, we summarize our linguistically-motivated annotation guidelines.",
        "In Section 4, we introduce the domain annotation task.",
        "In Section 5 we provide examples from our dataset.",
        "We present related work in Section 6.",
        "We conclude in Section 7."
      ]
    },
    {
      "heading": "2. Subjectivity and Sentiment in the News",
      "text": [
        "Most work on SSA has been conducted on data belonging to highly subjective, user-generated genres such as blogs and product or movie reviews where authors express their opinions quite freely (Balahur and Steinberger, 2009).",
        "In spite of the important role news play in our lives (e.g., as an influencer of the social construction of reality (Fowler, 1991), (Chouliaraki and Fairclough, 1999), (Wodak and Meyer, 2009)), the news genre has received much less attention within the SSA community.",
        "This role of news and the connection between news-making and social contexts and practices motivates the task of building SSA system.",
        "In addition, the many novel ways online news-making is becoming an interactive process (Abdul-Mageed, 2008) further motivates investigating the newswire genre.",
        "News-makers reproduce some of the views of their readers (e.g., by quoting them) and they devote full stories about the interactions of web users on social media outlets.",
        "Although subjectivity in news articles has traditionally tended to be implicit, the fact that news stories have their own biases (e.g., hiding agents behind negative or positive events via use of passive voice, variation in lexical choice) has been pointed out by e.g., (Van Dijk, 1988).",
        "The growing trend to foster interactivity and more heavily report communication of internet users within the body of news articles is likely to make expression of subjectivity in news articles more explicit."
      ]
    },
    {
      "heading": "3. Subjectivity and Sentiment Annotation",
      "text": [
        "Two graduate level educated native speakers of Arabic annotated 2855 sentences from Part 1 V 3.0 of",
        "'This trend has increased especially in Arab news organizations like Al-Jazeera and Al-Arabiya with the hightened attention to social media as a result of ongoing revolutions and protests in the Arab world",
        "the Penn Arabic TreeBank (PATB) (Maamouri et al., 2004).",
        "The sentences make up the first 400 documents of that part of PATB amounting to a total of 54.5% of the PATB Part 1 data set.",
        "The task was to annotate MSA news articles at the sentence level.",
        "Each article has been processed such that coders are provided sentences to label.",
        "We prepared annotation guidelines for this SSA task focusing specifically on the newswire genre.",
        "We summarize the guidelines next, illustrating related and relevant literature.",
        "For each sentence, each annotator assigned one of 4 possible labels: (1) Objective (OBJ), (2) Subjective-",
        "Positive (S-POS), (3) Subjective-Negative (S-NEG), and (4) Subjective-Neutral (S-NEUT).",
        "We followed (Wiebe et al., 1999) in operationalizing the subjective vs. the objective categories.",
        "In other words, if the primary goal of a sentence is perceived to be the objective reporting of information, it was labeled OBJ.",
        "Otherwise, a sentence would be a candidate for one of the three subjective classes.",
        "Table 1 shows the contingency table for the two annotators judgments.",
        "Overall agreement is 88.06%, with a Kappa (k) value of 0.38.",
        "To illustrate, a sentence such as \"The Prime Minister announced that he will visit the city, saying that he will be glad to see the injured\", has two authors (the story writer and the Prime Minister indirectly quoted).",
        "Accordingly to our guidelines, this sentence should be annotated S-POS tag since the part related to the person quoted (the Prime Minister) expresses a positive subjective sentiment, \"glad\" which is a private state (i.e., a state that is not subject to direct verification) (Quirk et al., 1974).",
        "OBJ",
        "S-POS",
        "S-NEG",
        "S-NEUT",
        "Total",
        "OBJ",
        "1192",
        "21",
        "57",
        "11",
        "1281",
        "S-POS",
        "47",
        "439",
        "2",
        "3",
        "491",
        "S-NEG",
        "69",
        "0",
        "614",
        "6",
        "689",
        "S-NEUT",
        "115",
        "2",
        "9",
        "268",
        "394",
        "Total",
        "1423",
        "462",
        "682",
        "288",
        "2855",
        "News can be good or bad.",
        "For example, whereas \"Five persons were killed in a car accident\" is bad news, \"It is sunny and warm today in Chicago\" is good news.",
        "Our coders were instructed not to consider good news positive nor bad news negative if they think the sentences expressing them are objectively reporting information.",
        "Thus, bad news and good news can be OBJ as is the case in both examples.",
        "Some sentences are written from a certain perspective (Lin et al., 2006) or point of view.",
        "Consider the two sentences (1) \"Israeli soldiers, our heroes, are keen on protecting settlers\" and (2) \"Palestinian freedom fighters are willing to attack these Israeli targets\".",
        "Sentence (1) is written from an Israeli perspective, while sentence (2) is written from a Palestinian perspective.",
        "The perspective from which a sentence is written interplays with how sentiment is assigned.",
        "Sentence (1) is considered positive from an Israeli perspective, yet the act of protecting settlers is considered negative from a Palestinian perspective.",
        "Similarly, attacking Israeli targets may be positive from a Palestinian vantage point, but will be negative from an Israeli perspective.",
        "Coders were instructed to assign a tag based on their understanding of the type of sentiment, if any, the author of a sentence is trying to communicate.",
        "Thus, we have tagged the sentences from the perspective of their authors.",
        "As it is easy for a human to identify the perspective of an author (Lin et al., 2006), this measure facilitated the annotation task.",
        "Thus, knowing that the sentence (1) is written from an Israeli perspective the annotator assigns it a S-POS tag.",
        "Epistemic modality serves to reveal how confident writers are about the truth of the ideational material they convey (Palmer, 1986).",
        "Epistemic modality is classified into hedges and boosters.",
        "Hedges are devices like perhaps and I guess that speakers employ to reduce the degree of liability or responsibility they might face in expressing the ideational material.",
        "Boosters are elements like definitely, I assure that, and of course that writers or speakers use to emphasize what they really believe.",
        "Both hedges and boosters can (1) turn a given unit of analsysis from objective into subjective and (2) modify polarity (i.e., either strengthen or weaken it).",
        "Consider, for example, the sentences (1) \"Gaddafi has murdered hundreds of people\", (2) \"Gaddafi may have murdered hundreds of people\", and (3) \"Unfortunately, Gaddafi has definitely murdered hundreds of people\".",
        "While (1) is OBJ, since it lacks any subjectivity cues), (2) is S-NEUT because the proposition is not presented as a fact but rather is softened and hence offered as subject to counter-argument, (3) is a strong S-NEG (i.e., it is S-NEG as a result of the use of \"unfortnately\", and strong due to the use of the booster definitely).",
        "Our annotators were explicitly alerted to the ways epistemic modality markers interact with subjectivity.",
        "Occurrences of language expressing (e.g. apologies, congratulations, praise, etc.",
        "are referred to as il-locutionary speech acts (ISA) (Searle, 1975).",
        "We believe that ISAs are relevant to the expression of sentiment in natural language.",
        "For example, the two categories expressives (e.g., congratulating, thanking, apologizing and commisives (e.g., promising) of (Searle, 1975)'s taxonomy of ISAs are specially relevant to SSA.",
        "In addition, (Bach and Harnish, 1979) define an ISA as a medium of communicating attitude and discuss ISAs like banning, bidding, indicting, penalizing, assessing and convicting.",
        "For example, the sentence \"The army should never do that again\" is a banning act and hence is S-NEG.",
        "Although our coders were not required to assign ISA tags to the sentences, we have brought the the concept of ISAs to their attention as we believe a good understanding of the concept facilitates annotating data for SSA.",
        "The type of sentiment expressed may vary based on the type of background knowledge of an annotator/reader (Balahur and Steinberger, 2009).",
        "For example, the sentence \"Secularists will be defeated\", may be positive to a reader who opposes secularism.",
        "However, if the primary intention of the author is judged to be communicating negative sentiment, annotators are supposed to assign a S-NEG tag.",
        "In general, annotators have been advised to avoid interpreting the subjectivity of text based on their own economic, social, religious, cultural, etc.",
        "background knowledge."
      ]
    },
    {
      "heading": "4. Domain Annotation",
      "text": [
        "The same two annotators also manually assigned each sentence a domain label.",
        "The domain labels are from the news genre and are adopted from (Abdul-Mageed, 2008).",
        "The set of domain labels is as follows: {Light news, Military and political violence, Sport, Politics, Crime, Economy, Disaster, Arts and culture, This day in history}.",
        "Table 2 illustrates the number of sentences deemed for each domain.",
        "Domain annotation is an easier task than subjectivity annotation.",
        "Inter-annotator agreement for domain label assignment is at 97%.",
        "The two coders discussed differences and a total agreement was eventually reached.",
        "Coders disagreed most on cases belonging to the Military and political violence and Politics domains.",
        "For example, the following is a case where the two raters disagreed (and which was eventutally assigned a Military and political violence domain):",
        "Transliteration: Tlb r}ys AlwzrA' AlsAbq fy jzr fydjy mAhndrA $wdry Al*y OTyH bh fy 19 OyAr mAyw Ivr Hrkp AnqlAbyp, Alywm Alsbt bIEAdp",
        "Hkwmth IlY AlslTp.",
        "English: Former Prime Minister of Fiji Mahendra Chaudhry, who was ousted in May 19 after a revolutionary movement, asked on Saturday to return to office."
      ]
    },
    {
      "heading": "5. Examples of SSA categories from MSA news",
      "text": [
        "We illustrate examples of each category in our annotation scheme.",
        "We also show and discuss examples for each category where the annotators differed in their annotations.",
        "Importantly, the two annotators discussed and adjudicated together the differences.",
        "Sentences where no opinion, sentiment, speculation, etc.",
        "is expressed are tagged as OBJ.",
        "Typically such sentences relay factual information, potentially expressed by an official source, like examples 1-3 below:",
        "Transliteration: wyblg Edd Alm$rdyn fy kwntyp lws Onjlys nHw 84 Olf $xS.",
        "English: The number of homeless in Los Angeles County is about 48 thousand.",
        "fjArA msA' Alywm Alsbt fy wzArp AlAstxbArAt Hyv.",
        "AstdEyt AlEdyd mn syArAt AlIsEAf kmA Okd $Ahd EyAn lwkAlp frAns brs.",
        "Domain",
        "# of Cases",
        "Politics",
        "1186",
        "Sports",
        "530",
        "Military & political violence",
        "435",
        "Disaster",
        "228",
        "Economy",
        "208",
        "Culture",
        "78",
        "Light news",
        "72",
        "Crime",
        "62",
        "This day in history",
        "56",
        "Total",
        "2855",
        "English:Tehran 15-7 (AFP) - An eye witness affirmed to AFP that 16 explosions occurred late Saturday at the Ministry of Intelligence where many ambulances were summoned.",
        "Al$bAb fy mTlE AltsEynyAt.",
        "English: Previously, Campos, who acted as the coach of Al Rayyan in Qatar last season, coached Al Shabab in the early nineties.",
        "Transliteration: AEln AlsA}q AlIyrlndy Iydy IyrfAyn ( jAgwAr ) {nsHAbh mn sbAq jA}zp AlnmsA AlkbrY.",
        "English:The Irish driver Eddie Irvine (Jaguar) announced his withdrawal from the Austrian Grand Prix.",
        "Examples 1-3 show that objective sentences can have some implicitly negative words/phrases like çU-JI \"{nsHAb\" (\"withdrawl\").",
        "In addition, although these 3 examples convey bad news, they are annotated with an OBJ tag since the sentences are judged as facts, although one annotator did initially tag example 1 as S-NEG before it was resolved later.",
        "In a similar vein, the OBJ tag was also assigned to good news as in example 4 below:",
        "Transliteration wtWkd AwlgA SAHbp AlmjmE An kl $y' yntj mHlyA b{stvnA' AlTHyn wAlskr wAlm$rwbAt Alty ytm $rAWhA mn Alswq.",
        "English: Olga, the owner of the restaurant, asserts that everything is produced locally except flour, sugar and beverages, which are purchased from the market.",
        "The OBJ tag was also assigned to sentences which are neither good nor bad news, as example 5 below:",
        ".oLxju-oJ I ^lla* Transliteration: wsbq lkAmbws Al*y kAn y$rf ElY AlryAn AlqTry fy Almwsm AlmADy On drb",
        "Sentences that were assigned a S-POS tag included ones with positive private states (Quirk et al., 1974) (i.e., states that are not subject to verification).",
        "Examples 6 and 7 below are cases in point where the phrase JUS I Ow-Uüt \"AntE$t Al – mAl\" (\"hopes revived\") and the word jLUsI \"TmnAn\" (\"relief\") stand for unverifiable private states:",
        "Transliteration: wAntE$t Al – mAl bAlIfrAj En AlrhA}n fy AlsAEAt Al 24 AlAxyrp mE tdxl lybyA.",
        "English: Hopes for the release of hostages revived in the last 24 hours with the intervention of Libya.",
        "Transliteration: wAbdY SlAt Hsn TmnAnh IlY",
        "Ewdp AlnZAm wAlstqrAr IlY blAdh.",
        "English: Silaat Hasan expressed relief for the return of order and stability to his country.",
        "The subtle nature of subjectivity as expressed in the news genre is reflected in some of the positive examples, especially in directly or indirectly quoted content when quoted people express their emotion or support their cause (via e.g., using modifiers).",
        "For instance, the use of the phrases",
        "SwmAl\" (\"for the advancement of Somalia\") and JuSI J& \"IlY AlAbd\" (\"for ever\") in examples 8 and 9, respectively, below turn what would have otherwise been OBJ sentences into S-POS sentences.",
        "Again, one annotator initially tagged example 8 as Transliteration: dEA Alr} ys AlSwmAly msA'",
        "Ams Alsbt Aldwl AlmAnHp wxSwSA AEDA' AljAmEp AlErbyp wAl{ tHAd AlAwrwby IlY tqdym msAEdAt IlY blAdh \"mn Ajl nhDp AlSwmAl\".",
        "English: The Somali President, on Saturday evening, called on the donor countries, especially members of the Arab League and the European Union, to provide assistance to his country \"for the advancement of Somalia\".",
        "Transliteration: wAkd [Alrys] An SfHp AlHrb AlAhlyp qd Antht IlY AlAbd, wyEwd *'lk b$kl AsAsy IlY AnthA' AltdxlAt AlxArjyp.",
        "English: He [The president] affirmed that was over for ever mainly because of the end of foreign/external interference.",
        "Quoted content sometimes was in the form of speech acts (Searle, 1975).",
        "For example, (10) is an expressive speech act where the quoted person is thanking another party:",
        "Transliteration: [wADAf:] \"$krA mn AEmAq qlby lh'*A Al$rf Al*y ymtd mdY AlHyAp\".",
        "English: [He added:] Thank you from all my heart for this lifelong honor.",
        "Positive content was also sometimes explicitly expressed in the text belonging to the story author, especially in stories belonging to the Sports domain as is shown in (11).",
        "Transliteration: wymkn AEtbAr mAt$AlA (50 EAmA) mn AnjH Almdrbyn fy AlqArp AlAsywyp wtHdydA fy mnTqp Alxlyj, wykfy Anh qAd Almntxb Alkwyty IlY IHrAz lqb kAs Alxlyj mrtyn mttAlytyn EAmy 96 w 98 English: Macala, 50 years old, is one of the most successful coaches in Asia, more specifically in the Gulf area, and it is enough that he lead the Kuwaiti team to winning the Gulf Cup twice in a row in 96 and 98.",
        "Again, the more explicit negative content was found to be frequent in sentences with quoted content (as is illustrated in examples 12-14).",
        "(12) shows how the S-NEG S-POS sentiment can be very strong as is illustrated by the use of the noun phrase jjUa^ \"ISrAr $yTAny\" (\"diabolical insistence\"\"):",
        ",U AcI ijj",
        "Transliteration: wrd AHd mHAmy Andrywty jywAkynw sbAky ElY qrAr AlnyAbp fy bAlyrmw wASfA IyAh bAnh \"ISrAr $yTAny\" mn qbl AlAthAm.",
        "English: One of lawyers of Andreotti Jjoaquino responded to the prosecutor's decision in Palermo, describing it as a \"diabolical insistence\" on the acusser's part.",
        "(13) shows how political parties express their political stance toward events via use of private state expressions (e.g., ^j-T JJuL \"bqlq kbyr\" [\"with great concern\"]).",
        "Transliteration: wAwDH byAn l wzArp AlxAr-jyp Altrkyp An \"trkyA ttAbE bqlq kbyr hjmAt AlArhAbyyn Alty Hdvt fy AlAyAm AlAxyrp fy AwzbkstAn wqrgyzstAn\".",
        "English: A statement from the Turkish Foreign Ministry indicated that \"Turkey follows with great concern the terrorist attacks that have occurred in recent days in Uzbekistan and Kyrgyzstan\".",
        "Speech acts have also been used to express negative sentiment.",
        "For example, (14) is a direct quotation where a political figure denounces the acts of hearers.",
        "The speech act is intensified through the use of the adverb ji> \"HtY\" (\"even\"):",
        "Buckwalter: wqAl $Arwn mn mnSp Alknyst mtwjhA AlY nwAb Hzb AlEml \"lqd txlytm HtY En Alqsm AlAkbr mn Almdynp Alqdymp.\"",
        "English: Sharon, addressing Labour MPs from the Knesset, said: \"You have even abandoned the biggest part of the old city\".",
        "Majority of the sentences pertaining to the military and political violence domain were OBJ, however, some of the sentences belonging to this specific domain were annotated S-NEG.",
        "News reporting is supposed to be objective, story authors sometimes used very negative modifiers, sometimes metaphorically as is indicated in (15).",
        "Example 15, however, was labeled OBJ by one of the annotators, and later agrrement was reached that it is more of an S-NEG case.",
        "Transliteration: wkAn $hr tmwz ywlyw dmwyA b$kl xAS mE sqwT nHw 300 qtyl.",
        "English: The month of July was especially bloody, with the killing of 300 people.",
        "Again, authors of articles sometimes evaluated the events they reported.",
        "Sentences 16 and 17 are examples:",
        "Transliteration: wbAt mwqf fryq AlAhly SEbA lAlgAyp fy AlbTwlp AlIfryqyp Alty ysEY lAlfwz blqbhA wtDE jmAhyrh AydyhA ElY qlwbhA x$yp nhyArh.",
        "English: The position of Al-Ahly in the African Championship, which the team seeks to win, became extremely difficult; and the team's fans hold their breath in fear of its defeat.",
        "Transliteration: wjA' AEtdA' h$Am Hnfy ElY zmylh $Ady mHmd ElY mrAY wmsmE AljmyE AvnA' mbArAp AlAhly wAlAsmAEyly fy nSf nhA}y AlkAs AlAsbwE AlmADy lyWkd tfkk",
        "Alfryq.",
        "English: Hesham Hanafi's attack on his colleague Shadi Muhammad, in front of everyone during the game between Al-Ahli and Al-Ismaili in the semifinals last week, confirms the disintegration of the team.",
        "Some of the S-NEUT cases were speculations about the future, as is illustrated by sentences 18 and 19:",
        "Transliteration: wytwqE An yEwd IlY AlwlAyAt AlmtHdp fy 25 tmwz (ywlyw).",
        "English: And he is expected to return to the United States on July 25.",
        "Transliteration: wkl AlmW$rAt tfyd In h'*A AlwDE ln ytgyr bEd AlAntxAbAt.",
        "English: All indications are that this situation will not change after the elections.",
        "Hedges were also used to show cautious commitment to propositions, and hence turn OBJ sentences to S-NEUT ones.",
        "Sentences (20) and (21) are examples, with the occurrence of the hedge trigger word Transliteration: w ybdw An Altktm Al*y AHAT bzyArp byryz AlY AndwnysyA kAn yhdf AlY tfAdy AvArp rdwd fEl mEAdyp fy AlblAd.",
        "English: It seems that the secrecy surrounding Peres's visit to Indonesia was aimed at avoiding negative reactions in the country.",
        "Transliteration: wElY AlArjH An qbTAn Al-gwASp AETY AlAmr bATfA' kl AlAlAt ElY mtnhA.",
        "English: Most likely the submarine's captain ordered turning off all the machines on board.",
        "Some S-NEUT cases are examples ofarguing that something is true or should be done (Somasundaran et al., 2007).",
        "(22) is an illustrative example:",
        "Transliteration: qlthA, wAkrrhA, fAlm$klp lyst fy",
        "AlnfT AlxAm wInmA fy Alm$tqAt AlnfTyp.",
        "English: I said, and I repeat it, the problem is not in crude oil but rather in oil derivatives.",
        "Example 22 was, however, initially tagged as OBJ.",
        "Later, the two annotators agreed to assign it an S-NEUT tag.",
        "6 Related Work",
        "There are a number of datasets annotated for SSA.",
        "Most relevant to us is work on the news genre.",
        "(Wiebe et al., 2005) describe a fine-grained news corpus manually labeled for SSA at the word and phrase levels.",
        "Their annotation scheme involves identifying the source and target of sentiment as well as other related properties (e.g., the intensity of expressed sentiment).",
        "Our work is less fine grained on the one hand, but we label our data for domain as well as subjectivity.",
        "(Balahur et al., 2009) report work on labeling quotations from the news involving one person mentioning another entity and maintain that quotations typically contain more sentiment expressions than other parts of news articles.",
        "Our work is different from that of (Balahur et al., 2009) in that we label all sentences regardless whether they include quotations or not.",
        "(Balahur et al., 2009) found that entities mentioned in quotations are not necessarily the target of the sentiment, and hence we believe that SSA systems built for news are better if they focus on all the sentences of articles rather than quotations alone (since the target of sentiment may be outside the scope of a quotation, but within that of the sentence to which a quotation belongs)..",
        "The only work on Arabic SSA we are aware of is that of Abbasi et al.",
        "(2008) who briefly describe labeling a collection of documents from Arabic Web forums.",
        "(Abbasi et al., 2008)'s dataset, however, is not publicly available and detailed information as to how the data was annotated is lacking.",
        "Our work is different from (Abbasi et al., 2008)'s in that we label instances at the sentence level.",
        "We believe that documents contain mixtures of OBJ and SUBJ cases and hence sentence-level annotation is more finegrained.",
        "In addition, (Abbasi et al., 2008) focus on a specific domain of 'dark Web forums'."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "In this paper, we present a novel annotation layer of SSA to an already labeled MSA data set, the PATB Part 1 ver.",
        "3.0.",
        "To the best of our knowledge, this layer of annotation is the first of its kind on MSA data of the newswire genre.",
        "We will make that collection available to the community at large.",
        "We motivate SSA for news and summarize our linguistics-motivated guidelines for data annotation and provide examples from our data set."
      ]
    }
  ]
}
