{
  "info": {
    "authors": [
      "Luciana Benotti",
      "Alexandre Denis"
    ],
    "book": "Proceedings of the SIGDIAL 2011 Conference",
    "id": "acl-W11-2010",
    "title": "Giving instructions in virtual environments by corpus based selection",
    "url": "https://aclweb.org/anthology/W11-2010",
    "year": 2011
  },
  "references": [
    "acl-P09-2076",
    "acl-W06-1303",
    "acl-W10-4233",
    "acl-W10-4329"
  ],
  "sections": [
    {
      "text": [
        "PLN Group, FAMAF National University of Cordoba Cordoba, Argentina",
        "TALARIS team, LORIA/CNRS Lorraine.",
        "Campus scientifique, BP 239 Vandoeuvre-lès-Nancy, France",
        "alexandre.denis@loria.fr",
        "Instruction giving can be used in several applications, ranging from trainers in simulated worlds to non player characters for virtual games.",
        "In this paper we present a novel algorithm for rapidly prototyping virtual instruction-giving agents from human-human corpora without manual annotation.",
        "Automatically prototyping full-fledged dialogue systems from corpora is far from being a reality nowadays.",
        "Our approach is restricted in that only the virtual instructor can perform speech acts while the user responses are limited to physical actions in the virtual worlds.",
        "We have defined an algorithm that, given a task-based corpus situated in a virtual world, which contains human instructor's speech acts and the user's responses as physical actions, generates a virtual instructor that robustly helps a user achieve a given task in the virtual world.",
        "We explain how this algorithm can be used for generating a virtual instructor for a game-like, task-oriented virtual world.",
        "We evaluate the virtual instructor with human users using task-oriented as well as user satisfaction metrics.",
        "We compare our results with both human and rule-based virtual instructors hand-coded for the same task."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Virtual human characters constitute a promising contribution to many fields, including simulation, training and interactive games (Kenny et al., 2007; Jan et al., 2009).",
        "The ability to communicate using natural language is important for believable and effective virtual humans.",
        "Such ability has to be good enough to engage the trainee or the gamer in the activity.",
        "Nowadays, most conversational systems operate on a dialogue-act level and require extensive annotation efforts in order to be fit for their task (Rieser and Lemon, 2010).",
        "Semantic annotation and rule authoring have long been known as bottlenecks for developing conversational systems for new domains.",
        "In this paper, we present a novel algorithm for generating virtual instructors from automatically annotated human-human corpora.",
        "Our algorithm, when given a task-based corpus situated in a virtual world, generates an instructor that robustly helps a user achieve a given task in the virtual world of the corpus.",
        "There are two main approaches toward automatically producing dialogue utterances.",
        "One is the selection approach, in which the task is to pick the appropriate output from a corpus ofpossible outputs.",
        "The other is the generation approach, in which the output is dynamically assembled using some composition procedure, e.g. grammar rules.",
        "The selection approach to generation has only been used in conversational systems that are not task-oriented such as negotiating agents (Gandhe and Traum, 2007a), question answering characters (Kenny et al., 2007), and virtual patients (Leuski et al., 2006).",
        "To the best of our knowledge, our algorithm is the first one proposed for doing corpus based generation and interaction management for task-oriented systems.",
        "The advantages of corpus based generation are many.",
        "To start with, it affords the use of complex and human-like sentences without detailed analysis.",
        "Moreover, the system may easily use recorded audio clips rather than speech synthesis and recorded video for animating virtual humans.",
        "Finally, no rule writing by a dialogue expert or manual annotations is needed.",
        "The disadvantage of corpus based generation is that the resulting dialogue may not be fully coherent.",
        "For non-task oriented systems, dialogue management through corpus based methods has shown coherence related problems.",
        "Shawar and Atwell (2003; 2005) present a method for learning pattern matching rules from corpora in order to obtain the dialogue manager for a chatbot.",
        "Gandhe and Traum (2007b) investigate several dialogue models for negotiating virtual agents that are trained on an unannotated human-human corpus.",
        "Both approaches report that the dialogues obtained by these methods are still to be improved because the lack of dialogue history management results in incoherences.",
        "Since in task-based systems, the dialogue history is restricted by the structure of the task, the absence of dialogue history management is alleviated by tracking the current state of the task.",
        "In the next section we introduce the corpora used in this paper.",
        "Section 3 presents the two phases of our algorithm, namely automatic annotation and dialogue management through selection.",
        "In Section 4 we present a fragment of an interaction with a virtual instructor generated using the corpus and the algorithm introduced in the previous sections.",
        "We evaluate the virtual instructor in interactions with human subjects using objective as well as subjective metrics.",
        "We present the results of the evaluation in Section 5.",
        "We compare our results with both human and rule-based virtual instructors hand-coded for the same task.",
        "Finally, Section 7 discusses the weaknesses of the approach for developing instruction giving agents, as well as its advantages and drawbacks with respect to hand-coded systems.",
        "In this last section we also discuss improvements on our algorithms designed as a result of our error analysis."
      ]
    },
    {
      "heading": "2. The GIVE corpus",
      "text": [
        "The Challenge on Generating Instructions in Virtual Environments (GIVE; Koller et al.",
        "(2010)) is a shared task in which Natural Language Generation systems must generate real-time instructions that guide a user in a virtual world.",
        "In this paper, we use the GIVE-2 Corpus (Gargett et al., 2010), a freely available corpus of human instruction giving in virtual environments.",
        "We use the English part of the corpus which consists of 63 American English written discourses in which one subject guided another in a treasure hunting task in 3 different 3D worlds.",
        "The task setup involved pairs of human partners, each of whom played one of two different roles.",
        "The \"direction follower\" (DF) moved about in the virtual world with the goal of completing a treasure hunting task, but had no knowledge of the map of the world or the specific behavior of objects within that world (such as, which buttons to press to open doors).",
        "The other partner acted as the \"direction giver\" (DG), who was given complete knowledge of the world and had to give instructions to the DF to guide him/her to accomplish the task.",
        "The GIVE-2 corpus is a multi-modal corpus which consists of all the instructions uttered by the DG, and all the object manipulations done by the DF with the corresponding timestamp.",
        "Furthermore, the DF's position and orientation is logged every 200 milliseconds, making it possible to extract information about his/her movements."
      ]
    },
    {
      "heading": "3. The unsupervised conversational model",
      "text": [
        "Our algorithm consists of two phases: an annotation phase and a selection phase.",
        "The annotation phase is performed only once and consists of automatically associating the DG instruction to the DF reaction.",
        "The selection phase is performed every time the virtual instructor generates an instruction and consists of picking out from the annotated corpus the most appropriate instruction at a given point.",
        "The basic idea of the annotation is straightforward: associate each utterance with its corresponding reaction.",
        "We assume that a reaction captures the semantics of its associated instruction.",
        "Defining reaction involves two subtle issues, namely boundary determination and discretization.",
        "We discuss these issues in turn and then give a formal definition of reaction.",
        "We define the boundaries of a reaction as follows.",
        "A reaction Rk to an instruction Uk begins right after the instruction Uk is uttered and ends right before the next instruction Uk+1 is uttered.",
        "In the following example, instruction 1 corresponds to the reaction (2, 3, 4), instruction 5 corresponds to (6), and instruction 7 to (8).",
        "DG(1): hit the red you see in the far room DG(5): hit far side green DF(6): [moves next to the wrong green] DF(8): [moves to the right green and pushes it]",
        "As the example shows, our definition of boundaries is not always semantically correct.",
        "For instance, it can be argued that it includes too much because 4 is not strictly part of the semantics of 1.",
        "Furthermore, misinterpreted instructions (as 5) and corrections (e.g., 7) result in clearly inappropriate instruction-reaction associations.",
        "Since we want to avoid any manual annotation, we decided to use this naive definition of boundaries anyway.",
        "We discuss in Section 5 the impact that inappropriate associations have on the performance of a virtual instructor.",
        "The second issue that we address here is discretization of the reaction.",
        "It is well known that there is not a unique way to discretize an action into subactions.",
        "For example, we could decompose action 2 into 'enter the room' or into 'get close to the door and pass the door'.",
        "Our algorithm is not dependent on a particular discretization.",
        "However, the same discretization mechanism used for annotation has to be used during selection, for the dialogue manager to work properly.",
        "For selection (i.e., in order to decide what to say next) any virtual instructor needs to have a planner and a planning problem: i.e., a specification of how the virtual world works (i.e., the actions), a way to represent the states of the virtual world (i.e., the state representation) and a way to represent the objective of the task (i.e., the goal).",
        "Therefore, we decided to use them in order to dis-cretize the reaction.",
        "For the virtual instructor we present in Section 4 we used the planner LazyFF and the planning problem provided with the GIVE Framework.",
        "The planner LazyFF is a reimplementation (in Java) of the classical artificial intelligence planner FF (Hoffmann and Nebel, 2001).",
        "The GIVE framework (Gar-gett et al., 2010) provides a standard PDDL (Hsu et al., 2006) planning problem which formalizes how the GIVE virtual worlds work.",
        "Both the LazzyFF planner and the GIVE planning problem are freely available on the web .",
        "Now we are ready to define reaction formally.",
        "Let Sk be the state of the virtual world when uttering instruction Uk, Sk+1 be the state of the world when uttering the next utterance Uk+1 and Acts be the representation of the virtual world actions.",
        "The reaction to Uk is defined as the sequence of actions returned by the planner with Sk as the initial state, Sk+1 as the goal state and Acts as the actions.",
        "Given this reaction definition, the annotation of the corpus then consists of automatically associating each utterance to its (discretized) reaction.",
        "The simple algorithm that implements this annotation is shown in Figure 1.",
        "Moreover, we provide a fragment of the resulting annotated corpus in Appendix A.",
        "1: Acts – world possible actions 2: for all utterance Uk in the corpus do",
        "In this section we describe how the selection phase is performed every time the virtual instructor generates an instruction.",
        "The instruction selection algorithm, displayed in Figure 2, consists in finding in the corpus the set of candidate utterances C for the current task plan P (P is the sequence of actions that needs to be executed in the current state of the virtual world in order to complete the task).",
        "We define C = {U G Corpus | P starts with U.Reaction}.",
        "In other words, an utterance U belongs to C if the first actions of the current plan P exactly match the reaction associated to the utterance U.",
        "All the utterances that pass this test are considered paraphrases and hence suitable in the current context.",
        "Whenever the plan P changes, as a result of the actions of the DF, we call the selection algorithm in order to regenerate the set of candidate utterances C.",
        "2: Plan – current task plan 3: for all utterance U in the corpus do 4: if Plan starts with U.Reaction then 8: return C",
        "While the plan P doesn't change, because the DF is staying still, the virtual instructor offers alternative paraphrases of the intended instruction.",
        "Each paraphrase is selected by picking an utterance from C and verbalizing it, at fixed time intervals (every 3 seconds).",
        "The order in which utterances are selected depends on the length of the utterance reaction (in terms of number of actions), starting from the longest ones.",
        "Hence, in general, instructions such as \"go back again to the room with the lamp\" are uttered before instructions such as \"go straight\", because the reaction of the former utterance is longer than the reaction of the later.",
        "It is important to notice that the discretization used for annotation and selection directly impacts the behavior of the virtual instructor.",
        "It is crucial then to find an appropriate granularity of the discretization.",
        "If the granularity is too coarse, many instructions in the corpus will have an empty reaction.",
        "For instance, in the absence of the representation of the user orientation in the planning domain (as is the case for the virtual instructor we evaluate in Section 5), instructions like \"turn left\" and \"turn right\" will have empty reactions making them indistinguishable during selection.",
        "However, if the granularity is too fine the user may get into situations that do not occur in the corpus, causing the selection algorithm to return an empty set of candidate utterances.",
        "It is the responsibility of the virtual instructor developer to find a granularity sufficient to capture the diversity of the instructions he wants to distinguish during selection."
      ]
    },
    {
      "heading": "4. A virtual instructor for a virtual world",
      "text": [
        "We implemented an English virtual instructor for one of the worlds used in the corpus collection we presented in Section 2.",
        "The English fragment of the corpus that we used has 21 interactions and a total of 1136 instructions.",
        "Games consisted on average of 54.2 instructions from the human DG, and took about 543 seconds on average for the human DF to complete the task.",
        "On Figures 4 to 7 we show an excerpt of an interaction between the system and a user.",
        "The figures show a 2D map from top view and the 3D ingame view.",
        "In Figure 4, the user, represented by a blue character, has just entered the upper left room.",
        "He has to push the button close to the chair.",
        "The first candidate utterance selected is \"red closest to the chair in front of you\".",
        "Notice that the referring expression uniquely identifies the target object using the spatial proximity of the target to the chair.",
        "This referring expression is generated without any reasoning on the target distractors, just by considering the current state of the task plan and the user position.",
        "Figure 4: \"red closest to the chair in front of you\"",
        "After receiving the instruction the user gets closer to the button as shown in Figure 5.",
        "As a result of the new user position, a new task plan exists, the set of candidate utterances is recalculated and the system selects a new utterance, namely \"the closet one\".",
        "The generation of the ellipsis of the button or the chair is a direct consequence of the utterances normally said in the corpus at this stage of the task plan (that is, when the user is about to manipulate this object).",
        "From the point of view of referring expression algorithms, the referring expression may not be optimal because it is over-specified (a pronoun would",
        "straight go back out closest the door go back to the hallway go back out of the room exit the way you entered back to the room with the lamp",
        "Go through the opening on the left okay now go back to where you came from now i ned u to go back to the original room now go back now go back out down the passage nowin to the shade room out the way you came in ok now go out the same door go back to the door you came in okay now go back to the original room ok go back again to the room with the lamp",
        "Go through the opening on the left with the yellow wall paper",
        "Figure 5: \"the closet one\"",
        "Figure 7: \"go back to the room with the lamp\"",
        "of 'closest').",
        "In spite of this non optimality, the instruction led our user to execute the intended reaction, namely pushing the button.",
        "Right after the user clicks on the button (Figure 6), the system selects an utterance corresponding to the new task plan.",
        "The player position stayed the same so the only change in the plan is that the button no longer needs to be pushed.",
        "In this task state, DGs usually give acknowledgements and this is then what our selection algorithm selects: \"good\".",
        "After receiving the acknowledgement, the user turns around and walks forward, and the next action in the plan is to leave the room (Figure 7).",
        "The system selects the utterance \"go back to the room with the lamp\" which refers to the previous interaction.",
        "Again, the system keeps no representation of be preferred as in \"click it\"), Furthermore, the in-the past actions of the user, but such utterances are struction contains a spelling error ('closet' instead the ones that are found at this stage of the task plan.",
        "We show in Figure 3 all candidate utterances selected when exiting the room in Figure 7.",
        "That is, for our system purposes, all the utterances in the figure are paraphrases of the one that is actually uttered in Figure 7.",
        "As we explained in Section 3.2, the utterance with the longest reaction is selected first (\"go back to the room with the lamp\"), the second utterance with the longest reaction is selected second (\"ok go back again to the room with the lamp\"), and so on.",
        "As you can observe in Figure 3 the utterances in the candidate set can range from telegraphic style like \"L\" to complex sentences like \"Go through the opening on the left with the yellow wall paper\".",
        "Several kinds of instructions are displayed, acknowledgements such as \"yes\", pure moving instructions like \"left\" or \"straight\", instructions that refer to the local previous history such as \"go back out the room\" or \"ok now go out the same door\" and instructions that refer back to the global history such as \"okay now go back to the original room\".",
        "Due to the lack of orientation consideration in our system, some orientation dependent utterances are inappropriate in this particular context.",
        "For instance, \"left\" is incorrect given that the player does not have to turn left but go straight in order to go through the correct door.",
        "However, most of the instructions, even if quite different among themselves, could have been successfully used in the context of Figure 7."
      ]
    },
    {
      "heading": "5. Evaluation and error analysis",
      "text": [
        "In this section we present the results of the evaluation we carried out on the virtual instructor presented in Section 4 which was generated using the dialogue model algorithm introduced in Section 3.",
        "We collected data from 13 subjects.",
        "The participants were mostly graduate students; 7 female and 6 male.",
        "They were not English native speakers but rated their English skills as near-native or very good.",
        "The evaluation contains both objective measures which we discuss in Section 5.1 and subjective measures which we discuss in Section 5.2.",
        "The objective metrics we extracted from the logs of interaction are summarized in Table 1.",
        "The table compares our results with both human instructors and the three rule-based virtual instructors that were top rated in the GIVE-2 Challenge.",
        "Their results correspond to those published in (Koller et al., 2010) which were collected not in a laboratory but connecting the systems to users over the Internet.",
        "These hand-coded systems are called NA, NM and Saar.",
        "We refer to our system as OUR.",
        "In the table we show the percentage of games that users completed successfully with the different instructors.",
        "Unsuccessful games can be either canceled or lost.",
        "We also measured the average time until task completion, and the average number of utterances users received from each system.",
        "To ensure comparability, we only counted successfully completed games.",
        "In terms of task success, our system performs better than all hand-coded systems.",
        "We duly notice that, for the GIVE Challenge in particular (and probably for human evaluations in general) the success rates in the laboratory tend to be higher than the success rate online (this is also the case for completion times) (Koller et al., 2009).",
        "Koller et al.",
        "justify this difference by stating that the laboratory subject is being discouraged from canceling a frustrating task while the online user is not.",
        "However, it is also possible that people canceled less because they found the interaction more natural and engaging as suggested by the results of the subjective metrics (see next section).",
        "In any case, our results are preliminary given the amount of subjects that we tested, but they are indeed encouraging.",
        "In particular, our system helped users to identify better the objects that they needed to manipulate in the virtual world, as shown by the low number of mouse actions required to complete the task (a high number indicates that the user must have manipulated wrong objects).",
        "This correlates with the subjective evaluation of referring expression quality (see next section).",
        "Human",
        "NA",
        "Saar",
        "NM",
        "OUR",
        "Task success",
        "100%",
        "47%",
        "40%",
        "30%",
        "70%",
        "Canceled",
        "0%",
        "24%",
        "n/a",
        "35%",
        "7%",
        "Lost",
        "0%",
        "29%",
        "n/a",
        "35%",
        "23%",
        "Time (sec)",
        "543",
        "344",
        "467",
        "435",
        "692",
        "Mouse actions",
        "12",
        "17",
        "17",
        "18",
        "14",
        "Utterances",
        "53",
        "224",
        "244",
        "244",
        "194",
        "We performed a detailed analysis of the instructions uttered by our system that were unsuccessful, that is, all the instructions that did not cause the intended reaction as annotated in the corpus.",
        "From the 2081 instructions uttered in total (adding all the utterances of the 13 interactions), 1304 (63%) of them were successful and 777 (37%) were unsuccessful.",
        "Given the limitations of the annotation discussed in Section 3.1 (wrong annotation of correction utterances and no representation of user orientation) we classified the unsuccessful utterances using lexical cues into 1) correction like \"no\" or \"wrong\", 2) orientation instruction such as \"left\" or \"straight\", and 3) other.",
        "We found that 25% of the unsuccessful utterances are of type 1, 40% are type 2, 34% are type 3 (1% corresponds to the default utterance \"go\" that our system utters when the set of candidate utterances is empty).",
        "In Section 7 we propose an improved virtual instructor designed as a result of this error analysis.",
        "The subjective measures were obtained from responses to the GIVE-2 questionnaire that was presented to users after each game.",
        "It asked users to rate different statements about the system using a continuous slider.",
        "The slider position was translated to a number between -100 and 100.",
        "As done in GIVE-2, for negative statements, we report the reversed scores, so that in Tables 2 and 3 greater numbers indicates that the system is better (for example, Q14 shows that OUR system is less robotic than the rest).",
        "In this section we compare our results with the systems NA, Saar and NM as we did in Section 5.1, we cannot compare against human instructors because these subjective metrics were not collected in (Gargett et al., 2010).",
        "The GIVE-2 Challenge questionnaire includes twenty-two subjective metrics.",
        "Metrics Q1 to Q13 and Q22 assess the effectiveness and reliability of instructions.",
        "For almost all of these metrics we got similar or slightly lower results than those obtained by the three hand-coded systems, except for three metrics which we show in Table 2.",
        "We suspect that the low results obtained for Q5 and Q22 relate to the unsuccessful utterances identified and discussed in Section 5.1 (for instance, corrections were sometimes contradictory causing confusion and resulting in subjects ignoring them as they advanced in the interaction).",
        "The high unexpected result in Q6, that is indirectly assessing the quality of referring expressions, demonstrates the efficiency of the referring process despite the fact that nothing in the algorithms is dedicated to reference.",
        "This good result is probably correlated with the low number of mouse actions mentioned in Section 5.1.",
        "Q5: I was confused about which direction to go in",
        "Q6: I had no difficulty with identifying the objects the system described for me",
        "Q22: I felt I could trust the system's instructions",
        "Table 2: Results for the significantly different subjective measures assessing the effectiveness of the instructions (the greater the number, the better the system)",
        "Metrics Q14 to Q20 are intended to assess the naturalness of the instructions, as well as the immersion and engagement of the interaction.",
        "As Table 3 shows, in spite of the unsuccessful utterances, our system is rated as more natural and more engaging (in general) than the best systems that competed in the GIVE-2 Challenge.",
        "Q14: The system's instructions sounded robotic",
        "Q15: The system's instructions were repetitive",
        "Q16: I really wanted to find that trophy",
        "Q17: I lost track of time while solving the task",
        "Q18: I enjoyed solving the task",
        "Q19: Interacting with the system was really annoying",
        "Q20: I would recommend this game to a friend",
        "Table 3: Results for the subjective measures assessing the naturalness and engagement of the instructions (the greater the number, the better the system)"
      ]
    },
    {
      "heading": "6. Portability to other virtual environments",
      "text": [
        "The hand-coded systems, which we compared to, do not need a corpus in a particular GIVE virtual world in order to generate instructions for any GIVE virtual world, while our system cannot do without such corpus.",
        "These hand-coded systems are designed to work on different GIVE virtual worlds without the need of training data, hence their algorithms are more complex (e.g. they include domain independent algorithms for generation of referring expressions) and take a longer time to develop.",
        "Our algorithm is independent of any particular virtual world.",
        "In fact, it can be ported to any other instruction giving task (where the DF has to perform a physical task) with the same effort than required to port it to a new GIVE world.",
        "This is not true for the hand-coded GIVE systems.",
        "The inputs of our algorithm are an off-the-shelf planner, a formal planning problem representation of the task and a human-human corpus collected on the very same task the system aims to instruct.",
        "It is important to notice that any virtual instructor, in order to give instructions that are both causally appropriate at the point of the task and relevant for the goal cannot do without such planning problem representation.",
        "Furthermore, it is quite a normal practice nowadays to collect a human-human corpus on the target task domain.",
        "It is reasonable, then, to assume that all the inputs of our algorithm are already available when developing the virtual instructor, which was indeed the case for the GIVE framework.",
        "Another advantage of our approach is that virtual instructor can be generated by developers without any knowledge of generation of natural language techniques.",
        "Furthermore, the actual implementation of our algorithms is extremely simple as shown in Figures 1 and 2.",
        "This makes our approach promising for application areas such as games and simulation training."
      ]
    },
    {
      "heading": "7. Future work and conclusions",
      "text": [
        "In this paper we presented a novel algorithm for automatically prototyping virtual instructors from human-human corpora without manual annotation.",
        "Using our algorithms and the GIVE corpus we have generated a virtual instructor for a game-like virtual environment.",
        "A video of our virtual instructor is available in http://cs.famaf.unc.edu.ar/",
        "-luciana/give-ouR.",
        "We obtained encouraging results in the evaluation with human users that we did on the virtual instructor.",
        "In our evaluation, our system outperforms rule-based virtual instructors hand-coded for the same task both in terms of objective and subjective metrics.",
        "We plan to participate in the GIVE Challenge 2011 in order to get more evaluation data from online users and to evaluate our algorithms on multiple worlds.",
        "The algorithms we presented solely rely on the plan to define what constitutes the context of uttering.",
        "It may be interesting though to make use of other kinds of features.",
        "For instance, in order to integrate spatial orientation and differentiate \"turn left\" and \"turn right\", the orientation can be either added to the planning domain or treated as a context feature.",
        "While it may be possible to add orientation in the planning domain of GIVE, it is not straightforward to include the diversity of possible features in the same formalization, like modeling the global discourse history or corrections.",
        "Thus we plan to investigate the possibility of considering the context of an utterance as a set of features, including plan, orientation, discourse history and so forth, in order to extend the algorithms presented in terms of context building and feature matching operations.",
        "In the near future we plan to build a new version of the system that improves based on the error analysis that we did.",
        "For instance, we plan to take orientation into account during selection.",
        "As a result of these extensions however we may need to enlarge the corpus we used so as not to increase the number of situations in which the system does not find anything to say.",
        "Finally, if we could identify corrections automatically, as suggested in (Raux and Nakano, 2010), we could get an increase in performance, because we would be able to treat them as corrections and not as instructions as we do now.",
        "In sum, this paper presents the first existing algorithm for fully-automatically prototyping task-oriented virtual agents from corpora.",
        "The generated agents are able to effectively and naturally help a user complete a task in a virtual world by giving her him instructions."
      ]
    }
  ]
}
