{
  "info": {
    "authors": [
      "Anup Kumar Kolya",
      "Dipankar Das",
      "Asif Ekbal",
      "Sivaji Bandyopadhyay"
    ],
    "book": "Proceedings of the ACL 2011 Workshop on Relational Models of Semantics",
    "id": "acl-W11-0904",
    "title": "Identifying Event-Sentiment Association using Lexical Equivalence and Co-reference Approaches",
    "url": "https://aclweb.org/anthology/W11-0904",
    "year": 2011
  },
  "references": [
    "acl-J02-3001",
    "acl-L08-1086",
    "acl-L08-1088",
    "acl-N04-1030",
    "acl-P00-1010",
    "acl-S10-1063",
    "acl-S10-1077",
    "acl-W00-1308",
    "acl-W07-2013",
    "acl-W07-2067",
    "acl-W07-2094"
  ],
  "sections": [
    {
      "text": [
        "Identifying Event - Sentiment Association using Lexical Equivalence and",
        "Co-reference Approaches",
        "Anup Kumar Kolya Dipankar Das Asif Ekbal Sivaji Bandyopadhyay",
        "Computer Science and Engineering Department, Jadavpur University, India",
        "2",
        "Indian Institute of Technology, Patna (IITP), India",
        "In this paper, we have identified event and sentiment expressions at word level from the sentences of TempEval-2010 corpus and evaluated their association in terms of lexical equivalence and co-reference.",
        "A hybrid approach that consists of Conditional Random Field (CRF) based machine learning framework in conjunction with several rule based strategies has been adopted for event identification within the TimeML framework.",
        "The strategies are based on semantic role labeling, WordNet relations and some handcrafted rules.",
        "The sentiment expressions are identified simply based on the cues that are available in the sentiment lexicons such as Subjectivity Wordlist, SentiWordNet and WordNet Affect.",
        "The identification of lexical equivalence between event and sentiment expressions based on the part-of-speech (POS) categories is straightforward.",
        "The emotional verbs from VerbNet have also been employed to improve the coverage of lexical equivalence.",
        "On the other hand, the association of sentiment and event has been analyzed using the notion of co-reference.",
        "The parsed dependency relations along with basic rhetoric knowledge help to identify the co-reference between event and sentiment expressions.",
        "Manual evaluation on the 171 sentences of TempEval-2010 dataset yields the precision, recall and F-Score values of 61.25%, 70.29% and 65.23% respectively."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Event and Sentiment are two abstract entities closely coupled with each other from social, psychological and commercial perspectives.",
        "Some kind of action that is going on or something that is being happened are addressed as events in general by the Natural Language (NL) researchers.",
        "The events are described in texts where the time, temporal location and ordering of the events are specified.",
        "Event entities are represented by finite clauses, nonfinite clauses, nominalizations, event-referring nouns, adjectives and even some kinds of adverbial clauses.",
        "On the other hand, text not only contains the informative contents, but also some attitudinal private information that includes sentiments.",
        "Nowadays, in the NLP communities, research activities on sentiment analysis are in full swing.",
        "But, the identification of sentiment from texts is not an easy task as it is not open to any objective observation or verification (Quirk et al., 1985).",
        "Sometimes, similar or different types of sentiments are expressed on a single or multiple events.",
        "Sentiment of people over different events is important as it has great influence on our society.",
        "Tracking users' sentiments about products or events or about political candidates as expressed in online forums, customer relationship management, stock market prediction, social networking etc., temporal question answering, document summarization, information retrieval systems are some of the important applications of sentiment analysis.",
        "The identification of the association between event and sentiment is becoming more popular and interesting research challenge in the area of Natural Language Processing (NLP).",
        "Our present task is to identify the event and sentiment expressions from the text, analyze their associative relationship and investigate the insides of event-sentiment relations.",
        "For example, in the following sentence, the annotated events are, talked, sent and hijacked .But, it also shows the presence of underlying sentiments (as shown in underlined script) inscribed in the sentence.",
        "Here, sentiment helps to evoke the event property at lexical entity level (e.g. negative (-ve) sentiment for only the event word hijacked) as well as at context level (e.g. positive (+ve) sentiment associated with the event hijacked as the event word appears with the evaluative expression, recover that gives the +ve polarity).",
        "\"The prime minister of India told Friday that he has talked with top commander of Indian military force and sent a team to recover the host of Taj Hotel hijacked. \"",
        "Hence, we have organized the entire task into three different steps i) event identification, ii) sentiment expression identification and iii) identification of event sentiment relationships at context level using lexical equivalence and co-reference approaches.",
        "In the first step, we propose a hybrid approach for event extraction from the text under the Tem-pEval-2010 framework.",
        "Initially, we have used a Conditional Random Field (CRF) (Lafferty et al., 2001) machine learning framework but we observe that it often makes the errors in extracting the events denoted by deverbial entities.",
        "This observation prompts us to employ several strategies in conjunction with machine learning.",
        "These strategies are implemented based on semantic role labeling, WordNet (Miller, 1990) and some handcrafted rules.",
        "We have experimented with the TempEval-2010 evaluation challenge setup (Kolya et al.",
        ", 2010).",
        "Evaluation results yield the precision, recall and F-measure values of approximately 93.00%, 96.00% and 94.47% respectively.",
        "This is approximately 12% higher F-measure in comparison to the best system (Llorens et al., 2010) of",
        "TempEval-2010.",
        "On the other hand, the identification of the sentiment expressions is carried out based on the sentiment word.",
        "The words are searched in three different sentiment lexicons, the Subjectivity Word lists (Banea et al.",
        ", 2008), SentiWordNet (Baccia-nella et al.",
        ", 2010) and WordNet Affect (Strapparava and Valitutti, 2004).",
        "The coarse-grained (positive and negative) as well as Ekman's (1993) six finegrained sentiment or emotion expressions (happy, sadness, anger, disgust, fear and surprise) are tagged in the corpus.",
        "As there is no annotation in the TemEval-2010 corpus for sentiment expressions, the evaluation has been carried out by the authors and it achieves the precision, recall and F-measure values of approximately 73.54%, 86.04% and 79.30% respectively",
        "Determining the lexical equivalence of event and sentiment expressions based on the POS property at the lexical entity level is straightforward.",
        "If an event word also expresses the sentiment word, we have associated the corresponding sentiment type with the event word directly.",
        "In addition to the sentiment lexicons, the emotional verbs extracted from the VerbNet (Kipper-Schuler, 2005) are used in this phase.",
        "It improves the coverage of lexical equivalence by 12.76%.",
        "But, if the event and sentiment expressions occupy separate text spans in a sentence, we have adopted a co-reference approach for identifying their association.",
        "The parsed dependency relations along with some basic rhetoric components, such as nucleus, satellite and locus help in identifying the co-reference between the event and sentiment expressions.",
        "The text span containing sentiment word is hypothesized as the locus, the main effective part of the nucleus or satellite.",
        "The text span that reflects the primary goal of the writer is termed as nucleus (marked as \"{ }\") whereas the span that provides supplementary material is termed as satellite (marked as \"[ ]\").",
        "The distinguished identification of nucleus and satellite as well as their separation from each other is carried out based on the direct and transitive dependency relations, causal verbs, relaters or discourse markers.",
        "If both the locus and event are identified together in either nucleus or satellite, we term their association as co-referenced.",
        "If they occur separately in nucleus and satellite and share at least one direct dependency relation, we consider their association as co-referenced.",
        "The evaluation of the lexical equivalence as well as co-reference systems has been performed by the authors.",
        "Primarily, the evaluation of both systems has been conducted on the random samples of 200 sentences of the TempEval-2010 training dataset.",
        "Finally, the co-reference system achieves the precision, recall and F-Scores of 61.25%, 70.29% and 65.23% respectively on 171 sentences of the TempEval-2010 test corpus.",
        "The rest of the paper is organized as follows.",
        "Section 2 describes the related work.",
        "The event identification is discussed in Section 3.",
        "The identification of sentiment expressions is described in Section 4.",
        "Determination of lexical equivalence between event and sentiment expressions is specified in Section 5.",
        "The co-reference approach for identifying the association between event and sentiment is described in Section 6.",
        "Finally Section 7 concludes the paper."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "The existing works on event extraction are based either on pattern-matching rules (Mani and Wilson 2000), or on the machine learning approach (Bo-guraev and Ando, 2005).",
        "But, still the problems persist with the high complexities involved in the proper extractions of events.",
        "The events expressions were annotated in the TempEval 2007 source in accordance with the TimeML standard (Pustejovsky et al., 2003).",
        "On the other hand, the Task B of TempEval-2010 evaluation challenge setup (Verhagen et al., 2010) was aimed at identifying events from text.",
        "The best achieved result was obtained by (Llorens et al., 2010).",
        "The majority of subjective analysis methods that are related to emotion is based on textual keywords spotting that use specific lexical resources.",
        "A lexicon that provides appraisal attributes for terms was constructed and the features were used for emotion classification (Whitelaw et al., 2005).",
        "The features along with the bag-of-words model give 90.2% accuracy.",
        "UPAR7 (Chaumartin, 2007), a rule-based system uses a combination of WordNet Affect and SentiWordNet.",
        "The system was semi-automatically enriched with the original trial data provided during the SemEval task (Strapparais another supervised system that uses a unigram model trained to annotate emotional content.",
        "Our motivation is that though events and sentiments are closely coupled with each other from social, psychological and commercial perspectives, very little attention has been given about their detection and analysis.",
        "To the best of our knowledge, only a few tasks have been attempted (Fukuhara et al., 2007) (Das et al., 2010).",
        "Sometimes, the opinion topics are not necessarily spatially coherent as there may be two opinions in the same sentence on different topics, as well as opinions that are on the same topic separated by opinions that do not share that topic (Stoyanov and Cardie 2008).",
        "The authors have established their hypothesis by applying the co-reference technique.",
        "Similarly, we have adopted the co-reference technique based on basic rhetoric components for identifying the association between event and sentiment expressions.",
        "In addition to that, we have also employed the lexical equivalence approach for identifying their association."
      ]
    },
    {
      "heading": "3. Event Identification",
      "text": [
        "In this work, we propose a hybrid approach for event identification from the text under the Tem-pEval-2010 framework.",
        "We use Conditional Random Field (CRF) as the underlying machine learning algorithm.",
        "We observe that this machine learning based system often makes the errors in identifying the events denoted by deverbial entities.",
        "This observation prompts us to employ several strategies in conjunction with machine learning techniques.",
        "These strategies have been implemented based on semantic role labeling, WordNet senses and some handcrafted rules.",
        "We have experiment with the TempEval-2010 evaluation challenge setup (Kolya et al., 2010).",
        "Evaluation results yield the precision, recall and F-measure values of approximately 93.00%, 96.00% and 94.47% respectively.",
        "This is approximately 12% higher F-measure in comparison to the best system (Llorens et al., 2010) of TempEval-2010.",
        "We extract the gold-standard TimeBank features for events in order to train/test the CRF model.",
        "In the present work, we mainly use the various combinations of the following features:",
        "Part of Speech (POS) of event terms (e.g. Adjective, Noun and Verb), Tense (Present, Past, Future, Infinitive, Present part, Past part, or NONE), Aspect (Progressive, Perfective and Perfective Progressive or NONE), Class (Reporting, Perception, Aspectual, Iaction, Istate, State, Occurrence), Stem (e.g., discount /s/).",
        "We use an open source Semantic Role Labeler (SRL) (Gildea et al., 2002) (Pradhan et al., 2004) to identify different features of the sentences.",
        "For each predicate in a sentence acting as event word, semantic roles extract all constituents, determining their arguments (agent, patient etc.)",
        "and adjuncts (locative, temporal etc.).",
        "Semantic roles can be used to detect the events that are the nominaliza-tions of verbs such as agreement for agree or construction for construct.",
        "Nominalizations (or, deverbal nouns) are commonly defined as nouns that are morphologically derived from verbs, usually by suffixation (Quirk et al., 1985).",
        "Event nominalizations often afford the same semantic roles as verbs and often replace them in written language (Gurevich et al., 2006).",
        "Event nominali-zations constitute the bulk of deverbal nouns.",
        "The following example sentence shows how semantic roles can be used for event identification.",
        "[argi All sites] were [target inspected] to the satisfaction of the inspection team and with full cooperation of Iraqi authorities, [ARG0 Dacey] [TARGETsaid].",
        "The extracted target words are treated as the event words.",
        "It has been observed that many of these target words are identified as the event expressions by the CRF model.",
        "But, there exists many nominalised event expressions (i.e., deverbal nouns) that are not identified as events by the supervised CRF.",
        "These nominalised expressions are correctly identified as events by SRL.",
        "WordNet is mainly used to identify non-deverbal event nouns.",
        "We observed that the event entities like 'war', 'attempt', ltouf are not properly identified.",
        "These words have noun (NN) POS information as the previous approaches, i.e., CRF and SRL can only identify those event words that have verb (VB) POS information.",
        "We know from the lexical information of WordNet that the words like 'war' and ' tour' are generally used as both noun and verb forms in the sentence.",
        "Therefore, we have designed the following two rules based on the",
        "WordNet:",
        "Rule 1 : The word tokens having Noun (NN) POS categories are looked into the WordNet.",
        "If it appears in the WordNet with noun and verb senses, then that word token is considered as an event.",
        "For example, war has both noun and verb senses in the WordNet, and hence war is considered as an event.",
        "Rule 2: The stems of the noun word tokens are looked into the WordNet.",
        "If one of the WordNet senses is verb then the token is considered as verb.",
        "For example, the stem of proposal, i.e., propose has two different senses, noun and verb in the WordNet, and thus it is considered as an event.",
        "Here, we mainly concentrate on the identification of specific lexical classes like 'inspection and 'resignation '.",
        "These can be identified by the suffixes such as ('-ciôn'), ('-tion') or ('-ion'), i.e., the morphological markers of deverbal derivations.",
        "Initially, we have employed the CRF based Stanford Named Entity (NE) tagger on the TempEval-2 test dataset.",
        "The output of the system is tagged with Person, Location, Organization and Other classes.",
        "The words starting with the capital letters are also considered as NEs.",
        "Thereafter, we came up with the following rules for event identification:",
        "Cue-1: The deverbal nouns are usually identified by the suffixes like '-tion', '-ion', '-ing' and '-ed' etc.",
        "The nouns that are not NEs, but end with these suffixes are considered as the event words.",
        "Cue 2: The verb-noun combinations are searched in the sentences of the test set.",
        "The non-NE noun word tokens are considered as the events.",
        "Cue 3: Nominals and non-deverbal event nouns can be identified by the complements of aspectual PPs headed by prepositions like during, after and before, and complex prepositions such as at the end of and at the beginning of etc.",
        "The next word token(s) appearing after these clue word(s) or phrase(s) are considered as events.",
        "Cue 4: The non-NE nouns occurring after the expressions such as frequency of, occurrence of and period of are most probably the event nouns.",
        "Cue 5: Event nouns can also appear as objects of aspectual and time-related verbs, such as have begun a campaign or have carried out a campaign etc.",
        "The non-NEs that appear after the expressions like \"have begun a\", \"have carried out a\" etc.",
        "are also denoted as the events."
      ]
    },
    {
      "heading": "4. Sentiment Expression Identification",
      "text": [
        "Sentiment is an important cue that effectively describes the events associated with it.",
        "The binary classification of the sentiments (positive and negative) as well as the fine-grained categorization into Ekman's (1993) six emotions is therefore employed for identifying the sentiment expressions.",
        "200 sentences are randomly selected from the training dataset of the TempEval-2010 corpus.",
        "These sentences have been considered as our development set.",
        "On the other hand, 171 sentences were already provided as the test sentences in the TempEval-2010 evaluation challenge.",
        "The events are already annotated in the Tem-pEval-2010 corpus.",
        "But, no sentiment or emotion related annotation is available in the corpus.",
        "Hence, we have annotated the sentiment expressions at word level in a semi-supervised way.",
        "The word level entities are tagged by their coarse and fine grained sentiment tags using the available sentiment related lexical resources.",
        "Then the automatic annotation has been evaluated manually by the authors.",
        "The semi-supervised sentiment annotation agreements were 90.23% for the development set and 92.45% for the test sets respectively.",
        "The tagging of the evaluative expressions or more specifically the sentiment expressions on the Tem-pEval-2010 corpus has been carried out using the available sentiment lexicons.",
        "We passed the sentences through three sentiment lexicons, Subjectivity Wordlists (Banea et al., 2008), SentiWordNet (Baccianella et al., 2010) and WordNet Affect (Strapparava and Valitutti, 2004).",
        "Subjectivity Wordlist assigns words with the strong or weak subjectivity and prior polarities of types positive, negative and neutral.",
        "SentiWordNet, used in opinion mining and sentiment analysis, assigns three sentiment scores such as positive, negative and objective to each synset of WordNet.",
        "WordNet Affect, a small well-used lexical resource but valuable for its affective annotation contains the words that convey emotion.",
        "The algorithm is that, if a word in a sentence is present in any of these resources; the word is tagged as the sentiment expression.",
        "But, if any word is not found in any of them, each word of the sentence is passed through the WordNet Morphological analyzer (Miller, 1990) to identify its root form and the root form is searched through the resources again.",
        "If the root form is found, the corresponding word is tagged as sentiment expression accordingly.",
        "The identified sentiment expressions have been evaluated by the authors and it achieves the precision, recall and F-Score of 73.54%, 86.04% and 79.30%, respectively on a total of 171 test sentences of the TempEval-2010 corpus.",
        "The identification of event words that also express sentiment is straightforward.",
        "But, the problem arises when the event and sentiment expressions are present separately in a sentence and the sentiment is either closely associated with the event or affects it.",
        "In case of the former, we have adopted the approach of lexical equivalence between the event and sentiment entities whereas the co-reference technique has been introduced for resolving the latter case."
      ]
    },
    {
      "heading": "5. Lexical Equivalence between Event and Sentiment Expressions",
      "text": [
        "It is observed that in general the verbs, nouns and adjectives represent events.",
        "The sentences are passed through an open source Stanford Maximum Entropy based POS tagger (Manning and Toutano-va, 2000).",
        "The best reported accuracy for the POS tagger on the Penn Treebank is 96.86% overall and 86.91% on previously unseen words.",
        "Our objective was to identify the event words that also express sentiments.",
        "Hence, we have identified the event words that have also been tagged as the sentiment expressions.",
        "The coverage of these lexical resources in identifying the event sentiment association is shown in Table 1.",
        "On the other hand, not only the adjectives or nouns, the sentiment or emotional verbs play an important role in identifying the sentiment expressions.",
        "Hence, in addition to the above mentioned sentiment resources, we have also incorporated English VerbNet (Kipper-Schuler, 2005) for the automatic annotation process.",
        "VerbNet associates the semantics of a verb with its syntactic frames and combines traditional lexical semantic information such as thematic roles and semantic predicates, with syntactic frames and selectional restrictions.",
        "Verb entries in the same VerbNet class share common syntactic frames and thus they are believed to have the same syntactic behavior.",
        "For example, the emotional verbs \"love\" and \"enjoy\" are members of the admire-31.2-1 class and \"enjoy\" also belongs to the class want-32.1-1.",
        "The XML files of VerbNet are preprocessed to build up a general list that contains all member verbs and their available syntax information retrieved from VerbNet.",
        "The main criterion for selecting the member verbs as sentiment expressions is the presence of \"emotional_state\" type predicate in their frame semantics.",
        "The frequencies of the event words matched against the above said four resources are shown in Table 1.",
        "It has been observed that the adjective events are not identified by the lexical resources as their frequency in the test corpus was very low.",
        "But, the lexical coverage has been improved by 12.76% by incorporating VerbNet."
      ]
    },
    {
      "heading": "6. Co-reference between Event and Sentiment Expressions",
      "text": [
        "The opinion and/or sentiment topics are not necessarily spatially coherent as there may be two opinions in the same sentence on different topics.",
        "Sometimes, the opinions that are on the same topic are separated by opinions that do not share that topic (Stoyanov and Cardie, 2008).",
        "We observe the similar situation in case of associating sentiments with events.",
        "Hence, the hypothesis for opinion topic is established for sentiment events by applying the co-reference technique along with the rhetorical structure.",
        "We have proposed two different systems for identifying the association of sentiments with the events at context level.",
        "The baseline system has been developed based on the object information present in the dependency relations of the parsed sentences.",
        "Stanford Parser (Marneffe et al., 2006), a probabilistic lexicalized parser containing 45 different part of speech (POS) tags of Pen Treebank tagset has been used to get the parsed sentences and dependency relations.",
        "The dependency relations are checked for the predicates \"dobj\" so that the related components present in the predicate are considered as the probable candidates for the events.",
        "If a dependency relation contains both the event and sentiment words, we have considered the presence of co-reference between them.",
        "But, it has been observed that the event and sentiment expressions are also present in two different relations that share a common word element.",
        "Hence, if the event and sentiment words appear in two different relations but both of the relations contain at least one common element, the event and sentiment words are termed as co-referenced.",
        "Overall, the baseline co-reference system achieves the precision, recall and F-Scores of 40.03%, 46.10% and 42.33% for event-sentiment co-reference identification.",
        "For example in the following sentence, the writer's direct as well as indirect emotional intentions are reflected by mentioning one or more topics or events (spent, thought) and their associated sentiments (great).",
        "\"When Wong Kwan spent seventy million dollars for this house, he thought it was a great deal.\"",
        "The baseline co-reference system fails to associate the sentiment expressions with their corresponding event expressions.",
        "Hence, we aimed for the rhetoric structure based co-reference system to identify their association.",
        "The distribution of events and sentiment expressions in different text spans of a sentence needs the analysis of sentential structure.",
        "We have incorporated the knowledge of Rhetorical Structure Theory (RST) (Mann and Thompson 1987) for identifying the events that are co-referred by their corresponding sentiment expressions.",
        "Resources",
        "Noun Adjective Verb #114 #4 #380",
        "Subjectivity Wordlists SentiWordNet WordNet Affect List VerbNet (emotional verbs)",
        "24 -- 35",
        "32 -- 59",
        "12 -- 25 -- -- 79",
        "The theory maintains that consecutive discourse elements, termed text spans, are related by a relatively small set (20-25) of rhetorical relations.",
        "But, instead of identifying the rhetorical relations, the present task acquires the basic and coarse rhetorical components such as locus, nucleus and satellite from a sentence.",
        "These rhetoric clues help in identifying the individual event span associated with the span denoting the corresponding sentiment expression in a sentence.",
        "The text span that reflects the primary goal of the writer is termed as nucleus (marked as \"{ }\") whereas the span that provides supplementary material is termed as satellite (marked as \"[ ]\").",
        "For example, the nucleus and satellite textual spans are shown in the following sentence as,",
        "{Traders said the market remains extremely nervous} because [the wild swings seen on the New York Stock Exchange last week].",
        "The event or topic of an opinion or sentiment depends on the context in which the associated opinion or sentiment expression occurs (Stoyanov and Cardie 2008).",
        "Considering the similar hypothesis in case of events instead of topics, the co-reference between an event and a sentiment expression is identified from the nucleus and/or satellite by positioning the sentiment expression as locus.",
        "We have also incorporated the WordNet's (Miller 1990) morphological analyzer to identify the stemmed forms of the sentiment words.",
        "The preliminary separation of nucleus from satellite was carried out based on the list of frequently used causal keywords (e.g., as, because, that, while, whether etc) and punctuation markers (,) (!)",
        "(?",
        ").The discourse markers and causal verbs are also the useful clues if they are explicitly specified in the text.",
        "The identification of discourse markers from written text itself is a research area (Azar 1999).",
        "Hence, our task was restricted to identify only the explicit discourse markers that are tagged by conjunctive ^} or mark_() type dependency relations of the parsed constituents.",
        "The dependency relations containing conjunctive markers (e.g., conj_and(), conj_or(), conj_but()) were considered for separating nucleus from satellite if the markers are present in between two successive clauses.",
        "Otherwise, the word token contained in the mark_() type dependency relation was considered as a discourse marker.",
        "The list of causal verbs is prepared by processing the XML files of VerbNet.",
        "If any VerbNet class file contains any frame with semantic type as Cause, we collect the member verbs of that XML class file and term the member verbs as causal verbs.",
        "We used a list that contains a total number of 253 causal verbs.",
        "If any clause tagged as S or SBAR in the parse tree contains any causal verb, that clause is considered as the nucleus and the rest of the clauses denote the satellites.",
        "Considering the basic theory of rhetorical structure (Mann and Thompson 1987), the clauses were separated into nucleus and satellite to identify the event and sentiment expressions.",
        "The direct dependency is identified based on the simultaneous presence of locus and the event word in the same dependency relation whereas the transitive dependency is verified if the word is connected to locus and event via one or more intermediate dependency relations.",
        "If the event and sentiment words are together present in either nucleus or satellite, the association between the two expressions is considered as co-referenced.",
        "If they occur in nucleus and satellite separately, but the event and sentiment words are present in at least one direct dependency relation, the expressions are termed as co-referenced.",
        "In the previous example, the event expressions, \"said\" and \"remains\" are associated with the sentiment expression \"nervous\" as both the event expressions share the direct dependency relations \"cop(nervous-7, remains-5)\" and \"ccomp(said-2, nervous-7)\" in the nucleus segment.",
        "Similarly, the event word, \"seen\" and sentiment word \"wild\" are present in the satellite part and they share a direct dependency relation \"partmod(swings-12, seen-13)\".",
        "But, no direct dependency relation is present between the \"nervous\" and \"seen\" or \"said\" and \"wild\" or \"remains\" and \"wild\".",
        "Though the event annotation is specified in the TempEval-2010 corpus, the association between the event and sentiment expressions was not specified in the corpus.",
        "Hence, we have carried out the evaluation manually.",
        "The 200 random samples of the training set that were used in sentiment expression identification task have been considered as our development set.",
        "The Evaluation Vectors (EvalV) are prepared manually from each sentence of the development and test sets.",
        "The vectors <EvExp, SentiExp> are filled with the annotated events and sentiment expressions by considering their association.",
        "The annotation of sentiment expressions using the semi-supervised process has been described in Section 4.",
        "The rule based baseline and rhetoric based co-reference systems identify the event and sentiment expressions from each sentence and stores them in a Co-reference Vector (CorefV).",
        "The evaluation is carried out by comparing the system generated Co-reference Vectors (CorefV) with their corresponding Evaluation Vectors (EvalV).",
        "The evaluation results on 171 test sentences are shown in Table 2.",
        "Table 2: Precision (Prec.",
        "), Recall (Rec.)",
        "and F-Scores (in %) of the event-sentiment co-reference systems",
        "Overall, the precision, recall and F-Scores are co-reference identification using rhetoric clues.",
        "Though the co-reference technique performs satisfactorily for identifying the event-sentiment co-reference, the problem arises in distinguishing the corresponding spans of events from an overlapped text span of multi-word tokens."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "In this present work, we have identified event and sentiment expressions at word level from the sentences of TempEval-2010 corpus and evaluated their association in terms of lexical equivalence and co-reference.",
        "It has been observed that the lexical equivalence based on lexicons performs satisfactorily but overall, the co-reference entails that the presence of indirect affective clues can also be traced with the help of rhetoric knowledge and dependency relations.",
        "The association of the sentiments with their corresponding events can be used in future concerning the time based sentiment change over events."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The work is supported by a grant from the India-Japan Cooperative Programme (DST-JST) 2009 Research project entitled \"Sentiment Analysis where AI meets Psychology\" funded by Department of Science and Technology (DST), Government of India.",
        "Co-reference Approaches",
        "Prec.",
        "Rec.",
        "F-Score (in %)",
        "Baseline System",
        "40.03 46.10 42.33",
        "Rhetoric System",
        "61.25 70.29 65.23"
      ]
    }
  ]
}
