{
  "info": {
    "authors": [
      "Barbara Dunin-Keplicz"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E85-1014",
    "title": "How to Restrict Ambiguity of Discourse",
    "url": "https://aclweb.org/anthology/E85-1014",
    "year": 1985
  },
  "references": [
    "acl-E83-1024"
  ],
  "sections": [
    {
      "text": [
        "We single out a class of prototypes i.e., a class of constructions forcing the obligatory coreference or obligatory noncorefarence.",
        "An essential feature of prototypes is their undistinctiveness.",
        "In this sense they are the most natural and efficient means of communication in discourse.",
        "The non-application of prototype should be well motivated.",
        "This leads to the rule of restricted choice stating that whenever it is possible the application of a prototype should be preferred.",
        "The rule of the restricted choice suggests the general outline of interpreting ambiguous sentences, strictly speaking, the method of ordering admissible interpretations: those which can be equivalently expressed by means of a prototype are less probable.",
        "In other words, the rule of the restricted choice can be regarded as some kind of mechanism ordering the hypotheses for computation."
      ]
    },
    {
      "heading": "INTRODUCTION",
      "text": [
        "The crucial problem in discourse analysis is the appropriate transposition of all expressions occurring in it, into reality (see, for instance, the framework provided by Kamp in (Kamp, 1981)).",
        "Even preliminary analysis shows that one real object can be identified by various surface constructions.",
        "This forces the necessity of dividing surface expressions into classes denoting identical individuals.",
        "The above problem can formally be stated as follows.",
        "To each discourse D we assign some reality which can be understood as a set ID of individuals (semantic discourse domain) together with a set of relations defined on ID.",
        "The semantic discourse domain can be interpreted twofold:",
        "as a set of real objects i.e., objects existing in actual world; 2o as a set of mental objects i.e., objects existing in language user's mind.",
        "Although the first interpretation is more natural, it leads to some ontological problems, concerning the distinction of fictitious and non-fictitious entities.",
        "Since there is no such distinction from linguistic perspective the second interpretation seems better motivated.",
        "The next step is to define syntactic discourse domain, denoted by SD, i.e., a set of discourse expressions referring to individuals (set of individuals).",
        "The mapping assigning individuals to syntactic expressions will be called the reference function and denoted by R. Formally, R : SD 2ID.",
        "Example (D1) John and Peter admire winter.",
        "They are often skiing together.",
        "{\"John\", \"Peter\", \"winter\", \"they\"sD1 - i.John, Peter, winter}",
        "We say that discourse expressions x and y are coreferencial, what we denote by xCy, if and only if they refer to the same set of individuals.",
        "Formally, for each x,y e SUxCy iff R(x) R(y) It is readily verified that C is an equivalence relation.",
        "Obviously each equivalence class of C contains coreferential expressions.",
        "The set of equivalence classes of C will be called the reference state of discourse and denoted by RSD.",
        "Example",
        "(D2) John took a knife.",
        "(RSD2) k\"Johnifi)., knife\".",
        "(D3) John took a knife.",
        "He hurt himself.",
        "(RSD3) {\"John;', \"he\", \"himself\"1),",
        "We can observe here that adding new utterance to the discourse changes its",
        "reference state.",
        "In this sense RSD is a dynamic notion Let us note also that the problem of anaphora solution can be regarded as defining the relation C for the whole discourse.",
        "Both the speaker, while constructing a discourse, and the hearer, while analysing it, try to achieve the identity of RSD at each step of the discourse.",
        "We argue in this paper that to accomplish this effect, the speaker has at his disposal (at each moment) a more restricted set of linguistic constructions than it seems intuitively.",
        "Let us notice that expressions belonging to one equivalence class have various syntactic shapes at different steps of discourse.",
        "It can be shown that the syntactic form of expressions at particular moments is not accidential, i.e., elements of indicated equivalence class are not interchangeable.",
        "PROTOTYPES Recent discourse theories provide several levels of language analysis: morphological, syntactic, semantic and sometimes pragmatic.",
        "Each of these levels determines a characteristic set of notions and mechanisms.",
        "It is assumed here that the analysis of an utterance on each levels of language should yield complete information obtainable by tools available on this level.",
        "Classical anaphor resolvers act on semantic level on discourse analysis.",
        "We take the position that for inflexional languages the coreference relation can be partially described on the syntactic level.",
        "An essential feature of this partial characteristic is defining the coreference relation quite apart from real individuals, i.e. without specyfing the reference function.",
        "To fix some ideas let us consider an utterance containing the noun phrases NP a, NP n. If there is no information regarding coreference, all we can do is to assert that the coreference relation is included between the \"minimal\" relation, i.e., relation identified by the unit equivalence classes NP , NPn and the maximal one, i.e. admitting tting in one class all number-gender agreeable phrases.",
        "We very seldom deal with such a situation in practice.",
        "Almost always we can assign to an utterance a syntactic level information stating obligatory coreference or obligatory noncoreference of some expressions.",
        "The surface constructions carrying this kind of information with respect to pronouns and zero pronouns (in the case of elided subject) will be called prototypes.",
        "In other words prototypes can be regarded as syntactic means forcing obligatory coreference or obligatory noncoreference between pronouns or zero pronouns and other surface expressions.",
        "Let us consider few instances of prototypes.",
        "Because the ideas presented here are implemented for the Polish language, the notion of prototype will be illustrated with a number of Polish sentences.",
        "An elided subject specific for inflexional languages can be observed here.",
        "It is denoted by a Because elided subject expresses some aspects of thematic continuity, its interpretation seems to be an important step during discourse analysis.",
        "English translations of presented examples preserve their syntactic shape.",
        "Unfortunately they are sometimes incorrect as English sentences.",
        "(1) Piotr obudzil siei pl podszedl do okna, Q2 otworzyl je i 03 wyskoczyt.",
        "Peter woke up, pi.",
        "came to the window, 02 opened it and 03 jumped out.",
        "Expressions: Peter, 01, 02, 03 are coreferentiaL Another interpretation is unadmissible.",
        "In (1) we deal with obligatory coreference of expressions (denoted by (2) 01.",
        "Obudzik sie, 02 podszecik do okna, (63 otworzyt je wyskoczyl.",
        "01 Woke up, 02 came to the window, 03 opened it and 04 jumped out.",
        "In (2), similarly as in (1) (co-ordinate clauses) and in (3), (4) (subordinate clauses) the only acceptable interpretation is explicitely showed.",
        "z(3) Zanim 01 -wys edt, Q2 zgasii gwiatto.",
        "Before 01 left, 02 turned the light off.",
        "(4) 01 Zgasit iwiatto, zanim 02 wyszedt.",
        "91 Turned the light off, before 02 left.",
        "The next examples concern the obligatory noncoreference of expressions (denoted by a+b).",
        "(5) Ona lubi She likes her.",
        "(6) 0 zap-ytat Piotra; czy Jan pOjdzie do teatru.",
        "0 Asked Peter, whether John would go to the theatre.",
        "(7 ) 0 Usiadt do stolu, a Jan nalal mu wina.",
        "0 Sat at the table, and John poured him out some wine.",
        "The above examples pose the question of how the class of prototypes should be singled out.",
        "This problem can be solved by specifying a collection of rules concerning the obligatory coreference and obligatory noncoreference.",
        "The exact format of these rules is beyond the scope of this paper.",
        "For inflexional languages they depend on the type of considered sentence, the sentence-level functions of considered phrases and their syntactic shape.",
        "As a simple example of such a rule let us consider the basic criterion of excluding coreference: If the object is expressed by means of a reflexive pronoum, then it is coreferential with the subject; in other cases the referential identity of the subject and object is excluded.",
        "This criterion can be applied both for determinig coreferents of objects - blocking the subject, and in testing the possible antecedents of the subject - blocking the objects.",
        "This is exactly the case we have in (5).",
        "THE RULE OF RESTRICTED CHOICE A conclusive criterion of being a prototype results from analysing a given sentence in isolation.",
        "If it is possible to assert or to exclude the referential identity of some expressions of the sentence, indepedently of its context then the sentence can be regarded as an instance of prototype.",
        "An essential feature of prototypes is that they are completely indistinctive and in this sense they are the most proper tool for expressing a certain relationship in the utterance.",
        "This strong relationship makes it possible to eliminate some interpretations, which in other cases should be regarded as probable too.",
        "If we agree that achieving unambiguity of discourse is the major goal both for the speaker and the hearer, then the non-application of prototype, as the most natural and efficient means of communication should be well motivated.",
        "When such a special reason is lacking, the speaker should apply a a prototype.",
        "Under this assumption the set of linguistic tools available to the speaker is restricted.",
        "The notion of prototype can be naturally applied on the syntactic level of discourse analysis to limit the number of hypotheses for further consideration.",
        "But it can also be useful on the higher levels to interpret ambiguous discourses.",
        "Strictly speaking the properties of prototype suggest the general outline of interpreting ambiguous sentences, more precisely a method of ordering possible interpretations with respect to their plausibility.",
        "From the set of possible interpretations of a sentence, those that can be equivalently expressed by means of prototype, should be regarded as less plausible.",
        "The justification of this choice is clear: if the speaker wanted to point out such an interpretation, he would naturally achieve it by applying a prototype.",
        "In view of the obove we can formulate the rule of restricted choice.",
        "It states that whenever it is possible the application of a prototype should be preferred.",
        "It is important to notice that the rule of restricted choice can be viewed from the perspective both of the speaker contructing the discourse and the hearer modelling it.",
        "The speaker should apply prototypes whenever it is possible.",
        "The hearer should take this fact into consideration.",
        "Let us try to interpret the concrete sentences with the help of the rule of restricted choice.",
        "(8) Zanim wyszedt, Jan zgasit 4wiatto.",
        "the light off.",
        "There are two interpretations here:",
        "(9) Zanim 01 wyszedt, Jan zgasit awiatto.",
        "Before 01 left, John turned the light off.",
        "/I\" (10) Zanim 01 wyszedl, Jan zgasit gwiatto.",
        "Before 01 left, John turned the light off.",
        "(0 denotes the reference to the context).",
        "But the first interpretation can be expressed by means of prototypes.",
        "(P1.)",
        "Zanim 01 wyszedl, 02 zgasit iwiatto.",
        "Before 01 left, 02 turned the light off.",
        "(P2) Jan zanim wyszedl, 01. zgasit gwiatto.",
        "John before left, 01. turned the light off.",
        "According to the rule of restricted choice the first interpretation should be regarded as less probable (note that it can be expressed by prototype).",
        "Hence the second interpretation should be chosen.",
        "Another example is more complicated.",
        "(11) Zanim on wyszedt, 01 zapytat go, czy 02 pOjdzie do kina.",
        "Before he left , 01 had asked him, masc whether 02 would have gone to the cinema.",
        "In the embedded clause 01 zapytat go there acts the rule of obligatory noncoreference excluding the referential identily of subject and object in this sentence: Zanim on wyszedt, 01 zapytat go, czy 02 pOjdzie do kina.",
        "According to our definition the above sentence is an instance of a prototype.",
        "Excluding the coreference of pointed expressions decreases the numer of possible interpretations, but does not clear up all referential relationships in this ambiguous sentence.",
        "Although there are no further syntactic premises to resolve this ambiguity we can specify the less probable interpretation by appying the rule of restricted choice.",
        "If the speaker wanted to express the following sense: (1.2) Zanim X wyszedl, X zapytat go, czy 01 pcijdzie do kina.",
        "he should have used the following (structural) prototype: (1.3) Zanim 1. zapytat go, czy 02 pOjdzie do kina.",
        "(In such a sequence of clauses in the sentence the rule of obligatory coreference demandes that 0 and 01 should be identified).",
        "It follows therefore that the interpretation: (14) Zanim on wyszed!).,01.",
        "zapytat go, czy 02 pOjdzie do kina.",
        "is the less probable and should be computed as the last one."
      ]
    },
    {
      "heading": "NONMONOTONICITY OF THE RULE OF RESTRICTED CHOICE",
      "text": [
        "Consider the following example: (15) Kiedy 01 podszedt do Piotra, byt on zdenerwowany.",
        "When 01 came near Peter, he was nervous.",
        "There are two possible interpretations (1.6) Kiedy 01. podszedt do Piotra, byl on zdenerwowany.",
        "(1.7) Kiedy podszedt do Piotra, byt on zden erwowany.",
        "Because the second interpretation can unambiguously be expressed by the prototypical construction: (1.8) Kiedy 01 podszedt do Piotra, byt ,02 zdenerwowany.",
        "When ;?",
        ")1 came near Peter 02 was nervous.",
        "according to the rule of restricted choice the first interpretation should be preferred.",
        "The rule of restricted choice is based on the assumption that whenever it is possible people use unambiguous constructions.",
        "Although usually valid this assumption cannot be regarded as general truth.",
        "This means that the rule of restricted choice enables one to jump to plausible but not ironclad conclusions.",
        "Typically, such conclusions can be invalidated when new information is available.",
        "In our example the preferred interpretation might he overturned when we extend our discourse as follows: (1.9) Kiedy 01 podszedt do Piotra, byt on zdenerwowany.",
        "Byt to wynik wczegniejszej ktOtni z Piotrem.",
        "When 01 came near Peter he was nervous.",
        "That was the result of an earlier quarrel with Peter.",
        "The necessity of changing the preferred interpretation follcws from the fact that new informa.tion is available.",
        "The prcperty of drawing playsible but defeasible inferences characterizes non-monotonic reasoning.",
        "Various forms of this kind of reasoning are now being developed (see (AAAI-84) ).",
        "It is now widely recognized that discourse understanding reguires nonmonotonic mechanisms in many aspects.",
        "The rule of restricted choice is an example of such a nonmonotonic tool."
      ]
    },
    {
      "heading": "CONCLUSIONS",
      "text": [
        "(1.)",
        "While constructing discourse the speaker wants the hearer to understand him correctly.",
        "Even if he uses ambiguous constructions he intends to communicate the unique interpretations, and not to create in hearer 's mind a set of all possible hypotheses.",
        "It follows that constructing NLU systems, which generate all admissible interpretations, contradicts common sense reasoning.",
        "So the essential problem is to determine methods of choosing the most appropriate interpretation.",
        "If this plausible interpretation fails, it should be revised.",
        "(2) Employing the rule of restricted choice assumes the existence of some mechanism which determines whether a given construction can be regarded as a prototype.",
        "This can be achieved by specifying a set of rules qualifying the obligatory coreference and noncoreference of referring expressions.",
        "A partial set of such rules for the Polish language has been presented in (Dunin-Kqplicz, 1983)."
      ]
    },
    {
      "heading": "ACKNOWLEDGEMENT",
      "text": [
        "I would like to thank Dr Witold Lukaszewicz for helping me to clarify ideas presented in this paper."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
