{
  "info": {
    "authors": [
      "Philip R. Cohen",
      "Hector J. Levesque"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P85-1007",
    "title": "Speech Acts and Rationality",
    "url": "https://aclweb.org/anthology/P85-1007",
    "year": 1985
  },
  "references": [
    "acl-J80-3003",
    "acl-J84-2002"
  ],
  "sections": [
    {
      "heading": "1 Abstract",
      "text": [
        "This paper derives the basis of a theory of communication from a formal theory of rational interaction.",
        "The major result is a demonstration that illocutionary acts need not be primitive, and need not be recognized.",
        "As a test case, we derive Searle's conditions on requesting from principles of rationality coupled with a Oricean theory of imperatives.",
        "The theory is shown to distinguish insincere or nonserious imperatives from true requests.",
        "1.:xtensions to indirect speech acts, and ramifications for natural language systems are also briefly discussed."
      ]
    },
    {
      "heading": "2 Introduction",
      "text": [
        "The unifying theme of much corrent pragmatics and discourse research is that the coherence of dialogne is to be found in the interaction of the conversant,: plans.",
        "That is, a speaker is regarded as planning his utterances to achieve his goals, which may involve influencing a hearer by the use of communicative or speech acts.",
        "On receiving an utterance realizing such an action, the hearer attempts to infer the speaker's goal(s) and to understand how the iitterance furthers them.",
        "The hearer then adopts new goals (e.g.. to respond to a reqoest.",
        "to clarify the previous speaker's to terance or ;.!",
        "'o al) anti plans his Own utterances tI) achieve those.",
        "A conversation ensues.",
        "This view of language as purposeful action has pervaded 1'omputational Linguistics research, anti has resulted in numerous prototype systems [1, 2, 3, 5, 25, 271.",
        "However, the formal foundations underlying these systems have been unspecified or underspeciiied.",
        "In this state of affairs, one cannot characterize what a system should do independently from what it does.",
        "This paper begins to rectify this situation by presenting a formalization of rational interaction.",
        "upon which is erected the beginnings of a theory of communication and speech acts.",
        "Interaction is derived from principles of rational action for individual agents, as well as principles of belief and goal adoption among agents.",
        "The basis of a theory of purposeful communication thus _"
      ]
    },
    {
      "heading": "2.1 Speech Act Theory",
      "text": [
        "Speech act theory was originally conceived as part of action theory.",
        "Many of Austin's [.11 insights about the nature of speech acts, felicity conditions, anti modes of failure apply equally well to non-communicative actions.",
        "Searle [26] repeatedly mentions that many of the conditions he attributes to various illocutionary acts (such as requests anti questions) apply more generally to non-communicative action.",
        "However, researchers have gradually lost sight of their roots.",
        "In recent work [2S] illocutionary acts are formalized, and a logic is proposed, in which properties of IA's (e.g., preparatory conditions\" and modes of achieve-ment') are primitively stipulated.",
        "rather than derived from more basic principles of action.",
        "We believe this approach misses significant generalities.",
        "This paper shows how to derive properties of illocutionary acts from principles of rationality, updating the formalism of [10].",
        "Work in Artificial Intelligence provided the first formal grounding of speech act theory in terms of planning, and plan recognition.",
        "(laminating in Perrault and Allen', (21:1 theory of indirect speech acts.",
        "Mitch of owr research is inspired 1)% their analyses.",
        "llowe%er, one to ingredient of their theory ran be shown to be redundant.",
        "[101 illocutionary acts.",
        "All the inferential power of the recognition of their illocutionary acts was already available in other -operators'.",
        "Nevertheless, the natural language systems based on this approach [I, 51 always had to recognize which illocutionary act was performed in order to respond to a user's utterance.",
        "Since the illocutionary acts were unnecessary for achieving their effects, so too was their recognition.",
        "The stance that.",
        "illocutionary acts are not primitive, and need not be recognized, is a lib-rating one.",
        "Once taken, it becomes apparent that many of the difficulties in applying speech act theory to discourse, or to computer systems, stem from taking these acts too seriously i.e., too primitively."
      ]
    },
    {
      "heading": "3 Form of the argument",
      "text": [
        "propositional attitude expressing the speaker's goal.",
        "This attitude becomes true as a result of uttering a sentence with that feature.",
        "Because of certain general principles governing beliefs and goals, other causal consequences of the speaker's having the expressed goal can be derived.",
        "Such derivations will be \"summarized\" as lemmas of the form \"If (conditions) are true, then any action making (antecedent) true also makes (consequent) true.\"",
        "These lemmas will be used to characterize illocutionary acts, though they are not themselves acts.",
        "For example, the lemma called REQUEST will characterize a derivation that shows how a hearer's knowing that the speaker has certain goals can cause the hearer to act.",
        "The conditions licensing that chain will be collected in the REQUEST lemma, and will be shown to subsume those stipulated by Searle [261 as felicity conditions.",
        "However, they have been derived here from first principles, and without the need for a primitive action of requesting.",
        "The benefits of this approach become clearer as other illocutionary acts are derived.",
        "We have derived a characterization of the speech act of informing, and have used it in deriving the speech act of questioning.",
        "The latter derivation also allows us to distinguish real questions from teacher/student questions, and rhetorical questions.",
        "However, for brevity, the discussion of these speech acts has been omitted.",
        "Indirect speech acts can be handled within the framework.",
        "although, again, we cannot present the analyses here.",
        "Briefly, axioms similar to those of Perrault and Allen [221 can be supplied enabling one to reason that an agent has a goal that q, given that he also has a goal p. When the p's and q's are themselves goals of the hearer (i.e.. the speaker is trying to get the hearer to do something), then we can derive a set of lemmas for indirect requests.",
        "Many of these indirect request lemmas correspond to what have been called 'short-circuited\" implicatures.",
        "which, it was suggested [211 underlie the processing of utterances of the form \"Can you do X?\".",
        "'Do you know y?",
        "\", etc.",
        "Lemma formation and lemma application thus provide a familiar model of -hort-circuiting.",
        "Furthermore, this approach shows how one ran use general purpose reasoning in concert with conventionalized forms (e.g., how one can reason that Can you reach the salt\" is a request to pass the salt), a problem that has plagued most, theories of speech acts.",
        "The plan for the paper is to construct a formalism based on a theory of action that is sufficient for characterizing a request.",
        "Most of the work is in the theory of action, as it should he."
      ]
    },
    {
      "heading": "4 The Formalism",
      "text": [
        "To achieve these goals we need a carefully worked out (though perhaps incomplete) theory of rational action and interaction.",
        "Vie theory wil) be expressed in a logic whose model theory is based (loosely) on a possible-worlds semantics.",
        "We shall propose a logic with four primary modal operators -- 13ELief, LIMB, GOAL.",
        "and AFTER.",
        "With these, we shall characterize what agents need to know to perform actions that are intended to achieve their goals.",
        "The agents do so with the knowledge that other agents operate similarly.",
        "Thus, agents have beliefs about (e!",
        "her's gcals, and they have goals to influence others' beliefs and goals.",
        "The integration of these operators follows that of Moore POI, who analyzes how an agent's knowledge affects and is affected by his actions, by meshing a possible-worlds model of knowledge with a situation calculus model of action [181.",
        "By adding GOAL, we can begin to talk about an agent's plans, which can include his plans to influence the beliefs and goals of others.",
        "Intuitively, a model for these operators includes courses of events (i.e., sequences of primitive acts) that characterize what has happened.",
        "Courses of events (c.o.e.",
        "'s) are paths through a tree of possible future primitive acts, and after any primitive act has occurred, one can recover the course of events that led up to it.",
        "C.o.e.",
        "'s can also be related to one another via accessiblity relations that partake in the semantics of DEL and GOAL.",
        "Further details of this semantics must await our forthcoming paper [171.",
        "As a general strategy, the formalism will be too strong.",
        "First, we have the usual consequential closure problems that plague possible-worlds models for belief.",
        "These, however, will be accepted for the time being.",
        "Second, the formalism will describe agents as satisfying certain properties that might generally be true, but for which there might be exceptions.",
        "Perhaps a process of non-monotonic reasoning could smooth over the exceptions, but we will not attempt to specify such reasoning here.",
        "Instead, we assemble a set of basic principles and examine their consequences for speech act use.",
        "Third, we are willing to live with the difficulties of the situation calculus model of action – e.g., the lack of a way to capture true parallelism, and the frame problem.",
        "Finally, the formalism should be regarded as a description or specification of an agent, rather than one that any agent could or should use.",
        "Our approach will be to ground a theory of communication in a theory of rational interaction, itself supported by a theory of rational action, which is finally grounded in mental states.",
        "Accordingly, we first need to describe the, behavior of BEL, BMB.",
        "GOAL and AFTER.",
        "Then, these operators will be combined to describe how agents' goals and plans influence their actions.",
        "Then, we characterize how having beliefs about the beliefs and goals of others can affect one's own beliefs and goals.",
        "Finally, we characterize a request.",
        "To be more spee.ific, here are the primitives that will be used, with a minimal explanation."
      ]
    },
    {
      "heading": "4.1 Primitives",
      "text": [
        "Assume p, q, ... are schema variables ranging over wffs, and a, b .",
        "are schematic varia:Iles ranging over acts.",
        "Then the following are wffs."
      ]
    },
    {
      "heading": "4.1.1 Miffs P (co v q)",
      "text": [
        "(AFTER a p) - p is true in all courses of events that obtain from act as happening.",
        "', (if a denotes a halting act)."
      ]
    },
    {
      "heading": "believed by x and y.",
      "text": [
        "=1\"%sr thin paper, the only events that will be considered are primitive acts.",
        "'That is, p is true in all c.o es resulting from concatenating the current with the c.o.e.",
        "denoted by a."
      ]
    },
    {
      "heading": "4.1.2 Action Formation",
      "text": [
        "If a, b, c, d range over sequences of primitive acts, and p is a wff.",
        "then the following are complex act descriptions:",
        "The meta-symbol will prefix formulas that are theorems, i.e.. that are derivable.",
        "Properties of the formal system that will be assumed to hold will be termed Propositions.",
        "Propositions will be both formulas that should always be valid, for our forthcoming semantics, and rules of inference that should be sound.",
        "No attempt to prove or validate these propositions here, but we do so in [I71."
      ]
    },
    {
      "heading": "4.2 Properties of Acts",
      "text": [
        "We adopt the usual axioms characterizing how complex actions behave under AFTER, as treated in a dynamic logic (e.g., 120)) namely,"
      ]
    },
    {
      "heading": "Proposition 1 Properties of romplez arts",
      "text": [
        "(AFTER a:h p) s (AFTER a (AFTER b p)).",
        "(AFTER alb p) a (AFTER a p) A (AFTER b p).",
        "(AFTER p?",
        "q) p A q."
      ]
    },
    {
      "heading": "AFTER and DONE will have the following additional properties:",
      "text": [
        "Proposition 2 V act (AFTER act (DONE x act)) 4 Proposition 3 Va ((DONE (AFTER a p)i:a) pl Proposition 4 If oiD11 then Nia (DONE n1;a) D (DONE 3?",
        ";a) Proposition 5 p s (DONE p?)",
        "Proposition 8 (DONE [(p D q) A p(?)",
        "D (DONE q?)",
        "Our treatment of acts requires that we deal somehow with the 'frame problem' [181.",
        "That is.",
        "we must characterize not only what changes as a result of doing an action, but also what does not change.",
        "To approach this problem, the following notation will be convenient: Definition 1 (PRESERVES a p) p D (AFTER a p) Of course, all theorems are preserved.",
        "Temporal concepts are introduced witl.",
        "DONE (for past happenings) and O (read 'eventually\").",
        "To say that p was true at some point in the past, we use 3a (DONE p?;a).",
        "is to be regarded in the 'branching time' sense [111, and will be defined more rigorously in [171.",
        "Essentially, Op is true ilT for all infinite extensions of any course of events there is a finite prefix satisfying p. Op and 0 – p are jointly satisfiable.",
        "Since Op starts \"now\", the following property is also true,",
        "Also, we have the following rule of inference: Proposition 8 If I ct 1;1 then P(cf V p) D v p)"
      ]
    },
    {
      "heading": "4.3 The Attitudes",
      "text": [
        "Neither BEL, BMB, nor GOAL characterize what an agent actively believes, mutually believes (with someone else), or has as a goal, but rather what is implicit in his beliefs, mutual beliefs, and goals.",
        "5 That is, these operators characterize what the world would he like if the agent's beliefs and mutual beliefs were true, and if his goals were made true.",
        "Importantly.",
        "we do not include an operator for wanting, since desires need not be consistent.",
        "We assume that once an agent ha_s sorted out his possibly inconsistent desires in deciding what he wishes to achieve, the worlds he will be striving for are consistent.",
        "conversely, recognition of an agent's plans need not.",
        "consider that agent's possibly inconsistent desires.",
        "Furthermore, there is also no explicit operator for intending.",
        "If an agent intends to bring about p, the agent is usually regarded as also being able to bring about p. fly using GOAL, we will be able to reason about the end state the agent is aiming at separately from our reasoning about his ability to achieve that state.",
        "For simplicity, we assume the usual Hintikka axiom schemata for BEL [151, and we introduce KNOW by definition: Definition 2 (KNOW x p) p A (BEL x p)"
      ]
    },
    {
      "heading": "4.3.1 Mutual Belief",
      "text": [
        "Human communication depends crucially on what is mutually believed [I, 6, 7, 9, 22, 23, 241.",
        "We do not use the standard definitions, but employ (13MI3 y x p), which stands for y's belief that it is mutually believed between y and x that p. (13M13 y x p) is true if (BEL y [p A (BMB x y p)1).",
        "6 BMB has the following properties:",
        "'For an exploration of the issues involved in explicit vs. implicit belief, see 061.",
        "'Notice that (BMB y x p) A (BMB x y p).",
        "'This definition is not entirely correct, but is adequate for present purposes."
      ]
    },
    {
      "heading": "4.3.2 Goals",
      "text": [
        "For GOAL, we have the following properties: Proposition 12 (GOAL x (GOAL x p)) 7 (GOAL x p) If an agent thinks he has a goal, then he does.",
        "The following two derived rules are also useful:",
        "More properties of GOAL follow."
      ]
    },
    {
      "heading": "4.4 Attitudes and Rational Action",
      "text": [
        "Next, we must characterize how beliefs, goals, and actions are related.",
        "The interaction of BEL and AFTER will be patterned after Moore's analysis [201.",
        "In particular, we have:",
        "Agents know what they have done.",
        "Moreover, they think certain effects of their own actions are achieved:",
        "The major addition we have made is GOAL.",
        "which interacts tightly with the other operators.",
        "We will say a rational agent only adopts goals that are achievable, and accepts as 'desirable\" those states of the world that are inevitable.",
        "To characterize inevitabilities, we have Definition 5 (ALWAYS p) la (AFTER a p) This says that no matter what happens, p is true.",
        "Clearly, we want Proposition 19 then (DEL.",
        "x (ALWAYS a)) That is, theorems are believed to be always true.",
        "Another property we want is that no sequence of primitive acts is forever ruled out from happening.",
        "Proposition 20 I Vs (ACT a) D -(ALWAYS -(DONE a)), where (ACT a)-4!",
        "-(AFTER a --(DONE a)) One important variant of ALWAYS is (ALWAYS x p) (relative to an agent), which indicates that no matter what that agent does, p is true.",
        "The definition of this version is: Definition 8 (ALWAYS x p) Va (RESULT x a p) A useful instance of ALWAYS is (ALWAYS pPq) in which no matter what happens, p still implies q.",
        "We can now distinguish between p D 'is being logically valid, its being true in all courses of events, and its merely being true after some event happens.",
        "'Notice that if pDci is true (or even believed) but (GOAL x pDq) is not true, we should not reach this conclusion since some act could make it false.",
        "What an agent believes to be inevitable is a goal (he accepts what he cannot change).",
        "and conversely (almost), agents do not adopt goals that they believe to be impossible to achieve – ",
        "This gives the following useful lemma:"
      ]
    },
    {
      "heading": "Lemma 1 Inevitable Consequences",
      "text": [
        "(GOAL x p) A (BEL x (ALWAYS pDci )) D (GOAL x q) Proof By Proposition 21, if an agent believes poq is always true, he has it as a goal.",
        "Hence by Proposition 14, q follows from his goals.",
        "This lemma states that if one's goal is a c.o.e.",
        "in which p holds, and if one thinks that no matter what happens, ppq, then one's goal is a c.o.e.",
        "in which q holds.",
        "Two aspects of this property are crucially important to its plausibility.",
        "First, one must keep in mind the 'follows from\" interpretation of our propositional attitudes.",
        "Second, the key aspect of the connection between p and q is that no one can achieve p without achieving q.",
        "If someone could do so, then q need not be true in a c.o.e.",
        "that satisfies the agent's goals.",
        "Now, we have the following as a lemma that will be used in the speech act derivations: Lemma 2 Shared Recognition",
        "The proof is a straightforward application of Lemma 1 and Propositions 9 and 10."
      ]
    },
    {
      "heading": "4.4.2 Persistent goals",
      "text": [
        "In this formalism, we are attempting to capture a number of properties of what might be called \"intention\" without postulating a primitive concept for 'intend\".",
        "Instead, we will combine acts, beliefs.",
        "goals, and a notion of commitment built out of more primitive notions.",
        "To eapture one grade of commitment than an agent might have towards his goals, we define a persistent goal.",
        "P-GOAL, to he one rhat the agent will not give up until he thinks it has been satisfied, or until he thinks he cannot achieve it.",
        "Now, in order to state constraints on c.o.e.",
        "'s we define: Definition 7 (PREREQ x p q) Ve (RESULT x c q) 7 3 a (a c) A (RESULT x a p) This definition states that p is a prerequisite for x's achieving q if all ways for x to bring about q result in a course of events in which p has been true.",
        "Now, we are ready for persistent goals:",
        "Persistent goals are ones the agent will replan to achieve if his earlier attempts to achieve it fail to do so.",
        "Our definition does not say that an agent must give up his goal when he thinks it is satisfied.",
        "since goals of maintenance are allowed.",
        "All this says is that somewhere along the way to giving up the persistent goal, the agent had to think it was true (or belieVe it was impossible for him to achieve).",
        "Though an agent may be persistent, he may be foolishly so because he has no competence to achieve his goals.",
        "We characterize competence below."
      ]
    },
    {
      "heading": "4.4.3 Competence",
      "text": [
        "People are sometimes experts in certain fields, as well as in their own bodily movements.",
        "For example.",
        "a competent electrician will form correct plans to achieve world states in which \"electrical\" states of affairs obtain.",
        "Most adults are competent in achieving world states in which their teeth are brushed, etc.",
        "We will say an agent is COMPETENT with respect to p if, whenever he thinks p will true after some action happens, he is correct:",
        "Finally, given all these properties we are ready to describe rational agents."
      ]
    },
    {
      "heading": "4.5 Rational Agents",
      "text": [
        "Below are properties of ideally rational agents who adopt persistent goals.",
        "First, agents are careful: they do not knowingly and deliberately make their persistent goals impossible for them achieve.",
        "In other words, no deliberately shooting onesself in the foot.",
        "Now, agents are cautious in adopting persistent goals, since they must eventually come to some decision about their feasibility.",
        "We require an agent to either come up with a \"plan\" to °Because of Proposition 2. all Proposition 23 says is that if a competent agent.",
        "believes his own primitive act halts, it will.",
        "'Notice that it is crucial that p be true in the same world in which the agent does act, hence the use of •p7;act\" achieve them – a belief of some act (or act sequence) that it achieves the persistent goal – or to believe he cannot bring the goal about.",
        "That is, agents do not adopt persistent goals they could never give up.",
        "The next Proposition will characterize this property of P-GOAL.",
        "But, even with a correct plan and a persistent goal.",
        "there is still the possibility that the competent agent never executes the plan in the right circumstances – some other agent has changed the circumstances, thereby making the plan incorrect.",
        "If the agent is competent, then if he formulates another plan, it will be correct for the new circumstances.",
        "But again, the world could change out from under him.",
        "Now, just as with operating systems, we want to say that the world is 'fair\" - the agent will eventually get a chance to execute his plans.",
        "This property is also characterized in the following Proposition:",
        "where p (DEL x (RESULT x act' q)) We now give a crucial theorem: Theorem 1 Consequences of a persistent goal – If someone has a persistent goal of bringing about p, and bringing about p Is within his area of competence, then eventually either p becomes true or he will believe there is nothing that can be done to achieve",
        "Since the agent has a persistent goal.",
        "he eventually will either find and execute a plan, or will believe there is nothing he can do to achieve the goal.",
        "Since he is competent with respect to p, the plans he forms will be correct.",
        "Since his plan act' is correct, and since any other plans he forms for bringing about p are also correct, and since the world is 'fair', eventually either the agent executes his correct plan, making p true, or the agent comes to believe he cannot achieve p. A more rigorous proof can be found in the Appendix.",
        "This theorem is a major cornerstone of the formalism, telling us when we can conclude Op, given a plan and a goal.",
        "and is used throughout the speech act analyses.",
        "If an agent who is not COMPETENT with respect to p adopts p as a persistent goal, we cannot conclude that eventually either p will be true (or the agent will think he cannot bring it about), since the agent could forever create incorrect plans.",
        "If the goal is not persistent, we also cannot conclude Op since the agent could give it up without achies,ing it.",
        "The use of 0 opens the formalism to McDermott's 'Little Neil\" paradox (191.",
        "In our context, the problem arises as follows: First, since an agent has a persistent goal to achieve p, IlLittle Nell is tied to the railroad tracks, and will be mashed by the next train.",
        "Dudley Doright is planning to save her.",
        "McDermott claims that, according to various Al theories of planning, he never will, even though he always knows just what to do.",
        "and we assume here he is always competent with respect to p, p is true.",
        "But, when p is of the form Oq (e.g., 0(SAVED LITTLE-NELL)), 00q is true, so Oq is true as well.",
        "Let us assume the agent knows all this.",
        "Hence, by the definition of P-GOAL, one might expect the agent to give up his persistent goal that 0q, since it is already satisfied!",
        "On the other hand, it would appear that Proposition 25 is sufficient to prevent the agent from giving up his goal too soon, since it states that the agent with a persistent goal must act on it, and, moreover, the definition of P-GOAL does not require the agent to give up his goal immediately.",
        "For persistent goals to achieve 0q.",
        "within someone's scope of competence, one might think the agent need \"only\" maintain Oq as a goal, and then the other properties of rationality force the agent to perform a primitive act.",
        "Unfortunately, the properties given so far do not yet rule out Little Nell's being mashed, and for two reasons.",
        "First, NIL denotes a primitive act – the empty sequence.",
        "Hence, doing it would satisfy Proposition 25, but the agent never does anything substantive.",
        "Second, doing anything that does not affect q also satisfies Proposition 25, since after doing the unrelated act.",
        "Oq is still true.",
        "We need to say that the agent eventually acts on q!",
        "To do so, we have the following property:",
        "That is.",
        "eventually the agent will have the persistent goal that q, and by Proposition 25. will act on it.",
        "If he eventually comes to believe he cannot bring about q, he eventually comes to believe he cannot bring about eventually q as well, allowing him to give up his persistent goal that eventually q."
      ]
    },
    {
      "heading": "4.6 Rational Interaction",
      "text": [
        "This ends our discussion of single agents.",
        "We now need to characterize rational interaction sufficiently to handle a simple re-tie-sst.",
        "First, we discuss cooperative agents, and then the effects of uttering sentences.",
        "4.8.1 Properties of Cooperative Agents We describe agents as sincere, helpful, and more knowledgeable than others about the truth of some state of affairs.",
        "Essentially, these concepts capture (quite simplistic) constraints on influencing someone else's `whet's and goals, and on adopting the beliefs and goals of someone eke as one's own.",
        "More refined versions are certainly desirable.",
        "Ultimately.",
        "we expect such properties of cooperative agents, as embedded in a theory of rational interaction.",
        "to provide a formal description of the kinds of conversational behavior (',rice [HI describes with his 'conversational maxims\".",
        "First, we will say an agent is SINCERE with respect to p if whenever his goal is to get someone else CO 5t1ieve p, his goal is in fact to get, that person to know p.",
        "An agent is HELPFUL to another if he adopts as his own persistent goal another agent's goal that he eventually do something (provided that potential goal does not conflict with his own).",
        "Finally, we need to describe the effects of tittering sentences with certain 'features' 1141, such as mood.",
        "In particular, we need to characterize the results of uttering imperative, interrogative, and declarative sentences 12 Our descriptions of these effects will be similar to Cltices's 1131 and to Perrault and Allen's [221 'surface speech acts'.",
        "Many times, these sentence forms are not used literally to perform the corresponding speech acts (requests, questions, and assertions).",
        "The following is used to characterize uttering an imperative:",
        "The act IIMPEH.",
        "speaker hearer 't:I1 stands for 'make p true'.",
        "Proposition 27 states that if it is mutually known that y is attending to a, 13 then the result of tittering an imperative to y to make it the case that y has done action act is that y thinks it is mutually believed that the speaker's goal is that y should think his goal is for y to form the persistent goal of doing act.",
        "We also need to assert that IMPER preserves sincerity about the speaker's rnals and helpfulness.",
        "These restrictions could be loosened.",
        "hut maintaining them is simpler.",
        "All t ;ricean 'feature' based theories of communication need to account for cases in which a speaker uses an utterance with a feature, but does not have the attitudes (e.g.. beliefs, and goals) \"However, we can only present the analysis of imperatives here.",
        "\"If it is not mutually known that y is attending, for example.",
        "if the speaker is not speaking to an audience, then we do riot say what the result of uttering an imperative is.",
        "usually attributed to someone uttering sentences with that feature.",
        "Thus, the attribution of the attitudes needs to be context-dependent.",
        "Specifically, proposition 28 needs to be weak enough to prevent nonserious utterances such as \"go jump in the lake' from being automatically interpreted as requests even though the utterance is an imperative.",
        "On the other hand, the formula must be strong enough that requests are derivable."
      ]
    },
    {
      "heading": "5 Deriving a Simple Request",
      "text": [
        "In making a request.",
        "the speaker is trying to get the hearer to do an act.",
        "We will show how the speaker's uttering an imperative to do the act leads to its eventually being done.",
        "What we need to prove is this:",
        "We will give the major steps of the proof in Figure I. and point to their justifications.",
        "The full-fledged proofs are left to the energetic reader.",
        "All formulas preceded by a • are supposed it, be true just prior to performing the IMPER, are preserved by it.",
        "and thus are implicitly conjoined to formulas 2 - 9.",
        "By their placement in the proof, we indicate where they are necessary for making, the deductions.",
        "Essentially, the proof proceeds as follows: If it is mutually known that y is attending to x, and y thinks it is mutually believed that the •-condit ions hold, then x's uttering an imperative to y to do some action results in formula (2).",
        "Since it is mutually believed x is sincere about his goals, then (1) it is mutually believed his goal truly is that y form a persistent goal to In the act.",
        "Since everyone is always competent to do acts of which they are the agent.",
        "(4) it is mutually believed that the act will eventually be done, or y will think it is forever impossible to do.",
        "But since no halting act is forever impossible to do, it is (5) mutually believed that x's goal is that y eventually do it.",
        "'fence, (6) y thinks x.s goal is that y eventually do the act.",
        "Now, since y is helpfully disposed towards x, and has no objections to doing the act, (7) y takes it on as a persistent goal.",
        "Since he is always competent about doing his own acts, (R) eventually it will he done or he will think it impossible to do.",
        "Again, since it is not forever impossible, (:)) he will eventually do it.",
        "We have shown how the performing of an imperative to do an act leads to the act's eventually being done.",
        "We wish to create a number of lemmas from this proof (and others like it) to characterize illocutionary acts."
      ]
    },
    {
      "heading": "8 Plans and Summaries",
      "text": []
    },
    {
      "heading": "6.1 Plans",
      "text": [
        "A plan for agent \"x' to achieve some goal \"1\" is an action term \"a\" and two sequences of wffs 'pa\", \"131\"• • • • 'Pk' and 'ffo\", \"rik\" where \"rik\" is \"q\" and satisfying",
        "In other words, given a state where \"x' believes the 'pi', he will believe that if he does 'a\" then \"go\" will hold and moreover.",
        "given that the act preserves pi, and he believes his making",
        "There are two main points to be made about these corollaries.",
        "First of all, since they are theorems, the implications can be taken to be believed by the agent axa in every state.",
        "In this sense, these wffs express general methods believed to achieve certain effects provided the assumptions are satisfied.",
        "The second point is that these corollaries are in precisely the form that is required in a plan and therefore can be used as justification for a step in a future plan in much the same.",
        "way a lemma becomes a single step in the proof of a theorem."
      ]
    },
    {
      "heading": "6.2 Summaries",
      "text": [
        "We therefore propose a notation for describing many steps of a plan as a single summarizing operator.",
        "A summary consists of a name, a list of free variables, a distinguished free variable called the agent of the summary (who will always be listed first), an Effect which is a wff, a optional Body which is either an action or a wff and Finally, an optional Gate which is a wff.",
        "The understanding here is that summaries are associated with agent and for an agent ax\" to have summary au', then there are three cases depending on the body of \"u\": I.",
        "If the Body of \"u' is a wff, then"
      ]
    },
    {
      "heading": "One thing worth noting about summaries is that normally the wffs used above",
      "text": [
        "I (DEL x (Gate D will follow from the more general wff I Gale However, this need not be the case and different agents could have different summaries (even with the same name).",
        "Saying that an agent has a summary is no more than a convenient way of saying that the agent always believes an implication of a certain kind."
      ]
    },
    {
      "heading": "7 Summarization of a Request",
      "text": [
        "The following is a summary named REQUEST that captures steps 2 through steps 5 of the proof of Theorem 2.",
        "This summary allows us to conclude that any action preserving the Cate and making the Body true makes the Effect true.",
        "Conditions (2) and (3) are theorems and hence are always preserved.",
        "Condition (1) was preserved by assumption.",
        "Searle's conditions for requesting are captured by the above.",
        "Specifically, his 'propositional content\" condition, which states that one requests a future act, is present as the Effect because of Theorem 2.",
        "Searles first \"preparatory' condition – that the hearer be able to do the requested act, and that the speaker think so is satisfied by condition (2).",
        "Searle's second preparatory condition – that it not be obvious that the hearer was going to do the act anyway – is captured by our conditions on persistence, which state when an agent can give up a persistent goal, that is not one of maintenance, when it has been satisfied.",
        "Grice's 'recognition of intent\" condition [12, 131 is satisfied since the endpoint in the chain (step 9) is a goal.",
        "Hence, the speaker's goal is to get the hearer to do the act by means, in part, of the (mutual) recognition that the speaker's goal is to get the hearer to do it.",
        "Thus, according to Grice, the speaker has meant„,, that the hearer should do the act.",
        "Searle's revised Gricean condition, that the hearer should \"understand\" the ;it-eral meaning of the utterance, and what illocutionary act the utterance 'counts as\" are also satisfied, provided the summary is mutually known.",
        "16"
      ]
    },
    {
      "heading": "7.1 Nonserious Requests",
      "text": [
        "Two questions now arise.",
        "First, is this not overly complicated?",
        "The answer, perhaps surprisingly, is \"No\".",
        "By applying this REQUEST theorem, we can prove that the utterance of an imperative in the circumstances specified by the Gate results in the Effect, which is as simple a propositional attitude as anyone would propose for the effect of uttering an imperative – namely that it is mutually believed that the speaker's goal is that the hearer eventually do the act.",
        "The Body need never be considered \"The further elaboration of this point that it deserves is outside the scope .",
        "of this paper.",
        "unless one of the gating conditions fails.",
        "Then, if the Body is rarely needed, when is the 'extra\" embedding (GOAL speaker (BEL hearer ...)) attitude of use?",
        "The answer is that these embeddings are essential to preventing nonserious or insincere imperatives from being interpreted unconditionally as requests.",
        "In demonstrating this, we will show how Searle's \"Sincerity\" condition is captured by our SINCERE predicate.",
        "The formula (SINCERE speaker p) is false when the speaker does something to get the hearer to believe he, the speaker, has the goal of the hearer's believing p, when he in fact does not have the goal of the hearer's knowing that p Let us see see how this would be applied for 'Go jump in the lake\", uttered idiomatically.",
        "Notice that it could be uttered and meant as a request, and we should he able to capture the distinction between serious and nonserious uses.",
        "In the case of uttering this imperative, the content of SINCERE.",
        "p p = (GOAL speaker (P-GOAL hearer (DONE hearer [JUMP-INTO Lake1())).",
        "Assume that it is mutually known/believed that the lake is frigidly cold (any other conditions leading to --(GOAL x p) would do as well, e.g., that the hearer is wearing his best suit, or that there is no lake around).",
        "So, by a reasonable axiom of goal formation, no one has goals to achieve states of affairs that are objectionable (assume what is *objectionable\" involves a weighing of alternatives).",
        "So, it is mutually known/believed that"
      ]
    },
    {
      "heading": "–(GOAL speaker (DONE hearer [JUMP-INTO Laken)), and",
      "text": [
        "so the speaker does not believe he has such a goal. \"",
        "The consequent to the implication defining SINCERE is false, and because the result of the imperative is a mutual belief that the speaker's goal is that the hearer think he has the goal of the hearer's jumping into the lake, the antecedent of the implication is true.",
        "Hence, the speaker is insincere or not serious, and a request interpretation is blocked.",
        "le In the case of there not being a lake around, the speaker's goal cannot he that the hearer form the persistent goal of jumping in some non-existent lake, since by the No Futility property, the hearer will not adopt a goal if it is unachievable, and hence the speaker will not form his goal to achieve the unachievable state of affairs (that the hearer adopt a goal he cannot achieve).",
        "Hence, since all this is mutually believed, using the same argument, the speaker must be insincere."
      ]
    },
    {
      "heading": "8 Nonspecific requests",
      "text": [
        "The ability conditions for requests are particularly simple, since as long as the hearer knows what action the speaker is referring to.",
        "he can always do it.",
        "He cannot, however, always bring about some goal world.",
        "An important variation of requesting is one in which the speaker does not specify the act to he performed; he merely expresses his goal that some p be made true.",
        "This will be captured by the action LIMPER y for \"make p true\".",
        "Here, \"The speaker's expressed goal is that the hearer form a persistent goal to jump in the lake.",
        "But, by the Inevitable Consequence, lemma, given that a c.o.e.",
        "satisfying the speaker's goal also has the hearer's eventually jumping in (since the hearer knows what to do), the speaker's goal is also a c.o.e.",
        "in which the hearer eventually jumps in.",
        "In the same way, the speaker's goal would also be that the h eventually gets wet.",
        "\"However, we do not say what else might be derivable.",
        "The speaker's true goals may have more to do with the manner of hi.",
        "action (e.g., tone of voice), than with the content.",
        "All we have done is demonstrate formally how a hearer could determine the utterance is not to be taken at face value.",
        "in planning this act, the speaker need only believe the hearer thinks it is mutually believed that it is always the case that the hearer will eventually find a plan to bring about p. Although we cannot present the proof that performing an [IMPER x y will make Op true, the following is the illocutionary summary of that proof: [NONSPECIFIC-REQUEST x y p]:",
        "Since the speaker only asks the hearer to make p true, the ability conditions are that the hearer think it is mutually believed that it is always true that eventually there will be some act such that the hearer believes of it that it achieves p (or he will believe it is impossible for him to achieve).",
        "The speaker need not know what act the hearer might choose."
      ]
    },
    {
      "heading": "9 On summarization",
      "text": [
        "Just as mathematicians have the leeway to decide which proofs are useful enough to he named as lemmas or theorems, so too does the language user.",
        "linguist, computer system, and speech act theoretician have great leeway in deciding which summaries to name and form.",
        "Grounds for making such decisions range from the existence of illocutionary verbs in a particular language, to efficiency.",
        "However, summaries are flexible – they allow for different languages and different agents to carve up the same plans differently.",
        "IG Furthermore, a summary formed for efficiency may not correspond to a verb in the language.",
        "Philosophical considerations may enter into how much of a plan to summarize for an illocutionary verb.",
        "For example, most illocutionary acts are considered successful when the speaker has communicated his intentions, not when the intended effect has taken hold.",
        "This argues for labelling as Effects of summaries intended to capture illocutionary acts only formulas that are of the form (BMB hearer speaker (GOAL speaker p)), rather than those of the form (BMB hearer speaker p) or (BEL hearer p), where p is not a GOAL-dominated formula.",
        "Finally, summaries may be formed as conversations progress.",
        "The same ability to capture varying amounts of a chain of inference will allow us to deal with multi-utterance or multi-agent acts, such as, betting, complying, answering, etc., in which there either needs to be more than one act (a successful bet requires an offer and an acceptance), or one act is defined to require the presence of another (complying makes sense only in the presence of a previous directive).",
        "For example, where REQUEST captured the chain of inference from step 2 to step 5, one called COMPLY could start at 5 and stop at step 9.",
        "\"Remember, summaries are actually beliefs of agents, and those beliefs need not be shared.",
        "Thus, the notion of characterizing illocutionary acts as lemma-like summaries, i.e., as chains of inference subject to certain conditions, buys us the ability to encapsulate distant inferences at \"one-shot\"."
      ]
    },
    {
      "heading": "9.1 Ramifications for Computational Models of Language Use",
      "text": [
        "The use of these summaries provides a way to prove that various short-cuts that a system might take in deriving a speaker's goals are correct.",
        "Furthermore, the ability to index summaries by their Bodies or from the utterance types that could lead to their application (e.g., for utterances of the form 'Can you do <X>\") allows for fast retrieval of a lemma that is likely to result in goal recognition.",
        "By an appropriate organization of summaries 151, a system can attempt to apply the most comprehensive summaries first, and if inapplicable, can fall back on less comprehensive ones, eventually relying on first principles of reasoning about actions.",
        "Thus, the apparent difficulty of reasoning about speaker-intent can be tamed for the \"short-circuited\" cases, but more general-purpose reasoning can deployed when necessary.",
        "However.",
        "the complexities of reasoning about others' beliefs and goals remains."
      ]
    },
    {
      "heading": "10 Extensions: Indirection",
      "text": [
        "Indirection will he modeled in this framework as the derivation of propositions dealing with the speaker's goals that are not stated as such by the initial propositional attitude.",
        "For example, if we can conclude from (DWI y x (GOAL x (GOAL y p))) that y x (GOAL x (GOAL y 0 q))), where p does not entail q, then.",
        "'loosely\".",
        "we will say an indirect request has been made by x."
      ]
    },
    {
      "heading": "Civen the properties of . (GOAL x p) D (GOAL x Op) is",
      "text": [
        "a theorem.",
        "(GOAL x and (GOAL x are mutually un-satisfiable, bud (GOAL x Op) and (GOAL x 0 – p) are jointly satisfiable.",
        "For example, (GOAL BILL OHAVE BILL HAM-MERI))) and (GOAL DILL 0(HAVE JOHN HAMMER1)) could both be part of a description of Bill's plan for John to get a hammer and give it to him.",
        "Such a plan could be triggered by Bill's merely saying \"Cet the hammer' in the right circumstances, such as when Bill is on a ladder plainly holding a nail.",
        "A subsequent paper will demonstrate the conditions under which such reasoning is sound."
      ]
    },
    {
      "heading": "11 Concluding Remarks",
      "text": [
        "This paper has detnonstrated that all illocutionary acts need not be primitive.",
        "At least some can he derived from more basic principles of rational action, and an account of the propositional attitudes affected by the uttering of sentences with declarative, interrogative, and imperative moods.",
        "This account satisfies a number of criteria for a good theory of illocutionary acts.",
        "• Most elements of the theory are independently motivated.",
        "The theory of rational action is motivated independently from any notions of communication.",
        "Similarly, the properties of cooperative agents are also independent of communication.",
        "\"Notice that most theories of speech acts would treat the above utterance as only a direct request.",
        "We do not.",
        "• The characterization of the result of uttering sentences with certain syntactic moods is justified by the results we derive for illocutionary acts, as well as the results we cannot derive (e.g., we cannot derive a request under conditions of insincerity).",
        "• Summaries need not correspond to illocutionary verbs in a language.",
        "Different languages could capture different parts of the same chain of reasoning, and an agent might have formed a summary for purposes of efficiency, but that summary need not correspond to any other agent's summary.",
        "• The rules of combination of illocutionary acts (characterizing, for example, how multiple assertions could constitute the performance of a request) are now reduced to rules for combining propositional contents and attitudes.",
        "Thus, multi-utterance illocutionary acts can be handled by accumulating the speaker's goals expressed in multiple utterances, to allow an illocutionary theorem to be applied.",
        "• Multi-act utterances are also a natural outgrowth of this approach.",
        "There is no reason why one cannot apply multiple illocutionary summaries to the result of uttering a sentence.",
        "Those summaries, however, need not correspond to illocutionary verbs.",
        "• The theory is naturally extensible to indirection (to be argued for in another paper).",
        "to other illocutionary act, such as questions, commands, informs, assertions, and to the act of referring (81.",
        "Finally, although illocutionary act recognition may be strictly unnecessary, given the complexity of our proofs, it is likely to be useful.",
        "Essentially.",
        "such recognition would amnion to the application of illocutionary summaries theorems to discover the speaker's goal(s)."
      ]
    },
    {
      "heading": "12 Acknowledgements",
      "text": [
        "We would like to thank Tom Blenko, Herb Clark, Michael Georgelf, David Israel, Beb Moore, Cecil).",
        "Nutiberg, Fernando Pereira.",
        "Hay Perrault, Stan Rosenschein, Ivan Sag, and Nloshe Vardi for valuable discirssions."
      ]
    },
    {
      "heading": "13 References",
      "text": []
    },
    {
      "heading": "13 Appendix",
      "text": []
    }
  ]
}
