{
  "info": {
    "authors": [
      "Celestin Sedogbo"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C86-1005",
    "title": "Extending the Expressive Capacity of the Semantic Component of the OPERA System",
    "url": "https://aclweb.org/anthology/C86-1005",
    "year": 1986
  },
  "references": [
    "acl-J82-3002"
  ],
  "sections": [
    {
      "text": [
        "ABSTRACT; OPERA is a natural.",
        "language question answering system allowing the interrogation of a data base consisting of an extensive listing of operas.",
        "The linguistic front-end of OPERA is a comprehensive grammar.",
        "of French, and its semantic component translates the syntactic analysis into logical formulas (first order log is formulas).",
        "However there are quite a flew constructions which can be, analysed syntactically in the grammar but for which we are unable to specify translations.",
        "Foremost among these are anaphoric and elliptic contructions.",
        "Thus this paper describes the extension of OPERA to anaphoric and elliptic constructions on the basis of the Discourse Representation Theory (DUO)."
      ]
    },
    {
      "heading": "1- INTRODUCTION",
      "text": [
        "OPERA is a natural language question answering system allowing the interrogation of a data base consisting of an extensive listing of operas and their associated caracteristics (composers, time of canposition, recor dings, etc...).",
        "The linguistic front-end of OPERA is a cunprehensive grammar of.",
        "French based essentially on the string grammar formalism (cf for exmcple [SAGER,81] (x- [SALKOFE, 73]); the details of the syntax used in OPERA are described in [SEDOGBO, 851.",
        "In this paper we shall describe the semantic component of OPERA as it stands now.",
        "In addition we shall discuss a number of problematic constructions which are not handled at present in the system and we outline a possible solution for them in the setting of this systar.",
        "It has become more and more clear that the most natural and transparent formulation of the semantics of natural languages can be constructed in terms of a logical semantics i.e a semantics based on the usual model.",
        "theoretic interpretation of predicate logic.",
        "This was in fact already realized as early as 1973 by A. COLMERAUER and his group ( CF [COLMERAUER & a1,73]1 [PASERO, 73], [COII4ERAUER, 79]).",
        "In these papers the semantics for natural languages is specified in terms of the truth conditions of predicate logic formulas into which these utterances are translated in a systematic way.",
        "( It should be mentioned that in many respects the way these translations are obtained as well as the translations themselves resemble the even earlier proposals of MONTAGUE and his students (cf [MONTAGUE, 74]).",
        "The work done in COLMERAUER's group has however the additional merit that these proposals are presented in operative systems for man-machine dialogues.",
        "Indeed in these early papers we find sketched two alternatives for the systematic manipulation of the translations provided for natural language discourse: This research was supported in part by ESPRIT, in the ACORD project(P393).",
        "a) given a data base in relational (e.g Prolog like ) form the answers to queries (which are themselves translated into logical forms) can be given in terms of the satisfaction conditions of these formulas.",
        "I.e. a query like \"does every student own a book? \"",
        "will receive the answer \"yes\" if its translation \" for all x ( student(x) --> there exists y ( book(y)& own(x,y))) \" is true i.n the data base.",
        "Here the answers to queries are obtained by simply evaluating the translation in the data base (or model).",
        "b) another approach however consists in regarding the data base as a set of formulas and the process of answering a query as a deduction.",
        "A query will be said to be true with respect to the data bass if and only if it.",
        "can be deduced from it.",
        "(Naturally as in the case of the first approach, this method applies equally well to closed sentences ( i.e yes-no questions) as well as to open sentences ( I.e WH-questions).",
        "For an application of this method as well as for discussion of its advantages (cf [PASERO, 73]).",
        "For reasons which we shall not spell out here we have chosen the model theoretical approach (i.e the first approach ) in OPERA.",
        "Needless to say it is not too difficult and in fact sometimes necessary, as we shall see below, to complement the pure semantic evaluation with deductive capacities.",
        "2-- SEMANTICS VIA TRANSLATION INFO LOGIC Even if it.",
        "is clear in most respects how to obtain predicate logic translations for a large variety of natural.",
        "language sentences, cf [WARREN & PEREIRA, 82] we repeat here for the sake of clarity the essentials of the translation process in OPERA.",
        "Consider for example the following sentences :",
        "(a) Berg a oanpose un opera en trois actes (Berg composed an opera i.n three acts) (b) aucun oompositeur Allemand n'a compose un opera en 1912 (no genran composer composed an opera in 1912) (c) Chaque opera de Berg a eté anregistr6 par Karajan every opera by Berg was recorded by Karajan.",
        "The syntax of OPERA (cf [SEDOGBO, 85]) yields syntactic analysis as in (d).",
        "These trees are then translated into the following predicate logic formulas :",
        "(a) exist(x,opera-in-three-acts(x) & compose(Berg,x)) (b) aucun(x,cemposer(x) & german(x),exist(y,opera(y) & compose-by(y,Berg) & in(y,1912))) (c) chaque(x,opera(x) & of(x,Berg), recorded-by(x,Karajan))",
        "The evaluation component of OPERA then evaluates these formulas in the data base.",
        "Quite a few syntactically complex queries can thus be formulated in this system.",
        "3- FROM TRANSLATIONS TO DRSs OPERA was conceived not so much as an effort towards an implementation of viable integrated natural language question answering system, as a testing ground for a rather extensive fragment of French.",
        "In fact many constructions ( in particular complement constructions ) which are accomodated in the syntax fragment of OPERA are such that they cannot effectively be applied in the setting of OPERA's data base.",
        "However there are quite a few constructions which can be analysed syntactically in the grammar but for which we are unable to specify translations, even when their intended translations are essentially first-order logic formulas.",
        "Foremost among these are anaphoric and elliptical contructions.",
        "It.",
        "is clear that any comprehensive treatment of such phenomena cannot restrict itself to the analysis of isolated sentences i.e to isolated queries.",
        "For what could a sentence like: when did he compose it ?",
        "mean ?",
        "or what query could be expressed by the phrase \"and Britten?\"?",
        "There is not much that these sentences could convey in isolation.",
        "But consider the following dialogue : Question: did Beethoven compose Fidelio ?",
        "Answer : yes.",
        "Question: when did he compose it?",
        "Answer: in 1812 Or consider another very natural interaction : Question: how many operas did Beethoven compose?",
        "answer: 1 Question: and Mozart?",
        "Answer : 15 It is clear that an adequate account of anaphoric and elliptic constructions must at least take into account the current situation of the dialogue.",
        "How to define the notion \" current situation\" is by no means a trivial task.",
        "For one thing we cannot simply asssume that the current situation is identical to the sequence of the question-answer pairs that make up the dialogue.",
        "Much more is involved.",
        "Even though pronouns raise no problem at all as for us as far as the syntax is concerned, no one has been able to provide a unified and systematic account of anaphoric linking.",
        "As recent work has shown one must distinguish on the one hand various types of pronominal reference and on the other hand show how the resolution of anaphora must appeal to cannon underlying mechanisms.",
        "It is one of the achivements in [KAMP, 81] to show the way towards that unified treatment .",
        "In fact we shall base our proposals for both the treatment of anaphora and of ellipsis on the concepts and technics introduced by KAMP in his theory of discourse representation.",
        "Since the current translation component of OPERA does not take into account pronouns at all we must first provide an extension which is also able to deal with pronominal reference.",
        "Syntactically pronouns can occur in all NP positions characterized by the grammar.",
        "We shall mark each occurence of a pronoun by indicating its gender/number features; As a first step in the translation procedure we shall therefore simply take these translations to be identical with themselves.",
        "Thus the translation of sentences like : Berg l'a compose (Berg composed it)",
        "similarly a sentence like : chaque ccmpositeur qui a compose un opera l'a enre-gistre (every composer who wrote an opera recorded it).",
        "will be translated into : chaque(x,exist(y,opera(y)&composer(x)&cempose(x,y)), record(x,[it,null,sing]))) We shall call translations containing occurrences of pronouns \"unresolved translations\".",
        "Notice that contrary to the practice in [MONTAGUE, 74] we do not index pronouns either in the syntax or the initial tranlation phase.",
        "The resolution of anaphora will take as input \"unresolved translations\" and yield as output a rather different type of semantic representation namely a discourse representation structure (DRS).",
        "What is DRS?",
        "In general we shall say that a DRS is pair consisting of a (possibly empty) domain of discourse referents U and a set of conditions CON.",
        "We shall for the present discussion take into consideration only three types of conditions :",
        "a) atomic conditions, which consists of nary predicate P and terms.",
        "a term is either a discourse referent or a proper name; among the predicates we single out the equality predicate \"=\".",
        "b) conditional conditions which have the form =>(kl,k2) where kl and K2 are again DRSs.",
        "c) negative conditinal conditions which has the form 4>(K1,k2).",
        "In a more comprehensive treatment it is clear that we shall need further types of conditions.",
        "Thus for the final translations of unresolved translation we want to arrive at DRSs like the following :",
        "There are precise truth definitions for DRSs which we shall not spell out here however (cf KAMP for details).",
        "In any case the first DRS is logically equivalent to the formula : compose(berg, loulou) and the second DRS is logically equivalent to the predicat logic formula",
        "What is interesting in the second example is of course a fact that the pronoun \"it\" has as its syntactic antecedent the noun phrase \"an opera \".",
        "The semantic force of this noun phrase cannot however be rendered in terms of an existential quantifier at least not if we want to establish an anaphoric link between the existential quantifier and the variable representing the pronoun in the consequent of the conditional.",
        "MONTAGUE for instance runs into this problem in PTO where the pronoun is either left unbound or either is bound by the existential quantifier when the latter occur outside the conditional all together.",
        "This wide scope reading of the indefinite NP obviously gives them the wrong interpretation.",
        "As does of course the translation leaving the pronoun unbound.",
        "In the DRS on the other hand we get a universal reading for an opera as the result of the interpretation of the conditional.",
        "Even though inside the antecedent of the conditional we treat the occurrence of the indefinite noun phrase \"an opera \" as we would in an ordinary indicative sentence, where of course the interpretation of the indefinite article corresponds more naturally to an existential quantifier.",
        "This is one of the features of KAMP theory that we shall take advantages of in the present proposal.",
        "As we said above we shall transform unresolved translations stepwise into DRSs.",
        "Needless to say we could of course set up the translation procedure in such a way that we obtain DRSs directly from the output of the syntactic component.",
        "But this would entail major revision of the entire translation algorithm in any event the way we propose to derive DRSs can be regarded as DRS construction algorithm in its own right.",
        "On this view \"our unreduced translations\" play the role of an intermediate structure between syntax and DRSs.",
        "Assume that t is an unresolved translation of a sentence .",
        "We first generate K(t) the discourse representation structure corresponding to t, in the following way : if t is a universal tree i.e a formula of the form chaque---x --fl ---f2 we create a DRS K(t) with an empty domain and the condition =>(Kl,K2).",
        "K1 will have x in his domain and the result of transforming fl in K1 as its condition K2 will have an empty domain and the result of tran-forming f2 as its conditions.",
        "Let t be a tree with the determiner \"aucun\" as its top node, i.e a formula of the form : aucun---x ---fl ----f2 we procede as in the case above except that the condition we enter into K(t) is now a negative universal condition, i.e a condition of the form =>(kl,K2).",
        "Suppose t is dominated by exist i.e t has the form : exist---x ---fl we create a DRS K(t) whose domain contains x and we add the result.",
        "of transforming fl as the conditions to K(t).",
        "Suppose t is a tree dominated by \"et\" i.e a formula of the form : et---fl ---f2 we create a DRS K(t) with an empty domain whose conditions are the result of transforming fl and f2 with respect to K(t).",
        "Finaly suppose the unresolved translation is non quantified then we enter it as is into K and we add all occurrences of proper names into the domain of K. This provides the induction basis for the tranforma-tion.",
        "Let K' be a DRS with domain U' and conditions CON' and let t be a tree i.e a formula.",
        "The result of transforming t in K' is the application of the above three rules to t. When we no longer have any tree to process all conditions in the principle K i.e the DRS representing the sentence to be transformed, as well",
        "as all conditions occurring in the sub-DRSs of K will now be conditions in the language of DRSs or atomic conditions containing occurrences of pronouns.",
        "How are these be eliminated ?",
        "Let us first consider an example the sentence \"every composer dedicated an opera to a conductor that he has admired\" has as its unresolved translation: chaque---x fl: ---ccmposer(x) f2: ---exist---y ---exist---z",
        "Let K' be a DRS embedded in K (which is a DRS too); the antecedent of a pronoun occurring in K' is the list consisting of the union of U(K) and U(K') if and only if K is accessible to K'.",
        "For a precise definition of the notion of accessibility cf [GUENTHNER & LEHMAN,85].",
        "Let us now illustrate the notion of accessibility by giving the table of accessibility of the DRS above:",
        "By the transitive closure of the accessibility relation we obtain for example all the possible antecedents of a pronoun occurring in K2 (e.g a pronoun occurring in Kl cannot have as antecedent a referent of K2).",
        "For the clarity of what will follow, we will call \"unresolved predicate\" (abreviated UP) a predicate whose arguments included at least one pronoun.",
        "Then to resolve an UP, one must replace the pronoun arguments with appropriate referents accessible.",
        "The idea is to transport during the translation of formulas, a list of antecedents accessible according to DRSs constraints.",
        "How is this list to be constructed?",
        "As shown in (3.1) a universal tree is translated into a DRS K= =>(Kl,K2); the antecedent list of K which we note L(K) is empty.",
        "The antecedent list of Kl is L(K1) and L(K2) = U2 + L(Kl) (we denote the union of sets by the symbol +).",
        "The existential tree is translated into K = [U,CON] and the antecedent list L(K)=U.",
        "Let f be a formula with \"aucun\" at its top node; f is translated into the DRS K f>(K1,K2).",
        "The list of antecedents L(K) of K is empty and L(K1) is Ul and L(K2) =U2 + L(K1).",
        "Let us call a DRS containing \"unresolved predicates\" an \"unresolved DRS\".",
        "Thus each unresloved DRS is a pair of the form K = [K,L(K)] where L(K) is the antecedent list of the DRS K. To resolve an unresolved CRS, each unresolved predicate (UP) must be resolved according to the following rule : for an unresolved DRS K = [K,L(K)] with K=[U,CON] a UP P of CON is transformed into the logical predicate .Which is obtained by unifying pronoun arguments of Pih L(K).",
        "The example \"every camposer dedicated an opera to a conducter that he has admired\" treated in session 3.1 3.2 INCORPORATING DRS CONSTRAINTS INTO TRANSLATIONS ► will illustrate how unresolved DRSs are resolved.",
        "We will give below the exact method for translating formulas of OPERA into DRSs.",
        "One of the most important features of DR-theory is the precise constraints on the antecedents of pronouns.",
        ".",
        ".",
        "Given the unresolved DRS K = [K,nil] with K= =>(kl,k2) , Kl= [K1,x], K1 = (x,carposer(x)) and",
        "K will be resolved by application of the rule described above, i.e: The pronoun he is unifiable in the list (x,y) of antecedents, to z.",
        "Therefore the unresolved predicate will be translated into admire(x,z)."
      ]
    },
    {
      "heading": "4- EXTENDING THE DIALOGUE CAPACITY OF OPERA",
      "text": [
        "A problem arises in interrogating a data base in natural language which is the problem of dialogue situation.",
        "For example",
        "(a) qui a compose Loulou (who composed Loulou ?)",
        "(b) oh est-il ne?",
        "(where is he born?)",
        "This dialogue can be translated into a DRS containing the semantic representation of the two sentences.",
        "But if there is no interaction with the data base, the anaphoric link of the pronoun in (b) will be an unbound variable and not for example the individual \"Berg\" (as it is Berg who composed Loulou).",
        "What we prefer for a question-answering system is to take into account the situation of a question and its answer.",
        "A possible solution could be to consider that after the evaluation of a query, its corresponding DRS is therefore instantiated (i.e. its unbound variables are now bound); in such a situation we loose the reading of the DRS as a logical formula and moreover we cannot represent the instantiation of a splitted DRS (e.g. a universal formula)."
      ]
    },
    {
      "heading": "4.1 THE NOTION OF A \"CURRENT SITUATION DRS\"",
      "text": [
        "The solution we proposed is to separate the DRS of a formula from the DRS for the situation.",
        "Let t be a formula and K(t) =[U,CON] its translation into a DRS.",
        "The DRS of situation is the DRS K§(n) 1U§,CONS1 with U§ containing the instantiation of referents of U, CONS empty, and n denoting the current state of the dialogue (i.e. the occurrence of the question during the dialogue).",
        "The rule for UP resolution presented in the last session, must now be modified in the following way: let n be the current state of the dialogue and K be an unresolved DRS; the antecedent of a pronoun occurring in K is contained in the list consisting of the concatenation of L(K) and L(K§(n-1)).",
        "The antecedent list of K§(i) is defined in the same way as that a normal DRS, i.e. L(KS(i))=U§(i).",
        "To illustrate what is above, we will treat the dialogue above: (a) is translated into the logical formula tl= Wh(x,compose(x,Loulou)); its translation into a DRS will produce Kl.",
        "compose(N,Loulou) Since there is no pronoun in Kl, we can then evaluate the formula tl.",
        "After evaluation, we can build the DRS of situation K5:",
        "and L(K) = y L(K§(2-1)) = [y,Berg,Louloul.",
        "To resolve K2, an antecedent must be substituted to \"he\"; this antecedent will be Berg (because arguments in OPERA are typed).",
        "The DRS of situation becomes :",
        "Berg Vienne"
      ]
    },
    {
      "heading": "4.2 TREATMENT OF ELLIPSIS",
      "text": [
        "One of the most common phenomena of dialogue is ellipsis such as in :",
        "(a) Berg a compose Loulou Berg composed Loulou (b) Britten aussi Britten too or (c) et une symphonic and a symphony",
        "The interpretation of (b) is \"Britten a compose Loulou\" (i.e. VP-ellipsis); and (c) is to be interpreted as \"Berg a compose une symphonie\".",
        "The ad hoc treatment proposed in [SEDOGBO, 851 fails in many cases as we mentioned, since the logical formulas in OPERA are equivalent to first-order logic formulas.",
        "An interesting extension to VP-ellipsis in DR-theory is described by KLEIN (cf [KLEIN 841).",
        "KLEIN introduced the notion of predicate-DRS and pro",
        "posed an indexation of NP predicate-DRS and VP predicate-DRS in a DRS.",
        "We will not propose here how this extended DRS can be implemented; but will exploit the parallelism between our logical formulas and DRSs.",
        "Each sentence will be translated into two partial-logical formulas (noted PLF) of the form <x,f>, where x is a variable or an individual and f a logical formula.",
        "We assume that the composition of PLF(NP) and PLF(VP) gives the translation of the sentence.",
        "The first PLF is implicitly indexed by the NP and the second PLF is indexed by the VP.",
        "The DRS of current situation must be modified in the following way : KS(n)= [U§,CON§] with US defined as above, and CONS containig PLF(VP).",
        "Given a VP-ellipsis s, it will be translated into the the PLF: <i,fl>.",
        "The DRS of current situation contains in its CONS a PLF -<j,f2>.",
        "The VP-ellipsis is treated in the following way:",
        "1) unification of i and j 2) the composition of <i,fl> and <j,f2> produces the translation t 3) t is translated into a DRS K and KS is built as described in session (4.1)",
        "We will illustrate the VP-ellipsis treatment by processing the dialogue above: (a) is translated into the formula compose(Berg,Loulou) and PLF(NP) = <Berg,Berg>, PLF(VP)= <i,compose(i,Loulou)>.",
        "The translation t of (a) is then obtained by composition of PLF(NP) and PLF(VP); thus t= compose(Berg,loulou).",
        "The evaluation of t will augment the dialogue situation of a new DRS of situation containing PLF(VP).",
        "The translation of (b) will produce a PLF(NP)= <Britten,Britten> and a PLF(VP)= <i,p>.",
        "<i,p> will then be unified to the PLF(VP) contained in the CONS of KS , i.e <i,p> is unified with <i,caepose(i,Loulou)>; the composition of the two PLF <Britten,Britten>, <Britten,canpose(Britten,Loulou)> will produce the logical formula \"compose(Britten,Loulou)\"."
      ]
    },
    {
      "heading": "5- CONCLUSION",
      "text": [
        "The extensions to the OPERA system proposed here give a powerful dialogue capacities to OPERA.",
        "On the basis of the DR-theory, we propose an extension for the treatment of anaphora.",
        "We do not treat here the definite article as a definite refence since in our system the definite article must be interpreted as an indefinite article.",
        "However notice that even if in the framework of DR-theory the definite article is explained as a definite anaphora, its anaphoric link requires often the use of deduction.",
        "We prefer therefore not to treat the definite anaphora.",
        "The extension to ellipsis described in this paper is limited to VP-ellipsis; in fact the other kinds of elliptic sentences can be seen as conjoined to the preceding sentences.",
        "Even if the treatment proposed is not the one described by KLEIN, the notion of partial logic formula is equivalent to that of partial-DRS.",
        "In order to handle the dialogue we introduce the notion of a current situation DRS.",
        "But, is the level of logic translations (i.e our logical formulas) necessary, since we translate these formulas into DRSs?",
        "The reason to maintain this intermediate representation is that our use of DRSs is only justified by the accounting of the dialogue, so that we do not need the complex features of a DRS system.",
        "Then for reason of efficiency we think that it is better to evaluate translations on the data base (this enables the use of an optimization algorithm before executing the queries)."
      ]
    },
    {
      "heading": "ACKNOWLEDGMENTS",
      "text": [
        "the author would like here to thank F. GUENTHNER for his help during the specification of these extensions and for his comments on this paper."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
