{
  "info": {
    "authors": [
      "Barbara Di Eugenio",
      "Leonardo Lesmo",
      "Paolo Pogliano",
      "Pietro Torasso",
      "Francesco Urbano"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C86-1081",
    "title": "A Logical Formalism for the Representation of Determiners",
    "url": "https://aclweb.org/anthology/C86-1081",
    "year": 1986
  },
  "references": [
    "acl-J82-1003",
    "acl-P83-1007",
    "acl-P83-1009",
    "acl-P84-1114",
    "acl-P85-1008",
    "acl-P85-1023"
  ],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "Determiners play an important role in conveying the meaning of an utterance, but they have often been disregarded, perhaps because it seemed more important to devise uethods to grasp the global meaning of a sentence, even if not in a precise way.",
        "Another problem with determiners is their inherent ambiguity.",
        "In this paper we propose a logical formalism, which, among other things, is suitable for representing determiners without forcing a particular interpretation when their meaning is still not clear."
      ]
    },
    {
      "heading": "INTRODUCTION",
      "text": [
        "Ambiguity of determiners is one of the most striking phenomena of natural language; what is strange is the ease with which humans use them: it seems that the molteplicity of interpretations of a noun phrase including a determiner is not explicitly perceived by human users of ratural language [Hobbs 1983].",
        "The approach we chose tries to model this behavior: each determiner has a charac\" teristic semantic interpretation, Which is different from that of other determiners and which can be fbrtherly specified on the basis of the information contents gathered from the overall con\" text and from the remaining part of the sentence.",
        "If such an information contents is not sufficient, then the meaning of the determiner remains ambiguous.",
        "What is of paramount importance is that any determiner has a \"single\" meaning, that can be furtherly specified by the context.",
        "Of course, we need to express the semantics of determiners by means of a suitable representation.",
        "The one that we propose seems to be intuitively acceptable, formally precise and suitable for a compositional analysis of natural language that, even if questionable in some particular cases, is still one of the approaches that guarantee the most reasonable degree of generality in semantic interpretation.",
        "It is obvious that the representation of a sentence in such a formalism may contain ambiguities; therefore a further step is needed in order to obtain an unambiguous deep specification of its meaning.",
        "Contrarily to the intermediate logical formalism we are going to discuss, this final specification will not be given in declarative form, but in terms of operations on an underlying knowledge base."
      ]
    },
    {
      "heading": "REPRESENTATION FORMALISM",
      "text": [
        "Cur main goals in designing the representation formalism that will be used in the following sections were:",
        "1) To maintain a close relationship between the pieces of information that are intuitively present in the input sentence and the predicates appearing in its interpretation.",
        "2) To nuke explicit the distinction between surface objects and semantic entities: words on one side and concepts, individuals, classes etc.",
        "on the other.",
        "3) To maintain a compositional analysis of language, where the starting point is provided by the dependency tree built by the rule based syntactic component of the FIDO system [Lesmo, Torasso 84; Lesmo, Torasso 85a; Lesno, Torasso 85b].",
        "+ Partially supported by MPI Project \"Architetture Software per Sistemi Intelligenti\" * Supported by a fellowship of CSI Piemonte 4) To devise a set of predicates allowing an easy translation between the obtained representation and the corresponding operations on a Knowledge Base.",
        "A first example concerns a very simple sentence: 1) Bob loves Lucy.",
        "The representation is (lower case strings refer to variables; upper case ones to constants cr predicates):",
        "This can be read as: there are three internal entities (x,y,z); the speaker (S) is referring to the first of them by using the word BOB, to the second with TO LOVE, to the third with LUCY; the agent of y is x, its obiect is z. Fig.1 depicts, in terns of nodes and arcs, the proposed representation.",
        "REF predicates are meant to indicate the mapping between words and internal nodes.",
        "Consider now ex.2: 2) The boy loves a girl The representation reported below disregards the information contents gathered from the determiners:",
        "the representation is analogous to the previous one.",
        "Cn the other hand, some problems arise in this case; they concern the conmuni\".",
        "cative impact of ex.2, and which were not evident in the previous example.",
        "If we say \"Bob loves Lucy\", we assume that whoever hears this sentence knows both Bob and Lucy, so that he is able to reconstruct the right semantic interpretation, and to identify the specific individuals to wham the speaker is referring.",
        "But how can the hearer convey such kind of information when explicit names are not available?",
        "And, on the opposite side, how can the speaker tell the hearer that he is not referring to any specific individual, but he wants to mention a general property of the class?",
        "We believe that the discriminating information is carried by determiners.",
        "If we take them into account, we should state that ex.2 expresses something as: \"BOY (this word should suffice for you to identify whom I'm talking about) LOVES GIRL (this word is not specific enough to allow you to identify the correct referent)\" or, if we think of a knowledge base represented as a semantic network: \"Dear hearer, you should find a node satisfying the 'BOY' description (and if you consider the context, this can be done unambiguously), then you should create a new node of type 'GIRL' and connect them via a node which is an ACT\"-OF 'LOVE' \".",
        "We can give now the complete representation of ex.2:",
        "that is: \"The speaker is referring to entity x by mans of the word BOY, he assumes that x is identifiable to himself and that the description used (BOY) enables the hearer to refer to the same entity; there is also an act of loving (y) and another entity (z) Whom he is referring to by means of the word GIRL; z is identifiable to himself, but the word GIRL will.",
        "not enable the hearer to refer to the sane entity he is thinking about.",
        "Finally, x is the agent of y and z is the object of y\".",
        "Actually, 2r' does not correspond exactly to sentence 2.",
        "In fact Ex.2 is ambiguous Whilst 2r' is not.",
        "The source of ambiguity is the NP \"a girl\".",
        "In the previous discussions we assumed that the speaker knows the girl loved by \"the boy\", but this is not necessarily true.",
        "Tne \"specific\" reading is given in 2r' by the presence of the predicate IDENTIFIABLE(S,S,z).",
        "Now, how can we account for the inherent ambiguity of the indefinite determiner?",
        "Simply dropping from its semantics the \"IDENTIFIABLE\" predicate: it will be added in case the context provides sufficient clues to infer the \"specific\" interpretation, or its negation (\"not tall\" TIFIABLE\") will be added in case some evidence abcut a \"generic\" interpretation is available.",
        "No predicate is added (and the sentence remains ambiguous, as it actually is) if no disambiguating criterium is provided by the context.",
        "The approach exemplified above will be described in the next section, covering the definite and indefinite determiners.",
        "The predicates used are listed below, together with an explanation of their intuitive meaning.",
        "REF(x,y,z): Individual x is able to refer to entity y by by means of expression z. ENABLESANEREF(x,y,z): Individual x assumes that individual y is able to identify, by means of expression z, the same entity Which he refers to.",
        "IDENTIFIABLE(x,y,z): Individual x assumes that individual y is able to identify (or that y knows) entity z. SET2(x): Entity x is a set composed of at least two elements.",
        "ARBITRARY(x,z): Any member of the class x identified by to expression z necessarily satisfies the property expressed by the proposition in which z occurs."
      ]
    },
    {
      "heading": "REPRESENTATION CF DETERMINERS",
      "text": [
        "We will describe the representations we have adopted for determiners, following the classification introduced in [Croft 85], which we report here (note, however, that the ARBITRARY predicate introduced above does not correspond to 'arbitrary' in Croft's classification, only to its 'not defeasible' subclass):",
        "The representation for 'the' reported in table 1 can be parw-phrased as: \"There exists an entity that the speaker is able to refer to by means of the expression following the determiner; the speaker assumes that that expression will enable the hearer to refer to the sane entity; the speaker is able to identify the referred entity\".",
        "An example is provided by",
        "It must be noted that it is not written anywhere that the entity x has to be an individual.",
        "In principle, it could be a generic entity (i.e. an 'intensional' node of a semantic net), thus fulfilling the role of 'prototype individual' [Grosz, Joshi, stein 83].",
        "A few words now to discuss plurals.",
        "For example: II) I ragazzi mangiano (The boys are eating)",
        "The only difference is the presence of the predicate SET2(x), which states that the entity x is a set.",
        "We use the name SET2 to evidentiate that it refers to the pretheoretical notion of set as 'a group' composed by more than one element.",
        "As regards indefinite deterndners, the representations given in Table 1 can be paraphrased as: \"There is an entity that the speaker is able to refer to by means of the expression following the determiner; the speaker cannot assume that that expression will enable the hearer to refer to the mine entity\".",
        "Let us consider first the 'specific' meaning of the determiner 'a':",
        "5) Un uome entro' adagio nella stanza (A man quietly entered the room)",
        "(note that the speaker assumes that the use of the lexeue 'room' enables the hearer to identify the specific room he is thinking about).",
        "This interpretation is the simplest one, since it directly encodes the basic manning of the indefinite determiner, i.e. the reference to an unspecified entity.",
        "A first problem is how to get the 'generic' meaning from this representation (epistemic and intensional interpretations will be analyzed afterwards, since they do not appear as subjects of sentences).",
        "In:",
        "6) Un orso vain letargo in inverno (A bear hibernates in winter)",
        "you could probably perceive a meaning such as: \"If you randomly pick an individual bear, then you will see that it hibernates in winter; of course, the bear you will select will probably not be the same bear I am thinking of, but it still.",
        "hibernates in winter\".",
        "Notice that this paraphrase (as we assume it is) does not imply the existence of a 'prototypical' bear to which the general property of 'hibernating in winter' should apply: we are referring to an arbitrary element of the class we are talking about, although we are not saying that no exceptions exist.",
        "It is this non'identifiability of the element for which the property is predicated that allows the hearer to obtain the same general result.",
        "But now, what is the difference between ex.5 and ex.6?",
        "In the first case (specific interpretation), the speaker is referring to a particular individual, whereas in the second one he is not.",
        "We can state that in the specific interpretation IDENTIFIABLE(S,S,x), whereas in the generic interpretation 'not IDENTIFIABLE(S,S,x)'.",
        "Of course, in both cases the presence of 'not FNABLESANEREF(S,H,EXP).",
        "should allow to infer that 'not IDENTIFIABLE(S,H,x)', that is, to the speaker's knowledge, x is not identifiable by the hearer by means of the expression EXP used.",
        "Note that this does not mean that the hearer will not be able to identify x, but only that the speaker is not willing to assume so (sere examples will be provided afterwards).",
        "The representation we get for ex.6 is:",
        "Note that the representation includes the REF predicate, which will be actually built up on the basis of the expression following the determiner..",
        "This has been done in order to provide a means of unifying the variable x occurr•ng in the other predicates with the one appearing in the representation of the remaining NP.",
        "It cculd be argued that there is no reason why in the analysis of definite determiners we allowed the 'expression' following the determiner to refer to an intensional object, whereas in the inde', finite case we do not.",
        "However, language works just because we assume (sometimes incorrectly) that a given lexeme refers to the sane concept for the whole comminity of language users.",
        "This means that we cannot accept a reading where 'not ENABLESANEREF(S,H,EXP)' occurs and where EXP is intended to refer to a generic concept.",
        "In order to discuss the other two interpretations of indefinite determiners, we need to refer to their use in cases different from the subject of the sentence, or, more precisely, in sentential contexts where there is another partecipant, different from the speaker, who has an 'active' role.",
        "In these cases, the representation must account for the existence of a referentiality predicate attributed to someone different from the speaker and the hearer.",
        "The first well known example is provided by a 'desire' verb, that is 'to want':",
        "7) John wants to marry a Norwegian Scar different meanings can be characterized by the hearer's different replies : 7a) No, Ingrid isn't a Norwegian.",
        "7b) Who is she?",
        "7c) How does he think he can find one?",
        "In the first case, the speaker is using the word 'Norwegian' to refer to John's future wife, but the speaker does not agree on that word (*).",
        "In the second case, the hearer assumes that the speaker is referring to a specific girl whom he does not know.",
        "In the third case, he assumes the speaker is not referring to any particular Norwegian.",
        "In all cases there is a common core in the representation of the initial sentence; it is:",
        "To this basic interpretation, some different predicates are added for each different case: 7ar) IDENTIFIABLE(S,S,w) for the standard \"specific\" interpretation of the indefinite determiner; IDENTIFIABLE(H,H,w) & not",
        "But now we have the possibility to characterize two subcases of c: in the first one (c1) S does not know the Norwegian that John wants to marry, but John does know her; in the second case (c2) the identification is generic for both of them:",
        "The Last determiner (in Croft's analysis) is \"any\".",
        "Its represen' taticn is reported in table 1, but lack of space prevents us from discussing it (moreover, not all students agree on its status of determiner - vs. quantifier ' and no Italian lexeae has a meaning exactly equivalent to \"any\").",
        "We list below the rules more strictly concerned with the operational interpretation of the predicates associated with determiners:"
      ]
    },
    {
      "heading": "R1 (Definite):",
      "text": [
        "(*) Note that neither the speaker nor the hearer are necessaries ly right.",
        "For instance, the speaker could reply \"She was born in Oslo\", and the hearer \"But last year she got the U.S. citizen-ship\".",
        "then createnode(exp,x), nark(x,'GENERIC-DEFEASIBLE') A few words on the functions used in the action part of the rules: locatenode looks first for individual referents; if none is available it considers generic nodes.",
        "createnode builds a new instance of the most specific available concept identified by exp.",
        "locateset works exactly as locatenode, but the node that it locks for mist represent a set.",
        "These rules are not complete, as they do not take into account Epistemic and Intensional Indefinite: in fact, both the representations of these interpretations mist include the hypothetical knowledge of another individual and, as we said before, we did not treat belief contexts."
      ]
    },
    {
      "heading": "CONCLUDING REMARKS",
      "text": [
        "Interpretation of determiners and quantifiers is usually oversimplified in many natural.",
        "language interfaces.",
        "We think the formalism discussed in this paper constitutes a significant step in representing the meaning of the sentence at a more abstract level than many interfaces do; at the same tine we can directly exploit the features of this representation to build the actual update command or query.",
        "Other approaches use a direct translation of the sentence from its surface form (or from a purely syntactic tree) into a representation language which is actually a KB management or a DB query language.",
        "The formalism discussed in this pages does not make any assumption on the language used for actually accessing the KB (and for this reason the formalism does represent the meaning of a sentence in a natural or at least 'neutral' way [Hobbs 1985, Schubert & Pelletier 1982]).",
        "On the other hand, the formalism is not too far from the way the domain knowledge is (or could be) represented inside a KB or DB, so that it is easy to develop translation rules stating what operations on the KB or DB should be done.",
        "The constraints on the available space prevented us from discussing the problem of using the context to disambiguate among the different meanings of a given determiner (e.g. specific vs. unspecific \"a\").",
        "Some efforts were node and the results are encouraging, though in many cases it is only very high-level information (e.g. mutual knowledge and beliefs) can provide the basis for selecting the right interpretation."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
