{
  "info": {
    "authors": [
      "Jacques Vergne",
      "Pascale Pages",
      "Inalco Paris"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C86-1064",
    "title": "Synergy of Syntax and Morphology in Automatic Parsing of French Language With a Minimum of Data",
    "url": "https://aclweb.org/anthology/C86-1064",
    "year": 1986
  },
  "references": [
    "acl-J85-2004"
  ],
  "sections": [
    {
      "heading": "Abstract:",
      "text": [
        "We intend to present in this paper a parsing method of French language whose particularities are: a multilevel approach: syntax and morphology working simultaneously, the use of string pattern matching and the absence of dictionary.",
        "We want here to evaluate the feasibility of the method rather than to present an operationnal system."
      ]
    },
    {
      "heading": "I General objectives;",
      "text": [
        "We intend to demonstrate that it is possible to parse texts with very few data: only determinants.",
        "indefinite and numeral adjectives, conjunctions and prepealkena, that in such an analysis, the consecutive application of morphology and syntax is insufficient, but that the use of syntax and morphology simultaneously is very efficient, and at last that the notion of a grammatical or lexical category of the word is not attached to the word, but dePends on the local situation of the word in the sentence."
      ]
    },
    {
      "heading": "II Comments upon objectives;",
      "text": [
        "A.",
        "Comparison with the classical parsing strategies: In nearly every contemporary automatic parsing system, wo have a chronology of several steps, one step by linguistic level: the morphological step, then the syntactical step, and then eventually the semantic step.",
        "The morphological step uses an exhaustive dictionary of forms or sometimes of lemmas.",
        "But we know that the human understanding uses simultaneous information coming from all levels.",
        "Some parsers now begin to use two levels simultaneously: for example the system ASCOF (SFB 100 Sarrebruck, see reference) uses semantic information coming from semantic nets in the syntactical analysis and semantic constraints in the syntactical rules.",
        "We propose to use morphology and syntax simultaneously in a parser with no dictionary."
      ]
    },
    {
      "heading": "B. Assumptions and theorical aspect:",
      "text": [
        "By \"parsing\" we mean to recognize adjectives and nouns with their gender and number, verbs in the infinitive or in the present participle and the adverbs derived from adjectives, to produce the lexicon of the text and to determine syntactical relations between words.",
        "The possible applications of such a parser are: automatic indexation, and also as a first step in every system which uses a parser: inquiry system, automatic translation, filling knowledge bases from texts, etc ..., particularly when the parser must work in open semantics.",
        "The main practical interests are to avoid consulting an exhaustive dictionary In the first step of the parsing and to process the neologisms exactly the same way as the other words.",
        "Dictionaries are expensive to update and in fact are never completely updated; consulting a dictionary produces many artefact-ambiguities, locally to the word, which are cancelled as soon as the immediate context is examined; these ambiguities produce a combination-explosion and much redundant processing.",
        "There are also some theorical aspects.",
        "If the lexical.",
        "category can be deduced with no dictionary, is this category really lexical ?",
        "We could rather name it a contextual.",
        "or functional category or even a function : a word gets its category from the flow of the text and the dictionary gives the usual categories.",
        "The jexicat category then is only the regularity of the function.",
        "Further, any word can potentially have any category (perhaps more in English than in French).",
        "Claude Hagege: \"ce sont des fonctions non des parties du discours, quW convient d'abord de poser\" (L'homme de paroles 1985 page 137).",
        "A more general theorical aspect lies in the use of computer as an experimental tool which allows now to consider linguistics as an experimental science and to use the experimental method to test linguistic theories."
      ]
    },
    {
      "heading": "III The means:",
      "text": [
        "A.",
        "General method: The main method is pattern matching.",
        "The principle is the following: the shape to recognize is compared to a set of pattom; until a match is found.",
        "But what exactly is a sham/ in a natural language?",
        "The classical terms are \"morphology\" for the word, and \"syntax\" for the sentence.",
        "We could say that morphology is the shape of the word and syntax the shape of the sentence; and more, we propose here to fill conceptually the gap between the level morphology-word and the level syntax-sentence: MorPholony + syntax = shape of the text.",
        "We can also remember that our habit of the written word properly delimited by spaces or punctuation makes us forget that the spoken string is a continuum that we cut while understanding: we use simultaneously morphological, syntactical, semantic and pragmatical information with which we make deductions, inferences, deadlocks and use intuition (about the word see Tesniere page 27, § 11 to 15).",
        "It is possible to classify the pattern matching methods in two categories: the statistic and the structural methods (see Midst and Fu).",
        "More precisely, we use here a string pattern matching method: every word of the sentence is replaced by its category, coded by a character, and question marks for unknown words: l'electricite cerebrate --> d??",
        "(d=determiner) <the cerebral electricity> maladies mentales et lesions cerebrates --> ??c??",
        "(c=coordination) <mental illnesses and cerebral lesions> Let us call this string the pattern by word that will be used in the grammar and in the parsing, The information used in the parsing is composed of three types of data: a small lexicon of the words in finite number (about §0 forms), morphological deduction rules for each word, a set of patterns of the noun phrase for pattern matching, and of course the text to analyse itself.",
        "The first sten of this study is the noun or _prepositional phrase.",
        "The following steps are the recognition of these phrases in the sentence, and the whole parsing of the sentence.",
        "This work is implemented on Apple Macintosh, and the programming language is Pascal UCSD which is suitable to develop such a parser whose algorithms are rarely recursive.",
        "B.",
        "The small lexicon: It contains about 80 forms (not lemmas): determiners (articles, possessive, demontrative and indefinite adjectives), prepositions, coordinations, some punctuation signs (considered as words).",
        "These words are the anchoring_poInts for pattern matching.",
        "But we realize that it is impossible to keep the general position to have only the words in finite number in this lexicon, and that the problem becomes pragmatic: what is the minimum of data necessary to recognize correctly the other words ?",
        "We have added the first numeral adjectives, indefinite adjectives, some very current adjectives often placed before the noun (petit, autre, memo), adverb not derived from adjective (bien, mat, tits).",
        "Every form has its possible categories, eventually gender and number; the list of the possible categories can be open: a form can have another category in a particular sentence: le blen et le mat , le la de ma clarinette For example, et can be: - conjunction which coordinates adjectives (b): valour localisatrice et pronostique --> ??b?",
        "<localizing and prognosal value> - conjunction which coordinates noun phrases (c): maladies mentales et lesions cerebrates --> ??c??",
        "<mental illnesses and cerebral lesions> - conjunction which coordinates nouns (e): creation et renouvellement lexicaux -->?e??",
        "<lexical creation and renewing> - conjunction which coordinates prepositional phrases (C): Pinfluence de !",
        "'inductance et de la capacite --> d?pd?Cpd?",
        "<the influence of inductance and capacity> We have distinguished two categories of proposition according to the \"attraction\" between the two np: high attraction: le system° cPunites <the unit system> (sort of compound nouns), or low attraction: un chat sur un toit <a cat on a roof> (facultative \"circumstant\"), whence two kinds of prepositional phrases: internal to the np : a de en (o) or external to the np : a de en sur dans chez vers (p).",
        "So de can be: - internal preposition (o) in: une theorie de la morphogenese --> d?od?",
        "<a morphogenesis theory> le system° d' unites international -->d?o??",
        "<the international unit system> - external preposition (p) in: de !animal a l'homme --> pd?pd?",
        "<from animal to human> - preposition (q) in: les diffórents moyens de faire les mesures --> d??qid?",
        "<the different ways to make measures> C. The morphological approach: Our attitude is to explore all possibilities to extract, to deduce Information from the mere morphology of the word, without dictionaries, information which can be used at any time of the syntactical analysis.",
        "For example, let us observe the words ending with Ito : -ivite -abillte -ibilite -ubillte -arlte elite ; we have a regular alternation adjective/noun: electrigue / electricite, combatif / combativite, portable / portabilitd, particuker / particularite ; from these endings, we can deduce that the word means a quality (semantic aspect) and is a singular feminine noun (category).",
        "On the semantic opposite, endings as -ification , -isation suggest an action, for example: classification comes from the noun class(e) + suffixe -ification , nationalisation comes from the adjective national + suffixe -isation , climatisaton <air-conditioning> comes from the noun climat + -isation ; these words have been derived on the same way, with the same semantic aspect: the suffixe is + er (verbal ending) = -isor or is + -ation (noun ending) = -isation has the property to make a verb or a noun which expresses an action, from adjectives (national) ) or nouns (climat ); words ending with -ification or -isation are always feminine nouns.",
        "In some cases, at first sight, the morphology does not give reliable information: a word ending by -ement can be an adverb (derived from adjective) or a masculine noun: for example lachement <slackly> is adverb and relachement <slackening> masculine noun, but a more precise study brings the following information: -Oment ==> adverb except 3 roots: agrament complement increment and except the word element ; -Oment ==> adverb: assidOment; -ublement -ibloment -ivement adverb derived from an adjective:indissolublement visiblement hativement; -oment -rment -gment noun: moment sarment fragment ; -issement -ionnetnent ==> noun derived from a verb: vagissement positionnement At last, as far as neological production uses these elements and these rules to create new words, neologismmare_analysed exactly as the other words (see Guilbert and Kokourek).",
        "These morphological properties of each word are the second kind of anchoring points for pattern matching.",
        "D. The grammar: 1. the grammar of the complex noun or prepositional phrase:",
        "The phase is considered as a three level hierarchical structure (finite number of levels): the grammar is not recursive (on that point joining TesnlOre and leaving Chomsky): phrase = complex noun or prepositional phrase which is composed of simple noun phrases which are composed of words or \"agglutinated\" words.",
        "A complex noun phrase (cnp) is: - either a simple noun phrase alone (G=snp) - or a train of simple noun phrases separated by: an expernal proposition (p=cle , dans , pour), or a conjunction coordinating snp (c=et , ou ), or a conjunction coordinating prepositional phrase (C=ot ou) and followed by a preposition (Cp=et de , ou avec), or a preposition preceding an infinitive (q=de , a , pour ) or a present participle (r=-ant ).",
        "These snp have between them relations of subordination or coordination.",
        "2. the grammar of the simple noun phrase: A snp is a train of words obeying two types of constraints: - syntactical, when the phrase agrees with a dependency tree - mohefogical, which is usually named gender-number agreement A pattern of a can is a horizontal Projection of a sub-stemma oLa canonical stemma.",
        "Let us remember that a stemma (word introduced by Tesniére) is a dependency tree.",
        "The canonical stemma represents an abstract of all possible patterns of a snip.",
        "a sub-stemma is: - either the unchanged canonical stemma, - or the canonical stemma without a leaf, - or a sub-stemma without a leaf.",
        "A stemma is a two dimensional diagram: the vertical dimension of the hierachical levels and the horizontal dimension of the written words; a stemma can be horizontally projected to obtain the one dimensional train of words as they are written.",
        "Here is an example of a possible canonical stemma of the snp, and its projection: dot adv adv adj noun adv adv adj adv adv adj dependency relations: adj > noun (depends on) projection relations: dot > det (is projected as) There is a snp pattern for every sub-stemma of the canonical stemma.",
        "The three canonical stemmas now used are equivalent to about 2000 rewriting rules.",
        "The \"agglutination\" rules are applied inside lle snp from right to left and are the bottom-up aspect of the algorithm: - every adjective can be an agglutinated adjective (A) as the result of the coordination of several adjectives: ?b?->A Bb?->A ==> ?=adjectives - in the forms: noun de noun or: noun a noun , we have internal prepositionaLphrases working like adjectives (B), which are included in the snp, and processed as adjectives, in the parsing of the snp: o?->I3 od?->B ?=noun.",
        "We recognize here Tesnidre's \"translation \"concept: the \"translation\" of the jnounLlato adjective (see Tesniere pages 443 and seq.).",
        "The prepositional phrases which can be considered as adjectives are not only preceded by: de a en , but potentially by every preposition, for example in: nonerotation par domalne ou loxicographique sons usuel ou salon la theorle recherche houristique dans les graphes applique° a la reconnaissance We can remark here that the two coordinated objects have fundamentally the same function that is often but netalwayamarked by the same category.",
        "We shall now deduce linguistic information from the form of the snp.",
        "For example, if we analyse the form: un [unknown.word] (d?",
        "), we can deduce that this unknown word is a masculine singular noun for two reasons: it matches the pattern: determiner - noun, and the whole snp inherits its gender and number from the determiner.",
        "Here is an ambiguous case: [unknown word 1] [unknown word 2] (??",
        "); we have here three solutions: either noun - adjective , or adjective - noun , or noun - apposed noun..",
        "It is often possible to decide by a morphological study of each word: Pelectdclte cerebrate --> d??",
        "and kite singular feminine noun noun - adjective une nouvelle conception --> d??",
        "and Pion ==> singular feminine noun ==> AdiUdiYfL1141113 les ondes alpha --> d??",
        "and no number agreement ==> noun - apposed noun In the texts now processed (content tables of scientific books), we have noun - adiective in about 97 % cases, probably because French is a centrifugal",
        "language: the governor first, then the dependants (see Wagner et Pinchon page 155, Tosniere pages 33 and 147) .",
        "For example, la linguistigue informatique and finfortnatique linguistique which are morphologically ambiguous, are both understood by a native speaker as a form: neurhadjeettye.",
        "If we choose to obtain only one analysis to got one deduction, we must have an order of trial, barring syntactical or morphological impossibility: this order is now: noun - adjective , then adjective - noun , then noun - apposed noun , with three stemmas tried in this order.",
        "3. some parsing difficulties:",
        "Wrong deductions upon the category come in the cases wo have several possible analysises and when morphology does not implies the category: - what does of coordinate ?",
        "two possible analysises according to whether et coordinates two snp or two adjectives; then pronostiquo can bo analysed as noun or adjective; - if the pattern is ??",
        "without any possible morphological deduction, the form noun - adjective will be choosed, and that may be wrong in some rare cases.",
        "But at the end of the parsing of the text, the lexicon is extracted and it is possible to consult it to ropers° the ambiguous phrases.",
        "JV A.",
        "How syntax and morphology work together In such a parser, the parsed language implies a parsing strategy: in French, syntax gives more information than morphology; for example, in English morphology is poor and syntax becomes morn important, in German, morphology is richer because of declensions and the throe genders.",
        "So, in French, theparsingiriguided_buy sYclauind sometimes lighted_by_morphology: .",
        "at the beginning, we look if it is possible to deduce its category, gender and number, and the deduction is marked surd or not sure, for example: Mite teminin singular noun, sure (Olectricite) -emont Inasc.",
        "singular noun (onrogistroment) or adverb (purement) ant present participle, not sure (concomant or passant) .",
        "in the study of each snp, every category and some genders and numbers are known arid the gender-number agreement is verified, for example: al and adjective (deduced by syntax) y masculine singular (ifrincipal) -iv©n and adjective --> feminine plural (gualitatives ) If a sop does not agree in gender and number, the analysis fails and the next stemma is tested.",
        "H. General ease: First, some replacements aro made in the phrase submitted to the analysis, for example: space inserted after the apostrophes to isolate I' or d' as one word, autour do --> autour-do (one word), de --> do In , dos --> doles , au --> die , aux -.> a los .",
        "Then for each word, the lexicon is consulted, and if not found, the first morphological study is made (see above), whence the sot of the possible categories of each word; this sot is classed in the order of trial.",
        "Then the ciet....et.",
        "all possible oaltenia by word is made from the combinations of the possible categories of each word, and from contextual constraints of each letter of the pattern; these constraints aro as severe as possible to reduce the number of combinations as much and as soon as possible: for example, for the phrase: evolution do reloctro-encephalogramme d'un malade atteint de paralysis generale salon los effets du traitement , the number of possible patterns is reduced from 1250 to 8.",
        "Then, each pattern is tested until the first successful analysis, except if there aro possible adverbs, infinitives or present participle.",
        "In that case, a measure of the quality of the analysis is made to get only the best analysis.",
        "The test of one pattern is made in the following way: the pattern by snp is calculated: Pelectricite cerebrate --> d??",
        "--> G (G=snp); maladies mentales et lesions du cetvoau ??c?od?",
        "--> GcG (o=preposition internal to snp); l'activation par formeturo dos youx d?p?od?",
        "--> GpG (the activation by closing eyes) (p=preposition external to snp).",
        "We verify that this pattern by snp can constitute a cnp (top-down aspect).",
        "The patterns by snp may be for example: G (snp) GcG (co-ordinated snp) GpG (sub-ordinated snp) GrG (two snp separed by a present participle).",
        "We try to apply the agglutination rules (bottom-up aspect: see above).",
        "Then we study each snp: - we test if it is possible to find a match with one of the three stemmas tested in the order: raon,adjeetive, then adiectivo peen, then nom - apposed noun, whence a deduced or confirmed category (noun or adjective) for every question mark; - we test if we have a gender-number agreement between the governing noun and its eventual depending determinant and adjectives; this is done by a sot intersection algorithm and by getting gender and number of the determinants from the lexicon, and by a morphological study (see above) of adjectives and nouns whose category has just been deduced.",
        "At any moment, if a constraint is not satisfied, the test of this pattern is stopped and the next ono is tested.",
        "A bracketed phrase gives the history of the analysis.",
        "C is impossible because et is not followed by a preposition possible patterns: ??b?",
        "??c?",
        "test of ??b?",
        "calculation of the pattern by sop: ??b?",
        "--> G possible complex phrase agglutination: applicable rule: ?h?",
        "--> A ( coordinated adjectives)",
        "bracketed structure: valour +A(localisatrice +et +pronostique) now pattern: ?A and end of agglutination study of the single snp: syntactical constraint: ?A matches with the stemma 1 (noun-adjective) valour : ?,:noun morphological constraints: valour : singular ( by morphological study ) localisatrico : feminine singular (-trice by morphological study ) pronostique : singular ( by morphological study ) gender-number agreement: feminine singular this snip is correct and of course the cnp is correct: valour >noun/f/s can be adjective elsewhere localisatrico >adj/f/s can be noun elsewhere, qualifies valour pronostiquo >adj/t/s can be noun elsewhere, qualifies valour bracketed structure: G( valour +18(localisatrice +et +pronostiquo)) if we ask for all possible analysises, we get also:",
        "In the texts now processed, tables of contents and diagrams in scientific books and articles (about -I() 000 words), the Lecogattign of categories js correct to_ 99 %, and the lexicon (Attie taxi is eorrectly___extraeted,, but the deduction of the hierarchy of the snp and of relations between snp cannot be realised only by using syntactical et morphological data because semantic and pragmatic_ information is lacking.",
        "The original assumptions aro verified: - it is possible to deduce categories of words by string pattern matching, with no dictionary and with very few data, by simultaneous use of „,yntogillat and norpbofogicel Information.",
        "the concept of category is really a functional concept."
      ]
    },
    {
      "heading": "VI References:",
      "text": []
    }
  ]
}
