{
  "info": {
    "authors": [
      "Tomek Strzalkowski"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C86-1086",
    "title": "An Approach to Non-Singular Terms in Discourse",
    "url": "https://aclweb.org/anthology/C86-1086",
    "year": 1986
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "A new Theory of Names and Descriptions that offers a uniform treatment for many types of non-singular concepts found in natural language discourse is presented.",
        "We introduce a layered model of the language denotational base (the universe) in which every world object is assigned a layer (level) reflecting its relative singularity with respect to other objects in the universe.",
        "We define the notion of relative singularity of world objects as an abstraction class of the layer membership relation"
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Linguistic (and related) literature describes numerous forms of non-singular concepts that can be found in discourse including intensional (or functional) concepts.",
        "mass concepts, generic (or general) concepts attributive concepts.",
        "abstract concepts, etc.",
        "111 [2[.",
        "pi.",
        "1111 16) [10] Not all of these approaches could properly capture the distinction between singular and non-singular interpretation of linguistic descriptions, and some were originally devised to deal with singular terms only (such as DonneIlan's attributive interpretation of definite descriptions [2]).",
        "With the exception of intensional concepts, these notions have not been given satisfactory formal representations that would account for their role in natural language discourse.",
        "Perhaps the most successful approach to non-singularity thus far has been presented by Montague 14) with his formalised concept of intension.",
        "Unfortunately.",
        "the concept of intension does not capture all aspects of non-singularity and the rigid translation system into intensional logic [11] seems to loose the important aspect of subjectivity in interpreting natural language discourse.",
        "Also, the enormous complexity of any non trivial system of possible worlds proved to be a bar in developing a computationally-oriented application of Montague's theory In this paper we introduce a fragment of a new, and as we believe, computationally feasible Theory of Names and Descriptions that offers a uniform treatment for many types of non-singular concepts found in natural language discourse.",
        "Although we limit our presentation to nominal phrase constructions, the approach can be further extended to cover other types of phrases.",
        "In our theory we present the formalised definition of non-singularity with respect to a particular discourse situation involving a discourse message, a number of individuals (parties), and their knowledge, beliefs, awareness, etc.",
        "We introduce a layered model of reality (the universe) as perceived by a discourse participant.",
        "and define the notion of relative singularity of objects in this universe as an abstraction class of the layer membership relation Subsequently, linguistic descriptions and names are classified as singular, measurably singular, or non-singular depending on what they are assumed to denote in the universe The relationship between objects addressed in discourse and classified into different layers (levels) of the universe has a particular significance for resolution of certain types of cohesive links in text.",
        "We call these links remote references because they cross level boundaries."
      ]
    },
    {
      "heading": "2. Non-singular terms in language",
      "text": [
        "Many philosophers and logicians, see [1]-[4], [6], 1101, appreciate that the usage of the underlined nominal phrases in the following sentences has a \"genera or \"generic\" character, except for \"regular\" singular interpretations which are possible only in some cases.",
        "Example 1 (tril The king wears a crown (lb) The president is elected every four years.",
        "00 Gold is a yellow metal (1d) The temperature is a measure of molecular motion ,One can imagine hundreds of similar examples involving such nonsingular objects as water, heat, the Pope, the number etc Unfortunately.",
        "there is no commonly accepted account of these species in philosophical literature Some authors, see [1] and 1101 cautiously called them generic, or general (for example the king), or functional (such as the number of students, the temperature) uses of (definite) descriptions.",
        "Others, like Kripke 131. were quite close to consider them names (or at least some of them: heat gold).",
        "Yet others, see Quine 16, 7), advocate the notion of abstract terms as being made of attributes.",
        "such as /being] red (further abstracted as redness).",
        "or [being] the man drinking the martini (which cannot be so easily nominalized) which can predicate about \"concrete\" objects.",
        "There are numerous striking linguistic puzzles involving nonsingular definite descriptions, see Pt [4].",
        "[51.",
        "The following example illustrates the phenomenon Example 2 Consider the following inferences' (2a) The temperature is rising.",
        "The temperature is ninety.",
        "so.Ninety is rising.",
        "(2b) The president met the Soviet leader many times.",
        "The president is Reagan so.",
        "Reagan met the Soviet leader many times (2c) The tiger lives in the jungle, My pet is a tiger.",
        "so.",
        "My pet lives in the jungle The conclusions in (2a) to (2c) are wrong in general case.",
        "The explanation given by numerous researchers chiefly amounted to the corroboration that the definite descriptions the temperature, the president and the tiger in the first sentences of (2a), (2b) and (2c) respectively should be interpreted functionally.",
        "i.e., as intensions [4].",
        "or functions over situations [1].",
        "Observe that if the descriptions were to be interpreted singularly or as enumerating all instances of a nonsingular object (i.e., statements containing them were understood as making claims about each instance), the reasoning would be sound.",
        "We claim that unless some two descriptions (or names) are used singularly or measurably singularly at the same level no simple reference can be made between them.",
        "In fact, another type of reference that we call remote reference can still take place and we shall put this view forward in this paper.",
        "3.",
        "The Theory of Names and Descriptions Initially let us observe that our language deals with singular objects only, no matter how complex their structure happens to be Suppose somebody is being put into position of the Observer who .perceives all these objects and has to use his language to describe ,them.",
        "Some objects are sharply distinguished from others so he chooses to give them names as John, Mary, Patsy.",
        "Sun.",
        "..",
        "The others have no clearly perceivable boundaries but he still may name them: tea, water, grass, snow, and then refer to some measurable quantities of them as some tea, little snow.",
        "etc.",
        "Yet others appear to be numerous, though enumerable, displaying strong similari'ties to one another.",
        "It would be pointless for Observer to give them each a name.",
        "Instead, he decides to refer to them as a cow, the man.",
        "this tree.",
        "etc Still, he prefers to say the sun or the lake rather than to invent new names if he is not sure how many of them are there.",
        "even if he is aware of just one specimen.",
        "Later he may find out that some objects were given identical names.",
        "so having encountered them together he must refer to one as the John.",
        "the Sun, or a Patsy.",
        "Having completed his job Observer, who is also a part of this world, may name himself Observer or the Observer, and happily sit down under a tree on the grass.",
        "Let us call the whole collection of objects he has just described as the Observer level and use the symbol Lo for it.",
        "Suppose then we ask Observer to tell us as much as he can about Lo.",
        "Soon he finds.",
        "example).",
        "At Lo we have according to the FD formula that exVy,E T (TP x)= (TP A Later the Observer may dicover that for some t1.",
        "t2 E T. (TP ti)=N and (T P t2)= R , and that at some level C_T' T where N and R belong.",
        "they are considered distinct and named Nixon and Reagan respectively.",
        "But at Lo.",
        "R=N is true.",
        "The last observation can be made clearer if one imagines that TP is some abstract individual which (like Venus) when observed in early 70's is named Nixon, while when observed in 80's is called Reagan.",
        "D Definition 6 An object N at a level L is said to be remotely referenced if the reference comes from some level L, such that either L< L,, or L,< L Typical cases of remote references in discourse have been listed in Example 2"
      ]
    },
    {
      "heading": "4. Superobjects",
      "text": [
        "Let us now examine the nature of .superobjects i.e.. the objects placed at level L.+.1.",
        "It turns out that the plural terms, e.g. presidents, tigers, etc., are actually prototypes of superobjects, see [6].",
        "and they should therefore be placed at the same level as respective superobjects.",
        "We will see that the generalization leads naturally to plural terms which may or may not induce equivalent singular superobjects.",
        "Conversely, a plural equivalent to a superobject may suggest the most natural coordinate to decompose the latter onto some lower level.",
        "When a superobject lacks a plural equivalent, however, we may admit that this object's origin has been traced down.",
        "A further decomposition is still possible but this process may often produce objects that will never assume an independent status and will remain recognized only as instances of this general concept scattered over that or another coordinate This phenomenon is characteristic of the so-called mass objects and their corresponding mass terms.",
        "Quite naturally the question of where one level ends and another begins arises The following example gives some insight into the problem of level boundaries.",
        "Example 5 Consider the following sentences.",
        "(5a) Mary brings (some) water every day.",
        "Let water in (5a) be the name of some superobject w at the level L4.1.",
        "Presumably Mary brings only a part of w but we can say that w is being brought by Mary every day This is the same w every day, although each time possibly a different part of it is in transit, which leads to the obvious translation (at L+1) (i) 5a(bred M w) where bred stands for brings every day.",
        ".On the other hand, suppose that Mary brings some water every day.",
        "Except for the above interpretation, we also have the measurably singular reading at Lo where w is scattered over some coordinate T so thattE T such that (w t) is being brought by Mary.",
        "i.e.. (it (be M (w t))).",
        "This clause is, of course, relative to every day so at Lo we could have (ii) 5a(Vx (d x) D (-it (br M (w t))))1. where bringsbr.",
        "day Both translations are essentially equivalent, and this equivalence is by no means accidental.",
        "It lends a strong support for our Theory of Names and Descriptions, and explains the intuition underlying its formulation."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "In this paper we presented a new approach to representing various kinds of non-singular concepts in natural language as the Theory of Names and Descriptions.",
        "The major observation of the Theory is that reality, as perceived by an intelligent individual, can be regarded as a partially ordered structure of levels such that each level contains only those objects which are considered relatively singular Observe t To be precise we should represent Mary as (M tj here.",
        "i.e.. as an instance, of the L. object M at some 1 E T. Floweyer.",
        "our naming convention discusser( in section 3 allows for replacing the definite description by a new name at the level L0.",
        "We shall utilize this option here.",
        "that there are virtually no restrictions imposed upon the notion of relative singularity so that the distribution of objects between levels of the world model may differ among different individuals.",
        "Nonsingular objects, called superobjects, are placed at a number of higher levels which are related to the current level with various coordinates.",
        "Conversely, a singular object may be decomposed along a coordinate, and new objects.",
        "so obtained, will be placed at some lower level.",
        "This same coordinate can be used then to obtain instances of other objects at this lower level, so that the relative singularity of objects within each level is maintained.",
        "For more details concerning various aspects of the theory the reader is referred to [B]and [9]."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The author would like to thank Dr. Nick Cercone and Dr. Jim Delgrande for their comments and suggestions that helped to improve the quality of this paper This research was supported in part by the Natural Science and Engineering Research Council of Canada under Operating Grant number A4309, by the Office of the Academic Vice President Simon Fraser University.",
        "and by the SFU's Open Graduate Scholarship Thank the LCCR for use of facilities."
      ]
    }
  ]
}
