{
  "info": {
    "authors": [
      "Wolfgang Wahlster"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C86-1036",
    "title": "Natural Language Interfaces - Ready for Commercial Success?",
    "url": "https://aclweb.org/anthology/C86-1036",
    "year": 1986
  },
  "references": [],
  "sections": [
    {
      "text": [
        "The goal of this panel is to evaluate three natural language interfaces which were introduced to the commercial market in 1985 (cf. Carnegie Group 1985, Kamins 1985, Texas Instruments 1985) and to relate them to current research in computational linguistics.",
        "Each of the commercial systems selected as a starting point for the discussion (see Wahlster 1986 for a functional comparision) was developed by a well-known scientist with considerable research experience in NL processing: Language CraftTM by Carnegie Group (designed under the direction of J. Carbonell), NI„Menu by Texas Instruments (designed under the direction of II.",
        "Tennant), and Q & by Symantec (designed under the direction of G. Hendrix).",
        "This discussion complements a panel at COLING 84 (see Sparck Jones et al.",
        "1984), which debated the proposition that database query is no longer a paradigmatic problem for computational linguistics.",
        "A commercial success of NL interfaces could have a great value to our field.",
        "When thousands of users appreciate the capabilities of NI, interfaces, computational linguists have something to be proud of.",
        "The economic interest might push forward the needed basic research and secure its funding.",
        "For the first time in the history of computational linguistics the large user communities of NL systems sold as mass products provide a basis for serious empirical research on the dialog behavior of real end-users.",
        "The discussion may influence computational linguistics as a basic science by focussing it to actual needs and by pointing out new problems which arc typically identified when NI, interfaces are transferred out of research laboratories.",
        "I asked the panelists to discuss the following questions in particular:",
        "1) How successful are the commercial systems?",
        "- How many copies have been sold?",
        "To what extent are they being used on a regular basis by the customers?",
        "- How much money do they save?",
        "Are there any cost-benefit analyses?",
        "Are the systems empirically evaluated in a commercial environment?",
        "Which evaluation methodologies are used?",
        "How well do current users adapt to the limitations of the systems?",
        "What are the main areas of application?",
        "2) What are the most important factors for success of a NL interface: the linguistic and conceptual coverage?",
        "- its robustness?",
        "- the degree of portability and transportability?",
        "- the quality of tools for adapting the systems to a new application?",
        "3) Isn't it too early for a commercialization of NL systems?",
        "4.)",
        "Don't you see the danger that the customers lose interest in NI, processing forever if their overblown expectations cannot be fulfilled by the systems currently available?",
        "5) Is it just a tremendous amount of engineering to transform a research system into a commercial product or is it much more (e.g. new concepts, algorithms, data structures?)",
        "6) How do you see the evolution of the market for NL interfaces?",
        "What are your market forcast hypotheses?",
        "7) Should commercial systems be designed for mainframes, powerful AI workstations or personal computers?",
        "8) Is it a market advantage if the system is multilingual (e.g. if there exists not only an English version but also a French, German, Spanish and Italian one)?",
        "9) What current research in.",
        "computational linguistics and artificial intelligence seems most important for improving the quality of the current products?",
        "10) Considering the next generation of commercial NI, systems, how do you assess the role of - NI, generation - cooperative response generation",
        "- speech act recognition user modeling - hybrid representation languages (e.g. KL-TWO, KRYPTON) new types of grammars (e.g. FUG, GPSG, LFG, TAG) multimedia communication (e.g. mixtures of text, graphics, gestural input)."
      ]
    }
  ]
}
