{
  "info": {
    "authors": [
      "Laurence Danlos",
      "Eric Laporte",
      "Francoise Emerard"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C86-1141",
    "title": "Synthesis of Spoken Messages from Semantic Representations (Semantic-Representation-To-Speech System)",
    "url": "https://aclweb.org/anthology/C86-1141",
    "year": 1986
  },
  "references": [
    "acl-P84-1107"
  ],
  "sections": [
    {
      "text": [
        "All the segmental phenomena have been taken into account and the next operation consists In entering prosodic markers in such a tree.",
        "2.3.",
        "The prosodic component 2 Our prosodic system is based on syntax.",
        "However, there is not an isomorphic relation between the syntax and the prosody of a sentence.",
        "For example, the syntactic structures of Jean est part/ d Paris (John went to Paris) and // est part/ <0 Paris (He went to Paris) are nearly identical, whereas there is a prosodic marker after the noun dean and none after the pronoun 11 Conversely, the syntactic representations of lean a par/es de ce problem& d Marie (John spoke about this problem to Mary) et Jean a parks de ce problem& d Paris (John spoke about this problem in Paris) are different although their prosodic markers are identical.",
        "As a consequence, we had to build a complete syntactico-prosodic grammar for French 3.",
        "This grammar enables us to obtain a structure of a sentence that is isomorphic to its prosodic structure and computable from its syntactic structure.",
        "A syntactico-prosodic category corresponds",
        "-either to a syntactic category (e.g. the syntacticoprosodic category S is equivalent to the syntactic category 5), or to a sequence of syntactic categories (e.g. the prosodic category POV [post-verbal phrase) groups together all the complements which appear after the 2.",
        "This work was supported by CNET under contract no.",
        "857B068 with LADL.",
        "3.",
        "This solution was also considered by Martin (1979).",
        "verbal syntagm [VS), and the prosodic category PRV [pre-verbal phrase] groups all the complements which appear before the VS), - or to several syntactic categories (e.g. the prosodic category VC [verbal complement) corresponds to the following syntactic categories: SUBJECT, OBJECT, A-OBJECT and ATTRIBUTE).",
        "where the sign \"I\" following an element means that the element is either absent or present once.",
        "The function",
        "I.",
        "In French, semantic features are needed to distinguish only a few non-homophonic homographs, mostly technical words, 1.",
        "Knowledge needed In a tent-to-speech system 1.1.",
        "Spelling-to-sound conversion",
        "The first problem encountered in synthesizing speech from written text is that of spelling-to-sound conversion.",
        "Certain languages are much easier than others in this respect.",
        "For example, about 50 rules are sufficient for the conversion of written Spanish into phonetic symbols, with a virtually zero error rate (Santos & Nombela 1982), For other languages, such as French or English, the problem is much greater.",
        "A phoneme does not generally correspond to only one grapheme, and the reverse is also true.",
        "For instance, the word 01,5t381/ is pronounced /wazo/ none of its graphemes Is pronounced as would be expected (i.e. /o/ for o.",
        "/i/ for /s/ for 5, schwa for e, /a/ for o and /y/ for u) Spelling-to-sound conversion is further complicated by the existence of non-homophonic homographs, i.e. words spelled the same but pronounced differently.",
        "The distinction between two homographs requires to know their grammatical categories (record is pronounced [reko:d] if it is a noun and fri.ko:dj if it is a verb), their inflexional features (read is pronounced [ri:d] in the infinitive form and [red] in the preterite), or their semantic features (lead is pronounced [led] when it is a noun or a verb related to the metal and [li:d] otherwise)'.",
        "In French, words in context raise the additional problem of liaison.",
        "A liaison occurs between a word ending in a mute consonant and a word beginning with a vowel.",
        "For example, the /2 in Mal is pronounced in men arrive but mute in mon depart However, a liaison is made only if this phonological condition is accompanied with syntactic conditions.",
        "For example, a liaison is made between a determiner and a noun as In mon arrive (my arrival), but not between a subject and a verb as in te limo arrive (The silt is coming).",
        "(SEG-CL [CU x) indicates that when [PRVJ is present, a marker f(x) must be entered after it; when [POVI is present, a marker g(x) must be entered after [VSl; in any case, x is after the last constituent, i.e. [POI/ when present, [VS] otherwise.",
        "The algorithm for entering the markers works in a recursive manner by means of a function SEG.",
        "Given a constituent [X] and the marker x that is to appear to the right of [XI, this function figures out the category C of IX] and calls (SEG-C [X] x).",
        "Next, the functions (SEG-Ci [Xi] x1), (SEG-C2 [X2] x2),(SEG-Cn [Xn] x) are called.",
        "For example, after (SEG-CL [CU x) has been called, the entering of the markers into [PRV] when present Is executed by",
        "The erasing of the auxiliary vocabulary leads to: Jean a often des anemones Marie pour /a rendre heureuse (John offered anemones to Mary to make her happy.)",
        "The syntactic component contains a morphological module (Courtois 1984) that works out an inflected form (e.g. heureuse, the feminine singular of neureux) given a basic form (e.g. heureux) and inflexional features (e.g. feminine, singular).",
        "This module is based on a dictionary that indicates an inflexion mode for each basic form.",
        "Each inflexion mode is associated with a rule that computes inflected forms.",
        "The only modification made to the text generation system was to replace the morphological module with a morpho-phonetic module that proceeds to both Inflexion and spelling-to-sound conversion.",
        "With this modification, the syntactic component produces a tree whose leaves are phonetic words.",
        "2.2.",
        "Inflenion and phonetic conuersion A French morpho-phonetic system has been built to compute an inflected phonetic form given an orthographic basic word and inflexional features (Laporte 1986).",
        "This system uses an intermediate phonological representation devised to optimize not only word Inflexion and phonetic conversion but also liaison processing.",
        "The system works in the following way: given a basic orthographic form (e.g. neureux), its syntactic category and inflexional features (e.g. adjective, feminine, singular), a phonological dictionary works out its phonological representation (e.g. orgz) The word is then inflected (e.g. env) by means of a set of rules.",
        "These rules for phonological inflexion are much simpler than those that would be required for inflecting orthographic or phonetic words.",
        "By way of illustration, the feminine of the following adjectives: bon, grand, pros, leper, petit, pris, sot, vu can be obtained from their phonological representation with only I rule, whereas 3 would be required when starting from their orthographic representation and 8 from their phonetic representation (Laporte 1984).",
        "The shift from phonological words to phonetic words entails knowing where liaisons should take place.",
        "Recall that a liaison takes place when both syntactic and phonological conditions are satisfied.",
        "In the semantic-representation-to-speech system, the syntactic tree of the sentence allows us to place liaison markers at the points where a liaison is syntactically allowed.",
        "The conversion of phonological words into phonetic words is then performed by a set of straightforward rules that check the phonological conditions of liaisons at the points where a liaison marker is present, Laporte's system is represented in Fig, 1.",
        "From the text template (2), the syntactic component with the morpho-phonetic module outputs the following tree:",
        "marked with the sign [-1.",
        "We present three syntactically different versions of the same terrorism crime to emphasize the robustness of the syntactic component and the entering of appropriate prosodic markers according to syntax.",
        "The semantic-representation-to-speech system developed in COMMON-LISP produces a spoken message of about 35 words in less than 1 second.",
        "In our system, only the strategic component is domain dependent.",
        "The lexicon and discourse structures used to build the text templates are domain dependent linguistic data.",
        "The rest of the system is domain independent.",
        "Let us recapitulate the data and rules integrated in it:",
        "- a syntactic component which can apply the French grammar rules whatever the structure of the texts and the syntax of the sentences; - a complete phonological dictionary of the 50,000 basic forms of French and a set of rules for obtaining a phonetic text from a phonological text; - a complete syntactico-prosodic grammar of French and a set of rules that enable us to enter prosodic markers in a sentence whatever the syntax of the sentence; - a speech synthesizer and a synthesis software.",
        "To sum up, the phonetic conversion of French texts relies on syntactic knowledge to deal with homographs and liaisons."
      ]
    },
    {
      "heading": "1.2. Prosody",
      "text": [
        "A text-to-speech system supposes the storage of minimum acoustic units that allow the reconstruction of the acoustic signal for any sentence, One solution consists in the choice of diphones as acoustic units.",
        "A diphone is defined as a segment (about 1,200 for French) that goes from the steady state of a phonetic segment to the steady state of the following segment and that contains in its heart all the transitional part between two consecutive sounds.",
        "Furthermore, the issue of increasing the naturalness of synthetic speech requires to take into account prosodic factors, namely, stress, timing (structuring of the utterance by pauses) and intonation.",
        "Intonation is characterized by the interaction of three parameters: evolution of intensity and laryngeal frequency as functions of duration.",
        "The prosodic behavior of one speaker was therefore subjected to a systematic study.",
        "An acceptable model was extracted from this behaviour.",
        "The prosodic processing (Emerard 1977) is based on the allocation of prosodic markers (e.g. (.1, [4,]) at different points In a sentence.",
        "Fifteen prosodic markers were considered to be sufficient for determining suitable prosodic contours for the synthesis of French.",
        "Each marker assigns a melody and a rhythm to each syllable of the preceding word, More precisely, each marker may cause an interruption in the diphone concatenation, introduce a pause, affect to varying degrees the amplitude of laryngeal frequency (F0) on the last vowel of the word, determine rising or falling Fo movements.",
        "The choice of a marker after a constituent is determined both by the syntactic category of the constituent (verbal syntagm, subordinate clause) and by its location inside the sentence, especially by the existence of a more or less complex right context.",
        "In the simple enunciative sentence dean part (John is leaving), the prosodic processing has to give the following results: dean NI part [.]",
        ".",
        "Nevertheless, it is not possible to conclude with the following prosodic rules [14] is the marker assigned to [end of subject noun phrase] [.]",
        "is the marker assigned to [end of verbal syntagm] because in the enunciative sentence Jean part et Marie went (John is going away and Mary is coming), the prosodic processing has to propose: dean E=1 part Li et Marie [*] went H. A comparison of these two sentences clearly shows that it is not possible to assign a specific marker after a constituent only on the basis of its syntactic category.",
        "It is necessary to take its right context into account.",
        "Moreover, placing prosodic markers must be carried out in a hierarchical manner.",
        "For example, the marker between the preverbal phrase and the verbal syntagm depends on the marker assigned at the end of the clause containing them; this last marker depends in turn on the marker assigned at the end of the sentence containing the clause.",
        "To sum up, the issue of prosody is handled by placing appropriate markers in appropriate locations.",
        "This can only be done when precise syntactic information is available."
      ]
    }
  ]
}
