{
  "info": {
    "authors": [
      "Joyce Friedman",
      "Dawei Dai",
      "Weiguo Wang"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C86-1047",
    "title": "The Weak Generative Capacity of Parenthesis-Free Categorial Grammars",
    "url": "https://aclweb.org/anthology/C86-1047",
    "year": 1986
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Abstract: We study the weak generative capacity of a class of parenthesis-free categorial grammars derived from those of Ades and Steedman by varying the set of reduction rules.",
        "With forward cancellation as the only rule, the grammars are weakly equivalent to context-free grammars.",
        "When a backward combination rule is added, it is no longer possible to obtain all the context-free languages.",
        "With suitable restriction of the forward partial rule, the languages are still context-free and a push-down automaton can be used for recognition.",
        "Using the unrestricted rule of forward partial combination, a context-sensitive language is obtained."
      ]
    },
    {
      "heading": "INTRODUCTION",
      "text": [
        "The system of categorial grammars, developed in modern times from the work of Ajdukiewicz (1935), has recently been the attention of renewed interest.",
        "Inspired by the use of categori-al notions in Montague grammar, more recent systems, such as GPSG, have developed related concepts and notations.",
        "This in turn leads to a resurgence of interest in pure categorial systems.",
        "Classically, a categorial grammar is a quadruple G(VT,VA,S,F), where VT is a finite set of morphemes, and VA is a finite set of atomic categories, one of which is the distinguished category S. The set CA of categories is formed from VA as follows: (1) VA is a subset of CA, (2) if X and Y are in CA, then, (X,'Y) is in CA.",
        "The grammar also contains a lexicon F, which is a function from words to finite subsets of CA.",
        "A categorial grammar lacks rules; instead there is a cancellation rule implicit in the formalism: if X and Y are categories, then (X/ Y) Y X.",
        "The language of a categorial grammar is the set of ter-• minal strings with corresponding category symbol strings reducible by cancellation to the sentence symbol S. In 111 Ades and Steedman offer a form of categorial grammar in which some of the notations and concepts of the usual categorial grammar are modified.",
        "The formalism at first appears to be more powerful, because in addition to the cancellation rule there are several other metarules.",
        "However, on closer examination there are other reasons to suspect that the resulting language class differs sharply from that of the traditional grammars.",
        "Among the new rules, the forward partial rule (FP rule) is most interesting, since one may immediately conclude that this rule leads to a very large number of possible parsings of any sentence (almost equal to the number of different binary trees of n leaves if the length of the sentence is n).",
        "But its effects on the generative power of categorial grammar are not really obvious and immediate.",
        "Ades and Steedman raised the question in the footnote 7 in 01 and left it unanswered.",
        "We will first formally define categorial grammar and the associated concepts.",
        "Then we analyze the generative power of the categorial grammars with different interesting combinations of the reduction rules.",
        "The categorial grannnars considered here consist of both a categorial component and a set of reduction rules.",
        "The category symbols differ from the traditional ones because they are parenthesis--free.",
        "The categorial component consists as before of a set VA of atomic categories including a distinguished symbol 5, and a lexical function F mapping words to finite sets of categories.",
        "However, the definition of category differs: (1) VA is a subset of CA, (2) if X is in CA, and A is in VA, then X/A is",
        "in CA.",
        "Notice that the category symbols arc parenthesis free; the implicit parenthesization is left--to--right.",
        "Thus the symbol (A I(B IC )) of traditional categorial grammar is excluded, since A /B IC abbreviates ((A /13)1C).",
        "However, some of the rules treat A IB IC as though it were, in fact, (A /(11IC))."
      ]
    },
    {
      "heading": "DEFINITIONS",
      "text": [
        "Notation.",
        "We use A, B, C to denote atomic category symbols, and //, V, X, Y to denote arbitrary (complex) category symbols.",
        "The number of occurrences of atomic category symbols in X is I. Strings of category symbols are denoted by x, y. Morphemes are denoted by a, b; morpheme strings by u, v, A categorial grammar under certain reduction rules is a quadruple GR = (VT, VA, S, F), where: V7' is a finite set of morphemes, VA a finite set of atomic categories, SE VA a distinguished element, F a function from VT to 2' such that for every a E VT, F(a) is finite, where CA is the category set and is defined as: i) if A E VA, then A E CA, ii) if X E CA and A E VA, then X/A E CA, iii) nothing else is in CA.",
        "The set of reduction rules 1?",
        "can include any combination of the following:",
        "(1) (F Rule) If U/A E CA, A E VA, the string U/A A can be replaced by U.",
        "We write: 11/A A U; (2) (FP Rule) If U/A, A/V E CA, where A E VA, the string U/A A/V can be replaced by 11/V.",
        "We write: U/A A,'V 11/ V; (3) (FP 2 Rule) if U/A, A/.11 E CA, where A, 11 E VA, the string U/A A/11 can be replaced by 1///1.",
        "We write: U/A A/B U / B; (4) (FP s Rule) Same as (2) except that U/A must be headed by S; (5) (B Rule) If U/A E CA, A E VA, the string A U/A can be replaced by U.",
        "We write: A U/A 4 U; (6) (B s Rule) Same as (5) except that U/A must be headed by S.",
        "When it won't cause confusion, we write CR to denote a categorial grammar with rule set /I, and specify a categorial grammar by just specifying its lexicon F. The reduce relation --=> on CA* x CA* is defined as: for all a, p E CA* and all X,Y,Z E CA, cxX Y/3 => olZp if X Y Z.",
        "Let -:>* denote the reflexive and transitive closure of relation un:> A morpheme string w=w rw 2 • • • w„, where wi E V7', i =1,2, • • • n , is accepted by CR =- (VT, VA, S, F) if there is",
        "The language accepted by CR = (VT, VA, S, F), L(GR) is the set of all morpheme strings that are accepted by GR.",
        "The categorial grammar recognition problem is: given a categorial grammar GR = CGR (VT, VA, S, F) and a morpheme string w E VT*, decide whether w E L(GR ).",
        "The derivable category set DA C CA under a set R of reduction rules is the set of categories including all the primary categories designated by F, and all the reachable categories under that set of reduction rules.",
        "It is formally defined as: i) X is in DA if there is an a E VT such that X E F(a), ii) For all X, Y E DA and Z E CA, if X 17 Z by some rule in R then Z E DA, and iii) Nothing else is in DA.",
        "GRAMMARS WITII FORWARD CANCELLATION ONLY We begin by looking at the most restricted form of the",
        "reduction rule set R IF).",
        "The single cancellation rule is the forward combination rule.",
        "It is well-known that traditional categorial grammars are equivalent to context--free grammars.",
        "We examine the proof to see that it still goes through for categorial grammars GR with R = IF).",
        "Theorem The categorial grammars GR, R = In, generate exactly the context-free languages.",
        "Proof (1) Let CR be a categorial grammar with R = IF).",
        "GR becomes a traditional categorial grammar once parentheses are restored by replacing them from left to right, so that, e.g., A/B/C becomes ((A/11)/C).",
        "Hence, its language is CF. (2) To show that every context-free language can be obtained, we begin with the observation that every context-free language has a grammar in Greibach 2--form, that is, with all rules of the three forms A -> aBC, A -> aB, and A -> a, where A, B, C are in V N and a is in VT [6].",
        "A corresponding classical categorial grammar can be immediately constructed: F (a ) I ((A/C)/B), (A/ B), Al.",
        "These are the categories A/C/B, A/B, and A of a parenthesis-free categorial grammar.",
        "The details of the proof can be easily carried out to show that the two languages generated are the same.",
        "GRAMMARS WITH BACKWARDS CANCELLATION The theorem shows that with I?",
        "= IF) exactly the context-free languages are obtained.",
        "What happens when the additional metarules are added?",
        "We examine now parenthesis--free categorial grammars with R = IF, B} and R = IF, B s I.",
        "Rule B s is the version adopted in in; B is an obvious generalization.",
        "In either case we are adding the equivalent of context-free rules to a grammar; the result must therefore still yield a context-free language.",
        "So one guess might be that categorial grammars of these types will still yield exactly the context-free languages, perhaps with more structures for each sentence.",
        "An alternative conjecture would be that fewer languages are obtained, for we have now added some \"involuntary\" context-free rules to every grammar.",
        "Example: Consider the standard context--free language L1= { a\" b\" n >0}.",
        "The easiest grammar is S -> aSb, S -> ab.",
        "The Creibach 2--form grammar is S -> aSB, B ->b, S -> aB.",
        "The constructed categorial grammar GR then has F (a) = {S/B, S/B/S} and F (b) {B }.",
        "If R = IF'), this yields exactly L However, with R = I F, B) or R = IF, B s ), here equivalent, CR yields a language L2 = lab, ba, aabb, abab, bbaa, baba, boat, ...",
        "I, which contains L1 and other strings as well.",
        "It is the language of the context--free grammar with rule set IS -> bC, S -> Cb, C -> aS, C -> Sa, C -> a).",
        "Reversible languages.",
        "Let xi1 be the reverse of string x That is, if x = a la 2 • • • a,„ (a; E VT ), then xi?",
        "=a\" • \" a 2a '-Call a language L reversible if x EL iff xn EL L. Examples: The set of all strings on (a, b} with equal numbers of a's and b's is a reversible CF language.",
        "let) In >01 is not a reversible language.",
        "Theorem The languages of categorial grammars CR with R IF, B) are reversible.",
        "Proof If x => *S, then xi?",
        "=> 5,5 by a reduction whose tree is the mirror image of the one for x in which rules F and B have been interchanged.",
        "Theorem Let GR be a categorial grammar with I?",
        "contains IF, B) or IF, B s ).",
        "R may or may not also contain some form of FP rules.",
        "If L (CR) contains any sentence of length greater than one, then it contains at least one sentence w = uv such that vu is also in L (CR).",
        "Proof Let w be a sentence of L (GR) of length greater than one.",
        "Suppose the final step of the reduction to S uses rule F. Then w = u v where u - > * A and v * A.",
        ".But then v u > * A S/A S by rule B or B s. No form of FP can be used as the final step of the reduction to S, so its presence does not affect the result.",
        "Corollary There are context-free languages that cannot be obtained by any categorial grammar GR , where R contains IF, B) or IF, B s )."
      ]
    },
    {
      "heading": "CATEGORIAL GRAMMAR IS CONTEXT-FREE IF THE FP RULE IS RESTRICTED",
      "text": [
        "The method that had been used to construct a context-free grammar G equivalent to a classical categorial grammar can be formally described as following: (1) For each a E VT, if X E F(a), then put X -> a in G; (2) For each derivable category X/Y, put X X/Y Yin G. This method remains valid when B s rule is added.",
        "We just need to put an additional rule X -> Y X/Y in G whenever X is headed by S. But this doesn't work when the FP rule is allowed.",
        "We might put in the CF rule U/V -> U/A A/ V for each derivable category U/V and for each atomic category A, but in case there is a category like A/ B/ A, then any category symbol headed by A followed by B's and ended by A is a derivable category.",
        "There are infinitely many of them, so by using this construction method, we might have to put in an infinite number of CF rules.",
        "Therefore, this method does not always find a finite context free grammar equivalent to a category grammar with the FP rule.",
        "As we shall see, there may be no such context .free grammar.",
        "Let's now enforce some restrictions on the FP rule so that it won't cause an infinite number of derivable categories.",
        "Actually, using the FP rule sometimes violates the parenthesis convention, e.g. applying FP on 4 'A ft 'C /I) implies that B/(7/D is interpreted as (13/(C/ D)).",
        "However, by the parenthesis convention, B/C/D is the abbreviation of ((B/C)/D).",
        "Notice, however, when the second category symbol has exactly two atomic symbols, i.e., is in form A/B, the FP rule does not violate the convention.",
        "Coincidentally, if the FP rule is accordingly restricted as to FI' 2, the derivable category set becomes finite.",
        "Lemma For a categorial grammar GR (VA, VT,S,F), let",
        "Proof From the definition ii) of DA, we can see that any new category Z added to DA by a form of the B rule can be added by the F rule.",
        "The lemma follows.",
        "Lemma The derivable category set DA of a categorial grammar CR with R IF , FP 2) is finite and constructible.",
        "Sketch of Proof We begin with the observation that none of the reduction rules in R increases the length of category symbols, and the initial lexical category symbols are all of finite length.",
        "This implies that the length of all the derivable category symbols are bounded.",
        "So there are only finitely many of them.",
        "We now give an algorithm for computing DA, to show that it is constructible."
      ]
    },
    {
      "heading": "Algorithm: Compute DA of a GR with R = IF , FP 2).",
      "text": [
        "Input: A categorial grammar GR (VT, VA,S, F) with ft= IF , 21.",
        "Let DA = U (a );",
        "For all non-atomic categories U/A E DA",
        "(1) If A C DA Then DA = DA U U (2) For all non-atomic categories A/ B E DA",
        ", FP 2, B 1, and can be similarly proved.",
        "We choose R , FP 2, B s / to state the theorem because it is closest to Ades and Steedman's model [1].",
        "THE FP RULE IS USEFUL ONLY ON S-HEADED CATEGORIES Now the next question is what if the FP rule is riot restricted to U/A A/B -• II/B.",
        "Intuitively, we can see that the application of the FP rule on a category which is not headed by S is not crucial in the sense that it can be replaced by an application of the F rule, because whenever U/A A/V appears in a valid derivation to a sentence, the V part must be cancelled out sooner or later, so we can make a new derivation that cancels the V part first and get U/A A on which we can apply the F rule instead of the FP rule.",
        "But this doesn't hold if 11/A is headed by S. For example, when we have A S/B IV A, we can't do backward combination on .4 and S/A if we don't combine S/B and 11/A first.",
        "So, we expect that the weak generative power of categorial grammar wouid remain unchanged if the FP rule is restricted to be used only on categories which are headed by S. This in fact follows as our next theorem.",
        "Lemma Given a categorial grammar Gn (V T, VA, S, F) with R , FP , B s L for any w E CA* and A E VA, if there is a reduction w =:* A, then there is a reduction of w to C using FP rule only on categories which are headed by S. Sketch of Proof Formalize the idea illustrated above.",
        "❑ As an almost immediate consequence, we have: Theorem The language accepted by categorial grammar GR (VT , VA , S , F) with I?",
        "= IF , FP , B sl is the same as that accepted with I?",
        "= (F , FP s, B s Proof It trivially follows the lemma.",
        "❑ Corollary FP rule is useless if there is no form of the B rule, i.e., any GR (VT , VA , S , F) with 1?",
        "= FP) will generate the same language as that generated with R ="
      ]
    },
    {
      "heading": "A CONTEXT-SENSITIVE LANGUAGE GENERATED USING UNRESTRICTED FP RULE",
      "text": [
        "This section gives a categorial grammar with unrestricted FP rule that generates a language which is not context-free.",
        "Consider categorial grammar C r = CR (VA , VT „5,F), where VT = (a, c ), VA = (A, C, S }, F (a) = ), F (b) = (S/A/C/S, S/A/C}, F (c) IC }, and)?",
        "= (111, B s , FP ).",
        "Claim 1 a' b' c' E L (G 1) for i > 0.",
        "Proof For any i > 0, we can find a corresponding categorial string for a' b' c' : A' (S /A /C /S '(S/A IC )C' .",
        "A reduction to S is straightforward.",
        "❑ Claim 2 For all w E VT *, if w E L WO then Cbie (a ) Cbie (1) = (c).",
        "Proof First, it is easy to see that from the lexical categories, we cannot get any complex category headed by either A or C, and we can get atomic category symbol A or C only directly from the lexicon.",
        "Second, each morpheme b would introduce one A and one C within a complex category symbol which must be cancelled out sooner or later in order to reduce the whole string to S In general, there are two ways for such A and C being cancelled: (1) with an A - headed or C headed complex category by the FP rule, which is impossible in this example; (2) with a single atomic category A or C by either the F or B s rule.",
        "We have seen that such single A and C can only be introduced by the morpheme a and c , respectively.",
        "So G/),„ (a ) = (b) = (c ).",
        "To show that L (GI) is not context-free, we take its intersection with the regular language a 565c* .",
        "By claim 1 and 2, the intersection is exactly the language la\" 6' c\" n > 0) which is well known to be non context -free.",
        "Since the intersection of a context free language with a regular set must be context -free, 1, (G 1) cannot be context -free.",
        "PROCESSORS A categorial grammar is certainly no worse than context-sensitive.",
        "We can verify this by using a nondeterininistic linear bounded automaton to model the reduction process.",
        "For even in the case of reduction by the unrestricted FP rule, the category symbol obtained by reduction is shorter than the combined length of the two inputs to the rule.",
        "Ades and Steedman 111 propose a processor that is a push-down stack automaton and pushdown stack automata are known to correspond to the context-free languages.",
        "How can we reconcile this with the context sensitive example above?",
        "The contradiction arises because the stack of their processor must be able to contain any derived category symbol of DA, and thus the size of the stack sy inbols is unlimited.",
        "The processor is thus not a pushdown automaton in the usual sense.",
        "Acknowledgment: We would like to thank RamaratInam Ven katesan and Remko Scha for helpful discussions of the material.",
        "This work was supported in part by National Science Foundation Grant No.",
        "1ST-.8317736."
      ]
    }
  ]
}
