{
  "info": {
    "authors": [
      "Ryochi Sugimura"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C86-1120",
    "title": "Japanese Honorifics and Situation Semantics",
    "url": "https://aclweb.org/anthology/C86-1120",
    "year": 1986
  },
  "references": [],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "A model of Japanese honorific expressions in situation semantics is proposed.",
        "Situation semantics provides considerable power for analyzing the complicated structure of Japanese honorific expressions.",
        "The main feature of this model is a set of basic rules for context switching in honorific sentences.",
        "Mizutani's theory of Japanese honorifics is presented and incorporated in the model which has been used to develope an experimental system capable of analyzing honorific context.",
        "Some features of this system are described."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The Japanese language, like Korean and many non-European languages, contains a grammaticalized system of honorific forms.",
        "It is well known that the use of honorifics is closely connected to context, including aspects like relative social standing.",
        "No effective mechanisms have been developed to deal with this problem.",
        "Situation Semantics (SS) 1Barwise 1982,1984a,1984b,1985a,1985b,1985c,1985d,1985e11Ba•wise & Perry 1983111,experancell Pollard 198511Creary & Pollard] is a theory of context used here to construct a model of honorific sentences to analyze the relationship between sentence and context.",
        "About Japanese, we can make use of Mizutani's theory of honorifics [Mizutani 1983a,1983b1.",
        "This theory does tackle the relation between context and sentence, but it seems that SS can describe context move usefully than Mizutani's theory.",
        "In this paper, SS is used to reconstruct the context given by Mizutani's theory.",
        "honorific forms are analyzed and basic rules for context switching are established.",
        "Table 1 gives the relation between Mizutani's theory of honorifics and the model.",
        "This model can be divided into two parts.",
        "The first part describes basic context features and the second describes lexical rules based on Mizutani's Japanese grammar, along with some basic mechanisms of \"context switching.\"",
        "It is very easy to re] resent some context features in discourse in SS, but context involves some very difficult problems like \"focusing.\" We want to analyze this in future research.",
        "In this paper only enough elements for context required in Mizutani's theory are set up.",
        "The main concern here is the second part of the model which deals with the relationship between contextual elements and lexical elements, and especially the mechanism of \"context switching\" on honorifics.",
        "Mizutani's theory of honorific expression in Japanese is described first.",
        "Then the model in SS is presented.",
        "The context feature of relative social status in Mizutani's theory is realized in the first part of the model.",
        "This is followd by explanation of seine basic features designed to handle the mechanism of context switching in the second part.",
        "Finally, an experimental system based on this model is given.",
        "This system was implemented in CH, (Complex Indeterminate Language)IMukai 1985a, 1985134 Results from some experiments processing Japanese honorific expressions are given at the end of the paper."
      ]
    },
    {
      "heading": "2. Mizutani's theory of Japanese honorific expression",
      "text": []
    },
    {
      "heading": "2.1. Honorific Status",
      "text": [
        "Honorific relations are represented as vectors in an abstract two_ dimensional honorific space.",
        "In the honorific space the speaker in the discourse is set as the origin.",
        "Other individuals like hearer and agents who are presented in the sentence of discourse are represented by vectors as in the following example.",
        "An honorific attitude is defined as the vector between these points.",
        "For example, the honorific attitude from the speaker (I) to the hearer (Y) is defined as a vector from 1(0,0) to Y(y1,y2).",
        "The honorific attitude from the",
        "1) Up <t> > 0, 3) Flat <t> = 0 A al = 0, 2) Down <t> < 0, 4) Across ,<L> = 0 A al \\ 0,",
        "We represent the \"flat\" honorific relation between agents explicitly, but the \"across\" relation is represented as in which there is no need to express the honorific relation explicitly.",
        "For conventional use, we define the following directions.",
        "5) anyl up or down or flat 5) any2 up or down or flat or across To analyze the sentence uttered, definitions of the following honorific relations are necessary.",
        "The honorific attitude of the speaker or the hearer toward the agent in the sentence of discourse.",
        "In this case the original point of the vector should be the point of the hearer or speaker, whichever is higher.",
        "If I > 11 the original point of the vector will be I, and if 1 < II the origin will II.",
        "We introduce the notation J which stands for the higher individual."
      ]
    },
    {
      "heading": "2.2. Japanese Grammar",
      "text": [
        "Now we can represent the relation between these three honorific relations and the sentences of discourse.",
        "Before looking at this honorific relation, we will show the small number of Japanese grammar rules used to define the structure of sample Japanese sentences.",
        "This grammar is taken from the \"Sketch of Japanese Grammar\" [Mizutani 1983a1 a part of which is shown in Figure 1.",
        "This grammar is presented in CFG, but we give the rules in DCG.",
        "SD 0 --> ph,ps.",
        "ph --> np,cm,ph.",
        "ph --> vp.",
        "vp > subl,v,sub2.",
        "honorific form vp --> v. vp --> v,sub4.",
        "honorific form np --> n. np --> n,sub3.",
        "honorific form ii>>1g(tallroJAhanako (name of individual) cm – > [nil.",
        "agent / object case marker cvm --> 1 aul.",
        "(meet) v --> [int (say)",
        "In his theory, ,Mizutani attaches Japanese terms to each terminal and non _terminal node.",
        "Table 2 gives the correspondence between Mizutani's Japanese terms and standard English grammatical terms.",
        "Rules *1) and",
        "*2) above are not represented in his grammar.",
        "These rules were included specifically to represent direct and indirect speech.",
        "sn(sentence nuclear) = juttaiku sno(sentence nuclear 0) = juttaiku0 cm(case marker) = kakuhyoji.",
        "ps (post sentence marker) = juttaiji.",
        "ph (phrase element) = jutsuso.",
        "vp (verb phrase) = yorengo.",
        "v (verb) = doshi np (noun phrase) = tairengo.",
        "n (noun) = taigen.",
        "2.3.Relation between honorific context and Japanese grammar.",
        "The following relation holds between honorific relations and the sentence of discourse.",
        "The notation \"= = >\" means the left element has some effect on the right element.",
        "2) Changes in the second order honorific relation are shown by description of individual Al and the honorific elements subl and sub2 of vp in the agent case , and by description of individual A2 as the np in the object case.",
        "3.",
        "Model of the honorific sentence",
        "In this section, we present our model in SS.",
        "Readers who are familiar with SS can skip Section 3.1."
      ]
    },
    {
      "heading": "3.1. First Part on Context Features 3.1.1. Model of discourse",
      "text": [
        "In the theory of situation semantics, discourses are represented within situations and constraints.",
        "In formal representation the sentence and context are expressed in the form \"d,c [sentence]s , e\".",
        "d stands for discourse situation (DU), c is the speaker's connection (CS), s is the setting and e is the described situation.",
        "There is another situation called a resource situation in this theory.",
        "In our model we define a resource situation for each individual.",
        "(I) Discourse Situation (DU) here is an example of the representation of a sentence in discourse.",
        "Ex 2.",
        "John said \"Tom met Jane\" to Jim.",
        "el : = toe ,10 ; yes saying John ; yes addressing John,Jim ; yes uttering \"Tom met Jane\" ; yes 10 < Id (Id means discourse location)",
        "Discourse situations are represented in the following form as series of terms expressing relations between speaker A, hearer B and uttered sentence [[alpha]].",
        "In SS, spatio-temporal location is defined in discourse situations, but we have no effective way to formalize it in our model, so spatio-temporal location is not represented.",
        "DU : = speaking A;yes addressing,A,B;yes saying,A,alpha;yes (II) Speaker's Connection (CS)",
        "The speaker's connection is a series of the following types.",
        "A is the actual object and [A] is the word that represents A. CS : = speaking A;yes refers A [Al ; yes",
        "A resource situation is defined for each individual in a discourse; it contains many events and constraints."
      ]
    },
    {
      "heading": "3.1.2. Honorific context in the sentence (I) Honorific Attitude Event type",
      "text": [
        "We introduce an \"honorific attitude event type (Eh)\" which stands for an honorific attitude in Mizutani's theory.",
        "Formula 1) represents the mind status (HE) of the speaker towards Eh.",
        "A denotes the individual and \"Hr\" indicates that in the mind of the individual A, the honorific event type Eh is \"represented.\" Eh shows the external honorific event including social honorifics.",
        "Formulas 2) through 5) represent the basic honorific attitude event types (Eh).",
        "In Mizutani's theory, this event type is represented as a vector, but we represent it in the form of a binary relation.",
        "For one example, in 2) \"honor-up\" denotes the honorific relation between individuals t and t'.",
        "\"ind t ; yes\" denotes that t is an individual which can be represented in \"_\" as its name.",
        "Frame of Mind 1) HE : = Ilr, A, Eh ;yes oft ;yes of t', ;yes 2) Eh : = honor_up t,t';yes ind t ,_;yes ind LIT ;yes 3) Eh : = honor_down t,t';yes ind t, ;yes ind t',_ ;yes 4) Eh : honor across t,e;yes ind t, ;yes ind t'_ ;yes 5) Eh : = honor_eq t,t';yes ind t, ;yes ind t'_ ;yes",
        "In Section 2.3. we described the relation between honorific context and grammatical rules.",
        "This section corresponds to Section 2.3.",
        "In Japanese there are many honorific words, and some interesting phenomena are to be found in daily life.",
        "For example, a secretary in the company president's office should have many honorific words in his resource situation (RS) because he always has to be careful to use the appropriate honorific expression in his work.",
        "On the other hand university students will have a poor stock of honorific words for there is no need to express honorific status, except to teachers.",
        "A constraint is required which determines the relation between the honorific event type (Eh) and word representation.",
        "This is the \"conditional constraint on word selection (Cw).\" Mizutani's rules for first order through third order honorific relations given in 2.3. correspond to this constraint Cw.",
        "Word representation should he an event type called \"honorific word selection event (11W)\", and if a person does not have this event type in his resource situation, he or she will have a poor range of honorifics.",
        "We represent these Cw and IIW in formula 6).",
        "In formula 6), \"Cwl(Eh,f)\" denotes the conditional constraint of word selection Cw which has Eh and anchor \"f\" as its conditional schema.",
        "Anchor \"f\" determines the relation between indeterminates in Eh and objects like taro and hanako.",
        "See Barwise's work for details.",
        "6) is read : if Eh is factual and Cw is satisfied, then I IW is actual.",
        "Conditional constraint on word selection has an honorific event type and its anchor as its scheme.",
        "In Japanese honorific expressions, if Eh and f are given, the word representation will follow very easily.",
        "Some instances of this are given in formulas 7) through 15).",
        "For example, formula 7) can be read : if Eh is actual and the anchor f anchors t to individual J (J is the speaker or the hearer) or t' to Al in the agent case, then hw is actual so that when refering to t' honorific form tairen-go (np) is added to the description Al.",
        "7) EMO f(t) = J, fit') =Al hw := refer t' , [A 1 Ilnp in h-forml 8) Eh(f) f(t)=J, f(t')= A2 hw : = refer t' , [A2][np in h-forml 9) Eh(f) f(t) =J, f(t') = Al hw : = refer R , [II][vp in h-form] 10) Eh(f) f(t) = Al,fit')--- A2 : = refer R , [111[vp in h-form] 11) Eh(f) f(t) = I, f(t')= := refer E , [Ellps in h-form1 12) Eh(f) fit) =I, fill= A 1 hw:=refert',[t] 13) Eh(f) 110=1, f(t') = A2 tiw = refer t' , [t]"
      ]
    },
    {
      "heading": "3.2. Second Part on The Relation between Context Features and the Sentence 3.2.1. CIL as basic language",
      "text": [
        "Before going into the representation of lexical rules which give the correspondence between honorific word expressions and sentences, and context switching on honorific sentences, we describe CIL used in the description of lexical rules.",
        "Accurate accounts of CIL can be found in [Mukai 1985a,1985b1.",
        "Here only the part needed to understand the lexical rules in section 3.2.2 is described.",
        "CIL (Complex Indeterminate Language) can be represented by the following formula.",
        "CIL has the unique data structure called \"complex indeterminate.\" This data structure can be regarded as a frame and represented as in the following example.",
        "(1) term((X with a: = X, b: = Y where X = Y)).",
        "(2) > term(Z),alZ = abc,b!Z = abc.",
        "yes.",
        "Formula (1) is the specification of the data type and this can be used in formula (2).",
        "\"a := X\" means assign value X to slot a.",
        "\"X= Y\" denotes the condition part.",
        "If this condition is not satisfied the unification \"term(X)\" in (2) will fail.",
        "Formula (2) utilizes the complex indeterminate and unifies \"abc\" to each slot value."
      ]
    },
    {
      "heading": "3.2.2. DOG Rules for honorifics",
      "text": [
        "(I) First order honorifics As Rule 1 in Section 2.3. shows, first order honorifics affect \"ps.\" This is illustrated by the following examples.",
        "Ex.3 This corresponds to Eh in 11) in section 3.1.2. psatainX,Context) < - dsolve(honofi(agentfids!Context))firs!Context), eq(speakerRds!Context),objectRlex!Context))).",
        "\" < -\" denotes the operator \":-\" in Prolog [Bowen 19821.",
        "\"ttalX1,X\" is the DCG parsing mechanism.",
        "\"Context\" is a complex indeterminate variable for the context for this parsing part.",
        "\"dsolve\" is a Prolog predicate with the following mechanism.",
        "dsolve(X,Y).",
        "Xis a list like [a,b,c,d] which contains Prolog atoms or terms.",
        "Y is a Prolog atom or term.",
        "1) Search list X for Y.",
        "2) If there is a term in X with the same arguments but different term name, fail and return.",
        "3) If Y is not in X, then add Y to list X,succeed and return.",
        "4) If Y is in X, succeed and return.",
        "\"honol((agentl(ds!Context))!",
        "(rs!Context))\" represents a list of honorific event types in the resource situation of the agent of discourse.",
        "\"object!",
        "(lex!Context))\" represents the lexical object in this parsing stage.",
        "This",
        "notation for lexical items has its origin in Lexical Functional Grammar [Kaplan & Bresnai], so this expression can be represented like (`object) in the LEG manner.",
        "This example states that if \"ps\" [tat, then there should be honorific information in the resource situation of the individual who is the speaker.",
        "If the speaker's RS contains two or more different terms expressing the honorific relationship between the same agents, fail.",
        "Thus, the mechanism of 2) in dsolve is very important because it shows that in the honorific information of one individual there should not be different information about the binary honorific relation between two individuals.",
        "(11) Second order honorifics Lexical rules for second order honorifics can be represented as in following example program.",
        "Ex.4 This corresponds to Eh in 7) and 8) in Section 3.1.2. np(X0,X2,Context) < - n(X0,X1,Context),sub3(X1,X2,Context), dsolveflionoVagentRds!ContextD(rs!Context), up(agentRds!X),objRlex!X))).",
        "(III) Third order honorifics Lexical rules for third order honorifics can be represented as in the following example program.",
        "Ex.5 This corresponds to Eh in 10) in section 3.1.2.",
        "v(X0,X1,Context),sub4(X1,X2,Context), dsolve(hono!((agentl(ds!Context))!",
        "(rs!Context), up(agentl(lex!X),obj!",
        "(lex!X))).",
        "When we utilize the contextual elements like DS and RS in discourse it is very difficult to decide the context for each sentence.",
        "A sentence in discourse can be represented by the expression \"DS,CS,11alphaJJS,E\", but then how do we map contexts like DS and CS to complex sentences ?",
        "Mizutani's theory of honorific forms does not go into context switching in a complex sentence.",
        "So we have expanded his grammar and propose a basic mechanism for context switching.",
        "Consider sentence 1) below uttered by individual S to R which means \"individual said that individual U said that Taro met Ilanako.\" In this example, we establish relations a) through j) among 5, T, U, Taro and Hanel°.",
        "The operator > denotes the situation in which the left hand side honors the right hand side, < denotes the situation in which the right had side honors the left hand side, and = denotes the situation in which there is no need to use honorifics between left hand side and right hand side.",
        "The main point in utterances of this form is that honorifics in these sentence change according to the form of speech, such as direct or indirect speech.",
        "But in the .Japanese discourse there are no markers like \"s\" and \"m, so in order to process these sentences correctly, we need the mechanism of \"context switching.\" Without this mechanism, all sentences would be parsed with one context, but this cannot explain the reason why honorifics change in complex sentences.",
        "1) In S's utterance he said to R",
        "( \"T said, U said, Taro met hanako\") \"taro sama ga hanako sama ni ai nasat ta' to U ga iware ta' to '1' gain ta.",
        "In RS of S a) S > Taro b) S > hanalco c) S > T d) S > U e) taro > hanako In RS of 'I' f) T < U g) = Taro h) < hanako i) Taro < Hanako In RS of U j) U < Taro k) U < Hanakol) Taro > hanako These are the parsing rules used to analyze utterances.",
        "Li) sentence --> sn(X), ds!X Y, agent!Y = s, obj!Y = r,atlY = L, /* a,b,c,d,e */ hono!",
        "(skrs!X)) Ldown(s,taro),down(s,hanako), down(s,t),down(s,u),down(taro,hanako)J, /* f,g,h,i */ honoRtl(rs!X)) Lup(t,u),eq(t,taro),up(t,hanako), up(taro,hanalto)1, /* j,k,l */ hono!(u!",
        "(rs!X)) = [up(u,taro),up(mhanako), down(taro;hanako)I.",
        "LI) and L2) are formal rules to start the process, while 1,3),L4) and L5) are basic rules for determining context switch in sentences of discourse.",
        "L1) specifies the initial stage for parsing.",
        "In 1) above S tells R something so this context is set in the slot denoted by ds!X.",
        "L2) states that all of the features of snO are transfered to sn to meet a requirement of Mizutani's grammar.",
        "This is done easily by unification.",
        "L3) means that all of the features in snO are transfered to sn.",
        "This mechanism corresponds to indirect speech.",
        "IA) means that there should be context switch.",
        "As the discourse situation for snO, set agent of discourse of snO to agent of Z who utters snO and set object of discourse of snO to object of Z who hears this utterance.",
        "L5) means that in a sentence with no marker, there can be context switch, so if a parsing failed because of the context of honorifics, use this rule.",
        "Sentence 1) is analyzed using rule L5) and the mechanism of context switch is decrived from phase (I) to phase (111).",
        "(0 Parsing really starts with the rule 3) estimating that there is no context switching.",
        "But at point *1, a conflict between S's resource situation and honorific expression occurs.",
        "In S's resource situation, the honorific relation between S and Taro is down(S,taro), but [taro,samal requests the honorific relation up(S,taro), so context switch occurs at *2.",
        "Rule 5) switches the agent of discourse from S to U.",
        "Context switch does not occur at this point again.",
        "We use the notation DS(S) to state that the agent of discourse is S. The symbol --> means the context of left hand side is changed to the context of the right hand side as the result of context switch.",
        "(T said U said Taro met hanako) taro sama ga hanako sama ni ai nasat ta to U ga iware ta to 'I' ga iu ta.",
        "in RS of S s down(s,taro)",
        "(if) Next, the parsing mechanism finds a conflict at point *3).",
        "[U,ga, iware,ta requests honorific relation up(S,U), but the resource situation of S contains the honorific relation down(S,U).",
        "Then context switch given in 5) is applied at point *4).",
        "in RS of S s down(s,taro)",
        "n ) – cm – ph vp In sub3 n sub3 sub4- v -sub2 I I I I I I I taro sama ga hanako sama ni o au nasal.",
        "3.3.",
        "Ch and Cw",
        "Now, we have come to the main point of our model, but there remains an interesting feature of Cw.",
        "This constraint is not verified so with some trepidation we touch on it briefly here.",
        "For example, when a worker \"Suzuki\" refers to his friend 'Tanaka\" with contempt, he will intentionally use a polite word to refer to him such as \"Tanaka sensei\" (Mr.Tanaka).",
        "When the hearer (Y)hears this polite expression,he decides on honorific event types but finds conflicts between these types and the normal social event types in his resource situation, Ex.6 expression [Tanaka sensei] where Eh : = at 1: honor_up,Suzuki,Tanaka expression [Tanaka sensei] where Eh := at 1: honor_down,Suzuki,Tanaka in RS of Y",
        "--> hearer find conflict and the hearer wonders why !!",
        "Then the hearer (Y) wonders why he broke the universal honorific event.",
        "Finally, he comes to the conclusion that Suzuki intends either to praise Tanaka or berate him.",
        "We can go no further on this problem here.",
        "There are other aspects to Eh.",
        "If the sentence is given first, Eh will be calculated for each word and there remains a possibility of conflict between honorific event types Eh in a simple sentence.",
        "In a complex sentence the mechanism of context switch will be used, but in a simple sentence this mechanism is not effective.",
        "When the hearer tries to deal with this conflict, he or she will assume that the speaker has some illegal honorific constraint Ch'.",
        "We have implemented this mechanism in our model system."
      ]
    },
    {
      "heading": "4. System Configuration",
      "text": [
        "Our experimental system written in CIL runs on the DEC 2060 and utilizes Prolog as the basic programming environment, which enables us to use CIL.",
        "CIL is now compiled and runs very fast on DEC 2060.",
        "Next, we want to run this DCG parser on the Bottom Up Parser !Matsumoto 1983], [Matsumoto,Kiyono,19841."
      ]
    },
    {
      "heading": "5. Some Other Examples",
      "text": [
        "In this section, we give some examples which have no relation to context switching.",
        "A sentence without honorifics is parsed.",
        "These are resource situations for this type of sentence.",
        "parse([taro,ga,hanako,ni,at,tal,[],Context).",
        "The following is an sentence with conflict between honorific word expressions.",
        "[taro] is a word withour honorifics but to,ai,nasatl are words with honorifics from the speaker to Taro.",
        "In a simple sentence, there should not he conflict between honorific relations.",
        "if there is, then the hearer R gets information that the speaker S has some trouble with honorific word expression."
      ]
    },
    {
      "heading": "3) Complex case",
      "text": [
        "This example sentence contains many honorific expressions.",
        "The system analyzes these expressions to find some honorific event type in the speaker's mind."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "It is easy to model honorific context in situation semantics, But we don't know how this context is represented in the human mind.",
        "This requires further research.",
        "This treatment of the context switching mechanisms of honorifics is a first step toward analyzing more complicated phenomena.",
        "The main contribution of this model derives from the fact that in any complex sentence, there will probably be context switching on honorifics.",
        "But this model shows context switching in a complex sentence only and there remains more complicated phenomena like the following.",
        "$1 is the direct speech act and there should be a context switch because when It knows who Hanako is, he refers to her with the nonhonorific \"liana.\" But we do not formalize the context switch which decides who is the agent of sentence $1.",
        "To solve this problem, we should use an \"anaphora mechanism for the honorific context\" and in order to build a firm model of this mechanism, study not only of the anaphora mechanism [Barwise 1985c1 but also the focusing mechanism [Sidney) is required.",
        "These also are topic for further research."
      ]
    },
    {
      "heading": "ACKNOWLEDGEMENTS",
      "text": [
        "I would like to thank Mr.Mukai of ICOT for his comments on context switching and Mr.Yokoi, the I lead of the Second Research Laboratory at 1COT, for his encouragement and for allowing me ample time for this work."
      ]
    },
    {
      "heading": "REFERENCE",
      "text": []
    }
  ]
}
