{
  "info": {
    "authors": [
      "Annibale Elia",
      "Yvette Mathieu"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C86-1032",
    "title": "Computational Comparative Studies on Romance Laguages a Linguistic Comparison of Lexicon-Grammars",
    "url": "https://aclweb.org/anthology/C86-1032",
    "year": 1986
  },
  "references": [],
  "sections": [
    {
      "heading": "1. The linguistic comparison of lexicon-grammars",
      "text": [
        "What we present here is an application on the basis of the Italian and french linguistic data bank assembled by the Istituto di Linguistica of Salerno University (Italy) and the Laboratoire Automatique Documentaire et Linguistique (C.N.R.S,-France).",
        "These two researching centers have been working for years to the constitution of formalized grammars of the respective languages.",
        "The composition of lexicon-grammars is the first stage of this project.",
        "A lexicon-grammar requires the study of nearly 300 syntactic property for all words of a language.",
        "The data revealed in this way are memorized under a matricial form of the type",
        "The composition of a lexicon-grammar allows to take into account selection and sub-categorization restrictions as well as derivational morphologic relations, without getting away from the limits of the formal syntax, that is, in limiting to the only experience of the estimation of acceptability, the recourse to intuitions of semantic nature.",
        "A lexicon-grammar can satisfactorily render an account for the lexical and syntaxical differences of a word and those morphologically connected to it, allowing as well a comparison with verbs and nouns of another language disposing of a lexicon-grammar.",
        "Fig.l Therefore we have a number of classes of nouns, adjectives, adverbs, conjunctions and verbs, the determiners and the prepositions being included in the verbal classes.",
        "Some matrices exist with lexicon-grammars corre-spondances between two lexicon-grammars as: The high level of lexicon syntactic informations of the italian and french lexicon-grammars allowed us to a very subtle comparative study of the two languages.",
        "For exemple, the comparison of the italian verb investire and the french verb investir, leads to the following situation:"
      ]
    },
    {
      "heading": "Italian INVESTIRE 1",
      "text": [
        "(1) NO V N1 di N2 =: (1) a.",
        "La regina ha investito i Beatles del titolo di baronetti",
        "(2) NO V Nl in N2 INVESTIRE 6b.",
        "concerner (2) a. Max ha investito un milione nell'affare INVESTIRE 7 echouer (2) b. Eva ha investito (molto, tutta se stessa,",
        "suo affetto) nel rapporto con Max To give a comparative presentation of the italian and french data, we have two comparative tables of INVESTIRE 3 the realization of the morpheme INVEST in Italian",
        "(3) NO V N1 (E,con N2) and french.",
        "The first one (fig.",
        "3) gives a survey of (3) a. Il generale investi la piazzaforte (E, con the correspondance, while a detailed comparison of le truppe d'assalto) the distributional syntactic properties and of the (3) b. Luca investi (Eva, l'auto di Eva) (E, con paraphrases is given by the second one (fig.",
        "4) l'automobile) (3) c. Eva investi Max (E, (con,d1)(tutti i suoi",
        "(1) a.",
        "Le pape a investi l'évegue du titre cardina-lice (1) b.",
        "Le gouvernement a investi le ministre d'une charge importante INVESTIR 2 (2) NO V N1 dans N2 =: (2) a. Max a investi un million dans l'affaire (2) b. Eva a investi (beaucoup, son affection) dans le rapport avec Max INVESTIR 3 (3) NO V N1 (E, avec N2) (3) a.",
        "Le general a investi la ville (E, avec ses troupes)",
        "The french correspondents for the other uses of investire are:",
        "This table is to be read from the top left where the verbs investire and investir are placed.",
        "In the middle the properties are put in a line and noted by indications placed at the right concerning the number and the kind of use (example, (a)... 1.",
        "(b)..., 3, etc) At the top right, there are specifications on the support verb (Vsup) and the nominalization (V-n).",
        "The equivalent structures, italian-french, for prepositions and support verbs have a representation with a slash / (example di/de: di-italian and de-french; dare/donner: dare-italian and donner-french).",
        "At the left, there are two columns with plus and minus (+, -) which point out whether the property in question is valid or not for the verb; if the point is about the property with Vsup, first of all you must control if the verb at the left has a + or a - in the division of the column, if it is +, you can then read at the top right the type of Vsup and of V-n; if it is - , but there is a + at the right, that means that it refers only to one of the two verbs.",
        "The $ symbol is equivalent to \"financial in-vestments\" and the symbol to \"psychological investments\".",
        "Comparison between lexicon-grammars of different languages leads to draw up formal correspondences between structures, where so-called \"grammatical words\" are constants.",
        "Therefore, those \"grammatical words\" are considered as formal parts of structure.",
        "With that clause case, for example, we will have to take into account the following structures: Italian french it fatto che F le fait que P ce que P ...che F que P which will lead us to say that there is no italian correspondent to the french sentence",
        "(1) Max doute de ce que Marie vienne in view of the fact that the Italian sentence (2) *Max dubita di cio che Maria venga is unacceptable.",
        "But the sentences (3) Max doute du fait que Marie vienne (fr) (4) Max dubita del fatto che Maria venga (it) (5) Max doute que Marie vienne (fr) (6) Max dubita che Maria venga (it)",
        "drive us to consider italian structures (4) and (6) at a formal proximity degree of french structure (1).",
        "From a strictly formal point of view, the correspondence between (1) and (2) cant'be accepted, but from a larger point of view, which implies the formal proximity degree notion (obviously depending on the researcher's theoretical choice) we can mention structures (4) and (6) as the closest realization of the french structure (1).",
        "Of course, structures (4) and (6) have the strict formal correpondents (3) and (5).",
        "The very complex data organization is usable by specialists but not by ordinary users.",
        "That is why we have been interested by the realization of a flexible and intelligent system, which allows the consultation and comparaison of the two languages lexicon-grammars (which are at the present day romance languages lexicon-grammars), and which includes the correspondance notion we have just presented.",
        "Its use will not need any knowledge neither of the data organization nor of computer science.",
        "2.",
        "The TRANSLEGS system The general TRANSLEGS's architecture is illustrated"
      ]
    },
    {
      "heading": "Research and reasoning Rules base",
      "text": [
        "Fig.",
        "5 A \"query-answer\" system of the interface allows to choose the type of research one wants to make.",
        "The system offers a research arborescence guided by its own resources and by the user's choices.",
        "If the study concerns, for example, a class drawn up a know definitional property, TRANSLEGS will look for all the properties of this class, whether the correspondents exist in the other language, which elements appear (nouns, verbs, adjectives), in which structures do they appear and how do the correspondents of the other language behave.",
        "If the study concerns a particular verb or noun, the system will look for the structures where this element appears, it will find its correspondent in the other language and the classes in which it exists, its properties and those of the correspondent into a given class.",
        "It will look for elements that have a degree of proximity for the secondary correspondence, and how do they behave in front of the properties and associated sentences.",
        "b) by building new structures according to linguistic choices different from those reflected by existing classes (in that cas TRANSLEGS will make a class from the choosen definition property and those linked to it).",
        "The system is written in PROLOG and runs on a VAX 11/ 750 from Digital Equipment.",
        "3.",
        "Examples of dialogues",
        "In the following examples, TL means TRANSLEGS",
        "- la liste des classes oil it apparait(1) - etudier une classe particuliere (2) - etudier une classe particuliere et connaitre le comportement de l' equivalent italien (3)",
        "propriete NO = Nhum equivalente A la propriete italienne NO = Num propriete un modif equivalente a la propriete italienne Det = un modif",
        "In some cases, TRANSLEGS's answer needs deduction rules, if properties or classes exist in one langua- propriete = du equivalente a la proprie-ge and not in the other one for example.",
        "Then, the to italienne Det = del system will propose \"substitution\" classes according to their formal proximity degree.",
        "The same type of propriete Prep = pour equivalente a la pro-answer will be done if one element has some proper prieté italienne Prep = per ties in one language that its correspondent doesn't have.",
        "Son equivalent italien amore possede les proprietes suivantes: The system being quite supple, the user can create Verbe support: avere his own environment a) by modifying the deduction rules",
        "La propriete 5 n'existe pas en frangais.",
        "La propriete 3 peut etre consideree comme correspondante.",
        "Ex.",
        "3 (TL) : ammirazione avec avere a la propriete Bet = 0 admiration ne l'a pas Suite proposee des proprietes correspondan-tes les plus proches: Bet = la Bet = une modif Bet = de la"
      ]
    },
    {
      "heading": "4. Conclusion",
      "text": [
        "We would like Translegs to be computer tool for two main purposes: - To allow an ordinary user to consult comfortably a linguistic data bank; - To allow a linguistic researcher to work to a scientific description of a language or of two (or more) languages to compare by modifying and/or going deeper into lexical or grammatical informations already within the data bank made available by our laboratories."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": [
        "ELIA, A., MARTINELLI, M., D'AGOSTINO, E. (1981) Les-sico e strutture sintattiche, Napoli Liguori ELIA, A.",
        "(1983) \"Une hypothese globale sur les verbes a complements locatifs et sur l'infinitive locative\", in Lingua e Stile 2, 1984 ELIA, A.",
        "(1984a) Le verbe italien, Bari- Paris Schena Nizet ELIA, A.",
        "(1984b)\"Sur l'unite du motet la syntaxe com-paree des langues romanes' in Revue Quebec-oise de Linguistique\", 13, n.2 GROSS, M. (1975) Methodes en syntaxe, Paris Hermann GROSS, M. (1981) \"Les bases empiriques du predicat semantique\", in Langages, vol.63 LAMIROY, B.",
        "(1983)\"La linguistique comparee et l'argumentation en syntaxe\",in C.Angeltet et al.",
        "(eds.",
        "), Langue, dialecte, litterature, Leu-ven University Press ROUSSEL, P. (1975) PROLOG: manuel de reference, Uni-versite Aix-Marseille 2 Vasseux, P. (1983) Systeme LEXSYN, L.A.D.L.,Universi-Le Paris 7"
      ]
    }
  ]
}
