{
  "info": {
    "authors": [
      "I. S. Kononenko"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C86-1122",
    "title": "Speech Acts of Assertion in Cooperative Informational Dialogue",
    "url": "https://aclweb.org/anthology/C86-1122",
    "year": 1986
  },
  "references": [
    "acl-E85-1041"
  ],
  "sections": [
    {
      "heading": "SPEECH ACTS OF ASSERTION IN COOPERATIVE INFORMATIONAL DIALOGUE",
      "text": [
        "Dialogue systems should provide a cooperative informational dialogue aimed at knowledge sharing .",
        "In the paper speech acts of assertion (SAA) are assumed to be the means of achieving this goal.",
        "A typology of SAAs is proposed which reflects certain cognitive aspects of communicative situation at different stages of mutual informing process.",
        "Information constituents of the type assertions are formally described to represent: a current cognitive state of the speaker's knowledge base, each proposition in it being characterized by a subjective verisimilitude evaluation.",
        "The general scheme of information flow in the cooperative dialogue is considered.",
        "With regard to this scheme the dialogue functions of SAAs are discussed.",
        "We must strive to provide dialogue systems with ability to interact with the user in the kind of cooperative human-like dialogues of informational type.",
        "By this type of a dialogue we mean a mutual informing activity of interaction participants - similar to Carlson's (1984) dialogue game of information sharing - aimed at enriching the stock M of shared (mutually coordinated) knowledge.",
        "Our tenet in this study is that SAAs are performed in dialogues to approach the general goal of shared knowledge.",
        "The proposed typology of SAAs reflects their dialogue functions and contribution into the information flow process.",
        "Performing an SAA the speaker X conveys to the addressee Z the information about some actual situation 8, i.e. about some part of the 'world' which a topic of the dialogue refers to.",
        "It is assumed here that appropriateness of the SAA is determined by conditions formulated in terms of contextual properties of the current communicative situation including knowledge, beliefs, evaluations and goals of interaction participants (van Dijk, 1984).",
        "Certain cognitive aspects of communicative situation are considered to be a necessary precondition for SAA performance and simultaneously a part of SAA integral content.",
        "To simulate the cognitive situation and represent information constituents of SAA content in a participant's (for example, X's) knowledge base two cognitive components are defined.",
        "Let X be a set of utterances (P) which represents a current cognitive state of X (denoted as X:P).",
        "A cognitive component X:Z is distinguished in X which is a reflection of Z in X (X's beliefs about Z's knowledge including Z's beliefs about his partner X's state of knowledge), i.e. a set of utterances of the form P=Z:P'.",
        "Then the rest of X is X's own knowledge about the world.",
        "Now M may be defined as a set of utterances simultaneously contained in X, Z, X:Z and Z:X ( a weak definition of M)."
      ]
    },
    {
      "heading": "2. COGNITIVE ASPECTS OF COMMUNICATIVE SITUATION",
      "text": [
        "The nucleons of integral content of the SAA is a propositional structure, in the simplest case, a proposition P which represents S in a generalized and semantically structured form.",
        "Besides P, the SAA content reflects the following aspects of communicative situation which make up a cognitive background for SAA generation:",
        "1) the speaker's state of knowledge about S, i.e. the state of X, which includes X's evaluation of his own knowledge; 2) the speaker's beliefs about the addressee's knowledge, i.e. the state of X:Z.",
        "2.1.Participant's knowledge.",
        "To reflect the subjective nature of a participant's knowledge each proposition P in his individual knowledge base is provided with a verisimilitude evaluation (v-evaluation) which indicates a degree of his certainty of whether or not P is an adequate description of S. It is convenient to interpret the v-evaluation on the numerical scale (kv.0) rather than in terms of the traditional truth values (Truth, Falsity, Indefiniteness).",
        "This allows representation of various degrees of belief and comparison of the partici-pants' knowledge: X's certainty is more, much more, less or equal to that of Z.",
        "The continuality of v-evaluation does not exclude selection of v-intervals embracing pragmatically and psychologically non-distinguished scale values, each interval corresponding to a type of cognitive state of the participant.",
        "Different cognitive states of X are interconnected by relations regarding information flow between the cognitive components of X.",
        "These relations are expressed in terms of the following set of rulesl:",
        "(1) X:P-->X:(P,vx) (2) X:Z:P-->X:P (3) X:Z:P – •>X:Z:(P,vz'), in special case vz'-?",
        "(4) X:Z:(P,vz')-->X:(P,vx), in general case vz4vx (5) X:(P,vx)-->X:X:(P,vx) Note that (4) is an amplification of (2), (5) represents the reflexivity of X.",
        "For an explanation of the meta-value '?'",
        "in (3) see section 2.2.",
        "To each rule (1)-(5) corresponds its counterpart for Z: (1)'-(5)'.",
        "It should be born in mind that X:P does not imply X:Z:P. X and Z are related to M by rules (6) and (7), the latter corresponding to a stronger definition of M. These statements are valid if their premises are explicated in the dialogue (see section 4).",
        "(6) X:P&Z:P&X:Z:P&Z:X:P-->M:P (7) X:(P,vx)&Z:(P,vz)&X:Z:(P,vz')&Z:X:(P,vx')& vx=vz-vz'=vx'=v-->M:(P,v)",
        "The cognitive states of the X:(P,vx) type differ in vx-values2:",
        "vx=0.5* - both (positive and negative) evaluations are equally possible; this interval is a domain of full uncertainty, resulting either from the absence of any information in support of or against P or from there being much evidence both in favour of and against P. The cognitive state X:(P,vx) is a precondition for the performance of an SAA by X (SAA.X).",
        "Another necessary precondition is X's belief that Z does not dispose of the information about S to be conveyed by the SAA.X.",
        "The well-known formulation \"it is not obvious to X that Z knows that P\" (Searle,1969) needs specification since it permits several interpretations.",
        "2.2.Ignorance types.",
        "We distinguish four ignorance situations defined by comparing the current state of X to that of X:Z. A-ignorance.",
        "X:(P,vx); X:Z+P.",
        "Considering P, X believes that P is not considered (or simply not activated) in Z. B-ignorance.",
        "X:(P,vx); X:Z:(P,vz'); X:Z:X:(P,vx'), vx'tvx or vx'=?",
        "P is considered by both X and Z. X believes that v-value of P in Z is vz' (which is, possibly, not equal to vx, by rule (4)).",
        "X believes also that the correct vx-value is unknown to Z, i.e. vx'vx/vx'=?",
        "('?'",
        "has been introduced into knowledge representation apparatus as a meta-value of v-evaluation to account for just this very case of ignorance).",
        "C-ignorance.",
        "X:(Pi,vix),vkx>0.5*; X:Z:(Pi,viz), viz40.5*; X:Z:X:(Pi,vix'),vix'*vix/vix'=?",
        "X believes that the state of Z corresponds to disjunctive uncertainty: there is a set (Pi) of alternative propositional descriptions of S in Z3, none of them evaluated as considerably more verisimilar than the rest.",
        "In X v-values of the alternatives are distributed in such a way that one of them (vkx) is positive.",
        "In X's opinion, Z is ignorant of this distribution.",
        "D-ignorance.",
        "X:(Q,vlx), vlx>0.5*; X:(P,v2x), v2x= 1*-vlx; X:Z+Q; X:Z:(P,vz'),vz'>0.5*; X:Z:X:(P,vx'), vx'kr2x/vx'=?",
        "The propositions contained in X and Z (in X's opinion) present alternative descriptions of S. The type of ignorance determines a communicative goal of the SAA, this goal subordinated to the general goal of the cooperative dialogue.",
        "By SAA performance, X intends to change Z so as to bring about Z's beliefs of S into line with his own knowledge, i.e. to approximate Z to X (or, at least, Z:X to X, if S has to do with the 'mental world' of X, i.e. X).",
        "This intention, in its turn, determines 2.n* denotes n and the scale values close to n. 3•The v-values of the alternative propositions are bound by correlation Evi41* ( < is the case when not all the alternatives are known).",
        "a type of operational change of Z: a) to include information about S in Z (an inclusion operation); b) to exclude wrong information about S from Z (an exclusion operation); c) to select one of the alternative descriptions of S contained in Z (a non-elementary selection operation carried out by means of several exclusions); d) to correct wrong information about S contained in Z (a non-elementary correction operation carried out by means of exclusion and inclusion )."
      ]
    },
    {
      "heading": "3. SAA TYPES",
      "text": [
        "The information about the cognitive situation is incorporated in the integral information (information package - IP) to be conveyed from X to Z by the performance of an SAA.",
        "The information constituents of the SAA IP are distributed between the three sections representing the states of M, X:Z and X.",
        "Their content is formed in accordance with the ignorance situation as X sees it by the moment of SAA generation.",
        "It is the content of M, X:Z and X that determines a type of the given SAA.",
        "3.1.Basic SAA types.",
        "In the A-ignorance situation a proposition P and corresponding evaluative information vx is put by X under Z's consideration.",
        "In the B-ignorance situation it is evaluative information only that is introduced to Z.",
        "An opposition by the type of information introduced by an SAA (propositional + evaluative vs. evaluative) allows two basic SAA types, namely, Statements (S--SAA) and Evaluations (E-SAA), to be distinguished.",
        "Statements.",
        "S-SAA is based on the assumption that P is not considered in Z.",
        "By S--SAA performance, P is put under Z's consideration and vx-value of P is communicated to Z.",
        "In general case, M is empty (with respect to S): the topic P hasn't been yet initiated in the dialogue.",
        "S-SAA IP: (a) M:(0",
        "(b) X:Z•P (c) X:(P,vx)",
        "Different vx-values determine the S-SAA subtypes: Indefinite Statements (vx=0.5*), Uncertain Statements (0*<vx<0.5* and 0.5*<vx<1*) and Certain Statements (vx=0* and vx=1*).",
        "Examples: (1) It seems that John is going to leave for Paris tomorrow.",
        "(2) I am certain that Jack has passed his exam.",
        "(3) I don't know whether it will rain, < but I'll take my umbrella.> (4) I don't think she is married, < so it is not foolish for him to try to meet her again.>",
        "Evaluations.",
        "E-SAA is performed in the communicative situation when P has been already activated in M, i.e. the topic P is under consideration in the dialogue.",
        "No new propositional information is introduced by E-SAA.",
        "The goal of X is to introduce vx-value which is not contained in Z:X, in X's opinion.",
        "E-SAA IP: (a) M:P (b) X:Z:(P,vz') (c) X:(P,vx) (d) X:Z:X:(P,vx'), vx'Pvx/vx'=?",
        "There are Positive Evaluations (vx>0.5*), Negative Evaluations (vx<0.5*) and Indefinite Evaluations (vx=0.5*).",
        "The consideration of possible correlations of vx and vz' allows distinguishing a number of E-SAA subtypes that are shown in fig.l.",
        "Of special interest here are Acceptance and Approval corresponding to vx-vz'• The distinctions between these two subtypes as well as their dialogue functions will be discussed in section 4.",
        "3.2.Non-elementary SAA types.",
        "In certain communicative situations X performs speech acts which may be called non-elementary: their informational content may be divided into several components (sets of information constituents) each representing the content of some elementary (basic) speech act.",
        "In the situations of C and D-ignorance the non-elementary SAAs (Correction and Selection) are performed, their information packages being the combination of IPs of the basic SAAs described above.",
        "Selection (pick).",
        "P-SAA is a means of selection in the C-ignorance situation .",
        "In the simplest case M contains a set of two propositions (P,Q) and knowledge that only one of them is adequate to S, i.e. M:(P/Q,1*).",
        "By P-SAA X positively evaluates Q.",
        "It means a negative evaluation of P, in accordance with the implication ((Q,vl) ---> (P,v2), v1=1*-v2).",
        "So, the P-SAA IP is a combination of two E-SAA IPs, one of them introducing the positive evaluation of Q and the other negatively evaluating P; a constituent (b) is added to the P--SAA IP and v-values are specified.",
        "P-SAA IP: (a) M:(P,Q) (b) M:(P/Q,1*) (c) X:Z:(P,0.5*) (d) X:Z:(Q,0.5*) (e) X:(Q,v1x), vlx>0.5* (f) X:(P,v2x), v2x=1*-vix (g) X:Z:X:(Q,vlx'), vlx'41/1x/v1x'=.?",
        "(h) X:Z:X:(P,v2x'), v2x'=1*-v1x7v2x'=?",
        "For example: (7) Z: Has Smith gone away on business or stayed in London?",
        "X: He has stayed, < I saw him yesterday.>",
        "Correction.",
        "C-SAA is performed to correct Z in the situation of D-ignorance.",
        "M contains P which is characterized by a positive v-evaluation in Z.",
        "Assuming that P is inadequate to S, X evaluates P negatively and introduces Q, P and Q being alternative, in X's opinion, i.e. X:(P/Q,1*).",
        "X believes that this presupposition will be accepted or approved of by Z (included in Z) and thus become an element of M. The C-SAA IP combines the E-SAA IP (Negative Evaluation in the Denial mode) and the S-SAA IP (with positive evaluation of Q being introduced); a constituent (d) is added to the C-SAA IP and v-values are specified."
      ]
    },
    {
      "heading": "4.INFORMATION FLOW AND SAA CONTRIBUTION",
      "text": [
        "In this section we consider the process of information flow in the cooperative informational dialogue and discuss the role of the basic SAAs in this process.",
        "The problem of information flow is partially analyzed by Carlson (1984) who makes successful use of the table and private lists metaphor.",
        "However, the information flow scheme proposed here seems to be more general as far as it takes into account not only the propositional but also the evaluative constituents of the participants' knowledge.",
        "This allows distinguishing a stage of mutual coordination of evaluations in the scheme.",
        "Figure 2 shows several variants of the dialogue flow of which certain stages are represented by Statements and Evaluations.",
        "At the beginning of the dialogue the set M is empty (in1).",
        "The cognitive state of X corresponds to A-ignorance.",
        "This determines the appropriateness of S-SAA and formation of the communicative goal of the cooperative partner X, namely, to inform 2 about S. X performs an S-SAA by means of which information about the current cognitive situation is conveyed from the speaker X to his addressee Z.",
        "As a result of S-SAA performance the cognitive situation changes in the following way: P is entered in Z:X and, consequently, in Z (by rule (2)) and in X:Z; then P is entered in M (by (6)) and is contained there as a topic of the dialogue (further the question of P will not be closed untill its v-evaluation will be coordinated by the participants); X:(P,vx) is entered in Z and X:Z; so, in accordance with (5) and (7), X's assumptions about S become mutually known to the participants, i.e. M:X:(P,vx).",
        "The further course of the dialogue is determined by the state of Z and by a type of informational contract between X and Z (see the notion of a contract in Narin'yani-Simonova, 1985).",
        "This notion regards informational relations which hold between X and Z, e.g. a dominancy of X over Z, a subordinacy of X to Z or a neutrality between X and Z.",
        "These relations determine a degree of Z's confidence in X and a degree of Z's self-confidence.",
        "Let us consider several variants of the further progress of the dialogue.",
        "By variant 1, provided that an index of Z's confidence is high enough, a v-evaluation of P is formed in Z on the basis of vx.",
        "By variant 2, the formation of vz does not depend upon vx.",
        "In any case, the states of Z (by rule (4)') and of Z:X (by rule (3), in the B-ignorance mode) change resulting in the preconditions for E-SAA.Z.",
        "The E-SAA.Z is immediately aimed at the alteration of X:Z.",
        "By the performance of E-SAA, Z explicates the state of Z including vz, after that X:Z:(P,vz), and the content of M changes correspondingly, i.e. M:Z:(P,vz).",
        "The subtype of E-SAA.Z is determined by vx and vz correlation.",
        "In case of vx=vz-v the subtype is Acceptance (variant 1: Z accepts X's viewpoint on S) or Approval (variant 2: having the same assumptions about S, Z approves of X's viewpoint).",
        "The coincidence of X's and Z's viewpoints is now fixed in M; this involves the corresponding change of M (by rule (7)): the topic P is closed and the constituent (P,v) is entered in M. So the interaction is successfully completed (outi) by achieving the general goal of the cooperative dialogue: the stock of shared knowledge is enriched by new mutually coordinated information about the world.",
        "In case of vx0iz the subtype of E-SAA.Z is Confirmation or Denial.",
        "It is obvious that Strong Evaluations are aimed at changing the vx-value in X.",
        "As for Weak Evaluations which express Z's doubts, their goal is determined by a degree of Z's self-confidence: if this index is relatively low, it is only X:Z that Z pretends to change; besides, he, probably, makes an indirect request for an additional information which should allow him to change vz for a more certain value.",
        "After Confirmation or Denial a stage of coordinating evaluations begins.",
        "On recieving E-SAA.Z, X may change vx-value thus creating preconditions for the next in turn E-SAA.X.",
        "In this case 03 includes the E-SAA.X and the corresponding cognitive background.",
        "Provided that Z informationally dominates over X, a new vx-value is equal to vz - so, the goal of the dialogue is accomplished (outi).",
        "If nobody changes his v-value after one exchange of evaluative information (i.e. after the sequence of S-SAA.X and E-SAA.Z), 43 is an argumentative interaction in the course of which one or both the participants try to prove their viewpoints by introducing an additional supporting information (there are complex speech acts in .3).",
        "The non-argumentative insisting is not peculiar to the cooperative dialogue, it would mean going out into a kind of a conflict (out 2).",
        "The above variants of the dialogue flow demonstrate significant distinctions between Statements and Evaluations as to their dialogue functions.",
        "The S-SAA is usually an initial dialogue move opening a topic of the dialogue.",
        "A secondary S-SAA function is to be an answer to a certain kind of questions ( What's happened?",
        "What's known about John?).",
        "This option is presented in the scheme by the dialogue beginning variant 6,1 which includes a question of Z.",
        "The E-SAA is a response by its very nature.",
        "It reacts not only to the explicit assertive moves in the dialogue but also to the implicit assertions, e.g. to semantic presuppositions of the previous speech acts.",
        "In this case the E-SAA.Z follows A2 including some SA.X, e.g. a yes/no question of X which expresses just the lack of evaluative information (vx=0.5*).",
        "The E-SAA.Z may also be performed in the context of the preceding SA.Z which has introduced P as a non-asserted propositional constituent of an imbedding proposition (You were interested in John's arrival (SA.Z).",
        "John arrived (E-SAA.Z).).",
        "The result of SA.Z in A2 is a cognitive state including Z:X:(P,vx'),vx'=0.5* since X's viewpoint on S is not explicit in the dialogue (not contained in M) but is merely assumed by Z.",
        "The scheme of information flow discussed in this section accounts for functions of the basic SAAs in the cooperative dialogue.",
        "It appears to be directly extendible for the analysis of functions of the non-elementary SAAs."
      ]
    },
    {
      "heading": "5.CONCLUSIONS AND FUTURE RESEARCH",
      "text": [
        "In this paper we have presented a new theoretical approach to a formal description of SAA functions in the cooperative informational dialogue.",
        "It differs from the previous approaches in several ways: - two cognitive components in a participant's knowledge base are defined to represent his own knowledge as contrasted to his beliefs about his partner's state of knowledge; the rules are introduced describing the information flow relations between these components; - propositional and evaluative constituents are distinguished in individual knowledge representation; a notion of v-evaluation is introduced and types of cognitive states described; - a cognitive background for SAA performance is represented by one of four types of ignorance; - a typology of SAAs is proposed which distinguishes between basic and non-elementary SAAs; for each SAA type a formal representation of its informational content is given; - a scheme of information flow is presented which shows different dialogue functions of SAAs; in this scheme a stage of introducing propositional and evaluative information and that of coordinating evaluations are considered.",
        "The limitations of the paper did not allow us to present a description of the so called particular SAAs which are opposed to the general SAAs described here by the scope and character of the propositional information under evaluation.",
        "The current description can be extended in a variety of ways: an additional research is required to define the non-elementary SAAs as a subclass of complex speech acts; the dialogue scheme is also to be extended to include the non-elementary SAAs; the question of how to design a dialogue model allowing for types of informational contracts between the participants deserves further attention."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": [
        "cognitive states; ) SAAs; Qi gaps in the scheme; combination relation."
      ]
    }
  ]
}
