{
  "info": {
    "authors": [
      "Erich H. Steiner"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C86-1072",
    "title": "Generating Semantic Structures in EUROTRA-D",
    "url": "https://aclweb.org/anthology/C86-1072",
    "year": 1986
  },
  "references": [],
  "sections": [
    {
      "text": [
        "The following paper is based on work done in the multilingual MT-project EUROTRA, an MT-project of the European Community.",
        "Analysis and generation of clauses within the EUROTRA-framework proceeds through the levels of (at least) EUROTRA constituent structure (ECS), EUROTRA relational structure (ERS) and interface structure (IS) (cf. Arnold/des Tombe/Jaspaert.1985 and the EUROTRA-REFERENCE MANUAL, version 1, revision 0).",
        "At IS, labelling of nodes consists of label.lings for time, modality, semantic features, semantic relations and others.",
        "In this paper, we shall be concerned exclusively with semantic relations (SRs), to which we shall also refer as \"participant roles\" (PR).",
        "A list of EUROTRA SRs as given in ELS-3 is reproduced below:"
      ]
    },
    {
      "heading": "- PATH SPACE TIME - AIM -- CONDITION - CONCESSIVE - CONSEQUENCE -- CAUSE -- CONCERN - QUALITY TOTUM -- ACCORD -- ACCOMPANIMENT INSTRUMENT - MEASURE",
      "text": [
        "According to current EUROTRA legislation, these SRs are assigned to dictionary entries of verbs (and other word classes, which will be disregarded in this paper) by coders, and through these entries to clauses in a pattern matching process.",
        "This approach, while certainly valid in principle, leads to the problem of inter-coder-consistency, at least as long as the means for identifying SRs are paraphrase tests for SRs.",
        "In EUROTRA--D, we have for some time now been experimenting with a set of SRs, or PRs, which are identified with the help of syntactic criteria.",
        "This approach will be outlined in the following.",
        "Its roots, are to be found in the literature on semantic cases in general (cf. Fillmore.1968 and 1977, Starosta 1977, Somers.1983) and more particularly, in ideas from Systemic.",
        "Linguists (cf. Fawcett.1980 and.",
        "forthcoming, Hal.liday.1967-68 and 1985, Steiner.1983 and 1985, Winograd.",
        "1983).",
        "2.",
        "Definition of basic concepts",
        "To start with, we need a small set of basic concepts, which will be defined in the following.",
        "There is a basic distinction between Participant Roles and Circumstantial Roles on the semantic level, which the ELS-3 specifications do not contain.",
        "There is the further distinction between inherent and non-inherent roles, which is also not explicitly made ELS•3 and may be necessary at some point.",
        "Participant Role: A participant role is a semantic constituent of a clause which is syntactically realized as a complement rather than as a modifier.",
        "Circumstantial Role: A circumstantial role is a semantic constituent which is, on clause level, realized as a modifier rather than as a complement Obligatory Participant Role: A semantic constituent which is, on clause level, realized as obligatory complement",
        "Optional Participant Role: A semantic constituent which is, on clause level, realized as an optional complement Inherent Role: Inherent roles are obligatory participant roles and those participant roles which, if they are not realized in a clause, lead to look up in the preceding text or situation for a referent.",
        "Cf.: (20) David was watching."
      ]
    },
    {
      "heading": "- GOAL AGENT",
      "text": [
        "Non Inherent Role: Non inherent roles are those participant roles which, if they are not realized in the clause, do not lead to look up.",
        "CF.: (21) Devid is eating",
        "3.",
        "Definitions of semantic relations and types of process",
        "The first essential step is to define certain key PRs as far as possible through syntactic criteria.",
        "Some of these detinitimns are given in the following: SR/PR: Phenomenon Syntactic realization: - dependent clause in the folic:Limn of syntactic \"direct object\", introduced by \"that\" or \"if\"; -- dependent lug-construction in the syntactic function of \"direct object\".",
        "SR/PR: location Syntactic realization: - complement 01 place, origin OT direction (realised by Adverbial Group, Prepositional Group or embedded clause) SR/PR: Identifier Syntactic realization: - NG in function of subject complement.",
        "ADJ-group with the adjective ia the superlative - embedded clause in function of subject complement_ 4.",
        "A procedure for the assignment of semantic relations The following procedure is used for the assignment of semantic relations by dictionary coders.",
        "These ore just a few characteristic examples.",
        "The overall number of PRs is around All these PRs have, apart from syntactic criteria for their identification, notional definitions and parahrase tests.",
        "These, however, are only used hi the cases, where syntactic criteria do nor lead lo an unambiguous assignment.",
        "An identified subset of the PRs is used to identify \"i[iPes and process\".",
        "These, in tarn, serve as entry conditions into very limited sub sots Crow the overall set of PRs, so that the cholce of Pits For the coder is always limited to a small number of between 2 and around 6 cases from the overall set.",
        "The types of process are Oven in the following:"
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "The statements in this paper are necessarily very sketchy and brief.",
        "More detailed information will be given in the oral presentation.",
        "The assignment of semantic relations, as presented here, has been worked out for German in some detail.",
        "The available literature for English, especially in the work of Fawcett and Halliday, shows that the treatment of English in the same way does not present a major problem.",
        "It seems to be reasonable to assume that the method outlined constitutes a worthwhile way to explore for a multilingual MT-project such as EUROTRA.",
        "Acknowledgements: I am very grateful to my colleagues in EUROTRA-D for many critical comments on my work.",
        "Most indebted, though, I am to Robin P. Fawcett for many hours of discussion and explorations.",
        "Needless to say, that the responsibility for any weaknesses in form and content rest with the author alone."
      ]
    },
    {
      "heading": "6. Bibliography",
      "text": []
    }
  ]
}
