{
  "info": {
    "authors": [
      "Andre Schenk"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C86-1075",
    "title": "Idioms in the ROSETTA Machine Translation System",
    "url": "https://aclweb.org/anthology/C86-1075",
    "year": 1986
  },
  "references": [
    "acl-C82-1028"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper discusses one of the problems of machine translation, namely the translation of idioms.",
        "The paper describes a solution to this problem within the theoretical framework of the Rosetta machine translation system.",
        "Rosetta is an experimental.",
        "translation system which uses an intermediate language and translates between Dutch, English and, in the future, Spanish."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Idioms have been and still are a basic theoretical stumbling block in most linguistic theories.",
        "For the purposes of machine translation or, in general., natural language processing, it is necessary to be able to deal.",
        "with idioms because there are so many of then in every language and because they are an essential part of it.",
        "Idioms occur in sentences as a number of words, possibly scattered over the sentence and possibly with some inflected elements; this number of words has to be interpreted as having one primitive meaning.",
        "For example, in (1) \"made\", \"peace\" and \"with\" have to be interpreted idiomatically.",
        "Note that words that are part of the idiom are underlined.",
        "(1) He has made his peace with his neighbour The classic example is (2): (2) Pete kicked the bucket",
        "Literally this sentence means that Pete hit a specific vessel with his foot.",
        "In the idiomatic reading the interpretation is that Pete died.",
        "It is impossible to infer this idiomatic meaning directly from the primitives \"Pete\", \"kick\", \"the\" and \"bucket\" and from the way they are combined.",
        "Idioms can undergo syntactic transformations, but sometimes they are reluctant to do so.",
        "The passive sentence (3) has lost its idiomatic reading, while in the jassive sentence (4) the idiomatic reading has been retained .",
        "(3) The bucket was kicked by Pete (4) Mary's heart was broken by Pete",
        "Other examples are (5-12).",
        "In the idiomatic reading in (5) clefting with the object as focus is not allowed, while it is allowed in (6) if \"Mary\" is stressed.",
        "Clefting with the subject as focus in both (7) and (8) is permitted.",
        "In (9) the PP \"at whose door\" and in (10) the NP \"whose heart\" can be subject to wh-movement.",
        "In (11) the NP \"Mary's heart\" can be topicalized (if \"Mary\" is stressed), but in (12) the NP \"the bucket\" cannot undergo this transformation without losing the idianatic reading.",
        "Thus idioms behave syntactically like non-idiomatic structures, although sometimes they are restricted .",
        "(5) It was the bucket that Pete kicked (6) It was Mary's heart that Pete broke (7) It was Pete that kicked the bucket (8) It was Pete that broke Mary's heart (9) At whose door did Pete lay his failure (10) Whose heart did Pete say that Mary broke (11) Mary's heart Pete broke (12) The bucket Pete kicked",
        "Idioms can take free arguments or can have elements, like possessive pronouns, which have to be bound by arguments.",
        "In sentences (13-15) \"Mary\" a complement to the idiomatic verb, and realizes different grammatical functions in the sentence (i.e. indirect object, possessive NP and to-PP object respectively).",
        "In (16) the pronoun \"his\" has to be bound by the subject \"Pete\".",
        "(13) Pete gave Mary the finger (14) Pete broke Mary's heart (15) Pete laid down the law to Mary (16) Pete lost him temper",
        "Linguistic theories on idioms should he able to account for the problems outlined above.",
        "The proposals made are usually fragmentary, in the sense that they only are concerned with part of the problem, for instance Fraser (1970), who only deals with the possible application of transformations to idioms, or they are a relatively minor part of a larger theory, for example Chomsky (1981), who gives a very general and principled account of idioms, but cannot cope with all the data More elaborate studies on idioms are usually not directly relevant to machine translation, for instance Boisset (1.978), who treats idioms from a more pragmatic point of view.",
        "To illustrate it could he argued that Chomsky (1981) can cope with sentences such as (2) and (15), but not with (13), (14) and (16); Pesetsky (1985) can deal.",
        "with (2) or (13-16), but not with a sentence like: (17) Pete laid his failure at Mary's door.",
        "Chomsky (1981, p. 146, note 94) claims that \"we may think of an idiom rule for an idiom with a verbal head as a rule adding the string aVc to the phrase marker of each terminal string abc, where b is the idiom, now understanding a phrase marker to be a set of strings\" and that idioms \"appear either in 1)-structure or S-structure or LF-form.\" Furthermore \"at D-structure, idioms can he distinguished as subject or not subject to Move alpha\".",
        "l'hus here it is possible to reanalyse a string abc into aVc as for example for sentence (2) in figure (18), where the reanalysis is indicated by a double tree and where a is \"Pete\", b is \"kick the bucket\" and c is empty:",
        "It seems that on this approach elements of idioms must be adjacent at a certain level (D-structure, S-structure or LF-form), which is the case for sentence (2).",
        "However, in sentence (14) the parts of the idiom \"break\" and \"heart\" are not adjacent at any level, since the free argument \"Mary\" is situated between the idiom parts and in (16) \"lose\" and \"temper\" are not adjacent at any level either.",
        "Hence this theory is not able to deal with every type of idiom.",
        "According to Pesetsky (1985) in a configuration such as figure (19) B and E may undergo a rule of idiosyncratic interpretation, if B is the head of C.",
        "For sentence (14) in which \"heart\" is the head of the NP dominating \"Mary's heart\", the rule of idiosyncratic interpretation is allowed, resulting in:",
        "In the above tree, the effect of the rule of idiosyncratic interpretation is indicated by the dotted lines; the effect is that the idiom parts are mapped onto one meaning.",
        "As suggested by Pesetsky, this would also account for sentence (13) if we follow Kayne (1982) in his analysis of double object constructions.",
        "Kayne claims that \"NP the finger\" forms a constituent with \"the finger\" as its head, so the rule of idiosyncratic interpretation is allowed.",
        "Sentences (17) and (21-22) are problematic even under this analysis:",
        "(21) Pete rammed his lack of money down Mary's throat (22) Pete gave Mary credit for her work",
        "Figure (23) gives a representation of sentence (21) which \"his lack of money\" and \"Mary\" are free arguments:",
        "his lack of money P NP",
        "Since \"throat\" and \"down\" are heads of their constituents, one might suggest a successive application of the rule of idiosyncratic interpretation, but it is not clear how such a rule should operate and since every constituent has a head and syntactic categories are no barrier to rule application, the domain in which this rule is permitted is unlimited.",
        "It seems that Chomsky (1981) and Pesetsky (1985) are not capable of dealing with the counter examples given here.",
        "The treatment of idioms presented in this paper can cope with these phenomena because it is based on the assumption that elements of idioms neither have to be adjacent at the level of interpretation nor do they have to be in the specific configuration proposed by Pesetsky.",
        "In the field of computational linguistics not much attention has been paid to idioms.",
        "Some examples are Rothkegel (1973) and Wehrli (1984).",
        "However, in their proposals idioms are treated in the lexicon or morphology and there is no apparent way to account for the scattering of elements of idioms in sentences.",
        "The organisation of the rest of the paper is as follows: in section (2) an outline of the theoretical framework of the Rosetta machine translation system will be given; section (3) discusses idioms within this framework; section (4) discusses some of the typical problems mentioned in the introduction."
      ]
    },
    {
      "heading": "2 Outline of Isomorphic M-Grammars",
      "text": [
        "The Rosetta system is based on the 'isomorphic grammar' approach to machine translation.",
        "In this approach a sentence s' is considered a possible translation of a sentence s if s and s' have not only the same meaning but if they also have similar derivational histories, which implies that their meanings are derived in the same way from the same basic meanings.",
        "This approach requires that 'isomorphic grammars' are written for the languages under consideration.",
        "The term 'possible translation' should be interpreted as \"possible in a particular context\".",
        "The discussion in this paper will be restricted to the translation of isolated sentences on the basis of linguistic knowledge only.",
        "In the following sections the notions M-grammars, the variant of Montague grammar used in the Rosetta system, and isomorphic grammars will be introduced.",
        "For a more detailed discussion of isomorphic M-grammars the reader is referred to Landsbergen (1982, 1984).",
        "In section (2.3) an example of an M-grammar will be given."
      ]
    },
    {
      "heading": "2.1 M-Grammars",
      "text": [
        "Starting from basic expressions, an expression can be formed by applying syntactic rules.",
        "The result of this is a surface tree, in which the labels of the terminal nodes correspond to words.",
        "This process of making an expression is represented in an M-grammar by a 'syntactic derivation tree', in which the basic expressions are labels of the terminal nodes and the names of the rules that are applicable are labels of the non-terminal nodes.",
        "In the example below (Fig.",
        "(25)), rule R1 makes the NP \"the cat\" The grammars used in the system, called M-grammars, can he in seen as a computationally viable variant of Montague Grammar which is in accordance with the transformational extensions proposed by Partee (1973).",
        "This implies that the syntactic rules operate on syntactic trees rather than on strings.",
        "Restrictions have been imposed on the grammars in such a way that effective parsing procedures are possible.",
        "An M-grammar consists of (i) a syntactic, (ii) a morphological and (iii) a semantic component.",
        "(i) The syntactic component of an M-grammar defines a set of 'S-trees'.",
        "An 'S-tree' is a labelled ordered tree.",
        "The labels of the nodes consist of a syntactic category and a list of attribute-value pairs.",
        "The branches are labelled with the names of syntactic relations, such as subject, head, object, etc.",
        "An M'-grammar defies a set of S-trees by specifying a set of basic S-trees and a set of syntactic rules called 'M-Rules'.",
        "An 'M-Rule' defines a partial function from tuples of S-trees to S-trees.",
        "from the 'basic expression \"cat\" and rule R2 makes the S-tree for the sentence (24) on the basis of the NP and the basic expression \"walk\" (the constructions to the left of the dotted lines are abbreviations of what the result of the application of the rule looks like).",
        "(24) the cat is walking the cat is walking the cat cat (ii) The morphological component relates terminal S-trees to strings.",
        "This component will be ignored in the rest of the discussion.",
        "In this way the syntactic and the morphological component define sentences.",
        "(iii) The semantic component.",
        "M-grammars obey the compost-tionality principle, i.e. every syntactic rule and every basic S-tree gets a model-theoretical interpretation.",
        "For translation purposes only the names of meanings and the names of meaning rules are relevant as will.",
        "be shown later.",
        "The model-theoretical interpretation of the basic S--trees and the syntactic rules is represented in a 'semantic derivation tree', which has the same geometry as the syntactic derivation tree, but is labelled with names of meanings of rules and basic expressions.",
        "An example is given below in (27).",
        "Before giving an example of an M-grammar in section (2.3), isomorphic N.-grammars will be discussed.",
        "2.2 Isomorphic M-Grammars To establish the possible translation relation the grammars must be attuned to each other as follows: - For each basic expression of a grammar C of a language L there is at least one basic expression of a grammar G' of a language L' with the same meaning.",
        "- For each syntactic rule of C there is at least one syntactic rule of G\" corresponding to the same meaning operation.",
        "Syntactically these rules may differ considerably.",
        "Two sentences are defined to be (possible) translations of each other if they have derivation trees with the same geometry, in which the corresponding nodes are labelled with names of corresponding rules and basic expressions.",
        "If this is the case then the derivation trees are isomorphic and the two sentences have the same semantic derivation tree.",
        "Grammars that correspond to each other in the way described above will be called 'isomorphic grammars' if the corresponding rules satisfy certain conditions on application, such that for each well-formed syntactic derivation tree in one language there is at least one corresponding well-formed syntacticderivation tree in the other language.",
        "A syntactic derivation tree is well-formed if it defines a sentence, i-e. if the rules are applicable.",
        "The following is an illustration of these principles.",
        "The left part of figure (27) shows the derivation tree of sentence (26) which is the Dutch translation of sentence (24).",
        "Rule R°1 builds the NP \"de kat\" from the basic expression \"kat' and rule R'2 constructs the expression \"de kat loopt\" from the NP and the basic expression \"lopen\".",
        "There is a correspondence between both the basic expressions and the syntactic rules of the two grammars.",
        "Each rule of the syntactic derivation tree is mapped onto a corresponding rule of the semantic derivation tree and each basic expression is mapped onto the corresponding basic meaning.",
        "(26) de kat loopt (27) Dutch",
        "<=-> de kat loopt lopen de kat kat syntactic derivation tree The Rosetta machine translation system is based on the isomorphic grammars approach.",
        "The semantic derivation trees are used as the interlingua.",
        "The analysis component translates sentences into semantic derivation trees; the generation component translates semantic derivation trees into target language sentences.",
        "In this paper the translation relation will be discussed generatively only."
      ]
    },
    {
      "heading": "2.3 An Example of an M-Grammar",
      "text": [
        "in this section an example will be given of an M-grammar that generates sentence (28): (28) Pete lends the girl a book Only those M-Rules that are relevant to the discussion in the following sections will be dealt with.",
        "Note that the rules given here are in an informal notation.",
        "The M-grammar needed for this example:",
        "(i) basic S-trees:",
        "VERB(lend) (in this informal notation the syntactic information in the basic S-trees, given in the form of attribute-value pairs, has been omitted)",
        "(VAR's are syntactic variables corresponding to logical variables) (ii) M-Rules: Some notational conventions: - tl Indicate t, etc.",
        "are S-trees, - mu 's a arbitrary strings of relation/S-tree pairs, - square brackets indicate nesting,",
        "- in an expression of the form det/ART(the) det is the relation, ART the category and \"the\" a literal.",
        "So an expression like CL[subj/NP, head/VERB, mul] stands for: subj head",
        "t4 is of category VAR with index k then: CL[subj/t2, head/ti, iobj/t3, obj/t4] The rule operates on a ditransitive verb and three variables and makes a clause in which the variables are the subject, indirect object and direct object respectively.",
        "This is a rule scheme with an instance for every variable index i.",
        "The rule substitutes an NP for the subject variable.",
        "The same holds for rules R6 i and R7 k in which the NP's are substituted for the indirdct and direct object respectively.",
        "Apart from changing the category, this rule assigns the tense to the verb and specifies the form in accordance with the number and person of the subject, which is not indicated here (the correct form is spelled out in the morphological component).",
        "In this example the rules operate as follows:",
        "- Rule R applied to \"lend\", VAR(x ) VAR(x ) and VAR(xk) 1 ' as indicated, - rule R, applied to \"Pete\" gives NP(Pete), - R3 applied to \"girl.\" renders NP(the girl), - R3 applied to \"book\" NP(a hook), 4 - rule R5 i applied to \"lend\" and NP(Pete) renders CL(Pete lend x, - app: cation of R6 j to \"lend\" and NP(the girl) renders CL(Pete lend the girl x),",
        "- application of R7 k eo \"lend\" and NP(a book) results in CL(Pete lend the girl a book), - application of R8 gives SENTENCE(Pete lends the girl a book).",
        "The derivation tree for this example is represented in (29):"
      ]
    },
    {
      "heading": "3 Idioms and Isomorphic M-Grammars",
      "text": [
        "Traditionally, in Montague semantics, as for instance in the PTQ paper (Montague, 1973), a basic expression has a primitive meaning.",
        "However, the semantic concept basic expression does not always coincide with what one would call a syntactic primitive.",
        "This is the case, for instance, with idioms.",
        "For example the idiom \"kick the bucket\" has the primitive meaning 'die\", but the syntactic primitives are \"kick\", \"the\" and \"bucket\".",
        "For reasons given In the introduction it is impossible to treat idioms as strings (i.e. syntactic primitives).",
        "The possibility of applying syntactic transformations to (elements of) idioms, which are also applicable to non-idiomatic constructs, suggests that idioms should be treated as having complex constituent structures, which are similar to non-idiomatic constituent structures.",
        "The possibility of having free arguments, which are realized by various gramnatical functions, suggests that parts of idioms do riot have to be adjacent at any level of the syntactic process.",
        "The complex idiomatic constituent structure should accommodate this.",
        "In Rosetta, before idioms were introduced, basic expressions were terminal S-trees, i.e. terminal nodes.",
        "Idioms can be treated as basic S-trees that have an internal structure.",
        "This type of expression is an example of what will be called a \"complex basic expression' (CBE).",
        "A CBE is a basic expression from a semantic point of view, i.e. it corresponds to a basic ananing, and a complex expression from a syntactic point of view, i.e. it is a non-terminal S-tree.",
        "For example, the basic S-tree for \"kick the bucket\" looks like the following:",
        "By extending the notion of basic expression in this way the attuning of grammars (as defined in section (2.2)) is easier to achieve: corresponding basic expressions may be CBE's. For example the Dutch verb \"doodgaan\" may correspond to the English idiom \"kick the bucket\".",
        "Special measures are necessary to guarantee that the rules obey the conditions on application (cf. section (2.2)).",
        "Basic expressions are listed in the basic lexicon of a grammar.",
        "A CBE is represented as a canonical surface tree structure in the lexicon.",
        "A canonical surface tree structure is the default tree structure for a certain sentence, phrase, etc., i.e. the structure to which no syntactic transformations have applied.",
        "For example: if there is a passive transformation, the canonical structure is in the active form.",
        "Figure (32) shows the lexicon representation of the idiom:",
        "det head \\"
      ]
    },
    {
      "heading": "ART NOUN",
      "text": [
        "\"a' 'hand' The VAR nodes are not specified (i.e. not referring to an actual VAR) in the dictionary.",
        "These variables will be replaced by syntactic variables, when the CBE is inserted into the syntactic tree.",
        "Apart from the category VERB and the usual attribute-value pairs, the top node contains a set of attribute-value pairs that indicates which transformations are possible."
      ]
    },
    {
      "heading": "3.1 Treatment of Complex Basic Expressions",
      "text": [
        "in this section an extension of the M-grammar of section (2.3) will be given that can deal with an interesting class of Complex Basic Expressions and two M-grammars will be related to each other according to the isomorphy approach.",
        "Some other reasons for having complex basic expressions will be given."
      ]
    },
    {
      "heading": "3.1.1 An Example of an M-grammar for Complex Basic Expressions",
      "text": [
        "In this section an M-grammar will be presented that generates the idiomatic sentence:",
        "(33) Pete lends the girl a hand",
        "The grammar of section (2.3) is extended in the following way:",
        "head/VERB, lobj/V ] and t2 is of category VAR with index i.and t3 is of category VAR with index j then: CL[subj/t2, head/VERB, lobj/t3] This rule expects a complex, transitive verb and two variables; it constructs a clause in which the variables are the subject and the indirect object.",
        "For this example the rules operate as follows: - 09 renders CL(xi lend x a hand), - R2 and R, as in sectionJ(2.3), - R5 ,i renders CL(Pete lend x. a hand), --R, gives CL(Pete lend the]girl a hand), - Ara R8 results in CL(Pete lends the girl a hand).",
        "The derivation tree for this sentence is represented in the left part of figure (37).",
        "The result of application of rules R9, R7, R3, R5R is represented as a tree structure in figure (30: 6,j (34) CL subj head iobj obj NP head NOUN 'Pete' This construct is similar to the construct made after applying rules R1 to R7 in the example of section (2.3).",
        "One of the basic expredens differs.",
        "So the structures can he idiomatic or non-idiomatic and other rules of the M-grammar (e.g. wh-movement or passivisation) are applicable to both these structures, unless, as in the case of certain idioms, they are prohibited as indicated at the top node.",
        "Assume we have an M-grammar that generates the Dutch sentence (35) which is a translation of (33).",
        "It is then possible to lot the English M-grammar given above for (33) correspond to this grammar in the following way: (35) Pete helpt het meisje Here \"Pete\" in both languages corresponds to the basic meaning 131, \"V1 lend V2 a hand\" and \"help\" to B2, rules R9 and R'1 correspond to meaning rule M1, R2 and R'2 to M R, 2' J and R' to M4, etc.. 4 In this way it is possible to establish a correspondence between complex basic expressions in one language and basic expressions that are not complex in another.",
        "In a similar fashion it is possible to establish a relation between complex basic expressions in one language and complex basic expressions in another.",
        "Note that in this way it is not necessary to incorporate a so-called structural transfer in the machine translation systen for the translation of CBE's. 3.2 Other Reasons for Having Complex Basic Expressions Expressions that are not idiomatic, but that consist of more than one word can be handled by means of a complex basic expression in order to retain the isomorphy.",
        "This is the case if the expression (i) corresponds to an idiom or (ii) corresponds to a .word in another language.",
        "Examples are the following: (i) In Dutch (37) is not an idiom in the sense defined above (i.e. the meaning of the expression \"kwaad worden\" can be composed in a natural way from \"kwaad\" and \"warden\"), but has an idiomatic equivalent in English (38).",
        "(37) kwaad worden (Eng.",
        "\"become angry\") (38) lose one's temper If \"kwaad warden\" has to correspond to \"lose one's temper\", then in a technical sense, in Dutch, \"kwaad worden' can be treated in the sane way as an idiom.",
        "(ii) The Italian word (39) which translates into English (40) and Spanish (41) which translates into English (42) are words that correspond to complex expressions in English (and Dutch).",
        "From a translational point of view cases like \"get up early\" eau be treated in the same way as idioms.",
        "(39) adagiare (40) lay down with care (41) madrugar (42) get up early 4 Some Typical Problems",
        "In this section some of the problems mentioned in the introduction will be briefly discussed."
      ]
    },
    {
      "heading": "4.1 Argument Variables Embedded in a Complex Basic Expression",
      "text": [
        "in sentence (43) there are two arguments \"Pete\" and \"Mary\" and the idiom \"x1 break x2's heart\".",
        "The subject (\"Pete\") is treated in the same way as in the previous examples.",
        "The argument substitution rule substitutes the variabl.e by the NP \"Pete\", giving the structure in (44), in which, eventually, the NP \"Mary\" substitutes for the argument variable x1.",
        "Special M-Rules will have to be added to an M-granmar to achieve this kind of substitution.",
        "'Normal' argument",
        "substitution rules substitute for the variables in their canonical positions, i.e. as a subject or (indirect) object directly under the clause node or as an object to a preposition in a prepositional object.",
        "The argument substitution rule for this type of construct looks like the following: R10 h: if t1 is of category NP and t2 is of the form CL[mul, NP[det/VAR(x,), mu2], mu3] then: CL[mul, NP[de/t1, mu2], mu3] In this rule tl is assigned genitive case.",
        "Rule R1 applied applied to NP(Mary) results in CL(Pete break Mary's heart).",
        "In this way it is also possible to deal with the constructs mentioned in the introduction, as for example \"x1 ram x2 down x3's throat\"."
      ]
    },
    {
      "heading": "4.2 Variables Bound by Arguments",
      "text": [
        "Sentence (45) contains a possessive pronoun \"his\", that refers to the subject \"the boy\".",
        "In the lexicon the basic expression is represented as in (46).",
        "(45) the boy lost his temper (46) VERB"
      ]
    },
    {
      "heading": "ZI",
      "text": [
        "subj headN obj IN.. VAR VERB NP"
      ]
    },
    {
      "heading": "'lose' /\\",
      "text": [
        "Vl det head POSSPRO NOUN V1 'temper\" The M-Rule that inserts the CBE makes all possible forms of the possessive pronoun (his, her, their, etc.).",
        "The substitution rule for the subject decides upon the form of the possessive pronoun.",
        "In (47) the possessive pronoun \"her\" is bound to the object \"the woman\".",
        "The treatment here is similar to the one above.",
        "The argument to which the pronoun has to be bound is indicated in the lexicon.",
        "(47) the man gave the woman her freedom 5 Conclusion",
        "The method described in this paper for the treatment of idioms can deal with the problems traditionally related to expressions of this type.",
        "Structural transfer is not necessary, since idioms are mapped onto basic meanings.",
        "The grammar can operate on idiom structures in the same way as it operates on non-idiomatic structures, while, in the case of certain idioms, restrictions on operations are specified.",
        "A test implementation in the Rosetta machine translation system has shown that this approach is promising."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The author would like to thank all members of the Rosetta team, particularly Jan Landsbergen and Jan Odijk, for their helpful comments on earlier versions of this paper.",
        "This work was supported in part by a grant from the Nederlandse Herstructureringsmaatschappij (NEHEM)."
      ]
    }
  ]
}
