{
  "info": {
    "authors": [
      "Jacob Mey"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C65-1019",
    "title": "Pushdown Stores and Subscripts",
    "url": "https://aclweb.org/anthology/C65-1019",
    "year": 1965
  },
  "references": [],
  "sections": [
    {
      "heading": "1965 International Conference on Computational Linguistics PUSHDOWN STORES AND SUBSCRIPTS",
      "text": []
    },
    {
      "heading": "Abstract",
      "text": [
        "Various devices for the improvement of phrase structure grammars (PSG) have been suggested recently.",
        "In particular, the PSG model with a pushdown store (PSG/PDS) a s described by V,Yngve, and the PSG with subscripts (PSG/S) as described by G,Harman are considered.",
        "It is contended that such devices, even if they may do away with some of the difficulties of PSG, do not contain sufficient generative power to produce the structurally complicated sentences that are generated by other grammars (e.g., of transformational type).",
        "The handling of multiple discontinuous constituents (DC) in PSG/PDS, as well as the use of deletion rules in PSG/S is examined and criticized.",
        "It is shown that the improvements on PSG will not allow the grammar to generate a ll the sentences of the language that a transformational grammar (TG) does; moreover, the improvements on PSG a re obtained only at the cost of introducing too much power at the PS level, so that the improved grammars in some cases will exceed the requirements of the description, i.e. generate non-grammatical sentences."
      ]
    },
    {
      "heading": "O. Introduction",
      "text": [
        "N.Chomsky has argued that a PSG is not Bufficient to generate all the grammatical sentences of a language (Chomsky 1957:34 ff.).",
        "Recently, this conception of PSG has been criticized as being too primitive (Yngve 1960:445a, Harman 1963:604 ff.",
        "), and several ways of improving such a grammar have been suggested: a PDS has been connected with a PSG (Yngve 1960, 1961, 1962); the use of subscript notation has been recommended to give PSG a fair chance in competition with TG (Harman 1963)."
      ]
    },
    {
      "heading": "1. PSG/PDS",
      "text": []
    },
    {
      "heading": "1.1. PSG and DC",
      "text": [
        "The problem of the so-called discontinuous constituents (for a detailed treatment, see Wells 1947:96 ff.)",
        "has always been a crux in IC analysis.",
        "One of the drawbacks of PSG as described by Chomsky, is that it is not able to handle these constituents in a way that satisfies both the formal criteria of the grammar and the intuitive feeling that call and RE in, e.g., I called him up, belong together and should be treated accordingly in the analysis.",
        "Chomsky, in his discussion of PSG limitations, admits the possibility of \"extending the notions of phrase structure to account for discontinuities\" (Chomsky 1957:41), but, he adds, \"...fairly serious difficulties arise in any systematic attempt to pursue this course.\" An attempt in this direction is described by V.Yngve in several articles (see especially Yngve 1960); although the presence of DC is the most annoying of the complications under the PSG model (Yngve 1960:448a), the solution •.",
        ")ffered to this particular problem implies a wider claim, namely, that \"any shortcomings /of PSG, JM/ can be overcome\" (Ib.:445a).",
        "Accordingly, I will discuss below not only the problem of DC, but also the more general one of structure in a PSG/PDS."
      ]
    },
    {
      "heading": "1.2. DC and PDS",
      "text": [
        "The crucial step in the derivation of DC by the automaton (for a full description, see Yngve 1960:448-9) is the question asked: Does the right half of the grammar rule in question (GRi) contain the symbol \"...\" ?",
        "(where \"...\" stands for \"discontinuity in rewriting the symbol on the left hand side of the rule\") If the answer is Yes, we have to roll out the temporary memory (TM) tare one space (in a flow chart, one woull symbolize this by the index notation 1 – 1 – > 1, where 1 stands for \"leftmost\": \"rolling in\""
      ]
    },
    {
      "heading": "MN*",
      "text": [
        "tape would then be indicated by 1 + 1 – > 1, see Fig. 1).",
        "During this operation, the original content of TM1 (the leftmost location of TM) has to be kept in place, that is, the blank has to occur after the original TM].",
        "(on the right side, if the tape is thought of as moving from the left, see Fig. 1).",
        "If, however, the answer is No, we have to make sure that we have space for all the symbols on the right hand side of the rule and roll out tape accordingly.",
        "Let n be the number of symbols on the right hand side of GRi: then we can symbolize the rolling out by the index formula 1 – (n – 1), asthe first symbol always goes to the computing register.",
        "Let further J be the subscript for right hand side symbols of GRi.",
        "The rest of the operation is then performed as routine counting on GRi , 1 being set at 2 (the first symbol has already been taken care of).",
        "There should, of course, be a proviso for the symbol \"...\" itself, so that it will not be copied onto the TM tape.",
        "The method as described here will work neatly even in those cases where DC are \"nested\", that is, if the expansion of some DC turns out to be another DC (and so on, at least theoretically).",
        "As an example, one may try out the doubly discontinuous as far as the corner, where atl the necessary rules are specified by Yngve himself (1960:449a).",
        "An implicit assumption throughout the description of the mechanism is that DC can be represented by the simple formula A – > B + „.",
        "+ C. It follows that there are two cases that cannot be handled directly by the machine: the first one can be symbolized by A B + + C + + D (\"multiple discontinuous constituents\"); this reduces easily to double discontinuity by a suitable manipulation of the input rules.",
        "The other case could be labeled \"discontinuous multiple constituents\": formula A – > B + C + + D (or some variation on this theme), which would imply that the blank has to occur two spaces from leftmost instead of one.",
        "Following the instructions given by Yngve we would not obtain the right string of symbols in this case (as examples, one may try: He's not that big a fool, or: As nice a little parlor as ever you did see, or the Spanish sentence: Habla mas de lo que sabe 'He talks more than what he knows' (Bolinger 1957:63), where common sense would prefer the analyses that big ... fool, as nice ... parlor, mas de ... que (see diagrams in Fig. 2), thus preserving analogy with constructions like such a fool etc.",
        "The program could be accommodated to perform this by combining a counting operation with the check on \"...\", whereafter the continuous part of GRi's right hand side could be thrown in with the non-DC rules.",
        "Derivation being different, there would be no interference from constructions like that big fool, that are treated in the normal way by the machine.",
        "A device like the one described here will, within its obvious limitations, be able to randomly generate sentences that are for the most part quite grammatical (Yngve 1962:70).",
        "The question is: will it generate all, and only, the grammatical sentences of a language?",
        "I will try to answer this question in the next paragraph."
      ]
    },
    {
      "heading": "1.3. Limitations of PSG/PDS",
      "text": [
        "Although the model as proposed by Yngve in its original form only uses the PDS technique to solve a minor problem in syntactic analysis by the machine, the scope and use of PDS are by no means limited'to this particular problem of DC (For a detailed discussion, see Oettinger 1961:126-7).",
        "The elegancy and simplicity of PDS algorithms make them wellsuited for procedures of automatic syntactic analysis of languages.",
        "There are, however, some inherent limitations.",
        "Common to all PDS techniques is the fact that information stored in this way only is accessible in accordance with the formula \"last in, first out\".",
        "Being essentially a linear array of information (Oettinger 1961:104), the user (the machine) will not be able to draw on other information than is given by the leftmost symbol in a left-to-right production (the temporary memory tape in Yngve's machine, see Fig.l).",
        "Since, on the one hand, the machine output is past control (what is printed, is no longer available to the machine for inspection) and, on the other hand, the internal state of the machine is entirely determined by the current input symbol, one has to keep careful account not only of the current derivational steps, but also of the \"left-overs\" from earlier steps.",
        "This is exactly what a PDS can do, and the problems in connection with this technique are, as shown above in the case of the so-called discontinuous multiple constituents, are mainly technical (providing indexes etc.)",
        "The linear character of the memory, however, together with the finite state properties of the model itself give rise to another problem that seems unsolvable under the following assumptions for our machine: a finite number of states, a linear temporary memory, and a transition from one state into another by onesymbol input.",
        "The problem is the following: given any internal state of the/machine that is determined by more than one symbol simultaneously, will the supplementary device of a PDS be able to supply the necessary instructions to the machine that are not contained in the current symbol?",
        "The answer is in the negative, precisely because the memory is linear, and there is no \"look-up\" for items in the memory.",
        "What is stored in the memory can only be brought up to the surface by something outside the memory itself, that is, I have to create an \"expectancy\" that is specific for each item in the PDS.",
        "Only under these conditions the state of the machine can be defined as determined by the current symbol plus the oontents of the temporary memory (Yngve 19 60:449).",
        "This is essentially the procedure described by Harris for keeping track of nested constructions (\"incurrence and discharge of requirements\", Harris 1962: 53).",
        "The reason why the machine is able to handle DC is that this \"nesting\" occurs in one level, so that the symbols involved can be uniquely determined as belonging to the same dimension of analysis.",
        "Where \"surface structure\" is explained only by underlying \"deep structure\" (Hockett 1959: 246 ff.",
        "), the machine will not be able to carry out the analysis correctly.",
        "The structure that underlies a symbol X1 may be bound up with a special PS derivation, so that rules concerning structures like, say, Xi + X2 + X3 will be ambiguous in their application.",
        "One could place restrictions (in Harris' sense) on (one of) the symbols, thus creating a multiple path through the derivation, possibly combined with a cycling device: this is what the subscript technique does, see 2.4 for a detailed discussion.",
        "Some of the difficulties are removed in this way, but others persist, like those cases where pairs of symbol formulae are involved (the so-called \"generalized transformations\" of early TG, Chomsky 1957:113); this point is also discussed below.",
        "While placing too many restrictions on the symbols has serious disadvantages (some of which will be discussed in section 2 of this paper), it certainly exceeds the capacity of the model as described by Yngve: his rules are all of the context-free form.",
        "Thus, structure in a sufficiently powerful PSG is not only a matter of specifying the right rules, but also of choosing the right rules and combining them at the right places.",
        "There is still another factor that we have left out of consideration so far: the ordering of the rules.",
        "Yngve states that any order will do: an alphabetical order may be convenient (1960:445).",
        "Now this has two consequences: first, all of the rules have to be run through every time a symbol is expanded (perhaps only a minor drawback in a computeroriented analysis), second, the advantages of ordered rules (economy, elegancy, accuracy) are lost (\"forcing all kinds of low-level detail into the rules\", Bach 1964:53).",
        "Besides, ordering of the rules is indispensable in cases where complicated high-level structural descriptions are involved: thus an immediate derivation of each non-terminal symbol all the way down to word level would not be permitted in any kind of PSG, not even the most contextsensitive ones.",
        "Being esientially context-free, Yngve's grammar will generate what is usually called \"kernel sentences\" (Chomsky 1963:132): unambiguous derivation of more complex structures (derived sentences) will only be feasible under a careful specification of the order in which the rules have to apply (as an example, cf. the discussion of wh-transformations as depending on the interrogative transformation in Chomsky 1963:140).",
        "There is another way out of the difficulties that have been sketched in this section: phrasestructurizing at different levels, these being kept together by the representation relation (see Sgall 1964b).",
        "This solution is based on a somewhat different interpretation of PSG functions (not only syntactic, but also semantic rules are included); a PDS is coupled with the PSG of the lowest level.",
        "A detailed discussion of this system will have to wait for more details, but it seems that grammars based on dependency relations have received too little attention so far (for a comparison of IC and dependency theories, see Hays 1964: 519-22)."
      ]
    },
    {
      "heading": "1.4. Grammar and psychology",
      "text": [
        "Referring to experiments performed by G.A.",
        "Miller, Yngve establishes an analogy between the \"depth\" of memory /n the human brain and the depth of sentence construction in the model (1960:452).",
        "The human brain is not capable of storing more than, say, seven plus minus two items a t a time (for references, see Yngve ibid.).",
        "In other words, the human brain has a limited capacity, just like the temporary memory of Yngve's machine.",
        "One of the conditions to be put on a flawless handling of \"deep\" constructions is that the storage capacity is not exceeded by the number of symbols to be developed later on.",
        "In this connection Yngve makes the interesting observation that sentences and constructions in general actually do have a sort of limited depth, i.e. the number of regressive nodes is bound by more or less the same upper limit as that for human memory's simultaneous storage capacity.",
        "Now, I think that the analogy between the two kinds of \"storage\" should not be overstressed.",
        "It rests primarily on the tacit assumption that the model should, or could, be considered as a more or less true-to-life representation of human linguistic activity.",
        "As I have remarked before, this supposition is altogether groundless, and will at best hamper an explanation of such activity in truly linguistic terms.",
        "A remark made by Yngve in this connection may clarify the issue.",
        "Yngve says (1960: 452b; see also 1961:135-6 for an even more explicit commitment): \"The depth limitation does not apply to algebra, for example, because it is not a spoken language.",
        "The user has paper available for temporary storage.\" But so has the user of any other language, e.g, human everyday spoken language.",
        "The fact that we do not use paper actually when speaking has nothing to do with greater or lesser depth of sentences (or, if it does, the depth differences occur only to one side, namely that of decreasing depth).",
        "One could pursue this analogy ad absurdum by assuming two kinds of depth, one unlimited, for written languages, and one limited, for spoken languages.",
        "The results would be disastrous for any description of any language: sentences of the type: \"That that that they are both isosaies is true is obvious isn't clear\" (Yngve 1960:458b) are as ungrammatical in written as they are in spoken English.",
        "Of course Yngve is perfectly right in attributing the difference between the above nongrammatical (deep regressive) that-clause and its grammatical (progressive) counterpart: \"It isn't clear that it is obvious that it is true that they are both isosceles\" to excess depth.",
        "So, there is a denth limitation and this limitation is gramatically relevant.",
        "But this linguistically fruitful concept should not be confounded with hypotheses from descriptive psychology.",
        "That the claim for descriptive similarity between psychology and linguistics is latent in Yngve's model can be seen from another instance.",
        "His second assumption for the model (1960: 445) is that \"the model should share with the human speaker ... the property that words are produced one at a time in the proper time sequence, that is, in left-toLright order ...\" (the first assumption, viz. that any shortcomings of the PS model can be overcome, has partly been dealt with above, and will be treated at length in the second half of this paper).",
        "This restriction, I think, on a model (or a grammar, insofar as the grammar is based on the model) is unnecessary and self-contradictory.",
        "It is unnecessary, since the model should only copy relevant traits in the speech production of the individual; and even though it may be true that words are produced in a linear sequence (as already Saussure has remarked), it has not yet been shown how this linearity is to be interpreted in human speech production: I think it is only weakly relevant, that is to say, linearity alone will never suffice to give a complete picture of the speech event.",
        "For a full-fledged description of speech I suppose the assumption that we speak in sentences rather than in words will have many advantages.",
        "Moreover, the claim that the model should duplicate the property of left-to-right production in the human speaker cannot be brought to harmonize with the model.",
        "In fact, the model can only examine one symbol at a time: the machine may erase or delete or read only that section of the memory tape that is closest to the roll, i.e. the leftmost symbol only (Yngve 1960:446).",
        "Now, the limitation of human memory is on reproducing more than a certain numher of items at the same time.",
        "The analogy clearly does not hold between human memory and machine storage: the explanation is that the machine produces symbols, whereas the speech of humans is structured.",
        "In other words, a left-to-right production may in many cases be explained by a linear structure in the producer; the pushdown store is a linear memory device.",
        "But there are other left-to-right productions that are structured in such a way that a PDS or other left-to-right arrangements will not suffice.",
        "It is of course true that a structural description is not altogether absent, from a PSG/PDS: Yngve's machine produces as its output a string of symbols containing both syntactical markers (\"flattenedout trees\") and terminal symbols.",
        "This will suffice to \"infer the derivational history of each string from that string in a single way\" (Sall 1963:41), but only insofar as the structure can be described in one-level terms, cf. discussion above (see also Sgall 1963; 1964a).",
        "The question will be treated at length in part two of this paper."
      ]
    },
    {
      "heading": "2. PSG/S",
      "text": []
    },
    {
      "heading": "2.1. The subscript notation",
      "text": [
        "The subscript method referred to here is not in the first place thought of a s a machine program (even though its close affinity with the computer language COMIT is asserted, see Harman 1963:608fn.).",
        "Accordingly, it has a more general scope: namely, to offer a fullfledged alternative, in PS form, to other grammars (e.g. of transformational obedience), thereby proving that \"transformational grammar has no advantage over the phrase structure grammar\" (Harman 1963:598).",
        "Subscripts are added to the PSG rules in two ways: first, to introduce restrictions on such rules, second, to s2ecify where those restrictions apply.",
        "An example of the first kind is the rule S – > Sl/NUMBER-SG (Harman 1963:609), and, in general, any rule of the type A B/J + .",
        "The second case obtains e.g. in the following rule: NP/NOT-WIi DETERMINER + NOUN, and, of course, in all rules where subscripts are \"lost\" during expansion.",
        "I think there will be a third type as well, even though this is not expressly mentioned in the article, namely, subscripts that do both: introduce new subscripts at places indicated by old ones; but this is only a minor point.",
        "More important is the observation that subscripts can take care of all sorts of constittients, both continuous and discontinuous.",
        "For the latter, the generation rules are adapted from rules suggested by Victor Yngve (Harman 1963:606; the reference quoted is Yngve 1960.)",
        "Like in Yngve's model, the rules of PSG/S are unordered: all necessary information about when and where to wIply a rule is contained in the subscripts (which, by the way and perhaps a fortiori, are said to occur in an unordered sequence).",
        "But, as will be seen from the following paragraphs, this \"when\"and \"where\" is not only a notational problem: in fact, it is one of the big underlying differences between PSG and TG.",
        "(On the difficulty of ordering rules in a PSG, see Chomsky 1957:35).",
        "A further important difference from other PSG interpreta.tions is the admission of deletion rules, that is rules of the form A – > 0 (Harman 1963:603); also this point will be discussed at length below.",
        "2.2.",
        "Subscripts.",
        "And Transformations In general, one cannot deny the possibility of incorporating (by means of subscripts or other devices) some of the information that is contained in a transformational gra mmarrinto a one-level grammar of PS type.",
        "But the grammar thus constructed will never generate all and only the grammatical sentences of the language.",
        "Either it will generate too little (the normal case for PSG without subscripts or similar devices) or, if it generates more, it will also generate some nongrammatical sentences (Harman 1963:611:\"... not all sentences constructed in accordance with this grammar 'are well-formed.\") A very simple example will show this.",
        "Suppose we want to transform optionally a sentence into its question counterpart.",
        "To do this in the PSG/S according to Harman, we have to choose an appropriate expansion of the symbol S2 (the same paths hold for number-and moderestricted S : Sl, resp.",
        "S2, Harman:600), namely either the second or the fourth rule in 3., the set of expansion rules for S2.",
        "We choose the second rule (normal question, the fourth rule concerns wh-questions): S2 – > VP/TYPE-QUES,NOT-WH + NP/CASE-NOM,NOT-WH Now, note two things: in order to conform to the rules for this grammar, we have already added some of the subscripts from Rules 1 and 2 to the symbol S2 (e.g., NUMBER-SG and MODE-ACT).",
        "These subscripts, together with the new ones, are to appear on every symbol that is contained in every rule from now on (unless a delete subscript is introduced, cf. below).",
        "This is necessary, since we cannot let any information that is conveyed by the subscripts be lost, even if it be irrelevant to the symbol in question (such as, say, a MODE restriction on a NP).",
        "One can easily imagine that rewrite rules of this type soon become very unwieldy ( even if we do not allow Ourselves to be frightened by the prospects of \"millions of rules\", Harman:605).",
        "Thus, in rule 7.of this comparatively simple grammar we already have 6 subscripts to each symbol.",
        "This number is substantially increased in the more elaborate version of the grammar (see Appendix to Harman's article).",
        "This is certainly not what one would call simplicity of description.",
        "But objections of this kind can be met by the following consideration: even if the multiplication of entia, i.c.",
        "symbols and subscripts, seems without rationale for humans, one can conceive of it as a necessity for computer data handling, and the computer certainly dues not mind going through all the subscripts, adding some, deleting others, etc., every time a symbol is mentioned or expanded.",
        "So, if one has a working program in which these restrictions can he written out as subroutines, and if the computer space needed does not exceed that available, the objection just made does not hold (cf.",
        "Harman:610fn.",
        ": \"Many of these grammars are in the form of computer programs for generating actual sentences.\") The other question is far more imp'tant.",
        "It can be split up into two parts: 1.",
        "Can all the data of the grammar be put into the subscript-restriction schema?",
        "2.",
        "Will the subscript-restriction schema not put more data into my grammar than wanted?",
        "The first question concerns the adequate representation of the structure, the other expresses the fear that I may add structure to my grammar, thus producing sentences that are not grammatical (see Chomsky 1962:514ff.)",
        "Adopting a distinction made by Chomsky, I make the following assertion: A PSG/S will serve as a more or less adequate observational and descriptive representation of the facts covered by a normal PSG; as far as TG is concerned, the structure of the transformational model (how trees map into trees) will not be represented adequately on the descriptive (and perhaps not even on the observational) level by a PSG/S.",
        "In no case the PSG/S will attain the level of explanatory adequacy.",
        "The first part of my assertion can easily be proved from the observation that a normal PSG and a PSG/S are strongly equivalent grammars, the only difference being the notation.",
        "(On the notion of equivalence, cf. also Hays 1965:519).",
        "In fact, it makes no difference whether one expands a symbol on the basis of a rule to be affixed to the constituent by means of a subscript, or on the basis of a rule contained somewhere else in the grammar.",
        "The essential is that gneration proceeds from left to right, and one symbol is produced at a time.",
        "(See discussion above, 1.2).",
        "To prove the other half of the assertion made above, I will try to give an answer to the twofold question about representation of structure.",
        "Let's go back to the elementary example of the optional T , and try to imagine how this is handled in a PSG/S.",
        "The main difference between PSG and TG is that the rules in PSG operate on symbols, in TG on strings of symbols.",
        "When I put a subscript on a symbol that is part of a string, and I want to mark off a structure that is based on several symbols occurring in a certain order, I will have to mark a 11 the symbols of my string in the same way, and this way of marking must be unique, i.e. define a unique path through the rules.",
        "This path may, in due course, require additions, deletions, permutations and the like.",
        "Now, in TG these operations are carried out after the PS derivation has been completed.",
        "In PSG/S, however, the cleavage between affirmative and interrogative sentences occurs already in the third rule, where S2 is expanded into NP + VP, VP + NP, respectively (omitting the subscripts).",
        "The two derivations follow separate paths through the rules: in terms of tree diagrams, what is left in the one is right in the other of the two trees, In this way, many PSG rules are unnecessarily duplicated (see above); moreover, the relationstiip between interrogative and declarative sentences, as defined in TG, is reduced to a remote common source of derivation, namely S2.",
        "It is not true that \"Sentences are 'transformationally related' to the extent that the same choice of restrictions is made in their derivations and if the same lexical c'toices are made where possible\" (Harman:608; single quotes are his), unless one takes \"'transformationally related'\" in a sense rather different from Chomsky's, namely: sentences that have a (partial) path through the rules in common.",
        "This is, in fact, the only 'transformational relation' that it is possible to define in a PSG/S, but unfortunately, it is not transfermational.",
        "Even in the case that two paths coincide, and coincide altogether, we do not have '.transformational relatedness', but \"grammatical similarity\" (Harman:608).",
        "Lexical choices have nothing to do with this relation: both in PSG and in TG the choice on the lexical level is made after the application of expansion, resnectively transformational rules.",
        "(This is not altogether correct: lexical choices may be made earlier and thus affect the derivation, but this is beside the point; complex symbols (see Klima 1964) are not taken into consideration here, but they could be built into a PSG as well as into any other generative grammar.",
        "I think, e.g., that some complex symbol could be devised to prevent sentences like The man walks the men, that could easily be generated in accordance with the rules described on pp.",
        "609-10 of Harman's article.)",
        "In my opinion, a PSG/S will never be able to show transformational relationships as formally defined and described by Chomsky and others; hence such a grammar, even though it may attain a certain descriptive adequacy, will never give an explanation of the fact that precisely this, and not some other sentence, is transformed into another structure.",
        "2.3.",
        "Deletion in a PSG Another difficulty in PSG/S concerns the problem of deletion rules.",
        "In normal PSG, no deletes are permitted (Chomsky 1961:9).",
        "Harman gives as reason for this restriction that trees must be uniquely recoverable in a PSG (p.603).",
        "This is, however, only part of the motivation.",
        "Deletes are not symbols: they cannot be expanded (unLess one chooses to expand them into deletes, which is obviously useless in a description).",
        "Whenever a deletion rule occurs, the structure of the derivate is altered in such a way that rules may a)ply which originally should not.",
        "One could say that deletes are extremely context-sensitive: in Harman's PSG/S, which in reality is a highly restricted PSG, the number of rules having the form A – > 0 is very limited indeed, even though the author advocates their use (0.605).",
        "In passing, I would like to remark that nearly all of the deletion bules have to do with the expansion of NP/WH (this subscript occurs only once in the smaller grammar, p.609, and should therefore be rejected by the machine, since there are no constituents on which the rule could aiply.)",
        "The real reason why a delete cannot be admitted in a PSG (especially a highly context-sensitive one) is that the rules following the deletion rules should be modified or alter•?,d completely , otherwise it would not be possible to keep the distinction between not-rewritten and rewritten symbols clear: the rules following deletion might thus operate on symbols originally belonging to the context.",
        "(Note, by the way, that in the case of wh-words the context problem is somewhat simplified by the fact that these words normally stand at the beginning of a sentence, so that the left context can be thought of as zero.)",
        "In our example, the transformational rule for interrogative sentences to be generated from declarative ones operates on a string of symbols that may be symbolized X1 - X2 - X3 (Chomsky 1957:112), carrying it into the shape X2 - X1 - X3.",
        "Now, suppose that in the course of the derivation to non-terminal symbols (the kernel string) we have a deletion rule operating, say, on 'Clo Suppose moreover that the non-terminal symbol following X3 qualifies for the conditions originally put on X3.",
        "The transformational rule will then operate on a string X2 X3 - X4, and carry it into X,3 -X2 - X4, thus generating a non-grammatical sentence.",
        "I do not pretend that the actual PSG/S as proposed and described by Harman in his article will generate these sentences: as already said, the grammar makes a very cautious use of deletions, so that sentences like the ones mentioned will not occur.",
        "This does not, however, invalidate the criticism.",
        "Subscripts may not only be added in ft PSG/S, but also deleted.",
        "In this manner a restriction that has been put on a certain rule can be removed (this deletion of subscripts is of course quite another matter than the deletion of symbols discussed above).",
        "Subscripts may be suerfluous, such as in Rule 8.1 (p.609), where the subscript AUX-MODAL is removed from the constituent INFINITIVE by the subscript – AUX-MODAL, even though the lexicon would offer no ambiguous rewrites in the case of a nonremoval of the superfluous subscript.",
        "One could perhaps wonder why this precaution is taken, since in many other instances superfluous subscripts persist all the way through the derivation (see discussion above).",
        "In other cases, the removal of subscripts can be motivated by the desire to Prevent ungrammatical \"loops\", i.e. endless recursive expansions that have no justification in the grammar.",
        "Thus in Rule 8.1 the symbol VP'3/AUX-MODAL is expanded into INFINITIVE/... + VP)/AUX-HAVE, – AUX-MODAL, thus preventing another expansion by the same rule of VP).",
        "If, on the other hand, we wish the symbol in question to be expanded recursively (and according to the latest develooment in TG there should be no difficulty in admitting recursivity for all symbols, S not excluded: see Klima 1964), we can restart the cycle by wiping our slate, i.e. deleting all the subscripts by means of the instruction ERASE.OTHERS, to be incorporated as a subscript on the right hand side of the rule.",
        "Naturally, we would expect a subscript of this kind to occur in those cases where a whole sentence is to be embedded into another by means of what in early TG was called \"generalized transformations\" (Chomsky 1957:113).",
        "The/nominalizing transformation is an instance inkind: under 3g in the extended PSG/S (p.613), we find, among others, the entry: NP8 Sl/CLAUSE.TYPE:NOMINALIZATION,SUBJ.IN.",
        "GENITIVE,B,C,IX,E,Z,Y,ERASE.OTHERS This means that all the subscripts originally found on NP8 are to be deleted; the new subscripts deal exclusively with the derivation of the embedded clause (as can easily be verified from the rules of the PSG/S as given in the Appendix of the article).",
        "Whereas TG keeps track of the changes to be made by means of a structural description of the pair of kernel sentences involved, together with a formula for structural change, in PSG/S we have only a constituent NP to be expanded by means of PS rules.",
        "How this NP fits into the structure of the original kernel sentence (being essentially its path through the PS derivation) can be followed in PSG by tracing back the nodes of the tree representation.",
        "In PSG/S, this path is marked by the subscripts added to the NP in question.",
        "Now, all this information is struck from the record by the removal of the subscripts in ac:ordance with the instruction ERASE OTHERS.",
        "(structural description of the sentence as a whole is not available: the expansion of NP8 destroyed our bridge back to the original S. It is as if we had/been expanding a constituent while forgetting what it was we were expanding."
      ]
    },
    {
      "heading": "3. Conclusion",
      "text": [
        "Of the two models discussed here, the first one (PSG/PDS) has not actually been proposed as a full-scale grammatical model, but I have tried to show that the implications of the claim that any shortcomings of PSG can be overcome lead to difficulties of about the same nature as those encountered in the second mo.iel (PSG/S).",
        "Descriptive adequacy is not attained in those cases where structural descriptions are relevant for the operation of the rules: neither PSG/PDS nor PSG/S permits one structural description to be carried over into another.",
        "As one will have noticed, the argument in both cases runs along the same lines.",
        "Moreover, of the several devices proposed by Har:Aan to boost the 0ower of PSG, the deletion rule was explicitly rejected on the ground that it would add too much power to the grammar.",
        "On the other hand, the use of subscripts, no matter how carefully chosen, gill not help enlarge the descriptive power of the grammar (Harman 1961:605) enough to account for all the grammatical sentences of the language.",
        "Thus, one-level grammars like the ones discussed above will not attain explanatory adequacy in any case, and in some cases not even descriptive.adequacy.",
        "\"Dieser Versuch /namely, the defense of phrase structure, JM/ verfehlt den entscheidenden Punkt aber in.",
        "zweifacher Hinsicht: Erstens Uberschreiten die Regeln Harmans die Kapazitt einer PSG.",
        ",Und zweitens losen auch sie nicht das Problem einer geigneten Zuordnung von Stammbumen.\" (Bierwisch 1964: 49fn.11)"
      ]
    },
    {
      "heading": "References",
      "text": [
        "as nice a little parlor"
      ]
    },
    {
      "heading": "41 I 1",
      "text": [
        "raga de lo que Babe"
      ]
    }
  ]
}
