{
  "info": {
    "authors": [
      "L. W. Tosh"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C65-1027",
    "title": "Data Preparation for Syntactic Translation",
    "url": "https://aclweb.org/anthology/C65-1027",
    "year": 1965
  },
  "references": [],
  "sections": [
    {
      "heading": "1965 International Conference",
      "text": [
        "on Computational Linguistics DATA PREPARATION FOR SYNTACTIC TRANSLATION L. W. Tosh The University of Texas P. O.",
        "Box 8611 Austin, Texas 78712 TUSH"
      ]
    },
    {
      "heading": "ABSTRACT",
      "text": [
        "The following paper discusses the preparation of syntactic data for use in a generalized language translation system, developed by the Linguistics Research Center at The University of Texas.",
        "Capabilities and limitations of translation by syntactic model are outlined and compared with the word-for-word model.",
        "BACKGROUND In January of this year the Linguistics Research Center held its first demonstration of an operational system for experimental translation of languages.",
        "We prepared n limited set of test data and used a preselected input text to demonstrate the operational status of computer programs in the system.",
        "I shall discuss briefly the model on which the translation system is based and the preparation of linguistic data used in the demonstration.1"
      ]
    },
    {
      "heading": "LINGUISTICS RESEARCH CENTER",
      "text": [
        "Two principal objectives at the Linguistics Research Center have been the development of a generalized automatic translation system and the development of a linguistics computer system consisting of programs designed to facilitate the collection and maintenance of data for the translation system [7].",
        "In addition to these objectives, we have undertaken related studies in information retrieval and automatic classification [1, 2].",
        "The philosophy behind our research effort may be characterized as one of seeking general solutions to language description and translation as opposed to one of designing specialized algorithms.",
        "The general principles underlying our research have been discussed elsewhere, and I shall not dwell on them here [4; 5; 6; 8, pp.",
        "3-14; 9].",
        "Three organizational subdivisions of the Center are the Theoretical Linguistics Group, the Descriptive Linguistics Group and the Systems Group.",
        "Activities at the Center are distributed over these and other specialized arevs in order to facilitate research.",
        "Results reported in this paper are presented from the point of view of activities in the Descriptive Linguistics Group.",
        "The Descriptive Linguistics Group is currently engaged in maintaining research data in six languages: Chinese, English, German, Hebrew, Russian and Spanish.",
        "We are also maintaining data for independent, non-supported research in Hindi and Old Saxon.",
        "We have just begun maintaining data for Japanese.",
        "Plans are being made to add French to the data in the Linguistics Research System in the near future."
      ]
    },
    {
      "heading": "LINGUISTICS RESEARCH SYSTEM",
      "text": [
        "The Linguistics Research System is a hierarchical system of computer programs, which, in addition to programs in the experimental translation system, includes programs designed to support a stratified description of language data (see fold-out entitled LINGUISTICS RESEARCH SYSTEM).",
        "In the illustration the large boxes marked MAINTAINANCE at the upper and lower part of the page represent the system of programs in which we collect and maintain language and descriptive linguistic data.",
        "The system of large boxes running across the middle of the page represents the translation system.",
        "Details of these programs will be found in [8, pp.",
        "83-103].",
        "I outline the functions of programs in the translation system below.",
        "TRANSLATION MODELS Various models have been proposed For automatic translation of languages.",
        "The models have been characterized into at least three levels of increasing complexity and sophistication: 1.",
        "Word-for-word, 2.",
        "Rule-for-rule or syntactic, 3.",
        "Transformational-semantic.",
        "The inadequacies of type 1. are known.",
        "Most of current investigation is concentrated in some form or other on type 2., while type 3. models remain largely speculative.",
        "Translation programs have been completed which will simulate models 1. and 2.",
        "In model 1. we may perform word-for-word translation by presenting an input corpus (see fold-out) to the LEXICAL ANALYSIS program.",
        "Analysis results in recognition of whatever forms have been defined in the lexical grammar.",
        "The results are transferred from the analysis program in MONOLINGUAL RECOGNITION to the LEXICAL ANALYSIS program in INTERLINGUAL RECOGNITION.",
        "Intermediate display programs are ordinarily bypassed in the translation mode.",
        "The data then pass to an INPUT TRANSFER tape before entering the TRANSFER program.",
        "This program processed INPUT TRANSFER data against data from the INTERLINGUA tape to produce an OUTPUT TRANSFER tape.",
        "OUTPUT TRANSFER data pass into the LEXICAL SYNTHESIS program in INTERLINGUAL PRODUCTION to be converted to an acceptable form for input to LEXICAL SYNTHESIS in MONOLINGUAL PRODUCTION.",
        "The resulting data pass on to the OUTPUT CORPUS tape which serves as input to the CORPUS DISPLAY program.",
        "Output from this lowest level of translation would be word-for-word, morph-for-morph, etc.",
        "matching the order of input forms.",
        "There would be no control over output morphology or syntax.",
        "We have not considered it worthwhile to attempt to use model 1. translation independently of model 2.",
        "Model 2. translation in the Linguistics Research System performs in a fashion operationally similar to model 1.",
        "Instead of operating (horizontally on the fold-out) directly through the lexical level, however, we initiate",
        "the translation input in LEXICAL ANALYSIS and pass the resulting data (vertically) into SYNTACTIC ANALYSIS.",
        "Model 2. translation now continues horizontally on the syntactic level analogously to the manner described for the lexical level.",
        "Output resulting from the syntactic translation model observes the requirements for well-formedness in output language morphology and syntax.",
        "Examples from the January demonstration are given below.",
        "With large volumes of grammar data, this model is not expected to provide all the semantic collocational controls which we as linguists will want to maintain.",
        "Nor will it properly account for problems such as pronominal reference.",
        "These and other transformational problems will be dealt with in a still higher order of description and programming.",
        "The semantic order of programming has only recently been undertaken.",
        "The translation model used in the January demonstration is essentially a type 2. model, although it contains some features proposed for type 3. models.",
        "Analysis is performed on the input language with a context-free phrase structure grammar.",
        "The structures which are thus identified are transformed into equivalent output language structures by the so-called transfer grammar.",
        "Translation output is then generated through a context-free phrase structure grammar of the output language [13].",
        "Rules for use in a similar model are given by Ilse Langerhans [3].",
        "The essential difference, however, between our model and that proposed by Langerhans is that in the latter the input language is analyzed into kernels, the kernels matched with equivalent output language kernels, and the output language kernels transformed into finished expressions."
      ]
    },
    {
      "heading": "PREPARATION OF DATA",
      "text": [
        "For the demonstration, we selected a text in psychology to use as a test corpus in German, the input language (Appendix A).",
        "The corpus consisted of the first six paragraphs of an essay appearing in UNIVERSITAS [10].",
        "Members of our staff then prepared an English translation to be used as a test corpus in the output language (Appendix B).",
        "We use test corpora for verifying the morphosyntactic description in each language before attempting to use the grammars in the translation system.",
        "To illustrate the details of data preparation, I have chosen the second sentence from the third paragraph of text (Fig.",
        "1).",
        "This sentence was chosen for reasons of simplicity and economy of description.",
        "It is typical, however, of transformational problems in syntactic translation.",
        "We provided a phrase structure description for the sentence, labelling those features of construction which would be necessary for morpho-syntactic (as opposed semantic) grammaticality in German.",
        "The description contains, therefore, more information than is necessary for recognition.",
        "But we are designing our grammars, in general, for bidirectional use.",
        "A similar description was provided for the English translation (Fig.",
        "2).",
        "After diagramming each sentence, we encoded the information contained in the diagrams in an equivalent phrase structure notation [14].",
        "The data were then compiled in the computer system.",
        "As rules are compiled for each language, each rule is randomly assigned a permanent identification number.",
        "After the respective grammars are compiled and displayed, we refer to them for the identification of each rule and record the appropriate number by each occurrence of a rule in the diagram.",
        "The diagrams then appear as in Figures 3 and 4."
      ]
    },
    {
      "heading": "VERIFICATION OF DATA",
      "text": [
        "To insure that a description for any given sentence is complete, we perform analysis on the sentence in the computer, using the grammar data accumulated up to that point.",
        "If automatic analysis is successful, we expect to see at least the analysis output corresponding to the information recorded in the diagram for the sentence.",
        "Often there are alternative analyses.",
        "If automatic analysis is incomplete, we reconstruct the rules needed and (re)compile them in the grammar.",
        "I shall not go into the details of analysis here, as they have been presented elsewhere [8, 12, 13].",
        "TRANSLATIONAL TRANSFORMATIONS After we verified the descriptions in each language, we went on to define the basis of interlingual transformation relationships.",
        "We selected a pair of sentences, one from each of the two languages.",
        "They are defined as equivalent in meaning by bilingual informants.",
        "Given the pair of sentences, we mapped corresponding substructures from one sentence on to the other.",
        "This information was recorded on the diagrams by circumscribing the substructures (Fig.",
        "5).",
        "Normally these lines are added directly to the diagrams.",
        "For the sake of simplicity, I have omitted branching diagrams and class names from the illustrations.",
        "After we established the correspondences between each pair of sub-structures, we inspected each substructure to see of what it was TOSE.' 13 composed.",
        "I have represented this information in Figures 6 and 7 by the rule number(s) contained in each substructure.",
        "Suppose now we want to \"transform,\" i.e., translate the expression Bewusstsein into the expression consciousness.",
        "Bewusstsein (Figs.",
        "3, 6) is represented by the rule 42321: N1OW 4 Bewusstsein Consciousness (Figs.",
        "4, 7) is represented by the rule 27951: NSF 4 consciousness We define the equivalence of these two expressions by writing the hi-directional transformation Tx: [42321]g 4 Tx [27951]e This is equivalent to writing a reversible transformation between the structures of Figure 8.",
        "Similarly, we may translate from an infinitive construction in the one language into a corresponding construction in the other.",
        "The infinitive of umschreib-is formed with en by the rule 628: INF/ACSTV V12A + en The corresponding English construction is formed by the rule 359: VRBL VPR1A + e We record thus the transformation T [628]g Ty -■ [359]e to define the translation equivalence.",
        "This is equivalent to writing the transformation in Figure 9.",
        "Figure 9 INF/ACSTV VRBL",
        "The foregoing examples are typical of the many rule-for-rule correspondences to be found in a pair of structurally similar languages.",
        "Of greater interest are those transformations of pairs of structures which are dissimilar in terms of constituent rules.",
        "In Figure 6 the sub-string kann (man) nicht (raeher umschreiben) is analyzed in part by the rule sequence 10234 + 10241 + 1035 + 626.",
        "The sub-string consists, furthermore, of a subject-verb inversion characteristic of German syntax.",
        "We may transform this construction of four rules into the corresponding English construction (Fig.",
        "7) of three rules 533 + 466 + 28792 by writing the transformation T,: [10234 + 10241 + 1035 + 626] Tz 4 [533 + 466 + 28792]e p This is equivalent to writing a transformation on the structures in Figure 10.",
        "Figure 10 ,",
        "The transformation brings us from the subject-verb inversion of German into the normal subject-verb order for English.",
        "Superscripts are associated with all class names in phrase structure rules in order to maintain proper order of content substitution during transformation from one structure to another [13, pp.",
        "12f, 51-66].",
        "TRANSLATION OUTPUT After all translation data have been collected and compiled for a given test corpus, the next step is to verify the data in the computer system by attempting to carry out automatic translation.",
        "As in the case of automatic analysis, we expect translation output corresponding at least to the target language structures for which we have set up translation rules.",
        "That is, we expect in the case of successful translation an output which resembles within satisfactory limits the human translation given as the ideal goal.",
        "There may be, in addition, various alternative paraphrases, but the content should be essentially the same.",
        "The more likely case in the beginning stages, naturally, is partial success mixed with failure.",
        "Our first output for German to English translation is given in Appendix C. The unsatisfactory quality in this example is the result of a combination of program errors and inadequate linguistic data.",
        "Word-for-word output would produce results quite similar to this sample.",
        "Receiving such results, we referred back to the appropriate sentence diagrams and lists of translation rules to reconstruct the rules necessary for well-formed output.",
        "A subsequent run with the needed additional translation rules is displayed in Appendix D.3 If we compare the computer translation (Appendix D) with the human translation (Appendix B), they appear quite similar at first glance, as indeed we should hope they would be.",
        "A closer inspection, however, reveals numerous differences.",
        "Some of these result from weaknesses in description as limited by the model, while some result from the alternatives implicit in the descriptive data -- alternatives which the model is designed to cope with.",
        "In the first or title paragraph, the German title is constructed in the framework of a prepositional phrase beginning with ueber.",
        "Since the human translation was prepared without a preposition, transformation rules were set up to delete the preposition accordingly in the computer version of the English output.",
        "This is probably not advisable, however, since in the syntactic model there TOSS!",
        "19 is no satisfactory way to distinguish contextually a prepositional phrase functioning as a title from its other uses.",
        "The implication is, then, that we should reformulate our transformation for this context to produce an English preposition like on.",
        "The human and machine translations are identical in the first sentence of paragraph 1 denoted by the numbers 74 001 in the left margin (Appendices A, B, 0).",
        "The German adverb allein, which is an element in the relative clause modifying the subject-noun head, has been transformed into the English adverb only, which now is a member of the corresponding English subject-noun head construction and not an element of the following relative clause.",
        "For the German clause das Problem...so verzweigt, we have transformed into the corresponding English clause the problem...so complex, inserting a copula verb is.",
        "Finally, in the last clause of the German sentence there is a passive construction which has been transformed into an equivalent English active construction.",
        "There are transformations of similar complexity throughout the remainder of the corpus.",
        "There is an interesting difference between the last sentence of the human translation of paragraph 1 and the machine translation.",
        "In the human translation the sentence ends ...problem of a dependence of mental processes on the body.",
        "In the machine translation the sentence ends ...problem of a physical dependence of mental processes.",
        "Although all the necessary grammar rules and transformations were available to the translation system for producing an output identical with that of the human translation, it is interesting that the system picked instead an alternative paraphrase (and a potentially confusing one) which was more similar to the syntax of the original German input.",
        "The system's choice was made on the basis of certain probability parameters available to it and with which we are in continual experimentation.",
        "It is not surprising that the system selected such an alternative, for we expect such to be the case in the present model.",
        "What is interesting, however, is the fact that a choice was available even within the limited data set which we prepared for these few paragraphs.",
        "For this experiment the system had available to it dictionary data for the entire article of 32 paragraphs.",
        "With respect to syntactic data, however, it was quite limited since we supplied just the rules necessary to carry out analysis and/or synthesis of the six paragraphs involved in the experiment.",
        "Furthermore, we had limited ourselves in the transformation data to a choice of one syntactic output for each sentence -- the output identical with that of the human translation.",
        "Nonetheless, it is evident that in this small data set there are already sufficient implicit relationships to permit unplanned for if not unexpected paraphrases."
      ]
    },
    {
      "heading": "LIMITATIONS IN THE MODEL",
      "text": [
        "Paragraph 2 of Appendix D contains probably the most frequent and characteristic examples of deviation from an ideal output.",
        "The paragraph contains a number of aberrant pronominal forms.",
        "Since German contains the forms er, es, sie and all their variant case forms and since all these forms are ultimately correlatable with all forms of English he, she, it, it follows that we may generate any one of the English third singular pronouns from any one of the German third singular pronouns.",
        "In the model presented here, we have not, for instance, classified nouns on the basis of such features as gender, animateness, concreteness, etc.",
        "Thus, in the first sentence of paragraph 2, we have not classified either reader or brain as to referential gender.",
        "Consequently, at the moment when the translation system is prepared to generate a pronoun following the sequence ...at this moment when..., the English grammar is so constructed and tied into the transformation-transfer data that the system may generate (just the proper case form of) all three third singular pronouns.",
        "Which one is TOSII 23 generated depends on which rule has the highest probability value, in this case the rule producing the expression it, since this is the most frequent of the pronouns in the text.",
        "It is not clear that the proper choice of English pronoun gender could be specified even if we included in the syntactic description such features as gender, animateness, etc.",
        "For some instances of pronoun-antecedent agreement will remain ambiguous, given two or more antecedents.",
        "The ambiguity occasionally cannot be resolved without resort to reference to the extralinguistic environment.",
        "The first sentence of paragraph 2 is perhaps a case in point.",
        "Given the general context of psychology in which the test corpus was written, it is conceivable that either the pronoun he or it could refer back to the appropriate respective antecedents reader or brain.",
        "In those cases where pronoun-antecedent agreement can be stated within the linguistic environment, we should of course be prepared to build such features as gender, animateness, concreteness, countableness, and a host of other such features into our grammars--features which have been difficult to account for systematically before the advent of stratificational, tagmemic and transformational techniques.",
        "In the grammars we have undertaken so far for the several languages, we have tended to exclude such features from morpho-syntactic description.",
        "EXPANDING THE MODEL We shall include features such as lexical collocation (agent-action agreement) and transformations of semantic equivalence in a systematic description of a higher order which presupposes a morpho-syntactic description for each language [8, pp.",
        "66-71].",
        "The following analogy might be drawn: just as strings of alphabetic and other characters are taken as a body of data to be parsed and classified by a phrase structure grammar, we may regard the string of rule numbers generated from a phrase structure analysis as a string of symbols to be parsed and classified in a still higher order grammar [11; 13, pp.",
        "67-83], for which there is as yet no universally accepted nomenclature.",
        "The term transformational strongly suggests itself and is widely used, but the term semantic may seem more appropriate to others.4 PROJECTIONS During the coming year we shall proceed to expand syntactic description of all languages now under investigation.",
        "Sufficient transfer data will be compiled between pairs of languages to test the general validity of the model and the general adequacy of the system of programs we are now using.",
        "Several questions suggest themselves with respect to limitations of the model, among them: 1. how large will the syntactic description of a language be in terms of rules before the grammar converges on the languages, and 2. in what ways can we improve the quality of translation by using a more solhisticated model, say one in which there is a grammar of structural semantics?",
        "We shall be occupied primarily with these two questions in an effort to anticipate the need for modifying elements of the translation programs and in an effort to test empirically with a comprehensive data base some of the more recent theories and notions of linguistics.",
        "FOOTNOTES",
        "1.",
        "Research at the Linguistics Research Center is supported by the National Science Foundation, the U. S. Army Electronics Laboratories, the U. S. Air Force and the Latin American Institute of The University of Texas.",
        "2.",
        "Recognition is due the entire LRC staff, present and past, for success in the results reported here.",
        "Among the linguists who contributed more immediately to the underlying data are: T. Baker, T. Git, M. Prince, K. Ryan, R. Stachowitz, A. Staves, C. Swinburn.",
        "Intensive preparation of test data for the demonstration covered the period from August, 1964 to January, 1965.",
        "General research and development of programs have been under way since May, 1959.",
        "3.",
        "On comparing the computer and human versions of the English translation with the German version, the reader is reminded that nowhere are any corpus data stored explicitly in the translation system of programs.",
        "Only raw corpus data in the source language are fed in as input to the analysis programs in the system.",
        "The analysis and synthesis programs use grammatical descriptions in both languages with attendant transformation/translation rules to produce output in the target language from the analysis-transfer-synthesis cycle.",
        "4.",
        "Perhaps a passing observation is in order.",
        "The term transformational, borrowed from mathematics, is a term generally applicable to any process of mapping equivalences of one structure onto another and so is applicable to all levels of linguistic description.",
        "FOOTNOTES (CONTINUED) It should not, therefore, be used to denote a particular level in a hierarchical structure.",
        "The term semantic, on the other hand, may perhaps come to be universally accepted as a hierarchical expression in some series like: pragmatic logical semantic syntactic morphological phono-/graphological REFERENCES",
        "[1] A. G. Dale, N. Dale, E. D. Pendergraft, \"A Programming System for Automatic Classification with Applications in Linguistic and Information Retrieval Research,\" presented to the International Study Conference on Classification Research, Elsinore, 1964 (mimeo) [2] R. Jernigan and A. G. Dale, \"Set Theoretic Models for Classification and Retrieval,\" LRC 64 WTM-5 (Austin, 1964) [3] I. Langerhans, \"Transformational Translation: English to German,\" Transformations and Discourse Analysis Projects 50 (Philadelphia, 1963) [4] W. P. Lehmann, \"Computational Linguistics: Procedures and Problems,\" LRC 65 WA-1 (Austin, 1965) [5] W. P. Lehmann, \"Towards Machine Translation,\" LRC 64-WA2 (Austin, 1964) [6] W. P. Lehmann and E. D. Pendergraft, \"Structural Models for Linguistic Automation,\" VISTAS IN INFORMATION HANDLING, P. W. Howerton, ed.",
        "(Washington, 1963), pp.",
        "78-91.",
        "[7] Linguistics Research Center, \"Seventh Quarterly Progress Report,\" LRC 65 AMC-23 (Austin, 1965) [8] Linguistics Research Center, \"Symposium on the Current Status of Research,\" LRC 63-SR1 (Austin, 1963) [9] E. D. Pendergraft, \"A Generalized Computer System for Language Translation,\" LRC 64-WA1 (Austin, 1964) [10] H. Schaefer, \"Ueber die physiologische Grundbedingung des Bewusstseins,\" UNIVERSITAS, Oktober 1959, 10.1079-1090.",
        "[11] W. Tosh, \"Content Recognition and the Production of Synonymous Expressions,\" PROCEEDINGS OF THE NINTH INTERNATIONAL CONGRESS OF LINGUISTS, (The Hague, 1964), pp.",
        "723-729.",
        "[12] W. Tosh, \"Development of Automatic Grammars,\" to appear in LINGUISTICS.",
        "[13] W. Tosh, SYNTACTIC TRANSLATION, (The Hague, 1965)"
      ]
    }
  ]
}
