{
  "info": {
    "authors": [
      "Mike Reape"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E89-1014",
    "title": "A Logical Treatment of Semi-Free Word Order and Bounded Discontinuous Constituency",
    "url": "https://aclweb.org/anthology/E89-1014",
    "year": 1989
  },
  "references": [
    "acl-P85-1021",
    "acl-P86-1038"
  ],
  "sections": [
    {
      "heading": "2 Buccleuch Place, Edinburgh EH8 9LW Scotland, UK Abstract",
      "text": [
        "In this paper we present a logical treatment of semi free word order and bounded discontinuous constituency.",
        "We extend standard feature value logics to treat word order in a single formalism with a rigorous semantics without phrase structure rules.",
        "The elimination of phrase structure rules allows a natural generalisation of the approach to nonconfigurational word order and bounded discontinuous continuency via sequence union.",
        "Sequence union formalises the notions of clause union and scrambling by providing a mechanism for describing word order domains larger than the local tree.",
        "The formalism incorporates the distinction between bounded and unbounded forms of discontinuous constituency.",
        "Grammars are organised as algebraic theories.",
        "This means that linguistic generalisations are stated as axioms about the structure of signs.",
        "This permits a natural interpretation of implicational universals in terms of theories, subtheories and implicational axioms.",
        "The accompanying linguistic analysis is eclectic, borrowing insights from many current linguistic theories."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In this paper we present a logical treatment of semi free word order and bounded discontinuous constituency.",
        "By a logical treatment, we mean that the grammar is an axiomatic algebraic theory, i.e., a set of axioms formalised in a logic.",
        "By bounded discontinuous constituency, we refer to phenomena such as Dutch cross-serial dependencies, German Mittelfeld word order and clause-bounded extraposition in contrast to unbounded forms of discontinuous constituency such as cross-serial multiple extractions in Swedish relative clauses.",
        "There is no scope within this paper to provide the linguistic argumentation sufficient to justify the approach described below.",
        "We shall have to limit ourselves to describing the key linguistic insight that we wish to formalise.",
        "That is that semi-free word order and nonconfigurationality are local phenomenon (i.e., bounded) and that word order domains are larger than the local trees of context free based accounts of syntax.",
        "(This includes nearly all well-known unification-based grammar formalisms such as GPSG, LFG, HPSG and cuc.)",
        "This is simply a restatement of the notion of clause union or scrambling familiar from transformational analyses.",
        "Our proposal is to provide a feature-value logic with a rigorous semantics with sufficient expressive power to allow the encoding of even syntactic structure within the single formalism.",
        "This means that the work of encoding syntactic structure is carried by the feature-value logic and not by formal language theoretic devices (i.e., phrase structure rules).",
        "Sequences of linguistic categories, or signs (following Saussure, HPSG and ucc), do the work of PSRs in our logic.",
        "The phon attribute of signs is functionally dependent on the phon attributes of the signs in sequences encoding local order domains.",
        "This allows us to trivially introduce word order domains larger than the local tree by introducing a sequence union operation.",
        "cPsc-style linear precedence (LP) statements express partial ordering constraints on elements of sequences.",
        "The grammars we use consist of three types of elements: (1) descriptions of lexical signs, (2) descriptions of nonlexical signs and (3) axioms which specify the redundant structure of signs.",
        "This organisation is similar to that of HPSG (Pollard and Sag, 1987) from which we borrow many ideas.",
        "Subcategorisation is expressed in terms of sets of arguments.",
        "This borrows ideas from all of HPSG, LFG (Bresnan, 1982) and categorial grammar (cc).",
        "However, like HPSG and unlike LFG, our set descriptions are collapsible.",
        "We also share with CG the notions that linguistic structure is based on functor-argument structure and that lexical functors partially order their arguments.",
        "All word order facts are captured in the way that lexical functors combine the ordering domains (dtrs sequences) of their arguments.",
        "Functors can combine order domains in one of two ways.",
        "They can take the sequence union of two sequences or concatenate one with the other.",
        "Discontinuity is achieved via sequence union.",
        "Continuity is achieved via concatenation.",
        "Since functors partially order sequences by LP statements, order amongst both continuous and discontinuous constituents is treated in the same way.",
        "This solves the problem often noted in the past of specifying the appropriate - 103 - constituents as sisters so that LP statements can apply correctly while satisfying the subcategorisation requirements of lexical heads and coindexing constituents correctly with subcategorised arguments.",
        "Furthermore, order is \"inherited\" from the \"bottom\" since sequence union preserves the relative order of the elements of its operands.",
        "The empirically falsifiable linguistic hypothesis made is that the whole range of local word order phenomena is treatable in this way.",
        "In 2 we present the syntax and semantics of the feature-value logic In 3 we develop a methodology for organising grammars as algebraic theories.",
        "In 4 we present a toy analysis of Dutch subordinate clauses which illustrates the basic ideas underlying this paper.",
        "We very briefly discuss an interpretation of parametric variation in terms of theories and subtheories in 5 and possible implementation strategies for the logic in 6.",
        "Below, we present an inductive definition of the syntax of the language.",
        "A is the set of i-constani descriptions, N is the set of (object language) variables, 41 is the set of i-feature structure descriptions, K is the set of i-set descriptions, Z is the set of i-sequence descriptions and IP =A uNu 41) uKuE is the set of descriptions of i. structures (formulas) of the entire language.",
        "Object language variables are uppercase-initial atoms.",
        "(I.e., they follow the Prolog convention.)",
        "Lowercase Greek letters are metavariables over descriptions o' structures of the corresponding intensional type (E.g., a EA is an i-constant description, (1) E cb is an ifeature structure description, x e K is an i-sei description and a e Z is an i-sequence description V e N may denote a structure of any i-type.)",
        "2.2.2.",
        "Definition Given the notational conventions, IP is inductively defined as follows:",
        "introduced as needed.",
        "For example, the following 2.2.3.",
        "Notes on the syntaxformulas are formally equivalent We define Vi > v2 to bev v2 and vi 4-,v2 to be v v2) A (-v2 v vi) in the usual way.",
        "Set descriptions ((VI, Vn)) are multisets of formulas.",
        "Set descriptions describe i-sets of istructures.",
        "A set union description (xi u x2) describes the union of two i-sets.",
        "The union of two isets is an i-set whose second component is the union of the second components of the two operand i-sets.",
        "(Note that this definition means that the indices of the two subsets do not contribute to the union.)",
        "A sequence concatenation description (oi cF2) describes the concatenation of two i-sequences.",
        "(Sometimes in grammars, we will be sloppy and write subformulas which denote arbitrary i-types.",
        "This should be understood as a shorthand for subformulas surrounded by sequence brackets).",
        "Vni5 describes an i-sequence of elements the order of which is unspecified.",
        "VI 112 describes an implicitly universally quantified ordering constraint over a sequence.",
        "The intuitive interpretation is: \"vi 5 v2 is satisfied by a sequence if every element of the sequence that satisfies vi precedes (or is equal to) every element of the sequence that satisfies v2\".",
        "This is essentially the same interpretation as that given to CPSC LP constraints (as modified for sequences).",
        "2.2.4.",
        "Matrix notation and other abbreviatory conventions We will use a variant of the familiar matrix notation below adapted to the extra expressive power that our logic provides.",
        "We will briefly outline here the translation from the matrix notation to the logic.",
        "A conjunction of feature-value pairs al:V1 A ... A an :Vn is represented using the traditional matrix notation: [al:V1] an:Vn Any other type of conjunction is represented as specified above.",
        "The connectives v, 4-are used in the normal way except that their arguments may be conjunctions written in matrix notation.",
        "For set (sequence) descriptions, \"big\" set (sequence) brackets are used where the elements of the set (sequence) may be in matrix notation.",
        "We will also often use boxed integers in the matrix notation to indicate identity instead of variables.",
        "The interpretation should be obvious.",
        "We will also use a few abbreviatory syntactic conventions.",
        "They should be obvious and will be",
        "In addition, we will occasionally write partial ordering statements in which the first (second) description in the ordering statement is a variable which denotes a sequence.",
        "In this case, the intent is that the elements of the denoted sequence all follow (precede) the elements satisfying the other description.",
        "For example, if VP denotes a sequence of feature structures then the description cat: verb 5 VP stands for",
        "and all of the elements of the VP sequence must follow any verb.",
        "Similarly, VP 5 cat: verb stands for (Final 5 cat: verb) A (NonVP k.r5 (VP A (Front (Final)))) and all of the elements of the VP sequence must precede any verb."
      ]
    },
    {
      "heading": "2.3. Semantics",
      "text": [
        "An i-structure, Vi, is an element of 4/1.",
        "A function N V+ is an assignment to variables.",
        "A model is a pair (V1,,g)",
        "2.3.1.",
        "Constants (a)(54i,g)a if= 0,a).",
        "0,A)(i.e., a = .5te .g) 2.3.2.",
        "Variables (b)g) v iff ,g(v)= 41+ (v N) 2.3.3.",
        "Feature-value pairs",
        "length(S\") and Ben\" s.t.",
        "1 --)n and it\": m ---)n and range(n) u range(n\") = n and Vi4 Es jle(j) and",
        "as in (q) and range(n) r range(ir\") = 0 2.3.7.",
        "Notes on the semantics Note that the set of syntactic constants A and the set of semantic constants A are the same, i.e., A = A and Tot] = a. is the sequence concatenation operator.",
        "It is a total function cSxS.-4.5.",
        "It is defined to be ,th) (M+1, , tin) =vn).",
        "EA is the underlying set of the sequence S, i.e., the set consisting of the elements of sequence S. 2.3.8.",
        "The feature structure notation for models Below we will use matrix notation for representing istructures.",
        "Since i-structures are completely conjunctive, there is no indication of disjunction, negation or implication.",
        "Furthermore, the order of elements in i-sequences are totally specified so there are no partial ordering statements.",
        "I structures are composed of only i-feature structures, i-sets, i-sequences and i-constants.",
        "Obviously, there are no variables in structures.",
        "Rather than explicitly indicate all indices of intensional structures, identity of two structures is indicated with boxed integers."
      ]
    },
    {
      "heading": "2.4. A Partial Proof Theory",
      "text": [
        "We use a partial Hilbert-style proof theory consisting of one rule of inference and many axioms and axiom schema.",
        "Space prevents us from presenting even this partial proof theory.",
        "We will note briefly that many of the axioms allow rather large disjunctions to be inferred.",
        "For example, if we have a formula",
        "then we can infer",
        "Similar axioms hold for most of the two place connectives in the language including sequence union.",
        "The only rule of inference is modus ponens.",
        "From a and a ---,p infer p.",
        "3.",
        "The organisation of the grammar 3.1.",
        "Basic organisation",
        "A = (81, ,6m) is the set of lexical signs.",
        "P =... ,pn) is the set of nonlexical signs.",
        "The sign axiom, 4)E encodes the signs A P where or; (cat: Cat) --> (81 v v 8m v vPn).",
        "A model M satisfies a formula N with respect to a theory 'T=...,tn), written M yr iff 244.tnAw.",
        "(We assume that the individual formulas in a theory have disjoint variables.",
        "When they don't, the assumption is that the variables in the entire theory are renamed such that this property holds.)",
        "A sequence P is a category C if",
        "This axiom says that in any headed sign, any element of the subcat set is either an element of the slash set, an element of the dtrs sequence or is \"unioned into\" the dtrs sequence and that there are no other elements of the slash set or &IT; sequence.",
        "3.3.",
        "A simple example Consider the following three element lexicon.",
        "[phon: (X,likes,Y)].",
        "cat: C Then the minimal FS which satisfies it is 4.",
        "An analysis of Dutch subordinate clauses In this section, we will present a toy analysis of simple Dutch subordinate clauses.",
        "The example that we will look at is the clause Ian Piet Marie zag hel pen zwemmen (minus the complementiser omdat).",
        "We require the following lexical entries.",
        ",Jan,.",
        "[phon: (fan)] cat: np [ phon: (he,likes,her) cat: sentence head: [phon: (likes)] cat: verb dtrs: { El , e , U 1",
        "case: nom case: acc f dtrs: Dtrs slash: Slash [phon: (he)] (1)2= cat: np case: nom i [phon: (her)] 03 = cat: np case: acc Then the grammar Tis the one axiom theory ,r= (4)) where 4) = cat: C >4)1 v 4)2 v 4)3.",
        "That is, if a FS is defined for cat then it must satisfy one of OD 4)2 or 4)3.",
        "Given this grammar, the only sentence defined is \"he likes her\" and the only NP's defined are \"he\" and \"her\".",
        "Consider the description glee.",
        "[phon: (Piet)1 cat: npj mane': [phon: (Marie)] cat: np phon: Phon cat: sentence vform.",
        "fin 'zag': head: cat: verb phon: (zagl 1 vform: fin [ subcat: (4)1, 4)2, 4)3) dtrs: Dtrs slash: Slash where .1, 02, and 03 are: phon: Subjl 4)1 .",
        "[cat: np case: nom i phon: Obj] 02 .",
        "[cat: np case: acc phon: VP 4)3 = [cat: vp vform: inf rphon: Phon cat: sentence head: [phon: (likes)] cat: verb",
        "subcat: f[cat: npcat: vp case: accvform: inf f dtrs: Dtrs slash: Slash We also need the following axioms.",
        "cat: (vp v sentence) A subcat: (((cat: vp) A (dtrs: Dtrs) A VP) Li X) > ((extra: - A dtrs: (Dtrs u< Y)) v (extra: Z A slash: ((VP) Li W))) dtrs: Dtrs dtrs: (cat: np 5 cat: verb case: nom 5 case: acc) ((head: Head) A (dtrs: Dtrs)) > dtrs: (Head 5 cat: verb) The first axiom simply states that VP complements are either extracted (i.e., members of the slash set) or are sequence unioned into the dtrs sequence.",
        "The second axiom says that NPs precede verbs and that nominative NPs precede accusative NPs.",
        "The third axiom says that a head precedes any other daughters in the dtrs sequence.",
        "This encodes the generalisation for Dutch subordinate clauses that governing verbs precede governed verbs.",
        "We'll now present the analysis.",
        "(We will necessarily have to omit considerable detail due to considerations of space.)",
        "We start as indicated in 3 with the following description phon: (lan,Piet,Marie,zag,helpen,zwemmen) A cat: C The sign axiom will have the disjunction of the six lexical entries in its consequent.",
        "Since our formula is specified for cat, thus satisfying the antecedent of the sign axiom, we can apply the sign axiom.",
        "The disjunct that we will pursue will be the one for 'zag'.",
        "This means we infer the formula phon: (Jan,Piet,Marie,zag,helpen,zwemmen) cat: sentence vform: fin phon: (zal head: cat: verb vform: fin [ subcat: (01, 02, 4,3) dtrs: Dtrs slash: Slash (where 01, 02, 4,3 are as in the lexical entry for 'zag') From the head-subcat-slash-dtrs axiom we ca] infer a large disjunction one of whose disjuncts is [phon: (Jan,Piet,Marie,zag,helpen,zwemmen) cat: sentence vform: fin [ phon: (zag) head: cat: verbA D4 vform: fin subcat: (D1 A Or, D2 A 02', 4)3' } dtrs: (D1,D2,D3,D4,D5,D6) slash: 0 where Of, 02' and 03' are: Of [phon: (ran cat: np case: nom 02' [phon: (Piet)] cat: np case: acc = [phon: arie,helpen,zwemmen) cat: vp (Mvform: inf dtrs: (D3,D5,D6) Again, we can apply the sign axiom to each of thes embedded formulas.",
        "01' and 42' will be consister with the lexical entries for 'Jan' and 'Piei respectively and can be rewritten no further.",
        "03' wil be consistent with the lexical entry for 'helpen' so w will be able to infer [phon: (zwemmen) 'zwemmen': head: cat: verb [ vform: inf subcat: () dtrs: Dtrs slash: Slash [phon: Phon cat: vp vform: inf",
        "phon: NP subcat: cat: npcat: vp case: acc }phon: VP [It vform: inf f dtrs: (D3,D5,D6) slash: Slash Again, from the head-subcat-slash-dtrs axiom we can infer a large disjunction one of whose disjuncts is [phon: Narie,helpen,zwemmen cat: vp vform: inf [ phon: (helpel I heed: cat: verbI1 D5",
        "Again, the head-subcat-slash-dtrs axiom can be applied leaving only one possibility in this case, namely, that both dtrs and slash has value 0.",
        "No further rewriting is possible.",
        "Under the assumption that the proof theory axioms that we have used are sound, we have determined that the original clause is in fact a finite sentence of the theory.",
        "There are two other points to make about the analysis.",
        "First, the first axiom we gave above guaranteed that VP complements which are specified extra: - are sequence unioned into the surrounding sign while NPs are not.",
        "We simply chose the extra: - option for every complement VP.",
        "Second, although we freely guessed at the values of dtrs sequences (within the limits allowed by the head-subcat-slash-dtrs axiom) a quick glance will establish that every dtrs sequence obeys the ordering constraints expressed in the second and third axioms.",
        "A few words are in order about how we can accomodate \"canonical\" German and Swiss German subordinate clause order.",
        "In either case, the first axiom is maintained as is.",
        "For German we need to either eliminate the strict ordering condition concerning case of NPs in the second axiom or add disjunctive ordering constraints for NPs as Uszkoreit suggests.",
        "The ordering constraints for Swiss-German are essentially the same.",
        "The first half of the consequent of the second axiom must be maintained for German.",
        "For Swiss-German, however, this constraint must be eliminated.",
        "It seems that the correct generalisation for at least the Zurich dialect (ZUritUUsch) is that NP complements need only precede the verb that they depend on but not all verbs.",
        "(Cf. Cooper 1988.)",
        "Therefore, for ZUritUUsch we must add an axiom something like subcat: ((cat: np A NP) t..) X) A head: (cat: verb A Verb) >dtrs: (NP S. Verb).",
        "(This condition is actually more general than the first half of the consequent of the original second axiom.",
        "I.e., it is a logical consequent of the second axiom.)",
        "For German, the third axiom is simply the one for Dutch with the order of Head and cat: verb reversed.",
        "This encodes the generalisation for German subordinate clauses that governed verbs precede governing verbs.",
        "For Diritthisch, the third axiom is simply eliminated since verbs are unordered with respect to each other.",
        "This analysis has been oversimplified in every respect and has ignored a considerable amount of data which violates one or more of the axioms given.",
        "It is intended to be strictly illustrative.",
        "It should, however, indicate that for \"canonical\" subordinate clauses, the differences which account for the variation in Dutch, German and ZUritUUsch word order are fairly small and related in straightforward ways.",
        "It is this aspect which we briefly address next."
      ]
    },
    {
      "heading": "5. Parametric Variation",
      "text": [
        "[phon: (Marie,helpen,zwemmen) cat: vp vform.",
        "inf - 109 - If Ti and T2 are theories and Ti g T2, then T2 is a subtheory of T1.",
        "This means that T2 axiomatises a smaller class of algebraic structures than Ti.",
        "Typically, Ti (and T2) contain many implicational axioms.",
        "The implicational axioms of Ti actually limit the class of structures which T2 axiomatises.",
        "A theory of universal grammar has a natural interpretation in terms of algebraic theories, subtheories and implicational axioms which potentially allows a richer account of parametric variation than the naive parameter setting interpretation.",
        "The approach is entirely analogous to the relation of the theories of Brouwerian and Boolean lattices to the general theory of lattices."
      ]
    },
    {
      "heading": "6. Implementation",
      "text": [
        "There has been no work done yet on the implementation of the logic.",
        "There are at least three obvious implementation strategies.",
        "First, as implied in 3, parsing of a sequence P as a category C can be reduced to testing satisfiability of the formula phon: P A cat: C. This means that we should be able to use a general purpose proof environment (such as Edinburgh LF) to implement the logic and test various proof theories for it.",
        "Second, there is an interpretation in terms of head driven parsing (Proudian and Pollard 1985).",
        "Third, we might try to take advantage of the simple structure of the grammars (i.e., the dependency of phonon dtrs sequences) and implement a parser augmented with sequence union.",
        "We hope to investigate these possibilities in the future."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "There are several comments to make here.",
        "First, the specific logic presented here is not important in itself.",
        "There are undoubtedly much better ways of formalising the same ideas.",
        "In particular, the semantics of the logic is unduly complicated compared to the simple intuitions about linguistic structure whose expression it is designed to allow.",
        "Specifically, a logic which uses partially ordered intensional sets instead of sequences is simpler and intuitively more desirable.",
        "However, this approach also has its drawbacks.",
        "What is significant is the illustration that syntactic structure and a treatment of nonconfigurational word order can be treated within a single logical framework.",
        "Second, the semantics is complicated a great deal by the reconstruction of intensional structures within classical set theory.",
        "A typed language which simply distinguishes atomic tokens from types and the use of intensional nonwellfounded set theory would give a far cleaner semantics.",
        "Third, the programme outlined here is obviously unsatisfactory without a sound and complete proof theory.",
        "The entire point is to have a completely logical characterisation of grammar.",
        "A complete axiomatisation is still in work.",
        "This is largely due to the complexity of the semantics of set and sequence descriptions and the belief that there should be an adequate logic with a simpler (algebraic) semantics and consequently a simpler proof theory.",
        "We simply note here that we believe that a Henkin style completeness proof can be given for the logic (or an equivalent one)."
      ]
    },
    {
      "heading": "8. Acknowledgements",
      "text": [
        "I would first like to thank Jerry Seligman.",
        "If this paper makes any sense technically, it is due to his great generosity and patience in discussing the logic with me.",
        "I would also like to thank Inge Bethke for detailed comments on the semantics of the logic and Jo Calder and Ewan Klein for continuing discussion.",
        "Any errors in this paper are solely the author's responsibility."
      ]
    },
    {
      "heading": "9. References",
      "text": []
    }
  ]
}
