{
  "info": {
    "authors": [
      "Jan Odijk"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E89-1011",
    "title": "The Organization of the ROSETTA Grammars",
    "url": "https://aclweb.org/anthology/E89-1011",
    "year": 1989
  },
  "references": [
    "acl-E87-1022"
  ],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "In this paper the organization of the grammars in the Rosetta machine translation system is described and it is shown how this organization makes it possible to translate between words of different syntactic categories in a systematic way.",
        "It is also shown how the organization chosen makes it possible to translate 'small clauses' into full clauses and vice versa.",
        "The central concept worked out here in some detail is the concept of 'partial iso-morphy' between subgrammars.",
        "The system as described here has been implemented and is currently being tested."
      ]
    },
    {
      "heading": "1 ROSETTA",
      "text": [
        "In this section I will mention some essential properties of the Rosetta machine translation system.",
        "For more extensive descriptions of this system I refer to Landsbergen(1987), Appelo & Landsbergen(1986), Appelo, Fellinger & Landsbergen(1987) and Leermakers & Rous(1986).",
        "The Rosetta machine translation system is an interlingual machine translation system based on Montague Grammar and developed at Philips Research Laboratories in Eindhoven for Dutch, English and Spanish.",
        "The grammars used in Rosetta are computational variants of Montague Grammar and are called M-grammars.",
        "Rules in M-grammars, called M-rules, operate on syntactic surface trees.",
        "If a certain string str is associated with a syntactic tree of category C the notation C(str) will be used.",
        "An M-grammar in Rosetta is subdivided into a number of subgrammars.",
        "Each subgrammar is a rule package and is defined by specifying a head (the category of a designated argument from the import for the subgrammar), export (the categories of the syntactic trees yielded by the subgrammar) and a control expression that indicates in which: order M-rules must be applied.",
        "In Rosetta31 a distinction is made between meaningful M-rules, called rules (that correspond to a meaning operation), and meaningless rules, called transformations (that do not correspond tc a meaning operation).",
        "M-grammars are reversible.",
        "Because of this fact the translation relation between two sentences cat be illustrated by showing their derivations in gen. eration.",
        "The example derivations below will 13( restricted to generation only.",
        "Within the Rosetta system the grammars of the relevant languages are attuned to one another in such a way that two sentences that are each other's translation can be derived starting fron corresponding basic expressions by applying corre• sponding rules in the same way for both sentences `Corresponding' here means: 'corresponding to tho same meaning operation or basic meaning', and ii holds of meaningful M-rules only.",
        "M-grammars attuned in this way are called isomorphic grammars, and therefore the method o translation used is called the isomorphic gramma approach to machine translation."
      ]
    },
    {
      "heading": "2 CATEGORIAL MISMATCHES",
      "text": [
        "In order to derive simple sentences e.g. Ziet hij di man?",
        "one could design a grammar of Dutch that starting with a basic verb (zie) applies rules to de rive the sentence mentioned.",
        "One could have rule: combining a basic verb with arguments that it al lows or requires (hij, de man) in a sentence, rule: that determine the tense of this sentence (presen tense) and rules that determine 'mood' and real IThe paper deals with the grammars in the third versioi of the Rosetta system, Rosetta3.",
        "ize the sentence accordingly ( in this case yes-no-question, main clause, realized by the order verb-subject-object), etc..",
        "In order to derive the English sentence Does he see the man?",
        "as a translation of this Dutch sentence it would be required to design a grammar of English isomorphic to the grammar of Dutch sketched above.",
        "There must be a rule combining a verb (see) with its arguments (he, the man).",
        "There must be rules determining tense and aspect (simple present tense in the example sentence), and there must be rules that determine 'mood' and realize the sentence accordingly (yes-no- question, main clause, realized by introducing the auxiliary verb do and the order do-subject-verb-object), etc..",
        "In this simple example the syntactic categories of the Dutch word zien and its translation into English see are the same.",
        "For these cases isomorphic grammars can be developed rather straightforwardly.",
        "However, machine translation systems must be able not only to translate between words of the same category, but also to translate between words of different syntactic categories.",
        "Some examples where a translation between words of different categories is required or desirable are given in the following table: hij zwemt graag (Adv) he likes to swim (Verb) hij is toevallig ziek (Adv) he happens to be ill (Verb) het mist (Verb) it is foggy (Adj) hij schaamt zich ervoor (Verb) He is ashamed of it (Adj) hij is mij 3 gulden schuldig (Adj) He owes me 3 guilders (Verb) hij is in A'dam woonachtig (Adj) He resides in Amsterdam (Verb) Het is voldoende (Adj) It suffices (Verb) The Rosetta grammars must be able to deal with such cases in a systematic way.",
        "It must also be possible to translate 'small clauses' into full clauses (finite or infinite) and vice versa.",
        "'Small Clauses' are propositional units in which a subject-predicate relationship is expressed and which are not marked for tense and aspect (cf. Stowell (1981)).",
        "Some examples of full clauses and their corresponding 'small clauses' are given in the following table:",
        "Adj I consider him intelligent Prep We got him against the deal Adv We got him here Noun They consider him a fool Small clauses can occur only as complements within a clause.",
        "The fact that they are not marked for tense and aspect is reflected in the absence of auxiliary and copular verbs.",
        "If the grammar allows for translation of clauses into small clauses and vice-versa, then it becomes possible to derive e.g. he seems ill and hij schijnt ziek te zijn (lit.",
        "he seems to be ill as translations of each other.",
        "It is sometimes required to be able to translate small clauses into full clauses in some cases.",
        "The English sentence he seems ill cannot be translated into Dutch *hij schijnt ziek, which is ungrammatical, but must be translated into hij schijnt ziek te zijn ( he seems to be ill) or into het schijnt dat hij ziek is (it seems that he is ill)."
      ]
    },
    {
      "heading": "3 GRAMMAR ORGANIZATION",
      "text": [
        "The global organization of the grammars (leaving transformations out of consideration) is the same for all languages, as is required by the isomorphic method.",
        "The grammars are subdivided into five projection subgrammars2, one for each major category (Verb, Noun, Prep, Adj, Adv).3 Each of these projection subgrammars consists of a number of subgrammars.",
        "The partitioning of projection subgrammars into subgrammars is motivated by the fact that it must be possible to use the output of each subgrammar as import to subgrammars of other projection subgrammars.",
        "A schematic representation of the partitioning of a projection subgrammar into subgrammars is"
      ]
    },
    {
      "heading": "2 These are called subgrammars in Appelo, Fellinger Landsbergen(1987)",
      "text": [
        "3Apart from these subgrammars there is also a projection subgrammar to derive simple NPs, which is not partially isomorphic to the other projection subgrammars.",
        "given in figure 1, where X is a variable over the major syntactic categories.",
        "A projection subgrammar is a set of subgrammars that define a projection for a given category X.",
        "A projection of some category X is a syntactic structure headed by X.",
        "Each projection subgrammar is bifurcated as indicated in figure 1.",
        "If the rules and transformations in the XPPtoCLAUSE and CLAUSEtoSENTENCE subgrammars are applied a full clause is derived.",
        "If the rules and transformations of the XPPtoXPFORMULA (XPPtoXPF) and XPFOR-MULAtoXPP (XPFtoXPP) are applied a 'small clause' is derived.",
        "The projection subgrammars are partially isomorphic to one another, which makes it possible to translate a subset of constructions from one projection subgrammar into constructions from some other projection subgrammar.",
        "Furthermore the XPPtoXPF subgrammars are partially isomorphic to the XPPtoCLAUSE subgrammars, and the XPFtoXPP subgrammars are partially isomorphic to the CLAUSEtoSENTENCE subgrammars.",
        "This makes it possible to translate a subset of full clauses into 'small clauses'.",
        "The subgrammars are partially isomorphic to one another instead of fully isomorphic, because for certain full clauses no corresponding small clauses exist (e.g. there is no 'small clause' corresponding to the full clause Is he ill?).",
        "BX derivation X The subgrammars indicated in figure 1 will be discussed in more detail now.",
        "X-Derivation subgrammar deals with derivation and composition XPPformation In this subgrammar the argu• meat structure and the syntactic realization of arguments (whether they are subject, ob.",
        "ject, prepositional object, etc.)",
        "is accounted for.",
        "Voice (active, passive) is determined in this subgrammar.",
        "XPPtoCLAUSE When this subgrammar is ap• plied a full clause will be derived.",
        "In the subgrammar propositional complements and ad.",
        "verbials are introduced, tense and aspect ie determined and auxiliaries are introduced ac.",
        "cordingly.",
        "There are several transformation: in this subgrammar to deal with the propel incorporation of propositional units into the structure, e.g. transformations dealing with control phenomena, and transformations deal.",
        "ing with the proper positioning of verbs (es.",
        "pecially in Dutch).",
        "'Hidden' arguments, e.g nonovert by-phrases in passives, are dealt with, here.",
        "XPPtoXPF When this subgrammar is applied t `small clause' will be derived.",
        "The XPPtoXPF subgrammars are partially isomorphic to the XPPtoCLAUSE subgrammars, hence they contain similar corresponding rules.",
        "They contain rules introducing propositional corn• plements, rules determining tense and aspect (which is considered to be present thong' dependent upon superordinate clauses) anc rules dealing with hidden arguments.",
        "CLAUSEtoSENTENCE In this subgrammal nonpropositional arguments are introduced and scope of quantificational expressions is ac• counted for.",
        "Furthermore the 'mood' of a sentence is determined, i.e. it is decided whethee it is going to be a declarative, interrogative relative etc.",
        "clause.",
        "XPFtoXPP This subgrammar is partially iso• morphic to the CLAUSEtoSENTENCE sub.",
        "grammars.",
        "It contains rules to introduce non.",
        "propositional arguments and to account foe scope.",
        "There are 'mood' rules determininE whether the XPP is 'closed' (i.e. there are nc free variables left in the structure), or 'open' (i.e. the subject variable is free)."
      ]
    },
    {
      "heading": "4 ILLUSTRATIONS",
      "text": [
        "The global organization of the grammar will be illustrated here by showing the derivation processes of certain examples involving a categorial mismatch and of some examples of translations from 'small clauses' into full clauses or vice versa.",
        "I repeat that only the generative part of the derivation need be demonstrated given the reversibility of the grammars.",
        "Furthermore only the correct derivation paths through the grammar will be illustrated, though in reality many false paths, i.e. paths through the grammar that do not lead to an actual sentence, are chosen by the grammar.",
        "Since M-grammars are reversible it possible to `translate' from e.g. Dutch into Dutch.",
        "In this way Rosetta functions as a paraphrase generator.",
        "Because of this, the partial isomorphy between two projection subgrammars can (and will) be illustrated by showing the parallel derivation of two paraphrases in generation.",
        "In subsection 4.1 the derivation of hij schaamt zich ervoor and he is ashamed of it will be illustrated.",
        "In subsection 4.2 the derivation of I find him intelligent and I find that he is intelligent will be illustrated.",
        "In subsection 4.3 the derivation of he seems intelligent, he seems to be intelligent and it seems that he is intelligent as paraphrases of one another will be illustrated.",
        "In subsection 4.4 the derivation of de op haar verliefde man and de man die op haar verliefd is as paraphrases of one another will be illustrated.",
        "In subsection 4.5 the derivation of hij zwemt graag and he likes to swim will be illustrated."
      ]
    },
    {
      "heading": "4.1 Adjective-Verb",
      "text": [
        "The derivations of hij schaamt zich ervoor (lit.",
        "he ashamed himself therefor) and its translation he is ashamed of it run as follows.",
        "The verb schamen is a two place verb so that it can be combined with two variables, xi and x2, in the VPPformation subgrammar yielding VPP(xi x2 schaam).",
        "In the English grammar, the adjective ashamed is also combined with two variables in the ADJPPfor-mation subgrammar, yielding ADJPP(xi ashamed x2).",
        "The Dutch verb schamen must realize its second argument as a prepositional object with the preposition voor.",
        "The English adjective ashamed must realize its second argument as a prepositional object as well, though headed by the preposition of.",
        "Pattern transformations are applied to yield this effect: VPP(xi voor x2 schaam) and ADJPF(zi ashamed of x2).",
        "In the VPPformation subgrammar a Voice-rule applies determining that the structure is in active voice.",
        "In the ADJPPformation subgrammar a corresponding rule applies which has no visible effects.",
        "In Dutch a transformation spelling out a reflexive pronoun must apply, since the verb schamen is a so-called inherently reflexive verb.",
        "This yields VPP(xi zich voor z2 schaam).",
        "Since spelling out these reflexive pronouns is achieved by transformations, no corresponding M-rule need apply in English.",
        "These structures are both input to the XPPtoCLAUSE subgrammar where they are turned into clauses.",
        "In Dutch this yields CLAUSE(xi zich voor z2 schaam).",
        "In English the copula be is introduced, yielding CLAUSE(zi be ashamed of z2).",
        "Tense and aspect rules are applied in both cases, putting the structures in present tense, yielding CLAUSE(zi zich voor x2 schaamt) and CLAUSE(zi is ashamed of x2).",
        "Substitution rules substitute the NPs het and it respectively for the variables x2 and the NPs hij and he respectively for the variables xi.",
        "This yields in English CLAUSE(he is ashamed of it) and in Dutch CLAUSE(hij zich voor het schaamt).",
        "An obligatory transformation turns voor het in Dutch into ervoor.",
        "Mood rules are applied in Dutch and in English.",
        "The clauses are turned into declarative main clauses.",
        "In English this yields SENTENCE(he is ashamed of it) and in Dutch this yields SEN-TENCE(hij zich ervoor schaamt).",
        "Application of the transformation putting the finite verb in 'second' position and application of an obligatory topicalization transformation in Dutch yield the actual sentence Hij schaamt zich ervoor."
      ]
    },
    {
      "heading": "4.2 Adjective-declarative clause with main verb",
      "text": [
        "The parallel derivations of I find him intelligent and I find that he is intelligent run as follows.",
        "In the ADJPPformation subgrammar the adjective intelligent is combined with a variable xi yielding ADJPP(x/ intelligent) This ADJPP can be turned either into a clause yielding CLAUSE(x/ be intelligent) (in the XPPtoCLAUSE subgrammar) or it can continue as an adjectival construction (in the ADJPPtoADJPF subgrammar).",
        "Tense and Aspect rules determine that the tense of this construction is dependent on the tense of a superordinate construction yet to be formed.",
        "A substitution rule substitutes the NP containing he for xi yielding ADJPF( he intelligent) and CLAUSE(he is/was intelligent) respectively.",
        "Finally Mood rules determine the way the clause and the ADJPF are realized.",
        "The mood rule forming subordinate declarative clauses is mapped onto the mood rule forming 'closed' ADJPPs (CADJPP).",
        "Applying these mood rules yields SENTENCE(that he is/was intelligent) and CADJPP(he intelligent).",
        "These results can be used later in the derivation as arguments to the verb find.",
        "To derive the rest of the structures the verb find is combined with two variables (x2, x3 ) yielding VPP(x2 find x3).",
        "The substructures built earlier can be substituted for x3 yielding VPP( x2 find he intelligent) and VPP(x2 find that he is/was intelligent) respectively.",
        "After turning these VPPs into clauses and applying tense and aspect rules (putting the sentences in present tense) the tense of the subordinate clause can be determined.",
        "This yields CLAUSE(x2 find he intelligent) and CLAUSE(x2 find that he is intelligent).",
        "Applying a case-assignment transformation and substituting the NP(I) for x2 yields CLAUSE(' find him intelligent) and CLAUSE(' find that he is intelligent) respectively.",
        "Applying a mood rule that turns these clauses into declarative main clauses yields the actual sentences."
      ]
    },
    {
      "heading": "4.3 Adjective-declarative clause with copula",
      "text": [
        "The derivations of he seems intelligent, he seems to be intelligent and it seems that he is intelligent starts in the same way as in the preceding section.",
        "A CADJPP(he intelligent) and a SEN-TENCE(that he is/was intelligent) are generated.",
        "In addition to the mood rule forming finite declarative subordinate sentences a mood rule forming `closed' infinite declarative subordinate sentences containing to can be applied.",
        "This rule forms the SENTENCE(he to be intelligent) out of the CLAUSE(he be intelligent).",
        "These results can be used as arguments to the verb seem.",
        "In the VPPformation subgrammar a VPP(seem x.2) is formed from the verb seem and the variable x2.",
        "The SENTENCEs and the CADJPP obtained earlier are substituted for the variable x2.",
        "This yields the structures VPP(seem he intelligent), VPP(seem that he is/was intelligent) and VPP(seem he to be intelligent) respectively.",
        "A transformation turns the subject of embedded infinitival complements of verbs such as seem into the subject of seem, and the NP(it) is inserted as a subject of the verb seem if it has a finite complement.",
        "After determining tense and aspect and applying a subject-verb agreement transformation this yields the structures CLAUSE(he seems intelligent), CLAUSE(it seems that he is intelligent) and CLAUSE(he seems to be intelligent) respectively.",
        "Applying the mood rule forming declarative main clauses yields the actual sentences.",
        "In the grammar of Dutch parallel derivations can be made.",
        "The CADJPP(hij intelligent) (cf. he intelligent) and the SENTENCEs dat hij intelligent is/was and hij intelligent te zijn (cf. that he is/was intelligent and he to be intelligent resp.)",
        "can be derived.",
        "Some of these results can be used as arguments to the verb schijnen 'seem'.",
        "In the VPPformation subgrammar the verb schijnen is combined with the variable x2 into a VPP(x2 schijn).",
        "The SENTENCEs obtained earlier can be substituted for this variable, but the CADJPP(hij intelligent) cannot, because the Dutch verb schijnen does not take CADJPPs as a complement.",
        "The derivation continues with the two results VPP(dat hij is/was intelligent schijn) and VPP(hij intelligent te zijn schijn).",
        "Application of several transformations to deal adequately with such complements in Dutch (Verb-raising and extraposition (in the sense of Evers(1975)), subject-to-subject-raising and some others) and application of tense and aspect rules yields CLAUSE(het schijnt dat hij intelligent is) and CLAUSE(hij intelligent schijnt te zijn) respectively.",
        "Application of mood rules forming declarative main clauses and some obligatory transformations in Dutch yields the actual sentences Het schijnt dat hij intelligent is and Hij schijnt intelligent te zijn as translations of the English sentences derived earlier."
      ]
    },
    {
      "heading": "4.4 Adjective-relative clause",
      "text": [
        "The derivations of (de) op haar verliefde (man) (the man in love with her) and (de man) die op haar verliefd is (the man that is in love with her) runs as follows.",
        "The adjective verliefd 'in love' is a two-place adjective that is combined with two variables xl and x2 in the ADJPPforma,tion subgrammar.",
        "This yields a structure of the form ADJPP(xi verliefd x2).",
        "The adjective verliefd must realize its second argument (x2) as a prepositional object that can occur in front of the adjective.",
        "Pattern transformations introduce the preposition required, yielding ADJPP(xi op x2 verliefd ).",
        "This ADJPP can be turned into a clause, or it can be turned into an adjectival phrase.",
        "The XP-PROPtoCLAUSE subgrammar changes the structure mentioned in the following way: CLAUSE(xi op z2 verliefd zijn), where the top category has been turned into CLAUSE and the copula zijn `be' has been introduced.",
        "To form an adjectival phrase the ADJPP is input to the XPPtoXPF subgrammar, yielding ADJPF(x/ op x2 verliefd).",
        "In both subgrammars tense and aspect rules apply.",
        "In the CLAUSEtoSENTENCE subgrammar a transformation is applicable that moves the subject variable x1 into a position where normally relative pronouns would appear.",
        "In this particular structure this has no effects on the left-right order, but the relation that xi bears is changed.",
        "In the CLAUSEtoSENTENCE subgrammar and in the ADJPFtoADJPP subgrammar the NP(zij) `she' is substituted for variable x2 and the appropriate Case form (accusative) is assigned to it.",
        "This yields CLAUSE(xi op haar verliefd is/was) and ADJPP(xi op haar verliefd).",
        "Finally Mood rules turn the ADJPP into an `open' ADJPP (OADJPP) yielding OADJPP(xi op haar verliefd), and they turn the CLAUSE into a relative subordinate clause: SENTENCE(xi op haar verliefd is).",
        "These structures can be used by rules in the NP-subgrammar that introduce these structures as modifiers and bind variable x1."
      ]
    },
    {
      "heading": "4.5 Graag-like",
      "text": [
        "In the Dutch sentence hij zwemt graag the adverb graag appears.",
        "This adverb must be mapped onto the English verb like in the translation he likes to swim.",
        "It is assumed that the Dutch adverb graag is a two place-function.",
        "This is required in Rosetta, because its translation like is a two-place function4.",
        "However, apart from being required in Rosetta, it is also plausible for independent reasons that graag is a two-place function: the adverb graag imposes selectional restrictions upon the subject of the sentence it appears in (cf. ?het regent graag or ?de steen valt graag, which are as odd as their English counterparts ?it likes to rain and The stone likes to fall).",
        "If we assume that predicates impose selectional restrictions only upon their arguments, then it must be the case that the subject of the sentence is an argument of graag, or that the argument of 4 This contrasts with the approach in the Eurotra framework, where this requirement does not hold.",
        "See Arnold et.",
        "al.",
        "(1988) graag is coindexed with the subject of the sentence.",
        "I will assume the latter.",
        "Starting with the subordinate infinitival clause in English, we combine the verb swim, which takes one argument, with a variable x1 as its subject, yielding: VPP(xi swim) Similarly in the Dutch grammar the translation of swim, zwem, is combined with xi: VPP(xj, zwem) In the VPPformation subgrammar the voice rule to form active clauses is applied.",
        "After the VPPformation subgrammar the derivation continues in the XPPtoCLAUSE subgrammar.",
        "An M-rule to make the sentence infinitival is applied.",
        "Corresponding rules are applied in the XPPtoCLAUSE subgrammar of Dutch.",
        "In the CLAUSEtoSENTENCE subgrammar no arguments are substituted.",
        "In English a rule is applied that makes the clause an infinitival subordinate clause containing to and containing a free variable in subject position which will later be subject to control transformations.",
        "This yields a structure of the form SENTENCE(xi to swim) In Dutch a corresponding rule is applied that makes the clause an infinitival subordinate clause without to with a free variable in subject position.",
        "This yields the following structure in Dutch: SENTENCE(xi zwemmen) These structures will be used later on.",
        "In the VPPformation subgrammar of English the two-place verb like is combined with two variables, xi and x2.",
        "This yields: VPP(xi like x2) The voice rule to form active sentences is applied.",
        "Correspondingly, in the ADVPPformation subgrammar of Dutch the adverb graag is combined with two variables, x1 and z2, and a voice rules is applied.",
        "This yields: ADVPP(xi graag x2) In the English subgrammar XPPtoCLAUSE the sentential structure derived above is substituted for the variable x2, yielding: VPP(xi like xi to swim].)",
        "A control transformation deletes the second occurrence of xi.",
        "Tense and aspect rules apply which turn the structure into a finite clause in present tense.",
        "In the Dutch subgrammar XPPtoOLAUSE the sentential structure derived above is substituted for the variable x2 by a special rule that takes care of substitution of sentential complements into AD-VPPs.",
        "This special rule deletes the ADVPP node and replaces it by a VPP node, turns the ADVP into a modifier inside this VPP, makes the VP of SENT the VP of this VPP, deletes the variable xi inside SENT and undoes the morphological effects of tense rules.",
        "This yields the structure: VPP(xi",
        "These structures continue their normal derivation.",
        "Tense and aspect rules apply, the NP argument hij (he) is substituted for xi and the sentence is made into a declarative main clause, yielding in English: SENTENCE(he likes to swim) and in Dutch, after application of the transformation of 'Verb second' and an obligatory topicalization transformation: SENTENCE(hij zwemt graag)"
      ]
    },
    {
      "heading": "5 CONCLUSION",
      "text": [
        "It has been shown that the concept of partial iso-morphy between subgrammars makes it possible to translate between words of different syntactic categories and between 'small clauses' and full clauses in a systematic way.",
        "Furthermore, it has been shown that one of the most difficult cases of translation between words of different categories, viz. the graag/ like translation problem, can be reduced to having only one special rule, given partial iso-morphy between subgrammars."
      ]
    },
    {
      "heading": "ACKNOWLEDGEMENTS",
      "text": [
        "This paper is based on joint work being done in the Rosetta machine translation project.",
        "I would like to thank Lisette Appelo, Jan Landsbergen, Mar-greet Sanders and Andre Schenk for many valuable comments on earlier drafts of this paper."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
