{
  "info": {
    "authors": [
      "Thomas R. Hofmann"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-2030",
    "title": "Why There Must Be a Semantic Representation (Over and Above Any Cognitive Network)",
    "url": "https://aclweb.org/anthology/C82-2030",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "text": [
        "A semantic representation (or a semantic network; Mel-auk, Seuren, Hofmann, Sgall, ...) cannot be dispensed with in a model of language comprehension which incorporates a representation of knowledge, commonly called a cognitive network (e.g. Quillian, Lamb, Shank, Hays, Jaokendoff, ...).",
        "We shall demonstrate this in several ways, claiming to resolve the contention between those wno claim they are necessary (the lst camp above) and those who would claim that they can be dispensed with, the 2nd camp, including also Montague, who uses them for\"convenience only\".",
        "First, and moat intuitively, is the observation that one oan and commonly does understand a description of something (e.g. a scientific theory, or a political tract) which one knows or believes to be at variance with the facts.",
        "This suggests that in-taken information is kept apart from general knowledge, until such time as one decides to accept it ea true.",
        "Cognitive networks can, however, be augmented to account for this by annotating arcs by their (epistemic) source, though this is a bit unrealistic for most human use of language - we seldom know the source of some believed fact.",
        "A 2nd demonstration is to note that the normal person \"knows\" of many different worlds, where facts are at variaa-co; with those of an other world.",
        "As a scientific example, Riemanian and Eucledian geometries are such contrary worlds, - 134 - as are any pair of competing theories.",
        "For more ordinary examples, most English speakers know of at least 4 different worlds, containing different objects, different possibilities, and so on: the world of Greek mythology (containing unicorns, gods, etc.",
        "), the world of Sherlock Holmes (with a certain Dr Watson, a Baker St, ...), the world of James Bond, and the \"real\" world.",
        "As for the real world, one's interlocutor often has a different version of it, which must be known to understand his speech.",
        "Now, if one must incorporate in himself knowledge of 4 or so distinct worlds (and I would suggest it is closer to 40 than 4), then we may say he has as many cognitive networks, of various degrees of detail and completeness.",
        "These networks may be represented as conflated into one super cognitive netv work, with sufficient special marking of the type suggested above (extended to nodes, also), but such a conflated network can always be decomposed into separate ones for the various worlds, if it is adequately marked to model human behaviour.",
        "If then there are a number of distinct cognitive networks needed for understanding ordinary human speech, there is no reason not to add 1 more for the conversation currently in progress.",
        "This is no more nor less than a semantic representation, except as we shall observe below, it differs in structure and function.",
        "A tighter, but longer and more difficult, demonstration is to show that \"inferencing\", which is roughly equivalent to moving through a cognitive network, is NOT undertaken until the semantic operation of integration is attempted.",
        "This operation, which combines the semantic contributions of sentences together, depends heavily on a principle whereby each successive sentence is interpreted in the most redundant way possible, so that it \"overlaps\" as much as possible with the content of the previous sentences.",
        "- 135 - With this principle, we can show that inferenoing appears to be undertaken only when integration is blocked for lack of overlap of the expressed meanings of the component sentences.",
        "(Inferenoing is of course required for argument, for determining truth of an assertion, or for otherwise applying the comprehension of a language act against the world.)",
        "These \"expressed meanings of the discourse\" are nothing more than their semantic representation, which we have thus shown to be necessarily held distinct from background knowledge used in inferenoing, represented in a cognitive network.",
        "We can conclude, then, that in some form or other, a representation of the semantic effects of the sentences is needed to account for how discourses are understood.",
        "Although this semantic representation may be conflated (in a computer, e.g.) with a cognitive network, it is logically distinct, and may be profitably so-treated.",
        "This semantic representation, we may observe, is dist-inot from the ordinary cognitive network in being extremely undetailled containing mostly syntagmatic rather than paradigmatic relationships, and very malleable, and it has a priviledged position in the interpretation of language acts.",
        "It is also used primarily, at speech time, as a depository, with perhaps no inferenoing, while a cognitive network as generally understood receives perhaps nothing at speech time, but is used primarily for inferenoing.",
        "Thus they appear to be quite distinct in contents,-function and usage."
      ]
    }
  ]
}
