{
  "info": {
    "authors": [
      "Vaclav Polak",
      "Nadezda Polakova"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-2058",
    "title": "Operation Logic - A Database Management Operation System of Human-Like Information Processing",
    "url": "https://aclweb.org/anthology/C82-2058",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "heading": "OPERATION LOGIC - A DATABASE MANAGEMENT OPERATION SYSTEM OF HUMAN-LIKE INFORMATION PROCESSING",
      "text": [
        "Vdclav Polak and Nadada Poldkova (in memoriam) Zdvod vg.po6etni techniky aSAD, Brno, Czechoslovakia The paper contains the description of a database management computer operation system called operation logic.",
        "This, system is a formal logic with well-defined formulas as semantic language clauses and with reasoning by means of modus ponens rules.",
        "There are four frames - CLAUSE, QUESTION, PROBLEM, SYSTEM.",
        "Each of these frames is processed by one program.",
        "By means of these programs it can be realized understanding of any clause, answering any reasonable question, solving any reasonable problem and understanding any organizational structure.",
        "Some algorithms of operation logic are described and examples of clauses are exhibited.",
        "Our approach is the following: (1) Information processing of subJects.",
        "Material objects are anorganic objects or organic ones.",
        "They are also non-live objects or live ones.",
        "Live objects reproduce themselves autonomously.",
        "Live objects are organic individuals or artificial ones.",
        "Organic individuals are one-cellular or multicellular.",
        "They are also heterotrophic (they consume organic objects) or autotrophic (they consume anorganic objects only).",
        "Multicellular autotrophic organic individuals are called plants.",
        "Multicellular heterotrophic organic individuals are called sublects.",
        "Plants have no moving organs and no consciousness.",
        "They do not need them.",
        "Subjects have moving organs and consciousness.",
        "They need them for searching, hunting and escape.",
        "Each subjects has general knowledge database.",
        "It contains information - 234 - about types of scenes (called image-frames) in the form the scenes are seen by the subject by its eyes, but in a very simplified form.",
        "It contains also sequences of scenes (called sceneries) representing rules (called modus ponens rules) according to which changes in the universe are realized.",
        "Each subject has concrete knowledge database representing history of life of the subject and image-frame of actual scene.",
        "Each subject constructs possible scenes and realizes programmed behaviour of itself.",
        "Each subject has information processing database management operation system having both above databases in long term memory and processing actual knowledge in short term memory.",
        "A subject is called human, if it is able to describe scenes by means of processes (i.e. to decode image-frames into formulas (called clauses) representing processes) and if it constructs new clauses from the old ones by means of modus ponens rules (called reasoning).",
        "Subjects with consciousness without above properties are called animals.",
        "Humans operation system for information processing is called operation logic, humans clauses form • system called semantic language.",
        "Humans have the ability to exchange information among themselves by means of clauses (such activity is called dialog).",
        "We have thus the following stages of information processing: First there are anorganic objects only.",
        "Then organic objects appear by a random.",
        "Then by means of natural selection one-cellular heterotrophic organic individuals (bacteria) appear.",
        "From bacteria one-cellular autotrophic organic individuals are developed (cyanophycae).",
        "From bacteria more sophisticated one-cellular heterotrophic protozoa are developed and by symbiosis from protozoa and cyanophycae one-cellular autotrophic algae appear.",
        "From algae plants are developed and from protozoa animals.",
        "From animals humans are developed (namely because of necessity of exchange information in social production activities).",
        "(2) Semantic language clause.",
        "In each scene there are individuals (like TREE, JOHN, FEAR) and processes (like TO-GO,",
        "TO-EXPLAIN).",
        "Names of individuals are called atomic individuals (or nouns), names of processes are called verbs.",
        "In each process participating individuals play certain roles (called individual members) like (TO-GO WHO WITH-WHOM), (TO-EXPLAIN WHO WHAT TO-WHOM).",
        "Individuals have properties (like BLUE, EMPTY).",
        "Processes have properties (like QUICKLY, DAILY).• Properties of individuals are called attributes, properties of processes are called adverbs.",
        "Names of attributes are called atomic attributes (or adjectives), names of adverbs are.",
        "called atomic adverbs.",
        "There are several types of adverbs (called adverbial members), each of them describes the circumstances the process is realized.",
        "The process.is realized in euclidean three dimensional space (WHERE-PLACE,WHERE-NEAR, WHERE-FAR, WHERE-INSIDE, WHERE-OUTSIDE, WHERE-BESIDE, WHERE-LEFT, WHERE-RIGHT, WHERE-BEFORE, WHERE-BEHIND, WHERE-BELOW, WHERE-ABOVE, WHERE-AROUND, WHERE-AMONG, WHERE-BETWEEN, FROM, TO, VIA, DISTANCE) in linear time scale (WHEN-ANTERIORITY, WHEN-SIMULTANEITY, WHEN-POSTERIORITY, BEGINNING, END, FREQUENCY, DURATION) under validity of several modus ponens rules (CAUSE, RESULT, PURPOSE, CONCESSION) with instruments (BY-MEANS-OF) and according to algorithm types (BY-WHAT-WAY, INTENSITY, RESEMBLING).",
        "Hence we have (ATOMIC-INDIVIDUAL (ATTRIBUTE (K))K) for individuals (such form is called compound individual) and (VERB (INDIVIDUAL-MEMBER(I))I (ADVERBIAL-MEMBER(J))0 for processes i.e. for clauses.",
        "Modus ponens rules are of the form (IF CLAUSES THEN CLAUSES).",
        "Individual can be atomic individual, compound individual, process-as-individual clause, meta-level clause.",
        "Adverb can be atomic adverb, individual, adverb-defining clause.",
        "Attribute can be atomic attribute, individual, attribute-defining clause.",
        "To each clause some information about the whole clause belongs (called clause parameters).",
        "Individual members and adverbial members are palled clause members .",
        "Hence we have (VERB CLAUSE-MRMBRRS CLAUSE-PARAMETERS).",
        "- 236 - (3) Clause parameters.",
        "(a) Contextuality.",
        "Because of existence of short term memory one must distinguish in each clause the old knowledge (called 1011) and the new one (called focus) receiving thus either (TOPIC-VERB TOPIC-CLAUSE-MEMBERS FOCUS-CLAUSE-MrmARRS) or (FOCUS-VERB TOPIC-CLAUSE-MEMBERS FOCUS7CLAUSE..MEMBEAS).",
        "(b) Tense: Because individuals, adverbs and attributes can be clauses, we have for each clause a graph tree with clauses as vertices and to-be-superior-clause-of as edges.",
        "One needs only relative binary time relations (interiority, simultaneity, posteriority).",
        "We consider time of construction of the clause and time of clause process realization.",
        "Time of construction of meta-level clause is the time of process realization of the superior clause.",
        "Time of construction of clause of other types is the time of construction of its superior clause (or in the case of top clause - the time of sending it by sender).",
        "Other binary time relations (if needed) can be given by time adverbs.",
        "(c) Quantifiers: The simplest way in using quantifiers is to have only ALL and SOME with areas given in attributes.",
        "(d) Tot: The negation is used only in building scenes:",
        "We have old knowledge about scene.",
        "We expect new knowledge.",
        "We add new knowledge.",
        "We negate expected but untrue knowledge.",
        "Prom this we have the following: either we negate new expected focus (i.e. focus with or without verb) or we negate topic verb only.",
        "(e) Aspect.",
        "iterativness.",
        "extension.",
        "process realizatiel Each process according to its completness can be COMPLETED or NOT-COMPLETED, according to its iterativness REPEATED or NOT-REPEATED, according to its relation to a certain time moment IMMEDIATE or EXTENDED and according to its realization REAL-PROCESS, UNREAL-PROCESS-POSSIBLE-SCENE-DEFINING or UNREAL-PROCESS-POSSIBLE-SCENE-NOT-DEFINING.",
        "- 237 - (f) Subjective modality: (CERTAINTY: I know that CLAUSE), (HOPE: I suppose that CLAUSE), (INDETERMINATION: I don't know that CLAUSE), (DOUBT: I suppose that NOT-CLAUSE), (NEGATION: I know that NOT-CLAUSE).",
        "(g) Emotionality: (OBJECTIVITY: I am indifferent to realize CLAUSE), (PLEASURE: I want CLAUSE, I know that CLAUSE), (LONGING: I want CLAUSE, I suppose that CLAUSE), (PEAR: I want CLAUSE, I suppose that NOT-CLAUSE), (ANGER: I want CLAUSE, I know that NOT-CLAUSE, It is CLAUSE(T) if NOT-CLAUSE, I don't want CLAUSE(1), It is NOT-CLAUSE(1) if NOT-CLAUSE and CLAUSE (2), I strive to realize CLAUSE(2)), (REGRET: dtto like for anger but I don't strive to realize CLAUSE(2)).",
        "(h) Objective modality: (NECESSITY-WITH-SOURCE-AGENT): Agent A is indifferent to",
        "CLAUSE; A realizes CLAUSE(1) if NOT-CLAUSE, A doesn't want CLAUSE(1)), (NECESSITY-WITH-SOURCE-NON-AGENT: Non-agent B is superior to A, B realizes CLAUSE(1) if A doesn't realize CLAUSE, B wants CLAUSE, A is indifferent to CLAUSE, A doesn't want CLAUSE(1), B appeals to A to realize CLAUSE), (NECESSITY-WITH-SOURCE-ENVIRONMENTAL-CIRCUMSTANCES: A is indifferent to CLAUSE, One realizes CLAUSE(1) if A doesn't realize CLAUSE, A doesn't want CLAUSE(1)), (NECESSITY-WITH-SOME-SOURCE: At least one type of necessity is given), (POSSIBILITY-WITH-SOURCE-AGENT: Inner circumstances of A are complete for CLAUSE), (POSSIBILITY-WITH-SOURCE-NON-AGENT: B is superior to A, B agrees to realize CLAUSE, B realizes CLAUSE(1) if A realizes CLAUSE and B doesn't agree to realize CLAUSE, A doesn't want CLAUSE(1)), (POSSIBILITY-WITH-SOURCE-ENVIRONMENTAL-CIRCUMSTANCES: Environmental circumstances are complete for CLAUSE), (POSSIBILITY-WITH-ALL-SOURCES: All types of possibilities are - 238 - given), (WILL-WITH-SOURCE-AGENT: A wants CLAUSE, A strives to realize CLAUSE).",
        "Objective modality = nth objective modality ((n-1)-th objective modality (...(1-th objective modality) ...).",
        "(i) Global modality: INFORMATION, FIND-TRUTH-VALUE-QUESTION, FIND-X-VALUE-QUESTION, COMMAND, PROHIBITION, REQUEST, ADVICE.",
        "(j) Database position: VIEWPOINT.",
        "(4) Understanding .",
        "Clauses are grouped into role-pairs (WHY-ROLE-CLAUSE •BOW-ROLE-CLAUSES), modus ponens rules, scenes and denote-clauses.",
        "Content of clauses is given by means of such grouping.",
        "It enables to operate with vague notions and even with contradictions.",
        "Each system, say S, is described by input and output of structures, energy and records, by structures as means and records as database, by scenes and by role-pairs, where why-roles are the roles being fulfilled by S and how-roles are why-roles of subsystems of S. Understanding of very large systems and semantic mathematical analysis of anthropoecosystems is realized by the binary relation to-be",
        "-subsystem-of defined by role-pairs on SYSTEM's. Example: (ROLE-PAIR(24): (WHY-ROLE: (TO-RECEIVE (WHO: IT) (WHAT: GLUCOSE))) (HOW-ROLE(1): (TO-REALIZE (WHO: IT) (WHAT: PHOTOSYNTHESIS)))) - 239 -"
      ]
    }
  ]
}
