{
  "info": {
    "authors": [
      "James Bradford"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-1007",
    "title": "A Metric Space Defined on English and Its Relation to Error Correction",
    "url": "https://aclweb.org/anthology/C82-1007",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "text": [
        "A distance function is proposed that maps pairs of strings to the real numbers.",
        "It has been shown that given suitable constraints the function is a metric over the free monoid generated from a set of grammatical symbols.",
        "The necessary constraints modify the metric so that it maps pairs of strings to a lattice of real numbers.",
        "Thus for each string the metric defines a countable set of nested neighbourhoods.",
        "This aspect of the space has proved useful for the correction of certain kinds of grammatical errors that occur in English sentences.",
        "An English parser was written that used the metric to propose corrections to a variety of ungrammatical sentences.",
        "Experience with the program suggests that in many cases the intuitive notion of grammatical similarity corresponds closely to the mathematical definition of nearest neighbour in the space."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Consider a string of grammatical symbols which has been produced by lexical analysis.",
        "Each symbol in the string corresponds to a word in the original sentence.",
        "The string will be analysed by a parser which compares the sequence of symbols to sequences specified by some grammar, G. If the comparison succeeds then the original sentence is accepted as grammatical.",
        "_Otherwise, it is rejected and error correction is required.",
        "Definition: Given a grammar G and a string S composed of grammatical symbols from some alphabet A then S is ungrammatical if it is not contained in L(G), the language generated by G. Ungrammatical in this sense refers to any sentence that was not anticipated by the grammar.",
        "In many systems it is possible for a user to produce a proper English sentence within the appropriate domain of discourse and still have the sentence rejected by the parser.",
        "This is usually attributed to \"holes in the grammar.\" This paper will describe a technique for correcting ungrammatical input.",
        "The class of errors treated includes both genuine grammatical errors and those resulting from \"holes.\" One of the assumptions tested by this work is that a significant class of errors can be resolved by examination of syntactic structure alone.",
        "44J.",
        "BRADFORD An ungrammatical sentence is viewed as a grammatical sentence that has been transformed by one or more error operations.",
        "Definition: An error-operation involves either (a) an insertion of a word, Obl a deTeTran of a word, or Cc) an alteration of the word sequence.",
        "In general, the damage done by a single error operation is local and does not significantly alter the global structure.",
        "Thus a comparison of the respective structures of the two sentences is used as the basis for a measure of their similarity.",
        "This ap-.",
        "proach is based on earlier work by Fischer and Wagner.",
        "1 The error correction strategy rests on a measure which expresses structural similarity as a numerical distance.",
        "If the parser's analysis of a of a given sentence fails then a search.",
        "is made for its nearest grammatical neighbour.",
        "As various alternatives are found they are presented to the user.",
        "The user may elect to continue the search, accept the corrector's proposal or abandon the search and rephrase the input.",
        "The class of errors that can be corrected by a measure of structural similarity are those related to word arrangement.",
        "Word arrangement is described by an augmented transition network in which the conditions on the arcs are totally relaxed.",
        "Such a net is called a recursive transition network and it defines a context free language?",
        "Thus the class of errors treated by this technique are called context free errors."
      ]
    },
    {
      "heading": "2. The Measure - Informally",
      "text": [
        "The basis of the distance function is a value called the transformation cost.",
        "In essence the transformation cost gives an indication of the number of changes required to convert one string of grammatical symbols into another.",
        "The changes are considered under two categories, rearrangement and edition.",
        "The cost of a transformation is the sum of the cost of rearrangment and cost of edition.",
        "The rearrangement cost measures the amount of disorder of one string relative to another.",
        "Many definitions are possible but most yield asymmetrical costs.",
        "One that does not, considers common sub strings between the two given strings.",
        "The cost is based on the number of gaps between the substrings.",
        "For example, if the two given strings match exactly then the rearrangement cost is zero because the two strings match without gaps.",
        "The edition cost considers the symbols that occupy the gaps between substrings.",
        "In order to transform one string into another the symbols not part of common substrings in the first must be removed and those in the second that are not common must be inserted into the first.",
        "The edition cost is the sum of the costs of insertion and deletion.",
        "Clearly the potential for asymmetry exists here as well.",
        "However, if the cost of insertion is equal to the cost of deletion for any given symbol then symmetry follows as a consequence.",
        "The most significant element of the formal description of Eta's distance measure is the concept of a match set.",
        "Suppose we consider two sequences of words (actually strings of grammatical symbols, A METRIC SPACE DEFINED ON ENGLISH45 each corresponding to a word).",
        "The A-sequence will be the input and the B-sequence will be a sentence in the grammar - henceforth called the test sentence.",
        "Thus a match set M with respect to A and B describes a pairing between words in the input and words in the test sentence.",
        "If the two sentences match exactly and are both of length n then the match set denoting the best match will be: (1,1),(2,2), ...,(n,n).",
        "Notice that the integers comprising each ordered pair are the positions of words in the two respective sentences.",
        "The rearrangement cost (which measures the disorder of one sentence relative to another) is computed from M. Although the cost is related to the number of common substrings of words shared by the two given sentences the actual cost is computed by counting gaps between substrings.",
        "For example, suppose two sentences have no words in common.",
        "Since there are no shared substrings the word order of the two sentences are not related and thus the rearrangement cost is zero (hence the entire transformation cost will derive from the edit cost).",
        "If the two sentences were identical then in this case as well there will exist a match set yielding a rearrangment cost of zero.",
        "The edit cost is also computed from the match set M. In a manner similar to the Fischer/Wagner measure it is assumed that each grammatical symbol has two associated unit costs, the cost of insertion and the cost of deletion.",
        "The underlying idea is WiE after the IiipTut has been rearranged to match the test sentence then nonmatching symbols in the input are removed and unmatched symbols in the test sentence are inserted into the modified input.",
        "In practice it is the sum of the unit costs that is used as the edit cost.",
        "Because of the nonnegativity and nondegeneracy requirements for a metric the unit edit costs must be positive.",
        "3.",
        "The Measure - Formally Notation 1.",
        "If A is a set then the cardinality of A is denoted 1A1.",
        "2.",
        "If m = (i,j) is an ordered pair of integers then D(m) = i and R(m) = j 3.",
        "If S = sl,...,s is a sequence of symbols then s<i' = s. where 1.1j.11 Match Set, M given strings then a match set M with respect to A of ordered pairs of integers with the following pro n EM and rail then 1.",
        "D(m)E[1, All 2, D(m) D(n) 3.",
        "R(m)E[1,1B1] 4.",
        "R(m) R(n) 5. m=(a,b).4-A<a>=B<b>",
        "If M is a match set with respect to two strings A and B and if 1A1 = a, 1131=b and (i,DEM then succ((i,j)) = (i+al,j+b1) Recall that the rearrangement cost is based on the number of gaps between substrings.",
        "A gap is detected by means of a successor function.",
        "The successor of an ordered pair is the pair produced by incrementing each element of the initial pair by 1.",
        "Thus the successor of (2,3) is (3,4).",
        "An unusual aspect of the successor function is that for any given sentence, the first word is defined to be the successor of the last.",
        "For example, if the length of the two sentences was n, then the successor of (n,n) is defined to be (1,1).",
        "A metric must yield a distance from a string to itself of zero.",
        "This is the reason underlying the successor function's \"wrap around\" characteristic.",
        "Definition 4Gap Set, G If M is a given match set then G is defined by G=0111 mEMAsucc(m)10} Definition 5Rearrangement Cost, (2(M) If M is a match set and G the associated gap set then Q(M)=IGI Convention 1 states that the cost of inserting or deleting any grammatical symbol is constant.",
        "In other words the cost of a unit edit operation is independent of the symbol being edited.",
        "Convention 1Let be an alphabet of symbols and c be a positive real constant.",
        "Convention 1 requires VscEyINS(s)=yDEL(s)=c Recall that the edit cost between two strings A and B is based on the unit costs of inserting and deleting symbols not common to both strings.",
        "A definition of the edit cost, r(A,B,M) based on this is given in reference 3.",
        "For two strings A and B and a given match set M,Lemma 1 establishes the equivalence of a more convenient definition.",
        "The proof of Lemma 1 is also given in reference 3.",
        "Lemma 1If M is a match set with respect to two strings A and B and if convention 1 is in force then r(A,B,M)=0A1+1B1-2iMpc"
      ]
    },
    {
      "heading": "4. Conclusions",
      "text": [
        "A program called Eta (for Error Tolerant Analysis) was written to test the effectiveness of the measure.",
        "For a given grammar, G the program searches the metric space in the neighbourhood of the input until a sentence contained in L(G) is found.",
        "This sentence is given to the user for confirmation.",
        "If the program's proposal is rejected then the search is continued.",
        "The neighbourhood searched by the program consists of the set of strings of grammatical symbols within a given distance of the input.",
        "By progressively enlarging this distance a partial ordering is applied to the strings in L(G).",
        "Thus the user sees alternatives from \"near\" (structurally similar to the input) to \"far\" (structurally dissimilar).",
        "Experience with the program suggests that many common grammatical errors can be corrected by relatively short dialogues with the user.",
        "Frequently an acceptable alternative is proposed within three or four interactions.",
        "The extent to which the alternatives proposed by Eta are \"likely\" is, of course, subjective.",
        "Nevertheless, the measure does yield alternatives that are structurally similar to input that would otherwise 48J.",
        "BRADFORD defy analysis.",
        "In the majority of the cases seen, grammatical errors do leave much of a sentence's structure intact.",
        "Since there is no fixed limit on the number of alternatives that may be presented even pathological cases are correctable with patience."
      ]
    }
  ]
}
