{
  "info": {
    "authors": [
      "Kenji Araki",
      "K. Hinatsu",
      "K. Itayama",
      "T. Sahara",
      "Y. Sakagami",
      "F. Takano"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-2004",
    "title": "Development of Basic Practical Techniques for Japanese Letter String Processing - Automatic Keyword Extraction and Automatic Reading",
    "url": "https://aclweb.org/anthology/C82-2004",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Japanese is a peculiar language among the thousands of languages in the world.",
        "There exist only two of the same class; Japanese and Korean.",
        "Japanese is written both in Chinese characters (ideograph) and in Kana (Katakana and Hiragana phonetic symbols) in mixture without any apaoe.",
        "Moreover, Chinese characters in Japanese have, in moat cases, several readings and play several roles depending on the context and letter string characteristics.",
        "So for written Japanese, it was very diffioult to segment letter string and extract adequate terms from sentence and to give them correct readings automatically, which are indispensable for terminology, automatic reading, automatic indexing, keyboarding from on-line terminals otherwise more than 2,000 character keyboard is necessary.",
        "The authors invented efficient algorithm and-developed computer programme and dictionaries for successful solution of the problems above for the first time in Japan.",
        "The system consists of two subsystems called K-KACS (Kanji-Kana Automatic Conversion System) and JAKAS (Japanese Keyword Automatic Selection).",
        "Some Chinese characters act both as suffix, preffix or preposition and as parts of meaningful words.",
        "We comprehensive 21 - ly collected such characters (about 500) and those terms in ►hioh the characters are included not as fixes or prepositions but as important part (about 8000 words).",
        "Letter string which is matched with dictionary term is passed but the letter remained and coincides with the special character itself is cut, In case of long letter string without such special letter, sentence is cut by those terms of dictionary which are thought to be definite within reasonable amount.",
        "That is: dog liver nucleus DNase",
        "indefinite type of word.",
        "definite type of word.",
        "Equally, among the variety of readings - in some cases more than 8 - some are special and definite and others are indefinite but obey to rules.",
        "We collected these special readings (about 25,000) for about 2,000 Chinese characters and developed algorithm and programme to select the correct reading for each Chinese character with the precision higher than 99.94 %.",
        "As the dictionary is small enough and login is simple, implementation and maintenance are relatively easy and the speed is very high.",
        "JICST adopted this system for its information file production and services of more than 400,000 citations per year and save costs.",
        "By the development of the techniques, processing of Japanese has become to be able to cope with western languages.",
        "We were awarded for the work The Prize of Learning of Japan Association of Information and Documentation in 1980, and have applied patent (Japan Patent Kokai Shows.",
        "55 (1980) - 102074).",
        "- 22 -"
      ]
    },
    {
      "heading": "Information File of JICST",
      "text": [
        "reading lup-word pasting by thesaurus - 24 -"
      ]
    }
  ]
}
