{
  "info": {
    "authors": [
      "Jan Sabrsula",
      "Jitka Svobodova",
      "Jaroslav Svoboda"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-2068",
    "title": "Some \"Informational\" Languages and Models - A Semantic View",
    "url": "https://aclweb.org/anthology/C82-2068",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "text": [
        "• SOME \"INFORMATIONAL\" LANGUAGES AND MODELS.",
        "- A SEMANTIC VIEW Jan gabriula, Jitka Svobodovd, Jaroslav Svoboda Faculty of Philosophy, Charles University, Prague, Czechoslovakia (1) In natural languages as well as in any other sign system code signs (semis) are to be distinguished from epi-semia (enunciative signs).",
        "In artificial (\"informational\") systems signs are subject to asymmetric dualism involving the necessity of synergy of semia in a comparatively insignificant measure when compared with signs in natural languages.",
        "On the other hand, a measure of assymetry may be established, for example, in some constituents of the traditional language of arithmetic where even the phenomenon of \"double articulation\" of signs is encountered, plemes functioning - to a limited extent - as pleremes or Benda.",
        "On this occasion, we rely on the common definition of the term pleme as a constituting element of the expression, a sort of subsymbol, dldment de 1°expression (cf. J. Pohl, Word 23, 453-468).",
        "A new definition of pleme is given on this occasion: pleme absolute, relative (semi-symbol),.",
        "The pleme constituting the cipher (Number, quantity) semia is strongly dependent on the syntactic synergy: This dependence is the larger the lower is the particular numeral notation.",
        "Both constant mathematical signs and constant signs of some other \"formalized\" languages have their specific sign - 277 - basis, whereas variable symbols possess a very vague meaning of mere \"cipher-representatives\" or \"number-representatives\", without any own defined, precoded systemic and specific denotation.",
        "Grouped together into organized structures, variable.",
        "symbols can function as abstract episemia (elementary and complex), and thus as elementary models, only for an (advised) recipient capable of using certain \"algorithms\" for replacing symbols by constant signs or of transferring them into signs of natural language.",
        "The icon and symptom act as episemia for an advised recipient.",
        "We can imagine a number of logical or arithmetical languages which can operate - each with regard to all others - as metalanguages.",
        "At the same time, translation algorithm may sometimes be rather complex in view of typological differences between such systems, e.g. in the bicipher (two-figure) numeral notation, syntactical synergy and linear arrangement of plemes are encountered in a very profuse measure when compared to, for example, the decimal notation where the symbol 0 when placed to the right of a figure serves to multiply it by 10.",
        "The principle of cipher plemes is very economic: 3 plemes may have 6 permutations (3!",
        "= 6), 4!",
        "- 24, 51 = 120, 6!",
        "- 720, 10!",
        "= 3 628 000, but plemes as letters do not constitute semia in every permutation, e.g. la, all, sia, lae, lea.",
        "(2) We distinguish the \"functional style\" and the \"functional language\" (technical, scientific, logical, arithmetical...) based on the structural features which refer to the totality of the devices of expression, to the structural organization of the totality of the devices of expression: strata, registers, sub-systems, sub-languages, sub-codes, varieties, \"special languages\".",
        "-278-Scientific subsystem and \"artificial\" system can be examined not only in contrast to other subsystems (vertical - \"social\", horizontal - \"professional\", regional..., of.",
        "J. Svobodova-Chmelovg, Beitrige zur romanisohen Philologie, 1211, Berlin 1974, Heft 1/2, 217-229) of the same language, but also in relation to the scientific subsystems of other languages.",
        "(3) Arithmetical language, Morse code (with specific merismatical level), conventional symbols used in transmitting messages by flags, et cetera, can be, entirely or partially, internationalized,' but also \"idiolectized\".",
        "In a natural language, some signs or categories of signs (e.g. Shifters, Tense, \"Verbal\" Aspects, cf. J.",
        "8., IN: Prague School of Linguistics..., London, Oxford Univ.",
        "Press 1972, 95-111) denote or, rather, designate the speaker's subjective conception of ontological reality rather than objective measurable values.",
        "A simple example taken from planimetry inspires us to examine - even while using mathematical language notation - the problem of relations between reality, or a model (whether mathematical or physical) of reality, or else various potential conceptions of the same reality.",
        "(4) In conclusion, the problem of relations between varying degrees of designation of the same real situation as well as the problem of the relation between its designation by means of mathematical expression and one in a natural language is illustrated on a mathematical model of meteorological situation while taking into account the concept of a fuzzy set.",
        "As far as the transfer and difusion of the atmospherical pollution is concerned, we describe them in two different languages (Lagrange, Euler), which represent a problem, both mutually, as, well as in the moment while being interpreted into a natural language.",
        "And it is by solving this problem (\"algorithmsTM, list of instructions, organigram defined by Jaroslav Svoboda) that we want to avoid both distortion and the complete loss of information."
      ]
    }
  ]
}
