{
  "info": {
    "authors": [
      "Istvan Batori"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-2005",
    "title": "Subordinate Clauses and Belief - Domains in Verbal Information Processing",
    "url": "https://aclweb.org/anthology/C82-2005",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "heading": "SUBORDINATE CLAUSES AND BELIEF - DOMAINS IN VERBAL INFORMATION PROCESSING Istvdn Bdtori",
      "text": [
        "EWH Koblenz, Seminar fUr Informatik, Sehwerpunkt Linguistik Rheinau 3-4, D-5400 Koblenz There is agreement among linguist*, logicians and computer linguists on the treatment of belief-statements as embedded, hierarchical structures.",
        "On the syntactic level of analysis linguists treat belief-statements as subordinate clauses (S-over-S-structures, LYONS 1977, KAPLAN and BRESNAN 1981, eto.).",
        "On the semantic level of analysis, following the logio-al tradition, they are manifested as predicate formulae, in which full propositions are used as arguments in higher predicates (e.g. CRESSWELL 1973).",
        "In computational treatments accordingly the recovery of the hierarchical propositional structures is considered as primary objective: The information conveyed by a belief-statement is presumed to be stored (or retrieved) in a data base as some kind of nested (S-over-S) structure (e.g. RUSTIN 1973, EISENBERG 1977).",
        "Consider the sentence (borrowed from Lyons, slightly modified):",
        "(1) Mr. Smith believes that professor Brown is the Dean.",
        "The syntactic analysis reveals the following structure: (2) S(NP(N(Smith))VP(V(believe) S(NP(N(professor)N(Brown))VP(V(be)NP(Det(the)N(Dean)))))) The semantic structure is very similar: -25(3) p1(believe (Smith, p2(be (professor Brown, Dean)))) The CL-analysis comprises accordingly the following logical steps: (4) a) recover the structure of p1 c) process the structure p1 b) recover the structure of p2 d) process the structure p2",
        "This scheme will be referred in the following as the standard model.",
        "Due to unsolved problems in evaluation of composite predicates and to the extremely high computational costs embedded structures are avoided in application systems (such as USL, PLIDIS, HAM-RPM, of.",
        "BOLC 1980).",
        "Moreover the superimposed predicate appears from the point of view of the (embedded) lower predicate as purely accidental.",
        "The domain-concept of beliefs avoids some of the difficulties of the standard model.",
        "Considering the basic communicative function of human language the information conveyed by a verbal statement should be decomposed into two components: 1. semantic (material) information and 2. modal information concerning belief-status of the statement (UNGEHEUER 1972).",
        "The fundamental difference between the two kinds of information should be reflected in the linguistic design and should be taken into consideration in models for man-machine communication.",
        "Accordingly the communication partners dispose of belief-registers in addition to the information registers (as it is the case in current systems).",
        "The belief-register provides a belief-.gent and a belief-value (belief-certitute) for each statement received.",
        "It is natural to initialize at the beginning of a discourse a number of belief-domains for the EGO, the PARTNER and the PERSONS MENTIONED.",
        "Notice that these processing frames (in the technical sense of the word, like in METZING 1980) are necessary in any system aiming at the same degree of sophistication.",
        "-26-In case of overtly marked belief-agents the objective of analysis is the proper assignment to a belief-domain and not the recovery of a structure.",
        "This means that expensive recovery procedures can be dispensed with, since the surface structure usually provides immediate keys for the proper assignment of belief-agents.",
        "Bach belief-agent has his own domain of beliefs.",
        "In actual communication the appearance of a partner A initializes a domain of A'.",
        "As soon as it the conversation further actants B, C, D etc.",
        "occur there will be corresponding new belief-domains C', D' etc.",
        "initialized.",
        "Statements overtly marked in view of a belief-agent will be transferred to the corresponding domain.",
        "For unmarked statements a general strategy of assignment of default values can be developed along the lines of Grioe and of MEGGLE (1981).",
        "Having initialized the appropriate belief-frame with the appropriate belief-agent, there is a particular domain of each belief-agent.",
        "In the case of (1) there is a belief-domain called \"world-of-Mr-Smith\" within the universe of discourse.",
        "The processing involves: (5) a) locate belief-domain by belief-agent key (.",
        "Mr Smith) b) enter/retrieve p in the activated belief-domain and c) determine current degree of certitude (= to believe) The present concept of belief-domains should be regarded in a more general procedural view of language, such as presented in BATORI (1981).",
        "The suggested treatment of belief-domains as pointer based areas in DB is another instance of procedural solutions, in which dynamic language structures turn out to be simpler than their static, purely representionally oriented description.",
        "On the linguistic level of analysis the domain concept of beliefs is motivated by the observation that the superimposition of belief-structures on statements does not make the comprehension of these sentences more difficult, at least not in the measure as the processing of the embedded structures in the standard model would let this to",
        "expect.",
        "Even if storing S-over-S structures cannot be dispensed with entirely, the number of their occurrences in actual analysis-procedures can be substantially reduced.",
        "Notice that the concept of belief-domains provides a framework to treat opaque references in a natural way.",
        "In the final version of the presentation it will be attempted to substantiate the proposed model on the treatment of belief-agents and esp.",
        "of their derivation from agents and subjects across clause boundaries."
      ]
    },
    {
      "heading": "Literature:",
      "text": []
    }
  ]
}
