{
  "info": {
    "authors": [
      "Fernand Gobeil"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-2025",
    "title": "Experiences Et Realisations Du Bureau Canadien Des Traductions Dans Le Domaine De L'Automatisation De La Traduction",
    "url": "https://aclweb.org/anthology/C82-2025",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "heading": "EXPERIENCES ET RtALISATIONS DU BUREAU CANADIEN DES TRADUC-PIONS DANS LE DOMAINE DE L'AUTOMATISATION DE LA TRADUCTION",
      "text": [
        "Fernand Gobeil Translation Bureau, Secretary of State Ottawa, Ontario, KIA 0M5 Canada De 1973 it co Jour, le Bureau des traductions du Seordta-riat d'Etat du Canada a subventionnd la recherche en traduotion automatique au moyen de marches de ddveloppement conclue aveo l'Universiti de Montreal.",
        "Il est Lesu des travaux du groups de recherche TAUM de cette universitd deux systemes, dont Mdteo, utilise depuis 1977 pour traduire des bulletins metdorologiques, et Aviation, actuellement a l'dtat de prototype limitd au sous-langage de manuel d'entretien d'avions et, plus partioulierement, des circuits hydrauliques dun patrouilleur maritime du ministers canadien de la Defense nationals.",
        "Suite a une Evaluation du system.",
        "Aviation en 1979-1980 et i une Etude de faisabilitd de son extension aux manuels d'entretien de l'dquipement dlectronique, it a dte decide de ne pas en poursuivre le ddvsloppement.",
        "En effet, it subsists, dune part, nombre de problemes qui exigent qu on recule,les frontieres des oonnaissances acquises•e ce Jour, done qu on poursuive les recherches, pour atteindre l'obJectif initial: la traduction sane intervention hamaine ou automatique.",
        "D'autre part, les beeoins du Bureau des traductions Justifient pas de poureuivre soul l'entrepries.",
        "La situation est claire: la traduotion automatique, realisable dans le cas de sous-lax:gages restraints oomme celui des bulletins mdtdorologiques, demeure une solution i long - 113 - terme our le plan plus generalise de manuels d'entretien.",
        "Cependant, la teohnologie issue des travaux de l'Universite de Montreal, grace auxauels le Canada s'est aoquia une reputation d'exoellence de par le monde, eat porous comma le point de depart dun nouveau programme qui aerait axe sur une action concertee du gouvernanent, du secteur prive et du milieu universitaire.",
        "Outre la traduction automatique, co programme porterait our la traduotion humaine assistee et our la traduction automatique assistee, ces avenues «Stant consi-denies comma offrant respeotivement des solutions & court et moyen terms.",
        "Ainai, auivant le courant de bureautique ou d'automatiaation des bureaux, on integrerait dans le mgme systeme le traitement de textes, la verification orthographique, les dictionnairee automatises, l'interface avec les banques de donnees terminologiques et documentairea, lea communications avec les clients, le courrier 6lectronique, la geation des travaux, etc.",
        "Les technologies necessaires existent: le probleme est de les harmoniser et de lea adapter aux besoina des traduc-teurs.",
        "Les salaires des profeasionnela et le volume de travail croissant sans cease, tandia qua le prix des ordinateurs accuse une tendance constants i la baisse.",
        "En outre, en en reduisant la taille, la micro-informatique fait de plus en plus des ordinateurs des machines de bureau et les demystifie.",
        "Au nombre des projets immediate et experiences du Bureau des traduction figure le tranafert sur micro-ordinateur du systems Mete° aotuellement implants our un CYBER CDC 7600.",
        "En outre, on introduit graduellement les machines de traitement de textes comme outila de travail des traduoteurs.",
        "On savait deja qua ces machines, d abord utilisees exoluaivement par des dactyloa, epargnaient aux traduoteurs de multiples re-lectures de lours textes.",
        "Maintenant, tout en leur assurant les mgMee avantages, ces machines, entre les mains de tra-- 114 - ducteurs autonomes et chevronnes, permettraient d'economiser ... les dactylos, reseources aussi precieuses que lee traducteuree Sur un autre plan, c'est aux systemes commerciaux de traduotion (automatique ou automatique assiotie - le classe-meat eat difficile a etablir) que le Bureau dee traductiono s'intéresse.",
        "Aprils une etude de faisabilite faite en 1980-81„ le Bureau eonge maintenant A des assets operationells.",
        "Le premier systime qui sera mis a l'essai, d'origine americaine, et maintenant commercialise au Canada, est ALPS, lequel s'inspire directement dee travaux de l'Universite Brigham Young aux Etats-Unie.",
        "On examine aussi les possibilites de faire un essai du systeme WEIDNER, aussi d'origite americaine, et de SYSTRAN II, commercialise au Canada depuis environ 6 ana par tine societe canadienne, la World Translation Company of Canada.",
        "On Oompte que les ()seeds permettront, entre autree chosen, de connattre lee limites linguistiques dee systemes et, aussi, lee utilisation possible.."
      ]
    }
  ]
}
