{
  "info": {
    "authors": [
      "Pavel Materna"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-2048",
    "title": "The Nature of Understanding from the Logical Point of View",
    "url": "https://aclweb.org/anthology/C82-2048",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "heading": "ADIS Praha, Czechoslovakia",
      "text": [
        "In this paper I want to sketch an analysis of the con-oept of understanding (in the semantic sense of word).",
        "No com-paration with other attempts at such an analysis will be made.",
        "Since the most adequate logical tool for analyzing natural language is, to the author's opinion, Tiobre \"transparent intensional logic\" (TIL, see, e.g., P. Tich*: The Logic of Temporal Discourse, Linguistics and Philosophy 3 (1980), 343- 369), I shall first adduce a brief exposition of some relevant concepts of TIL.",
        "1.",
        "Transparent intensional logic.",
        "TrL is consequently intensional system that exploits partial theory of types and a modified version of A -calculus.",
        "Omitting teohnioal details (however important they are) we aball summarize some principles of TIL; Objects which are supposed to be denoted by the expressions of a (natural) language are type-theoretical objects over an \"epistemio basic\", where elementary types are the universe of discourse (L ), the set of truthvvalues (o), the set of time moments or real numbers (T ), and the logical space (w ; members of w are \"possible worlds\"); compound types are sets of (partial and total) functions.",
        "The objects are the members of the particular types.",
        "The objects denoted (named) by \"normal\" expressions of a language are intensions, i.e.,funotions whose domain is w. Thus definite descriptions name individual concepts (members of w +(r+i ) ), sentences name propositions (members of w + + o) ), some nouns name properties (members of w±(T.4.",
        "(n4.o) ) , where n is a type),etc.",
        "- 199 - In TIL there is introduced a concept of key importance: the concept of construction.",
        "Intuitively, a construction is a way in which an object can be given.",
        "Atomic constructions are objects themselves (an object A constructs A) and variables of the given type (a variable v-constructs an object dependently on the valuation v).",
        "Non-atomic constructions are applications of functions to their arguments, and a -abstractions.",
        "Constructions are defined inductively, so that an infinite hierarchy of constructions with embedded constructions arises.",
        "Distinguishing between constructions and objects is one of main contributions of TIL.",
        "Every object is a construction (of atomic constructions!)",
        "but the variables and non-atomic constructions are not objects.",
        "The interrelations between language expressions, objects and constructions are stipulated as follows: Let E be a language expression: E expresses a construction, say, CE, and names (denotes) the object, say, 02, which is constructed by CE.",
        "There are, however, some expressions whose role differs from the role of \"normal\", semantically analyzable expressions.",
        "This concerns i) expressions whose role is solely a syntactic one, ii) interjections, iii) \"egocentric expressions\" such as \"I\", \"you\", \"here\", \"this\", etc.",
        "The category ii) is uninteresting in our context.",
        "As for i), transformintE into CE is generally impossible without the expressions from this category.",
        "With iii), a pragmatic elatent appears: the transformation into CE is possible only if we are acquainted with the situation in which E has been uttered.",
        "A special category of expressions is, from the semantic viewpoint, the category of \"formal expressions\", such as the mathematical ones, e.g., \"two times three\" or \"four minus two - 200 - equals two\".",
        "These expressions are supposed to denote directly constructions.",
        "2.",
        "Understanding.",
        "It may be stated that there is a general agreement among linguists, as well as among logicians, that understanding (in the semantic sense) is a relation between an individual and an expression.",
        "Any explication must, however, specify this relation.",
        "With respect to what has been said above, there are two principal possibilities of such a specification: a) (the individual) A understands E iff .A asociates E with the object (OE) denoted by E; b) A understands E iff A associates E with the constructtion (CE) expressed (or - in case of a mathematical expression - denoted) by E. Thus let A hear or read a sentence S. In the case a) we would say that A understands S iff he knows that S names a proposition P. In the case b) we should say that A understands S iff he knows the construction C that constructs P (or any structure preserving the meanings of \"atomic express-ions\" and isomorph with Cs).",
        "It is clear that understanding in the sense of b) implies understanding in the sense of a) wherever both these senses are thinkeble.We can show, however, that the implication does not hold vice versa.",
        "Indeed, take the English sentence (S) John owns a outlass or he does not own a cutlass.",
        "Even those who do not know what a cutlass is will know that (8) denotes the proposition \"verum\", i.e., the proposition which is true in every possible world at every time moment.",
        "Thus not knowing the construction Cs (because of not knowing an atom being part of it) the above individuals know the object (i.e., the proposition) denoted by (S).",
        "One argument against explicating understanding in the sense a) is that we would probably hesitate to say that who does not know the meaning of \"cutlass\" does all the same understand (S).",
        "- 201 - Another argument against a) is strictly bound to our conception and can be formulated as follows: in the case of mathematical expressions a) is not applicable, since such expressions generally name constructions rather than objects.",
        "The last argument in favour of b) again refers to our intuition: we feel that one can \"more or less\" understand an expression.",
        "This \"more or less\" is excluded if we connect understanding with the objects named by expressions (or, at most, we must confine ourselves to the cases of \"more or less\" clear meanings of particular atomic expressions).",
        "When connecting understanding with constructions we can explicate this \"more or less\" rather intuitively.",
        "We shall sketch this explication (technical details are omitted again):,Let the given expression E contain n \"atomic\", i.e., unanalyzable meaningful (sub/expressions) including, as the case may be, the expressions from the category iii) ) el ..... en.",
        "A necessary condition for A's understanding E (in the sense b) ) is that A associated the appropriate atomic constructions, i.e., objects with el,...,en.",
        "(The second necessary condition consists in A's correct transformation of E into a construction schema according to the grammar of the given language).",
        "Now, the degree of A's understanding E can be, among others, measured by 1 - k/n, where k is the number of those subexpresa-ions among el en, which are associated ,„by A with no object at all; analogically, the degree of A's 'misunderstanding E oan be measured by k'/n, where k' is the number of those subexpreasions among el en, which are associated by A with an inappropriate object.",
        "(Clearly, k-}- n.) Thus it seems more appropriate to accept the position b) and to claim that understanding is a relation between an individual and an expression which holds iff the individual correctly associates two structured entities: the grammatical (or: tectogrammatical) structure of the expression and the (logical) structure of the corresponding construction.",
        "- 202 -"
      ]
    }
  ]
}
