{
  "info": {
    "authors": [
      "Naoyuki Okada",
      "Aiko Miura"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-2051",
    "title": "Conceptual Taxonomy of Japanese Adjectives for Understanding Natural Language and Picture Patterns",
    "url": "https://aclweb.org/anthology/C82-2051",
    "year": 1982
  },
  "references": [
    "acl-C80-1019"
  ],
  "sections": [
    {
      "heading": "1. Introduction",
      "text": [
        "This paper presents a conceptual taxonomy of Japanese adjectives, succeeding that on Japanese verbal.",
        "In this taxonomy, natural language is associated with real world things - matter, events, attributes - and mental activities - spiritual and sensual.",
        "Adjective concepts are divided into two large classes, simple and non-simple.",
        "Simple concepts cannot be reduced into further elementary adjective concepts, whereas non-simple ones can be.",
        "Roughly speaking, simple concepts are concrete and can be directly associated with physical and mental attributes, whereas non-simple ones are abstract and indirectly associated with them.",
        "2.",
        "Simple Adjective Concepts",
        "Verb concepts were well understood as \"change\" from state S° to state S1 as shown in Fig. 1:1Adjective concepts are considered to be captured as the \"difference\" between objects 00 and 01.",
        "Fig.2 shows how the difference in vertical length between 0 and 01 brings about the concept of \"high\".",
        "Notice 0 that surface structures often lack the expression of 00 like \"yama-Ka takai (the mountain is high)\".",
        "Since the meaning of \"high\" cannot be expressed only by 01, deep structures need"
      ]
    },
    {
      "heading": "State So State S1 otoko-ga ie-kara deru.",
      "text": [
        "The man goes out of the house."
      ]
    },
    {
      "heading": "2.1 Structural Patterns",
      "text": [
        "Adjective concepts can be regarded as the concept of a relation among constituents which produce difference and can be represented as follows: Ad(c, s, o, of, ot, oin, Os, i, 1, t, r, ...) (1) where each symbol in parentheses stands for a constituent.",
        "For example, c and s stand for an object for comparison and a subject, respectively.",
        "Same constituents are obligatory in the sense that they are indispensable in the recognition of difference.",
        "Seven types of structural patterns are proposed, according to the combination of obligatory constituents."
      ]
    },
    {
      "heading": "2.2 Semantic Contents",
      "text": [
        "The semantic contents of Ad in formula (1) are categorisw ed into physical, mental and abstract attribute.",
        "We classify each of them in detail because we cannot detect any difference - 210 - without such information.",
        "In the case of verbs, twenty categories such as displacement, deformation, and spiritual activity were proposed to classify the semantic contents of \"changes\".",
        "We modify them slightly to apply to the classification of semantic contents of adjectives.",
        "For example, displacement and deformation are modified to location and shape, respectively.",
        "3.",
        "Non-Simple Adjective Concepts",
        "Non-simple adjective concepts are not directly associated with physical or mental attributes; therefore we emphasize an analysis of how they are composed of simple ones."
      ]
    },
    {
      "heading": "3.1 Complex Concepts-A",
      "text": [
        "For example, there is a complex adjective \"hoso-nagai (thin-long)\" which is registered as one word in ordinary Japanese dictionaries.",
        "The connecting relation between two adjective concepts is a logical product in this case.",
        "The complex concept of A is defined as follows: if two adjective concepts are connected by a rule and the connected concept is represented by a complex word of those adjectives, it is called a \"complex concept of A\".",
        "Two types of connecting rules are proposed: logical product and syntactic relation."
      ]
    },
    {
      "heading": "3.2 Complex Concepts-B",
      "text": [
        "This concept is usually represented by a simple word and is considered to consist of several elementary adjective concepts.",
        "No general rule can be found to connect elementary adjective concepts.",
        "Semantic contents of the concepts are classified into such categories as linguistic activity and character."
      ]
    },
    {
      "heading": "3.3 Derivative Concepts",
      "text": [
        "Some concepts possess a function of deriving a new concept by operating others.",
        "They have two morphemic structures, prefix and suffix, which add certain information to operands.",
        "For example, suffix \"-tarashT\" adds the meaning \"indeed\" to its operand.",
        "Such derivative information is categorized into five classes.",
        "- 211 - 4.",
        "Classification",
        "There are approximately 530 adjectives considered sufficient for daily Japanese.",
        "We actually classified their concepts, numbering about 630, according to types and categories proposed in Sec.2 and 3.",
        "They were well classified into those types and categories.",
        "In the classification of simple concepts, \"standard concepts\" were chosen from among similar concepts, amounting to approximately 270.",
        "They might be considered \"primitives\" in the sense that every other adjective concept can be derived from them by some rule.",
        "5.",
        "Extraction of Conceptual Features",
        "We extract conceptual features from each Ad and its constituents, noticing the standard concepts with physical attributes obtained in Sec.4.The following analysis shows part of the feature extraction from takai (high)/ hikui (low).",
        "takai(high) / hikui(low) Polysemy (1) Structural pattern; Ad(s,c), semantic contents; shape s, c : thing Ad : The vertical length of s is larger/smaller than that of c. Example: T6ky6 taws-ga Kyoto taws-yori takai.",
        "Tokyo Tower is higher than Kyoto Tower.",
        "Polysemy (2) Structural pattern; Ad(s,c), semantic contents; location s, c : thing Ad : The vertical distance of s from a standard plane is larger/smaller than that of c. Example: Hik6ki-ga Kumo-yori takai.",
        "The airplane is higher than the cloud.",
        "6.",
        "Sentence Production from Picture Patterns",
        "System SUPP, which accepts moving picture patterns, interprets the meaning of changes in them, infers about similarity among changes, and describes the results in Japanese and English sentences, was constructed as an application of -212-the conceptual taxonomy of verbs.",
        "SUPP was improved to interpret physical attributes of picture patterns.",
        "Fourteen standard concepts were chosen for this improvement.",
        "An example of experimental results is shown in Fig.3."
      ]
    },
    {
      "heading": "7. Conclusions",
      "text": [
        "This taxonomy has made clear an outline of the whole of Japanese adjective concepts.",
        "IA Japanese, the number of adjectives is rather small compared to that of adjective verbs.",
        "This taxonomy is expected to give a basis to that of adjective verbs."
      ]
    },
    {
      "heading": "Reference",
      "text": []
    }
  ]
}
