{
  "info": {
    "authors": [
      "Helder Coelho"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-1010",
    "title": "A Formalism for the Structural Analysis of Dialogues",
    "url": "https://aclweb.org/anthology/C82-1010",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "text": [
        "A FORMALISM FOR THE STRUCTURAL ANALYSIS OF DIALOGUES Helder Coelho Centro de Informatica Laboratorio Nacional de Engenharia Civil 101, Av.",
        "do Brasil, 1799 Lisboa Codex, Portugal This paper outlines a formalism for conversational analysis that captures multiple interactional patterns of mixed-initiative and fix the historical skeleton of a dialogue.",
        "The formalism, composed by a grammar of dialogues (syntax and semantic component) and a collection of attached scenarios (pragmatic component), is written in Prolog and implemented in a program which converses in Portuguese to provide a library service."
      ]
    },
    {
      "heading": "INTRODUCTION",
      "text": [
        "In trying to solve the problem of building programs that interact in natural language no great attention has been paid to formalisms for the structural analysis of dialogues.",
        "However, such formalisms may support a clear description of the history of the whole conversation, and convey reasoning power when associated to other tools such as definite clause grammars DCG's , an extension of context-free grammars.",
        "And, on the other hand, they promote the elaboration of theories of systematic comprehension of conversations and, in fact, a better understanding of conversations between individuals, because they allow their simulation.",
        "Dialogue taking place, for example, in a library world has structural properties, and rules are derived to form a grammar of dialogues [43 .",
        "This grammar, expressed by a DCG, generates all possible exchange forms and is responsible for the organization of the possible interactions in such context, because it contains a description of the various ways in which the dialogue units may be strung together to form dialogues.",
        "In fact, the majority of those rules are general and may apply to other task domains.",
        "Rules are defined in terms of.semantic concepts, like requests or answers, which are supported by sentences of natural language.",
        "And, these sentences are analysed, ie, translated into logical structures, by a DCGfor Portuguese [1] .",
        "Both DCG's are expressed by Prolog's grammar rules [3] The research behind this paper is guided by the objective of design and implementation of computer programs capable to display intelligent behaviour according to the standards of human perfomance.",
        "An associated objective, the comprenhension of human perfomance with the help of computer models leading to theories about intelligent human behaviour, is kept in mind but not discussed along the paper.",
        "A FORMALISM FOR THE ANALYSIS OF DIALOGUE The organization of taking turns to talk is fundamental to dialogue, as well as to a program able to converse.",
        "A formalism for the analysis of dialogue is proposed, and we examine its compatibility, with the representation of the history of dialogues between a program and its users.",
        "Let P be a set of participants and C a set of contributions.",
        "By a contribution act we mean a member of the set PxC of participant-contribution pairs.",
        "For exemple, <pl,c11> is a contribution act, where pl and cll are the first members of P. and C, respectively.",
        "Let S be a set of conversational states or configurations.",
        "A conversational state s is a sequence of at least two related contribution acts.",
        "For exemple, cll stands for the first contribution regarding the first conversational state.",
        "By a dialogue of length n we mean a member of the set (Px C) of sequences of n contribution acts; and by a dialogue we mean a member of the set",
        "of dialogues of any length.",
        "Each member of a dialogue is of the form (5, <p,c>> (s LS,p EP,c tC) with we identify with the triple 0,s,c,.",
        "For example, T = (01,1,c11> , <p2,1,c21, , <pi ,2,c32> , <p2,2,c42> ) is a dialogue of length 4, with 2 participants, pl and p2, 2 conversational states and 4 contributions.",
        "Wecall E = PxSxC the set of events, and any triple (p,s,c, an event.",
        "A dialogue is a sequence of events, grouped into units, and governed by rules.",
        "The conversational units are the invariant structures of dialogue: sub-dialogues, exchanges, monologues and contributions.",
        "A sub-dialógue (dialogue course or segment) is any sequential subset of a dialogue,",
        "An exchange is a set of two consecutive events, concerning the same conversational state and two different participants.",
        "A predefined exchange, conducted by the program, is called an exchange pattern.",
        "A monologue is a sequence of at least two consecutive events, concerning the same conversational state and the same participant.",
        "A contribution of a participant to a dialogue is a sequence of his contributions.",
        "The semantics of contributions covers the following types: requests (statements, questions, and commands), answers and remarks (eg.",
        "agreement).",
        "The underlying structures of the situations occurring in a certain problem world determine the organization of dialogue and its systems.",
        "A grammar of dialogue is a set of rules of dialogue.",
        "Rules of dialogue state how participants understand coherent dialogues, and specify the membership of the set of legal dialogues K, such that K a T, where T is the set of dialogues of any length.",
        "Rules of dialcr gue define the class of coherent dialogue and their attached models.",
        "They contain the way contributions are put together.",
        "A model is a system of dialogue defined as the triple <P,C,K> .",
        "The core of any model is the set R of rules defining K."
      ]
    },
    {
      "heading": "ANALYSIS OF DIALOGUE",
      "text": [
        "We consider the dialogue occuring between the program TUGA El) and its users in the library world.",
        "Such dialogues are evolving dual processes, goal-and-rule-oriented for sharing information between the participants.",
        "They are dual because there are only two participantes at a given time.",
        "They are goal oriented because they are carried on to satisfy, for example, the following objectives: i) to satisfy users straightforward request concerning the document collection and the classification system, ii) to ask users about the library world (eg.",
        "the author of a paper), for conversational.guidance purpose, and iii) to present the user with proposed data (eg, the document classification), enabling him to choose from or modify it.",
        "They are rule-oriented because the conversational units are governed by a grammar of dialogueswhich determines the roles played by the program--the librarian and the library's secretary, and by the user.",
        "The grammar also allows the inclusion of several courses inside a dialogue, such as topic shifts for simple question-A FORMALISM FOR THE STRUCTURAL ANALYSIS OF DIALOGUES 63 answering purposes.",
        "Consider a dialogue between the program and one of its users, defined as a sequential organization of single exchanges.",
        "The conversational description is represented in the diagram of the following figure.",
        "The diagram shows the history of that dialogue.",
        "The interaction proceeds in separa to discrete steps from one to another of a finite number of configurations.",
        "There are three sucessive conversational states through time, each one corresponding to a single exchange, question (q) - answer (a) pair, conducted under user initiative.",
        "This history is described as follows.",
        "is a dialogue of length 6, with 2 participants, the user (u) and the program (p), with 3 conversational states and 6 contributions (questions and answers).",
        "Note that 'q32', for example, means that the third contribution is a question, referring to the second conversational state.",
        "Consider now the following segment of a nested dialogue, concerning the classification of a document:",
        "(1) u-Classifique \"Explorations in Cognition\"!",
        "(2) p-\"explorations in cognition\" e desconhecido!",
        "(3) Quer ainda classifica-lo?",
        "(4) u-Esta bem.",
        "(5) p-Vamos classifica-1o: (6) Por favor, de-me o titulo de uma referencia do documento em questao.",
        "(7) u-Qual e o titulo do Nilsson?",
        "(8) p-\"artifical intelligence\" (9) Vamos classifica-lo: (10) Por favor, de-me o titulo de outra referencia do documento em questio.",
        "(11) u-Nao_tenho nenhuma.",
        "(12) p-Esta bem!",
        "(13) Ja que rido consegui obter nenhuma referencia, nio_sei dar-lhe qualquer sugestao!",
        "Quer ainda classifica-lo?",
        "(14) u-Nao_quero.",
        "(15) p-Esta bem!",
        "E que mais?",
        "The conversational description, represented in the figure 2, shows the organization and levels of the dialogue.",
        "Numbers, placed on the left of contributions, are used for referencing them to the segment considered.",
        "(Classify \"Explorations in Cognition\"!)",
        "(\"explorations in cognition is unknown: Do you still want to classify it?)",
        "(All right.)",
        "(Let us classify it!)",
        "Please give me the title of a reference from the document in question.)",
        "(What is the title of Nilsson?)",
        "(\"artificial intelligence\".",
        "Let us classify it!",
        "Please, give me the title of another reference from the document in question.)",
        "(I have none.)",
        "(All right!",
        "As I could not get any reference, I don't known to give you any suggestion!"
      ]
    },
    {
      "heading": "GRAMMAR OF DIALOGUES",
      "text": [
        "The grammar of dialogues of program TUGA is a complete and precise description of the properties of a certain class of dialogues.",
        "The properties concern the structures of the dialogues, occurring in a library world, and organized as models.",
        "This grammar machinery is able to parse situations, and it is-very much like the one able to parse a natural language sentence: the objects recognized, dialogue units, are characterized as structured objects assembled out of recognizable parts according to know rules of assembly.",
        "A dialogue carried out by TUGA has two participants, the program (p) and its users (u), and therefore two mutually exclusive states, the \"agent\" and the \"passive par ticipante\".",
        "Both participants may take the initiative during the encounter, ie.the program may be an \"agent\" or a \"passive participant\".",
        "The \"agent\" claims the turn to speak at any given moment, and plays an active role.",
        "The \"passive participant\" does not claim the turn to speak at any given moment.",
        "Considering two states for each participant, there are four possible conversational states.",
        "However, we only consider two states: \"agent\"-- \"passive participant\" and \"passive participant\" – \"agent\".",
        "(The other two states represent in some sense a failure of dialogue.)",
        "The BNF specification of the grammar syntax above the discourse level, presented below, characterizes only the class of dialogues considered.",
        "Let us consider only the first few rules in order to make explicit their mealing.",
        "A general dialogue, 'converse', is defined as an opening following by a sub-dialogue which may be followed by a sub-dialogue or closed by user initiative.",
        "The user may also suspend torIporarily the dialogue without affecting it.",
        "This feature justifies the existence of two kinds of opening: one for the dialogue start and the other for the restart.",
        "A dialogue is simply a sequence of exchanges or monologue, or is followed by several models of dialogue.",
        "For example, dialogue on the classificatioi of a document is handled by dialogue model 'converse5', which is defined by rules 'course'.",
        "These rules define several kinds of possible courses during the interaction.",
        "Dialogue on adding new documents is handled by dialogue model 'converse6', which is served by a set of exchange patterns a sequence of predefined program questions whose order may be altered by user.",
        "Some feature of a sentence, together with the current context, can trigger a hypothesis that an instance of some particular model or pattern is being conveyed.",
        "All this means that the program can cope with user changes of mind, single or multiple data, provided in any order, and can avoid asking questions whose answers were provided either implicitly or explicitly at some earlier time.",
        "We use rules of interpretation, below the discourse level.",
        "The rules of interpretation deal with what the user does, eg, requests (statements, questions and commands) and answers.",
        "Other rules deal with what the program does, eg, answers, questions, and remarks (comments and agreements).",
        "Here are, for example, throe of these rules: Rule If the user makes a statement, the program interprets it as a request for confirmation.",
        "Rule If the user asks a closed question (form Q-S, where S means the statement corresponding to the question) and the program responds with an existential E (yes/ /no), then the program is understood as answering the user with the tratement ES.",
        "Rule If the user issues a command, then the program interprets it as a valid request for an action A only if the following conditions hold:"
      ]
    },
    {
      "heading": "66 H.COELHO",
      "text": [
        "the request is ended with an exclamation mark, and action A is classifying a document, generating a category, adding data items and, deleting data items.",
        "The first two actions also cover the general purpose of gathering information through a referent: the referenced document or the classification."
      ]
    },
    {
      "heading": "DIALOGUE ORGANIZATION STRUCTURES AND LEVELS",
      "text": [
        "Any original natural language sentence is parsed by a cascade of two DCG's.",
        "The first DCG, above the discourse level, represents the syntactic information about dialogue form (exchange patterns and dialogue models) and is closely coupled to a set of scenarios which represent the pragmatic information about the task domain (a collection of situation descriptions).",
        "The second DCG, on the sentence level, represents the syntatic information about sentence form and the general semantic information.",
        "Let us observe in more detail the main dialogue forms, engineered and manipulated by the first DCG in order to build up the overall skeleton of the dialogue history.",
        "An exchange pattern (eg.",
        "'dialogue') is a predefined exchange between the program and the user.",
        "It is defined by a name and a number, and provided by a message and the number of the following contribution.",
        "It consists of a question of an expected form, followed by a simple dialogue.",
        "The question is constructed with the value of the message (eg.",
        "a proper noun).",
        "The simple dialogue is the standard way to interpret user contributions: the question-answer pair.",
        "As regards exchange patterns, the user contribution expected is not always an answer: the user also question the program, and by doing so a new dialogue is nested in the previous %ne.",
        "Program questions are motivated by the content of user request.",
        "For exemple, interrogating 'the name of a new category' and 'under what categories may it be placed' are generated when the user wants to create a new category in thectässification system.",
        "The exchange pattern is called by the grammar of dialogues through its name and number.",
        "In case of non acceptance of the program question by the user, the initiative for restarting the dialogue belongs to the user.",
        "But the new dialogue may be nested in the previous dialogue, as often occurs in the process of classifying new documents.",
        "A dialogue model (eg.",
        "'converse') is a suite of unconstrained exchanges between the program and the user.",
        "It generates detailed expectations about the next contri bution, by having an ordering for calling exchange patterns which may be altered by user.",
        "The user may give several answers which need not be ordered.",
        "Also, he may modify his previous answers.",
        "The program uses the success or failure of is predictions to determine what role the user contribution plays in the dialogue.",
        "Whenever a dialogue model is activated, an appropriate exchange pattern is invoked,and the program poses a question to the user and interprets the user response.",
        "If a failure occurs, the program is able to come back to the same topic.",
        "For example, during the classification of a document, the user may oppose the program and request information about the location of a category in the classification system.",
        "And, the program only accepts three titles of documents,known to its data base, and according to its classification method.",
        "Therefore, it goes on asking the user till it attains that limit, and skips any unknown title.",
        "But if the user gives up, the program restarts a new dialogue.",
        "These features are implemented either by using recursion or backtracking.",
        "Recursion is the ability of a procedure to contain a procedure call to another copy of itself.",
        "The declaration of the procedure, for the dialogue model in charge of the classification process, contains a procedure call which matches the name of another copy of the same procedure declaration.",
        "counters control the process of recursion during the program asking for references in the classification process.",
        "And, an handling device deals with contradictions arising when a new document is archived.",
        "Numbers (1 and 0) are assigned according to existing contradiction or otherwise, and summed over the facts.",
        "If the result is A FORMALISM FOR THE STRUCTURAL ANALYSIS OF DIALOGUES 67 non-zero, a failure aries forcing backtracking and the restarting of the process.",
        "In the course of conversing, the program remembers the events by storing conversational states containing the name of the participant, the number of the contribution, and the active information, such as questions or answers.",
        "This knowledge about the current dialogue history and skeleton is maintained in order to be served in any specific situation or instance to which it applies.",
        "In fact, it is the support for the organizational ability of the grammar of dialogues.The example below illustrate this ability.",
        "Consider the segment of a nested dialogue, presented in figure 2, concerning the classification of a document.This dialogue presents a sub-dialogue and an interruption due to the user.",
        "The sub-dialogue corresponds to a dialogue model, which organizes interactions concerning the implementation of the document classification method.",
        "The interruption is presented as an exchange,nested in the sub-dialogue.",
        "This conversational description shows the organization, the depth of nesting, the change of initiative, and the levels of the dialogue (one for the ordinary tdalogue; the other for the particular dialogue model; and, the last one for the interruption).",
        "Consider another example of a dialogue (numbers appended to the natural language contributions correspond to the conversational states).",
        "(1) u-Crie Prolog!",
        "p-Prolog a conhecido!",
        "(2) u-Quero criar uma categoria!",
        "(3) p-Por favor, qual o nome da nova categoria?",
        "u-\"Pattern recognition\"._ p-\"Pattern recognition\" e desonhecida!",
        "(4) Por favor, debaixo de que categoria a pretende inserir?",
        "u-\"Machine vision\"._ p-\"Machine vision\" e conhecida!",
        "(5) A nova categoria ficou_inserida no sistema de classificagao e recebeu o numero 2141.",
        "E que mail?",
        "The history of this dialogue is:",
        "The new category has been inserted in the classification system and received 2141 as a number.",
        "And what else?)",
        "<u,1 ,c11> ,0,2,a21),(u ,2,c32> p,3,q43>,<u ,3 ,a53) , < p,4,r64>,<p,4,q74), < u,4,a84),(p,2,a92)} scenario C Dialogues 1 4 2 ore exchange patterns of scenario C: question_anssser pars 1( q43, 053),(r64 6074,0134)1 Fig. 3 Conversational description The program knows that the first user contribution, a command,<u,l,c11> , opens a dialogue composed of a simple question-answer pair (conversational state 1).",
        "The dialogue goes on with another user command, <u,2,c32>, which invokes a dialogue",
        "model for creating new categories.",
        "This dialogue model calls two exchange patterns, and the dialogue is closed with the program answer < p,2,a92> .",
        "Note that this last event has the same conversational state number (2) as the event invoking the dialogue model.",
        "This information, shared by the program and one of its users, helps the program to decide on what to do and how to proceed.",
        "It chooses its course of action by inspecting previous user decisions, through the remembering mechanism.",
        "The dialogue model, responsible for gathering information about new documents, exemplifies the use of backtracking.",
        "If the user changes his mind at any stage of the dialogue, the program backtracks to follow up the consequences of the new information.",
        "Supplied facts contradicting those already known are detected in the immediate interpretation of the user's input, and when this interpretation is complete, a failure leading to the restart of interpretation at a previous level occurs if a contradiction has been found.",
        "This mechanism overrides the repetition of unanswered questions, and skips questions by recognizing the content and form of the user's answers.",
        "SCENARIOS Scenarios are sets of expectations and presumptions regarding a certain type of situation, They are of the form \"if <situation description> then expect <situation description> \", or \"if <situation description) is a satisfied then do <action description> \".",
        "Situation and action descriptions are triggered by verbs.",
        "Scenarios are used in TUGA [13 as recognition devices for classifying and identifying situations in a dialogue, and they call the exchange patterns and organize their invocation.",
        "All the embedded knowledge embedded in the scenarios covers the ability.",
        "- to derive questions from relevant information or from the logical consequences of the information that is known about the questioned topic combined with general knowledge of the library world, and - to handle the user's answers TUGA is a program able to play two roles in the library world.",
        "It acts as a librarian and as a library's secretary.",
        "Scenarios A, B and C may occur inside scenario D. Scenarios B2 and B4 may occur inside scenario C. Exchange patterns are classified according to their use in these scenarios, as shown in the following figure.",
        "The classification is made possible through two of their arguments: name and number.",
        "This taxonomy for situation recognition is made available during a dialogue.",
        "It contains the pragmatic knowledge of the task domain, and supports the pic,gram ability to converse with users in a more clever way, when put aside the gr..--Dar of dialogues.",
        "A FORMALISM FOR THE STRUCTURAL ANALYSIS OF DIALOGUES 69 Scenario an-scerono Diaicste mode E.., amerns Al a.tng whether Ye user wants more data handing a., the user's agreement Ifr adanory ...gement king about a Syntotic error in the semen.",
        "as., whether the unkreAvn ward a prep, noun tnaccebkhd sentences ash, which om NC proper naps oolong oho.",
        "the unknown herd gender asiong about ire uterewn ward domain addition asking document Ntha and oubliSner 01 nest aSinng document dote al pubic., and sort 5/ ....IN ask, dzurne.",
        "omega es B ask, Ow user to confirm no desire for document nonage B2 Dassilocaban o., Ne (oleo, nen., goo when the nee us A be merle', system ortertlan a.ong the new category name C 0 cbssiledben asking the retereree Me me.. asking tM minimum a throe hategares asking 2/e user to COMM his desire Lee, the uSees Chace kr document categores asking Me dOCurnent cliaseiltcabon Fig. 4 Classification of exchange patterns"
      ]
    },
    {
      "heading": "CONCLUSIONS",
      "text": [
        "An intelligent automated conversationalist may attempt to construct a process of participation by analysing the other's process, ie.",
        "use conversational procedures, develop multiple conversations, fix the skeleton of the dialogue history, build up a conversational context space and appeal to it as a guider for the calculation of responses and disambiguation tactics.",
        "We are approaching the complexity of these phenomena by developing an evolving framework for conversational sequencing structure analysis, allowing users to insert sequences and abruptly shift to other topic, and the program to recognize user turns at conversing.",
        "However, our framework is not completed and some more work is needed to cover, for example, the implicit conversational mode or internal dialogue.",
        "This mode constitutes the background of the explicit flow of what is declared, tackled by the present work.",
        "Each participant, before uttering a sentence, discusses with himself to find the best appropriate utterance to match the opponent one.",
        "By doing this, the participant executes several mental constructions, like deductions, presupositions, analogies or associations, and compares the result to his beliefs in order to discover the intention of the other.",
        "A part of this extension, it would also be required to augment the complexity of the conversational context space by structuring it, because context plays the role of a model directing the reasoning of participants in what concerns the understanding of a sentence.",
        "Such improvement of embedding the function and the use of context into a program would also increase its interactional power.",
        "Finally,the pragmatic component needs further improvement in order to allow communication (passing messages) among scenarios."
      ]
    }
  ]
}
