{
  "info": {
    "authors": [
      "Ching Y. Suen"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-1060",
    "title": "Computational Analysis of Mandarin Sounds With Reference to the English Language",
    "url": "https://aclweb.org/anthology/C82-1060",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "text": [
        "In the analysis of Mandarin, the author used a corpus composed of over 750,000 samples transcribed automatically from Chinese characters by the computer through the sequential application of a set of phonetic rules developed by the author.",
        "The result is a classification and rank distribution of all speech sounds, the phonetic properties, frequency distribution of symbols, phonemes, syllables, tones, and their combinations.",
        "These statistical properties are compared with those of the English language."
      ]
    },
    {
      "heading": "INTRODUCTION",
      "text": [
        "English is widely used throughout the world while Mandarin is spoken in China by one quarter of the world's population.",
        "It is interesting to compare the phonetic properties of these two languages and to study their similarities and differences to understand the problems involved when the speakers of one language learn to speak the other language.",
        "The linguistic aspects of written English and Chinese, such as those presented below, have already been studied extensively (see Suen (1979 a & b)), e.g. a) the frequency of occurrence of words/ characters, b) the statistical distribution of letters/radicals, and their combinations, c) the study of syntax, semantics, pragmatics, and related areas, and d) translation of one language into another.",
        "Also the linguistics aspects of spoken English have been described in well-known literature (Dewey (1923), Carterette et al. (1974)), e.g. a) the frequency of occurrence of syllables, b) the statistical distribution of phonemes and their combinations, c) the Phonetic system and symbolic representation of sounds, and d) acoustical analysis, recognition and synthesis of the spoken language.",
        "Such investigations, however, have been rarely conducted'on Mandarin, the official language spoken in China, owing to many reasons.",
        "In order to close this gap, the author has initiated several research projects aimed specifically at the analysis of these aspects (Suen (1979 b)).",
        "paper can be found in Suen (1979 b)."
      ]
    },
    {
      "heading": "Syllabic Structure Example",
      "text": [
        "1.",
        "Vowel /A/ 2.",
        "Diphthong /EI/ 3.",
        "Triphthong /I AU/ 4.",
        "Vowel + Nasal /AN/ 5.",
        "Diphthong + Nasal /I ANG/ 6.",
        "Consonant + Vowel /B 0/ 7.",
        "Consonant + Diphthong /P AU/ 8.",
        "Consonant + Triphthong /M I AU/ 9.",
        "Consonant + Vowel + Nasal /R UN/ 10.",
        "Consonant + Diphthong + Nasal /L I ANG/",
        "Associated with each Mandarin syllable is a tone which gives the musical quality.",
        "It is normally denoted by a diacritical mark as shown below.",
        "A tone specifies the pitch contour of the syllable.",
        "There are five tones in Mandarin and they can be described as follows (Suen (1979 b)): Tone Description Pitch",
        "1.",
        " – high level 55 2.",
        "/ high rising 35 3.",
        "Ne low rising 214 4.",
        "\\ high falling to low 51 5.",
        "• neutral 5",
        "For example, the syllable /W0'7, meaning \"I\" in English, has a low rising tone.",
        "Since there are only about 400 different syllables in the whole Mandarin language, the tone is crucial in signifying the meaning of words.",
        "This property of Mandarin is distinct from the English sounds."
      ]
    },
    {
      "heading": "COMPUTATIONAL ANALYSIS OF DATA",
      "text": [
        "In computational linguistics, it is essential to have a large collection of data in order to derive reliable results.",
        "The help of a"
      ]
    },
    {
      "heading": "COMPUTATIONAL ANALYSIS OF MANDARIN SOUNDS 373",
      "text": [
        "computer is indispensable.",
        "In this study, computational analysis of a corpus composed of more than 750,000 samples of Mandarin syllables was made.",
        "More details .can be found in Suen (1979 b).",
        "Owing to the limitation of space here, this paper only compares the frequency distribution of Mandarin and English phonemes.",
        "The distribution of English sounds was derived from a study conducted by Carterette and Jones (1974).",
        "Their phonemic frequencies were obtained from a transcription of 15,694 words spoken by 24 subjects.",
        "REMARKS ON MANDARIN/ENGLISH SOUNDS From Tables 1 and 2, one can make the following observations:",
        "(a) Mandarin consonants occur 8% less frequently than English consonants (b) Semi-vowels are used twice more often in Mandarin than in English (c) Vowels occur more frequently in Mandarin than in English (d) Chinese speakers used diphthongs more often than English speakers (e) Mandarin tones are not evenly distributed and the 4th tone occurs much more frequently than the others (f) Although both English and Mandarin have approximately 40 phonemes, many Mandarin phonemes do not occur in the English language, especially the retroflex and dental sibilant sounds, and the round-lipped vowel u which occur rather frequently (about 12%) in Mandarin conversations (g) There is considerable difference in the distribution of Mandarin and English diphones, triphones, etc.",
        "which affect significantly the formation of syllables in these two languages (h) Considerable difference also occurs between the syllabic structures of English and Mandarin (i) There are many more sound patterns in English (about one'distinct sound for one word) than in Mandarin (only about 1160 distinct sounds in the entire language)",
        "Implications of the above on the learning of Mandarin by English speakers will be discussed.",
        "Their effects on computer synthesis and recognition of Mandarin speech will also be presented.",
        "If time permits, the author wishes to present his new phonetic system which will enable an English speaker to pronounce Mandarin sounds correctly and easily.",
        "Encouraging results of applying this new system in the learning situation will be discussed."
      ]
    },
    {
      "heading": "ACKNOWLEDGEMENTS",
      "text": [
        "This research was supported by a grant from the Kung Chung Wo Co., Ltd. of Hong Kong.",
        "The encouragements of Mr. Peter K. L. Chan is deeply appreciated."
      ]
    }
  ]
}
