{
  "info": {
    "authors": [
      "Michal Chytil"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-2016",
    "title": "Computational Linguistics and Its Role in Mechanized or Man-Machine Cognitive Problem Solving",
    "url": "https://aclweb.org/anthology/C82-2016",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "text": [
        "In the present paper cognitive science will be conceived as a discipline which theoretically supports the following constructing of various cognitive problem solving systems running in a CA mode or in a man-machine mode or in the form of cognitive robots.",
        "The role of computational linguistics in this context will be demonstrated and justified.",
        "1.",
        "Cognitive problem solving.",
        "Hence \"cognition\" is not",
        "considered here as an object of psychological analysis but rather in the sense of a man-machine cognitive process, i.e. of a purpose built point of view.",
        "Therefore, an analogy with industrial mass-production will be emphasized and the necessary theoretical questions for projecting and setting up such efficient mechanized or computer assisted cognitive systems will be studied.",
        "Such systems can be employed especially in scientific research since it presents a systematic form of activity in the field of general cognition.",
        "Following our analogy it is to say that such \"factories on cognition\" should not be identified with usual computing centers.",
        "The considerations will be focused on a so-called cognitiveoproblem.",
        "It is a question raised for inquiry, investigation or discovery, which needs to be solved and where the final solution will present new knowledge.",
        "Non-cognitive problems are designated as technical problems.",
        "Their final solution consists of a desirable change in a material system.",
        "In the following we re-74-strict our account to factual extramathematical cognitive problems the solving of which satisfies necessarily the two conditions: I. a computer is used, at least, partly in the solving I: mathematical means are included, at least, in a part of the process of reasoning (as an algorithm or inferring in a suitable calculus).",
        "The presence of other solving means, such as linguistic-al, methodological, etc.",
        "follows directly from the fact that only factual problems are at stake.",
        "2.",
        "Symbiotic problem solvers.",
        "Cognitive problem-solving procedures consist of operations with concepts, expressions or symbols.",
        "If such a procedure has the character of an algo",
        "rithm we call it a routine _procedure, otherwise it is termed a creative one.",
        "Any goal-seeking performance of such cognitive procedures is considered to be an intelligent activity.",
        "We can by this way unambiguously say that man or machine acts intelligently and avoid by this way such vague expressions as, for instance, 'he'or 'it thinks'.",
        "Systems which can act intelligently are called intelligent agents.",
        "They generally satisfy the following requirements:",
        "(i) they have the ability of performing operations with abstract entities, (ii) they can accept knowledge from other systems (agents) and then use it correctly (i.e. they understand it), (iii) they must be able to communicate knowledge to another, similar system (an agent), (iv) they must have a capacity for memory and be able to learn from their history (1).",
        "Intelligent agents can be used as processors for cognitive problem solving.",
        "Examples of intelligent agents are man, a computer, an animal.",
        "When connecting such agents functionally, but not necessarily, physically, various types of symbiotic intelligent agents can arise, shortly said symbionts (man-computer, a group of people and computer, etc.).",
        "Let us note - 75 - that in a symbiotic connection both man and machine obtain certain exactly circumscribed tasks from a control unit of the whole system.",
        "Man is charged with tasks required by creative procedures w'lreas machine is oharged with the routine ones.",
        "The difference between the symbiotic and the usual interactive connection of man and machine consists in the fact that in the interactive mode man is not controlled and, therefore, he cam act fully independently, using the computer as an efficient tool only.",
        "The sense of a man-machine symbiont emerges perspicuously when accepting the following three assumptions: A.",
        "The solving of each cognitive (solvable) problem can be done by a creative procedure.",
        "Moreover, some of these procedures can be algorithmized (routinized).",
        "B.",
        "Each routine procedure realizable by man is, in principle, also realizable by machine, but not conversely, i.e. there are some routine procedures which are realizable by machine only.",
        "C. Some of the non-routinizable procedures, as in the sense A, can be performed either (i) only by man, or (ii) by machine only, or (iii) by both man and machine.",
        "Obviously various basic kinds of cognitive problem systems, particularly of symbionts can be set up.",
        "Respecting the assumption A we shall prefer cognitive systems where: (a) the solving is routinized whenever possible (ass.",
        "A) or necessary (ass.",
        "B) and we take into account only the mechanized processing of routine procedures, (b) the performance of non-routinizable procedures satisfying ass.",
        "C(i) or C(ii) will be done exclusively by man.",
        "Such systems have not only a broader range but they are not replaceable by a single computer solving system.",
        "They are, moreover, cheaper.",
        "The role of computational linguistics is quite essential in symbiotic systems because the requirements to the number of communications inside and outside of the sys-76- tem grows rapidly.",
        "Let us note that a so-called expert-system° is a vague expression for cognitive problem solving systems constructed on.the principles mentioned above.",
        "3.",
        "Computational linguistics and_jts role in the family of cognitive tools.",
        "A mechanizing cognitive solving process runs within the following general triad: 1.",
        "Knowledge 2.",
        "Form (method) 3.",
        "Processor",
        "Knowledge is partly factual (i.e. taken from the given problem domain), partly auxiliary.",
        "In the latter case its certain part is necessary for the questions arising in connection with the proper construction of the solving system (knowledge backed by computer science, mathematics, logic, methodology of science, psychology, systems theory, cybernetics and (computational) linguistics.",
        "The necessity of the support from the part of computational linguistics is given: by the requirements to the communication and understanding occurring in the definition of intelligent agents, by the ,assumption I., by the assumption I; and by the fact that we have only factual problems in mind.",
        "The representing of a factual structure into a formal one presents one of the most difficult parts of the whole cognitive solving process, by the preference of symbiotic cognitive sstems.",
        "In this way the claims for various kinds and levels of linguistic communication and understanding grow more quickly than they do by the usual machine mode of processing.",
        "The above exemplified importance and needs of computational linguistic tools for a symbiotic cognitive solving process continues obviously even under the condition that the use of the natural language would be, if possible, reduced, i. e. by replacing it by a semiformal or a formal language.",
        "Similarly computational linguistics should not avoid, in this connection, to cover those areas which are presented by various kinds of image processing and manipulation (nonverbal input",
        "output) running in the course of a mechanized cognitive solving process.",
        "4.",
        "Cognitive science.",
        "The above described mechanized or symbiotic cognitive problem solving systems, their construction, maintenance and use present the necessary basis and raison d'etre of computational linguistics.",
        "But neither the computational linguistics itself nor the disciplines and means required by I and I' (computers and mathematics) are sufficient for the given goals.",
        "The rest can be gathered from a set of disciplines called above auxiliary cognitive sciences.",
        "Thus cognitive science has its general methodological background in philosophy, it studies various nonphilosophical methods and nonmaterial tools or arising in the individual cognitive sciences or thanks to some interaction among them and from the viewpoint whether and how such tools could be helpful in the process of mechanized factual cognitive problem solving.",
        "Its object is thus a theory of mechanized cognition.",
        "Its method is partly mathematics, partly logic, partly philosophy.",
        "The development of cognitive science is stimulated by the needs of individual factual sciences such as social sciences, biology or physics or by various civic areas of knowledge.",
        "The results of cognitive science are applied in a discipline called cognitive engineering which has the proper construction of the concrete mechanized cognitive problem systems as its duty whereas the use of such systems runs on the particular problems in the course of the single factual disciplines: This approach described in (2) starts from the Bobrow's (3) and Collins (4) the original determination of cognitive science, being, moreover, consistent with the Bedosejev's appeal (5).",
        "It differs in two essential points: firstly in the main pragmatical aim of cognitive science and secondly in its approach to mathematics.",
        "Let us emphasize that the whole act ' ivity called usually (computer assisted) applications of mathematics, makes, according to our approach, a certain part"
      ]
    }
  ]
}
