{
  "info": {
    "authors": [
      "Frank Van Eynde"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-2021",
    "title": "Merging - The Art of Representing Different Levels of Sentence Structure in a Single Analysis Tree",
    "url": "https://aclweb.org/anthology/C82-2021",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "text": [
        "The first example illustrates the merging of a part of speech analysis with a functional analysis.",
        "1.1.",
        "Part of speech analysis and the on line principle A part of speech analysis consists in the assignment of category labels to lexical units.",
        "By adding parsing rules to the categorial analysis one could also carry out the next step of grouping those lexical units into larger syntagmatic units.",
        "The principle governing the part of speech analysis is the on line principle: syntagmatic units are analysed from the left to the right without changing the word order Example: (1) Harry promised me a new car (1') Is rs Harry] Ev promisedXs0 12410( ART a] [A new] [N car]]"
      ]
    },
    {
      "heading": "1.2. Functional analysis and the dependency principle",
      "text": [
        "A functional analysis consists in the assignment of function labels to syntagmatic units.",
        "The principle governing the functional analysis is the dependency principle: every syntagmatic unit (4 sentence)",
        "new The sister nodes of each GOV-node are either terminal nodes, in which case there is no function label specified.",
        "cf. the node of the indefinite article.",
        "Or non-terminal nodes, in which case the function label takes one of the following values: SUJ, DO, IO, MF (= modifier), ...",
        "The function labels specify the kind of relation holding between the head and its dependents.",
        "For instance, \"Harry\" is the subject of \"promised\", \"new\" is a modifier of \"car\", etc."
      ]
    },
    {
      "heading": "1.3. A synthetic representation",
      "text": [
        "Assumption: the part of speech analysis and the functional analysis can be represented in the same tree, since the on line principle and the dependency principle are compatible.",
        "INI , I , ,GOVJ promised 'RO,GOV) LART,0 GAP,MF N,GOVJ Harry me I I n I me a [A,GOVJ car I new -96",
        "2.",
        "A problematic example: the result clause I'll be concerned with the external structure of the result clause only, not with its internal structure; the result clause will, consequently, be treated as an unanalysed syntagmatic unit.",
        "2.1.",
        "A part of speech analysis of the result clause Example: (2) He left so early on Tuesday that we missed him (2') ((PRO he] r",
        ".v left 31Adv so] CAdv early] (r. on] Ex Tuesday) [x that we missed himjj We could add some further structure to this bracketing by subsuming the adjacent adverbs under one node: [EAdv so) rAdv early)] We oan, however, not incorporate the \"that\"-clause into this syntagmatic unit, since the prepositional phrase \"on Tuesday\" intervenes between both parts.",
        "2.2.",
        "A functional analysis of the result clause The crucial question concerning the functional analysis of a sentence like (2) is: which constituent governs the \"that\"-clause?",
        "In other words, where do we have to attach the S-node of the result clause?",
        "For reasons (to be given in the full version of this paper) we propose the following dependence structure for (2): (2\")"
      ]
    },
    {
      "heading": "2.3. A synthetic representation",
      "text": [
        "2.3.1.",
        "Unfortunately, the part of speech analysis and the functional analysis do not match (cf. the disturbance of the word order in (2\").",
        "A marging of the labeled bracketing with the dependency structure would give the following result:",
        "The lowest MP-node dominates no lexical material, and has, consequently, no category label.",
        "The righmost S-node, on the other hand, has no functional label, since it does not bear any dependency relation to the verb.",
        "Important to note is the fact that both deficient nodes are complementary, and that they in fact refer to each other.",
        "In order to make this relation explicit, I propose to add an index (an arbitrary integer) to both nodes: (II) [ Thanks to this coindexing device we are able to merge two levels of sentence structure, although they do not seem to be compatible at first sight.",
        "2.3.2.",
        "The computation of (II) can be performed in a straightforward way:",
        "1.",
        "Es, ... so •••,3 Cs.",
        "• • • [AP,MP EA,GOV sc] C-MP 2.",
        "If there is a that-clause in s', then give it a LS,•gi-node, and attach it immediately under the S.-node.",
        "If there is no such clause, then delete the [-,Migi-node.",
        "it could be argued that the surface subject and the deep subject do not coincide.",
        "Making use of some new notations (to be explained in the full version of this paper) and of the device already known from section 2.3.1.",
        "I propose the following analysis tree for (3):",
        "V110,G01/3 seems that Steve likes her"
      ]
    },
    {
      "heading": "4. Summary",
      "text": [
        "Merging is a technique of representing different levels of syntactic (and semantic) structure in one analysis tree.",
        "In order to make merging work one has to make sure that: 1. each level of analysis is properly defined, i.e. - that there exists a list of possible values for the labels - that there is an algorithm for assigning those values in each particular case - that there is a unifying principle at each level (for instance, the dependency principle at the level of functional analysis).",
        "2.",
        "The relations between the different levels are properly defined.",
        "In order to warrant the latter I have pleaded for -99-adding reference indices to the nodes, thus introducing a new formal device in the grammar a third dimension in the analysis tree.",
        "Some merits of the merging technique in a program .tor automatic translation."
      ]
    }
  ]
}
