{
  "info": {
    "authors": [
      "R. Zuber"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-2073",
    "title": "Explicit Sentences and Syntactic Complexity",
    "url": "https://aclweb.org/anthology/C82-2073",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "text": [
        "French sentence (1) oan be translated into English either by (2) or (3):",
        "(1) Leslie est dtudiante (2) Leslie is a student (3) Leslie is a woman and Leslie is a student",
        "It is clear however that neither (2) nor (3) can be considered as an \"exact\" translation of (1).",
        "Sentence (2) does not carry the information that Leslie is a woman and sentence (3) does not carry this-information in the same way as (1); the fact that Leslie is a woman is presupposed by (1) whereas it is asserted by (3).",
        "In other words sentence (3) is more exoli-AI than sentence (1).",
        "Following Keenan (1973) we will say that a sentence S is more explicit than a sentence Tiff S and T have the same consequences but some presupposition of T is an assertion of S. Not only translations can be more explicit.",
        "For instance (5) is more explicit that (4) since (4) presupposes (6) whereas (5) asserts (6):",
        "(4) Bill knows that Sue has phoned (5) Sue has phoned and Bill knows whether Sue has phoned or not (6) Sue has phoned",
        "Roughly, defining sentences are, more explicit than \"defined\" sentences.",
        "The question which we will try to answer in this paper is the following one: are more explicit sentences - 299 - this paper is the following one: are more explicit sentences syntactically more complex ones (notice that (3) is syntactically more complex than (1) as well as (5) isMore complex than (4)) .",
        "We will show that et least for some simple languages this ie indeed the case: more explicit sentences are syntactically more complex.",
        "We will consider essentially propositional categorial languages, i.e. languages in which we have only the category of sentences and the category of sentential operators.",
        "Since we will distinguish two types of consequences,.",
        "presuppositons and assertions, our language must contain strongly intensional operators.",
        "A sentential operator 0 is said to be strongly.",
        "intensional iff for every possible world w and for every sentence P, if 0(P) is true at w then there exist a sentence P. with the same truth value as P at w and such that 0(P) is false at w (P and P' must be contigent sentences).",
        "Classic modal operators are not strongly intensional.",
        "Now a presupposition can be defined as a consequence which has an argument under the scope of a strongly opaque operator in the presupposing sentence.",
        "More precisely a sentence S presupposes a sentence Tiff S semantically implies T and S is of the form 0(R) where 0 is a strongly intensional operator and R and T have a common argument.",
        "It can be shown that presupposition defined in this way is equivalent to the classical definition, if one accepts a negation which preserves intensionality (cf. Zuber 1980).",
        "Now given a simple measure of syntactic complexity and the above definition of presupposition the following property for our propositional language holds: If S is more explicit than T, then S is syntactically more complex than T. - 300 -"
      ]
    },
    {
      "heading": "References:",
      "text": []
    }
  ]
}
