{
  "info": {
    "authors": [
      "Eva Hajicová",
      "Jarka Vrbova"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-1017",
    "title": "The Role of the Hierarchy of Activation in the Process of Natural Language Understanding",
    "url": "https://aclweb.org/anthology/C82-1017",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "text": [
        "The elements of the stock of knowledge shared ,by the speaker and the hearer change their salience, in the sense of being immediately accessible in the hearers memory.",
        "The hierarchy of salience is argued to be a basic component of a mechanism serving for the identification of reference.",
        "Some of the regularities of this mechanism are discussed, the description of which is a necessary prerequisite of an automatic understanding of connected texts.",
        "1..When discussing the question of what is the main contribution of computational linguistics to theoretical linguistics at one of the panel discussions at Coling 80 in Tokyo, the panelists unanimously pointed to the due emphasis laid on the function of natural language in communication.",
        "In this direction, it is known from the classical Prague School that the topic/focus articulation belongs to the most important aspects connecting the structure of language with the conditions of its use.",
        "However, this articulation' was not examined systematically in most of the main linguistic trends, so that the pioneers who are aware of its importance for natural language understanding (esp.",
        "Grosz, 1977, Reichman, 1978, 1981, McKeown, 1979, Hirst, 1981) attempt to find their own ways.",
        "During the discourse the stock of \"knowledge\" the speaker assumes to share with the hearer changes according to what is \"in the centre of attention\" at the given time point.2 Each utterance has its influence on this hierarchy of salience; however, not every mentioning of an object has the same effect.",
        "The assumption that the degrees of salience constitute a partial ordering is corroborated e.g. by the degrees of consciousness characterized by Chafe (1974).",
        "Let us denote by xa an expression x referring to an object a that is salient to the - degree n in the stock; since the maximum of salience can more easily than other degrees be imagined to be fixed, we denote it by n = 0, reversing the direction of\"growth\" of the degrees; to the left (right) of the arrow we indicate the state immediately preceding (following) the utterance of a sentence S in which x occurs; x c F (T) stands for \"x belongs to the focus (topic) of S\"; P(x ) denotes that a is expressed either by a weak pronoun or is deleted in S, though present in its tectogrammatical represent+ ation (TR);3 withNP some ) we refer to definite NP's and to such NP's as one of the N,etomg.",
        "(of the) N. According to a preliminary empirical investigation it appears that-the following rules concerning the degrees of salience obtain",
        "(cf. a first formulation of some of them in Sgall, 1980a, p.240), where m, n > 0:",
        "(1) If P(x ), then an a – 0 (2) If 11112(x a) C F, then a– + a, (3) If NP (x ) T, then a– + a1 clef –a (4) If an + WI, then br14-2 obtains for every object b that is not itself referred to in the TR of S, but is immediately associated with it (as e.g. teacher or pupil are with school, or parents with child, etc.)",
        "(5) If As for xa, or Concerning xa is present in S, then aa + a1 – (6) If x is not included in the TR of S, not even among the",
        "associated objects (see Rule (4)), then an + aa+2 As was pointed out by Sgall (1967a, p.95f.",
        "; ,1980b), the difference between n = 0 and n = 1 is too small to make the reference assignment univocal (if such specific pronouns as Czech ten, Germander or Engl.",
        "the latter are not present): If Charles met PAUL is followed by He wore his HAT, we may only guess whether he refers to Paul and his to Charles, or vice versa, or whether a third possibility is present.",
        "However, whenever the difference in the degrees of salience is greater, an occurrence of a pronoun or of a definite NP in the next utterance regularly refers - as we want to illustrate in the sequel - to that object which was referred to as the most salient among those that meet the lexical and grammatical conditions of the NP or pronoun (number, gender).",
        "The two main types of the thematic progressions described by Dana (1968; 1976) are important here.",
        "Also Hobbs (1976) specifies a common heuristics for resolving pronouns, which says that we should prefer the subject to an NP in the object position (in other words, since the subject position in English functions as a rule as (a part of) the topic of the sentence, this heuristics says that the tppic is preferably preserved in successive sentences).",
        "Another possible strategy (Hobbs, 1979) includes inferencing and factual knowledge.",
        "In our rules some of the relationships between the salience and the pragmatic relationships of lexical units are treated only in a preliminary way.",
        "Thus e.g. Rule (4) or a similar rule should reflect also a rather common situation when a mentioning of a particular object (or objects) brings into foreground only a fraction of a set of objects that already are in the foreground of the stock of knowledge.",
        "It does not capture the case when the foregrounded object(s) belong to a set the activation of which has already faded away under the threshold of activation; it seems to be a plausible hypothesis that even in such a case the \"rest\" of the objects are being activated beyond this threshold by mentioning the foregrounded object(s), even if to a very low extent.",
        "2.",
        "Let us illustrate the above rules on a fragment of text; we are not concerned with a systematic linguistic analysis of the given text here, but we concentrate on the changes of activation of the elements of the stock of shared knowledge as reflected (and induced) by the discourse.",
        "We restrict ourselves to objects identified by NP-s or pronouns and we leave aside actions and their circumstantial ON THE ROLE OF HIERARCHY OF ACTIVATION 109 qualifications.",
        "The capital letters denote the intonation centre of each clause; for the ease of reference, the clauses are numbered.",
        "A partial preliminary discussion of such a text was presented in Ha-ji6ova and Vrbova (1982).",
        "[1] The school garden was full of CHILDREN.",
        "[2a] They talked NOISILY, [2b] but the teachers did not REPROVE them, [2c] because they were so EXCITED.",
        "[3] Outside PARENTS were waiting.",
        "[4] A group of about five parents grouped around the MICROPHONE.",
        "[5] One of them should probably SPEAK.",
        "[6] The teachers were very SERIOUS.",
        "[7] In fact, ALL ADULTS in the garden were serious.",
        "[8] They were dressed in evening DRESSES.",
        "[9] Concerning the pupils, they had school UNIFORMS.",
        "[10] The smallest had even snow-white COLLARS.",
        "[11a] The tall on the contrary LAUGHED at them, [lib] because they pretended not to be INTERESTED.",
        "[12a] Their teachers did not LIKE that, [12b] while the teachers of the small.",
        "were evidently PROUD.. [13] The parents at the microphone discussed something in a WHISPER.",
        "[14] Then one of them, a father, stepped FORWARD [15] and SAID: [16] The Society of Friends of this school is highly satisfied with the results of our lowest GRADES.",
        "[17] Then he PAUSED.",
        "[18] Some parents in the audience began to MURMUR.",
        "[19] The father at the microphone tried to SILENCE them.",
        "[20] He was puzzled.",
        "[21] The praised children immediately started to CHATTER.",
        "[22] One small pupil SCREAMED: [23] HURRAH!",
        "[24] The teachers of the older pupils made FACES.",
        "[25] The parents who were representatives of the Society wildly GESTICULATED.",
        "[26] A mother suddenly FAINTED.",
        "[27] The courageous child stopped SCREAMING.",
        "[28] His classmates ASKED him so.",
        "[29] The least excited seemed the oldest PUPILS.",
        "[30] The boys CHEWED [31] and the girls GIGGLED.",
        "A simplified list of the most activated objects after the individual utterances: [1] children° school gardeni parents2 school3 pupils3 [2a] children's parents2 school garden3 school5 [2h] children teachersl parents2 school3 [2c] either: children° teachers3 parents2 schools or: teachers° children2 school2 parents4 [3] parents° children` teachers5(3) school5 [4] microphone° parentsli (=those at the micro) parents21 children3 [5] parentsl° microphone2 parents22 children3 [6] teachers1 parentsl3 school3 children3 microphone4 parents25 [7] adults° garden' teachers2 parents12 parents22 school4",
        "The following comments are numbered according to the number of the clause to which they refer.",
        "We omit those clauses the commentary to which follows trivially from the previous comments and from the rules.",
        "[1] In the opening sentence of the text two objects are introduced: the school garden and the children.",
        "Since the latter object is mentioned in the focus of the sentence, it becomes more salient than objects mentioned previously or those activated by their presence in the broader context or situation.",
        "Also the associated objects such as school, pupils, and teachers are now relatively salient.",
        "[2a] The children as a highly salient object in the stock of shared knowledge are referred to in the topic position by a pronoun, which keeps their activation at the same degree (see Rule (1)), while the activation of the other objects (Rule (6))fades away.",
        "[2b] A new object enters the scene: the teachers.",
        "However, their appearance on the scene is not completely new and surprising, because the hearer has already been introduced into the scene of school, which has the teachers associated with it (see Rule (4)).",
        "This is why the teachers can be understood as referring to the teachers of the children and the school which were already mentioned.",
        "In accord",
        "ance with Rule (3) the degree of salience of teachers is 1.",
        "The children remain on the scene - they are reminded by a pronominal reference in the topic and their activation does not fade away (see Rule (1)).",
        "It should be noted that even though the pronoun them is in the final position of the sentence, it is preceded by the intonation centre; it is well known that all participants placed after the intonation centre belong to the topic part of the sentence.",
        "[2c] The pronoun in the topic has an indistinct reference: both teachers and children may be referred to.",
        "This indistinctness of reference is difficult to solve: according to the strategies mentioned in Sect.",
        "2 the two objects are salient enough to be referred to by a weak pronoun, and the teachers as well as the children can be excited in the given situation, so that not even factual knowledge with inferencing gives a safe clue.",
        "The formulation of the text can be characterized as not successful in this point.",
        "However, if the lexical setting of [2c] were changed, as in [2c-] and [2c – ], the indistinctness would disappear, and only one of the two possible candidates of reference would be chosen, namely the teachers in [2c'] and the children [2c\"]: [2c'] ... because they were always kind to their pupils.",
        "[2c\"]... because they were too small to understand the seriousness... [3] A new object is being introduced in the focus of the sentence; again, it can be said that it is not completely new, because it is also given by the broader scene (of family relations: children - parents).",
        "This newly introduced item receives a very high degree of activation, while the other two objects - the children and the teachers - are not mentioned in this sentence at all and thus their activation fades away (see Rule (6)).",
        "[4] The speaker chooses a subset of the most activated set of elements and speaks about this subset; he introduces a new object on the scene, which receives a high degree of activation (see Rule (2)), but since it does not appear in any of the following utterances, this activation later fades away step by step (Rule (6)).",
        "The complement to the set of five parents - the rest of the parents - retains the degree of a rather high activation, see Rule (3).",
        "[6] One of the items the activation of which has been fading away (the teachers) is back on the scene; the teachers may be referred to by a definite NP in the topic since the activation has not been lowered under a certain threshold, which would otherwise lead to an explicit reintroduction.",
        "[9] An explicit reintroduction of the children is preferred by the speaker since the children have not been mentioned in several preceding utterances; their activation has been lowered considerably.",
        "For such strong reactivation expressions such as concerning, as far as ... is concerned, as for ... are used.",
        "[10] Only one subset of the children is explicitly mentioned in this sentence; the activation of this item of knowledge is raised (Rule (3)), but also the complement subset of pupils is \"supported\" in its activation (Rule (1)), which does not fade away as it would be the case if no pupils were mentioned at all (Rule (6)).",
        "[lib] The reference of the pronoun they is again indistinct; it may refer either to the smallest or to the tall pupils.",
        "Neither of the strategies mentioned above helps: both the NP `s the tall (pupils) and the smallest (pupils) are in the topic position of [11a], and both are activated to the same extent: the smallest pupils were referred to in [11a] by pronoun them and the activation-of this item was preserved (Rule (1)); the tall were mentioned by a definite NP in the topic, which keeps their activation.",
        "This indistinctness remains",
        "unsolved even after the utterance of [12a], which adds another indistinct reference (their teachers - whose?",
        "of the smallest?",
        "of the tall?)",
        "and it is only after hearing [12b] that the hearer can decide: there the explicit mentioning of the teachers of the small children resolves the indistinct reference of their in [12a] and at the same time our factual knowledge of the world invites the inference that if the small children pretended not to be interested, their teachers would have nothing to be proud of, so that they in [11b] can refer only to the tall pupils.",
        "[16] The speaker of the direct speech is not mentioned in the quote (only by means of his reference to the Society of Friends of the School, of which he undoubtedly is a member), but the activation of this item does not seem to fade away.",
        "This appears to be a general feature of direct speech, which follows from the semantico-syntactic structure of the direct speech, where the \"direct speech clause\" functions as an object (Patient) of the introductory clause (and the speaker, as the Actor of the sentence, belongs to the TR of the same sentence).",
        "[27] The use of the courageous child to refer to the small pupil who screamed \"Hurrah!\"",
        "offers another example of the inferencing the hearer must perform in order to understand what is the sentence about and to determine the reference, even in cases where full NP-s rather than pronouns are used.",
        "It is also easy to verify that with other variants of the text the weak pronoun they, if it were used after each of the sentences [5](e.g. in 6-: The children observed them, ...) , [6], [13], [18], etc., would lack any referential indistinctness; similarly for he after [14] (where, in fact, the pronoun is deleted),[17], [22], etc.",
        "The referential indistinctness is present (and must be solved by means of inferencing) after such utterances as e.g. [2b], [9], [10], [11a], [12a], where objects with the degrees 0 and 1 can be referred to by the same pronoun.",
        "In a similar way the indistinctness of the reference of nouns can be studied,cf.",
        "e.g. the use of father in [19] (synonymous with he, while in [20] the pronoun and in [27] the noun is necessary).",
        "3.",
        "To conclude, it should be noted that when speaking about the hierarchy of salience (activation) and of degrees of activation of items of the stock of shared knowledge we do not have in mind an absolute scale or linear ordering of elements.",
        "The raise or drop of activation should be always taken as related to the other items of the stock.",
        "In the rules, we use two kinds of raise: a mild one (Rule (3)), and a strong one (Rule (2)); it may be the case that further empirical research will lead us to a more subtle classification.",
        "Also, we are aware that this is a point where linguistic and psychological investigations should go hand in hand.",
        "Anyhow, we are convinced that such an empirical research, if guided by an attempt at a more explicit and systematic description, is of primary importance for (automatic) language comprehension, and as such also for all applicat-ional projects of text understanding.",
        "FOOTNOTES: 1 See Sgall (1967b; 1975), Sgall and HajiCova (1977), Haji6ova and Sgall (1980), Sgall, HajieovA and Benegova (1973).",
        "2 The term \"giveness\" is often used in a similar sense, but it should be born in mind that a \"given\" item may be in contrast, or irrecoverable (in the terms of Halliday), or not identifiable (Chafe), so that a definite noun may well occur inside the focus of a sentence.",
        "3 The TR of a sentence has the form of a dependency tree, labelled by complex symbols with the main predicate as its root; an ordering of the nodes is defined with respect to their so-called communicative dynamism, fulfilling the condition of projectivity; for a detailed description of TR's in the framework of the functional generative description, to which we subscribe, see Sgall (1967a); Hajiaova and Sgall (1980); and Panevova in this volume."
      ]
    },
    {
      "heading": "REFERENCES:",
      "text": []
    }
  ]
}
