{
  "info": {
    "authors": [
      "Jordan Penchev",
      "Vladimir Pericliev"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C82-2055",
    "title": "On Meaning Theoretical and Computational Semantics",
    "url": "https://aclweb.org/anthology/C82-2055",
    "year": 1982
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Institute for Bulgarian Language Chapaev 52, Sofia, Bulgaria Theoretical semantics is concerned with the modelling of meaning proper, and computational semantics (natural language understanding systems, machine translation, dialogue systems), with the modelling of communicative meaning, or meaning as used purposefully by people in communication ('By uttering X with meaning proper Y the speaker intends a communicative maning Z').",
        "The distinction between meaning proper and communicative meaning is difficult to make since in everyday speech, which is the only observable manifestation of meaning, people are apt to confuse the thing itself with what it is intended to stand for as well as for some other reasons (e.g. that both meanings are simultaneosly acquired in our childhood).",
        "It is clearly cut, however, in foreign language acquisition.",
        "In foreign language acquisition people learn the meanings of words and expressions rather than how these meanings are used for the purposes of communication, since in the general case, the latter is part of their own native language knowledge.",
        "This explains why we speak that for a Bulgarian to have learned the meaning of the English I want to sleep is to have learned that in Bulgarian it has meaning equivalents like Iskam da stria, Spi mi se etc., and not to have learned that in communicative acts the former English sentence may be purposefully used by the speaker with the intention of stating that he (she) is willing to sleep, or urging someone to leave him (her) alone so that he (she) can sleep, and so on.",
        "Furthermore, - 226 - we can imagine situations in which one knows the communicative meaning of a language expression without knowing its meaning proper.",
        "Communicative meaning lies at the basis of our intuitive understanding of language.",
        "Understanding of language crucially depends upon different mental processing accomplished by native speakers such as explicating implicit connections in sentences, logical deducing (Schenk, Rieger) etc.",
        "Strictly speaking, this processing does not involve meaning proper and as such is not a part of linguistics.",
        "In this sense, the claim made in current semantic theories that linguistic semantics should explain the intuitive understanding of the language by native speakers is not true, unless, of course, the notion of linguistic meaning is extended to meaninglessness.",
        "In the paper, some cases of unacceptable conceptions of linguistic meaning in the works of semantic theorists are discussed.",
        "For further explication of the difference between meaning proper and communicative meaning (in the sense above) classes of ambiguities are discussed which have different meaning proper but still their different semantic representations preserve the same communicative meaning.",
        "These classes of ambiguities share the same (1) referent, (ii) implication, (iii) presupposition, or (iv) present communicative equivalents , in a leas well-defined way.",
        "In the paper, it is noted that, in addition to deepening its concept of semantics along the lines of studying communicative meaning, as an applied science, computer linguistios searches for strategies avoiding rather than solving some of its moat difficult semantical problems.",
        "'Two such strategies are discussed.",
        "One is concerned with the tackling of the ambiguity between marked and unmarked lexica]: items.",
        "In the other, it is proposed that instead of - 227 - trying to resolve some cases of A. Syntactical ambiguity, and B.",
        "Semantical ambiguity in the analysis (e.g. for the purposes of MT), sentences are synthesized in the target language which are syntactically ambiguous (in the same sense), *so that the user himself, rather than the linguistic analyser, resolves the ambiguities in question.",
        "A. John hit the dog with the long bat (Schenk) (it is not clear whether with the long bat.",
        "is a modifier of MI or of Age may be translated into Bulgarian as Dion udari kudeto d;lgqbalka which preserves the ambiguity of the original sentence (udarl s dalga palka or kudetq -0,s dalga balks).",
        "B.",
        "Now for breakfast we shall want a frying-ban (Harris said it was inqlgestible: but we nearly urged him not to be an ass...) (J.K.Jerome) (it is not clear whether for breakfast they want to eat the frying-pan itself or just need the frying-pan to prepare their breakfast in it) may be translated into Bulgarian as the structurally ambiguous Sutrin triabva edin tigan da sakusim... (triabva tigan H dfttskatilm or As an aid to the above-mentioned strategy, a list is made (within dependency grammar framework) of 36 models of structural ambiguity in English and Bulgarian.",
        "- 228 -"
      ]
    }
  ]
}
