{
  "info": {
    "authors": [
      "Jonathan K. Kummerfeld",
      "Dan Klein"
    ],
    "book": "EMNLP",
    "id": "acl-D13-1027",
    "title": "Error-Driven Analysis of Challenges in Coreference Resolution",
    "url": "https://aclweb.org/anthology/D13-1027",
    "year": 2013
  },
  "references": [
    "acl-D08-1031",
    "acl-D09-1101",
    "acl-D09-1120",
    "acl-D12-1096",
    "acl-D13-1203",
    "acl-H05-1004",
    "acl-M95-1005",
    "acl-N06-2015",
    "acl-N13-2001",
    "acl-P02-1014",
    "acl-P08-4003",
    "acl-P09-1074",
    "acl-P10-2029",
    "acl-W11-1901",
    "acl-W11-1902",
    "acl-W11-1903",
    "acl-W11-1904",
    "acl-W11-1905",
    "acl-W11-1906",
    "acl-W11-1907",
    "acl-W11-1908",
    "acl-W11-1909",
    "acl-W11-1910",
    "acl-W11-1911",
    "acl-W11-1912",
    "acl-W11-1913",
    "acl-W11-1914",
    "acl-W11-1915",
    "acl-W11-1916",
    "acl-W11-1917",
    "acl-W11-1918",
    "acl-W11-1919",
    "acl-W11-1920",
    "acl-W11-1921",
    "acl-W11-1922",
    "acl-W12-4501",
    "acl-W12-4503",
    "acl-W12-4504",
    "acl-W12-4507",
    "acl-W12-4509",
    "acl-W12-4511"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Coreference resolution metrics quantify errors but do not analyze them.",
        "Here, we consider an automated method of categorizing errors in the output of a coreference system into intuitive underlying error types.",
        "Using this tool, we first compare the error distributions across a large set of systems, then analyze common errors across the top ten systems, empirically characterizing the major unsolved challenges of the coreference resolution task."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Metrics produce measurements that concisely summarize performance on the full range of error types, and for coreference resolution there has been extensive work on developing effective metrics (Luo, 2005; Recasens and Hovy, 2011).",
        "However, it is also valuable to tease apart the errors to understand their relative importance.",
        "Previous investigations of coreference errors have focused on quantifying the importance of subtasks such as named entity recognition and anaphoricity detection, typically by measuring accuracy improvements when partial gold annotations are provided (Stoyanov et al., 2009; Pradhan et al., 2011; Pradhan et al., 2012).",
        "For coreference resolution the drawback of this approach is that decisions are often interdependent, and so even partial gold information is extremely informative.",
        "Also, previous work only considered errors by counting links, which does not capture certain errors in a natural way, e.g. when a system incorrectly divides a large entity into two parts, each with multiple mentions.",
        "Recent work has considered some of these issues, but only with small scale manual analysis (Holen, 2013).",
        "We present a new tool that automatically classifies errors in the standard output of any coreference resolution system.",
        "Our approach is to identify changes that convert the system output into the gold annotations, and map the steps in the conversion onto linguistically intuitive error types.",
        "Since our tool uses only system output, we are able to classify errors made by systems of any architecture, including both systems that use link-based inference and systems that use global inference methods.",
        "Using our tool we perform two studies to understand similarities and differences between systems.",
        "First, we compare the error distributions on coreference resolution of all of the systems from the CoNLL 2011 shared task plus several publicly available systems.",
        "This comparison adds to the analysis from the shared task by illustrating the substantial variation in the types of errors different systems make.",
        "Second, we investigate the aggregate behav-ior of ten state-of-the-art systems, providing a detailed characterization of each error type.",
        "This investigation identifies key outstanding challenges and presents the impact that solving each of them would have in terms of changes in the standard coreference resolution metrics.",
        "We find that the best systems are not best across all error types, that a large proportion of span errors are due to superficial parse differences, and that the biggest performance loss is on missed entities that contain a small number of mentions.",
        "This work presents a comprehensive investigation of common errors in coreference resolution, identifying particular issues worth focusing on in future research.",
        "Our analysis tool is available at code.google.com/p/berkeley-coreference-analyser/."
      ]
    },
    {
      "heading": "2 Background",
      "text": [
        "Most coreference work focuses on accuracy improvements, as measured by metrics such as MUC (Vilain et al., 1995), B3 (Bagga and Baldwin, 1998), CEAF (Luo, 2005), and BLANC (Recasens and Hovy, 2011).",
        "The only common forms of further analysis are results for anaphoricity detection and scores for each mention type (nominal, pronoun, proper).",
        "Two exceptions are: the detailed analysis of the Reconcile system by Stoyanov et al. (2009), and the multi-system comparisons in the CoNLL shared task reports (Pradhan et al., 2011, 2012).",
        "A common approach to performance analysis is to calculate scores for nominals, pronouns and proper names separately, but this is a very coarse division (Ng and Cardie, 2002; Haghighi and Klein, 2009).",
        "More fine consideration of some subtasks does occur, for example, anaphoricity detection, which has been recognized as a key challenge in coreference resolution for decades and regularly has separate results reported (Paice and Husk, 1987; Sobha et al., 2011; Yuan et al., 2012; Bjo?rkelund and Farkas, 2012; Zhekova et al., 2012).",
        "Some work has also included anecdotal discussion of specific error types or manual classification of a small set of errors, but these approaches do not effectively quantify the relative impact of different errors (Chen and Ng, 2012; Martschat et al., 2012; Haghighi and Klein, 2009).",
        "In a recent paper, Holen (2013) presented a detailed manual analysis that considered a more comprehensive set of error types, but their focus was on exploring the shortcomings of current metrics, rather than understanding the behavior of current systems.",
        "The detailed investigation presented by Stoyanov et al. (2009) is the closest to the work we present here.",
        "First, they measured accuracy improvements when their system was given gold annotations for three subtasks of coreference resolution: mention detection, named entity recognition, and anaphoricity detection.",
        "To isolate other types of errors they defined resolution classes, based on both the type of a mention, and properties of possible antecedents (for example, nominals that have a possible antecedent that is an exact string match).",
        "For each resolution class they measured performance while giving the system gold annotations for all other classes.",
        "While this approach is effective at characterizing variations President Clinton1 is questioning the legitimacy of George W. Bush's election victory.",
        "Speaking last night to Democratic supporters in Chicago, he said Bush won the election only because Republicans stopped the vote-counting in Florida, and Mr. Clinton1 praised Al Gore's campaign manager, Bill Daley, for the way he handled the election.",
        "?I2 want to thank Bill Daley for his exemplary service as Secretary of Commerce.",
        "He was brilliant.",
        "I2 think he did a brilliant job in leading Vice President Gore to victory myself2.",
        "?",
        "lined and subscripts indicate entities.",
        "One error is a mention missing from the system output, he.",
        "The other is the division of references to Bill Clinton into two entities.",
        "between the nine classes they defined, it misses the cascade effect of errors that only occur when all mentions are being resolved at once.",
        "The only multi-system comparisons are the CoNLL task reports (Pradhan et al., 2011, 2012), which explored the impact of mention detection and anaphoricity detection through subtasks with different types of gold annotation.",
        "With a large set of systems, and well controlled experimental conditions, the tasks provided a great snapshot of progress in the field, which we aim to supplement by characterizing the major outstanding sources of error.",
        "This work adds to previous investigations by providing a comprehensive and detailed analysis of errors.",
        "Our tool can automatically analyze any system's output, giving a reliable estimate of the relative importance of different error types."
      ]
    },
    {
      "heading": "3 Error Classification",
      "text": [
        "When inspecting the output of coreference resolution systems, several types of errors become immediately apparent: entities that have been divided into pieces, spurious entities, non-referential pronouns that have been assigned antecedents, and so on.",
        "Our goal in this work is to automatically assign intuitive labels like these to errors in system output.",
        "A simple approach, refining results by measuring the accuracy of subsets of the mentions, can be misleading.",
        "For example, in Figure 1, we can intuitively see two pronoun related mistakes: a missing mention (he), and a divided entity where the two pieces are the blue pronouns (I2, I2, myself2) and the red proper names (President Clinton1, Mr. Clinton1).",
        "Simply counting the number of incorrect pronoun links would miss the distinction between the two types of mistakes present.",
        "One question in designing an error analysis tool like ours is whether to operate on just system output, or to also consider intermediate system decisions.",
        "We focused on using system output because other methods cannot uniformly apply to the full range of coreference resolution decoding methods, from link based methods to global inference methods.",
        "Our overall approach is to transform the system output into the gold annotations, then map the changes made in the conversion process to errors.",
        "The transformation process is presented in Section 3.1 and Figure 2, and the mapping process is described in Section 3.2 and Figure 3."
      ]
    },
    {
      "heading": "3.1 Transformations",
      "text": [
        "The first part of our error classification process determines the changes needed to transform the system output into the gold annotations.",
        "This five stage process is described below, and an abstract example is presented in Figure 2.",
        "1.",
        "Alter Span transforms an incorrect system mention into a gold mention that has the same head token.",
        "In Figure 2 this stage is demonstrated by a mention in the leftmost entity, which has its span altered, indicated by the change from an X to a light blue circle.",
        "2.",
        "Split breaks the system entities into pieces, each containing mentions from a single gold entity.",
        "In Figure 2 there are three changes in this stage: the leftmost entity is split into a red piece and a light blue piece, the middle entity is split into a dark red piece and an X, and the rightmost entity is split into singletons.",
        "3.",
        "Remove deletes every mention that is not present in the gold annotations.",
        "In Figure 2 this means the four singleton X's are removed.",
        "4.",
        "Introduce creates a singleton entity for each",
        "mention that is missing from the system output.",
        "In Figure 2 this stage involves the introduction of a light blue mention and two white mentions.",
        "5.",
        "Merge combines entities to form the final, completely correct, set of entities.",
        "In Figure 2 the two red entities are merged, the singleton"
      ]
    },
    {
      "heading": "Mentions Spurious mention Entity",
      "text": [
        "1.",
        "Alter Span 2.",
        "Split 3.",
        "Remove 4.",
        "Introduce 5.",
        "Merge",
        "that converts system output (at the top) to gold annotations (at the bottom).",
        "blue entity is merged with the rest of the blue entity, and the two white mentions are merged.",
        "and Merge the Arab region the Arab region iv) Missing Mention the region the region - it",
        "multiple entities are involved, they are marked with subscripts.",
        "Mentions are in the order in which they appear in the text.",
        "All examples are from system output on the dev set of the CoNLL task.",
        "One subtle point in the split stage is how to record an entity being split into several pieces.",
        "This could either be a single operation, one entity being split into N pieces, or N ?1 operations, each involving a single piece being split off from the rest of the entity.",
        "We use the second approach, as it fits more naturally with the error mapping we describe in the following section.",
        "Similarly, for the merge operation, we record N entities being merged as N?1 operations."
      ]
    },
    {
      "heading": "3.2 Mapping",
      "text": [
        "The operations in Section 3.1 are mapped onto seven error types.",
        "In some cases, a single change maps onto a single error, while in others a single error represents several closely related operations from adjacent stages in the error correction process.",
        "The mapping is described below and in Figure 3.",
        "1.",
        "Span Error.",
        "Each Alter Span operation is mapped to a Span Error, e.g. in Figure 3(i), the system mention Gorbachev is replaced by the annotated mention Soviet leader Gorbachev.",
        "2.",
        "Missing Entity.",
        "A set of Introduce and Merge operations that forms an entirely new entity,",
        "e.g. the white entity in Figure 2, and the pills in Figure 3(ii).",
        "This error is still assigned if the new entity includes pronouns that were already present in the system output.",
        "The reasoning for this is that most pronouns in the corpus are coreferent, so including just the pronouns from an entity is not meaningfully different from missing the entity entirely.",
        "3.",
        "Extra Entity.",
        "A set of Split and Remove operations that completely remove an entity, e.g. the rightmost entity in Figure 2, and Figure 3(iii).",
        "As for the Missing Entity error type, this error is still assigned if the original entity contained pronouns that were valid.",
        "4.",
        "Missing Mention.",
        "An Introduce and a Merge that apply to the same mention, e.g. it in Figure 3(iv), and the blue mention in Figure 2.",
        "5.",
        "Extra Mention.",
        "A Split and a Remove that apply to the same mention, e.g. it in Figure 3(v), and the X in the red entity in Figure 2.",
        "6.",
        "Divided Entity.",
        "Each remaining Merge operation is mapped to a Divided Entity error, e.g.",
        "Figure 3(vi), and the red entity in Figure 2.",
        "7.",
        "Conflated Entities.",
        "Each remaining Split op",
        "eration is mapped to a Conflated Entity error, e.g.",
        "Figure 3(vii), and the blue and red entities in Figure 2."
      ]
    },
    {
      "heading": "4 Methodology",
      "text": [
        "Our tool processes the CoNLL task output, with no other information required.",
        "During development, and when choosing examples for this paper, we used the development set of the CoNLL shared task (Hovy et al., 2006; Pradhan et al., 2007; Pradhan et al., 2011).",
        "The results we present in the rest of the paper are all for the test set.",
        "Using the development set would have been misleading, as the entrants in the shared task used it to tune their systems."
      ]
    },
    {
      "heading": "4.1 Systems",
      "text": [
        "We analyzed all of the 2011 CoNLL task systems, as well as several publicly available systems.",
        "For the shared task systems we used the output data from the task itself, provided by the organizers.",
        "For the publicly available systems we used the default configurations.",
        "Finally, we included another run of the Stanford system, with their OntoNotes-tuned parameters (STANFORD-T).",
        "The publicly available systems we used are: BERKELEY (Durrett and Klein, 2013), IMS (Bjo?rkelund and Farkas, 2012), STANFORD (Lee et al., 2013), RECONCILE (Stoyanov et al., 2010), BART (Versley et al., 2008), UIUC (Bengtson and Roth, 2008), and CHERRYPICKER (Rahman and Ng, 2009).",
        "The systems from the shared task are listed in Table 1 and in the references."
      ]
    },
    {
      "heading": "5 Broad System Comparison",
      "text": [
        "Table 1 presents the frequency of errors for each system and F-Scores for standard metrics1 on the test set of the 2011 CoNLL shared task.",
        "Each bar is filled in proportion to the number of errors the system made, with a full bar corresponding to the number of errors listed in the bottom row.",
        "The metrics provide an effective overall ranking, as the systems with high scores generally make fewer errors.",
        "However, the metrics do not convey the significant variation in the types of errors systems make.",
        "For example, YANG and CHARTON are assigned almost the same scores, but YANG makes more than twice as many Extra Mention errors.",
        "1CEAF and BLANC are not included as the most recent version of the CoNLL scorer (v5) is incorrect, and there are no standard implementations available.",
        "The most frequent error across all systems is Divided Entity.",
        "Unlike parsing errors (Kummerfeld et al., 2012), improvements are not monotonic, with better systems often making more errors of one type when decreasing the frequency of another type.",
        "One outlier is the Irwin et al. (2011) system, which makes very few mistakes in five categories, but many in the last two.",
        "This reflects a high precision, low recall approach, where clusters are only formed when there is high confidence.",
        "The third section of Table 1 shows results for systems that were run with gold noun phrase span information.",
        "This reduces all errors slightly, though most noticeably Extra Mention, Missing Mention, and Span Error.",
        "On inspection of the remaining Span Errors we found that many are due to inconsistencies regarding the inclusion of the possessive.",
        "The final section of the table shows results for systems that were provided with the set of mentions that are coreferent.",
        "In this setting, three of the error types are not present, but there are still Missing Mentions and Missing Entities because systems do not always choose an antecedent, leaving a mention as a singleton, which is then ignored.",
        "While this broad comparison gives a complete view of the range of errors present, it is still a coarse representation.",
        "In the next section, we characterize the common errors on a finer level by breaking down each error type by a range of properties."
      ]
    },
    {
      "heading": "6 Common Errors",
      "text": [
        "To investigate the aggregate state of the art, in this section we consider results averaged over the top ten systems: CAI, CHANG, IMS, NUGUES, SANTOS, SAPENA, SONG, STANFORD-T, STOYANOV, URYUPINA-OPEN.2 These systems represent a broad range of approaches, all of which are effective.",
        "In each section below, we focus on one or two error types, characterizing the mistakes by a range of properties.",
        "We then consider a few questions that apply across multiple error types."
      ]
    },
    {
      "heading": "6.1 Span Errors",
      "text": [
        "To characterize the Span Errors, we considered the text that is in the gold mention, but not the system",
        "the extra/missing part of the mention.",
        "mention (missing text), and vice versa (extra text).",
        "We then found nodes in the gold parse that covered just this extra/missing text, e.g. in Figure 3(i) we would consider the node over Soviet leader.",
        "In Table 2 we show the most frequent parse nodes.",
        "Some of these differences are superficial, such as the possessive and the punctuation.",
        "Others, such as the missing PP and SBAR cases, may be due to parse errors.",
        "Of the system mentions involved in span errors, 27.0% do not correspond to a node in the gold parse.",
        "The frequency of punctuation errors could also be parse related, because punctuation is not considered in the standard parser evaluation.",
        "Overall it seems that span errors can best be dealt with by improving parsing, though it is not possible to completely eliminate these errors because of inconsistent annotations."
      ]
    },
    {
      "heading": "6.2 Extra Mention and Missing Mention",
      "text": [
        "We consider Extra and Missing Mentions together as they mirror each other, forming a precision-recall tradeoff, where a high precision system will have fewer Extra Mentions and more Missing Mentions, and a high recall system will have the opposite.",
        "Table 3 divides these errors by the type of mention involved and presents some of the most frequent Extra Mentions and Missing Mentions.",
        "For the corpus statistics we count as mentions all NP spans in the gold parse plus any word tagged with PRP, WP, WDT, or WRB (following the definition of gold mention boundaries for the CoNLL tasks).",
        "The mentions it and you are the most common errors, matching observations from several of the papers cited in Section 2.",
        "However, there is a surprising imbalance between Extra and Missing cases, e.g. it accounts for a third of the extra errors, but only 12% of the Missing errors.",
        "This imbalance may",
        "by properties of the mention and the entity it is in.",
        "be the result of systems being tuned to the metrics, which seem to penalize Missing Mentions more than Extra Mentions (shown in Section 6.7).",
        "In Table 4 we consider the Extra Mention errors and Missing Mention errors involving proper names and nominals.",
        "The top section counts errors in which the mention involved in the error has an exact string match with a mention in the cluster, or whether it has just a head match.",
        "The second section of the table considers the named entity annotations in OntoNotes, counting how often the mention's type matches the type of the cluster.",
        "In all cases shown in the table it appears that systems are striking a balance between these two types of errors.",
        "One exception may be the use of exact string matching for nominals, which seems to be biased towards Extra Mentions.",
        "For these two error types, our observations agree with previous work: the most common specific error is the identification of pleonastic pronouns, named entity types are of limited use, and head matching is already being used about as effectively as it can be."
      ]
    },
    {
      "heading": "6.3 Extra Entities and Missing Entities",
      "text": [
        "In this section, we consider the errors that involve an entire entity that was either missing from the system output or does not exist in the annotations.",
        "Table 5 counts these errors based on the composition of the entity.",
        "There are several noticeable differences between the two error types, e.g. for entities containing one nominal and one pronoun (row 0 1 1) there are far more Missing errors than Extra errors, while entities containing two pronouns (row 0 0 2) have the opposite trend.",
        "It is clear that entities consisting of a single type of mention are the primary source of these errors, accounting for 85.3% of the Extra Entity errors, and 47.7% of Missing Entity errors.",
        "Table 6 shows counts for these cases divided into three groups: when all mentions are identical, when all mentions have the same head, and the rest.",
        "Nominals are the most frequent type in Table 6, and have the greatest variation across the three sec",
        "errors where the entity has just two mentions: a pronoun and either a nominal or a proper name.",
        "tions of the table.",
        "For the Extra column, Exact match cases are a major challenge, accounting for over half of the nominal errors.",
        "These errors include cases like the example below, where two mentions are not considered coreferent because they are generic: everybody tends to mistake the part for the whole.",
        "Here, mistaking the part for the whole is ... For missing entities we see the opposite trend, with Exact match cases accounting for less than 12% of nominal errors.",
        "Instead, cases with no match are the greatest challenge, such as this example, which requires semantic knowledge to correctly resolve: The charges related to her sale of ImClone stock.",
        "She sold the share a day before ...",
        "The other common case in Table 5 is an entity containing a pronoun and a nominal.",
        "In Table 7 we present the most frequent pronouns for this case and the similar case involving a pronoun and a name.",
        "One way of interpreting these errors is from the perspective of the pronoun, which is either incorrectly coreferent (Extra), or incorrectly non-coreferent (Missing).",
        "From this perspective, these errors are similar in nature to those described by Table 3.",
        "However, the distribution of errors is quite different, with it being balanced here where previously it skewed heavily towards extra mentions, while that was balanced in Table 3 but is skewed towards being part of Missing Entities here.",
        "Extra Entity errors and Missing Entity errors are particularly challenging because they are dominated by entities that are either just nominals, or a nominal and a pronoun, and for these cases the string matching features are often misleading.",
        "This implies that reducing Extra Entity and Missing Entity errors will require the use of discourse, context, and semantics.",
        "grouped by the Name / Nominal / Pronoun composition of the parts involved."
      ]
    },
    {
      "heading": "6.4 Conflated Entities and Divided Entities",
      "text": [
        "Table 8 breaks down the Conflated Entities errors and Divided Entity errors by the composition of the part being split/merged and the rest of the entity involved.",
        "Each 1+ indicates that at least one mention of that type is present (Name / Nominal / Pronoun).",
        "Clearly pronouns being placed incorrectly is the biggest issue here, with almost all of the common errors involving a part with just pronouns.",
        "It is also clear that not having proper names in the rest of the entity presents a challenge.",
        "One particularly noticeable issue involves entities composed entirely of pronouns, which are often created by systems conflating the pronouns of two entities together.",
        "Table 8 aggregates errors by the presence of different types of mentions.",
        "Aggregating instead by the exact composition of the incorrect part being conflated or divided we found that instances with a part containing a single pronoun account for 38.9% of conflated cases and 35.8% of divided cases.",
        "Finally, it is worth noting that in many cases a part is both conflated with the wrong entity, and divided from its true entity.",
        "Only 12.6% of Conflated Entity errors led to a complete gold entity with no other errors, and only 21.3% of Divided Entity errors came from parts that were not involved in another error.",
        "Conflated Entities and Divided Entities are dominated by pronoun link errors: cases where a pronoun was placed in the wrong entity.",
        "Finding finer characterizations of these errors is difficult, as almost any division produces sparse counts, reflecting the long tail of mistakes that make up these two error types."
      ]
    },
    {
      "heading": "6.5 Cataphora",
      "text": [
        "Cataphora (when an anaphor precedes its antecedent) is a pronoun-specific problem that does not fit easily in the common left-to-right coreference resolution approach.",
        "In the CoNLL test set, 2.8% of the pronouns are cataphoric.",
        "In Table 9 we show how well systems handle this challenge by counting mentions based on whether they are cataphoric in the annotations, are cataphoric in the system output, and whether the antecedents match.",
        "Systems handle cataphora poorly, missing almost all of the true instances, and introducing a large number of extra cases.",
        "However, this issue is a fairly small part of the task, with limited metric impact."
      ]
    },
    {
      "heading": "6.6 Entity Properties",
      "text": [
        "Gender, number, person, and named entity type are properties commonly used in coreference resolution systems.",
        "In some cases, two mentions with different properties are placed in the same entity.",
        "Some of these cases are correct, such as variation in person between mentions inside and outside of quotes.",
        "However, many of these cases are errors.",
        "In Table 11 we present the percentage of entities that contain mentions with properties of more than one type.",
        "For named entity types we considered the annotations in OntoNotes; for the other properties we derive them from the pronouns in each cluster.",
        "For all of the properties, there are many entities that we could not assign a value to, either because no named entity information was available, or because no pronouns with an unambiguous value for the property were present.",
        "For named entity information, OntoNotes only has annotations for 68% of gold entities, suggesting that named entity taggers are of limited usefulness, matching observations on the MUC and ACE corpora (Stoyanov et al., 2009).",
        "The results in the ?Gold?",
        "column of Table 11 in",
        "with properties that disagree.",
        "dicate possible errors in the annotations, e.g. in the 0.7% of entities with a mixture of named entity types there may be mistakes in the coreference annotations, or mistakes in the named entity annotations.3 However, even after taking into consideration cases where the mixture is valid and cases of annotation errors, current systems are placing mentions with different properties in the same clusters."
      ]
    },
    {
      "heading": "6.7 Impact of Errors on Metric Scores",
      "text": [
        "Table 10 shows the performance impact of correcting errors of each type.",
        "The Span Error row gives improvements over the original scores, while all other rows are relative to the scores after Span Errors are corrected.4 By fixing each of the other error types in isolation, we can get a sense of the gain if just that error type is addressed.",
        "However, it also means some mentions are incorrectly placed in the same cluster, causing some negative scores.",
        "Interaction between the error types and the way the metrics are defined means that the deltas do not",
        "changes relative to the state of the entities after the Span Errors are corrected, e.g. in Figure 2 a blue and red entity is split that previously contained an X instead of one of the blue mentions.",
        "add up to the overall average gap in performance, but it is still clear that every error type has a noticeable impact.",
        "Missing Entity errors have the most substantial impact, which reflects the precision oriented nature of many coreference resolution systems."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "While the improvement of metrics and the organization of shared tasks have been crucial for progress in coreference resolution, there is much insight to be gained by performing a close analysis of errors.",
        "We have presented a new means of automatically classifying coreference errors that provides an exhaustive view of error types.",
        "Using our tool we have analyzed the output of a large set of coreference resolution systems and investigated the common challenges across state-of-the-art systems.",
        "We find that there is considerable variability in the distribution of errors, and the best systems are not best across all error types.",
        "No single source of errors stands out as the most substantial challenge today.",
        "However, it is worth noting that while confidence measures can be used to reduce precision-related errors, no system has been able to effectively address the recall-related errors, such as Missed Entities.",
        "Our analysis tool is available at code.google.com/p/berkeley-coreference-analyser/."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We would like to thank the CoNLL task organizers for providing us with system outputs.",
        "This work was supported by a General Sir John Monash fellowship to the first author and by BBN under DARPA contract HR0011-12-C-0014."
      ]
    }
  ]
}
