{
  "info": {
    "authors": [
      "Glyn Morrill"
    ],
    "book": "Computational Linguistics",
    "id": "acl-J00-3002",
    "title": "Incremental Processing and Acceptability",
    "url": "https://aclweb.org/anthology/J00-3002",
    "year": 2000
  },
  "references": [
    "acl-C90-2030",
    "acl-E89-1002",
    "acl-E99-1009",
    "acl-P89-1033"
  ],
  "sections": [
    {
      "text": [
        "Universitat Politecnica de Catalunya We describe a left-to-right incremental procedure for the processing of Lambek categorial grammar by proof net construction.",
        "A simple metric of complexity, the profile in time of the number of unresolved valencies, correctly predicts a wide variety of performance phenomena including garden pathing, the unacceptability of center embedding, preference for lower attachment, left-to-right quantifier scope preference, and heavy noun phrase shift."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Contemporary linguistics rests on abstractions and idealizations which, however fruitful, should eventually be integrated with human computational performance in language use.",
        "In this paper we consider the case of language processing on the basis of Lambek categorial grammar (Lambek 1958).",
        "We argue that an incremental procedure of proof net construction affords an account of various processing phenomena, including garden pathing, the unacceptability of center embedding, preference for lower attachment, left-to-right quantifier scope preference, and heavy noun phrase shift.",
        "We give examples of each of these phenomena below.",
        "Garden pathing (Bever 1970) is illustrated by the following contrasts:",
        "(1) a.",
        "The horse raced past the barn.",
        "b.",
        "?The horse raced past the barn fell.",
        "(2) a.",
        "The boat floated down the river.",
        "b.",
        "?The boat floated down the river sank.",
        "(3) a.",
        "The dog that knew the cat disappeared.",
        "b.",
        "?The dog that knew the cat disappeared was rescued.",
        "Typically, although the b sentences are perfectly well formed they are perceived as being ungrammatical due to a strong tendency to interpret their initial segments as in the a sentences.",
        "The unacceptability of centre embedding is illustrated by the fact that while the nested subject relativizations of (4) exhibit little variation in acceptability, the nested",
        "object relativizations (5) exhibit a severe deterioration in acceptability (Chomsky 1965, Chap.",
        "1).",
        "(4) a.",
        "The dog that chased the cat barked.",
        "b.",
        "The dog that chased the cat that saw the rat barked.",
        "c. The dog that chased the cat that saw the rat that ate the cheese barked.",
        "(5) a.",
        "The cheese that the rat ate stank.",
        "b.",
        "?The cheese that the rat that the cat saw ate stank.",
        "c.",
        "?",
        "?The cheese that the rat that the cat that the dog chased saw ate stank.",
        "Discussing such center embedding, Johnson (1998) presents the essential idea developed here, noting that processing overload of dependencies invoked in psycholinguistic literature could be rendered in terms of the maximal number of unresolved dependencies as represented by proof nets.",
        "Kimball (1973, 27) considers sentences such as (6), which are three ways ambiguous according to the attachment of the adverb.",
        "He points out that the lower the attachment of the adverb, the higher the preference (he calls this relationship Right Association).",
        "(6) Joe said that Martha believed that Ingrid fell today.",
        "Left-to-right quantifier scope preference is illustrated by: (7) a.",
        "Someone loves everyone.",
        "b.",
        "Everyone is loved by someone.",
        "Both sentences exhibit both quantifier scopings: (8) a. aVy(love y x) b. Vy3x(love y x)",
        "However, while the dominant reading of (7a) is (8a), that of (7b) is (8b), i.e., the preference is for the first quantifier to have wider scope.",
        "Note that the same effect is observed when the quantifiers are swapped:",
        "(9) a.",
        "Everyone loves someone.",
        "b.",
        "Someone is loved by everyone.",
        "While both sentences in (9) have both quantifier scopings, the preferred readings give the first quantifier wide scope.",
        "Finally, we will look at heavy noun phrase shift, which is the preference for complex object noun phrases to \"shift\" to the end of the sentence.",
        "Consider the two sentences in (10); the second, in which the \"heavy\" direct object follows the indirect object, is more acceptable than the first.",
        "(10) a.",
        "?John gave the painting that Mary hated to Bill.",
        "b. John gave Bill the painting that Mary hated.",
        "We argue that a simple metric of categorial processing complexity explains these and other performance phenomena."
      ]
    },
    {
      "heading": "2. Lambek Calculus",
      "text": [
        "We shall assume some familiarity with Lambek categorial grammar as presented in, for example, Moortgat (1988, 1997), Morrill (1994), or Carpenter (1998), and limit ourselves here to reviewing some central technical and computational aspects.",
        "The types, or (category) formulas, of Lambek calculus are freely generated from a set of primitives by the binary infix connectives \"1\" (over), \" \\ \" (under) (directional divisions) and \"-\" (product).",
        "With respect to a semigroup algebra (L, +) (i.e., a set L closed under an associative binary operation + of adjunction), each formula A is interpreted as a subset [AJI of L by residuation as follows:",
        "A sequent, F A, comprises a succedent formula A and an antecedent configuration F, which is a a finite sequence of formulas.'",
        "A sequent is valid if and only if in all interpretations the ordered adjunction of elements inhabiting the antecedent formulas always yields an element inhabiting the succedent formula.",
        "The following Gentzen-style sequent presentation is sound and complete for this interpretation (Buszkowski 1986, Dogen 1992), and indeed for free semigroups (Pentus 1994): hence the Lambek calculus can make an impressive claim to be the logic of concatenation; a parenthetical notation A (F) represents a configuration containing a distinguished subconfiguration F.",
        "Every rule, with the exception of Cut, where the Cut formula A does not appear in the conclusion, has exactly one connective occurrence less in its premisses than in its conclusion.",
        "Lambek (1958) proved Cut elimination – that every proof has a Cut-free counterpart – hence a decision procedure for theoremhood is given by backward-chaining proof search in the Cut-free fragment.",
        "The nonatomic instances of the id axiom are derivable from atomic instances by the rules for the connectives.",
        "But even in the Cut-free atomic-id calculus there is spurious ambiguity: equivalent derivations differing only in irrelevant rule ordering.",
        "For example, composition as above has the following alternative derivation:",
        "One approach to this problem consists in defining, within the Cut-free atomic-id space, normal form derivations in which the succession of rule application is regulated (Kiinig 1989, Hepple 1990, Hendriks 1993).",
        "Each sequent has a distinguished category formula (underlined) on which rule applications are keyed:",
        "In the regulated calculus there is no spurious ambiguity, and provided there is no explicit or implicit antecedent product, i.e., provided •1_, is not needed, r A is a theorem of the Lambek calculus iff A is a theorem of the regulated calculus.",
        "However, apart from the issue regarding .L, there is a general cause for dissatisfaction with this approach: it assumes the initial presence of the entire sequent to be proved, i.e., it is in principle nonincrementah on the other hand, allowing incrementality on the basis of Cut would reinstate with a vengeance the problem of spurious ambiguity, for then what are to be the Cut formulas?",
        "Consequently, the sequent approach is ill-equipped to address the basic asymmetry of language – the asymmetry of its processing in time – and has never been forwarded in a model of the kind of processing phenomena cited in the introduction.",
        "Morrill Incremental Processing and Acceptability An alternative formulation (Ades and Steedman 1982, Steedman 1997), which from its inception has emphasized a capacity to produce left-branching, and therefore incrementally processable, analyses, is comprised of combinatory schemata such as the following (together with a Cut rule, feeding one rule application into another):",
        "(17) a. A,A\\B B BIA,A B b.",
        "A (B I A)\\B A B I (A\\B) c. A\\B,B\\C A\\C CIB,BIA CIA",
        "By a result of Zielonka (1981), the Lambek calculus is not axiomatizable by any finite set of combinatory schemata, so no such combinatory presentation can constitute the logic of concatenation in the sense of Lambek calculus.",
        "Combinatory categorial grammar does not concern itself with the capture of all (or only) the concatenatively valid combinatory schemata, but rather with incrementality, for example, on a shift-reduce design.",
        "An approach (also based on regulation of the succession of rule application) to the associated problem of spurious ambiguity is given in Hepple and Morrill (1989) but again, to our knowledge, there is no predictive relation between incremental combinatory processing and the kind of processing phenomena cited in the introduction."
      ]
    },
    {
      "heading": "3. Proof Nets",
      "text": [
        "Lambek categorial derivations are often presented in the style of natural deduction or sequent calculus.",
        "Here we are concerned with categorial proof nets (Roorda 1991) as the fundamental structures of proof in categorial logic, in the same sense that linear proof nets were originally introduced by Girard (1987) as the fundamental structures of proof in linear logic.",
        "(Cut-free) proof nets exhibit no spurious ambiguity and play the role in categorial grammar that parse trees play in phrase structure grammar.",
        "Surveys and articles on the topic include Lamarche and Retord (1996), de Groote and Retord (1996), and Morrill (1999).",
        "Still, at the risk of proceeding at a slightly slower pace, we aim nonetheless to include here enough details to make the present paper self-contained.",
        "A polar category formula is a Lambek categorial type labeled with input (') or output (°) polarity.",
        "A polar category formula tree is a binary ordered tree in which the leaves are labeled with polar atoms (literals) and each local tree is one of the following (logical) links:",
        "daughters are labeled with the immediate subformulas of their mothers.",
        "The polarities indicate sequent sidedness, input for antecedent and output for succedent; the polarity propagation follows the sidedness of subformulas in the sequent rules: in the antecedent (input) rule for A\\B the subformula A goes in a succedent (output) and the subformula B goes in an antecedent (input); in the succedent (output) rule for A\\B the subformula A goes in an antecedent (input) and the subformula B goes in a succedent (output); etc.",
        "The labels i and ii indicate whether the corresponding sequent rule is unary or binary.",
        "Note that in the output links the order of the subformulas is switched; this corresponds to a cyclic reading of sequents: the succedent type is adjacent to the first antecedent type.",
        "A proof frame is a finite sequence of polar category formula trees, exactly one of which has a root of output polarity (corresponding to the unique succedent of sequents).",
        "An axiom linking on a set of literal labeled leaves is a partitioning of the set into pairs of complementary leaves that is planar in its ordering, i.e., there are no two pairs {Li, L3}, {1,2, L4} such that L1 < L2 < L3 < L4.",
        "Geometrically, planarity means that where the leaves are ordered on a line, paired leaves can be connected in the half plane without crossing.",
        "Axiom links correspond to id instances in a sequent proof.",
        "A proof structure is a proof frame together with an axiom linking on its leaves.",
        "A proof net is a proof structure in which every elementary (i.e., visiting vertices at most once) cycle crosses the edges of some i-link.2 Geometrically, an elementary cycle is the perimeter of a face or cluster of faces in a planar proof structure.",
        "There is a proof net with roots A° ,A1,.",
        ",A' iff A1, ,A, A is a valid sequent."
      ]
    },
    {
      "heading": "4. Incremental Processing Load and Acceptability",
      "text": [
        "Let us assume the following lexical assignments:",
        "The feature + on S marks the projection of a tensed verb form; a verb phrase modified by past need not be tensed.",
        "Let us consider the incremental processing of (1a) as proof 2 This criterion, adapted from that of Lecomte and Retore (1995), derives from Girard's (1987) long trip condition, which is an involved mathematical result.",
        "Danos and Regnier (1989) express it in terms of acyclicity and connectivity of certain subgraphs.",
        "Intuitively, acyclicity assures that the subformulas of ii-links (binary rules) occur in different subproofs, whereas connectivity assures that the subformulas of i-links (unary rules) occur in the same subproofs (attributed to Jean Gallier by Philippe de Groote, p.c.).",
        "However the single-succedent (intuitionistic) nature of Cut-free categorial proofs in fact renders the connectivity requirement redundant, hence we have just an acyclicity test.",
        "Morrill Incremental Processing and Acceptability net construction.3 In the first case, we suppose that one initially expects some target category, perhaps (though not necessarily) S. This 'principle of expectation' seems a reasonable or obvious principle of communication; as we shall see, it turns out to be technically critical.",
        "After perception of the word the there is the following partial proof net (for simplicity we omit features, included in lexical entries, from proof nets themselves):",
        "Here there are three unmatched valencies/unresolved dependencies; no axiom links can yet be placed, but after horse we can build:",
        "the horse Now there are only two unmatched valencies.",
        "After raced we have, on the correct analysis, the following:",
        "Note that linking the Ns is possible, but we are interested in the history of the correct analysis, and in that, the verb valencies are matched by the adverb that",
        "Observe that a cycle is created, but as required it crosses the edges of an i-link.",
        "At the penultimate step we have:",
        "the horse raced past the The final proof net analysis is given in Figure 1.",
        "The semantics associated with a categorial proof net, i.e., the proof as a lambda term (intuitionistic natural deduction proof, under the Curry-Howard correspondence) is extracted by associating a distinct index with each output division node and traveling as follows, starting by going up at the unique output root (de Groote and Retore 1996): (25) • traveling up at the mother of an output division link, perform the lambda abstraction with respect to the associated index of the result of traveling up at the daughter of output polarity;",
        "• traveling up at the mother of an output product link, form the ordered pair of the result of traveling up at the right daughter (first component) and the left daughter (second component);",
        "Proof net analysis of (la) the horse raced past the barn.",
        "• traveling up at one end of an axiom link, continue down at the other end; • traveling down at an (input) daughter of an input division link, perform the functional application of the result of traveling down at the mother to the result of traveling up at the other (output) daughter; • traveling down at the left (respectively, right) daughter of an input product link, take the first (respectively, second) projection of the result of traveling down at the mother; • traveling down at the (input) daughter of an output division link, return the associated index; • traveling down at a root, return the associated lexical semantics.",
        "Thus for our example we obtain (26a), which is logically equivalent to (26b).",
        "(26) a.",
        "(AxAyAz(past x (y z)) (the barn) A1(race 1) (the horse)) b.",
        "(past (the barn) (race (the horse)))",
        "The analysis of (lb) is less straightforward.",
        "Whereas in (la) raced expresses a one-place predication (\"go quickly\"), in (lb) it expresses a two-place predication (there was some agent racing the horse); horse is modified by an agentless passive participle, but the adverbial past the barn is modifying race.",
        "Within the confines of the Lambek calculus, the characterization we offer assumes the lexical assignment to the passive participle given in the following:4",
        "Let us assign to each proof net analysis a complexity profile that indicates, before and after each word, the number of unmatched literals, i.e., unresolved valencies or dependencies, under process at that point.",
        "This is a measure of the course of memory load in optimal incremental processing.",
        "We are not concerned here with resolution of lexical ambiguity or serial backtracking: we are supposing sufficient resources that the nondeterminism of selection of lexical entries and their parallel consideration is not the critical burden.",
        "Rather, the question is: which among parallel competing analyses places the least load on memory?",
        "Since entropy degrades the structure of memory, it requires more energy to pursue an analysis that is high cost in memory than to pursue one that is low cost.",
        "From these simple economic considerations we derive our main claim:"
      ]
    },
    {
      "heading": "(29) Principle of Acceptability",
      "text": [
        "Acceptability is inversely proportional to the sum in time of the memory load of unresolved valencies.",
        "If other factors are constant, the principle makes a quantitative prediction.",
        "We can distinguish two cases: synonymy and ambiguity In the case of synonymy, semantics is constant.",
        "It is then predicted that amongst synonymous forms of expression, the lower",
        "the complexity curve, the higher the preference for the form of expression.",
        "In the case of ambiguity, prosodics is constant.",
        "It is then predicted that amongst the readings of an ambiguous expression, the lower the complexity curve, the more dominant the reading.",
        "The complexity profile is easily read off a completed proof net: the complexity between two words is the number of axiom links bridging rightwards (forwards in time) at that point.",
        "Thus for (1a) and (1b) analyzed in Figures 1 and 2, the complexity profiles are as follows:",
        "We see that after the first two words the complexity of the locally ambiguous initial segment of (1b) is consistently higher than that of its garden path (1a).",
        "The areas of the a and b curves are 12 and 22 respectively, predicting that in (1b) the less costly but incorrect analysis could be salient, as indeed it is.",
        "Johnson (1998) considers center embedding for subject and object relativization from a similar point of view.",
        "We assume here the relative pronoun lexical assignments shown in (31).5",
        "(31) that - AxAyAz[(y Z) A (X z)] (CN\\CN)/(N\\S+) that - AxAyAz[(y z) A (x z)] (CN CN)/ (S+ /N)",
        "The proof net analysis of sentence (4b) is shown in Figure 3, and that of sentence (5b) is shown in Figure 4.",
        "Let us compare the complexities:",
        "The profile of (5b) is higher; indeed it rises above 8, thus reaching what is usually taken to be the limit of short-term memory.",
        "Johnson attributes the increasing ill-formedness of centre embedded constructions to the number of incomplete dependencies at the \"maximal cut\" of a proof net.",
        "This almost corresponds to the maximum height of a complexity profile here, except Johnson includes no target category, whereas we will argue in relation to quantifier scope preference that this is critical.",
        "However, we also differ from Johnson in attributing relative acceptability to the area under the complexity curve, not only its maximal height.",
        "This is because we believe acceptability is to be explained in terms of the energy required to maintain processes in memory over time, and not just in terms of peak memory load.",
        "Finally, it happens that our proposal solves a problem encountered by Johnson.",
        "Gibson and Thomas (1996) observe that (33a) is easier to comprehend than (33b).",
        "(33) a.",
        "The chance that the nurse who the doctor supervised lost the reports bothered the intern.",
        "b.",
        "?The intern who the chance that the doctor lost the reports bothered supervised the nurse.",
        "Johnson notes that his proposal does not capture this difference since both sentences have the same size maximal cut.",
        "Under our account, on the other hand, it is the complexity curves as a whole that account for acceptability.",
        "In these sentences, although the height is the same, the complexity curves are not: the area of (33a) is less than that of (33b).6 Thus, whereas Johnson must look to other factors to explain this difference, our account makes the correct prediction.",
        "Proof net analyses for (34) Joe said that Martha believed that Ingrid fell today, with lowest (top), middle (center), and highest (bottom) attachment of the adverb today."
      ]
    },
    {
      "heading": "5. Preferred Readings",
      "text": [
        "The examples so far involve comparison of different expressions, having many differences to which their relative acceptabilities could be attributed.",
        "More factors would be held constant by comparing alternative readings of an ambiguous expression, and most appropriately of all, a structurally ambiguous expression, where there is no lexical alternation.",
        "Consider the ambiguity that arises in a sentence such as (34) (repeated from (6)) from the possibility of attaching the adverb at different syntactic levels.",
        "As we saw in the introduction, the lower the attachment of the adverb in such sentences, the higher the preference (Kimball 1973, 27).",
        "(34) Joe said that Martha believed that Ingrid fell today.",
        "In Figure 5 we give the analyses for the lowest, the middle, and the highest attachments.",
        "We now abbreviate proof nets by flattening formula trees into their linear representations (since this conceals the order switching of output links, the notation belies the underlying planarity, but the portrayal of word-by-word complexity is unaltered).",
        "Accordingly, the complexity profiles are:"
      ]
    },
    {
      "heading": "6. Left-to-right Quantifier Scope Preference",
      "text": [
        "Let us consider now another instance of ambiguity: quantifier scope preference.",
        "A rudimentary account of sentence-peripheral quantifier phrase scoping is obtained in Lambek calculus by means of lexical assignments such as the following:7",
        "(St/N)\\St Given these assignments, one analysis of (7a) is that given in Figure 7.",
        "This is the subject wide scope analysis: its extracted and simplified semantics are as in (39).",
        "Proof net analysis for the object wide scope reading of (7a) someone loves everyone (Va).",
        "At the only point of difference, the subject wide scope reading, the preferred reading, has the lower complexity We emphasize that some target category is expected at the start of language processing.",
        "Lambek proof nets have the property that they can be kept planar under any cyclic permutation of the roots; one can view them as a circular list and require planarity on the interior (or exterior) of a disc.",
        "The same proof net would then have different complexity profiles depending on whether one set in axiom links clockwise or counterclockwise.",
        "Language processing, though, takes place in time, which is not cyclic, so we order the roots along a line, starting, according to the principle of expectation, with the target category.",
        "As a reviewer has pointed out, if, for example, the target category were placed at the end of the time line, then the predictions of the relative acceptabilities in (41) would be reversed!",
        "For the passive (7b), let there be assignments as in (42).",
        "The preposition by projects an agentive adverbial phrase; is is a functor over (post)nominal modifiers (the man outside, John is outside, etc.)",
        "and passive loved is treated exactly like passive raced in (27).",
        "A V] analysis of (7b) is given in Figure 9.",
        "This has semantics, after some simplification, as in (43), which is equivalent to (40).",
        "An 3V analysis of (7b) is given in Figure 10.",
        "This has semantics, after some simplification, as in (44), which is equivalent to (39).",
        "Another good test would be to compare different expressions that are synonymous, holding semantics constant.",
        "Our account appears to explain the preference for heavy noun phrases to appear at the end of the verb phrase (heavy noun phrase shift).",
        "Of the following two sentences, repeated from (10), the second is more acceptable:",
        "Proof net analysis for (46b) John gave Bill the painting that Mary hated (bottom) and (46a) John gave the painting that Mary hated to Bill (top)."
      ]
    },
    {
      "heading": "8. Conclusion: Valencies versus Category Complexity",
      "text": [
        "Finally, another dramatic example of unacceptability is provided by the following:8 (48) a.",
        "That two plus two equals four surprised Jack.",
        "b.",
        "?That that two plus two equals four surprised Jack astonished Ingrid.",
        "c.",
        "?",
        "?That that that two plus two equals four surprised Jack astonished Ingrid bothered Frank.",
        "The passive paraphrases, however, seem more or less equally acceptable: (49) a. Jack was surprised that two plus two equals four.",
        "b. Ingrid was astonished that Jack was surprised that two plus two equals four.",
        "c. Frank was bothered that Ingrid was astonished that Jack was surprised that two plus two equals four.",
        "In Figure 12 we give the analysis of (48b) and in Figure 13 that of (49b).",
        "It is very interesting to observe that the complexity profile of the latter is in general lower even though the analysis has more than twice the total number of links."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "For helpful remarks I thank Gabriel Bes, anonymous reviewers, and various audiences, and especially for recent comment, Ewan Klein and Mark Steedman."
      ]
    }
  ]
}
