{
  "info": {
    "authors": [
      "Herve Dejean"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C00-1034",
    "title": "Theory Refinement and Natural Language Learning",
    "url": "https://aclweb.org/anthology/C00-1034",
    "year": 2000
  },
  "references": [
    "acl-E99-1023",
    "acl-J93-2004",
    "acl-P98-1010",
    "acl-P98-1034",
    "acl-W95-0107",
    "acl-W97-1013",
    "acl-W99-0621",
    "acl-W99-0629"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper presents a learning system for identifying syntactic structures.",
        "This system relies on the use of background knowledge and default values in order to build up an initial grammar and the use of theory refinement in order to improve tins grammar.",
        "Tins combination provides a good machine learning framework for Natural Language Learning.",
        "We illustrate tins point with the presentation of ALLiS, a learning system winch generates a regular expression grammar of non-recursive phrases from bracketed corpora."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Applying Machine Learning techniques to Natural Language Processing is a booming domain of research.",
        "One of the reasons is the development of corpora with morpho-syntactic and syntactic annotation (Marcus et al., 1993), (Sampson, 1995).",
        "One recent popular subtask is the learning of non-recursive Nouns Phrases (NP) (Ramshaw and Marcus, 1995), Gijon Kim Sang and Veenstra, 1999), (Munoz et al., 1999), (Group, 1998), (Cardie and Pierce, 1999), (13uchholz et al., 1999).",
        "When other learning techniques (symbolic or statistical) are widely used in Natural Language Learning, theory refinement (Abecker th.d Schmid, 1.996), (Mooney, 1993) seems to be ignored (except (Brunk and Pazzani, 1995)).",
        "Theory refinement consists of improving an existing knowledge base so that it better accords with data.",
        "No work using theory refinement applied to the grammar learning paradigm seems to have been developed.",
        "We would like to point out in tins article the adequacy between theory refinement and Natural Language Learning.",
        "To illustrate this claim, we present ALLiS (Architecture for Learning Linguistic Structures), a learning system which uses theory refinement in order to learn non-recursive noun phrases (also called base noun phrases) and non-recursive verbal phrases.",
        "We will show that this technique combined with the",
        "use of default values provides a good architecture to learn natural language structures.",
        "This article is organised as follows: Section 2 gives an overview of theory refinement.",
        "Section 3 explains the advantage of combining default values and theory refinement to build a learning system.",
        "Section 4 describes the general characteristics of ALLiS, and Section 5 explains the learning algorithm.",
        "The evaluation of ALLiS is described Section 6.",
        "The examples winch illustrate this article correspond to English NPs."
      ]
    },
    {
      "heading": "2 Theory Refinement",
      "text": [
        "We present here a brief introduction to theory refinement.",
        "For a more detailed presentation, we refer the reader to (Abecker and Schmid, 1996), (Brunk, 1996) or (Ourston and Mooney, 1990).",
        "(Mooney, 1993) defines it as: Theory refinement systems developed in Machine Learning automatically modify a Knowledge Base to render it consistent with a set of classified training examples.",
        "This technique thus consists of improving a given Knowledge Base (here a grammar) on the basis of examples (here a treebank).",
        "Sonic impose to modify the initial knowledge base as little as possible.",
        "Applied in conjunction with existing learning techniques (Explanation-Based Learning, Inductive Logic Programming), TB, seems to achieve better results than these techniques used alone (Mooney, 1997).",
        "Theory refinement is mainly used (and has its origin) in Knowledge Based Systems (KBS) (Craw and Sleeman, 1990).",
        "It consists of two main steps:",
        "1..",
        "Build a more or less correct grammar on the basis of background knowledge.",
        "2.",
        "Refine this grammar using training examples: (a) Identify the revision points (b) Correct them",
        "The first; step consists of acquiring an initial grammar (or more generally a knowledge base).",
        "In tins work, the initial grammar is automatically induced",
        "from a tagged and bracketed corpus.",
        "The second step (the refinement) compares the prediction of the initial grammar with the training corpus in order to firstly identify the revision points, i.e. points that are not correctly described by the grammar, and secondly, to correct these revision points.",
        "The error identification and refinement operations are explained Section 5.3.",
        "The main difference between a TB, system and other symbolic learning systems is that a TB, system must be able to revise existing rules given to the system as background knowledge.",
        "(A system such as TBL (Brill, 1993) can not be considered as TR since it only acquires new rules).",
        "In the case of other techniques, new rules are learned in order to improve the general efficiency of the system (selection of the \"best rule\" according to a preference function) and not in order to correct a specific rule."
      ]
    },
    {
      "heading": "3 Theory Refinement, Default values and Natural Language Learning",
      "text": [
        "This section explains how default values combined with theory refinement can provide a good machine learning framework for NLP."
      ]
    },
    {
      "heading": "3.1 The Use of Default Values",
      "text": [
        "The use of default values is not new in NLP (Brill, 1993), (Vergne and Giguet, 1998).",
        "We can observe that often (but not necessarily) in a language, an element belongs to a predominant class (Vergne and Giguet, 1998).",
        "Some systems such as stochastic models use this property implicitly.",
        "Some others use it explicitly.",
        "For instance, the general principle of the Transformation-Based Learning (Brill, 1993) is to assign to each element its most frequent category, and then to learn transformation rules which correct its initial categorisation.",
        "A second example is: the parser described in (Vergne and Giguet, 1998).",
        "They first assign to each grammatical word a default category (default tag), and then might modify it thanks to local contexts and grammatical relation assignment (in order to deal with constraints due to long distance relations which can not be expressed by local contexts).",
        "The main work is done by the lexicon and by default values (even if further operations are obviously necessary) These approaches are thus different for the disambiguation often used in tagging.",
        "The default rules are not numerous (one per tag), easy to automatically generate but they nevertheless produce a satisfactory starting level."
      ]
    },
    {
      "heading": "3.2 The Combination of Default Values with TR",
      "text": [
        "The idea on which ALLiS relies is the following: a first \"naive grammar\" is built up using default values, and then TB, is used in order to provide a \"more realistic grammar\".",
        "This initial grammar assigns to each element its default category (the algorithm is explained in Section 5.2).",
        "The rules learned are categorisation rules: assign a category to an element (a tag or a word).",
        "Since an element is automatically assigned to its default category, the system has not to learn the categorisation rules for its category, and just learns categorisation rules which correspond to cases in which the element does not belong to its default category.",
        "This minimised the number of rules that have to be learned.",
        "Suppose the element c can belong to several categories (a frequent case).",
        "The first rule learned is the \"default\" rule: assign(c,de), where de is the default category of e. Then ALLiS just learns rules for cases where c does no belong to its default category.",
        "The numerous rules concerning the default category are replaced by the simple default rule."
      ]
    },
    {
      "heading": "4 ALLiS",
      "text": [
        "The goal of ALLiS1 is to automatically build a regular expression grammar from a bracketed and tagged corpus2.",
        "In this training data, only the structures we want to learn are marked at their boundaries by square brackets'.",
        "The following sentence shows an example of the training corpus for the NP structure (only base-NPs occur inside brackets).",
        "Following the principle of theory refinement, the learning task is composed of two steps.",
        "The first step is the generation of the initial grammar.",
        "This grammar is generated from examples and background knowledge (Section 5).",
        "This initial grammar provides an incomplete and/or incorrect analysis of the data.",
        "The second step is the refinement of this grammar (Section 5.3).",
        "During this step, the validity of the grammar rules is checked and the rules are improved (refined) if necessary.",
        "This improvement corresponds to find contexts in which elements which lhttp: //www.sfb441.uni-tuebingen.derdejean/ chunker.html."
      ]
    },
    {
      "heading": "2 The WSJ corpus (Marcus et al., 1993).",
      "text": [
        "'(Munoz et al., 1999) showed that this representation tends to provide better results than the representation used in (Ramshaw and Marcus, 1995) where each word is tagged with a tag I(inside), 0(outside), or B(breaker).",
        "are considered to be members of the structure do not belong to this structure (and reciprocally).",
        "We give here a simple example to illustrate the learning process.",
        "The first step (initial grammar generation) categorises the tag JJ (adjective) as belonging by default to the NP structure if it occurs before a noun.",
        "The second step (refinement) finds out that some adjectives do not obey to these rules'.",
        "The refinement is triggered in order to modify the default rule so that these exceptions can be correctly processed.",
        "Thus, the learning algorithm simply consists of categorising the elements of the corpus (tags and words) into specific categories, and this categorisation allows the extraction of the structures we want to learn.",
        "These categories are explained in the next section."
      ]
    },
    {
      "heading": "5 The Learning System",
      "text": []
    },
    {
      "heading": "5.1 The Background Knowledge",
      "text": [
        "hi order to ease the learning, the system uses background knowledge.",
        "This knowledge provides a formal and general description of the structures that ALIAS can learn.",
        "We suppose that the structures are composed of a nucleus with optional left and right adjuncts.",
        "We here give infi-irmal definitions, the formal/distributional ones are given in Section 5.2.",
        "The nucleus is the head of the structure.",
        "We authorise the presence of several nuclei in the same structure.",
        "All the other elements in the structure (except the linker) are considered as adjuncts.",
        "They are in dependence relation with the head of the structure.",
        "The adjuncts are characterised by their position (left/right) relative to the nucleus.",
        "A linker is a special element winch builds an en-docentric structure with two elements.",
        "It usually corresponds to coordination'.",
        "An element (nucleus or adjunct) might possess the break property.",
        "This notion is introduced (as in (Ramshaw and Marcus, 1995), (Mulioz et al., 1999)) in order to deal with sequences where adjacent nuclei compose several structures (Section 5.2.4).",
        "This pattern can be seen as a variant of the X-bar template (Head, Spec and Comp), which was already used in a learning system (I3erwick, 1985) (although Comp is not useful for the non-recursive structures).",
        "The possible different categories of an element are summarised in Figure 5.1.",
        "The following sentence shows an example of categorisation (elements which do not appear in the structure (NP) are tagged 0):",
        "The symbol * corresponds to the Kleene star.",
        "For the sake of legibility, we do not introduce linkers in tins expression.",
        "But each symbol X (NU, A) can be defined by the rule' X – > X X 1 X where 1 is the list of linkers.",
        "The symbols B+ and 13 – indicate whether the element has the breaker property or not.",
        "Since the corpus does not contain information about these distributional categories, ALIAS has to figure them out.",
        "This categorisation relies on the distributional behaviour of the elements, and can be automatically achieved."
      ]
    },
    {
      "heading": "5.2 The Initial Categorisation",
      "text": [
        "The general idea to categorise elements is to use specific contexts which point out some of the distributional properties of the category.",
        "The categorisation is a sequential process.",
        "First the nuclei have to be found out.",
        "For each tag of the corpus, we apply the function j, below).",
        "Tins function selects a list of elements which are categorised as nuclei.",
        "The function f applied to tins list in order to figure out nuclei which are breakers.",
        "Then the adjuncts are found out, and the fiinction f is also applied to them to figure out breakers."
      ]
    },
    {
      "heading": "5.2.1 Categorisation of Nuclei",
      "text": [
        "The context used to find out the nuclei relies on this simple following observation: A structure requires at least one nucleus7.",
        "Thus, the elements that occur alone in a structure are assimilated to nucleus, since a structure requires a nucleus.",
        "For example, the tags PRP (pronouns) and NNP (proper nouns) may compose alone a structure (respectively 99%",
        "and 48% of these tags appear alone in NP) but the tag .1.1 appears alone only 0.009%.",
        "We deduce that PRP and NNP belong to the nuclei and not JJ.",
        "But tins criterion does not allow the identification of all the nuclei.",
        "Some often appear with adjuncts (an English noun (NN) often' occurs with a determiner or an adjective and thus appears alone only 13%).",
        "The single use of this characteristic provides a continuum of values where the automatic set up of a threshold between adjuncts and nuclei is problematic and depends on the structure.",
        "To solve this problem, the idea is to decompose the categorisation of nuclei in two steps.",
        "First we identify characteristic adjuncts.",
        "The adjuncts can not appear alone since they depend on a nucleus.",
        "The function f char is built so that it provides a very small value for adjuncts.",
        "If the value of an element is lower than a given threshold (0char = 0.05), then it is categorised as a characteristic adjunct.",
        "the pattern P in the corpus C. For example the number of occurrences in the training corpus of the pattern [Li] is 99, and the number of occurrences of the pattern JJ (including the pattern [ JJ ]) is 11097.",
        "So f char(JJ) = 0.009, value being low enough to consider J.1 as a characteristic adjunct.",
        "The list provided by fchar for English NP is:",
        "These elements can correspond to left or right adjuncts.",
        "All the adjuncts are not identified, but this list allows the identification of the nuclei as explained in the next paragraph.",
        "The second step consists of introducing these elements into a new pattern used by the function f. nu This pattern matches elements surrounded by these characteristic adjuncts.",
        "It thus matches nuclei which often appear with adjuncts.",
        "Since a sequence of adjuncts (as an adjunct alone) can not alone compose a complete structure, X only matches elements which correspond to a nucleus.",
        "The function 11111 is a good discrimination function between nuclei and adjuncts and provides very low values for adjuncts and very high values for nuclei (table 1)."
      ]
    },
    {
      "heading": "5.2.2 Categorisation of Adjuncts",
      "text": [
        "Once the nuclei are identified, we can easily find out the adjuncts.",
        "They correspond to all the other elements which appear in the context: There are two",
        "If an element appears at the position of the underscore, it is categorised as adjunct.",
        "Once the left adjuncts are found out, they can be used for the categorisation of the right adjuncts.",
        "They thus appear in the context as optional elements (this is helpful to capture circumpositions).",
        "Since the Adjective Phrase occurring inside an NP is not marked in the Upenn treebank, we introduce the class of adjunct of adjunct.",
        "The contexts used to find out the adjuncts of the left adjunct are: [ _ A1 NU ] for the left adjuncts of Ai [ ai*Ai _ NU ] for the right adjuncts of A1 The contexts are similar for adjuncts of right adjuncts.",
        "By definition, a linker connects two elements, and appears between them.",
        "The contexts used to find linkers are:",
        "Elements which occur in these contexts but which have already been categorised as nucleus or adjuncts are deleted from the list.",
        "A sequence of several nuclei (and the adjuncts which depend on them) can belong to a unique structure or compose several adjacent structures.",
        "An element is a breaker if its presence introduces a break into a sequence of adjacent nuclei.",
        "For example, the presence of the tag DT in the sequence NN DT JJ NN introduces a break before the tag DT, although the",
        "sequence NN JJ NN (without DT) can compose a single structure in the training corpus.",
        "... [the/DT coming/VBG week/NN] [the/DT foreign/JJ exchange/NN market/NN] The tag DT introduces a break on its left, but some tags can introduce a break on their right or on their left and right.",
        "For instance, the tag WDT (NU by (lefault) introduces a break on its left and on its right.",
        "In other words, this tag can not belong to the same structure as the preceding adjacent nucleus and to the same structure as the following adjacent nucleus.",
        "These fimctions are used to compute the break property for nuclei, but also for adjuncts (In this case, the pattern X is completed by adding the element NU to the left or to the right of X (the potential adjunct) according to the kind of adjunct (left or right adjunct)).",
        "The table 2 shows some values for some tags.",
        "An element can be a left breaker (DT), a right breaker (no example for English NP at the tag level), or both (PR,P).",
        "The break property is generally well-marked and the threshold is easy to set up (0.66 in practice).",
        "In the refinement step (Section 5.3), the breaker property can be extended to words.",
        "Thus, the word yesterday is considered as a right; breaker, although its tag (NN) is not."
      ]
    },
    {
      "heading": "5.3 The Refinement Step 5.3.1 The notion of reliability",
      "text": [
        "The preceding functions identify the category of an element when it occurs in the structure.",
        "But an element can occur in the structure as well as out of the structure.",
        "For example, the tag VBG is only considered as adjunct; when it occurs in the structure.",
        "Nevertheless, it mainly occurs out; of the structure (84% of its occurrences).",
        "If an element mainly9 occurs out of the structure, it is considered as non-reliable and its default category is OUT.",
        "For each element occurring inside the structure, its reliable is tested.",
        "The initial grammar corresponds to the grammar which only contains the reliable elements.",
        "Its precision and its recall are around 86%.",
        "How is determined the reliability of an element'?",
        "Tins notion of reliable element; is contextual and depends on the category of the element.",
        "For the nuclei, the context is empty.",
        "We just compute the ratio between the number of occurrences in the structure over the number of occurrences occurring outside of the structure.",
        "For the adjuncts, the context includes an adjacent nucleus (on the right for left adjuncts or on the left for right adjuncts).",
        "For instance, the tag .1.1 is categorised as left adjunct for the English NP.",
        "It appears 9617 times before a nucleus and 9489 times in the structure.",
        "It is thus considered as reliable, and its default category is left adjunct.",
        "ln the case where the tag .1,I occurs without nucleus on its right (a predicative use), it is not considered as adjunct; and this kind of occurrences is not used to determine the reliability of the element.",
        "On the contrary, the tag VI IC appears 468 times before a nucleus, but, in this context, it occurs only 138 times in the structure.",
        "This is not enough (29%) to consider the element as a reliable left adjunct, and thus its default; category is OUT.",
        "For the adjunct of adjunct, the context includes adjunct and nucleus."
      ]
    },
    {
      "heading": "5.3.2 Detection of errors",
      "text": [
        "Once the initial grammar is built up, its errors have to be corrected.",
        "The detection of the errors corresponds to a miscategorisation of a tag.",
        "An automatic error done by the initial grammar is to wrongly analyse the structures composed with non-reliable de-ments (false negative examples).",
        "Each time that a non-reliable element occurs in the structure corresponds to an error.",
        "For instance, the initial grammar can not correctly recognise the following sequence as an NP, the default category of the tag 1/JAG being OUT (outside the structure): ... [the/DT coming/VBG week/NN]",
        "The second kind of errors corresponds to sequences wrongly recognised as structures (false positive examples).",
        "This kind of error is generated by reliable elements which exceptionally do not occur in the structure.",
        "In the following example, order/NN occurs outside of the structure, although the default category of the tag NN is NU (nucleus), and thus the initial grammar recognises an NP.",
        "In both kinds of errors, the same technique is used to correct them.",
        "_For this purpose, ALLiS disposes of two Operators, the contextualisation and the lex-icalisation.",
        "The contextualisation consists of finding out contexts in order to fix the errors_ The idea, is to add constra.ints for reeategorising non-reliable elements as reliable'.",
        "The presence of some specific elements can completely change the behaviour of a tag.",
        "The table 3 shows the list of contexts where the tag 17/3.1Y is not categorised as OUT but as left Adjunct.",
        "For each tag occurring in the structure, all the possible contexts' are generated.",
        "For the non-reliable tags (first kind of error), we evaluate the reliability of them contextually, and we delete the contexts in which the tag is still non-reliable (the list of contexts can be empty, and in this case the error can not be fixed).",
        "For the reliable tags (second kind of error), we keep the contexts in which the tag is categorised OUT.",
        "The lexicalisation consists of introducing lexical information: the word level.",
        "Somc words can have a specific behaviour which does not appear at the Part-Of-Speech (PUS) level.",
        "For instance, the word yesterday is a left breaker, behaviour which can not be figured out at the PUS level (Table 4).",
        "The introduction of the lexicalisation improves the result by 2% (Section 6).",
        "The lexicalisation and the contextualisation can be combined when both separately are not powerful enough to fix the error.",
        "For example, the word about tagged 103 (default category of RB: OUT) followed luTlic same technique is used in (Sinaa'an, 1997).",
        "I I The contexts depend on the category of Lim tag, but are just mmposecl of one element.",
        "by the tag CD is recategorised as left adjunct and left breaker (Table 4)."
      ]
    },
    {
      "heading": "6 Evaluation",
      "text": [
        "We now show sonic results and give some comparisons with other works (Table 5).",
        "The results are quite similar to other approaches.",
        "Two rates are measured: precision an recall.",
        "The training data are composed of the sections 15-18 of the Wall Street Journal Corpus (Marcus et 1993), and we use the section 20 for the test corpus] 2, The data is tagged with the Brill tagger.",
        "The works generating symbolic rules like ALLiS are (Ramshaw and Marcus, 1995) (Transformation-Based learning) and (Cardie and Pierce, 1998) (error-driven pruning of treebank grammars).",
        "ALLiS provides better results than them.",
        "(Argamon et al., 1998) use a Memory-Based Shallow Learning system, (Tjong Kim Sang and Veenstra, 1999) the Memory-Based Learning method and (Munoz et al., 1999) Ilse5; a network of linear functions.",
        "The latter work seems to integrate better lexical information since ALIAS gets better results with POS only.",
        "The main errors done by ALLiS are clue to errors of tagging (the corpus is tagged with the Drill tagger) or errors in the bracketing of the training corpus.",
        "Then, the second type of errors concerns \"This data set is available via ftp ://ftp.",
        "cis .upenn.edr/ pub/chunker/.",
        "the coorclinatecl StniCtlireS.",
        "These two types errors correspond to 51% of the overall errors.",
        "We can find the same typology in other :works (Ramshaw and Marcus, 1995), ((.1ardie and Pierce, 1998).",
        "We did tries in iiicIi In inaminity the final grammar, but the only type of errors which can lie manually improved concerns the problem of the quotation marks ([lie improvement is about of (.2% in precision and recall)."
      ]
    }
  ]
}
