{
  "info": {
    "authors": [
      "Cecile Fabre",
      "Christian Jacquemin"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C00-1039",
    "title": "Boosting Variant Recognition With Light Semantics",
    "url": "https://aclweb.org/anthology/C00-1039",
    "year": 2000
  },
  "references": [
    "acl-J96-2004",
    "acl-P98-1112",
    "acl-P99-1051",
    "acl-P99-1071"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "A reasonably simple, domain-independent, large-scale approach of lexical semantics to paraphrase recognition is presented in this paper.",
        "It relies on the enrichment of morphosyntactic rules and the addition of four boolean syntactico-semantic features to a set of 1,023 words.",
        "It results in a significant enhancement of precision of 30% with a slight decrease in recall of 10%."
      ]
    },
    {
      "heading": "1 Overview",
      "text": [
        "The recognition of paraphrases and variants is an important issue in several areas of information retrieval and text understanding.",
        "Merging paraphrastic sentences improves summarization by avoiding redundancy (Barzilay et al., 1999).",
        "Term variant conflation enhances recall in information retrieval by pointing at documents that contain linguistic variants of query terms (Arampatzis et al., 1998).",
        "In (Jacquemin and Tzoukermann, 1999), a technique is proposed for the conflation of morpho-syntactic variants that relies solely on morphological and low-level syntactic features (part-of-speech category, number agreement, morphological relationships, and phrase structure).",
        "An analysis of these results shows the limitation of this approach: correct and incorrect variants cannot be separated satisfactorily on a purely morpho-syntactic basis.",
        "Some additional lexical semantics must be taken into consideration.",
        "In this study we propose a reasonably simple, domain-independent, large-scale approach of lexical semantics to noun-to-verb variant recognition.",
        "It relies on the mere addition of two boolean syntactic features to 449 verbs and two boolean morpho-semantic features to 574 nouns.",
        "It results in a significant enhancement of precision of 30% with a slight decrease in recall of 10%.",
        "This new approach to semantics-human-based, efficient, involving simple linguistic features convincingly illustrates the positive role of linguistic knowledge in information processing.",
        "It confirms that verbs and their semantics play a significant role in document analysis (Klavans and Kan, 1998)."
      ]
    },
    {
      "heading": "2 Morpho-syntactic Approach to Nomino-verbal Variation",
      "text": [
        "In order to illustrate the contribution of semantics to the detection of paraphrastic structures, we focus on a specific type of variation: the verbal variants of Noun-Preposition-Noun terms or compounds in French.",
        "For example, les contraintes r6siduelles darts les copes soul analysees (the residual constraints in the shells are analyzed) is such a verbal variant of analyse de contrainte (constraint analysis).",
        "A.s a baseline for the extraction of these variants, we use a set of five morpho-syntactic transformations for Noun-Preposition-Noun terms reported in (Jacquemin and Tzoukermann, 1999) (see Table 1).1 We use the notation M(Ni)v for the morphological link between the initial term and the transformed structure.",
        "It represents any verb in the same morphological family as For instance, in English, and according to the CELEX database, M(analysis)v = {to analyze, to psychoanalyze}.",
        "Given a 1\\11 P2 N3 structure, these transformations are obtained through corpus-based tuning iTlie following symbols are used for syntactic categories: N (noun), A (adjective), Av (adverb), V (verb), C (coordinating conjunction), P (preposition), and D (determiner).",
        "In the regular expressions, ?",
        "denotes optionality and I disjunction.",
        "Morphologically related words are underlined.",
        "NheadToVRev: N3 (A?",
        "(P A?",
        "N (A (C A)?)?)?",
        "(CD?",
        "Av?",
        "A?",
        "N A?)?",
        "V?",
        "V?",
        "Av?)",
        "M(Ni)v abattage d'arbre (tree cutting) arbres ont t\"te abattus (trees have been cut down) NmodifToV1: 1\\11 ((Av?",
        "A (C Av?",
        "A)?)?",
        "P) M (1\\13)V niOthode d'evaluation (method of evaluation) inahode pour evolve?",
        "(method for evaluating) NmodifToV2: Ni (A?",
        "(V I (PD?",
        "(Av?",
        "A)?",
        "N)?)",
        "(Av?",
        "A)?",
        "A.v?",
        ")M(N3)v zone de destabilisation (region of (lestabilization) zone dt'stabilist'e (destabilized region) NmodifToVRev: M(N3)v (Av?",
        "(P?",
        "D) I (P MA?)",
        "N1 temperature de chauffage (temperature for heating)"
      ]
    },
    {
      "heading": "chauffes a haute temperature (heated at high temperatures)",
      "text": [
        "and correspond basically to four configurations:",
        "1. either N1 or N3 (respectively head and modifier of the initial term) is transformed into a morphologically related verb V, 2. the order of the two content words is retained or reversed, 3. the dependency relation between the two initial nouns is preserved.",
        "For instance, rule NheadToVRev corresponds to transformations in which the head 1101111 is morphologically related to the verb and the order of the two words is reversed; rule NmodifToV (modifier transformed, order retained) has been divided into two subrules: the first one - NmodifroV1 - requires the insertion of a preposition just before the verbal form."
      ]
    },
    {
      "heading": "3 The Limits of the Morpho-syntactic Approach",
      "text": [
        "In the first step of this work, we expected the precision of variant recognition to be controlled in two ways: firstly, by searching for multi-term variants in which the two content words of the initial term are found, directly or via morphological transformation.",
        "Secondly, by defining morpho-syntactic patterns of variation in terms of part-of-speech strings that are allowed to come in between these two content words.",
        "Yet, the sequences found on such a morpho-syntactic basis prove to be of varying quality regarding their ability to provide paraphrases of the initial term.",
        "Consider for instance some of the variants detected Ibr the term comparai-son de rt\"sultat (comparison of results), in which only the first two sequences are good variants: compare les r6sultats (compare the results) (rule NheadToV, pattern M(1\\13)NiDN3) rCsultats enu\"rimentoux sont comport's (experimental results are compared) (rule NheadtoVRev, pattern N3 AVM (N1 )v) compares aux rt\"sultats (compared to the results) (rule NheadToV, pattern M(N1)vPN3) r(su/t6 d'une compainison (resulted from a comparison) (rule NModitToVRev, pattern.",
        "M(N3)vPDN1) Such examples show that morpho-syntactic patterns are too coarse-grained to ensure that the dependency relation between the two pivots (results is the object of the predicate comparison) is maintained.",
        "When trying to define linguistic criteria to evaluate such variants, it appears that the frontier between good and bad variants lies between those that preserve the argument relation between the two content words and those that disrupt it.",
        "This means that, in the verbal variant, the argument relation between the verb and the 1101111 must be the same as the relation between the deverbal noun and the other noun in the nominal term.",
        "None of the five rules ensures that the subcat-egorization frame is preserved.",
        "For instance, if we consider the rule NModifToVRev, we find se",
        "quences that obey this constraint and sequences that violate it2: critare d'evaluation (evaluation criterion) (\"value scion les critercs (evaluated according to the criteria) systame d'evaluation (evaluation system) *---> evalue le systême (evaluated the system) In the second case, the transformation is unacceptable because the instrumental relation expressed in the nominal term becomes an object relation in the verbal sequence.",
        "Even when word order is preserved, the relation between the pivots can be totally different in the term and its transformation, as in: contrOle d'installation (installation control) and contrOle centralise installó (installed centralized control) (rule NModifToV2).",
        "Our aim was to formulate additional constraints in order to control argument structure preservation.",
        "We thus had to cope with problem of handling nominal phrases (NP) in which one of the elements is morphologically linked to a verb.",
        "In French, as in English, the semantics of these nominal phrases is an issue for linguistic description: the two nouns can be linked by the whole range of argument-predicate relations, and very few linguistic elements can be used to decide what relation is expressed.",
        "Here is a brief list of the configurations that are likely to appear in such NPs: - the second noun is the object of the first one: com,paraison de resultat (comparison of result)",
        "- the second noun is the subject of the first one: augmentation de l'inteu„site (increase in intensity) - the second noun is an adjunct: traitement a la chaleur (treating with heat) - the first noun is an adjunct: taux",
        "d'augmentation (increase rate) Our aim was to find a way to use surface linguistic knowledge, as required in such an area of NLP, to deal with the interpretation of these phrases."
      ]
    },
    {
      "heading": "4 Light Semantics for Nomino-verbal Variations",
      "text": [
        "Our approach consisted of two steps: firstly, defining semantic clues for accepting or discarding variants and, secondly, defining new variation patterns based on these features."
      ]
    },
    {
      "heading": "4.1 Filtering Criteria",
      "text": [
        "First, using linguistic results on the semantics of French NPs (Fabre, 1996; Bartning, 1990), we identified predicate-argument configurations that cannot be matched by a given pattern ('reject' heuristics in the sense of (Lapata, 1999)).",
        "For example, when rule NmodifToVRev applies, N1 de N3 terms cannot be paraphrased by verbal sequences in which N1 is the object of the verb, as in: experience d'utilisation (experiment of use) *---> utilisait UM experience (used an ex periment).",
        "In such a configuration, only non-thematic arguments (adjuncts) of the deverbal noun may be found inside the NP.",
        "Similarly, when rule NheadToVRev applies, N1 de N3 terms cannot be paraphrased by verbal sequences in which Ni is the subject of a transitive verb, as in: utilisation de l'experience (use of experiment) experience.",
        "utilisant (experiment using).",
        "This configuration provides variants only when the verb is intransitive or ergative: ergative verbs allow for alternations of the form: NP V (la densite augmente) I one V NP (on augmente la densite).",
        "In this case, the following transformation is correct: augmentation de densite (density increase) / (tensile augmente (density increases)."
      ]
    },
    {
      "heading": "4.2 Enriched Metarules",
      "text": [
        "Once it has been established which transformations should be rejected, we searched for surface linguistic clues that could help us to filter out these undesirable variants.",
        "It led us to the redefinition of the metarules, in two ways: putting additional constraints on the part-of-speech strings that can intervene between the two pivots, and defining new features to add linguistic control upon the application of the rules.",
        "These features are: the prepositional form, the morphological type of the noun, the transitivity of the verb, and the voice (active versus passive).",
        "Here are two examples for the redefinition of the metarules (further details and examples are given in table 3):",
        "refined rule, in which the combinatimi of parts of speech is more restricted: a preposition is required to eliminate object relations from the verbal phrase.",
        "In addition, the morphologically complex 1101111 must; be a processive deverbal.",
        "Transformations such as cxp&icncc d'uti/isation",
        "metarule is refined into three enriched rules, mainly by means of lexical constraints on the verb form.",
        "Only N1 P2 N3 terms where P2 = (10 are treated.",
        "If the verb is transitive, then the verb \"bun must he a past participle (rule NheadtoVRev-Pass), so that the object relation still holds in the variant.",
        "If the verb is intransitive or ergative, then the verb form must be active so that the subject relation holds (rule NheadtoVRev-ActSimp (resp.",
        "NheadtoVRev-ActComp) for simple (resp.",
        "complex) verb forms).",
        "Transformations such as utilisation (10 1'exp6-ience calW.rience utilisant are filtered out.",
        "The refinement of the metarules introduced four linguistic features which had to be encoded in the lexicon (see Table 2), namely: • the morphological nature of the 1101111: the noun is either non deverbal or deverbal.",
        "the latter case, it may correspond to an agent &verbal, which refers to the agent of the verb, e.g. utilisateur (user), or to a processive deverbal, which refers to the action denoted by the verb, e.g. utilisation (use).",
        "• the transitivity of the verb: intransitive and ergative verbs are marked in the lexicon.",
        "This annotation task is not; time-consuming (about 3 hours for 1,023 words) and could be partly automated: characteristic endings could help to detect; processive and agent deverbals.",
        "In addition, intransitive and ergative verbs form a small set of the verbal lexicon (8% of the verbs) which is likely to be partly domain-independent."
      ]
    },
    {
      "heading": "5 Experiments and Evaluations",
      "text": [
        "In this section, we evaluate the variations produced from the two preceding sets of metarules: initial morpho-syntactic variations (henceforth MS) and new variations enriched through light semantics (henceforth MS+S).",
        "The variants are obtained from a 13.2 million-word corpus composed of scientific abstracts in the agricultural domain (in French) and a set of 11,452 terms.",
        "The corpus is analyzed through SYLEX, a shallow parser that builds limited phrase structures and associates each word with an unambiguous syntactic category and a lemma.",
        "Terms are acquired from the output of the SYLEX parser.",
        "Only [N [P N]] structures are selected and only terms that occur at least three times in the corpus are retained.",
        "The numbers of variants extracted through MS and 114S+S are reported in Table 4.",
        "They are arranged in such a way that corresponding variations are aligned horizontally.",
        "For instance, each of the three MS-I-S variations NheadT0V-Comp, NheadToV-Simp or NheadtoV-Prep is a refinement of the MS variation NheadToV.",
        "In other words, the set of variants extracted by these three rich metarules is included into the set of variants extracted by the poor metarule.",
        "These two sets are not equal since the rich metarules are made more selective than the original metartde from which they are derived.",
        "In addition to the output of rich and poor metarules, Table 4 shows, in the third column, the number of co-occurrences associated with these metarules.",
        "Co-occurrences are the least selective filters associated with morpho-syntactic variants; they are expected 1;0 extract all the possible correct; nomino-verbal variations (recall value 1.0).",
        "Given a N1 P2 N3 term, these co-occurrences correspond to a configuration in which Ni co-occurs with a verb that is morphologically related to N3 or N3 CO-OMUrs with a verb related to Nl.",
        "Co-occurrences are extracted from a i1-word window (9 intervening words).",
        "These co-occurrences are used to evaluate the recall values of the filtering metarules.",
        "NheadToV-Comp: avoir Av?",
        "A4(1\\11)Nr Av?",
        "D A?",
        "N3 {(Ni del)) = processive A P2 = de A (M(1\\10v tense) = pastparticiple} comparaison de resultats (comparison of results) a compare les rósultats (has compared results)",
        "exposition a la lumie,re (exposure to light) exposees a la luntiare (exposed to light) NheadtoVRev-Pass: N3 (A?",
        "(P A?",
        "N (A (C A)?)?)?",
        "(C D?",
        "Av?",
        "A?",
        "N A?)?",
        "V?",
        "etre?",
        "Av? )",
        "M(N i)v {(1\\13 agreement) = (M(Ni)v agreement) A P2 = de A (1\\11 dev) = processive A (A4(1\\11 )v tense) = pastparticiple A (M(NONT valence) = transitive} repartition de charge (weight distribution) charge egalement repartie (equally distributed weight)",
        "chute de temperature (drop in temperature) temperature chute (temperature (Irops)",
        "fermentation de jus (juice fermentation) – > jus de raisins fermentes (fermented grape juice) Precision and Recall In order to calculate the precision and recall of the rich and poor metarules and to estimate the gains of semantic enrichment, a set of 1,000 co-occurrences has been randomly chosen among the 159,898 co-occurrences retrieved by the system.",
        "They have been divided into three sets: Si (500 co-occurrences) and S2 and S12 (250 co-occurrences).",
        "S3 has been evaluated independently by the two judges (i.e. the two authors)",
        "in order to test; the level of agreement and S2 and S!2 have been evaluated separately by only one judge each.",
        "Each cooccurrence has been marked as positive (a correct variation), negative (an incorrect; variation) or inevaluable.",
        "In-evaluable cases correspond either to tagging errors or to incorrect; terms such as coque de forme (shell of shape) which is an incomplete term structure because it should be followed by an adjective such as coque de form,: ovule (oval-shaped shell).",
        "Only the cases of agreement between, the two judges are used for the computation of recall and precision values.",
        "The addition of semantics results in an increase of precision of 0.29: from 0.499 for MS to 0.789 for MS+S.",
        "The corresponding decrease of recall is mudi smaller: 0.11 from 0.696 for MS to 0.586 for MS+S.",
        "Precision and recall can be combined into a single measure such as the effectiveness measure Ea given by Formula (1) in which a is a parameter (0 < cm < 1) (van Rijsbergen, 1975): E, varies from 0 to 1.0.",
        "Low values of Ea correspond to combined high recall and high precision.",
        "If we use a = in order to assign an equal importance to precision and recall, the El val",
        "nes are 0.419 for MS and 0.327 for MS+S.",
        "They indicate that the addition of semantics has significantly improved the quality of variant extraction.",
        "Detailed values of recall and precision are shown in Table 5.",
        "Agreement on Judgment Agreement on a classification task can be measured through the kappa coefficient (K).",
        "It evaluates the pairwise agreement among a set of coders making category judgment, correcting for expected chance agreement (Carletta, 1996).",
        "In our case the results of the ternary classification task are given by Table 6.",
        "The simple kappa coefficient; is",
        "hen, 1960).",
        "P0 is flue proportion of times the coders agree and Pe is the proportion of times we would expect them to agree by chance.",
        "The value of the kappa coefficient is 0.91 indicating a good reliability of the evaluation performed by the two independent judges."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "On a linguistic point; of view, this experiment demonstrates that NlaP applications can provide new issues for the description of linguis",
        "tic phenomena.",
        "The problem of linguistic variation in information processing forces the linguist to reconsider paraphrase and transformation mechanisms in a new perspective, based on real linguistic data and on systematic corpus exploration.",
        "The paraphrase judgment is evaluated in a new way, from a practical point of view: two sequences are said to be a paraphrase of each other if the user of an information system considers that they bring identical or similar information content.",
        "Regarding linguistic methodology, this work led us to find \"light\" solutions in terms of lexical encoding to describe complex semantic phenomena.",
        "This approach is promising because it demonstrates that linguistic knowledge can really enhance the results of term recognition beyond the morphology level, and that semantics can be taken into account to some extent."
      ]
    }
  ]
}
