{
  "info": {
    "authors": [
      "Leah Schroeder",
      "Sandra Carberry"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C00-2107",
    "title": "Realizing Expressions of Doubt in Collaborative Dialogue",
    "url": "https://aclweb.org/anthology/C00-2107",
    "year": 2000
  },
  "references": [
    "acl-C96-1059",
    "acl-J98-3002",
    "acl-J99-1001"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "One way to begin a negotiation subdialogue is to express doubt at a proposition.",
        "However, expressions of doubt occur in a variety of forms, each of winch conveys information about the nature of the doubt that is important for the subsequent resolution of the conflict.",
        "This paper presents our work on realizing expressions of doubt appropriately in natural language dialogues."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Participants in a collaborative natural language dialogue must develop mutual beliefs about what is said, what is meant, and the implications for the task at hand.",
        "We may think of each utterance as a proposed change to the agents' common ground (Clark, 1996).",
        "Since autonomous agents enter the dialogue with differing domain, world, and personal knowledge, it is inevitable that sonic beliefs conveyed by an utterance will not be accepted because they conflict with existing beliefs of the agent.",
        "However, it is also the case that these conflicting beliefs will not necessarily result in rejection of the proposed beliefs, but in sub dialogues to negotiate a modification that is acceptable to both agents(Chu-Carroll and Carberry, 1995).",
        "One way to begin such a subdialogue is to express doubt at the beliefs proposed by an utterance.",
        "In the following example, the boldface utterance is expressing doubt at the previous utterance a (Transcripts, 1982)2: H: and – there's no reason why you shouldn't have an ira for last yr J: well i thought they just started this yr",
        "H: oh no.",
        "ira's were available as long as you are not a participant in an existing pension An expression of doubt is an utterance that conveys uncertain disbelief in a proposition that was introduced in an earlier utterance.",
        "An expression of doubt signals that the speaker does not accept the utterance at which she is expressing doubt, but she is neither expressing a \"neutral\" attitude toward it nor rejecting it with certainty'.",
        "In the above example, J cannot be said to be rejecting the proposal outright, because her response indicates that she is uncertain in her disbelief.",
        "A natural language system must be able to express doubt, particularly in cases where it has incomplete or uncertain knowledge.",
        "Examination of natural language corpora shows that expressions of doubt may be realized in a variety of forms.",
        "Furthermore, the form of the utterance conveys information about the nature of the doubt that is important for the subsequent resolution of the conflict.",
        "Thus a collaborative natural language system must be able to generate utterances that convey doubt naturally and effectively.",
        "This paper presents our work on realizing expressions of doubt appropriately in natural language dialogues."
      ]
    },
    {
      "heading": "2 Previous Work",
      "text": [
        "In Chu-Carroll and Carberry (1998) the collaborative planning process is modeled as a Propose-Evaluate-Modify cycle, in which an agent is able to detect conflicts in belief and initiate collaborative negotiation subdialogues to attempt to resolve the conflicts.",
        "They use a modified version of Galliers belief revision mechanism(Galliers, 1992; Logan et al., 1994) to determine whether to accept a proposition and in determining which conflicting beliefs to use to refute an utterance that is not accepted.",
        "However, their work does not address how an expression of doubt should be realized in a natural language utterance.",
        "Vander Linden and Di Eugenio (Vander Linden and Di Eugenio, 1996) studied negative imperatives",
        "in instructional texts.",
        "They used machine learning to correlate features of an action X's relationship to the reader in terms of attention, awareness, and safety, with whether it was realized as Don't X, Never X, or Take care not to X.",
        "In our research, we draw on their notion of identifying how features of the generation context correlate with how an utterance should be expressed.",
        "However, our work differs from theirs in that we must deal with an agent's beliefs motivating his doubt and we consider a wider range of variations in realization."
      ]
    },
    {
      "heading": "3 Communicating an Expression of Doubt",
      "text": [
        "We assume appropriate mechanisms for detecting conflict and determining when to engage in a subdialogue by expressing doubt(Chu-Carroll and Carberry, 1998), as well as an appropriate belief revision mechanism, and in this paper concentrate on how an expression of doubt should be realized as an utterance.",
        "A cooperative agent should be as informative as needed, without expressing too much irrelevant information(Grice, 1975).",
        "Thus, in formulating an expression of doubt, we must consider how much the doubted agent needs to know in order to collaborate in resolving the doubt and how much we can expect him to infer without being explicitly told.",
        "In addition, Clark (1996) argues that participants in discourse select utterances that express their communicative intent efficiently, often in sentence fragments.",
        "Since such efficiency of expression is the expected natural form of discourse, a hearer is likely to derive unintended implications from significantly less economical realizations.",
        "Expressions of doubt, by our definition, signal nonacceptance because of 'uncertain disbelief.",
        "In order for the doubted agent to attempt to collaborate in resolving the doubt, he needs to know several things.",
        "Most basically, he needs to recognize that there is doubt in a particular utterance.",
        "In the absence of an objection to an utterance, the speaker will assume an implicit acceptance(Lambert and Carberry, 1999).",
        "To efficiently negotiate an acceptable resolution to the belief conflict, ideally the doubted agent must know something about the beliefs of the doubting agent; in particular, winch belief(s) are causing her nonacceptance, and the strength of these beliefs.",
        "If the doubted agent decides to retain his original beliefs, this information helps him to construct an argument that will be maximally effective and efficient in his attempt to convince the doubting agent(Chu-Carroll and Carberry, 1998).",
        "To identify how expressions of doubt are realized in naturally occurring dialogue and how these realizations convey the requisite beliefs, we analyzed features of individual expressions of doubt extracted from natural corpora, and correlated the various forms of the utterances with the features of the underlying beliefs.",
        "However, as explained in Section 3.3, the use of machine learning techniques was not appropriate due to the nature of our corpus.",
        "Section 3.1 discusses features of underlying beliefs and Section 3.2 discusses the various forms that an expression of doubt can take.",
        "Section 3.3 then presents a set of rules that relate the two."
      ]
    },
    {
      "heading": "3.1 Belief features",
      "text": [
        "As noted above, beliefs play a prominent role in expressions of doubt, since a speaker will ideally convey enough information for the hearer to discern 1) that she is expressing doubt, 2) what she is doubting, 3) any support she has for the doubt, and 4) the strength of this support.",
        "In addition, speakers tend to differentiate new supporting information from that; winch is already part of the common ground and which should already have been considered.",
        "These beliefs are often not explicitly stated, but are assumed to be inferable by the doubted agent based on ins knowledge of the previous dialogue, knowledge of the other agent's beliefs, a model of stereotypical beliefs, linguistic knowledge, and the particular realization of the doubting agent's utterance.",
        "For example, consider the following assertion and two possible responses, each expressing doubt at the proposition Pdo„bt that John Smith gets $800 a month from Social Security:",
        "5: John Smith gets $800 a month in Social Security.",
        "1) U: Isn't he less than 62 years old?",
        "2) U: $800?",
        "In 1) U relies on mutual domain knowledge to express doubt at Pdoubt by contending some other proposition Pi, that implies -,Pdo„bt(Lambert and Carberry, 1999), namely that Smith is younger than 62.",
        "In the rest of this paper, Pdoubt refers to the doubted proposition and Pi, to a proposition other than Pdo„bt, if any, that is the reason for tins doubt.",
        "In addition, expectations also play a role in expressions of doubt.",
        "In the simplest case, the violated expectation is just that Pdo„bt is false.",
        "In other situations, an agent may have an expectation that a proposition will be false if instantiated with some particular subset of its possible instantiations.",
        "Responses that conflict with these expectations may provoke an expression of doubt, even though the doubting agent may have little or no support for the expectation.",
        "Such violated expectations are often signaled by elliptical fragments, such as response 2) above where U conveys not only that she doesn't",
        "accept Pdo„bt, but also that her doubt sterns from the instantiation of the amount term as $800.",
        "We hypothesize that U might accept a proposition with a different instantiation of the amount term, but U doesn't explicitly state this, and other instantiations may be irrelevant.",
        "A violated expectation will be referred to as Pe and is described further in Section 3.1.2.",
        "When and how these expectations arise is a topic for future research.",
        "We assume the propositions Pdoubt, Pc, and Pi, as well as the fact that we want to express doubt, as inputs to our generation process.",
        "Note that every expression of doubt will be associated with some Pdoubt and some Pe, since for every expression of doubt, there must be some doubted proposition and some inconsistency between the doubting agent's expectations and belief in Pdoubt• There may or may not be an associated Pi, depending on the doubting agent's beliefs supporting doubt.",
        "Lack of a Pi indicates that the agent's belief in --1Pdaubt is unsup-ported`'.",
        "Based on the information that a speaker will ideally convey when expressing doubt (as discussed at the beginning of this section), we hypothesize that the following aspects of a speaker's beliefs are significant factors in how an expression of doubt is realized.",
        "Endorsement of Pdoubt: Refers to the authority behind the asserted proposition, which impacts the strength of the hearer's doubt(Chu-Carroll and Carberry, 1998)",
        "• Expert - The information is coming from a domain expert, or coming from someone with firsthand knowledge (including personal preferences).",
        "• Reliable The agent suggesting the proposition is not an expert, but is considered a generally knowledgeable source.",
        "• Questionable - Information that doesn't come from an expert or reliable agent, or that is stated uncertainly by such an agent.",
        "Pe feature: Pe refers to a violated expectation.",
        "In the following, we identify three kinds of expectations that may be violated by an assertion.",
        "For illustrative purposes, assume that S has made the following assertion: S: The most you will get back on your taxes is $400.",
        "• Term-value: Pe = False(-Pdoubt, _term, _value)",
        "5 Although lmman agents may generally be able to offer some weak support for their beliefs, it is possible, depending on the belief revision system used, to have no supporting evidence for a belief (Logan et al., 1094).",
        "The doubting agent may fail to accept _Rioubt with _term instantiated to _value, due to an expectation that _value is not one of the instantiations of _term that would make -Pdoubt true.",
        "For example, the hearer of the above assertion by S may have expected a much larger value than $400, with little or no support; for this expectation.",
        "• Constraint:",
        "The doubting agent may fail to accept _Pdoubt due to an expectation that _Pdoubt will be false when _term is instantiated with _value, in situations in which _constraint holds.",
        "This constraint is not a term in _Pdoubt, but the doubting agent believes that the speaker of _Pdoubt intends that the constraint hold.",
        "For example, the hearer of the above assertion by S may believe that S means $400 for the whole year, but may have expected a larger amount unless S was referring to, say, quarterly taxes.",
        "• General:",
        "The doubting agent may fail to accept Pdonot in its entirety without having a specific objection to any particular term in the proposition.",
        "3.1.3 Features Associated with Pic Commonality of Pi, refers to the source of the doubting agent's conflicting belief, if any.",
        "• Old - A prior conflicting belief is already part of the explicit; common ground of the dialogue.",
        "• New - The doubting agent doesn't believe that",
        "her conflicting belief is already part of the common ground established by the preceding dialogue.",
        "Endorsement of Pi refers to the strengths of evidence supporting the belief Pi that is in conflict; with the doubted belief.",
        "The endorsements are listed here from strongest to weakest.",
        "• First-hand - Belief is a personal preference or something directly experienced.",
        "• Expert - Belief supported by expert testimony, or thought to be common knowledge among experts in this domain.",
        "• Reliable - Belief communicated from someone who, while not an expert, is generally considered a knowledgeable source of information.",
        "• Default - Belief believed to be common knowledge, in the sense that the speaker strongly believes it and strongly believes that others who belong to a certain community (namely one which she has in common with the other dialogue agent) believe it as well.",
        "6We make the simplifying assumption that only one such proposition has been identified for use in an expression of doubt, as this is the case in all of the expressions of doubt we encountered in our corpus.",
        "We leave consideration of expressing multiple Pi's in one utterance for future work.",
        "• Derived - Belief is derived from other beliefs in such a way that it is considered strong.",
        "• Hypothesis - The belief is derived from other beliefs in such a way that it is considered weak.",
        "This category includes beliefs derived horn analogy with another belief in a similar proposition.",
        "• None - The belief is unsupported.",
        "Endorsement of Implication refers to the strength of evidence supporting the belief that Pi being true implies that Pdoiibt is not true.",
        "The endorsements are listed from strongest to weakest.",
        "We assume the same definitions as the category above and that the two lists lie on the same strength scale.",
        "That is, an implication endorsed as reliable is the same strength as a Pi, endorsed as reliable and stronger than a Pi endorsed as hypothesis.",
        "The only addition to this list is the Logical endorsement to account for instances in which Pil„,b1 can be logically deduced from Pi.",
        "• Logical - --,P,1077bt directly inferred from Pi.",
        "• First-hand 7 o Expert • Reliable • Default • Derived • Hypothesis • None"
      ]
    },
    {
      "heading": "3.2 Form features",
      "text": [
        "Expressions of doubt occur in a variety of forms.",
        "We distinguish them according to the surface form of the utterance, the presence of two clue words, and the specificity of the information conveyed."
      ]
    },
    {
      "heading": "Surface Form",
      "text": [
        "o Surface Negative Question - \"isn't that only worth what someone will pay for it?\" This category also includes negative tag questions.",
        "• Simple interrogative - \"Can I join the IRA when I am 65?\" • Statement as Question - \"I must file a return'?\" This category also includes elliptical fragments such as \"$400?\" • Simple declaration - \"I calculated 10.\" • Proposition within a belief clause - \"I thought they only started this year.\""
      ]
    },
    {
      "heading": "Clue word",
      "text": [
        "• But • Even though",
        "Specificity - General forms of the expression can be more or less specific in the amount of information conveyed.",
        "• Generic: Sentence that is a general question of the previous utterance.",
        "h. you still you have to file a state income tax return as well j. i do?",
        "• Repetition: Repetition of a phrase from previous utterance.",
        "h. OK, what I'd like you to do is lend hint the 20 thousand.",
        "1.",
        "20 thousand?",
        "• Repetition+ : Repetition of phrase from previous utterance plus new information h. right.",
        "the maximum amount of credit that you will be able to get will be $400 on their tax return c. $400 for the whole year?",
        "• Contradict: Presentation of a belief that implies the negation of lido„bt h. and --- there's no reason why you shouldn't have an ira for last yr j. well i thought they just started this yr • Contradict-I-Source: Presentation of a contradictory belief and the source of that belief.",
        "h had told j he must pay tax on his $6256 j. harry another thing.",
        "i have the internal uh revenue uh ask you about that 6250 $ uh since i have the fund he said no!",
        "so what do i do now?",
        "• Explicit+Contradict: Explicit statement of disbelief, followed by a contradictory belief.",
        "b. well oh he uh he belongs to a money snorkel fund now and 7111, they will do that /invest it in gout securities as part of their individual retirement account] for him h. Pm not so sure of it.. they may move it ah into a into a govt securities fund, but Pin not so sure that they can move it into individual securities – check that out"
      ]
    },
    {
      "heading": "3.3 Realizing an Expression of Doubt",
      "text": [
        "Many of the expressions of doubt in our corpus are non-ideal, because they were not recognized as doubt or because information that was not included in the utterance, but could have been, was ultimately needed to resolve the doubt.",
        "Thus it was not appropriate to use the corpus as training data for machine learning.",
        "Consequently, the following rules are based",
        "and implication beliefs that would have caused the form of expression of doubt to be generated.",
        "We also encouraged subjects to write in beliefs which were not included, but none did.",
        "Out of the 60 instances (ten expressions of doubt times six subjects), the subjects five times chose beliefs that we did not represent; as contributing to the doubt and three times failed to recognize a belief that did contribute.",
        "The subjects also rated the beliefs according to strength.",
        "We evaluated these ratings to see if the communicated strengths were correlated with the endorsements of beliefs that would have generated this form.",
        "Since subjects varied in the ranges that they used in rating the strengths of the beliefs, we looked at the scores relative to each subjects ratings of the other beliefs.",
        "Most of the strength ratings were consistent with the rules.",
        "The most frequent inconsistency was the case in which we would have generated a form based on slightly different endorsements for Pi and the implication, but our subjects rated them equivalent strengths.",
        "While it may be the case that people don't actually perceive a difference, it may also he the case that numerical ratings don't fully capture the same information that the notion of endorsements do.",
        "The only significant inconsistency with our rules was one utterance in which doubt was expressed by \"I thought that, but my husband, lie wasn't sure if that just meant ss pension.\" We had represented the husband as a reliable source and .thus generated information about the source of the conflicting proposition.",
        "In this instance, the doubt was not judged very strong by our subjects, and the agent's belief in her husband's expertise as relatively weak.",
        "In future work, we will further explore expressions of doubt for which it is important to communicate the source of information.",
        "We consider this a preliminary evaluation to show that the rules we have formulated thus far are reasonable.",
        "Further evaluation will be needed to provide evidence that subjects really do draw different inferences based on the different forms of expression and that our rules accurately capture these differences."
      ]
    },
    {
      "heading": "5 Conclusion and Future work",
      "text": [
        "This paper has presented rules that could be used by a natural language system to realize expressions of doubt.",
        "We have identified several forms that are used to express doubt in naturally occurring dialogues.",
        "Our rules correlate these forms to beliefs of the doubting agent, taking into consideration the beliefs that must be conveyed for the utterance to be a successful expression of doubt.",
        "Preliminary evaluation shows that the belief feature values in our rules correspond to human sub-.jects' intuitions about the strength of the doubt.",
        "In addition, the beliefs that would generate each form are consistent with the beliefs that the subjects attribute to the doubting agent when that form was used.",
        "Future work will concentrate on refining the features and exploring more explicit; reasoning about the beliefs of the other agent.",
        "We also plan to explore the role of intonation in realizing expressions of doubt."
      ]
    }
  ]
}
