{
  "info": {
    "authors": [
      "Wanying Jin"
    ],
    "book": "Chinese Language Processing Workshop",
    "id": "acl-W00-1216",
    "title": "Text Meaning Representation for Chinese",
    "url": "https://aclweb.org/anthology/W00-1216",
    "year": 2000
  },
  "references": [
    "acl-P98-2216",
    "acl-W99-0509"
  ],
  "sections": [
    {
      "text": [
        "Las Cruces, NM 88003-8001 U.S.A. wanyingacrl.nmsu.eclu"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "This paper describes text meaning representation for Chinese.",
        "Text meaning representation is composed of a set of ontological concept instances along with ontological links among them.",
        "It integrates lexical, textual and world knowledge into a single hierarchical framework.",
        "In NLP application it serves as an interlingual representation for various processing.",
        "The methodology and implementation of text meaning representation is discussed in detail.",
        "1"
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In natural language text processing, it becomes inevitable to require a system having capability to automatically extract and represent the information conveyed in a given text.",
        "The theory and methodology of text meaning representation (TMR) has been studied in the past decade (Nirenburg, 1991; Ma-hesh and Nirenburg, 1996; Beale et al., 1995; Onyshkevych 1997) and its application has been presented in machine translation systems that employ interlingual approach.",
        "An ideal text meaning representation will be a language-neutral description of the linguistic information conveyed in a natural language text.",
        "TMR captures the meanings of words in the text and represents them in a set of ontological concepts interconnected through ontological relations.",
        "In addition, TMR provides information about the lexicon-semantic dependencies as well as stylistic factors.",
        "Based on this study, two supportive resources to compose TMR are ontology and semantic lexicon.",
        "An ontology is a set of knowledge concepts about the world.",
        "It is composed of thou-This work has been supported by the Department of Defense of the United States under contract number MDA-904-92-C-5189.",
        "sands of concepts organized into a particular hierarchy so that each concept is related to other concepts through semantic links (Carlson et al., 1990; Bateman, 1993; Dowell et al.",
        "1995; Nirenburg et al., 1995; Bouaud, et al., 1995; Mahesh et al.",
        "1995;).",
        "Semantic lexicon represents the senses of the words.",
        "Each lexicon entry is a framework that maps a word sense to an ontological concept.",
        "It also includes information about syntax, semantics, morphology and pragmatics, as well as annotation that keep the record of data management.",
        "Over the years, various methodologies have been investigated carrying out the structure of a computational lexicon entry within a knowledge-based framework(Onyshkevych et al., 1995; Viegas and Raskin, 1998; Viegas, 1999; Viegas, et al., 1998a, 1998b).",
        "A semantic parser uses information in the semantic lexicon and makes a decision on word sense disambiguation based on the strategy proposed by Beale et al.",
        "(1995) and Beale(1997).",
        "This paper presents the development and application of text meaning representation for Chinese.",
        "Detailed discussion about the principle for building a computational semantic Chinese lexicon is illustrated in Jin (1999).",
        "The methodology and implementation of word sense disambiguation is fully discussed in Viegas, Jin and Beale(1999a, 1999b, 1999c)."
      ]
    },
    {
      "heading": "2 Overview of Ontology",
      "text": [
        "An ontology is a body of knowledge about the world.",
        "It is a repository of concepts used in meaning representations.",
        "All concepts are organized in a tangled subsumption hierarchy and further interconnected using a system of semantic relations defined among the concepts.",
        "The ontology is put into well-defined",
        "relationships with knowledge sources in the system.",
        "In an NLP application the ontology supplies world knowledge to lexical, syntactic, semantic and pragmatic processes.",
        "In the IVEkroKosmos project,2 the ontological concepts consist of: OBJECT, the static things existing in the world; EVENT, any activities happening in the world, and PROPERTY, the properties of OBJECTS and EVENTs.",
        "The ontology organizes terminological nouns into a taxonomy of objects, verbs into a taxonomy of events, and adjectives into a taxonomy of attributes.",
        "It further includes many ontological relations between objects and events to support a variety of disambiguation tasks.",
        "Currently, the ontology in the MikroKosmos project contains about 5,000 concepts covering a wide range of categories in the world.",
        "Each concept, on average, has 14 relation links.",
        "An example below presents the top three level of the ontology, which differentiates between OBJECT; EVENT and PROPERTY.",
        "Each concept is a frame in which a collection of ontological slots such as DEFINITION, IS-A, SUBCLASSES, INVERSE; case roles such as AGENT, THEME and properties such as HEADED-BY, HAS-MEMBER, etc.",
        "link one concept to other concepts in the ontology.",
        "Below is an example of a concept frame of GOVERNMENT-ACTIVITY:"
      ]
    },
    {
      "heading": "ACCOMPANIER: HUMAN LOCATION: PLACE",
      "text": [
        "This example indicates that the concept GOVERNMENT-ACTIVITY is a subclass of the concept POLITICAL-EVENT; its case role AGENT requires its semantic value as HUMAN and its THEME requires its value as either OBJECT or EVENT; the GOVERNMENT-ACTIVITY can also have case role ACCOMPANIER with value as HUMAN and LOCATION with value as PLACE.",
        "Any lexicon entry mapping to the concept GOVERNMENT-ACTIVITY gets extended information through this frame."
      ]
    },
    {
      "heading": "3 Semantic Lexicon",
      "text": [
        "Semantic lexicon is another knowledge source for text meaning representation.",
        "In the MikroKosmos project each lexicon entry is designed as a frame with 11 zones corresponding to information relevant to orthography, morphology, syntax, semantics, syntax-semantic linking, stylistics, and database type management record, etc.",
        "The core of the lexicon frame is syntactic zone SYN-STRUC, semantic zone SEM-STRUC and their link SYNSEM zone.",
        "Syntax particular to a given language is described in the syntactical zone.",
        "The semantic zone maps a sense into an ontological concept in the case of single sense, or to several concepts in the case of multiple senses.",
        "Through the syntactic-semantic link zone the information of each word in the text can be extracted directly from lexicon database and its relevant world knowledge also can be retrieved.",
        "The general template of semantic lexicon entry is shown as follows.",
        "For a detailed description see Viegas and Raskin (1998).",
        "adjective mapping to OPEN-TO-PUBLIC with the definition to be available to the public.",
        "• in the context ETHS% 7f aft the library is open, can be an intransitive verb with the same concept OPEN-TO-PUBLIC.",
        "Using the ontological concepts as the value of semantic variables and linking them to syntactic variables makes the lexicon very informative.",
        "Figure 2. and Figure 3. present each sense and POS of the lexicon entries for the Chinese word fflik.",
        "Due to the lack of morphological information in Chinese, it is often the case that the same Chinese word form can be mapped to a different part of speech and has multiple senses, such as the word 3f *t:",
        "• in the context AM 3f flowers bloom, can be an intransitive verb mapping to a concept BLOOM with the definition to produce flower.",
        "• in the context 33t e 7ftt ov the government opens the foreign trade policy, can be a transitive verb mapping to a concept GOVERNMENT-ACTIVITY with the definition an activity that is commonly carried out by a government at any level.",
        "• in the context og Tr 3:Ftt Vtt the government carries open policy, can be an [Bloom THEME: al Flowed synsem: [subj: n [sem: Es I I"
      ]
    },
    {
      "heading": "4 Semantic Analysis for Word Sense Disambiguation",
      "text": [
        "The task of a semantic analyzer is to combine the knowledge contained in the ontology and lexicon and apply it to the input text to produce text meaning representation output.",
        "The central tasks involved are to retrieve the appropriate semantic constraints for each possible word sense, test each sense in context, and construct the output 'Mills by instantiating the concepts in semantic zones of the word senses that best satisfy the combination of constraints.",
        "Figure 4. illustrates the process of text meaning representation.",
        "Below illustrates the process through a sentence til",
        "The semantic analysis process takes the following steps:",
        "• to gather all of the possible lexicon for each of the words with instantiated each concepts.",
        "• In the next step, selectional constraints are retrieved from the ontology.",
        "Individual selectional constraints are checked.",
        "In the example, the concept GOVERNMENT-ACTIVITY requires AGENT to be HUMAN and THEME to be EVENT or OBJECT.",
        "The lexical information indicates that the SUBJ ag with sense FEDERATION must satisfy the AGENT of GOVERNMENT-ACTIVITY with value HUMAN.",
        "An inference rule described below checks the satisfaction.",
        "The OBJ gEM with the sense LAW satisfies THEME of GOVERNMENT",
        "ACTIVITY with value OBJECT.",
        "Through IS-A links it is found that LAW is a descendant of OBJECT.",
        "Therefore, the semantic constraints are satisfied.",
        "• Seeking satisfaction through inference rules, the semantic analyzer does more than match selectional constraints or find the distance along IS-A links.",
        "The search inside the ontology also involves looking for metonymic type links, such as FEDERATION in a metonymic relation with HUMAN through the property HAS",
        "in which DOMAIN is ORGANIZATION that has subclass FEDERATION and RANGE is HUMAN.",
        "Thus, the constraint of AGENT of GOVERNMENT-ACTIVITY to be HUMAN is satisfied.",
        "• In case multiple senses all satisfy the constraints, the concept with the shortest path is selected as the best choice.",
        "An ontological search program, Onto-Search, is presented in Onyshkevych (1997).",
        "The resulting preference values for each constraint are combined in an efficient control and search algorithm called Hunter-Gatherer that combines constraint satisfaction, branch and bound, and solution synthesis techniques to pick the best combination of word senses of the entire sentence in near linear time, as described in Beale (1997).",
        "• Chosen word senses are assembled into TMR frames."
      ]
    },
    {
      "heading": "5 Text Meaning Representation",
      "text": [
        "A text meaning representation (TMR) is a language-neutral description of the meaning conveyed in a text.",
        "It is derived by syntactic and semantic analysis.",
        "TMR captures not only the meaning of individual words in the text, but also the relation between those words.",
        "It provides information about the lexicon-semantic dependencies.",
        "In addition, it also represents stylistic and other factors presented in the text.",
        "From the result of word sense disambiguation, TMR integrates lexical, ontological and textual information into a single hierarchical framework.",
        "Below is a TMR for the example sentence 142ffi T * VSW.",
        "Chinese government has opened foreign trade policy.",
        "After semantic analysis.",
        "a variety of mi-crotheories are applied to further analyze elements of text meaning such as time, aspect, propositions, sets, co-reference, and so on.",
        "to produce a complete TMR.",
        "In the example, ASPECT-7 is applied within the scope of GOVERNMENT-ACTIVITY in which TELIC with value YES indicates the GOVERNMENT-ACTIVITY is complete that means the action",
        "of opening foreign trade policy is done.",
        "TIMES indicates the GOVERNMENT-ACTIVITY happens at the time the speaker make the utterance.",
        "Thus, the meaning of the Chinese sentence l' IE3t * 3f 711t T xt 3F R A aw is completely represented in the TMR."
      ]
    },
    {
      "heading": "6 Discussion",
      "text": [
        "A knowledge-based machine translation can be viewed as extracting and representing the meaning of a text and generating a text in target language based on the meaning presented.",
        "Thus, text meaning representation plays the key role in an interlingual approach to machine translation.",
        "The approach described in this article enables integrating linguistic knowledge of source languages with general world knowledge to reach high quality translation.",
        "It is because TMR represents meaning deeper and broader than what the context presents.",
        "For example, in the context MIlk JR* provide service, the linguistic information indicates syntactic-semantic dependency as SUBJ (human) -V(service-event)OBJ (event).",
        "In an ontology, the SERVICE-EVENT concept frame contains information about AGENT and THEME as well as BENEFICIARY, ACCOMPANIER, INSTRUMENT, LOCATION, etc.",
        "which extends the meaning of the given text A% SE* to *A tE A Yg AA IA IA NI* Someone provides service to someone else at some place.",
        "If the extended information is not explicitly presented in the text, the default value provides the assumption based on the world knowledge.",
        "In machine translation, it enables the generation of high quality text, especially in the case where the syntax in source language is different from that in target language or in the case where ellipsis is allowed in one language such as He plays Bach in English, but is not allowed in other language such as in Chinese, where one must say fth N4*Ea M ffa He plays Bach's work.",
        "With the rapid development of internet, information retrieval plays the key role in search engin.",
        "The extended information about the world knowledge allows to retrieve relevant data through the ontology that is implicitly specified in the query.",
        "As result, more broad and deep information can be extracted.",
        "It is extremely valuable to the development of next generation of Internet search engin.",
        "All in all, using ontology strengthens all NLP systems."
      ]
    }
  ]
}
