{
  "info": {
    "authors": [
      "Jiang Chen",
      "Jian-Yun Nie"
    ],
    "book": "Applied Natural Language Processing Conference and Meeting of the North American Association for Computational Linguistics",
    "id": "acl-A00-1004",
    "title": "Automatic Construction of Parallel English-Chinese Corpus for Cross-Language Information Retrieval",
    "url": "https://aclweb.org/anthology/A00-1004",
    "year": 2000
  },
  "references": [
    "acl-A00-1019",
    "acl-J93-1006",
    "acl-J93-2003",
    "acl-P91-1022",
    "acl-P91-1023",
    "acl-P93-1002",
    "acl-P94-1012"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "A major obstacle to the construction of a probabilistic translation model is the lack of large parallel corpora.",
        "In this paper we first describe a parallel text mining system that finds parallel texts automatically on the Web.",
        "The generated Chinese-English parallel corpus is used to train a probabilistic translation model which translates queries for Chinese-English cross-language information retrieval (CLIR).",
        "We will discuss some problems in translation model training and show the preliminary CUR results."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Parallel texts have been used in a number of studies in computational linguistics.",
        "Brown et al.",
        "(1993) defined a series of probabilistic translation models for MT purposes.",
        "While people may question the effectiveness of using these models for a full-blown MT system, the models are certainly valuable for developing translation assistance tools.",
        "For example, we can use such a translation model to help complete target text being drafted by a human translator (Langlais et al., 2000).",
        "Another utilization is in cross-language information retrieval (CUR) where queries have to be translated from one language to another language in which the documents are written.",
        "In CUR, the quality requirement for translation is relatively low.",
        "For example, the syntactic aspect is irrelevant.",
        "Even if the translated word is not a true translation but is strongly related to the original query, it is still helpful.",
        "Therefore, CLIR is a suitable application for such a translation model.",
        "However, a major obstacle to this approach is the lack of parallel corpora for model training.",
        "Only a few such corpora exist, including the Hansard English-French corpus and the HKUST English-Chinese corpus (Wu, 1994).",
        "In this paper, we will describe a method which automatically searches for parallel texts on the Web.",
        "We will discuss the text mining algorithm we adopted, some issues in translation model training using the generated parallel corpus, and finally the translation model's performance in CUR."
      ]
    },
    {
      "heading": "2 Parallel Text Mining Algorithm",
      "text": [
        "The PTMiner system is an intelligent Web agent that is designed to search for large amounts of parallel text on the Web.",
        "The mining algorithm is largely language independent.",
        "It can thus be adapted to other language pairs with only minor modifications.",
        "Taking advantage of Web search engines as much as possible, PTMiner implements the following steps (illustrated in Fig. 1): 1 Search for candidate sites – Using existing Web search engines, search for the candidate sites that may contain parallel pages; 2 File name fetching – For each candidate site, fetch the URLs of Web pages that are indexed by the search engines; 3 Host crawling – Starting from the URLs collected in the previous step, search through each candidate site separately for more URLs; 4 Pair scan – From the obtained URLs of each site, scan for possible parallel pairs; 5 Download and verifying – Download the parallel pages, determine file size, language, and character set of each page, and filter out non-parallel pairs."
      ]
    },
    {
      "heading": "2.1 Search for candidate Sites",
      "text": [
        "We take advantage of the huge number of Web sites indexed by existing search engines in determining candidate sites.",
        "This is done by submitting some particular requests to the search engines.",
        "The requests are determined according to the following observations.",
        "In the sites where parallel text exists, there are normally some pages in one language containing links to the parallel version in the other language.",
        "These are usually indicated by those links' anchor texts 1.",
        "For example, on some English page there may be a link to its Chinese version with the anchor text \"Chinese Version\" or \"in Chinese\".",
        "First, we establish four lists for English prefixes, English suffixes, Chinese prefixes and Chinese suffixes.",
        "For example: English Prefix = {e, en, e_, en_, e – , en – , ...}.",
        "For each file in one language, if a segment in its name corresponds to one of the language affixes, several new names are generated by changing the segment to the possible corresponding affixes of the other language.",
        "If a generated name corresponds to an existing file, then the file is considered as a candidate parallel document of the original file."
      ]
    },
    {
      "heading": "2.5 Filtering",
      "text": [
        "Next, we further examine the contents of the paired files to determine if they are really parallel according to various external and internal features.",
        "This may further improve the pairing precision.",
        "The following methods have been implemented in our system."
      ]
    },
    {
      "heading": "2.5.1 Text Length",
      "text": [
        "Parallel files often have similar file lengths.",
        "One simple way to filter out incorrect pairs is to compare the lengths of the two files.",
        "The only problem is to set a reasonable threshold that will not discard too many good pairs, i.e. balance recall and precision.",
        "The usual difference ratio depends on the language pairs we are dealing with.",
        "For example, Chinese-English parallel texts usually have a larger difference ratio than English-French parallel texts.",
        "The filtering threshold had to be determined empirically, from the actual observations.",
        "For Chinese-English, a difference up to 50% is tolerated."
      ]
    },
    {
      "heading": "2.5.2 Language and Character Set",
      "text": [
        "It is also obvious that the two files of a pair have to be in the two languages of interest.",
        "By automatically identifying language and character set, we can filter out the pairs that do not satisfy this basic criterion.",
        "Some Web pages explicitly indicate the language and the character set.",
        "More often such information is omitted by authors.",
        "We need some language identification tool for this task.",
        "SILC is a language and encoding identification system developed by the BALI laboratory at the University of Montreal.",
        "It employs a probabilistic model estimated on trigrams.",
        "Using these models, the system is able to determine the most probable language and encoding of a text (Isabelle et al., 1997)."
      ]
    },
    {
      "heading": "2.5.3 HTML Structure and Alignment",
      "text": [
        "In the STRAND system (Resnik, 1998), the candidate pairs are evaluated by aligning them according to their HTML structures and computing confidence values.",
        "Pairs are assumed to be wrong if they have too many mismatching markups or low confidence values.",
        "Comparing HTML structures seems to be a sound way to evaluate candidate pairs since parallel pairs usually have similar HTML structures.",
        "However, we also noticed that parallel texts may have quite different HTML structures.",
        "One of the reasons is that the two files may be created using two HTML editors.",
        "For example, one may be used for English and another for Chinese, depending on the language handling capability of the editors.",
        "Therefore, caution is required when measuring structure difference numerically.",
        "Parallel text alignment is still an experimental area.",
        "Measuring the confidence values of an alignment is even more complicated.",
        "For example, the alignment algorithm we used in the training of the statistical translation model produces acceptable alignment results but it does not provide a confidence value that we can \"confidently\" use as an evaluation criterion.",
        "So, for the moment this criterion is not used in candidate pair evaluation."
      ]
    },
    {
      "heading": "3 Generated Corpus and Translation Model Training",
      "text": [
        "In this section, we describe the results of our parallel text mining and translation model training."
      ]
    },
    {
      "heading": "3.1 The Corpus",
      "text": [
        "Using the above approach for Chinese-English, 185 candidate sites were searched from the domain hk.",
        "We limited the mining domain to hk because Hong Kong is a bilingual English-Chinese city where high quality parallel Web sites exist.",
        "Because of the small number of candidate sites, the host crawler was used to thoroughly explore each site.",
        "The resulting corpus contains 14820 pairs of texts including 117.2Mb Chinese texts and 136.5Mb English texts.",
        "The entire mining process lasted about a week.",
        "Using length comparison and language identification, we refined the precision of the corpus to about 90%.",
        "The precision is estimated by examining 367 randomly picked pairs."
      ]
    },
    {
      "heading": "3.2 Statistical Translation Model",
      "text": [
        "Many approaches in computational linguistics try to extract translation knowledge from previous translation examples.",
        "Most work of this kind establishes probabilistic models from parallel corpora.",
        "Based on one of the statistical models proposed by Brown et al.",
        "(1993), the basic principle of our translation model is the following: given a corpus of aligned sentences, if two words often co-occur in the source and target sentences, there is a good likelihood that they are translations of each other.",
        "In the simplest case (model 1), the model learns the probability, p(tis), of having a word t in the translation of a sentence containing a word s. For an input sentence, the model then calculates a sequence of words that are most probable to appear in its translation.",
        "Using a similar statistical model, Wu (1995) extracted a large-scale English-Chinese lexicon from the HKUST cor",
        "divided into sentences.",
        "The sentences are marked by <s id=\"xxxx\"> and </s>.",
        "Note that we determine sentences not only by periods, but also by means of HTML markup.",
        "We further notice that it is difficult to align sentences 0002.",
        "The sentence in the Chinese page is much longer than its counterpart in the English page because some additional information (font) is added.",
        "The length-based method thus tends to take sentence 0002, 0003, and 0004 in the English page as the translation of sentence 0002 in the Chinese page (Fig.",
        "2), which is wrong.",
        "This in turn provocated the three following incorrect alignments.",
        "As we can see in Fig. 3, the cognate method did not make the same mistake because of the noise in sentence 0002.",
        "Despite their large length difference, the two 0002 sentences are still aligned as a 1-1 pair, because the sentences in the following 4 alignments (0003 - 0003; 0004 - 0004, 0005; 0005 - 0006; 0006 - 0007) have rather similar HTML markups and are taken by the program to be the most likely alignments.",
        "Beside HTML markups, other criteria may also be incorporated.",
        "For example, it would be helpful to consider strong correspondence between certain English and Chinese words, as in (Wu, 1994).",
        "We hope to implement such correspondences in our future research."
      ]
    },
    {
      "heading": "3.4 Lexicon Evaluation",
      "text": [
        "To evaluate the precision of the English-Chinese translation model trained on the Web corpus, we examined two sample lexicons of 200 words, one in each direction.",
        "The 200 words for each lexicon were randomly selected from the training source.",
        "We examined the most probable translation for each word.",
        "The Chinese-English lexicon was found to have a precision of 77%.",
        "The English-Chinese lexicon has a higher precision of 81.5%.",
        "Part of the lexicons are shown in Fig. 4, where t/f indicates whether a translation is true or false.",
        "These precisions seem to be reasonably high.",
        "They are quite comparable to that obtained by Wu (1994) using a manual Chinese-English parallel corpus."
      ]
    },
    {
      "heading": "3.5 Effect of Stopwords",
      "text": [
        "We also found that stop-lists have significant effect on the translation model.",
        "Stop-list is a set of the most frequent words that we remove from the train",
        "trained without considering the English stopwords gives higher probabilities."
      ]
    },
    {
      "heading": "4 English-Chinese CUR Results",
      "text": [
        "Our final goal was to test the performance of the translation models trained on the Web parallel corpora in CUR.",
        "We conducted CLIR experiments using the Smart IR system."
      ]
    },
    {
      "heading": "4.1 Results",
      "text": [
        "The English test corpus (for C-E CUR) was the AP corpus used in TREC6 and TREC7.",
        "The short English queries were translated manually into Chinese and then translated back to English by the translation model.",
        "The Chinese test corpus was the one used in the TREC5 and TREC6 Chinese track.",
        "It contains both Chinese queries and their English translations.",
        "Our experiments on these two corpora produced the results shown in Tab.",
        "1.",
        "The precision of monolingual IR is given as benchmark.",
        "In both EC and C-E CLIR, the translation model achieved around 40% of monolingual precision.",
        "To compare with the dictionary-based approach, we employed a Chinese-English dictionary, CEDICT (Denisowski, 1999), and an English-Chinese online dictionary (Anonymous, 1999a) to translate queries.",
        "For each word of the source query, all the possible translations given by the dictionary are included in the translated query.",
        "The Chinese-English dictionary has about the same performace as the translation model, while the English-Chinese dictionary has lower precision than that of the translation model.",
        "We also tried to combine the translations given by the translation model and the dictionary.",
        "In both C-E and EC CLIR, significant improvements were achieved (as shown in Tab.",
        "1).",
        "The improvements show that the translations given by the translation model and the dictionary complement each other well for IR purposes.",
        "The translation model may give either exact translations or incorrect but related words.",
        "Even though these words are not correct in the sense of translation, they are very possibly related to the subject of the query and thus helpful for IR purposes.",
        "The dictionary-based approach expands a query along another dimension.",
        "It gives all the possible translations for each word including those that are missed by the translation model."
      ]
    },
    {
      "heading": "4.2 Comparison With MT Systems",
      "text": [
        "One advantage of a parallel text-based translation model is that it is easier to build than an MT system.",
        "Now that we have examined the CLIR performance of the translation model, we will compare it with two existing MT systems.",
        "Both systems were tested in EC CLIR."
      ]
    },
    {
      "heading": "4.2.1 Sunshine WebTran Server",
      "text": [
        "Using the Sunshine WebTran server (Anonymous, 1999b), an online English-Chinese MT system, to translate the 54 English queries, we obtained an average precision of 0.2001, which is 50.3% of the monolingual precision.",
        "The precision is higher than that obtained using the translation model (0.1804) or the dictionary (0.1427) alone, but lower than the precison obtained using them together (0.2232)."
      ]
    },
    {
      "heading": "4.2.2 Transperfect",
      "text": [
        "Kwok (1999) investigated the CLIR performance of an English-Chinese MT software called Transperfect, using the same TREC Chinese collection as we used in this study.",
        "Using the MT software alone, Kwok achieved 56% of monolingual precision.",
        "The precision is improved to 62% by refining the translation with a dictionary.",
        "Kwok also adopted pre-translation query expansion, which further improved the precison to 70% of the monolingual results.",
        "In our case, the best EC CLIR precison using the translation model (and dictionary) is 56.1%.",
        "It is lower than what Kwok achieved using Transperfect, however, the difference is not large."
      ]
    },
    {
      "heading": "4.3 Further Problems",
      "text": [
        "The Chinese-English translation model has a far lower CLIR performance than that of the English-French model established using the same method (Nie et al., 1999).",
        "The principal reason for this is the fact that English and Chinese are much more different than English and French.",
        "This problem surfaced in many phases of this work, from text alignment to query translation.",
        "Below, we list some further factors affecting CLIR precision.",
        "• The Web-collected corpus is noisy and it is difficult to align English-Chinese texts.",
        "The alignment method we employed has performed more poorly than on English-French alignment.",
        "This in turn leads to poorer performance of the translation model.",
        "In general, we observe a higher",
        "variability in Chinese-English translations than in English-French translations.",
        "• For EC CLIR, although queries in both languages were provided, the English queries were not strictly translated from the original Chinese ones.",
        "For example, (human right situation) was translated into human right issue.",
        "We cannot expect the translation model to translate issue back to :KA, (situation).",
        "• The training source and the CLIR collections were from different domains.",
        "The Web corpus are retrieved from the parallel sites in Hong Kong while the Chinese collection is from People's Daily and Xinhua News Agency, which are published in mainland China.",
        "As the result, some important terms such as ft A, tiq (most-favored-nation) and -- 41 (one-nation-two-systems) in the collection are not known by the model."
      ]
    },
    {
      "heading": "5 Summary",
      "text": [
        "The goal of this work was to investigate the feasibility of using a statistical translation model trained on a Web-collected corpus to do English-Chinese CLIR.",
        "In this paper, we have described the algorithm and implementation we used for parallel text mining, translation model training, and some results we obtained in CLIR experiments.",
        "Although further work remains to be done, we can conclude that it is possible to automatically construct a Chinese-English parallel corpus from the Web.",
        "The current system can be easily adapted to other language pairs.",
        "Despite the noisy nature of the corpus and the great difference in the languages, the evaluation lexicons generated by the translation model produced acceptable precision.",
        "While the current CLIR results are not as encouraging as those of English-French CLIR, they could be improved in various ways, such as improving the alignment method by adapting cognate definitions to HTML markup, incorporating a lexicon and/or removing some common function words in translated queries.",
        "We hope to be able to demonstrate in the near future that a fine-tuned English-Chinese translation model can provide query translations for CLIR with the same quality produced by MT systems."
      ]
    }
  ]
}
