{
  "info": {
    "authors": [
      "Michael Schiehlen"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C00-2103",
    "title": "Granularity Effects in Tense Translation",
    "url": "https://aclweb.org/anthology/C00-2103",
    "year": 2000
  },
  "references": [
    "acl-C96-1054",
    "acl-E95-1001",
    "acl-P98-1024",
    "acl-P98-2193"
  ],
  "sections": [
    {
      "heading": "1 Introduction",
      "text": [
        "One of the daunting problems in machine translation (MT) is the mapping of tense.",
        "The paper singles out the problem of translating German present tense into English.",
        "This problem seems particularly instructive as its solution requires calculation of aspect as well as determination of the temporal location of events with respect to the time of speech.",
        "We present a disambiguation algorithm which makes use of granularity calculations to establish the scopal order of temporal adverbial phrases.",
        "The described algorithm has been implemented and is running in the Verbmobil system.",
        "The paper is organized as follows.",
        "In sections 2 through 4 we present the problem and discuss the linguistic factors involved, always keeping an eye on their exploitation for disambiguation.",
        "Sections 5 and 6 are devoted to an abstract definition of temporal granularity and a discussion of granularity effects on scope resolution.",
        "In section 7 the actual disambiguation algorithm is presented, while section 8 describes its performance on the Verbmobi/ test data.",
        "A summary closes the paper."
      ]
    },
    {
      "heading": "2 Present or Future?",
      "text": [
        "In contrast to English, the German present tense is commonly used to describe both present and future happenings.",
        "One task in translation from German to English is therefore the disambiguation of German present tense to present time or future time.",
        "(1) present tense – > future time present time * This work was funded by istry of Education, Science, (BMBF) in the framework of der Grant 01 IV 101 U. Mai H. Kamp and K. Eberle.",
        "All"
      ]
    },
    {
      "heading": "2.1 Temporal Orientation",
      "text": [
        "A prominent factor involved in the choice between present and future time (Butt, 1995) is the temporal orientation of the time adverbials that modify the tensed verb.",
        "Only a limited set of time adverbials can refer to present time.",
        "Indeed, the set is so small that it can be enumerated.",
        "The adverbials can be further subclassified according to other times they may refer to.",
        "• only present (now, at the moment) • also past (just, German eben) • any time (today, this week, in the meantime, for two weeks) All other time adverbials are incompatible with present time.",
        "(2) * On 19th November 2000, I sleep late.",
        "• Some adverbials only refer to past time (e.g. yesterday, last week, formerly, recently-, two days ago).",
        "(3) * I will be here yesterday.",
        "• Others can only be used with future time (tomorrow, next week, soon, in four days)."
      ]
    },
    {
      "heading": "2.2 Verbs Immune to Temporal Orientation Effects",
      "text": [
        "In some cases the temporal orientation of adverbials sounds a false alarm: Even though an adverbial requiring non-present syntactically modifies the tensed verb, German present tense is translated as present (see examples (4) from the British National Corpus).",
        "The effect comes about because semantically the adverbial modifies not the verb's eventuality but one of the verb's objects.",
        "the German Federal Min-Research and Technology the Verbmobil Project linty thanks are due to Prof. errors are my own.",
        "(4) a.",
        "Tomorrow I am already planning a golf trip with the boss.",
        "(Verbmobil corpus) b.",
        "And we wish him the very best of hick tomorrow in 13irmingham.",
        "(British National Corpus, 13NC) c. Another storm from SE ... is expected here tomorrow.",
        "(13NC)",
        "The decisive factor seems to be the verb sense involved.",
        "Thus, for disambiguation a list of such \"immune\" verb senses must be compiled.",
        "Such verbs can be modified by adverbials requiring present and adverbials requiring non-present at the same time.",
        "(5) am Montag haben wir .jetzt noch etwas Zeit on Monday have we now still some time but now we still have sonic time on Monday."
      ]
    },
    {
      "heading": "2.3 Temporal Orientation and Scope",
      "text": [
        "Only the temporal orientation of wide-scope adverbials is relevant for tense disambiguation (Butt, 1995).",
        "Frequency adverbials intercept the disambiguating effect (see (6)).",
        "ft is therefore important to evaluate only those adverbials that outscope the frequency adverbial with widest scope.",
        "(6) a.",
        "Joint will be here on Monday.",
        "b. John is here on.",
        "Monday every week.",
        "c. John will be lucre in.",
        "April every week.",
        "3 Simple or Progressive?",
        "A distinctive feature of the English tense system that is missing in German is the differentiation between simple and progressive aspect.",
        "We focus here on the usage of aspect in present time.",
        "(7) present time simple present present progressive"
      ]
    },
    {
      "heading": "3.1 Linguistic Factors",
      "text": [
        "The factors involved have been thoroughly studied and classified in the linguistic literature (Greenbaum and Quirk, 1990).",
        "So we confine ourselves to a short review here.",
        "State Present.",
        "Stative verb senses get simple aspect.",
        "(8) a.",
        "* We are having a house on Street;.",
        "b.",
        "We are having dinner.",
        "Habitual Present.",
        "A habit is a set of events of the same type.",
        "In semantic terms, a habit arises from quantification over events.",
        "If the events extend indefinitely into the past; and future, the habit is conceived as permanent and simple aspect is used; if the events occur over a limited period of time, the habit is conceived as temporary and progressive aspect is appropriate.",
        "A frequency adverbial can be used to specify the (relative) number of occurrences of the event.",
        "General [acts can be viewed as a special type of a habit.",
        "They are always expressed in simple aspect (see (9)).",
        "(9) Because water boils at 100°C, water is boiling at 100°C in the pot.",
        "Instantaneous Present.",
        "Dynamic verb senses that refer to a single event with little or no duration occurring at the speech time are expressed with simple aspect.",
        "This type of present is used in commentaries (10a), self-commentaries (10b) and with performative verbs (10c) referring to speech acts.",
        "(10) a. :Joe scores a goal.",
        "b. I enclose an application form.",
        "c. For permission to publish this paper, the authors thank the Department of Economic Development.",
        "Durational Present.",
        "Dynamic verb senses denoting an incomplete event with duration get progressive aspect.",
        "(11.)",
        "a.",
        "We are looking at; March sixteenth.",
        "(Verbmobil corpus) b.",
        "This is looking interesting.",
        "(Verbmobil corpus)"
      ]
    },
    {
      "heading": "3.2 Disambiguation",
      "text": [
        "State Present.",
        "Disambiguation requires definition and classification of all relevant verb senses according to stativity.",
        "When in a first approximation only the most frequent verb sense of each verb are considered, a list of stative verbs can be extracted from a corpus.",
        "Habitual Present.",
        "The presence of a frequency adverbial points to a reading of Habitual Oxford Present.",
        "Since every event can be construed as a general fact, general facts are very difficult to identify and will be disregarded.",
        "Instantaneous Present.",
        "For disambiguation achievement verbs used in self-commentaries and performative verbs need to be listed.",
        "Durational Present.",
        "Present events are usually regarded as having duration, so progressive is the default aspect for dynamic verb senses in the present."
      ]
    },
    {
      "heading": "4 Perfect or Not?",
      "text": [
        "In a special case, German present tense can be rendered as English present perfect: In English, perfect is used to describe periods that begin in the past and lead up to the present; German uses a non-perfective tense in this situation.",
        "(1.2) Wir leben schon fiinf Jahre in Amsterdam.",
        "We live already five years in Amsterdam.",
        "We have lived in Amsterdam for five years.",
        "Whenever a period is described that begins before and still holds at speech time, a liinitative time adverbiall is used.",
        "(This term is due to Bras (1.990).)",
        "This peculiarity makes disambiguation very easy.",
        "(13) a. Er ist erst zwei Wochen flier.",
        "He is onlyt two weeks here.",
        "He has only been here for two weeks.",
        "b. Er ist nur zwei Wochen hien He is only two weeks here.",
        "He is here for only two weeks."
      ]
    },
    {
      "heading": "5 Definition of Granularity",
      "text": [
        "For our purposes we model the time axis as the set of rational2 numbers Q.",
        "An interval is then a pair of rational numbers (s, e), such that s < e. The duration of an interval is the distance between start and end of the interval (dur((s, e)) – s).",
        "On the interval structure we define the relations of inclusion (14a) and overlap (14b).",
        "(14) a.",
        "(sit, C (82, e2) H 82 < si A e1 < e2 b.",
        "(she\") 0 (32, e2) H sl < e2 A s2 < 1Limitative advcrbials go with the prepositions since and for phis temporal measure nouns in English; in German they occur with the preposition seit and as duration adverbials modified by schon and cyst.",
        "2 Although natural numbers could have been used too, rational numbers are convenient since they allow free choice of the unit."
      ]
    },
    {
      "heading": "5.1 Temporal nouns",
      "text": [
        "A temporal noun denotes a set of intervals.",
        "We define the granularity of a temporal noun formally as a pair of numbers specifying the minimal and maximal duration of its intervals (e.g. gran(day) = (1, 1), gran(conference) = (1,28), gran(seminar) = (0.00138889, 334.812) if the unit is a day).",
        "The following relation is used to compare granularity values.",
        "(15) (duel, durD > (dur?, dur4) ((furl , durD (d,ur?",
        "dur4) A dun' > dur",
        "If nm has coarser granularity than n2, then an interval of M. cannot be included in an interval of n2.",
        "(16) Vu1, n2 : (grau(ni) > gran(n2) diI E E n2 i2) Consider the following definition.",
        "(17) A temporal noun n has the property of disjointness E n : i2",
        "Every calendar measure noun defines a partition on the time axis and has therefore the property of disjointness (e.g. hour, day, week, eternity).",
        "Nouns functionally dependent on calendar measure nouns inherit the property (e.g. Monday, Christmas, holiday, 6:45, ...).",
        "Event and state nouns have the disjointness property, if the described intervals functionally depend on one of the participants and the participant is definite.",
        "Thus, example (18) is deviant.",
        "(18) * Tomorrow at 6:30 Jones will give a talk at every conference.",
        "if nt has finer granularity than a noun n2 winch has the property of disjointness, then every interval in ni overlaps with at most one interval in n2 (we disregard the case where it joins two intervals in n2).",
        "(19) Via E nd.",
        ":i2En2 A it 0 i2 <1"
      ]
    },
    {
      "heading": "5.2 Functions on Granularity",
      "text": [
        "Relational Nouns.",
        "Among the temporal relational nouns we distinguish nouns describing periods of definite length (e.g. quarter, third, half) from those that refer to periods of indefinite length (e.g. beginning, middle, end).",
        "In granularity calculation, relational nouns contribute a factor.",
        "With relational nouns referring",
        "to periods of indefinite length we set the factor to Temporal prepositions.",
        "Temporal prepositions are mapped to interval relations.",
        "1.",
        "Some prepositions do not alter granularity (e.g. temporal location on, in, at, duration during, throughout, for).",
        "2.",
        "Some prepositions describe an open-ended interval (e.g. before, after, from-on, until).",
        "3.",
        "Some prepositions require a detailed deter",
        "mination of temporal reference if they are to yield granularity predictions (e.g. since, between).",
        "To calculate granularity with the latter two classes, we take the granularity of the preposi-tions' NP arguments as a guideline.",
        "The heuristic assumption is that if a time adverbial is to designate a long period more detail is given in the NP argument.",
        "Thus, the relevant temporal prepositions map the 1101111 granularity to the next higher level on a certain scale (day - month ---- year - eternity).",
        "(20) before 6:30 (<day) before klionday (< month or year) before Monday, 1st; of October (< year) before Monday, 1st; of October 1998 (infinite)",
        "Determiners.",
        "Two classes of determiners can be distinguished: specific (definite or indefinite) and quantificational (Kamp and Reyle, 1993).",
        "Specific determiners do not change granularity.",
        "Quantifiers, however, extend granularity if it; is clear that every interval denoted by a temporal noun occurs only once within a certain period.",
        "(21) every Monday (week) every beginning of a conference (conference) every bimonthly meeting (two months) 13UT: every quarter of a year (three months, not; year)",
        "Appositions.",
        "If temporal nouns form a constituent (e.g. yesterday afternoon), the granularity of the head noun is chosen (typically this is the finer granularity).",
        "Since intervals are usually described on source and target; side, granularity information of both source and target temporal nouns can be exploited to achieve higher precision (e.g. VOrmittag morning)."
      ]
    },
    {
      "heading": "6 Scope Resolution",
      "text": [
        "For tense disambiguation scope resolution of time adverbials can be crucial (cf. section 2.3)."
      ]
    },
    {
      "heading": "6.1 Functional Concepts",
      "text": [
        "Functional concepts restrict the possibilities of scope resolution (Alshawi, 1992).",
        "A quantifier (K•, R, S) is iterative iff it requires that conceptual knowledge allows for at least two objects in the intersection of its restriction li and nuclear scope S (I{ : R(:E) A S(x) > Examples for iterative quantifiers are every, most, several and the distributive reading of plural.",
        "y) A concept C is functional on domain D and range If iff \\kr : : WCOAC(3:, 11 < 1 (e.g. every human has exactly one father).",
        "It can be shown that; if an iterative quantifier quantifies over the range of a functional concept;, it must; outscope the domain quantifier (e.g. every hither outscopes a student in every hither of a student) (Moran and Pereira, 1992).",
        "Temporal overlap is a functional concept if the domain interval has finer granularity than the range interval (see (19)).",
        "Hence, if two time adverbials n-1 (on Monday in (22)) and 712 (every week in (22)) modify the same event, ii has finer granularity than n2, and 712 is iteratively quantified, then n2 must; outscope 'to .",
        "(22) John visited .Jane every week on Monday."
      ]
    },
    {
      "heading": "6.2 Temporal Quantification",
      "text": [
        "Temporal quantification has a curious property.",
        "Prepositional phrases are generally treated as intersective modifiers to the head instance (Alshawi, 1992).",
        "If we analyse sentence (23a) in this vein, we get (23b) as logical representation: The described events are situated in May and in every week.",
        "(23) a.",
        "In May John visited Jane every week.",
        "b. Jun : Mayen)) A : week(') --> He : visit(e, John, Jane) A ccyr A e C 11)",
        "On closer inspection we see that the representation is contradictory.",
        "Take an arbitrary week, say in April.",
        "Then the formula asserts that there is a visit in this week (i.e. in April) and",
        "in May, which is inconsistent.",
        "Thus, the formula should not quantify over weeks in general but over weeks in May: An inclusion restriction to the wide-scope adverbial is needed ,in the narrow-scope adverbial (Kamp and Reyle, 1993).",
        "(24) 9m : May(m) A Vw : week(w) A w C 7n 9e : visit(e, John, Jane) A e C A e C w",
        "Since temporal quantification requires that a narrow-scope iterative adverbial be included in the wide-scope adverbial, configurations are excluded where by conceptual knowledge the narrow-scope adverbial al cannot be included in the wide-scope adverbial a2.",
        "By theorem (16) this is the case if al has coarser granularity than a2."
      ]
    },
    {
      "heading": "6.3 Granularity and Scope",
      "text": [
        "We have now seen two motivations for the principle (25).",
        "(25) If ni has finer granularity than n2 and 712 is iteratively quantified, ni cannot have scope over n2.",
        "Let us now consider the following principle: (26) If ni has finer granularity than n2 and ni is iteratively quantified, n,\" cannot have scope over n2.",
        "We are not in a position to formally explain the principle.",
        "It holds for at least all nouns with the disjointness property.",
        "Although in example (27a) the V9 reading would make perfect sense (Jones is always on holiday), it is excluded.",
        "In contrast, example (27b) allows this reading (.Jones shuttles between conference sites).",
        "The principle is not restricted to temporal granularity: In (27c) the V9 reading is excluded, too.",
        "(27) a.",
        "Every Monday, Jones was here in a month in which he was on holiday.",
        "b.",
        "Every afternoon, Jones gave a talk at a conference.",
        "c. On every page, I found something interesting in a paper I read.",
        "Taken together, the two principles assert that the granularity ranking determines the scope order.",
        "In the disambiguation algorithm presented in section 7 we arc mainly interested in the position of the highest (iterative) quantifier.",
        "So if every pair of time adverbials can be compared in terms of granularity, we have a procedure to compute this position.",
        "Comparison of granularity (15) is not defined if the granularity values overlap or are equal.",
        "Equal granularity is only possible with specific time adverbials.",
        "(28) * John carne from every Wednesday to every weekend Other heuristics will have to come into play in case of overlapping granularity (see section 8 for further discussion)."
      ]
    },
    {
      "heading": "6.4 Deictic Adverbials",
      "text": [
        "Another factor for determining scope order is deixis.",
        "Some adverbials are connected in their interpretation to the time of speech (now, at the moment, next week, last week).",
        "Since time of speech is deictic (it depends on the context of utterance), hence definite, every function on it will also be definite.",
        "Deictic adverbials always get wide-scope position.",
        "Sentences in which deixis conflicts with granularity are deviant.",
        "(29) * Next month, I will be here every year."
      ]
    },
    {
      "heading": "7 The Disambiguation Algorithm",
      "text": [
        "In the implementation, an underspecified semantic representation formalism is used to encode the source analysis and the transfer result for the target (the Verbmobil Interface Term (VIT) formalism (Bos et al., 1998), which is based on the theory of Underspecified Discourse Representation Structures (Reyle, 1995)).",
        "The disambiguation heuristics of the system completely rely on local context.",
        "The most important features in local context are source tense, the predicate names of the tensed verb in source and target, and the time adverbials modifying the verb in source and target (Schiehlen, 1998).",
        "In a first step, the source and target representations are converted into an abstract representation, using the VIT transfer formalism (Dorna and Emele, 1996).",
        "All information irrelevant to tense resolution is removed.",
        "Since no full-fledged tense logic is implemented, information about temporal reference is discarded as well.",
        "Temporal adverbs are decomposed into prepositional phrases (e.g. yesterday on a Past",
        "day).",
        "In particular the following features are extracted:",
        "(30) a. multiple classification of verb senses • stative or dynamic (for English only, cf. section 3.2) • potentially performative/selfcommentary or not (for English only, cf. section 3.2) • \"immune\" or not (cf. section 2.2) b. temporal relation expressed by prepositions c. temporal orientation of prepositions (on Monday), adjectives ( the previous Monday) and determiners (this Monday) (cf. section 2.1) d. granularity of nouns and adverbs (e.g. German ganztiigig (whole-day)) e. classification of determiners (quantificational/specific/ambiguous) f. classification of adverbs (frequency adverb or not)",
        "We now give an outline of the disambiguation algorithm for translating German present.",
        "It is clear that the algorithm is heuristic in many aspects, but in the absence of context and detailed discourse analysis it does not seem possible to do much better.",
        "1.",
        "For every tensed verb, determine all time adverbials modifying it and collect them in the set TA.",
        "2.",
        "Order the time adverbials in TA according to scope (cf. section 6).",
        "3.",
        "Let STA be the set; of all specific time adverbials in TA (i.e. adverbials denoting a specific interval) not in the scope of a quantificational adverbial or frequency adverb (cf. section 2.3).",
        "4.",
        "Perfect or Not?",
        "(cf. section 4)",
        "If one of the time adverbials in STA is connected to the tensed verb over a limitative relation, choose perfect; else choose non-perfective tense.",
        "temporal orientation (cf. section 2.2).",
        "Else unify the temporal orientation contributed by the time adverbials in STA.",
        "In case the result excludes present time, choose future; else choose present (cf. section 2.1).",
        "6.",
        "Simple or Progressive Aspect?",
        "(cf. section 3) (a) If the tensed verb has a stative sense, choose simple (State Present).",
        "(b) If the tensed verb is used in a self-commentary or performatively, choose simple (Instantaneous Present).",
        "(c) If there is an adverbial in STA, choose progressive (Temporary Habit and Durational Present).",
        "(d) If there is a quantificational adverbial or frequency adverb in TA, choose simple (Permanent Habit).",
        "(e) Else choose progressive (Durational Present)."
      ]
    },
    {
      "heading": "8 Results",
      "text": [
        "We tested the system on a data base of 13,625 pairs of German ViTs with their English translations, containing 12,036 tensed verbs.",
        "All the data were in the appointment scheduling domain which is investigated in Verbmobil.",
        "They were transliterated and syntactically annotated by hand.",
        "Translation was performed by the Verbmobil transfer component (Donna and Emele, 1996).",
        "2,758 tensed verbs were modified by time adverbials, 1,373 of these verbs were modified by time adverbials with known granularity.",
        "The algorithm made the following choices for these data.",
        "The second column shows the total number of tensed verbs, the third column only counts those modified by time adverbials with granularity.",
        "the present but only in the future (travel, meet, eat, ...).",
        "In 93.6% of the cases a specific wide-scope time adverbial could be determined with granularity constraints.",
        "In 4.7% of the cases several time adverbials of equal granularity had wide scope.",
        "A good deal of these cases were alignment errors with the translations (e.g. iibermorgen the day after tomorrow).",
        "Other cases were due to the lack of a treatment for coordination (e.g. on Monday and on Thursday or from June to August).",
        "Some cases were genuine double descriptions of days: (31) a.",
        "Is it possible for you tomorrow on the second?",
        "b. I would have time on Wednesday on Wednesday the third of May.",
        "In 1.7% of the cases the wide-scope adverbial could not be determined because some adverbials had overlapping granularity values.",
        "Here the main culprit was the unspecified adverb when (see (32a)).",
        "Other cases were due to incorrect preposition attachment (see (32b)).",
        "(32) a.",
        "When shall we meet on Monday?",
        "Next week/6:30. b.",
        "Would you be available in the time period until .June?"
      ]
    },
    {
      "heading": "9 Summary",
      "text": [
        "The paper has presented a disambiguation algorithm for translation of German present into English.",
        "After a discussion of the factors involved, particular emphasis was placed on an account of scope resolution among time adverbials.",
        "It has been shown that granularity calculations go a long way towards the goal of full scope resolution.",
        "The cross-connections between granularity and scope have been analysed in detail, and some motivation for these connections has been given.",
        "One area of future work is to apply the model to larger corpora and extend it to cover the full set; of tenses.",
        "If translations can be aligned with the training data, it would be interesting to investigate the extent to which the model can be used to extract (parts of) the pertinent granularity information on temporal nouns from the corpus (Schiehlen, 1998).",
        "For example, the occurrence of a configuration like (33) could be interpreted as evidence for NOUN having coarser granularity than week.",
        "(33) FUTURE-EVENT every week in NOUN"
      ]
    }
  ]
}
