{
  "info": {
    "authors": [
      "Rani Nelken",
      "Nissim Francez"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C00-2161",
    "title": "Querying Temporal Databases Using Controlled Natural Language",
    "url": "https://aclweb.org/anthology/C00-2161",
    "year": 2000
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Recent years have shown a surge in interest in temporal database systems, which allow users to store time-dependent information.",
        "We present a novel controlled natural language interface to temporal databases, based on translating natural language questions into SQL/Temporal, a temporal database query language.",
        "The syntactic analysis is done using the Type-Logical Grammar framework, highlighting its utility not only as a theoretical framework but also as a practical tool.",
        "The semantic analysis is done using a novel theory of the semantics of temporal questions, focusing on the role of temporal preposition phrases rather than the more traditional focus on tense and aspect.",
        "Our translation method is considerably simpler than previous attempts in this direction.",
        "We present a prototype software implementation."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Traditionally, database management systems were designed to store snapshot information, valid at a particular moment of time (state).",
        "However, many applications require handling dynamic time-dependent information, pertaining not only to the present, but also to the past and future.",
        "Adding temporal support to databases has proved to be a surprisingly * This work was carried out as part of the research project \"Semantics of Natural Language Temporal Questions and Interfaces to Temporal Database Systems\" sponsored by the Fund for interdisciplinary research, administered by the Israeli Academy of Science.",
        "We thank Michael Bohlen, Bob Carpenter and Andreas Steiner for each allowing us to incorporate their software within our own.",
        "We also thank Yoad Winter and the anonymous referees for helpful comments on a previous version of this paper.",
        "The work of the second author was partially supported by the fund for the promotion of research in the Technion.",
        "thorny issue (Tansel et al., 1993).",
        "A recent drive to consolidate research efforts has led to the design of a consensus temporal data model and associated temporal database query language, SQL/Temporal, an extension of the popular Structured Query Language (SQL) (Snodgrass, 2000).1 SQL/Temporal represents a significant improvement over standard SQL in allowing programmers to express temporal queries (Snodgrass, 2000).",
        "Since temporal database (TDB) implementations are still in their infancy (Boehlen., 1.995), there is little practical experience with SQL/Temporal.",
        "; let alone experience of non-expert users.",
        "However, it is our belief that such users are bound to find the expression of complex temporal queries in SQL/Temporal to be extremely difficult.",
        "In an attempt to counter this problem, we present a translation method from controlled natural language (NL) to SQL/Temporal.",
        "Following the standard pipeline architecture of such methods, translation is done via an intermediate meaning representation language illustrated in Figure 1.",
        "NL questions are first parsed using a grammar in the Type Logical Grammar (TLG) framework (Carpenter, 1.998; Morrill, 1998).",
        "Simultaneously with parsing, the NL question is translated into a formula of a formal language called LAnc„ (Toman, 1996), based on the interval operators of (Allen, 1983).",
        "The translation is based on an independently motivated novel semantics of sentences modified by temporal Preposition Phrases (PPs) (Pratt and Francez 1997; 2000, Nelken and Francez 1999).",
        "The constructed LAIlen formula is then trans-'Through continued design, SQL/Temporal has evolved from predecessor versions named TSQL2 (Snodgrass, 1995) and ATSQL2 (Boehlen et al., 1996).",
        "It is expected to be incorporated within the new version of SQL named SQL3.",
        "lated into an SQL/Temporal query, which is subsequently submitted to a prototype TDB implementation for evaluation.",
        "Finally, the TDB's answer is presented to the user.",
        "We have implemented this method as a prototype software tool, called Q WERTY, (almost) an acronym for \"Querying with English of Relational Temporal Databases\".",
        "Parsing and translation to LAllen is done using the r.PLG Theorem Prover (Carpenter, 1999).",
        "The translation from LAIIcU to SQL/Temporal is done using an adaptation of a temporal logic (TL) to ATSQL2 translator of (Boehlen et al., 1996).",
        "The resulting query is submitted to a prototype TD13 implementation, called TimeD13 (Steiner, 1997).",
        "The different modules are coupled into an integrated system implemented in Sicstus Prolog on a UNIX platform with a WWW-based graphical front-end.",
        "We discuss some of the directions required in order to turn the system from a research prototype to a working tool."
      ]
    },
    {
      "heading": "2 Related work",
      "text": [
        "There is voluminous literature on the design of N.L interfaces to general (non-temporal) databases (see (Perrault and Grosz, 1.988; Copestake and Jones, 1990; A ndroutsopoulos et al., 1995) for surveys) and by now their main advantages and disadvantages are well understood.",
        "Much less work has been devoted to the design of NI, interfaces to TDBs (Clifford, 1990; Ilintichs, 1988) or other computer systems involving a temporal dimension (Crouch and Pulman, 1993).",
        "01 particular relevance is (Androutsopoulos, 1096), who presents a linguistically motivated translation method from NL queries into TSQL2 using an H.I'SG (Pol-lard and Sag, 1.994) grammar and a TL as an intermediate representation language.",
        "Our approach shares many characteristics with (Androutsopoulos, 1996), but there also important differences, which we point out throughout the Paper.",
        "We begin our presentation of the translation method with a brief overview of the as its structure determines many of the deign choices taken in devising the translation method."
      ]
    },
    {
      "heading": "3 The TDB",
      "text": [
        "A 1.1)111 is a two-sorted first-order structure.",
        "The domain consists of a Data Domain, 1), and a 'Temporal Domain of intervals, T1, defined as follows.",
        "Let Tp be a set (of time points) with a discrete linear order without endpoints, <.",
        "is defined as the set of pairs : al = -Ua,b)la < bAa, b E TU{ – oo, coll.",
        "A relational database schema is a set of single-sorted predicate symbols (Ri, ..., Rh).",
        "Given a relational database schema p, a TDB schema p' is the set of two-sorted predicate symbols (MI, ..., RD, where the sort of is DaritY(ni) x Tr.",
        "A TDB instance of schema p' is a set of relations c DurztYmo x T1, where each w, is finite.",
        "For instance, assume a database schema p consisting of a single binary predicate symbol work, storing for each employee the department in which she is employed.",
        "The TDB schema, p' consists of the relation work', called a valid-time state table, which adds a temporal argument to the original relation, called the valid-time of the table.",
        "The temporal argument can be used to store the history (and perhaps even future plans) of departments in which employees are employed.",
        "Following a suggestion of (Androutsopoulos, 1996), we also include relations mapping names of calendrical items to temporal intervals in p'.",
        "For instance, we store a relation year' mapping the year 2000 to the interval [1.7.2000-31.12.2000] (which in turn is Mapped to an element of 7 ).",
        "We now describe the translation process."
      ]
    },
    {
      "heading": "4 The translation process",
      "text": [
        "The translation process accepts input NL questions in a controlled subset of NL.",
        "Restricting input language in this way enables effective processing of a sufficiently rich fragment while avoiding many of the well-know problems of unrestricted NL.",
        "We use a formal grammar in the TLG framework.",
        "Our grammar is specially designed for use with a particular TDB schema.",
        "Future work will allow easier configuration of the grammar with respect to the schema.. Our grammar is based on work on an independently motivated theory of the semantics of temporality.",
        "Most of the research in this field (see (Steedman, 1997) for a survey) has focused on the issues of tense and aspect.",
        "We handle tense, but purposefully not aspect, which plays",
        "an important role in (Androutsopoulos, 1996).",
        "Aspect, which is used to reflect speakers' temporal viewpoint with respect to reported situations is an important facet of NL temporality.",
        "However, its relevance to TDBs is questionable, as it is unlikely that a realistic TDB would actually encode such subjective viewpoints.",
        "Moreover, handling aspect requires postulating a more complex data model.",
        "For instance, (Androutsopoulos, 1996) augments the TDB model with event-like \"occurrence identifiers\", and adds an additional argument to temporal relations indicating whether a given event has culminated or not.",
        "While such devices may perhaps be linguistically justified, it is unclear whether the TDB community would adopt such augmentations of the model.",
        "Instead, following (Pratt and Francez, 2000; Nelken and Francez, 1999) our focus is on sentences modified by temporal PPs.",
        "These PPs are analyzed as variants of standard generalized quantifiers (Barwise and Cooper, 1981), in which quantification is over time.",
        "Using this framework, we handle questions that refer explicitly to the temporal dimension (e.g. When/during which year ... ) as well as questions in which temporality is implied by the TDB context (e.g. Did Mary work in marketing?, Which employees worked in marketing?).",
        "We handle both clausal and phrasal temporal PPs (e.g. after John worked in R&D, during every year).",
        "An important strength of this semantic theory is that it allows for arbitrary iteration of PPs (e.g. one month during every year until 1992).",
        "In addition, our grammar also handles quantification over individuals (e.g. some employee), coordination and negation.",
        "Input questions are parsed using a lexicalized type-logical grammar.",
        "Lexical items are associated with a syntactic category and a higher-order lambda-term representing its semantics.",
        "Taking advantage of TLG's elegantly tight coupling of syntax and semantics, parsing and construction of a semantic representation in the form of an.",
        "LAlle„ formula proceed simultaneously, in a bottom-up fashion.",
        "We have found using TLG to be advantageous over a feature-structure based formalism (such as F1PSG as in (Androutsopoulos, 1996)), since formula, construction is an integral part of the parsing and does not require complex ad-hoc manipulations of feature structures.",
        "Using a particular grammar helps reduce some of the ambiguity inherent in unrestricted NL.",
        "For instance, whereas in general a preposition such as at is ambiguous between a temporal and a locative interpretation, the choice of the complement NP relative to a given schema-induced grammar deterministically fixes the interpretation.",
        "As another example, whereas iterating several temporal PPs (e.g. during some month every year) opens up exponential scoping possibilities, some choices are eliminated by world knowledge, which is encoded in the grammar (e.g. every year must have higher scope than some month since months are included in years and not vice-versa).",
        "In cases of remaining ambiguity, the user is presented with all the distinct possibilities.",
        "Future work will allow the user to make informed choices between different possible readings, e.g. by presenting him with NI, paraphrases of the alternatives.",
        "We translate NI, questions into I,An„„.",
        "The main reason for not translating directly to SQL/Temporal is that the latter is not closed for sub-formulae, i.e. a sub-formula of a well-formed query is not necessarily well-formed.",
        "Since 1-_,Alle„ is closed for sub-formulae, compositionally constructing formulae while parsing in a bottom-up fashion becomes much easier.",
        "LAlle„ is defined as follows (Taman, 1996).",
        "Let p be the database schema (./?4, , Rk).",
        "Let:",
        "where x, y are variables over I), x is a vector of such variables, I, J are variables or constants over and a is one of the operators: precedes, meets, overlaps, equals, contains.",
        "LAllen is defined as the set of formulae cp E L that contain at most one free variable over The answer to a formula co relative to a TDB D is H co(x,I)}.",
        "To illustrate, consider the NL question: During which years did Mary work in marketing?",
        "The LAlle„ representation for it is constructed in a bottom-up manner.",
        "The meaning representation of the main clause Mary worked in marketing is constructed as: Al (work(mary, marketing, J) A J C past A J C I) In this formula, I denotes a Reichenba,chia,nlike reference time, j denotes a time interval",
        "during which Mary worked in marketing, which is located in the past (the contribution of the tense) and is included within I.",
        "The meaning of the full question is constructed by applying the meaning of the interrogative temporal PP during which year to the meaning of the clause.",
        "Without going into details, the result is:",
        "The effect of applying the PP is that the variable I is now both free and restricted to be the time of a year.",
        "The answer to the formula is the set of intervals / that are years, and during which there is an interval ./ contained in the past, during which Mary worked ill marketing.",
        "We allow iterated PPs to apply in a similar manner.",
        "Not every LAH,„ formula corresponds to an evaluable SQL/Temporal query.",
        "In particular, formulae might have an infinite answer.",
        "-.Formulae that are safe from this and related problems are termed domain-indcpcmicnt ((elder and 'ropor, 1991; A.biteboul et al., 1995).",
        "I )o-main independence is an undecidable semantic property.",
        "I lowever, we impose certain syntactic restrictions on generated formulae that ensure it.",
        "These restrictions also simplify the translation task from I,Auen to SQL/Temporal.",
        "Tins translation is based on a modification of the translator from first-order TI, over time-points to A'1'SQ1,2 of (11oehlen et al., 1996).",
        "The syntactically restricted version of LAH„„ we use has the unique advantage of being very close both to the language used in (Nelken and Francez, 11999) on the one hand and to SQL/'Temporal on the other.",
        "The semantics of NI, temporal expressions is often expressed using explicit reference to intervals.",
        "Likewise, SQL/Temporal has Allen-style operators over intervals.",
        "Androutsopoulos (1996) uses a customized '1'1, as an intermediate language, in which temporal relations are encoded using temporal operators rather than explicit reference to intervals.",
        "We have found using a syntactically restricted version of IJAH„„ to be advantageous, as it actually simplifies the translation.",
        "Continuing our previous example, the resulting LAUD.,, formula is subsequently translated into the following SQL/Temporal query:",
        "The query asks for the first argument of the relation instance year' such that the relation instance work' includes a tuple consisting of `Mary', 'marketing' and a valid tune, which is temporally included in the valid time of the year, as well as in the interval starting at the 'beginning' of time and ending 'now' - viz. the past.",
        "The 'MI responds by returning a table containing exactly the requested year names."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "'Clue addition of the temporal dimension to database systems increases their power but also their complexity.",
        "To increase the usability of T1)135, we present a prototype controlled N-1, interface to a TDB.",
        "Our semantic focus is on the Ilse of temporal generalized quantifiers, based on (Pratt and .Francez, 2000), rather than tense and aspect.",
        "As argued by ((,opestake and -Jones, 1990), handling quantification is one of the areas ill which N.I, interfaces have a potential advantage over both formal languages and graphical user interfaces.",
        "In comparison with previous work, we are able to considerably simplify the translation method.",
        "First, using '11,G, rather than a feature-structure formalism provides a much simpler method for constructing semantic representations.",
        "Second, using 1,Ali„„ as an intermediate meaning representation language yields a much more straightforward translation than using a restricted TL.",
        "One must bear in mind, that our implementation is at the prototype stage.",
        "Turning it into a practical tool would require considerable work, as is true of most comparable systems.",
        "Future work includes increased NI, coverage, adding a disambiguation module, handling nominal and temporal anaphora, allowing multiple-sentence queries, and generation of NI, answers from the results presented by the TDB."
      ]
    }
  ]
}
