{
  "info": {
    "authors": [
      "Juntae Yoon",
      "Yoonkwan Kim",
      "Mansuk Song"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C00-2138",
    "title": "Identifying Temporal Expression and Its Syntactic Role Using FST and Lexical Data from Corpus",
    "url": "https://aclweb.org/anthology/C00-2138",
    "year": 2000
  },
  "references": [
    "acl-J95-2004",
    "acl-J97-2003",
    "acl-P94-1010",
    "acl-P96-1025",
    "acl-W95-0107"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Accurate analysis of the temporal expression is crucial for Korean text processing applications such as information extraction and chunking for efficient syntactic analysis.",
        "It is a complicated problem since temporal expressions often have the ambiguity of syntactic roles.",
        "Tins paper discusses two problems: (1) representing and identifying the temporal expression (2) distinguishing the syntactic function of the temporal expression in case it has a dual syntactic role.",
        "In tins paper, temporal expressions and the context for disambiguation which is called local context are represented using lexical data extracted from corpus and the finite state transducer.",
        "By ex-perhnents, it turns out that the method is effective for temporal expression analysis.",
        "In particular, our approach shows the corpus-based work could make a promising result for the problem in a restricted domain in that we can effectievely deal with a large size of lexical data."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Accurate analysis of the temporal expression is crucial for text processing applications such as information extraction and for chunking for efficient syntactic analysis.",
        "In information extraction, a user might want to get a piece of information about an event.",
        "Typically, the event is related with date or time, which is represented by temporal expression.",
        "Chunking is helpful for efficient syntactic analysis by removing irrelevant intermediate constituents generated through parsing.",
        "It involves the task to divide sentences into non-overlapping segments.",
        "As a result of chunking, parsing would be a problem of analysis inside chunks and between chunks (Yoon, et al., 1999).",
        "Chunking prevents the parser from producing intermediate structures irrelevant to a final output, which makes the parser efficient without losing accuracy.",
        "Thus, it turns out that chunking is an essential stage for the application system like MT that should pursue both efficiency and precision.",
        "Korean, an agglutinative language, has well-developed functional words such as postposition and ending by which the grammatical function of a phrase is decisively determined.",
        "Besides, because it is a head final language and so the head always follows its complement, the chunking is relatively easy.",
        "However, we are also faced with an ambiguity problem in chunking, which is often clue to the temporal expression.",
        "This is because many temporal nouns are used as the modifier of noun and verb in a sentence.",
        "Let us consider the following examples:",
        "We went to the mountain together last summer.",
        "We went to the mountain together in the last summer vacation.",
        "2a 10 wcol(October) 9 il(9th) jconycog(evening) 7 si(7 o'clock) dactonycycong-yi (president/GEN) donthwa-ga(talk/NOM) issda(be) The president will give a talk at 7:00pm in Oct. 7th.",
        "2b 10 wco/(October) 9 i/(9th) jconyeog(evening) 7 si(7 o'clock) biltacagyipyo-rcul(flight ticket/ ACC) yeyaghal su issseulmigya(can reserve) Can 1 reserve the flight ticket for 7:00pm in Oct. 7?",
        "In the examples, each temporal expression plays a. syntactically different role used as noun phrase or adverbial phrase (The underlined is a phrase) although they comprise the same phrasal forms.",
        "The temporal expressions in la and 2a of the example serve as the temporal adverb to modify predicates.",
        "On the other hand, the temporal expressions in lb and 2b are used as the modifier of other nouns.",
        "That is, as a temporal noun either contributes to construction of a noun compound or modifies a predicate, it causes a structural ambiguity.",
        "One solution might be that the POS tagger assigns a different tag to each temporal noun e.g. NN",
        "and ADV.",
        "However, slice dependencies of temporal nouns are lexically decided, it does not seem that their syntactic tags could be accurately predicted with a relatively small size of POS tagged corpus.",
        "Also, the simple rule based approach cannot make satisfactory results without lexical information.",
        "As such, identification of temporal expression is a complicated problem in Korean text analysis.",
        "This paper discusses identification of temporal expressions and their syntactic roles.",
        "In this paper, we would deal with two problems: (1) representing and identifying the temporal expression (2) distinguishing its syntactic function in case it has a dual syntactic role.",
        "Actually, the two problems are closely related since the identification and disambiguation process would be done wider the representation scheme of temporal expression.",
        "The process bases on lexical data extracted from corpus and the finite state transducer (FST).",
        "According to oil]: observation of texts, we could see that a few words following a temporal noun have great effect on the syntactic function of time temporal noun.",
        "Therefore, we note that the structural andiiguity could be resolved in local contexts, and so obtain lexical information for the local contexts from corpus.",
        "The lexical data which contain contexts for disambiguation are represented with temporal word transition over the FST.",
        "Briefly describing our methodology, we first extract concordance data of each temporal word using a concordance program.",
        "The co-occurrences represent relations between temporal words and also explain how temporal nouns and common nouns are combined to generate a compound noun.",
        "It would be the likelihood of word conthination, which helps disambiguate the syntactic role if a temporal word have a syntactic duality.",
        "In particular, we classify temporal nouns into 26 classes in accordance with their meaning and function.",
        "Thus, the word co-occurrences become those among temporal classes or temporal classes and other nouns, which results in reducing the parameter space.",
        "Second, temporal expressions containing the co-occurrences of temporal classes and other nouns are represented with the FYI' to identify temporal expressions and assign their syntactic tags in a sentence.",
        "It has been shown that the FST presents a very efficient way for representing phrases with locality.",
        "The input of the FST is the result from morphological analysis and PUS tagging (here, the temporal noun is tagged only as noun).",
        "Its output is the syntactic tag for each word in the sentence and temporal words are attached tags such as noun and adverb.",
        "Figure 1 shows the overall system from the morphological analyzer to the canker.",
        "Therefore, the process attaches syntactic labels to the previous examples so that chunking would be",
        "We went to the mountain together last summer.",
        "111 [finan(last) ycorcum(summer)] 7' Ar bang ltagc(in vacation) uri-ncun(we/NOM) ltainggc (together) san-c(to mountain) ,gassda(went) - We went to the mountain together in the last summer vacation.",
        "- The president will give a talk at 7:00pin in Oct. 7th.",
        "- Can I. reserve the flight ticket for 7:00pm in Oct. 7?"
      ]
    },
    {
      "heading": "2 Related Works",
      "text": [
        "Abney (1991) has proposed text chunking as a pre-limMary step to parsing on the basis of psychological evidence.",
        "In his work, the chunk was defined as a partitioned segment which corresponds in some way to prosodic patterns.",
        "In addition, complex attachment decisions as occurring in NP or VP analysis are postponed without being decided in chunking.",
        "Ramshaw and Marcus (1995) introduced a baseNP which is a non-recursive NP.",
        "They used transformation-based learning to identify non-recursive baseNPs in a sentence.",
        "Also, V-type chunk was introduced in their system, and so they tried to partition sentences into non-overlapping N-type and V-type chunks.",
        "Yoomi, et al.",
        "(1999) have defined chunking in various ways for efficient analysis of Korean texts and shown that the method is very effective for practical application.",
        "Besides, there have been many works based on the finite state machine.",
        "The finite state machine is often used for systems such as speech processing, pat-termi matching, POS tagging and so forth because of its efficiency of speed and space and its convenience of representation.",
        "As for parsing, it is not suitable for full parsing based on the grammar that has recurrent; property, but for partial parsing requiring simple state transition.",
        "Roche and Schabes (1.995) have transformed the 13rill's rule based tugger to the optimized deterministic FST and improved the speed and space of the tagger.",
        "A. notable one related to this work is about local gnarlmar presented in Gross (1993), which is suitable for representing",
        "rigid phrases, collocations and idioms unlike global grammar for describing sentences of a language in a formal level.",
        "The temporal expression was represented with local grammar in his work, where it was claimed that the formalism of finite automata could be easily used to represent them."
      ]
    },
    {
      "heading": "3 Acquiring Co-occurrence of Temporal Expression",
      "text": []
    },
    {
      "heading": "3.1 Categorizing Temporal Nouns",
      "text": [
        "Since many words have in common a similar meaning and function, they can be categorized by their features.",
        "So do temporal nouns.",
        "That is, we say that `Sunday' and 'Monday' have the same features and so would take the similar behavior patterns such as co-occurring with the similar words in a sentence or phrase.",
        "Hence, in the first place we categorize temporal nouns according to their meaning and function.",
        "We first select 259 temporal nouns and divide them into 26 classes as shown in Table 1.",
        "Among them, some temporal words have syntactic duality and others play one syntactic role.",
        "Thus, the disambiguation process would be applied only to the words with dual syntactic functions."
      ]
    },
    {
      "heading": "3.2 Acquisition of Temporal Expressions from Corpus",
      "text": [
        "Temporal words would be combined with each other in order to be made reference to time, which is called temporal expression.",
        "Since a temporal expression is typically composed of one or a. few temporal words, it seems to be possible to describe a grammar of",
        "the temporal expression with a simple model like finite automata.",
        "In the practical system, however, we are confronted with a complicated problem in treat-Mg temporal expressions since many temporal words have a functional ambiguity used as both a nominal and predicate modifier.",
        "For instance, a temporal noun oneul(today) could play a different role in the similar situation as shown in Figure 2.",
        "In the first and the second path, the words to follow oneul are all noun, but the roles (dependency relations) of oneul are different.",
        "Accurate classification of their syntactic functions is crucial for the application system since great difference would be made according to accuracy of the dependency result.",
        "Practically, we therefore should take into consideration the structural ambiguity resolution as well as their representation itself in identi",
        "Eying temporal expressions.",
        "The point that we note here is that we could predict the syntactic function of temporal words by looking ahead one or two words.",
        "Namely, looking at a few words that follows a temporal word we can figure out which word the temporal expression modifies, and call the following words local context.",
        "Unfortunately, it is not easy to define the local context for determining the syntactic function of each temporal word because they are lexically related.",
        "That is, it is wholly different, from each word whether a temporal 1101111 would modify other 1101111 to form a compound noun or modify a predicate as an adverbial phrase.",
        "Our approach is to use corpus to acquire information about the local context.",
        "Since we could obtain from corpus as many examples as needed, rules for compound word generation can be constructed from the examples.",
        "In this paper, we use co-occurrence relations of temporal nouns extracted from large corpus to represent and construct rules for identification of temporal expressions.",
        "As mentioned before, we would pay attention to two points here: (1) In what order a temporal expression would be represented with temporal words, i.e. description of the temporal expression network.",
        "(2) how the local context would be described to resolve the ambiguity of the syntactic function of temporal expressions.",
        "For this purpose, we first extract example sentences containing each of 259 temporal words from corpus using the KAIST concordance program' (KAIST, 1998).",
        "The number of temporal words is small and so we could manually manipulate lexical data extracted from corpus.",
        "Figure 3",
        "shows example sentences about yco•cum(stunmer) extracted by the concordance program.",
        "Second, we select only the phrases related with temporal words from the examples (Table 4).",
        "As shown in Table 4, uhru is associated with varying words.",
        "Temporal words like temporal prefixes can come before it and common nouns can follow it.",
        "In this stage we describe contexts of each temporal word and the output (syntactic; tag of the temporal word) under the given context.",
        "In particular, each temporal word is assigned a temporal class.",
        "Besides, other nouns serve as local contexts for disambiguation of syntactic function of temporal words.",
        "From the examples, we can see that if bam(night,), byco4ang(villa), bangh ofj(vacation) and so on follows it, yeoreum serves as a component of a compound noun with the following word.",
        "On the other hand, the word naenac which means all the time is a temporal noun and forms a temporal adverbial phrase with other preceding temporal 1101111.",
        "Moreover, yea-reum(stunmer) might represent; time-related expression with preceding temporal prefixes."
      ]
    },
    {
      "heading": "4 Identifying Temporal Expressions and Chunking",
      "text": []
    },
    {
      "heading": "4.1",
      "text": [
        "Representing Temporal Expression Using FST The co-occurrence data extracted by the way described in the previous section can he represented with a finite state machine (Figure 5).",
        "For syntactic function disambiguation and chunking, the automata should produce an output, which leads to a finite state transducer.",
        "In fact, individual description for each data could be integrated into one large FST and represented as the right-hand side in Figure 5.",
        "A finite state transducer is defined with a six",
        "left context",
        "tuple 21;•, Q, F, E) where: 2 1 is a finite input alphabet; E2 is a finite output alphabet; Q is a finite set of states or vertices; i E Q is the initial state; F C Q is the set of final states; ECQxT Ez x Q is the set of transitions or edges.",
        "Although the syntactic function of a temporal expression would be nondeterministically selected from the context, temporal expressions and the lexical data of local context can be represented in a deterministic way due to their finite length.",
        "For the deterministic FST, we define the partial functions 0 and * where q0a = q' iff d(q, a) = {q'} and q* a = w' iff Dq' E Q such that (10 a = q' and ( 5 (q , a, (/) = {0} (Roche and Schabes, 1995).",
        "Then, a subsequential FST is a eight-tuple (E1, E2, Q, i, F, 0, *, p) where: El E2, Q, i and F are the same as the FST; 0 is the deterministic state transition function that maps Q x E1 on Q; * is the deterministic emission function",
        "that maps Q x E1 on E; p : F E; is the final output function.",
        "Our temporal co-occurrence data can be represented with a deterministic finite state transducer",
        "in a similar way.",
        "The subsequential FST for our systein is defined as in Figure 6 mid Figure 7 illustrates the transducer in Figure 6.",
        "In the figure.",
        "ti is a class to wic:11 the temporal word belongs in the temporal classification.",
        "715 is a word other than temporal ones that has the preceding temporal word be its modifier, and wi is not such a word to make a. compound noun.",
        "TN, TA i.u(1.",
        "N7' are syntactic tags.",
        "A word tagged with would modify a succeeding 1101111 like ba,m(night), banyhag(vacation).",
        "A word attached with TA would modify a predicate and one with NT means it is not a temporal word.",
        "Actually, individual FSTs are combined into one and rules for tagging of temporal words are put over the FST.",
        "The rule is applied according to the priority by frequency in case more than one output are possible for a context.",
        "Namely, it is a rule-based system where the rules are extracted from corpus."
      ]
    },
    {
      "heading": "4.2 Chunking",
      "text": [
        "After the FST of temporal expressions adds to words syntactic tags such as TN and TA, chunking is conducted with results from outputs by the FST.",
        "As we said earlier, chunking in Korean is relatively easy only if the temporal expression would be successfully recognized.",
        "Actually, our chunker is also based on the finite state machine.",
        "The following is an example for chunking rules.",
        "Here, N is a 10)1111 without any postposition, NP is a 1101111 with a postposition, TN is a temporal noun recognized as modifying a succeeding noun, NU is a number and UN is a unit 1101111.",
        "After temporal tagging, the drunker transforms 'NT' into N, NP, etc.",
        "according to morphological constituents and their POS.",
        "Briefly, the rule says that an NP chunk is made froth either NP or temporal NP.",
        "An NP would be constructed with one or more nouns and their modifiee or with a noun quantified.",
        "A INP, which is related with time, is made from nouns modified by temporal words which would be identified by the FST.",
        "By identification of' temporal expression and chunking, the following example sentence is chunked as below.",
        "• jinan(last) ycorcum(summer) banyhame(in vacation) uri-neun(we/SUB,11) keninpyu-tco(computer) sc(three) dac-rcu/(unit/OBJ) sassda(bought)",
        "We bought three computers in the last summer vacation."
      ]
    },
    {
      "heading": "Experimental Results",
      "text": [
        "For the experiment about temporal expression, we extracted 300 sentences containing temporal expressions from KIRI POS corpus.",
        "Table 2 shows the re",
        "in a similar way.",
        "The subsequential FS`.17 for our system is defined as in Figure 6 and Figure 7 illustrates the transducer in Figure (i.",
        "In the figure, is a class to winch the temporal word belongs in the temporal classification.",
        "'iuj is a word other than temporal ones that has the preceding temporal word be its modifier, and 7i)j is not such a word to make a compound noun.",
        "TN, TA and NT are syntactic tags.",
        "A word tagged with TN would modify a succeeding noun like bam(night), bang/tay(vacation).",
        "A word attached with TA would modify a predicate and one with NT means it is not a temporal word.",
        "Actually, individual FSTs are combined into one and rules for tagging of temporal words are put over the FST.",
        "The rule is applied according to the priority by frequency in case more than one output are possible for a context.",
        "Namely, it is a rule-based system where the rules are extracted from corpus."
      ]
    },
    {
      "heading": "4.2 Chunking",
      "text": [
        "After the FST of temporal expressions adds to words syntactic tags such as TN and TA, chunking is conducted with results from outputs by the FST.",
        "As we said earlier, chunking in Korean is relatively easy only if the temporal expression would be successfully recognized.",
        "Actually, our chunker is also based on the finite state machine.",
        "The following is an example for chunking rules.",
        "Here, N is a 110iiii without any postposition, NP is a noun with a postposition, TN is a temporal noun recognized as modifying a succeeding noun, NU is a. number and UN is a unit noun.",
        "After temporal tagging, the chunker transforms 'NT' into N. NP, etc.",
        "according to morphological constituents and their POS.",
        "Briefly.",
        "the rule says that an NP chunk is made from either NP or temporal NP.",
        "An NP would be constructed with one or more nouns and their modifiee or with a 1101111 quantified.",
        "A TNP, which is related with time, is made from nouns modified by temporal words which would be identified by the FST.",
        "By identification of temporal expression and chunking, the following example sentence is chunked as below.",
        "• jinan(last) ycorcum(summer) banghao-c(in",
        "-4 We bought three computers in the last summer vacation.",
        "• jinanTN yeareumTN banghag-eNp Uri-UCUTliv p kcompyuteoN seNu (lac-TrulNi, sassdav"
      ]
    },
    {
      "heading": "5 Experimental Results",
      "text": [
        "For the experiment about temporal expression, we extracted 300 sentences containing temporal expressions from EMI POS corpus.",
        "Table 2 shows the re",
        "sults from identifying temporal expressions and disambiguating their syntactic functions.",
        "From the result in the table we see that the method is very effective in that it very accurately identifies all the temporal expressions and assigns them syntactic tags.",
        "And, Table 2 shows the reduction resulted from chunking after temporal expression identification.",
        "We take into consideration the average number of head candidates for each word since our parser is dependency based one.",
        "The test was conducted on the first file (about 800 sentences) of KAIST treebank (Choi et al.",
        ", 1994).",
        "The number was reduced by 31% in candidates compared to the system with no chunking, which makes parsing efficient.",
        "Most of errors were caused by the case where temporal words have different syntactic roles under the same context.",
        "In this case, the global context such as the whole sentence or intersentential information or sometimes very sophisticated processing is needed to resolve the problem.",
        "For instance, '82 nycon(year) hyeonjae-yi(now/GEN)' could be used two-way.",
        "If the speech time is the year 1982, then hyeonjae-yi are combined with 82 nycon to represent time.",
        "Otherwise, 82 does not modify hyeonjae-yi, which cannot be recognized only with the local context.",
        "Nevertheless, the system is promising in that generally it can improve efficiency without losing accuracy which is crucial for the practical system."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "In this paper, we presented a method for identification of temporal expressions and their syntactic functions based on FST and lexical data extracted from corpus.",
        "Since temporal words have the syntactic ambiguity when used in a sentence, it is important to identify the syntactic function as well as the temporal expression itself.",
        "For the purpose, we manually extracted lexical co-occurrences from large corpus and it was possible as the number of temporal nouns is tractable enough to manipulate lexical data by hand.",
        "As shown in the result, lexical co-occurrences are crucial for disambiguating the syntactic function of the temporal expression.",
        "Besides, the finite state approach provided an efficient model for temporal expression processing.",
        "Combined with the chunker, it helped remarkably lessen, by pruning irrelevant candidates, intermediate structures generated while parsing."
      ]
    }
  ]
}
