{
  "info": {
    "authors": [
      "Manabu Okumura"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C00-2160",
    "title": "Producing More Readable Extracts by Revising Them",
    "url": "https://aclweb.org/anthology/C00-2160",
    "year": 2000
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper, we first experimentally investigated the factors that make extracts hard to read.",
        "We did this by having human subjects try to revise extracts to produce more readable ones.",
        "We then classified the factors into five, most of which are related to cohesion, after which we devised revision rules for each factor, and partially implemented a system that revises extracts."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The increasing number of on-line texts available has resulted in automatic text summarization becoming a major research topic in the NLP community.",
        "The main approach is to extract important sentences from the texts, and the main task in this approach is that of evaluating the importance of sentences [MIT, 1999].",
        "This producing of extracts - that is, sets of extracted important sentences - is thought to be easy, and has therefore long been the main way that texts are summarized.",
        "As Paice pointed out, however, computer-produced extracts tend to suffer from a 'lack of cohesion' [Paice, 1990].",
        "For example, the antecedents corresponding to anaphors in an extract are not always included in the extract.",
        "This often makes the extracts hard to read.",
        "In the work described in this paper, we therefore developed a method for making extracts easier to read by revising them.",
        "We first experimentally investigated the factors that make extracts hard to read.",
        "We did this by having human subjects try to revise extracts to produce more readable ones.",
        "We then classified the factors into five, most of which are related to cohesion [Halliday et al., 1976], after which we devised revision rules for each factor, and partially implemented a system that revises extracts.",
        "We then evaluated our system by comparing its revisions with those produced by human subjects and also by comparing the readability judgments of human subjects between the revised and original extracts.",
        "In the following sections we briefly review related works, describe our investigation of what make extracts hard to read, and explain our system for revising extracts to make them more readable.",
        "Finally, we describe our evaluation of the system and discuss the results of that evaluation."
      ]
    },
    {
      "heading": "2 Related Works",
      "text": [
        "Many investigators have tried to measure the readability of texts [Klare, 1963].",
        "Most of them have evaluated well-formed texts produced by people, and used two measures: percentage of familiar words in the texts (word level) and the average length of the sentences in the texts (syntactic level).",
        "These measures, however, do not necessarily reflect the actual readability of computer-produced extracts.",
        "We therefore have to take into account other factors that might reduce the readability of extracts.",
        "One of them could be a lack of cohesion.",
        "Halliday and Ilasan [Halliday et al., 1976] described five kinds of cohesion: reference, substitution, ellipsis, conjunction, and lexical cohesion.",
        "Mind [Minel et al., 1997] tried to measure the readability of extracts in two ways: by counting the number of anaphors in an extract that do not have antecedents in the extract, and by counting the number of sentences which are not included in an extract but closely connected to sentences in the extract.",
        "We therefore regard kinds of cohesion as important in trying to classify the factors that make extracts less readable in the next section.",
        "One of the notable previous works dealing with ways to produce more cohesive extracts is that of Paice [Paice, 1990].",
        "Mathis presented a framework in which a pair of short sentences are combined into one to yield a more readable extract [Mathis et al., 1973].",
        "We think, however, that none of the previous studies have adequately investigated the factors making extracts hard to read.",
        "Some investigators have compared human-produced abstracts with the original texts and investigated how people revise texts to produce abstracts",
        "[Kawahara, 1989, Jing, 1999].",
        "Revision is thought to",
        "be done for (at least) the following three purposes: (1) to shorten texts, (2) to change the style of texts, (3) to make texts more readable.",
        "Jing [Ding, 1999] is trying to implement a human summarization model that includes two revision operations: reduction (1) and combination (3).",
        "Mani [Mani et al., 1999] proposed a revision system that uses three operations: elimination (1), aggregation (1), and smoothing (1, 3).",
        "Mani showed that his system can make extracts more informative without degrading their readability.",
        "The present work, however, is concerned not with improving readability but with improving the informativeness."
      ]
    },
    {
      "heading": "3 Less Readability of Extracts",
      "text": [
        "To investigate the revision of extracts experimentally, we had 12 graduate students produce extracts of 25 newspaper articles from the NIHON KEIZAI SHINBUN, the average length of which was 30 sentences.",
        "We then asked them to revise the extracts (six subjects per extract).",
        "We obtained extracts containing 343 revisions, made for any of the three purposes listed in the last section.",
        "We selected the revisions for readability, and classified them into 5 categories, by taking into account the categories of cohesion by Halliday and Hasan[Halliday et al., 1976].",
        "Table 1 shows the sum of the investigation.",
        "Next, we illustrate each category of revisions.",
        "In the examples, darkened sentences are those that are not included in extracts, but are shown for explanation.",
        "The serial number in the original text is also shown at the beginning of sentences 1.",
        "A) Lack of conjunctive expressions/presence of extraneous conjunctive expressions The relation between sentences 15 and 16 is ad-versative, because there is a conjunctive ' L h' L (However)' at the beginning of sentence 16.",
        "But because sentence 15 is not in the extract, ' L h' L (However)' is considered unnecessary and should be deleted.",
        "Conversely, lack of conjunctive expressions might cause the relation between sentences to be difficult to understand.",
        "In such a case, a suitable conjunctive expression should be added.",
        "For these tasks, discourse structure analyzer is required.",
        "'We use the following three tags to show revisions.",
        "<>< /add >: add a new expression Bi.",
        "< del >< /de.1 >: delete an expression B.,.",
        "< rep Ey> B, < ircp >: replace an expression a, with E4.",
        "B) Syntactic complexity 2.",
        "RiFijij;before revision)",
        "(It is the first project in telecommunication business, which President Kashio wants to be one of the central businesses in the future, and it is also the preparation for expanding the business to cellular",
        "(It is the first project in telecommunication businesses, which President Kashio wants to be one of the central business in the future.)",
        "<t_A/W)l61T1 (It is also the preparation for expanding the business to cellular phone.)",
        "Longer sentences tend to have a syntactically complex structure [Klare, 1963], and a long compound sentence should generally be divided into two simpler sentences.",
        "It has also been claimed, however, that short coordinate sentences should be combined [Mathis et al., 1973].",
        "has been making use of NTT Captain system since 1987.)",
        "If subjects of adjacent sentences in an extract are the same, as in the above example, readers might think they are redundant.",
        "In such a case, repeated expressions should be omitted or replaced by pronouns.",
        "In this example, the anaphoric expression (fl (the company)' is used instead of the original expression.",
        "(The company plans to give women more opportunity to work by employing full-time workers.)",
        "15..z.to .,c-lz-11tl[Pn < ALB:WT.0MM'.",
        "(Since there have been no similar cases before, the project that women join is now in a hard situation, though the company puts hopes on it.)",
        "16.",
        "<del> L h. L. </del> ficz tFi17:EMMA, ).+V)AITI.",
        "(<del>However,</del> it is making efforts of reformation which will be profitable both for the company and the female workers.)",
        "done well, because its management strategy exactly fits the age of low growth.)",
        "In this example, the referent of zc- t-11-C- (in such a situation)' in sentence 9 is sentence 8, which is not in the extract.",
        "In such a case, there are two ways to revise: to replace the anaphoric expression with its antecedent, or to delete the expression.",
        "The revision in the example is the latter one.",
        "For the task, a method for anaphora and ellipsis resolution is required.",
        "sell softwares using CD-ROM, and he think it is a big project for his company.)",
        "In this second example, since TEO Son' appears without the name of the company in the extract, without any background knowledge, we may not understand what company Mr.",
        "Son is the CEO of.",
        "Therefore, the name of the company `Softbank' should be added as the supplementary information.",
        "The task requires a method for information extraction or at least named entity extraction.",
        "E) lack of adverbial particles/presence of extraneous adverbial particles 26.I't I(11 lmPVC: ;-',Fat) (It is a good opportunity to promote the mutual understanding between Japan and Vietnam that Mr. Do MUOI, a chief secretary of Vietnam, visits",
        "(Japanese government should consider long-term economical support<del>, too </del>.)",
        "In the above example, there is an adverbial particle '4, (, too)' and we can find that sentences 29 and 30 are paratactical.",
        "But, because sentence 29 is not in the extract, the particle `4, (, too)' is unnecessary and should be deleted."
      ]
    },
    {
      "heading": "4 Revision System",
      "text": [
        "Our system uses the Japanese public-domain analyzers JUMAN [Kurohashi et al., 1998] and KNP [Kurohashi, 1998] morphologically and syntactically analyze an original newspaper article and its extract.",
        "It then applies revisions rules to the extract repeatedly, with reference to the original text, until no rules can revise the extract further."
      ]
    },
    {
      "heading": "4.1 Revision Rules",
      "text": [
        "Because the techniques needed for dealing with all the categories of revisions dealt with in the previous",
        "section were not available, we devised and implemented revision rules only for factors (A), (C), and (D) in Table 1 by using JPerl.",
        "a) Deletion of conjunctive expressions We prepared a list of 52 conjunctive expressions, and made it a rule to delete each of them whenever the extract does not include the sentence that expression is related.",
        "To identify the sentence related to the sentence by the conjunction [Mann et al., 1986], the system performs partial discourse structure analysis taking into account all sentences within three sentences of the one containing the conjunctive expression.",
        "The implementation of our partial discourse structure analyzer was based on Fukumoto's discourse structure analyzer [Fukumoto, 1990].",
        "It infers the relationship between two sentences by referring to the conjunctive expressions, topical words, and demonstrative words.",
        "c) Omission of redundant expressions If subjects (or topical expressions marked with topical postposition `wa') of adjacent sentences in an extract were the same, the repeated expressions were considered redundant and were deleted.",
        "d-1) Deletion of anaphors To treat anaphora and ellipsis successfully, we would need a mechanism for anaphora and ellipsis resolution (finding the antecedents and omitted expressions).",
        "Because we have no such mechanism, we implement a rule with ad hoc heuristics: If an anaphor appears at the beginning of a sentence in an extract, its antecedent must be in the preceding sentence.",
        "Therefore, if that sentence was not in the extract, the anaphor was deleted.",
        "d-2) Supplement of omitted subjects If a subject in a sentence in an extract is omitted, the revision rule supplements the subject from the nearest preceding sentence whose subject is not omitted in the original text.",
        "This rule is implemented by using heuristics similar to the above revision rule."
      ]
    },
    {
      "heading": "5 Evaluation of Revision System",
      "text": [
        "We evaluated our revision system by comparing its revisions with those by human subjects (evaluation 1), and comparing readability judgments between the revised and original extracts (evaluation 2)."
      ]
    },
    {
      "heading": "5.1 Evaluation 1: comparing system",
      "text": [
        "revisions and human revisions Because revision is a subjective task, it was not easy to prepare an answer set of revisions to which our system's revisions could be compared.",
        "The revisions that more subjects make, however, can be considered more reliable and more likely to be necessary.",
        "When comparing the revisions made by our system with those made by human subjects, we therefore took into account the degree of agreement among subjects.",
        "For this evaluation, we used 31 newspaper articles (NIHON KEIZAI SHINBUN) and their extracts.",
        "They were different from the articles used for making rules.",
        "Fifteen of extracts are taken from Nomoto's work [Nomoto et al., 1997], and the rest were made by our group.",
        "The average numbers of sentences in the original articles and the extracts were 25.2 and 5.1.",
        "Each extract was revised by five subjects who had been instructed to revise the extracts to make them more readable and had been shown the 5 examples in section 3.",
        "As a result, we obtained 167 revisions in total.",
        "The results are listed in Table 2.",
        "We compared our system's revisions with the answer set comprising revisions that more than two subjects made.",
        "And we used recall (R) and precision (P) as measures of the system's performances.",
        "(Number of system's revisions matched to the answer Number of system's revisions Evaluation results are listed in Table 3.",
        "As in Table 3, the coverage of our revision rules is rather small (about 1/4) in the whole set of revisions in Table 2.",
        "It is true that the experiment is rather small and can be considered as less reliable.",
        "Though it is less reliable, some of the implemented rules can cover most of the necessary revisions by human subjects.",
        "However, precision should be improved.",
        "Number of revisions in the answer (Number of system's revisions matched to the answer"
      ]
    },
    {
      "heading": "5.2 Evaluation 2: comparing human",
      "text": [
        "readability judgments of original and revised extracts In the second evaluation, using the same 31 texts as in evaluation 1, we asked five human subjects to rank the following four kinds extracts in the order of readability: the original extract (without revision)(NON-REV), human-revised ones (REV-1 and REV-2), and the one revised by our system (REV-AUTO).",
        "REV-1 and REV-2 were respectively extracts revised in the cases where more than one and more than two subjects agreed to revise.",
        "We considered a judgment by the majority (more than two subjects) to be reliable.",
        "The results are listed in Table 4.",
        "Tile column 'split' in Table 4 indicates the number of cases where no majority could agree.",
        "The results show that both REV-1 and REV2 extracts were more readable than NON-REV extracts and that REV-2 extracts might be better than REV-1 extracts, since the number of 'worse' evaluations was smaller for REV-2 extracts.",
        "In comparing REV-AUTO with NON-REV, we use 27 texts where the readability does not degrade in REV-2, since the readability cannot improve with revisions by our system in those texts where the readability degrades even with human revisions.",
        "Even with those texts, however, in almost half the cases, the readability of the revised extract was worse than that of the original extract.",
        "The main reason is that the revision system supplemented incorrect subjects."
      ]
    },
    {
      "heading": "6 Discussion",
      "text": [
        "Although the results of the evaluation are encouraging, they also show that our system needs to be improved.",
        "We have to implement more revision rules to enlarge the coverage of our system.",
        "One of the most frequent revisions is to add conjunctions(37%).",
        "We also need to reform our revision rules into more thorough implementation.",
        "To improve our system, we think it is necessary to develop a robust discourse structure analyzer, a robust mechanism for anaphora and ellipsis resolution, and a robust system of extracting named entities.",
        "They are under development now."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "In this paper we described our investigation of the factors that make extracts less readable than they should be.",
        "We had human subjects revise extracts to made them more readable, and we classified the factors into five categories.",
        "We then devised revision rules for three of these factors and implemented a system that uses them to revise extracts.",
        "We found experimentally that our revision system can improve the readability of extracts."
      ]
    }
  ]
}
