{
  "info": {
    "authors": [
      "Matthew Stone"
    ],
    "book": "International Conference on Natural Language Generation",
    "id": "acl-W00-1416",
    "title": "On Identifying Sets",
    "url": "https://aclweb.org/anthology/W00-1416",
    "year": 2000
  },
  "references": [
    "acl-A92-1006",
    "acl-J93-4004",
    "acl-P86-1029",
    "acl-P97-1026",
    "acl-W94-0319",
    "acl-W98-0210",
    "acl-W98-1403"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "A range of research has explored the problem of generating referring expressions that uniquely identify a single entity from the shared context.",
        "But what about expressions that identify sets of entities?",
        "In this paper, I adapt recent semantic research on plural descriptionsusing covers to abstract collective and distributive readings and using sets of assignments to represent dependencies among referencesto describe a search problem for set-identifying expressions that largely mirrors the search problem for singular referring expressions.",
        "By structuring the search space only in terms of the words that can be added to the description, the proposal defuses potential combinatorial explosions that might otherwise arise with reference to sets."
      ]
    },
    {
      "heading": "I Introduction",
      "text": [
        "Natural language interaction lends itself to tasks like generalization, abstraction, comparison, and summarization which call for SETS of objects to be picked out using definite referring expressions.",
        "For example, consider the concrete function of describing the elements of a figure.",
        "In (1 b), we find a pair of elements from (I a); imagine that some notable relationship leads to an intention to identify and comment on just THOSE elements.",
        "As (1c) records, these are the intersecting dotted segments of (la), and can be designated as such.",
        "Or again, we find distinguished in (2b) five elements of (2a), which might hold some independent interest.",
        "So we can and should identify these elements, and (2c), the squares clustered at the lower left, will do the trick.",
        "E!",
        "0 c The squares clustered at the lower left.",
        "Concrete problems like those of (1) and (2) cast into relief the potential difficulty of identifying sets.",
        "The world provides sets with embarrassing abundance, yet we are able to call attention to any of these sets at will, and to describe it at will both by properties its members have on.",
        "their ownthe members.",
        "individually may be square or dottedand by properties or relationships that the set enjoys as a collectionthe set as a whole may be intersecting, or clustered in a certain region.",
        "Reference to sets is more general than picturesque examples like (1) and (2) might suggest.",
        "Linguistic research suggests that covert reference to SETS OF SALIENT ALTERNATIVES plays a pervasive and fundamental role in mediating between the meanings of sentences, and their interpretations in context.",
        "Consider (3), forexample.",
        "(4) a b The squares.",
        "(3) a Only [Mary]F passed.",
        "b Well, [1]F. passed.",
        "c Another student passed.",
        "According to (Rooth, 1992), the interpretation of focusing adverbs such as-onlyTelatesaminstartce a-to a set of alternatives C: the adverb describes a property that makes a unique in C. Thus in (3a) Mary is unique among some set C of individuals in passing.",
        "Likewise, scalar implicature, as illustrated in (3b), depends on distinguishing one claimmy passing, sayas the strongest claim that can be supported among some salient set of claims Cstudents in the class passing, for (3b).",
        "Rooth formalizes the focus marking in these examples as contributing a presupposition that helps to identify these alternative sets.",
        "More generally, a range of lexical items, including the morpheme other from (3c), carry discourse presuppositions that relate their referent to salient alternatives from the contextlike the students we accommodate in understanding (3c) (Bierner and Webber, 2000).",
        "Overtly, ail the examples in (3) involve singular noun phrases that specify isolated individuals.",
        "Nevertheless, representing and reasoning about reference to sets is required for faithful account of how such sentences are interpreted, and thus how such sentences can achieve the communicative goals of a system for natural language generation (NLG).",
        "So how are expressions that refer to sets to be constructed?",
        "In this paper, I will argue that identifying sets of individuals is not as forbidding as it may at first appear.",
        "The extensive literature in NLG on singular references starting with (Dale and Haddock, 1991) tells us what to do.",
        "We must use the INTERPRETATION of provisional descriptions in context to assemble a combination of descriptive elements which identifies the intended target.",
        "Take (2), where we used the descriptive elements square, clustered somewhere, and at the lower :left.. 'Tracking the incremental interpretation of these descriptors should lead to a sequence like that in (4).",
        "d The squares clustered somewhere.",
        "The squares clustered at the lower left.",
        "This high-level story leaves us on familiar ground.",
        "The project of this paper is to realize this high-level story in formal terms.",
        "I begin in Section 2 by framing the problem of singular noun phrase generation more precisely.",
        "The sequel extends this framework with a formal account of plural interpretation and generation.",
        "Section 3 introduces the two independently-motivated observations from formal semantics which form the basis of this account.",
        "The ASSIGNMENT-SET semantics for reference to plurals provides a way to evoke and describe collections with variables that range only over individuals (van den Berg, 1993; van den Berg, 1996).",
        "By using the assignment-set semantics, we can dispense with explicit collections in formalizing an interpretation such as that schematized in (4c); we represent only the individuals involved.",
        "The COVER semantics for predications about pluralities provides a simple scheme of implicit quantification to abstract collective and distributive predication (Gil/on, 1987; Verkuyl and van der Does, 1991; Schwarzschild, 1994; Schwarzschild, 1996).",
        "The cover semantics offers an elegant, and convenient, definition of what it means for the set distinguished in (4c) to be characterized as the squares clustered somewhere.",
        "Section 4 presents the computational model of plural descriptions based on these principles.",
        "In keeping with (4), this model simply and naturally extends 'the models used to generate-singular references.",
        "In particular, as (4) suggests, this model continues to structure the search space for generation in terms of",
        "the words that can be added to the description and to arrive at corresponding interpretations by constraint satisfaction over individuals.",
        "In so doing, the proposal defuses the potential combinatorial explosions that might otherwise arise with reference to sets."
      ]
    },
    {
      "heading": "2 Background",
      "text": [
        "At a high level, we can characterize generation procedures like that of (Dale and Haddock, 1991) or its successors as manipulating linguistic data structures that link together FORMS, MEANINGS and INTERPRETATIONS.",
        "(5) illustrates such a data structure, as it might be entertained in identifying a uniquely identifiable element of (2a).",
        "(5) a E: /the square in the upper left/",
        "(5a) proposes the form the square in the upper left a syntactic structure represented to some degree of abstraction.",
        "(5b) records the semantics for the description as a set of constraintseach constraint is an atomic formula with free variables that specifies the requirement that some lexical meaning contributes to the description; the variables are placeholders for the discourse entities that the description identifies.",
        "And (5c) anticipates how the hearer could process the description, by outlining the possible candidate referents for it; in (5e) we find the element of the figure which x must represent, along with the corresponding (vaguely delimited) region r in the upper left where x is located.",
        "Any data structure linking form, meaning and interpretation combines two kinds of information.",
        "Form and meaning are related by the generator's model of linguistic resources.",
        "In the concrete case, this model is a grammar; LEXICAL semantics determines the separate constraints that can go into a description and ComPOSIT1ONAL semantics determines how these constraints can share variables and so describe common objects.",
        "Meaning and interpretation, meanwhile, are related by a model of the context in which the form is to be uttered.",
        "In interpreting referring expressions,.we appeal to a CONTEXT SET enumerating the salient individuals at some point in the discourse and a commON GROUND listing the instances of constraints that can be presumed to be mutually known at that point.",
        "To determine the interpretation from the meaning, we must instantiate the free variables to individuals in the context set and match the instantiated constraints against the el.",
        "ements-iof the, common.ground.",
        ",In practice, _constraint satisfaction heuristics (Mackworth, 1987) are required to accomplish the process of instantiation and matching with any hope of efficiency.",
        "With an understanding of what data structures such as (5) represent and how to carry out reasoning over them, solving descriptive problems becomes a matter of search.",
        "In practice, this search is typically managed quite simply: for example, (Dale and Haddock, 1991) select transitions among states according to a greedy heuristic, while (Dale and Re-iter, 1995) select alternatives by exploring different kinds of constraints in a fixed order.",
        "In any case, the search starts with a structure defining an empty description, which means nothing and could refer to anything.",
        "Structures are then extended and considered in turn until the interpretation satisfies the system's goals (for example because it allows only a specified value, the intended referent, for a particular variable).",
        "The process of extension simply consists of deriving a more elaborate form with a richer meaning using the generator's linguistic resourcesit is useful to think of obtaining this by carrying out a step of derivation in a lexicalized grammar (Stone and Doran, 1997)and then consulting the model of the context to obtain an updated interpretation, To extend these data structures to sets, we cannot introduce set variables and maintain the alternative candidate set values those variables might ultimately refer tofor one thing, there are just too many sets to represent an interpretation this way.",
        "3 An intuition and some semantics Here.",
        "is a sue-Ees-,tion: REINTERPRET..dala.struclures like (5) as compatible with descriptions of collections as well as singletons.",
        "This should have some intuitive appeal.",
        "After all, we always thought that a form like (5a) abstracted out details of syntax and morphology; there's no difficulty then in seeing it as short for a family of singular and plural expressions like /the squares) in the upper 101.",
        "Similarly, the interpretation is already defined in terms of a set of instances that satisfy the description; why not use this as THE set that the description refers to?",
        "The problem is the meaning.",
        "We have to allow",
        "for both DISTRIBUTIVE predicates, which characterize collections based on properties of the individuals involved, and COLLECTIVE predicates, which describe collections that jointly participate in some relation.",
        "If we have collective predicates, how can we get away without explicit set variables which could take on any set as a possible value?",
        "Van den Berg's treatment of dependent plurals in dynamic semantics provides the first half of the answer (van den Berg, 1993; van den Berg, 1996).",
        "Van den Berg's starting observation is that discourse can set up and maintain dependencies between the individuals in one set and the individuals in another.",
        "(6) a Every man loves a woman.",
        "b They prove this by giving them flowers.",
        "In (6) for example, the first sentence introduces a set of men and a set of women, where each man in the one set is related to a woman in the other set (by love); the second sentence builds on that relationship, indicating another connection (of giving) between each man and the corresponding woman.",
        "For van den Berg, data like (6) show that discourses describe sets of CASES generally.",
        "Each case involves a sequence of entities that stand in various relationships to one another, sometimes directly as individuals and sometimes indirectly through their membership in larger, related groups.",
        "Some sentences in discourse aggregate cases together, to express relationships that hold collectively among groups.",
        "Other sentences, like (6), zoom in on individual cases, and describe distributive properties which hold of isolated individuals.",
        "In zooming in on cases, rather than individuals, these sentences maintain and extend the dependencies and other relationships that define a case.",
        "The second half of the answer derives from the observation, made in (Gillon, 1987; Verkuyl and van der Does, 1991; Schwarzschild, 1994; Schwarzschild,- -199.6); :that .the .collective-and distributive readings of plurals represent only the extremes in a larger space of readings.",
        "Take (7): (7)Rogers, Hammerstein and Hart wrote musicals.",
        "This sentence is true, but only in virtue of the joint action of Rogers and Hammerstein in writing some musicals and the-joint.",
        "action-of Rogers and Hart in writing other musicals.",
        "As a matter of fact, the three never wrote a musical individually or as a single team, so both the collective and distributive readings are false.",
        "We will follow Schwarzschild's proposal most closely.",
        "Schwarzschild argues that we establish that a linguistic predicate applies to a plural argument by recovering a salient cover of :that argument from the context.",
        "A cover here means a set of pluralities whose union or sum is the overall plural argument.",
        "Given the cover, the overall plural predication holds just in case the basic property denoted by the predicate is true (collectively) of each of the sets (or CELLS) in the cover.",
        "For example, the sets consisting of Rogers and Hammerstein and of Rogers and Hart form the salient cover of Roger, Hammerstein and Hart in (7); the example is true because each of the cells in this cover directly enjoys the property of having written a musical.",
        "Schwarzschild's covering proposal and van den Berg's assignment-set proposal are perfectly compatible.",
        "Following van den Berg, we interpret discourses in terms of sets of cases, where these cases spell out dependencies among related individuals.",
        "But now, following Schwarzschild, we zoom in on those cases flexibly, by covering them.",
        "Sometimes we consider all the cases together and describe relationships among aggregated groups; sometimes we consider cases separately and describe individuals distributively; and sometimes, as in (7), we take an intermediate step and cluster the cases into some salient subgroups.",
        "Now let us return to (4c), repeated as (8a), and",
        "consider informally what this proposal amounts to: (8) a",
        "b The squares clustere somewhere.",
        "The assignment-set cover semantics fits the description to the figure this way.",
        "As in (5c), the figure schematizes a set of cases; here each case involves two entities, a square and the location of the cluster to which the square belongs.",
        "The description applies because we can look at the individual cases to see that we have squares, and we can group the cases together by region into a cover so that in-each cell the squares are indeed clustered at the location.",
        "At this point, some formalism is required to pro-0El",
        "ceed with the development.",
        "We'll use assignment variables like g to range over cases; gx is the value of g for variable x.1 Interpretations are defined in terms of sets of cases, naturally; we'll use r to range over a set of cases and write F(x)- for {gx: g E r}.",
        "Most constraints will involve several variables; we can abstract this in terms of a sequence Of VariableSX and the tuple of collections that those variables take on across a set of cases, r(x).",
        "(We can define this explicitly as F(x) = G where GA-1 = r(x;).)",
        "Now, consider an atomic constraint F(x).",
        "In general, F(x) will have multiple known instances, and each instance will relate collections of individuals to one another.",
        "Thus the common ground will associate F(x) with a set of tuples of sets, which we write as ElF(x)-.",
        "An interpretation r will fit one of those instances directly iff r(x) E IF(x)j.",
        "In this case we say F(x) DESCRIBES F. For example, consider the constraint clustered(x,r).",
        "Let us say a set X is clustered around R if R is a singleton spatial location {r} and X is a group of sufficient cardinality and density located together at r. Then we might find three tuples of aclustered(x,r)fi in the explicit depiction of (8).",
        "If we define r1 as in (9) then clustered(x, r) describes r1.",
        "(9){(x, r) : x a square in the lower left region r} Of course, we are principally interested in the ability to zoom in to particular cases, using covers.",
        "We represent a cover using a reflexive binary relation that links each assignment to any assignment in its cell.",
        "Given such a relation C, the constraint (Dc pread \"covered by C, p\"says that p is true on each of the cells of the cover specified by C. We will only consider the case where p is an atomic constraint F(x).",
        "(10) C)cF(x) DESCRIBES F iff for all g E F, F(x) describes {h E r : C(g, h)}.",
        "Continuing from (9).",
        "define F and F3 in ( I la) and",
        "11 adopt the notation throughout that v is a tuple and ri is component i of v, where components may be indexed equivalently by variables or numbers.",
        "Lower case Roman letters are for ordinary individuals and tuples thereof: upper case Roman letters are for sets of individuals and tuples thereof; upper case Greek letters are for sets of tuples.",
        "Then with C defined as in (12), C)cclustered(x,r) describes ri U F2 LI r3.",
        "(12) C = (r, x F1) U (F2 x r2) U (r3 X F3).",
        "Observe the close connection between this formal judgment and -the-informal -discussion.of f8) presented",
        "earlier.",
        "We have a set of cases involving a square and the location of the cluster to which the square belongs; we cover the cases together by region and find that the resulting groups define a specified cluster at a specified location.",
        "Schwarzschild's proposal is that the salient cover C is supplied from context.",
        "In the case of definite reference to tuples F, we can regard the tuples in any predicate as defining the appropriate salient cover for plural predication; any tuples that help to identify r must be prominent parts of the shared context.",
        "Meanings of referring expressions should therefore appeal to a condition p which describes riff there is a C for which ocp describes F. Clearly, if p describes F and p describes I' then p describes F u r. This in turn entails that any condition C)p describes a maximal set of cases from the current context; the same goes for any conjunction of conditions of this form.",
        "We can treat this set of cases as the interpretation of a description.",
        "In particular, consider a description L that consists of a list of constraints L; (x) formulated in terms of a tuple of variables x and atomic conditions on those variables Li(x).",
        "Assume a context set D defining a domain of salient individuals, so that candidate cases to interpret L are given by r {a a, E D}.",
        "The development thus far leads us to define the INTERPRETATION of L--/(L)as:",
        "Drawing on our running discussion, we can apply this definition to the description L {C)sq.uare(x),(Dclustered(x,r)} and the context schematized by (2a).",
        "Of course, we find 1(L) r, U r, U F3.",
        "The fully distributive cover shows that the square condition is satisfied; the cover of (12) shows that the clustered condition is satisfied.",
        "Meanwhile, no further cases can be considered without adding either a circle or the unclustered square.",
        "The reader will already have recognized 1(L) ri U F2 U P3 as-the set of casessthat-goeswith (8a).",
        "Thus, we have reconciled the informal picture of (4) with the concrete data structures of form, meaning",
        "and interpretation that NLG demands.",
        "For (8) we can now read (14).",
        "(14)a F: /the squares(s) clustered b M: IC) square(x),C)ciuster(x,r)} 4 Computing referring expressions",
        "At this point, we have an understanding of what kinds of representations we can use to describe the derivation of plural referring expressions.",
        "But we still must devise appropriate reasoning methods for these representations.",
        "The problem is the subject of this section."
      ]
    },
    {
      "heading": "4.1 Collective Constraints",
      "text": [
        "The first step is to formulate a constraint-satisfaction heuristic that accounts for cover-constraints on collections.",
        "In general, constraint-satisfaction heuristics provide a technique for approximating the interpretation of a description.",
        "The key notion is that of a CONSTRAINT NETWORK for a description L, which determines a tuple C of CONSTRAINED VALUES.",
        "This tuple specifies a generous set of possible values C, for each variable x, in x; it is obtained by conservatively eliminating values that are determined to be inconsistent with L according to heuristic tests.",
        "For example, the usual arc-consistency heuristic for a constraint over individuals K(x) is to eliminate a value r for variable z unless some g E [K(x)]1 has g, , v and gk E Ci, for all k. We will adapt this to the case of cover constraints with the following test of consistency.",
        "An individual value v for a variable A-1 maintains its membership in C, in the.presence,of.a collective.constraint C)Li(x) whenever v belongs to a SUBSET Gi of Ci which participates directly in the relation denoted by L (x) with sets of possible values for the other variables.",
        "This criterion is spelled out formally in the definition in (15).",
        "(15) Value r for variable xi is",
        "values C if there is an G E [[Li(x)]] with L' E Gi and Gk C Ck for all k. All values of xi in C, that are not c-consistent with constraint 0.L./(x) may be deleted from C,, as they will not satisfy the constraint.",
        "Doing so makes Ci ARC c-consistent with respect to C)Li(x), and provides the basic step in a network-based arc-.consistency constraint-satisfier.",
        "As with ordinary constraint satisfaction, we arrive at a final tuple of values for x by starting with an initial tuple Co of valuesoften an assignment Dx giving each variable Dand a queue of arcs linking each C, with any Li(x) that constrains it.",
        "Until the queue is empty, we select an arc and enforce the arc c-consistency by pruning C1; if Ci changes we requeue all arcs that might no longer be arc c-consistent after the deletion.",
        "I will refer to the final tuple of values as P(L; C0), for the PLURAL constraint network on description L and domains Co.",
        "The properties of this algorithm are in line with ordinary constraint satisfaction.",
        "The output will not provide all and only solutions to the constraints without further assumptions about the constraints.",
        "However, we can show, as usual, that the network converges on consistent values for variables in the ordinary linguistic case where the constraint graph is a treea semantic property, that there are no disjoint sets of constraints that overlap on the same two variables, that follows under plausible assumptions about the derivation of semantics from a tree-structured syntax.",
        "We can show further that these values, together with the tuples in [I.Li(x)] that cover these values, determine precisely the collection of assignments /(L)."
      ]
    },
    {
      "heading": "4.2 Search for Referring Expressions",
      "text": [
        "The second step is to formalize the task of constructing a description as a state-space search task.",
        "Suppressing details of form for exposition, each state is a tuple E as set out in (16).",
        "(16)E=(L,r,R.x,P(L;R,Dx),P(L;Dr,Dx)) The state represents: (17)a a description L; b a tuple r of distinguished free variables in the description for which we must identify specific intended values; c a tuple R of sets describing the value Ri which we intend for the corresponding variable ri;d the remaining free variables of the",
        "e a constraint network P(L; R, Dx) describing - the values for all the free variables in the description, on the assumption that the distinguished variables take on the values we intend; and f a constraint network P(L; Dr Dx) describing the values for all the free variables in the description, on the assumption that the distinguished variables may, like other variables, take on any values from the context set.",
        "The distinction between the variables whose intended reference is fixed and those for which it is derived as a byproduct of the search process is due to Horacek (Horacek, 1995; Horacek, 1996); the distinction derives increased importance when relating one collection to another as the choice of collections need not give rise to explicit branching in search.",
        "The initial state involves an empty description and so has the form given in (18).",
        "(18) E (0, r, R, , P(0; R),P(2); Dr)) A state such as (16) represents a final state that successfully resolves the generation task when each variable x from r and x is associated with the same set Cx in both P(L;R,Dx) and P(L: Dr, Dx ) .",
        "This simply means that the hearer's interpretation of the referring expression matches the speaker's intended interpretation.",
        "At any state E, the grammar defines a set of constraints of the form C)L(rx; y) that could potentially be added to the description to obtain L't.",
        "is some domain relation, r and x name the old variables from L while y names fresh variables.",
        "Of course, we want to restrict our attention to constraints that are compatible with our intended interpretation.",
        "To achieve this restriction, we begin by computing the new constraint network C' , P(Ii; R,Dxy).",
        "We check, whenever R assigns a value tox, that R, C If this test admits the,new constraint, the new.",
        "state obtained from state E is computed as in (19).",
        "(19) (12.r.R.xy,P(LR,Dxy),P(LI;Dr,Dxy))"
      ]
    },
    {
      "heading": "4.3 An Example",
      "text": [
        "I return to (I) to provide an illustration of the final scheme; the goal is to identify the segments in (20f), R, from among those in (20a).",
        "I use figures and references to figures, :in ,p Ince -of, con straint, networks; the description uses the variable r. The states proceed, perhaps, thus:",
        "Descriptions of sets obviously have much in common with expressions that describe a single entity from the shared context.",
        "In particular, adopting the standard view of NLG as goal-directed activity (Ap-pelt, 1985; Dale, 1992; Moore, 1994; Moore and Paris, 1993), singular and plural descriptions agree both in the kinds of intentions that they can achieve and the stages of generation at which they can be formulated.",
        "We cannot expect a single process to be responsible for set descriptions across all intentions or stages of NLG.",
        "For example, as with a singular description, a description of a set may appeal to properties that play a role in the argument the speaker is trying to make, and may therefore address goals above and beyond simple identification of discourse entities.",
        "(See (Donellan, .1966; Kronfeld, 1986) on the distinction.)",
        "(Green et al., 1998a; Green et al., 1998b) show how such descriptions may be represented and formulated in NLG at a high-level process of content or rhetorical planning.",
        "At the same time, plurals and singulars are alike in offering resources for referencesuch as pronouns, one-anaphora or aggregated expressionsthat bypass explicit description altogether.",
        "The use of these resources may be quiteclosely dependent tni the surface forth being generated and so could reflect a relatively late decision in the generation process (Dale and Haddock,",
        "1991; Reiter, 1994; Dalianis, 1996).",
        "These complexities notwithstanding, we can expect many descriptions of sets, like descriptions of individuals, to be formulated from scratch to achieve purely referential goals during the SENTENCE PLANNING .",
        "phase of NLG,\"-between content planning and surface realization (Rambow and Korelsky, 1992; Reiter, 1994).",
        "I have shown that using covers to abstract collective and distributive readings-and using sets of assignments to represent plural references-yields a search space for this problem which largely mirrors that for singulars, and which avoids computation and search over sets of collections.",
        "Although sets proliferate explosively, it is no surprise that the search space for plurals set up by (19) is, like that for singulars, ultimately defined by the sequences of elements that make up descriptions.",
        "NLG involves search to use words effectively-choices of words should be the only decisions a referring expression generation system has to make."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This paper benefits from the comments of anonymous referees and from discussions with Kees van Deemter, Roger Schwarzschild, Bonnie Webber, the Edinburgh generation group, and the participants of the GNOME workshop where a preliminary version was presented; it was supported by a postdoctoral fellowship from RuCCS."
      ]
    }
  ]
}
