{
  "info": {
    "authors": [
      "Michael Strube",
      "Maria Wolters"
    ],
    "book": "Applied Natural Language Processing Conference and Meeting of the North American Association for Computational Linguistics",
    "id": "acl-A00-2003",
    "title": "A Probabilistic Genre-Independent Model of Pronominalization",
    "url": "https://aclweb.org/anthology/A00-2003",
    "year": 2000
  },
  "references": [
    "acl-J95-2003",
    "acl-J96-2004",
    "acl-J97-1007",
    "acl-P97-1005",
    "acl-P98-1011",
    "acl-W98-1119",
    "acl-W99-0107",
    "acl-W99-0108",
    "acl-W99-0611"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Our aim in this paper is to identify genre-independent factors that influence the decision to pronominalize.",
        "Results based on the annotation of twelve texts from four genres show that only a few factors have a strong influence on pronominalization across genres, i.e. distance from last mention, agreement, and form of the antecedent.",
        "Finally, we describe a probabilistic model of pronominalization derived from our data."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Generating adequate referring expressions is an active research topic in Natural Language Generation.",
        "Adequate referring expressions are those that enable the user to quickly and unambiguously identify the discourse entity that the expression co-specifies with.",
        "In this paper, we concentrate on an important aspect of that question, which has received less attention than the question of anaphora resolution in discourse interpretation, i.e., when is it feasible to pronominalize?",
        "Our aim is to identify the central factors that influence pronominalization across genres.",
        "Section 2 motivates and presents the factors that were investigated in this study: distance from last mention, parallelism, ambiguity, syntactic function, agreement, sortal class, syntactic function of the antecedent and form of the antecedent.",
        "Our analyses are based on a corpus of twelve texts from four different genres with a total of more than 24,000 words and 7126 referring expressions (Section 3).",
        "The results of the statistical analyses are summarized in Section 4.",
        "There are strong statistical associations between each of the factors and pronominalization.",
        "Only when we combine them into a probabilistic model we can identify those factors whose contribution is really important, i.e. distance from last mention, agreement, and to a certain degree form of the antecedent.",
        "Since these factors can be annotated relatively cheaply, we conclude that it is possible to develop reasonable statistical pronominalization algorithms."
      ]
    },
    {
      "heading": "2 Factors in Pronoun Generation 2.1 Previous Work",
      "text": [
        "Lately, a number of researchers have done corpus-based work on NP generation and pronoun resolution, and a number of studies have found differences in the frequency of both personal and demonstrative pronouns across genres.",
        "However, none of these studies compares the influence of different factors on pronoun generation across genres.",
        "Recently, Poesio et al.",
        "(1999) have described a corpus-based approach to statistical NP generation.",
        "While they ask the same question as previous researchers (e.g. Dale (1992)), their methods differ from traditional work on NP generation.",
        "Poesio et al.",
        "(1999) use two kinds of factors: (1) factors related to the NP under consideration such as agreement information, semantic factors, and discourse factors, and (2) factors related to the antecedent, such as animacy, clause type, thematic role, proximity, etc.",
        "Poesio et al.",
        "(1999) report that they were not able to annotate many of these factors reliably.",
        "On the basis of these annotations, they constructed decision trees for predicting surface forms of referring expressions based on these factors - with good results: all 28 personal pronouns in their corpus were generated correctly.",
        "Unfortunately, they do not evaluate the contribution of each of these factors, so we do not know which ones are important.",
        "Work on corpus-based approaches to anaphora resolution is more numerous.",
        "Ge et al.",
        "(1998) describe a supervised probabilistic pronoun resolution algorithm which is based on complete syntactic information.",
        "The factors they use include distance from last mention, syntactic function and context, agreement information, animacy of the referent, a simplified notion of selectional restrictions,",
        "Sortal Class (cf. Tab.",
        "2) Syntactic function of antecedent.",
        "\"F\" for first mention, \"N\" for deadend Form of antecedent (pers.",
        "pron., poss.",
        "pron., def.",
        "NP, indef.",
        "NP, proper name) Distance to last mention in units Dist reduced to 4 values (deadend,",
        "and the length of the coreference chain.",
        "Cardie & Wagstaff (1999) describe an unsupervised algorithm for noun phrase coreference resolution.",
        "Their factors are taken from Ge et al.",
        "(1998), with two exceptions.",
        "First, they replace complete syntactic information with information about NP bracketing.",
        "Second, they use the sortal class of the referent which they determine on the basis of WordNet (Fellbaum, 1998).",
        "There has been no comparison between corpus-based approaches for anaphora resolution and more traditional algorithms based on focusing (Sidner, 1983) or centering (Grosz et al., 1995) except for Azzam et al.",
        "(1998).",
        "However, their comparison is flawed by evaluating a syntax-based focus algorithm on the basis of insufficient syntactic information.",
        "For pronoun generation, the original centering model (Grosz et al., 1995) provides a rule which is supposed to decide whether a referring expression has to be realized as a pronoun.",
        "However, this rule applies only to the referring expression which is the backward-looking center (Cb) of the current utterance.",
        "With respect to all other referring expression in this utterance centering is underspecified.",
        "Yeh & Mellish (1997) propose a set of handcrafted rules for the generation of anaphora (zero and personal pronouns, full NPs) in Chinese.",
        "However, the factors which appear to be important in their evaluation are similar to factors described by authors mentioned above: distance, syntactic constraints on zero pronouns, discourse structure, salience and animacy of discourse entities."
      ]
    },
    {
      "heading": "2.2 Our Factors",
      "text": [
        "The factors we investigate in this paper only rely on annotations of NPs and their co-specification relations.",
        "We did not add any discourse structural annotation, because (1) the texts are extracts from larger texts which are not available to us, and (2) we have not yet found a labelling scheme for discourse structure that has an inter-coder reliability comparable to the MUC coreference annotation scheme.",
        "Based on our review of the literature and relevant work in linguistics (for sortal class, mainly Fraurud (1996) and Fellbaum (1998)), we have chosen the nine factors listed in Table 1.",
        "Methodologically, we distinguish two kinds of factors: NP-level factors are independent from co-specification relations.",
        "They depend on the semantics of the discourse entity or on discourse information supplied for the NP generation algorithm by the NLG system.",
        "Typical examples are NP agreement by gender, number, person and case, the syntactic function of the NP (subject, object, PP adjunct, other), the sortal class of the discourse entity to which an NP refers, discourse structure, or topicality of the discourse entities.",
        "In this paper, we focus on the first three factors, agreement (Agree), syntactic function (Syn), and sortal class (Class).",
        "Since we are using syntactically annotated data in the Penn Treebank-II format, the syntactic function of an NP was derived from these annotations.",
        "Agreement for gender, number, and person was labelled by hand.",
        "Since English has almost no nominal case morphemes, case was not annotated.",
        "Sortal classes provide information about the discourse entity that a referring expression evokes or accesses.",
        "The classes, summarized in Table 2, were derived from EuroWordNet BaseTypes (Vossen, 1998) and are defined extensionally on the basis of WordNet synsets.",
        "Their selection was motivated by two main considerations: all classes should occur in all genres, and the number of classes should be as small as possible in order to avoid problems with sparse data.",
        "Four classes, State, Event, Action, and Property, cover different types of situations, two cover spatiotemporal characteristics of situations (LociTime).",
        "The four remaining classes cover the two dimensions \"concrete vs. abstract (Con-cept)\" and \"human (Pers) vs. non-human (PhysObj) vs. institutionalised groups of humans (Group)\".",
        "Since we are only interested in the decision whether to employ pronouns rather than full NPs and less in the form of the NP itself, and since our methodology is based on corpus annotation, we did not take into account more formal semantic categories such as kinds vs. individuals.",
        "Co-specification-level factors depend on information about sequences of referring expressions",
        "genre-specific corpora (CF, CG, CK, CL) and the complete data set (all).",
        "% correct: correctly predicted pronominalization decition, AIC: Akaike Information Criterion, % variation: percentage of original variation in the data (as measured by deviance) accounted for by the model ther theoretical interpretation.",
        "Results of a first evaluation of the full model are summarized in Table 5.",
        "The model can explain more than two thirds of the variation in the complete data set and can predict pronominalization quite well on the data it was fitted on.",
        "The matter becomes more interesting when we examine the genre-specific results.",
        "Although overall prediction performance remains stable, the model is obviously suited better to some genres than to others.",
        "The best results are obtained on CF, the worst on CL (mystery fiction).",
        "In the CL texts, MCUs are short, a third of all referring expressions are pronouns, there is no first person singular narrator, and most paragraphs which mention persons are about the interaction between two persons.",
        "The Relative Importance of Factors.",
        "All values of Dist4 have very strong weights in all models; this is clearly the most important factor.",
        "The same goes for Agree, where the first and second person are strong signs of pronominalization, and, to a lesser degree, masculine and feminine third person singular.",
        "The most important distinction provided by Class appears to be that between Persons, non-Persons, and Times.",
        "This holds as well when the model is only trained on third person referring expressions.",
        "For singular referring expressions, Per-sonhood information is reflected in gender, but not for plural referring expressions.",
        "Another important influence is the form of the antecedent.",
        "The syntactic function of the referring expression and of its antecedent are less important, as is ambiguity.",
        "In order to examine the importance of the factors in more detail, we refitted the models on the complete data set while omitting one or more of the three central features Dist4, Agree, and Class.",
        "The results are summarized in Table 6.",
        "The most interesting finding is that even if we exclude all three factors, prediction accuracy only drops by 3.2%.",
        "This means that the remaining 4 factors also contain most of the relevant information, but that this information is coded more \"efficiently\", so to speak, in the first three.",
        "Speaking of these factors, questions concerning the effect of sortal class remains.",
        "Remarkably enough, when sortal class is omitted, accuracy increases by 0.7%.",
        "The increase in AIC can be explained by a decrease in the amount of explained variation.",
        "A third result is that information about the form of the antecedent can substitute for distance information, if that information is missing.",
        "Both variables code the crucial distinctions between expressions that evoke entities and those that access evoked entities.",
        "Furthermore, a pronominal antecedent tends to occur at a distance of less than 2 MCUs.",
        "The contribution of syntactic function remains stable and significant, albeit comparatively unimportant.",
        "Predictive Power: To evaluate the predictive power of the models computed so far, we determine the percentage of correctly predicted pronouns and NPs.",
        "The performance of the trained models was compared to two very simple algorithms: Algorithm A: Always choose the most frequent option (i.e. noun).",
        "Algorithm B: If the antecedent is in the same MCU, or if it is in the previous MCU and there is no ambiguity, choose a pronoun; else choose a noun.",
        "Table 7 summarises the results of the comparison.",
        "To determine the overall predictive power of",
        "data in % correct prediction if referring expression is to be pronominalised or not.",
        "Setup for genres: model is trained on three genres, tested on the remaining one the model, we used 10-fold cross-validation.",
        "Algorithm A always fares worst, while algorithm B, which is based mainly on distance, the strongest factor in the model, performs quite well.",
        "Its overall performance is 3.2% below that of the full model, and 3.6% below that of the full model without sortal class information.",
        "It even outperforms the models on CG, which has the lowest percentage of Persons (12.9% vs. 35% for CF and 43.4% and 43.5% for CL and CK).",
        "For all other genres, the statistical models outperform the simple heuristics.",
        "Excluding sortal class information can boost prediction performance on unseen data by as much as 0.4% for the complete corpus.",
        "The apparent contradiction between this finding and the results reported in the previous section can be explained if we consider that not only were some sortal classes comparatively rare in the data (Property, Event), but that our sortal class definition may still be too fine-grained.",
        "We evaluated the genre-independence of the model by training on three genres and testing on the fourth.",
        "The results show that the model fares quite well for genre CF, which is also the genre where the overall fit was best (see Table 5).",
        "We therefore hypothesize that the decrease in performance is mainly due to the model itself, not to the training data.",
        "The results presented in both Table 5 and 7 show that although the model we have found is not quite as genre-independent as we would want it to be, it provides a reasonable fit to all the genres we examined."
      ]
    },
    {
      "heading": "5 Future Work",
      "text": [
        "We have described a probabilistic model of pronominalization that is able to correctly predict 93% of all pronouns in a corpus that consists of twelve texts from four different genres.",
        "Since the model was derived from a limited corpus and a limited number of genres, we cannot guarantee that our results are applicable to all texts without modifications.",
        "But since its performance on our sample is consistently above 90% correct, we are reasonably confident that our main findings will hold for a wide variety of texts and text types.",
        "In particular, we isolated several factors which are robust predictors of pronominalization across genres: distance from last mention and agreement, and to a certain extent the form of the antecedent, which appears to be a good substitute if the other two factors are not available.",
        "All three features can be computed on the basis of a chunk parse, a rough morphosyntactic analysis of the resulting NPs, and co-specification sequences.",
        "In computational terms, they are comparatively cheap.",
        "Large corpora can be annotated relatively quickly with this information, which can then be used for statistical pronoun generation.",
        "The comparatively expensive sortal class annotation, on the other hand, was not very important in the final model; in fact, prediction accuracy decreased when sortal class was included.",
        "There are two main reasons for this: first, the proposed sortal class annotation scheme needs further work,"
      ]
    }
  ]
}
