{
  "info": {
    "authors": [
      "Katja Wiemer-Hastings",
      "Peter Wiemer-Hastings",
      "Sonya Rajah"
    ],
    "book": "Applied Natural Language Processing Conference and Meeting of the North American Association for Computational Linguistics",
    "id": "acl-A00-1013",
    "title": "DP: A Detector for Presuppositions in Survey Questions",
    "url": "https://aclweb.org/anthology/A00-1013",
    "year": 2000
  },
  "references": [
    "acl-A92-1021"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes and evaluates a detector of presuppositions (DP) for survey questions.",
        "Incorrect presuppositions can make it difficult to answer a question correctly.",
        "Since they can be difficult to detect, DP is a useful tool for questionnaire designer.",
        "DP performs well using local characteristics of presuppositions.",
        "It reports the presupposition to the survey methodologist who can determine whether the presupposition is valid."
      ]
    },
    {
      "heading": "Introduction",
      "text": [
        "Presuppositions are propositions that take some information as given, or as \"the logical assumptions underlying utterances\" (Dijkstra & de Smedt , 1996, p. 255; for a general overview, see McCawley, 1981).",
        "Presupposed information includes state of affairs, such as being married; events, such as a graduation; possessions, such as a house, children, knowledge about something; and others.",
        "For example, the question, \"when did you graduate from college\", presupposes the event that the respondent did in fact graduate from college.",
        "The answer options may be ranges of years, such as \"between 1970 and 1980\".",
        "Someone who has never attended college can either not respond at all, or give a random (and false) reply.",
        "Thus, incorrect presuppositions cause two problems.",
        "First, the question is difficult to answer.",
        "Second, assuming that people feel obliged to answer them anyway, their answers present false information.",
        "This biases survey statistics, or, in an extreme case, makes them useless.",
        "The detector for presuppositions (DP) is part of the computer tool QUAID (Graesser, Wiemer-Hastings, Kreuz, Wiemer-Hastings & Marquis, in press), which helps survey methodologists design questions that are easy to process.",
        "DP detects a presupposition and reports it to the survey methodologist, who can examine if the presupposition is correct.",
        "QUAID is a computerized QUEST questionnaire evaluation aid.",
        "It is based on QUEST (Graesser & Franklin, 1990), a computational model of the cognitive processes underlying human question answering.",
        "QUAID critiques questions with respect to unfamiliar technical terms, vague terms, working memory overload, complex syntax, incorrect presuppositions, and unclear question purpose or category.",
        "These problems are a subset of potential problems that have been identified by Graesser, Bommareddy, Swamer, and Golding (1996; see also Graesser, Kennedy, Wiemer-Hastings & Ottati, 1999).",
        "QUAID performs reliably on the first five problem categories.",
        "In comparison to these five problems, presupposition detection is even more challenging.",
        "For unfamiliar technical terms, for example, QUAID reports words with frequencies below a certain threshold.",
        "Such an elegant solution is impossible for presuppositions.",
        "Their forms vary widely across presupposition types.",
        "Therefore, their detection requires a complex set of rules, carefully tuned to identify a variety of presupposition problems.",
        "DP prints out the",
        "presuppositions of a question, and relies on the survey methodologist to make the final decision whether the presuppositions are valid."
      ]
    },
    {
      "heading": "1 How to detect presuppositions",
      "text": [
        "We conducted a content analysis of questions with presupposition problems to construct a list of indicators for presuppositions.",
        "22 questions containing problematic presuppositions were selected from a corpus of 550 questions, taken from questionnaires provided by the U.S. Census Bureau.",
        "The 22 questions were identified based on ratings by three human expert raters.",
        "It may seem that this problem is infrequent, but then, these questions are part of commonly used questionnaires that have been designed and revised very thoughtfully.",
        "Additionally, we randomly selected a contrast question sample of 22 questions rated unproblematic with regard to incorrect presuppositions by all three raters.",
        "Examples (1) and (2) are questions rated as problematic by at least two raters; examples (3) and (4) present questions that do not contain presuppositions.",
        "(1) Is that the same place you USUALLY go when you need routine or preventive care, such as a physical examination or check up?",
        "(2) How much do your parents or parent know about your close friends' parents?",
        "(3) From date to December 31, did you take one or more trips or outings in the United States, of at least one mile, for the PRIMARY purpose of observing, photographing, or feeding wildlife?",
        "(4) Are you now on full-time active duty with the armed forces?",
        "Example (1) presupposes the habit of making use of routine / preventive care; (2) presupposes that the respondent has close friends.",
        "As stated above, incorrect presuppositions are infrequent in well-designed questionnaires.",
        "For example, questions about details of somebody's marriage are usually preceded by a question establishing the person's marital status.",
        "In spite of this, providing feedback about presuppositions to the survey methodologist is useful.",
        "Importantly, QUAD is designed to aid in the design process.",
        "Consider a survey on health-related issues.",
        "In the context of this topic, a survey methodologist may be interested in how many days of work a person missed because of illness, but not think about whether the person actually has a job.",
        "Upon entering the question \"how many days of work did you miss last year because of illness\" into the QUAD) tool, DP would report that the question presupposes employment.",
        "The survey methodologist could then insert a question about employment.",
        "Second, there are subtle presuppositions that may go undetected even by a skilled survey designer.",
        "These are presuppositions about things that are likely (but not necessarily) true.",
        "For example, a question may inquire about a person's close friends (presupposing close friends) or someone's standard place for preventive care (presupposing the habit of making use of preventive care).",
        "DP does not know which presuppositions are likely to be valid or invalid, and is therefore more likely to detect such subtle incorrect presuppositions than a human expert."
      ]
    },
    {
      "heading": "1.1 The presupposition detector (DP)",
      "text": [
        "We constructed a set of presupposition detection rules based on the content analysis.",
        "The rules use a wide range of linguistic information about the input sentences, including particular words (such as \"why\"), part of speech categories (e.g., wh-pronoun), and complex syntactic subtrees (such as a quantification clause, followed by a noun phrase).",
        "We used Eric Brill's rule-based word tagger (1992, 1994a, 1994b), the de facto state of the art tagging system, to break the questions down into part-of-speech categories.",
        "Brill's tagger produces a single lexical category for each word in a sentence by first assigning tags based on the frequency of occurrence of the word in that category, and then applying a set of context-based re-tagging rules.",
        "The tagged text was then passed on to Abney's SCOL/CASS system (1996a, 1996b), an extreme bottom-up parser.",
        "It is designed to avoid ambiguity problems by applying grammar rules on a level-by-level basis.",
        "Each level contains rules that will only fire if they are correct with high probability.",
        "Once the parse moves on to a higher level, it will not attempt to apply lower-level rules.",
        "In this way, the parser identifies chunks of information, which it can be reasonably certain are",
        "connected, even when it cannot create a complete Table 1: Indicators of absence or presence of parse of a sentence.",
        "presuppositions",
        "The indicators for presuppositions were tested against questions rated as \"unproblematic\" to eliminate items that failed to discriminate questions with versus without presuppositions.",
        "We constructed a second list of indicators that detect questions containing no presuppositions.",
        "All indicators are listed in Table 1.",
        "These lists are certainly far from complete, but they present a good basis for evaluating of how well presuppositions can be detected by an NLP system.",
        "These rules were integrated into a decision tree structure, as illustrated in Figure 1.",
        "\"It looks,like you are presupposing Make sure that the presupposition is correct by"
      ]
    },
    {
      "heading": "1.2 Classifying presuppositions",
      "text": [
        "Different types of presuppositions can be distinguished based on particular indicators.",
        "Examples for presupposition types, such as events or possessions, were mentioned above.",
        "Table 2 presents an exhaustive overview of presupposition types identified in our analysis.",
        "Note that some indicators can point to more than one type of presupposition.",
        "DP reports when a presupposition is present, and it also indicates the type of presupposition that is made (e.g., a common ground presupposition or the presupposition of a habit) in order to point the question designer to the potential presupposition error.",
        "DP uses the expressions in the right column in Table 2, selected in accordance with the indicators, and fills them into the brackets in its output (see Figure 1).",
        "For example, given the question \"How old is your child?\", DP would detect the possessive pronoun \"your\", and accordingly respond: \"It looks like you are presupposing a possession (child).",
        "Make sure that the presupposition is correct by consulting the previous questions.\""
      ]
    },
    {
      "heading": "2 Evaluation",
      "text": [
        "In this section, we report summary statistics for the human ratings of our test questions and the measures we computed based on these ratings to evaluate DP's performance."
      ]
    },
    {
      "heading": "2.1 Human ratings",
      "text": [
        "We used human ratings as the standard against which to evaluate the performance of DP.",
        "Three raters rated about 90 questions from 12 questionnaires provided by the Census Bureau.",
        "DP currently does not use context.",
        "To have a fair test of its performance, the questions were presented to the human raters out of context, and they were instructed to rate them as isolated questions.",
        "Ratings were made on a four-point scale, indicating whether the question contained no presupposition (1), probably contained no presupposition (2), probably contained a presupposition (3), or definitely contained a presupposition (4).",
        "We transformed the ratings into Boolean ratings by combining ratings of 1 and 2 (\"no problem\") versus ratings of 3 and 4 (\"problem\").",
        "We obtained very similar results for analyses of the ratings based on the four-point and the Boolean scale.",
        "For simplicity, we just report the results for the Boolean scale."
      ]
    },
    {
      "heading": "2.2 Agreement among the raters",
      "text": [
        "We evaluated the agreement among the raters with three measures: correlations, Cohen's kappa, and percent agreement.",
        "Correlations were significant only between two raters (r = 0.",
        "41); the correlations of these two with the third rater produced non-significant correlations, indicating that the third rater may have used a different strategy.",
        "The kappa scores, similarly, were significant only for two raters (Is = 0.36).",
        "In terms of percent agreement, the raters with correlated ratings agreed in 67% of the cases.",
        "The percentages of agreement with rater 3 were 57% and 56%, respectively.",
        "DP ratings were significantly correlated with the ratings provided by the two human raters who"
      ]
    }
  ]
}
