{
  "info": {
    "authors": [
      "Erhong Yang",
      "Guoqing Zhang",
      "Yongkui Zhang"
    ],
    "book": "Chinese Language Processing Workshop",
    "id": "acl-W00-1209",
    "title": "The Research of Word Sense Disambiguation Method Based on Co-Occurrence Frequency of Hownet",
    "url": "https://aclweb.org/anthology/W00-1209",
    "year": 2000
  },
  "references": [
    "acl-J90-1003",
    "acl-J98-1001",
    "acl-P95-1025"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Word sense disambiguation (WSD) is a difficult problem in natural language processing.",
        "In this paper, a sememe co-occurrence frequency based WSD method was introduced.",
        "In this method, Hownet was used as our information source , and a co-occurrence frequency database of sememes was constructed and then used for WSD.",
        "The experimental result showed that this method is successful."
      ]
    },
    {
      "heading": "Keywords",
      "text": []
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Word sense disambiguation (WSD) is one of the most difficult problems in NLP.",
        "It is helpful and in some instances required for such applications as machine translation, information retrieval, content and thematic analysis, hypertext navigation and so on.",
        "The problem of WSD was first put forward in 1949.",
        "And then in the following decades researchers adopted many methods to solve the problem of automatic word sense disambiguation, including:1) Al-based method, 2) knowledge-based method and 3) corpus-based methodP1 Although some useful results have been got, the problem of word sense disambiguation is far from being solved.",
        "The difficult of WSD is as follow: 1) Evaluation of word sense disambiguation systems is not yet standardized.",
        "2) The potential for WSD varies by task.",
        "3) Adequately large sense-tagged data sets are difficult to obtain.",
        "4) The field has narrowed down approaches, but only a little.",
        "123 In this paper, we use a statistical based method to solve the problem of automatic word sense disambiguationP3 In this method, a new knowledge baseHownetE4'5I was use as knowledge resources.",
        "And instead of words, the sememes which are defined in Hownet were used to get the statistical figure.",
        "By doing this, the problem of data sparseness was solved to a large degree."
      ]
    },
    {
      "heading": "2. A Brief Introduction Of Hownet",
      "text": [
        "Hownet is a knowledge base which was released recently on Internet.",
        "In Hownet, the concept which were represented by Chinese or English words were described and the relations between concepts and the attributes of concepts were revealed.",
        "In this paper, we use Chinese knowledge base, which is an important part of Hownet, as the resource of our disambiguation.",
        "The format of this file is as follow: W_X =word E_X = some examples of this word G_X= the pos of this word DEF= the definition of this word This research project is supported by a gam from Shanxi Natural Science Foundation of China",
        "A important concept used in Hownet that we must introduce is sememe.",
        "In Hownet, sememes refer to some basic unit of senses.",
        "They are used to describe all the entries in Hownet and there are more than 1,500 sememe all together."
      ]
    },
    {
      "heading": "3. Sense Co-occurrence Frequency",
      "text": []
    },
    {
      "heading": "Database",
      "text": [
        "It is well known that some words tend to co-occur frequently with some words than with others[6].",
        "Similarly, some meaning of words tend to co-occur more often with some meaning of words than with others.",
        "If we can got the relations of word meanings quantitatively, it would have some help on word sense disambiguation.",
        "In Hownet, all words are defined with limited sememes and the combination of sememes is fixed.",
        "If we make statistic on the co-occurrence frequency of sememe so as to reflect the co-occurrence of words, the problem of data sparseness would be solved to a large degree.",
        "Based on the above thought, we built a sense co-occurrence frequency database to disambiguate word senses."
      ]
    },
    {
      "heading": "3.1 The Preprocessing Of Hownet",
      "text": [
        "The Hownet we downloaded from Internet is in the form of plain text.",
        "It is not convenient for computer to use and it must been converted into a database.",
        "In the database, each lexical entry is converted into a record.",
        "The formalization description of the records is as follow: <lexical entry> ::= <NO.><morphology> <part-of-speech><definition> Where NO.",
        "is the corresponding number of this lexical entry in Hownet.",
        "And the definition is composed of several sememes (short for SU) which were divided by comma.",
        "In addition, we have deleted the English sememes in order to saving space and speeding up the processing.",
        "Here are some examples after preprocessing:"
      ]
    },
    {
      "heading": "3.2 The Creation Of Sememe Co-occurrence Frequency Database",
      "text": [
        "The sememe co-occurrence frequency database is the basic of sense disambiguation.",
        "Now we will introduce it briefly.",
        "The sememe co-occurrence frequency database is a table of two dimension.",
        "Each item corresponding to the co-occurrence frequency of a pair of sememes.",
        "Before introducing the sememe co-occurrence frequency database, we gave the following definition: Definiton: suppose word W has m sense items in hownet, and the corresponding definition of each sense item is: yll, y12,YI(n1),.",
        "Y21, Y220 0 Y2(n2)0.",
        "YMIPY M2, Y Ym(nm) respectively.We call fyibyi2,youlla sememe set of W(short for SS), and call (1 yll, y12, Y 1(n1)1,( Y21> Y22, Y2(n2)1, yniby,nzy,nound jthe sememe expansion of W (short for SE).",
        "For example, in the above mentioned example, the word \"MF\" has only one sense item.",
        "The corresponding sememe set of this",
        "sense item is { } and the sememe expansion of \"fith \" is {{altl, *ILA\", } .",
        "The word \"T\" has four sense items, and the corresponding sememe set of each item is {MitiA,P-14,4,*}, {NW }, {t1; N) and {\".A,4;.%} respectively.",
        "The sememe expansion of word \"4\" is {{altil,WiT, { 44}, {^4}}, When building the sememe co-occurrence frequency database, the corpus is segmented first and each word is tagged with its sememe expansion in Hownet.",
        "Then for each unique pair of words co-occurred in a sentence (here a sentence is a string of characters delimited by punctuations.",
        "), the co-occurrence data of sememes which belong to the definition of each words respectively were collect.",
        "When collecting co0occurrence data, we adopt a principle that every pair of word which co-occurred in a sentence should have equal contribution to the sememe co-occurrence data regardless of the number of sense items of this word and the length of the definition.",
        "Moreover, the contribution of a word should be evenly distributed between all the senses of a word and the contribution of a sense should been evenly distributed between all the sememe in a sense.",
        "The algorithm is as follow:",
        "It can be concluded from the above algorithm that the SCFD are symmetrical.",
        "In order to saving space and speeding up the processing, we only save those cells (SUJ,SUi ) that satisfying SU; -..SUi",
        "When disambiguate a polysemous word, we given the following equation as the score of a sense item of the polysemous word and the context containing this polysemous word.",
        "The context of the word is the sentence containing this word.",
        "the corresponding sememe set of S, C' is the set of sememe expansion of words in C and GlobaiSS is the sememe set that containing all of the sememe defined in Hownet.",
        "for any sememe set SS and sememe",
        "for any sememe set SS and sememe SU'.",
        "score(SU , SU') = I (SU, SU')(6) for any sememe SU and SU'.",
        "SU') in SCFD.",
        "And for g(SU) and N, we have the following equation:",
        "In equation (7), the mutual-information-like measure deviated from the stardard mutual-information measure by multiple a extra multiplicative factor N, this is because that the scale of the corpus is not large enough that the mutual-information of some sememes pairs would be negtive if it was not normalized by a extra multiplicative factor N. In equation (9), the sum of f(SU,SU') was divided by 2, this is because for each pair of sememes, Ef(SU,SU') is increase by 2. vsu,vsu' When disambiguation, we tag the sememe T that satisfying the following equation to polysemous word W."
      ]
    },
    {
      "heading": "33.2 The Creation Of Mutual Information Database",
      "text": [
        "We have created a mutual information database according to (7),(8) and(9) Here is some examples: The examples in table 1 have a high mutual information.",
        "The sememe pairs in this table have certain semantic relations.",
        "While the examples in table 2 have a low mutual information.",
        "And the sememe pairs in this table have no patency semantic relations.",
        "g(SU) g(SU') Where f(SU,SU') is the co-occurrence frequency corresponding to sememe pair ( SU,",
        "the tightness of semantic relations."
      ]
    },
    {
      "heading": "4. Experiment And Analysis",
      "text": [
        "We did the experiment on a corpus of 10,000 characters from People's Dialy.",
        "Firstly, the corpus is segmented, and then the sememe co-occurrence frequecny database and mutual information database is created.",
        "In the mutual-information database, there is 709,496 data items corresponding to different sememes pairs.",
        "In order to speeding up the processing, the mutual-information database was sorted and indexed according to the first two bytes of each sememe pair.",
        "At last the experiment of disambiguation of some polysemous words was done.",
        "Here is two examples:",
        "We use the following euqation to access the accuracy ratio of disambiguation: the numberof correctlytaggedexample.",
        "accuracy ratio= the total number of examplesin testing se (11) the experimental result is shown in table 4.",
        "The definition ofThe score of sense items andThe score of sense items and word\"\"the context of word \"\" inthe context of word \"\" in",
        "The disambiguation method introduced above have the following charatristics:",
        "(1) The problem of data spraseness is solved in a large degree.",
        "(2) This disambiguation method avoids the laborious hand tagging of training corpus.",
        "(3) This method can been easily applied to other kind of corpus."
      ]
    },
    {
      "heading": "Reference",
      "text": []
    }
  ]
}
