{
  "info": {
    "authors": [
      "Béatrice Daille"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C00-1032",
    "title": "Morphological Rule Induction for Terminology Acquisition",
    "url": "https://aclweb.org/anthology/C00-1032",
    "year": 2000
  },
  "references": [
    "acl-A92-1021",
    "acl-C92-3150",
    "acl-J97-3003",
    "acl-P98-1092",
    "acl-P99-1044"
  ],
  "sections": [
    {
      "text": [
        "IRIN, 2, rue de la Houssiniere.",
        "l3P 92208, 44322 Nantes Codex 3 France daillekt)irin .univ-nantes.11"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "We present the identification in corpora of French relational adjectives (RA (lj) such as gazeux (viscous) which is derived from the noun gaz (gas).",
        "RAdj appearing in nominal phrases are interesting for terminology acquisition because they hold a naming function.",
        "The derivational rules employed to compute the 1101111 from which has been derived the RAdj are acquired.",
        "semi-automatically from a tagged ll1(1 a lem-matized corpora.",
        "These rules are then integrate(1 into a termer which identifies R,Adj thanks to their property of being INfraphrasable by a prepositional phrase.",
        "11,Adj and compound nouns which include a RAdj are then quantified, their linguistic: precision is measured and their informative status is evaluated thanks to a thesaurus of the domain."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Identifying relational adjectives (RAdj) such as malarial, and 1101111 phrases in which they appear such as malarial mosquitoes, could be interesting in several fields of NLP, such as terminology acquisition, topic detection, updating of thesauri, because they hold a naming function acknowledged by linguists: (Levi, 1978), (Melis-Puchulu, 1991), etc.",
        "The use of RAdj is particularly frequent in scientific fields (Monceaux, 1993).",
        "Paradoxically, terminology acquisition systems such as TERMINO (David and Plante, 1990), LEXTER (Bourigault, 1992), TERMS (.1usteson and Katz, 1995), have not been concerned with RAdj.",
        "Even (Ibekwe-Sanjua, 1998) in her study of term variations for identifying research topics from texts does not take into account derivational variants.",
        "Our concern is:",
        "1.",
        "To identify noun phrases in which relational adjectives appear, as well as the prepo",
        "sitional phrases by winch they could be paraphrased.",
        "We will see through another source presented in section 2 that this property of paraphrase can be used to identify these adjectives.",
        "2.",
        "To check the naming character of these ad",
        "jectives and to evaluate the naming character of the 1101111 phrases in which they appear.",
        "Moreover, identifying both the adjective and the prepositional phrase is useful in the field of terminology acquisition for performing accurate term normalization by grouping synonym forms referring to an unique concept such as produit laitier (dairy product) and, produit lait (product with milk), p7nduit de Init.",
        "(product of milk), produit issu du tail (product made of milk), etc.",
        "To carry out tins identification, we use shallow parsing (Abney, 1991), and then, for morphological processing, a dynamic method winch takes as input a corpus labeled with part-of-speech and lemma tags.",
        "The morphological rules are built semi-automatically from the corpus.",
        "In this study, we first define, and give some linguistic properties of RAdj.",
        "We then present; the method to build morphological rules and how to integrate then into a term extractor.",
        "We quantify the results obtained from a technical corpus in the field of agriculture [AGRIC] and evaluate their linguistic and informative precision."
      ]
    },
    {
      "heading": "2 Linguistic properties of relational adjectives",
      "text": [
        "According to linguistic and grammatical tradition, there are two main categories among adjectives: epithetic such as important (significant) and relational adjectives such as laitier (dairy).",
        "The first ones cannot have an agentive interpre",
        "tation in contrast; to the second: the adjective laitier (dairy) within the noun phrase production laitiere (dairy production) is an argument to the predicative noun production (production) and this is not the case for the adjective important (significant) within the phrase production importante (significant production).",
        "Relational adjectives (RAdj) possess the following well-known linguistic properties:",
        "• they are either denominal adjectives",
        "morphologically derived from a noun thanks to suffix – , or adjectives having a noun usage such as mathem,atique (mathematical/mathematics).",
        "For the former, not all the adjective-forming suffixes lead to relational adjectives.",
        "The following suffixes are considered by (Dubois, 1962) as appropriate:-an, -aim, -al, -el, -estrc, - ien, -il(e), -in,-ique.",
        "However, (Guy-on, 1993) remarks that a suffix, even the most appropriate, is never necessary nor sufficient.",
        "Several adjectives carrying a favorable suffix are not relational: this is the case with the adjectives ending with -ique (-ic), which characterize them-istry and which are not derived from a noun, such as desoxyribonucleique (deoryri-bonucleic), dodecanoique (dodecanoic), etc.",
        "Other suffixes inappropriate are sometimes used such as the suffixes 6 and -eux: car-bone (carbon) – > carbone (carbonaceous), cancer (cancer) – > cancereux (cancerous), etc.",
        "• they own the possibility, in special conditions, of replacing the attributive use of a corresponding prepositional phrase.",
        "The preposition employed, as well as the presence or not of a determiner, depends on the head noun of the noun phrase:",
        "• and several other properties such the impossibility of a predicative position, the in",
        "compatibility with a degree modification, etc."
      ]
    },
    {
      "heading": "3 Morphological Rule Induction",
      "text": [
        "To identify RAdj trough a term extractor, we use their paraphrastic property which includes the morphological property, the morphological property being insufficient alone.",
        "We need rules to recover the lemma of the noun from which the lemma of the RAdj has been derived.",
        "These rules follow the following schemata:",
        "S is the relational suffix to be deleted from the end of an adjective.",
        "The result of this deletion is the stem R; M is the mutative segment to be concatenated to R in order to form a noun; exceptions list; the adjectives that should not be submitted to this rule.",
        "For example, the rule [ +e ]{age} says that if there is an adjective which ends with é, we should strip tins ending from it and append the string c to the stem except if tins adjective belongs to the list of exceptions, namely age.",
        "We extract; these morphological rules from the corpora following the method presented, in (Mikheev, 1997) with the difference that; we don't limit the length of the mutative segment.",
        "The relational suffixes are known, only the imitative segments have to be guessed.",
        "For the lemma of an adjective ending with a relational suffix in the corpus Adji, we strip tins suffix of Adji and store the resulting stein in R. Then, WC try to segment this stem R to each noun Nouns appearing in the corpus.",
        "If the subtraction result in an non-empty string, the system creates a morphological rule where the mutative segment is the result of the subtraction of R to Nouns.",
        "We thus obtained couples (Adji, Nouns) associated to a morphological rule.",
        "For example: (gazeux, gaz) [-eux +\"].",
        "This schemata doesn't take into account stem alternants such as:",
        "In order to handle this allomorphy, we use the Levenslitchi's weighted distance (Levenshtein, 1.966) which determines the minimum number of insertions or deletions of characters to transform one word into another.",
        "(Wagner and Fisher, 1974) presents a recursive algorithm to calculate this distance.",
        "with w„,„, being the substring beginning at the nth character and finishing after the inth character of the word w,",
        "and q cost of the insertion/deletion of one character p cost of the substitution of one character by another.",
        "Generally, a substitution is considered as a deletion fifflowed by an insertion, thus p = 2q.",
        "We apply this algorithm to each stein it, obtained after the deletion of the relational suffix, that had not been found as a stem of a noun.",
        "1 we add the constraint that 11, and the noun must share the same two first characters, i.e. the substring computed begin at character 3.",
        "We only retain couples composed of an adjective and a noun with a Levenshtein's weighted equal to 3 (i.e. one substitution + one insertion) .",
        "From these couples, we deduce new relational suffixes to be added to list of allowed suffixes.",
        "More precisely, we consider that such suffixes are al-lomorphic variants of the relation suffixes.",
        "We also add new morphological rules.",
        "For example, for the couple (hygiene, hygi/migue), we add the suffix -enique which is considered as an al-lomorph of the suffix -igue, and create the rule: [ 4,nique +e,ne].",
        "However, this method doesn't retrieve ItAdj built from non autonomous bases of noun classes such as camr/eard (heart/card), nor from Latin noun bases such as ph'e/patcv (father/pate7), ville/urb (townlurb).",
        "We check manually the rules obtained and",
        "added to the list of exceptions the wrong derivations obtained.",
        "Table 1 presents the number of rules retained and the number of variants for each suffix."
      ]
    },
    {
      "heading": "4 Term Extractor",
      "text": [
        "First, we present the term extractor chosen then, the modifications perform to enable the application of the derivational rules."
      ]
    },
    {
      "heading": "4.1 Initial Term Extractor",
      "text": [
        "ACAl3IT (Daille, 1996), the term extractor used for this experiment eases the task of the termi-nologist by proposing, for a given corpus, a list of candidate terms ranked, from the most representative of the domain to the least using a statistical score.",
        "Candidate terms which are extracted from the corpus belong to a special type of cooccurrences:",
        "• the cooccurrence is oriented and follows the linear order of the text; • it is composed of two lexical units winch do not belong to the class of functional words such as prepositions, articles, etc.",
        "; • it matches one of the morphosyntactic patterns of what we will call \"base terms\", or one of their possible variations.",
        "The patterns for base terms are:"
      ]
    },
    {
      "heading": "Nonni a Vinf viandes a griller (grill meat)",
      "text": [
        "These base structures are not frozen structures and do accept several variations.",
        "Those which are taken into account are:",
        "1.",
        "Inflexional and Internal morphosyntactic variants: • graphic and orthographic variants which gather together predictable in-flexional variants: conservation de produit (product preservation), conservations de produit (product preservations), or not: conservation de produit-s (products preservation) and case differences.",
        "• variations of the preposition: chromatographic en colonne (column chromatography), chromatographic sur colonne (chromatography on column); • optional character of the preposition and of the article: fixation azote (nitrogen fixation), fixation d'azote (fixation of nitrogen), fixation de l'azote (fixation of the nitrogen); 2.",
        "Internal modification variants: insertion inside the base-terni structure of a modifier such as the adjective inside the Noun1 (Prep (Det)) Noun2 structure: tail de bre-his (goat's milk), lait crude brebis (milk straight from the goat); 3.",
        "Coordinational variants: coordination of base term structures: alimentation hu-maine (human diet), alimentation animale et humaine (human and animal diet); 4.",
        "Predicative variants: the predicative role of the adjective: pectine methyl& (methylate pectin), ces pectines SOW methylees (these pectins are metylated).",
        "The corpus is tagged and lemmatized.",
        "The program scans the corpus, counts and extracts collocations whose syntax characterizes base-terms or one of their variants.",
        "This is done with shallow parsing using local grammars based on regular expressions (Basin et al., 1993).",
        "These grammars use the morphosyntactic information associated with the words of the corpus by the tagger.",
        "The different occurrences are grouped as pairs formed by lemmas of the candidate term and sorted following an association measure winch takes into account the frequence of the cooccurrences."
      ]
    },
    {
      "heading": "4.2 Term Extractor modifications",
      "text": [
        "The identification of relational adjective takes place after extraction of the occurrences of the candidate terms and their syntactic variations.",
        "The algorithm below resumes the successive steps for identifying relational adjectives:",
        "1.",
        "Examine each candidate of Noun Adj structure; 2.",
        "Apply a transformational rule in order to generate all the possible corresponding base nouns.",
        "We added morphosyntactic constraints for sonic suffixes, such as for the suffix -em, that the identified adjective is not a past-participle; 3.",
        "Search the set of candidate terms for a pair formed with Nonni_ (identical between a Nonni (Prep (Det)) Noun2 and a Nonni Adj structures) and Noun2 generated from step 2.",
        "4.",
        "If step 3 succeeds, group the two base structures under a new candidate term.",
        "Take out all the Noun Adj structures owing this adjective from the set of Noun Adj candidates and rename them as a Noun RAdj structure.",
        "In Step 2, morphological rules generate one or several nouns for a given adjective.",
        "We generate a noun for each relational suffix class.",
        "A class of suffixes includes the allomorphic variants.",
        "This overgeneration method used in information retrieval by (Jacquemin and Tzoukermann, 1999) gives low noise because the base noun must not only be an attested for in the corpus, but must also appear as an extension of a head noun.",
        "For example, with the adjective ionique (ionic), we generate both ionic (ionia) and ion (ion), but only ion (ion) is an attested form; with the adjective gazeux (gaseous), the noun forms gaz (gas) and gaze (gauze); are generated and the two of them are attested; but, the adjective gazeux (gaseous) appears with the",
        "1101111 c'ellange (exchange) which is paraphrased in the corpus by 6change de yaz (gas exchanj«:) and not by (Ichange de gaze (gauze (xchange).",
        "For adjectives with a noun function, as for example problemte technique (technical problem) and probl(\"mte de technique (problem of tech-nics), we have accepted that; a candidate term could share several base structures: one of type Nonni (Prep (Det)) Nonn2 and another of type Nounl Adj.",
        "No computation is needed to see that Noun2 as Noun2 and Adj share the same lemma."
      ]
    },
    {
      "heading": "5 Results and Evaluation",
      "text": [
        "Our corpus, called [AGRIC], is made up of 7 272 abstracts (430 000 words) from French texts in the agriculture domain and extracted from PASCAL.",
        "We used the 13rill part-of-Speech Tag-gel (13rill, 1992) trained for French by (Lecomte and Paroubek, 1996)) and the lemmatizer developed by F. Namer (Toussaint et al., 1998)."
      ]
    },
    {
      "heading": "5.1 Quantitative results",
      "text": [
        "Table 2 resumes the number of base structures extracted from [AGRIC] corpus.",
        "From these base structures, 395 groupings were identified.",
        "The linked presence of noun phrases of which the extension is fulfilled either by a relational adjective, or be a prepositional phrase the number is rare a little bit more than 1 % of the total of occurrences.",
        "But, these groupings allow us to extract from the numerous hapax - - • more than 70 % of the total of occurrences candidates which, we presume, will be highly denominative and to increase the number of occurrences of a candidate term.",
        "The number of relational adjectives which have been identified is 129: agmnomique (agronomical), alimenfaire (food), arachidier ((Jroundnut), aromatique (aromatic), etc."
      ]
    },
    {
      "heading": "5.2 Linguistic Precision",
      "text": [
        "We checked the linguistic accuracy of the 395 structural variations which group a Noma Prep (Det) Noun2 structure and a Noun1 RAcl-j structure.",
        "Reported errors concern 3 incorrect; groupings due to the homography, 1,11d the non homonymy, of the adjective and the noun: fin (thin (Adj)/end (Noun)), couran-t (ordinary(Adj)/current(Noun)), potentiel (potential).",
        "This lead us to a linguistic precision of more than 99 % in tlw identification of relational adjectives.",
        "As a matter of comparison, (Jacquemin, 1999) obtained a precision of 69,6 % for the Noun 1;o Adj morphosyntactic variations calculated according to the morphological families produced by a stemming algorithm applied to the MULTEXT lexical database (MIJIIITXT, 1998) on the same French corpus [AGRIC]."
      ]
    },
    {
      "heading": "5.3 Informative Precision",
      "text": [
        "The thesaurus (AGROVOC, 1998) is a taxonomy of about; 15 000 terms associated with synonyms in a SGML format, which leads to 25 964 different terms.",
        "AGROVOC is used for indexing with data fitting agricultural retrieval systems and indexing systems.",
        "We made two comparisons with AGROVOC: we first checked whether these RAdjit were really part of terms of it and second, we compared the candidate terms extracted with a RAdj with its terms.",
        "We consider that the presence of the RAdj in AGROVOC confirms its informative character, and that the presence of a candidate term attests its terminological value.",
        "From the 124 correct RAdj, 68 appear inside terms of the thesaurus ill epithetic position, and 15 only under their 1101111 form in an extension position, for example a7nchidier (groundnut) does not appear but arachide is used in an extension position.",
        "Moreover, among the 124 adjectives, 73 appear in AGROVOC under their noun term as uniterms.",
        "The adjectives which are not present in the thesaurus in an extension position under either their adjectival or noun form are 11 in number.",
        "So 93 % of them are indeed highly informative.",
        "TA the number of terms in AGROVOC in which the relational adjective appears in an epithetic position, i.e. the terms of Noun 11,Adj structure.",
        "For example TA=15 for the adjective cellulaire (cellular) because it appears in 15 terms of AGR,OVOC such as diffórenciation cellulaire (cellular differ-enciation), division cellulaire (cellular division).",
        "TN the number of terms in AGROVOC in which the noun from which has been derived the relational adjective appears inside a prepositional phrase, i.e. the terms of Nounl Prep (Det) NounRAdi structure.",
        "For example TN=4 for the noun cellule (cell) because it appears in 4 terms of AGROVOC such as ban que de cellules (cell bank), culture de cellules (culture of cells).",
        "CA the number of candidate terms of Noun RAdj structure.",
        "For example, CA=61 for the adjective cellulaire (cellular) because it appears in 61candidate terms such as acide cellulaire (cellular acid), activit6 cellulaire (cellular activity), agregat cellulaire (cellular aggregate).",
        "CN the number of candidate terms of Nounl Prep (Del;) NounnAdj structure.",
        "For example CN58 for the noun ce//u/e (cell) because it appears in 58 candidate terms such as ADN de cellule (cell DNA), addition de cellules (cell addition).",
        "Then, for each candidate term of CA and CN, we checked for their presence in AGR,OVOC.",
        "The only matches that we have accepted are exact matches.",
        "With this comparison, we obtained the following indexes: a the number of candidate terms of Noun RAdj structure found in AGR,OVOC under the Noun RAdj structure.",
        "b the number of candidate terms of Noun RAdj structure found in AGROVOC under the Nonni Prep (Det) NounnAdi structure.",
        "c the number of candidate terms of Nounl Prep (Det) NounnAdj structure found in AGROVOC under the Noun R,Adj structure.",
        "d the number of candidate terms of Nounl.",
        "Prep (Det) NounRAdi structure found in AGROVOC under the Nonni Prep (Det) NounnAdi structure.",
        "These indexes allow us to compute precision P and recall R for each Noun RAdj structure and each Nounl Prep (Det) NounRAdi structure with the help of the following formula:",
        "The averages of precision and recall for the two structures are summarized in table 3.",
        "This comparison of the average of precision computed shows that candidate terms with a Noun RAdj structure are 10 times more likely to be terms than their equivalent in Nounl Prep (Det) NounRAdj.",
        "The analysis of the average of recall is also impressive: it is generally difficult to obtain a recall superior to 25 % when comparing candidate terms extracted from a corpus and a thesaurus of the same domain (Daille et al., 1998).",
        "The average of recalls obtained thanks to the identification of 11,Adj shows that nearly half of the terms built with the defined R,Adj are identified.",
        "These good values of precision and recall have been obtained on linguistic criteria only without taking into account frequency."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "The method proposed in this study to acquire morphological rules from corpora in order to recover derivational term variations trough a term extractor and identify relational adjectives",
        "shows an excellent precision.",
        "We have also proved that noun phrases including a 1.IAdj are far more informative than their equivalent in Nonni Prep (Dot) NounnAdi structure.",
        "We still have to write the program whose task will be to merge new morphological rules acquired from another corpus with the existing ones."
      ]
    }
  ]
}
