{
  "info": {
    "authors": [
      "Simone Teufel",
      "Marc Moens"
    ],
    "book": "Joint SIGDAT Conference on Empirical Methods in Natural Language Processing and Very Large Corpora",
    "id": "acl-W00-1302",
    "title": "What's Yours and What's Mine: Determining Intellectual Attribution in Scientific Text",
    "url": "https://aclweb.org/anthology/W00-1302",
    "year": 2000
  },
  "references": [
    "acl-E99-1015",
    "acl-J91-1002",
    "acl-J94-2004",
    "acl-J96-2004",
    "acl-J97-1003",
    "acl-P98-1112",
    "acl-P99-1046",
    "acl-W97-0713",
    "acl-W98-1123"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We believe that identifying the structure of scientific argumentation in articles can help in tasks such as automatic summarization or the automated construction of citation indexes.",
        "One particularly important aspect of this structure is the question of who a given scientific statement is attributed to: other researchers, the field in general, or the authors themselves.",
        "We present the algorithm and a systematic evaluation of a system which can recognize the most salient textual properties that contribute to the global argumentative structure of a text.",
        "In this paper we concentrate on two particular features, namely the occurrences of prototypical agents and their actions in scientific text."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "When writing an article, one does not normally go straight to presenting the innovative scientific claim.",
        "Instead, one establishes other, well-known scientific facts first, which are contributed by other researchers.",
        "Attribution of ownership often happens explicitly, by phrases such as \"Chomsky (1965) claims that\".",
        "The question of intellectual attribution is important for researchers: not understanding the argumentative status of part of the text is a common problem for non-experts reading highly specific texts aimed at experts (Rowley, 1982).",
        "In particular, after reading an article, researchers need to know who holds the \"knowledge claim\" for a certain fact that interests them.",
        "We propose that segmentation according to intellectual ownership can be done automatically, and that such a segmentation has advantages for various shallow text understanding tasks.",
        "At the heart of our classification scheme is the following trisection:",
        "• BACKGROUND (generally known work) • OWN, new work and • specific OTHER work.",
        "The advantages of a segmentation at a rhetorical level is that rhetorics is conveniently constant tThis work was done while the first author was at the HCRC Language Technology Group, Edinburgh.",
        "BACKGROUND: Researchers in knowledge representation agree that one of the hard problems of understanding narrative is the representation of temporal information.",
        "Certain facts of natural language make it hard to capture temporal information [...] OTHER WORK: Recently, Researcher-4 has suggested the following solution to this problem [...].",
        "WEAKNESS/CONTRAST: But this solution cannot be used to interpret the following Japanese examples: [...] OWN CONTRIBUTION: We propose a solution which circumvents this problem while retaining the explanatory power of Researcher-4's approach.",
        "across different articles.",
        "Subject matter, on the contrary, is not constant, nor are writing style and other factors.",
        "We work with a corpus of scientific papers (80 computational linguistics conference articles (ACL, EACL, COLING or ANLP), deposited on the CMP.LG archive between 1994 and 1996).",
        "This is a difficult test bed due to the large variation with respect to different factors: subdomain (theoretical linguistics, statistical NLP, logic programming, computational psycholinguistics), types of research (implementation, review, evaluation, empirical vs. theoretical research), writing style (formal vs. informal) and presentational styles (fixed section structure of type Introduction – Method – Results – Conclusion vs. more idiosyncratic, problem-structured presentation).",
        "One thing, however, is constant across all articles: the argumentative aim of every single article is to show that the given work is a contribution to science (Swales, 1990; Myers, 1992; Hyland, 1998).",
        "Theories of scientific argumentation in research articles stress that authors follow well-predictable stages of argumentation, as in the fictional introduction in figure 1.",
        "Are the scientific statements expressed in this sentence attributed to the authors, the general field, or specific other researchers?",
        "Own work Other Work Does this sentence contain material that describes the specific aim of the paper?",
        "NO"
      ]
    },
    {
      "heading": "BACKGROUND",
      "text": [
        "Does it describe a negative aspect of the other work, or a contrast or comparison of the own work to it?",
        "Our hypothesis is that a segmentation based on regularities of scientific argumentation and on attribution of intellectual ownership is one of the most stable and generalizable dimensions which contribute to the structure of scientific texts.",
        "In the next section we will describe an annotation scheme which we designed for capturing these effects.",
        "Its categories are based on Swales' (1990) CARS model."
      ]
    },
    {
      "heading": "1.1 The scheme",
      "text": [
        "As our corpus contains many statements talking about relations between own and other work, we decided to add two classes (\"zones\") for expressing relations to the core set of OWN, OTHER and BACKGROUND, namely contrastive statements (CONTRAST; comparable to Swales' (1990) move 2A/B) and statements of intellectual ancestry (BAsis; Swales' move 2D).",
        "The label OTHER is thus reserved for neutral descriptions of other work.",
        "OWN segments are further subdivided to mark explicit aim statements (AIM; Swales' move 3.1A/B), and explicit section previews (TEXTUAL; Swales' move 3.3).",
        "All other statements about the own work are classified as OWN.",
        "Each of the seven category covers one sentence.",
        "Our classification, which is a further development of the scheme in Teufel and Moens (1999), can be described procedurally as a decision tree (Figure 2), where five questions are asked about each sentence, concerning intellectual attribution, author stance and continuation vs. contrast.",
        "Figure 3 gives typical example sentences for each zone.",
        "The intellectual-attribution distinction we make is comparable with Wiebe's (1994) distinction into subjective and objective statements.",
        "Subjectivity is a property which is related to the attribution of authorship as well as to author stance, but it is just one of the dimensions we consider."
      ]
    },
    {
      "heading": "1.2 Use of Argumentative Zones",
      "text": [
        "Which practical use would segmenting a paper into argumentative zones have?",
        "Firstly, rhetorical information as encoded in these zones should prove useful for summarization.",
        "Sentence extracts, still the main type of summarization around, are notoriously context-insensitive.",
        "Context in the form of argumentative relations of segments to the overall paper could provide a skeleton by which to tailor sentence extracts to user expertise (as certain users or certain tasks do not require certain types of information).",
        "A system which uses such rhetorical zones to produce task–tailored extracts for medical articles, albeit on the basis of manually-segmented texts, is given by Wellons and Purcell (1999).",
        "Another hard task is sentence extraction from long texts, e.g. scientific journal articles of 20 pages of length, with a high compression.",
        "This task is hard because one has to make decisions about how the extracted sentences relate to each other and how they relate to the overall message of the text, before one can further compress them.",
        "Rhetorical context of the kind described above is very likely to make these decisions easier.",
        "Secondly, it should also help improve citation indexes, e.g. automatically derived ones like Lawrence et al.'s (1999) and Nanba and Oku-mura's (1999).",
        "Citation indexes help organize scientific online literature by linking cited (outgoing) and citing (incoming) articles with a given text.",
        "But these indexes are mainly \"quantitative\", listing other works without further qualifying whether a reference to another work is there to extend the",
        "earlier work, correct it, point out a weakness in it, or just provide it as general background.",
        "This \"qualitative\" information could be directly contributed by our argumentative zones.",
        "In this paper, we will describe the algorithm of an argumentative zoner.",
        "The main focus of the paper is the description of two features which are particularly useful for attribution determination: prototypical agents and actions."
      ]
    },
    {
      "heading": "2 Human Annotation of Argumentative Zones",
      "text": [
        "We have previously evaluated the scheme empirically by extensive experiments with three subjects, over a range of 48 articles (Teufel et al., 1999).",
        "We measured stability (the degree to which the same annotator will produce an annotation after 6 weeks) and reproducibility (the degree to which two unrelated annotators will produce the same annotation), using the Kappa coefficient K (Siegel and Castellan, 1988; Carletta, 1996), which controls agreement P(A) for chance agreement P(E):",
        "Kappa is 0 for if agreement is only as would be expected by chance annotation following the same distribution as the observed distribution, and 1 for perfect agreement.",
        "Values of Kappa surpassing .8 are typically accepted as showing a very high level of agreement (Krippendorff, 1980; Landis and Koch, 1977).",
        "Our experiments show that humans can distinguish own, other specific and other general work with high stability (K=.83, .79, .81; N=1248; k=2, where K stands for the Kappa coefficient, N for the number of items (sentences) annotated and k for the number of annotators) and reproducibility (K=.78, N=4031, k=3), corresponding to 94%, 93%, 93% (stability) and 93% (reproducibility) agreement.",
        "The full distinction into all seven categories of the annotation scheme is slightly less stable and reproducible (stability: K=.82, .81, .76; N=1220; k=2 (equiv.",
        "to 93%, 92%, 90% agreement); reproducibility: K=.71, N=4261, k=3 (equiv.",
        "to 87% agreement)), but still in the range of what is generally accepted as reliable annotation.",
        "We conclude from this that humans can distinguish attribution and full argumentative zones, if trained.",
        "Human annotation is used as training material in our statistical classifier."
      ]
    },
    {
      "heading": "3 Automatic Argumentative Zoning",
      "text": [
        "As our task is not defined by topic coherence like the related tasks of Morris and Hirst (1991), Hearst (1997), Kan et al.",
        "(1998) and Reynar (1999), we predict that keyword-based techniques for automatic argumentative zoning will not work well (cf. the results using text categorization as described later).",
        "We decided to perform machine learning, based on sentential features like the ones used by sentence extraction.",
        "Argumentative zones have properties which help us determine them on the surface:",
        "• Zones appear in typical positions in the article (Myers, 1992); we model this with a set of location features.",
        "• Linguistic features like tense and voice correlate with zones (Biber (1995) and Riley (1991) show correlation for similar zones like \"method\" and \"introduction\").",
        "We model this with syntactic features.",
        "• Zones tend to follow particular other zones (Swales, 1990); we model this with an ngram model operating over sentences.",
        "• Beginnings of attribution zones are linguistically marked by meta-discourse like \"Other researchers claim that\" (Swales, 1990; Hyland, 1998); we model this with a specialized agents and actions recognizer, and by recognizing formal citations.",
        "• Statements without explicit attribution are interpreted as being of the same attribution as previous sentences in the same segment of attribution; we model this with a modified agent feature which keeps track of previously recognized agents."
      ]
    },
    {
      "heading": "3.1 Recognizing Agents and Actions",
      "text": [
        "Paice (1981) introduces grammars for pattern matching of indicator phrases, e.g. \"the aim/purpose of this paper/article/study\" and \"we conclude/propose\".",
        "Such phrases can be useful indicators of overall importance.",
        "However, for our task, more flexible meta-discourse expressions need to be determined.",
        "The description of a research tradition, or the statement that the work described in the paper is the continuation of some other work, cover a wide range of syntactic and lexical expressions and are too hard to find for a mechanism like simple pattern matching.",
        "We suggest that the robust recognition of prototypical agents and actions is one way out of this dilemma.",
        "The agents we propose to recognize describe fixed role-players in the argumentation.",
        "In Figure 1, prototypical agents are given in boldface (\"Researchers in knowledge representation, \"Researcher-4\" and \"we\").",
        "We also propose prototypical actions frequently occurring in scientific discourse (shown underlined in Figure 1): the researchers \"agree\", Researcher-4 \"suggested\" something, the solution \"cannot be used\".",
        "We will now describe an algorithm which recognizes and classifies agents and actions.",
        "We use a manually created lexicon for patterns for agents, and a manually clustered verb lexicon for the verbs.",
        "Figure 4 lists the agent types we distinguish.",
        "The main three types are US_AGENT, THEM_AGENT and GENERAL_AGENT.",
        "A fourth type is US_PREVIOUS-AGENT (the authors, but in a previous paper).",
        "Additional agent types include non-personal agents like aims, problems, solutions, absence of solution, or textual segments.",
        "There are four equivalence classes of agents with ambiguous reference ( \"this system\"), namely REF_US_AGENT, THEM_PRONOUN_AGENT, AIM.REF_AGENT, REF_AGENT.",
        "The total of 168 patterns in the lexicon expands to many more as we use a replace mechanism (@WORK_NOUN is expanded to \"paper, article, study, chapter\" etc).",
        "For verbs, we use a manually created the action lexicon summarized in Figure 6.",
        "The verb classes are based on semantic concepts such as similarity, contrast, competition, presentation, argumentation and textual structure.",
        "For example, PRESENTATION_ACTIONS include communication verbs like \"present\", \"report\", \"state\" (Myers, 1992; Thompson and Yiyun, 1991), RE-SEARCH_ACTIONS include \"analyze\", \"conduct\" and \"observe\", and ARGUMENTATION_ACTIONS \"argue\", \"disagree\", \"object to\".",
        "Domain-specific actions are contained in the classes indicating a problem ( \"degrade\", \"overestimate\"), and solution-contributing actions (\" \"circumvent\", solve\", \"mitigate\").",
        "The main reason for using a hand-crafted, genre-specific lexicon instead of a general resource such as WordNet or Levin's (1993) classes (as used in Klavans and Kan (1998)), was to avoid polysemy problems without having to perform word sense disambiguation.",
        "Verbs in our texts often have a specialized meaning in the domain of scientific argumentation, which our lexicon readily encodes.",
        "We did notice some ambiguity problems (e.g. \"follow\" can mean following another approach, or it can mean follow in a sense having nothing to do with presentation of research, e.g. following an arc in an algorithm).",
        "In a wider domain, however, ambiguity would be a much bigger problem.",
        "Processing of the articles includes transformation from I4TEX into XML format, recognition of formal citations and author names in running text, tokenization, sentence separation and POS-tagging.",
        "The pipeline uses the TTT software provided by the HCRC Language Technology Group (Grover et al., 1999).",
        "The algorithm for determining agents in subject positions (or By-PPs in passive sentences) is based on a finite automaton which uses POS-input; cf.",
        "Figure 5.",
        "In the case that more than one finite verb is found in a sentence, the first finite verb which has agents and/or actions in the sentences is used as a value for that sentence."
      ]
    },
    {
      "heading": "4 Evaluation",
      "text": [
        "We carried out two evaluations.",
        "Evaluation A tests whether all patterns were recognized as intended by the algorithm, and whether patterns were found that should not have been recognized.",
        "Evaluation B tests how well agent and action recognition helps us perform argumentative zoning automatically."
      ]
    },
    {
      "heading": "4.1 Evaluation A: Correctness",
      "text": [
        "We first manually evaluated the error level of the POS-Tagging of finite verbs, as our algorithm crucially relies on finite verbs.",
        "In a random sample of 100 sentences from our corpus (containing a total of 184 finite verbs), the tagger showed a recall of",
        "1.",
        "Start from the first finite verb in the sentence.",
        "2.",
        "Check right context of the finite verb for verbal forms of interest which might make up more complex tenses.",
        "Remain within the assumed clause boundaries; do not cross commas or other finite verbs.",
        "Once the main verb of that construction (the \"semantic\" verb) has been found, a simple morphological analysis determines its lemma; the tense and voice of the construction follow from the succession of auxiliary verbs encountered.",
        "3.",
        "Look up the lemma of semantic verb in Action Lexicon; return the associated Action Class if successful.",
        "Else return Action 0.",
        "4.",
        "Determine if one of the 32 fixed negation words contained in the lexicon (e.g. \"not, don't, neither\") is present within a fixed window of 6 to the right of the finite verb.",
        "5.",
        "Search for the agent either as a by-PP to the right, or as a subject-NP to the left, depending on the voice of the construction as determined in step 2.",
        "Remain within assumed clause boundaries.",
        "6.",
        "If one of the Agent Patterns matches within that area in the sentence, return the Agent Type.",
        "Else return Agent 0.",
        "7.",
        "Repeat Steps 1-6 until there are no more finite verbs left.",
        "95% and a precision of 93%.",
        "We found that for the 174 correctly determined finite verbs (out of the total 184), the heuristics for negation worked without any errors (100% accuracy).",
        "The correct semantic verb was determined in 96% percent of all cases; errors are mostly due to misrecognition of clause boundaries.",
        "Action Type lookup was fully correct, even in the case of phrasal verbs and longer idiomatic expressions (\"have to\" is a NEED_ACTION; \"be inspired by\" is a CONTINUE_ACTION).",
        "There were 7 voice errors, 2 of which were due to POS-tagging errors (past participle misrecognized).",
        "The remaining 5 voice errors correspond to a 98% accuracy.",
        "Figure 7 gives an example for a voice error (underlined) in the output of the action/agent determination.",
        "Correctness of Agent Type determination was tested on a random sample of 100 sentences containing at least one agent, resulting in 111 agents.",
        "No agent pattern that should have been identified was missed (100% recall).",
        "Of the 111 agents, 105 cases were completely correct: the agent pattern covered the complete grammatical subject or by-PP intended (precision of 95%).",
        "There was one complete error, caused by a POS-tagging error.",
        "In 5 of the 111 agents, the pattern covered only part At the point where John <ACTION"
      ]
    },
    {
      "heading": "TENSE=PRESENT VOICE=ACTIVE",
      "text": [
        "MODAL=NOMODAL NEGATION=O ACTIONTYPE=0> knows </ACTION> the truth has been <FINITE TENSE=PRESENT.PERFECT VOICE=PASSIVE MODAL=NOMODAL NEGA-TION=O ACTIONTYPE=O> processed </ACTION> , a complete clause will have"
      ]
    },
    {
      "heading": "been <ACTION TENSE=FUTUREYERFECT VOICE=ACTIVE MODAL=NOMODAL NEGATION== ACTIONTYPE=O> built </ACTION>",
      "text": [
        "of a subject NP (typically the NP in a postmodify-ing PP), as in the phrase \"the problem with these approaches\" which was classified as REF_AGENT.",
        "These cases (counted as errors) indeed constitute no grave errors, as they still give an indication which type of agents the nominal phrase is associated with."
      ]
    },
    {
      "heading": "4.2 Evaluation B: Usefulness for Argumentative Zoning",
      "text": [
        "We evaluated the usefulness of the Agent and Action features by measuring if they improve the classification results of our stochastic classifier for argumentative zones.",
        "We use 14 features given in figure 8, some of which are adapted from sentence extraction techniques (Paice, 1990; Kupiec et al., 1995; Teufel and Moens, 1999).",
        "1.",
        "Absolute location of sentence in document 2.",
        "Relative location of sentence in section 3.",
        "Location of a sentence in paragraph 4.",
        "Presence of citations 5.",
        "Location of citations 6.",
        "Type of citations (self citation or not) 7.",
        "Type of headline 8.",
        "Presence of tf/idf key words 9.",
        "Presence of title words 10.",
        "Sentence length 11.",
        "Presence of modal auxiliaries 12.",
        "Tense of the finite verb 13.",
        "Voice of the finite verb 14.",
        "Presence of Formulaic Expressions",
        "All features except Citation Location and Citation Type proved helpful for classification.",
        "Two different statistical models were used: a Naive Bayesian model as in Kupiec et al.'s (1995) experiment, cf.",
        "Figure 9, and an ngram model over sentences, cf.",
        "Figure 10.",
        "Learning is supervised and training examples are provided by our previous human annotation.",
        "Classification preceeds sentence by sentence.",
        "The ngram model combines evidence from the context (Cm-1, Cm-2) and from 1 sentential features (Fm,o F171,1- 1), assuming that those two factors are independent of each other.",
        "It uses the same likelihood estimation as the Naive Bayes, but maximises a context-sensitive prior using the Viterbi algorithm.",
        "We received best results for n=2, i.e. a bigram model.",
        "The results of stochastic classification (presented in figure 11) were compiled with a 10-fold cross-validation on our 80-paper corpus, containing a total of 12422 sentences (classified items).",
        "As the first baseline, we use a standard text categorization method for classification (where each sentence is considered as a document*) Baseline 1 has an accuracy of 69%, which is low considering that the most frequent category (OWN) also covers 69% of all sentences.",
        "Worse still, the classifier classifies almost all sentences as OWN and OTHER segments (the most frequent categories).",
        "Recall on the rare categories but important categories AIM, TEXTUAL, CONTRAST and BASIS is zero or very low.",
        "Text classification is therefore not a solution.",
        "*We used the Rainbow implementation of a Naive Bayes tf/idf method, 10-fold cross-validation.",
        "Baseline 2, the most frequent category (OWN), is a particularly bad baseline: its recall on all categories except OWN is zero.",
        "We cannot see this bad performance in the percentage accuracy values, but only in the Kappa values (measured against one human annotator, i.e. k=2).",
        "As Kappa takes performance on rare categories into account more, it is a more intuitive measure for our task.",
        "In figure 11, NB refers to the Naive Bayes model, and NB+ to the Naive Bayes model augmented with the ngram model.",
        "We can see that the stochastic models obtain substantial improvement over the baselines, particularly with respect to precision and recall of the rare categories, raising recall considerably in all cases, while keeping precision at the same level as Baseline 1 or improving it (exception: precision for BASIS drops; precision for AIM is insignificantly lower).",
        "If we look at the contribution of single features (reported for the Naive Bayes system in figure 12), we see that Agent and Action features improve the overall performance of the system by .02 and .04 Kappa points respectively (.36 to .38/.40).",
        "This is a good performance for single features.",
        "Agent is a strong feature beating both baselines.",
        "Taken by itself, its performance at K=.08 is still weaker than some other features in the pool, e.g. the Headline feature (K=.19), the Citation feature (K=.18) and the Absolute Location Feature (K=.17).",
        "(Figure 12 reports classification results only for the stronger features, i.e. those who are better than Baseline 2).",
        "The Action feature, if considered on its own, is rather weak: it shows a slightly better Kappa value than Baseline 2, but does not even reach the level of random agreement (K=0).",
        "Nevertheless, if taken together with the other features, it still improves results.",
        "Building on the idea that intellectual attribution is a segment-based phenomena, we improved the Agent feature by including history (feature SAgent).",
        "The assumption is that in unmarked sentences the agent of the previous attribution is still active.",
        "Wiebe (1994) also reports segment-based agenthood as one of the most successful features.",
        "SAgent alone achieved a classification success of K=.21, which makes SAgent the best single features available in the entire feature pool.",
        "Inclusion of SAgent to the final model improved results to K=.43 (bigram model).",
        "Figure 12 also shows that different features are better at disambiguating certain categories.",
        "The Formulaic feature, which is not very strong on its own, is the most diverse, as it contributes to the disambiguation of six categories directly.",
        "Both Agent and Action features disambiguate cote-gories which many of the other 12 features cannot disambiguate (e.g.",
        "CONTRAST), and SAgent additionally contributes towards the determination of BACKGROUND zones (along with the Formulaic and the Absolute Location feature).",
        "index of sentence (mth sentence in text) number of features considered target category associated with sentence at index m Probability that sentence m has target category Cm, given its feature values Fm,,..., Fm,1 – 1 and given its context Co, •••Cm – i; Probability that sentence rn has target category C, given the categories of the two previous sentences; Probability of feature-value pair Fi occurring within target category C at position m; Probability of feature value Fmj;"
      ]
    },
    {
      "heading": "5 Discussion",
      "text": [
        "The result for automatic classification is in agreement with our previous experimental results for human classification: humans, too, recognize the categories AIM and TEXTUAL most robustly (cf.",
        "Figure 11).",
        "AIM and TEXTUAL sentences, stating knowledge claims and organizing the text respectively, are conventionalized to a high degree.",
        "The system's results for AIM sentences, for instance, compares favourably to similar sentence extraction experiments (cf. Kupiec et al.'s (1995) results of 42%/42% recall and precision for extracting \"relevant\" sentences from scientific articles).",
        "BASIS and CONTRAST sentences have a less prototypical syntactic realization, and they also occur at less predictable places in the document.",
        "Therefore, it is far more difficult for both machine and human to recognize such sentences.",
        "While the system does well for AIM and TEXTUAL sentences, and provides substantial improvement over both baselines, the difference to human performance is still quite large (cf. figure 11).",
        "We attribute most of this difference to the modest size of our training corpus: 80 papers are not much for machine learning of such high-level features.",
        "It is possible that a more sophisticated model, in combination with more training material, would improve results significantly.",
        "However, when we ran them on our data as it is now, different other statistical models, e.g. Ripper (Cohen, 1996) and a Maximum Entropy model, all showed similar numerical results.",
        "Another factor which decreases results are inconsistencies in the training data: we discovered that 4% of the sentences with the same features were classified differently by the human annotation.",
        "This points to the fact that our set of features could be made more distinctive.",
        "In most of these cases, there were linguistic expressions present, such as subtle signs of criticism, which humans correctly identified, but for which the features are too coarse.",
        "Therefore, the addition of \"deeper\" features to the pool, which model the semantics of the meta-discourse shallowly, seemed a promising avenue.",
        "We consider the automatic and robust recognition of agents and actions, as presented here, to be the first incarnations of such features."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "Argumentative zoning is the task of breaking a text containing a scientific argument into linear zones of the same argumentative status, or zones of the same intellectual attribution.",
        "We plan to use argumentative zoning as a first step for IR and shallow document understanding tasks like summarization.",
        "In contrast to hierarchical segmentation (e.g. Marcu's (1997) work, which is based on RST (Mann and Thompson, 1987)), this type of segmentation aims at capturing the argumentative status of a piece of text in respect to the overall argumentative act of the paper.",
        "It does not deter",
        "mine the rhetorical structure within zones.",
        "Sub-zone structure is most likely related to domain-specific rhetorical relations which are not directly relevant to the discourse-level relations we wish to recognize.",
        "We have presented a fully implemented prototype for argumentative zoning.",
        "Its main innovation are two new features: prototypical agents and actions - semi-shallow representations of the overall scientific argumentation of the article.",
        "For agent and action recognition, we use syntactic heuristics and two extensive libraries of patterns.",
        "Processing is robust and very low in error.",
        "We evaluated the system without and with the agent and action features and found that the features improve results for automatic argumentative zoning considerably.",
        "History-aware agents are the best single feature in a large, extensively tested feature pool."
      ]
    }
  ]
}
