{
  "info": {
    "authors": [
      "Rachel Edita O. Roxas",
      "Allan Borra"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P00-1074",
    "title": "Panel: Computational Linguistics Research on Philippine Languages",
    "url": "https://aclweb.org/anthology/P00-1074",
    "year": 2000
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This is a paper that describes computational linguistic activities on Philippines languages.",
        "The Philippines is an archipelago with vast numbers of islands and numerous languages.",
        "The tasks of understanding, representing and implementing these languages require enormous work.",
        "An extensive amount of work has been done on understanding at least some of the major Philippine languages, but little has been done on the computational aspect.",
        "Majority of the latter has been on the purpose of machine translation."
      ]
    },
    {
      "heading": "1 Philippine Languages",
      "text": [
        "Within the 7,200 islands of the Philippine archipelago, there are about one hundred and one (101) languages that are spoken.",
        "This is according to the nationwide 1995 census conducted by the National Statistics Office of the Philippine Government (NSO, 1997).",
        "The languages that are spoken by at least one percent of the total household population include Tagalog, Cebuano, Ilocano, Hiligaynon, Bikol, Waray, Pampanggo or Kapangpangan, Boholano, Pangasinan or Panggalatok, Maranao, Maguin-danao, and Tausug.",
        "Aside from these major languages, there are other Philippine dialects, which are variants of these major languages.",
        "Fortunato (1993) classified these dialects into the top nine major languages as above (except for Boholano which is similar to Cebuano)."
      ]
    },
    {
      "heading": "2 Language Representations",
      "text": [
        "Linguistics information on Philippine languages are extensive on the languages mentioned above, except for Maranao, Maguin-danao, and Tausug, which are some of the"
      ]
    },
    {
      "heading": "Allan BORRA",
      "text": [
        "Software Technology Department De La Salle University 2401 Taft Avenue, Manila, Philippines ccsabb@ccs.dlsu.edu.ph languages spoken in Southern Philippines.",
        "But as of yet, extensive research has already been done on theoretical linguistics and little is known for computational linguistics.",
        "In fact, the computational linguistics researches on Philippine languages are mainly focused on Tagalog.",
        "There are also notable work done on Ilocano.",
        "Kroeger (1993) showed the importance of the grammatical relations in Tagalog, such as subject and object relations, and the insufficiency of a surface phrase structure paradigm to represent these relations.",
        "This issue was further discussed in the LFG98, which is on the problem of voice and grammatical functions in Western Austronesian Languages.",
        "Musgrave (1998) introduced the problem certain verbs in these languages that can head more than one transitive clause type.",
        "Foley (1998) and Kroeger (1998), in particular, discussed about long debated issues such as nouns in Tagalog that can be verbed, the voice system of Tagalog, and Tagalog as a symmetrical voice system.",
        "Latrouite (2000) argued that a level of semantic representation is still necessary to explicitly capture a word’s meaning.",
        "Crawford (1999) contributed to an issue on interrogative sentences and suggested that the restriction on wh-movement reveals the syntactic structure of Tagalog.",
        "Potet (1995) and Trost (2000) provided general materials on computational morphology, though, both presented examples on Tagalog.",
        "Rubino (1997, 1996) provided an in-depth analysis of Ilocano.",
        "Among the major contributions of the work include an extensive treatment of the complex morphology in the language, a thorough treatment of the discourse",
        "particles, and the reference grammar of the language."
      ]
    },
    {
      "heading": "3 Applications in Machine Translation",
      "text": [
        "Currently, most of the empirical endeavours in computational linguistics are in machine translation."
      ]
    },
    {
      "heading": "3.1 Filipino MT Software",
      "text": [
        "There are several commercially available translation software, which include Philippine language, but translation is done word-for-word.",
        "One such software is the Universal Translator 2000, which includes Tagalog among 40 other languages.",
        "Although omni-directional, translation involving Tagalog excludes morphological and syntactic aspects of the language Another software is the Filipino Language Software, which includes Tagalog, Visayan, Cebuano, and Ilocano languages."
      ]
    },
    {
      "heading": "3.2 Machine Translation Research",
      "text": [
        "IsaWika!",
        "is an English to Filipino machine translator that uses the augmented transition network as its computational architecture (Roxas, 1999).",
        "It translates simple and compound declarative statements as well as imperative English statements.",
        "To date, it is the most serious research undertaking in machine translation in the Philippines.",
        "Borra (1999) presented another translation software that translates simple declarative and imperative statements from English to Filipino.",
        "The computational architecture of the system is based on LFG, which differs from IsaWika’s ATN implementation.",
        "Part of the research was describing a possible set of semantic information on every grammar category to establish a semantically-close translation."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "There are various theoretical linguistic studies on Philippine languages, but computational linguistics research is currently limited.",
        "CL activities in the Philippines had yet to gain acceptance from its computing science community."
      ]
    }
  ]
}
