{
  "info": {
    "authors": [
      "Kees van Deemter",
      "Richard Power"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C00-1033",
    "title": "Authoring Multimedia Documents Using WYSIWYM Editing",
    "url": "https://aclweb.org/anthology/C00-1033",
    "year": 2000
  },
  "references": [
    "acl-P98-2173",
    "acl-W98-1427"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "(1) This paper outlines a future 'ideal' multimedia document authoring system that allows authors to specify content and form of the document independently of each other and at a high level of abstraction; (2) It describes a working system that implements a small but significant part of the functionality of such an ideal system, based on semantic modeling of the pictures as well as the text of the document; and (3) It explains what needs to be done to bridge the gap between the implemented system and the ideal one.",
        "1 A Future 'Ideal' Multimedia"
      ]
    },
    {
      "heading": "Document Authoring System",
      "text": [
        "A Document Authoring System is a tool that helps an author to write documents.",
        "If the system supports the authoring of documents that combine 'presentations' in different media (text and images, for example), we will speak of a multimedia document authoring system.",
        "Ideally, a multimedia document authoring system would allow authors to specify the content and form of a high-quality document in ways that are both simple and efficient.",
        "More specifically, an ideal system would afford the following options to the author:",
        "1.",
        "Easy determination of content.",
        "'Content' is taken to mean the factual (i.e., propositional) content of the document – in other words, the content of the Knowledge Base (KB) that forms the input to the document authoring system.",
        "2.",
        "Easy determination of style and layout.",
        "In the absence of specific instructions from the author, style and layout should be determined using intelligent defaults.",
        "(For ex",
        "ample, the standard settings may require the document to be informal, with avoidance of technical terms, lists and footnotes, without maximum paragraph length, and with numbered sections.)",
        "Defaults can be overridden by the author, whereupon other defaults may become relevant.",
        "3.",
        "Easy allocation of media.",
        "As in the case of style and layout, the system has to use judiciously chosen defaults: perhaps using illustrative pictures wherever suitable pictures are available, and graphs or tables wherever large amounts of homogeneously structured quantitative information are involved.",
        "As above, defaults may be overruled by specific requests from the author; if a request; is impossible to fullfil, an appropriate error message should be generated.",
        "4.",
        "Easy annotation of non-generated presen",
        "tations.",
        "In sonic cases, it will be possible for the system to generate presentations.",
        "In other cases, this may be impossible: Literally quoted texts, for example, or historic photographs, may predate the use of the system, in winch case it may be necessary to treat them as 'canned' and to annotate them to allow the system to make intelligent use of them.",
        "5.",
        "Easy post-editing.",
        "Once the system has produced a document according to the specifications of the author, the ideal system would offer tools to address remaining inadequacies using post-editing.",
        "'Easy' means efficient, protected against inconsistencies, and not requiring specialist skills or knowledge.",
        "A domain specialist – who may not know anything about knowledge representation, logic, or linguistics – could use such a system to",
        "build KBs that the system can turn into documents in any desired language using any desired combination of media.",
        "The production and updating of complex documents would be greatly simplified as a result.",
        "In present-day practice, these requirements tend to be far from realized: authoring documents by mans of such tools as Nis WORD or POWER-POINT requires much low-level interaction, such as the typing of characters on a keyboard and the dragging of figures from one physical location to another.",
        "In some cases, an intelligent Multimedia Presentation System (immi's e.g., Bordegoni et al.",
        "1.997) can be used (see AIR 1995, Maybury and Wahlster 1998 flir some surveys), which employs techniques from Artificial intelligence to allow higher-level interaction.",
        "Present; immPs, however, meet few of the requirements mentioned above.",
        "Most of them, for example, require input of a highly specialized nature (e.g., the complex logical forum-las entered in the mill) system, Andrá and Rist 1995)1 and they allow an author little control over the form (e.g., layout, textual style, media allocation) of the document.",
        "The issue of easy annotation (z.\") is never even addressed, to the best of our knowledge.",
        "The next section describes an implemented system for the authoring of textual documents that can be argued to fulfill requirements (1) and (2) and which Rams a suitable starting point for working towards the 'ideal' multimedia system outlined above.",
        "Section 3 describes ui extension of this system in which significant aspects of requirements 3-5 have also been implemented.",
        "Key features of this new system are its ability to use semantic representations that are common to the different media, and the ability to construct natural language feedback texts to help the author understand the content and the form of the document while it is still under construction.",
        "The concluding section explains what needs to be done to fill the gap between the implemented system and the ideal one.",
        "Elsewhere (Power and Scott 1998, Scott et al.",
        "1998, Scott 1999), a new knowledge-editing method called `WYSIWYM editing' has been introduced and motivated.",
        "WYSIWYM editing allows a domain expert to edit a knowledge base (KB) by interacting with a feedback text, generated by the system, which presents both the knowledge already defined and the options for extending and modifying it.",
        "Knowledge is added or modified by menu-based choices which directly affect the knowledge base; the result is displayed to the author by means of an automatically generated feedback text: thus 'What You See is What You Meant'.",
        "WYSIWYM instantiates a general recent trend in dialogue systems towards moving some of the initiative from the user to the system, allowing such systems to avoid the difficulties of processing 'open' (i.e., unconstrained) input.",
        "Of particular importance, here, are applications of WYSIWYM to the generation of documents containing text and pictures; the present section focuses on (multilingual) text generation: the KB created with the help of WYSIWYM used as input to a natural language generation (Nbo) program, producing as output a document of some sort, for the benefit of an end user.",
        "Present applications of WYSIWYM to text generation use a Kb-ONE-type knowledge representation language as input to two NLO systems.",
        "One NLCI system generates feedback texts (ffir the author) and the other generates output texts (for an end user).",
        "One application currently under development has the creation of Patient; information Leaflets (PILLS) as its domain.",
        "The present version of this PILLS system allows authors to enter information about possible side effects (If you are either pregnant or allergic to penicillin, then tell your doctor) and how to handle medical devices such as inhalers, inoculators, etc.",
        "By interacting with the feedback texts generated by the system, the author can define a procedure for performing a task, e.g. preparing an inhaler for use.",
        "A new KB leads to the creation of a procedure instance, e.g. p. The permanent part of the KB (i.e., the T-Box) specifies that procedures may be",
        "complex or atomic, and lists a number of options in both cases.",
        "In the atomic case, the options include Clean, Store, Remove, etc., and these are made visible by means of a menu from which the author can select, say, Remove.",
        "The program responds by adding a new instance, of type Remove, to the KB:",
        "(There is a procedure p whose type is Remove.')",
        "From the updated knowledge base, the generator produces a feedback text Remove this device or device-part from this device or device-part, making use of the information, in the T-Box of the system, that Remove procedures require an Actee and a Source.",
        "Such not yet defined attributes are shown through mouse-sensitive anchors.",
        "By clicking on an anchor, the author obtains a pop-up menu listing the permissible values of the attribute; by selecting one of these options, the author updates the knowledge base.",
        "Clicking on this device or device part yields a pop-up menu that lists all the types of devices and their parts that the system knows about, including a Cover (which, according to the T-Box must have a Device as Owner).",
        "By continuing to make choices at anchors, the author might, expand the knowledge base in the following sequence:",
        "• Remove a device's cover from a device or device-part • Remove a device's cover from an inhaler of a person • Remove a device's cover from your inhaler • Remove your inhaler's cover from your inhaler",
        "At this point the knowledge base is potentially complete, so a (less stilted) output text can be generated and incorporated into the leaflet, e.g.",
        "Please remove the cover of your inhaler.",
        "Longer output texts can be obtained by expanding the feedback text further.",
        "A number of properties of the PILLS system are worth stressing.",
        "First, the system supports a high-level dialogue, allowing the author to disregard low-level details, such as the exact words used in the output text.",
        "This makes it possible to interact with the system using, say, French (provided a generator for French feedback texts is available), for the production of leaflets in Japanese (provided a generator for Japanese output texts is available).",
        "The semantic model in the T-Box guarantees that many types of inconsistencies (e.g., a medicine that has to be taken both once and twice a day) are prevented.",
        "Second, a simple version of WYSIWYM has also been applied to the form of the text, allowing the author to specify it separately from its content.",
        "This is done by allowing the author to use WYSIWYM for building a second, form-related KB which describes the style and layout of the document.",
        "This KB, for example, may state that the maximum paragraph length is 10 sentences and that there are no footnotes.",
        "(A second, form-related T-Box determines what the options determining layout are.)",
        "This form-related KB constrains the texts that are generated.",
        "By interacting with feedback texts describing the forum-related KI3, the author changes the stylistic/layout properties of the document."
      ]
    },
    {
      "heading": "3 A WYSIWYM-based System for the Authoring of Multimedia Documents",
      "text": [
        "ILLUSTRATE is an extension of PILLS producing documents that contain pictures as well as words.",
        "Consider a toy example, adapted from ABPI (1997).",
        "Suppose the document says Remove the cover of your inhaler.",
        "An instruction of this kind may be illustrated by the picture below.",
        "How can a document authoring system produce a document in which appropriate pictures illustrate the text when this is desired?",
        "ILLUSTRATE does this by allowing an author to ask for pictorial illustration of the information in the document by interacting with the feedback texts.",
        "The author can indicate, for a given mouse-sensitive stretch s of the feedback text, whether sine would like to see the part of the document that corresponds to s illustrated.",
        "If so, the system searches its library to find a picture that matches the meaning of s. In Fig.2, the author has requested illustration of the in",
        "struction corresponding with the text °R.emove your inhaler's cover from your inhaler'.",
        "(The other four options are irrelevant for present purposes.)",
        "In domains where all the pictures are",
        "variations on a common theme, suitable pictures can be generated.",
        "In the case of Patient Information Leaflets, however, this was not a practical option because of the many different kinds of things depicted in the leaflets: medicine packages, body parts, medical applicances, var-ions types of actions, etc.",
        "Pictures, moreover, are heavily reused in the different leaflets written by the same company.",
        "For these reasons, ILLUSTRATE uses an alternative approach, selecting pictures from a library, each of which is annotated with a formal representation of its meaning.",
        "We will explain the workings of ILLUSTRATE by answering three questions: (1) What kinds of representations are used in the library to annotate the pictures with relevant aspects of then meaning?",
        "(2) How is the semantically annotated library of pictures created?",
        "and (3) What selection algorithm is employed to retrieve an optimally appropriate illustration for a given part of the KB from the library?",
        "We shall assume that the information whose illustration is requested corresponds with the following formula in the KB, which represents the meaning of the feedback text in Fig. 2.",
        "('There exists a 'Remove' action whose Source is an Inhaler and whose Actee is a Cover of the same inhaler.')",
        "1.",
        "What kinds of representations are used?",
        "Representations say what information each picture intends to convey.",
        "Irrelevant details should be omitted.",
        "It has been observed that photographic pictures express 'vivid information and that this information can be expressed by a conjunction of positive literals (Levesque 1986).",
        "In line with this observation, ILLUSTRATE represents the meaning of the picture in Fig. 1, f'or example, as follows:",
        "(The leaflets describe inhalers, Autolialers, and ilerohalers.)",
        "If any of the variables e, y, z has an occurrence in the meaning representation of another picture then these occurrences corefer.",
        "This allows the system to know when two pictures depict the same person, for example (Van Deemter and Power 1999).",
        "2.",
        "How is the library created?",
        "This is a question of great importance because the library contains semantic representations that are much inure detailed than those in current picture retrieval systems (e.g. Van de Waal 1995) and this could potentially make the annotation task extremely burdensome (Enser 1995).",
        "The answer to this problem may be unexpected: 1LLusTRATE uses WYSIWYNI itself to enable authors to associate a given picture with a novel representation.",
        "The class of representations that",
        "are suitable for expressing the meaning of a picture is, after all, a (`vivid') subset of the class of representations allowed by the T-Box for the text of the document, and consequently, the same WYSIWYM interface can be used to create such representations.",
        "Fig.",
        "3 contains a screen-dump of the annotation process, where the current annotation corresponds with the formula",
        "3.",
        "What is the selection algorithm?",
        "A picture can illustrate an item of information without expressing everything in it.",
        "For example, Fig. 1 does not show that the Actor is the Reader and it leaves the type of 'Haler' unspecified.",
        "(They all look alike.)",
        "So, a selection rule must allow pictures to omit information: Selection Rule: Use the logically strongest picture whose representation is logically implied by the information to he illustrated.",
        "(Van Deemter 1999) Logical strength is determined on the basis of the two semantic representations alone.",
        "Determining whether one representation logically implies the other, where one is an instance in the KB and the other a representation of a picture, is easy, given that both are conjunctions of positive literals.",
        "This brief description should suffice to highlight the following advantages of ILLUSTRATE:",
        "• One uniform interface is employed for all actions that involve the editing of semantic representations, regardless of the type of presentation involved (i.e., its media).",
        "• When used for the construction of annotations of pictures, the T-Box of the system makes sure that only those properties can enter an annotation that are relevant in connection with it.",
        "In the present domain, for example, the height of the patient is irrelevant, and consequently the T-Box does not make height an attribute of a person.",
        "• Pictures are retrieved by a reasoning process involving classical logic; since a match between a picture and a piece of the KB can never be inexact, there is no need for the retrieval process to be probabilistic, as",
        "has to be done when the system has less control over the form of annotations (Van Rijsbergen 1985, Van Deciliter 1999).",
        "Specific aspects of ILLUSTRATE have been described elsewhere, but the assumptions behind the system as a whole have not been stated before.",
        "(For the representation scheme and the selection scheme see Van Deemter 1999; for the treatment of sequences of pictures see Van Deciliter and Power 1999.)",
        "We have so far simplified by assuming there to be only one author.",
        "In fact, however, an intelligent authoring system is most useful when there are several authors (each of which can be allowed to work in a different language).",
        "More specifically, it is plausible that the person authoring the annotations in the library is not the same as the person(s) who author(s) the document itself."
      ]
    },
    {
      "heading": "4 Future Work Towards the Ideal",
      "text": [
        "The PILLS system (section 2) makes a first stab at fulfilling text-related requirements 1 and 2 mentioned in section 1.",
        "The ILLUSTRATE demonstrator goes beyond this, fulfilling important aspects of requirements 3 and 4 as well.",
        "Yet, there is a considerable gap between the implemented system and the ideal one of section 1.",
        "Possible improvements do not only concern the coverage of the system, butt matters of system architecture as well.",
        "Three different sets of improvements may be discerned.",
        "Firstly, there is requirement 5 of section 1, which requires easy postediting.",
        "It is easy to allow authors to make low-level corrections in the document after the interaction with WYSIWYM, but unless the system 'understands' the meaning of the editing actions, postediting destroys the connection between the edited document and the content of the various knowledge bases.",
        "Consequently, post-editing is not a practical possibility yet, given the state of the art in text and picture understanding.",
        "Other improvements would be less problematic.",
        "On the one hand, there are issues that have been tackled by other research groups and whose solutions we intend to carry over to a wysiwYm-based setting.",
        "nese concern the generation of graphics from underlying representations (Wahlster et al.",
        "1993) and the problem of optimizing the layout of text picture documents (e.g. Graph et al.",
        "1996), for instance.",
        "Three remaining improvements, on the other hand, are matters ler future research:",
        "• Media allocation.",
        "ILLUSTRATE embodies one way in which media may be allocated.",
        "Other mechanisms could give the system more autonomy.",
        "For example, the system may use rules (e.g. Roth and Hefley 1.993) to decide autonomously what information is in need of illustration.",
        "Similarly, authors may be enabled to point at thumbnail pictures, whereupon the system tries to find a suitable place in the document to include thmn, based on the representation of their meaning and making use of the Selection Rule of section 3.",
        "By thus allowing the author and the system to cooperate on media allocation, this difficult task will be made more tractable (see the recent discussions in ETAI 1997-8).",
        "• Other media.",
        "Little in ILLUSTRATE lunges",
        "on the fact that the objects in the library are pictures.",
        "The same system, for example, can be used for annotating sound or canned text (for example, a complex la of law code, which needs to be rendered literally).",
        "Of great practical interest, finally, is the possibility of including documents authored previously (and possibly by a (hifferent author), leading to iterative applications of WYSIWYM.",
        "• Interaction betiMell media.",
        "Ideally, the words in a text should be affected by the inclusion of a picture: First, and most obviously, texts may be enlarged by references to pictures (e.g., references like 'See Fig. 3' may he added, cf. Paraboni and Van Deciliter 1.999).",
        "Secondly, texts may be reduced because information expressed in the picture can be shortened (or left out altogether).",
        "One type of situation where this happens is exemplified by the text 'Bpmove the capsule from the foil as shown in the picture' (m3PI 1997), accompanied by a picture showing how thus may be done.",
        "Other types of situation include the case where quantitative information is expressed through a vague textual description (`a blob of cream.",
        "', 'a fingertip of ointment') that is made inore precise by means of a picture showing the required amount.",
        "It should be noted that each of these extensions depends crucially on ILLUSTRATE's ability to manipulate the semantic representations associated with multimedia objects, where one and the same representation language is used for the different media: a nmltimedia `interlingua' (e.g. Barker-Plummer and Greeves 1995).",
        "In the case of an author selecting a picture using thumbnails, for example, the semantic representation enables the author to (a) find a suitable location for the picture and (b) adapt the text by omitting from it information that is now expressed by the picture.",
        "A final extension of the ideas outlined in this paper would involve completing the symmetry between feedback and output: all present WYSIWYM systems use purely textual feedback.",
        "In principle, however, feedback can be as multimodal as the target document.",
        "We are currently exploring the possibility of allowing an author to express some of her choices by clicking on a mouse-sensitive part of a picture; the system could generate an updated feedback text (possibly along with an updated picture)",
        "as a result.",
        "In some technologically complex domains, for example, where a brief description of an object may be difficult to obtain, this might lead to a further improvement of the WYSIWYM technique."
      ]
    }
  ]
}
