{
  "info": {
    "authors": [
      "Amit Bagga",
      "Tomek Strzalkowski",
      "G. Bowden Wise"
    ],
    "book": "Applied Natural Language Processing Conference and Meeting of the North American Association for Computational Linguistics",
    "id": "acl-A00-1005",
    "title": "PartsID: A Dialogue-Based System for Identifying Parts for Medical Systems",
    "url": "https://aclweb.org/anthology/A00-1005",
    "year": 2000
  },
  "references": [
    "acl-J86-3001",
    "acl-J99-3003",
    "acl-P96-1009"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes a system that provides customer service by allowing users to retrieve identification numbers of parts for medical systems using spoken natural language dialogue.",
        "The paper also presents an evaluation of the system which shows that the system successfully retrieves the identification numbers of approximately 80% of the parts."
      ]
    },
    {
      "heading": "Introduction",
      "text": [
        "Currently people deal with customer service centers either over the phone or on the world wide web on a regular basis.",
        "These service centers support a wide variety of tasks including checking the balance of a bank or a credit card account, transferring money from one account to another, buying airline tickets, and filing one's income tax returns.",
        "Most of these customer service centers use interactive voice response (IVR) systems on the front-end for determining the user's need by providing a list of options that the user can choose from, and then routing the call appropriately.",
        "The IVRs also gather essential information like the user's bank account number, social security number, etc.",
        "For back-end support, the customer service centers use either specialized computer systems (example: a system that retrieves the account balance from a database), or, as in most cases, human operators.",
        "However, the IVR systems are unwieldy to use.",
        "Often a user's needs are not covered by the options provided by the system forcing the user to hit 0 to transfer to a human operator.",
        "In addition, frequent users often memorize the sequence of options that will get them the desired information.",
        "Therefore, any change in the options greatly inconveniences these users.",
        "Moreover, there are users that always hit 0 to speak to a live operator because they prefer to deal with a human instead of a machine.",
        "Finally, as customer service providers continue to rapidly add functionality to their IVR systems, the size and complexity of these systems continues to grow proportionally.",
        "In some popular systems like the IVR system that provides customer service for the Internal Revenue Service (IRS), the user is initially bombarded with 10 different options with each option leading to sub-menus offering a further 3 5 options, and so on.",
        "The total number of nodes in the tree corresponding to the IRS' IVR system is quite large (approximately 100) making it extremely complex to use.",
        "Some customer service providers have started to take advantage of the recent advances in speech recognition technology.",
        "Therefore, some of the IVR systems now allow users to say the option number (1, 2, 3, ..., etc.)",
        "instead of pressing the corresponding button.",
        "In addition, some providers have taken this a step further by allowing users to say a keyword or a phrase from a list of keywords and/or phrases.",
        "For example, AT&T, the long distance company, provides their users the following options: \"Please say information for information on placing a call, credit for requesting credit, or operator to speak to an operator.\" However, given the improved speech recognition technology, and the research done in natural language dialogue over the last decade, there exists tremendous potential in enhancing",
        "these customer service centers by allowing users to conduct a more natural human-like dialogue with an automated system to provide a customer-friendly system.",
        "In this paper we describe a system that uses natural language dialogue to provide customer service for a medical domain.",
        "The system allows field engineers to call and obtain identification numbers of parts for medical systems using natural language dialogue.",
        "We first describe some work done previously in using natural language dialogue for customer service applications.",
        "Next, we present the architecture of our system along with a description of each of the key components.",
        "Finally, we conclude by providing results from an evaluation of the system."
      ]
    },
    {
      "heading": "1. Previous Work",
      "text": [
        "As mentioned earlier, some customer service centers now allow users to say either the option number or a keyword from a list of options/descriptions.",
        "However, the only known work which automates part of a customer service center using natural language dialogue is the one by Chu-Carroll and Carpenter (1999).",
        "The system described here is used as the front-end of a bank's customer service center.",
        "It routes calls by extracting key phrases from a user utterance and then by statistically comparing these phrases to phrases extracted from utterances in a training corpus consisting of prerecorded calls where the routing was done by a human.",
        "The call is routed to the destination of the utterance from the training corpus that is most \"similar\" to the current utterance.",
        "On occasion, the system will interact with the user to clarify the user's request by asking a question.",
        "For example, if the user wishes to reach the loan department, the system will ask if the loan is for an automobile, or a home.",
        "Other related work is (Georgila et al., 1998).",
        "While we are aware of the work being done by speech recognition companies like Nuance (www.nuance.com) and Speechworks (www.speechworks.com) in the area of providing more natural language dialogue-based customer service, we are not aware of any conference or journal publications from them.",
        "Some magazine articles which mention their work are (Rosen 1999 ; Rossheim 1999 ; Greenemeier 1999 ; Meisel 1999).",
        "In addition, when we tried out a demo of Nuance's systems, we found that their systems had a very IVRish feel to them.",
        "For example, if one wanted to transfer $50 from one account to another, the system would first ask the account that the money was coming from, then the account that the money was going to, and finally, the amount to be transferred.",
        "Therefore, a user could not say \"I want to transfer $50 from my savings account to my checking account\" and have the system conduct that transaction.",
        "In addition to the works mentioned above, there have been several classic projects in the area of natural language dialogue like TRAINS/TRIPS project at Rochester (Allen et al., 1989, 1995, 1996), Duke's Circuit-FixitShoppe and Pascal Tutoring System (Biermann et al., 1997; 1995), etc.",
        "While the Circuit-FixitShoppe system helps users fix a circuit through a dialogue with the system, the TRIPS and the TRAINS projects allow users to plan their itineraries through dialogue.",
        "Duke's Pascal tutoring system helps students in an introductory programming class debug their programs by allowing them to analyze their syntax errors, get additional information on the error, and learn the correct syntax.",
        "Although these systems have been quite successful, they use detailed models of the domain and therefore cannot be used for diverse applications such as the ones required for customer service centers.",
        "Other related work on dialogue include (Carberry, 1990; Grosz and Sidner, 1986; Reichman, 1981)."
      ]
    },
    {
      "heading": "2. PartslD: A System for Identification of Parts for Medical Systems",
      "text": [
        "Initially, we were approached by the medical systems business of our company for help in reducing the number of calls handled by human operators at their call center.",
        "An analysis of the types of customer service provided by their call center showed that a large volume of calls handled by their operators were placed by field engineers requesting identification numbers of parts for various medical systems.",
        "The ID numbers were most often used for ordering the corresponding parts using an automated IVR system.",
        "Therefore, the system we have built",
        "helps automate some percentage of these calls by allowing the engineer to describe a part using natural language.",
        "The rest of this section describes our system in detail."
      ]
    },
    {
      "heading": "2.1 Data",
      "text": [
        "The database we used for our system was the same as the one used by the operators at the call center.",
        "This database consists of the most common parts and was built by the operators themselves.",
        "However, the data contained in the database is not clean and there are several types of errors including mis-spellings, use of nonstandard abbreviations, use of several different abbreviations for the same word, etc.",
        "The database consists of approximately 7000 different parts.",
        "For each part, the database contains its identification number, a description, and the product (machine type) that it is used in.",
        "The descriptions consist of approximately 60,000 unique words of which approximately 3,000 are words which either are non-standard abbreviations or are unique to the medical domain (example: collimator).",
        "Due to the large size of the database, we did not attempt to clean the data.",
        "However, we did build several data structures based on the database which were used by the system.",
        "The primary data structures built were two inverted hash tables corresponding to the product, and the part description fields in the database.",
        "The inverted hash tables were built as follows:",
        "1) Each product and part description field was split into words.",
        "2) Stop-words (words containing no information like: a, the, an, etc.)",
        "were filtered.",
        "3) Each remaining word was inserted as the index of the appropriate hash table with the identification number of the part being the value corresponding to the index.",
        "Therefore, for each non-stop-word word used in describing a part, the hash table contains a list of all the parts whose descriptions contained that word.",
        "Similarly, the products hash table contains a list of all parts corresponding to each product word."
      ]
    },
    {
      "heading": "2.2 System Architecture",
      "text": [
        "The architecture of the system is shown in Figure 1.",
        "The system was designed in a manner such that it could be easily ported from one application to another with minimal effort other than providing the domain-specific knowledge regarding the new application.",
        "Therefore, we decided to abstract away the domain-specific information into self-contained modules while keeping the other modules completely independent.",
        "The domain-specific modules are shown in the dark shaded boxes in Figure 1.",
        "The remainder of this section discusses each of the modules shown in the system architecture.",
        "Since customer service centers are meant to be used by a variety of users, we needed a user-independent speech recognition system.",
        "In",
        "and Hauspie's RealSpeak text-to-speech system.",
        "Although the system currently cannot use both modes of communication simultaneously, we plan to incorporate this feature sometime in the future.",
        "As with any dialogue system, it is extremely important for the system to be robust.",
        "Our system has the following two features which make it extremely robust: 1) The user can, at any given moment, say operator to transfer to an operator, quit/stop to exit, and back/restart to start afresh.",
        "2) When expecting a response from the user, if the system does not receive an expected input, it repeats the question at most twice before transferring control to an operator."
      ]
    },
    {
      "heading": "3. Sample Dialogues",
      "text": [
        "This section gives examples of two sample dialogues that occur during the testing of the system.",
        "The system's response is indicated by \"S>\", the user's response by \"U>\", and the recognition of the user's response by \"V>\"."
      ]
    },
    {
      "heading": "4. Evaluation and Results",
      "text": [
        "The goal of our evaluation was to ensure that the system helped a user successfully identify parts irrespective of the performance of the speech recognition engine for the user.",
        "In other words, we wanted to see if the system was robust enough to conduct transactions with a diverse mix of users.",
        "We tested the system with 4 different users two of whom had foreign accents.",
        "For each user, we randomly selected 20 parts from the database.",
        "The results are summarized in Table 1.",
        "These results show that the system was quite successful in handling requests from users with a variety of accents achieving varying recognition rates.",
        "Out of the 80 parts tested, only twice did the user feel that he/she had to transfer to an operator.",
        "The system successfully retrieved the identification numbers of 79% of the parts while transferring 19% of the cases to a human operator because of extremely bad"
      ]
    },
    {
      "heading": "Conclusions",
      "text": [
        "In this paper we have described a robust system that provides customer service for a medical parts application.",
        "The preliminary results are extremely encouraging with the system being able to successfully process approximately 80% of the requests from users with diverse accents."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We wish to thank the GE Medical Systems team of Todd Reinke, Jim Tierney, and Lisa Naughton for providing support and funding for this project.",
        "In addition, we also wish to thank Dong Hsu of Lernout and Hauspie for his help on the ASR and the text-to-speech systems.",
        "Finally, we wish to thank the Information Technology Laboratory of GE CRD for providing additional funding for this project."
      ]
    }
  ]
}
