{
  "info": {
    "authors": [
      "Sylvain Pogodalla"
    ],
    "book": "Applied Natural Language Processing Conference and Meeting of the North American Association for Computational Linguistics",
    "id": "acl-A00-2010",
    "title": "Generation in the Lambek Calculus Framework: An Approach With Semantic Proof Nets",
    "url": "https://aclweb.org/anthology/A00-2010",
    "year": 2000
  },
  "references": [],
  "sections": [
    {
      "heading": "1 Introduction",
      "text": [
        "The linear logic (Girard, 1987) provides a powerful framcwork to cxprcss categorial grammars (Ajdukicwicx, 1935) and Lambek calculus (Lambek, 1958), and a lot of work has presented proof nets uses for linguistic purposcs, with a special look at proof nets for Lambek calculus (Roorda, 1991; Lamarche and Retor6, 1996).",
        "But they have mainly explored the syntactic capabilities of proof nets, describing parsing processes.",
        "This paper wants to focus on the generation capabilities of proof nets thanks to their semantic readings as expressed in (de Groote and Retor6, 1996).",
        "The main features of our proposal consist in the use of proof nets lot Lambek calculus, of the Curry-Howard isomorplaisna (Howard, 1980; Girard et al., 1988), of semantic proof nets with semantic expressions a la Montague (Montague, 1974; Dowry et al., 1981), and in an algorithm for proof search with a target proof net.",
        "Unlike a previous proposal for generation in the Lambek calculus framework (Merenciano and Mort'ill, 1997), this point of view avoids the use of the A-term unification to lead the generation process.",
        "And the algorithmic undecidability of this latter mechanism (from second order unification) does not occur any more.",
        "In this work, we do not consider the choice of lexical items from a given semantic expression the syntactic rcalization of which we want to generate, but rather tile way we can associate given lexical entries to fit the given semantic expression and generate a syntactically correct cxpression.",
        "For this purpose, we express our problem as a proof search one in (multiplicative) linear logic which is decidable.",
        "Moreover, we characterize the semantic recipes of lexical items that provide a polynomial solution for the generation process.",
        "From a one-sided sequent and a sequential proof of it, we obtain a proof net by unfolding every formula as a tree (whose nodes are the binary connectives and the leaves are formulas, e.g. atomic ones) and linking together the formulas occurring in the same axiom rule of tile sequent calculus.",
        "But proof nets have a more intrinsic definition that prevents us to come back every time to sequential proofs.",
        "They can be defined as graphs with a certain property (i.e. verifying a correctness criterion) such that every proof net with this property corresponds to a sequential proof and such that every proof net built from a sequential proof has this property.",
        "So that we do not present the sequent calculus but only the proof net calculus.",
        "In this paper, we do not consider all the proof nets, but a part of the multiplicative ones: those of the intuitionistic implicative linear logic.",
        "In this case, sequents are made of several antecedent [brmulas, but only one succedent formula.",
        "To deal with tile intuitionistic notion with proof nets (since we consider one-sided sequents), we use the notion of polarities with the input (,: negative) and the output (o: positive) (Danos, 1990; Lamarche, 1995) to decorate formulas.",
        "Positive ones correspond to succedent formulas and negative ones to antecedent formulas.",
        "Given the links of table 1, we define proof structures as graphs made of these links such that: 1. any premise of any link is connected to exactly one conclusion of some other link; 2. any conclusion of any link is connected to at most one premise of some other link; 3. input (resp. output) premises are connected to input (resp. output) conclusions of the same type.",
        "Note that the two links for tile negative and positive implications correspond to the two connectives of the linear logic: Tensor and Par, so that we name these links after these latter connectives.",
        "But in the following, only the graphical forms of the links play a role.",
        "Proof nets are proof structures that respect the correctness criterion.",
        "We mentioned the intrinsic definition of proof nets that enables the complete representation of sequential proofs.",
        "Tile cut elimination property of sequent calculus also appears intrinsically in the proof net formalism with a simple rewriting process described in table 2 (in case of complex formulas as in the third rewriting rule, those rules can apply again on the result and propagate until reaching atoms)."
      ]
    },
    {
      "heading": "2.2 Syntactic Proof Nets",
      "text": [
        "Definitions of proof nets for Lambek calculus first appeared in (Roorda, 1991).",
        "They naturally raised as Lambek calculus is an intuitionistic fragment of non commutative linar logic (with two linear implications: \"\\\" on the left and \"/\" on the right), and the consequences on the proof net calculus we presented in section 2.1 are:",
        "• we get two tensor links: one for the formulas ( (the one in table 1) and one for the formula (B \\ A ) – (just inverse the polarities of the premises).",
        "And two par links : one for the formula ( A \\B)+ and one for (Al B)+ (idem); • formulas in Lambek's sequents are ordered, so that conclusions of the proof nets are cyclically ordered and axiom links may not cross.",
        "If Tp is the set of basic types (e.g. 5, NP .",
        ".",
        "), the set T of syntactic types follows T ::= TpIT\\TITIT.",
        "Note that from a syntactic category, we can unfold the formula to obtain a graph which only lacks axiom links to become a proof structure.",
        "So that the parsing process in this framework is, given the syntactic categories of the items and their order, to put non crossing axiom links such that the proof structure is a proof net.",
        "It means there is a proof of given types in a certain order.",
        "For technical reasons, the order of the conclusions (i.e. the types used) in the proof net to prove S is the reverse order of the words associated to these types.",
        "As an example, with the lexicon of table 3, proving that John lives in Paris is a correct sentence leads to find axiom links between the atoms in the figure 1(a).",
        "Figure 1(b) shows it actually happens and proves the syntactic correctness of the sentence."
      ]
    },
    {
      "heading": "2.3 Semantic Proof Nets",
      "text": [
        "In this section, we present how (de Groote and Retor6, 1996) propose to use proof nets as semantic recipes.",
        "As a slight difference with this work, we only deal in this paper with semantic recipes that correspond to linear A-terms in the Montague's semantics framework.",
        "The idea of expressing the semantics with proof nets refers to the fact that both the ►-terms (with the Curry-Howard isomorphism) and the proof nets represent proofs of intuitionistic implicative linear logic.",
        "And indeed, the linear A-terms may be encoded as proof nets.",
        "On the other hand, given an intuitionistic implicative proof net, a simple algorithm (given in (de Groote and Retore, 1996), based on (Lamarche, 1995)'s dependency paths).",
        "we can obtain a A-term.",
        "Then, instead of associating a A-term to a lexical entry, we can associate a proof net.",
        "For instance, on the semantic side, we can use the Montagovian types e and t and typed constants.",
        "01 course, we want to keep the compo-sitionality principle of Montague's semantics that maps any syntactic association rule with a semantic association rule.",
        "We express it in a straightforward way with the following homomorphism (for as many basic categories as required):",
        "And for a lexical item, given its syntactic type, we assume its semantic proof net to verify:",
        "• the type of its unique output conclusion is the homomorphic image of the syntactic type: • its input conclusions (if any) are decorated with typed constants.",
        "An example of such a lexicon is given in table 4.",
        "Let us illustrate the process on a short example.",
        "We use the lexicon of table 4 to parse the sentence John lives in Paris.",
        "The first thing is to define with the syntactic categories of the different lexical items the syntactic proof net of figure 2.",
        "It provides the way we should compose the semantic recipes of each lexical item: we take its homomorphic image as in figure 4(a), and we substitute to every input its semantic definition with cut-links.",
        "Then the cut-elimination on the resulting proof net gives a new proof net (on figure 4(b)) we can use as the semantic analysis of John lives in Paris.",
        "If necessary, we can come back to the A-term expression:(in p)(Iive j)."
      ]
    },
    {
      "heading": "3 Generation: Stating the Problem",
      "text": [
        "Let us now consider the problem of generation.",
        "We have a given semantic proof net (like the one in figure 4(b)) and we want to gather syntactic entries with axiom links such that: I. this yields a correct (syntactic) proof net; 2. the meaning of the resulting proof net matches the given semantic expression.",
        "As we already said it, we assume that we have some lexical entries, and we try to make the generation with these entries, each one used once and only once.",
        "Thus, if we define:",
        "• 110 the semantic proof net of the expression we want to generate; • H the semantic proof nets associated to the given lexical entries i we use; • Ti the unfolding in proof structure of the syntactic formula of the lexical item i; • F the forest made of the syntactic trees of all the considered lexical entries plus the output (the type we want to derive).",
        "The generation problem (see figure 5) is to find a matching Al of atomic formulas of F such that:",
        "1.",
        "F endowed with Al (let us call this proof structure F') is a correct proof net; 2. when cut-linking H(F') with the and eliminating these cuts, we obtain 110.",
        "This problem is not an original one: making proof search with proof nets always leads to look for matching between atomic formulas of opposite polarities.",
        "So that an answer to this problem would consist in taking F and try every possible matching.",
        "This brute-force technique would of course appear essentially inefficient, and our purpose is to use everything we know to prune the search domain.",
        "Nevertheless, note that even with such an algorithm, we already reach the decidability (because the finitness of the number of the matchings) without making any assumption on the form of the semantic entries (neither on the order of the associated A-terms, nor the presence of a free variable).",
        "And we want to keep these good properties in our algorithm."
      ]
    },
    {
      "heading": "4 Cut-elimination as Matrix Computation",
      "text": [
        "This section first establishes some equivalent relations between cut-elimination on proof nets and matrix equations.",
        "We then show how to use these equations in the generation process and how we can solve them.",
        "It enables us to characterize the properties required by the semantic proof nets to have a polynomial resolution of the generation process."
      ]
    },
    {
      "heading": "4.1 Principles",
      "text": [
        "First, as expressed in (Girard, 1989) and reformulated in (Retore 1990; Girard, 1993; Girard, 1995), we state the algebraic representation of cut-elimination on proof nets.",
        "Due to lack of space, we can not develop it, but the principle is to express cut-elimination between axioms with incidence matrices and paths in graphs.",
        "Let us consider a proof net U.",
        "We denote by )1<i‹, all the vertices taking place for atoms in U.",
        "We can define U the incidence matrix of axiom links, a the incidence matrix of cut links (we assume without loss of generality that they happen only between axiom links), and H the incidence matrix of axiom links of fl where II is the proof net resulting from all the cut eliminations on r",
        "Then we have (Girard, 1989): Then in this base, we express the matrices (every ax-ti iom link of U has at least one of its conclusion involved B=..(1_(72)IT(1 E(o-u)k)(1 – (72) (1) in a cut link): Moreover, since (a-U ) is nilpotent, (1 + (a- )k ) is inversible.",
        "and its inverse is (1 – IL').",
        "The next section make explicit the relation (I) with a special choice of the base (F i )."
      ]
    },
    {
      "heading": "4.2 Matrix Relation for Cut Elimination",
      "text": [
        "In the problem we are dealing with, we know II and some of the axiom links in U.",
        "Let us assume that Vi E [1, , both ( and B( e;) I are not cut-linked in U (this assumption entails no loss of generality)."
      ]
    },
    {
      "heading": "4.3 Expressing the Reduction of U into H",
      "text": [
        "In this section, we want to give a relation equivalent to (1) which focuses on some axiom links we are interested in.",
        "As mentioned in section 4.2, we can consider the (ei) such that in U :",
        "• Vi E [1. ei is not cut-linked (then, because of the hypothesis made in section 4.2, B(ei) is cut-linked): • Vi E [p+ I, p+ m], ei is cut-linked but B(ei) is not cut-linked: • Vi E[p+m+1,p+m+.n], both ei and B(ei) are cut-linked.",
        "Note: Remember we assume that there is no axiom link such that both its conclusions are not cut-linked.",
        "So p =",
        "If we define A = (Willi – a1 f(71 )U1 and X = U3( 1 – o-4 L13)-1, we can state the theorem:",
        "• Res(a,U ) = (1 – a2)Uo - (u)'l( 1 - • (tuilli - = (79(3(1 – cr4r3) – to • A = ta2Xcr2 and U3 = X-1 + a-4.",
        "Of course, all the terms are defined.",
        "We base the proof search algorithm corresponding to the generation process we are dealing with on this third relation, as explained in the next sections."
      ]
    },
    {
      "heading": "4.4 Solving the Equations",
      "text": [
        "In this section (proof search oriented), we consider that the axiom links we are looking for are those whose two conclusions are involved in cut links.",
        "That is we want to complete ITE.",
        "As in the previous section we proceeded",
        "by equivalence, solving the equation (1) correponds to solving the equation",
        "In other words, • = 1 <=> 3/1 E [1,1] A i = iiiA j ji,.",
        "Then make such a statement.",
        "In other cases, the complexity would increase polynomially.",
        "Then, the given matrices are:",
        "A consequence of this result is that if o-4 = 0, then / it and we determine X completely with relation (3), and then the same for U3.",
        "This configuration correspond to the fact that in the (given) semantic proof nets, no output contains the two conclusions of a same axiom link.",
        "In this latter case, the computation is not so simple and should he mixed with word order constraints."
      ]
    },
    {
      "heading": "5 Example",
      "text": [
        "Let us process on an example the previous results.",
        "We still use the lexicon of table 4, and we want to generate (if possible) a sentence whose meaning is given by the proof net of figure 7: (try(find j))m. We first need to associate every atom with an index (in the figures, we only indicate a number i beside the atom to express it is e1).",
        "Of course, we have to know how to recognize the ei that are the same in U (figure 6) and in Ii (figure 7).",
        "This can he done by looking at the typed constants decorating the input conclusions (for the moment, we don't have a general procedure in the complex cases).",
        "We also assume in this numbering that we know which of the atoms in H(F) are linked to t+ (the unique output).",
        "In our case where o-4 = 0, it is not a problem to",
        "0001000000- 0000100000 0000000010 1000000000 0100000000 0000000000 0000000001 0000000000 0010000000 0000001000- According to the definition of the (Ii) and the (it) families such that (79 = Ei Ei,j,, we have: ii 3 4 5 2 1 7 9 10 1 2 3 4 5 6 7 Then = 1 = 01.4 X2,5 = 04,1 X4,3 = 1 = X3,4 = 1 = a5,2 X17 = 1 = a3,9 X7,1 = 1 = a93 x6,8 = 07,10 x8,6= 1= a10,7 and in this case o-4 = 0, so according to the preceeding notes X is completely determined and -0000001000001000 00010000 00100000 01000000 00000001 10000000 -00000100-We can add this matching to the syntactic forest of figure 8(a) (do not forget that U3 represents the edges between Ci with i E [17, 221) and obtain on F the matching of figure 8(h).",
        "= 173 =",
        "We still have to ensure the correctness of this proof net (because we add all the tensor and par links), but it has a quadratic complexity (less than the matrix computation).",
        "In this case, it is correct.",
        "the John item on the left would achieve the result of Mary seeks John.",
        "• The choice of seeks and its high order type (for in-tensionnal ity) shows there is no limitation on the order of the A-term."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "We took advantage of proof nets on the semantic point of view and we expressed the generation process as a guided proof search.",
        "On top of keeping the decidability property of this framework, we characterized the semantic proof nets that enable a polynomial time process.",
        "Such properties are crucial because it is the central part of the generation process (considering Lambek calculus).",
        "But there are other things left to look at.",
        "As the very next steps, we should work on the atoms numbering and the choice of the lexical items.",
        "Appropriate interactions between word order contraints and matrix resolution in the hard case should also be considered.",
        "Moreover, another point is to benefit from the power of linear logic and deal with non linear A-terms.",
        "Finally, since different extensions of Lambek calculus based on proof nets (Moortgat, 1996; Lecomte and Retore, 1995) have been considered, we hope our proposal and its good properties to apply to other linguistic approaches."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "I would like to thank Christian Retore who pointed out to me Girard's algebraic interpretation of the cut elimination."
      ]
    }
  ]
}
