{
  "info": {
    "authors": [
      "Kok Wee Gan",
      "Percy Ping-Wai Wong"
    ],
    "book": "Chinese Language Processing Workshop",
    "id": "acl-W00-1213",
    "title": "Annotating Information Structures in Chinese Texts Using HowNet",
    "url": "https://aclweb.org/anthology/W00-1213",
    "year": 2000
  },
  "references": [
    "acl-W97-0101"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper reported our work on annotating Chinese texts with information structures derived from HowNet.",
        "An information structure consists of two components: HowNet definitions and dependency relations.",
        "It is the unit of representation of the meaning of texts.",
        "This work is part of a multi-sentential approach to Chinese text understanding.",
        "An overview of HowNet and information structure are described in this paper."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Corpora are essential resources to any research in language engineering.",
        "For Chinese, efforts in building large corpora started in the 90s.",
        "For instance, the PH corpus of 4 million Chinese characters with word boundary information was released in 1993 (Guo, 1993).",
        "The first version of the Sinica corpus of two millions words marked with word boundaries and parts-of-speech was released in 1995 (CKIP, 1995).",
        "In 1996, a small corpus of 5266 distinct words (inclusive of punctuation marks) with a total occurrence frequency of 51870 was released (Yu et al., 1996).",
        "This corpus was derived from the Singapore Primary School Chinese Language Textbooks.",
        "It contained information on word boundaries, parts-of-speech and also syntactic structures.",
        "In 2000, two additional bracketed corpora have just been announced.",
        "The first one, the Chinese Penn Treebank, includes 100- thousand words (Xia et al., 2000).",
        "The second one, the Sinica Treebank, which is derived from the Sinica corpus, contains 38,725 sentences with 1000 of them released to the publicl (CKIP, 2000).",
        "The historical development of Chinese corpus construction has shown a consensus in incorporating more powerful linguistic structures into corpora.",
        "As noted by Marcus (1997), the more powerful linguistic structures will help in improving the accuracy of parsing.",
        "This is especially true to isolating language such as Chinese.",
        "However, there is very little work on annotating corpora with semantic information.",
        "To the best of our knowledge, there is only one report of this kind.",
        "The work by Lua2 annotated 340,000 words with semantic class information as defined in a thesaurus of synonyms (Mei, 1983).",
        "With the release of HowNet3, a bilingual general knowledge base, Gan and Tham (1999) reported the first corpus of 30,000 words that was annotated with the general knowledge structure defined in HowNet.",
        "This paper reported an extension of the work in Gan and Tham (1999) on the annotation of information structures in Chinese texts.",
        "In Section 2, an overview of HowNet is provided.",
        "Information structure and an illustration will be given in Section 3."
      ]
    },
    {
      "heading": "2 An Overview of HowNet",
      "text": [
        "HowNet is a bilingual general knowledge-base describing relations between concepts and relations between the attributes of concepts.",
        "The latest version covers over 65,000 concepts in",
        "Chinese and close to 75,000 English equivalents.",
        "The relations include hyponymy, synonymy, antonymy, meronymy, attribute-host, material-product, converse, dynamic role and concept cooccurrence.",
        "The philosophy behind the design of HowNet is its ontological view that all physical and non-physical matters undergo a continual process of motion and change in a specific space and time.",
        "The motion and change are usually reflected by a change in state that in turn, is manifested by a change in value of some attributes.",
        "The topmost level of classification in HowNet thus includes: entity, event, attribute and attribute value.",
        "It is important to point out that the classification is derived in a bottom-up manner.",
        "First, a set of sememes, the most basic set of semantic units that are non-decomposable, is extracted from about 6,000 Chinese characters.",
        "This is feasible because each Chinese character is monosyllabic and they are meaning-bearing.",
        "Similar sememes are grouped.",
        "The coverage of the set of sememes is tested against polysyllabic concepts to identify additional sememes.",
        "Eventually, a total of over 1,400 sememes are found and they are organized hierarchically.",
        "This is a closed set from which all concepts are defined.",
        "The bottom-up approach takes advantage of the fact that all concepts, either current or new, can be expressed using a combination of one or more existing Chinese characters.",
        "It is yet to find a new concept that has to resort to the creation of a new Chinese character.",
        "Therefore, by deriving the set of sememes in a bottom-up fashion, it is believed that the set of sememes is stable and robust enough to describe all kinds of concepts, whether current or new.",
        "The fact that HowNet has verified this thesis over 65,000 concepts is a good proof of its robustness."
      ]
    },
    {
      "heading": "2.1 Types of Relation",
      "text": [
        "The definition of a concept in HowNet expresses one or more of the following relations.",
        "There are a total of 71 dynamic roles defined in HowNet.",
        "Dynamic role resembles case role in case grammar (Fillmore, 1968).",
        "However, it differs from case role in that it is concerned with all probable actants of an event and the roles they play in the event.",
        "The issue of whether these actants can be realized grammatically is not its concern.",
        "For example, Concept(1): OM (be a vegetarian for religious reasons) DEFatIRL, patient=vegetableIM, religionITr At the syntactic level, \"OM\" is an intransitive verb.",
        "According to case grammar, it has only one case role: agent.",
        "However, for this word, the patient is self-contained in its constituent (i.e. \"\" ).",
        "HowNet specifies this explicitly and indicates the category ('vegetable'4) of prototypical concepts which fills up this role.",
        "Another distinguishing feature of dynamic role is its use in defining concepts of 'entity' class.",
        "Concept(2): (writing brush) DEF=PenInklM, *writeln Through the use of the \"*\" pointer, the above definition states that the concept being defined () is the instrument of the event type a `write'.",
        "HowNet also uses dynamic role to specify the attributes that a concept contains.",
        "For example, Concept(3): 50-JA3K (arise suddenly) DEF=happen141., manner=suddenln The definition of concept (3) specifies that the manner of the event is 'sudden'.",
        "The 'event' and 'entity' classes in HowNet are organized in a hierarchical manner.",
        "The parent class is a hypemym of its children classes.",
        "Details of the organization are available from the HowNet site and are therefore omitted here.",
        "Meronymy relation is expressed through the We use single-quote and italic to mark sememes in HowNet.",
        "pointer \"%\" .",
        "For example, Concept (4): 112151aiNgg (CPU) DEF=partaf, %computerrargi, heartbb The class of the-concept \"11=1311W\" is `part'.",
        "It is a part of the class 'computer'.",
        "The function of the part \"14:t9UVIgg\" is the `heart' of the whole 'computer'.",
        "Material-product relation is expressed through the pointer \"?\" .",
        "For example, Concept (5): i c (knitting wool) DEF=materialltiM, ?clothing1Mt \"\" belongs to the class 'material'.",
        "It is a material for the product 'clothing'."
      ]
    },
    {
      "heading": "3 Information Structures",
      "text": [
        "Dong (2000) uses the example \"ap,Afj,‘ \" (Narcotic drugs smuggling group) to illustrate what information structure is.",
        "Describing the structure of this phrase at the syntactic level, such as the analysis of Penn Treebank (Xue, 1999: 72-77), only reveals that it is a noun phrase with the head of \"XlE\" modified by a relative clause \"agif./.,\" which involves operator movement.",
        "At the semantic level of description, we would indicate that \"Xffi\" (group) is the agent of the event \"f./.,\" (smuggle) and “eg,\" (Narcotic drugs) is the patient of \"tb\" (smuggle).",
        "The informaton structure of this example consists of two parts, the dependency relations and the HowNet definitions.",
        "The descriptions are as follows:",
        "\"ffi-7-\" is an attribute; in particular, it is about the attribute 'reputation'.",
        "The hosts could be `human' as well as `organization' .",
        "Some concept typically co-occurs with certain concept.",
        "For example, Concept (7): TaZ.fit (lawless person) DEF=humanlA, fierce*, crime*, #policee, undesiredIN The typical context where the concept \"NA Z-It\" is used involves the concept 'police'.",
        "This type of relation is expressed by the pointer In this example, the descriptions specify that a `community' is an agent involved in a `transport' event transporting the patient `medicine'.",
        "Furthermore, the 'transport' event is a 'crime' and the manner is 'secret'.",
        "The `medicine' is a material of 'addictive' products.",
        "The arrow between two concepts is a dependency connection with the concept pointed to by the arrow denoting the dependent and the concept at the other end as the governor.",
        "The name of the dependency relation is enclosed in a square bracket and it could appear at either the dependent or the governor side.",
        "Currently, over 60 types of information structure have been defined.",
        "The pattern of information structure is specified in the following format (sememe) [DRe1] ---> [DRel] (sememe), where DRe1 means the name of a dependency relation.",
        "For the dependency relation to apply, the governor and the dependent must satisfy the requirement of the sememes.",
        "Table 1 shows a",
        "subset of the information structures.",
        "Information structures are derived in a bottom-up fashion from analysing the mechanisms used in the composition of words.",
        "This approach is based on the insight that mechanisms used in word formation are also applicable to phrase and sentence construction in Chinese.",
        "For example, the type \"(11411311thne) [IVEUltime] 4 – (*4 !event) \" applies to the formation of the following units at various levels of linguistic structure: level: word \"4--Iffi\" (afternoon nap) phrase \"Ong-<-4T\" (summer study) level: \"AAJ3.-neuEP\" (long-time sentence level: shortage of commodities) \"1999*12 n 9 El RIME14---gta \" (leaking occurs on Thursday, December 9, 1999) In the process of annotating the corpus, the coverage of information structure types at the phrase and sentence levels was evaluated and missing types are added.",
        "The new types arise mainly due to function words.",
        "For example, the type \" (modality! )",
        "[modality!",
        "o A 4 (41event)\" is due to the use of function words such as \"Nto\" (must) and \"ffra(must).",
        "These are words expressing the attitude of the speaker of an utterance towards an event."
      ]
    },
    {
      "heading": "3.1 An example",
      "text": [
        "We annotated a subset of the Sinica corpus (version 3.0) of 30,000 words with information structures.",
        "The corpus includes 103 newspaper texts covering the crime domain.",
        "The annotation has been completed and is currently under verification.",
        "We expect to release the corpus and the annotation guideline at the end of this year.",
        "An example of our annotation is shown below and its information structures are shown in Figure 1 at the end of this paper.",
        "The difference between this work and the work reported in Gan and Tham (1999) lies in the addition of the dependency relations into the annotation.",
        "\"After Lin Wenzheng, a junior captain with the Criminal Investigation Department of the Xinhua police branch of Tainan county, committed suicide by shooting himself yesterday afternoon,\" The hierarchical structure in Figure 1 is another way to represent the relation between governor and dependent, as illustrated in Figure 2.",
        "Cl immediately dominates C2, indicating that Cl is the governor and C2 the dependent.",
        "The relation between them is either R1 or R2.",
        "Rl is located at the same level as C 1 and R2 is located at the same level as C2.",
        "These two possibilities could also be represented linearly as shown in (2).",
        "(2) Cl [R1] [R2] C2 R2 between the two concepts Cl and C2 should be read as \"C2 is the R2 of Cl\" .",
        "For example, \"T4 (afternoon) is the time of \"s\" (raise).",
        "R1 between C1 and C2 should be interpreted as \"Cl is the Rl of C2\" .",
        "For example, the \"time\" between \"&\" (after) and “n\" (suicide) should be interpreted as \"\"&\" is the time of \" ntt- .",
        "The HowNet definitions of the concepts in (1) are provided in Table 2:",
        "The structures in Figure 1 and Table 2 reveal the following information:",
        "(a) example (1) is about the time after a `suicide' event; (b) preceding the 'suicide' event is the event `raise'; (c) the time of the `raise' event is \"FIFFY , the agent is \"44:5coc\" and the patient is a `weapon'; (d) the 'occupation' of \"*-4:3ZOC\" is \"ICg R which is an `official' of 'secondary' importance and \"4-4zfjc\" belongs to the `institution' \"WA-ffifINE\" ; (e) the location of the 'institution' \"Yr3-1-Wpj",
        "kil\" is at \"-EM144filt\" This kind of representation enables a computer to analyse texts at a deeper level of understanding.",
        "As an English and Chinese bilingual common-sense knowledge system, HowNet can contribute much to better text understanding and machine translation (Dong 1999)."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "The work reported here constitutes part of our efforts to develop a new strategy for Chinese text understanding.",
        "The strategy was proposed by Dong (1999).",
        "It starts with tagging each concept with the most probable HowNet definitions.",
        "The second step is to determine the information structures as described in this paper.",
        "The last step is to recover the implicit information structures from the surface information structures based on two additional knowledge sources: (i) relations between the event types as defined in HowNet; and (ii) rules governing the interplay of dynamic roles between event types.",
        "For example, the 'suicide' event in example (1) does not mention its agent directly.",
        "The means of committing 'suicide' by `firing' is also implicit.",
        "The recovery of this information will be the main issues to be resolved at the final stage.",
        "In parallel with our annotation effort, we are also working on developing automatic algorithms for the disambiguation of HowNet definitions and the identification of information structures.",
        "The creation of the two additional knowledge bases will be our future plan."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "This work was supported by the Hong Kong Research Grant Council.",
        "We would also like to thank Dong Zhendong.",
        "Without his advice, this work would not be possible."
      ]
    }
  ]
}
