{
  "info": {
    "authors": [
      "Benjamin K. T'sou",
      "Tom Bong-Yeung Lai",
      "Samuel W. K. Chan",
      "Weijun Gao",
      "Xuegang Zhan"
    ],
    "book": "Chinese Language Processing Workshop",
    "id": "acl-W00-1206",
    "title": "Enhancement of a Chinese Discourse Marker Tagger With C4.5",
    "url": "https://aclweb.org/anthology/W00-1206",
    "year": 2000
  },
  "references": [
    "acl-C92-3162",
    "acl-C94-1056",
    "acl-J81-2001",
    "acl-J86-3001",
    "acl-P92-1030",
    "acl-W00-0402",
    "acl-W97-0713"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Discourse markers are complex discontinuous linguistic expressions which are used to explicitly signal the discourse structure of a text.",
        "This paper describes efforts to improve an automatic tagging system which identifies and classifies discourse markers in Chinese texts by applying machine learning (ML) to the disambiguation of discourse markers, as an integral part of automatic text summarization via rhetorical structure.",
        "Encouraging results are reported.",
        "Keywords: discourse marker, Chinese corpus, rhetorical relation, automatic tagging, machine learning"
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Discourse refers to any form of language-based communication involving multiple sentences or utterances.",
        "The most important forms of discourse of interest to Natural Language Processing (NLP) are text and dialogue.",
        "The function of discourse analysis is to divide a text into discourse segments, and to recognize and reconstruct the discourse structure of the text as intended by its author.",
        "Automatic text abstraction has received considerable attention (Paice 1990).",
        "Various systems have been developed (Chan et al.",
        "2000).",
        "Ono et al.",
        "(1994), T'sou et al.",
        "(1992) and Marcu (1997) focus on discourse structure in summarization using the Rhetorical Structure Theory (RST, Mann and Thompson 1986).",
        "The theory has been exploited in a number of computational systems (e.g. Hovy 1993).",
        "The main idea is to build a discourse tree where each node of the tree represents an RST relation.",
        "Summarization is achieved by trimming unimportant sentences on the basis of the relative saliency or rhetorical relations.",
        "The SIFAS (Syntactic Marker based Full-Text Abstraction System) system has been implemented to use discourse markers in the automatic summarization of Chinese (T'sou et al.",
        "1999).",
        "In this paper, we report our efforts to improve the SIFAS tagging system by applying machine learning techniques to disambiguation of discourse markers.",
        "C4.5 (Quinlan, 1993) is used in our system."
      ]
    },
    {
      "heading": "2 Manual Tagging Process",
      "text": [
        "To tag the discourse markers, the following coding scheme is designed to encode Real Discourse Markers (RDM) appearing in the SIFAS corpus (T'sou et al.",
        "1998).",
        "We describe the i discourse marker with a 7-tuple RDM,: RDM ,=< DM, , RR, , RP, , CT, , MN, , RN, , OT, >, where",
        "DM; : the lexical item of the Discourse Marker, or the value 'NULL' .",
        "RR; : the Rhetorical Relation in which DM; is a constituent marker.",
        "RP; : the Relative Position of DM;.",
        "CT; : the Connection Type of RR; .",
        "MN; : the Discourse Marker Sequence Number.",
        "RN; : the Rhetorical Relation Sequence Number.",
        "OT; : the Order Type of RR;.",
        "The value of OT; can be 1, 1 or 0, denoting respectively the normal order, reverse order or irrelevance of the premise-consequence ordering of RR; .",
        "For apparent discourse markers that do not function as a real discourse marker in a text, a different coding scheme is used to encode them.",
        "We describe the apparent discourse marker using a 3-Tuple ADM;: ADM;=< LI; , *, SN; >, where LIi : the Lexical Item of the apparent discourse marker.",
        "SN; : the Sequence Number of the apparent discourse marker.",
        "In Chinese, discourse markers can be either words or phrases.",
        "To tag the SIFAS corpus, all discourse markers are organized into a discourse marker pair-rhetorical relation correspondence table.",
        "Part of the table is shown Table 1.",
        "To construct an automatic tagging system, let us first examine the sequential steps in the tagging process of a human tagger.",
        "S1.",
        "Written Chinese consists of running texts without word delimiters; the first step is is to segment the text into Chinese word sequences.",
        "S2.",
        "On the basis of a discourse marker list, we identify those words in the text which appear on the list as Candidate Discourse Markers (CDMs).",
        "S3.",
        "To winnow Real Discourse Markers (RDMs) and Apparent Discourse Markers (ADMs) from the CDMs, and encode the ADMs with a 3-tuple.",
        "S4.",
        "To encode the RDM with a 7-tuple according to a Discourse Marker Pair-Rhetorical Relation correspondence table."
      ]
    },
    {
      "heading": "3 Automatic Tagging Process",
      "text": [
        "The identification of candidate discourse markers is based on a discourse marker list, which now contains 306 discourse markers plus a NULL marker.",
        "The markers are extracted from newspaper editorials of Hong Kong, Mainland China, Taiwan and Singapore.",
        "These markers constitute 480 distinct discontinuous pairs that correspond to 25 rhetorical relations.",
        "In actual usage, some discourse marker pairs designate multiple rhetorical relations according to context.",
        "Some pairs can represent both INTER-sentence and INTRA-sentence relations.",
        "Thus the correspondence between the discourse marker pairs and the rhetorical relations is not single-valued.",
        "Some discourse marker pairs correspond to more than one rhetorical relation or connection type.",
        "We have 504 correspondences between the discourse marker pairs and the rhetorical relations.",
        "In practice, one discontinuous constituent member of a marker pair is often omitted.",
        "We use the NULL marker to indicate the omission.",
        "In the 504 correspondences, 244 of them are double constituent marker pairs, 260 are single constituent markers (i.e. One of the markers is NULL).",
        "And in the 244 double constituent markers, only 3 are not single-valued correspondences (one of which is an INTER/INTRA relation, and can easily be distinguished.).",
        "Thus the tagging of the 244 double constituent markers is basically a table searching process.",
        "But for the 260 single constituent markers, the identity of the NULL marker is often difficult to determine.",
        "The SIFAS tagging system works in two modes: automatic and interactive (semiautomatic).",
        "The automatic tagging procedure is as follows:",
        "1.",
        "Data preparation: Input data files are modified according to the required format.",
        "2.",
        "Word segmentation: Because there are no delimiters between Chinese words in a text, words have to be extracted through a segmentation process.",
        "3.",
        "CDM identification 4.",
        "Full-Marker RDM recognition 5.",
        "ADM identification (first pass, deterministic) 6.",
        "CDM feature extraction 7.",
        "ADM identification (2nd pass, via ML) 8.",
        "Tagging NULL-marker CDM pairs (via ML) 9.",
        "ADM and RDM sequencing, proofreading, training data generation, and statistics",
        "The following principles are adopted by the tagging algorithm to resolve ambiguity in the process of matching discontinuous discourse markers:",
        "1. the principle of greediness: When matching a pair of discourse markers for a rhetorical relation, priority is given to the first matched relation from the left.",
        "2. the principle of locality: When matching a pair of discourse markers for a rhetorical relation, priority is given to the relation where the distance between its constituent markers is shortest.",
        "3. the principle of explicitness: When matching a pair of discourse markers for a rhetorical relation, priority is given to the relation where both markers are explicitly presented.",
        "4. the principle of superiority: When matching a pair of discourse markers for a rhetorical relation, priority is given to the inter-sentence relation whose back discourse marker matched with the first word of a sentence.",
        "5. the principle of Back-marker preference: This is applicable only to rhetorical relations where either the front or the back marker is absent, or to a NULL marker.",
        "In such cases, priority is given to the relation with the back marker present.",
        "Steps 1 to 6 and the five principles underlie the original naive tagger of the SIFAS system (T'sou et al.",
        "1998), which also contains the system framework."
      ]
    },
    {
      "heading": "4 Improvement",
      "text": []
    },
    {
      "heading": "4.1 Problems",
      "text": [
        "Many Chinese discourse markers have both discourse senses and alternate sentential senses in different context.",
        "For a human tagger, steps S3 and S4 in section 2 are not difficult because he/she can identify an ADM/RDM based on his/her text comprehension.",
        "However, for an automatic process, it is quite difficult to distinguish an ADM from an RDM if no syntactic/semantic information is available.",
        "Another problem is the location of NULL-Marker described above.",
        "Our earlier statistics showed some characteristics in the distance measured by punctuation marks.",
        "Statistics from 80 tagged editorials show that most of the relations are INTRA-Sentence relations (about 93%), about 70% of the INTRA RDM pairs have NULL markers.",
        "Most of these RDM pairs are separated by ONE comma (62%).",
        "These statistics show",
        "the importance of the problems of positioning the NULL markers.",
        "The naive tagger partially solved the CDM discrimination and NULL marker location problems.",
        "Our experiment shows that about 45% of the ADMs can be correctly identified, and about 60% of the NULL markers can be correctly located one comma/period away from the current RDM.",
        "This leaves much room for improvement.",
        "One solution is to add a few rules according to previous statistics.",
        "The original naive tagger did not assume any knowledge of the statistics and behavioral patterns of discourse markers.",
        "From the error analysis, we extracted some additional rules to guide the classification and matching of the discourse markers.",
        "For example, one of the rules we extracted is: \"A matching pair must be separated by at least two words or by punctuation marks\".",
        "Using this rule, the following full marker matching error is avoided.",
        "Another solution is to use syntactic/semantic information through machine learning."
      ]
    },
    {
      "heading": "4.2 C4.5",
      "text": [
        "Most empirical learning systems are given a set of pre-classified cases, each described by a vector of attribute values, and construct from them a mapping from attribute values to classes.",
        "C4.5 is one such system that learns decision-tree classifiers.",
        "It uses a divide-and-conquer approach to growing decision trees.",
        "The current version of C4.5 is C5.0 for Unix and Sees for Windows.",
        "Let attributes be denoted A=fal, a2, a.",
        "), cases be denoted D={4 d2, dj, and classes be denoted C'=\"c,, c2, cii.",
        "For a set of cases D, a test 7; is a split of D based on attribute a,.",
        "It splits D into mutually exclusive subsets Do Do Dr These subsets of cases are single-class collections of cases.",
        "If a test T is chosen, the decision tree for D consists of a node identifying the test T , and one branch for each possible subset Di.",
        "For each subset Di, a new test is then chosen for further split.",
        "If Di satisfies a stopping criterion, the tree for Di is a leaf associated with the most frequent class in Di.",
        "One reason for stopping is that cases in Di belong to one class.",
        "C4.5 uses arg max(gain(D,T)) or arg max(gain ratio(D,T)) to choose tests for split:",
        "where, p(c1,D) denotes the proportion of cases in D that belong to the ith class."
      ]
    },
    {
      "heading": "4.3 Application of C4.5",
      "text": [
        "Since using semantic information requires a comprehensive thesaurus, which is unavailable at present, we only use syntactic information through machine learning.",
        "The attributes used in the original SIFAS system include the candidate discourse marker itself, two words immediately to the left of the CDM, and two words immediately to the right of the CDM.",
        "The attribute names are F2, F1, CDM, B1, B2, respectively (T'sou et al., 1999).",
        "SIFAS only uses the Part Of Speech attribute of the neighboring words.",
        "This reflects to some degree the syntactic characteristics of the CDM.",
        "To reflect the distance characteristics, we add two other attributes: the number of discourse delimiters (commas, semicolons for INTRA-sentence relation, periods and",
        "exclamation marks for INTER-sentence relation) before and after the current CDM, denoted Fcom and Bcom, respectively.",
        "For the location of the NULL marker, we still add an actual number of delimiters Acorn.",
        "The order of these attributes is: CDM, F 1 , F2, B 1 , B2, Fcom, Bcom Acorn for Null marker location, and CDM, F 1 , F2, B1, B2, Fcom, Bcom, IsRDM for CDM classification, where IsRDM is a Boolean value.",
        "The following are two examples of cases: 4 _EL ,?,q,a,a,7,1,1 for NULL marker location M,d,?,u,?,1,0,F for CDM classification where \"?\" denotes that no corresponding word is at the position (beginning or end of sentence); a, d, q, and u are part-of-speech symbols in our segmentation dictionary, representing adjective, adverb, classifier, and auxiliary, respectively.",
        "The following are two examples of the rules generated by the C4.5.",
        "The first is a CDM classification rule, and the other is a NULL marker location rule.",
        "which can be explained as: if the word after the CDM \"#\" is a verb, and there is one comma in the sentence, before \"4\", then \"4\" is an RDM.",
        "which can be explained as: if the second word after the RDM is a preposition, and there is more then one commas before the current RDM, then the location of the NULL marker is two commas away from the RDM."
      ]
    },
    {
      "heading": "4.4 Objects in the SIFAS system",
      "text": [
        "The objects in the new SIFAS tagging system are listed below.",
        "1.",
        "Dictionary Editor: for the update of word segmentation dictionary and the rhetorical relation table.",
        "2.",
        "Data Manager: for the modification of the input data (editorial texts) to conform with the required format.",
        "3.",
        "Word Segmenter: for the segmentation of the original texts, and the recognition of CDMs.",
        "4.",
        "RDM Tagger: The initial identification of RDMs is a table searching process.",
        "All those full-marker pairs are identified as rhetorical relations according to the principles described above.",
        "For those Null-marker pairs, the location of the Null maker is left to the rule interpreter.",
        "5.",
        "ADM Tagger: The identification of ADMs is also a table searching process, because, without other syntactic/semantic information, the only way to identify ADMs from the CDMs is to find out that the CDM cannot form a valid pair with any other CDMs (including the NULL marker) to correspond to a rhetorical relation.",
        "6.",
        "CDM Feature Extractor: For those untagged CDMs, the classification is carried out through C4.5.",
        "The Feature Extractor extracts syntactic information about the current CDM and send it to the Rule Interpreter (see below).",
        "7.",
        "Rule Interpreter: C4.5 takes feature data file as the input to construct a classifier, and the rules formed are stored in an output file.",
        "The rule interpreter reads this output file and applies the rules to classify the CDMs.",
        "In our system, The Rule Interpreter functions as a NULL Marker Locator and a CDM classifier.",
        "8.",
        "Sequencer: for the rearrangement of RDM and ADM order number.",
        "In the rearranging process, the Sequencer also extracts statistical information for analysis.",
        "9.",
        "Interaction Recorder: for the recording of user interaction information for",
        "statistics use.",
        "10.",
        "Data Retriever: for data retrieval and browsing."
      ]
    },
    {
      "heading": "5 Evaluation",
      "text": [
        "In order to evaluate the effectiveness of the tagging system in terms of the percentage of discourse markers that can be tagged correctly, we have chosen 80 tagged editorials from Ming Pao, a Chinese newspaper of Hong Kong, in the duration from December 1995 to January 1996 to form a training data set.",
        "Then we randomly selected 20 editorials from Mainland China and Hong Kong newspapers for the system to tag automatically, and then manually checked the results.",
        "The total CDMs in the training data set is 4764, in which 2116 are RDMs and 2648 are ADMs.",
        "The distribution of INTER-sentence relations, INTRA-sentence relations, and NULL marker pairs is shown below.",
        "Our evaluation is based on counting the number of discourse markers that are correctly and incorrectly tagged.",
        "The total CDMs in the test data set is 1134, in which 563 are RDMs and 571 are ADMs.",
        "The distribution of INTER-sentence relations, INTRA-sentence relations, and NULL marker pairs in the test data set is shown in Table 3.",
        "From the test results shown in Table 4, we can see that most of the errors are caused by the misclassification of the CDMs.",
        "An example of Other errors is shown below.",
        "The following sentence is from an editorial of People's Daily.",
        "In the above sentence, the first \"a\" is matched with the NULL marker, but the second \"a\" is left as an ADM.",
        "This causes an \"Other error\" and an \"ADM/RDM classification error\".",
        "The Gross Accuracy (GA) as defined in T'sou et al.",
        "(1999) is: GA = correctly tagged discourse markers / total number of discourse markers = 95.38% This greatly improves the performance compared with the original GA = 68.89%.",
        "The overgeneration problem (tagged 415, actual 424) is caused by the mismatch of CDMs as RDM pairs, or by the",
        "misclassification of CDMs as RDMs.",
        "Following are two examples.",
        "In this example, \" A \" could have matched <4,*,55>, <4t,*,56>, or <a*,58>.",
        "Only the <4,*,55> and the 4t,*,58> can be eliminated from the candidates according to the \"simple rules\" mentioned in section 4.1.",
        "The system has to choose from <a,*,56> and <J13,*,57> to match with \"fin*\" .",
        "Luckily, the system has given a right choice here.",
        "The two \"A\" are misclassified as RDMs, and causes a mismatch of RDM pair.",
        "Such errors are difficult to avoid for an automatic system.",
        "Without further syntactic/semantic analysis, we can only hope for the ML algorithm to give us a solution from more training data."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "In order to study discourse markers for use in the automatic summarization of Chinese text, we have designed and implemented the SIFAS system.",
        "In this paper, we have focused on the problems of NULL marker location and the classification of RDMs and ADMs.",
        "A study on applying machine learning techniques to discourse marker disambiguation is conducted.",
        "C4.5 is used to generate decision tree classifiers.",
        "Our results indicate that machine learning is an effective approach to improving the accuracy of discourse marker tagging.",
        "For interactive use of the system, if we set a threshold for the rule precision and only display those low precision rules for interactive selection, we can greatly speed up the semi-automatic tagging process."
      ]
    },
    {
      "heading": "7 References",
      "text": []
    }
  ]
}
