{
  "info": {
    "authors": [
      "Tony Berber Sardinha"
    ],
    "book": "Workshop on Comparing Corpora",
    "id": "acl-W00-0902",
    "title": "Comparing Corpora With WordSmith Tools: How Large Must the Reference Corpus Be?",
    "url": "https://aclweb.org/anthology/W00-0902",
    "year": 2000
  },
  "references": [
    "acl-J93-1003"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "WordSmith Tools (Scott, 1998) offers a program for comparing corpora, known as KeyWords.",
        "KeyWords compares a word list extracted from what has been called 'the study corpus' (the corpus which the researcher is interested in describing) with a word list made from a reference corpus.",
        "The only requirement for a word list to be accepted as reference corpus by the software is that must be larger than the study corpus.",
        "one of the most pressing questions with respect to using KeyWords seems to be what would be the ideal size of a reference corpus.",
        "The aim of this paper is thus to propose answers to this question.",
        "Five English corpora were compared to reference corpora of various sizes (varying from two to 100 times larger than the study corpus).",
        "The results indicate that a reference corpus that is five times as large as the study corpus yielded a larger number of keywords than a smaller reference corpus.",
        "Corpora larger than five times the size of the study corpus yielded similar amounts of keywords.",
        "The implication is that a larger reference corpus is not always better than a smaller one, for WordSmith Tools Keywords analysis, while a reference corpus that is less than five times the size of the study corpus may not be reliable.",
        "There seems to be no need for using extremely large reference corpora, given that the number of keywords yielded do not seem to change by using corpora larger than five times the size of the study corpus."
      ]
    },
    {
      "heading": "Introduction",
      "text": [
        "WordSmith Tools (Scott, 1998) offers a program for comparing corpora, known as KeyWords.",
        "This tool has been used in several studies as a means for describing various lexico-grammatical characteristics of different genres (Barbara and Scott, 1999; Batista, 1998; Berber Sardinha, 1995, 1999a, b; Berber Sardinha and Shimazumi, 1998; Bonamin, 1999; Collins and Scott, 1996; Conde, 1999; Dutra, 1999; Freitas, 1997; Fuzetti, 1999; Granger and Tribble, 1998; Lima-Lopes, 1999; Lopes, 2000; Ramos, 1997; Santos, 1999; Scott, 1997; Silva, 1999; Tribble, 1998).",
        "The keywords identified by the program are not necessarily the 'most important words' in the corpus (Scott, 1997), or those that correspond to readers' intuitions as to what the topics of the texts are.",
        "It is generally thought that a set of WordSmith Tools keywords indicate `aboutness' (Phillips, 1989).",
        "KeyWords compares a word list extracted from what has been called 'the study corpus' (the corpus which the researcher is interested in describing) with a word list made from a reference corpus.",
        "The result is a list of keywords, or words whose frequencies are statistically higher in the study corpus than in the reference corpus.",
        "The software also identifies words whose frequencies are statistically lower in the study corpus, which are called 'negative keywords', in contrast to positive keywords, which have higher frequencies in the study corpus.",
        "Negative keywords, though, will not be discussed in the present paper.",
        "Hence, whenever keyword is mentioned in this paper, it will mean 'positive keyword' .",
        "The only requirement for a word list to be accepted as reference corpus by the software is that must be larger than the study corpus.",
        "Thus, the composition and length of KeyWord lists can vary according to at least six parameters:",
        "• The composition of the study corpus.",
        "• The composition of the reference corpus.",
        "• The size of the study corpus.",
        "• The size of the reference corpus.",
        "• The statistical test used in the comparison of frequencies (log-likelihood and chi-square are available).",
        "• The level of significance (p) used as the",
        "leyness' benchmark (the cut-off point).",
        "Since WordSmith Tools is Windows software, it has appealed to a large audience of applied linguists willing to do corpus-based research, to whom this platform is generally the only one that they know how to use.",
        "To them, one of the most pressing questions with respect to using KeyWords seems to be what would be the ideal size of a reference corpus.",
        "The aim of this paper is thus to propose answers to this question."
      ]
    },
    {
      "heading": "1 Using KeyWords",
      "text": [
        "A KeyWord list is a portion of the study corpus word list.",
        "KeyWords compares the frequencies for each type in the study and reference corpora.",
        "The program calculates the log-likelihood (G2)' or Chi-Square (X2) of each word form based on its distribution in both corpora, an example of which is given in the table below.",
        "Word Remaining Total form x word forms Study 10 90 (90%) 100 corpus (10%) (100%) Reference 10 (1%) 1000 (99%) 1010 corpus (100%) For a distribution such as the above, both the log-likelihood and chi-square statistics would probably flag the word form in question as a keyword, since its frequencies in the two corpora are so different (10% versus 1%).",
        "The way KeyWords processes word lists is not unique, and has been applied by researchers using other software (De Cock, Granger, Leech, and McEnery, 1998; Granger and Rayson, 1998; Milton, 1998).",
        "After processing the word lists, the keyword lists appear in WordSmith Tools as illustrated below.",
        "See Dunning (1992) for the formulae.",
        "From left to right, the columns in the window refer to:"
      ]
    },
    {
      "heading": "ROM",
      "text": [
        "• 'Word': the keywords.",
        "• 'Reg': frequency in the study corpus; • <file name> %: percent frequency in the study corpus; • `Freq': frequency in the reference corpus; • <file name> %: percent frequency in the reference corpus; • Keyness: the value of the log-likelihood or chi-square statistics; • p: the significance value associated with the statistic."
      ]
    },
    {
      "heading": "2 Methodology",
      "text": [
        "In order to answer this question, the following English corpora were used:",
        "• Corpus of job application letters, taken from the DIRECT Corpus2 .",
        "• Corpus of newspaper editorials, from the Brown Corpus (13' subcorpus).",
        "• Corpus of newspaper reviews, from the Brown Corpus (`C' subcorpus).",
        "• Corpus of mystery fiction, from the Brown Corpus (`L' subcorpus).",
        "• Corpus of science fiction, from the Brown Corpus (`M' subcorpus).",
        "These five corpora added up to about 162 thousand words:",
        "The reference corpora were compiled out of texts published in 'The Guardian'.",
        "The reason for choosing it is that newspaper text is the most typical kind of reference corpus used by applied linguists, mainly because it is easy to get.",
        "Therefore, the results obtained here would be relevant to the typical user of KeyWords.",
        "The reason for specifically choosing the Guardian is that Mike Scott, the author of WordSmith Tools, makes it available on his website a word list of 95 million tokens of The Guardian text on his website.",
        "This has become a popular choice for several WordSmith Tools users investigating English keywords.",
        "Once again, it was hoped that by using The Guardian, the investigation would mirror a typical choice of WordSmith users.",
        "For the present study, a portion of the Guardian word list was used, namely from texts published in 1994, taken randomly.",
        "The size of the reference corpora varied according to the size of the study corpora.",
        "For each study corpus, 18 reference corpora were created.",
        "Each one was n times larger than the study corpus, with n being 2, 3, 4, 5, 6, 7, 8, 9, 10, 20, 30, 40, 50, 60, 70, 80, 90, and 100.",
        "For instance, the letters corpus had 11,761 tokens, and so for n=2 the size of the reference corpus was 23,552 tokens (11,761 * 2); for n=3, the reference corpus size was 35,283 (11,761 x 3), for n=4 47,044, and so on, up to n=100, whose size was 1,176,100 words.",
        "The KeyWords settings used for the comparisons were as follows:",
        "The table below shows the size of all of the reference corpora used in the study:"
      ]
    },
    {
      "heading": "3 Results",
      "text": [
        "The results for the total number of keywords obtained are shown in the following table.",
        "Since the study corpora were of different sizes, the number of keywords is also shown as a percentage of the total types of the study corpus.",
        "For instance, the letters corpus had 2,415 types; the number of keywords obtained comparing this corpus to the n=2 reference corpus was 279; therefore, this corresponds to 11.6% of the total types.",
        "The results indicate that the number of keywords increases as the size of the reference corpus increases, but this increase is not linear.",
        "For instance, the keywords for n=2 in the letters corpus was 279, for n=3 it was 347, and for n= 100 the total keywords was 475.",
        "Had the growth been linear, for n=3 there would be 418 keywords, and for n=100 13,950.",
        "Obviously, a total of 13,950 keywords could never have been obtained since the maximum possible number of",
        "keywords in the letters corpus is 2,415, which is the total number of types.",
        "The same is true of all the other corpora.",
        "This suggests that there must be a point at which the growth in number of keywords diminishes.",
        "This can be shown by plotting the number of keywords for each size of n across all the study corpora, as in the graph below.",
        "The plot shows that for all study corpora the keyword totals rose from n=2 to n=3, then fell or stabilized at n=4, rose again at n=5 and from then on basically reached a plateau.",
        "For instance, for the letters corpus, the keyword totals for n=2, n=3, n=4, n=5, and n=6 were respectively 11.6, 14.4, 14.7, 19.9, and 19.9.",
        "Hence, there was indeed a considerable rise from n=2 to n=3 (11.6 to 14.4), followed by a slight rise at n=4 (14.7), then a major increase at n=5 (19.9), and there was no change from n=5 to n=6 (19.9 to 19.9).",
        "In order to check where the major changes occurred, an ANOVA was run on the keyword totals across the various n sizes.",
        "The results are shown in the table below.",
        "The value of F(21,68)=267.98 is significant at p<0.0001, which indicates that size of the reference corpora had a significant effect on the keyword totals.",
        "This does not show us the differences in keyword totals among n sizes.",
        "In order to know at which n sizes the keyword totals are statistically different, the REGWF (Ryan-Einot-Gabriel-Welsch) Multiple F Test was run in SAS.",
        "The results appear in the table below, in decreasing order of the average percentage of keyword totals across the five study corpora.",
        "The REGWF test presents the results in terms of groupings, identified by letters.",
        "Keyword totals in the same grouping are not statistically different.",
        "Hence, sizes of n equal to 40, 60, 20, 100, 80, 90, 30, 70, 50, 5, and 6 formed grouping A, which has on average 14.066% to 14.884% keyword totals.",
        "Likewise, n sizes equal to 70, 50, 5, 6, and 8 were in grouping B, with averages ranging from 13.686% to 14.694%.",
        "Note that this is overlap among groupings, and so groupings A, B, C and D are in fact joined.",
        "This grouping comprises n sizes ranging from 5 to 100.",
        "The remaining groupings are non-overlapping: grouping E was formed by n sizes 3 and 4, and grouping F by n=2.",
        "Therefore, there are two basic divisions in the previous table, namely at n sizes equal to 2, 3,",
        "and 5.",
        "These correspond to the major peaks and plateaus visible in the plot.",
        "The results suggest, then, that the critical value for a reference corpus seems to be .five.",
        "In other words, the answer to the question 'what is the ideal size of a reference corpus' is five.",
        "A reference corpus that is five times as large as the study corpus yields a larger number of keywords than a smaller reference corpus.",
        "This means that the results of a keyword analysis based on a reference corpus that is less than five times the size of the study corpus could be very different from a study done on a corpus, say, just three times larger than the study corpus, in so far as the number of keywords go.",
        "Several potentially revealing keywords could be left out of the analysis if the reference corpus is not as large as five times or more."
      ]
    },
    {
      "heading": "Conclusion",
      "text": [
        "The aim of this study was to estimate the ideal size of a reference corpus to be used in WordSmith Tools KeyWords procedure.",
        "KeyWords provides facilities for comparing a study corpus to a reference corpus, which, by default, must be larger than study corpus.",
        "The results indicated that a reference corpus that is five times larger than the study corpus yields a similar amount of keywords than reference corpora that are up to 100 times larger than the study corpus.",
        "This was taken to mean that a reference corpus does not need to be more than five times larger than the study corpus.",
        "In sum, a larger reference corpus is not always better than a smaller one, for WordSmith Tools Keywords analysis.",
        "There seems to be no need for using extremely large reference corpora, given that the number of keywords yielded do not seem to change by using corpora larger than five times the size of the study corpus.",
        "This may be important for WordSmith Tools users, who may be short of disk space and memory on their PCs to process large reference corpora.",
        "A suggestion that might come out of this finding is that researchers should not spend time and resources building, collecting or searching for larger and larger reference corpora.",
        "Resources would be better spent in the compilation of reference corpora that are more suitable in terms of their contents viz a viz the study corpus.",
        "This study did not tackle several important questions.",
        "One of them is whether the keywords that were identified represent the main concepts or topics found the texts.",
        "A qualitative study would be needed to answer this, as an independent test of validity of the status of the keywords.",
        "Another question is the effect of the size of the study corpus.",
        "It is not known how study corpora of the same size behave in terms of the total keywords that they yield when compared to reference corpora of the same size.",
        "Another question is the composition of the keyword lists obtained.",
        "This study restricted itself to quantitative aspects of keyword list variation, but it would be important that changes be assessed qualitatively as well.",
        "In particular, it would be pertinent to know which keywords were added or dropped as the levels of n change& .",
        "Finally, the fact that Brown corpus texts are short fragments and not whole texts may have upset the results, since the number of keywords seems to vary considerably as a function of the size of the texts (Mike Scott, personal communication).",
        "Shorter texts provide less room for repetition, which in turn influences word frequencies."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "My thanks go to Mike Scott and the three anonymous reviewers for their comments."
      ]
    }
  ]
}
