{
  "info": {
    "authors": [
      "Dragomir R. Radev",
      "Weiguo Fan"
    ],
    "book": "Workshop on Recent Advances in Natural Language Processing and Information Retrieval",
    "id": "acl-W00-1110",
    "title": "Automatic Summarization of Search Engine Hit Lists",
    "url": "https://aclweb.org/anthology/W00-1110",
    "year": 2000
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We present our work on open-domain multi-document summarization in the framework of Web search.",
        "Our system, SNS (pronounced \"essence\"), retrieves documents related to an unrestricted user query and summarizes a subset of them as selected by the user.",
        "We present a task-based extrinsic evaluation of the quality of the produced multi-document summaries.",
        "The evaluation results show that summarization quality is relatively high and does help improve the reading speed and judge the relevance of the retrieved URLs."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Online information is increasingly available at an exponential rate.",
        "According to a recent study by NetSizer (2000), the number of web hosts has increased from 30 million in Jan.1998 to 44 million in Jan. 1999, and to more than 70 million in Jan. 2000.",
        "More than 2 million new hosts were added to the Internet in Feb. 2000, according to this report.",
        "Similar Internet growth results were reported by Internet Domain Service (IDS, 2000).",
        "The number of web pages on the Internet was 320 million pages in Dec. 1997 as reported by Lawrence et al.",
        "(1997), 800 million in Feb. 1999 (Lawrence et al.",
        "1999), and more than 1,720 million in March, 2000 (Censorware, 2000).",
        "The number of pages available on the Internet almost doubles every year.",
        "To help alleviate the information overload problem and help users find the information they need, many search engines emerge.",
        "They build a huge centralized database to index a portion of the Internet: ranging from 10 million to more than 300 million of web pages.",
        "Search engines do help reduce the information overload problem by allowing a user to do a centralized search, but they also bring up another problem for the user: too many web pages are returned for a single query.",
        "To find out which documents are useful, the user often have to sift through hundreds of pages to find out that only a few of them are relevant.",
        "Moreover, browsing through the long list of retrieval results is so tedious that few users would be willing to go through.",
        "That's why research results have shown that search engine users often give up their search in the first try, examining no more than 10 documents (Jansen et al.",
        "2000).",
        "It would be very helpful if an effective search engine could be designed to help classify the retrieved web pages into clusters and provide more contextual and summary information to help these users explore the retrieval set more efficiently.",
        "Recent advances in information retrieval, natural language processing, computational linguistics make it easier to build a helpful search engine based on summaries of hit lists.",
        "We describe in this paper a prototype system, SNS, which blends the traditional information retrieval technology with the advanced document clustering and multi-document summarization technology in an integrated framework.",
        "The following steps are performed for a given query:",
        "compare our work to related research in Section 7, we conclude the paper in Section 8."
      ]
    },
    {
      "heading": "2 Search",
      "text": [
        "The search component of SNS is a personalized search engine called MySearch.",
        "MySearch utilizes a centralized relational database to store all the URL indexes and other related URL information.",
        "Spiders are used to fetch URLs from the Internet.",
        "After a URL is downloaded, the following steps are applied to index the URL:",
        "The general architecture of our system is shown in Figure 1.",
        "User interaction with SNS can be done in three different modes:",
        "• Web search mode.",
        "The user enters a general-domain query in the search engine (MySearch).",
        "The result is a set of related documents (the hit-list).",
        "The user then selects which of the hits should be summarized.",
        "MEAD, the summarization component produces a cross-document summary of the documents selected by the user from the hit list.",
        "• Intranet mode.",
        "The user indicates what collection of documents needs to be summarized.",
        "These documents are not necessarily extracted from the Web.",
        "• Clustering mode.",
        "The user indicates that either the hit list of the search engine or a standalone document collection needs to be clustered.",
        "CIDR, the clustering component, creates clusters of documents.",
        "For each cluster, MEAD produces a cross-document summary.",
        "Our paper is organized as follows.",
        "Sections 2 – 4 describe the system.",
        "More specifically: Section 2 explains how the search engine operates, Section 3 deals with the clustering module while Section 4 presents the multi-document summarizer.",
        "Section 5 describes the user interface of the system.",
        "In Section 6, we present some experimental results.",
        "After we",
        "• Parse the HTML file, remove all those tags • Apply Porter's stemming algorithms to each keyword.",
        "• Remove stop words • Index each keyword into the database along with its frequency and position information.",
        "The contents of URLs are indexed based on the locations of the keywords: Anchor, Title, and Body.",
        "This allows weighted retrieval based on different word positions.",
        "For example, a user can specify that he'd like to give a weight 5 for the keyword appearing in the title, 4 for anchor, and 2 for body.",
        "This information can be saved in his personal profile and used for later weighted ranking.",
        "Besides the weighted search, MySearch also supports Boolean search and Vector Space search (Salton, 1989).",
        "For the vector space model, the famous TF-IDF is used for ranking purpose.",
        "We used a modified version of TF-IDF: log(y.+0.5)*log(N/dj), where y' means the number of times a term appeared in the content of an URL, N is the total number of documents in the text collection, and df stands for the number of unique URLs in which a term appears in the entire collection.",
        "A user can choose which search method he wants to use.",
        "He/she can also combine Boolean search with Vector Space search.",
        "These options are provided to give users more flexibility to control the retrieval results as",
        "past research indicated that different ranking functions give different performances (Salton, 1989).",
        "A sample search for \"Clinton\" using the TF-IDF Vector Space search is shown in Figure 3.",
        "The keyword \"Clinton\" is highlighted using a different color to help users get more contextual information.",
        "The retrieval status value is shown in a bold black font after the URL title."
      ]
    },
    {
      "heading": "3 Clustering",
      "text": [
        "Our system uses two types of clustered input-either the set of hits that the user has selected or the output of our own clustering engine CIDR (Columbia Intelligent Document Relater).",
        "CIDR is described in (Radev et al., 1999).",
        "It uses an iterative algorithm that creates as a side product so-called \"document centroids\".",
        "The centroids contain the most highly relevant words to the entire cluster (not to the user query).",
        "We use these words to find the most salient \"themes\" in the cluster of documents."
      ]
    },
    {
      "heading": "3.1 Finding themes within clusters",
      "text": [
        "One of the underlying assumptions behind SNS is that when a user selects a set of hits after reading the single-document summaries from the hit list retrieved by the system, he or she performs a cognitive activity whereby he or she selects documents which appear to be related to one or more common themes.",
        "The multi-document summarization algorithm attempts to identify these themes and to identify the most salient passages from the selected documents using a pseudo-document called the cluster centroid which is computed automatically from the entire list of hits selected by the user."
      ]
    },
    {
      "heading": "3.2 Computing centroids",
      "text": [
        "Figure 2 describes a sample of a cluster centroid.",
        "The TF column indicates the average term frequency of a given term within the cluster.",
        "E.g., a TF value of 13.33 for three documents indicates that the term \"deny\" appears 40 times in the three documents.",
        "The IDF values are computed from a mixture of 200 MB of news and web-based documents."
      ]
    },
    {
      "heading": "4 Centroid-based summarization",
      "text": [
        "The main technique that we use for summarization is sentence extraction.",
        "We score individually each sentence within a cluster and output these that score the highest.",
        "A more detailed description of the summarizer can be found in (Radev et al., 2000).",
        "The input to the summarization component is a cluster of documents.",
        "These documents can be either the result of a user query or the output of CIDR.",
        "The summarizer takes as input a cluster of d documents with a total of n sentences as well as a compression ratio parameter r which indicates how much of the original cluster to preserve.",
        "The output consists of a sequence of [n * r] sentences from the original documents in the same order as the input documents.",
        "The highest-ranking sentences are included according to the scoring formula below:",
        "In the formula, we, wf are weights.",
        "Ci is the centroid score of the sentence, Pi is the positional score of the sentence, and Fi is the score of the sentence according to the overlap with the first sentence of the document."
      ]
    },
    {
      "heading": "4.1 Centroid value",
      "text": [
        "The centroid value C, for sentence Si is computed as the sum of the centroid values C„, of all words in the sentence.",
        "For example, the sentence \"President Clinton met with Vernon Jordon in January\" gets a score of 243.34 which is the sum of the individual centroid values of the words (clinton = 36.39; vernon = 47.54; jordan = 75.81; j anuary = 83.60)."
      ]
    },
    {
      "heading": "Ci Cw 4.2 Positional value",
      "text": [
        "The positional value is computed as follows: the first sentence in a document gets the same score C,„,„ as the highest-ranking sentence in the document according to the centroid value.",
        "The score for all sentences within a document is computed according to the following formula:",
        "For example, if the sentence described above appears as the third sentence out of 30 in a document and the largest centroid value of any sentence in the given document is 917.31, the positional value P3 will be = 28/30 * 917.31"
      ]
    },
    {
      "heading": "4.3 First-sentence overlap",
      "text": [
        "The overlap value is computed as the inner product of the sentence vectors for the current sentence i and the first sentence of the document.",
        "The sentence vectors are the n-dimensional representations of the words in each sentence whereby the value at position i of a sentence vector indicates the number of occurrences of that word in the sentence.",
        "-*Fi=SiSi"
      ]
    },
    {
      "heading": "4.4 Combining the three parameters",
      "text": [
        "As indicated in (Radev & al., 2000) we have experimented with several weighting schemes for the three parameters (centroid, position, and first-sentence overlap).",
        "Until this moment, we have not come to the point in which the three weights wc, w,„ and w1 are either automatically learned or derived from a user profile.",
        "Instead, we have experimented with various sets of empirically determined values for the weights.",
        "In this paper the results are based on equal weights for the three parameters w, = wp= wf = 1."
      ]
    },
    {
      "heading": "5 User Interface",
      "text": [
        "We describe in this section the user interface for web search mode as described earlier in Section 1.",
        "One component of our system is the search engine (MySearch).",
        "The detailed design of the search component is discussed in Section 2.",
        "The result of a sample query \"Clinton\" to our search engine is shown starting in Figure 4.",
        "A user has the option to choose a specific ranking function as well as the number of retrieval results to be shown in a single screen.",
        "The keyword contained in the query string will be automatically highlighted in the search results to provide contextual information for the user.",
        "The overall interface for SNS is shown in Figure 4.",
        "On the top right of the frame is the MySearch search engine.",
        "When a user submits a query, the screen in Figure 5 appears.",
        "As can be seen from Figure 5, there is a check box along with each retrieved record.",
        "This allows the user to tell the summarization engine which documents he/she wants to summarize.",
        "After the user clicks the summarization button, the summarization option screen is displayed as shown in bottom of Figure 6.",
        "The summarization option screen allows a user to specify the summarization compression ratio.",
        "Figure 7 shows the summarization result for four URLs with the compression ratio set as 30%.",
        "The following information is shown in the summarization result screen in Figure 7:",
        "• The number of sentences in the text of the set of URLs that the user selected • The number of sentences in the summary",
        "The sentences representing the themes of those selected URLs and their relative scores.",
        "The sentences are ordered the same way they appear in the original set of documents."
      ]
    },
    {
      "heading": "6 Experimental results",
      "text": [
        "Our system was evaluated using the task-based extrinsic measure as suggested in (Math et al.",
        "1999).",
        "The experiment was set up as follows: Three sets of documents on different topics were selected prior to the experiment.",
        "The topics and their corresponding document information are shown in Table 1.",
        "Sentence Score The idea behind dat.atnining then is the,non-...ttiyial process,of identifying, valid 494.92 novel potentially usefulfaitd\":41tatataktitideratatidablepatternalidatz 18 2 The term knOimledge:discoveryth databases KD Was formalized in, 1989 in' reference , , D, .",
        "to tliesetieraliconcept ofbeing broad and `high level' iiithe pursuit of seeking knowledge•froml,,.. ata The term data mining is then this high-level application techniques / tools used to 509.11 present and analyze data for decision makers This term data inning has been by StatiStiCifinSdataianalyst'OrittlieMia,:,.",
        "487.92 management information systems community whereas been mostly Used by artificial intelligen06:iiictiiiic:hind learning researchers These are : the untapped value in large databases consolidation of database 576.60 records tending towards a single customer view concept of an information or data warehouse from the consolidation of databases dramatic drop in the cost/performance ratio of hardware systems - for data storage arid processing Intetise!fintii 6-ii.iii*ineiokiiiiiirSithiratiidWfarleettiliCalliibilitS4 ciin 486.92 manufacture market and advertise to .,-,Mall rnarkeisegmentS'and individuals 4 and .",
        "the market for data mining products is estimated'at about 50(iinillion.ln early ..-.- - .. 1994 12 Data mining technologies are characterized by intensive eoMptuations on .. , ... , large voluntes of data,,!.",
        "Data mining versus traditional database queries Traditional database queries 520.53 contrasts with data mining since these are typified by the simple question such as what were the sales of orange juice in January 1995 for the Boston area Data ; the 'Other tiaiicVtlik.O-ii use;oi ific alg&ahms or search 500.80 --,,,,,„,) infer - Ps4ttOnt7Itts to ,soUrce:otiti'dierrikle p id trendSkiithe data iiid''' lea'fitifnethese patterns .",
        "As Table 1 shows, the articles in topic set S1 are in S3 are the shortest, with each 32k in average.",
        "longer than both these in S2 and S3.",
        "The articles The number of documents in each topic set is",
        "also different.",
        "The variations of document length and different number of documents in each topic set will help test the robustness of our summarization algorithms.",
        "We used SNS to generate both 10% and 20% summaries for each topic.",
        "A sample of the 10% summary for topic S2 is shown in Figure 8.",
        "Four users were selected for evaluation of these summarization results.",
        "Each user was asked to read through the set of full articles for each topic first, followed by its corresponding 10% and 20% summaries.",
        "After these 4 users finished each set, they were asked to assign a readability score (1-10) for each summary.",
        "The higher the readability score is, the more readable and meaningful for comprehension is the summary.",
        "The time of reading both full articles and summaries was tracked and recorded.",
        "have different reading speeds.",
        "However, their reading speed is pretty consistent across the 3 topics.",
        "The summaries generated by SNS are also very readable.",
        "For example, The average readability score (which is obtained by averaging the readability scores assigned by the four users) for 10% and 20% summaries for",
        "topic S 1 , is 8, 8 respectively.",
        "For topic S3, the average readability score for 10% and 20% summaries is 7.75, and 8.75, respectively.",
        "Similarly, for S2 the average readability score for 10% and 20% summaries is 8 and 8.5, respectively.",
        "The differences in the average readability score also suggest that (a) our summarizer favors longer documents over shorter documents; (b) 20% summaries are generally favorable over 10% summaries.",
        "The difference in the readability score between 10% and 20% summaries is bigger in S3 (diff = 1.0) than in SI (diff = 0).",
        "These interesting findings raise interesting questions for future research.",
        "As can be seen from Table 3, the 20% summary achieves better readability score in overall than the 10% summary.",
        "The speedup of the 10% summary over full articles is 6.87.",
        "That is, with reading material reduced by 900%, the speedup in reading is only 687%.",
        "This suggests that there may be a little bit difficulty in reading the 10% summary result.",
        "This may be due to the simple sentence boundary detection algorithm we used.",
        "The feedback from users in the evaluation seems to confirm the above reason.",
        "As more sentences were included in the 20% summaries, the speedup in reading (4.22) almost approached the optimal speedup ratio (5.0)'."
      ]
    },
    {
      "heading": "7 Related Work",
      "text": [
        "Neto et al.",
        "(2000) describes a text mining tool that performs document clustering and text summarization.",
        "They used the Autoclass algorithm to perform document clustering and used TF-ISF (an adaptation of TF-IDF) to perform sentence ranking and generate the summarization output.",
        "Our work is different from theirs in that we perform personalized summarization based on the retrieval result from a generic personalized web-based search engine.",
        "A more complicated sentence ranking functions is employed to boost the ranking performance.",
        "The compression ratio for the summary is customizable by a user.",
        "Both single-document for a single URL and multiple-document I Since the length of the summary is only 20% of the original documents, the maximum speedup in terms of reading time is 1/0.2=5.",
        "summarization for a cluster of URLs are supported in our system.",
        "More related work can be found in Extractor web site http://extractor.iit.nrc.ca/.",
        "They use MetaCrawler to perform web-based search and automatically generate summaries for each URLs retrieved.",
        "They only support single document summarization in their engine and the compression rate of the summarizer is also non-customizable.",
        "We not only support both single and multiple document summarization, but also allow the user to specify the summarization compression ratio as well as to get per-cluster summaries of automatically generated clusters, which, we believe, are more valuable to online users and give them more flexibility and control of the summarization results."
      ]
    },
    {
      "heading": "8 Conclusion and Future Work",
      "text": [
        "We described in this paper a prototype system SNS, which integrates natural language processing and information retrieval techniques to perform automatic customized summarization of search engine results.",
        "The user interface and detailed design of SNS's components are also discussed.",
        "Task-based extrinsic evaluation showed that the system is of reasonably high quality.",
        "The following issues will be addressed in the future."
      ]
    },
    {
      "heading": "8.1 Interaction between sentence inclusion in a summary",
      "text": [
        "There are two types of interaction (or reinforcement) between sentences in a summary: negative and positive.",
        "Negative interaction occurs when the inclusion of one sentence in the summary indicates that another sentence should not appear in the summary.",
        "This is particularly relevant to multi-document summarization as in this case: negative interaction models the non-inclusion of redundant information.",
        "The case of positive interaction involves positive reinforcement between sentences.",
        "For example, if a sentence with a referring expression is to be",
        "included in a summary, typically the sentence containing the antecedent should also be added.",
        "We will investigate specific setups in which positive and/or ,negative reinforcement between sentences is practical and useful."
      ]
    },
    {
      "heading": "8.2 Personalization",
      "text": [
        "We will investigate additional techniques for producing personalized summaries.",
        "Some of the approaches that we are considering are:",
        "• Query words: favoring sentences that include words from the user query in the Web-based scenario • Personal preferences and interaction history: we would favor sentences that match the user profile (e.g., overlapping with his or her long-term interests and/or recent queries logged by the system)."
      ]
    },
    {
      "heading": "83 Technical limitations",
      "text": [
        "The current version of our system uses a fairly basic sentence delimiting component.",
        "We will investigate the user of robust sentence boundary identification modules in the future.",
        "We will also investigate the possibility of some limited-form anaphora resolution component."
      ]
    },
    {
      "heading": "8.4 Availability",
      "text": [
        "A demonstration version of SNS is available at the following URL: http://www.si.umich.edu/–radev/ssearch/"
      ]
    }
  ]
}
