{
  "info": {
    "authors": [
      "Zheng Chen",
      "Heng Ji"
    ],
    "book": "Proceedings of the 2009 Workshop on Graph-based Methods for Natural Language Processing (TextGraphs-4)",
    "id": "acl-W09-3208",
    "title": "Graph-based Event Coreference Resolution",
    "url": "https://aclweb.org/anthology/W09-3208",
    "year": 2009
  },
  "references": [],
  "sections": [
    {
      "text": [
        "In this paper, we address the problem of event coreference resolution as specified in the Automatic Content Extraction (ACE)program.",
        "In contrast to entity coreference resolution, event coreference resolution has not received great attention from researchers.",
        "In this paper, we first demonstrate the diverse scenarios of event coreference by an example.",
        "We then model event coreference resolution as a spectral graph clustering problem and evaluate the clustering algorithm on ground truth event mentions using ECM F-Measure.",
        "We obtain the ECM-F scores of 0.8363 and 0.8312 respectively by using two methods for computing coreference matrices."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Typically, an ACE Event Detection and Recognition (VDR) system consists of two steps: first, it detects all mentions of events with certain specified types occurring in the raw text (event mention detection) and second, it unifies the event mentions into equivalence classes so that all the mentions in a given class refer to an event (event coreference resolution).",
        "ACE defines the following terminologies related with VDR:",
        "• Event: a specific occurrence involving participants.",
        "An ACE event has six attributes (type, subtype, modality, polarity, genericity and tense), zero or more event arguments, and a cluster of event mentions.",
        "• Event trigger: the word that most clearly expresses an event's occurrence.",
        "• Event argument: an entity,or a temporal expression or a value that has a certain role (e.g., Time-Within, Place) in an event.",
        "• Event mention: a sentence (or a text span extent) that mentions an event, including a distinguished trigger and involving arguments.",
        "In contrast to entity coreference, the scenarios in event coreference are more complicated, mainly because entity coreference is word (or phrase)-level coreference whereas event corefe-rence is sentence-level coreference and therefore the coreferring event mentions may have more flexible linguistic structures than entity mentions.",
        "We provide an example to demonstrate this diversity.",
        "EM1An {explosion} in a cafe at one of the capital's busiest intersections killed one woman and injured another Tuesday, police said.",
        "EM2Police were investigating the cause of the {explosion} in the restroom of the multistory Crocodile Cafe in the commercial district of Kizilay during the morning rush hour.",
        "EM3The {blast} shattered walls and windows in the building.",
        "EM4Ankara police chief Ercument Yilmaz visited the site of the morning blast but refused to say if a bomb had caused the {explosion}.",
        "The {explosion} comes a month after a bomb {exploded} at a McDonald's restaurant in Istanbul, causing damage but no injuries.",
        "EM7Radical leftist, Kurdish and Islamic groups are active in the country and have carried out {bombings} in the past.",
        "Table 1 shows the source text of a news story.",
        "As an example, we only tag the event mentions which have the event type and subtype of (Con-flict:Attack).",
        "In each event mention, the trigger is surrounded by curly brackets, and arguments are underlined.",
        "Table 3 shows that the five event mentions in event EV1 corefer with each other.",
        "We summarize EV1 as follows: a bomb (E4-1) exploded in the restroom (E2-1) of a café (E1-1 or E1-2) during Tuesday morning's rush hour (combination of T1-1, T2-1 and T3-1).",
        "EV2 is a different attack event because the target (E6-1) in EV2 differs from the one (E1-3) in EV1.",
        "EV3 tells that the bombing attacks have occurred generically (thus the event attribute \"genericity\" is \"General\" whereas it is \"Specific\" in EV1 and EV2).",
        "I EMI Trigger: explosion",
        "Arguments (ID: ROLE): (E1-1: Place) a cafe at one of the capital's busiest intersections",
        "EM2 Trigger: explosion_",
        "Arguments:",
        "(E2-1: Place) the restroom of the multistory Crocodile Cafe (E3-1: Place) the commercial district of Kizilay (T2-1: Time-Within) the morning rush hour",
        "EM3 I Trigger: blast_",
        "EM4 I Trigger: explosion Arguments:",
        "(E4-1: Instrument) a bomb (El-3: Target) the site of the morning blast (T3-1: Time-Within) morning_",
        "EM5 Trigger: explosion Arguments: None Trigger: exploded",
        "Arguments: (E5-1: Instrument) a bomb (E6-1: Target) a McDonald's restaurant (E7-1: Place) Istanbul_ Trigger: bombings_ (E8-1: Attacker) Radical leftist, Kurdish and Islamic groups Event__Included event mentions_",
        "2 Event Coreference Resolution as Spectral Graph Clustering",
        "We view the event coreference space as an undirected weighted graph in which the nodes represent all the event mentions in a document and the edge weights indicate the coreference confidence between two event mentions.",
        "In real implementation, we initially construct different graphs for separate event types, such that, in each graph, all the event mentions have the same event type.",
        "Similar to (Nicolae and Nicolae, 2006), we formally define a framework for event coreference resolution.",
        "Let EM = {emm :1 <m<M) be M event mentions in the document and EV = {evn :1 <n <N} be N events.",
        "Let /: EM -> EV be the function mapping from an event mention emm EEM to an event evn e£V.",
        "Let coref: EM x EM -> [0,1] be the function that computes the coreference confidence between two event mentions errii, enij 6 EM.",
        "Let T = {tk :1 <k <K} be K event types.",
        "Thus for each event type k, we have a graph Gk (Yk, Ek ), where Vk = {emm\\f(emm ).type = tk, emm 6 EM} and Ek = {(em;, em,-, coref (enii, emj '))\\emi, emj EEM).",
        "We then model event coreference resolution as a spectral graph clustering problem that optimizes the normalized-cut criterion (Shi and Malik, 2000).",
        "Such optimization can be achieved by computing the second generalized eigenvector, thus the name \"spectral\".",
        "In this paper, we do not try to propose a new spectral clustering algorithm or improve the existing algorithm.",
        "Instead, we focus on how to compute the coreference matrix (equivalently, the affinity matrix in Shi and Malik's algorithm) because a better estimation of coreference matrix can reduce the burden on clustering algorithm."
      ]
    },
    {
      "heading": "3. Coreference Matrix W",
      "text": [
        "Obviously, the trigger pair and the argument sets owned by two event mentions carry much information about whether one event mention corefers with the other.",
        "Based on a corpus, we compute the statistics about event mention pairs (with the same event type) listed in Table 4.",
        "Let emi.",
        "trigger be the trigger in emf , stem(emi.",
        "trigger) be the stem of the trigger in emi, wordnet(emi.",
        "trigger, emj.",
        "trigger) be the semantic similarity between the two triggers in eniiand erry as computed in (Seco et al., 2004), emi.",
        "arg be the argument (ID and ROLE) set in errii.",
        "Let D1 be the conjunction operator on argument pairs whose ID and ROLE match, V\\2be the conjunction operator on argument pairs whose ID matches but ROLE does not match, H 3 be the conjunction operator on argument pairs whose ROLE matches but ID does not match, H4be the conjunction operator on argument pairs whose ID and ROLE do not match.",
        "We then propose the following formula to measure the core-ference value between em; and em,-.",
        "' We view the 33 ACE event subtypes as event types",
        "if emi.",
        "trigger = em}.",
        "trigger else if stem ( emi.",
        "trigger) = stem(em}.",
        "trigger) elseif wordnet(emi.",
        "trigger,emj.",
        "trigger)> 0 otherwise emi.argn1 emj.arg emi.argn3 emm.arg |emi.argn2 emj.arg|4 |emi.argn4 emm.argl]",
        "The strength of this formula is that it allows to give credit to different cases of trigger matching and argument pair matching between two event mentions.",
        "We train a maximum entropy model to produce the confidence values for W. Each confidence value tells the probability that there exists corefe-rence C between event mention em; and em,-.",
        "where gk(emi, emp C) is a feature and is its weight; Z{emi, em, ) is the normalizing factor.",
        "The feature sets applied in the model are listed in Table 5 by categories."
      ]
    },
    {
      "heading": "4. Experiments and Results",
      "text": [
        "We developed and tested the spectral clustering algorithm for event coreference resolution using the ACE 2005 English corpus which contains 560 documents.",
        "We used the ground truth event mentions and evaluated our algorithm based on ECM F-Measure (Luo, 2005).",
        "We reserved 60 documents for testing purpose and used the left 500 documents for training/developing purpose and for computing the statistics discussed above.",
        "We applied 10-fold cross-validation in the experiment of comparing two methods for computing coreference matrix.",
        "The results of the statistics discussed in Section 3.1 are presented in Table 6.",
        "From Table 6, we observe that if two event mentions use the same trigger or if they have arguments whose ID and ROLE match, it is more probable for them to corefer with each other than other cases.",
        "4.3 Comparison of the Two Methods for Computing Coreference Matrix",
        "CUT THRESHOLD",
        "T11",
        "in those coreferring event mention pairs, how many pairs use exactly the same triggers",
        "T12",
        "in those non-coreferring event mention pairs, how many pairs use exactly the same triggers",
        "T21",
        "in those coreferring event mention pairs, how many pairs do not have the same triggers, but have the same stems of triggers",
        "T22 1 non-coreferring version of T21",
        "T31",
        "in those coreferring event mention pairs, how many pairs do not have the same triggers nor the same stems, but the semantic similarity between two triggers is higher than 0 in WordNet.",
        "T32",
        "non-coreferring version of T31",
        "T41",
        "in those non-coreferring event mention pairs, how many pairs are not in T11 or T21 or T31",
        "T42",
        "non- coreferring version that is not T12 or T22 or T32",
        "A11",
        "in those coreferring event mention pairs, how many argument pairs whose ID and ROLE match",
        "A12",
        "non-coreferring version of A11",
        "A21",
        "in those coreferring event mention pairs, how many argument pairs whose ID matches but ROLE does not match",
        "A22 1 non-coreferring version of A21",
        "A31",
        "in those coreferring event mention pairs, how many argument pairs whose ROLE matches but ID does not match",
        "A32 1 non-coreferring version of A31",
        "A41",
        "in those non-coreferring event mention pairs, how many argument pairs whose ID and ROLE do not match",
        "A42 1 non-coreferring version of A41",
        "Figure 1 shows the ECM-F scores for both methods by varying the cut threshold in the clustering algorithm.",
        "Both methods obtain the highest ECM-F score at threshold 0.85 and method 1 performs slightly better than method 2 (0.8449 vs. 0.8418, significant at 85% confidence level, p<=0.1447).",
        "We obtained the ECM-F scores of 0.8363 and 0.8312 on the test set for method 1 and method 2 respectively.",
        "We also obtained two baseline ECM-F scores, one is 0.535 if we consider all the event mentions with the same event type as a cluster, the other is 0.7635 if we consider each event mention as a cluster."
      ]
    },
    {
      "heading": "5. Related Work",
      "text": [
        "Earlier work on event coreference (e.g. Humphreys et al., 1997; Bagga and Baldwin, 1999) in MUC was limited to several scenarios, e.g., terrorist attacks, management succession, resignation.",
        "The ACE program takes a further step towards processing more fine-grained events.",
        "To the best of our knowledge, this paper is the first effort to apply graph-based algorithm to the problem of event coreference resolution.",
        "Nicolae and Nicolae (2006) proposed a similar graph-based framework for entity coreference resolution.",
        "However, in our task, the event mention has much richer structure than the entity mention, thus, it is possible for us to harness the useful information from both the triggers and the attached arguments in the event mentions."
      ]
    },
    {
      "heading": "6. Conclusions and Future Work",
      "text": [
        "In this paper, we addressed the problem of event coreference resolution in a graph-based framework, and presented two methods for computing the coreference matrix.",
        "A practical event corefe-rence resolver also depends on high-performance event extractor.",
        "We will further study the impact of system generated event mentions on the performance of our coreference resolver."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This material is based upon work supported by the Defense Advanced Research Projects Agency under Contract No.",
        "HR0011-06-C-0023 via 27001022, and the CUNY Research Enhancement Program and GRTI Program.",
        "Category",
        "Features",
        "Remarks (EM1: the first event mention, EM2: the second event mention)",
        "Lexicon",
        "typesubtype",
        "pair of event type and subtype in EM1",
        "trigger_pair",
        "trigger pair of EM1 and EM2",
        "pos_pair",
        "part-of-speech pair of triggers of EM1 and EM2",
        "nominal",
        "1 if the trigger of EM2 is nominal",
        "exact match",
        "1 if the spellings of triggers in EM1 and EM2 exactly match",
        "stem match",
        "1 if the stems of triggers in EM1 and EM2 match",
        "triggersim",
        "quantized semantic similarity score (0-5) using WordNet resource",
        "Distance",
        "token dist",
        "how many tokens between triggers of EM1 and EM2 (quantized)",
        "sentence dist",
        "how many sentences EM1 and EM2 are apart (quantized)",
        "event dist",
        "how many event mentions in between EM1 and EM2 (quantized)",
        "Arguments",
        "overlap_num,overlap_roles",
        "overlap number of arguments and their roles (role and id exactly match) between EM1 and EM2",
        "prior num, prior roles",
        "the number and the roles of arguments that only appear in EM1",
        "act num, act roles",
        "the number and the roles of arguments that only appear in EM2",
        "corefnum",
        "the number of arguments that corefer each other but have different roles between EM1 and EM2"
      ]
    }
  ]
}
