{
  "info": {
    "authors": [
      "Shoushan Li",
      "Rui Xia",
      "Chengqing Zong",
      "Chu-Ren Huang"
    ],
    "book": "ACL-IJCNLP",
    "id": "acl-P09-1078",
    "title": "A Framework of Feature Selection Methods for Text Categorization",
    "url": "https://aclweb.org/anthology/P09-1078",
    "year": 2009
  },
  "references": [
    "acl-P04-1035",
    "acl-P06-2079",
    "acl-P07-1056",
    "acl-W02-1011",
    "acl-W06-1652"
  ],
  "sections": [
    {
      "text": [
        "Shoushan Li Rui Xia Chengqing Zong Chu-Ren Huang",
        "The Hong Kong Polytechnic University",
        "National Laboratory of Pattern Recognition Institute of Automation Chinese Academy of Sciences {rxia,cqzong}@nlpr.ia.ac.cn",
        "In text categorization, feature selection (FS) is a strategy that aims at making text classifiers more efficient and accurate.",
        "However, when dealing with a new task, it is still difficult to quickly select a suitable one from various FS methods provided by many previous studies.",
        "In this paper, we propose a theoretic framework of FS methods based on two basic measurements: frequency measurement and ratio measurement.",
        "Then six popular FS methods are in detail discussed under this framework.",
        "Moreover, with the guidance of our theoretical analysis, we propose a novel method called weighed frequency and odds (WFO) that combines the two measurements with trained weights.",
        "The experimental results on data sets from both topic-based and sentiment classification tasks show that this new method is robust across different tasks and numbers of selected features."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "With the rapid growth of online information, text classification, the task of assigning text documents to one or more predefined categories, has become one of the key tools for automatically handling and organizing text information.",
        "The problems of text classification normally involve the difficulty of extremely high dimensional feature space which sometimes makes learning algorithms intractable.",
        "A standard procedure to reduce the feature dimensionality is called feature selection (FS).",
        "Various FS methods, such as document frequency (DF), information gain (IG), mutual information (MI), X test (CHI), Bi-Normal",
        "Separation (BNS), and weighted log-likelihood ratio (WLLR), have been proposed for the tasks (Yang and Pedersen, 1997; Nigam et al., 2000; Forman, 2003) and make text classification more efficient and accurate.",
        "However, comparing these FS methods appears to be difficult because they are usually based on different theories or measurements.",
        "For example, MI and IG are based on information theory, while CHI is mainly based on the measurements of statistic independence.",
        "Previous comparisons of these methods have mainly depended on empirical studies that are heavily affected by the experimental sets.",
        "As a result, conclusions from those studies are sometimes inconsistent.",
        "In order to better understand the relationship between these methods, building a general theoretical framework provides a fascinating perspective.",
        "Furthermore, in real applications, selecting an appropriate FS method remains hard for a new task because too many FS methods are available due to the long history of FS studies.",
        "For example, merely in an early survey paper (Sebastiani, 2002), eight methods are mentioned.",
        "These methods are provided by previous work for dealing with different text classification tasks but none of them is shown to be robust across different classification applications.",
        "In this paper, we propose a framework with two basic measurements for theoretical comparison of six FS methods which are widely used in text classification.",
        "Moreover, a novel method is set forth that combines the two measurements and tunes their influences considering different application domains and numbers of selected features.",
        "The remainder of this paper is organized as follows.",
        "Section 2 introduces the related work on feature selection for text classification.",
        "Section 3 theoretically analyzes six FS methods and proposes a new FS approach.",
        "Experimental results are presented and analyzed in Section 4.",
        "Finally, Section 5 draws our conclusions and outlines the future work."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "FS is a basic problem in pattern recognition and has been a fertile field of research and development since the 1970s.",
        "It has been proven to be effective on removing irrelevant and redundant features, increasing efficiency in learning tasks, and improving learning performance.",
        "FS methods fall into two broad categories, the filter model and the wrapper model (John et al., 1994).",
        "The wrapper model requires one predetermined learning algorithm in feature selection and uses its performance to evaluate and determine which features are selected.",
        "And the filter model relies on general characteristics of the training data to select some features without involving any specific learning algorithm.",
        "There is evidence that wrapper methods often perform better on small scale problems (John et al., 1994), but on large scale problems, such as text classification, wrapper methods are shown to be impractical because of its high computational cost.",
        "Therefore, in text classification, filter methods using feature scoring metrics are popularly used.",
        "Below we review some recent studies of feature selection on both topic-based and sentiment classification.",
        "In the past decade, FS studies mainly focus on topic-based classification where the classification categories are related to the subject content, e.g., sport or education.",
        "Yang and Pedersen (1997) investigate five FS metrics and report that good FS methods improve the categorization accuracy with an aggressive feature removal using DF, IG, and CHI.",
        "More recently, Forman (2003) empirically compares twelve FS methods on 229 text classification problem instances and proposes a new method called 'Bi-Normal Separation' (BNS).",
        "Their experimental results show that BNS can perform very well in the evaluation metrics of recall rate and F-measure.",
        "But for the metric of precision, it often loses to IG.",
        "Besides these two comparison studies, many others contribute to this topic (Yang and Liu, 1999; Brank et al., 2002; Gabrilovich and Markovitch, 2004) and more and more new FS methods are generated, such as, Gini index (Shang et al., 2007), Distance to Transition Point (DTP) (Moyotl-Hernandez and Jimenez-Salazar, 2005), Strong Class Information Words (SCIW) (Li and Zong, 2005) and parameter tuning based FS for Rocchio classifier (Moschitti, 2003).",
        "Recently, sentiment classification has become popular because of its wide applications (Pang et al., 2002).",
        "Its criterion of classification is the attitude expressed in the text (e.g., recommended or not recommended, positive or negative) rather than some facts (e.g., sport or education).",
        "To our best knowledge, yet no related work has focused on comparison studies of FS methods on this special task.",
        "There are only some scattered reports in their experimental studies.",
        "Riloff et al.",
        "(2006) report that the traditional FS method (only using IG method) performs worse than the baseline in some cases.",
        "However, Cui et al.",
        "(2006) present the experiments on the sentiment classification for large-scale online product reviews to show that using the FS method of CHI does not degrade the performance but can significantly reduce the dimension of the feature vector.",
        "Moreover, Ng et al.",
        "(2006) examine the FS of the weighted log-likelihood ratio (WLLR) on the movie review dataset and achieves an accuracy of 87.1%, which is higher than the result reported by Pang and Lee (2004) with the same dataset.",
        "From the analysis above, we believe that the performance of the sentiment classification system is also dramatically affected by FS."
      ]
    },
    {
      "heading": "3. Our Framework",
      "text": [
        "In the selection process, each feature (term, or single word) is assigned with a score according to a score-computing function.",
        "Then those with higher scores are selected.",
        "These mathematical definitions of the score-computing functions are often defined by some probabilities which are estimated by some statistic information in the documents across different categories.",
        "For the convenience of description, we give some notations of these probabilities below.",
        "P(t): the probability that a document x contains term t;",
        "P(ci ) : the probability that a document x does not belong to category ci ;",
        "P(t, ci): the joint probability that a document x contains term t and also belongs to category ci ;",
        "P(ci | t) : the probability that a document x belongs to category ci under the condition that it contains term t.",
        "P(t I ci): the probability that, a document x does not contain term t with the condition that x belongs to category ct;",
        "Some other probabilities, such as P(t), P(ci),",
        "P(t I c), P(t I ~ct), P(c 11), and P(c~ 11), are similarly defined.",
        "In order to estimate these probabilities, statistical information from the training data is needed, and notations about the training data are given as follows:",
        "{ci }m=1: the set of categories;",
        "Ai: the number of the documents that contain the term t and also belong to category ci ;",
        "Bi: the number of the documents that contain the term t but do not belong to category ci ;",
        "N: the total number of the documents that belong to category ci ;",
        "Nall: the total number of all documents from the training data.",
        "C : the number of the documents that do not contain the term t but belong to category ci , i.e.,",
        "Di : the number of the documents that neither contain the term t nor belong to category ci , i.e., Nau - N - Bt;",
        "In this section, we would analyze theoretically six popular methods, namely DF, MI, IG, CHI, BNS, and WLLR.",
        "Although these six FS methods are defined differently with different scoring measurements, we believe that they are strongly related.",
        "In order to connect them, we define two basic measurements which are discussed as follows.",
        "The first measurement is to compute the document frequency in one category, i.e., Ai.",
        "The second measurement is the ratio between the document frequencies in one category and the other categories, i.e., Ai / Bi.",
        "The terms with a high ratio are often referred to as the terms with high category information.",
        "These two measurements form the basis for all the measurements that are used by the FS methods throughout this paper.",
        "In particular, we show that DF and MI are using the first and second measurement respectively.",
        "Other complicated FS methods are combinations of these two measurements.",
        "Thus, we regard the two measurements as basic, which are referred to as the frequency measurement and ratio measurement.",
        "DF is the number of documents in which a term occurs.",
        "It is defined as",
        "DF = I m=i( Ai) The terms with low or high document frequency are often referred to as rare or common terms, respectively.",
        "It is easy to see that this FS method is based on the first basic measurement.",
        "It assumes that the terms with higher document frequency are more informative for classification.",
        "But sometimes this assumption does not make any sense, for example, the stop words (e.g., the, a, an) hold very high DF scores, but they seldom contribute to classification.",
        "In general, this simple method performs very well in some topic-based classification tasks (Yang and Pedersen, 1997).",
        "The mutual information between term t and class ci is defined as",
        "And it is estimated as",
        "Let us consider the following formula (using Bayes theorem)",
        "Therefore,",
        "A / Bi Nall",
        "From this formula, we can see that the MI score is based on the second basic measurement.",
        "This method assumes that the term with higher category ratio is more effective for classification.",
        "It is reported that this method is biased towards low frequency terms and the bias becomes extreme when P(t ) is near zero.",
        "It can be seen in the following formula (Yang and Pedersen, 1997)",
        "Therefore, this method might perform badly when common terms are informative for classification.",
        "Taking into account mutual information of all categories, two types of MI score are commonly used: the maximum score Imax (t) and the average score Iavg (t), i.e.,",
        "We choose the maximum score since it performs better than the average score (Yang and Pedersen, 1997).",
        "It is worth noting that the same choice is made for other methods, including CHI, BNS, and WLLR in this paper.",
        "IG measures the number of bits of information obtained for category prediction by recognizing the presence or absence of a term in a document (Yang and Pedersen, 1997).",
        "The function is",
        "And it is estimated as _N",
        "From the definition, we know that the information gain is the weighted average of the mutual information I (t, ct ) and I (t, ct ) where the weights are the joint probabilities P(t, ct ) and",
        "Since P(t, ct ) is closely related to the document frequency Ai and the mutual information I(t, ci ) is shown to be based on the second measurement, we can say that the IG score is influenced by the two basic measurements.",
        "3.4 z Statistic (CHI)",
        "The CHI measurement (Yang and Pedersen, 1997) is defined as",
        "(A + Ct) • (Bt + Dt) • (At + Bt) • (Ci + Dt) In order to get the relationship between CHI and the two measurements, the above formula is rewritten as follows",
        "From the above formula, we see that the CHI score is related to both the frequency measurement Ai and ratio measurement Ai / Bi .",
        "Also, when keeping the same ratio value, the terms with higher document frequencies will yield higher CHI scores.",
        "BNS method is originally proposed by Forman (2003) and it is defined as",
        "It is calculated using the following formula where F(x) is the cumulative probability function of standard normal distribution.",
        "For simplicity, we assume that there are two categories and the numbers of the training documents in the two categories are the same, i.e., Nall = 2Nt and we also assume that A > Bt.",
        "It should be noted that this assumption is only to allow easier analysis but will not be applied in our experiment implementation.",
        "In addition, we only consider the case when A / N ^ 0.5 .",
        "In fact, most terms take the document frequency Ai which is less than half of Ni .",
        "Under these conditions, the BNS score can be shown in Figure 1 where the area of the shadow part represents (A / Nt - Bt / Nt) and the length of the projection to the x axis represents the BNS score.",
        "Nt • (NaU - N) • (At + Bt) • [- (At + Bt)] For simplicity, we assume that there are two categories and the numbers of the training documents in the two categories are the same (Nall = 2Nf).",
        "The CHI score then can be written",
        "And it is estimated as",
        "From Figure 1, we can easily draw the two following conclusions:",
        "1) Given the same value of Ai , the BNS score increases with the increase of Ai - Bi .",
        "2) Given the same value of Ai - Bi , BNS score increase with the decrease of Ai .",
        "Figure 1.",
        "View of BNS using the normal probability distribution.",
        "Both the left and right graphs have shadowed areas of the same size.",
        "And the value of Ai - Bi can be rewritten as the following",
        "The above analysis gives the following conclusions regarding the relationship between BNS and the two basic measurements:",
        "1) Given the same Ai, the BNS score increases with the increase of Ai / Bt.",
        "2) Given the same Ai / Bt, when Ai increases, A - Bt also increase.",
        "It seems that the BNS score does not show a clear relationship with",
        "a.",
        "In summary, the BNS FS method is biased towards the terms with the high category ratio but cannot be said to be sensitive to document frequency.",
        "WLLR = A log A(Na\"-Ni)",
        "The formula shows WLLR is proportional to the frequency measurement and the logarithm of the ratio measurement.",
        "Clearly, WLLR is biased towards the terms with both high category ratio and high document frequency and the frequency measurement seems to take a more important place than the ratio measurement.",
        "So far in this section, we have shown that the two basic measurements constitute the six FS methods.",
        "The class prior probabilities, P(ci), i =1,2,...,m , are also related to the selection methods except for the two basic measurements.",
        "Since they are often estimated according to the distribution of the documents in the training data and are identical for all the terms in a class, we ignore the discussion of their influence on the selection measurements.",
        "In the experiment, we consider the case when training data have equal class prior probabilities.",
        "When training data are unbalanced, we need to change the forms of the two basic measurements to A /N.",
        "and A • (Nan -N)/(B • N).",
        "Because some methods are expressed in complex forms, it is difficult to explain their relationship with the two basic measurements, for example, which one prefers the category ratio most.",
        "Instead, we will give the preference analysis in the experiment by analyzing the features in real applications.",
        "But the following two conclusions are drawn without doubt according to the theoretical analysis given above.",
        "1) Good features are features with high document frequency;",
        "2) Good features are features with high category ratio.",
        "These two conclusions are consistent with the original intuition.",
        "However, using any single one does not provide competence in selecting the best set of features.",
        "For example, stop words, such as 'a', 'the' and 'as', have very high document frequency but are useless for the classification.",
        "In real applications, we need to mix these two measurements to select good features.",
        "Because of different distribution of features in different domains, the importance of each measurement may differ a lot in different applications.",
        "Moreover, even in a given domain, when different numbers of features are to be selected, different combinations of the two measurements are required to provide the best performance.",
        "Although a great number of FS methods is available, none of them can appropriately change the preference of the two measurements.",
        "A better way is to tune the importance according to the application rather than to use a predetermined combination.",
        "Therefore, we propose a new FS method called Weighed Frequency and Odds (WFO), which is defined as where A is the parameter for tuning the weight between frequency and odds.",
        "The value of A varies from 0 to 1.",
        "By assigning different value to A we can adjust the preference of each measurement.",
        "Specially, when A= 0 , the algorithm prefers the category ratio that is equivalent to the MI method; when A = 1, the algorithm is similar to DF; when A = 0.5, the algorithm is exactly the WLLR method.",
        "In real applications, a suitable parameter A needs to be learned by using training data."
      ]
    },
    {
      "heading": "4. Experimental Studies",
      "text": [
        "Data Set: The experiments are carried out on both topic-based and sentiment text classification datasets.",
        "In topic-based text classification, we use two popular data sets: one subset of Reuters-21578 referred to as R2 and the 20 Newsgroup dataset referred to as 20NG.",
        "In detail, R2 consist of about 2,000 2-category documents from standard corpus of Reuters-21578.",
        "And 20NG is a collection of approximately 20,000 20-category documents .",
        "In sentiment text classification, we also use two data sets: one is the widely used Cornell movie-review dataset(Pang and Lee, 2004) and one dataset from product reviews of domain DVD (Blitzer et al., 2007).",
        "Both of them are 2-category tasks and each consists of 2,000 reviews.",
        "In our experiments, the document numbers of all data sets are (nearly) equally distributed cross all categories.",
        "Classification Algorithm: Many classification algorithms are available for text classification, such as Naïve Bayes, Maximum Entropy, k-NN, and SVM.",
        "Among these methods, SVM is shown to perform better than other methods (Yang and Pedersen, 1997; Pang et al., 2002).",
        "Hence we apply SVM algorithm with the help of the LIBSVM tool.",
        "Almost all parameters are set to their default values except the kernel function which is changed from a polynomial kernel function to a linear one because the linear one usually performs better for text classification tasks.",
        "Experiment Implementation: In the experiments, each dataset is randomly and evenly split into two subsets: 90% documents as the training data and the remaining 10% as testing data.",
        "The training data are used for training SVM classifiers, learning parameters in WFO method and selecting \"good\" features for each FS method.",
        "The features are single words with a bool weight (0 or 1), representing the presence or absence of a feature.",
        "In addition to the \"principled\" FS methods, terms occurring in less than three documents ( DF < 3 ) in the training set are removed.",
        "4.2 Relationship between FS Methods and the Two Basic Measurements",
        "To help understand the relationship between FS methods and the two basic measurements, the empirical study is presented as follows.",
        "Since the methods of DF and MI only utilize the document frequency and category information respectively, we use the DF scores and MI scores to represent the information of the two basic measurements.",
        "Thus we would select the top-2% terms with each method and then investigate the distribution of their DF and MI scores.",
        "First of all, for clear comparison, we normalize the scores coming from all the methods using Min-Max normalization method which is designed to map a score s to s' in the range [0, 1] by computing where Min and Max denote the minimum and maximum values respectively in all terms' scores using one FS method.",
        "Table 1 shows the mean values of all top-2% terms' MI scores and DF scores of all the six FS methods in each domain.",
        "From this table, we can apparently see the relationship between each method and the two basic measurements.",
        "For instance, BNS most distinctly prefers the terms with high MI scores and low DF scores.",
        "According to the degree of this preference, we can rank these six methods as MI, BNS f IG, CHI, WLLR f DF, where x f y means method x prefers the terms with higher MI scores (higher category information) and lower DF scores (lower document frequency) than method y.",
        "This empirical discovery is in agreement with the finding that WLLR is biased towards the high frequency terms and also with the finding that BNS is biased towards high category information (cf.",
        "Section 3 theoretical analysis).",
        "Also, we can find that CHI and IG share a similar preference of these two measurements in 2-category domains, i.e., R2, movie, and DVD.",
        "This gives a good explanation that CHI and IG are two similar-performed methods for 2-category tasks, which have been found by Forman (2003) in their experimental studies.",
        "According to the preference, we roughly cluster FS methods into three groups.",
        "The first group includes the methods which dramatically prefer the category information, e.g., MI and BNS; the second one includes those which prefer both kinds of information, e.g., CHI, IG, and WLLR; and the third one includes those which strongly prefer frequency information, e.g., DF.",
        "It is worth noting that learning parameters in WFO is very important for its good performance.",
        "We use 9-fold cross validation to help learning the parameter X so as to avoid over-fitting.",
        "Specifically, we run nine times by using every 8 fold documents as a new training data set and the remaining one fold documents as a development data set.",
        "In each running with one fixed feature number m, we get the best Xi m-best (i=1,..., 9) value through varying Xi,m from 0 to 1 with the step of 0.1 to get the best performance in the development data set.",
        "The average value Xm-best, i.e., is used for further testing.",
        "Figure 2 shows the experimental results when using all FS methods with different selected feature numbers.",
        "The red line with star tags represents the results of WFO.",
        "At the first glance, in R2 domain, the differences of performances across all are very noisy when the feature number is larger than 1,000, which makes the comparison meaningless.",
        "We think that this is because the performances themselves in this task are very high (nearly 98%) and the differences between two FS methods cannot be very large (less than one percent).",
        "Even this, WFO method do never get the worst performance and can also achieve the top performance in about half times, e.g., when feature numbers are 20, 50, 100, 500, 3000.",
        "Let us pay more attention to the other three domains and discuss the results in the following two cases.",
        "In the first case when the feature number is low (about less than 1,000), the FS methods in the second group including IG, CHI, WLLR, always perform better than those in the other two groups.",
        "WFO can also perform well because its parameters Xm-best are successfully learned to be around 0.5, which makes it consistently belong to the second group.",
        "Take 500 feature number for instance, the parameters X500-best are 0.42, 0.50, and 0.34 in these three domains respectively.",
        "In the second case when the feature number is large, among the six traditional methods, MI and BNS take the leads in the domains of 20NG and Movie while IG and CHI seem to be better and more stable than others in the domain of DVD.",
        "As for WFO, its performances are excellent cross all these three domains and different feature numbers.",
        "In each domain, it performs similarly as or better than the top methods due to its well-learned parameters.",
        "For example, in 20NG, the parameters Xm-best are 0.28, 0.20, 0.08, and 0.01 when feature numbers are 10,000, 15,000, (WFO equals MI when X = 0) while MI is the top one in this domain.",
        "FS",
        "Domain |",
        "Methods",
        "20NG",
        "R2",
        "| Movie",
        "DVD |",
        "DF score",
        "MI score",
        "DF score",
        "MI score",
        "DF score",
        "MI score",
        "DF score",
        "MI score",
        "MI",
        "0.004",
        "0.870",
        "0.047",
        "0.959",
        "0.003",
        "0.888",
        "0.004",
        "0.881",
        "BNS",
        "0.005",
        "0.864",
        "0.117",
        "0.922",
        "0.008",
        "0.881",
        "0.006",
        "0.880",
        "CHI",
        "0.015",
        "0.814",
        "0.211",
        "0.748",
        "0.092",
        "0.572",
        "0.055",
        "0.676",
        "IG",
        "0.087",
        "0.525",
        "0.209",
        "0.792",
        "0.095",
        "0.559",
        "0.066",
        "0.669",
        "WLLR",
        "0.026",
        "0.764",
        "0.206",
        "0.805",
        "0.168",
        "0.414",
        "0.127",
        "0.481",
        "DF",
        "0.122",
        "0.252",
        "0.268",
        "0.562",
        "0.419",
        "0.09",
        "0.321",
        "0.111",
        "Movie domain, using only 500-4000 features is as good as using all 15176 features).",
        "Figure 2.",
        "The classification accuracies of the four domains using seven different FS methods while increasing the number of selected features.",
        "From Figure 2, we can also find that FS does help sentiment classification.",
        "At least, it can dramatically decrease the feature numbers without losing classification accuracies (see",
        "Conclusion and Future Work",
        "In this paper, we propose a framework with two basic measurements and use it to theoretically analyze six FS methods.",
        "The differences among them mainly lie in how they use these two measurements.",
        "Moreover, with the guidance of the analysis, a novel method called WFO is proposed, which combine these two measurements with trained weights.",
        "The experimental results show that our framework helps us to better understand and compare different FS methods.",
        "Furthermore, the novel method WFO generated from the framework, can perform robustly across different domains and feature numbers.",
        "In our study, we use four data sets to test our new method.",
        "There are much more data sets on text categorization which can be used.",
        "In additional, we only focus on using balanced samples in each category to do the experiments.",
        "It is also necessary to compare the FS methods on some unbalanced data sets, which are common in real-life applications (Forman, 2003; Mladeni and Marko, 1999).",
        "These matters will be dealt with in the future work."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The research work described in this paper has been partially supported by Start-up Grant for Newly Appointed Professors, No.",
        "1-BBZM in the Hong Kong Polytechnic University."
      ]
    }
  ]
}
