{
  "info": {
    "authors": [
      "Hannes Rieser",
      "Massimo Poesio"
    ],
    "book": "Proceedings of the SIGDIAL 2009 Conference",
    "id": "acl-W09-3912",
    "title": "Interactive Gesture in Dialogue: a PTT Model",
    "url": "https://aclweb.org/anthology/W09-3912",
    "year": 2009
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Gestures are usually looked at in isolation or from an intra-propositional perspective essentially tied to one speaker.",
        "The Bielefeld multi-modal Speech-And-Gesture-Alignment (SAGA) corpus has many interactive gestures relevant for the structure of dialogue (Rieser 2008, 2009).",
        "To describe them, a dialogue theory is needed which can serve as a speech-gesture interface.",
        "PTT (Poesio and Traum 1997, Poesio and Rieser submitted a) can do this job in principle, how this can be achieved is the main topic of this paper.",
        "As a precondition, the empirical research procedure from systematic corpus annotation via gesture typology to a partial ontology for gestures is described.",
        "It is then explained how PTT is extended to provide an incremental modelling of speech plus gesture in an assertion-acknowledgement adjacency pair where grounding between dialogue participants is obtained through gesture."
      ]
    },
    {
      "heading": "1. Introduction and Overview",
      "text": [
        "We present work combining experimental methods, body-movement tracking techniques, corpus linguistics and theoretical modelling in order to investigate the role of iconic gesture in dialogue.",
        "We propose to map speech meaning and gesture meaning into a single compositional meaning which is then used in grounding and updating of information states in discourse, using PTT (Poesio & Traum 1997, Poesio & Rieser submitted 2009a) to account for the speech-gesture interface.",
        "We argue that several design features of PTT are es-",
        "Proceedings of SIGDIAL 2009: the 10th Annual Meeting of the i Queen Mary University of London, September 2009",
        "sential for this purpose, such as accepting sub-propositional inputs, extracting information from linguistic surface, using dynamic semantics, basing the dialogue engine on a theory of grounded-ness and grounding, and allowing for the resolution of anaphora across turns.",
        "The structure of the paper is as follows.",
        "Section 2 looks at the Bielefeld Speech-and-Gesture-Alignment corpus SAGA from which the data comes.",
        "Section 3 then deals with multi-modal acts using one example from SAGA (Dial 1 p.??).",
        "In section 4 a short introduction into PTT is provided.",
        "Sections 5 and 6 explain how a gesture typology and a partial ontology can be extracted from the annotated data.",
        "Both (see Appendix) serve as the basis for the integration of gesture meaning and verbal meaning.",
        "In section 7 PTT is developed as an interface for verbal and gestural meaning.",
        "First a PTT description of Dial 1 is provided using (Poesio and Rieser submitted b, Poesio to appear) dealing inter alia with anaphora resolution (7.1).",
        "Secondly, PTTs interface properties are detailed (7.2), the semantic defaults for combining speech and gesture meaning are set up (7.3), and a gestural dialogue act is described (7.4).",
        "Section 8 contains some preliminary insights into the grounding of multi-modal content."
      ]
    },
    {
      "heading": "2. The Multi-modal SAGA Corpus",
      "text": [
        "The SAGA corpus contains 25 route-description dialogues taken from three camera perspectives using body tracking technologies.",
        "The setting comes with a Router \"riding on a car\" through a virtual landscape passing five landmarks.",
        "The landmarks are connected by streets.",
        "Fig.",
        "1a in Appendix B shows the Router, Fig. 1b the site, Fig.",
        "pecial Interest Group in Discourse and Dialogue, pages 87-96, ©2009 Association for Computational Linguistics",
        "lc the town hall.",
        "After the ride the Router reports his trip in detail to a Follower.",
        "We collected audio and body movement data as well as eye-tracking data from the Router.",
        "The dialogues have all been annotated, use of functional predicates like INDEXING, MODELLING, SHAPING etc.",
        "was rated."
      ]
    },
    {
      "heading": "3. An Example from the SAGA corpus",
      "text": [
        "In the dialogue passage (Dial l) the Router uses gestures to explain the looks of the town-hall.",
        "We'll focus on the numbered utterances in this paper; utterances omitted in the reconstruction are reported in italics, omitted phrases in brackets.",
        "DIAL l [Router:] [...] und [du] folgst dann dem [... ] and [you] follow then the Straßenverlauf einfach nur bis du ah vor nem street simply until you ah before a größeren Gebäude stehst.",
        "larger building stand.",
        "(2.1) Das ist dann das Rathaus.",
        "That is then the townhall.",
        "(2.2) [Ahm] das ist ein U-förmiges Gebäude.",
        "[Ahm] that is a U-shaped building.",
        "(2.3) Du blickst [praktisch] da rein.",
        "You look [practically] into it.",
        "(2.4) [Das heißt] es hat vorne zwei [That is] it has to the front two Buchtungen und geht hinten bulges and closes in the rear zusammen dann.",
        "then.",
        "[Follower:] OK.",
        "In (Dial 1) Router's gestures first come with",
        "two BEATS.",
        "Shortly after, the BEATs extend into an ICONIC gesture overlapping town hall in (2.1)(stills in Apendix B), cf. the still Two-Handed-Prism-Segment-l. Then the Router's DRAWN U-shaped gesture (still One-Handed-U-Shape) intersects the word U-shaped.",
        "Next his SHAPING the sides of a prism (still Two-Handed-U-Shaped-Prism-Segment) aligns with [look pactically] into it.",
        "The gesture following is two-handed: one hand SHAPES the U's left branch and the other both the U's right branch and its rear bend linking up to the left branch (stills Two-Handed-Prism-Segment-2A and 2B).",
        "The STROKE overlaps with the words and closes in the rear.",
        "The Follower copies the two-handed town hall gesture of the Router in his acknowledgement (still Two-Handed-Prism-Segment-3).",
        "In other words: the Follower's gesture is aligned to the Router's.",
        "Being copies of each other, the semantics of the Router's and the Follower's gesture can enter the common ground (cf. 7.4 and 8).",
        "In the reconstruction we will use the translation with the English word order standardised."
      ]
    },
    {
      "heading": "4. A Short Introduction to PTT",
      "text": [
        "Explanation of dialogue rests on three things: making clear how the succession ofspeakers' contributions emerges, stating what the impact of contributions on speakers' minds is and specifying how information is extracted incrementally from the contributions.",
        "Turning to emerging structure, PTT assumes that participants perform (often fragmentary) contributions, discourse units (DUs), which are dynamic propositions (DRSs in the sense of (Muskens, 1996)).",
        "They contain locu-tionary acts, conversational events/dialogue acts plus their prepositional contents/DRSs.",
        "DUs may be sub-propositional micro-conversational events.",
        "Dialogue acts are either core speech acts or grounding acts.",
        "Core speech acts can be related to the present like assert, towards the past like accept or towards the future like commit.",
        "Grounding acts are acknowledge or repair (Traum 2009).",
        "Putting the distinctions above to work, we obviously can already model adjacency pairs.",
        "For the problems at issue we do not need more, cf. (Dial 1).",
        "Which attitudes are assumed in current PTT and which changes of participants' minds are accounted for?",
        "Agents can have individual and private or common and public intentions.",
        "All sorts of actions, verbal or domain ones, are as a rule intended, at the outset of changes we have individual intentions.",
        "Common intentions are for example needed in order to explain completions and repairs (Poesio and Rieser submitted a).",
        "Most of the cooperation facts investigated in Clark (1996) need common intentions, most prominently, the intention to carry out a communicative task felicitously.",
        "Frequently, the vehicle for these types of intentions are (partial) plans.",
        "Plans can also be individual or shared.",
        "In (Dial 1) for example, the Router has an individual plan how to best map out his ride and the intention to communicate it to the",
        "Follower.",
        "The Follower in turn intends to let the Router control her beliefs.",
        "Both have the collective intention to enable the Follower to follow the Router's route.",
        "Information presupposed or generated is contained in the discourse situation which, in PTT, is just a normal situation with objects and events, i.e., a DRS.",
        "Conversational participants have command over information states.",
        "An information state is updated whenever a new event is perceived, including events such as sub-sentential utterances, and non-verbal events such as gestures or nods.",
        "Hence the possibility is already implemented in PTT to model accumulation of information due to gesture.",
        "Information common to the dialogue participants can be considered as grounded by default.",
        "This assumption connects PTT with other dialogue theories, for example Clark's (cf. Clark and Marshall, 1981, Clark and Schaefer, 1989) and Traum's (Traum 2009).",
        "Acknowledged information is at the heart of the grounding process.",
        "What is grounded is mutually believed ceteris paribus.",
        "Therefore, grounded information is part of the pragmatic machinery driving a dialogue forward (Rieser 2009).",
        "Grounding acts are taken as meta-discoursive devices and not included in discourse units proper.",
        "Besides beliefs and intentions we have obligations as mental attitudes.",
        "In PTT every conversational action induces an obligation on the participant indicated to address that action.",
        "Information states raise the question of how changes of information are brought about on the basic grammatical level, viz. the interpretation of incrementally produced locutionary acts.",
        "The grammar in which syntactic and semantic interpretation is implemented is LTAG (Abeilleé & Ram-bow (eds), 2000).",
        "LTAG is a tree-grammar encoding syntactic projections which do the duty of, say, HPSGs rules, principles and constraints.",
        "Nodes and projecting leaves are decorated with semantic information based on Compositional DRT as developed in (Muskens, 1996, 2001).",
        "A specific trait of PTT is working with semantic non-monotonicity at all compositional levels: PTT hypothesizes that semantic computation is the result of defeasible inferences over DRSs obtained concatenating updates of single contributions.",
        "These default inference rules have the effect of semantic composition rules.",
        "Due to the impact of interpreted LTAG one can say that PTT is well founded in a bottom up fashion.",
        "Especially the default mechanism of PTT is used to make it a workable interface for speech and gesture (cf. 7.2 - 7.4).",
        "5 Setting up the Speech-gesture Interface: Typology and Partial Ontology",
        "As mentioned, this paper is based on the systematic annotation of SAGA carried out over the years 2007-2009 (Rieser 2009).",
        "Like many gesture researchers we assume that the semantic and pragmatic centre of a gesture is its stroke.",
        "The stroke overlaps as a rule with part of a complex constituent, for example the head or the logical subject.",
        "The range of speech-gesture overlap usually marks the functional position where the gestures meaning has to be merged into the speech content.",
        "Technically, the annotation is an ELAN-grid.",
        "From the annotation, a set of gesture types has been factored out in the following way (Rieser 2009).",
        "AGENCY is installed as a root feature dominating the role features ROUTER and FOLLOWER.",
        "Next come the Router's and the Follower's LEFT and RIGHT HAND and BOTH their HANDS.",
        "HANDEDNESS in turn is mapped onto single annotation features like HANDSHAPE, WRISTMOVEMENT, PATHOFWRISTMOVEMENT etc.",
        "Bundles of features make feature CLUSTERs which yield classes of objects like curved, straight etc.",
        "entities.",
        "These build up SHAPES of different di-mensions: ABSTRACT OBJECTs of 0 DIMENSION and LINEs, one-dimensional entities of different curvature.",
        "Among the two dimensional entities are LOCATIONs, RECTANGLEs, CIR CLEs etc.",
        "Then three dimensional sorts come up: CUBOIDSs CYLINDERs, PRISMs and so on.",
        "In the end we get COMPOSITEs of SHAPES, for example a BENT LINE in a SPHERE, and SEQUENCES OF COMPOSITEs.",
        "The central issue of 'How does a gesture acquire meaning'?",
        "is answered in the following way: A gesture type is mapped onto a partial ontology description, a stipulation encoding the content attributed to a gesture by raters.",
        "As a rule, gesture content is underspecified and will be completed to some extent when interfacing with verbal meaning.",
        "As an example of a gesture type and its partial ontology, see e.g. TwoHandedPrismSegmentl and 'Partial Ontolo-gyTwoHandedPrismSegmentl' in Appendix A.",
        "6 Setting up the Speech-gesture Interface: Levels of Interaction",
        "Our starting point is the hypothesis detailed in (Rieser 2008) that a genuine understanding of dialogues like (Dial 1) requires integration of multimodal meaning at different levels of discourse, from fine grained lexical definitions up to rhetorical relations.",
        "In the rest of the paper, we will specify how information from spoken utterances merges with information from gestures, using (Dial 1) as an example.",
        "Omitting the two BEATS on that is [then], we have the following gestures on the Router's side (see stills in Appendix B):",
        "6.1 the PRISM SEGMENT covering the town hall; cf. still Two-Handed-Prism-Segment",
        "6.2 the DRAWN U-shape overlapping the adjective U-shaped; still One-Handed-U-Shape",
        "6.3 the PRISM SEGMENT affiliated to [practically] look into it; still Two-Handed-U-Shaped-Prism-Segment",
        "with and closes in the rear; stills Two-Handed-Prism-Segment-2A and 2B.",
        "The Follower uses a variant of",
        "6.5 the Router's PRISM SEGMENT in (6.4) followed by OK; still Two-Handed-Prism-Segment-3.",
        "The key observation from Rieser (2009) is that gestures interact with verbal contributions at different levels.",
        "(6.1) to (6.4) must be integrated at the level of the semantic interpretation of LTAG.",
        "(6.3) is involved since the stroke covers three constituents in the German wording, the modal adverb [practically], the pronoun it, and the separable prefix da rein/into of the verb blickst/you look.",
        "We will develop a simplified solution here using the \"verb\" look-into.",
        "Similarly, in (6.4) the gesture contains information relevant for closes in the rear, i.e. for the whole VP.",
        "The gesture information has to be integrated into the Router's dialogue acts at the interface points mentioned.",
        "Therefrom several side issues arise, for example the treatment of anaphora across Router's or Follower's contributions.",
        "In (Dial 1) the Follower uses gestural information only to acknowledge.",
        "It is a multimodal example of acknowledging by imitating the",
        "Router's multi-modal acts.",
        "Her gesture and the OK form a kind of \"complex acknowledgement\".",
        "This way the Router's contributions (6.2) to (6.4) and the Follower's contribution (6.5) show the interactive role of gesture, more specifically, gesture content in its use for grounding.",
        "We will briefly comment upon that in section 8.",
        "7 Using PTT as an Interface for Verbal Meaning and Gestural Meaning",
        "According to PTT, the discourse situation after the verbal updates brought about by (Dial l) would be as follows.",
        "(We only represent one aspect of the content of the initial utterances of (Dial l).",
        "):",
        "Kl is [bl | building(bl), large(bl)], u2.l: utter(Router,\"Das ist das Rathaus\"), thl is tnhl, u4: utter(Router, \"es hat vorne zwei Buchtungen und geht hinten zus.",
        "dann\"), rear(re1), s4: has(bu1, re1), rear(re2), s5:has(bu2, re2), s6: meet(re1, re2)], ce2.44: assert(Router, Follower, K9), generate(u2.4, ce2.4)].",
        "The model of anaphora resolution accounting for the anaphoric cases is developed in (Poesio and Rieser, submitted 2009 b).",
        "The anaphoric Das/this in DU1 depends on the discourse entity a larger building introduced at the beginning of the conversation in DRS K1: K1 is the resource situation for the anaphoric definite.",
        "The second das/this still depends on the same resource situation.",
        "The pronouns, however, behave differently: Pronoun da/there in DU3 takes up the antecedent a U-shaped building, whereas the es/it in DU4 in turn refers to the it in DU3.",
        "Observe that the verbal part of (Dial 1) alone would already specify the interpretation completely: nothing essential is missing.",
        "As it will become clear below, what gestures do in this example is to add details to the verbally determined models and restrict the model set.",
        "What we have got so far is a PTT-representation of the verbal part of (Dial 1).",
        "We now move on to how the information coming from the Router's gestures gets integrated with the verbal information - in particular, how this integration can take place below the sentential level.",
        "Our account builds on two key ideas from PTT.",
        "First of all, gestures are part of the discourse situation - i.e., the occurrence of gestures is recorded in the information state's representation of the discourse situation.",
        "Second, every occurrence of a sentence constituent counts as a conversational event - a",
        "MICRO CONVERSATIONAL EVENT (MCE).",
        "With these assumptions in place, the interaction of speech meaning and gesture meaning - how the two types of meanings combine to specify the overall meaning of a contribution - can be specified using the same mechanisms that specify the meaning of MCEs: i.e., with (prioritized) defaults in the sense of (Reiter, 1980, Brewka 1989).",
        "One example of a default specifying semantic composition is the BINARY SEMANTIC COMPOSITION (BSC) developed in (Poesio to appear, Poesio and Rieser submitted a) to specify the default way in which MCEs meanings can be derived from the meanings of their constituents.",
        "(We use the notation > to indicate defeasible inference, | to indicate 'dominated by'.)",
        "BSC can however be overridden in a number of circumstances: most notably, when anaphora interpretation processes identify a referent for a definite description like uNP1: utter(\"the building\"), in which case sem(uNPl) will be the referent as opposed to a set of properties; or in cases of metonymy such as those studied by Nunberg (2004), in which the meaning of a MCE may be derived even more indirectly.",
        "We hypothesize that the integration of utterance meaning and gesture meaning is specified by interface defaults that may override the general meaning in a similar way by enriching the normal meaning of MCEs.",
        "We provide several examples of interface defaults below.",
        "For reasons of space, we only specify the results of default inference, without providing full derivations of the multi-modal meanings.",
        "For the gestures only the semantics is specified, abstracted from the description of the partial ontology (cf.",
        "Appendix A for details).",
        "Utterance meaning then operates on the partial ontology information.",
        "MM abbreviates \"multi-modal\"; \"lex-entry\" means the word-form at stake, \"lex-definition\" means an explict dictionary definition for the word, for example in the style of the OED, cast into PL1.",
        "The general heuristic strategy for setting up interface defaults designed to combine verbal meaning and gesture meaning is to probe into the PTT structure as deep as you need in order to fit in the gestural content properly.",
        "Gestures may be relevant at any level of discourse, as shown in (Rieser, 2008) and demonstrated below; this means that sometimes gestural content has to be stored \"deep in\" the lexical definition of a word, at other times one has to remain on the top level of semantic composition or even follow up the contributions produced so far.",
        "The interface defaults mostly follow the general schema:",
        "A prefix mentioning the open parameters + lexicon definition + open parameters applied to iconic meaning = A abstracted partial ontology description where the A bound parameters secure binding.",
        "An exception to this is (7.3.5.1) which uses the notion of satisfaction (see stills in Appendix B).",
        "[the] town hall (6.1).",
        "To begin with, gestural meaning can enrich the meaning of a nominal utterance.",
        "The interface default allowing this is called Noun meaning extended (NMExt)",
        "NMExt: Noun(u), sem(u) is A x lex-definition(x), u|u', N'(u'), u overlaps g, gesture(g), iconic-meaning(g) is Ap partial ontology(p) meaning(g)(x)",
        "For instance in the dialogue under consideration lex-definition is the predicate 'large building used for the administration of local government' abbreviated as 'APAx [[ |s: large building(x), used for the administration of local government(x)]; P(x)]' and the Partial Ontology TwoHandedPrismSeg-mentl from the Appendix A, resulting in the following meaning for the utterance of 'town hall' accompanied by the gesture:",
        "Observe that the fine-grained local information is provided by the gesture.",
        "7.3.2 The DRAWN U-shape overlapping the adjective U-shaped is an example of gesture enriching an adjectival meaning through the interface default Adjective meaning extended (AdjMExt)",
        "> sem(u') is A PA QA x([|lex-entry(x), P(x)]; Q(x)) iconic meaning(g)(x).",
        "Using AdjMExt and the meaning of the gesture OneHanded-U-shape in the Partial Ontology we obtain (7.3.2.1) as an enriched meaning for \"U-shaped\", '©' denoting mereological composition:",
        "After fitting in the noun modified by the multimodal content into position 'Q', the DRs will have to be correctly bound.",
        "Observe that we could apply (NMext) and (Ad-jMext) iteratively to arrive at a complex MM Nom-meaning.",
        "7.3.3 The PRISM SEGMENT affiliated to [practically] look into it is computed using the interface default Verb meaning extended (VMExt).",
        "VMExt gives us, again using the information from the Partial Ontology TwoHanded-U-shapedPrism from the Appendix:",
        "Again we see that fine-grained information is provided by the gesture, especially the pragmatic anchoring of the space looked into from the Router's position.",
        "7.3.4 Finally, the two-handed U-shaped PRISM SEGMENT going with and closes in the rear needs a default VP meaning extended (VPMex-tended).",
        "The gesture information is distributed among the verb \"closes\" and the PP \"in the rear\", the assumption being that the object closing does so at a particular location which is part of the object itself.",
        "So we have:",
        "The default using Appendix A, Partial Ontology TwoHanded-U-shapedPrism, generates the following MM meaning:",
        "tion(sectl, leftp), leftside(lefts, leftp), length(ll, lefts), left(lefts, Router), section(sectr, rightp), rightside(rights, rightp), frontside(fronts, rightp), bent(rightp), meet(lefts, rights, loc), right(rights, Router), parallel(lefts, rights), distance(d, lfts, rhts)]).",
        "7.3.5 The Follower's U-shaped gesture: So far, gesture meaning constrained word meanings or constituent meanings.",
        "In contrast, the Follower's U-shaped gesture invades dialogue structure.",
        "The Follower's reply has two steps.",
        "Her iconic gesture yields a predicate U-shaped in much the same way as the Router's contribution in DU2 and DU4 does.",
        "This is combined with a DR anaphorically linked to the Router's preceding its and thats.",
        "The gesture in turn takes up the Router's U-shapes from DU2 and DU4.",
        "So we get an anaphora related to antecedent multi-modal information.Her \"OK\" then simply acknowledges her own DU5 filled up.",
        "Acknowledgement of the Router's contributions is achieved indirectly.",
        "In order to model all that, we have to Hook up the Gesture's Content with a DR.",
        "This is simply",
        "(7.3.5.1) Ap(iconic-meaning(p))DR for some preceding discourse referent DR satisfying iconic-meaning.",
        "The relevant iconic meaning is taken from Partial Ontology TwoHandedPrismSegment3: sec-tion(sect, p), leftpart(lftp, p), lengthl(lftp), left(leftp, Follower), rightpart(rtp, p), right(rightp, Follower), lengthr(rtp), lftp = rtp, p = lftp e rtp.",
        "Concerning dialogue structure, we have concentrated on the verbal part of (Dial 1) in 7.1.",
        "In the SAGA corpus there are many data showing how dialogue structure interfaces with gesture meaning.",
        "In 7.3.5 a default for the follower's U-shaped gesture was given.",
        "Its embedding into the PTT-description of (Dial 1) is shown in DU5 below:",
        "g1: gesticulate(Follower, Router, U-shape), sem(g1) is K10, leftpart(lftp, p), lengthl(lftp), left(leftp, Follower), rightpart(rtp, p), right(rightp, Follower), lengthr(rtp),",
        "In the multi-modal dialogue passage we have 'gesticulate' instead of 'utter'.",
        "The semantics, using the default (7.3.5.1) 'Hook up the Gesture's Content with a DR' and material from Appendix A is provided in the standard way by K10.",
        "It is assumed that gestural content can be generated and asserted.",
        "The Follower's acknowledgement is a sort of self-acknowledgement that percolates up through anaphora."
      ]
    },
    {
      "heading": "8. Grounding by Gesture: a Genuine Case of Gestural Alignment",
      "text": [
        "The different defaults, Noun-meaning extended (NMextended), Adjective meaning extended (AdjMextended), Verb meaning extended (VMextended), VP meaning extended (VPMextended) and Hook up the Gesture's Content with a DR, clearly indicate that integration of gesture meaning has to operate on levels of different grain.",
        "Gesture can operate on a sub-word level if one has to attach its meaning to parts of a lexical definition, on the word level, on the level of constituents, and, as a consequence of all that, on specific dialogue acts.",
        "Furthermore, we have seen gesture at two inter-propositional levels at work, at the interface among the contributions of one agent (see Router's contributions which are all \"united\" by communicating the appearance of the town hall) and at the interface among contributions of different agents (Router-Follower).The Follower acknowledges by imitating gestures of the Router; this is a genuine case of gestural alignment.",
        "Alternatively, she could also acknowledge verbally, uttering 'U-shaped' but she chooses a gestural content.",
        "Obviously, speakers think that this works.",
        "Her 'OK' furthermore shows that verbal and gestural means can work in tandem.",
        "So, in the end, the U-shape of the town hall is rooted in the common ground by default and the Router can continue with describing the route leading to the next landmark."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "Support by the SFB 674, Bielefeld University, is gratefully acknowledged.",
        "We also want to than three anonymous reviewers for carful reading and suggestions for improvement.",
        "Hannes Rieser wants to thank Florian Hahn for common work on gesture typology starting in 2OO7.",
        "Due to limited space gesture types and ontology descriptions are only partially characterised.",
        "TwoHandedPrismSegment 1 R.G.Left.HandShapeShape",
        "R.G.Left.HandPalmDirection R.G.Left.BackOfHandDirection R.G.Left.Practice",
        "R.G.Left.Perspective",
        "R.G.Right.HandShapeShape R.G.Right.HandPalmDirection R.G.Right.BackOfHandDirection R.G.Right.Practice",
        "R.G.Right.Perspective R.Two-handed-configuration R.Movement-relative-to-other-hand loose B spread grasping-indexing PDN/PTL BAB grasping-indexing speaker",
        "Partial Ontology TwoHandedPrismSegment 1 R.G.Left.HandShapeShape-loose B spread side(ls, p)",
        "R.G.Left.HandPalmDirection-PDN/PTR left(ls, Router)",
        "R.G.Right.HandShapeShape-loose B spread side(rs, p) R.G.Right.HandPalmDirection-PDN/PTL right(rs, Router) R.Two-handed-configuration-TT location(loc, p)",
        "OneHanded-U-shape",
        "R.G.Right.HandShapeShape R.G.Right.PalmDirection R.G.Right.BackOfHandDirection R.G.Right.PathOfWristLocation",
        "R.G.Right.WristLocationMovementDirectio",
        "R.G.Right.Extent",
        "R.G.Left.WristLocation PDN/PTL>PDN/PTB>PDN BAB/BTL>BAB/BDN>BAB/BDN/BTL MR>MF>ML MEDIUM",
        "R.G.Left.HandPalmDirection-PTR",
        "R.G.Left.PathOfWristLocation-LINE R.G.Left.WristLocation",
        "MovementDirection-MF R.G.Left.Perspective-speaker R.G.Right.HandShapeShape-B spread",
        "R.G.Right.HandPalmDirection-PTL",
        "R.G.Right.PathOfWristLocation-LINE R.G.Right.WristLocation",
        "MovementDirection-MF R.G.Right.Perspective-speaker R.Two-handed-configuration-PF R.Movement-relative-to-other-hand-SYNC",
        "Partial Ontology OneHanded-U-shape",
        "R.G.Right.PathOfWristLocation-ARC R.G.Right.WristLocation",
        "MovementDirection-MR>MF>ML U-shape(us) straight-line(lr, us) A bent-line(lb, us) A straight-line(ll, us) hight(hl, ls) leftside(ls, p) A prism(p) length(lel, ls) frontside(fs, p) left(ls, speaker) hight(hr, rs) rightside(rs, p) A prism(p) length(ler, rs) frontside(fs, p) right(rs, speaker) distance(d, ls, lr) lel = ler",
        "Partial Ontology TwoHanded-U-shapedPrism",
        "R.G.Left.HandShapeShape-small C",
        "R.G.Left.PathOfWristLocation-LINE",
        "MovementDirection -MF R.G.Left.Perspective-speaker R.G.Right.HandShapeShape-small",
        "R.G.Right.PathOfWristLocation-LINE>LINE R.G.Right.WristLocation>ML",
        "MovementDirection-MF R.G.Right.Perspective-speaker R.Movement-relative-to-other-hand-SYNC section(sectl, leftp) leftside(lefts, leftp) length(ll, lefts) left(lefts, speaker) section(sectr, rightp) rightsideijights, rightp) A frontside(fronts, rightp) bent(rightp) A meet(lefts, rights) right(rights, speaker) parallel(lefts, rights) A distance(d, lefts, rights)",
        "Partial Ontology TwoHandedPrismSegment 2",
        "R.G.Left.HandShapeShape-B spread",
        "R.G.Right.Practice",
        "drawing",
        "R.G.Right.Pespective",
        "speaker",
        "TwoHandedPrismSegment 2",
        "R.G.Left.HandShapeShape",
        "B spread",
        "R.G.Left.HandPalmDirection",
        "PTR",
        "R.G.Left.BackOfHandDirection",
        "BAB/BUP > BAB",
        "R.G.Left.PathOfWristLocation",
        "LINE",
        "R.G.Left.WristLocation",
        "MF",
        "MovementDirection",
        "R.G.Left.Practice",
        "shaping-modellin",
        "R.G.Left.Perspective",
        "speaker",
        "R.G.Right.HandShapeShape",
        "B spread",
        "R.G.Right.HandPalmDirection",
        "PTL",
        "R.G.Right.BackOfHandDirection",
        "BAB/BUP > BAB",
        "R.G.Right.PathOfWristLocation",
        "LINE",
        "R.G.Right.WristLocation",
        "MF",
        "MovementDirection",
        "R.G.Right.Practice",
        "shaping-modellin",
        "R.G.Right.Perspective",
        "speaker",
        "R.Two-handed-configuration",
        "PF",
        "R.Movement-relative-to-other-hand",
        "SYNC",
        "TwoHanded-U-shapedPrism",
        "-",
        "R.G.Left.HandShapeShape",
        "small C",
        "R.G.Left.HandPalmDirection",
        "PAB",
        "R.G.Left.BackOfHandDirection",
        "BAB/BTR",
        "R.G.Left.PathOfWristLocation",
        "LINE",
        "R.G.Left.WristLocation",
        "MF",
        "MovementDirection",
        "R.G.Left.Practice",
        "shaping",
        "R.G.Left.Perspective",
        "speaker",
        "R.G.Right.HandShapeShape",
        "small C",
        "R.G.Right.HandPalmDirection",
        "PAB/PTL>",
        "PTL>PTB/PTL",
        "R.G.Right.BackOfHandDirection",
        "BAB/BTR>",
        "BAB>BAB/BTL",
        "R.G.Right.PathOfWristLocation",
        "LINE>LINE",
        "R.G.Right.WristLocation",
        "MF>ML",
        "MovementDirection",
        "R.G.Right.Practice",
        "shaping",
        "R.G.Right.Perspective speaker",
        "R.Two-handed-configuration",
        "BHA",
        "R.Movement-relative-to-other-hand",
        "SYNC",
        "Partial Ontology TwoHandedPrismSegment 3",
        "R.G.Left.HandShapeShape section(sect, p)",
        "R.G.Left.PathOfWristLocation leftpart(lftp, p)",
        "R.G.Left.WristLocationMovementDirection lengthl(lftp)",
        "R.G.Left.Perspective left(leftp, speaker)",
        "R.G.Right.HandShapeShape section(sect, p)",
        "R.G.Right.PathOfWristLocation rightpart(rtp, p)",
        "R.G.Right.WristLocationMovementDirection lengthr(rtp)",
        "R.G.Right.Perspective speaker",
        "R.Two-handed-configuration lftp = rtp",
        "R.Movement-relative-to-other-hand p = lftp 0 rtp",
        "(a) The Router on his trip.",
        "(b) The site traversed by the Router.",
        "The U-shaped building is the town hall (c) Fig. 1c shows the town hall as described and gestured by the Router.",
        "(d) Two-Handed-Prism-Segment-1 (e) One-Handed-U-Shape (f) Two-Handed-U-Shaped-",
        "Prism-Segment (g) Two-Handed-Prism-Segment-2A (h) Two-Handed-Prism-Segment-2B (i) Two-Handed-Prism-Segment-3",
        "TwoHandedPrismSegment 3",
        "R.G.Left.HandShapeShape",
        "C",
        "R.G.Right.HandPalmDirection",
        "PDN/PTR>",
        "PAB/PUP",
        "R.G.Left.BackOfHandDirection",
        "BAB>",
        "BTL/BUP",
        "R.G.Left.PathOfWristLocation",
        "ARC",
        "R.G.Left.WristLocationMovementDirection",
        "ML>MB",
        "R.G.Left.Practice",
        "shaping",
        "R.G.Left.Perspective",
        "speaker",
        "R.G.Right.HandShapeShape",
        "C",
        "R.G.Right.HandPalmDirection",
        "PDN/PTL>",
        "PAB/PUP",
        "R.G.Right.BackOfHandDirection",
        "BAB>",
        "BTR/BUP",
        "R.G.Right.PathOfWristLocation",
        "ARC",
        "R.G.Right.WristLocationMovementDirection",
        "MR>MB",
        "R.G.Right.Practice",
        "shaping",
        "R.G.Right.Perspective",
        "speaker",
        "R.Two-handed-configuration",
        "BHA",
        "R.Movement-relative-to-other-hand",
        "Mirror-Sagittal"
      ]
    }
  ]
}
