{
  "info": {
    "authors": [
      "Ekaterina Buyko",
      "Erik Faessler",
      "Joachim Wermter",
      "Udo Hahn"
    ],
    "book": "Proceedings of the BioNLP 2009 Workshop Companion Volume for Shared Task",
    "id": "acl-W09-1403",
    "title": "Event Extraction from Trimmed Dependency Graphs",
    "url": "https://aclweb.org/anthology/W09-1403",
    "year": 2009
  },
  "references": [
    "acl-D07-1111",
    "acl-P04-1025",
    "acl-W08-0601"
  ],
  "sections": [
    {
      "text": [
        "Ekaterina Buyko, Erik Faessler, Joachim Wermter and Udo Hahn",
        "Jena University Language & Information Engineering (JULIE) Lab Friedrich-Schiller-Universitat Jena Fürstengraben 30, 07743 Jena, Germany",
        "{ekaterina.buyko|erik.faessler|joachim.wermter|udo.hahn}@uni-j ena.de",
        "We describe the approach to event extraction which the JuLiELab Team from FSU Jena (Germany) pursued to solve Task 1 in the \"BioNLP'09 Shared Task on Event Extraction\".",
        "We incorporate manually curated dictionaries and machine learning methodologies to sort out associated event triggers and arguments on trimmed dependency graph structures.",
        "Trimming combines pruning irrelevant lexical material from a dependency graph and decorating particularly relevant lexical material from that graph with more abstract conceptual class information.",
        "Given that methodological framework, the JuLiELab Team scored on 2nd rank among 24 competing teams, with 45.8% precision, 47.5% recall and 46.7% Fl-score on all 3,182 events."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Semantic forms of text analytics for the life sciences have long been equivalent with named entity recognition and interpretation, i.e., finding instances of semantic classes such as proteins, diseases, or drugs.",
        "For a couple of years, this focus has been complemented by analytics dealing with relation extraction, i.e., finding instances of relations which link one or more (usually two) arguments, the latter being instances of semantic classes, such as the interaction between two proteins (PPis).",
        "PPi extraction is a complex task since cascades of molecular events are involved which are hard to sort out.",
        "Many different approaches have already been tried - pattern-based ones (e.g., by Blaschke et al.",
        "(1999), Hakenberg et al.",
        "(2005) or Huang et al.",
        "(2004)), rule-based ones (e.g., by Yakushiji et al.",
        "(2001), Saric et al.",
        "(2004) or Fundel et al.",
        "(2007)), and machine learning-based ones (e.g., by Katrenko and Adriaans (2006), Sœtre et al.",
        "(2007) or Airola et al.",
        "(2008)), yet without conclusive results.",
        "In the following, we present our approach to solve Task 1 within the \"BioNLP'09 Shared Task on Event Extraction\".",
        "Task 1 \"Event detection and characterization\" required to determine the intended relation given a priori supplied protein annotations.",
        "Our approach considers dependency graphs as the central data structure on which various trimming operations are performed involving syntactic simplification but also, even more important, semantic enrichment by conceptual overlays.",
        "A description of the component subtasks is provided in Section 2, while the methodologies intended to solve each subtask are discussed in Section 3.",
        "The system pipeline for event extraction reflecting the task decomposition is described in Section 4, while Section 5 provides the evaluation results for our approach."
      ]
    },
    {
      "heading": "2. Event Extraction Task",
      "text": [
        "Event extraction is a complex task that can be subdivided into a number of subtasks depending on whether the focus is on the event itself or on the arguments involved:",
        "Event trigger identification deals with the large variety of alternative verbalizations of the same event type, i.e., whether the event is expressed in a verbal or in a nominalized form (e.g., \"A is expressed\" and \"the expression of A\" both refer to the same event type, viz. expression(A)).",
        "Since the same trigger may stand for more than one event type, event trigger ambiguity has to be resolved as well.",
        "Event trigger disambiguation selects the correct event name from the set of alternative event triggers.",
        "Event typing, finally, deals with the semantic classification of a disambiguated event name and the assignment to an event type category.",
        "Argument identification is concerned with finding all necessary participants in an event, i.e., the arguments of the relation.",
        "Argument typing assigns the correct semantic category (entity class) to each ofthe determined participants in an event (which can be considered as instances of that class).",
        "Argument ordering assigns each identified participant its functional role within the event, mostly Agent (and Patient/Theme).",
        "The sentence \"Regulation of jun and fos gene expression in human monocytes by the macrophage colony-stimulating factor\", e.g., contains mentions of two Gene Expression events with respective Theme arguments \"jun\" and \"fos\", triggered in the text by the literal phrase \"gene expression\".",
        "Task 1 of the \"BioNLP'09 Shared Task on Event Extraction\" was defined in such a way as to identify a proper relation (event) name and link it with its type, plus one or more associated arguments denoting proteins.",
        "To focus on relation extraction only no automatic named entity recognition and interpretation had to be performed (subtask 'argument typing' from above); instead candidate proteins were already pre-tagged.",
        "The complexity of Task 1 was raised by the condition that not only proteins were allowed to be arguments but also were events."
      ]
    },
    {
      "heading": "3. Event Extraction Solution",
      "text": [
        "Our event extraction approach is summarized in Figure 1 and consists of three major streams - first, the detection of lexicalized event triggers (cf.",
        "Section 3.1), second, the trimming of dependency graphs which involves pruning irrelevant and semantically enriching relevant lexical material (cf.",
        "Section 3.2),",
        "Pre-processing",
        "Typing of Putative Event Triggers",
        "Trimming of Dependency Graphs",
        "Event Detection",
        "Argument Identification with Ensemble of Classifiers",
        "Post-processing",
        "and, third, the identification of arguments for the event under scrutiny (cf.",
        "Section 3.3).",
        "Event typing results from proper event trigger identification (see Section 3.1.2), which is interlinked with the outcome of the argument identification.",
        "We talk about putative triggers because we consider, in a greedy manner, all relevant lexical items (see Section 3.1.1) as potential event triggers which might represent an event.",
        "Only those event triggers that can eventually be connected to arguments, finally, represent a true event.",
        "To achieve this goal we preprocessed both the original training and test data such that we enrich the original training data with automatically predicted event triggers in order to generate more negative examples for a more effective learning of true events.",
        "Looking at the wide variety of potential lexicalized triggers for an event, their lacking discriminative power relative to individual event types and their inherent potential for ambiguity, we decided on a dictionary-based approach whose curation principles are described in Section 3.1.1.",
        "Our disambiguation policy for the ambiguous lexicalized event triggers assembled in this suite of dictionaries, one per event type, is discussed in Section 3.1.2.",
        "We started collecting our dictionaries from the original Genia event corpus (Kim et al., 2008a).",
        "The extracted event triggers were then automatically lemmatized and the resulting lemmata were subsequently ranked by two students of biology according to their predictive power to act as a trigger for a particular event type.",
        "This expert assessment led us to four trigger groups (for each event type these groups were determined separately):",
        "(1) Triggers are important and discriminative for a specific event type.",
        "This group contains event triggers such as \"upregulate\" for Positive .regulation.",
        "(2) Triggers are important though not fully discriminative for a particular event type; yet, this deficiency can be overcome by other lexical cues within the context of the same sentence.",
        "This group with in-context disambiguators contains lexical items such as \"proteolyse\" for Protein jcatabolism.",
        "(3) Triggers are non-discriminative for an event type and even cannot be disambiguated by linguistic cues within the context of the same sentence.",
        "This group contains lexical items such as \"presence\" for Localization and Gene.expression.",
        "(4) Triggers are absolutely non-discriminative for an event.",
        "This group holds general lexical triggers such as \"observe\", \"demonstrate\" or \"function\".",
        "The final dictionaries used for the detection of putative event triggers are a union of the first two groups.",
        "They were further extended by biologists with additional lexical material of the first group.",
        "The dictionaries thus became event type-specific they contain all morphological forms of the original lemma, which were automatically generated using the Specialist NLP Tools (2008 release).",
        "We matched the entries from the final set of dictionaries with the shared task data using the Ling-pipe Dictionary Chunker.",
        "After the matching process, some cleansing had to be done.",
        "Preliminary experiments indicated that the disambiguation of event triggers might be beneficial for the overall event extraction results since events tend to be expressed via highly ambiguous triggers.",
        "Therefore, we performed a disambiguation step preceding the extraction of any argument structures.",
        "it is based on the importance of an event trigger ti for a particular event type T as defined by Imp(tJ) := pfftjrn , where f (tT) is the frequency of the event trigger t of the selected event type T in a training corpus divided by the total amount of all event triggers of the selected event type T in that training corpus.",
        "The frequencies are measured on stemmed event triggers.",
        "For example, Imp for the trigger stem \"depend\" amounts to 0.013 for the event type Positive regulation, while for the event type Regulation it yields 0.036 .",
        "If a text span contains several event triggers with the same span offset, the event trigger with max(Imp) is selected and other putative triggers are discarded.",
        "The trigger stem \"depend\" remains thus only for Regulation.",
        "When we consider event (relation) extraction as a semantic interpretation task, plain dependency graphs as they result from deep syntactic parsing might not be appropriate to directly extract semantic information from.",
        "This is due to two reasons - they contain a lot of apparently irrelevant lexical nodes (from the semantic perspective of event extraction) and they also contain much too specific lexical nodes that might better be grouped and further enriched semantically.",
        "Trimming dependency graphs for the purposes of event extraction, therefore, amounts to eliminate semantically irrelevant and to semantically enrich relevant lexical nodes (i.e., overlay with concepts).",
        "This way, we influence the final representation for the machine learners we employ (in terms of features or kernel-based representations) – we may avoid an overfitting of the feature or kernel spaces with syntactic and lexical data and thus reduce structural information in a linguistically motivated way.",
        "a longer event trigger, (3) overlapped with a longer trigger of the same event type, (4) occurred inside an entity mention annotation.",
        "Pruning targets auxiliary and modal verbs which govern the main verb in syntactic structures such as passives, past or future tense.",
        "We delete the aux-iliars/modals as govenors of the main verbs from the dependency graph and propagate the semantics-preserving dependency relations of these nodes directly to the main verbs.",
        "Adhering to the dependency tree format and labeling conventions set up for the 2006 and 2007 CONLL shared tasks on dependency parsing main verbs are usually connected with the auxiliar by the VC dependency relation (see Figure 2).",
        "Accordingly, in our example, the verb \"activate\" is promoted to the Root in the dependency graph and governs all nodes that were originally governed by the modal \"may\".",
        "NF-kappaB may activate TNF-alpha production I",
        "Lexical nodes in the (possibly pruned) dependency graphs deemed to be important for argument extraction were then enriched with semantic class annotations, instead of keeping the original lexical (stem) representation (see Figure 2).",
        "The rationale behind this decision was to generate more powerful kernel-based or features representations (see Section 3.3.2 and 3.3.1).",
        "The whole process is based on a three-tier task-specific semantic hierarchy of named entity classes.",
        "The top rank is constituted by the equivalent classes Transcription factor, Binding site, and Promoter.",
        "The second rank is occupied by MESH terms, and the third tier assembles the named entity classes Gene and Protein.",
        "Whenever a lexical item is categorized by one of these categories, the associated node in the dependency graph is overlaid with that category applying the ranking in cases of conflicts.",
        "We also enriched the gene name mentions with their respective Gene Ontology Annotations from GOA.",
        "For this purpose, we first categorized GO terms both from the \"molecular function\" and from the \"biological process\" branch with respect to their matching event type, e.g., Phosphorylation or Positive.regulation.",
        "We then mapped all gene name mentions which occurred in the text to their UniProt identifier using the gene name normalizer GeNo (Wermter et al., 2009).",
        "This identifier links a gene with a set of (curated) GO annotations.",
        "in addition, we inserted semantic information in terms of the event trigger type and the experimental methods.",
        "As far as experimental methods are concerned, we extracted all instances of them annotated in the GENiA event corpus.",
        "One student of biology sorted the experimental methods relative to the event categories under scrutiny.",
        "For example \"affinity chromatography\" was assigned both to the Gene expression and to the Binding category.",
        "For our purposes, we only included those GO annotations and experimental methods which matched the event types to be identified in a sentence.",
        "The argument identification task can be subdivided into three complexity levels.",
        "Level (1) incorporates five event types (Geneexpression, Transcription, Proteinjcatabolism, Localization, Phosphory-lation) which involve a single participant with a Theme role only.",
        "Level (2) is concerned with one event type (Binding) that provides an nary argument structure where all arguments occupy the THEME(n) role.",
        "Level (3) comprises three event types (Positive regulation, Negative regulation, or an unspecified Regulation) that represent a regulatory relation between the above-mentioned event classes or proteins.",
        "These events have usually a binary structure, with a Theme argument and a Cause argument.",
        "For argument extraction, we built sentence-wise pairs of putative triggers and their putative argu-ment(s), the latter involving ontological information about the event type.",
        "For Level (1), we built pairs only with proteins, while for Level (3) we allowed all events as possible arguments.",
        "For Level (2), Binding events, we generated binary (trigger, protein) pairs as well as triples (trigger, proteini, protein2) to adequately represent the binding between two proteins.",
        "Pairs of mentions not connected by a dependency path could not be detected.",
        "For the argument extraction we chose two machine learning-based approaches, feature-based and a kernel-based one, as described below.",
        "We distinguished three groups of features.",
        "First, lexical features (covering lexical items before, after and between both mentions (of the event trigger and an argument) as described by Zhou and Zhang (2007)); second, chunking features (concerned with head words of the phrases between two mentions as described by Zhou and Zhang (2007)); third, dependency parse features (considering both the selected dependency levels of the arguments (parents and least common subsumer) as discussed by Ka-trenko and Adriaans (2006), as well as a shortest dependency path structure between the arguments as used by Kim et al.",
        "(2008b) for walk features).",
        "For the feature-based approach, we chose the Maximum Entropy (ME) classifier from Mallet.",
        "The graph kernel uses a converted form of dependency graphs in which each dependency node is represented by a set of labels associated with that node.",
        "The dependency edges are also represented as nodes in the new graph such that they are connected to the nodes adjacent in the dependency graph.",
        "Subgraphs which represent, e.g., the linear order of the words in the sentence can be added, if required.",
        "The entire graph is represented in terms of an adjacency matrix which is further processed to contain the summed weights of paths connecting two nodes of the graph (see Airola et al.",
        "(2008) for details).",
        "Figure 3: Graph Kernel Representation for a Trimmed Dependency Graph – (1) original representation, (2) representation without graph dependency edge nodes (weights (0.9, 0.3) taken from Airola et al.",
        "(2008)).",
        "For our experiments, we tried some variants of the original graph kernel.",
        "In the original version each dependency graph edge is represented as a node.",
        "That means that connections between graph token nodes are expressed through graph dependency edge nodes (see Figure 3; (1)).",
        "To represent the connections between original tokens as direct connections in the graph, we removed the edge nodes and each token was assigned the edge label (its dependency label; see Figure 3; (2)).",
        "Further variants included encodings for (1) the shortest dependency path (sp) between two mentions (argument and trigger) (2) the complete dependency graph (sp-dep), and (3) the complete dependency graph and linear information (sp-dep-lin) (the original configuration from Airola et al.",
        "(2008)).",
        "For the graph kernel, we chose the LibSVM (Chang and Lin, 2001) Support Vector Machine as classifier.",
        "The postprocessing step varies for the three different Levels (see Section 3.3).",
        "For every event trigger of Level (1) (e.g., Gene .expression), we generate one event per relation comprising a trigger and its argument.",
        "For Level (2) (Binding), we create a Binding event with two arguments only for triples (trigger, protein1, protein2).",
        "For the third Level, we create for each event trigger and its associated arguments e = n x m events, for n Cause arguments and m Theme arguments."
      ]
    },
    {
      "heading": "4. Pipeline",
      "text": [
        "The event extraction pipeline consists of two major parts, a preprocessor and the dedicated event extractor.",
        "As far as preprocessing is concerned, we imported the sentence splitting, tokenization and GDep parsing results (Sagae and Tsujii, 2007) as prepared by the shared task organizers for all data sets (training, development and test).",
        "We processed this data with the OpenNLP POS tagger and Chun-ker, both retrained on the GENIA corpus (Buyko et al., 2006).",
        "Additionally, we enhanced the original tokenization by one which includes hyphenization of lexical items such as in \"PMA-dependent\".",
        "The data was further processed with the gene normalizer GENo(Wermter et al., 2009) and a number of regex- and dictionary-based entity taggers (covering promoters, binding sites, and transcription factors).",
        "We also enriched gene name mentions with their respective Gene Ontology annotations (see Section 3.2.2).",
        "The MeSH thesaurus (except chemical and drugs branch) was mapped on the data using the Lingpipe Dictionary Chunker.",
        "After preprocessing, event extraction was started distinguishing between the event trigger recognition (cf.",
        "Section 3.1), the trimming of the dependency graphs (cf.",
        "Section 3.2), and the argument extraction proper (cf.",
        "Section 3.3).",
        "We determined in our experiments on the development data the performance of every classifier type and its variants (for the graph kernel), and of ensembles of the most performant (F-Score) graph kernel variant and an ME model.",
        "We present here the argument extraction configuration used for the official run.",
        "For the prediction of Phosphorylation, Localization, Pro-teineatabolism types we used the graph kernel in its \"sp without dependency-edge-nodes\" configuration, while for the prediction of Transcription and Gene expression events we used an ensemble of the graph kernel in its \"sp with dependency-edge-nodes\" variant, and an ME model.",
        "For the prediction of Binding we used an ensemble of the graph kernel (\"sp-dep with dependency-edge-nodes\") and an ME model.",
        "For the prediction of regulatory events we used ME models for each regulatory type."
      ]
    },
    {
      "heading": "5. Results",
      "text": [
        "The baseline against which we compared our approach can be captured in a single rule.",
        "We extract for every pair of a putative trigger and a putative argument the shortest dependency path between them.",
        "If the shortest dependency path does not contain any direction change, i.e., the argument is either a direct child or a direct parent of the trigger, and if the path does not contain any other intervening event triggers, the argument is taken as the Theme role.",
        "We performed evaluations on the shared task development and test set.",
        "Our baseline achieved competitive results of 36.0% precision, 34.0% recall, 35.0% F-score on the development set (see Table 1), and 30.4% precision, 35.7% recall, 32,8% F-score on the test set (see Table 2).",
        "In particular the one-argument events, i.e., Gene expression, Pro-teineatabolism, Phosphorylation are effectively extracted with an F-score around 70.0%.",
        "More complex events, in particular events of Level (3), i.e., (Regulation) were less properly dealt with because of their strong internal complexity.",
        "Table 1: Baseline results on the shared task development data.",
        "Approximate Span Matching/Approximate Recursive Matching.",
        "Event Class",
        "gold",
        "recall",
        "prec.",
        "F-score",
        "Localization",
        "53",
        "75.47",
        "30.30",
        "43.24",
        "Binding",
        "248",
        "33.47",
        "20.80",
        "25.66",
        "Gene expression",
        "356",
        "76.12",
        "75.07",
        "75.59",
        "Transcription",
        "82",
        "68.29",
        "40.58",
        "50.91",
        "Protein jcatabolism",
        "21",
        "76.19",
        "66.67",
        "71.11",
        "Phosphorylation",
        "47",
        "76.60",
        "72.00",
        "74.23",
        "Regulation",
        "169",
        "14.20",
        "15.09",
        "14.63",
        "Positive .regulation",
        "617",
        "15.40",
        "20.83",
        "17.71",
        "Negative .regulation",
        "196",
        "11.73",
        "13.22",
        "12.43",
        "TOTAL",
        "1789",
        "36.00",
        "34.02",
        "34.98",
        "Table 2: Baseline results on the shared task test data.",
        "Approximate Span Matching/Approximate Recursive Matching (columns 3-5).",
        "Event decomposition, Approximate Span Matching/Approximate Recursive Matching (columns 7 -9).",
        "The event extraction approach, in its final configuration (see Section 4), achieved a performance of 50.4% recall, 45.8% precision and 48.0% F - score on the development set (see Table 4), and 45.8% recall, 47.5% precision and 46.7% F-score on the test set (see Table 3).",
        "This approach clearly outperformed the baseline with an increase of 14 percentage points on the test data.",
        "In particular, the events of Level (2) and (3) were more properly dealt with than by the baseline.",
        "In the event decomposition mode (argu ment detection is evaluated in a decomposed event) we achieved a performance of 49.4% recall, 56.2% precision, and 52.6% F-score (see Table 3).",
        "Our experiments on the development set showed that the combination of the feature-based and the graph kernel-based approach can boost the results up to 6 percentage points F-score (for the Binding event type).",
        "It is interesting that the combination for Binding increased recall without dropping precision.",
        "The original graph kernel approach for Binding events performs with 38.3% recall, 27.9% precision and 32.3% F-score on the development set.",
        "The combined approach comes with a remarkable increase of 14 percentage points in recall.",
        "The combination could also boost the recall of the Gene .expression and Transcription by 15 percentage points and 5 percentage points, respectively, without seriously dropping the precision (4 points for every type).",
        "For the other event types, no improvements were found when we combined both approaches.",
        "One expert biologist analyzed 30 abstracts randomly extracted from the development error data.",
        "We determined seven groups of errrors based on this analysis.",
        "The first group contains examples for which an event should be determined, but a false argument was found (e.g., Binding arguments were not properly sorted, or correct and false arguments were detected for the same trigger) (44 examples).",
        "The second group comprised examples where no trigger was found (23 examples).",
        "Group (3) stands for cases where no events were detected although a trigger was properly identified (14 examples).",
        "Group (4) holds examples detected in sentences which did not contain any events (12 examples).",
        "Group (5) lists biologically meaningful analyses, actually very close to the gold annotation, especially for the cascaded regulatory events (12 examples), while Group (6) incorporates examples of a detected event with incorrect type (1 example).",
        "Group (7) gathers misleading gold annotations (10 examples).",
        "This assessment clearly indicates that a major source of errors can be traced to the level of argument identification, in particular for Binding events.",
        "The second major source has its offspring at the level of trigger detection (we ignored, for example, triggers such as \"in the presence of', \"when\", \"normal\").",
        "About 10% of the errors are due to a slight difference between extracted events and gold events.",
        "For example, in the phrase \"role for NF-kappaB in the regulation of FasL expression\" we",
        "Event Class",
        "gold",
        "recall",
        "prec.",
        "F-score",
        "gold",
        "recall",
        "prec.",
        "F-score",
        "Localization",
        "174",
        "42.53",
        "44.85",
        "43.66",
        "174",
        "42.53",
        "44.85",
        "43.66",
        "Binding",
        "347",
        "32.28",
        "37.09",
        "34.51",
        "398",
        "44.22",
        "58.28",
        "50.29",
        "Gene .expression",
        "722",
        "61.36",
        "80.55",
        "69.65",
        "722",
        "61.36",
        "80.55",
        "69.65",
        "Transcription",
        "137",
        "39.42",
        "35.06",
        "37.11",
        "137",
        "39.42",
        "35.06",
        "37.11",
        "Protein jcatabolism",
        "14",
        "71.43",
        "66.67",
        "68.97",
        "14",
        "71.43",
        "66.67",
        "68.97",
        "Phosphorylation",
        "135",
        "65.93",
        "90.82",
        "76.39",
        "135",
        "65.93",
        "90.82",
        "76.39",
        "EVT-TOTAL",
        "1529",
        "51.14",
        "60.90",
        "55.60",
        "1580",
        "53.54",
        "65.89",
        "59.08",
        "Regulation",
        "291",
        "9.62",
        "11.72",
        "10.57",
        "338",
        "9.17",
        "12.97",
        "10.75",
        "Positive-regulation",
        "983",
        "10.38",
        "11.33",
        "10.83",
        "1186",
        "14.67",
        "19.33",
        "16.68",
        "Negative-regulation",
        "379",
        "14.25",
        "19.22",
        "16.36",
        "416",
        "14.18",
        "21.00",
        "16.93",
        "REG-TOTAL",
        "1653",
        "11.13",
        "12.96",
        "11.98",
        "1940",
        "13.61",
        "18.59",
        "15.71",
        "ALL-TOTAL",
        "3182",
        "30.36",
        "35.72",
        "32.82",
        "3520",
        "31.53",
        "41.05",
        "35.67",
        "Table 3: Offical Event Extraction results on the shared task test data of the JuLiELab Team.",
        "Approximate Span Matching/Approximate Recursive Matching (columns 3-5).",
        "Event decomposition, Approximate Span Matching/Approximate Recursive Matching (columns 7-9).",
        "could not extract the gold event Regulation of Regulation (Gene.expression (FasL)) associated with the trigger \"role\", but we were able to find the (inside) event Regulation (Gene.expression (FasL)) associated with the trigger \"regulation\".",
        "Interestingly, the typing of events is not an error source in spite of the simple disambiguation approach.",
        "Still, our disambiguation strategy is not appropriate for the analysis of double-annotated triggers such as \"overexpression\", \"transfection\", etc., which are annotated as Gene.expression and Positive regulation and are a major source of errors in Group (2).",
        "As Group (6) is an insignificant source of errors in our randomly selected data, we focused our error analysis on the especially ambiguous event type Transcription.",
        "We found from 34 errors that 14 of them were due to the disambiguation strategy (in particular for triggers \"(gene) expression\" and \"induction\")."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "Our approach to event extraction incorporates manually curated dictionaries and machine learning methodologies to sort out associated event triggers and arguments on trimmed dependency graph structures.",
        "Trimming combines pruning irrelevant lexical material from a dependency graph and decorating particularly relevant lexical material from that graph with more abstract conceptual class information.",
        "Given that methodological framework, the JuLIELab Team scored on 2nd rank among 24 com-",
        "Table 4: Event extraction results on the shared task development data of the official run of the JuLiELab Team.",
        "Approximate SpanMatching/Approximate Recursive Matching.",
        "peting teams, with 45.8% precision, 47.5% recall and 46.7% F1-score on all 3,182 events."
      ]
    },
    {
      "heading": "7. Acknowledgments",
      "text": [
        "We wish to thank Rico Landefeld for his technical support, Tobias Wagner and Rico Pusch for their constant help and great expertise in biological issues.",
        "This research was partially funded within the BOOTStrep project under grant FP6-028099 and the CALBC project under grant FP7-231727.",
        "Event Class",
        "gold",
        "recall",
        "prec.",
        "F-score",
        "gold",
        "recall",
        "prec.",
        "F-score",
        "Localization",
        "174",
        "43.68",
        "77.55",
        "55.88",
        "174",
        "43.68",
        "77.55",
        "55.88",
        "Binding",
        "347",
        "49.57",
        "35.25",
        "41.20",
        "398",
        "63.57",
        "54.88",
        "58.91",
        "Gene .expression",
        "722",
        "64.82",
        "80.27",
        "71.72",
        "722",
        "64.82",
        "80.27",
        "71.72",
        "Transcription",
        "137",
        "35.77",
        "62.03",
        "45.37",
        "137",
        "35.77",
        "62.03",
        "45.37",
        "Protein .catabolism",
        "14",
        "78.57",
        "84.62",
        "81.48",
        "14",
        "78.57",
        "84.62",
        "81.48",
        "Phosphorylation",
        "135",
        "76.30",
        "91.15",
        "83.06",
        "135",
        "76.30",
        "91.15",
        "83.06",
        "EVT-TOTAL",
        "1529",
        "57.49",
        "63.97",
        "60.56",
        "1580",
        "60.76",
        "71.27",
        "65.60",
        "Regulation",
        "291",
        "31.27",
        "30.13",
        "30.69",
        "338",
        "35.21",
        "37.54",
        "36.34",
        "Positive .regulation",
        "983",
        "34.08",
        "37.18",
        "35.56",
        "1186",
        "40.64",
        "49.33",
        "44.57",
        "Negative .regulation",
        "379",
        "40.37",
        "31.16",
        "35.17",
        "416",
        "42.31",
        "39.11",
        "40.65",
        "REG-TOTAL",
        "1653",
        "35.03",
        "34.18",
        "34.60",
        "1940",
        "40.05",
        "44.55",
        "42.18",
        "ALL-TOTAL",
        "3182",
        "45.82",
        "47.52",
        "46.66",
        "3520",
        "49.35",
        "56.20",
        "52.55",
        "Event Class",
        "gold",
        "recall",
        "prec.",
        "F-score",
        "Localization",
        "53",
        "71.70",
        "74.51",
        "73.08",
        "Binding",
        "248",
        "52.42",
        "29.08",
        "37.41",
        "Gene .expression",
        "356",
        "75.28",
        "81.46",
        "78.25",
        "Transcription",
        "82",
        "60.98",
        "73.53",
        "66.67",
        "Protein.catabolism",
        "21",
        "90.48",
        "79.17",
        "84.44",
        "Phosphorylation",
        "47",
        "82.98",
        "84.78",
        "83.87",
        "Regulation",
        "169",
        "37.87",
        "36.78",
        "37.32",
        "Positive .regulation",
        "617",
        "34.36",
        "35.99",
        "35.16",
        "Negative .regulation",
        "196",
        "41.33",
        "33.61",
        "37.07",
        "TOTAL",
        "1789",
        "50.36",
        "45.76",
        "47.95"
      ]
    }
  ]
}
