{
  "info": {
    "authors": [
      "Buzhou Tang",
      "Lu Li",
      "Xinxin Li",
      "Xuan Wang",
      "Wang XiaoLong"
    ],
    "book": "Proceedings of the Thirteenth Conference on Computational Natural Language Learning (CoNLL 2009): Shared Task",
    "id": "acl-W09-1217",
    "title": "A Joint Syntactic and Semantic Dependency Parsing System based on Maximum Entropy Models",
    "url": "https://aclweb.org/anthology/W09-1217",
    "year": 2009
  },
  "references": [
    "acl-L08-1222",
    "acl-W08-2121",
    "acl-W08-2130"
  ],
  "sections": [
    {
      "text": [
        "A Joint Syntactic and Semantic Dependency Parsing System based on",
        "Maximum Entropy Models",
        "Buzhou Tang Lu Li Xinxin Li Xuan Wang Xiaolong Wang",
        "Shenzhen Graduate School Harbin Institute of Technology Shenzhen,518055, China",
        "{tangbuzhou,lixxin2}@gmail.com {lli,wangxuan,wangxl}@insun.hit.edu.cn",
        "A joint syntactic and semantic dependency parsing system submitted to the CoNLL-2009 shared task is presented in this paper.",
        "The system is composed of three components: a syntactic dependency parser, a predicate classifier and a semantic parser.",
        "The first-order MSTParser is used as our syntactic dependency pasrser.",
        "Projective and non-projective MSTParsers are compared with each other on seven languages.",
        "Predicate classification and semantic parsing are both recognized as classification problem, and the Maximum Entropy Models are used for them in our system.",
        "For semantic parsing and predicate classifying, we focus on finding optimized features on multiple languages.",
        "The average Macro F1 Score of our system is 73.97 for joint task in closed challenge."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The task for CoNLL-2009 is an extension of the CoNLL-2008 shared task to multiple languages: English (Surdeanu et al., 2008), Catalan plus Spanish (Mariona Taule et al., 2008), Chinese (Martha Palmer et al., 2009), Czech (Jan Hajic et al., 2006), German (AljoschaBurchardtetal., 2006) and Japanese (Daisuke Kawahara et al., 2002).",
        "Compared to the CoNLL-2008 shared task, the predicates are given for us in semantic dependencies task.",
        "Therefore, we have only need to label the semantic roles of nouns and verbs, and the frames of predicates.",
        "In this paper, a joint syntactic and semantic dependency parsing system submitted to the CoNLL2009 shared task is presented.",
        "The system is composed of three components: a syntactic dependency parser, a predicate classifier and a semantic parser.",
        "The first-order MSTParser is used as our syntactic dependency parser.",
        "Projective and non-projective MSTParsers are compared with each other on seven languages.",
        "The predicate classifier labeling the frames of predicates and the semantic parser labeling the semantic roles of nouns and verbs for each predicate are both recognized as classification problem, and the Maximum Entropy Models (MEs) are used for them in our system.",
        "Among three components, we mainly focus on the predicate classifier and the semantic parser.",
        "For semantic parsing and predicate classifying, features of different types are selected to our system.",
        "The effect of them on multiple languages will be described in the following sections in detail."
      ]
    },
    {
      "heading": "2. System Description",
      "text": [
        "Generally Speaking, a syntactic and semantic dependency parsing system is usually divided into four separate subtasks: syntactic parsing, predicate identification, predicate classification, and semantic role labeling.",
        "In the CoNLL-2009 shared task, the predicate identification is not required, since the predicates are given for us.",
        "Therefore, the system we present is only composed of three components: a syntactic dependency parser, a predicate classifier and a semantic parser.",
        "The syntactic dependencies are processed with the MSTParser 0.4.3b.",
        "The predicates identification and semantic role label are processed with MEs-based classifier respectively.",
        "Unlike conventional systems, the predicates identification and the semantic parser are independent with each other.",
        "Figure 1 is the architecture of our system.",
        "In our system, we firstly select an appropriate mode (projective or non-projective) of Graph-based Parser (MSTParser) for each language, then construct the MEs-based predicates classification and the MEs-based semantic parser with syntactic dependency relationships and predicate classification respectively.",
        "MSTParser (McDonald, 2008) is used as our syntactic dependency parser.",
        "It is a state-of-the-art dependency parser that searches for maximum spanning trees (MST) over directed graph.",
        "Both of projective and non-projective are supported by MST-Parser.",
        "Our system employs the first-order framework with projective and non-projective modes on seven given languages.",
        "In this phase, we label the sense of each predicate and the MEs are adopted for classification.",
        "Features of different types are extracted for each predicate, and an optimized combination of them is adopted in our final system.",
        "Table 1 lists all features.",
        "1-20 are the features used in Li's system (Lu Li et al., 2008), and 21-31 are a part of the optimized features presented in Che's system (Wanxiang Che et al., 2008) In Table 1, \"w\" denotes the word and \"p\" denotes POS of the words.",
        "Features in the form of part1_part2 denote the part2 of the part1, while features in the form of part1+part2 denote the combination of the part1 and part2.",
        "\"CHD\" and \"SIB\" denote a sequence of the child and the sibling words respectively, \"REL\" denotes the type of relations, \"U\" denotes the result after reducing the adjacent duplicate tags to one, \"V\" denotes whether the part is a voice, \"In\" and \"OUT\" denote the in.degree and out_degree, which denotes how many dependency relations coming into this word and going away from this word,and \"ARG\" denotes the semantic roles of the predicate.",
        "The \"Span\" denotes the maximum length between the predicate and its arguments.",
        "The final optimized feature combination is :1-31 and 3337.",
        "The semantic role labeling usually contains two sub-tasks: argument identification and argument classification.",
        "In our system, we perform them in a single stage through one classifier, which specifies a particular role label to the argument candidates directly and assigns \"NONE\" label to the argument candidates with no role.",
        "MEs are also adopted for classification.",
        "For each word in a sentence, MEs gives each candidate label (including semantic role labels and none label) a probability for the predicate.",
        "The features except for the feature (lemma plus sense number of the predicate in (Lu Li et al., 2008)) and the features 32-38 in Table 1 are selected in our system.",
        "No",
        "Features",
        "No",
        "Features",
        "1",
        "Wo",
        "20",
        "Lemma",
        "2",
        "po",
        "21",
        "DEPREL",
        "3",
        "p-1",
        "22",
        "CHD_POS",
        "4",
        "pi",
        "23",
        "CHD_POS_U",
        "5",
        "P-1P0",
        "24",
        "CHDJREL",
        "6",
        "P0P1",
        "25",
        "CHD_REL_U",
        "7",
        "P-2P0",
        "26",
        "SIBJREL",
        "8",
        "P0P2",
        "27",
        "SIB_REL_U",
        "9",
        "P-3P0",
        "28",
        "SIB_POS",
        "10",
        "P0P3",
        "29",
        "SIB_POS_U",
        "11",
        "P-1P0P1",
        "30",
        "VERBV",
        "12",
        "wopo",
        "31",
        "4+11",
        "13",
        "W0P-1P0",
        "32",
        "Indegree",
        "14",
        "W0P0P1",
        "33",
        "Outdegree",
        "15",
        "W0P-2P0",
        "34",
        "Degree",
        "16",
        "W0P0P2",
        "35",
        "ARGJN",
        "17",
        "W0P-3P0",
        "36",
        "ARGOUT",
        "18",
        "W0P0P3",
        "37",
        "ARGJDegree",
        "19",
        "W0P-1P0P1",
        "38",
        "Span"
      ]
    },
    {
      "heading": "3. Experiments and Results",
      "text": [
        "We train the first-order MSTParser with projective and non-projective modes in terms of default parameters respectively.",
        "Our maximum entropy classifiers are implemented with the Maximum Entropy Modeling Toolkit .",
        "The default classifier parameters are used in our system except for iterations.",
        "All models are trained using all training data, and tested on the whole development data and test data, with 64bit 3.00GHz Intel(R) Pentium(R) D CPU and 4.0G memory.",
        "Table 2 is a performance comparison between projective parser and non-projective parser on the development data of seven languages.",
        "In Table 2, \"LAS\", \"ULAS\" and \"LCS\" denote as Labeled attachment score, Unlabeled attachment score and Label accuracy score respectively.",
        "The experiments show that Catalan, Chinese and Spanish have projective property and others have non-projective property.",
        "To get the optimized system, three group features are used for comparison.",
        "• group 1: features 1-20 in Table 1.",
        "• group 2: features 1-31 in Table 1.",
        "• group 3: all features in Table 1.",
        "The performance of predicate classification on the development data of the six languages, which contain this subtask, are given in Table 3.",
        "The results",
        "Table 2: Performance of Syntactic Dependency Parsing with different modes.",
        "The above line is the performance of projective mode, while the below one is the performance of non-projective mode for each language.",
        "Table 3: Performance of predicate classification (F1 scores) for different group features on the development data of the six languages.",
        "show that Che's features and the degrees of the predicate and its arguments are useful for all languages, the former improves the labeled F1 measure by 0.3% to 5.4%, and the latter by 0.3% to 1.7%.",
        "In this phase, feature selection and performance lose caused by P-columns are studied.",
        "Firstly, we compare the following two group features:",
        "• group 1: The features except for the lemma plus sense number of the predicate in (Lu Li",
        "et al., 2008).",
        "Catalan",
        "84.18",
        "88.18",
        "91.76",
        "83.69",
        "87.74",
        "91.59",
        "Chinese",
        "72.58",
        "77.06",
        "82.07",
        "62.85",
        "69.47",
        "73.00",
        "Czech",
        "72.79",
        "81.40",
        "80.93",
        "73.18",
        "81.86",
        "81.30",
        "English",
        "86.89",
        "90.29",
        "91.50",
        "86.88",
        "90.34",
        "91.58",
        "German",
        "83.43",
        "86.89",
        "90.24",
        "84.00",
        "87.40",
        "90.61",
        "Japanese",
        "92.23",
        "93.16",
        "98.38",
        "92.23",
        "93.14",
        "98.45",
        "Spanish",
        "83.88",
        "87.93",
        "91.36",
        "83.46",
        "87.46",
        "91.37",
        "group 1",
        "group 2",
        "group 3",
        "Catalan",
        "75.51",
        "80.90",
        "82.23",
        "Chinese",
        "93.79",
        "94.99",
        "94.75",
        "Czech",
        "91.83",
        "91.77",
        "91.86",
        "English",
        "92.12",
        "92.48",
        "93.20",
        "German",
        "74.49",
        "74.14",
        "75.85",
        "Spanish",
        "74.01",
        "76.22",
        "76.53",
        "• group 2: groupl+the degrees of the predicate and its arguments presented in the last section.",
        "Secondly, features extracted from golden-columns and P-columns are both used for testing.",
        "The performance of them are given in Table 4, where \"LF1\", \"ULF1\" and \"PF1\" denote as Labeled F1 score, Unlabeled F1 score and Proposition F1 score respectively.",
        "The above line is the F1 scores of Semantic Role Labeling with different features.",
        "The uppermost line is the result of group1 features, the middle line is the result of group2 features extracted from P-columns, and the downmost one is the result of group2 features extracted from golden-columns for each language.",
        "The results show that the features of degree also improves the labeled F1 measure by 3.4% to 15.8%, the different labeled F1 between golden-columns and P-columns is about 2.9%-13.9%.",
        "In the final system, we select the optimized feature subset discussed in the former sections.",
        "The overall performance of the system on the development data, test data and Out-of-domain data are shown in Table 5 (all features are extracted from P-columns).",
        "The average Macro F1 Scores of our system are 73.97 on test data and 71.79 on Out-of-domain data.",
        "In Table 5, \"LAS\", \"LF1\" and \"M_LF1\" denote as Labeled accuracy score for Syntactic Dependency Parsing, Labeled F1 score for Semantic Role Labeling, and Overall Macro Labeled F1 score respectively.",
        "The topmost line is the result on the development data, the middle one is the result on the test data for each language and the downmost one is the result on the Out-of-domain data if the data exist."
      ]
    },
    {
      "heading": "4. Conclusion and Discussion",
      "text": [
        "We present a joint syntactic and semantic dependency parsing system for CoNLL2009 Shared Task, which composed of three components: a syntactic dependency parser, a predicate classifier and a semantic parser.",
        "All of them are built with some state-of-the-art methods.",
        "For the predicate classifier and the semantic parser, a new kind of features – degrees, which reflect the activeness of the words in a sentence improves their performance.",
        "In order to improve the performance further, we will study new machine learning methods for semantic dependency parsing, especially the joint learning methods, which can avoid the information loss problem ofour system.",
        "LF1",
        "ULFl",
        "PFl",
        "Catalan",
        "73.25",
        "92.69",
        "38.41",
        "72.71",
        "91.93",
        "35.22",
        "83.23",
        "100.00",
        "61.88",
        "Chinese",
        "69.60",
        "82.15",
        "28.35",
        "71.49",
        "81.71",
        "29.41",
        "85.44",
        "95.21",
        "58.20",
        "Czech",
        "80.62",
        "92.49",
        "70.04",
        "79.10",
        "91.44",
        "68.34",
        "85.42",
        "96.93",
        "77.78",
        "English",
        "73.91",
        "87.26",
        "33.16",
        "76.10",
        "88.58",
        "36.28",
        "79.35",
        "91.74",
        "43.32",
        "German",
        "64.85",
        "88.05",
        "27.21",
        "65.36",
        "88.63",
        "26.70",
        "72.78",
        "94.54",
        "41.50",
        "Japanese",
        "69.43",
        "82.79",
        "29.27",
        "69.87",
        "83.31",
        "29.69",
        "72.80",
        "87.13",
        "34.96",
        "Spanish",
        "73.49",
        "93.15",
        "39.64",
        "78.18",
        "91.68",
        "33.57",
        "81.96",
        "99.98",
        "59.20",
        "LAS",
        "LFl",
        "M_LF1",
        "Catalan",
        "84.18",
        "72.71",
        "81.46",
        "75.68",
        "66.95",
        "71.32",
        "Chinese",
        "72.58",
        "71.49",
        "72.20",
        "63.95",
        "67.06",
        "65.53",
        "Czech",
        "73.18",
        "79.10",
        "76.37",
        "72.60",
        "79.08",
        "75.85",
        "Czech-ood",
        "69.81",
        "79.80",
        "74.81",
        "English",
        "86.88",
        "76.10",
        "82.89",
        "86.61",
        "77.17",
        "81.92",
        "English-ood",
        "80.09",
        "67.21",
        "73.69",
        "German",
        "84.00",
        "65.36",
        "83.06",
        "79.85",
        "61.98",
        "70.93",
        "German-ood",
        "71.86",
        "61.83",
        "66.86",
        "Japanese",
        "92.23",
        "69.87",
        "83.77",
        "91.26",
        "69.58",
        "80.49",
        "Spanish",
        "83.88",
        "71.18",
        "80.74",
        "77.21",
        "66.23",
        "71.72"
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We would like to thank McDonald for providing the MSTParser program, to Zhang Le for providing the Maxent program.",
        "This research has been partially supported by the National Natural Science Foundation of China(No.60703015) and the National 863 Program of China (No.2006AA01Z197, No.2007AA01Z194)."
      ]
    }
  ]
}
