{
  "info": {
    "authors": [
      "Francesca Fallucchi",
      "Fabio Massimo Zanzotto"
    ],
    "book": "Proceedings of the Workshop on Geometrical Models of Natural Language Semantics",
    "id": "acl-W09-0209",
    "title": "SVD Feature Selection for Probabilistic Taxonomy Learning",
    "url": "https://aclweb.org/anthology/W09-0209",
    "year": 2009
  },
  "references": [
    "acl-C92-2082",
    "acl-N04-1016",
    "acl-P06-1015",
    "acl-P06-1101"
  ],
  "sections": [
    {
      "text": [
        "Fallucchi Francesca Fabio Massimo Zanzotto",
        "Disp, University \"Tor Vergata\" Disp, University \"Tor Vergata\"",
        "Rome, Italy Rome, Italy",
        "fallucchi@info.uniroma2.it zanzotto@info.uniroma2.it",
        "In this paper, we propose a novel way to include unsupervised feature selection methods in probabilistic taxonomy learning models.",
        "We leverage on the computation of logistic regression to exploit unsupervised feature selection of singular value decomposition (SVD).",
        "Experiments show that this way of using SVD for feature selection positively affects performances."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Taxonomies are extremely important knowledge repositories in a variety of applications for natural language processing and knowledge representation.",
        "Yet, manually built taxonomies such as WordNet (Miller, 1995) often lack in coverage when used in specific knowledge domains.",
        "Automatically creating or extending taxonomies for specific domains is then a very interesting area of research (O'Sullivan et al., 1995; Magnini and Speranza, 2001; Snow et al., 2006).",
        "Automatic methods for learning taxonomies from corpora often use distributional hypothesis (Harris, 1964) and exploit some induced lexical-syntactic patterns (Hearst, 1992; Pantel and Pennacchiotti, 2006).",
        "In these models, within a very large set, candidate word pairs are selected as new word pairs in hyperonymy and added to an existing taxonomy.",
        "Candidate pairs are represented in some feature space.",
        "Often, these feature spaces are huge and, then, models may take into consideration noisy features.",
        "In machine learning, feature selection has been often used to reduce the dimensions in huge feature spaces.",
        "This has many advantages, e.g., reducing the computational cost and improving performances by removing noisy features (Guyon and Elisseeff, 2003).",
        "In this paper, we propose a novel way to in probabilistic taxonomy learning models.",
        "Given the probabilistic taxonomy learning model introduced by (Snow et al., 2006), we leverage on the computation of logistic regression to exploit singular value decomposition (SVD) as unsupervised feature selection.",
        "SVD is used to compute the pseudo-inverse matrix needed in logistic regression.",
        "To describe our idea, we firstly review how SVD can be used as unsupervised feature selection (Sec.",
        "2).",
        "In Section 3 we then describe the probabilistic taxonomy learning model introduced by (Snow et al., 2006).",
        "We will then shortly review the logistic regression used to compute the taxonomy learning model to describe where SVD can be naturally used.",
        "We will describe our experiments in Sec. 4.",
        "Finally, we will draw some conclusions and describe our future work (Sec.",
        "5).",
        "2 Unsupervised feature selection with Singular Value Decomposition",
        "Singular value decomposition (SVD) is one of the possible factorization of a rectangular matrix that has been largely used in information retrieval for reducing the dimension of the document vector space (Deerwester et al., 1990).",
        "The decomposition can be defined as follows.",
        "Given a generic rectangular n x m matrix A, its singular value decomposition is:",
        "where U is a matrix n x r, VT is a r x m and £ is a diagonal matrix r x r. The two matrices U and V are unitary, i.e., UTU = I and VTV = I.",
        "The diagonal elements of the £ are the singular values such as Si > S2 > ... > Sr > 0 where r is the rank of the matrix A.",
        "For the decomposition, SVD exploits the linear combination of rows and columns of A.",
        "A first trivial way of using SVD as unsupervised",
        ", .Proceedings of the EACL 2009 Workshop on GEMS: GEometical Models of Natural Language Semantics, pases-66-73,",
        "clude unsupervisedAfeahiurereee.eection&r^t^o>ds§inoo9 Afejstjis^oredouctooaptiisi&gafo^ogwiisiigs Given e as set of training examples represented in a feature space of n features, we can observe it as a matrix, i.e. a sequence of examples E = (el...i-m).",
        "With SVD, the n x m matrix E can be factorized as E = U£VT.",
        "This factorization implies we can focus the learning problem on a new space using the transformation provided by the matrix U.",
        "This new space is represented by the matrix:",
        "where each example is represented with r new features.",
        "Each new feature is obtained as a linear combination of the original features, i.e. each feature vector eef can be seen as a new feature vector ' = UT eel.",
        "When the target feature space is big whereas the cardinality of the training set is small, i.e., n >> m, the application of SVD results in a reduction of the original feature space as the rank r of the matrix E is r < min(n, m).",
        "A more interesting way of using SVD as unsupervised feature selection model is to exploit its approximated computations, i.e. :",
        "A ~ Afc = Umxk£kxkVkxn where k is smaller than the rank r. The computation algorithm (Golub and Kahan, 1965) is allowed to stop at a given k different from the real rank r. The property of the singular values, i.e., Sl > S2 > ... > Sr > 0, guarantees that the first k are bigger than the discarded ones.",
        "There is a direct relation between the informativeness of the dimension and the value of the singular value.",
        "High singular values correspond to dimensions of the new space where examples have more variability whereas low singular values determine dimensions where examples have a smaller variability (see (Liu, 2007)).",
        "These dimensions can not be used as discriminative features in learning algorithms.",
        "The possibility of computing the approximated version of the matrix gives a powerful method for feature selection and filtering as we can decide in advance how many features or, better, linear combination of original features we want to use.",
        "As feature selection model, SVD is unsupervised in the sense that the feature selection is done without taking into account the final classes of the training examples.",
        "This is not always the case, feature selection models such as those based on Information Gain largely use the final classes of training examples.",
        "SVD as feature selection is independent from the classification problem."
      ]
    },
    {
      "heading": "3. Probabilistic Taxonomy Learning and SVD feature selection",
      "text": [
        "Recently, Snow et al.",
        "(2006) introduced a probabilistic model for learning taxonomies form corpora.",
        "This probabilistic formulation exploits the two well known hypotheses: the distributional hypothesis (Harris, 1964) and the exploitation of the lexico-syntactic patterns as in (Robison, 1970; Hearst, 1992).",
        "Yet, in this formulation, we can positively and naturally introduce our use of SVD as feature selection model.",
        "In the rest of this section we will firstly introduce the probabilistic model (Sec.",
        "3.1) and, then, we will describe how SVD is used as feature selector in the logistic regression that estimates the probabilities of the model.",
        "To describe this part we need to go in depth into the definition of the logistic regression (Sec.",
        "3.2) and the way of estimating the regression coefficients (Sec.",
        "3.3).",
        "This will open the possibility of describing how we exploit",
        "In the probabilistic formulation (Snow et al., 2006), the task of learning taxonomies from a corpus is seen as a probability maximization problem.",
        "The taxonomy is seen as a set T of assertions R over pairs Ritj.",
        "If Ritj is in T, i is a concept and j is one of its generalization (i.e., the direct or the indirect generalization).",
        "For example, Rdog,animai S T describes that dog is an animal.",
        "The main innovation of this probabilistic method is the ability of taking into account in a single probability the information coming from the corpus and an existing taxonomy T.",
        "The main probabilities are then: (1) the prior probability P(Ri;j S T) of an assertion Ri;j to belong to the taxonomy T and (2) the posterior probability P(Ri)j- S T jl?)",
        "of an assertion RiJ-to belong to the taxonomy T given a set of evidences \"e?",
        "i;j derived from the corpus.",
        "Evidences is a feature vector associated with a pair (i, j).",
        "For examples, a feature may describe how many times i and j are seen in patterns like \"i as j \" or \"i is a j \".",
        "These among many other features are indicators of an is-a relation between i and j (see (Hearst, 1992)).",
        "Given a set of evidences E over all the relevant word pairs, in (Snow et al., 2006), the probabilistic taxonomy learning task is defined as the problem of finding the taxonomy T that maximizes the probability of having the evidences E, i.e.:",
        "In (Snow et al., 2006), this maximization problem is solved with a local search.",
        "What is maximized at each step is the increase of the probability P (EjT) of the taxonomy when the taxonomy changes from T to T' = T U N where N are the relations added at each step.",
        "This increase ofprob-abilities is defined as multiplicative change A(N) as follows:",
        "The main innovation of the model in (Snow et al., 2006) is the possibility of adding at each step the best relation N = {Rjj} as well as N = I) that is Rjj with all the relations by the existing taxonomy.",
        "We will then experiment with our feature selection methodology in the two different models:",
        "flat: at each iteration step, a single relation is added, i.e. R^, = argmaxRij A(Ri)j-) inductive: at each iteration step, a set of relations is added, i.e.",
        "I(Rjj) where Rjj = argmaxRij A(1 (Rjj)).",
        "The last important fact is that it is possible to demonstrate that where k is a constant (see (Snow et al., 2006)) that will be neglected in the maximization process.",
        "This last equation gives the possibility ofusing the logistic regression as it is.",
        "In the next sections we will see how SVD and the related feature selection can be used to compute the odds.",
        "Logistic Regression (Cox, 1958) is a particular type of statistical model for relating responses Y to linear combinations of predictor variables X.",
        "It is a specific kind of Generalized Linear Model (see (Nelder and Wedderburn, 1972)) where its function is the logit function and the independent variable Y is a binary or dicothomic variable which has a Bernoulli distribution.",
        "The dependent variable Y takes value 0 or 1.",
        "The probability that",
        "Y has value 1 is function of the regressors x = ...,xfc).",
        "The probabilistic taxonomy learner model introduced in the previous section falls in the category of probabilistic models where the logistic regression can be applied as Ri;j S T is the binary dependent variable and i;j is the vector of its regressors.",
        "In the rest of the section we will see how the odds, i.e., the multiplicative change, can be computed.",
        "We start from formally describing the Logistic Regression Model.",
        "Given the two stochastic variables Y and X, we can define as p the probability of Y to be 1 given that X=x, i.e.:",
        "The distribution of the variable Y is a Bernulli distribution, i.e.:",
        "Y ~ Bernoulli(p)",
        "Given the definition of the logit(p) as:",
        "and given the fact that Y is aBernoullidistribution, the logistic regression foresees that the logit is a linear combination of the values of the regressors, i.e., where ///0,///^are called regression coefficients of the variables xl,xk respectively.",
        "Given the regression coefficients, it is possible to compute the probability of a given event where we observe the regressors x to be Y = 1 or in our case to belong to the taxonomy.",
        "This probability can be computed as follows:",
        "It is obviously trivial to determine the odds(Ri;j) related to the multiplicative change of the probabilistic taxonomy model.",
        "The odds is the ratio between the positive and the negative event.",
        "It is defined as follows:",
        "Then, it is strictly related with the logit, i.e.:",
        "The relationship between the possible values of the probability, odds and logit is show in the Table 1.",
        "The remaining problem is how to estimate the regression coefficients.",
        "This estimation is done using the maximal likelihood estimation to prepare a set of linear equations using the above logit definition and, then, solving a linear problem.",
        "This will give us the possibility of introducing the necessity of determining a pseudo-inverse matrix where we will use the singular value decomposition and its natural possibility of performing feature selection.",
        "Once we have the regression coefficients, we have the possibility of assigning estimating a probability P(Ri)j- S T I ij) given any configuration of the values of the regressors i;j, i.e., the observed values of the features.",
        "For sake of simplicity we will hereafter refer to i;j as 1.",
        "Let assume we have a multiset O of observations extracted from Y x E where Y S {0,1} and we know that some of them are positive observations (i.e., Y = 1) and some of them are negative observations (i.e., Y = 0).",
        "For each pairs the relative configuration 1 S E that appeared at least once in O, we can determine using the maximal likelihood estimation P (Y = 1I1).",
        "Then, from the equation of the logit (Eq.",
        "4), we have a linear equation system, i.e.:",
        "where Q is a matrix that includes a constant column of 1, necessary for the //0 of the linear combination of the values of the regression.",
        "Moreover it includes the transpose of the evidence matrix, i.e. E = (\"ef l...\"m).",
        "Therefore the matrix will be:",
        "The set of equations in Eq.",
        "7 can be solved using multiple linear regression.",
        "In their general form, the equations of multiple linear regression may be written as (Caron et al.,",
        "• y is a column vector n x 1 that includes the observed values of the dependent variables Yi,...,Yfc;",
        "• X is a matrix n x m of the values of the re-gressors that we have observed;",
        "• / is a column vector m x 1 of the regression coefficients;",
        "• e is a column vector including the stochastic components that have not been observed and that will not be considered later.",
        "In the case X is a rectangular and singular matrix, the system y = X/ has not a solution.",
        "Yet, it is possible to use the principle of the Least Square Estimation.",
        "This principle determines the solution / that minimize the residual norm, i.e.:",
        "This problem can be solved by the Moore-Penrose pseudoinverse X+ (Penrose, 1955).",
        "Then, the final equation to determine the ß is",
        "It is important to remark that if the inverse matrix exist X + = X-and that X+X and XX + are symmetric.",
        "For our case, the following equation is valid:",
        "We finally reached the point where it is possible to explain our idea that is naturally using singular value decomposition (SVD) as feature selection in a probabilistic taxonomy learner.",
        "In the previous sections we described how the probabilities of the taxonomy learner can be estimated using logistic regressions and we concluded that a way to determine the regression coefficients // is computing the Moore-Penrose pseudoinverse Q+.",
        "It is possible to compute the Moore-Penrose pseudoinverse using the SVD in the following way (Penrose, 1955).",
        "Given an SVD decomposition of the matrix Q = U£VT the pseudo-inverse matrix that minimizes the Eq.",
        "9 is:",
        "Probability",
        "Odds",
        "Logit",
        "O < p < O.5",
        "[O, l)",
        "(-oo, O]",
        "O.5 <p < l",
        "[l, oo)",
        "[O, oo)",
        "The diagonal matrix £+ is a matrix r x r obtained first transposing £ and then calculating the reciprocals of the singular value of £.",
        "So the diagonal elements of the £+ are j-, ^,, ;r.",
        "We have now our opportunity of using SVD as natural feature selector as we can compute different approximations of the pseudo-inverse matrix.",
        "As we saw in Sec. 2, the algorithm for computing the singular value decomposition can be stopped a different dimensions.",
        "We called k the number of dimensions.",
        "As we can obtain different SVD as approximations of the original matrix (Eq.",
        "2), we can define different approximations of:",
        "Q+ ~ Q+ = Vnxk£fcxfcUTxm",
        "In our experiments we will use different values of k to explore the benefits of SVD as feature selector."
      ]
    },
    {
      "heading": "4. Experimental Evaluation",
      "text": [
        "In this section, we want to empirically explore whether our use of SVD feature selection positively affects performances of the probabilistic taxonomy learner.",
        "The best way of determining how a taxonomy learner is performing is to see if it can replicate an existing \"taxonomy\".",
        "We will experiment with the attempt of replicating a portion of WordNet (Miller, 1995).",
        "In the experiments, we will address two issues: 1) determining to what extent SVD feature selection affect performances of the taxonomy learner; 2) determining if SVD as unsupervised feature selection is better for the task than some simpler model for taxonomy learning.",
        "We will explore the effects on both the flat and the inductive probabilistic taxonomy learner.",
        "The rest of the section is organized as follows.",
        "In Sec. 4.1 we will describe the experimental setup in terms of: how we selected the portion of WordNet, the description of the corpus used to extract evidences, a description of the feature space we used, and, finally, the description of a baseline models for taxonomy learning we have used.",
        "In Sec. 4.2 we will present the results of the experiments in term of performance.",
        "To completely define the experiments we need to describe some issues: how we defined the taxonomy to replicate, which corpus we have used to extract evidences for pairs of words, which feature space we used, and, finally, the baseline model we compared our feature selection model against.",
        "As target taxonomy we selected a portion of WordNet (Miller, 1995).",
        "Namely, we started from the 44 concrete nouns listed in (McRae et al., 2005) and divided in 3 classes: animal, artifact, and vegetable.",
        "For sake of comprehension, this set is described in Tab.",
        "2.",
        "For each word w, we selected the synset sw that is compliant with the class it belongs to.",
        "We then obtained a set S of synsets (see Tab.",
        "2).",
        "We then expanded the set to S' adding the siblings (i.e., the coordinate terms) for each synset in S. The set S' contains 265 coordinate terms plus the 44 original concrete nouns.",
        "For each element in S we collected its hyperonym, obtaining the set H. We then removed from the set H the 4 topmosts: entity, unit, object, and whole.",
        "The set H contains 77 hyperonyms.",
        "For the purpose of the experiments we both derived from the previous sets a taxonomy T and produced a set of negative examples T. The two sets have been obtained as follows.",
        "The taxonomy T is the portion of WordNet implied by O = H U S', i.e., T contains all the (s, h) S O x O that are in WordNet.",
        "On the contrary, T contains all the (s, h) S O x O that are not in WordNet.",
        "We then have 5108 positive pairs in T and 52892 negative pairs in T.",
        "We then split the set T U T in two parts, training and testing.",
        "As we want to see if it is possible to attach the set S' to the right hyperonym, the split has been done as follows.",
        "We randomly divided the set S' in two parts Strand Sts, respectively, of 70% and 30% of the original S'.",
        "We then selected as training Ttr all the pairs in T containing a synset in Strand as testing set Tts those pairs of T containing a synset of Sts.",
        "For the probabilistic model, Ttr is the initial taxonomy whereas Tts U T is the unknown set.",
        "As corpus we used the English Web as Corpus (ukWaC) (Ferraresi et al., 2008).",
        "This is a web extracted corpus of about 2700000 web pages containing more than 2 billion words.",
        "The corpus contains documents of different topics such as web, computers, education, public sphere, etc..",
        "It has been largely demonstrated that the web documents are good models for natural language (Lapata and",
        "Keller, 2004).",
        "As the focus of the paper is the analysis of the effect of the SVD feature selection, we used as feature spaces both n-grams and bag-of-words.",
        "Out of the T U T, we selected only those pairs that appeared at a distance of at most 3 tokens.",
        "Using these 3 tokens, we generated three spaces: (1) 1-gram that contains monograms, (2) 2-gram that contains monograms and bigrams, and (3) the 3-gram space that contains monograms, bigrams, and trigrams.",
        "For the purpose of this experiment, we used a reduced stop list as classical stop words as punctuation, parenthesis, the verb to be are very relevant in the context of features for learning a taxonomy.",
        "Finally, we want to describe our baseline model for taxonomy learning.",
        "This model only contains Heart's patterns (Hearst, 1992) as features.",
        "The feature value is the point-wise mutual information.",
        "These features are in some sense the best features for the task as these have been manually selected after a process of corpus analysis.",
        "These baseline features are included in our 3-gram model.",
        "We can then compare our best models with this baseline features in order to see if our SVD feature selection model outperforms manual feature selection.",
        "In the first set of experiments we want to focus on the issue whether or not performances of the probabilistic taxonomy learner is positively affected by the proposed feature selection model based on the singular value decomposition.",
        "We then determined the performance with respect to different values of k. This latter represents the number of surviving dimensions where the pseudo-inverse is computed.",
        "Then, it represents the number of features the model adopts.",
        "We performed this first set of experiments in the 1-gram feature space.",
        "Punctuation has been considered.",
        "Figure 1 plots the accuracy of the probabilistic learner with respect to the size of the feature set, i.e. the number k of single values considered for computing the pseudoinverse matrix.",
        "To determine if the effect of the feature selection is preserved during the iteration of the local search algorithm, we report curves at different sizes of the set of added pairs.",
        "Curves are inductive accuracy",
        "Concrete nouns",
        "Clas",
        "Sense",
        "Concrete nouns",
        "Clas",
        "Sense",
        "1",
        "banana",
        "Vegetable",
        "1",
        "23",
        "boat",
        "Artifact",
        "0",
        "2",
        "bottle",
        "Artifact",
        "0",
        "24",
        "bowl",
        "Artifact",
        "0",
        "3",
        "car",
        "Artifact",
        "0",
        "25",
        "cat",
        "Animal",
        "0",
        "4",
        "cherry",
        "Vegetable",
        "2",
        "26",
        "chicken",
        "Animal",
        "1",
        "5",
        "chisel",
        "Artifact",
        "0",
        "27",
        "corn",
        "Vegetable",
        "2",
        "6",
        "cow",
        "Animal",
        "0",
        "28",
        "cup",
        "Artifact",
        "0",
        "7",
        "dog",
        "Animal",
        "0",
        "29",
        "duck",
        "Animal",
        "0",
        "8",
        "eagle",
        "Animal",
        "0",
        "30",
        "elephant",
        "Animal",
        "0",
        "9",
        "hammer",
        "Artifact",
        "1",
        "31",
        "helicopter",
        "Artifact",
        "0",
        "10",
        "kettle",
        "Artifact",
        "0",
        "32",
        "knife",
        "Artifact",
        "0",
        "11",
        "lettuce",
        "Vegetable",
        "2",
        "33",
        "lion",
        "Animal",
        "0",
        "12",
        "motorcycle",
        "Artifact",
        "0",
        "34",
        "mushroom",
        "Vegetable",
        "4",
        "13",
        "onion",
        "Vegetable",
        "2",
        "35",
        "owl",
        "Animal",
        "0",
        "14",
        "peacock",
        "Animal",
        "1",
        "36",
        "pear",
        "Vegetable",
        "0",
        "15",
        "pen",
        "Artifact",
        "0",
        "37",
        "pencil",
        "Artifact",
        "0",
        "16",
        "penguin",
        "Animal",
        "0",
        "38",
        "pig",
        "Animal",
        "0",
        "17",
        "pineapple",
        "Vegetable",
        "1",
        "39",
        "potato",
        "Vegetable",
        "2",
        "18",
        "rocket",
        "Artifact",
        "0",
        "40",
        "scissors",
        "Artifact",
        "0",
        "19",
        "screwdriver",
        "Artifact",
        "0",
        "41",
        "ship",
        "Artifact",
        "0",
        "20",
        "snail",
        "Animal",
        "0",
        "42",
        "spoon",
        "Artifact",
        "0",
        "21",
        "swan",
        "Animal",
        "0",
        "43",
        "telephone",
        "Artifact",
        "1",
        "22",
        "truck",
        "Artifact",
        "0",
        "44",
        "turtle",
        "Animal",
        "1",
        "'V^zO addlfdpairs 40 added pairs 60 added pairs 80 added pairs 100 added pairs"
      ]
    },
    {
      "heading": "40. added pairs 80 added pairs 130 added pairs",
      "text": [
        "k: dimension of the reduced space added pairs reported for both the flat model and the inductive model.",
        "The flat algorithm adds one pair at each iteration.",
        "Then, we reported curves for each 20 added pairs.",
        "Each curve shows that accuracy does not increase after a dimension of k=700.",
        "This size of the space is necessary only for the first 20 added pairs.",
        "Accuracy keeps increasing to k=700 and then decreases.",
        "When we add more pairs, the optimal size of the space is around k=200.",
        "For the inductive model we report the accuracies for around 40, 80, 130 added pairs.",
        "Here, at each iteration, more than one pair is added.",
        "The optimal dimension of the feature space seems to be around 500 as after that value performances decrease or stay stable.",
        "SVD feature selection has then a positive effect for both the flat and the inductive probabilistic taxonomy learners.",
        "This has beneficial effects both on the performances and on the computation time.",
        "In the second set of experiments we want to determine whether or not SVD feature selection for the probabilistic taxonomy learner behaves better than a reduced set of known features.",
        "We then fixed the dimension k to 400 and we compared the baseline model with different probabilistic models with different feature sets: 1-gram, 2-gram, and 3-gram.",
        "We can consider that the trigram model before the cut on its dimensions contains feature subsuming the baseline model.",
        "Figure 2 shows results.",
        "Curves report accuracy after n added pairs.",
        "All the probabilistic models outperform the baseline model.",
        "As what happened for the first series of experiments (see Fig. 1) more informative spaces such as 3-gram behaves better when the number of added pairs is small.",
        "Performances of the three reduced pairs become similar after 100 added pairs.",
        "These experiments show that SVD feature selection has a positive effect on performances as resulting models are always better with respect to the baseline."
      ]
    },
    {
      "heading": "5. Conclusions and Future Work",
      "text": [
        "We presented a model to naturally introduce SVD feature selection in a probabilistic taxonomy learner.",
        "The method is effective as allows the designing of better probabilistic taxonomy learners.",
        "We still need to explore at least two issues.",
        "First, we need to determine whether or not the positive effect of SVD feature selection is preserved in more complex feature spaces such as syntactic feature spaces as those used in (Snow et al., 2006).",
        "Second, we need to compare the SVD feature selection with other unsupervised feature selection models to determine whether or not this is the best method to use in the case of probabilistic taxonomy learning."
      ]
    }
  ]
}
