{
  "info": {
    "authors": [
      "Daisuke Okanohara",
      "Jun'ichi Tsujii"
    ],
    "book": "HLT-NAACL, Companion Volume: Short Papers",
    "id": "acl-N09-2025",
    "title": "Learning Combination Features with L1 Regularization",
    "url": "https://aclweb.org/anthology/N09-2025",
    "year": 2009
  },
  "references": [
    "acl-C04-1002",
    "acl-P06-1029",
    "acl-P07-1104",
    "acl-W04-3239"
  ],
  "sections": [
    {
      "text": [
        "Learning Combination Features with L\\ Regularization",
        "Daisuke Okanoharaj Jun'ichi Tsujii|J§",
        "When linear classifiers cannot successfully classify data, we often add combination features, which are products of several original features.",
        "The searching for effective combination features, namely feature engineering, requires domain-specific knowledge and hard work.",
        "We present herein an efficient algorithm for learning an L1 regularized logistic regression model with combination features.",
        "We propose to use the grafting algorithm with efficient computation of gradients.",
        "This enables us to find optimal weights efficiently without enumerating all combination features.",
        "By using L1 regularization, the result we obtain is very compact and achieves very efficient inference.",
        "In experiments with NLP tasks, we show that the proposed method can extract effective combination features, and achieve high performance with very few features."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "A linear classifier is a fundamental tool for many NLP applications, including logistic regression models (LR), in that its score is based on a linear combination of features and their weights,.",
        "Although a linear classifier is very simple, it can achieve high performance on many NLP tasks, partly because many problems are described with very high-dimensional data, and high dimensional weight vectors are effective in discriminating among examples.",
        "However, when an original problem cannot be handled linearly, combination features are often added to the feature set, where combination features are products of several original features.",
        "Examples of combination features are, word pairs in document classification, or part-of-speech pairs of head and modifier words in a dependency analysis task.",
        "However, the task of determining effective combination features, namely feature engineering, requires domain-specific knowledge and hard work.",
        "Such a non-linear phenomenon can be implicitly captured by using the kernel trick.",
        "However, its computational cost is very high, not only during training but also at inference time.",
        "Moreover, the model is not interpretable, in that effective features are not represented explicitly.",
        "Many kernels methods assume an L2 regularizer, in that many features are equally relevant to the tasks (Ng, 2004).",
        "There have been several studies to find efficient ways to obtain (combination) features.",
        "In the context of boosting, Kudo (2004) have proposed a method to extract complex features that is similar to the item set mining algorithm.",
        "In the context of Li regularization.",
        "Dudfk (2007), Gao (2006), and Tsuda (2007) have also proposed methods by which effective features are extracted from huge sets offea-ture candidates.",
        "However, their methods are still very computationally expensive, and we cannot directly apply this kind of method to a large-scale NLP problem.",
        "In the present paper, we propose a novel algorithm for learning of an Li regularized LR with combination features.",
        "In our algorithm, we can exclusively extract effective combination features without enumerating all of the candidate features.",
        "Our method relies on a grafting algorithm (Perkins and Theeiler, 2003), which incrementally adds features like boosting, but it can converge to the global optimum.",
        "We use Li regularization because we can obtain a sparse parameter vector, for which many of the parameter values are exactly zero.",
        "In other words, learning with Li regularization naturally has an intrinsic effect of feature selection, which results in an efficient and interpretable inference with almost the same performance as L2 regularization (Gao et al., 2007).",
        "The heart of our algorithm is a way to find a feature that has the largest gradient value of likelihood from among the huge set of candidates.",
        "To solve this problem, we propose an example-wise algorithm with filtering.",
        "This algorithm is very simple and easy to implement, but effective in practice.",
        "We applied the proposed methods to NLP tasks, and found that our methods can achieve the same high performance as kernel methods, whereas the number of active combination features is relatively small, such as several thousands."
      ]
    },
    {
      "heading": "2. Preliminaries",
      "text": [
        "In this paper, we consider a multi-class logistic regression model (LR).",
        "For an input x, and an output label y e Y, we define a feature vector <<<(x, y) e Rm.",
        "Then in LR, the probability for a label y, given an input x, is defined as follows:",
        "where w e Rm is a weight vector corresponding to each input dimension, and Z(x, w) = J2y exp(wT0(x, y)) is the partition function.",
        "We estimate the parameter w by a maximum likelihood estimation (MLE) with Li regularization using training examples {(xi, yi),..., (x„, y„)}:",
        "where C > 0 is the trade-off parameter between the likelihood term and the regularization term.",
        "This estimation is a convex optimization problem.",
        "To maximize the effect of Li regularization, we use the grafting algorithm (Perkins and Theeiler, 2003); namely, we begin with the empty feature set, and incrementally add effective features to the current problem.",
        "Note that although this is similar to the boosting algorithm for learning, the obtained result is always optimal.",
        "We explain the grafting algorithm here again for the sake of clarity.",
        "The grafting algorithm is summarized in Algorithm 1.",
        "In this algorithm we retain two variables; w stores the current weight vector, and H stores the set of features with a non-zero weight.",
        "Initially, we set w = 0, and H = {}.",
        "At each iteration, the feature is selected that has the largest absolute value of the gradient of the likelihood.",
        "Let vk = ^^^r be the gradient value of the likelihood of a feature k. By following the definition, the value vk can be calculated as follows, where a%y = /(y% = y) – p(y%|x%; w) and /(a) is 1 if a is true and 0 otherwise.",
        "Then, we add k* = arg maxk |vk | to H and optimize (2) with regard to H only.",
        "The solution w that is obtained is used in the next search.",
        "The iteration is continued until |v*| < C.",
        "We briefly explain why we can find the optimal weight by this algorithm.",
        "Suppose that we optimize (2) with all features, and initialize the weights using the results obtained from the grafting algorithm.",
        "Since all gradients of likelihoods satisfy |vk| < C, and the regularization term pushes the weight toward 0 by C, any changes of the weight vector cannot increase the objective value in (2).",
        "Since (2) is the convex optimization problem, the local optimum is always the global optimum, and therefore this is the global optimum for (2)",
        "The point is that, given an efficient method to estimate v* without the enumeration of all features, we can solve the optimization in time proportional to the active feature, regardless of the number of candidate features.",
        "We will discuss this in the next section."
      ]
    },
    {
      "heading": "3. Extraction of Combination Features",
      "text": [
        "This section presents an algorithm to compute, for combination features, the feature v* that has the largest absolute value of the gradient.",
        "We propose an element-wise extraction method, where we make use of the sparseness of the training data.",
        "In this paper, we assume that the values of the combination features are less than or equal to the original ones.",
        "This assumption is typical; for example, it is made in the case where we use binary values for original and combination features.",
        "Algorithm 1 Grafting v = (L(w) is the log likelihood term) k* = arg max|vfc | (The result of Algorithm 2) if |vk* | < C then break",
        "Optimize w with regards to H end loop Output w and H",
        "First, we sort the examples in the order of their values.",
        "Then, we look at the examples one by one.",
        "Let us assume that r examples have been examined so far.",
        "Let us define where a~y = min(a%;y, 0) and a+y = max(a%,y, 0).",
        "Then, simple calculus shows that the gradient value for a combination feature k, vk, for which the original features are k1 and k2, is bounded below/above thus; tk + max(t-i,tfc2) < vk < tk + min(t+i,t+2).",
        "Intuitively, the upper bound of (5) is the case where the combination feature fires only for the examples with a%,y > 0, and the lower bound of (5is the case where the combination feature fires only for the examples with a%,y < 0.",
        "The second inequality arises from the fact that the value of a combination feature is equal to or less than the values of its original features.",
        "Therefore, we examine (5) and check whether or not | vk| will be larger than C. If not, we can remove the feature safely.",
        "Since the examples are sorted in the order of their Ey |a%,y |, the bound will become tighter quickly.",
        "Therefore, many combination features are filtered out in the early steps.",
        "In experiments, the weights for the original features are optimized first, and then the weights for combination features are optimized.",
        "This significantly reduces the number of candidates for combination features.",
        "Algorithm 2 Algorithm to return the feature that has the largest gradient value.",
        "Input: training data (x%,y%) and its a%>y value (i = 1,..., n, y = 1,..., | Y|), and the parameter C. Examples are sorted with respect to their Ey |a%,y | values.",
        "t = 0, H = {} // Active Combination Feature for i = 1 to n and y e Y do",
        "for all combination features k in x do if | vk| > C (Check by using Eq.",
        "(5) ) then",
        "end if end for Output: argmaxkeH vk",
        "Algorithm 2 presents the details of the overall algorithm for the extraction of effective combination features.",
        "Note that many candidate features will be removed just before adding."
      ]
    },
    {
      "heading": "4. Experiments",
      "text": [
        "To measure the effectiveness of the proposed method (called Li -Comb), we conducted experiments on the dependency analysis task, and the document classification task.",
        "In all experiments, the parameter C was tuned using the development data set.",
        "In the first experiment, we performed Japanese dependency analysis.",
        "We used the Kyoto Text Corpus (Version 3.0), Jan. 1, 3-8 as the training data, Jan. 10 as the development data, and Jan. 9 as the test data so that the result could be compared to those from previous studies (Sassano, 2004).",
        "We used the shift-reduce dependency algorithm (Sassano, 2004).",
        "The number of training events was 11, 3332, each of which consisted of two word positions as inputs, and y = {0,1} as an output indicating the dependency relation.",
        "For the training data, the number of original features was 78570, and the number of combination features of degrees 2 and 3 was 5787361, and 169430335, respectively.",
        "Note that we need not see all of them using our algorithm.",
        "Table 1: The performance of the Japanese dependency task on the Test set.",
        "The active features column shows the number of nonzero weight features.",
        "In all experiments, combination features of degrees 2 and 3 (the products of two or three original features) were used.",
        "We compared our methods using LR with Li regularization using original features (Li-Original), SVM with a 3rd-polynomial Kernel, LR with L2regularization using combination features with up to 3 combinations (L2-Comb3), and an averaged per-ceptron with original features (Ave. Perceptron).",
        "Table 1 shows the result of the Japanese dependency task.",
        "The accuracy result indicates that the accuracy was improved with automatically extracted combination features.",
        "In the column of active features, the number of active features is listed.",
        "This indicates that Li regularization automatically selects very few effective features.",
        "Note that, in training, Li-Comb used around 100 MB, while L2-Comb3 used more than 30 GB.",
        "The most time consuming part for Li-Comb was the optimization of the Li-LR problem.",
        "Examples of extracted combination features include POS pairs of head and modifiers, such as Hea^Noun-Modifier/Noun, and combinations of distance features with the POS of head.",
        "For the second experiment, we performed the document classification task using the Tech-TC-300 data set (Davidov et al., 2004).",
        "We used the tf-idf scores as feature values.",
        "We did not filter out any words beforehand.",
        "The Tech-TC-300 data set consists of 295 binary classification tasks.",
        "We divided each document set into a training and a test set.",
        "The ratio of the test set to the training set was 1 : 4.",
        "The average number of features for tasks was 25, 389.",
        "Table 2 shows the results for Li-LR with combination features and SVM with linear kernel.",
        "The results indicate that the combination features are effective.",
        "Table 2: Document classification results for the Tech-TC-300 data set.",
        "The column F2 shows the average of F2scores for each method of classification."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "We have presented a method to extract effective combination features for the Li regularized logistic regression model.",
        "We have shown that a simple filtering technique is effective for enumerating effective combination features in the grafting algorithm, even for large-scale problems.",
        "Experimental results show that a Li regularized logistic regression model with combination features can achieve comparable or better results than those from other methods, and its result is very compact and easy to interpret.",
        "We plan to extend our method to include more complex features, and apply it to structured output learning.",
        "Dep.",
        "Train",
        "Active",
        "Acc.",
        "(%)",
        "Time (s)",
        "Feat.",
        "L1 -Comb",
        "89.03",
        "605",
        "78002",
        "L1 -Orig",
        "88.50",
        "35",
        "29166",
        "Svm 3-poly",
        "88.72",
        "35720",
        "(Kernel)",
        "L2-Comb3",
        "89.52",
        "22197",
        "91477782",
        "Ave. Perce.",
        "87.23",
        "5",
        "45089",
        "F2",
        "Li-Comb",
        "0.949",
        "Li-Orig",
        "0.917",
        "SVM (Linear Kernel)",
        "0.896"
      ]
    }
  ]
}
