{
  "info": {
    "authors": [
      "Boxing Chen",
      "Min Zhang",
      "Haizhou Li",
      "Aiti Aw"
    ],
    "book": "ACL-IJCNLP",
    "id": "acl-P09-1106",
    "title": "A Comparative Study of Hypothesis Alignment and its Improvement for Machine Translation System Combination",
    "url": "https://aclweb.org/anthology/P09-1106",
    "year": 2009
  },
  "references": [
    "acl-C04-1183",
    "acl-C08-1005",
    "acl-C08-1014",
    "acl-D07-1029",
    "acl-D08-1011",
    "acl-E06-1005",
    "acl-E06-1031",
    "acl-J00-2004",
    "acl-J03-1002",
    "acl-N04-1022",
    "acl-N07-1029",
    "acl-P02-1040",
    "acl-P03-1021",
    "acl-P05-3026",
    "acl-P06-1066",
    "acl-P07-1040",
    "acl-P07-2045",
    "acl-P08-1064",
    "acl-P08-2021",
    "acl-W06-3110",
    "acl-W08-0329"
  ],
  "sections": [
    {
      "text": [
        "Boxing Chen*, Min Zhang, Haizhou Li and Aiti Aw",
        "Institute for Infocomm Research 1 Fusionopolis Way, 138632 Singapore (bxchen, mzhang, hli, aaiti}@i2r.a-star.edu.sg",
        "Recently confusion network decoding shows the best performance in combining outputs from multiple machine translation (MT) systems.",
        "However, overcoming different word orders presented in multiple MT systems during hypothesis alignment still remains the biggest challenge to confusion network-based MT system combination.",
        "In this paper, we compare four commonly used word alignment methods, namely GIZA++, TER, CLA and IHMM, for hypothesis alignment.",
        "Then we propose a method to build the confusion network from intersection word alignment, which utilizes both direct and inverse word alignment between the backbone and hypothesis to improve the reliability of hypothesis alignment.",
        "Experimental results demonstrate that the intersection word alignment yields consistent performance improvement for all four word alignment methods on both Chinese-to-English spoken and written language tasks."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Machine translation (MT) system combination technique leverages on multiple MT systems to achieve better performance by combining their outputs.",
        "Confusion network based system combination for machine translation has shown promising advantage compared with other techniques based system combination, such as sentence level hypothesis selection by voting and source sentence re-decoding using the phrases or translation models that are learned from the source sentences and target hypotheses pairs (Rosti et al., 2007a; Huang and Papineni, 2007).",
        "In general, the confusion network based system combination method for MT consists of four steps: 1) Backbone selection: to select a backbone (also called \"skeleton\") from all hypotheses.",
        "The backbone defines the word orders of the final translation.",
        "2) Hypothesis alignment: to build word-alignment between backbone and each hypothesis.",
        "3) Confusion network construction: to build a confusion network based on hypothesis alignments.",
        "4) Confusion network decoding: to decode the best translation from a confusion network.",
        "Among the four steps, the hypothesis alignment presents the biggest challenge to the method due to the varying word orders between outputs from different MT systems (Rosti et al., 2007).",
        "Many techniques have been studied to address this issue.",
        "Bangalore et al.",
        "(2001) used the edit distance alignment algorithm which is extended to multiple strings to build confusion network, it only allows monotonic alignment.",
        "Jayaraman and Lavie (2005) proposed a heuristic-based matching algorithm which allows nonmonotonic alignments to align the words between the hypotheses.",
        "More recently, Matusov et alignment for hypotheses pairs.",
        "Sim et al.",
        "(2007), minimum Translation Error Rate (TER) (Snover et al., 2006) alignment to build the confusion network.",
        "Rosti et al.",
        "(2008) extended TER algorithm which allows a confusion network as the reference to compute word alignment.",
        "Karakos et al.",
        "(2008) used ITG-based method for hypothesis alignment.",
        "Chen et al.",
        "(2008) used Competitive align the words to construct confusion network.",
        "Ayan et al.",
        "(2008) proposed to improve alignment of hypotheses using synonyms as found in WordNet (Fellbaum, 1998) and a two-pass alignment strategy based on TER word alignment approach.",
        "He et al.",
        "(2008) proposed an IHMM-based word alignment method which the parameters are estimated indirectly from a variety of sources.",
        "Although many methods have been attempted, no systematic comparison among them has been reported.",
        "A through and fair comparison among them would be of great meaning to the MT system combination research.",
        "In this paper, we implement a confusion network-based decoder.",
        "Based on this decoder, we compare four commonly used word alignment methods (GIZA++, TER, CLA and IHMM) for hypothesis alignment using the same experimental data and the same multiple MT system outputs with similar features in terms of translation performance.",
        "We conduct the comparison study and other experiments in this paper on both spoken and newswire domains: Chinese-to-English spoken and written language translation tasks.",
        "Our comparison shows that although the performance differences between the four methods are not significant, IHMM consistently show slightly better performance than other methods.",
        "This is mainly due to the fact the IHMM is able to explore more knowledge sources and Viterbi decoding used in IHMM allows more thorough search for the best alignment while other methods has to use less optimal greedy search.",
        "In addition, for better performance, instead of only using one direction word alignment (n-to-1 from hypothesis to backbone) as in previous work, we propose to use more reliable word alignments which are derived from the intersection of two-direction hypothesis alignment to construct confusion network.",
        "Experimental results show that the intersection word alignment-based method consistently improves the performance for all four methods on both spoken and written language tasks.",
        "This paper is organized as follows.",
        "Section 2 presents a standard framework of confusion network based machine translation system combination.",
        "Section 3 introduces four word alignment methods, and the algorithm of computing intersection word alignment for all four word alignment methods.",
        "Section 4 describes the experiments setting and results on two translation tasks.",
        "Section 5 concludes the paper."
      ]
    },
    {
      "heading": "2. Confusion network based system combination",
      "text": [
        "In order to compare different hypothesis alignment methods, we implement a confusion network decoding system as follows:",
        "Backbone selection: in the previous work, Matusov et al.",
        "(2006, 2008) let every hypothesis play the role of the backbone (also called \"skeleton\" or \"alignment reference\") once.",
        "We follow the work of (Sim et al., 2007; Rosti et al., 2007a; Rosti et al., 2007b; He et al., 2008) and choose the hypothesis that best agrees with other hypotheses on average as the backbone by applying Minimum Bayes Risk (MBR) decoding (Kumar and Byrne, 2004).",
        "TER score (Snover et al., 2006) is used as the loss function in MBR decoding.",
        "Given a hypothesis set H, the backbone can be computed using the following equation, where TER (•, •) returns the TER score of two hypotheses.",
        "Hypothesis alignment: all hypotheses are word-aligned to the corresponding backbone in a many-to-one manner.",
        "We apply four word alignment methods: GIZA++-based, TER-based, CLA-based, and IHMM-based word alignment algorithm.",
        "For each method, we will give details in the next section.",
        "Confusion network construction: confusion network is built from one-to-one word alignment; therefore, we need to normalize the word alignment before constructing the confusion network.",
        "The first normalization operation is removing duplicated links, since GIZA++ and IHMM-based word alignments could be n-to-1 mappings between the hypothesis and backbone.",
        "Similar to the work of (He et al., 2008), we keep the link which has the highest similarity measure S (ej, et) based on surface matching score, such as the length of maximum common subsequence (MCS) of the considered word pair.",
        "where MCS (ej, et) is the maximum common subsequence of word ej and et ; len(.)",
        "is a function to compute the length of letter sequence.",
        "The other hypothesis words are set to align to the null word.",
        "For example, in Figure 1, e^and e3 are aligned to the same backbone word e2 , we remove the link between",
        "S(e3, e2) < S(e[, e2) , as shown in Figure 1 (b).",
        "The second normalization operation is reordering the hypothesis words to match the word order of the backbone.",
        "The aligned words are reordered according to their alignment indices.",
        "To reorder the null-aligned words, we need to first insert the null words into the proper position in the backbone and then reorder the null-aligned hypothesis words to match the nulls on the backbone side.",
        "Reordering null-aligned words varies based to the word alignment method in the previous work.",
        "We reorder the null-aligned word following the approach of Chen et al.",
        "(2008) with some extension.",
        "The null-aligned words are reordered with its adjacent word: moving with its left word (as Figure 1 (c)) or right word (as Figure 1 (d)).",
        "However, to reduce the possibility of breaking a syntactic phrase, we extend to choose one of the two above operations depending on which one has the higher likelihood with the current null-aligned word.",
        "It is implemented by comparing two association scores based on cooccurrence frequencies.",
        "They are association score of the null-aligned word and its left word, or the null-aligned word and its right word.",
        "We use point-wise mutual information (MI) as Equation 3 to estimate the likelihood.",
        "p(ej) p(ej+1)where p(eie+1) is the occurrence probability of bigram ee+1 observed in the hypothesis list; p(e ) and p(e +1 ) are probabilities of hypothesis word e and e +1 respectively.",
        "In example of Figure 1, we choose (c) if MI(e'2,e3) >MI(e'3,e\\) , otherwise, word is reordered as (d).",
        "Confusion network decoding: the output translations for a given source sentence are extracted from the confusion network through a beam-search algorithm with a log-linear combination of a set of feature functions.",
        "The feature functions which are employed in the search process are:",
        "• Language model(s),",
        "• Direct and inverse IBM model-1,",
        "• Position-based word posterior probabilities (arc scores of the confusion network),",
        "• Word penalty,",
        "• N-gram posterior probabilities (Zens and",
        "Ney, 2006).",
        "The n-grams used in the last two feature functions are collected from the original hypotheses list from each single system.",
        "The weights of feature functions are optimized to maximize the scoring measure (Och, 2003)."
      ]
    },
    {
      "heading": "3. Word alignment algorithms",
      "text": [
        "We compare four word alignment methods which are widely used in confusion network based system combination or bilingual parallel corpora word alignment.",
        "words between the backbone and hypothesis.",
        "This method uses enhanced HMM model bootstrapped from IBM Model-1 to estimate the alignment model.",
        "All hypotheses of the whole test set are collected to create sentence pairs for GIZA++ training.",
        "GIZA++ produces hypothesis-backbone many-to-1 word alignments.",
        "TER-based: TER-based word alignment method (Sim et al., 2007; Rosti et al., 2007a; Rosti et al., 2007b) is an extension of multiple string matching algorithm based on Levenshtein edit distance (Bangalore et al., 2001).",
        "The TER (translation error rate) score (Snover et al., 2006) measures the ratio of minimum number of string edits between a hypothesis and reference where the edits include insertions, deletions, substitutions and phrase shifts.",
        "The hypothesis is modified to match the reference, where a greedy search is used to select the set of shifts because an optimal sequence of edits (with shifts) is very expensive to find.",
        "The best alignment is the one that gives the minimum number of translation edits.",
        "TER-based method produces 1-to-1 word alignments.",
        "CLA-based: Chen et al.",
        "(2008) used competitive linking algorithm (CLA) (Melamed, 2000) to build confusion network for hypothesis regeneration.",
        "Firstly, an association score is computed for every possible word pair from the backbone and hypothesis to be aligned.",
        "Then a greedy algorithm is applied to select the best word alignment.",
        "We compute the association score from a linear combination of two clues:",
        "surface similarity computed as Equation (2) and position difference based distortion score by following (He et al., 2008).",
        "CLA works under a 1-to-1 assumption, so it produces 1-to-1 word alignments.",
        "IHMM-based: He et al.",
        "(2008) propose an indirect hidden Markov model (IHMM) for hypothesis alignment.",
        "Different from traditional HMM, this model estimates the parameters indirectly from various sources, such as word semantic similarity, surface similarity and distortion penalty, etc.",
        "For fair comparison reason, we also use the surface similarity computed as Equation (2) and position difference based distortion score which are used for CLA-based word alignment.",
        "IHMM-based method produces many-to-1 word alignments.",
        "In previous work, Matusov et al.",
        "(2006, 2008) used both direction word alignments to compute so-called state occupation probabilities and then compute the final word alignment.",
        "The other work usually used only one direction word alignment (many/1-to-1 from hypothesis to backbone).",
        "In this paper, we use more reliable word alignments which are derived from the intersection of both direct (hypothesis-to-backbone) and inverse (backbone-to-hypothesis) word alignments with heuristic-based expansion which is widely used in bilingual word alignment.",
        "The algorithm includes two steps:",
        "1) Generate bidirectional word alignments.",
        "It is straightforward for GIZA++ and IHMM to generate bidirectional word alignments.",
        "This is simply achieved by switching the parameters of source and target sentences.",
        "Due to the nature of greedy search in TER, the bidirectional TER-based word alignments by switching the parameters of source and target sentences are not necessary exactly the same.",
        "For example, in Figure 2, the word \"shot\" can be aligned to either \"shoot\" or \"the\" as the edit cost of word pair (shot, shoot) and (shot, the) are the same when compute the minimum-edit-distance for TER score.",
        "killer killer",
        "For CLA word alignment, if we use the same association score, direct and inverse CLA word alignments should be exactly the same.",
        "Therefore, we use different functions to compute the surface similarities, such as using maximum common subsequence (MCS) to compute inverse word alignment, and using longest matched prefix (LMP) for computing direct word alignment, as in Equation (4).",
        "2) When two word alignments are ready, we start from the intersection of the two word alignments, and then continuously add new links between backbone and hypothesis if and only if both of the two words of the new link are unaligned and this link exists in the union of two word alignments.",
        "If there are more than two links share a same hypothesis or backbone word and also satisfy the constraints, we choose the link that with the highest similarity score.",
        "For example, in Figure 2, since MCS-based similarity scores S(shot, shoot) > S(shot, the) , we choose alignment (a)."
      ]
    },
    {
      "heading": "4. Experiments and results 4.1 Tasks and single systems",
      "text": [
        "Experiments are carried out in two domains.",
        "One is in spoken language domain while the other is on newswire corpus.",
        "Both experiments are on Chinese-to-English translation.",
        "Experiments on spoken language domain were carried out on the Basic Traveling Expression Corpus (BTEC) (Takezawa et al., 2002) Chinese to-English data augmented with HIT-corpus.",
        "BTEC is a multilingual speech corpus which contains sentences spoken by tourists.",
        "40K sentence-pairs are used in our experiment.",
        "HIT-corpus is a balanced corpus and has 500K sentence-pairs in total.",
        "We selected 360K sentence-pairs that are more similar to BTEC data according to its sub-topic.",
        "Additionally, the English sentences of Tanaka corpus were also used to train our language model.",
        "We ran experiments on an IWSLT challenge task which uses IWSLT-20 06 DEV clean text set as development set and IWSLT-2006 TEST clean text as test set.",
        "I",
        "shot",
        "killer",
        "I",
        "shoot",
        "the",
        "I",
        "shoot",
        "the",
        "killer",
        "I",
        "shot",
        "Experiments on newswire domain were carried out on the FBIS corpus.",
        "We used NIST2002 MT evaluation test set as our development set, and the NIST 2005 test set as our test set.",
        "for IWSLT and NIST tasks.",
        "In both experiments, we used four systems, as listed in Table 2, they are phrase-based system Moses (Koehn et al., 2007), hierarchical phrase-based system (Chiang, 2007), BTG-based lexica-lized reordering phrase-based system (Xiong et al., 2006) and a tree sequence alignment-based tree-to-tree translation system (Zhang et al., 2008).",
        "Each system for the same task is trained on the same data set.",
        "For each system, we used the top 10 scored hypotheses to build the confusion network.",
        "Similar to (Rosti et al., 2007a), each word in the hypothesis is assigned with a rank-based score of 1/(1+ r), where r is the rank of the hypothesis.",
        "And we assign the same weights to each system.",
        "For selecting the backbone, only the top hypothesis from each system is considered as a candidate for the backbone.",
        "Concerning the four alignment methods, we use the default setting for GIZA++; and use toolkit TERCOM (Snover et al., 2006) to compute the TER-based word alignment, and also use the default setting.",
        "For fair comparison reason, we decide to do not use any additional resource, such as target language synonym list, IBM model lexicon; therefore, only surface similarity is applied in IHMM-based and CLA-based methods.",
        "We compute the distortion model by following (He et al., 2008) for IHMM and CLA-based methods.",
        "The weights for each model are optimized on held-out data.",
        "Our evaluation metric is BLEU (Papineni et al., 2002), which are to perform case-insensitive matching of n-grams up to n = 4.",
        "Performance comparison of four methods: the results based on direct word alignments are reported in Table 3, row Best is the best single systems' scores; row MBR is the scores of backbone; GIZA++, TER, CLA, IHMM stand for scores of systems for four word alignment methods.",
        "• MBR decoding slightly improves the performance over the best single system for both tasks.",
        "This suggests that the simple voting strategy to select backbone is workable.",
        "the confusion network decoding is effective in combining outputs from multiple MT systems and the four word-alignment methods are also workable for hypothesis-to-backbone alignment.",
        "• For IWSLT task where source sentences are shorter (12-13 words per sentence in average), the four word alignment methods achieve similar performance on both dev and test set.",
        "The biggest difference is only 0.46 BLEU score (30.88 for CLA, vs. 31.34 for IHMM).",
        "For NIST task",
        "task",
        "data",
        "Ch En",
        "IWSLT",
        "Train",
        "Sent.",
        "406K",
        "Words",
        "4.4M 4.6M",
        "Dev",
        "Sent.",
        "489 489 X 7",
        "Words",
        "5,896 45,449",
        "Test",
        "Sent.",
        "500 500 X 7",
        "Words",
        "6,296 51,227",
        "Add.",
        "Words",
        "- 1.7M",
        "NIST",
        "Train",
        "Sent.",
        "238K",
        "Words",
        "7.0M 8.9M",
        "Dev 2002",
        "Sent.",
        "878 878 X 4",
        "Words",
        "23,248 108,616",
        "Test 2005",
        "Sent.",
        "1,082 1,082 X 4",
        "Words",
        "30,544 141,915",
        "Add.",
        "Words",
        "- 61.5M",
        "System Dev Test",
        "IWSLT",
        "Sys1 30.75 27.58",
        "Sys2 30.74 28.54",
        "Sys3 29.99 26.91",
        "Sys4 31.32 27.48",
        "NIST",
        "Sys1 25.64 23.59",
        "Sys2 24.70 23.57",
        "Sys3 25.89 22.02",
        "Sys4 26.11 21.62",
        "where source sentences are longer (26-28 words per sentence in average), the difference is more significant.",
        "Here IHMM method achieves the best performance, followed by GIZA++, CLA p<0.05).",
        "This is mainly because IHMM exploits more knowledge source and Viterbi decoding allows more thorough search for the best alignment while other methods use less optimal greedy search.",
        "Another reason is that TER uses hard matching in computing edit distance.",
        "Performance improvement by intersection word alignment: Table 4 reports the performance of the system combinations based on intersection word alignments.",
        "It shows that:",
        "• Comparing Tables 3 and 4, we can see that the intersection word alignment-based expansion method improves the performance in all the dev and test sets for both tasks by 0.2-0.57 BLEU-score and the improvements are consistent under all conditions.",
        "This suggests that the intersection word alignment-based expansion method is more effective than the commonly used direct word-alignment-based hypothesis alignment method in confusion network-based MT system combination.",
        "This is because intersection word alignments are more reliable compared with direct word alignments, and so for heuristic-based expansion which is based on the aligned words with higher scores.",
        "• TER-based method achieves the biggest performance improvement by 0.4 BLEU-score in IWSLT and 0.57 in NIST.",
        "Our statistics shows that the TER-based word alignment generates more inconsistent links between the two-",
        "directional word alignments than other methods.",
        "This may give the intersection with heuristic-based expansion method more room to improve performance.",
        "• On the contrast, CLA-based method obtains relatively small improvement of 0.26 BLEU-score in IWSLT and 0.21 in NIST.",
        "The reason could be that the similarity functions used in the two directions are more similar.",
        "Therefore, there are not so many inconsistent links between the two directions.",
        "• Table 5 shows the number of links modified by intersection operation and the BLEU-score improvement.",
        "We can see that the more the modified links, the bigger the improvement.",
        "Effect of fuzzy matching in TER: the previous work on TER-based word alignment uses hard match in counting edits distance.",
        "Therefore, it is not able to handle cognate words match, such as in Figure 2, original TER script count the edit cost of (shoot, shot) equals to word pair (shot, the).",
        "Following (Leusch et al., 2006), we modified the TER script to allow fuzzy matching: change the substitution cost from 1 for any word pair to the length of longest matched prefix (LMP) computed as in Equation (4).",
        "As a result, the fuzzy matching reports",
        "method",
        "Dev",
        "Test",
        "IWSLT",
        "Best",
        "31.32",
        "28.54",
        "MBR",
        "31.40",
        "28.82",
        "GIZA++",
        "34.16",
        "31.06",
        "TER",
        "33.92",
        "30.96",
        "CLA",
        "33.85",
        "30.88",
        "IHMM",
        "34.35",
        "31.34",
        "NIST",
        "Best",
        "26.11",
        "23.59",
        "MBR",
        "26.36",
        "23.68",
        "GIZA++",
        "27.58",
        "24.88",
        "TER",
        "27.15",
        "24.31",
        "CLA",
        "27.44",
        "24.51",
        "IHMM",
        "27.76",
        "25.08",
        "method",
        "Dev",
        "Test",
        "IWSLT",
        "MBR",
        "31.40",
        "28.82",
        "GIZA++",
        "34.38",
        "31.40",
        "TER",
        "34.17",
        "31.36",
        "CLA",
        "34.03",
        "31.14",
        "IHMM",
        "34.59",
        "31.74",
        "NIST",
        "MBR",
        "26.36",
        "23.68",
        "GIZA++",
        "27.80",
        "25.11",
        "TER",
        "27.58",
        "24.88",
        "CLA",
        "27.64",
        "24.72",
        "IHMM",
        "27.96",
        "25.37",
        "system",
        "IWSLT NIST Inc. Imp.",
        "Inc. Imp.",
        "CLA",
        "1.2K 0.26 9.2K 0.21",
        "GIZA++",
        "3.2K 0.36 25.5K 0.23",
        "IHMM",
        "3.7K 0.40 21.7K 0.29",
        "TER",
        "4.3K 0.40 40.2K 0.57",
        "#total links",
        "284K 1,390K",
        "SubCost (shoot, shot) = 1 - (2 x 3) /(5 + 4) = 1/3 and SubCost(shoot, the) = 1 - (2 x 0)/(5 + 3) = 1 while in original TER, both of the two scores are equal to 1.",
        "Since cost of word pair (shoot, shot) is smaller than that of word pair (shot, the), word \"shot\" has higher chance to be aligned to \"shoot\" (Figure 2 (a)) instead of \"the\" (Figure 2 (b)).",
        "This fuzzy matching mechanism is very useful to such kind of monolingual alignment task as in hypothesis-to-backbone word alignment since it can well model word variances and morphological changes.",
        "Table 6 summaries the results of TER-based systems with or without fuzzy matching.",
        "We can see that the fuzzy matching improves the performance for all cases.",
        "This verifies the effect of fuzzy matching for TER in monolingual word alignment.",
        "In addition, the improvement in NIST test set (0.36 BLEU-score for direct alignment and 0.21 BLEU-score for intersection one) are more than that in IWSLT test set (0.15 BLEU-score for direct alignment and 0.11 BLEU-score for intersection one).",
        "This is because the sentences of IWSLT test set are much shorter than that of NIST test set.",
        "combined systems with or without fuzzy match.",
        "5 Conclusion",
        "Confusion-network-based system combination shows better performance than other methods in combining multiple MT systems' outputs, and hypothesis alignment is a key step.",
        "In this paper, we first compare four word alignment methods for hypothesis alignment under the confusion network framework.",
        "We verify that the confusion network framework is very effective in MT system combination and IHMM achieves the best performance.",
        "Moreover, we propose an intersection word alignment-based expansion method for hypothesis alignment, which is more reliable as it leverages on both direct and inverse word alignment.",
        "Experimental results on Chinese-to-English spoken and newswire domains show that the intersection word alignment-based method yields consistent improvements across all four word alignment methods.",
        "Finally, we evaluate the effect of fuzzy matching for TER.",
        "Theoretically, confusion network decoding is still a word-level voting algorithm although it is more complicated than other sentence-level voting algorithms.",
        "It changes lexical selection by considering the posterior probabilities of words in hypothesis lists.",
        "Therefore, like other voting algorithms, its performance strongly depends on the quality of the n-best hypotheses of each single system.",
        "In some extreme cases, it may not be able to improve BLEU-score (Mauser et al., 2006; Sim et al., 2007).",
        "TER-based",
        "systems",
        "IWSLT",
        "NIST",
        "Dev",
        "Test",
        "Dev",
        "Test",
        "Direct align +fuzzy match",
        "33.92 34.14",
        "30.96 31.11",
        "27.15 27.53",
        "24.31 24.67",
        "Intersect align +fuzzy match",
        "34.17 34.40",
        "31.36 31.47",
        "27.58 27.79",
        "24.88 25.09"
      ]
    }
  ]
}
