{
  "info": {
    "authors": [
      "Mikko Kurimo",
      "Sami Virpioja",
      "Ville Turunen",
      "Teemu Hirsimäki"
    ],
    "book": "HLT-NAACL, Companion Volume: Demonstration Session",
    "id": "acl-N09-5004",
    "title": "Morpho Challenge - Evaluation of algorithms for unsupervised learning of morphology in various tasks and languages",
    "url": "https://aclweb.org/anthology/N09-5004",
    "year": 2009
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Mikko Kurimo, Sami Virpioja, Ville Turunen, Teemu Hirsimaki",
        "Adaptive Informatics Research Centre Helsinki University of Technology FI-02015,TKK, Finland",
        "Firstname.Lastname@tkk.fi",
        "After the release of the open source software implementation of Morfessor algorithm, a series of several open evaluations has been organized for unsupervised morpheme analysis and morpheme-based speech recognition and information retrieval.",
        "T he u nsu pervised morpheme analysis is a particularly attractive approach for speech and lang u age technolog y for the morphologically complex languages.",
        "When the amount of distinct word forms becomes prohibitive for the constru ction of a sufficient lexicon, it is important that the words can b e segmented into smaller meaningful language modeling units.",
        "In this presentation w e w ill demonstrate the results of the evalu ations, the baseline systems b u ilt u sing the open source tools, and invite research g rou ps to participate in the next eval-u ation w here the task is to enhance statistical machine translation b y morpheme analy sis."
      ]
    },
    {
      "heading": "A proposal for a Type II Demo",
      "text": []
    },
    {
      "heading": "1. Extended Abstract",
      "text": [
        "One of the fundamental tasks in natural language processing applications, such as large-vocabulary speech recognition (LVCSR), statistical machine translation (SMT) and information retrieval (IR), is the morphological analysis of w ords.",
        "It is par-ticu larly important for the morphologically complex lang u ag es, w here the amount of different word forms is substantially increased by inflection, derivation and composition.",
        "T he decomposition of words is req u ired not only for understanding the sentence, b u t in many lang u ages also for just representing the language by any tractable and trainable statistical model and lex icon.",
        "T he manually composed rule-based morphological analy z ers can solve these problems to some ex tent, b u t only a fraction of the existing lang u ages have been covered so far, and for many the coverage of the relevant content is insufficient.",
        "T he objective of the M orpho Challenge is to design and evaluate new u nsu pervised statistical machine learning algorithms that discover which morphemes (smallest individually meaning fu l u nits of lang u ag e) words consist of.",
        "T he goal is to discover basic vocab u lary u nits su itab le for different task s, such as LVCSR, SMT and IR.",
        "In unsupervised learning the list of morphemes is not pre-specified for each lang u ag e, b u t the optimal morpheme lexicon and morpheme analysis of all different word forms is statistically optimized from a large text corpus in a completely data-driven manner.",
        "T he evaluation of the morpheme analysis alg o-rithms is performed both b y a ling u istic and an application oriented task .",
        "T he analysis obtained for a long list of words is first compared to the ling u istic g old standard representing a grammatically correct analysis b y verifying that the morphemesharing word pairs are the correct ones (K u rimo et al., 2007).",
        "This is repeated in different languages and then the obtained decomposition of words is applied in state-of-the-art systems running variou s",
        "NLP applications.",
        "The suitability of the morphemes is verified by comparing the performance of the systems to each other and to systems using unprocessed words or conventional word processing algorithms like stemming or rule-based decompositions.",
        "As a baseline method in all application, we have built systems by applying the Morfessor algorithm, which is an unsupervised word decomposition algorithm developed at our research group (Creutz and Lagus, 2002) and released as open source software implementation.",
        "In information retrieval (IR) from text documents a typical task is to look for the most relevant documents for a given query.",
        "One of the key challenges is to reduce all the inflected word forms to a common root or stem for effective indexing.",
        "From the morpheme analysis point of view this task is to decompose all the words in the query and text documents and find out those common morphemes which form the most relevant links.",
        "In Morpho Challenge the IR systems built using the unsupervised morpheme analysis algorithms are compared in state-of-the-art CLEF tasks in Finnish, German and English (Kurimo and Turunen, 2008) using the mean average precision metric.",
        "The results are also compared to those obtained by the grammatical morphemes as well as the stemming and word normalization methods conventionally used in IR.",
        "In large-vocabulary continuous speech recognition (LVCSR) one key part of the process is the statistical language modeling which determines the prior probabilities of all the possible word sequences.",
        "An especially challenging task is to cover all the possible word forms with sufficient accuracy, because any out-of-vocabulary words will not only be never correctly recognized, but also severely degrade the modeling of the other nearby words.",
        "By decomposing the words into meaningful sub-word units, such as morphemes, large-vocabulary language models can be successfully built even for the most difficult agglutinative languages, like Finnish, Estonian and Turkish (Kurimo et al., 2006b).",
        "In Morpho Challenge the unsupervised morpheme algorithms have been compared by using the morphemes to train statistical language models and applying the models in state-of-the-art LVCSR tasks in Finnish and Turkish (Kurimo et al., 2006a).",
        "Benchmarks for the same tasks were obtained by models that utilize the grammatical morphemes as well as traditional word-based language models.",
        "The state-of-the-art statistical machine translation (SMT) systems are affected by the morphological variation of words at two different stages (Virpi-oja et al., 2007).",
        "In the first stage, the alignment of the source and target language words in a parallel training corpus and the training of the translation model can benefit from the decomposition of complex words into morphemes.",
        "This is particularly important when either the target or the source language, or both, are morphologically complex.",
        "The final stage where the target language text is generated, may also require morpheme-based models, because the large-vocabulary statistical language models are applied in the same way as in LVCSR.",
        "In the ongoing Morpho Challenge 2009 competition, the morpheme analysis algorithms are compared in SMT tasks, where the analysis is needed for the source language texts.",
        "The European Parliament parallel corpus (Koehn, 2005) is used in the evaluation.",
        "The source languages are Finnish and German and the target in both tasks is English.",
        "To obtain a state-of-the-art performance in the tasks the morpheme-based SMT will be combined with a word-based SMT using the Minimum Bayes Risk (MBR) interpolation of the N-best translation hypothesis of both systems (de Gispert et al., 2009).",
        "As its predecessors, the Morpho Challenge 2009 competition is open to all and free of charge.",
        "The participants' are expected to use their unsupervised machine learning algorithms to analyze the word lists of different languages provided by the organizers and submit the results of their morpheme analysis.",
        "The organizers will then run the linguistic evaluations and build the IR and SMT systems and provide all the results and comparisons of the different systems.",
        "The participated algorithms and evaluation results will be presented at the Morpho Challenge workshop that is currently planned to take place within the HLT-NAACL 2010 conference."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The Morpho Challenge competitions and workshops are part of the EU Network of Excellence PASCAL Challenge program and organized in collaboration with CLEF.",
        "We are grateful to Mathias Creutz, Ebru Arisoy, Stefan Bordag, Nizar Habash and Majdi Sawalha for contributions in processing the training data and creating the gold standards.",
        "The Academy of Finland has supported the work in the projects Adaptive Informatics and New adaptive and learning methods in speech recognition.",
        "Example word",
        "Morfessor analysis",
        "Gold Standard",
        "Finnish: linuxiin Turkish: popUlerliGini",
        "Arabic: AlmtHdp",
        "German: zurueckzubehalten English: baby-sitters",
        "linux +iin",
        "pop +U +ler +liGini",
        "Al+ mtHd +p",
        "zurueck+ zu+ be+ halten baby-+ sitter +s",
        "linux_N +ILL",
        "popUler +DER_lHg +POS2S +ACC, popUler +DER_lHg +POS3 +ACC3 mut aHidap_POS:PN Al+ +SG, mut aHid_POS:AJ Al+ +SG zurueck_B zu be halt_V +INF baby_N sit_V er_s +PL"
      ]
    }
  ]
}
