{
  "info": {
    "authors": [
      "William Schuler"
    ],
    "book": "HLT-NAACL",
    "id": "acl-N09-1039",
    "title": "Positive Results for Parsing with a Bounded Stack using a Model-Based Right-Corner Transform",
    "url": "https://aclweb.org/anthology/N09-1039",
    "year": 2009
  },
  "references": [
    "acl-C08-1072",
    "acl-C08-1099",
    "acl-J01-2004",
    "acl-P97-1003",
    "acl-P98-1101"
  ],
  "sections": [
    {
      "text": [
        "Positive Results for Parsing with a Bounded Stack using a Model-Based",
        "Right-Corner Transform",
        "Statistical parsing models have recently been proposed that employ a bounded stack in time-series (left-to-right) recognition, using a right-corner transform defined over training trees to minimize stack use (Schuler etal., 2008).",
        "Corpus results have shown that a vast majority of naturally-occurring sentences can be parsed in this way using a very small stack bound of three to four elements.",
        "This suggests that the standard cubic-time CKY chart-parsing algorithm, which implicitly assumes an unbounded stack, may be wasting probability mass on trees whose complexity is beyond human recognition or generation capacity.",
        "This paper first describes a version of the right-corner transform that is defined over entire probabilistic grammars (cast as infinite sets of generable trees), in order to ensure a fair comparison between bounded-stack and unbounded PCFG parsing using a common underlying model; then it presents experimental results that show a bounded-stack right-corner parser using a transformed version of a grammar significantly outperforms an unbounded-stack CKY parser using the original grammar."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Statistical parsing models have recently been proposed that employ a bounded stack in time-series (left-to-right) recognition, in order to directly and tractably incorporate incremental phenomena such as (co-)reference or disfluency into parsing decisions (Schuler et al., 2008; Miller and Schuler, 2008).",
        "These models make use of a right-corner tree transform, based on the left-corner transform described by Johnson (1998), and are supported by corpus results suggesting thatmostsentences (inEn-glish, at least) can be parsed using a very small stack bound of three to four elements (Schuler et al., 2008).",
        "This raises an interesting question: if most sentences can be recognized with only three or four elements of stack memory, is the standard cubic-time CKY chart-parsing algorithm, which implicitly assumes an unbounded stack, wasting probability mass on trees whose complexity is beyond human recognition or generation capacity?",
        "This paper presents parsing accuracy results using transformed and untransformed versions of a corpus-trained probabilistic context-free grammar suggesting that this is indeed the case.",
        "Experimental results show a bounded-memory time-series parser using a transformed version of a grammar significantly outperforms an unbounded-stack CKY parser using the original grammar.",
        "Unlike the tree-based transforms described previously, the model-based transform described in this paper does not introduce additional context from corpus data beyond that contained in the original probabilistic grammar, making it possible to present a fair comparison between bounded-and unbounded-stack versions of the same model.",
        "Since this transform takes a probabilistic grammar as input, it can also easily accommodate horizontal and vertical Markovisation (annotating grammar symbols with parent and sibling categories) as described by Collins (1997) and subsequently.",
        "The remainder of this paper is organized as follows: Section 2 describes related approaches to parsing with stack bounds; Section 3 describes an existing bounded-stack parsing framework using a right-corner transform defined over individual trees; Section 4 describes a redefinition of this transform to apply to entire probabilistic grammars, cast as infinite sets of generable trees; and Section 5 describes an evaluation of this transform on the Wall Street Journal corpus of the Penn Treebank showing improved results for a transformed bounded-stack version ofa probabilistic grammar over the original unbounded grammar."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "The model examined here is formally similar to Combinatorial Categorial Grammar (CCG) (Steed-man, 2000).",
        "But the CCG account is a competence model as well as a performance model, in that it seeks to unify category representations used in processing with learned generalizations about argument structure; whereas the model described in this paper is exclusively a performance model, allowing generalizations about lexical argument structures to be learned in some other representation, then combined with probabilistic information about parsing strategies to yield a set of derived incomplete constituents.",
        "As a result, the model described in this paper has a freer hand to satisfy strict working memory bounds, which may not permit some of the alternative composition operations proposed in the CCG account, thought to be associated with available prosody and quantifier scope analyses.",
        "Other models (Abney and Johnson, 1991; Gibson, 1991) seek to explain human processing difficulties as a result of memory capacity limits in parsing ordinary phrase structure trees.",
        "The Abney-Johnson and Gibson models adopt a left-corner parsing strategy, of which the right-corner transform described in this paper is a variant, in order to minimize memory usage.",
        "But the transform-based model described in this paper exploits a conception of chunking (Miller, 1956) – in this case, grouping recognized words into stacked-up incomplete constituents – to operate within much stricter estimates of human short-term memory bounds (Cowan, 2001) than assumed by Abney and Johnson.",
        "Several existing incremental systems are organized around a left-corner parsing strategy (Roark, 2001; Henderson, 2004).",
        "But these systems generally keep large numbers of constituents open for modifier attachment in each hypothesis.",
        "This allows modifiers to be attached as right children of any such open constituent.",
        "But if any number of open constituents are allowed, then either the assumption that stored elements have fixed syntactic (and semantic) structure will be violated, or the assumption that syntax operates within a bounded memory store will be violated, both of which are psy-cholinguistically attractive as simplifying assumptions.",
        "The HHMM model examined in this paper upholds both the fixed-element and bounded-memory assumptions by hypothesizing fixed reductions of right child constituents into incomplete parents in the same memory element, to make room for new constituents that may be introduced at a later time.",
        "These in-element reductions are defined naturally on phrase structure trees as the result of aligning right-corner transformed constituent structures to sequences of random variables in a factored time-series model."
      ]
    },
    {
      "heading": "3. Background",
      "text": [
        "The recognition model examined in this paper is a factored time-series model, based on a Hierarchic Hidden Markov Model (Murphy and Paskin, 2001), which probabilistically estimates the contents of a memory store of three to four partially-completed constituents over time.",
        "Probabilities for expansions, transitions and reductions in this model can be defined over trees in a training corpus, transformed and mapped to the random variables in an HHMM (Schuler et al., 2008).",
        "In Section 4 these probabilities will be computed directly from a probabilistic context-free grammar, in order to evaluate the contribution of stack bounds without introducing additional corpus context into the model.",
        "HHMMs are factored HMMs which mimic a bounded-memory pushdown automaton (PDA), supporting simple push and pop operations on a bounded stack-like memory store.",
        "HMMs characterize speech or text as a sequence of hidden states qt (in this case, stacked-up syntactic categories) and observed states at (in this case, words) at corresponding time steps t. A most likely sequence of hidden states qi_T can then be hypothesized given any sequence of observed states a1..T:",
        "using Bayes' Law (Equation 2) and Markov independence assumptions (Equation 3) to define a full P(qi..T | 01..T) probability as the product of a Transition Model (0a) prior probability",
        "P(qi„T) = II* P©a(q* I and an Observation Model (Qb) likelihood probability P(oi_T | qi_T) =",
        "n* p©b (o* q*).",
        "Transition probabilities PeA (q* | q*.1) over complex hidden states q* can be modeled using synchronized levels of stacked-up component HMMs in an HHMM.",
        "HHMM transition probabilities are calculated in two phases: a reduce phase (resulting in an intermediate, marginalized state /*), in which component HMMs may terminate; and a shift phase (resulting in a modeled state q*), in which unterminated HMMs transition, and terminated HMMs are reinitialized from their parent HMMs.",
        "Variables over intermediate /* and modeled q* states are factored into sequences of depth-specific variables - one for each of D levels in the HHMM hierarchy:",
        "Transition probabilities are then calculated as a product of transition probabilities at each level, using level-specific reduce 6R;d and shift 6S;d models:",
        "with /*Df1 and q defined as constants.",
        "In Viterbi decoding, the sums are replaced with argmax operators.",
        "This decoding process preserves ambiguity by",
        "Figure 1: Graphical representation of a Hierarchic Hidden Markov Model.",
        "Circles denote random variables, and edges denote conditional dependencies.",
        "Shaded circles are observations.",
        "maintaining competing analyses of the entire memory store.",
        "A graphical representation of an HHMM with three levels is shown in Figure 1.",
        "Shift and reduce probabilities can then be defined in terms of finitely recursive Finite State Automata (FSAs) with probability distributions over transition, recursive expansion, and final-state status of states at each hierarchy level.",
        "In the version of HHMMs used in this paper, each intermediate variable is a reduction or non-reduction state /*d £ G U{1, 0} (indicating, respectively, a complete reduced constituent of some grammatical category from domain G, or a failure to reduce due to an 'active' transition being performed, or a failure to reduce due to an 'awaited' transition being performed, as defined in Section 4.3); and each modeled variable is a syntactic state qf £ G x G (describing an incomplete constituent consisting of an active grammatical category from domain G and an awaited grammatical category from domain G).",
        "An intermediate variable /*d at depth d may indicate reduction or non-reduction according to 0F-Rd)d if there is a reduction at the depth level immediately below d, but must indicate non-reduction (0) with probability 1 if there was no reduction below: where ftD1eG and q° = ROOT.",
        "Shift probabilities over the modeled variable qfat each level are defined using level-specific transition 6q_tr,<i and expansion 0q-ex)d models:",
        "'if ffVG, fdGG :[qf = qfif f+eG, fdGG : PeQ-Trd where /*Df1GG and q = ROOT.",
        "This model is conditioned on reduce variables at and immediately below the current FSA level.",
        "If there is no reduction immediately below the current level (the first case above), it deterministically copies the current FSA state forward to the next time step.",
        "If there is a reduction immediately below the current level but no reduction at the current level (the second case above), it transitions the FSA state at the current level, according to the distribution 0q-tr;d. And if there is a reduction at the current level (the third case above), it reinitializes this state given the state atthe level above, according to the distribution 0q-ex,d.",
        "The overall effect is that higher-level FSAs are allowed to transition only when lower-level FSAs terminate.",
        "An HHMM therefore behaves like a probabilistic implementation of a pushdown automaton (or shift-reduce parser) with a finite stack, where the maximum stack depth is equal to the number of levels in the HHMM hierarchy.",
        "The right-corner transform used in this paper is simply the left-right dual of a left-corner transform (Johnson, 1998).",
        "It transforms all right branching sequences in a phrase structure tree into left branching sequences of symbols of the form Andenoting an incomplete instance of an 'active' category An lacking an instance of an 'awaited' category Awyet to come.",
        "These incomplete constituent categories have the same form and much of the same meaning as non-constituent categories in a Combinatorial Categorial Grammar (Steedman, 2000).",
        "Rewrite rules for the right-corner transform are shown below:",
        "• Beginning case: the top of a right-expanding sequence in an ordinary phrase structure tree is mapped to the bottom of a left-expanding sequence in a right-corner transformed tree:",
        "This case of the right-corner transform may be considered a constrained version of CCG type raising.",
        "Middle case: each subsequent branch in a right-expanding sequence ofanordinaryphrase structure tree is mapped to a branch in a left-expanding sequence ofthe transformed tree:",
        "a.",
        "This case of the right-corner transform may be considered a constrained version of CCG forward function application.",
        "Ending case: the bottom of a right-expanding sequence in an ordinary phrase structure tree is mapped to the top ofa left-expanding sequence in a right-corner transformed tree:",
        ".a.",
        "a) binary-branching phrase structure tree:",
        "municipal obligation b) result ofright-corner transform:",
        "VBN/PRT PRT",
        "JJ market I",
        "DT municipal",
        "NN bonds propped I",
        "NP/PP IN I I",
        "NPpos general",
        "JJ obligation",
        "NPpos/POS POS",
        "JJ demand NNP/NNP NNP city I I I strong NNP york",
        "Figure 2: Trees resulting from a) a sample phrase structure tree for the sentence Strong demand for New York City's general obligations bonds propped up the municipal market, and b) a right-corner transform of this tree.",
        "Sequences of left children are recognized from the bottom up through in-element transitions in a Hierarchic Hidden Markov Model.",
        "Right children are recognized by expanding to additional stack elements.",
        "The completeness of the above transform rules can be demonstrated by the fact that they cover all possible subtree configurations (with the exception of bare terminals, which are simply copied).",
        "The soundness of the above transform rules can be demonstrated by the fact that each rule transforms a right-branching subtree into a left-branching subtree labeled with an incomplete constituent.",
        "An example of a right-corner transformed tree is shown in Figure 2(b).",
        "An important property of this transform is that it is reversible.",
        "Rewrite rules for reversing a right-corner transform are simply the converse of those shown above.",
        "Sequences of left children in the resulting mostly-left-branching trees are recognized from the bottom up, through transitions at the same stack element.",
        "Right children, which are much less frequent in the resulting trees, are recognized through cross-element expansions in a bounded-stack recognizer."
      ]
    },
    {
      "heading": "4. Model-Based Transforms",
      "text": [
        "In order to compare bounded-and unbounded-stack versions of the same model, the formulation of the right-corner and bounded-stack transforms introduced in this paper does not map trees to trees, but rather maps probability models to probability models.",
        "This eliminates complications in comparing models with different numbers of dependent variables – and thus different numbers of free parameters – because the model which ordinarily has more free parameters (the HHMM, in this case) is derived from the model that has fewer (the PCFG).",
        "Since they are derived from a simpler underlying model, the additional parameters of the HHMM are not free.",
        "Mapping probability models from one format to another can be thought of as mapping the infinite sets of trees that are defined by these models from one format to another.",
        "Probabilities in the transformed model are therefore defined by calculating probabilities for the relevant substructures in the source model, then marginalizing out the values of nodes in these structures that do not appear in the desired expression in the target model.",
        "A bounded-stack HHMM 0qj can therefore be derived from an unbounded PCFG 6G by:",
        "1. organizing the rules in the source PCFG model 6G into direction-specific versions (distinguishing rules for expanding left and right children, which occur respectively as active and awaited constituent categories in incomplete constituent labels);",
        "2. enforcing depth limits on these direction-specific rules; and",
        "3. mapping these probabilities to HHMM random variable positions at the appropriate depth.",
        "An inspection of the tree-based right-corner transform rewrites defined in Section 3.2 will show two things: first, that constituents occurring as left children in an original tree (with addresses ending in '0') always become active constituents (occurring before the slash, or without a slash) in incomplete constituent categories, and constituents occurring as right children in an original tree (with addresses ending in '1') always become awaited constituents (occurring after the slash); and second, that left children expand locally downward in the transformed tree (so each An0/... locally dominates An00/...), whereas right children expand locally upward (so each .../An1 is locally dominated by .../An11).",
        "This means that rules from the original grammar – if distinguished into rules applying only to left and right children (active and awaited constituents) – can still be locally modeled following a right-corner transform.",
        "A transformed tree can be generated in this way by expanding downward along the active constituents in a transformed tree, then turning around and expanding upward to fill in the awaited constituents, then turning around again to generate the active constituents at the next depth level, and so on.",
        "The locality of the original grammar rules in a right-corner transformed tree allows memory limits on incomplete constituents to be applied directly as depth bounds in the zigzag generation traversal defined above.",
        "These depth limits correspond directly to the depth levels in an HHMM.",
        "In the experiments described in Section 5, direction-specific and depth-specific versions of the original grammar rules are implemented in an ordinary CKY-style dynamic-programming parser, and can therefore simply be cut off at a particular depth level with no renormalization.",
        "But in an HHMM, this will result in label-bias effects, in which expanded constituents may have no valid reduction, forcing the system to define distributions for composing constituents that are not compatible.",
        "For example, if a constituent is expanded at depth D, and that constituent has no expansions that can be completely processed within depth D, it will not be able to reduce, and will remain incompatible with the incomplete constituent above it.",
        "Probabilities for depth-bounded rules must therefore be renormalized to the domain of allowable trees that can be generated within D depth levels, in order to guarantee consistent probabilities for HHMM recognition.",
        "This is done by determining the (depth- and direction-specific) probability PeB-Ld (11 An0) or PeB-Rd(11 An1) that a tree generated at each depth d and rooted by a left or right child will fit within depth D. These probabilities are then estimated using an approximate inference algorithm similar to that used in value iteration (Bellman 1957), which estimates probabilities of infinite trees by exploiting the fact that increasingly longer trees contribute exponentially decreasing probability mass (since each non-terminal expansion must avoid generating a terminal with some probability at each step from the top down), so a sum over probabilities of trees with increasing length k is guaranteed to converge.",
        "The algorithm calculates probabilities of trees with increasing length k until convergence, or to some arbitrary limit K:",
        "Normalized probability distributions for depth-bounded expansions 0G-L^ and 0G-R,d can now be calculated using converged 0B-L^ and 0B-Rd estimates:",
        "Converting PCFGs to HHMMs requires the calculation of expected frequencies FeG-L,d (An – Aw) of generating symbols Aw in the left-progeny of a nonterminal symbol An (in other words, of Aw being a left child of An, or a left child of a left child of An, etc.).",
        "This is done by summing over subtrees of increasing length k using the same approximate inference technique described in Section 4.2, which guarantees convergence since each subtree of increasing length contributes exponentially decreasing probability mass to the sum:",
        "and pe&L.,d (An",
        "A complete HHMM can now be defined using depth-bounded right-corner PCFG probabilities.",
        "HHMM probabilities will be defined over syntactic states consisting of incomplete constituent categories /Aw.",
        "Expansions depend on only the incomplete constituent category ../An (for any active category '..') at qd-1:",
        "Transitions depend on whether an 'active' or 'awaited' transition was performed at the current level.",
        "If an active transition was performed (where ftd = 1), the transition depends on only the incomplete constituent category (for any awaited category '..') at qf_1, and the incomplete constituent category ../An (for any active category '..')at q-:",
        "If an awaited transition was performed (where ftd = 0), the transition depends on only the complete constituent category Anjt^° at ftd+1, and the incomplete",
        "c„ m Ii .",
        "constituent category An/Aw at qt-1:",
        "Reduce probabilities depend on the complete constituent category at f*, and the incomplete constituent category An°^% (for any awaited category '..') at qt-1, and the incomplete constituent category ../An (for any active category '..') at q^-1.",
        "If the complete constituent category at f* does not match the awaited category of qt-1, the probability is [ft = f 0].",
        "If the complete constituent category at ftd+1 does match the awaited category of 1 :",
        "Ea,, .0,An .",
        "1 p©G-R,d-i(An ~* An° An.1)'.",
        "The correctness of the above distributions can be demonstrated by the fact that all terms other than ©G-U<i and 0G-R,d probabilities will cancel out in any sequence of transitions between an expansion and a reduction, leaving only those terms that would appear as factors in an ordinary PCFG parse."
      ]
    },
    {
      "heading": "5. Results",
      "text": [
        "A PCFG model was extracted from sections 2-21 of the Wall Street Journal Treebank.",
        "In order to keep the transform process manageable, punctuation was removed from the corpus, and rules occurring less frequently than 10 times in the corpus were deleted from the PCFG.",
        "The right-corner and bounded-stack transforms described in the previous section were then applied to the PCFG.",
        "The original and bounded PCFG models were evaluated in a CKY recognizer on sections 22-24 ofthe Treebank, with results shown in Table 1.",
        "Results were significant only for sentences longer than 40 words.",
        "On these sentences, the bounded PCFG model achieves about a .15% reduction of error over the original PCFG (p < .1 using one-tailed pairwise t-test).",
        "This suggests that on long sentences the probability mass wasted due to parsing with an unbounded stack is substantial enough to impact parsing accuracy."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "Previous work has explored bounded-stack parsing using a right-corner transform defined on trees to minimize stack usage.",
        "HHMM parsers trained on applications of this tree-based transform of training corpora have shown improvements over ordinary PCFG models, but this may have been attributable to the richer dependencies of the HHMM.",
        "This paper has presented an approximate inference algorithm for transforming entire PCFGs, rather than individual trees, into equivalent right-corner bounded-stack HHMMs.",
        "Moreover, a comparison with an untransformed PCFG model suggests that the probability mass wasted due to parsing with an unbounded stack is substantial enough to impact parsing accuracy."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This research was supported by NSF CAREER award 0447685 and by NASA under award NNX08AC36A.",
        "The views expressed are not necessarily endorsed by the sponsors."
      ]
    }
  ]
}
