{
  "info": {
    "authors": [
      "Alexander Fraser"
    ],
    "book": "Proceedings of the Fourth Workshop on Statistical Machine Translation",
    "id": "acl-W09-0420",
    "title": "Experiments in Morphosyntactic Processing for Translating to and from German",
    "url": "https://aclweb.org/anthology/W09-0420",
    "year": 2009
  },
  "references": [
    "acl-C04-1024",
    "acl-C04-1073",
    "acl-C96-2141",
    "acl-D07-1077",
    "acl-E03-1076",
    "acl-J03-1002",
    "acl-J04-2003",
    "acl-J93-2003",
    "acl-P04-3014",
    "acl-P05-1066",
    "acl-P07-1065",
    "acl-P07-2045",
    "acl-W05-0909",
    "acl-W07-0712",
    "acl-W08-0309",
    "acl-W08-0317",
    "acl-W08-0509"
  ],
  "sections": [
    {
      "text": [
        "Experiments in morphosyntactic processing for translating to and from",
        "German",
        "Institute for Natural Language Processing",
        "We describe two shared task systems and associated experiments.",
        "The German to English system used reordering rules applied to parses and morphological splitting and stemming.",
        "The English to German system used an additional translation step which recreated compound words and generated morphological inflection."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The Institute for Natural Language Processing (IfNLP), Stuttgart, participated in the WMT-2009 shared tasks for German to English and English to German translation with constrained systems which employed morphological and syntactic processing techniques.",
        "The systems were based on the open source Moses docoder (Koehn et al., 2007).",
        "We combined IfNLP tools for syntactic and morphological analysis (which are publicly available and widely used) with preprocessing techniques that were successfully used by other groups in WMT-2008, and extended these.",
        "For English to German translation, we additionally performed a step which recreated compound words and generated morphological inflection.",
        "The baseline is the standard system supplied for the shared task.",
        "We used the default parameters of the Moses toolkit, except for a small difference in the generation of the word alignments, see section 3."
      ]
    },
    {
      "heading": "2. Improvements",
      "text": [
        "We normalize both the English and German by converting all characters to theirnearestequivalent in Latin-1 (ISO 8859-1) encoding, except for the euro sign, which is handled specially.",
        "We did not modify the SGML files used for calculating BLEU and METEOR scores in any way.",
        "German underwent a writing reform from the alte Rechtschreibung (old spelling rules/orthography) to the neue Rechtschreibung (gloss: new spelling rules/orthography) recently.",
        "Early Europarl data are written using the alte Rechtschreibung and hence need to be converted to the neue Rechtschreibung in order to match the news data, which is in the new form.",
        "We began the process by mapping all cased variants of a particular word to a single class (such as by mapping two words which are written with ue and U, but are otherwise identical, to a single class).",
        "We then tried to automatically identify the correct variant under the writing reform for each class.",
        "Initially we tried the linux tool aspell but found that its coverage (the recall of its lexicon) was poor.",
        "We used a simple technique for finding the best variant.",
        "We separated the Europarl corpus into portions written using the old and new forms.",
        "We used the incidence of the word dass (the complementizer meaning that) and its old rules variant daß.",
        "We used a chunk size of 70 sentences to segment Europarl into old and new by counting whether there were more instances of daßor dass, respectively, in each chunk.",
        "We added the news corpora to the new portion.",
        "For each variant we counted the number of times it occurred in the new data and subtracted the number of times it occurred in the old data; the variant with the highest adjusted count was selected.",
        "German word order differs from English substantially.",
        "Preprocessing approaches involving the use of a syntactic parse of the source sentence to change the word order to more closely match the word order of the target language have been studied by Niessen and Ney (2004), Xia and McCord (2004), Drabek and Yarowsky (2004), Collins et al.",
        "(2005), Popovic and Ney (2006), Wang et al.",
        "(2007) and many others.",
        "To obtain a parse of each German sentence in the training, dev and test corpora, we employed the IfNLP BitPar probabilistic parser (Schmid, 2004), using models learned from the Tiger Treebank for German.",
        "Dealing with morphological productivity is important in the syntactic parsing of German.",
        "Bit-Par has been designed with this in mind.",
        "IfNLP's SMOR analyzer is used for morphological analysis (Schmid et al., 2004).",
        "SMOR is run over a list of types in each German sentence, and outputs a list of analyses for each type, each of which corresponds to a POS tag.",
        "BitPar is limited to choosing one of these POS tags for this type.",
        "Words which SMOR fails to analyze are allowed to occur with any POS tag.",
        "We reimplemented the syntactic preprocessing approach of Collins et al.",
        "(2005), with modifications.",
        "Reordering rules are applied to a German parse tree (generated by BitPar), and focus on reordering the words in the German clause structure to more closely resemble English clause structure.",
        "The rules are applied to both the training data for the SMT system, and the input (the dev and test sets).",
        "We previously performed an error analysis of this approach and for the work described here we addressed some of the shortcomings identified through the analysis.",
        "The analysis was performed on the Europarl dev2006 set.",
        "The first error that we noticed occurring frequently was that some large clausal units which were labeled as subjects were being moved forward in the sentence.",
        "We modified the rule moving subjects forward to not apply to the constituents S, CS, VP and CVP.",
        "See the first part of table 3 for an example.",
        "The phrase \"dass der Balkan ist kein Gebiet\" is moved under the original rules, and with the modification is no longer moved.",
        "Table 1: German to English, dev-2009b (case sensitive), c+w = char+word normalization, s/s = splitting/stemming, 21.2 = larger LM",
        "Table 2: English to German, dev-2009b (case sensitive), c+w = char+word normalization, s/s = splitting/stemming",
        "The second error that we handled was that S-RC constituents which do not have a complementizer are reordered incorrectly.",
        "We modified the original verb 2nd rule, so that if there is no complementizer in a S-RC constituent, then the head is moved to the second position, see the second part of table 3 for an example.",
        "Using the original rules, the verb 2nd rule fails to fire, incorrectly leaving haben (gloss: have) at the end of the clause.",
        "We implemented the frequency-based word splitting approach of Koehn and Knight (2003), and made modifications, including some similar to those described by Stymne et al.",
        "(2008).",
        "This well-known technique splits compound words.",
        "In addition, we performed simple suffix elimination, aimed at removing inflection marking features such as gender and case that are not necessary for translation to English.",
        "We took the stem combination with the highest geometric mean of the frequencies of the stems, but following Stymne et al.",
        "(2008), we restricted stems to minimum length 4, and we allowed an extended list of infixes: s, n, en, nen, es, er and ien.",
        "For suffixes, we allowed: e, en, n, es, s, em and er, which is more aggressive",
        "System",
        "BLEU",
        "METEOR",
        "LR",
        "no processing",
        "18.91",
        "49.50",
        "1.0097",
        "c+w",
        "19.37",
        "49.69",
        "1.0067",
        "c+w, s/s",
        "19.18",
        "51.13",
        "1.0035",
        "c+w, old reordering",
        "19.61",
        "50.44",
        "1.0092",
        "c+w, new reordering",
        "19.91",
        "50.84",
        "1.0059",
        "c+w, new reordering, s/s",
        "19.65",
        "51.57",
        "1.0093",
        "(submitted, bug)",
        "* c+w, new reordering, s/s",
        "19.73",
        "51.59",
        "1.0062",
        "as * IRSTLM quantized",
        "19.52",
        "51.33",
        "1.0003",
        "as * IRSTLM",
        "19.75",
        "51.61",
        "1.0013",
        "as * IRSTLM 21.2 quan-",
        "19.52",
        "51.51",
        "1.0095",
        "tized",
        "as * RANDLM",
        "19.67",
        "51.73",
        "1.0067",
        "as * RANDLM 21.2",
        "21.03",
        "51.96",
        "1.0111",
        "System",
        "BLEU",
        "METEOR",
        "LR",
        "no processing",
        "13.55",
        "38.31",
        "0.9910",
        "c+w (no second step)",
        "14.11",
        "38.27",
        "0.9991",
        "c+w, s/s, second step",
        "12.34",
        "37.89",
        "1.0338",
        "(submitted, bug)",
        "c+w, s/s, second step",
        "13.05",
        "37.94",
        "1.0157",
        "Table 3: Differences in reordering: BEFORE is reordering using rules in (Collins et al., 2005), AFTER is our modified reordering than used in previous work (and therefore generalizes more but at the same time causes some erroneous conflation).",
        "We stripped e, en and n from all stems (but remembered the most frequent variant, so that applying the procedure to Kirchturm results in Kirche Turm (gloss: church tower)).",
        "We store an alignment from the original German to the simplified German which we will use in the next section.",
        "For translation from English to German, we first translated from English to the simplified German presented in the previous section, and then performed an independent translation step from simplified German to fully inflected German.",
        "Two processes are handled by this step.",
        "First, series of stems corresponding to compound words are recomposed (along with infixes which are not present in the simplified German form) into compound words.",
        "Second, inflection is added (e.g., case and gender agreement is handled).",
        "Both of these processes are implemented using a Moses system trained on a parallel corpus where the source language is simplified German and the target language is fully inflected German.",
        "The alignment is error-free as it was generated as a side effect of the splitting and stemming process described in the previous section.",
        "In translation, reordering is not allowed, but we otherwise use standard Moses settings."
      ]
    },
    {
      "heading": "3. Experiments",
      "text": [
        "We trained our German to English system on the constrained parallel data.",
        "The English data was processed using character normalization.",
        "The German data was first processed using character and word (writing reform) normalization.",
        "We then parsed the German data using BitPar and applied the modified reordering rules.",
        "After this the splitting and stemming process was applied.",
        "Finally, we lowercased the data.",
        "Word alignments were generated using Model 4 (Brown et al., 1993) using the multi-threaded implementation of GIZA++ (Och and Ney, 2003; Gao and Vogel, 2008).",
        "We first trained Model 4 with English as the source language, and then with German as the source language, resulting in two Viterbi alignments.",
        "The resulting Viterbi alignments were combined using the Grow Diag Final And symmetrization heuristic (Koehn et al., 2003).",
        "We estimated a standard Moses system using default settings.",
        "MERT was run until convergence using dev-2009a (separately for each experiment).",
        "One limitation of our German to English system is that we were unable to scale to the full language modeling data using SRILM (Stolcke, 2002), 5-grams and modified Kneser-Ney with no singleton deletion.",
        "The language model in our submitted system is based on all of the available English data, but news-train08 is truncated to the first 10193376 lines, meaning that we did not train on the remaining 11038787 lines, so we used a little less than half of the data.",
        "We converted the language model trained using SRILM to the binary format using IRSTLM.",
        "INPUT gloss",
        "Mir ist bewusst , dass der Balkan kein Gebiet ist , das Anlass zu Optimismus",
        "gibt.",
        "me is clear , that the Balkans not area is , that opportunity for optimism gives .",
        "BEFORE",
        "gloss",
        "Mir dass der Balkan ist kein Gebiet ist bewusst , , das Anlass zu Optimismus",
        "gibt.",
        "me that the Balkans is not area is clear , that opportunity for optimism gives .",
        "AFTER",
        "gloss",
        "Mir ist bewusst, dass der Balkan ist kein Gebiet, das Anlass zu Optimismus gibt",
        "me is clear , that the Balkans is not area , that opportunity for optimism gives .",
        "REF",
        "I am aware that the Balkans are not the most promising area for optimism .",
        "INPUT",
        "gloss",
        "Am 23.",
        "November 1999 hat ein Partnerschaftstag stattgefunden , an dem viele von uns teilgenommen haben .",
        "on 23 November 1999 have a partnership-day took-place , in which many of us participated have .",
        "BEFORE",
        "gloss",
        "Am 23.",
        "November 1999 ein Partnerschaftstag hat stattgefunden , an dem teilgenommen viele von uns haben .",
        "on 23 November 1999 a partnership-day have took-place , in which participated many of us have .",
        "AFTER",
        "gloss",
        "Am 23.",
        "November 1999 ein Partnerschaftstag hat stattgefunden , an dem viele von uns haben teilgenommen .",
        "on 23 November 1999 a partnership-day have took-place , in which many of us have participated .",
        "REF",
        "A partnership day was held on 23 November 1999 , in which many of us participated .",
        "Experiments are presented in table 1, using BLEU (Papineni et al., 2001) and METEOR(Banerjee and Lavie, 2005), and we also show the length ratio (ratio of hypothesized tokens to reference tokens).",
        "For translation into English METEOR had superior correlation with human rankings to BLEU at WMT 2008 (Callison-Burch et al., 2008).",
        "Our submitted system had a bug where the environment variable LCALL was set to en US when creating the binarized filtered lex-icalized reordering table for the test set (and for the blindtest set, but not for the dev set used for MERT).",
        "This caused minor degradation, see the system marked (*) for the system with the bug corrected.",
        "Each system increases in both BLEU and METEOR as improvements are added.",
        "An exception is that splitting/stemming decreases BLEU somewhat.",
        "However, we trust the METEOR results more due to their better correlation with human judgements.",
        "We also compared using a different language model instead of the SRILM model (the bottom half of table 1).",
        "These used either the reduced English language modeling data or the full data (21.2 M segments, marked 21.2 in the results).",
        "RANDLM (Talbot and Osborne, 2007) performs well and scaled to the full data with improvement (resulting in our best overall system).",
        "IRSTLM (Federico and Cettolo, 2007) also performs well, but the quantized model on the 21.2 data did not improve over the smaller quantized model.",
        "IRSTLM uses an approximation of Witten-Bell smoothing, our results support that this is competitive.",
        "We trained our English to German system on the constrained parallel data.",
        "The first SMT system translates from lowercased English to lowercased simplified German, which is then recased.",
        "The syntactic reordering process is not used, but otherwise the German data is processed identically.",
        "The alignment from simplified German to English is generated as described in the previous section.",
        "We used all of the German data to train the language model on simplified German.",
        "The second SMT system translates mixed case simplified German to mixed case unsimplified German.",
        "The translation model is built only on the simplified German from the parallel text, and the language model is trained on all German data.",
        "We present the results in table 2.",
        "METEOR did not correlate as well as BLEU for translation out of English in WMT 2008.",
        "The BLEU score of our final system is worse than the baseline.",
        "We had chosen to submit this system as we found it more interesting than submitting a vanilla system.",
        "In addition, the system of Stymne et al.",
        "(2008) received a good human evaluation despite having a relatively low BLEU score, and we hoped we were performing similar morphological generalization.",
        "We expect to be able to improve this system through error analysis.",
        "In an initial inspection we found case mismatching problems between step one and step two."
      ]
    },
    {
      "heading": "4. Conclusion",
      "text": [
        "We presented our German to English system which employed character normalization, compensated for problems caused by the German writing reform, used modified syntactic reordering rules (in combination with morphologically aware parsing), and employed substring-based morphological analysis.",
        "Our best system improves by 2.46 METEOR and 1.12 BLEU over a standard Moses system.",
        "Our English to German system used the same two normalizations and the substring-based morphological analysis, and additionally implemented a second translation step for recreating compound words and generating case and gender inflection.",
        "We will improve this system in future work."
      ]
    }
  ]
}
