{
  "info": {
    "authors": [
      "Simone Paolo Ponzetto",
      "Massimo Poesio"
    ],
    "book": "ACL-IJCNLP: Tutorial Abstracts",
    "id": "acl-P09-5006",
    "title": "State-of-the-art NLP Approaches to Coreference Resolution: Theory and Practical Recipes",
    "url": "https://aclweb.org/anthology/P09-5006",
    "year": 2009
  },
  "references": [
    "acl-H05-1013",
    "acl-J01-4004",
    "acl-J05-3004",
    "acl-N01-1008",
    "acl-N06-1025",
    "acl-P02-1014",
    "acl-P03-1023",
    "acl-P04-1018",
    "acl-P07-1067"
  ],
  "sections": [
    {
      "text": [
        "Seminar fur Computerlinguistik University of Heidelberg",
        "ponzetto@cl.uni-heidelberg.de",
        "DISI",
        "massimo.poesio@unitn.it",
        "1 Introduction",
        "The identification of different nominal phrases in a discourse as used to refer to the same (discourse) entity is essential for achieving robust natural language understanding (NLU).",
        "The importance of this task is directly amplified by the field of Natural Language Processing (NLP) currently moving towards high-level linguistic tasks requiring NLU capabilities such as e.g. recognizing textual entailment.",
        "This tutorial aims at providing the NLP community with a gentle introduction to the task of coreference resolution from both a theoretical and an application-oriented perspective.",
        "Its main purposes are: (1) to introduce a general audience of NLP researchers to the core ideas underlying state-of-the-art computational models of corefer-ence; (2) to provide that same audience with an overview of NLP applications which can benefit from coreference information."
      ]
    },
    {
      "heading": "2. Content Overview",
      "text": [
        "1.",
        "Introduction to machine learning approaches to coreference resolution.",
        "We start by focusing on machine learning based approaches developed in the seminal works from Soon et al.",
        "(2001) and Ng & Cardie (2002).",
        "We then analyze the main limitations of these approaches, i.e. their clustering of mentions from a local pairwise classification of nominal phrases in text.",
        "We finally move on to present more complex models which attempt to model coreference as a global discourse phenomenon (Yang et al., 2003; Luo et al., 2004; Daumé III & Marcu, 2005, inter alia).",
        "2.",
        "Lexical and encyclopedic knowledge for coreference resolution.",
        "Resolving anaphors to their correct antecedents requires in many cases lexical and encyclopedic knowledge.",
        "We accordingly introduce approaches which attempt to include semantic information into the coreference models from a variety of knowledge sources, e.g. WordNet (Harabagiu et al., 2001), Wikipedia (Ponzetto & Strube, 2006) and automatically harvested patterns (Poesio et al., 2002; Markert & Nissim, 2005; Yang & Su, 2007)."
      ]
    },
    {
      "heading": "3.. Applications and future directions. We",
      "text": [
        "present an overview of NLP applications which have been shown to profit from coreference information, e.g. question answering and summarization.",
        "We conclude with remarks on future work directions.",
        "These include: a) bringing together approaches to coreference using semantic information with global discourse modeling techniques; b) exploring novel application scenarios which could potentially benefit from coreference resolution, e.g. relation extraction and extracting events and event chains from text."
      ]
    }
  ]
}
