{
  "info": {
    "authors": [
      "Athina Michou",
      "Violeta Seretan"
    ],
    "book": "EACL – Demos",
    "id": "acl-E09-2012",
    "title": "A Tool for Multi-Word Expression Extraction in Modern Greek Using Syntactic Parsing",
    "url": "https://aclweb.org/anthology/E09-2012",
    "year": 2009
  },
  "references": [
    "acl-A94-1006",
    "acl-J93-1003",
    "acl-W07-1216"
  ],
  "sections": [
    {
      "text": [
        "A Tool for Multi-Word Expression Extraction in Modern Greek",
        "Using Syntactic Parsing",
        "Athina Michou Violeta Seretan",
        "Geneva, Switzerland Geneva, Switzerland",
        "Athina.Michou@unige.ch Violeta.Seretan@unige.ch",
        "This paper presents a tool for extracting multi-word expressions from corpora in Modern Greek, which is used together with a parallel concordancer to augment the lexicon of a rule-based machine-translation system.",
        "The tool is part of a larger extraction system that relies, in turn, on a multilingual parser developed over the past decade in our laboratory.",
        "The paper reviews the various NLP modules and resources which enable the retrieval of Greek multi-word expressions and their translations: the Greek parser, its lexical database, the extraction and concordanc-ing system."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In today's multilingual society, there is a pressing need for building translation resources, such as large-coverage multilingual lexicons, translation systems or translation aid tools, especially due to the increasing interest in computer-assisted translation.",
        "This paper presents a tool intended to assist translators/lexicographers dealing with Greekas a source or a target language.",
        "The tool deals specifically with multi-lexeme lexical items, also called multi-word expressions (henceforth MWEs).",
        "Its main functionalities are: 1) the robust parsing of Greek text corpora and the syntax-based detection of word combinations that are likely to constitute MWEs, and 2) concordance and alignment functions supporting the manual creation of monolingual and bilingual MWE lexicons.",
        "The tool relies on a symbolic parsing technology, and is part of FipsCo, a larger extraction system (Seretan, 2008) which has previously been used to build MWE resources for other languages, including English, French, Spanish, and Italian.",
        "Its extension to Greek will ultimately enable the inclusion of this language in the list of languages supported by an in-house translation system.",
        "The paper is structured as follows.",
        "Section 2 introduces the Greek parser and its lexical database.",
        "Section 3 provides a description of Greek MWEs, including a syntactic classification for these.",
        "Section 4 presents the extraction tool, and Section 5 concludes the paper."
      ]
    },
    {
      "heading": "2. The Greek parser",
      "text": [
        "The Greek parser is part of Fips, a multilingual symbolic parser that deals, among other languages, with English, French, Spanish, Italian, and German (Wehrli, 2007).",
        "The Greek version, FipsGreek (Michou, 2007), has recently reached an acceptable level of lexical and grammatical coverage.",
        "Fips relies on generative grammar concepts, and is basically made up of a generic parsing module which can be refined in order to suit the specific needs of a particular language.",
        "Currently, there are approximately 60 grammar rules defined for Greek, allowing for the complete parse of about 50% of the sentences in a corpus like Europarl (Koehn, 2005), which contains proceedings of the European Parliament.",
        "For the remaining sentences, partial analyses are instead proposed for the chunks identified.",
        "One of the key components of the parser is its (manually-built) lexicon.",
        "It contains detailed mor-phosyntactic and semantic information, namely, selectional properties, subcategorization information, and syntactico-semantic features that are likely to influence the syntactic analysis.",
        "The Greek monolingual lexicon presently contains about 110000 words corresponding to 16000 lexemes, and a limited number of MWEs (about 500).",
        "The bilingual lexicon used by our translation system contains slightly more than 8000 Greek-French/French-Greek equivalents."
      ]
    },
    {
      "heading": "3. MWEs in Modern Greek",
      "text": [
        "Greek is a language which exhibits a high MWE productivity, with new compound words being created especially in the science and technology domains.",
        "Sometimes, existing words are transformed in order to denote new concepts; also, numerous neologisms are created or borrowed from other languages.",
        "A frequent type of multi-word constructions in Greek are special noun phrases, called lexical phrases (Anastasiadi-Symeonidi, 1986) or loose multi-word compounds (Ralli, 2005):",
        "- Adjective+Noun: avov/xrj Oakaaaa (anichti thalassa, 'open sea'), TratBtxrj \"/y.oi (pediki chara, 'kindergarten');",
        "- Noun+NounGEN: £<£vr] aacpocXeiac; (zo-ni asfalias, 'safety belt'),",
        "(foros isodimatos,",
        "- Noun+NounNOM (head-complement relation): Ttoci 8t-#au|xa (pedi-thavma, 'child prodigy'), auCrjx?)a?",
        ")- (jiapa^civtoc; (syzitisi-marathonios, 'marathon",
        "- NounNOM+NounNOM (coordination relation):",
        "(kanapes-krevati, 'sofa bed'), (yiatros-nosokomos,",
        "'doctor-nurse').",
        "A large body of Greek MWEs constitute collocations (typical word associations whose meaning is easy to decode, but whose component items are difficult to predict), such as xaxapptKiw eva pexop (kataripto ena rekor,'tobreakarecord'), in which the verbal collocate ('shake down') is unpredictable.",
        "Collocations may occur in a wide range of syntactic types.",
        "Some of the configurations taken into account in our work are:",
        "- Noun(Subject)+Verb: r] au£V]Tr]ar] Xrjyet (i sizitisi liyi,'discussion ends'); - Adjective+Noun:",
        "(thanatiki pini, 'deathpenalty');",
        "- Verb+Noun(Object): (diatrecho kindino,'run arisk');",
        "- Verb+Preposition+Noun(Argument): xaxaBtxdCw oe #avaxo (katadikazo se thanato , 'to sentence to death');",
        "- Verb+Preposition: (prosanatolizome pros, 'to orient - Noun+Preposition+Noun:",
        "(protropi yia anaptiksi, 'incitement to development');",
        "- Preposition+Noun: (ipo sizitisi, 'under discussion'); - Verb+Adverb:",
        "(xirokroto therma, 'applause warmly');",
        "- Adverb+Adjective:",
        "(yenetika tropopiimenos, 'genetically modified');",
        "- Adjective+Preposition: (eksartimenos apo, 'dependenton').",
        "In addition, Greek MWEs cover other types of constructions, such as:",
        "- one-word compounds: (erithrodermos, 'red skin'), (likoskylo, 'wolfhound');",
        "- adverbial phrases: (ek ton proteron, 'a priori, in principle');",
        "- idiomatic expressions (whose meaning is difficult to decode): y{vo\\iQa yjxki va",
        "(yinome xali name patisis, literally, become a carpet to walk all over; 'be ready to satisfy any wish')."
      ]
    },
    {
      "heading": "4. The MWE Extraction Tool",
      "text": [
        "MWEs constitute a high proportion of the lexicon of a language, and are crucial for many NLP tasks (Sag et al., 2002).",
        "This section introduces the tool we developed for augmenting the coverage of our monolingual/bilingual MWE lexicons.",
        "As we already mentioned, the Greek MWE extractor is part of FipsCo, a larger extraction system based on a symbolic parsing technology (Seretan, 2008) which we previously applied on text corpora in other languages.",
        "The recent development of the Greek parser enabled us to extend it and apply it to Greek.",
        "Alignment",
        "Collocations",
        "Display Collocations",
        "ciuai noAmKii □vnusTxonicp cfpT|ua",
        "E^ETQ^OJ 0W1MQ ^EKivtü 5ia5iKooia",
        "ËXtD UÉAoç",
        "Euxapioroj cioriYrrrpia auupaivci avrërro otëAvoj urïvuua Euxapicrroj aoTivniïfiq Kcrrcflmo TponoAovia pE^Titüvtü noiÖTTfra auyxaipœ Kupia EUXapKj™ auvàQEAtpoç XC-vto cuKaipia",
        "EVKpivOJ npCTTTdOTl",
        "uejüjvoj crnounr] aißouai opyfl ËXïn 5iKaiü^|ja EKUspäfro avnauxia CKtppafro suxapiaria napoKoAouSto c^AiE^n.",
        "ëxïd 8àppoç Kavto napaTfipnan cuxapicmi KÙpioç",
        "Oby frequency O alphabetically",
        "Jarzembr>wski, yirnï nrmTEAriüv Évnv oryDupri tpdttdvd: D&nvnÔDÛpETrriAij ypnynpn: orriTTDU&Evn.",
        "a npÉTTEivn AiifîriupE UTrrii|rn nç e&vikéç mnpDpÉç, Km Kupiijç ^nTHM^n KMVûïviKn Km rnTnoxoAnoTiç..",
        "LEVEviitÉç vpauuÉç, n flëgn t&u IuuBouAÎ&u Érei tiriTÙyti Tnv KOTŒAAnAn icoppoTria era 9Éuara TnçxpÉojtrnç., thç xopnvncnç a&Eiojv, TnçTrpôtTpatrnç k.ai tou &iaxtJpicuoii, 'Exa ettttûxei Tqv KnràAAnAn i(j[>ppQTnn UEia^ü tüjv &ûr> ükdhuv kdj &n UTT&OTnpiÇn - yin vn xpnoipoTTDifimD tov dpo tou k. Swoboda - 6ti r>\"ipîrrjç &pbuDçnTTp£TT£iv[i EipnpuDOTEi kdj ctduç.",
        "EupcurrrnKDÜc.",
        "cnônpoôpououç.",
        "□ i PouAeutéçtdu EpvrxnKDÛ KbpptnDÇ nvn,o\"uxDÛv yin &ûr>ifjirirEp[i ÇnTnM[Ir[I. Tn DTTDÏn yvüjpif^u 6n",
        "ŒTTaOXOAGÛV TTDAAdÛÇ œkouo.",
        "ßOUAEUTEC Tr> TTpüJTD Erva ÏD ÇHTrip□ T41ÏV TTapEKKAÏOEÛÎV.",
        "rilCTTEUDUpE r>n n EAAnBn, n, IpAnvtWa Km n Bbpanr, IpAtivma TTpÉTTava Éxr>uv piaTTEpmpicfUEvri TTnpÉKKAiori ttévte v",
        "02006 Ressources \\Corpora^1ulb'lingual\\europarl.v2V3<fAen^",
        "The alternative to this-modest step is no step at all.",
        "That is why tonight, regretfully I cannot agree with the tactics-suggested by Mr Jarzembowski because it is a recipe for going nowhere at all, very quickly.",
        "We have to take into account national differences and indeed, social and employment concerns.",
        "Broadly, the Council position has struck the right balance on the charging, licensing, access and separation issues, They have struck a right balance between both extremes and I would advacate- tt> use Mr Swoboda's term - that Third way\" should be applied to the railways in Europe.",
        "LabDur UEPs have two particular concerns which I know are shared by many other Members: one is the issue of derogations.",
        "We believe that Greece, Ireland and Northern Ireland should have a limited",
        "Type: Verb-Object Status: New collocation!",
        "Validate ,",
        "Translate",
        "Figure 1: Screen capture of the parallel concordancer, showing an instance of the collocation emxuyyava toopporcta ('strike balance') and the aligned context in the target language, English.",
        "The extractor is designed as a module which is plugged into the parser.",
        "After a sentence from the source corpus is parsed, the extractor traverses the output structure and identifies as a potential MWE the words found in one of the syntactic configurations listed in Section 3.",
        "Once all MWE candidates are collected from the corpus, they are divided into subsets according to their syntactic configuration.",
        "Then, each subset undergo a statistical analysis process whose aim is to detect those candidates that are highly cohesive.",
        "A strong association between the items of a candidate indicates that this is likely to constitute a collocation.",
        "The strength of association can be measured with one of the numerous association measures implemented in our extractor.",
        "By default, the log-likelihood ratio measure (LLR) is proposed, since it was shown to be particularly suited to language data (Dunning, 1993).",
        "In our extractor, the items of each candidate expression represent base word forms (lemmas) and they are considered in the canonical order implied by the given syntactic configuration (e.g., for a verb-object candidate, the object is postverbal in SVO languages like Greek).",
        "Even if the candidate occurs in corpus in a different morphosyntactic realizations, its various occurrences are successfully identified as instances of the same type thanks to the syntactic analysis performed with the parser.",
        "The extraction tool also provides visualization functions which facilitate the consultation and interpretation of results by users – e.g., lexicographers, terminologists, translators, language learners – by displaying them in the original context.",
        "The following functions are provided:",
        "Filtering and sorting The results which will be displayed can be selected according to seve-",
        "Language:",
        "I I Group by type Order: ©byscore",
        "ral criteria: the syntactic configuration (i.e., users can select only one or several configurations they are interested in), the LLR score, the corpus frequency (users can specify the limits of the desired interval), the words involved (users can look up MWEs containing specific words).",
        "Also, the selected results can be ordered by score or frequency, and users can filter them according to the rank obtained.",
        "Concordance The (filtered) results are displayed on a concordancing interface, similar to the one shown in Figure 1.",
        "The list on the left shows the MWE candidates that were extracted.",
        "When an item of the list is selected, the text panel on the right displays the context of its first instance in the source document.",
        "The arrow buttons beneath allow users to navigate through all the instances of that candidate.",
        "The whole content of the source document is accessible, and it is automatically scrolled to the current instance; the component words and the sentence in which they occur are highlighted in different colors.",
        "Alignment If parallel corpora are available, the results can be displayed in a sentence-aligned context.",
        "That is, the equivalent of the source sentence in the target document containing the translation of the source document is also automatically found, highlighted and displayed next to the original context (see Figure 1).",
        "Thus, users can see how a MWE has previously been translated in a given context.",
        "Validation The tool also provides functionalities allowing users to create a database of manually validated MWEs from among the candidates displayed on the (parallel) concordancing interfaces.",
        "The database can store either monolingual or bilingual entries; most of the information associated to an entry – such as lexeme indexes, syntactic type, source sentence – is automatically filled-in by the system.",
        "For bilingual entries, a translation must be provided by the user, and this can be easily retrieved manually from the target sentence showed in the parallel concor-dancer (thus, for the collocation shown in Figure 1, the user can find the English equivalent strike balance)."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "We presented a MWE extractor with advanced concordancing functions, which can be used to semi-automatically build Greek monolingual/bilingual MWE lexicons.",
        "It relies on a deep syntactic approach, whose benefits are manifold: retrieval of grammatical results, interpretation of syntactic constituents in terms of arguments, disambiguation of lexemes with multiple readings, and grouping of all morphosyntactic variants of MWEs.",
        "Our system is most similar to Termight (Dagan and Church, 1994) and TransSearch (Macklovitch et al., 2000).",
        "To our knowledge, it is the first of this type for Greek."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "This work has been supported by the Swiss National Science Foundation (grant 100012-117944).",
        "The authors would like to thank Eric Wehrli for his support and useful comments."
      ]
    }
  ]
}
