{
  "info": {
    "authors": [
      "Canasai Kruengkrai",
      "Kiyotaka Uchimoto",
      "Jun'ichi Kazama",
      "Yiou Wang",
      "Kentaro Torisawa",
      "Hitoshi Isahara"
    ],
    "book": "ACL-IJCNLP",
    "id": "acl-P09-1058",
    "title": "An Error-Driven Word-Character Hybrid Model for Joint Chinese Word Segmentation and POS Tagging",
    "url": "https://aclweb.org/anthology/P09-1058",
    "year": 2009
  },
  "references": [
    "acl-C04-1067",
    "acl-C08-1049",
    "acl-C94-1032",
    "acl-H05-1066",
    "acl-H05-1124",
    "acl-J95-4004",
    "acl-J96-2001",
    "acl-P07-2055",
    "acl-P08-1101",
    "acl-P08-1102",
    "acl-P99-1036",
    "acl-W01-0512",
    "acl-W02-1001",
    "acl-W03-1719",
    "acl-W04-3230",
    "acl-W04-3236",
    "acl-W07-1509",
    "acl-W96-0213"
  ],
  "sections": [
    {
      "text": [
        "Canasai Kruengkrai^^^l Kiyotaka Uchimoto:;^^B Jun'ichi Kazama* Yiou Wang ;^^B Kentaro Torisawa:;^^B Hitoshi Isahara^",
        "t Graduate School of Engineering, Kobe University 1-1 Rokkodai-cho, Nada-ku, Kobe 657-8501 Japan ^National Institute of Information and Communications Technology 3-5 Hikaridai, Seika-cho, Soraku-gun, Kyoto 619-0289 Japan",
        "{canasai,uchimoto,kazama,wangyiou,torisawa,isahara}@nict.go.jp",
        "In this paper, we present a discriminative word-character hybrid model for joint Chinese word segmentation and POS tagging.",
        "Our word-character hybrid model offers high performance since it can handle both known and unknown words.",
        "We describe our strategies that yield good balance for learning the characteristics of known and unknown words and propose an error-driven policy that delivers such balance by acquiring examples of unknown words from particular errors in a training corpus.",
        "We describe an efficient framework for training our model based on the Margin Infused Relaxed Algorithm (MIRA), evaluate our approach on the Penn Chinese Treebank, and show that it achieves superior performance compared to the state-of-the-art approaches reported in the literature."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In Chinese, word segmentation and part-of-speech (POS) tagging are indispensable steps for higherlevel NLP tasks.",
        "Word segmentation and POS tagging results are required as inputs to other NLP tasks, such as phrase chunking, dependency parsing, and machine translation.",
        "Word segmentation and POS tagging in a joint process have received much attention in recent research and have shown improvements over a pipelined fashion (Ng and Low, 2004; Nakagawa and Uchimoto, 2007; Zhang and Clark, 2008; Jiang et al., 2008a; Jiang et al., 2008b).",
        "In joint word segmentation and the POS tagging process, one serious problem is caused by unknown words, which are defined as words that are not found in a training corpus or in a system's word dictionary.",
        "The word boundaries and the POS tags of unknown words, which are very difficult to identify, cause numerous errors.",
        "The word-character hybrid model proposed by Naka-gawa and Uchimoto (Nakagawa, 2004; Nakagawa and Uchimoto, 2007) shows promising properties for solving this problem.",
        "However, it suffers from structural complexity.",
        "Nakagawa (2004) described a training method based on a word-based Markov model and a character-based maximum entropy model that can be completed in a reasonable time.",
        "However, this training method is limited by the generatively-trained Markov model in which informative features are hard to exploit.",
        "In this paper, we overcome such limitations concerning both efficiency and effectiveness.",
        "We propose a new framework for training the word-character hybrid model based on the Margin Infused Relaxed Algorithm (MIRA) (Crammer, 2004; Crammer et al., 2005; McDonald, 2006).",
        "We describe best decoding for our hybrid model and design its loss function and the features appropriate for our task.",
        "In our word-character hybrid model, allowing the model to learn the characteristics of both known and unknown words is crucial to achieve optimal performance.",
        "Here, we describe our strategies that yield good balance for learning these two characteristics.",
        "We propose an error-driven policy that delivers this balance by acquiring examples of unknown words from particular errors in a training corpus.",
        "We conducted our experiments on Penn Chinese Treebank (Xia et al., 2000) and compared our approach with the best previous approaches reported in the literature.",
        "Experimental results indicate that our approach can achieve state-of-the-art performance.",
        "The paper proceeds as follows: Section 2 gives background on the word-character hybrid model, Section 3 describes our policies for correct path selection, Section 4 presents our training method based on MIRA, Section 5 shows our experimental results, Section 6 discusses related work, and Section 7 concludes the paper."
      ]
    },
    {
      "heading": "2. Background",
      "text": [
        "In joint word segmentation and the POS tagging process, the task is to predict a path of word hypotheses y = (yi,...,y#y) = ((wi,pi),..., (w#y,p#y)) for a given character sequence x = (c\\,..., c#x), where w is a word, p is its POS tag, and a \"#\" symbol denotes the number of elements in each variable.",
        "The goal of our learning algorithm is to learn a mapping from inputs (unsegmented sentences) x £ X to outputs (segmented paths) y £ Y based on training samples of input-output pairs S = {(xt, yt)}J=i.",
        "We represent the search space with a lattice based on the word-character hybrid model (Nakagawa and Uchimoto, 2007).",
        "In the hybrid model, given an input sentence, a lattice that consists of word-level and character-level nodes is constructed.",
        "Word-level nodes, which correspond to words found in the system's word dictionary, have regular POS tags.",
        "Character-level nodes have special tags where position-of-character (POC) and POS tags are combined (Asahara, 2003; Naka-gawa, 2004).",
        "POC tags indicate the word-internal positions of the characters, as described in Table 1.",
        "Figure 1 shows an example of a lattice for a Chinese sentence: \"S^H^SM^^S.\"",
        "(Chongming is China's third largest island).",
        "Note that some nodes and state transitions are not allowed.",
        "For example, I and E nodes cannot occur at the beginning of the lattice (marked with dashed boxes), and the transitions from I to B nodes are also forbidden.",
        "These nodes and transitions are ignored during the lattice construction processing.",
        "In the training phase, since several paths (marked in bold) can correspond to the correct analysis in the annotated corpus, we need to select one correct pathyt as a reference for training.The next section describes our strategies for dealing with this issue.",
        "With this search space representation, we can consistently handle unknown words with character-level nodes.",
        "In other words, we use word-level nodes to identify known words and character-level nodes to identify unknown words.",
        "In the testing phase, we can use a dynamic programming algorithm to search for the most likely path out of all candidate paths.",
        "Tag",
        "Description",
        "B",
        "Beginning character in a multi-character word",
        "I",
        "Intermediate character in a multi-character word",
        "E",
        "End character in a multi-character word",
        "S",
        "Single-character word"
      ]
    },
    {
      "heading": "3. Policies for correct path selection",
      "text": [
        "In this section, we describe our strategies for selecting the correct path yt in the training phase.",
        "As shown in Figure 1, the paths marked in bold can represent the correct annotation of the segmented sentence.",
        "Ideally, we need to build a word-character hybrid model that effectively learns the characteristics of unknown words (with character-level nodes) as well as those of known words (with word-level nodes).",
        "We can directly estimate the statistics of known words from an annotated corpus where a sentence is already segmented into words and assigned POS tags.",
        "If we select the correct path yt that corresponds to the annotated sentence, it will only consist of word-level nodes that do not allow learning for unknown words.",
        "We therefore need to choose character-level nodes as correct nodes instead of word-level nodes for some words.",
        "We expect that those words could reflect unknown words in the future.",
        "Baayen and Sproat (1996) proposed that the characteristics of infrequent words in a training corpus resemble those of unknown words.",
        "Their idea has proven effective for estimating the statistics of unknown words in previous studies (Ratna-parkhi, 1996; Nagata, 1999; Nakagawa, 2004).",
        "We adopt Baayen and Sproat's approach as the baseline policy in our word-character hybrid model.",
        "In the baseline policy, we first count the frequencies of words in the training corpus.",
        "We then collect infrequent words that appear less than or equal to r times.",
        "If these infrequent words are in the correct path, we use character-level nodes to represent them, and hence the characteristics of unknown words can be learned.",
        "For example, in Figure 1 we select the character-level nodes of the word \"*Bfl\" (Chongming) as the correct nodes.",
        "As a result, the correct path yt can contain both wordlevel and character-level nodes (marked with asterisks (*)).",
        "To discover more statistics of unknown words, one might consider just increasing the threshold value r to obtain more artificial unknown words.",
        "However, our experimental results indicate that our word-character hybrid model requires an appropriate balance between known and artificial unknown words to achieve optimal performance.",
        "We now describe our new approach to leverage additional examples of unknown words.",
        "Intuition suggests that even though the system can handle some unknown words, many unidentified unknown words remain that cannot be recovered by the system; we wish to learn the characteristics of such unidentified unknown words.",
        "We propose the following simple scheme:",
        "• Divide the training corpus into ten equal sets and perform 10-fold cross validation to find the errors.",
        "• For each trial, train the word-character hybrid model with the baseline policy (r = 1) using nine sets and estimate errors using the remaining validation set.",
        "• Collect unidentified unknown words from each validation set.",
        "Several types of errors are produced by the baseline model, but we only focus on those caused by unidentified unknown words, which can be easily collected in the evaluation process.",
        "As described later in Section 5.2, we measure the recall on out-of-vocabulary (OOV) words.",
        "Here, we define unidentified unknown words as OOV words in each validation set that cannot be recovered by the system.",
        "After ten cross validation runs, we get a list of the unidentified unknown words derived from the whole training corpus.",
        "Note that the unidentified unknown words in the cross validation are not necessary to be infrequent words, but some overlap may exist.",
        "Finally, we obtain the artificial unknown words that combine the unidentified unknown words in cross validation and infrequent words for learning unknown words.",
        "We refer to this approach as the error-driven policy."
      ]
    },
    {
      "heading": "4. Training method",
      "text": [
        "Let Yt = {yj,...,yf} be a lattice consisting of candidate paths for a given sentence xt.",
        "In the word-character hybrid model, the lattice Yt can contain more than 1000 nodes, depending on the length of the sentence xt and the number of POS tags in the corpus.",
        "Therefore, we require a learning algorithm that can efficiently handle large and complex lattice structures.",
        "Online learning is an attractive method for the hybrid model since it quickly converges Algorithm 1 Generic Online Learning Algorithm",
        "Input: Training set S = {(xt,yt)}T=1Output: Model weight vector w 2: for iter = 1 to N do",
        "within a few iterations (McDonald, 2006).",
        "Algorithm 1 outlines the generic online learning algorithm (McDonald, 2006) used in our framework.",
        "We focus on an online learning algorithm called MIRA (Crammer, 2004), which has the desired accuracy and scalability properties.",
        "MIRA combines the advantages of margin-based and perceptron-style learning with an optimization scheme.",
        "In particular, we use a generalized version of MIRA (Crammer et al., 2005; McDonald, 2006) that can incorporate fc-best decoding in the update procedure.",
        "To understand the concept of fc-best MIRA, we begin with a linear score function:",
        "where w is a weight vector and f is a feature representation of an input x and an output y.",
        "Learning a mapping between an input-output pair corresponds to finding a weight vector w such that the best scoring path of a given sentence is the same as (or close to) the correct path.",
        "Given a training example (xt, yt), MIRA tries to establish a margin between the score of the correct path s(xt, yt; w) and the score of the best candidate path s(xt,y; w) based on the current weight vector w that is proportional to a loss function L(yt,y).",
        "In each iteration, MIRA updates the weight vector w by keeping the norm of the change in the weight vector as small as possible.",
        "With this framework, we can formulate the optimization problem as follows (McDonald, 2006):",
        "where bestk(xt; w(i)) e Yt represents a set of top fc-best paths given the weight vector w(i).",
        "The above quadratic programming (QP) problem can be solved using Hildreth's algorithm (Yair Censor, 1997).",
        "Replacing Eq.",
        "(2) into line 4 of Algorithm 1, we obtain c-best MIRA.",
        "The next question is how to efficiently generate bestk(xt; w(i)).",
        "In this paper, we apply a dynamic programming search (Nagata, 1994) to c-best MIRA.",
        "The algorithm has two main search steps: forward and backward.",
        "For the forward search, we use Viterbi-style decoding to find the best partial path and its score up to each node in the lattice.",
        "For the backward search, we use A*-style decoding to generate the top c-best paths.",
        "A complete path is found when the backward search reaches the beginning node of the lattice, and the algorithm terminates when the number of generated paths equals c.",
        "In summary, we use c-best MIRA to iteratively update w(i).",
        "The final weight vector w is the average of the weight vectors after each iteration.",
        "As reported in (Collins, 2002; McDonald et al., 2005), parameter averaging can effectively avoid overfitting.",
        "For inference, we can use Viterbi-style decoding to search for the most likely path y* for a given sentence x where:",
        "In conventional sequence labeling where the observation sequence (word) boundaries are fixed, one can use the 0/1 loss to measure the errors of a predicted path with respect to the correct path.",
        "However, in our model, word boundaries vary based on the considered path, resulting in a different numbers of output tokens.",
        "As a result, we cannot directly use the 0/1 loss.",
        "We instead compute the loss function through false positives (FP) and false negatives (FN).",
        "Here, FP means the number of output nodes that are not in the correct path, and FN means the number of nodes in the correct path that cannot be recognized by the system.",
        "We define the loss function by:",
        "This loss function can reflect how bad the predicted path yy is compared to the correct path yt.",
        "A weighted loss function based on FP and FN can be found in (Ganchev et al., 2007).",
        "This section discusses the structure of f (x,y).",
        "We broadly classify features into two categories: unigram and bigram features.",
        "We design our feature templates to capture various levels of information about words and POS tags.",
        "Let us introduce some notation.",
        "We write w-i and w0 for the surface forms of words, where subscripts – 1 and 0 indicate the previous and current positions, respectively.",
        "POS tags pi and p0 can be interpreted in the same way.",
        "We denote the characters by Cj.",
        "Unigram features: Table 2 shows our unigram features.",
        "Templates W0-W3 are basic word-level unigram features, where Length(w0) denotes the length of the word wo.",
        "Using just the surface forms can overfit the training data and lead to poor predictions on the test data.",
        "To alleviate this problem, we use two generalized features of the surface forms.",
        "The first is the beginning and end characters of the surface (A0-A7).",
        "For example, (AB(w0)) denotes the beginning character of the current word w0, and (AB(w0), AE(w0)) denotes the beginning and end characters in the word.",
        "The second is the types of beginning and end characters of the surface (T0-T7).",
        "We define a set of general character types, as shown in Table 4.",
        "Templates C0-C6 are basic character-level unigram features taken from (Nakagawa, 2004).",
        "These templates operate over a window of ±2 characters.",
        "The features include characters (C0), pairs of characters (C1-C2), character types (C3), and pairs of character types (C4-C5).",
        "In addition, we add pairs of characters and character types (C6).",
        "Bigram features: Table 3 shows our bigram features.",
        "Templates B0-B9 are basic wordlevel bigram features.",
        "These features aim to capture all the possible combinations of word and POS bigrams.",
        "Templates TB0-TB6 are the types of characters for bigrams.",
        "For example, (TE(w-i),TB(w0)) captures the change of character types from the end character in the previous word to the beginning character in the current word.",
        "Note that if one of the adjacent nodes is a character-level node, we use the template CB0 that represents POS bigrams.",
        "In our preliminary experiments, we found that if we add more features to non-word-level bigrams, the number of features grows rapidly due to the dense connections between non-word-level nodes.",
        "However, these features only slightly improve performance over using simple POS bigrams.",
        "ID",
        "Template",
        "Condition",
        "WO Wl W2 WS",
        "{wo){Po)",
        "{wo,Po)",
        "{Length(wo), po)",
        "for word-level nodes",
        "AO Al",
        "{As (wo)) {As(wo),po)",
        "if w0 is a single-character word",
        "A2 AS A4 AS A6 A?",
        "{Ab (wo)) {Ab(wo),Po) {Ae(wo)) {Ae(wo),Po) {Ab(wo),Ae (wo)) {Ab(wo),Ae (wo),po)",
        "for word-level nodes",
        "TO Tl",
        "{Ts(wo)) {Ts(wo),po)",
        "if w0 is a single-character word",
        "T2 TS T4 TS T6 T?",
        "{Tb(wo)) {Tb(wo),Po) {Te(wo)) {Te(wo),Po) {Tb(wo),Te(wo )) {Tb(wo),Te(wo ),po)",
        "for word-level nodes",
        "CO Cl C2 CS C4 CS C6",
        "{cj),j e [-2, 2] x po",
        "{cj,cj+i),j e [-2, l] x po",
        "{c-!,d) x po",
        "{T(cje [-2, 2] x po",
        "{T(cj),T(cj+1)),j e [-2, l] x po",
        "{T(c-!",
        "),T(a)) x po",
        "{co,T(co)) x po",
        "for character-level nodes",
        "ID",
        "Template",
        "Condition",
        "BO Bl B2 BS B4 BS B6 B?",
        "BS B9",
        "{W-i,Wo)",
        "{p-i,po)",
        "{W-i,po)",
        "{p-i,wo)",
        "{W-i,Wo,po)",
        "{p-i,wo,po)",
        "{W-i,p-i,Wo) {w-i,p-i,po) {W-i,p-i,Wo,po)",
        "{Length(w-l),po)",
        "if w-1 and w0are word-level nodes",
        "TBO TBl TB2 TBS TB4 TBS TB6",
        "{Te(w-i ))",
        "{Te(W-!",
        "),po)",
        "{Te(w-i ),p-i,po) {Te(W-!",
        "),Tb(wo)) {Te(w-!",
        "),Tb(wo),po) {Te(W-!",
        "),p-!,Tb(wo)) {Te(W-!",
        "),p-!,Tb(wo),po)",
        "CBO",
        "{p-i,po)",
        "otherwise",
        "Character type",
        "Description",
        "Space",
        "Space",
        "Numeral",
        "Arabic and Chinese numerals",
        "Symbol",
        "Symbols",
        "Alphabet",
        "Alphabets",
        "Chinese",
        "Chinese characters",
        "Other",
        "Others",
        "(a) Experiments on small training corpus"
      ]
    },
    {
      "heading": "5. Experiments 5.1 Data sets",
      "text": [
        "Previous studies on joint Chinese word segmentation and POS tagging have used Penn Chinese Treebank (CTB) (Xia et al., 2000) in experiments.",
        "However, versions of CTB and experimental settings vary across different studies.",
        "In this paper, we used CTB 5.0 (LDC2005T01) as our main corpus, defined the training, development and test sets according to (Jiang et al., 2008a; Jiang et al., 2008b), and designed our experiments to explore the impact of the training corpus size on our approach.",
        "Table 5 provides the statistics of our experimental settings on the small and large training data.",
        "The out-of-vocabulary (OOV) is defined as tokens in the test set that are not in the training set (Sproat and Emerson, 2003).",
        "Note that the development set was only used for evaluating the trained model to obtain the optimal values of tunable parameters.",
        "We evaluated both word joint word segmentation & Tag).",
        "We used recall Fi as evaluation metrics.",
        "Emerson, 2OOS), we also OOV (ROOV) tokens and kens.",
        "These performance lated as follows:",
        "segmentation (Seg) and and POS tagging (Seg (R), precision (P), and Following (Sproat and measured the recall on in-vocabulary (RIV) to-measures can be calcu-",
        "Precision (P)",
        "# of correct tokens # of tokens in system output # of correct OOV tokens # of OOV tokens in test data # of correct IV tokens # of IV tokens in test data",
        "Recall (R)",
        "# of correct tokens # of tokens in test data",
        "For Seg, a token is considered to be a correct one if the word boundary is correctly identified.",
        "For Seg & Tag, both the word boundary and its POS tag have to be correctly identified to be counted as a correct token.",
        "Our model has three tunable parameters: the number of training iterations N ; the number of top k-best paths; and the threshold r for infrequent words.",
        "Since we were interested in finding an optimal combination of word-level and character-level nodes for training, we focused on tuning r. We fixed N =10 and k = 5 for all experiments.",
        "For the baseline policy, we varied r in the range of [1, 5] and found that setting r = 3 yielded the best performance on the development set for both the small and large training corpus experiments.",
        "For the error-driven policy, we collected unidentified unknown words using 10-fold cross validation on the training set, as previously described in Section 3.",
        "Table 6 shows the results of our word-character hybrid model using the error-driven and baseline policies.",
        "The third and fourth columns indicate the numbers of known and artificial unknown words in the training phase.",
        "The total number of words is the same, but the different policies yield different balances between the known and artificial unknown words for learning the hybrid model.",
        "Optimal balances were selected using the development set.",
        "The error-driven policy provides additional artificial unknown words in the training set.",
        "The error-driven policy can improve ROOV as well as maintain good RIV, resulting in overall Fi improvements.",
        "Data set",
        "CTB chap.",
        "IDs",
        "# of sent.",
        "# of words",
        "Training",
        "l-2?O",
        "S,O46",
        "?S,169",
        "Development",
        "SO1-S2S",
        "SSO",
        "6,821",
        "Test",
        "2?l-SOO",
        "S48",
        "8,OO8",
        "# of POS tags",
        "S2",
        "OOV (word)",
        "O.O98?",
        "(?9O/8,OO8)",
        "OOV (word & POS)",
        "O.114O (91S/8,OO8)",
        "(b) Experiments on large training corpus",
        "Data set",
        "CTB chap.",
        "IDs",
        "# of sent.",
        "# of words",
        "Training",
        "l-2?O,",
        "18,O89",
        "49S,9S9",
        "4OO-9S1,",
        "1OO1-11S1",
        "Development",
        "SO1-S2S",
        "SSO",
        "6,821",
        "Test",
        "2?l-SOO",
        "S48",
        "8,OO8",
        "# of POS tags",
        "SS",
        "OOV (word)",
        "O.OS4?",
        "(2?8/8,OO8)",
        "OOV (word & POS)",
        "O.O42O (SS6/8,OO8)",
        "(a) Experiments on small training corpus",
        "Table 8: Comparison of Fi results of our baseline model with Nakagawa and Uchimoto (2007) and Zhang and Clark (2008) on CTB 3.0.",
        "Table 9: Comparison of averaged F\\ results (by 10-fold cross validation) with previous studies on CTB 3.0.",
        "in this section, we attempt to make meaningful comparison with the best prior approaches reported in the literature.",
        "Although most previous studies used CTB, their versions of CTB and experimental settings are different, which complicates comparison.",
        "Ng and Low (2004) (N&L04) used CTB 3.0.",
        "However, they just showed POS tagging results on a per character basis, not on a per word basis.",
        "Zhang and Clark (2008) (Z&C08) generated CTB",
        "Wang (2007) used CTB that was distributed in the SIGHAN Bakeoff.",
        "Besides CTB, they also used HowNet (Dong and Dong, 2006) to obtain semantic class features.",
        "Zhang and Clark (2008) indicated that their results cannot directly compare to the results of Shi and Wang (2007) due to different experimental settings.",
        "We decided to follow the experimental settings reported the best performances on joint word segmentation and POS tagging using the training materials only derived from the corpora.",
        "The performance scores of previous studies are directly taken from their papers.",
        "We also conducted experiments using the system implemented by Nakagawa and Uchimoto (2007) (N&U07) for comparison.",
        "Our experiment on the large training corpus is identical to that of Jiang et al.",
        "(Jiang et al., 2008a; Jiang et al., 2008b).",
        "Table 7 compares the Fi results with previous studies on CTB 5.0.",
        "The result of our error-driven model is superior to previous reported results for both Seg and Seg & Tag, and the result of our baseline model compares favorably to the others.",
        "Following Zhang and Clark (2008), we first generated CTB 3.0 from CTB 4.0 using sentence IDs 1-10364.",
        "We then divided CTB 3.0 into ten equal sets and conducted 10-fold cross validation.",
        "Unfortunately, Zhang and Clark's experimental setting did not allow us to use our error-driven policy since performing 10-fold cross validation again on each main cross validation trial is computationally too expensive.",
        "Therefore, we used our baseline policy in this setting and fixed r = 3 for all cross validation runs.",
        "Table 8 compares the Fi results of our baseline model with Nakagawa and Uchimoto (2007) and Zhang and",
        "Eval type",
        "Policy",
        "# of words in tra",
        "kwn.",
        "ining (75,169)",
        "art.",
        "unk.",
        "R",
        "P",
        "Fi",
        "Roov",
        "Riv",
        "Seg",
        "error-driven baseline",
        "63,997 64,999",
        "11,172 10,170",
        "0.9587 0.9572",
        "0.9509 0.9489",
        "0.9548 0.9530",
        "0.7557 0.7304",
        "0.9809 0.9820",
        "Seg & Tag",
        "error-driven baseline",
        "63,997 64,999",
        "11,172 10,170",
        "0.8929 0.8897",
        "0.8857 0.8820",
        "0.8892 0.8859",
        "0.5444 0.5246",
        "0.9377 0.9367",
        "(b) Experiments on large training corpus",
        "Eval Type",
        "Policy",
        "# of words in tra",
        "kwn.",
        "ning (493,939)",
        "art.",
        "unk.",
        "R",
        "P",
        "Fi",
        "Roov",
        "Riv",
        "Seg",
        "error-driven baseline",
        "442,423 449,679",
        "51,516 44,260",
        "0.9829 0.9821",
        "0.9746 0.9736",
        "0.9787 0.9779",
        "0.7698 0.7590",
        "0.9906 0.9902",
        "Seg & Tag",
        "error-driven baseline",
        "442,423 449,679",
        "51,516 44,260",
        "0.9407 0.9401",
        "0.9328 0.9319",
        "0.9367 0.9360",
        "0.5982 0.5952",
        "0.9557 0.9552",
        "Method",
        "Seg",
        "Seg & Tag",
        "Ours (error-driven)",
        "0.9787",
        "0.9367",
        "Ours (baseline)",
        "0.9779",
        "0.9360",
        "Jiang08a",
        "0.9785",
        "0.9341",
        "Jiang08b",
        "0.9774",
        "0.9337",
        "N&U07",
        "0.9783",
        "0.9332",
        "Seg",
        "Seg & Tag",
        "N&U07",
        "Z&C08",
        "Ours",
        "N&U07",
        "Z&C08",
        "Ours",
        "Trial",
        "(base.)",
        "(base.)",
        "1",
        "0.9701",
        "0.9721",
        "0.9732",
        "0.9262",
        "0.9346",
        "0.9358",
        "2",
        "0.9738",
        "0.9762",
        "0.9752",
        "0.9318",
        "0.9385",
        "0.9380",
        "3",
        "0.9571",
        "0.9594",
        "0.9578",
        "0.9023",
        "0.9086",
        "0.9067",
        "4",
        "0.9629",
        "0.9592",
        "0.9655",
        "0.9132",
        "0.9160",
        "0.9223",
        "5",
        "0.9597",
        "0.9606",
        "0.9617",
        "0.9132",
        "0.9172",
        "0.9187",
        "6",
        "0.9473",
        "0.9456",
        "0.9460",
        "0.8823",
        "0.8883",
        "0.8885",
        "7",
        "0.9528",
        "0.9500",
        "0.9562",
        "0.9003",
        "0.9051",
        "0.9076",
        "8",
        "0.9519",
        "0.9512",
        "0.9528",
        "0.9002",
        "0.9030",
        "0.9062",
        "9",
        "0.9566",
        "0.9479",
        "0.9575",
        "0.8996",
        "0.9033",
        "0.9052",
        "10",
        "0.9631",
        "0.9645",
        "0.9659",
        "0.9154",
        "0.9196",
        "0.9225",
        "Avg.",
        "0.9595",
        "0.9590",
        "0.9611",
        "0.9085",
        "0.9134",
        "0.9152",
        "Method",
        "Seg",
        "Seg & Tag",
        "Ours (baseline)",
        "0.9611",
        "0.9152",
        "Z&C08",
        "0.9590",
        "0.9134",
        "N&U07",
        "0.9595",
        "0.9085",
        "N&L04",
        "0.9520",
        "-",
        "Clark (2008) on CTB 3.0.",
        "Table 9 shows a summary of averaged Fi results on CTB 3.0.",
        "Our baseline model outperforms all prior approaches for both Seg and Seg & Tag, and we hope that our error-driven model can further improve performance."
      ]
    },
    {
      "heading": "6. Related work",
      "text": [
        "In this section, we discuss related approaches based on several aspects of learning algorithms and search space representation methods.",
        "Maximum entropy models are widely used for word segmentation and POS tagging tasks (Uchimoto et al., 2001; Ng and Low, 2004; Nakagawa, 2004; Nakagawa and Uchimoto, 2007) since they only need moderate training times while they provide reasonable performance.",
        "Conditional random fields (CRFs) (Lafferty et al., 2001) further improve the performance (Kudo et al., 2004; Shi and Wang, 2007) by performing whole-sequence normalization to avoid label-bias and length-bias problems.",
        "However, CRF-based algorithms typically require longer training times, and we observed an infeasible convergence time for our hybrid model.",
        "Online learning has recently gained popularity for many NLP tasks since it performs comparably or better than batch learning using shorter training times (McDonald, 2006).",
        "For example, a per-ceptron algorithm is used for joint Chinese word segmentation and POS tagging (Zhang and Clark, 2008; Jiang et al., 2008a; Jiang et al., 2008b).",
        "Another potential algorithm is MIRA, which integrates the notion of the large-margin classifier (Crammer, 2004).",
        "In this paper, we first introduce MIRA to joint word segmentation and POS tagging and show very encouraging results.",
        "With regard to error-driven learning, Brill (1995) proposed a transformation-based approach that acquires a set of error-correcting rules by comparing the outputs of an initial tagger with the correct annotations on a training corpus.",
        "Our approach does not learn the error-correcting rules.",
        "We only aim to capture the characteristics of unknown words and augment their representatives.",
        "As for search space representation, Ng and Low (2004) found that for Chinese, the character-based model yields better results than the word-based model.",
        "Nakagawa and Uchimoto (2007) provided empirical evidence that the character-based model is not always better than the word-based model.",
        "They proposed a hybrid approach that exploits both the word-based and character-based models.",
        "Our approach overcomes the limitation of the original hybrid model by a discriminative online learning algorithm for training."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "In this paper, we presented a discriminative word-character hybrid model for joint Chinese word segmentation and POS tagging.",
        "Our approach has two important advantages.",
        "The first is robust search space representation based on a hybrid model in which word-level and character-level nodes are used to identify known and unknown words, respectively.",
        "We introduced a simple scheme based on the error-driven concept to effectively learn the characteristics of known and unknown words from the training corpus.",
        "The second is a discriminative online learning algorithm based on MIRA that enables us to incorporate arbitrary features to our hybrid model.",
        "Based on extensive comparisons, we showed that our approach is superior to the existing approaches reported in the literature.",
        "In future work, we plan to apply our framework to other Asian languages, including Thai and Japanese."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We would like to thank Tetsuji Nakagawa for his helpful suggestions about the word-character hybrid model, Chen Wenliang for his technical assistance with the Chinese processing, and the anonymous reviewers for their insightful comments."
      ]
    }
  ]
}
