{
  "info": {
    "authors": [
      "Dimitrios Galanis",
      "George Karakatsiotis",
      "Gerasimos Lampouras",
      "Ion Androutsopoulos"
    ],
    "book": "EACL – Demos",
    "id": "acl-E09-2005",
    "title": "An Open-Source Natural Language Generator for OWL Ontologies and its Use in Protege and Second Life",
    "url": "https://aclweb.org/anthology/E09-2005",
    "year": 2009
  },
  "references": [],
  "sections": [
    {
      "text": [
        "An Open-Source Natural Language Generator for OWL Ontologies and",
        "its Use in Protege and Second Life",
        "Dimitrios Galanis*, George Karakatsiotis*, Gerasimos Lampouras*, Ion Androutsopoulos*+",
        "*Department of Informatics, Athens University of Economics and Business, Athens, Greece +Digital Curation Unit, Research Centre \"Athena\", Athens, Greece",
        "We demonstrate an open-source natural language generation engine that produces descriptions of entities and classes in English and Greek from owl ontologies that have been annotated with linguistic and user modeling information expressed in RDF.",
        "We also demonstrate an accompanying plug-in for the Protege ontology editor, which can be used to create the ontology's annotations and generate previews of the resulting texts by invoking the generation engine.",
        "The engine has been embedded in robots acting as museum tour guides in the physical world and in Second Life; here we demonstrate the latter application."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "NaturalowL (Galanis and Androutsopoulos, 2007; Androutsopoulos and Galanis, 2008) is a natural language generation engine that produces descriptions of entitities (e.g., items for sale, museum exhibits) and classes (e.g., types of exhibits) in English and Greek from OWL DL ontologies; the ontologies must have been annotated with linguistic and user modeling annotations expressed in RDF.",
        "An accompanying plug-in for the well known Protege ontology editor is available, which can be used to create the linguistic and user modeling annotations while editing an ontology, as well as to generate previews of the resulting texts by invoking the generation engine.",
        "NaturalowL is based on ideas from ilex (O'Donnell et al., 2001) and m-piro (Isard et al., 2003; Androutsopoulos et al., 2007), but it uses templates instead of systemic grammars, it is publicly available as open-source software, it is written entirely in Java, and it provides native support for OWL ontologies, making it particularly useful for Semantic Web applications (Antoniou and van Harmelen, 2004).",
        "Well known advantages of natural language generation (Reiter and Dale, 2000) include the ability to generate texts in multiple languages from the same ontology; and the ability to tailor the semantic content and language expressions of the texts to the user type (e.g., child vs. adult) and the interaction history (e.g., by avoiding repetitions, or by comparing to previous objects).",
        "In project xenios (Vogiatzis et al., 2008), Nat-uralOWL was embedded in a mobile robot acting as a museum guide, and in project indigo it is being integrated in a more advanced robotic guide that includes a multimodal dialogue manager, facial animation, and mechanisms to recognize and express emotions (Konstantopoulos et al., 2009).",
        "Here, we demonstrate a similar application, where NaturalOWL is embedded in a robotic avatar acting as a museum guide in Second Life (Oberlander et al., 2008), as shown in figure 1.",
        "We also demonstrate how the underlying ontology of the museum and its linguistic and user modeling annotations can be edited in Protege."
      ]
    },
    {
      "heading": "2. Natural OWL 's architecture",
      "text": [
        "Naturalowl adopts a typical natural language generation pipeline (Reiter and Dale, 2000).",
        "It produces texts in three stages: document planning, microplanning, and surface realization.",
        "In document planning, the system first selects from the ontology the logical facts (owl triples) that will be conveyed to the user, taking into account interest scores manually assigned to the facts via the annotations of the ontology, as well as a dynamcally updated user model that shows what information has already been conveyed to the user.",
        "Logical facts that report similarities or differences to previously encountered entities may also be included in the output of content selection, giving rise to comparisons like the one in figure 1.",
        "The selected facts are then ordered using a manually specified partial order, which is also part of the ontology's annotations.",
        "In micro-planning, the system turns each selected fact into a sentence by using micro-plans, in effect patterns that leave referring expressions underspecified.",
        "Figure 2 shows a micro-plan being edited with Naturalowl's Protege plug-in.",
        "The micro-plan specifies that to express a fact that involves the made-of property, the system should concatenate an automatically generated referring expression (e.g., name, pronoun, definite noun phrase) in nominative case for the owner of the fact (semantic subject of the triple), the verb form \"is made\" (or \"are made\", if the subject is in plural), the preposition \"of\", and then another automatically generated referring expression in accusative case for the filler of the property (semantic object).",
        "The referring expressions are generated by taking into account the context of each sentence, attempting to avoid repetitions without introducing ambiguities.",
        "Domain-independent aggregation rules are then employed to combine the resulting sentences into longer ones.",
        "In surface realization, the final form of the text is produced; it can be marked up automatically with tags that indicate punctuation symbols, grammatical categories, the logical facts expressed by the sentences, the interest (Int) of each sentence's information, the degree (Assim) to which the information is taken to be assimilated by the user etc., as shown below.",
        "In indigo, comparisons are also marked up with angles that guide the robot to turn to the object(s) it compares to.",
        "<Period> <Demonstrative ref=\".../#exhibit1\" role=\"owner\">",
        "This</Demonstrative> <Sentence Property=\".../#subtype",
        "role=\"owner\"> it</Pronoun> <Verb>was painted</Verb> <Preposition>by</Preposition>",
        "the painter of Kleophrades</Name> </Sentence> <Punct>.</Punct> </Period>",
        "Naturalowl's plug-in for Protege can be used to specify all the linguistic and user modeling annotations of the ontologies that Naturalowl requires.",
        "The annotations in effect establish a domain-dependent lexicon, whose entries are associated with classes or entities of the ontology; micro-plans, which are associated with properties of the ontology; a partial order of properties, which is used in document planning; interest scores, indicating how interesting the various facts of the ontology are to each user type; parameters that control, for example, the desired length of the generated texts.",
        "The plug-in can also be used to generate previews of the resulting texts, for different types of users, with or without comparisons, etc., as illustrated in figure 3.",
        "The resulting annotations are then saved in rdf.",
        "In Second Life, each user controls an avatar, which can, among other actions, move in the virtual world, touch objects, or communicate with other avatars; in the latter case, the user types text on the keyboard.",
        "In the Second Life application that we demonstrate, the robot is an avatar that is not controlled by a human, but by our own Second Life client software.",
        "The client software includes a navigation component, which controls the robot's movement, and it allows the robot to \"utter\" texts generated by NaturalOWL, instead of expecting keyboard input.",
        "Whenever a visitor near the robot touches an exhibit, an appropriate event is sent to the robot, which then goes near the exhibit and starts describing it."
      ]
    },
    {
      "heading": "3. Conclusions and further work",
      "text": [
        "The demonstration presents an open-source natural language generation engine for OWL ontologies, which generates descriptions of entities and classes in English and Greek.",
        "The engine is accompanied by a Protege plug-in, which can be used to annotate the ontologies with linguistic and user modeling information required by the generation engine.",
        "The demonstration includes an application in Second Life, where the generation engine is embedded in a robotic avatar acting as a museum guide.",
        "We are currently extending Natu-ralowL to handle follow up questions about entities or classes mentioned in the generated texts."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "NaturalOWL was developed in project xenios, which was funded by the Greek General Secretariat of Research and Technology and the European Union.",
        "NaturalOWL is now being extended in project INDIGO, which is funded by the European Union; our work in INDIGO is also supported by additional funding from the Greek General Secretariat of Research and Technology."
      ]
    }
  ]
}
