{
  "info": {
    "authors": [
      "Jong-Hoon Oh",
      "Kiyotaka Uchimoto",
      "Kentaro Torisawa"
    ],
    "book": "EMNLP",
    "id": "acl-D09-1069",
    "title": "Can Chinese Phonemes Improve Machine Transliteration?: A Comparative Study of English-to-Chinese Transliteration Models",
    "url": "https://aclweb.org/anthology/D09-1069",
    "year": 2009
  },
  "references": [
    "acl-J96-1002",
    "acl-P02-1051",
    "acl-P04-1021",
    "acl-P06-1143",
    "acl-P07-1015",
    "acl-P07-1016",
    "acl-P07-1082",
    "acl-P07-1119",
    "acl-P98-2215",
    "acl-W03-0317",
    "acl-W03-1508",
    "acl-W97-0301"
  ],
  "sections": [
    {
      "text": [
        "Can Chinese Phonemes Improve Machine Transliteration?",
        ": A Comparative Study of English-to-Chinese Transliteration Models",
        "Jong-Hoon Oh, Kiyotaka Uchimoto, and Kentaro Torisawa",
        "Language Infrastructure Group, MASTAR Project, National Institute of Information and Communications Technology (NICT) 3-5 Hikaridai Seika-cho, Soraku-gun, Kyoto 619-0289 Japan {rovellia,uchimoto,torisawa}@nict.go.jp",
        "Inspired by the success of English grapheme-to-phoneme research in speech synthesis, many researchers have proposed phoneme-based English-to-Chinese transliteration models.",
        "However, such approaches have severely suffered from the errors in Chinese phoneme-to-grapheme conversion.",
        "To address this issue, we propose a new English-to-Chinese transliteration model and make systematic comparisons with the conventional models.",
        "Our proposed model relies on the joint use of Chinese phonemes and their corresponding English graphemes and phonemes.",
        "Experiments showed that Chinese phonemes in our proposed model can contribute to the performance improvement in English-to-Chinese transliteration."
      ]
    },
    {
      "heading": "1. Introduction 1.1 Motivation",
      "text": [
        "Transliteration, i.e., phonetic translation, is commonly used to translate proper names and technical terms across languages.",
        "A variety of English-to-Chinese machine transliteration models has been proposed in the last decade (Meng et al., 2001; Gao et al., 2004; Jiang et al., 2007; Lee and Chang, 2003; Li et al., 2004; Li et al., 2007; Wan and Verspoor, 1998; Virga and Khudanpur, 2003).",
        "They can be categorized into those based on Chinese phonemes (Meng et al., 2001; Gao et al., 2004; Jiang et al., 2007; Lee and Chang, 2003; Wan and Verspoor, 1998; Virga and Khudanpur, 2003) and those that don't rely on Chinese phonemes (Li et al., 2004; Li et al., 2007).",
        "Inspired by the success of English grapheme-to-phoneme research in speech synthesis, many researchers have proposed phoneme-based Englishto-Chinese transliteration models.",
        "In these approaches, Chinese phonemes are generated from English graphemes or phonemes, and then the Chinese phonemes are converted into Chinese graphemes (or characters), where Chinese Pinyin strings are used for representing a syllable-level Chinese phoneme sequence.",
        "Despite its high accuracy in generating Chinese phonemes from English, this approach has severely suffered from errors in Chinese phoneme-to-grapheme conversion, mainly caused by Chinese homophone confusion - one Chinese Pinyin string can correspond to several Chinese characters (Li et al., 2004).",
        "For example, the Pinyin string \"LI\" corresponds to such different Chinese characters as ^IJ, ftj, and JL For this reason, it has been reported that English-to-Chinese transliteration without Chinese phonemes outperforms that with Chinese phonemes (Li et al., 2004).",
        "Then \"Can Chinese phonemes improve English-to-Chinese transliteration, if we can reduce the errors in Chinese phoneme-to-grapheme conversion?\"",
        "Our research starts from this question.",
        "Previous approaches using Chinese phonemes have relied only on Chinese phonemes in Chinese phoneme-to-grapheme conversion.",
        "However, the simple use of Chinese phonemes doesn't always provide a good clue to reduce the ambiguity in Chinese phoneme-to-grapheme conversion.",
        "Let us explain with an example, the Chinese transliteration of Greeley in Table 1, where Chinese phonemes are represented in terms of Chinese Pinyin strings and English phonemes are represented by ARPAbet symbols.",
        "In Table 1, Chinese Pinyin string \"LI\" corresponds to two different Chinese characters, ÜL and",
        "Proceedings of the 2009 Conference on Empirical Methods in Natural Language Processing, pages 658-667, Singapore, 6-7 August 2009.",
        "©2009 ACL and AFNLP",
        "Table 1 : Chinese Pinyin string \"LI\" and its corresponding Chinese characters in Chinese transliteration of Greeley ^IJ.",
        "It seems difficult to find evidence for selecting the correct Chinese character corresponding to each Chinese Pinyin string \"LI\" by just looking at the sequence of Chinese Pinyin strings \"GE LI LI.\"",
        "However, English graphemes (ree and ley) or phonemes (\"R IY\" and \"L IY\") corresponding to Chinese Pinyin string \"LI\", especially their consonant parts (r and / in the English graphemes and \"R\" and \"L\" in the English phonemes), provide strong evidence to resolve the ambiguity.",
        "Thus, we can easily find rules for the conversion from Chinese Pinyin string \"LI\" to ÜL and ^IJ as follows:",
        "Based on the observation, we propose an English-to-Chinese transliteration model based on the joint use of Chinese phonemes and their corresponding English graphemes and phonemes.",
        "We define a set of English-to-Chinese transliteration models and categorize them into the following three classes:",
        "• Mi: Models Independent of Chinese phonemes",
        "• Ms : Models based on Simple use of Chinese phonemes",
        "• Mj: Models based on Joint use of Chinese phonemes and English graphemes and phonemes that correspond to our proposed model.",
        "Our comparison among the three types of transliteration models can be summarized as follows.",
        "• The Mi models relying on either English graphemes or phonemes could not outperform those based on both English graphemes and phonemes.",
        "phonemes and syllables (Yin and Felley, 1990).",
        "• The Ms models always showed the worst performance due to the severe error rate in Chinese phoneme-to-grapheme conversion.",
        "• The Mj models significantly reduced errors in Chinese phoneme-to-grapheme conversion; thus they achieved the best performance.",
        "The rest of this paper is organized as follows.",
        "Section 2 introduces the notations used throughout this paper.",
        "Section 3 describes the transliteration models we compared.",
        "Section 4 describes our tests and results.",
        "Section 5 concludes the paper with a summary."
      ]
    },
    {
      "heading": "2. Preliminaries",
      "text": [
        "Let Eg be an English word composed of « English graphemes, and let Ep be a sequence of English phonemes that represents the pronunciation of Eg-Let Cq be a sequence of Chinese graphemes corresponding to the Chinese transliteration of Eg, and let Cp be a sequence of Chinese phonemes that represents the pronunciation oïCg-",
        "Cp corresponds to a sequence of the Chinese Pinyin strings of Cg- Because a Chinese Pinyin string represents the pronunciation of a syllable consisting of consonants and vowels, we divide a Chinese Pinyin string into consonant and vowel parts like \"L+I\", \"L+I+N\", and \"SH+A.\"",
        "In this paper, we define a Chinese phoneme as the vowel and consonant parts in a Chinese Pinyin string (e.g., \"L\", \"SH\", and \"I\").",
        "A Chinese character usually corresponds to multiple English graphemes, English phonemes, and Chinese phonemes (i.e., ÜL corresponds to English graphemes ree, English phonemes \"R IY\", and Chinese phonemes \"L I\" in Table 1).",
        "To represent these many-to-one correspondences, we use the well-known BIO labeling scheme to represent a Chinese character, where B and I represent the beginning and inside/end of the Chinese characters, respectively, and O is not used.",
        "Each Chinese phoneme corresponds to a Chinese character with B and I labels.",
        "For example, Chinese character \"II\" in Table 1 can be represented as \"J|:B\" and \"11:1\", where \"J|:B\" and \"11:1\" correspond to Chinese phonemes \"L\" and \"I\", respectively.",
        "In this paper, we define a Chinese grapheme as a Chinese character represented with a BIO label, e.g., \"JL:B\" and \"ML\"",
        "English grapheme",
        "g",
        "ree",
        "ley",
        "English phoneme",
        "G",
        "RIY",
        "LIY",
        "Chinese Pinyin",
        "GE",
        "LI",
        "LI",
        "Chinese character",
        "M",
        "M",
        "Table 2: egi and its corresponding epi, cpi, and cgi in Greeley and its corresponding Chinese transliteration \"fèmf ü\"",
        "Then Ep, Cp, and Cg can be segmented into a series of sub-strings, each of which corresponds to an English grapheme in Eg- We can thus write where egi, epi, cpi, and cgi represent the i English grapheme, English phonemes, Chinese phonemes, and Chinese graphemes corresponding to egi, respectively.",
        "Based on the definition, we model English-to-Chinese transliteration so that each English grapheme is tagged with its corresponding English phonemes, Chinese phonemes, and Chinese graphemes.",
        "Table 2 illustrates egi, epi, cpi, and cgi with the same example listed in Table 1 (English word Greeley and its corresponding Chinese transliteration \"fê-JlW), where <fi represents an empty string."
      ]
    },
    {
      "heading": "3. Transliteration Model",
      "text": [
        "We defined eighteen transliteration models to be compared.",
        "These transliteration models are classified into three classes, Mi, Ms, and Mj as described in Section 1.2; each class has three basic transliteration models and three hybrid ones.",
        "In this section, we first describe the basic transliteration models in each class by focusing on the main difference among the three classes and then describe the hybrid transliteration models.",
        "The basic transliteration models in each class are denoted as M(x, y).",
        "x is an English-side parameter representing English grapheme (Eg), English phoneme (Ep), and the joint use of English grapheme and phoneme (Egp = (Eg,Ep)) that contributes to generating Chinese phonemes or Chinese graphemes in a transliteration model, y is a Chinese-phoneme parameter that represents a way of using Chinese phonemes to generate Chinese graphemes in a transliteration model.",
        "Since M(x,<fi) represents a transliteration model that does not rely on Chinese phonemes, it falls into Mi, while M(x, Cp) corresponds to a transliteration model in Ms that only uses Chinese phonemes in Chinese phoneme-to-grapheme conversion.",
        "M(x, JCp) is a transliteration model in the Mj class that generates Chinese transliterations based on joint use of x and Chinese phoneme Cp, where x g X.",
        "Thus, M(x,JCp) can be rewritten as M(x, (x,Cp)), where the joint representation of x and Cp, (x, Cp), is used in Chinese phoneme-to-grapheme conversion.",
        "The three basic models in Mj can be interpreted as follows:",
        "M (Eg, JCp) directly converts English graphemes into Chinese phonemes without the help of English phonemes and then generates Chinese transliterations based on the joint representation of English graphemes and Chinese phonemes.",
        "The main difference between M(Ep,JCP) and M(EGp,JCP) lies in the use of English graphemes to generate Chinese phonemes and graphemes.",
        "English graphemes are only used in English grapheme-to-phoneme conversion, and English phonemes play a crucial role for generating Chinese transliteration in M(Ep, JCp).",
        "Chinese phoneme-to-grapheme conversion that relies on the joint use of English graphemes, English phonemes, and Chinese Pm(eg,jcp) phonemes is the key feature of M(Egp, JCp).",
        "Because M(a;, JCp) can be interpreted as M(x,(x,Cp)), English-side parameter x determines the English graphemes and phonemes, or both jointly used with Chinese phonemes in Chinese phoneme-to-grapheme conversion.",
        "Then we can represent the three basic transliteration models as in Eqs.",
        "(l)-(3), where P(Cg\\Eg, Cp), P{CG\\Ep, Cp), and P{CG\\EG, EP, CP) are the key points in our proposed models, Mj.",
        "i",
        "1",
        "2",
        "3",
        "4",
        "5",
        "6",
        "7",
        "Eg",
        "g",
        "r",
        "e",
        "e",
        "/",
        "e",
        "Ep",
        "G",
        "R",
        "IY",
        "<\\>",
        "L",
        "IY",
        "</>",
        "Cp",
        "GE",
        "L",
        "I",
        "L",
        "I",
        "GE",
        "LI",
        "LI",
        "CG",
        "M:B",
        "M:I",
        "flJ:B",
        "flJ:I",
        "M",
        "m",
        "0",
        "•",
        "Eg",
        "= egi, ■ ■",
        "■ ,egn",
        "= &9i",
        "•",
        "Ep",
        "= epi,--",
        "■ ,epn",
        "= ep\"",
        "•",
        "Cp",
        "= cpi,--",
        "■ ,cpn",
        "= cpi",
        "•",
        "CG",
        "= cgi, ■ ■",
        "■ ,cgn",
        "= CQi",
        "The three basic transliteration models in Ms - M(EG, Cp), M{EP, Cp), and M{EGP, CP) are formulated as Eqs.",
        "(4)-(6).",
        "Chinese phoneme-based transliteration models in the literature fall into either M{EG, CP) or M{EP, CP) (Meng et al., 2001; Gao et al., 2004; Jiang et al., 2007; Lee and Chang, 2003; Wan and Verspoor, 1998; Virga and Khudanpur, 2003).",
        "The three basic transliteration models in Ms are identical as those in Mj, except for the Chinese phoneme-to-grapheme conversion method.",
        "They only depend on Chinese phonemes in Chinese phoneme-to-grapheme conversion represented as P(Cg\\Cp) in Eqs.",
        "(4)-(6).",
        "The three basic transliteration models in Mi are represented in Eqs.",
        "(7)-(9).",
        "Because the Mi models are independent of Chinese phonemes, they are the same as the transliteration models in the literature used for machine transliteration from English to other languages without relying on target-language phonemes (Karimi et al., 2007; Malik, 2006; Oh et al., 2006; Sherif and Kondrak, 2007; Yoon et al., 2007).",
        "Note that M(EG,4>) is the same transliteration model as the one proposed by Li et al.",
        "(2004).",
        "The hybrid transliteration models in each class are defined by discrete mixture between the probability distribution of the two basic transliteration models, as in Eq.",
        "(10) (Al-Onaizan and Knight, 2002; Oh et al., 2006), where 0 < a < 1.",
        "We denote a hybrid transliteration model between two basic transliteration models M(xi,y) and M(x2,y) as M(x\\ + X2,y,a), where y g Y = {<p,Cp, JCp}, x\\ / X2, and x\\,X2 g X = {Eg,Ep,Egp}.",
        "In this paper, we define three types of hybrid transliteration models in each class: M(EG + EP, y, a), M(EG + EGp,y, a), and M(Ep + Egp, y, a).",
        "Because Eqs.",
        "(l)-(9) can be estimated in a similar way, we limit our focus to Eq.",
        "(3) in this section.",
        "Assuming that P{EP\\EG), P{CP\\EG,Ep), and P(Cg\\Eg, Ep, Cp) in Eq.",
        "(3) depend on the size of the context window, k (k = 3 in this paper), they can be simplified into a series of products in Eqs.",
        "(11)-(13).",
        "The maximum entropy model is used to estimate the probabilities in Eqs.",
        "(11) – (13) (Berger et al., 1996).",
        "Generally, a conditional maximum entropy model is an exponential model that gives the conditional probability, as described in Eq.",
        "(14), where Ai is the parameter to be estimated and fi(a, b) is a feature function corresponding to A» (Berger et al., 1996; Ratnaparkhi, 1997):",
        "fi(a,b) is a binary function returning TRUE or FALSE based on context a and output b.",
        "If fi(a,b)=\\, its corresponding model parameter Ai contributes toward conditional probability P(b\\a) (Berger et al., 1996; Ratnaparkhi, 1997).",
        "The feature functions used here are defined in terms of context predicates – a function returning TRUE or FALSE that depends on the presence of the information in the current context (Ratnaparkhi, 1997).",
        "Context predicates and their descriptions used are given in Table 4.",
        "N-gram includes gram\\(uj), gram2(uj), and granis(uj) corresponding to a unigram, a bigram, and a trigram, respectively.",
        "Pair includes a pair of unigrams (pair\\\\), unigram and bigram (pair\\2), and bigrams (pair22).",
        "Triple includes a triple of three unigrams (triplex) and a triple of two unigrams and one bigram (triple2).",
        "Note that if different context predicates represent the same context, we accept one of them and ignore the others (e.g., pair\\2(uj,Uj+i) = trigram(uj) = u^+2).",
        "Table 3 represents the examples of feature functions for P(cgi\\cgl~_\\, (eg, ep, cp)^).",
        "We used the \"Maximum Entropy Modeling Toolkit\" to estimate the probabilities and the LBFGS algorithm to find Ai in Eq.",
        "(14).",
        "For each transliteration model, we produced n-best transliterations using a stack decoder (Schwartz and Chow, 1990).",
        "In this paper, we defined eighteen transliteration models to be compared.",
        "There are six transliteration models, three basic and three hybrid ones, in each class, Mi, Ms, and Mj.",
        "We compared the transliteration models from the viewpoint of Chinese phonemes or the class of transliteration models in our experiments."
      ]
    },
    {
      "heading": "4. Testing and Results",
      "text": [
        "We used the same test set used in Li et al.",
        "(2004) for our testing.",
        "It contains 37,694 pairs of English words and their official Chinese transliterations",
        "Available at http://homepages.inf.ed.ac.",
        "uk/s0450736/maxent_toolkit.html",
        "fl",
        "gram;i(egi)",
        "1-2",
        "= \"ree\"",
        "= \"S",
        "B",
        "h",
        "pairn(cpi-i,cgi-i)",
        "CPi-",
        "-1",
        "= \"G\", cft_!",
        "= \"fê:B\"",
        "cgi = \"M",
        "B",
        "h",
        "pairi2(cgi-i,cpi-i)",
        "cp\\_",
        "-1",
        "= \"GE L\", cgi-\\= \"#r:B\"",
        "= \"S",
        "B",
        "h",
        "pair22(cpi-i,cgi-2)",
        "egl",
        "-1",
        "= \"gr\", ePi-i = \"G R\"",
        "= \"S",
        "B",
        "h",
        "triplei(egi,cpi,cgi-i)",
        "=",
        "'r\", cpi-i = \"GE\", cgi-\\= \"|§-:B\"",
        "cgi = \"M",
        "B",
        "h",
        "triple2(egi-i,cgi-i,cpi-i)",
        "egi-",
        "-1",
        "= \"g\", cv\\-i= \"GE L\", cgi-\\= \"|§-:B\"",
        "= \"S",
        "B",
        "gram\\(uj)",
        "Uj",
        "i+i",
        "gram2(uj)",
        "gram;i(uj)",
        "pairn(uj,vk) pain2(uj,vk) pair22(uj,vk)",
        "Uj, vk",
        "v vk+1J' uk",
        "vj+l vk+ u'j ' uk",
        "triplei(uj,vk,wi)",
        "Uj, Vk, Wl",
        "triple2(uj,vk,wi)",
        "Uj, vk, wl",
        "extracted from the \"Chinese Transliteration of Foreign Personal Names\" (Xinhua News Agency, 1992), which includes names in English, French, German, and many other foreign languages (Li et al., 2004).",
        "We used the same test data as in Li et al.",
        "(2004).",
        "But we randomly selected 90% of the training data used in Li et al.",
        "(2004) as our training data and the remainder as the development data, as shown in Table 5.",
        "Table 5 : Number of English-Chinese transliteration pairs in each data set_",
        "We used the training data for training the transliteration models.",
        "For each model, we tuned the parameters including the number of iterations for training the maximum entropy model and a Gaussian prior for smoothing the maximum entropy model using the development data.",
        "Further, the development data was used to select parameter a of the hybrid transliteration models.",
        "We varied parameter a from 0 to 1 in 0.1 intervals (i.e., a=0, 0.1, 0.2, • • •,!)",
        "and tested the performance of the hybrid models with the development data.",
        "Then we chose a that showed the best performance in each hybrid model.",
        "The blind test data was used for evaluating the performance of each transliteration model.",
        "The CMU Pronouncing Dictionary, which contains about 120,000 English words and their pronunciations, was used for estimating P(Ep\\Eg).",
        "We conducted two experiments.",
        "First, we compared the overall performance of the transliteration models.",
        "Second, we investigated the effect of training data size on the performance of each transliteration model.",
        "The evaluation was done for word accuracy in top-1 (ACC), Chinese pronunciation accuracy (CPA) and a mean reciprocal rank (MRR) metric (Kantor and Voorhees, 2000; Li et al., 2009; Chang et al., 2009).",
        "ACC measures how many correct transliterations appeared in the top-1 result of each system.",
        "CPA measures the Chinese pronunciation accuracy in the top-1 of the n-best Chinese pronunciation.",
        "We used CPA for comparing the performance between systems based on Chinese phonemes.",
        "MRR, mean reciprocal ranks of n-best results of each system over the test entries, is an evaluation measure for n-best transliterations.",
        "If a transliteration generated by a system matches a reference transliteration at the rth position of the n-best results, its reciprocal rank equals 1/r; otherwise its reciprocal rank equals 0, where 1 < r < n. We produced 10-best Chinese transliterations for each English word in our experiments.",
        "Table 6 represents the overall performance of one system in a previous work (Li et al., 2004) and eighteen systems based on the transliteration models defined in this paper.",
        "ACC, MRR, and CPA represent the evaluation results for each model trained by our training data.",
        "To test transliteration models without the errors introduced by incorrect Chinese phonemes, we carried out the experiments with the correct Chinese pronunciation (or the correct Chinese phoneme sequence) in Chinese phoneme-to-grapheme conversion.",
        "In the experiment, we put the correct Chinese pronunciation into the top-1 of the n-best Chinese pronunciation with the highest probability, say P(Cp\\Eg)=1; thus CPA was assumed to be 100%.",
        "The ACC of the transliteration models under this condition is denoted as ACC in Table 6.",
        "Train represents the evaluation results of the transliteration models trained by our training data.",
        "To compare Li et al.",
        "(2004) and transliteration models defined in this paper under the same condition, we also carried out experiments with the same training data in Li et al.",
        "(2004).",
        "Since the training data used in Li et al.",
        "(2004) is identical as the union of our training and development data, we denoted it as Train+Dev in Table 6.",
        "In both Train and Train+Dev, we used the same parameter setting that was obtained by using the development data.",
        "LI04 represents a system in Li et al.",
        "(2004), and its ACC in Train+Dev is taken from the literature.",
        "The systems based on the transliteration models defined in our paper are represented from the second row in Table 6.",
        "The phoneme-based transliteration models in the literature correspond to either M(Eg, Cp) (Wan and Verspoor, 1998; Lee and Chang, 2003; Jiang et al., 2007) or M{Ep, Cp) (Meng et al., 2001; Gao et al., 2004;",
        "Virga and Khudanpur, 2003).",
        "A comparison between the basic and hybrid transliteration models showed that the hybrid ones usually performed better (the exception was M(Ep+Egp, y, a) but the performance still comparable to the basic ones in each class).",
        "Especially, the hybrid ones based on the best two basic transliteration models, M(EG+EGp,y,a), showed the best performance.",
        "A comparison among the Mi, Ms, and Mj models showed that Chinese phonemes did contribute to the performance improvement of English-to-Chinese transliteration when Chinese phonemes were used together with their corresponding English graphemes and phonemes in Chinese phoneme-to-grapheme conversion.",
        "A one-tail paired t-test between the Mi and Mj models showed that the results of the Mj models were always significantly better than those of the Mi models if the Mi and Mj models shared the same English-side parameter, x g {Eg, Ep, Egp} (level of significance = 0.001).",
        "In the results obtained by the Ms and Mj models, the figures in CPA are the same when the Ms and our Mj models share the same English-side parameter.",
        "Moreover, the difference between the figures in ACC and CPA can be interpreted as the error rate of Chinese phoneme-to-grapheme conversion.",
        "Our proposed Mj models generated Chinese transliterations with a very low error rate in Chinese phoneme-to-grapheme conversion, while the Ms models suffered from a significant error rate in Chinese phoneme-to-grapheme conversion.",
        "ACC showed that the Mj models still outperformed the Ms models even without errors in generating Chinese pronunciation from the English words.",
        "These results indicate that the joint use of Chinese phonemes and their corresponding English graphemes and phonemes significantly improved the performance in Chinese phoneme-to-grapheme conversion and English-to-Chinese transliteration.",
        "Table 7 shows the Chinese transliterations generated by M (EG, <j>), M (Egp, <f>), M (Eg, JCp), and M (Egp, JCP) where English or Chinese phonemes contributed to the correct transliteration.",
        "In this table, the first column show the English words and their English phonemes, and the second and third columns represent the Chinese transliterations and their phonemes.",
        "Note that the Chinese phonemes in the second and third columns of the Mi models are not used in transliteration.",
        "They are shown in the table to indicate the difference in the Chinese phonemes of Chinese",
        "Class",
        "Model",
        "Train",
        "Train+Dev",
        "acc",
        "mrr",
        "cpa",
        "acc",
        "acc",
        "mrr",
        "cpa",
        "acc",
        "LI04",
        "N/A",
        "N/A",
        "N/A",
        "N/A",
        "70.1",
        "N/A",
        "N/A",
        "N/A",
        "M(EG, JCp)",
        "71.9",
        "80.4",
        "72.3",
        "88.2",
        "72.3",
        "80.7",
        "73.1",
        "88.9",
        "M(EP, JCp)",
        "61.1",
        "70.3",
        "62.4",
        "82.8",
        "61.1",
        "70.6",
        "63.1",
        "83.8",
        "Mj",
        "M(EGP, JCp)",
        "72.3",
        "80.9",
        "73.2",
        "89.6",
        "73.5",
        "81.5",
        "73.9",
        "90.4",
        "M(Eg+Ep, JCp, 0.7)",
        "72.8",
        "80.7",
        "73.8",
        "89.7",
        "73.2",
        "81.0",
        "74.7",
        "90.5",
        "M(EG+EGP, JCp, 0.6)",
        "73.5",
        "81.7",
        "74.2",
        "90.6",
        "73.7",
        "81.8",
        "74.8",
        "91.2",
        "M(Ep+Egp, JCp, 0.1)",
        "71.6",
        "80.3",
        "73.3",
        "89.8",
        "72.5",
        "80.8",
        "73.8",
        "90.1",
        "M(EG,<j>)",
        "70.0",
        "78.5",
        "N/A",
        "N/A",
        "70.6",
        "79.0",
        "N/A",
        "N/A",
        "M(EP, </>)",
        "58.5",
        "69.3",
        "N/A",
        "N/A",
        "59.4",
        "70.1",
        "N/A",
        "N/A",
        "Mi",
        "M(EGP,<f>)",
        "71.2",
        "79.9",
        "N/A",
        "N/A",
        "72.3",
        "80.7",
        "N/A",
        "N/A",
        "M(EG+EP,(f),0.7)",
        "70.7",
        "79.1",
        "N/A",
        "N/A",
        "72.0",
        "80.0",
        "N/A",
        "N/A",
        "M(EG+EGP,<f),0A)",
        "72.0",
        "80.3",
        "N/A",
        "N/A",
        "72.8",
        "80.9",
        "N/A",
        "N/A",
        "M(Ep+EGp,(f),0.l)",
        "71.0",
        "79.6",
        "N/A",
        "N/A",
        "72.0",
        "80.4",
        "N/A",
        "N/A",
        "M(EG,Cp)",
        "58.9",
        "70.2",
        "72.3",
        "78.4",
        "59.1",
        "70.4",
        "73.1",
        "78.4",
        "M(EP, Cp)",
        "50.2",
        "62.3",
        "62.4",
        "78.4",
        "50.4",
        "62.6",
        "63.1",
        "78.5",
        "Ms",
        "M(EGP,Cp)",
        "59.1",
        "70.4",
        "73.2",
        "78.4",
        "59.3",
        "70.5",
        "73.9",
        "78.5",
        "M(EG+Ep,CP, 0.8)",
        "59.7",
        "71.3",
        "73.8",
        "79.0",
        "60.3",
        "71.7",
        "74.7",
        "79.0",
        "M(Eg+Egp,Cp, 0.6)",
        "59.8",
        "71.7",
        "74.2",
        "78.9",
        "60.6",
        "72.1",
        "74.8",
        "78.9",
        "M(Ep+EGp,CP, 0.1)",
        "58.8",
        "70.4",
        "73.3",
        "78.9",
        "59.4",
        "70.7",
        "73.8",
        "78.8",
        "Table 7: Top-1 results oïM(EG, <j>), M(EGp, <j>), M(EG, JCp), and M(EGP, JCP), where * represents incorrect transliterations transliterations between the Mi and Mj models.",
        "For Emily and Reinhardt, the Mj models generated correct Chinese transliterations, but the Mi models did not.",
        "Figure 1 shows the probability distribution when a transliteration model generates the first Chinese character in the Chinese transliteration of Reinhardt with and without Chinese phonemes.",
        "Two Chinese characters, H and Wi, were strong candidates and ^ is the correct one in this case.",
        "Without Chinese phonemes, M (Eg, <fi), which is based on V(cg\\Reinhardt) in Figure 1(a) preferring H to W, generated the incorrect transliteration as shown in Table 7.",
        "However, Figure 1(b) shows that ^ can be selected if the correct Chinese phoneme sequence \"LAI YIN ...\" is given.",
        "Three Chinese phoneme sequences starting with \"LAI YIN ...\" \"LAI NA ...\", and \"LAI NEI ...\" were generated from Reinhardt, where \"LAI YIN ...\" was the best Chinese phoneme sequence based on the probability distribution in Figure 1(c).",
        "As a result, M(EG, JCp), which jointly used Chinese phonemes with English graphemes, generated the correct Chinese transliteration of Reinhardt based on two probability distribution in Figures 1(b) and 1(c).",
        "In the case of Ivy, English phonemes contributed to generating the correct transliteration in the M(EGp,(f)) and M(EGp, JCp) models.",
        "Chinese transliterations sometimes reflect the English word's pronunciation as well as the Chinese character's meaning (Li et al., 2007).",
        "Li",
        "POffi I Reinhardt) P(H | Reinhardt)",
        "(a) Probability distribution when Chinese phonemes are not given (b) Probability distribution when Chinese phonemes are given (c) Probability distribution for Chinese phoneme sequence \"LAI YIN ...\" and others",
        "Figure 1 : Probability distribution for the first Chinese character in the Chinese transliteration of et al.",
        "(2007) defined such a Chinese transliteration as a phonetic-semantic transliteration (semantic transliteration) to distinguish it from a usual phonetic transliteration.",
        "One fact that affects semantic transliteration is gender association (Li et al., 2007).",
        "For example, ftj (meaining jasmine) is frequently used in Chinese transliterations of female names but seldom in common person names.",
        "Because Emily is often used in female names, the results obtained by the M(EG,JCP) and M(EGP,JCP) models are acceptable.",
        "This indicates that Chinese phonemes coupled with English graphemes or those coupled with English graphemes and phonemes could provide evidence required for semantic transliteration as well as phonetic transliteration.",
        "As a result, M(EGP, (/)), M (Eg, JCP), and M (Egp, JCp), which used phonemes coupled with English graphemes, achieved higher performance than M(Eg,4>), which relied only on English graphemes.",
        "M, models",
        "M(EG,0)",
        "M(EGP,0)",
        "Emily",
        "(EH M IH L IY)",
        "(AI MI LI)",
        "(AI MI LI)",
        "Ivy",
        "um",
        "(AY V IY)",
        "(YIWEI)",
        "(AI WEI)",
        "Reinhardt",
        "(R AI N HH AA R T)",
        "(LAI YIN HA TE)",
        "(LAI YIN HATE)",
        "Mj models",
        "M(EG,JCP)",
        "M(EGP,JCp)",
        "Emily",
        "(EH M IH L IY)",
        "AI MI LI",
        "AI MI LI",
        "Ivy",
        "um",
        "(AY V IY)",
        "YI WEI",
        "AI WEI",
        "Reinhardt",
        "(R AI N HH AA R T)",
        "LAI YIN HA TE",
        "LAI YIN HA TE",
        "1",
        "0.8",
        "0.6",
        "0.4",
        "0.2",
        "0",
        "P(\"LAI YIN ..\" 1 Reinhardt) P(V'LAI YIN ..\" | Reinhardt)",
        "Training Data Size (%)",
        "(a) Basic transliteration models",
        "S M(EG+Ep,Cp,0.8) .......s.......",
        "(b) Hybrid transliteration models",
        "We investigated the effect of training data size on the performance of each transliteration model.",
        "We randomly selected training data with ratios from 10 to 90% and compared the performance of each system trained by different sizes of training data.",
        "The results for the basic transliteration models in Figure 2(a) can be categorized into three groups.",
        "M(EGp,4>) and M(EGp,JCP) fall into the best group, where they showed the best performance regardless of training data size.",
        "M(EG, 4>) and M(EG, JCP) belong to the middle group, where they showed lower performance than the best group if the training data size is small, but their performance is comparable to the best group if the size of the training data is large enough.",
        "The others always showed lower performance than both the best and middle groups.",
        "Figure 2(b) shows that hybrid transliteration models, on average, were less sensitive to the training data size than the basic ones, because the two different basic transliteration models used in the hybrid ones boosted transliteration performance by complementing each other's weak points."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "We proposed a new English-to-Chinese transliteration model based on Chinese phonemes and their corresponding English graphemes and phonemes.",
        "We defined eighteen English-to-Chinese transliteration models including our proposed model and classified them into three classes based on the role of Chinese phonemes in the transliteration models.",
        "Experiments showed that Chinese phonemes in our proposed model can contribute to the performance improvement in English-to-Chinese transliteration.",
        "Now we can answer Yes to this paper's key question, \"Can Chinese phonemes improve machine transliteration?\"",
        "Actually, this is the second time the same question has been answered.",
        "The previous answer, which was unfortunately reported as No by Li et al.",
        "(2004), has been accepted as true for the last five years; the research issue has been considered closed.",
        "In this paper, we found a new answer that contradicts the previous answer.",
        "We hope that our answer promotes research on phoneme-based English-to-Chinese transliteration.",
        "(b) Ms models",
        "i ^.......",
        "70",
        "sis'''''",
        "60",
        "4--------■ * \"",
        "M(EG,fl – ",
        "50",
        "M(EPil;>) – x – ",
        "M(EGP,0) --»-",
        "40",
        "M(EG,CP) .......a....... -",
        "M(Ep,Cp) - .",
        "-",
        "30",
        "M(EGP,Cp) g -M(EG,JCP)",
        "20",
        "M(Ep,JCp) -M(EGP,JCp)"
      ]
    }
  ]
}
