{
  "info": {
    "authors": [
      "Claudio Giuliano"
    ],
    "book": "CoNLL",
    "id": "acl-W09-1125",
    "title": "Fine-Grained Classification of Named Entities Exploiting Latent Semantic Kernels",
    "url": "https://aclweb.org/anthology/W09-1125",
    "year": 2009
  },
  "references": [
    "acl-C02-1130",
    "acl-C08-1034",
    "acl-D07-1026",
    "acl-D08-1061",
    "acl-E06-1003",
    "acl-P05-1050",
    "acl-W05-0608",
    "acl-W07-2012"
  ],
  "sections": [
    {
      "text": [
        "FBK-irst I-38100,Trento, Italy",
        "giuliano@fbk.eu",
        "We present a kernel-based approach for finegrained classification of named entities.",
        "The only training data for our algorithm is a few manually annotated entities for each class.",
        "We defined kernel functions that implicitly map entities, represented by aggregating all contexts in which they occur, into a latent semantic space derived from Wikipedia.",
        "Our method achieves a significant improvement over the state of the art for the task of populating an ontology of people, although requiring considerably less training instances than previous approaches."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Populating an ontology with relevant entities extracted from unstructured textual documents is a crucial step in Semantic Web and knowledge management systems.",
        "As the concepts in an ontology are generally arranged in deep class/subclass hierarchies, the problem of populating ontologies is typically solved top-down, firstly identifying and classifying entities in the most general concepts, and then refining the classification process.",
        "Recent advances have made supervised approaches very successful in entity identification and classification.",
        "However, to achieve satisfactory performance, supervised systems must be supplied with a sufficiently large amount of training data, usually consisting of hand tagged texts.",
        "As domain specific ontologies generally contains hundreds of subcategories, such approaches are not directly applicable for a more fine-grained categorization because the number of documents required to find sufficient positive examples for all subclasses becomes too large, making the manual annotation very expensive.",
        "Consequently, in the literature, supervised approaches are confined to classify entities into broad categories, such as persons, locations, and organizations, while the fine-grained classification has been approached with minimally supervised (e.g., Tanev and Magnini (2006) and Giuliano and Gliozzo (2008)) and unsupervised learning algorithms (e.g., Cimiano and Volker (2005) and Giuliano and Gliozzo (2007)).",
        "Following this trend, we present a minimally supervised approach to fine-grained categorization of named entities previously recognized into coarsegrained categories, e.g., by a named-entity recognizer.",
        "The only training data for our algorithm is a few manually annotated entities for each class.",
        "For example, Niels Bohr, Albert Einstein, and Enrico Fermi might be used as examples for the class physicists.",
        "In some cases, training entities can be acquired (semi-) automatically from existing ontologies allowing us to automatically derive training entities for use with our machine learning algorithm.",
        "For instance, we may easily obtain tens of training entities for very specific classes, such as astronomers, materials scientists, nuclear physicists, by querying the Yago ontology (Suchanek et al., 2008).",
        "We represent the entities using features extracted from the textual contexts in which they occur.",
        "Specifically, we use a search engine to collect such contexts from the Web.",
        "Throughout this paper, we will refer to such a representation as multi-context representation, in contrast to the single-context representation in which an entity is categorized using solely features extracted from the local context surrounding it, usually a window of a few words around the entity occurrence.",
        "Single-context features are commonly used in named-entity recognition, however to assign very specific categories the local context might not provide sufficient information.",
        "For example, in the sentence \"Prof. Enrico Fermi discovered a way to induce artificial radiation in heavy elements by shooting neutrons into their atomic nuclei,\" single-context features such as, the prefix Prof. and the capital letters, provides enough evidence that Enrico Fermi is a person and a professor.",
        "However, to discover that he is a physicist we need to analyze a wider context, or alternatively multiple ones.",
        "Recently, Ganti et al.",
        "(2008) has shown that exploiting multi-context information can greatly improve the fine-grained classification of named entities, when compared to methods using single context only.",
        "In order to effectively represent entities' multi-contexts, we extend the traditional vector space model (VSM), offering a way to integrate external semantic information in the classification process by means of latent semantic kernels (Shawe-Taylor and Cristianini, 2004).",
        "As a result, we obtain a generalized similarity function between multi-contexts that incorporates semantic relations between terms, automatically learned from unlabeled data.",
        "In particular, we use Wikipedia to build the latent semantic space.",
        "The underlying idea is that similar named entities tend to have a similar description in Wikipedia.",
        "As Wikipedia provides reliable information and it exceeds all other encyclopedias in coverage, it should be a valuable resource for the task of populating an ontology.",
        "To validate this hypothesis, we compare this model with one built from a news corpus.",
        "Our approach achieves a significant improvement over the state of the art for the task of populating the People Ontology (Giuliano and Gliozzo, 2008), although requiring considerably less training instances than previous approaches.",
        "The task consists in classifying person names into a multilevel taxonomy composed of 21 categories derived from WordNet, making very fine-grained distinctions (e.g., physicists vs. mathematicians).",
        "It provides a more realistic and challenging benchmark than the ones previously available (e.g., Tanev and Magnini (2006) and Fleischman and Hovy (2002)), that consider a smaller number of categories arranged in a one-level taxonomy."
      ]
    },
    {
      "heading": "2. Entity Representation",
      "text": [
        "The goal of our research is to determine the finegrained categories of named entities requiring a minimal amount of human supervision.",
        "Our method is based on the common assumption that named entities co-occurring with the same (domain-specific) terms are highly probable to refer to the same categories.",
        "For example, quantum mechanics, atomic physics, and Nobel Prize in physics are all terms that bound Niels Bohr and Enrico Fermi to the concept of physics.",
        "To automatically derive features for the training and testing entities we proceed as follows.",
        "We pair each entity i with a multi-context mj obtained by querying a search engine with the entity \"i\" and merging the first M snippets sjyj returned (1 ^ j ^ M).",
        "A multi-context is therefore a fictitious document obtained by aggregating snippets, i.e., summary texts of the search engine result.",
        "Formally, mj = UM=1si)j, where the operator U denotes the concatenation of strings.",
        "For example, Figure 1 (a) and (b) show some snippets retrieved for \"Enrico Fermi\" and \"Albert Einstein,\" while s1 U s2 U s3 and s4 U s5 U s6 represent their multi-contexts, respectively.",
        "The following section describes how entities' multi-contexts are embedded into the feature space in order to train a kernel-based classifier."
      ]
    },
    {
      "heading": "3. Kernels for Fine-Grained Classification of Entities",
      "text": [
        "The strategy adopted by kernel methods (Shawe-Taylor and Cristianini, 2004; Scholkopf and Smola, 2002) consists of splitting the learning problem in two parts.",
        "They first embed the input data in a suitable feature space, and then use a linear algorithm (e.g., the perceptron) to discover nonlinear pattern in the input space.",
        "Typically, the mapping is performed implicitly by a so-called kernel function.",
        "The kernel function is a similarity measure between the input data that depends exclusively on the specific data type and domain.",
        "A typical similarity function is the inner product between feature vectors.",
        "Characterizing the similarity of the inputs plays a crucial role in",
        "si: [Enrico Fermi]pER discovered that many nuclear transformations could be conducted by using neutrons.",
        "s2- [Enrico Fermi]per led the manhattan project's effort to create the first man-made and self-sustaining nuclear chain.",
        "s3: [Enrico Fermi]per was most noted for his work on the development of the first nuclear reactor.",
        "s4: [Albert Einstein] per did not directly participate in the invention of the atomic bomb.",
        "s5: [Albert Einstein] per is one of the most recognized and well-known scientists of the century.",
        "s6: [Albert Einstein] per was born at Ulm, in Württemberg, Germany, on March 14, 1879.",
        "determining the success or failure of the learning algorithm, and it is one of the central questions in the field of machine learning.",
        "Formally, the kernel is a function k : X x X – R that takes as input two data objects (e.g., vectors, texts, parse trees) and outputs a real number characterizing their similarity, with the property that the function is symmetric and positive semi-definite.",
        "That is, for all x%, Xj e X, it satisfies where << is an explicit mapping from X to an (inner product) feature space F.",
        "In the next sections, we define and combine different kernel functions that calculate the pairwise similarly between multi-contexts.",
        "They are the only domain specific element of our classification system, while the learning algorithm is a general purpose component.",
        "Many classifiers can be used with kernels.",
        "The most popular ones are perceptron, support vector machines (SVM), and k-nearest neighbor (KNN).",
        "The simplest method to estimate the similarity between two multi-contexts is to compute the inner product of their vector representations in the VSM.",
        "Formally, we define a space of dimensionality N in which each dimension is associated with one word from the dictionary, and the multi-context m is represented by a row vector where the function /(ti, m) records whether a particular token ti is used in m. Using this representation we define bag-of-words kernel between multi-contexts as",
        "However, the bag-of-words representation does not deal well with lexical variability.",
        "To significantly reduce the training set size, we need to map contexts containing semantically equivalent terms into similar feature vectors.",
        "To this aim, in the next section, we introduce the class of semantic kernels and show how to define an effective semantic VSM using (un-labeled) external knowledge.",
        "It has been shown that semantic information is fundamental for improving the accuracy and reducing the amount of training data in many natural language tasks, including fine-grained classification of named entities (Fleischman and Hovy, 2002), question classification (Li and Roth, 2005), text categorization (Giozzo and Strapparava, 2005), word sense disambiguation (Gliozzo et al., 2005).",
        "In the context of kernel methods, semantic information can be integrated considering linear transformations of the type <p(cj) = <(cj)S, where S is a N x k matrix (Shawe-Taylor and Cristianini, 2004).",
        "The matrix S can be rewritten as S = WP, where W is a diagonal matrix determining the word weights, while P is the word proximity matrix capturing the semantic relations between words.",
        "The proximity matrix P can be defined by setting nonzero entries between those words whose semantic relation is inferred from an external source of domain knowledge.",
        "The semantic kernel takes the general form",
        "It follows directly from the explicit construction that Equation 4 defines a valid kernel.",
        "WordNet and manually constructed lists of semantically related words typically provide a simple way to introduce semantic information into the kernel.",
        "To define a semantic kernel from such resources, we could explicitly construct the proximity matrix P by setting its entries to reflect the semantic proximity between the words i and j in the specific lexical resource.",
        "However, we prefer an approach that exploits unlabeled data to automatically build the proximity matrix, defining a language and domain independent approach.",
        "To define a proximity matrix, we look at cooccurrence information in a (large) corpus.",
        "Two words are considered semantically related if they frequently co-occur in the same texts.",
        "We use singular valued decomposition (SVD) to automatically derive the proximity matrix n from a corpus, represented by its term-by-document matrix D, where the Di;j entry gives the frequency of term ti in document dj .",
        "SVD decomposes the term-by-document matrix D into three matrixes D = USV', where U and V are orthogonal matrices (i.e., U'U = I and V'V = I) whose columns are the eigenvectors of DD' and D'D respectively, and X is the diagonal matrix containing the singular values of D.",
        "Under this setting, we define the proximity matrix n as follows:",
        "where Uk is the matrix containing the first k columns of U and k is the dimensionality of the latent semantic space and can be fixed in advance.",
        "By using a small number of dimensions, we can define a very compact representation of the proximity matrix and, consequently, reduce the memory requirements while preserving most of the information.",
        "The matrix n is used to define a linear transformation n : RN – Rk, that maps the vector <<(mj), represented in the standard VSM, into the vector <(mj) in the latent semantic space.",
        "Formally, n is defined as follows where <( mj) is a row vector, W is a N x N diagonal matrix determining the word weights such that Wi)i = log(id/where id/(wi) is the inverse document frequency of wi.",
        "Finally, the latent semantic kernel is explicitly defined as follows where << is the mapping defined in Equation 2 and n is the linear transformation defined in Equation 6.",
        "Note that we have used a series of successive mappings each of which adds some further improvement to the multi-context representation.",
        "Finally, to combine the two representations of multi-contexts, we define the composite kernel as follows",
        "It follows directly from the explicit construction of the feature space and from closure properties of kernels that it is a valid kernel."
      ]
    },
    {
      "heading": "4. Experiments",
      "text": [
        "In this section, we compare performance ofdifferent kernel setups and previous approaches on an ontology population task.",
        "Experiments were carried out on the People Ontology (Giuliano and Gliozzo, 2008).",
        "An ontology extracted from WordNet, containing 1,657 distinct person instances arranged in a multilevel taxonomy having 21 fine-grained categories (Figure 2).",
        "To provide a formal distinction between classes and instances, required to assign instances to classes, the authors followed the directives defined by Gangemi et al.",
        "(2003) for OntoWordNet, in which the informal WordNet semantics is re-engineered in terms of a description logic.",
        "In order to have a fair comparison, we reproduced the same experimental settings used in Giuliano and Gliozzo (2008).",
        "The population task is cast as a categorization problem, trying to assign person instances to the most specific category.",
        "For each class, the instances were randomly split into two equally sized subsets.",
        "One is used for training and the other for test, and vice versa.",
        "The reported results are the average performance over these two subsets.",
        "When an instance is assigned to a subclass it is also implicitly assigned to all its super-classes.",
        "For instance,",
        "Figure 2: The People Ontology defined by Giuliano and Gliozzo (2008).",
        "Numbers in brackets are the total numbers of person instances per category.",
        "Concepts with less than 40 instances were removed.",
        "classifying Salvador Dali as painter we implicitly classify him as artist and creator.",
        "The evaluation is performed as proposed by Melamed and Resnik (2000) for a similar hierarchical categorization task.",
        "For instance, classifying John Lennon as painter, we obtain a false positive for the spurious classification painter, a false negative for missing class musician, and two true positives for the correct assignment to the super-classes artist and creator.",
        "We built two proximity matrices nW and nNYT.",
        "The former is derived from the 200,000 most visited Wikipedia articles, while the latter from 200,000 articles published by the New York Times between June 1, 1998 and January 01, 2000.",
        "After removing terms that occur less than 5 times, the resulting dictionaries contain about 300,000 and 150,000 terms respectively.",
        "We used the SVDLIBC package to compute the SVD, truncated to 400 dimensions.",
        "To derive the multi-context representation, we collected 100 english snippets for each person instance by querying GoogleTM.",
        "To classify each person instance into one of the fine-grained categories, we used a KNN classifier (K = 1).",
        "No parameter optimization was performed.",
        "Table 1 shows micro-and macro-averaged results for Kbow , Kw , Kbow + Kw , Knyt , Kbow + Knyt, the IBOP method (Giuliano and Gliozzo, 2008), the random baseline, and most frequent base-line.",
        "Where Kw and Knyt are instances of the latent semantic kernel, Kls, using the proximity matrices nW and nNYT, derived from Wikipedia and the New York Times corpus, respectively.",
        "Table 2 shows detailed results for each sub-and super-category for Kbow + Kw .",
        "Table 3 shows the confusion matrix of Kbow + Kw , in which the rows are ground truth classes and the columns are predictions.",
        "The matrix has been calculated for the finer-grained categories and, then, grouped according to their super-class.",
        "To be compared with the IBOP method, all experiments were conducted using only 20 training examples per category.",
        "Finally, figure 3 shows the learning curves for Kbow + Kw obtained varying the number of snippets (12, 25, 50, and 100) used to derive the multi-contexts.",
        "On the one hand, the results (Table 2) show that learning the semantic model from Wikipedia gives no significant improvement.",
        "Therefore, we reject the hypothesis that encyclopedic knowledge can provide"
      ]
    },
    {
      "heading": "12. snippets",
      "text": []
    },
    {
      "heading": "25. snippets",
      "text": []
    },
    {
      "heading": "50. snippets",
      "text": [
        "Figure 3: Learning curves for KBow + Kw obtained varying the number of snippets used to derive the training and test sets.",
        "From top-left to bottom right: 12, 25, 50, and 100.",
        "Table 1: Comparison among the kernel-based approaches, the IBOP method (Giuliano and Gliozzo, 2008), the random baseline, and most frequent baseline.",
        "more accurate semantic models than general purpose corpora.",
        "Moreover, further experiments have shown that even a larger number of Wikipedia articles (600,000) does not help.",
        "On the other hand, the latent semantic kernels outperform all the other methods, and their composite (Kbow + Kw and Kbow + Knyt) perform the best on every configuration, demonstrating the effectiveness of latent semantic kernels in fine-grained classification of named entities.",
        "As in text categorization and word sense disambiguation, they have proven effective tools to overcome the limitation of the VSM by introducing semantic similarity among words.",
        "An important characteristic of the approach is the small number of training examples required per category.",
        "This affects both the prediction accuracy and the computation time (this is generally a common property of instance-based algorithms).",
        "The learning curves (Figure 3) show that the composite kernel (Kbow + KLS) obtained the same performance of the bag-of-word kernel (Kbow) using less than half of the training examples per category.",
        "The difference is much more pronounced when using less snippets.",
        "The composite kernel KBOW + KWreaches a plateau around 10 examples, and after 20 examples adding more examples does not significantly improve the classification performance.",
        "As most of entities in the People Ontology are celebrities, all the snippets retrieved by GoogleTMgenerally refer to them, alleviating the problem of ambiguity of proper names.",
        "However, person names are highly ambiguous.",
        "In a more realistic scenario, the result of a search engine for a person name is usually a mix of contexts about different entities sharing the same name.",
        "In this case, our approach have to be combined with a system that clusters the search engine result, where each cluster is assumed to contain all (and only those) contexts that refer to the same entity.",
        "The WePS evaluation campaign on disambiguation of person names (Artiles et al., 2007; Artiles et al., 2009) has shown that the best clustering systems achieve a precision of about 90%",
        "Method",
        "Micro-Fi",
        "Macro-F1",
        "kbow",
        "75.6",
        "70.6",
        "Kw",
        "78.1",
        "73.1",
        "Kbow + Kw",
        "80.0",
        "75.4",
        "Knyt",
        "77.6",
        "72.9",
        "Kbow + Knyt",
        "79.7",
        "75.1",
        "IBOP",
        "70.1",
        "62.3",
        "Random",
        "15.4",
        "15.5",
        "Most Frequent",
        "20.7",
        "3.3",
        "Table 3: Confusion matrix of KBOW + Kw for the more fine-grained categories grouped according to their top-level concepts of the People Ontology.",
        "and a recall of about 70% and that, in the majority of the cases, the number of contexts per entity is less than 20.",
        "This shows that latent semantic kernels are an effective tool for fine-grained classification of person names.",
        "Finally, table 3 shows that misclassification errors are largely distributed among categories belonging to the same superclass (i.e., the blocks on the main diagonal are more densely populated than others).",
        "As expected, the algorithm is much more accurate for the top-level concepts (i.e., Scientist, Communicator, etc.",
        "), where the category distinctions are clearer, while a further fine-grained classification, in some cases, is even difficult for human annotators."
      ]
    },
    {
      "heading": "5. Related Work",
      "text": [
        "Fleischman and Hovy (2002) approach the finegrained classification of person instances using supervised learning, where the training set is generated semi-automatically, bootstrapping from a small training set.",
        "They compare different machine learning algorithms, providing local features as well as global semantic information derived from topic signature and WordNet.",
        "Person instances were classified into one of eight categories.",
        "Cimiano and Volker (2005) present an approach for the fine-grained classification of entities relying on the Harris' distributional hypothesis and the vector space model.",
        "They assign a particular instance to the most similar concept representing both with lexical-syntactic features extracted from the context of the instance and the lexicalization of the concept, respectively.",
        "Experiments were performed using a large ontology with 682 concepts (unfortunately not yet available).",
        "Tanev and Magnini (2006) proposed a weakly-supervised method that requires as training data a list of named entities, without context, for each category under consideration.",
        "Given a generic syntactically parsed corpus containing at least each training entity twice, the algorithm learns, for each category, a feature vector describing the contexts where those entities occur.",
        "Then, it compares the new (unknown) entity with the so obtained feature vectors, assigning it to the most similar category.",
        "Experiments are performed on a benchmark of 5 subclasses of location and 5 subclasses of person.",
        "Scientist",
        "Performer",
        "Creator",
        "Communicator",
        "Business",
        "Health",
        "Phy",
        "Mat",
        "Che",
        "Bio",
        "Soc",
        "Act",
        "Mus",
        "Fil",
        "Pai",
        "Mus",
        "Poe",
        "Dra",
        "Rep",
        "man",
        "prof",
        "Phy",
        "118",
        "24",
        "10",
        "4",
        "2",
        "0",
        "0",
        "0",
        "0",
        "0",
        "0",
        "0",
        "0",
        "7",
        "2",
        "Mat",
        "2",
        "33",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "3",
        "0",
        "Che",
        "13",
        "2",
        "68",
        "9",
        "2",
        "0",
        "0",
        "0",
        "0",
        "0",
        "0",
        "0",
        "0",
        "5",
        "2",
        "Bio",
        "3",
        "0",
        "7",
        "52",
        "0",
        "0",
        "0",
        "0",
        "1",
        "0",
        "0",
        "0",
        "1",
        "6",
        "6",
        "Soc",
        "0",
        "4",
        "1",
        "1",
        "55",
        "0",
        "0",
        "0",
        "0",
        "0",
        "3",
        "1",
        "1",
        "4",
        "2",
        "Act",
        "0",
        "0",
        "0",
        "0",
        "0",
        "98",
        "5",
        "27",
        "0",
        "0",
        "2",
        "14",
        "0",
        "3",
        "0",
        "Mus",
        "0",
        "0",
        "0",
        "0",
        "0",
        "17",
        "67",
        "0",
        "0",
        "32",
        "1",
        "0",
        "1",
        "2",
        "1",
        "Fil",
        "0",
        "0",
        "0",
        "0",
        "0",
        "13",
        "0",
        "45",
        "0",
        "0",
        "1",
        "4",
        "0",
        "2",
        "0",
        "Pai",
        "0",
        "0",
        "0",
        "1",
        "1",
        "2",
        "0",
        "1",
        "100",
        "0",
        "1",
        "0",
        "0",
        "1",
        "0",
        "Mus",
        "0",
        "0",
        "0",
        "0",
        "0",
        "4",
        "29",
        "0",
        "0",
        "139",
        "0",
        "1",
        "0",
        "0",
        "0",
        "Poe",
        "0",
        "2",
        "0",
        "0",
        "0",
        "0",
        "0",
        "0",
        "7",
        "3",
        "98",
        "26",
        "1",
        "2",
        "3",
        "Dra",
        "0",
        "0",
        "0",
        "1",
        "1",
        "9",
        "0",
        "1",
        "0",
        "1",
        "12",
        "61",
        "1",
        "4",
        "1",
        "Rep",
        "0",
        "0",
        "0",
        "0",
        "0",
        "1",
        "1",
        "0",
        "2",
        "0",
        "0",
        "0",
        "197",
        "22",
        "0",
        "Bus",
        "1",
        "0",
        "1",
        "0",
        "1",
        "0",
        "0",
        "1",
        "0",
        "1",
        "0",
        "0",
        "1",
        "36",
        "0",
        "Hea",
        "0",
        "0",
        "0",
        "8",
        "4",
        "0",
        "1",
        "0",
        "0",
        "0",
        "0",
        "1",
        "1",
        "2",
        "31",
        "Category",
        "Prec.",
        "Recall",
        "Fi",
        "Scientist",
        "95.1",
        "90.1",
        "92.6",
        "Physicist",
        "86.1",
        "70.7",
        "77.6",
        "Mathematician",
        "50.8",
        "82.5",
        "62.9",
        "Chemist",
        "78.2",
        "67.3",
        "72.3",
        "Biologist",
        "68.4",
        "68.4",
        "68.4",
        "Social scientist",
        "82.1",
        "76.4",
        "79.1",
        "Performer",
        "75.7",
        "69.3",
        "72.3",
        "Actor",
        "68.1",
        "65.8",
        "66.9",
        "Musician",
        "65.0",
        "55.4",
        "59.8",
        "Creator",
        "78.9",
        "82.6",
        "80.7",
        "Film Maker",
        "60.0",
        "69.2",
        "64.3",
        "Artist",
        "83.6",
        "85.4",
        "84.5",
        "Painter",
        "90.9",
        "93.5",
        "92.2",
        "Musician",
        "79.0",
        "80.3",
        "79.7",
        "Communicator",
        "91.9",
        "86.7",
        "89.2",
        "Representative",
        "96.6",
        "88.3",
        "92.3",
        "Writer",
        "86.8",
        "84.2",
        "85.5",
        "Poet",
        "82.4",
        "69.0",
        "75.1",
        "Dramatist",
        "56.5",
        "66.3",
        "61.0",
        "Business man",
        "36.4",
        "85.7",
        "51.1",
        "Health professional",
        "64.6",
        "64.6",
        "64.6",
        "micro",
        "80.9",
        "79.6",
        "80.2",
        "macro",
        "75.1",
        "76.3",
        "75.7",
        "Giuliano and Gliozzo (2007) propose an unsupervised approach based on lexical entailment, consisting in assigning an entity to the category whose lex-icalization can be replaced with its occurrences in a corpus preserving the meaning.",
        "Using unsupervised learning, they obtained slightly worst results than Tanev and Magnini (2006) on the same benchmark.",
        "Picca et al.",
        "(2007) present an approach for ontology learning from open domain text collections, based on the combination of Super Sense Tagging and Domain Modeling techniques.",
        "The system recognizes terms pertinent to the domain and assigns them the correct ontological type.",
        "Giuliano and Gliozzo (2008) present an instance-based learning algorithm for fine-grained named entity classification based on syntactic features (wordorder, case-marking, agreement, verb tenses, etc.).",
        "Their method can handle much finer distinctions than previous methods, and it is evaluated on a hierarchical taxonomy of 21 ancestors of people that was induced from WordNet.",
        "One contribution is to create this richer People Ontology.",
        "Another is to make effective use of the Web 1T 5-gram corpus (Brants and Franz, 2006) to represent syntactic information.",
        "The main difference between the two approaches lies primarily in the use of syntactic and semantic information.",
        "Our experiments show that semantic features do provide richer information than syntactic ones for a more fine-grained classification of named entities.",
        "In fact, the accuracy improvement achieved by our approach is more evident for the more specific classes.",
        "For example, the improvement in accuracy is about 14% for the class scientist, while it ranges from 25% to 46% for its subclasses (physicist, mathematician, etc.",
        ").",
        "Kozareva et al.",
        "(2008) propose an approach for person name categorization based on the domain distribution.",
        "They use the information provided by WordNet Domains to generated lists of words relevant for a given domain, by mapping and ranking the words from the WordNet glosses to their WordNet",
        "Domains.",
        "A named entity is then classified according the similarity between the word-domain lists and the global context in which the entity appears.",
        "However, the evaluation was performed only on 6 person names using two categories.",
        "Ganti et al.",
        "(2008) present a method that considers an entity's context across multiple documents containing it, and exploiting word n-grams and existing large list of related entities as features.",
        "They generated training and test data using Wikipedia articles that contain list of instances.",
        "They compare their system with a single-context classifier, showing that their approach based on aggregate context perform better.",
        "Finally, Talukdar et al.",
        "(2008) propose a graph-based semi-supervised label propagation algorithm for acquiring open-domain labeled classes and their instances from a combination of unstructured and structured text."
      ]
    },
    {
      "heading": "6. Conclusions",
      "text": [
        "We presented an approach to automatic fine-grained categorization of named entities based on kernel methods.",
        "Entities are represented by aggregating all contexts in which they occur.",
        "We employed latent semantic kernels to extend the bag-of-words representation.",
        "The latent semantic models were derived from Wikipedia and a news corpus We evaluated our approach on the People Ontology, a multilevel ontology of people derived from WordNet.",
        "Although this benchmark is still far from being \"large\", it allows drawing more valid conclusions than past ones.",
        "We significantly outperformed the previous results on both coarse-and fine-grained classification, although requiring much less training instances.",
        "From this preliminary analysis, it appears that semantic information is much more effective that syntactic one for this task, and deriving the semantic model from Wikipedia gives no significant improvement, as well as, using a larger number of Wikipedia articles."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "Claudio Giuliano is supported by the X-Media project (http: //www.x-media-project.org), sponsored by the European Commission as part of the Information Society Technologies (1ST) programme under EC grant number IST-FP6-026978 and the ITCH project (http://itch.fbk.eu), sponsored by the Italian Ministry of University and Research and by the Autonomous Province of Trento."
      ]
    }
  ]
}
