{
  "info": {
    "authors": [
      "Lê Phương",
      "Hồng",
      "Nguyễn Thi Minh Huyền",
      "Roussanaly Azim"
    ],
    "book": "Proceedings of the 7th Workshop on Asian Language Resources (ALR7)",
    "id": "acl-W09-3409",
    "title": "Finite-State Description of Vietnamese Reduplication",
    "url": "https://aclweb.org/anthology/W09-3409",
    "year": 2009
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Le Hong Phuong Nguyen Thi Minh Huyen Azim Roussanaly",
        "LORIA, France Hanoi Univ.",
        "of Science, Vietnam LORIA, France",
        "lehong@loria.fr huyenntm@vnu.edu.vn azim@loria.fr",
        "We present for the first time a computational model for the reduplication of the Vietnamese language.",
        "Reduplication is a popular phenomenon of Vietnamese in which reduplicative words are created by the combination of multiple syllables whose phonics are similar.",
        "We first give a systematical study of Vietnamese reduplicative words, bringing into focus clear principles for the formation of a large class of bisyllabic reduplicative words.",
        "We then make use of optimal finite-state devices, in particular minimal sequential string-to string transducers to build a computational model for very efficient recognition and production of those words.",
        "Finally, several nice applications of this computational model are discussed."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Finite-state technology has been applied successfully for describing the morphological processes of many natural languages since the pioneering works of (Kaplan and Kay, 1994; Kosken-niemi, 1983).",
        "It is shown that while finite-state approaches to most natural languages have generally been very successful, they are less suitable for non-concatenative phenomena found in some languages, for example the non-concatenative word formation processes in Semitic languages (Cohen-Sygal and Wintner, 2006).",
        "A popular non-concatenative process is reduplication - the process in which a morpheme or part of it is duplicated.",
        "Reduplication is a common linguistic phenomenon in many Asian languages, for example Japanese, Mandarin Chinese, Cantonese, Thai, Malay, Indonesian, Chamorro, Hebrew, Bangla, and especially Vietnamese.",
        "We are concerned with the reduplication of Vietnamese.",
        "It is noted that Vietnamese is a monosyllabic language and its word forms never change, contrary to occidental languages that make use of morphological variations.",
        "Consequently, reduplication is one popular and important word formation method which is extensively used to enrich the lexicon.",
        "This follows that the Vietnamese lexicon consists of a large number of reduplicative words.",
        "This paper presents for the first time a computational model for recognition and production of a large class of Vietnamese reduplicative words.",
        "We show that Vietnamese reduplication can be simulated efficiently by finite-state devices.",
        "We first introduce the Vietnamese lexicon and the structure of Vietnamese syllables.",
        "We next give a complete study about the reduplication phenomenon of Vietnamese language, bringing into focus formation principles of reduplicative words.",
        "We then propose optimal finite-state sequential transducers recognizing and producing a substantial class of these words.",
        "Finally, we present several nice applications of this computational model before concluding and discussing the future work."
      ]
    },
    {
      "heading": "2. Vietnamese Lexicon",
      "text": [
        "In this section, we first present some general characteristics of the Vietnamese language.",
        "We then give some statistics of the Vietnamese lexicon and introduce the structure of Vietnamese syllables.",
        "The following basic characteristics of Vietnamese are adopted from (Doan, 2003; Doan et al., 2003; HQu et al.",
        ", 1998; Nguyen et al.",
        ", 2006).",
        "Vietnamese is classified in the Viet-Muong group of the Mon-Khmer branch, that belongs to the Austro-Asiatic language family.",
        "Vietnamese is also known to have a similarity with languages in the Tai family.",
        "The Vietnamese vocabulary features a large amount of Sino-Vietnamese words.",
        "Moreover, by being in contact with the French language, Vietnamese was enriched not only in vocabulary but also in syntax by the calque of French grammar.",
        "Vietnamese is an isolating language, which is characterized by the following properties:",
        "• it is a monosyllabic language;",
        "• its word forms never change, contrary to occidental languages that make use of morphological variations (plural form, conjugation, etc.",
        ");",
        "• hence, all grammatical relations are manifested by word order and function words.",
        "Vietnamese has a special unit called \"tieng\" that corresponds at the same time to a syllable with respect to phonology, a morpheme with respect to morpho-syntax, and a word with respect to sentence constituent creation.",
        "For convenience, we call these \"tieng\" syllables.",
        "The Vietnamese vocabulary contains• simple words, which are monosyllabic;",
        "• reduplicative words composed by phonetic reduplication;",
        "• compound words composed by semantic coordination and by semantic subodination;",
        "• complex words phonetically transcribed from foreign languages.",
        "The Vietnamese lexicon edited recently by the Vietnam Lexicography Center (Vietlex) contains 40,181 words and idioms, which are widely used in contemporary spoken language, newspapers and literature.",
        "These words are made up of 7, 729 syllables.",
        "Table 1 shows some interesting statistics of the word length measured in syllables.",
        "6,303 syllables (about 81.55% of syllables) are words by themselves.",
        "Two-syllable words are the most frequent, consisting of nearly 71% of the vocabulary.",
        "In this paragraph, we introduce phonetic attributes of Vietnamese syllables.",
        "In addition of the monosyllabic characteristic, Vietnamese is a tonal language in that each syllable has a certain pitch characteristic.",
        "The meaning of a syllable varies with its tone.",
        "This phonetic mechanism can also be found in other languages such that Chinese or Thai.",
        "There are six tones in Vietnamese as specified in Table 2.",
        "The letter a denotes any non-accent syllable.",
        "These six tones can be roughly classified into two groups corresponding to low and high pitches in pronunciation.",
        "The first half of the table contains three low tones and the second half contains three high tones.",
        "In addition, the difference in the tone of two syllables are distinguished by flat property of tones.",
        "The 1st and 4th tones in Table 2 are flat (bang), the other tones are non-flat (trac).",
        "The structure of a Vietnamese syllable is given in Table 3.",
        "Each syllable can be divided into three parts: onset, rhyme and tone.",
        "The onset is usually a consonant, however it may be empty.",
        "The rhyme contains a vowel (nucleus) with or without glide /w/, and an optional consonant (coda).",
        "It is noticed that the initial consonant of a syllable does not carry information of the tone, the Vietnamese tone has an effect only on the rhyme part of the syllable (Tran et al., 2006).",
        "This result reinforces the fact that a tone is always marked by the nucleus composant of the rhyme which is a vowel.",
        "Readers who are interested in detail the phonetic composition of Vietnamese syllables may refer to (Tran et al., 2006; Vuetal., 2005)."
      ]
    },
    {
      "heading": "3. Reduplication in Vietnamese",
      "text": [
        "Reduplication is one of the methods for creating multi-syllable words in Vietnamese.",
        "A reduplicative word is characterized by a phenomenon called phonetic interchange, in which one or several phonetic elements of a syllable are repeated following a certain number of specific rules.",
        "Length",
        "#",
        "%",
        "1",
        "6,303",
        "15.69",
        "2",
        "28,416",
        "70.72",
        "3",
        "2,259",
        "5.62",
        "4",
        "2,784",
        "6.93",
        ">5",
        "419",
        "1.04",
        "Total",
        "40,181",
        "100",
        "No.",
        "Tones",
        "Notation",
        "1.",
        "low falling",
        "ä",
        "2.",
        "creaky rising",
        "ä",
        "3.",
        "creaky falling",
        "a",
        "4.",
        "mid level",
        "a",
        "5.",
        "dipping",
        "ä",
        "6.",
        "high rising",
        "ä",
        "From the point of view of sense, the reduplication in Vietnamese usually indicates a diminutive of adjectives, which can also be found in Hebrew, or a pluralization in Malay, in Thai and in Indonesian, or an intensivity as the use of partial reduplication in Japanese, Thai, Cantonese and Chamorro (an Austronesian language spoken on Guam and the Northern Mariana Islands).",
        "In this aspect, Vietnamese reduplication serves similar functions as those of reduplication in several Asian languages, as reported in an investigation of Asian language reduplication within the NEDO project (Tokunaga et al., 2008a; Tokunaga et al.",
        ", 2008b).",
        "The Vietnamese reduplication creates an ex-pressional sense connecting closely to the phonetic material of Vietnamese, a language of rich melody.",
        "Consequently, there are many Vietnamese reduplicative words which are difficult to interpret to foreigners, though in general, native Vietnamese speakers always use and understand them correctly (Diep, 1999).",
        "Vietnamese reduplicative words can be classified into three classes basing on the number of syllables they contain: two-syllable (or bi-syllabic) reduplicative words, three-syllable (or tri-syllabic) reduplicative words and four-syllable reduplicative words.",
        "The bisyllabic class is the most important class because of two reasons: (1) bisyllabic reduplicative words make up more than 98% amount of reduplicative words, that is, almost reduplicative words has two syllables; and (2) bisyllabic reduplicative words embody principle characteristics of the reduplication phenomenon in both phone aspect and sense formation aspect.",
        "For these reasons, in this paper, we address only bisyllabic reduplicative words and call them reduplicative words for short, if there is no confusion.",
        "As presented in the previous section, a syllable has a strict structure containing three parts: the onset, the rhyme and the tone.",
        "Basing on the phonetic interchange of a syllable, we distinguish two types of reduplication:",
        "• full reduplication, where the whole syllable is repeated;",
        "• partial reduplication, where either the onset is repeated or the rhyme and the tone are repeated.",
        "In this work, we constraint ourselves by focusing only on the construction of an efficient computational model applied for reduplicative words which have clear and well-defined formation principles.",
        "These words can be classified into three types investigated in detail in the following subsections.",
        "In given examples, the base syllables (or root syllable, or root for short) are the ones which are underlined.",
        "The reduplication that has undefined or incomplete formation rules will be tackled in future works.",
        "In this type of reduplication, the root is identically repeated; there is only a slight difference on stress in pronunciation.",
        "For example, hao hao (a little similar), lam lam (intentional), dung dung (accidentally dertermined), li( Iti (silently).",
        "In the Vietnamese lexicon there are 274 reduplicative words of this type.",
        "In principle, there appears to be many reduplicative words of this type whose their roots may be whatever syllables bearing whatever tone, for instance do do, hd hd, sung sung, cham cham.",
        "However, in consequence of the difference of stress between the root and the reduplicant, the tone of the reduplicant is changed in order to be in harmony with the root, for the sake of more readability and audibility (\"easier to read, easier to hear\").",
        "This consequence leads to the formation of reduplicative words of the second type which we call reduplication with tone according.",
        "As presented above, the difference between tone of the root and the reduplicant is a consequence of the difference between their stress which is expressed by their tones.",
        "This creates reduplicative words of the second type; for example, do do (reddish), ho hd (in the bloom of youth), sung sung (statly, high and majestic), cham cham (rather slow).",
        "The tone properties (low or high pitch, flat or non-flat) are now put into use.",
        "Tone",
        "Onset",
        "Rhyme",
        "Glide",
        "Nucleus",
        "Coda",
        "The prosodic influence is responsible for the creation of the reduplicant from its root.",
        "As a result, the combination of tones between two syllables is realized in the following principle: non-flat tones of the roots are matched against a corresponding flat tones oftheir reduplicants.",
        "That is, the non-flat root has to select for it the flat redupli-cant belonging to the same pitch, i.e., in the same row.",
        "In this type of reduplicative words, the root is stressed in pronunciation.",
        "A detailed statistic about these reduplicative words with respect to the combination of tones is given in Table 4.",
        "There are 307 reduplicative words of the second type.",
        "In this type of reduplication, there is not only the difference between tones of the root and the redu-plicant but also the difference between their final consonants (hence their penultimates).",
        "Some examples of this type of reduplication which we call the third reduplication type are:",
        "• cam cap (clatter, shiver), 16m lop (pop pop), xdm xap (a little full), Mem thiep (fall asleep), nom ndp (be in a state of suspense)",
        "• gion gidt (sourish), ngiin ngut (burn violently), phon phdt (light red), hun hux (profound), son sax (be very close to, adjoining)",
        "• vang vg£_ (very clear), nhung nMc (a little ache), rung rue (brightly), phang phac (very silent), chenh check (a little oblique), anh ach (feeling bloated).",
        "The practical observation shows that the modification of final consonant from the root to the duplicate also has a clear rule: the noisy phone ofthe root is transformed to a nasal phone ofthe redu-plicant as shown in Table 5.",
        "The transformation of final consonant occurs only with the roots having as final consonant p, t, or c. The principle of tone combination is the same as that of the second reduplication type.",
        "A detailed statistic about these reduplicative words is given in the Table 6.",
        "There are 232 reduplicative words of the third type.",
        "Briefly, the total number of reduplicative words of all the three types of reduplication is 813, making up about 813/28, 416 w 2.86% of the number of two-syllable words."
      ]
    },
    {
      "heading": "4. Implementation",
      "text": [
        "We report in this section the construction of a computational model for recognition and production of the three types of reduplication presented in the previous section.",
        "We have implemented finite-state sequential transducers (FSTs) which are able to recognize and produce corresponding types of reduplicative words.",
        "These devices operate on the same input and output alphabets, say E, containing all Vietnamese characters.",
        "FSTs are formal devices for encoding regular relations.",
        "A regular relation is a mapping between two regular languages.",
        "In our cases, these languages are sets of Vietnamese root and reduplicant syllables.",
        "We adapted nice and efficient algorithms developed by (Daciuk et al., 2000) to incrementally construct minimal transducers from a source of data.",
        "These algorithms are originally designed to build optimal deterministic finite-state automata on-the-fly but they can also be used to construct optimal sequential transducers.",
        "We could consider simply that the alphabet of the automata would be E x E; output strings of E* are associated with the final states of the lexicon and they are only out-puted once corresponding valid inputs from E are recognized.",
        "Interested readers are invited to refer to (Daciuk et al., 2000) for further detail of the algorithms for building optimal automata on-the-fly.",
        "Reduplicant",
        "Root",
        "#",
        "a",
        "â",
        "72",
        "a",
        "â",
        "128",
        "à",
        "ä",
        "27",
        "à",
        "a",
        "80",
        "Sum",
        "307",
        "Example",
        "At root",
        "At reduplicant",
        "Noisy phone",
        "Nasal phone",
        "am äp",
        "-P",
        "-m",
        "phon phdt",
        "-t",
        "-n",
        "vang väc",
        "-c",
        "-ng",
        "anh âch",
        "-ch",
        "-nh",
        "Root",
        "Reduplicant",
        "#",
        "-P",
        "-m",
        "52",
        "-t",
        "-n",
        "96",
        "-c",
        "-ng",
        "56",
        "-ch",
        "-nh",
        "28",
        "Sum",
        "232",
        "In the first type reduplication, the root and the reduplicant is completely identical in writing; they are only distinguished by a stress in pronunciation.",
        "We can simply construct a deterministic finite-state transducer (FST) /1 that produces redupli-cants from their roots in which the output string labeled on each arc is the same as its input character; that is /1 (x) = x where x is a syllable in the first type duplication.",
        "As an illustration, the following minimal FST recognizes and generates three first type reduplicative words luon ludn (always), lit lit (silently), khan khan (raucous).",
        "The minimal FST /i recognizing all 274 reduplicative words of the first type consists of 90 states in which 16 states are final ones.",
        "It has 330 transitions, the maximum number of outtransitions from a state is 28.",
        "In the second type reduplication, the root has an non-flat tone while its reduplicant has the corresponding flat tone.",
        "A root determines for it the unique reduplicant.",
        "Hence we can construct a sequential FST /2 which is able to generate redupli-cants from roots.",
        "For instance, consider two reduplicative words of the second type lem lem (glib) and lem lem (voluble).",
        "They can be recognized by the minimal sequential FST /2 such that /2(lem) = lem and /2(lem) = lem as depicted in the following figure:",
        "Similarly, the minimal FST f2 which generates three reduplicative words giông giong (a little similar), dang dang (interminable) and dam dam (fixedly) is as follows:",
        "The roots and reduplicants in the third type reduplication are not only combined by principles of flat and non-flat tones, they are also distinguised by last consonants.",
        "We know that in the case the root ends with c, its reduplicant is one character longer than it.",
        "The other three transformations of last consonants do not change the length of the reduplicants with respect to that of the roots.",
        "Hence the FST /3 which recognizes the third type reduplication is required to modify the tones of the reduplicants with respect to those of the roots on the one hand, and to transform last consonants of the roots on the other hand.",
        "For example, the minimal FST /3 recognizing four reduplicative words bieng biec (bluish green), bien biet (leave behind no traces whatsoever), binh bich (a series of thudding blows) and bom bop (pop pop) is given in the figure below:",
        "The minimal FST /3 recognizing all 232 reduplicative words of the third type consists of 59 states in which 2 states are final ones.",
        "It has 262 transitions, the maximum number of outtransitions from a state is 19.",
        "Once all the three transducers have been constructed, we can unify them by making use of the standard union operation on transducers to obtain a sequential FST which is able to recognize all the three class of reduplication presented above (Mohri, 1996; Mohri, 1997).",
        "We have developed a Java software package named vnReduplicator which implements the above-mentioned computational model of Vietnamese reduplication.",
        "The core component of this package is a minimal FST which can recognize a substantial amount of reduplicative bisyllabic words found in the Vietnamese language.",
        "The first application of this core model which we have developed is a reduplication scanner for Vietnamese.",
        "We use the minimal FST of the core model to build a tool for fast detection of reduplication.",
        "The tool scans a given input text and produces a list of all the recognized reduplicative words.",
        "The detection process is very fast since the underlying transducer operates in optimal time in the sense that the time to recognize a syllable corresponds to the time required to follow a single path in the deterministic finite-state machine, and the length of the path is the length of the syllable measured in characters.",
        "As an example, given the following input text",
        "\"Anh di bien biet.",
        "Co van ch5 anh hon 20 nam dang dang.",
        "\", the scanner marks two reduplicative words as shown in the italic face.",
        "We are currently investigating another useful application of the core model for a partial spell checking of Vietnamese text.",
        "It is observed that people may make typhographical errors in writing like dang dang instead of the correct word dang dang.",
        "In such cases, the computational model can be exploited to detect the potential errors and suggest corrections.",
        "The reduplication model could also help improve the accuracy of Vietnamese lexical recognizers in particular and the accuracy of Vietnamese word segmentation systems in general.",
        "The reduplication scanner will be integrated to vn-Tokenizer - an open source and highly accurate tokenizer for Vietnamese texts (Le et al., 2008).",
        "The software and related resources will be distributed under the GNU General Public Lisenceand it will be soon available online."
      ]
    },
    {
      "heading": "5. Conclusion and Future Work",
      "text": [
        "We have presented for the first time a computational model for the reduplication of the Vietnamese language.",
        "We show that a large class of reduplicative words can be modeled effectively by sequential finite-state string-to-string transducers.",
        "The analysis of the various patterns of reduplication of the Vietnamese language has twofold contributions.",
        "On the one hand, it gives useful information on identification of spelling variants in Vietnamese texts.",
        "On the other hand, it gives an explicit formalization of precedence relationships in the phonology, and as a result helps ordering and modeling phonological processes before transfer of the presentation to the articulatory interface.",
        "It is argued that the relation between morphology and phonology is an intimate one, both syn-chronically and diachronically.",
        "As mentioned earlier, Vietnamese reduplication is always accompanied by a modification of phone and tone for a symmetric and harmonic posture.",
        "We thus believe that the compact finite-state description of a large class of reduplication would help connect mor-phosyntactic attributes to individual phonological components of a set of Vietnamese word forms and contribute to the improvement of Vietnamese automatic speech recognition systems.",
        "As mentioned earlier, the current work does not handle partial reduplication in which either the onset is repeated or the rhyme and the tone of syllables are repeated, for example bong benh (bob), chum chim (open slightly one's lips), lam cam (doting), lung tung (perplexed, embarrassed).",
        "Partial reduplication is a topic which has been well studied for a long time by Vietnamese linguists community.",
        "It has been shown that partial reduplicative words also have certain principle formation rules (Diep, 1999; UBKHXH, 1983).",
        "Hence, partial reduplicative words could also be generated and recognized by an appropriate finite-state model which encodes precisely their formation rules.",
        "This is an interesting topic of our future work in constructing a rather complete computational model for Vietnamese bisyllabic reduplication.",
        "Furthermore, in addition to the bisyllabic reduplication forms, there exists also three or four syllable reduplication forms, for example con con con (very little), teo teo teo (very small), or voi voi vdng vdng (hurry), dung da dung dinh (deliberate).",
        "These reduplication forms involve the copying operation of morphological structures which is a non-regular operation.",
        "Non-regular operations are problematic in that they cannot be cast in terms of composition - the regular operation of major importance in finite-state devices, while finite-state devices cannot handle unbounded copying.",
        "However, the question of the possibility for an elegant account to reduce these specific kinds of reduplication to purely regular mechanisms would be of interest for further research to extend and improve the core reduplication components for Vietnamese.",
        "Unknown reduplicative word guessing is another interesting and useful topic since the lexicon can never cover all reduplicative words.",
        "Acknowledgement",
        "We gratefully acknowledge helpful comments and valuable suggestions from three anonymous reviewers for improving the paper."
      ]
    }
  ]
}
