{
  "info": {
    "authors": [
      "Holger Schwenk",
      "Sadaf Abdul-Rauf",
      "Loïc Barrault",
      "Jean Senellart"
    ],
    "book": "Proceedings of the Fourth Workshop on Statistical Machine Translation",
    "id": "acl-W09-0423",
    "title": "SMT and SPE Machine Translation Systems for WMT'09",
    "url": "https://aclweb.org/anthology/W09-0423",
    "year": 2009
  },
  "references": [
    "acl-D07-1090",
    "acl-H93-1039",
    "acl-J03-1002",
    "acl-N03-1017",
    "acl-P02-1038",
    "acl-P07-2045",
    "acl-W07-0728",
    "acl-W07-0732",
    "acl-W08-0313",
    "acl-W08-0509"
  ],
  "sections": [
    {
      "text": [
        "Holger Schwenk and Sadaf Abdul-Rauf and Loïc Barrault",
        "LIUM, University of Le Mans 72G85 Le Mans cedex 9, FRANCE schwenk,abdul,barrault@lium.univ-lemans.fr",
        "SYSTRANSA",
        "92G44 Paris La Defense cedex, FRANCE senellart@systran.fr",
        "This paper describes the development of several machine translation systems for the 2009 WMT shared task evaluation.",
        "We only consider the translation between French and English.",
        "We describe a statistical system based on the Moses decoder and a statistical post-editing system using SYSTRAN's rule-based system.",
        "We also investigated techniques to automatically extract additional bilingual texts from comparable corpora."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "This paper describes the machine translation systems developed by the Computer Science laboratory at the University of Le Mans (LIUM) for the 2009 WMT shared task evaluation.",
        "This work was performed in cooperation with the company SYSTRAN.",
        "We only consider the translation between French and English (in both directions).",
        "The main differences to the previous year's system (Schwenk et al., 2008) are as follows: better usage of SYSTRAN's bilingual dictionary in the statistical system, less bilingual training data, additional language model training data (news-train08 as distributed by the organizers), usage of comparable corpora to improve the translation model, and development of a statistical post-editing system (SPE).",
        "These different components are described in the following."
      ]
    },
    {
      "heading": "2. Used Resources",
      "text": [
        "In the frame work of the 2009 WMT shared translation task many resources were made available.",
        "The following sections describe how they were used to train the translation and language models of the systems.",
        "The latest version of the French/English Europarl and news-commentary corpus were used.",
        "We realized that the first corpus contains parts with foreign languages.",
        "About 1200 such lines were excluded.",
        "Additional bilingual corpora were available, namely the Canadian Hansard corpus (about 68M English words) and an UN corpus (about 198M English words).",
        "In several initial experiments, we found no evidence that adding this data improves the overall system and they were not used in the final system, in order to keep the phrase-table small.",
        "We also performed experiments with the provided so-called bilingual French/English Gigaword corpus (575M English words in release 3).",
        "Again, we were not able to achieve any improvement by adding this data to the training material of the translation model.",
        "These findings are somehow surprising since it was eventually believed by the community that adding large amounts of bitexts should improve the translation model, as it is usually observed for the language model (Brants et al., 2007).",
        "In addition to these human generated bitexts, we also integrated a high quality bilingual dictionary from SYSTRAN.",
        "The entries of the dictionary were directly added to the bitexts.",
        "This technique has the potential advantage that the dictionary words could improve the alignments of these words when they also appear in the other bitexts.",
        "However, it is not guaranteed that multi-word expressions will be correctly aligned by GIZA++ and that only meaningful translations will actually appear in the phrase-table.",
        "A typical example is fire engine - camion de pompiers, for which the individual constituent words are not good translations of each other.",
        "The use of a dictionary to improve an SMT system was also investigated by",
        "French English Gigaword translations used as queries per day articles candidate sentence pairs parallel sentences with extra words at ends",
        "parallel sentences",
        "tail removal",
        "+ – 5 day articles from English Gigaword",
        "(Brown et al., 1993).",
        "In comparison to our previous work (Schwenk et al., 2008), we also included all verbs in the French subjonctif and passe simple tense.",
        "In fact, those tenses seem to be frequently used in news material.",
        "In total about 10,000 verbs, 1,500 adjectives/adverbs and more than 100,000 noun forms were added.",
        "Available human translated bitexts such as the UN and the Hansard corpus seem to be out-of domain for this task, as mentioned above.",
        "Therefore, we investigated a new method to automatically extract and align parallel sentences from comparable indomain corpora.",
        "In this work we used the AFP news texts since there are available in the French and English LDC Gigaword corpora.",
        "The general architecture of our parallel sentence extraction system is shown in figure 1.",
        "We first translate 174M words from French into English using an SMT system.",
        "These English sentences are then used to search for translations in the English AFP texts of the Gigaword corpus using information retrieval techniques.",
        "The Lemur toolkit (Ogilvie and Callan, 2001) was used for this purpose.",
        "Search was limited to a window of ±5 days of the date of the French news text.",
        "The retrieved candidate sentences were then filtered using the word error rate with respect to the automatic translations.",
        "In this study, sentences with an error rate below 32% were kept.",
        "Sentences with a large length difference (French versus English) or containing a large fraction of numbers were also discarded.",
        "By these means, about 9M words of additional bitexts were obtained.",
        "An improved version of this algorithm using TER instead of the word error rate is described in detail in (Rauf and",
        "Schwenk, 2009).",
        "The French and English target language models were trained on all provided monolingual data.",
        "We realized that the news-train08 corpora contained some foreign texts, in particular in German.",
        "We tried to filter those lines using simple regular expressions.",
        "We also discarded lines with a large fraction of numerical expressions.",
        "In addition, LDC's Gigaword collection, the Hansard corpus and the UN corpus were used for both languages.",
        "Finally, about 30M words crawled from the WEB were used for the French LM.",
        "All this data predated the evaluation period.",
        "All development was done on news-dev2009a and news-dev2009b was used as internal test set.",
        "The default Moses tokenization was used.",
        "All our models are case sensitive and include punctuation.",
        "The BLEU scores reported in this paper were calculated with the NIST tool and are case sensitive."
      ]
    },
    {
      "heading": "3. Language Modeling",
      "text": [
        "Language modeling plays an important role in SMT systems.",
        "4-gram back-off language models (LM) were used in all our systems.",
        "The word list contains all the words of the bitext used to train the translation model and all words that appear at least ten times in the news-train08 corpus.",
        "Separate LMs were build on each data source with the SRI LM toolkit (Stolcke, 2002) and then linearly interpolated, optimizing the coefficients with an EM procedure.",
        "The perplexities of these LMs",
        "Table 1: Case sensitive NIST BLEU scores for the French-English systems.",
        "\"NC\" denotes the news-commentary bitexts, \"dict\" SYSTRAN's bilingual dictionary and \"AFP\" the automatically aligned news texts (*=primary, # =contrastive system) are given in Table 2.",
        "Adding the new news-trainG8 monolingual data had an important impact on the quality of the LM, even when the Gigaword data is already included."
      ]
    },
    {
      "heading": "4. Architecture of the SMT system",
      "text": [
        "The goal of statistical machine translation (SMT) is to produce a target sentence e from a source sentence f. It is today common practice to use phrases as translation units (Koehn et al., 2003; Och and Ney, 2003) and a log linear framework in order to introduce several models explaining the translation process:",
        "The feature functions hi are the system models and the Ai weights are typically optimized to maximize a scoring function on a development set (Och and Ney, 2002).",
        "In our system fourteen features functions were used, namely phrase and lexical translation probabilities in both directions, seven features for the lexicalized distortion model, a word and a phrase penalty and a target language model (LM).",
        "The system is based on the Moses SMT toolkit (Koehn et al., 2007) and constructed as follows.",
        "First, word alignments in both directions are calculated.",
        "We used a multi-threaded version of the GIZA++ tool (Gao and Vogel, 2008).",
        "This speeds up the process and corrects an error of GIZA++ that can appear with rare words.",
        "This previously caused problems when adding the entries of the bilingual dictionary to the bitexts.",
        "Phrases and lexical reorderings are extracted using the default settings of the Moses toolkit.",
        "The parameters of Moses are tuned on news-dev2009a, using the cmert tool.",
        "The basic architecture of the system is identical to the one used in the but we did not use two pass decoding and n-best list rescoring with a continuous space language model.",
        "The results of the SMT systems are summarized in the upper part of Table 1 and 3.",
        "The dictionary and the additional automatically produced AFP bi-texts achieved small improvements when translating from French to English.",
        "In the opposite translation direction, the systems that include the additional AFP texts exhibit a bad generalisation behavior.",
        "We provide also the performance of the different systems on the official test set, calculated after the evaluation.",
        "In most of the cases, the observed improvements carry over on the test set."
      ]
    },
    {
      "heading": "5. Architecture of the SPE system",
      "text": [
        "During the last years statistical post-editing systems have shown to achieve very competitive performance (Simard et al., 2007; Dugast et al., 2007).",
        "The main idea of this techniques is to use",
        "Corpus",
        "# Fr words",
        "Dev09a",
        "Dev09b",
        "Test09",
        "SMT system",
        "Eparl+NC",
        "46.5M",
        "22.44",
        "22.38",
        "25.60",
        "Eparl+NC+dict",
        "48.5M",
        "22.60",
        "22.55",
        "26.01",
        "Eparl+NC+dict+AFP",
        "57.8M",
        "22.82",
        "22.63*",
        "26.18",
        "SPE system",
        "SYSTRAN",
        "-",
        "17.76",
        "18.13",
        "19.98",
        "Eparl+NC",
        "45.5M",
        "22.84",
        "22.59#",
        "25.59",
        "Eparl+NC+AFP",
        "54.4M",
        "22.72",
        "21.96",
        "25.40",
        "Data",
        "French",
        "English",
        "Vocabulary size",
        "407k",
        "299k",
        "Eparl+news",
        "248.8",
        "416.7",
        "+ LDC Gigaword",
        "142.2",
        "194.9",
        "+ Hansard and UN",
        "137.5",
        "187.5",
        "news-train08 alone",
        "165.0",
        "245.9",
        "all",
        "120.6",
        "174.8",
        "Table 3: Case sensitive NIST BLEU scores for the English-French systems.",
        "\"NC\" denotes the news-commentary bitexts, \"dict\" denotes SYSTRAN's bilingual dictionary and \"AFP\" the automatically aligned news texts (*=primary, # =contrastive system) an SMT system to correct the errors of a rule-based translation system.",
        "In this work, SYSTRAN server version 6, followed by an SMT system based on Moses were used.",
        "The post-editing systems uses exactly the same language models than the above described standalone SMT systems.",
        "The translation model was trained on the Europarl, the news-commentary and the extracted AFP bi-texts.",
        "The results of these SPE systems are summarized in the lower part of Table 1 and 3.",
        "SYSTRAN's rule-based system alone already achieves remarkable BLEU scores although it was not optimized or adapted to this task.",
        "This could be significantly improved using statistical post-editing.",
        "The additional AFP texts were not useful when translating form French to English, but helped to improve the generalisation behavior for the English/French systems.",
        "When translating from English to French (Table 3), the SPE system is clearly better than the carefully optimized SMT system.",
        "Consequently, it was submitted as primary system and the SMT system as contrastive one."
      ]
    },
    {
      "heading": "6. Conclusion and discussion",
      "text": [
        "We described the development of two complementary machine translation systems for the 2009 WMT shared translation task: an SMT and an SPE system.",
        "The last one is based on SYSTRAN's rule-based system.",
        "Interesting findings of this research include the fact that the SPE system outperforms the SMT system when translating into French.",
        "This system has also obtained the best scores in the human evaluation.",
        "With respect to the SMT system, we were not able to improve the translation model by adding large amounts ofbitexts, although different sources were available (Canadian Hansard, UN or WEB data).",
        "Eventually these corpora are too noisy or out-of-domain.",
        "On the other hand, the integration of a high quality bilingual dictionary was helpful, as well as the automatic alignment of news texts from comparable corpora.",
        "Future work will concentrate on the integration of previously successful techniques, in particular continuous space language models and lightly-supervised training (Schwenk, 2008).",
        "We also believe that the tokenization could be improved, in particular for the French sources texts.",
        "Numbers, dates and other numerical expressions could be translated by a rule-based system.",
        "System combination has recently shown to provide important improvements of translation quality.",
        "We are currently working on a combination of the SMT and SPE system.",
        "It may be also interesting to add a third (hierarchical) MT system."
      ]
    },
    {
      "heading": "7. Acknowledgments",
      "text": [
        "This work has been partially funded by the French Government under the project INSTAR (ANR JCJC06_143038) and the by the Higher Education Commission, Pakistan through the HEC Overseas Scholarship 2005.",
        "Corpus",
        "# En words",
        "Dev09a",
        "Dev09b",
        "Test09",
        "SMT system",
        "Eparl+NC",
        "41.6M",
        "21.89",
        "21.78",
        "23.80",
        "Eparl+NC+dict",
        "44.",
        "OM",
        "22.28",
        "22.35#",
        "24.13",
        "Eparl+NC+dict+AFP",
        "51.7M",
        "22.21",
        "21.43",
        "23.88",
        "SPE system",
        "SYSTRAN",
        "-",
        "18.68",
        "18.84",
        "20.29",
        "Eparl+NC",
        "44.2M",
        "23.03",
        "23.15",
        "24.36",
        "Eparl+NC+AFP",
        "53.3M",
        "22.95",
        "23.15*",
        "24.62"
      ]
    }
  ]
}
