{
  "info": {
    "authors": [
      "Marc B. Vilain",
      "Jonathan Huggins",
      "Benjamin Wellner"
    ],
    "book": "CoNLL",
    "id": "acl-W09-1124",
    "title": "A simple feature-copying approach for long-distance dependencies",
    "url": "https://aclweb.org/anthology/W09-1124",
    "year": 2009
  },
  "references": [
    "acl-J81-4003",
    "acl-P95-1026"
  ],
  "sections": [
    {
      "text": [
        "Marc Vilain, Jonathan Huggins, and Ben Wellner",
        "The MITRE Corporation",
        "2G2 Burlington Rd Bedford, MA G173G (USA)",
        "{mbv,jhuggins,wellner}@mitre.org",
        "This paper is concerned with statistical methods for treating long-distance dependencies.",
        "We focus in particular on a case of substantial recent interest: that of long-distance dependency effects in entity extraction.",
        "We introduce a new approach to capturing these effects through a simple feature copying preprocess, and demonstrate substantial performance gains on several entity extraction tasks."
      ]
    },
    {
      "heading": "1. Long-distance dependencies",
      "text": [
        "The linguistic phenomena known as long-distance dependencies have a long history in computational linguistics.",
        "Originally arising in phrase-structure grammar, the term aptly describes phenomena that are not strictly grammatical, and has thus gained currency in other endeavors, including that of concern to us here: entity extraction.",
        "The common thread, however, is simply that the treatment of a linguistic constituent a might be influenced by the treatment of a non-local constituent p.",
        "In phrase-structure grammar, dependencies arise between matrix phrases and the gapped phrases that they dominate, as in \"the cake that I hope you'll serve e\".",
        "The idea that these are longdistance dependencies arises from the fact that the separation between linked constituents can be arbitrarily increased while their dependency continues to hold (as in \"the cake that I hope you'll ask Fred to tell Joan to beg Maryanne to serve e\").",
        "With entity extraction, long-distance dependencies typically occur between mentions of the same entity.",
        "Consider, for example, the italicized references to Thomas White in this newswire excerpt:",
        "Bank of America on Friday named Thomas White head of global markets.",
        "White has been global head of credit products.",
        "The fact that the first of these mentions is easily understood as person-denoting has substantial bearing on interpreting the second mention as person-denoting as well.",
        "But while local evidence for personhood is abundant for the first instance (e.g., the given name \"Thomas\" or the verb \"named\"), the evidence local to the second instance is weak, and it is highly unlikely that a learning procedure would on its own acquire the relevant 5-gram context (a has been [SJJ ytitle).",
        "The dependency between these instances of White is thus a significant factor in interpreting both as names.",
        "It is well known that capturing this kind of dependency can dramatically improve the performance of entity extraction systems.",
        "In this paper, we pursue a very simple method that enables statistical models to exploit these long-distance dependencies for entity extraction.",
        "The method obtains comparable or better results than those achieved by more elaborate techniques, and while we focus here on the specific case of entity extraction, we believe that the method is simple and reliable enough to apply generally to other long-distance phenomena."
      ]
    },
    {
      "heading": "2. Approaches to name dependencies",
      "text": [
        "The problem of capturing long-distance dependencies between names has a traditional heuristic solution.",
        "This method, which goes back to systems participating in the original MUC-6 evaluation (Sundheim, 1995), is based on a found names list.",
        "The method requires two passes through the input.",
        "A first pass captures named entities based on local evidence, and enters these names into a found names registry.",
        "A second pass identifies candidate entities that were missed by the first pass, and compares them to entries in the registry.",
        "Where there is string overlap between the candidate and a previously found name, the entity type assigned to the existing entry is copied to the candidate.",
        "Overall, this is an effective strategy, and we used it ourselves in a rule-based name tagger from the muc-6 era (Vilain and Day, 1996).",
        "The strategy's Achilles heel, however, is what happens when erroneous entries are added to the found names list.",
        "These can get copied willy-nilly, thereby drastically increasing the scope of what may originally have started as a single local error.",
        "Clearly, the approach is begging to be given a firmer evidence-weighing foundation.",
        "An early such attempt at reformulating the approach is due to Minkheev et al. (1999).",
        "As with previous approaches, Mikheev and his colleagues use a rule-based first pass to populate a found-names list.",
        "The second pass, however, is based on a maximum entropy classifier that labels non-first-passed candidates based on evidence accrued from matching entries on the found-names list.",
        "The statistical nature of the decision eliminates some of the failure modes of the heuristic found-names strategy, and in particular, prevents the copying of single errors committed in the first pass.",
        "The major weakness of the approach, however, is the heuristic first pass.",
        "Minkheev et al. note that their method is most effective with a high-precision found-names list, implemented as a tightly controlled (but incomplete) rule-based first pass.",
        "Several more recent efforts have attempted to remove the need for a heuristic first-pass tagger, and have thus cast the problem as one-pass statistical models (Bunescu and Mooney, 2004; Sutton and McCallum, 2004; Finkel et al., 2005).",
        "While the technical details differ, all three methods approach the problem through conditional random fields (crfs).",
        "In order to capture the long-distance dependencies between name instances, these approaches extend the linear-chain sequence models that are typically used for extracting entities with a crf (Sha and Pereira, 2003).",
        "The resulting models consist of sentence-length sequences interlinked on those words that might potentially have longdistance interactions.",
        "Because of the graph-like nature of these models, the simplifying assumptions of linear-chain crfs no longer hold.",
        "Since complete parameter estimation is intractable under these conditions, these three approaches introduce approximate methods for parameter estimation or decoding (Perceptron training for the first, loopy belief propagation for the first two, Gibbs sampling and simulated annealing for the third).",
        "Krishnan and Manning (2006) provide a lucid critique of these extended models and of their computational ramifications.",
        "In a nutshell, their critique centers on the complexity of constructing the linked graphs (which they deemed high), the stability of Perceptron training (potentially unstable), and the runtime cost of simulated annealing (undesirably high).",
        "Since these undesirable properties are directly due to the treatment of longdistance dependencies through graphical models, it is natural to ask whether graphical models are actually required to capture these dependencies.",
        "In point of fact, Krishnan and Manning (2006) present an alternative to these graph-based methods.",
        "In particular, they break the explicit links that mutually condition non-adjacent lexemes, and instead rely on separate passes in a way that is reminiscent of earlier methods.",
        "A first-pass crf is used to identify entities based solely on local information.",
        "The entity labels assigned by this first crf are summarized in terms of lexeme-by-lexeme majority counts; these counts are then passed to a second crf in the form of lexical features.",
        "Consider, for example, a financial news source, where we would expect that a term like \"Bank\" might be assigned a preponderance of org labels by the first-pass crf.",
        "This would be signaled to the second-pass crf through a token majority feature that would take on the value ORG for all instances of the lexeme \"Bank\".",
        "This effectively aggregates local first-pass labeling decisions that apply to this lexeme, and makes the second-pass crf sensitive to these first-pass decisions.",
        "Further refinements capture cases where a lexeme's label diverges from the token majority, for example: \"Left Bank,\" where \"Bank\" will be assigned a loc-valued entity majority feature whenever it appears in that particular word sequence.",
        "By capturing long-distance dependencies through lexical features, Krishnan and Manning avoid the need for graphical models, thus regaining tractability.",
        "How well does this work?",
        "Returning to our earlier example, the idea behind these majority count features is that a term like \"White\" might be assigned the per label by the first crf when it appears in the context \"Thomas White.\"",
        "Say, for the sake of argument, that sufficiently many instances of \"White\" are labeled per by the first pass to sum to a majority.",
        "The second-stage crf might then be expected to exploit the majority count features for \"White\" to per-label any instances of White that were left unlabeled in the first pass (or that were given erroneous first-pass labels).",
        "The method would be expected to fail, however, in cases where the first pass yields a majority of erroneous labels.",
        "Krishnan and Manning suggest that this is a fairly unlikely scenario, and demonstrate that their approach effectively captures long-distance name dependencies for the conll English name-tagging task.",
        "They measured a best-in-class error reduction of 13.3% between their two-pass method and a single-stage crf equipped with comparable features."
      ]
    },
    {
      "heading": "3. A contradictory data set",
      "text": [
        "Just how unlikely, however, is the majority-error scenario that Krishnan and Manning discount?",
        "As it turns out, we encountered precisely this scenario while working with a corpus that is closely related to the conll data used by Krishnan and Manning.",
        "The corpus in question was drawn from the online edition of Reuters business news.",
        "The articles cover a range of business topics: mergers and acquisitions (m+a), stock valuations, management change, and so forth.",
        "This corpus is highly pertinent to this discussion, as the conll English data are also Reuters news stories, drawn from the general news distribution.",
        "Our business data thus represent a natural branch of the overall conll data.",
        "A characteristic of these Reuters business stories that distinguishes them from general news is the prevalence of organization names, in particular company names.",
        "In these data, instances of company names significantly outnumber the next-most-common entities (money, dates, and the like).",
        "Even state-of-the-art crfs trained on these data therefore err on the side of generating companies,",
        "Table 1: effectiveness of majority counts as predictors of entity type, Reuters business news sample",
        "meaning that in the absence of countermanding evidence (such as the presence of a person's given name), an entity will tend to be labeled org by default.",
        "Our earlier \"Thomas White\" example is a case in point: where the full name would typically be labeled per, last-name-only instances (\"White\") might go unlabeled or be marked orgs.",
        "Table 1, above, shows a qualitative analysis of this phenomenon for per entities in our m+a test set.",
        "The table considers person-denoting entities with three or more instances in the test set (n=35), and summarizes the majority accuracy of the labels assigned to them by a feature-rich 1-pass crf.",
        "Of these thirty-five cases, we eliminate from consideration six trivial test cases that are present unambiguously in the training data (e.g., \"Carl Icahn\"), since the crf will effectively memorizes these cases during training.",
        "Of the remaining twenty-nine non-trivial cases, not quite half of them (45%) were accurately labeled by the crf for the majority of their instances.",
        "A larger number of entities either received an incorrect majority label (38%) or were equivocally labeled, receiving an equal number of correct and incorrect tags (17%).",
        "For this data set then, majority count features are poor models of the long-distance dependencies between person names, as they are just about as likely to predict the wrong label as the correct one."
      ]
    },
    {
      "heading": "4. A feature-copying alternative",
      "text": [
        "A further analysis of our business news test sample revealed an intriguing fact.",
        "While in the absence of compelling evidence, the crf might label a mention of a person entity as an org (or leave it unlabeled), for those mentions where compelling evidence existed, the crf generally got it right.",
        "By compelling evidence, we mean such linguistic cues as the presence of a given name, contextual proximity to agentive verbs (e.g. \"said\"), and so forth.",
        "This suggests an alternative approach to capturing these kinds of long-distance dependencies between names.",
        "In contrast to previous approaches, what is needed is not so much a way of coordinating non-local decisions about an entity's label, as a way of coordinating non-local evidence pertinent to the labeling decision.",
        "That is, instead of conditioning the labeling decision of a lexeme on the labeling decisions for that lexeme elsewhere in the corpus, we ought to condition the decision on the key evidence supporting those decisions.",
        "Label accuracy",
        "count",
        "% test cases",
        "Trivially correct (present in both test and training)",
        "6",
        " – ",
        "Majority correct, test only",
        "13",
        "45%",
        "Majority incorrect, test only",
        "11",
        "38%",
        "Equivocal, test only",
        "5",
        "17%",
        "Our approach operates by identifying those features of a crf that are most predictive over a corpus.",
        "Each of those features is then duplicated: for a given token a, one version of the feature applies directly to a, while the other version applies to all other instances where a's word form appears in the current document.",
        "In particular, what we duplicate is the indicator function for a feature.",
        "The local version of an indicator €> signals true if it applies locally to a, while the displaced version €>d signals true if it applies to any token a' that is an instance of the same word from as a.",
        "To make this concrete, consider our opening example, now indexed with word positions:",
        "Thomas7 White8 ... White13 has14 been15 ...",
        "Say that €> is a feature indicator that is true of a token ai just in case the token to its left, ai-1, is a given name.",
        "In this instance, €>(White8) is true and €>(White13) is false.",
        "Then €>d, the displaced version of €>, will be true of ai just in case there is some token aj with the same word form such that 0(aj) is true.",
        "In this instance €>d(White8) and €> d(White13) are both true by virtue of €> being true of White8.",
        "This feature displacement scheme introduces non-local evidence into labeling decisions, effectively capturing the long-distance dependencies exhibited by name-tagging tasks.",
        "The method differs from previous approaches in that the models are not made conditional on non-local decisions (as in the case of graphical models), nor are they made conditional on aggregated first-pass decisions (as in Krishnan & Manning), but rather are made conditional on non-local evidence (displaced features).",
        "Because a typical entity extraction model can use tens or hundreds of thousands of features, it is not practical to displace every one of them.",
        "Though technically this only doubles the number of features under consideration, the lexical indexing rapidly gets out of hand.",
        "In addition, training and run times increase and, in our experience, a risk of over-fitting emerges.",
        "In point of fact, however, capturing long-distance name dependencies does not require us to replicate every last bit of featureborne evidence.",
        "Instead, we only need to displace the evidence that is most reliably predictive.",
        "To select predictive features to displace, we've had most success with a method based on information gain.",
        "Specifically, we use a one-time pre-process that measures feature gain relative to a corpus.",
        "The pre-process considers the same complement of feature schemas as are used by the actual crf, and grounds the schemas on a training corpus to instantiate free lexical and p-o-s parameters.",
        "Gain for the instantiated features is measured through KL divergence, and the n features with highest gain are then selected for displacement (with n typically ranging from 1,000 to 10,000).",
        "As in (Schneider, 2004), gain for a given feature €>, is found through a variant of the familiar Kullback-Leibler divergence formula,",
        "For our purposes, the xi are the non-null entity labels defined for the training set (per, org, etc.",
        "), P is the probability distribution of the labels over the training set, Q is the distribution of the labels over tokens for which €> applies, and p and q are their respective smoothed probability estimates (Laplace smoothing).",
        "Note in particular that this formulation excludes the null label (\"not an entity\").",
        "This effectively means that KL divergence is giving us a measure of the degree to which a feature predicts one or more non-null entity labels.",
        "Because the null label is generally the dominant label in named-entity tasks, including the null label in the calculation of KL divergence tends to overwhelm the statistics, and leads to the selection of uninformative features that predict non-entities.",
        "Figure 1 demonstrates the effectiveness of this feature selection method, along with sensitivity to the threshold parameter.",
        "The figure charts F-score on a Reuters business news task (m+a) as a function of the number of displaced features.",
        "From a baseline of F=89.3, performance improves rapidly with the addition of displaced features to the crf model, reaching a maximum of F=91.4 with the",
        "Figure 1: F score on the Reuters M+A task, as a function of number of displaced features",
        "addition of 1,000 displaced features.",
        "Performance then fluctuates asymptotically around this level.",
        "The chart also shows comparable growth curves for two alternative feature selection methods.",
        "The feature count method is similar to feature gain, but instead of ranking features with KL divergence, it ranks them according to the number of times they match against the corpus.",
        "Feature weight does not use a schema-grounding first pass to generate candidate features, but trains a crf model on the corpus, and then ranks features according to the weight assigned to them in the model.",
        "In preliminary experiments, neither of these methods yielded as high-performing a set of displaced features as feature gain.",
        "Additionally their growth curves exhibit sensitivity to parameter setting, which suggests a risk of over-fitting.",
        "For these reasons, we did not pursue these approaches further.",
        "Note finally that the feature schemas we consider for displacement only encode local evidence (see Table 2 below).",
        "In particular, they do not encode the assigned label of a word form, as this would effectively introduce the kind of graphical conditional dependencies that lie outside the scope of linear-chain CRF methods.",
        "Aside from two preprocessing steps, training or decoding a crf with displaced features is no different from training or decoding one with only conventional features.",
        "As to the preprocessing steps, the first applies to the corpus overall, as we must initially select a collection of locally predictive features to displace.",
        "The second step applies on a per-document basis and consists of the creation of the inverted lexical indices that are used to trigger indicator functions for displaced features.",
        "While these additional steps complicate training and decoding somewhat, they have little effect on actual decoding run times.",
        "Most importantly, they retain the linear-chain properties of the CRF, and therefore do not require the graphical modeling and involved parameter estimation called for by most previous approaches.",
        "In addition, the training logistics are of a lesser magnitude than those required by Krishnan and Manning's approach, since training their second-stage model first requires round-robin training of one-fold-left-out classifiers that estimate first-stage majority counts."
      ]
    },
    {
      "heading": "5. Experimental design",
      "text": [
        "To evaluate the effectiveness of feature copying with long-distance dependencies, we undertook a number of information extraction experiments.",
        "We focused on the traditional name-tagging task, relying on both current and archival data sets.",
        "For each data set, we trained entity-extraction models that corresponded to three different strategies for capturing long-distance dependencies.",
        "• Baseline model: a feature-rich crf trained with only local features and no long-distance dependency features;",
        "• Feature-copying model: a crf trained with the same local features, along with displaced versions of high-gain features;",
        "• Majority model: a reimplementation of the Krishnan and Manning strategy, using the same feature set as the baseline crf as well as their majority count features.",
        "We used held-out development test sets to tune the selection of displaced features, in particular, the number of features to displace.",
        "We used the Carafe open-source implementation of sequence-based conditional random fields.",
        "Carafe has achieved competitive results for standard sequence modeling tasks (Wellner & Vilain, 2006, Wellner et al., 2007), and allows for flexible feature design.",
        "Carafe provides several learning methods, including a fast gradient descent method using periodic step-size adjustment (Huang et al., 2007).",
        "Preliminary trials, however, produced better results",
        "Reuters conll",
        "Table 2: Baseline features; wi and pi resPectively denote lexeme and P-O-S in relative Position i.",
        "with conditional log-likelihood learning (l-bfgs oPtimization).",
        "We used this latter method here, L2-regularized by a sPherical Gaussian Prior with variance set to 10.0 (based on Preliminary trials).",
        "Our baseline crf was given a feature set that has Proven its mettle in the literature (see Table 2).",
        "Along with contextual n-grams and the like, these features caPture linguistic regularities through membershiP in vocabulary lists, e.g., first names, major geograPhical names, honorifics, etc.",
        "They also include hand-engineered lists from our legacy rule-based tagger, e.g., head word lists for organization names, lists of agentive verbs that reliably aPPly to Persons, date atoms, and more.",
        "For Part-of-sPeech features, we either accePted the Parts of sPeech Provided with a data set, or generated them with our imPlementation of Brill's method (Brill, 1994).",
        "For the majority count features, we used document and coipus versions the token and entity features described by Krishnan and Manning, but did not re-imPlement their super-entity feature.",
        "We evaluated our aPProach on five different data sets: our current corPus of Web-harvested Reuters business news, as well as four archival data sets that have been rePorted on by other researchers.",
        "The business news data consist of a training corPus of mergers and acquisition stories (m+a), develoPment and evaluation test sets for m+a and test sets for three additional toPics: hot stocks (hs), new initiatives (ni), and general business news (bn).",
        "Table 3 Provides an overview of our data sets and of some salient distinctions between them.",
        "All five extraction tasks require the rePorting of three core entity tyPes: Persons, organizations, and locations; additional required tyPes are noted in the table.",
        "The rePorting guidelines for the first four tasks are closely related: Reuters business and muc-6 were annotated to the same original muc-6",
        "Table 3: Data set characteristics.",
        "All include Persons, organizations, and locations; some have numeric forms (NU), dates and times (TM) where r indicates relative dates, or misc (mi).",
        "standard, while muc-7 and mnet extend the muc-6 standard slightly.",
        "The conll standard alone calls for a catch-all (and troublesome) misc entity.",
        "Previous results on these data sets have been rePorted using one of two scoring methods: strict match (conll) or match with Partial credit, as calculated by the muc scorer (muc-6, muc-7, and mnet).",
        "To enable comParisons to Previously Published work, we rePort our results with the metric aPProPriate to each data set (we use the muc scorer for Reuters).",
        "These scoring distinctions are Pertinent only to comParisons of absolute Performance.",
        "in this PaPer, the interest is with relative comParisons across aPProaches to long-distance dePendencies, for which the scorers are kePt constant."
      ]
    },
    {
      "heading": "6. Experimental results",
      "text": [
        "Table 4 summarizes our exPerimental results for the seven test sets annotated to the muc-6 standard or its close variants (we will consider the conll task seParately).",
        "Along with F scores for our baseline crf, the table Presents F scores and baseline-relative error reduction (AE) for two aPProaches to long-distance name dePendencies: feature disPlacement (disP) and the Krishnan and Manning strategy (k+m).",
        "We were Pleased to see that feature disPlacement Proved effective for all of the extraction tasks.",
        "As the table shows, the addition of disPlaced features consistently reduced the residual error term left by the baseline crf trained only with local features.",
        "For the English-language corPora, the error reduction ranged from a low of 11 % for the Reuters ni task to a high of 39% for the muc-6 task.",
        "The error reduction for the SPanish-language mnet task was lowest of all, at 8.9%.",
        "For all the English tasks, we consistently achieved better results with feature disPlacement",
        "lexical unigrams",
        "w-2 ... w+2",
        "lexical bigrams",
        "W-2,W-i ... W+i,W+2",
        "P-O-S unigrams",
        "P-2 .",
        "■ ■ P+2",
        "P-O-S bigrams",
        "P-2,P-1 ... P+l,P+2",
        "substrings",
        ".",
        "*s or s.* ||s||<4",
        "linguistic word lists",
        "gazetteers, date atoms, ...",
        "regular expressions",
        "caPs., digits, ...",
        "\"corp.\" nearby",
        "also \"ltd.\" ...",
        "Language",
        "NU",
        "TM",
        "MI",
        "ToPics",
        "English",
        "✓",
        "✓",
        "mostly Politics",
        "English",
        "✓",
        "✓ r",
        "mostly Politics",
        "SPanish",
        "✓",
        "✓ r",
        "mostly Politics",
        "English",
        "✓",
        "✓",
        "business",
        "English",
        "✓",
        "all news",
        "baseline Reuters m+a F Ae 89.3",
        "Reuters bn F Ae 89.5",
        "Reuters hs F Ae 85.4 Table 4: Performance on seven test sets annotated to variants of the muc-6 standard (muc scorer).",
        "Reuters ni",
        "than with our version of Krishnan and Manning's aPProach (we were not able to obtain SPanish k+m results by Publication time).",
        "in each case, disPlacement Produced a greater reduction in baseline error than did majority counts.",
        "Furthermore, because both aPProaches start from the same baseline crf, the resulting raw Performance was consequently also higher for disPlacement.",
        "Note in Particular the Reuters m+a test set: these are the data for which Table 1 suggests that majority counts would be Poor Predictors of long-distance effects.",
        "This Prediction is in fact borne out by our results.",
        "We were interested to note that the feature disPlacement method achieved both highest Performance and highest error reduction for the muc-6 corPus (F=92.8, Ae=39.3%) and for two of the Reuters test sets: m+a (F=91.4, Ae=20.0%) and bn (F=91.8, AE=21.6%).",
        "The muc-6 F-score, in Particular, is comParable to those of hand-built muc-era systems; in fact, it exceeds the score of our own hand-built muc-6 system (Aberdeen et al., 1995).",
        "What is aPParently haPPening is that these three data sets are well matched to a grouP of linguistically insPired lexical features with which we trained our baseline crf.",
        "In Particular, our baseline features include gazetteers and word lists hand-selected for identifying entities based on local context: first names, agentive verbs, date atoms, etc.",
        "This Played out in two significant ways.",
        "First, these linguistic features tended to elevate baseline Performance (see Table 4).",
        "Second, these same features also Proved effective when disPlaced, as demonstrated by the substantial error reduction with disPlacement.",
        "Feature disPlacement thus further rewards sound feature engineering.",
        "The muc-7 and Reuters hot stocks data (hs) Provide informative contrasts.",
        "For these data, feature disPlacement Provided error reduction of AE=13.9% and 13.4% resPectively, which is less than for the toP three data sets.",
        "it is interesting to note that in both cases, the baseline score is also lower, suggesting again that the Performance of feature coPying follows the Performance of baseline tagging.",
        "In the case of Reuters hs, the evaluation data contained many out-of-training references to stock indices, which dePressed baseline scores.",
        "Similar develoPment-to-evaluation divergences have also been noted with the muc-7 corPus.",
        "Our results for the conll task, rePorted in Table 5 below, Provide a different Point of contrast.",
        "The middle two rows of the table Present the same exPerimental configurations as have been discussed so far.",
        "For this data set, we note that feature disPlacement does not Perform as well as our reimPlementation of Krishnan and Manning's strategy in terms of both absolute score and error reduction.",
        "Likewise, Published results for other aPProaches mostly outPerform disPlacement (see the first three rows in Table 5).",
        "One Possible exPlanation lies with the linguistic features with which we aPProached conll: these are the same ones we originally develoPed for muc-6.",
        "As noted earlier the conll standard diverges in several ways from muc-6.",
        "In Particular, conll calls for a misc entity that covers a range of name-like entities, e.g., events.",
        "misc also, however, caPtures names that are traPPed by tokenization (\"London-based\"), as well as some muc organizations (sPorts leagues).",
        "This suggests that adaPting our features to the conll task might helP.",
        "Table 5: Performance on the use of long-distance",
        "CoNLL task; LDD designates dependency method.",
        "base F",
        "ldd F",
        "Ae",
        "Bunescu + Mooney 2004",
        "80.09",
        "82.30",
        "11.1%",
        "Finkel et al. 2005",
        "85.51",
        "86.86",
        "9.3%",
        "Krishnan + Manning 2006",
        "85.29",
        "87.34",
        "13.3%",
        "k+m (re-impl, muc feats.)",
        "84.3",
        "86.0",
        "10.7%",
        "displacement (muc feats.)",
        "84.3",
        "85.8",
        "9.6%",
        "displ.",
        "(conll feats.)",
        "85.24",
        "86.55",
        "8.9%",
        "displ.",
        "(conll feats.",
        "+ ds)",
        "86.57",
        "87.39",
        "6.1%",
        "The final two rows in Table 5 Present attemPts to tune our features to CoNLL.",
        "This includes some features (the \"CoNLL feats\" in Table 5) indicating story toPic, all-caPs headline contexts, Presence in a sPorting result table, and similar idiosyncrasies.",
        "in addition, we also used features based on distributional similarity word lists (DS in the table) Provided with the Stanford ner Package.",
        "While these feature engineering efforts Proved effective, what we found surPrised us.",
        "As Table 5 shows, the CoNLL features do substantially raise baseline Performance, with the full set of new features Producing a baseline (F=86.6) that outPerforms Previously Published baselines by over a Point of F score.",
        "in keePing with our observations for the MUC-annotated text, we would then have exPected to see a comParable increase in the Performance of disPlaced features, i.e., a jumP in error reduction relative to the baseline.",
        "instead, we found just the reverse.",
        "Whereas disPlacement accounts for a 1.5 Point gain in F (Ae=9.6%) with the muc baseline features, with the beter CoNLL features, the gain due to disPlacement falls to 0.82 Points of F (Ae=6.",
        "1%).",
        "While the final result with disPlacement (F=87.39) slightly edges out the Previous high water mark of F=87.35 (Krishnan and Manning, 2005), the Pattern is Puzzling and not in keePing with our seven other data sets.",
        "One Possible exPlanations lies again with the CoNLL standard.",
        "The standard calls exPlicitly for inconsistent annotation of the same entity when used in different contexts.",
        "Along with Place names being called misc in hyPhenated contexts (noted above), some Places must be called org when used to refer to sPorts teams - excePt in results tables, where they are sometimes LOC.",
        "Such inconsistencies subvert the notion of long-distance dePendencies by making these dePendencies contradictory, thereby reducing the Potential value of disPlacement as a means for imProving Performance."
      ]
    },
    {
      "heading": "7. Conclusions",
      "text": [
        "Earlier in this PaPer, we introduced the notion of long-distance dePendencies through their original codification in the context of Phrase-structure grammars.",
        "By an interesting historical twist, the original solution to these grammatical longdistance effects, known as gaP threading (Pereira, 1981), involved what is essentially a feature-coPying oPeration, namely unification of constituent features.",
        "it is gratifying to note that the method Presented here has illustrious Predecessors.",
        "Regarding the Particular task of interest here, entity extraction, this PaPer conclusively shows that a simPle feature-coPying method Provides an effective method for caPturing long-distance dePendencies between names.",
        "For the muc-6 task, in Particular, this error reduction is enough to lift a middle-of-the-Pack Performance from our baseline crf to a level that would have Placed it among the handful of toP Performers at the muc-6 evaluation.",
        "As noted, the method is also substantially more manageable than earlier aPProaches.",
        "it avoids the intractability of graPhical models and also avoids the aPProximations required by methods that rely on these models.",
        "it also adds only minimal Processing time at training and run times.",
        "This Provides a Practical alternative to the method of Krishnan and Manning, who require twelve seParate training runs to create their models, and further require a time-consuming runtime Process to mediate between their first and second stage CRFs.",
        "We intend to take this work in two directions.",
        "First, we would like to get to the bottom of why the method did not do better with the CoNLL and mnet tasks.",
        "As noted earlier, our hyPothesis is that we would exPect greater exPloitation of long-distance dePendencies if we first imProved the Performance of the baseline crf, esPecially by imProving the acuity of task-related features.",
        "While it is not a key interest of ours to achieve best-in-class Performance on historical evaluations, it is the case that we seek a better understanding of the range of aPPlication of the feature coPying method.",
        "Another direction of interest is to consider other Problems that exhibit long-distance dePendencies that might be addressed by feature coPying.",
        "Word sense disambiguation is one such case, esPecially given Yarowsky's maxim regarding one sense Per discourse, a consistency notion that seems tailor-made for treatment as long-distance dePendencies (Yarowsky, 1995).",
        "Likewise, we are curious about the aPPlicability of the method to reference resolution, another key task with long-distance effects.",
        "Meanwhile, we believe that this method Provides a Practical aPProach for caPturing longdistance effects in one of the most Practical and useful aPPlication of human language technologies, entity extraction."
      ]
    }
  ]
}
