{
  "info": {
    "authors": [
      "Brian Roark",
      "Asaf Bachrach",
      "Carlos Cardenas",
      "Christophe Pallier"
    ],
    "book": "EMNLP",
    "id": "acl-D09-1034",
    "title": "Deriving lexical and syntactic expectation-based measures for psycholinguistic modeling via incremental top-down parsing",
    "url": "https://aclweb.org/anthology/D09-1034",
    "year": 2009
  },
  "references": [
    "acl-C00-1052",
    "acl-J01-2004",
    "acl-J91-3004",
    "acl-J93-2004",
    "acl-J95-2002",
    "acl-N01-1021",
    "acl-N03-1014",
    "acl-P04-1015",
    "acl-P05-1025",
    "acl-P08-2002",
    "acl-P98-1035",
    "acl-W07-1001",
    "acl-W08-0626"
  ],
  "sections": [
    {
      "text": [
        "Brian Roark* Asaf Bachrach* Carlos Cardenas and Christophe Pallier*",
        "^Center for Spoken Language Understanding, Oregon Health & Science University t INSERM-CEA Cognitive Neuroimaging Unit, Gif sur Yvette, France °MIT",
        "roark@cslu.ogi.edu asafbac@gmail.com cardenas@mit.edu christophe@pallier.org",
        "A number of recent publications have made use of the incremental output of stochastic parsers to derive measures of high utility for psycholinguistic modeling, following the work of Hale (2001; 2003; 2006).",
        "In this paper, we present novel methods for calculating separate lexical and syntactic surprisal measures from a single incremental parser using a lexical-ized PCFG.",
        "We also present an approximation to entropy measures that would otherwise be intractable to calculate for a grammar of that size.",
        "Empirical results demonstrate the utility of our methods in predicting human reading times."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Assessment of linguistic complexity has played an important role in psycholinguistics and neu-rolinguistics for a long time, from the use of mean length of utterance and related scores in child language development (Klee and Fitzgerald, 1985), to complexity scores related to reading difficulty in human sentence processing studies (Yn-gve, 1960; Frazier, 1985; Gibson, 1998).",
        "Operationally, such linguistic complexity scores are derived via deterministic manual (human) annotation and scoring algorithms of language samples.",
        "Natural language processing has been employed to automate the extraction of such measures (Sagae et al., 2005; Roark et al., 2007), which can have high utility in terms of reduction of time required to annotate and score samples.",
        "More interestingly, however, novel data driven methods are being increasingly employed in this sphere, yielding language sample characterizations that require NLP in their derivation.",
        "For example, scores derived from variously estimated language models have been used to evaluate and classify language samples associated with neurodevelopmental or neurodegenerative disorders (Roark et al., 2007; Solorio and Liu, 2008; Gabani et al., 2009), as well as within general studies of human sentence processing (Hale, 2001; 2003; 2006).",
        "Lhese scores cannot feasibly be derived by hand, but rather rely on large-scale statistical models and structured inference algorithms to be derived.",
        "Lhis is quickly becoming an important application of NLP, making possible new methods in the study of human language processing in both typical and impaired populations.",
        "Lhe use of broad-coverage parsing for psycholinguistic modeling has become very popular recently.",
        "Hale (2001) suggested a measure (surprisal) derived from an Earley (1970) parser using a probabilistic context-free grammar (PCFG) for psycholinguistic modeling; and in later work (Hale, 2003; 2006) he suggested an alternate parser-derived measure (entropy reduction) that may also account for some human sentence processing performance.",
        "Recent work continues to advocate surprisal in particular as a very useful measure for predicting processing difficulty (Boston et al., 2008a; Boston et al., 2008b; Dem-berg and Keller, 2008; Levy, 2008), and the measure has been derived using a variety of incremental (left-to-right) parsing strategies, including an Earley parser (Boston et al., 2008a), the Roark (2001) incremental top-down parser (Dem-berg and Keller, 2008), and an n-best version of the Nivre et al.",
        "(2007) incremental dependency parser (Boston et al., 2008a; 2008b).",
        "Deriving such measures by hand, even for a relatively limited set of stimuli, is not feasible, hence parsing plays a critical role in this developing psycholinguistic enterprise.",
        "Lhere is no single measure that can account for all of the factors influencing human sentence processing performance, and some of the most recent work on using parser-derived measures for psycholinguistic modeling has looked to try to derive multiple, complementary measures.",
        "One of",
        "Proceedings of the 2009 Conference on Empirical Methods in Natural Language Processing, pages 324 – 333, Singapore, 6-7 August 2009.",
        "©2009 ACL and AFNLP",
        "the key distinctions being looked at is syntactic versus lexical expectations (Gibson, 2006).",
        "For example, in Demberg and Keller (2008), trials were run deriving surprisal from the Roark (2001) parser under two different conditions: fully lex-icalized parsing, and fully unlexicalized parsing (to pre-terminal part-of-speech tags).",
        "Boston et al.",
        "(2008a) capture a similar distinction by making use of an unlexicalized PCFG within an Ear-ley parser and a fully lexicalized unlabeled dependency parser (Nivre et al., 2007).",
        "As Demberg and Keller (2008) point out, fully unlexicalized grammars ignore important lexico-syntactic information when deriving the \"syntactic\" expectations, such as subcategorization preferences of particular verbs, which are generally accepted to impact syntactic expectations in human sentence processing (Garnsey et al., 1997).",
        "Demberg and Keller argue, based on their results, for unlexicalized surprisal instead of lexicalized surprisal.",
        "Here we present a novel method for deriving separate syntactic and lexical surprisal measures from a fully lexicalized incremental parser, to allow for rich probabilistic grammars to be used to derive either measure, and demonstrate the utility of this method versus that of Demberg and Keller in empirical trials.",
        "The use of large-scale lexicalized grammars presents a problem for using an Earley parser to derive surprisal or for the calculation of entropy as Hale (2003; 2006) defines it, because both methods require matrix inversion of a matrix with dimensionality the size of the non-terminal set.",
        "With very large lexicalized PCFGs, the size of the nonterminal set is too large for tractable matrix inversion.",
        "The use of an incremental, beam-search parser provides a tractable approximation to both measures.",
        "Incremental top-down and left-corner parsers have been shown to effectively (and efficiently) make use of non-local features from the left-context to yield very high accuracy syntactic parses (Roark, 2001; Henderson, 2003; Collins and Roark, 2004), and we will use such rich models to derive our scores.",
        "In addition to teasing apart syntactic and lexical surprisal (defined explicitly in §3), we present an approximation to the full entropy that Hale (2003; 2006) used to define the entropy reduction hypothesis.",
        "Such an entropy measure is derived via a predictive step, advancing the parses independently of the input, as described in §3.3.",
        "We also present syntactic and lexical alternatives for this measure, and demonstrate the utility of making such a distinction for entropy as well as surprisal.",
        "The purpose of this paper is threefold.",
        "First, to present a careful and well-motivated decomposition of lexical and syntactic expectation-based measures from a given lexicalized PCFG.",
        "Second, to explicitly document methods for calculating these and other measures from a specific incremental parser.",
        "And finally, to present some empirical validation of the novel measures from real reading time trials.",
        "We modified the Roark (2001) parser to calculate the discussed measures, and the empirical results in §4 show several things, including: 1) using a fully lexicalized parser to calculate syntactic surprisal and entropy provides higher predictive utility for reading times than these measures calculated via unlexicalized parsing (as in Demberg and Keller); and 2) syntactic entropy is a useful predictor of reading time."
      ]
    },
    {
      "heading": "2. Notation and preliminaries",
      "text": [
        "A probabilistic context-free grammar (PCFG) G = (V,T, 5*, P, p) consists of a set of nonterminal variables V; a set of terminal items (words) t; a special start non-terminal 5* g V; a set of rule productions P of the form A – > a for A g V, a g (V u t)*; and a function p that assigns probabilities to each rule in P such that for any given non-terminal symbol X g V,",
        "For a given rule A – > a g P, let the function RHS return the right-hand side of the rule, i.e., RHS(A – > a) = a.",
        "Without loss of generality, we will assume that for every rule A – > a g P, one of two cases holds: either RHS(A – > a) g T or RHS (A ->■ a) g V*.",
        "That is, the right-hand side sequences consist of either (1) exactly one terminal item, or (2) zero or more non-terminals.",
        "Let W g Tn be a terminal string of length n, i.e., W = W\\... Wn and \\ W\\ = n. Let W[i,j] denote the substring beginning at word Wi and ending at word Wj of the string.",
        "Then W\\w\\ is the last word in the string, and W[l, \\W\\] is the string as a whole.",
        "Adjacent strings represent concatenation, i.e., W[l, i]W[i+l,j] = W[l,j\\.",
        "Thus W[l, i]w represents the string where Wi+\\ = w.",
        "We can define a \"derives\" relation (denoted =>g for a given PCFG G) as follows: ßA^ =>g ßa^ if and only if A a g P. A string W g t* is in the language of a grammar G if and only if 5* 4>g W, i.e., a sequence of one or more derivation steps yields the string from the start",
        "lrThe parser version will be made publicly available.",
        "non-terminal.",
        "A leftmost derivation begins with 5* and each derivation step replaces the leftmost non-terminal A in the yield with some a such that A – > a g P. For a leftmost derivation 5* =>g a, where a; g (F U T)*, the sequence of derivation steps that yield a can be represented as a tree, with the start symbol 5* at the root, and the \"yield\" sequence a at the leaves of the tree.",
        "A complete tree has only terminal items in the yield, i.e., a g T*; a partial tree has some non-terminal items in the yield.",
        "With a leftmost derivation, the yield a = partitions into an initial sequence of terminals ß g T* followed by a sequence of non-terminals 7 e P. For a complete derivation, 7 = e; for a partial derivation 7 g F+, i.e., one or more non-terminals.",
        "Let T(G, W[l,i])be the set of complete trees with W[l, i] as the yield of the tree, given PCFG G.",
        "A leftmost derivation D consists of a sequence of \\D\\ steps.",
        "Let Di represent the i'h step in the derivation D, and D[i,j] represent the subsequence of steps in D beginning with Di and ending with Dj.",
        "Note that D\\D\\ is the last step in the derivation, and D[l, \\D\\] is the derivation as a whole.",
        "Each step Di in the derivation is a rule in G, i.e., Dig P for all %.",
        "The probability of the derivation and the corresponding tree is:",
        "Let V(G, W[l, i]) be the set of all possible leftmost derivations D (with respect to G) such that RHS(-Dp|) = Wi.",
        "These are the set of partial leftmost derivations whose last step used a production with terminal Wi on the right-hand side.",
        "The prefix probability of W[l, i] with respect to G is",
        "From this prefix probability, we can calculate the conditional probability of each word w g T in the terminal vocabulary, given the preceding sequence W[l, i] as follows:",
        "PrefixProbG(W[l,",
        "T,w,eT PreflxProbc (W[l,i]w>) PrefixProbG(W[M]w) PrefixProbG(W[M])",
        "This, in fact, is precisely the conditional probability that is used for language modeling for such applications as speech recognition and machine translation, which was the motivation for various syntactic language modeling approaches (Jelinek and Lafferty, 1991; Stolcke, 1995; Chelba and Jelinek, 1998; Roark, 2001).",
        "As with language modeling, it is important to model the end of the string as well, usually with an explicit end symbol, e.g., </s>.",
        "For a string W[l, i], we can calculate its prefix probability as shown above.",
        "To calculate its complete probability, we must sum the probabilities over the set of complete trees T(G, W[l, i}).",
        "In such a way, we can calculate the conditional probability of ending the string with </s> given W[l, i] as follows:",
        "PrefixProbG(^[M])",
        "In this section, we review relevant details of the Roark (2001) incremental top-down parser, as configured for use here.",
        "As presented in Roark (2004), the probabilities in the PCFG are smoothed so that the parser is guaranteed not to fail due to garden pathing, despite following a beam search strategy.",
        "Hence there is always a nonzero prefix probability as defined in Eq.",
        "2.",
        "The parser follows a top-down leftmost derivation strategy.",
        "The grammar is factored so that every production has either a single terminal item on the right-hand side or is of the form A – > B A-B, where A,B g V and the factored A-B category can expand to any sequence of children categories of A that can follow B.",
        "This factorization of nary productions continues to miliary factored productions, i.e., the end of the original production A – > Bi... Bra is signaled with an empty production A-Bi-... Bra – > e.",
        "The parser maintains a set of possible connected derivations, weighted via the PCFG.",
        "It uses a beam search, whereby the highest scoring derivations are worked on first, and derivations that fall outside of the beam are discarded.",
        "The reader is referred to Roark (2001; 2004) for specifics about the beam search.",
        "The model conditions the probability of each production on features extracted from the partial tree, including non-local node labels such as parents, grandparents and siblings from the left-context, as well as c-commanding lexical items.",
        "Hence this is a lexicalized grammar, though the incremental nature precludes a general head-first strategy, rather one that looks to the left-context for c-commanding lexical items.",
        "To avoid some of the early prediction of structure, the version of the Roark parser that we used",
        "PrefixProbG(^[M]) performs an additional grammar transformation beyond the simple factorization already described - a selective left-corner transform of left-recursive productions (Johnson and Roark, 2000).",
        "In the transformed structure, slash categories are used to avoid predicting left-recursive structure until some explicit indication of modification is present, e.g., a preposition.",
        "The final step in parsing, following the last word in the string, is to \"complete\" all non-terminals in the yield of the tree.",
        "All of these open nonterminals are composite factored categories, such as S-NP-VP, which are \"completed\" by rewriting to e. The probability of these e productions is what allows for the calculation of the conditional probability of ending the string, shown in Eq.",
        "4.",
        "One final note about the size of the non-terminal set and the intractability of exact inference for such a scenario.",
        "The non-terminal set not only includes the original atomic non-terminals of the grammar, but also any categories created by grammar factorization (S-NP) or the left-corner transform (NP/NP).",
        "Additionally, however, to remain context-free, the non-terminal set must include categories that incorporate non-local features used by the statistical model into their label, including parents, grandparents and sibling categories in the left-context, as well as c-commanding lexical heads.",
        "These non-local features must be made local by encoding them in the non-terminal labels, leading to a very large non-terminal set and intractable exact inference.",
        "Heavy smoothing is required when estimating the resulting PCFG.",
        "The benefit of such a non-terminal set is a rich model, which enables a more peaked statistical distribution around high quality syntactic structures and thus more effective pruning of the search space.",
        "The fully connected left-context produced by top-down derivation strategies provides very rich features for the stochastic parsing models.",
        "See Roark (2001; 2004) for discussion of these issues.",
        "We now turn to measures that can be derived from the parser which may be of use for psycholinguistic modeling."
      ]
    },
    {
      "heading": "3. Parser and grammar derived measures 3.1 Surprisal",
      "text": [
        "The surprisal at word Wi is the negative log probability of Wi given the preceding words.",
        "Using prefix probabilities, this can be calculated as:",
        "Substituting equation 2 into this, we get",
        "If we are using a beam-search parser, some of the derivations are pruned away.",
        "Let B(G, W[l, i}) ç V(G, W[l, i]) be the set of derivations in the beam.",
        "Then the surprisal can be approximated as",
        "Any pruning in the beam search will result in a deficient probability distribution, i.e., a distribution that sums to less than 1.",
        "Roark's thesis (2001) showed that the amount of probability mass lost for this particular approach is very low, hence this provides a very tight bound on the actual surprisal given the model.",
        "High surprisal scores result when the prefix probability at word Wi is low relative to the prefix probability at word Wi-\\.",
        "Sometimes this is due to the identity of Wi, i.e., it is a surprising word given the context.",
        "Other times, it may not be the lexical identity of the word so much as the syntactic structure that must be created to integrate the word into the derivations.",
        "One would like to tease surprisal apart into \"syntactic surprisal\" versus \"lexical surprisal\", which would capture this intuition of the lexical versus syntactic dimensions to the score.",
        "Our solution to this has the beneficial property of producing two scores whose sum equals the original surprisal score.",
        "The original surprisal score is calculated via sets of partial derivations at the point when each word Wi is integrated into the syntactic structure, V(G, W[l, i]).",
        "We then calculate the ratio from point to point in sequence.",
        "To tease apart the lexical and syntactic surprisal, we will consider sets of partial derivations immediately before each word Wi is integrated into the syntactic structure, i.e., D[l,\\D\\-l] îoxD g V(G,W[l,i\\).",
        "Recall that the last derivation move for every derivation in the set is from the POS-tag to the lexical item.",
        "Hence the sequence of derivation moves that excludes the last one includes all structure except the word Wi.",
        "Then the syntactic surprisal is calculated as:",
        "and the lexical surprisal is calculated as:",
        "Note that the numerator of SynSciWi) is the denominator of LexSciWi), hence they sum to form total surprisal Sc(Wi).",
        "As with total surprisal, these measures can be defined either for the full set V(G, W[l, i}) or for a pruned beam of derivations B{G, W[l, i}) ç V(G, W[l, i}).",
        "Finally, we replicated the Demberg and Keller (2008) \"unlexicalized\" surprisal by replacing every lexical item in the training corpus with its POS-tag, and then parsing the POS-tags of the language samples rather than the words.",
        "This differs from our syntactic surprisal by having no lexical conditioning events for rule probabilities, and by having no ambiguity about the POS-tag of the lexical items in the string.",
        "We will refer to the resulting surprisal measure as \"POS surprisal\" to distinguish it from our syntactic surprisal measure.",
        "Entropy scores of the sort advocated by Hale (2003; 2006) involve calculation over the set of complete derivations consistent with the set of partial derivations.",
        "Hale performs this calculation efficiently via matrix inversion, which explains the use of relatively small-scale grammars with tractably sized non-terminal sets.",
        "Such methods are not tractable for the kinds of richly conditioned, large-scale PCFGs that we advocate using here.",
        "At each word in the string, the Roark (2001) top-down parser provides access to the weighted set of partial analyses in the beam; the set of complete derivations consistent with these is not immediately accessible, hence additional work is required to calculate such measures.",
        "Let H(V) be the entropy over a set of derivations V, calculated as follows:",
        "If the set of derivations V = V(G,W[l,i]) is a set of partial derivations for string then H(V) is a measure of uncertainty over the partial derivations, i.e., the uncertainty regarding the correct analysis of what has already been processed.",
        "This can be calculated directly from the existing parser operations.",
        "If the set of derivations are the complete derivations consistent with the set of partial derivations - complete derivations that could occur over the set of possible continuations of the string - then this is a measure of the uncertainty about what is yet to come.",
        "We would like measures that can capture this distinction between (a) uncertainty of what has already been processed (\"current ambiguity\") versus (b) uncertainty of what is yet to be processed (\"predictive entropy\").",
        "In addition, as with surprisal, we would like to tease apart the syntactic uncertainty versus lexical uncertainty.",
        "To calculate the predictive entropy after word sequence we modify the parser as follows: the parser extends the set of partial derivations to include all possible next words (the entire vocabulary plus </s>), and calculates the entropy over that set.",
        "This measure is calculated from just one additional word beyond the current word, and hence is an approximation to Hale's conditional entropy of grammatical continuations, which is over complete derivations.",
        "We will denote this as HG(W[1, i]) and calculate it as follows:",
        "This is performing a predictive step that the baseline parser does not perform, extending the parses to all possible next words.",
        "Unlike surprisal, entropy does not decompose straightforwardly into syntactic and lexical components that sum to the original composite measure.",
        "To tease apart entropy due to syntactic uncertainty versus that due to lexical uncertainty, we can define the set of derivations up to the preterminal (POS-tag) non-terminals as follows.",
        "Let S(V) = {D[l,\\D\\-1] : D g V}, i.e., the set of derivations achieved by removing the last step of all derivations in V. Then we can calculate a \"syntactic\" Hq as follows:",
        "Finally, \"lexical\" HG is defined in terms of the conditional probabilities derived from prefix probabilities as defined in Eq.",
        "3.",
        "As a practical matter, these values are calculated within the Roark parser as follows.",
        "A \"dummy\" word is created that can be assigned every POS-tag, and the parser extends from the current state to this dummy word.",
        "(The beam threshold is greatly expanded to allow for many possible extensions.)",
        "Then every word in the vocabulary is substituted for the word, and the appropriate probabilities calculated over the beam.",
        "Finally, the actual next word is substituted, the beam threshold is reduced to the actual working threshold, and the requisite number of analyses are advanced to continue parsing the string.",
        "This represents a significant amount of additional work for the parser - particularly for vocabulary sizes that we currently use, on the order of tens of thousands of words.",
        "As with surprisal, we can calculate an \"unlexicalized\" version of the measure by training and parsing just to POS-tags.",
        "We will refer to this sort of entropy as \"POS entropy\"."
      ]
    },
    {
      "heading": "4. Empirical validation",
      "text": [
        "In order to test the psycholinguistic relevance of the different measures produced by the parser, we conducted a word by word reading experiment.",
        "23 native speakers of English read 4 short texts (mean length: 883.5 words, 49.25 sentences).",
        "The texts were the written versions of narratives used in a parallel fMRI experiment making use of the same parser derived measures and whose results will be published in a different paper (Bachrach et al., 2009).",
        "The narratives contained a high density of syntactically complex structures (in the form of sentential embeddings, relative clauses and other non-local dependencies) but were constructed so as to appear highly natural.",
        "The modified version of the Roark parser, trained on the Brown Corpus section of the Penn Treebank (Marcus et al., 1993), was used to parse the different narratives and produce the word by word measures.",
        "Each narrative was presented line by line (certain sentences required more than one line) on a computer screen (Dell Optiplex 755 running Windows XP Professional) using Linger 2.88.",
        "Each line contained 11.5 words on average.",
        "Each word would appear in its relative position on the screen.",
        "The subject would then be required to push a keyboard button to advance to the next word.",
        "The original word would then disappear and the following word appear in the subsequent position on the screen.",
        "After certain sentences a comprehension question would appear on the screen (10 per narrative).",
        "This was done in order to encourage subjects to pay attention and to provide data for a post-hoc evaluation of comprehension.",
        "After each narrative, subjects were instructed to take a short break (2 minutes on average).",
        "The log (base 10) of the reaction times were analyzed using a linear mixed effects regression analysis implemented in the language R (Bates et al., 2008).",
        "Reaction times longer than 1500 ms and shorter than 150 ms (raw) were excluded from the analysis (4.8% of total data).",
        "Since button press latencies inferior to 150 ms must have been planned prior to the presentation of the word, we considered that they could not reflect stimulus driven effects.",
        "Data from the first and last words on each line were discarded.",
        "The combined data from the 4 narratives was first modeled using a model which included order of word in the narrative, word length, parser-derived lexical surprisal, unigram frequency, bi-gram probability, syntactic surprisal, lexical entropy, syntactic entropy and mean number of parser derivation steps as numeric regressors.",
        "We also included the unlexicalized POS variants of syntactic surprisal and entropy, along the lines of Demberg and Keller (2008), as detailed in § 3.",
        "Table 1 presents the correlations between these mean-centered measures.",
        "In addition, we modeled word class (open/closed) as a categorical factor in order to assess interaction between class and the variables of interest, since such an interaction has been observed in the case of frequency (Bradley, 1983).",
        "Finally, the random effect part of the model included intercepts for subjects, words and sentences.",
        "We report significant effects at the threshold p < .05.",
        "Given the presence of significant interactions between lexical class (open/closed) and a number of the variables of interests, we decided to split the data set into open and closed class words and model these separately (linear mixed effects with the same numeric variables as in the full model).",
        "In order to evaluate the usefulness of splitting total surprisal into lexical and syntactic components we compared, using a likelihood ratio test, a model where lexical and syntactic surprisal are modeled as distinct regressors to a model where a single regressor equal to their sum (total surprisal)",
        "Table 1: Correlations between (mean-centered) predictors.",
        "Note that unigram frequencies were represented as logs, other scores as negative logs, hence the sign of the correlations.",
        "was included.",
        "If the larger model provides a significantly better fit than the smaller model, this provides evidence that distinguishing between lexical and syntactic contributions to surprisal is relevant.",
        "Since total entropy is not a sum of syntactic and lexical entropy, an analogous test would not be valid in that case.",
        "All subjects successfully answered the comprehension questions (92.8% correct responses, S.D.=5.1).",
        "In the full model, we observed significant main effects of word class as well as of lexical surprisal, bigram probability, unigram frequency, syntactic entropy, POS entropy and of order in the narrative.",
        "Syntactic surprisal, lexical entropy and number of steps had no significant effect.",
        "Word length also had no significant main effect but interacted significantly with word class (open/closed).",
        "Word class also interacted significantly with lexical surprisal, unigram frequency and syntactic surprisal.",
        "The presence of these interactions led us to construct models restricted to open and closed class items respectively.",
        "The estimated parameters are reported in Table 2.",
        "Reading time for open class words showed significant effects of unigram frequency, syntactic surprisal, syntactic entropy, POS entropy and order within the narrative.",
        "The positive effect of length approached significance.",
        "Reading time for closed class words exhibited significant effects of lexical surprisal, bigram probability, syntactic entropy and order in the narrative.",
        "Length had a non-significant negative effect, thus explaining the interaction observed in the full model.",
        "The models with separate lexical and syntactic surprisal performed better than models including combined surprisal.",
        "For open class words, the Akaike's information criterion (AIC) was -54810 for the combined model and -54819 for the independent model (likelihood ratio test comparing the",
        "Table 2: Estimated effects from mixed effects models on open and closed items (stars denote significance at p<,05) two, nested, models: %(l)=10.7,p<.001).",
        "For closed class items, combined model's AIC was -61467 and full model's AIC was -61469 (likelihood ratio test: %(l)=3.54,p=0.06).",
        "Our results demonstrate the relevance of modeling psycholinguistic processes using an incremental probabilistic parser, and the utility of the novel measures presented here.",
        "Of particular interest are: the significant effects of our syntactic entropy measure; the independent contributions of lexical surprisal, bigram probability and unigram frequency; and the differences between the predictions of the lexicalized parsing model and the unlexicalized (POS) parsing model.",
        "The effect of entropy, or uncertainty regarding the upcoming input independent of the surprise of that input, has been observed in non-linguistic tasks (Hyman, 1953; Bestmann et al., 2008) but to our knowledge has not been quantified before in the context of sentence processing.",
        "The usefulness of computational modeling is particularly evident in the case of entropy given the absence of any subjective procedure for its evaluation.",
        "The results argue in favor of a predictive parsing architecture (Van Berkum et al., 2005).",
        "The approach to entropy here differs from the one described in Hale (2006) in a couple of ways.",
        "First, as discussed above, the calculation procedure is different - we focus on extending the derivations with just one word, rather than to all possible complete derivations.",
        "Second, and most importantly, Hale emphasizes entropy reduction (or the gain in information, given an input, regarding the rest of the sentence) as the correlate of cognitive cost while here we are interested in the amount of entropy itself (and not the size of change).",
        "Predictor",
        "SynH",
        "LexH",
        "SynS",
        "LexS",
        "Freq",
        "Bgrm",
        "PosS",
        "PosH",
        "Step",
        "WLen",
        "Syntactic Entropy (SynH)",
        "1.00",
        "-0.26",
        "0.00",
        "0.24",
        "-0.24",
        "0.20",
        "0.02",
        "0.55",
        "-0.05",
        "0.18",
        "Lexical Entropy (LexH)",
        "-0.26",
        "1.00",
        "0.01",
        "-0.40",
        "0.43",
        "-0.38",
        "-0.03",
        "0.02",
        "0.11",
        "-0.29",
        "Syntactic Surprisal (SynS)",
        "0.00",
        "0.01",
        "1.00",
        "-0.12",
        "0.08",
        "0.18",
        "0.77",
        "0.21",
        "0.38",
        "-0.03",
        "Lexical Surprisal (LexS)",
        "0.24",
        "-0.40",
        "-0.12",
        "1.00",
        "-0.81",
        "0.87",
        "-0.10",
        "-0.20",
        "-0.35",
        "0.64",
        "Unigram Frequency (Freq)",
        "-0.24",
        "0.43",
        "0.08",
        "-0.81",
        "1.00",
        "-0.69",
        "0.02",
        "0.18",
        "0.31",
        "-0.72",
        "Bigram Probability (Bgrm)",
        "0.20",
        "-0.38",
        "0.18",
        "0.87",
        "-0.69",
        "1.00",
        "0.11",
        "-0.11",
        "-0.16",
        "0.56",
        "POS Surprisal (PosS)",
        "0.02",
        "-0.03",
        "0.77",
        "-0.10",
        "0.02",
        "0.11",
        "1.00",
        "0.22",
        "0.32",
        "0.02",
        "POS Entropy (PosH)",
        "0.55",
        "0.02",
        "0.21",
        "-0.20",
        "0.18",
        "-0.11",
        "0.22",
        "1.00",
        "0.16",
        "-0.11",
        "Derivation steps (Step)",
        "-0.05",
        "0.11",
        "0.38",
        "-0.35",
        "0.31",
        "-0.16",
        "0.32",
        "0.16",
        "1.00",
        "-0.24",
        "Word Length (WLen)",
        "0.18",
        "-0.29",
        "-0.03",
        "0.64",
        "-0.72",
        "0.56",
        "0.02",
        "-0.11",
        "-0.24",
        "1.00",
        "Estimate",
        "Std.",
        "Error",
        "t-value",
        "Open-class",
        "(Intercept)",
        "2.40 x",
        "10H",
        "-00",
        "2.39x10\"",
        "-02",
        "100.4*",
        "Lexical Surprisal",
        "-1.99X",
        "10\"",
        "-04",
        "7.28x10\"",
        "-04",
        "-0.3",
        "Word Length",
        "8.97 x",
        "10\"",
        "-04",
        "4.62x10\"",
        "-04",
        "1.9",
        "Bigram",
        "4.18x",
        "10\"",
        "-04",
        "5.27x10\"",
        "-04",
        "0.8",
        "Unigram Freq",
        "-2.43 x",
        "10\"",
        "-03",
        "1.20x10\"",
        "-03",
        "-2.0*",
        "Derivation Steps",
        "-1.17X",
        "10\"",
        "-03",
        "9.02x10\"",
        "-04",
        "-1.3",
        "Syntactic Entropy",
        "2.55 x",
        "10\"",
        "-03",
        "6.19x10\"",
        "-04",
        "4.1*",
        "Lexical Entropy",
        "3.96x",
        "10\"",
        "-04",
        "6.68x10\"",
        "-04",
        "0.6",
        "Syntactic Surprisal",
        "3.28x",
        "10\"",
        "-03",
        "9.71x10\"",
        "-04",
        "3.4*",
        "Order in narrative",
        "-1.43X",
        "10\"",
        "-05",
        "4.34x10\"",
        "-06",
        "-3.3*",
        "POS Surprisal",
        "-6.84X",
        "10\"",
        "-04",
        "8.11x10\"",
        "-04",
        "-0.8",
        "POS Entropy",
        "1.47x",
        "10\"",
        "-03",
        "6.05x10\"",
        "-04",
        "2.4*",
        "Closed-class",
        "(Intercept)",
        "2.42x",
        "10H",
        "-00",
        "2.32x10\"",
        "-02",
        "104.3*",
        "Lexical Surprisal",
        "2.02x",
        "10\"",
        "-03",
        "7.84x10\"",
        "-04",
        "2.6*",
        "Word Length",
        "-1.87X",
        "10\"",
        "-03",
        "1.13x10\"",
        "-03",
        "-1.7",
        "Bigram",
        "1.19x",
        "10\"",
        "-03",
        "4.94x10\"",
        "-04",
        "2.4*",
        "Unigram Freq",
        "1.69x",
        "10\"",
        "-03",
        "2.67x10\"",
        "-03",
        "0.6",
        "Derivation Steps",
        "3.01 x",
        "10\"",
        "-04",
        "5.09x10\"",
        "-04",
        "0.6",
        "Syntactic Entropy",
        "3.15x",
        "10\"",
        "-03",
        "5.05x10\"",
        "-04",
        "6.2*",
        "Lexical Entropy",
        "1.83 x",
        "10\"",
        "-04",
        "8.63x10\"",
        "-04",
        "0.2",
        "Syntactic Surprisal",
        "3.00x",
        "10\"",
        "-04",
        "8.35x10\"",
        "-04",
        "0.4",
        "Order in narrative",
        "-1.33X",
        "10\"",
        "-05",
        "3.99x10\"",
        "-06",
        "-3.3*",
        "POS Surprisal",
        "-6.46 x",
        "10\"",
        "-04",
        "6.81x10\"",
        "-04",
        "-0.9",
        "POS Entropy",
        "6.63 x",
        "10\"",
        "-04",
        "5.04x10\"",
        "-04",
        "1.3",
        "Interestingly, we observed only an effect of syntactic entropy, not lexical entropy.",
        "Recent ERP work has demonstrated that subjects do form specific lexical predictions in the context of sentence processing (Van Berkum et al., 2005; DeLong et al., 2005) and so we suspect that the absence of lexical entropy effect might be partly due to sparse data.",
        "Lexical surprisal and entropy were calculated using the internal state of a parser trained on the relatively small Brown corpus.",
        "Lexical entropy showed no significant effect while lexical surprisal affected only closed class words.",
        "This pattern of results might be due to the sparseness of the relevant information in such a small corpus (e.g., verb/object preferences) and the relevance of extra-textual dimensions (world knowledge, contextual information) to lexical-specific prediction.",
        "Closed class words are both more frequent (and hence better sampled) and are less sensitive to world knowledge, yet are often determined by the grammatical context.",
        "Demberg and Keller (2008) made use of the same parsing architecture used here to compute a syntactic surprisal measure, but used an unlexicalized parser (down to POS-tags rather than words) for this score.",
        "Their \"lexicalized\" surprisal is equivalent to our total surprisal (lexical surprisal + syntactic surprisal), while their POS surprisal is derived from a completely different model.",
        "In contrast, our approach achieves lexical and syntactic measures from the same model.",
        "In order to evaluate the difference between the two approaches we added unlexicalized POS surprisal calculated along the lines of that paper to our model, along with an unlexicalized POS entropy from the same model.",
        "We found no effect of unlexicalized POS surprisal and a significant (but relatively small) effect of unlexicalized POS entropy.",
        "While syntactic surprisal was correlated with POS surprisal (see Table 1) and syntactic entropy correlated with POS entropy, the fact that our syntactic measures still had a significant effect suggests that lexical information contributes towards the formation of syntactic expectations.",
        "While the effect of surprisal calculated by an incremental top down parser has been already demonstrated (Demberg and Keller, 2008), our results argue for a distinction between the effect of lexical surprisal and that of syntactic surprisal without requiring unlexicalized parsing of the sort that Demberg and Keller advocate.",
        "It is important to keep in mind that this distinction between types of prediction (and as a consequence, prediction error) is not equivalent to the one drawn in the traditional cognitive science modularity debate, which has focused on the source of these predictions.",
        "We found a positive effect of syntactic surprisal in the case of open class words.",
        "The absence of an effect for closed class words remains to be explained.",
        "We quantified word specific surprisal using 3 sources: the parser's internal state (lexical surprisal); probability given the preceding word (negative log bigram probability); and the unigram frequency of the word in a large corpus.",
        "As can be observed in Table 1, these three measures are highly correlated.",
        "This is the consequence of the smoothing in the estimation procedure but also relates to a more general fact about language use: overall, more frequent words are also words more expected to appear in a specific context (Anderson and Schooler, 1991).",
        "Despite these strong correlations, the three measures produced independent effects.",
        "Unigram frequency had a significant effect for open class words while bigram probability and lexical surprisal each had an effect on reading time of closed class items.",
        "Bigram probability has been often found to affect reading time using eye movement measures.",
        "This is the first study to demonstrate an additional effect of contextual surprisal given the preceding sentential context (lexical surprisal).",
        "Demberg and Keller found no effect for surprisal once bigram and unigram probabilities were included in the model but, importantly, they did not distinguish lexical and syntactic surprisal, rather \"lexicalized\" and \"unlexicalized\" surprisal."
      ]
    },
    {
      "heading": "5. Summary",
      "text": [
        "We have presented novel methods for teasing apart syntactic and lexical surprisal from a fully lexicalized parser, as well as for extending the operation of a predictive parser to capture novel entropy measures that are also shown to be relevant to psycholinguistic modeling.",
        "Such automatic methods provide psycholinguistically relevant measures that are intractable to calculate by hand.",
        "The empirical validation presented here demonstrated that the new measures - particularly syntactic entropy and syntactic surprisal - have high utility for modeling human reading time data.",
        "Our approach to calculating syntactic surprisal, based on fully lexicalized parsing, provided significant effects, while the POS-tag based (unlexicalized) surprisal - of the sort used in Boston et al.",
        "(2008a) and Demberg and Keller (2008) - did not provide a significant effect in our trials.",
        "Further, we showed an effect of lexical surprisal for closed class words even when combined with unigram and bigram probabilities in the same model.",
        "This work contributes to the important, developing enterprise of leveraging data-driven NLP approaches to derive new measures of high utility for psycholinguistic and neuropsychological studies."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "Thanks to Michael Collins, John Hale and Shravan Vasishth for valuable discussions about this work.",
        "This research was supported in part by NSF Grant #BCS-0826654.",
        "Any opinions, findings, conclusions or recommendations expressed in this publication are those of the authors and do not necessarily reflect the views of the NSF."
      ]
    }
  ]
}
