{
  "info": {
    "authors": [
      "Michael Bloodgood",
      "K. Vijay-Shanker"
    ],
    "book": "HLT-NAACL, Companion Volume: Short Papers",
    "id": "acl-N09-2035",
    "title": "Taking into Account the Differences between Actively and Passively Acquired Data: The Case of Active Learning with Support Vector Machines for Imbalanced Datasets",
    "url": "https://aclweb.org/anthology/N09-2035",
    "year": 2009
  },
  "references": [
    "acl-D07-1082",
    "acl-E06-1051",
    "acl-W09-1107"
  ],
  "sections": [
    {
      "text": [
        "Taking into Account the Differences between Actively and Passively Acquired Data: The Case of Active Learning with Support Vector Machines",
        "for Imbalanced Datasets",
        "Michael Bloodgood*",
        "Actively sampled data can have very different characteristics than passively sampled data.",
        "Therefore, it's promising to investigate using different inference procedures during AL than are used during passive learning (PL).",
        "This general idea is explored in detail for the focused case of AL with cost-weighted SVMs for imbalanced data, a situation that arises for many HLT tasks.",
        "The key idea behind the proposed InitPA method for addressing imbalance is to base cost models during AL on an estimate of overall corpus imbalance computed via a small unbiased sample rather than the imbalance in the labeled training data, which is the leading method used during PL."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Recently there has been considerable interest in using active learning (AL) to reduce HLT annotation burdens.",
        "Actively sampled data can have different characteristics than passively sampled data and therefore, this paper proposes modifying algorithms used to infer models during AL.",
        "Since most AL research assumes the same learning algorithms will be used during AL as during passive learning (PL), this paper opens up a new thread of AL research that accounts for the differences between passively and actively sampled data.",
        "The specific case focused on in this paper is that of AL with SVMs (AL-SVM) for imbalanced",
        "* This research was conducted while the first author was a PhD student at the University of Delaware.",
        "datasets.",
        "Collectively, the factors: interest in AL, widespread class imbalance for many HLT tasks, interest in using SVMs, and PL research showing that SVM performance can be improved substantially by addressing imbalance, indicate the importance ofthe case of AL with SVMs with imbalanced data.",
        "Extensive PL research has shown that learning algorithms' performance degrades for imbalanced datasets and techniques have been developed that prevent this degradation.",
        "However, to date, relatively little work has addressed imbalance during AL (see Section 2).",
        "In contrast to previous work, this paper advocates that the AL scenario brings out the need to modify PL approaches to dealing with imbalance.",
        "In particular, a new method is developed for cost-weighted SVMs that estimates a cost model based on overall corpus imbalance rather than the imbalance in the so far labeled training data.",
        "Section 2 discusses related work, Section 3 discusses the experimental setup, Section 4 presents the new method called InitPA, Section 5 evaluates InitPA, and Section 6 concludes."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "A problem with imbalanced data is that the class boundary (hyperplane) learned by SVMs can be too close to the positive (pos) examples and then recall suffers.",
        "Many approaches have been presented for overcoming this problem in the PL setting.",
        "Many require substantially longer training times or extra training data to tune parameters and thus are not ideal for use during AL.",
        "Cost-weighted SVMs (cwSVMs), on the other hand, are a promising approach for use with AL: they impose no extra training overhead.",
        "cwSVMs introduce unequal cost factors so the optimization problem solved becomes: Minimize:",
        "Subject to:",
        "where (w, b) represents the learned hyperplane, xkis the feature vector for example k, yk is the label for example k, £k = max(0,1 – yk(wk • xk + b)) is the slack variable for example k, and C+ and C – are user-defined cost factors.",
        "The most important part for this paper are the cost factors C+ and c_.",
        "The ratio ^ quantifies the importance of reducing slack error on pos train examples relative to reducing slack error on negative (neg) train examples.",
        "The value of the ratio is crucial for balancing the precision recall tradeoff well.",
        "tive heuristic.",
        "Section 4 explores using this heuristic during AL and explains a modified heuristic that could work better during AL.",
        "(Ertekin et al., 2007) propose using the balancing of training data that occurs as a result of AL-SVM to handle imbalance and do not use any further measures to address imbalance.",
        "(Zhu and Hovy, 2007) used resampling to address imbalance and based the amount of resampling, which is the analog of our cost model, on the amount of imbalance in the current set of labeled train data, as PL approaches do.",
        "In contrast, the InitPA approach in Section 4 bases its cost models on overall (unlabeled) corpus imbalance rather than the amount of imbalance in the current set of labeled data."
      ]
    },
    {
      "heading": "3. Experimental Setup",
      "text": [
        "We use relation extraction (RE) and text classification (TC) datasets and SVMHgh* (Joachims, 1999) for training the SVMs.",
        "For RE, we use Aimed, previously used to train protein interaction extraction systems ((Giuliano et al., 2006)).",
        "As in previous work, we cast RE as a binary classification task (14.94% of the examples in Aimed are positive).",
        "We use the Kgc kernel from (Giuliano et al., 2006), one of the highest-performing systems on AImed to date and perform 10-fold cross validation.",
        "For TC, we use the Reuters-21578 ModApte split.",
        "Since a document may belong to more than one category, each category is treated as a separate binary classification problem, as in (Joachims, 1998).",
        "As in (Joachims, 1998), we use the ten largest categories, which have imbalances ranging from 1.88% to 29.96%."
      ]
    },
    {
      "heading": "4. AL-SVM Methods for Addressing Class Imbalance",
      "text": [
        "The key question when using cwSVMs is how to set the ratio Increasing it will typically shift the learned hyperplane so recall is increased and precision is decreased (see Figure 1 for a hypothetical example).",
        "Let PA = §^.",
        "How should the PA be set during AL-SVM?",
        "We propose two approaches: one sets the PA based on the level of imbalance in the labeled training data and one aims to set the PA based on an estimate of overall corpus imbalance, which can drastically differ from the level of imbalance in actively sampled training data.",
        "The first method is called CurrentPA, depicted in Figure 2.",
        "Note that in step 0 of the loop, PA is set based on the distribution of positive and negative examples in the current set of labeled data.",
        "However, observe that during AL the ratio TT – biiii-s – in the current set ot la# pos labeled examples beled data gets skewed from the ratio in the entire L = small initial set of labeled data U = large pool of unlabeled data Loop until stopping criterion is met:",
        "where f is the function we desire to learn.",
        "1.",
        "Train an SVM with C+ and C – set such that ^ = PA and obtain hyperplane h .",
        "2. batch – select k points from U that are closest to h and request their labels.",
        "3.",
        "U = U – batch .",
        "corpus because AL systematically selects the examples that are closest to the current model's hyperplane and this tends to select more positive examples than random selection would select (see also (Ertekin et al., 2007)).",
        "Empirical evidence of this distribution skew is illustrated in Figure 3.",
        "The trend toward balanced datasets during AL could mislead and cause us to underestimate the PA.",
        "Therefore, our next algorithm aims to set the PA based on the ratio of neg to pos instances in the entire corpus.",
        "However, since we don't have labels for the entire corpus, we don't know this ratio.",
        "But by using a small initial sample of labeled data, we can estimate this ratio with high confidence.",
        "This estimate can then be used for setting the PA throughout the AL process.",
        "We call this method of setting the PA based on a small initial set of labeled data the InitPA method.",
        "It is like CurrentPA except we move Step 0 to be executed one time before the loop and then use that same PA value on each iteration of the AL loop.",
        "To guide what size to make the initial set of labeled data, one can determine the sample size required to estimate the proportion of positives in a finite population to within sampling error e with a desired level of confidence using standard statistical techniques found in many college-level statistics references such as (Berenson et al., 1988).",
        "For example, carrying out the computations on the AImed dataset shows that a size of 100 enables us to be 95% confident that our proportion estimate is within 0.0739 of the true proportion.",
        "In our experiments, we used an initial labeled set of size 100."
      ]
    },
    {
      "heading": "5. Evaluation",
      "text": [
        "In addition to InitPA and CurrentPA, we also implemented the methods from (Ertekin et al., 2007; Zhu and Hovy, 2007).",
        "We implemented oversampling by duplicating points and by BootOS (Zhu and Hovy, 2007).",
        "To avoid cluttering the graphs, we only show the highest-performing oversampling variant, which was by duplicating points.",
        "Learning curves are presented in Figures 4 and 5.",
        "Note InitPA is the highest-performing method for all datasets, especially in the practically important area of where the learning curves begin to plateau.",
        "This area is important because this is around where we would want to stop AL (Bloodgood and Vijay-",
        "Shanker, 2009).",
        "Observe that the gains of InitPA over CurrentPA are smaller for Reuters.",
        "For some Reuters categories, InitPA and CurrentPA have nearly identical performance.",
        "Applying the models learned by Cur-rentPA at each round of AL on the data used to train the model reveals that the recall on the training data is nearly 100% for those categories where InitPA/CurrentPA perform similarly.",
        "Increasing the relative penalty for slack error on positive training points will not have much impact if (nearly) all of the pos train points are already classified correctly.",
        "Thus, in situations where models are already achieving nearly 100% recall on their train data, InitPA is not expected to outperform CurrentPA.",
        "The hyperplanes learned during AL-SVM serve two purposes: sampling - they govern which unla-beled points will be selected for human annotation, and predicting - when AL stops, the most recently learned hyperplane is used for classifying test data.",
        "Although all AL-SVM approaches we're aware of use the same hyperplane at each round of AL for both of these purposes, this is not required.",
        "We compared InitPA with hybrid approaches where hyperplanes trained using an InitPA cost model are used for sampling and hyperplanes trained using a Cur-rentPA cost model are used for predicting, and vice-versa, and found that InitPA performed better than both of these hybrid approaches.",
        "This indicates that the InitPA cost model yields hyperplanes that are better for both sampling and predicting."
      ]
    },
    {
      "heading": "6. Conclusions",
      "text": [
        "We've made the case for the importance of AL-SVM for imbalanced datasets and showed that the AL scenario calls for modifications to PL approaches to addressing imbalance.",
        "For AL-SVM, the key idea behind InitPA is to base cost models on an estimate of overall corpus imbalance rather than the class imbalance in the so far labeled data.",
        "The practical utility of the InitPA method was demonstrated empirically; situations where InitPA won't help that much were made clear; and analysis showed that the sources of InitPA's gains were from both better sampling and better predictive models.",
        "InitPA is an instantiation of a more general idea of not using the same inference algorithms during AL as during PL but instead modifying inference algorithms to suit esoteric characteristics of actively sampled data.",
        "This is an idea that has seen relatively little exploration and is ripe for further investigation."
      ]
    }
  ]
}
