{
  "info": {
    "authors": [
      "Halil Kilicoglu",
      "Sabine Bergler"
    ],
    "book": "Proceedings of the BioNLP 2009 Workshop Companion Volume for Shared Task",
    "id": "acl-W09-1418",
    "title": "Syntactic Dependency Based Heuristics for Biological Event Extraction",
    "url": "https://aclweb.org/anthology/W09-1418",
    "year": 2009
  },
  "references": [
    "acl-C08-1033",
    "acl-D08-1075",
    "acl-P03-1054",
    "acl-P05-1022",
    "acl-P07-1125",
    "acl-P08-1033",
    "acl-W04-3103",
    "acl-W06-3307",
    "acl-W06-3312"
  ],
  "sections": [
    {
      "text": [
        "Halil Kilicoglu and Sabine Bergler",
        "West Montreal, Canada",
        "{h_kilico,bergler}@cse.concordia.ca",
        "We explore a rule-based methodology for the BioNLP'09 Shared Task on Event Extraction, using dependency parsing as the underlying principle for extracting and characterizing events.",
        "We approach the speculation and negation detection task with the same principle.",
        "Evaluation results demonstrate the utility of this syntax-based approach and point out some shortcomings that need to be addressed in future work."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Exponential increase in the amount of genomic data necessitates sophisticated approaches to accessing knowledge in molecular biology literature, which remains the primary medium for disseminating new knowledge in molecular biology.",
        "Extracting relations and events directly from free text facilitates such access.",
        "Advances made in foundational areas, such as parsing and named entity recognition, boosts the interest in biological event extraction (Zweigenbaum et al., 2007).",
        "The BioNLP'09 Shared Task on Event Extraction illustrates this shift and is likely to inform future endeavors in the field.",
        "The difficulty of extracting biological events from scientific literature is due to several factors.",
        "First, sentences are long and often have long-range dependencies.",
        "In addition, the biological processes described are generally complex, involving multiple genes or proteins as well as other biological processes.",
        "Furthermore, biological text is rich in higher level phenomena, such as speculation and negation, which need to be dealt with for correct interpretation of the text.",
        "Despite all this complexity, however, a closer look at various biological corpora also suggests that beneath the complexity lie regularities, which may potentially be exploited using relatively simple heuristics.",
        "We participated in Task 1 and Task 3 of the Shared Task on Event Extraction.",
        "Our approach draws primarily from dependency parse representation (Mel'cuk, 1988; deMarneffe et al., 2006).",
        "This representation, with its ability to reveal long-range dependencies, is suitable for building event extraction systems.",
        "Dependencies typed with grammatical relations, in particular, benefit such applications.",
        "To detect and characterize biological events (Task 1), we constructed a dictionary of event triggers based on training corpus annotations.",
        "Syntactic dependency paths between event triggers and event participants in the training corpus served in developing a grammar for participant identification.",
        "For speculation and negation recognition (Task 3), we extended and refined our prior work in speculative language identification, which involved dependency relations as well.",
        "Our results show that dependency relations, despite their imperfections, provide a good foundation, on which accurate and reliable event extraction systems can be built and that the regularities of biological text can be adequately exploited with a limited set of syntactic patterns."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "Co-occurrence based approaches (Jenssen et al., 2001; Ding et al., 2002) to biological relation extraction provide high recall at the expense of low 2005) , have also been explored as the basis for relation extraction.",
        "In contrast to co-occurrence based methods, these more sophisticated approaches provide higher precision at the expense of lower recall.",
        "Approaches combining the strengths ofcomplemen-tary models have also been proposed (Bunescu et al., 2006) for high recall and precision.",
        "More recently, dependency parse representation has found considerable use in relation extraction, particularly in extraction of protein-protein interactions (PPI).",
        "Fundel et al.",
        "(2007) use Stanford dependency parses of Medline abstracts as the basis for rules that extract gene/protein interactions.",
        "Rinaldi et al.",
        "(2007) extract relations combining a handwritten grammar based on dependency parsing with a statistical language model.",
        "Airola et al.",
        "(2008) extract protein-protein interactions from scientific literature using supervised machine learning based on an all-dependency-paths kernel.",
        "The speculative aspect of the biomedical literature (also referred to as hedging) has been the focus of several recent studies.",
        "These studies primarily dealt with distinguishing speculative sentences from non-speculative ones.",
        "Supervised machine learning techniques mostly dominate this area of research (Light et al., 2004; Medlock and Briscoe, 2007; Szarvas, 2008).",
        "A more linguistically-based approach, relying on lexical and syntactic patterns, has been explored as well (Kilicoglu and Bergler, 2008).",
        "The scope of speculative statements is annotated in the BioScope corpus (Vincze et al., 2008); however, experiments in detecting speculation scope have yet to be reported.",
        "Recognizing whether extracted events are negated is crucial, as negation reverses the meaning of a proposition.",
        "Most of the work on negation in the biomedical domain focused on finding negated terms or concepts.",
        "Some of these systems are rule-based and rely on lexical or syntactic information (Mutalik et al., 2001; Chapman et al., 2001; Sanchez-Graillet and Poesio, 2007); while others (Averbuch et al., 2004; Goldin and Chapman, 2003) experiment with machine learning techniques.",
        "A recent study (Morante et al., 2008) focuses on learning negation scope using memory-based classifiers trained on the BioScope corpus.",
        "Our approach to Task 1 is most similar to work of Fundel et al.",
        "(2007) as it builds on dependency-based heuristics.",
        "However, we address a larger number of event classes, including regulatory events allowing participation of other events.",
        "In addition, event triggers are central to our approach, contrasting with their system and most other PPI systems that rely on finding dependency paths between entities.",
        "We extended prior work for Task 3 and obtained state of the art results."
      ]
    },
    {
      "heading": "3. Event Detection and Characterization",
      "text": [
        "As preparation for biological event extraction, we combined the provided annotations, tokenized input and dependency parses in an XML representation.",
        "Next, we determined good trigger words for event classes and scored them.",
        "Finally, we developed a dependency-based grammar for event participant identification, which drives our event extraction system.",
        "Our event detection and characterization pipeline requires XML representation of a document as input.",
        "Here, the XML representation of a document contains sentences, their offset positions and dependency parses as well as entities (Proteins) and their offset positions in addition to word information (tokens, part-of-speech tags, indexes and lemmas).",
        "We used the Stanford Lexicalized Parser (Klein and Manning, 2003) to extract word-related information, as well as for dependency parsing.",
        "After parsing the training corpus and creating an enriched document representation, we proceeded with constructing a dictionary of event triggers, drawing from training corpus annotations of triggers and making further refinements, as described below.",
        "We view event triggers essentially as predicates and thus restricted event triggers to words carrying verb, noun or adjective part-of-speech tags.",
        "Our analysis suggests that, in general, trigger words with other POS tags are tenuously annotated event triggers and in fact require more context to qualify as event triggers.",
        "In Example (1), by is annotated as trigger for a Positive-regulation event; however, it seems that the meaning of the entire prepositional phrase introduced with by contributes to trigger such an event:",
        "(1) These data suggest a general role for Tax induction of IL-1alpha gene transcription by the NF-kappaB pathway.",
        "We refined the event trigger list further through limited term expansion and filtering, based on several observations:",
        "1.",
        "The event triggers with prefixes, such as co, down and up, (e.g., coexpression, down-regulate) were expanded to include both hyphenated and non-hyphenated forms.",
        "2.",
        "For a trigger that has inflectional/derivational forms acting as triggers in the development corpus but not in the training corpus, we added these forms as event triggers.",
        "Examples include adding dimerization after dimerize and dimin-ished(adj) after diminish, among others.",
        "3.",
        "We removed several event triggers, which, we considered, required more context to qualify as event triggers for the corresponding event classes.",
        "(e.g., absence, absent, follow, lack)",
        "Finally, we did not consider multi-word event triggers.",
        "We observed that core trigger meaning generally came from a single word token (generally head of a noun phrase) in the fragment annotated as event trigger.",
        "For instance, for trigger transcriptional activation, the annotated event class is Positive-regulation, which suggests that the head activation carries the meaning in this instance (since transcriptional is an event trigger for the distinct Transcription event class).",
        "In another instance, the trigger binding activity is annotated as triggering a Binding event, indicating that the head word activity is semantically empty.",
        "We noted some exceptions to this constraint (e.g., negatively regulate, positive regulation) and dealt with them in the postprocessing step.",
        "For the remaining event triggers, we computed a \"goodness score\" via maximum likelihood estimation.",
        "For a given event class C and event trigger t, the \"goodness score\" G(t,C) then is:",
        "where w(C:t) is the number of times t occurs as a trigger for event class C and w(t) is the frequency of trigger t in the training corpus.",
        "The newly added event triggers were assigned the same scores as the trigger they are derived from.",
        "In the event extraction step, we do not consider event triggers with a score below an empirically determined threshold.",
        "To identify the event participants Theme and Cause, we developed a grammar based on the \"collapsed\" version of Stanford Parser dependency parses of sentences.",
        "Grammar development was driven by extraction and ranking of typed dependency relation paths connecting event triggers to corresponding event participants in the training data.",
        "We then analyzed these paths and implemented as rules those deemed to be both correct and sufficiently general.",
        "More than 2,000 dependency paths were extracted; however, their distribution was Zipfian, with approximately 70% of them occurring only once.",
        "We concentrated on the most frequent, therefore general, dependency paths.",
        "Unsurprisingly, the most frequent dependency path involved the dobj (direct object) dependency between verbal event triggers and Theme participants, occurring 826 times.",
        "Next was the nn (nominal modifier) dependency between nominal event triggers and their Theme participants.",
        "The most frequent dependency for Cause participants was, again unsurprisingly, nsubj (nominal subject).",
        "The ranking of dependency paths indicated that path length is inversely proportional to reliability.",
        "We implemented a total of 27 dependency path patterns.",
        "Some of these patterns specifically address deficiencies of the Stanford Parser.",
        "Prepositional phrases are often attached incorrectly, causing problems in participant identification.",
        "Consider, for example, one of the more frequent dependency paths, dobj-prep-on (direct object dependency followed by prepositional modifier headed in on), occurring between the event trigger (effect) and participant (expression, itself a sub-event trigger):",
        "(2) We have examined the effect of leukotriene B4 (LTB4), a potent lipid proinflammatory mediator, on the expression of the proto-oncogenes c-jun and c-fos.",
        "dobj(examined,effect) prep-on(examined,expression)",
        "This dependency path occurs almost exclusively with PP attachment errors involving on, leading us to stipulate a \"corrective\" dependency path, implemented for certain trigger words (e.g., effect, influence, impact in this case).",
        "Postnominal prepositional attachment heuristics detailed in Schuman and Bergler (2006) helped determine 6 such patterns.",
        "Two common verbs (require and involve) deserve special attention, as the semantic roles of their subject/object constituents differ from typical verbs.",
        "The prototypical Cause dependency, nsubj, indicates a Theme in the following sentence:",
        "(3) Regulation of interleukin-1beta transcription by Epstein-Barr virus involves a number of latent proteins via their interaction with RBP.",
        "nsubj(involves,Regulation)",
        "For these two verbs, participant identification rules are reversed.",
        "An interesting phenomenon is NPs with hyphenated adjectival modifiers, occurring frequently in molecular biology texts (e.g., \"... LPS-mediated TF expression...\").",
        "The majority of these cases involve regulatory events.",
        "Such cases do not involve a dependency path, as the participant (in this case, LPS) and the event trigger (mediated) form a single word.",
        "An additional rule addresses these cases, stipulating that the substring preceding the hyphen is the Cause of the regulatory event triggered by the substring following the hyphen.",
        "(Positive_regulation (Trig-ger=mediated,Theme=TF expression,Cause=LPS)).",
        "Events allowing event participants (regulatory events) are treated essentially the same way as events taking entity participants.",
        "The main difference is that, when sub-events are considered, a dependency path is found between the trigger of the main event and the trigger of its sub-event, rather than an annotated entity, as was shown above in Example (2).",
        "The event detection and characterization pipeline (Task 1) consists of three steps:",
        "1.",
        "Determining whether a word is an event trigger.",
        "2.",
        "If the word is an event trigger, identifying its potential participant(s).",
        "3.",
        "If the event trigger corresponds to a regulatory event and it has a potential sub-event participant, determining in a recursive fashion whether the sub-event is a valid event.",
        "The first step is a simple dictionary lookup.",
        "Provided that a word is tagged as noun, verb or adjective, we check whether it is in our dictionary, and if so, determine the event class for which it has a score above the given threshold.",
        "This word is considered the clue for an event.",
        "We then apply our dependency-based rules to determine whether any entity or event trigger (in the case of regulatory events) in the sentence qualifies as an argument of the event clue.",
        "Grammar rules are applied in the order of simplicity; rules that involve a direct dependency between the clue and any word of the entity are considered first.",
        "Once a list of potential participants is obtained by consecutive application of the rules, one of two things may happen: Provided that sub-events are not involved and appropriate participants have been identified (e.g., a Theme is found for a Localization event), the event is simply added to the extracted event list.",
        "Otherwise, we proceed recursively to determine whether the sub-event participant can be resolved to a simple event.",
        "If this yields no such simple event in the end, the event in question is rejected.",
        "In the following example, the event triggered by inhibit is invalid even though its Cause JunB is recognized, because its Theme, subevent triggered by activation, cannot be assigned a Theme and therefore is considered invalid.",
        "(4) ... , JunB, is shown to inhibit activation mediated by JunD.",
        "After events are extracted in this manner, two postprocessing rules ensure increased accuracy.",
        "One rule deals with a limited set of multiword event triggers.",
        "If a Regulation event has been identified and the event trigger is modified by positive or negative (or inflectional forms positively, negatively), the event class is updated to Positive-regulation or Negative-regulation, respectively.",
        "The second rule deals with the limitation of not allowing multiple events on the same trigger and adds to the extracted event lista Positive-regulation event, if a Gene_expression event was recognized for certain triggers, including overexpression and several others related to transfection (e.g., trans-fect, transfection, cotransfect).",
        "Two grammatical constructions are crucial to determining the event participants: coordination and apposition.",
        "We summarize how they affect event extraction below.",
        "Coordination plays two important roles in event extraction:",
        "1.",
        "When the event trigger is conjoined with another word token, dependency relations concerning the other conjunct are also considered for participant identification.",
        "2.",
        "When an event is detected and its participant is found to be coordinated with other entities, new events are created with the event trigger and each of these entities.",
        "An exception are Binding events, which may have multiple Themes.",
        "In this case, we add conjunct entities as the Themes of the base event.",
        "Coordination between words is largely determined by dependency relations.",
        "The participants of a dependency with a type descending from conj (conjunct) are considered coordinated (e.g., conjjand, conj-of).",
        "Recognizing that Stanford dependency parsing misses some expressions of coordinated entities typical of biological text (in particular, those involving parentheses), we implemented a few additional rules to better resolve coordinated entities.",
        "These rules stipulate that entities that have between them:",
        "2.",
        "A word with CC (coordinating conjunction) part-of-speech tag",
        "Words in an apposition construction are considered equivalent for event extraction purposes.",
        "Therefore, if an appropriate dependency exists between a word and the trigger and the word is in apposition with an entity, that entity is marked as the event participant.",
        "In Example 6, the appos (apposi-tive) dependency shown serves to extract the event Positive.regulation (Trigger=upregulation, Theme=intercellular adhesion molecule-1):",
        "(6) ... upregulation of the lung vascular adhesion molecule, intercellular adhesion molecule-1, was greatly reduced by... appos(molecule,molecule-1) prep-of(upregulation,molecule)",
        "The dependencies that we consider to encode apposition constructions are: appos (appositive), ab-brev (abbreviation), prep.",
        "{including, such-as, com-paredJo, compared.with, versus} (prepositional modifier marked with including, such as, compared to, compared with or versus)."
      ]
    },
    {
      "heading": "3.. A complete parenthetical expression",
      "text": []
    },
    {
      "heading": "4.. Any combination of the above",
      "text": [
        "are coordinated.",
        "For instance, in Example (5), we recognize the coordination between interleukin-2 and IL-4, even though the parser does not:",
        "(5) The activation of NFAT by TCR signals has been well described for interleukin-2 (IL-2) and IL-4 gene transcription in T cells.",
        "conj-and(interleukin-2,transcription)",
        "Once an event list is obtained for a sentence, our speculation and negation module determines whether these events are speculated and/or negated, using additional dependency-based heuristics that consider the dependencies between the event trigger and speculation/negation cues.",
        "We refined an existing speculation detection module in two ways for Task 3.",
        "First, we noted that modal verbs (e.g., may) and epistemic adverbs (e.g., probably) rarely mark speculative contexts in the training corpus, demonstrating the lack of a standardized notion of speculation among various corpora.",
        "For Task 3, we ignored lexical cues in these classes completely for increased accuracy.",
        "Secondly, corpus analysis revealed a new syntactic pattern for speculation recognition.",
        "This pattern involves the class of verbs that we called active cognition verbs (e.g., examine, evaluate, analyze, study, investigate).",
        "We search for a Theme dependency pattern between one of these verbs and an event trigger and mark the event as speculated, if such a pattern exists.",
        "Nominalizations of these verbs are also considered.",
        "In Example (7), the event triggered by effects is speculated, since effects is the direct object (therefore, Theme) of studied:",
        "(7) We have studied the effects of prednisone (PDN),... on the production of cytokines (IL-2, IL-6, TNF-alpha, IL-10) by peripheral T lymphocytes...",
        "Negation detection is similar to speculation detection.",
        "Several classes of negation cues have been determined based on corpus analysis and the negation module negates events if there is an appropriate dependency between one of these cues and the event triggers.",
        "The lexical cues and the dependencies that are sought are given in Table 1.",
        "Table 1: Negation cues and the corresponding dependencies (xcomp: clausal complement, infmod: infinitival modifier, det: determiner)",
        "Additionally, participation of event triggers in dependencies of certain types is sufficient for negating the event it triggers.",
        "Such dependency types are neg (negation) and conjjiegcc (negated coordination).",
        "A neg dependency applies to event triggers only, while conjjiegcc is sought between event participants, as well as event triggers.",
        "Therefore, in Example (8), an event (Positive _regulation(Trigger=transactivate,",
        "Theme: GM-CSF, Cause=ELF1)) is negated, based on the dependencies below:",
        "(8) Exogenous ETS1, but not ELF1, can transacti-vate GM-CSF, in a PMA/ionomycin dependent manner.",
        "conjjiegcc(ETS1, ELF1) nsubj(transactivate, ETS1) dobj(transactivate, GM-CSF)",
        "Finally, if none of the above applies and the word preceding the event trigger or one of the event participants is a negation cue (no, not, cannot), the event is negated."
      ]
    },
    {
      "heading": "4. Results and Discussion",
      "text": [
        "Our event extraction system had one of the best performances in the shared task.",
        "With the approximate span matching/approximate recursive matching evaluation criteria, in Task 1, we were ranked third, while our speculation and negation detection module performed best among the six participating systems in Task 3.",
        "Not surprisingly, our system favors precision, typical of rule-based systems.",
        "Full results are given in Table 2.",
        "The results reported are at goodness score threshold of .08.",
        "Increasing the threshold increases precision, while lowering recall.",
        "The threshold was determined empirically.",
        "Our results confirm the usefulness of dependency relations as foundation for event extraction systems.",
        "There is much room for improvement, particularly in terms of recall, and we believe that incremental nature of our system development accommodates such improvements fairly easily.",
        "Our view of event triggers (\"once a trigger, always a trigger\"), while simplistic, provides a good starting point by greatly reducing the number of trigger candidates in a sentence and typed dependencies to consider.",
        "However, it also leads to errors.",
        "One such example is given in Example (9):",
        "(9) We show that and that LPS treatment enhances the oligomerization of TLR2.",
        "where we identify the event Binding (Trig-ger=oligomerization,Theme=TLR2).",
        "We consider oligomerization a reliable trigger, since it occurs twice in the training corpus, both times as event triggers.",
        "However, in this instance, it does not trigger an event.",
        "This narrow view also leads to recall errors, in which we do not recognize an event trigger as such, simply because we have not encountered it in the training corpus, or it does not have an appropriate part-of-speech tag.",
        "A more sophisticated trigger learning approach could aid in better detecting event triggers.",
        "Negation Cue",
        "Dependency",
        "lack, absence",
        "prep-of(Cue,Trigger)",
        "unable, <not> able, fail",
        "xcomp(Cue,Trigger)",
        "inability, failure",
        "infmod(Cue, Trigger)",
        "no, not, cannot",
        "det(Trigger, Cue)",
        "We dealt with some deficiencies of Stanford dependency parsing through additional rules, as described in Section 3.3.",
        "However, many dependency errors are still generated, due to the complexity of biological text.",
        "For instance, in Example (10), there is a coordination construction between NF-kappaB nuclear translocation and transcription of E-selectin and IL-8.",
        "However, this construction is missed and an erroneous prepjof dependency is found, leading to two false positive errors: Localization (Trigger=translocation, Theme=E-selectin) and Localization (Trig-ger=translocation, Theme=IL-8).",
        "(10) ... leading to NF-kappaB nuclear translocation and transcription of E-selectin and IL-8, which results in ...",
        "conj-and(transcription, translocation) prep'^translocation, E-selectin) conjjand(E-selectin, IL-8)",
        "These errors can be corrected via other \"corrective\" dependency paths; however, first, a closer examination of such error patterns is necessary.",
        "In other instances, the required dependency is completely missed by the parser, leading to recall errors.",
        "For instance, in Example (11), we are unable to recognize two events (Regulation (Trigger=regulation, Theme=4E-BP1) and Regulation (Trigger=regulation, Theme=4E-BP2)), due to lack of apposition dependencies between repressors and 4E-BP1 or 4E-BP2:",
        "(11) ... specific regulation of two repressors of translation initiation, 4E-BP1 and 4E-BP2.",
        "prep-of(regulation,repressors) prep _of(repressors, initiation) conjjand(intiation, 4E-BP1) conjjand(initiation, 4E-BP2)",
        "Typical of rule-base systems, we miss events expressed using less frequent patterns.",
        "Event participants expressed as prepositional modifiers marked with from is one such case.",
        "An example is given below:",
        "(12) Calcineurin activates transcription from the GM-CSF promoter...",
        "In this case, the event Transcription (Trig-ger=transcription, Theme=GM-CSF) is missed.",
        "It is fairly easy to add a rule to address such occurrences.",
        "We have not attempted to resolve anaphoric expressions for the shared task, which led to a fair number of recall errors.",
        "In a similar vein, we ignored events spanning multiple sentences.",
        "We expect that several studies addressing anaphora resolution in biomedical text (Castario et al., 2002; Gasperin and Briscoe, 2008) will inform our near future efforts in this area.",
        "Evaluation results regarding Task 3 may seem poor at first; however, most of the errors concern misidentified or missed base events.",
        "Thus, in this section, we focus on errors specifically triggered by speculation and negation module.",
        "In the development corpus, we identified 39 speculation instances, 4 of which were errors due to speculation processing.",
        "Of 95 annotated speculation instances, 7 were missed due to deficiencies in speculation processing.",
        "Event Class",
        "Recall",
        "Precis.",
        "F-score",
        "Localization",
        "35.63",
        "92.54",
        "51.45",
        "Binding",
        "20.46",
        "40.57",
        "27.20",
        "Gene_expression",
        "55.68",
        "79.45",
        "65.47",
        "Transcription",
        "15.33",
        "60.00",
        "24.42",
        "Protein_catabolism",
        "64.29",
        "56.25",
        "60.00",
        "Phosphorylation",
        "69.63",
        "95.92",
        "80.69",
        "EVT-TOTAL",
        "43.10",
        "73.47",
        "54.33",
        "Regulation",
        "24.05",
        "45.75",
        "31.53",
        "Positive_regulation",
        "28.79",
        "50.45",
        "36.66",
        "Negative_regulation",
        "26.65",
        "51.53",
        "35.13",
        "REG-TOTAL",
        "27.47",
        "49.89",
        "35.43",
        "Negation",
        "14.98",
        "50.75",
        "23.13",
        "Speculation",
        "16.83",
        "50.72",
        "25.27",
        "MOD-TOTAL",
        "15.86",
        "50.74",
        "24.17",
        "ALL-TOTAL",
        "32.68",
        "60.83",
        "42.52",
        "Similarly, negation processing led to 5 false positives in 31 negation instances we identified and to 5 false negatives in 107 annotated negation instances.",
        "We found that speculation false positive errors are exclusively cases for which speculation could be argued.",
        "For instance, in Example (13), we recognize that appears to scopes over event Negative-regulation (Trigger=negatively regulate, Theme=IL-2R), rendering it speculative.",
        "However, it is not annotated as such.",
        "This is further evidence for the difficulty of annotating such phenomena correctly and consistently, since the exact meaning is somewhat elusive.",
        "(13) An unidentified Ets family protein binds to the EBS overlapping the consensus GAS motif and appears to negatively regulate the human IL-2R alpha promoter.",
        "Negation pattern that involves negation cues (no,not,cannot) in the token preceding an event trigger or participant, a pattern initially considered to increase recall, caused most of negation false positive errors.",
        "An example is given in (14):",
        "(14) The finding that HL-60/vinc/R cells respond to TPA with induction of a monocytic phenotype, but not c-jun expression, suggests that ...",
        "Complex and less frequent patterns of expressing speculation and negation were responsible for more recall errors.",
        "Two such examples are given below:",
        "(15) (a) These results ... and suggest a molecular mechanism for the inhibition of TLR2 by DN variants.",
        "(b) Galectin-3 is ... and is expressed in many leukocytes, with the notable exception of B and T lymphocytes.",
        "In (15a), speculation is detected; however, we are unable to recognize that it scopes over the event triggered by inhibition.",
        "In (15b), the prepositional phrase, with the notable exception, is not considered to indicate negation."
      ]
    },
    {
      "heading": "5. Conclusions and Future Work",
      "text": [
        "We explored a rule-based approach to biological event detection driven by typed dependency relations.",
        "This study marks our first foray into bio-event extraction in a general way and, thus, we consider the results very encouraging.",
        "In one area we investigated before, speculation detection, our system performed best and this confirms the portability and extensibility of our approach.",
        "Modest recall figures point to areas of improvement.",
        "We plan to address anaphora resolution and multiple sentence spanning events in the near future.",
        "Our naive approach to event triggers needs refinement and we believe that sophisticated supervised machine learning techniques may be helpful.",
        "In addition, biomedical lexical resources, including UMLS SPECIALIST Lexicon (McCray et al., 1994), may be useful in improving event trigger detection.",
        "Finally, dependency relations based on the Stanford Parser provided better performance in our case, in contrast to general consensus that those based on Charniak Parser (Charniak and Johnson, 2005) are superior, and this, too, deserves further investigation."
      ]
    }
  ]
}
