{
  "info": {
    "authors": [
      "Diana McCarthy"
    ],
    "book": "Proceedings of the Workshop on Semantic Evaluations: Recent Achievements and Future Directions (SEW-2009)",
    "id": "acl-W09-2401",
    "title": "Invited Talk: Alternative Annotations of Word Usage",
    "url": "https://aclweb.org/anthology/W09-2401",
    "year": 2009
  },
  "references": [
    "acl-W07-2006",
    "acl-W07-2009"
  ],
  "sections": [
    {
      "text": [
        "Alternative Annotations of Word Usage",
        "Diana McCarthy, Department of Informatics, University of Sussex",
        "Falmer BN1 9QJ, UK",
        "Right from Senseval's inception there have been questions over the choice of sense inventory for word sense disambiguation (Kilgarriff, 1998).",
        "While researchers usually acknowledge the issues with predefined listings produced by lexicographers, such lexical resources have been a major catalyst to work on annotating words with meaning.",
        "As well as the heavy reliance on manually produced sense inventories, the work on word sense disambiguation has focused on the task of selecting the single best sense from the predefined inventory for each given token instance.",
        "There is little evidence that the state-of-the-art level of success is sufficient to benefit applications.",
        "We also have no evidence that the systems we build are interpreting words in context in the way that humans do.",
        "One direction that has been explored for practical reasons is that of finding a level of granularity where annotators and systems can do the task with a high level of agreement (Navigli et al., 2007; Hovy et al., 2006).",
        "In this talk I will discuss some alternative annotations using synonyms (McCarthy and Navigli, 2007), translations (Sinha et al., 2009) and WordNet senses with graded judgments (Erk et al., to appear) which are not proposed as a panacea to the issue of semantic representation but will allow us to look at word usages in a more graded fashion and which are arguably better placed to reflect the phenomena we wish to capture than the 'winner takes all' strategy."
      ]
    }
  ]
}
