{
  "info": {
    "authors": [
      "Iker Zulaica-Hernández",
      "Javier Gutiérrez-Rexach"
    ],
    "book": "Proceedings of the SIGDIAL 2009 Conference",
    "id": "acl-W09-3913",
    "title": "Tense, Temporal Expressions and Demonstrative Licensing in Natural Discourse.",
    "url": "https://aclweb.org/anthology/W09-3913",
    "year": 2009
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Tense, temporal expressions and demonstrative licensing in natural",
        "discourse",
        "Iker Zulaica-Hernändez",
        "The Ohio State University Columbus, Ohio 43210",
        "Javier Gutierrez-Rexach",
        "The Ohio State University Columbus, OH 43210",
        "Demonstrative terms are highly context-dependent elements both in deictic and anaphoric uses.",
        "When reference is transferred from a visual, three-dimensional context to the textual domain, information-structure factors (i.e. the cognitive status of the antecedent, recency of mention, syntactic structure or the semantic type of the antecedent) have an effect on speaker preferences for selecting demonstrative anaphors over other referring expressions.",
        "In certain languages, there seems to be a correlation between demonstratives and tenses in discourse.",
        "For example, proximal demonstratives correlate better with present tenses whereas distal demonstratives correlate with past tenses.",
        "In this paper, we present a corpus study of Spanish texts that analyzes the ways in which temporal expressions selectively favor the use of specific demonstratives thus confirming the contextual dependency of demonstrative anaphors."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "As referring expressions, adnominal and pronominal demonstratives (this/that) can be used in two basic 'modes' that allow speakers to refer to entities in different discourse situations.",
        "In the deictic mode, speakers commonly use demonstratives to refer to physical, concrete entities in the real-world speech situation.",
        "Utterance of the demonstrative (very likely accompanied by a pointing gesture) has an important communicative effect, namely, that of focusing the attention of the addressee on a particular entity in the perceptual or visual field.",
        "This is accomplished by making the intended entity salient from among a set of (potentially) competing entities.",
        "Thus, both speaker and addressee focus their attention on the same element and the speaker's intended communicative goal is achieved.",
        "This is the so-called joint attention effect in the psycholinguistics literature (Diessel 2006) In these exophoric uses, the role of the pointing gesture (a pointing finger, a gaze or movement of the head) may become essential.",
        "It completes the meaning of the demonstrative expression and serves to disambiguate the speaker's reference.",
        "Demonstratives can also be used exophorically without an accompanying ostension, but in such cases the entity referred to is already sufficiently salient in the visual field for the interlocutors to have focused their attention on it and, consequently, an accompanying gesture by the speaker would be redundant or irrelevant to achieve the intended communicative goal.",
        "There are certain uses of demonstrative elements that depart from the purely deictic mode.",
        "These uses, long and widely recognized, have been characterized as anaphoric or discourse anaphoric many authors (see inter alia Asher, 1993; Diessel, 1999; Janssen, 1996; Gundel et al.",
        "2001, 2003; Hegarty et al.",
        "2001).",
        "Thus, as demonstrative anaphors, demonstratives like English this/that are coreferential with a range of textual elements.",
        "From a syntactic point of view, the antecedents of demonstrative anaphors can be of a varied nature: NPs, subordinate clauses, entire sentences or larger textual fragments.",
        "Semantically, these antecedents comprise a rich ontology that ranges from individuals or propositions to event and event-types.",
        "Whether the anaphoric referring mode is derived from a primary deictic character or not is an issue quite beyond the purpose of this paper, but studies on language acquisition indicate that the deictic features are learned at the earlier stages (Diessel 2006).",
        "The only difference between the referential capabilities of deictic and anaphoric uses of demonstratives lies in the fact that these capabilities have been transferred from a real-world context of utterance common to strict deictic uses to a textual (endophoric) domain in the anaphoric use.",
        "The communicative function remains the same.",
        "The pointing gesture, absent in demonstrative anaphors, seems to have evolved into derived pragmatic functions in the anaphoric use.",
        "A key feature that is common to both deictic and anaphoric uses is their high degree of contextual dependency.",
        "This issue will be explored in the next sections."
      ]
    },
    {
      "heading": "2. Referential distance",
      "text": [
        "In deictic uses, pronominal and adnominal demonstratives are highly context dependent.",
        "In order to be properly used and fully interpreted, they require the aid of contextual parameters such as the speaker, the addressee, the location of the deictic center, the location of the object pointed at, the utterance time, etc.",
        "This is not only true of demonstratives like this (NP) or that (NP) but also of other indexical expressions like here, there, I, you, etc.",
        "Demonstrative anaphors also appear to be dependent on contextual factors to a high degree.",
        "The most relevant parameter in anaphoric uses is textual context.",
        "Elements such as referential distance, lexical clues, or syntactic structure may have an effect on the speaker's preferences for one demonstrative over the other(s), or over other referential expressions.",
        "For example, Gundel et al. (2001, 2003) examined referential expressions, including demonstratives and the personal pronoun it, in different environments and came to the conclusion that several factors, most prominently information structure, have an effect in the way clausally-introduced entities are referred to with these expressions.",
        "Different referential expressions (demonstratives, indefinites, the definite article, etc.)",
        "have the property of 'marking' the cognitive status of their antecedents.",
        "In the Givenness Hierarchy (Gundel et al.",
        "1993), the antecedents of demonstratives are cognitively ACTIVATED whereas those of the unstressed personal pronoun it are IN FOCUS.",
        "As they point out, \"the entities IN FOCUS at a given point in the discourse will be that partially-ordered subset of activated entities which are likely to be continued as topics of subsequent utterances.\"",
        "(2001: 40).",
        "A very important factor in determining the status of an entity is syntactic structure.",
        "Consider the following discourses:",
        "(1) a.",
        "My neighbor 's Bull Mastiff bit a girl on a bike.",
        "b.",
        "It's/That's the same dog that bit Mary last summer.",
        "(2) a. Sears delivered new siding to my",
        "neighbors with the Bull Mastiff.",
        "b.",
        "#It's/That's the same dog that bit Mary last summer.",
        "In the NP My neighbor's Bull Mastiff occupies the subject position of a main clause and it is very likely the discourse topic.",
        "This brings the entity into the FOCUS of attention and, therefore, can be indistinctively referred to using personal and demonstrative pronouns.",
        "The anaphor ' that' can be used to refer to the NP for entities IN FOCUS are also ACTIVATED, namely, in working memory.",
        "On the other hand, entities introduced in subordinate clauses or prepositional phrases are more likely to be rendered the cognitive status ACTIVATED upon their introduction in discourse.",
        "This point is shown in example (2), where the same NP is introduced within a prepositional phrase.",
        "This peripheral syntactic position renders the cognitive status of the antecedent ACTIVATED hence banning the use of the personal pronoun it and licensing the use of the demonstrative pronoun.",
        "Another contextual factor that has been investigated as bearing clear implications on the use of demonstrative anaphors by language users is referential distance.",
        "By referential distance we mean the textual distance between the antecedent and the demonstrative anaphor.",
        "Textual or referential distance is commonly quantified as the number of intervening clauses between antecedent and anaphor.",
        "Hegarty et al.",
        "(2000) observed that English demonstrative pronouns and adjectives (this/that-(NP)) show a strong preference for their antecedents to be found in the clause immediately preceding the clause holding the demonstrative expression.",
        "In quite the same line, Kirsner et al.",
        "(1987) investigate the factors that affect demonstrative (deze 'this' vs die 'that') choice in written Dutch.",
        "One of these determining factors is the magnitude of referential distance.",
        "Based on texts from different subcorpora tested on native Dutch speakers and comprising various different discourse genres, these authors showed that the Dutch proximal demonstrative deze ('this') tends to be associated with referential distance > 1 (extrasentential retrieval of a referent) and distal die ('that') tends to be associated with referential distance = 0 (intrasentential retrieval of a referent).",
        "Their study showed that only 15% of NPs with deze ('this') have referential distance = 0, whereas a 40% of the NPs with die ('that') have referential distance = 0.",
        "In our empirical corpus study, we have analyzed the referential distance factor for Spanish demonstrative pronouns with the aim of checking whether this contextual parameter may have an influence on the speakers' preferences for one demonstrative over the others.",
        "Let us first briefly characterize Spanish demonstratives.",
        "Unlike English, Spanish has a tripartite demonstrative system with three elements (este, ese and aquel) inflected for gender and number.",
        "As deictic elements, these demonstratives are commonly characterized as conveying different degrees of distance with respect to the deictic center (the speaker): este ('this') is proximal, ese ('that') medial, and aquel ('that yonder') is the distal demonstrative of the tripartite system.",
        "In addition, Spanish has three demonstrative pronouns (esto, eso and aquello), which do not inflect and have been traditionally labelled as neuter demonstrative pronouns in the Spanish grammatical tradition (even though there is not clearly a neuter grammatical gender in this language).",
        "Most likely these pronouns have been labelled as neuter for they are used, as in many other languages, as demonstrative anaphors to anaphorically and cataphorically refer to abstract, genderless, higher order entities like events, propositions, etc.",
        "in discourse.",
        "To test the referential distance (recency) factor, we carried out a corpus search on the three neuter demonstrative pronouns.",
        "To this aim, we obtained a sample of 193 cases to be scrutinized.",
        "Out of the total 193 occurrences, 82 were instances of demonstrative esto, 80 instances of eso and 31 of aquello.",
        "In order to restrict the high number of occurrences of demonstratives in our corpus we searched for combinations of a demonstrative in the subject position immediately followed by a past tense (e.g. esto ocurrio... ('this happened...').",
        "The sample is not even (82 vs 80 vs 31 cases) due to the lesser frequency of occurrence of demonstrative aquello in Spanish oral and written discourses.",
        "In order to find out the antecedent (and semantic referent) of the demonstrative, we segmented our sample texts into sentences as in (3).",
        "Note that each bracketed item corresponds to a discourse segment (a sentence), and each segment has been numbered with a subscript.",
        "The demonstrative anaphor is written in bold characters and the most likely antecedent has been underlined.",
        "In (3), for example, the antecedent to the demonstrative pronoun can be found in sentence #3 (subscript CL3), namely, in the third sentence relative to the position of the demonstrative anaphor in clause CL0.",
        "Antecedent and anaphor are subscripted to show coreference.",
        "An English translation of the original Spanish text is given below.",
        "(3) [Al fin y al cabo, si ustedes estan aqui es porque quieren que les hable de la Operation Operak, claro.",
        "]CL3 [jMe cuesta tanto volver al pasado!",
        "]CL2 [Ya comprenderan, el tiempo aqui transcurre de otra manera.",
        "]CL1 [Y todo aquellok sucedio en el 92, hace ya.",
        "]CL0 jPero sea!",
        "No voy a defraudarles.",
        "Les contare la historia tal y como sucedio.",
        "[After all, it is obvious that you are here because you want me to tell you about the Operation Opera]CL3 [It's so hard for me to go back to the past!",
        "]CL2 [You see, here times goes by differently.",
        "]CL1 [And all that happened in 1992, about.",
        "]CL0 But OK!",
        "I won't disappoint you.",
        "I'll tell you the story exactly as it happened.",
        "The results from our study indicate that demonstrative pronouns in Spanish show, like English, a strong preference for their antecedents to be found immediately prior to the occurrence of the anaphor.",
        "The results are shown in Figure 1.",
        "There are 7 different categories.",
        "Categories labelled 1CL, 2CL, 3CL and 4CL stand for the sentence ID number where the antecedent was found (where 1CL is the closest to the anaphor).",
        "The category >5CL comprises all those cases in which the antecedent was found in the fifth clause preceding the anaphor and up.",
        "All those cases in which, for some reason, the proper antecedent could not be determined have been gathered under category N/A (e.g. not enough text to locate the antecedent, the antecedent was ambiguous, etc.).",
        "Finally, the category labelled CATAPH stands for cases of cataphora where reference via the demonstrative is made to a textual entity, which is subsequent to the appearance of the anaphor.",
        "In all instances of cataphoric reference considered, the antecedent was found in the clause immediately following the one holding the anaphor.",
        "The results seem to be relatively straightforward: in 123 instances (63.7%) out of the total 193 cases examined, the antecedent was found in the sentence closest to the anaphor (1CL).",
        "This percentage increases substantially up to a 77.8% when we leave N/A cases out of the count.",
        "On the other hand, there are no relevant differences regarding individual demonstrative pronouns as the three elements obtained pretty similar results: 78% of antecedents of proximal esto ('this'), 78.2% of eso ('that') and 76.0% of aquello ('that yonder') were found in 1CL.",
        "Even if we would collapse categories 2CL, 3CL, 4CL and >5CL into one single category (with label >2CL), the number of antecedents found in the clause closest to the demonstrative anaphor would still be much higher.",
        "The results of this study seem to confirm the data by Hegarty et al.",
        "(2000) for English, namely that demonstrative pronouns show a strong preference for their clausal antecedents to be introduced in the sentence preceding the one containing the anaphor.",
        "Unlike Dutch demonstratives deze and die (Kirsner et al.",
        "(1987), Spanish demonstrative pronouns do not exhibit any individual differences concerning referential distance.",
        "This does not entail that Spanish demonstratives do not show any semantic or pragmatic differences.",
        "As we will see in the next section, Spanish demonstratives show important differences in the way they are licensed in discourse by certain contextual elements like tenses, even denoting nominals and temporal adverbials."
      ]
    },
    {
      "heading": "3. Tense and demonstration in discourse",
      "text": [
        "In the Spanish grammatical tradition, it was noticed that demonstratives and some particular tenses show a correlation in oral and written discourse (Fernandez-Ramirez, 1951; cf. also Gutierrez-Rexach (2002) for a more recent restatement).",
        "This parallelism arises when demonstratives are used as discourse anaphors, that is, when reference is intratextual.",
        "To date, the alleged correlation tense-demonstration has not been empirically tested.",
        "To this aim, we carried out a corpus study to check whether the alleged correlation can be sustained and explained.",
        "The alleged correlation tense-demonstration does not appear to be restricted to Spanish.",
        "In Dutch, Kirsner et al.",
        "(1987) studied the effect than tense may have on the speaker's choice of demonstratives deze ('this') and die ('that').",
        "At the intrasentential level, they found that 59% of present tense verb forms co-occur with proximal deze and 67% of past tense forms co-occur with distal die.",
        "These figures are based on the study of 43-deze sentences and 42 die-sentences containing non-perfect verb forms.",
        "Nevertheless, as the authors of the study point out, when context is added, other factors such as referential distance, the degree of detail with which the referent has been described, etc.",
        "override the influence of tense on demonstrative choice.",
        "It is worth noting that for Kirsner et al.",
        "'s the differences in meaning between Dutch demonstratives can be fundamentally explained on the basis of \"the degree of attention which the addressee is instructed to give to the referent of the noun\" (p.",
        "17).",
        "Regarding Spanish, our initial hypothesis is that contextual clues or elements such as tense, temporal adverbials, event denoting nominals and other temporal expressions favor the use of certain demonstrative anaphors.",
        "In particular, we will hypothesize that distal demonstrative aquel ('that yonder'), both in its pronominal and adnominal forms, needs a PAST-denoting contextual element to be licensed in discourse.",
        "As a consequence, anaphoric reference with the distal demonstrative aquel commonly involves past events, facts, situations, etc.",
        "On the other hand, the two other demonstratives of the tripartite system (proximal este ('this') and medial ese ('that')) do not need any particular contextual configuration to be used as demonstrative anaphors in discourse.",
        "In sum, there is a correlation between a PAST trigger and distal aquel, whereas este and ese are found in any context irrespective of their temporal frame in discourse.",
        "We carried out a second corpus study where we analyzed if the alleged correlation tense-demonstration can be sustained on empirical grounds.",
        "For this purpose, we searched for occurrences of demonstrative pronouns and past and present tense verb forms where the demonstrative anaphor played the syntactic role of subject of the verb.",
        "A sample query is shown in (4).",
        "All three demonstrative pronouns were combined with the tensed verb forms: past tense as in (4a) and present tense as in (4b).",
        "We limited our search to event predicates ('happen', 'occur' and 'finish'), to ensure the demonstratives in question were referring back in the text to events, which are entities that are commonly referred to via demonstrative anaphors.",
        "At the same time, forcing a discourse referential reading for the demonstrative would ensure that we were filtering out other actual uses of Spanish demonstratives as discourse particles.",
        "(4) a. Esto/Eso/Aquello sucedio.",
        "This/That/That yonder happen-3sg.Pret.",
        "'This/That/That yonder happened.'",
        "b. Esto/Eso/Aquello sucede.",
        "This/That/That yonder happen-3sg.Pres.",
        "'This/That/That yonder happen.'",
        "Regarding the tenses scrutinized, we looked for combinations of demonstratives and various PAST (past progressive, Spanish \"imperfecto\", preterite) and PRESENT tenses (present progres-",
        "time (S).",
        "sive, simple present and Spanish \"preterito per-fecto\").",
        "The results are shown in figures 2 and 3.",
        "As shown in the chart in 2, only 1 single occurrence of demonstrative aquello combined with a present tense was found.",
        "Compare these figures with the 573 occurrences of demonstrative pronoun esto and 209 occurrences of'medial' demonstrative eso.",
        "On the other hand, the frequency of tokens of demonstrative aquello accompanied by a past tensed verb form increases dramatically as shown in graph 3 (45 occurrences).",
        "Thus, out of the total 46 tokens of demonstrative aquello found in our corpus search, only 2.17% were cases where the demonstrative was accompanied by a past tense.",
        "The other two demonstratives also show a high rate of occurrence along with past tenses in discourse (151 tokens of eso vs 290 of proximal esto).",
        "The disparity in the total number of occurrences among demonstratives (46 of distal aquello; 360 of medial eso; 863 of proximal esto) clearly indicates that the use of demonstrative aquel is in general quite limited in modern Spanish; especially when compared to the overall frequency of use of demonstratives este and ese.",
        "This is a proven fact that equally applies to pronominal and adnominal demonstrative aquel when used anaphorically in discourse.",
        "Tense(s) in Previous Clause(s), ptsc (Past Tense in the Same Clause as the demonstrative anaphor).",
        "The numbers shown in figures 2 and 3 indicate that the use of spanish distal demonstrative aquello clearly correlates with past tense in discourse, whereas proximal esto and medial eso co-occur with past and present tenses in a similar proportion.",
        "Proximal demonstrative pronoun esto is the element of the tripartite system preferred by speakers for reference to events in discourse.",
        "Nevertheless, the picture is not as straightforward as it may appear from these figures.",
        "A non systematic look at the corpus reveals abundant cases of demonstrative aquel used in discourse along with a past tense in its immediate textual surroundings.",
        "A suitable explanation must be provided for these cases or, otherwise, the validity of our study could be questioned and the hypothesized correlation tense-demonstration in spanish could not be sustained.",
        "In order to test whether the semantic nature of the entity referred to or the specific demonstrative expression (pronominal vs adnominal) may have an effect on the clear correlation tense-demonstration shown by demonstrative aquel, we carried out a second corpus study.",
        "In this case, we have searched the corpus for occurrences of the expression aquel hecho 'that fact' containing the demonstrative in an adnominal use (this/that-NP type).",
        "The main goal is to test whether other explicit contextual factors besides tense may have an influence in the licensing of demonstrative aquello.",
        "We looked at a substantial fragment of text surrounding the demonstrative anaphor (a discourse fragment consisting of an average of 10 sentences).",
        "In all, 30 occurrences of the expression aquel hecho ('that fact') were scrutinized.",
        "The results are given in figure 4.",
        "The category acronyms stand for the following elements: NAPT (No Apparent Past Trigger), OTHER, EDN (Event denoting Noun), TE (Temporal Expression), PTPC (Past",
        "As figure 4 indicates, in only 3 out of the total 30 tokens analyzed no past temporal expression could be found in the immediate discourse context of the demonstrative anaphor.",
        "In all other tokens, at least one past expression 'trigger' could be found.",
        "In many cases, more than one past expression co-appeared in the anaphor's immediate context.",
        "A series of examples are given in the appendix to this paper.",
        "What all the linguistic expressions included in these categories have in common is that they directly or indirectly denote a past time or, in other words, contribute to situate the event referred to at some interval preceding the speech time.",
        "Taking discourse as a coherent and fully cohesive semantic unit, what these expressions do is contribute to the setup and maintenance of the temporal referential frame of discourse.",
        "Thus, for example, past time denoting temporal expressions (dates; time adverbs like 'tomorrow' and other past time denoting expressions like 'John visited Paris last year') are found in 14 out of the 30 cases analyzed.",
        "some event-denoting nominals like, for example, the Beijing Olympic Games or the murder of President Kennedy may also situate the event they denote at a particular past interval, namely, the summer of year 2008 and year 1963, respectively.",
        "Of course, nothing in the morphology or the semantics of these nominals indicates obligatory reference to a past time.",
        "Rather, their interpretation as past event-denoting nominals is clearly dependent on the background knowledge of the conversation participants.",
        "Thus, if we assume that common ground and a certain amount of shared world knowledge is essential to communication, event-denoting nominals also contribute to the setup of the referential temporal frame of discourse.",
        "Finally, tense is another key contextual factor that contributes to the setup and maintenance of the temporal frame.",
        "In 13 of the tokens examined, a past tense could be found in the same clause as the demonstrative.",
        "In 21 cases, the past tense verb form(s) was found in the preceding discourse.",
        "For example, a good number of the instances analyzed were narratives where a certain past fact, event or action was described using a series of past tenses along a variable textual span.",
        "In principle, what all these elements (past tenses, event denoting nominals, temporal ad-verbials) have in common is their ability to situate the discourse entity referred to at an interval interval preceding the actual speech time.",
        "Whether this sort of meaning is wholly procedural or contains a mixture of conceptual and procedural elements is an issue that we will not discuss in this paper.",
        "spanish distal demonstrative aquel in discourse anaphoric uses, and perhaps other demonstrative anaphors in different languages, appear to be somehow sensitive to the temporal information conveyed by these elements up to the point that demonstrative aquel needs a past denoting 'trigger' in its textual surroundings to be fully licensed in context.",
        "As the data presented in this paper indicate, demonstratives este and ese do not seem to be sensitive to the past/present distinction.",
        "This, along with other data like the overall frequency of use of spanish demonstrative anaphors, can be taken as an indication that the spanish tripartite system is in the process of evolving into a binary system, an issue we will not discuss here for reasons of space (see Gutierrez-Rexach 2002 for a general theory along these lines).",
        "The fundamental conclusion that can be drawn from this paper is that a variety of contextual information may contribute to the differential behavior of demonstratives as discourse anaphors.",
        "How the particular \"licensing\" of the tense-demonstration relation in discourse takes place and how to explain and/or characterize it is not a trivial task.",
        "Many linguistic expressions are clearly context-dependent in many languages in various ways.",
        "In some cases, such dependency can be explained on syntactic grounds (i.e. negative polarity items).",
        "In other cases, a suitable explanation has been provided on pragmatic or semantic grounds (the Spanish negative word tampoco 'neither/not...either' needs either an overt negation or even a presupposed negation in the textual surroundings for it to be fully licensed in discourse (Schwenter and Zulaica, 2001).",
        "Evidence presented in this paper concerning referential-distance preferences for Spanish demonstrative anaphors indicate that the abstract discourse object is commonly found in the clause immediately preceding the anaphor.",
        "It has also been shown that other contextual factors need to be taken into account when dealing with demonstrative anaphors cross-linguistically.",
        "Thus, for example, Spanish demonstrative anaphor aquel strongly correlates with past time denoting expressions to the point that the presence of any of these triggers in the surrounding discourse context is needed for the demonstrative to be licensed.",
        "This would seem to indicate that demonstrative aquel also binds a time variable thus establishing a referential relation between the anaphor and the temporal information conveyed by texts (along the lines defended by Setzer and Gaizauskas, 2000; Puste-jovsky et al.",
        "2003; Hobbs and Pustejovsky,"
      ]
    },
    {
      "heading": "4. Conclusions",
      "text": [
        "It is commonly assumed that demonstratives, when used as anaphors in discourse cross-linguistically, convey additional information besides mere (co)-reference.",
        "For example, these elements (and other referential expressions) are said to mark the cognitive status of their antecedents or contribute to the joint attentional state of the participants in the conversation.",
        "The source of such supplementary information appears to be of a pragmatic nature: It arises in specific uses and discourse context plays a crucial role in its appearance.",
        "In this paper, we have shown that the tripartite system of demonstrative anaphors in Spanish seems to be sensitive to specific temporal contextual information.",
        "Thus, the Spanish distal demonstrative anaphor aquel requires the presence a past time denoting expression (i.e. past tensed verb forms, adverbs, event-denoting nominals and other temporal expressions) in its contextual environment for the anaphor to be properly used in discourse.",
        "In addition, we have also studied the influence that referential distance may have on Spanish demonstrative ana-phors and the speaker's preferences for one ana-phor over the other.",
        "Nevertheless, our empirical study is far from being exhaustive.",
        "Future research would have to explore other contextual factors in more detail, such ase the amount of textual material between the anaphor and the antecedent, the syntactic and semantic type of specific lexical items involved, differences among discourse genres and/or syntactic prominence of the antecedent, etc.",
        "as these factors may also help us better understand the complex mechanisms underlying the semantics and pragmatics of discourse anaphors.",
        "In this appendix, we present some contextualized examples of the Spanish distal demonstrative aquel ('that yonder').",
        "The corresponding English translation is given below each discourse sample.",
        "The demonstrative is highlighted in capital letters for an easy identification and the source is given in brackets at the end of every example.",
        "Other relevant information is given in bold characters.",
        "All the labels (PTPC, PTSC, EDN, TE and Other) correspond to the corpus sample in figure 4.",
        "(I) This example is an instance of the temporal trigger labeled PTPC (Past tense(s) in previous clause(s) in our corpus study.",
        "The text tells a brief story about the movie Suddenly.",
        "The series of past tensed verb forms indicate the speaker is narrating a past event, which is the temporal frame that triggers the use of this particular demonstrative.",
        "\"Suddenly\" nunca se estrenô en Espana a pesar de que, ademâs de un excelente filme policiaco, fue una pelicula premonitoria.",
        "Nueve anos des-pués de su estreno, Kennedy fue asesinado y segûn dicen, el asesino official, Lee Oswald, se inspirô en ella.",
        "También se dice que cuando ya se habia producido el magnicidio, su protagoni-sta, Sinatra, intentô que la retiraran de la cir-culaciôn para \"evitar que otras mentes insanas la utilizaran como modelo\", aunque también para disociar su imagen con AQUEL HECHO.",
        "\"Suddenly\" was never showed in Spain in spite of the fact that it was a premonitory and excellent cop movie.",
        "Nine years after the premiere, Kennedy was murdered and, as it is said, the alleged murderer, Lee Oswald, was inspired by it.",
        "It is said that once the assassination was committed, the main character, Sinatra, tried to withdraw the film \"to prevent that other insane minds could use it as a model\", but also to dissociate his image from THAT FACT.",
        "(II) The following example is ambiguous as it may be categorized as belonging to either category PTSC (Past tense in same clause as anaphor) or as EDN (Event denoting noun).",
        "On the one hand, a past tense is accompanying the demonstrative expression in the last sentence.",
        "On the other hand, demonstrative reference is made to the past event denoting NP the French Revolution two clauses before the anaphor.",
        "It appears that this NP may be functioning as the element that licenses the use of distal demonstrative aquel.",
        "In cases like this, where a clear past event denoting NP is found, we believe the event denoting NP prevails over any other past denoting triggering expression.",
        "The reason behind this is that NPs are most commonly global or local discourse (sub)-topics.",
        "In consequence, we labeled this particular example as EDN.",
        "El editorial que publicô El Pais el pasado dia 19 de Julio lo podria firmar cualquier diario con-servador.",
        "Sôlo le ha faltado una arenga an-ticomunista y una referencia a lo utôpico de las revoluciones.",
        "En Nicaragua, y usted lo sabe bien, se ha avanzado mucho en lo que se refiere a libertades y a igualdades.",
        "El bicentenario de la revoluciôn francesa parece que no ha servido ni siquiera para dejar claro cuâl es la mâs importante de las palabras que encabezaron AQUEL HECHO histôrico.",
        "The leading article, published by El Pais last July 19th, could be signed by any conservative newspaper.",
        "It was only in need of an anti-comu-nist harangue and a reference to the revolutionary utopia.",
        "In Nicaragua, and you know that well, much progress has been made regarding liberty and equality.",
        "It appears that the bicentennial of the French Revolution was not even useful to make it clear whichword is the most important one among those leading to THAT historical FACT.",
        "(III) In this example, there are, technically, no past tenses (Spanish uses subjunctive tenses in this case).",
        "There is, though, an expression that clearly contributes to locate the narrative at as past interval, namely, el ano pasado ('last year').",
        "Therefore, the example has been categorized as TE (temporal expression) for the purposes of our corpus study.",
        "Los profesores del instituto Môstoles IV estân estos dias en plena vorâgine.",
        "Que el ano pasado un alumno de 16 anos disparara en mitad de un examen de matemâticas una escopeta de caza y el tiro pasara a metro y medio del profesor no ha amedrentado a nadie.",
        "De AQUEL HECHO, ahora solo queda una gran satisfaccion.",
        "The teachers in the 'Mostoles IV' high school are going through a fuss these days.",
        "Nobody was scared by the fact that a 16 year old student fired a hunting rifle in the middle of a math exam last year and the bullet missed the teacher by only one and a half meters.",
        "Only great relief remains from the outcame of THAT FACT.",
        "(IV) This paragraph describes a street where a notable person from Caracas once walked.",
        "Most verb forms are in the present tense or conditional though.",
        "The explicit contextual element that helps establishing a past temporal frame for this discourse fragment is the date: March 25th 1799.",
        "The temporal expression also licenses the use of the distal demonstrative AQUEL HECHO.",
        "This is another clear instance of a TE (temporal expression) trigger.",
        "En el tramo de la calle Mercaderes comprendido entre Obrapia y Lamparilla, donde hoy radica la Casa Simon Bolivar, una tarja recuerda el paso por la ciudad, el 25 de marzo de 1799, de quien seria el mas insigne de los caraquehos y el primero de los libertadores de Sudamerica.",
        "La embajada de Venezuela y la Universidad de Los Andes se han encargado de que cuantos transiten por esa acera, tengan conocimiento de AQUEL HECHO.",
        "In the stretch of Mercaderes street that extends from Obrapia to Lamparilla streets, the current location of Casa Simon Bolivar, a plaque honors Bolivar's march through the city on March 25th1799.",
        "He would eventually become the most notable individual born in Caracas and the first of the South American freedom fighters.",
        "The Venezuelan embassy and the Los Andes University have done the necessary work so that whoever walks on that sidewalk becomes aware of THAT FACT.",
        "(V) This discourse fragment is the only instance included in the category OTHER in our study.",
        "It is a case of cataphoric use of demonstrative aquel whereby forward reference is made to an event introduced into discourse by the clause (underlined) immediately following the demonstrative anaphor.",
        "The verb form chosen to introduce this event is the non-finite perfect form haber dividido ('have divided').",
        "It appears that the element that triggers the use of the distal demonstrative anaphor is the past tense verb form demoströ ('showed') accompanying the anaphor.",
        "Clinton es un buen comunicador, capaz de com-prender el asesoramiento que le ofrecen, lo trasmite, persuade a la gente, lucha.",
        "Ese es el papel de Clinton.",
        "El estd persuadido de todo eso que dijo.",
        "Pero los dos elementos claves, los dos cerebros del auge econömico de los Ultimos anos, los que han aconsejado cömo aprovechar bien las ventajas y privilegios que hoy disfrutan, son Rubin y Greenspan.",
        "No hay duda de eso.",
        "Creo que los gobiernos influirdn de alguna manera sobre el Banco Central de la Uniön Europea, lo demoströ AQUEL HECHO de haber dividido en dos periodos los ocho anos que le correspondian al primer Presidente del Banco Central, un alemdn.",
        "Clinton is a good speaker, able to understand the advice he is being offered: he passes it on, he persuades people, he fights.",
        "That is Clinton's role.",
        "He is convinced of everything he says.",
        "But the two key elements, the two brains of the economic growth over the last years, those who advised him on how to take advantage of the benefits and privileges they are enjoying today, are Rubin and Greenspan.",
        "That is beyond any doubt.",
        "I think that governments will somehow have an influence on the European Community Central Bank, as shown by THAT FACT of having divided the eight years that corresponded to the first president of the Central Bank, a German guy, into two periods.",
        "(CREA: Transcription of press conference: http://www2.cuba.cu/gobierno/discursos)"
      ]
    }
  ]
}
