{
  "info": {
    "authors": [
      "Feiliang Ren",
      "Muhua Zhu",
      "Huizhen Wang",
      "Jingbo Zhu"
    ],
    "book": "Proceedings of the 2009 Named Entities Workshop: Shared Task on Transliteration (NEWS 2009)",
    "id": "acl-W09-3532",
    "title": "Chinese-English Organization Name Translation Based on Correlative Expansion",
    "url": "https://aclweb.org/anthology/W09-3532",
    "year": 2009
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Feiliang Ren, Muhua Zhu, Huizhen Wang, Jingbo Zhu",
        "Natural Language Processing Lab, Northeastern University, Shenyang, China",
        "{wanghuizhen,zhujingbo}@mail.neu.edu.cn",
        "This paper presents an approach to translating Chinese organization names into English based on correlative expansion.",
        "Firstly, some candidate translations are generated by using statistical translation method.",
        "And several correlative named entities for the input are retrieved from a correlative named entity list.",
        "Secondly, three kinds of expansion methods are used to generate some expanded queries.",
        "Finally, these queries are submitted to a search engine, and the refined translation results are mined and re-ranked by using the returned web pages.",
        "Experimental results show that this approach outperforms the compared system in overall translation accuracy."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "There are three main types of named entity: location name, person name, and organization name.",
        "Organization name translation is a subtask of named entity translation.",
        "It is crucial for many NLP tasks, such as cross-language information retrieval, machine translation, question and answering system.",
        "For organization name translation, there are two problems among it which are very difficult to handle.",
        "Problem I: There is no uniform rule that can be abided by to select proper translation methods for the inside words of an organization name.",
        "For example, a Chinese word \"^K^b\", when it is used as a modifier for a university, it is translated to Northeastern for \"jfcjtjk^/Northeastern University\", and is translated to Northeast for \"jfcjfc Ullk^^/Northeast Forestry University\", and is mapped to Chinese Pinyin Dongbei for \"jfcjtM ^k^kl^/Dongbei University of Finance and Economics\".",
        "It is difficult to decide which translation method should be chosen when we translate the inside words of an organization name.",
        "Problem II: There is no uniform rule that can be abided by to select proper translation order and proper treatment of particles Here particles refer to prepositions and articles) for an input organization name.",
        "For example, the organization name \" 4HSi£fS;fT /China Construction Bank\" and the organization name \"^H^ling ffT /Agricultural Bank of China\", they are very similar both in surface forms and in syntax structures, but their translation orders are different, and their treatments of particles are also different.",
        "Generally, there are two strategies usually used for named entity translation in previous research.",
        "One is alignment based approach, and the other is generation based approach.",
        "Alignment based approach (Chen et al.",
        "2003; Huang et al.",
        "2003; Hassan and Sorensen, 2005; and so on) extracts named entities translation pairs from parallel or comparable corpus by some alignment technologies, and this approach is not suitable to solve the above two problems.",
        "Because new organization names are constantly being created, and alignment based method usually fails to cover these new organization names that don't occur in the bilingual corpus.",
        "Traditional generation based approach (Al-Onaizan and Knight, 2002; Jiang et al. .2007; Yang et al.",
        "2008; and so on) usually consists of two parts.",
        "Firstly, it will generate some candidate translations for the input; then it will re-rank these candidate translations to assign the correct translations high ranks.",
        "Cheng and Zong [2008] proposed another generation based approach for organization name translation, which directly translates organization names according to their inherent structures.",
        "But their approach still can't solve the above two problems.",
        "This is because the amount of organization names is so huge and many of them have their own special translation rules to handle the above two problems.",
        "And the inherent structures don't reveal these translation rules.",
        "Traditional generation based approach is suitable for organization name translation.",
        "But in previous research, the final translation performance depends on the candidate translation generation process greatly.",
        "If this generation process failed, it is impossible to obtain correct result from the re-ranking process.",
        "In response to this, Huang et al.",
        "[2005] proposed a novel method that mined key phrase translation form web by using topic-relevant hint words.",
        "But in their approach, they removed the candidate translation generation process, which will improve extra difficult during mining phrase.",
        "Besides, in their approach, the features considered to obtain topic-relevant words are not so comprehensive, which will affect the quality of returned web pages where the correct translations are expected to be included.",
        "There is still much room for the improvement process of the topic-relevant words extraction.",
        "Inspired by the traditional generation based named entity translation strategy and the approach proposed by Huang et al., we propose an organization name translation approach that mining the correct translations of input organization name from the web.",
        "Our aim is to solve the above two problems indirectly by retrieving the web pages that contain the correct translation of the input and mining the correct translation from them.",
        "Given an input organization name, firstly, some candidate translations are generated by using statistical translation method.",
        "And several correlative named entities for the input are retrieved from a correlative named entity list.",
        "Secondly, expanded queries are generated by using three kinds of query expansion methods.",
        "Thirdly, these queries are submitted to a search engine, and the final translation results are mined and re-ranked by using the returned web pages.",
        "The rest of this paper is organized as follows, section 2 presents the extraction process of correlative named entities, section 3 presents a detail description of our translation method for Chinese organization name, and section 4 introduces our parameter evaluation method, and section 5 is the experiments and discussions part, finally conclusions and future work are given in section 6."
      ]
    },
    {
      "heading": "2. Extraction of Correlative Named Entities",
      "text": [
        "The key of our approach is to find some web pages that contain the correct translation of the input.",
        "With the help of correlative named entities (here if two named entities are correlative, it means that they are usually used to describe the same topic), it is easier to find such web pages.",
        "This is because that in the web, one web page usually has one topic.",
        "Thus if two named entities are correlative, they are very likely to occur in pair in some web pages.",
        "The correlative named entity list is constructed in advance.",
        "During translation, the correlative named entities for the input organization name are retrieved from this list directly.",
        "To set up this correlative named entity list, an about 180GB-sized collection of web pages are used.",
        "Totally there are about 100M web pages in this collection.",
        "Named entities are recognized from every web page by using a NER tool.",
        "This NER tool is trained by CRF model with the corpus from",
        "SIGHAN-2008.",
        "During the extraction of correlative named entities, the following features are considered.",
        "Co-occurrence in a Document The more often two named entities co-occur in a document, the more likely they are correlative.",
        "This feature is denoted as CoDi (n1, n2) , which means the cooccurrence of named entities n1 and n2 in a document D .",
        "This feature is also the main feature used in Huang et al.",
        "[2005].",
        "Co-occurrence in Documents The more often two named entities co-occur in different documents, the more likely they are correlative.",
        "This feature is denoted as CoDs(n1, n2), which means the number of documents that both n1 and n2 occur in.",
        "Distance The closer two named entities is in a document, the more likely they are correlative.",
        "This feature is denoted as DistDi (n1, n2), which means the number of words between n1 and n2 in a document D .",
        "Mutual Information Mutual information is a metric to measure the correlation degree of two words.",
        "The higher two named entities' mutual information, the more likely they are correlative.",
        "And the mutual information of named entities n1 and n2 in a document D is computed as following formula.",
        "p(ni) • p(n2)Jaccard Similarity Jaccard similarity is also a metric to measure the correlative degree of two words.",
        "The higher two named entities' Jaccard",
        "http://www.",
        "chasen.",
        "org/~taku/software/CRF++/ http://www.china-language.gov.cn/bakeoff08/",
        "similarity, the more likely they are correlative.",
        "And Jaccard similarity is computed as following formula.",
        "D(n ) + Z)(n2) - CoDs(n, n2) where D( nt ) is the number of documents that n occurs in, and CoDs(ni, nj ) is the number of documents that both n and n, occur in.",
        "TF-IDF TF-IDF is a weight computation method usually used in information retrieval.",
        "Here for a named entity ni, TF-IDF is used to measure the importance of its correlative named entities.",
        "The TF-IDF value of nJin a document",
        "D is computed as following formula.",
        "TF - IDF, (n ) = tfj x log-",
        "where tf j is the frequency of nj in document D , N is the number of total documents, and D(nJ )is the number of documents that nJ occurs in.",
        "During the process of feature combination, every feature is normalized, and the final correlative degree of two named entities is the linear combination of these normalized features, and it is computed as following formula.",
        "Finally, for every organization name n , its top-K correlative named entities are selected to construct the correlative named entity list.",
        "During translation, the correlative words for the input can be retrieved from this correlative list directly.",
        "If the input is not included in this list, the same method as in Huang et al.",
        "[2005] is used to obtain the needed correlative words.",
        "3 Organization Name Translation Based on Correlative Expansion",
        "The first step of our approach is to generate some candidate translations for every input organization name.",
        "As shown in table 1, these candidate translations are used as query stems during query expansion.",
        "We use Moses, a state of the art public machine translation tool, to generate such candidate translations.",
        "Here Moses is trained with the bilingual corpus that is from the 4thChina Workshop on Machine Translation.",
        "Total there are 868,947 bilingual Chinese-English sentence pairs on news domain in this bilingual corpus.",
        "Moses receives an organization name as input, and outputs the N-best results as the candidate translations of the input organization name.",
        "Total there are six features used in Moses: phrase translation probability, inverse phrase translation probability, lexical translation probability, inverse lexical translation probability, language model, and sentence length penalty.",
        "All the needed parameters are trained with MERT method (Och, 2003) by using a held-out development set.",
        "Because the amount of available web pages is so huge, the query submitted to search engine must be well designed.",
        "Otherwise, the search engine will return large amount of unrelated web pages.",
        "This will enlarge the difficulty of mining phase.",
        "Here three kinds of expansion methods are proposed to generate some queries by combining the clues given by statistical translation method and the clues given by correlative named entities of the input.",
        "And these correlative named entities are retrieved from the correlative named entities list before the query expansions process.",
        "These three kinds of expansions are explained as follows.",
        "Given an input organization name n , suppose si is one of its candidate translations, and n, is one of its correlative named entities.",
        "If can be reliably translated, we expand si with this reli-",
        "http://www.",
        "statmt.",
        "org/moses/",
        "a unique dictionary translation or it is a Chinese able translation t(nj) to form a query \" si + t(n )\".",
        "This kind of expansion is called as monolingual expansion.",
        "For two named entities, if they are correlative, their translations are likely correlative too.",
        "So their translations are also likely to occur in pair in some web pages.",
        "Suppose a query generated by this expansion is \"si +t(n )\", if the candidate translation si is the correct translation of the input, there must be some returned web pages that contain si completely.",
        "Otherwise, it is still possible to obtain some returned web pages that contain the correct translation.",
        "This is because that the search engine will return both the web pages that include the query completely and the web pages that include the query partly.",
        "And for a translation candidate si and the correct translation si', they are very likely to have some common words, so some of their returned web pages may overlap each other.",
        "Thus it can be expected that when we submit \" si +1(nj)\" to search engine, it will return some web pages that include \" si' +1(nJ) \" or include si'.",
        "This is very helpful for the mining phase.",
        "Given an input organization name ni , suppose si is one of its candidate translations, we expand si with ni to form a query \" si + ni \".",
        "This kind of expansion is called as bilingual expansion.",
        "Bilingual expansion is very useful to verify whether a candidate translation is the correct translation.",
        "To give readers more information or they are not sure about the translation of original named entity, the Chinese authors usually include both the original form of a named entity and its translation in the mix-language web pages [Fei Huang et al., 2005].",
        "So the correct translation pair is likely to obtain more supports from the returned web pages than those incorrect translation pairs.",
        "Thus bilingual expansion is very useful for the re-ranking phase.",
        "Besides, for an input organization name, if one of its incorrect candidate translations si is very similar to the correct translation si' in surface form, the correct translation is also likely to be contained in the returned web pages by using this kind of queries.",
        "The reason for this is the search mechanism of search engine, which has been explained above in monolingual expansion.",
        "Given an input organization name ni , suppose si is one of its candidate translations, and n is one of its correlative named entities.",
        "We expand si with n to form a query \" si + n \".",
        "This kind of expansion is called as mix-language expansion.",
        "Mix-language expansion is a necessary complement to the other two expansions.",
        "Besides, this mix-language expansion is more prone to obtain some mix-language web pages that may contain both the original input organization name and its correct translation.",
        "When the expanded queries are submitted to search engine, the correct translation of the input organization name may be contained in the returned web pages.",
        "Because the translation of an organization name must be also an organization name, we mine the correct translation of the input among the English organization names.",
        "Here we use the Stanford named entity recognition toolkits to recognize all the English organization names in the returned web pages.",
        "Then align these recognized organization names to the input by considering the following features.",
        "Mutual Translation Probability The translation probability measures the semantic equivalence between a source organization name and its target candidate translation.",
        "And mutual translation probability measures this semantic equivalence in two directions.",
        "For simplicity, here we use IBM model-1(Brown et al.",
        "1993), which computes two organization names' translation probability using the following formula.",
        "where p(fj \\ el )is the lexical translation probability.",
        "Suppose the input organization name is ni , si is one of the recognized English organiperson name and can be translated by Pinyin map ping.",
        "http://nlp.stanford.edu/software/CRF-NER.shtml zation names, the mutual translation probability of ni and si is computed as:",
        "Golden Translation Ratio For two organization names, their golden translation ratio is defined as the percentage of words in one organization name whose reliable transactions can be found in another organization name.",
        "This feature is used to measure the probability of one named entity is the translation of the other.",
        "It is computed as following formula.",
        "whereG(ni,Sj)is the number of golden translated words from ni to Sj , and G(Sj,ni) is the number of golden translated words from Sjtoni .",
        "Co-occurrence In Web Pages For an input organization name ni and a recognized candidate translation Sj , the more often they co-occur in different web pages, the more likely they are translations of each other.",
        "This feature is denoted as CoS (ni, ), which means the number of web pages that both n1 and Sjoccur in.",
        "Input Matching Ratio This feature is defined as the percentage of the words in the input that can be found in a returned web page.",
        "For those mix-language web pages, this feature is used to measure the probability of the correct translation occurring in a returned web page.",
        "It is computed as the following formula.",
        "where skis the k - th returned web page.",
        "Correlative Named Entities Matching Ratio",
        "This feature is defined as the percentage of the words in a correlative named entity that can be found in a returned web page.",
        "This feature is also used to measure the probability of the correct translation occurring in a returned web page.",
        "It is computed as the following formula.",
        "The final confidence score of n and tjto be a translation pair is measured by following formula.",
        "As in formula 4, here every factor will be is normalized during computation.",
        "I IMIR(ni, Sk )",
        "where K is the number of returned web pages, I is the number of correlative named entities for the input organization name.",
        "For every input organization name, we remain a fixed number of mined candidate translations with the highest confidence scores.",
        "And add them to the original candidate translation set to form a revised candidate translation set.",
        "The aim of mining is to improve recall.",
        "And in the re-ranking phase, we hope to improve precision by assigning the correct translation a higher rank.",
        "The features considered here for the re-ranking phase are listed as follows.",
        "Confidence Score The confidence score of n and tj is not only useful for the mining phase, but also is useful for the re-ranking phase.",
        "The higher this score, the higher rank this candidate translation should be assigned.",
        "Inclusion Ratio For Bilingual Query This feature is defined as the percentage of the returned web pages that the bilingual query is completely matched.",
        "It is computed as the following formula.",
        "where h(q )is the number of web pages that match the queryq completely, and H(q )is the total number of returned web pages for queryq .",
        "Candidate Inclusion Ratio for Monolingual Query and Mix-language Query This feature is defined as the percentage of the returned web pages that the candidate translation is completed matched.",
        "This feature for monolingual query is computed as formula j3, and this feature for mix-language query is computed as formula 14.",
        "where h( s) is the number of web pages that match the candidate translation S completely, and H (q )is the total number of returned web pages for query q .",
        "Finally, the above features are combined with following formula.",
        "where N is the number of candidate translations, M and Z are the number of monolingual queries and mix-language queries respectively.",
        "At last the revised candidate translation set is re-ranked according to this formula, and the topic results are outputted as the input's translation results."
      ]
    },
    {
      "heading": "4. Parameters Evaluations",
      "text": [
        "In above formula (4), formula (jj) and formula (15), the parameters A are interpolation feature weights, which reflect the importance of different features.",
        "We use some held-our organization name pairs as development set to train these parameters.",
        "For those parameters in formula (4), we used those considered features solely one by one, and evaluated their importance according to their corresponding inclusion ratio of correct translations when using mix-language expansion and the final weights are assigned according to the following formula.",
        "Inclus'onRatei (jg) I Inclus'onRatei",
        "Where Inclus'onRatei is the inclusion rate when considered feature f only.",
        "The inclusion rate is defined as the percentage of correct translations that are contained in the returned web pages as Huang et al.",
        "[2005] did.",
        "To obtain the parameters in formula (jj), we used those considered features solely one by one, and computed their corresponding precision on development set respectively, and final weights are assigned according to following formula.",
        "Where P is the precision when considered feature f only.",
        "And for the parameters in formula (j5), their assignment method is the same with the method used for formula (jj)."
      ]
    },
    {
      "heading": "5. Experiments and Discussions",
      "text": [
        "We use a Chinese to English organization name translation task to evaluate our approach.",
        "The experiments consist of four parts.",
        "Firstly, we evaluate the contribution of the correlative named entities for obtaining the web pages that contain the correct translation of the input.",
        "Secondly, we evaluate the contribution of different query expansion methods.",
        "Thirdly, we investigate to which extents our approach can solve the two problems mentioned in section 1.",
        "Finally, we evaluate how much our approach can improve the overall recall and precision.",
        "Note that for simplicity, we use 10-best outputs from Moses as the original candidate translations for every input.",
        "And the search engine used here is Live.",
        "The test set consists of 247 Chinese organization names recognized from 2,000 web pages that are downloaded from Sina.",
        "These test organization names are translated by a bilingual speaker given the text they appear in.",
        "And these translations are verified from their official government web pages respectively.",
        "During translation, we don't use any contextual information.",
        "The contribution of correlative named entities is evaluated by inclusion rate, and we compare the inclusion rate with different amount of correlative named entities and different amount of returned web pages.",
        "The experimental results are shown in Table 1 (here we use all these three kinds of expanding strategies)._ # of correlative named enti_ ties used _",
        "#of web pages used-",
        "Table J.",
        "Comparisons of inclusion rate From these results we can find that our approach obtains an inclusion rate of 82% when we use j0 correlative named entities and j0 returned web pages.",
        "We notice that there are some Chinese organization names whose correct English translations have multiple standards.",
        "For example, the organization name \"HKjnF'is translated http:IIwww.live.comI http:IInews.sina.com.cnI",
        "#of web pages usedinto \"Department of Defense\" when it refers to a department in US, but is translated into \"Ministry of Defence\" when it refers to a department in UK or in Singapore.",
        "This problem affects the actual inclusion rate of our approach.",
        "Another factor that affects the inclusion rate is the search engine used.",
        "There is a small difference in the inclusion rate when different search engines are used.",
        "For example, the Chinese organization name \"4Mff^T/China CITIC Bank\", because the word \"^itl\" is an out-of-vocabulary word, the best output from Moses is \"of the bank\".",
        "With such candidate translation, none of our three expansion methods works.",
        "But when we used Google as search engine instead, we mined the correct translation.",
        "From these results we can conclude that by using correlative named entities, the returned web pages are more likely to contain the correct translations of the input organization names.",
        "In this section, we evaluate the contribution of these three query expansion methods respectively.",
        "To do this, we use them one by one during translation, and compare their inclusion rates respectively.",
        "Experimental results are shown in Table 2.",
        "#of web pages",
        "Monolingual Expansion",
        "Bilingual Expansion # of correlative named entities used |rVlix-language|_ Expansion Only",
        "Table 2.",
        "Inclusion rate of different kinds of query expansion methods From Table 2 we can see that bilingual expansion and mix-language expansion play greater roles than monolingual expansion in obtaining the web pages that contain the correct translations of the inputs.",
        "This is because the condition of generating monolingual queries is too strict, which requires a reliable translation for the correlative named entity.",
        "In most cases, this condition cannot be satisfied.",
        "So for many input organization names, we cannot generate any monolingual queries for them at all.",
        "This is the reason why monolingual expansion obtains so poorer an inclusion rate compared with the other two expansions.",
        "To evaluate the true contribution of monolingual expansion method, we carry out another experiment.",
        "We select j0 organization names randomly from the test set, and translate all of their correlative named entities into English by a bilingual speaker.",
        "Then we evaluate the inclusion rate again on this new test set.",
        "The experimental results are shown in Table 3._",
        "Table 3.",
        "Inclusion rate for monolingual expansion on new test set From Table 3 we can conclude that, if most of the correlative named entities can be reliably translated, the queries generated by this monolingual expansion will play greater role in obtaining the web pages that contain the correct translations of the inputs.",
        "From those results in Table 2 we can conclude that, these three kinds of expansions complement each other.",
        "Using them together can obtain higher inclusion rate than using anyone of them only.",
        "In this section, we investigate to which extents our approach can solve the two problems mentioned in section j.We compare the wrong translation numbers caused by these two problems (another main kind of translation error is caused by the translation of out-of-vocabulary words) between Voses and our approach.",
        "The experimental results are shown in Table 4._ __Moses Results Our method",
        "Table 4.",
        "Comparison of error numbers From Table 4 we can see that our approach is very effective on solving these two problems.",
        "Almost all of the errors caused by these two problems are corrected by our approach.",
        "Only three wrong translations are not corrected.",
        "This is because that there are some Chinese organization names whose correct English translations have multiple standards, such as the correct translation of organization name \" HKjrP \"depends on its nationality, which has been explained in section 5.2.",
        "1",
        "used 5",
        "10",
        "1",
        "0.002",
        "0.002",
        "0.004",
        "5",
        "0.017",
        "0.019",
        "0.019",
        "10",
        "0.021",
        "0.037",
        "0.051",
        "1",
        "0.112",
        "0.159",
        "0.174",
        "5",
        "0.267",
        "0.327",
        "0.472",
        "10",
        "0.285",
        "0.414",
        "0.669",
        "1",
        "0.098",
        "0.138",
        "0.161",
        "5",
        "0.231",
        "0.307",
        "0.386",
        "10",
        "0.249",
        "0.398",
        "0.652",
        "In this section, we compare our approach with other two methods: Moses and the approach proposed by Huang et al.",
        "[2005].",
        "We compare their accuracy of Top-K results.",
        "For both our approach and Huang et al.",
        "'s approach, we use 10 correlative words for each input organization name and use 10 returned web pages for mining the correct translation result.",
        "The experimental results are shown in Table 5.",
        "Moses is a state-of-the-art translation method, but it can hardly handle the organization name translation well.",
        "In addition to the errors caused by the above two problems mentioned in section 1, the out-of-vocabulary problem is another obstacle for Moses.",
        "For example, when translating the organization name \" H^^^ffJE /International Tsunami Information Centre\", because the word \"$JPf|\" is an out-of-vocabulary word, Moses fails to give correct translation.",
        "But for those approaches that have a web mining process during translation, both the out-of-vocabulary problem and the two problems mentioned in section 1 are less serious.",
        "This is the reason that Moses obtains the lowest performance compared with the other two approaches.",
        "Our approach is also superior to Huang's method, as shown in the above table.",
        "We think this is because of the following three reasons.",
        "The first reason is that in our approach, we use a translation candidate generation process.",
        "Although these candidates are usually not so good, they can still provide some very useful clue information for the web retrieval process.",
        "The second reason is that the features considered for correlative words extraction in our approach are more comprehensive.",
        "Most of the time (except for the case that the input is not included in the correlative word list) our approach is more prone to obtain better correlative words for the input.",
        "The third reason is that our approach use more query expansion strategies than Huang's approach.",
        "These expansion strategies may complement each other and improve the probability of obtaining the web pages that contain the correct translations For example, both Moses and Huang's approach failed to translate the organization name \"H^^fttfB + 'LV'.",
        "But in our approach, with the candidate translation \"International Information Centre\" that is generated by Moses, our approach still can obtain the web page that contains the correct translation when using bilingual expansion.",
        "Thus the correct translation \"International Tsunami Information Centre\" is mined out during the sequent mining process.",
        "From table 5 we also notice that the final recall of our approach is a little lower than the inclusion rate as show in table 1.",
        "This means that our approach doesn't mine all the correct translations that are contained in the returned web pages.",
        "One of the reasons is that some of the input organization names are not clearly expressed.",
        "For example, an input organization name \"iijJl^Ll))\" S\", although its correct translation \"University of California, Berkeley\" is contained in the returned web pages, this correct translation cannot be mined out by our approach.",
        "But if it is expressed as \"fti^^l^^ffi^^^t\", its correct translation can be mined from the returned web pages easily.",
        "Besides, the recognition errors of NER toolkits will also reduce the final recall of our approach."
      ]
    },
    {
      "heading": "6. Conclusions and Future Work",
      "text": [
        "In this paper, we present a new organization name translation approach.",
        "It uses some correlative named entities of the input and some query expansion strategies to help the search engine to retrieve those web pages that contain the correct translation of the input.",
        "Experimental results show that for most of the inputs, their correct translations are contained in the returned web pages.",
        "By mining these correct translations and re-ranking them, the two problems mentioned in section 1 are solved effectively.",
        "And recall and precision are also improved correspondingly.",
        "In the future, we will try to improve the extraction perform of correlative named entities.",
        "We will also try to apply this approach to the person name translation and location name translation."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work was supported by the open fund of National Laboratory of Pattern Recognition, Institute of Automation Chinese Academy of Science, P.R.C, and was also supported in part by National Science Foundation of China (60873091), Natural Science Foundation of Liaoning Province (20072032) and Shenyang Science and Technology Plan (1081235-1-00).",
        "Moses Results",
        "Huang's Results",
        "Our Results",
        "Top 1",
        "0.09",
        "0.44",
        "0.53",
        "Top 5",
        "0.18",
        "0.61",
        "0.73",
        "Top 10",
        "0.31",
        "0.68",
        "0.79"
      ]
    }
  ]
}
