{
  "info": {
    "authors": [
      "John Hale"
    ],
    "book": "Proceedings of the 11th International Conference on Parsing Technologies (IWPT’09)",
    "id": "acl-W09-3837",
    "title": "Heuristic search in a cognitive model of human parsing",
    "url": "https://aclweb.org/anthology/W09-3837",
    "year": 2009
  },
  "references": [],
  "sections": [
    {
      "text": [
        "John T. Hale",
        "Cornell University 217 Morrill Hall Ithaca, New York 14853",
        "We present a cognitive process model of human sentence comprehension based on generalized left-corner parsing.",
        "A search heuristic based upon previously-parsed corpora derives garden path effects, garden path paradoxes, and the local coherence effect."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "One of the most interesting applications of parsing technology has, for some researchers, been psycholinguistic models (Kay, 2005).",
        "Algorithmic models of language use have led in the past to a variety of cognitive insights (Kaplan, 1972; Marcus, 1980; Thibadeau et al., 1982; Pereira, 1985; Pulman, 1986; Johnson, 1989; Stabler, 1994).",
        "However they are challenged by a veritable tidal wave of new data collected during the 1990s and 2000s.",
        "Work during this later period reveals phenomena, such as the local coherence effect discussed in section 5, that have yet to be truly integrated into any particular theoretical framework.",
        "This short paper presents a parsing system intended to serve as a model of the syntactic part of human sentence comprehension.",
        "Such a model helps make sense of sentence-difficulty data from self-paced reading, eye-tracking and other behavioral studies.",
        "It also sketches a relationship between calculations carried out in the course of automated syntactic analysis and the inferences about linguistic structure taking place in our minds during ordinary sentence-understanding.",
        "Section 2 defines the model itself, highlighting its relationship to generalized left-corner parsing.",
        "Sections 3-5 apply this model to three controversial phenomena that are well-established in the psycholinguistics literature.",
        "Section 6 concludes."
      ]
    },
    {
      "heading": "2. Architecture of the model",
      "text": [
        "We model the human sentence comprehension mechanism as search within a problem space (Newell and Simon, 1972).",
        "We assume that all (incremental) parser states have a (partial) grammatical interpretation (Chomsky, 1965, 9).",
        "In this paper, the grammatical interpretation employs context-free grammar.",
        "An inventory of operators carries the model from one point in the problem space to another.",
        "In the interest of simplicity, we place no bound on the number of problem states the model can explore.",
        "However, we do acknowledge with Johnson-Laird (1983) and Resnik (1992) a pressure to minimize memory consumption internal to a problem state.",
        "The model's within-problem state memory usage should reflect human acceptability judgments with embedded sentences.",
        "These considerations motivate a generalized left-corner (GLC) parsing strategy (Demers, 1977) whose stack consumption is maximal on just the center-embedded examples that are so difficult for people to understand.",
        "To reflect the argument/adjunct distinction (Tutun-jian and Boland, 2008) we adopt a mixed strategy that is bottom-up for optional postmodifiers but left-corner everywhere else.",
        "Leaving the arc-eager/arc-standard decision (Abney and Johnson, 1991) to the control policy allows four possible operators, schematized in Table 1.",
        "Informed search differs from uninformed search procedures such as depth-first and breadth-first by making use of heuristic knowledge about the search domain.",
        "The strategy is to choose for expansion the node whose cost is lowest (Barr and Feigenbaum, 1981, 61).",
        "In A* search (Hart et al., 1968) this cost is divided up into a sum consisting of the known cost to reach a search node and an",
        "stack n E [steps] standard error",
        "trast between 1a and 1b is an example of this phenomenon.",
        "(1) a. while Mary was mending a sock fell on the floor b. while Mary was mending, a sock fell on the floor",
        "The control condition 1b includes a comma which, in spoken language, would be expressed as a prosodic break (Carroll and Slowiaczek, 1991; Speeretal., 1996).",
        "Figure 1 shows the search space explored in the experimental condition 1a.",
        "In this picture, ovals represent problem states.",
        "The number inside the oval encodes the vistation order.",
        "Arcs between ovals represent operator applications.",
        "The path (14, 22, 23, 24, 25, 29, 27) is the garden path which builds a grammatical interpretation where a sock is attached as a direct object of the verb mend.",
        "The grey line highlights the order in which A* search considers this path.",
        "At state 21 after shifting sock, experience with the Brown corpus suggests reconsidering the garden path.",
        "Whereas the model examines 45 search nodes during the analysis of the temporarily ambiguous item 1a, it dispatches the unambiguous item 1b after only 40 nodes despite that sentence having an additional token (the comma).",
        "Garden paths, on this view, are sequences of parser states explored only in a temporarily ambiguous item."
      ]
    },
    {
      "heading": "4. Garden pathing counterexamples",
      "text": [
        "Purely structural attachment preferences like Right Association (Kimball, 1973) and Minimal Attachment (Frazier and Fodor, 1978; Pereira, 1985) are threatened by paradoxical counterexamples such as 2 from Gibson (1991, 22) where no fixed principle yields correct predictions across both examples.",
        "(2) a. I gave her earrings on her birthday .",
        "b. I gave her earrings to another girl .",
        "A parser guided by Hypothesis 1 interleaves the garden path attachment and the globally-correct attachment in both cases, resulting in a search that",
        "Table 2: Popular left-corner parser states.",
        "Stacks grow to the left.",
        "The categories are as described in estimate of the costs involved in finishing search from that node.",
        "In this work, rather than relying on the guarantee provided by the A* theorem, we examine the exploration pattern that results from an inadmissable completion cost estimator.",
        "The choice of estimator is Hypothesis 1.",
        "Hypothesis 1 Search in parsing is informed by an estimate of the expected number of steps to completion, given previous experience.",
        "Table 2 writes out the expected number of steps to completion (E[steps]) for a selection of problem states binned together according to their grammatical interpretation.",
        "Categories enclosed in square brackets are predicted top-down whereas unbracketed have been found bottom-up.",
        "These states are some of the most popular states visited during a simulation of parsing the Brown corpus (Kucera and Francis, 1967; Marcus et al., 1993) according to the mixed strategy introduced above in subsection 2.1.",
        "The quantity E[steps] serves in what follows as the completion cost estimate in A* search."
      ]
    },
    {
      "heading": "3. Garden pathing",
      "text": [
        "Any model of human sentence comprehension should address the garden path effect.",
        "The conis strictly committed to neither analysis.",
        "In 2a, 32% of discovered states represent the globally-incorrect attachment of her.",
        "In 2b, 27% of states represent the globally-incorrect attachment of her to give as a one-word direct object.",
        "The paradox for purely structural attachment heuristics is dissolved by the observation that neither pathway fully achieves priority over the other.",
        "shift a word W",
        "project a rule LHS – Trigger ^ Rest",
        "scan the sought word W",
        "project and match the sought parent LHS using the rule LHS – Trigger Rest",
        "[VP] S [TOP]",
        "55790",
        "44.936",
        "0.1572",
        "S [TOP]",
        "53991",
        "10.542",
        "0.0986",
        "[NP] S [TOP]",
        "43635",
        "33.092",
        "0.1633",
        "NP [TOP]",
        "38844",
        "55.791",
        "0.2126",
        "NP [S] S [TOP]",
        "34415",
        "47.132",
        "0.2122",
        "[S] S [TOP]",
        "33578",
        "52.800",
        "0.2195",
        "[PP] S [TOP]",
        "30693",
        "34.454",
        "0.1915",
        "IN [PP] S [TOP]",
        "27272",
        "32.379",
        "0.2031",
        "DT [NP] S [TOP]",
        "22375",
        "34.478",
        "0.2306",
        "[AUX] [VP] S [TOP]",
        "16447",
        "46.536",
        "0.2863",
        "VBD [VP] S [TOP]",
        "16224",
        "43.057",
        "0.2826",
        "VB [VP] S [TOP]",
        "13548",
        "40.404",
        "0.3074",
        "the [NP] S [TOP]",
        "12507",
        "34.120",
        "0.3046",
        "NP [NP] S [TOP]",
        "12092",
        "43.821",
        "0.3269",
        "DT [TOP]",
        "10440",
        "66.452",
        "0.3907"
      ]
    },
    {
      "heading": "5. Local Coherence",
      "text": [
        "Tabor et al.",
        "(2004) discovered a processing difficulty phenomenon called \"local coherence.\"",
        "Among the stimuli they considered, the locally-coherent condition is 3a where the substring the player tossed afrisbee could be analyzed as a sentence, if considered in isolation.",
        "(3) a.",
        "The coach smiled at the player tossed a frisbee by the opposing team.",
        "b.",
        "The coach smiled at the player thrown a frisbee by the opposing team",
        "c. The coach smiled at the player who was tossed a frisbee by the opposing team.",
        "d. The coach smiled at the player who was thrown a frisbee by the opposing team.",
        "Tabor and colleagues observe an interaction between the degree of morphological ambiguity of the embedded verb (tossed or thrown) and the presence or absence of the relative-clause initial words who was.",
        "These two factors are known as ±ambiguity and ±reduction, respectively.",
        "If the human parser were making full use of the grammar, its operation would reflect the impossibility of continuing the coach smiled at... with a sentence.",
        "The ungrammaticality of a sentence in this left context would preclude any analysis of the player as a subject of active voice toss.",
        "But greater reading times observed on the ambiguous tossed as compared to the unambiguous thrown suggest contrariwise that this grammatical deduction is not made uniformly based on the left context.",
        "Table 3 shows how an informed parser's step counts, when guided by Hypothesis 1, derive Tabor et al.",
        "'s observed pattern.",
        "The cell predicted to be hardest is the local coherence, shaded gray.",
        "The degree of worsening due to relative clause reduction is greater in +ambiguous than in – ambiguous.",
        "This derives the observed interaction.",
        "+reduced +ambiguous – ambiguous 4",
        "Table 3: Count of states examined"
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "When informed by experience with the Brown corpus, the parsing system described in this paper exhibits a pattern of \"time-sharing\" performance that corresponds to human behavioral difficulty in three controversial cases.",
        "The built-in elements – context-free grammar, generalized left-corner parsing and the A*-type cost function – are together adequate to address a range of comprehension difficulty phenomena without imposing an a priori memory limit.",
        "The contribution is an algorithmic-level account of the cognitive processes involved in perceiving syntactic structure."
      ]
    }
  ]
}
