{
  "info": {
    "authors": [
      "Jun Sun",
      "Min Zhang",
      "Chew Lim Tan"
    ],
    "book": "ACL-IJCNLP",
    "id": "acl-P09-1103",
    "title": "A non-contiguous Tree Sequence Alignment-based Model for Statistical Machine Translation",
    "url": "https://aclweb.org/anthology/P09-1103",
    "year": 2009
  },
  "references": [
    "acl-C08-1138",
    "acl-J04-4002",
    "acl-N03-1017",
    "acl-P02-1040",
    "acl-P03-1054",
    "acl-P03-2041",
    "acl-P05-1034",
    "acl-P06-1077",
    "acl-P06-1121",
    "acl-P06-1123",
    "acl-P07-1089",
    "acl-P07-2045",
    "acl-P08-1064",
    "acl-W02-1018",
    "acl-W06-1606"
  ],
  "sections": [
    {
      "text": [
        "The tree sequence based translation model allows the violation of syntactic boundaries in a rule to capture non-syntactic phrases, where a tree sequence is a contiguous sequence of subtrees.",
        "This paper goes further to present a translation model based on non-contiguous tree sequence alignment, where a non-contiguous tree sequence is a sequence of sub-trees and gaps.",
        "Compared with the contiguous tree sequence-based model, the proposed model can well handle non-contiguous phrases with any large gaps by means of non-contiguous tree sequence alignment.",
        "An algorithm targeting the noncontiguous constituent decoding is also proposed.",
        "Experimental results on the NIST MT-05 Chinese-English translation task show that the proposed model statistically significantly outperforms the baseline systems."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Current research in statistical machine translation (SMT) mostly settles itself in the domain of either phrase-based or syntax-based.",
        "Between them, the phrase-based approach (Marcu and Wong, 2002; Koehn et al., 2003; Och and Ney, 2004) allows local reordering and contiguous phrase translation.",
        "However, it is hard for phrase-based models to learn global reorderings and to deal with noncontiguous phrases.",
        "To address this issue, many syntax-based approaches (Yamada and Knight, 2001; Eisner, 2003; Gildea, 2003; Ding and Palmer, 2005; Quirk et al., 2005; Zhang et al., 2007, 2008a; Bod, 2007; Liu et al., 2006, 2007; Hearne and Way, 2003) tend to integrate more syntactic information to enhance the non-contiguous phrase modeling.",
        "In general, most of them achieve this goal by introducing syntactic non-terminals as translational equivalent placeholders in both source and target sides.",
        "Nevertheless, the generated rules are strictly required to be derived from the contiguous translational equivalences (Galley et al., 2006; Marcu et al., acquire the non-contiguous phrasal rules from the contiguous tree sequence pairs, and find them useless via real syntax-based translation systems.",
        "However, Wellington et al.",
        "(2006) statistically report that discontinuities are very useful for translational equivalence analysis using binary branching structures under word alignment and parse tree constraints.",
        "Bod (2007) also finds that discontinues phrasal rules make significant improvement in linguistically motivated STSG-based translation model.",
        "The above observations are conflicting to each other.",
        "In our opinion, the non-contiguous phrasal rules themselves may not play a trivial role, as reported in Zhang et al.",
        "(2008a).",
        "We believe that the effectiveness of non-contiguous phrasal rules highly depends on how to extract and utilize them.",
        "To verify the above assumption, suppose there is only one tree pair in the training data with its alignment information illustrated as Fig. 1(a) .",
        "A test sentence is given in Fig. 1(b): the source sentence with its syntactic tree structure as the upper tree and the expected target output with its syntactic structure as the lower tree.",
        "In the tree sequence alignment based model, in addition to the entire tree pair, it is capable to acquire the contiguous tree sequence pairs: TSP (1~4) in Fig. 1.",
        "By means of the rules derived from these contiguous tree sequence pairs, it is easy to translate the contiguous phrase 'Mife/he liiS/show up fHj/'s\".",
        "As for the non-contiguous phrase \"fij/at, ***, Bflgt/time\", the only related rule is r1 derived from TSP4 and the entire tree pair.",
        "However, the source side of r1 does not match the source tree structure of the test sentence.",
        "Therefore, we can only partially translate the illustrated test sentence with this training sample.",
        "As discussed above, the problem lies in that the non-contiguous phrases derived from the contiguous tree sequence pairs demand greater reliance on the context.",
        "Consequently, when applying those rules to unseen data, it may suffer from the data sparseness problem.",
        "The expressiveness of the model also slacks due to their weak ability of generalization.",
        "To address this issue, we propose a syntactic translation model based on non-contiguous tree sequence alignment.",
        "This model extracts the translation rules not only from the contiguous tree sequence pairs but also from the non-contiguous tree sequence pairs where a non-contiguous tree sequence is a sequence of sub-trees and gaps.",
        "With the help of the non-contiguous tree sequence, the proposed model can well capture the noncontiguous phrases in avoidance of the constraints of large applicability of context and enhance the non-contiguous constituent modeling.",
        "As for the above example, the proposed model enables the non-contiguous tree sequence pair indexed as TSP5 in Fig. 1 and is allowed to further derive r2from TSP5.",
        "By means of r2 and the same processing to the contiguous phrase \" /he /show up fHj/'s\" as the contiguous tree sequence based model, we can successfully translate the entire source sentence in Fig. 1(b).",
        "We define a synchronous grammar, named Synchronous non-contiguous Tree Sequence Substitution Grammar (SncTSSG), extended from synchronous tree substitution grammar (STSG: Chiang, 2006) to illustrate our model.",
        "The proposed synchronous grammar is able to cover the previous proposed grammar based on tree (STSG, Eisner, 2003; Zhang et al., 2007) and tree sequence (STSSG, Zhang et al., 2008a) alignment.",
        "Besides, we modify the traditional parsing based decoding algorithm for syntax-based SMT to facilitate the non-contiguous constituent decoding for our model.",
        "To the best of our knowledge, this is the first attempt to acquire the translation rules with rich syntactic structures from the non-contiguous Translational Equivalences (non-contiguous tree sequence pairs in this context).",
        "The rest of this paper is organized as follows: Section 2 presents a formal definition of our model with detailed parameterization.",
        "Sections 3 and 4 elaborate the extraction of the non-contiguous tree sequence pairs and the decoding algorithm respectively.",
        "The experiments we conduct to assess the effectiveness of the proposed method are reported in Section 5.",
        "We finally conclude this work in Section 6."
      ]
    },
    {
      "heading": "2. Non-Contiguous Tree sequence Alignment-based Model",
      "text": [
        "In this section, we give a formal definition of SncTSSG and accordingly we propose the alignment based translation model.",
        "The details of probabilistic parameterization are elaborated based on the log-linear framework.",
        "Extended from STSG (Shiever, 2004), SncTSSG can be formalized as a quintuple G = <£s , Zt, Ns, Nt, R>, where:",
        "• Es and £t are source and target terminal alphabets (words) respectively, and",
        "• Ns and Nt are source and target nonterminal alphabets (linguistically syntactic tags, i.e. NP, VP) respectively; as well as the non-terminal < *** > to denote a gap,",
        "Figure 2: A word-aligned parse tree pair < *** > can represent any syntactic or non-syntactic tree sequences, and",
        "R is a production rule set consisting of rules derived from corresponding contiguous or non-contiguous tree sequence pairs, where a rule is a pair of contiguous or noncontiguous tree sequence with alignment relation between leaf nodes across the tree sequence pair.",
        "A non-contiguous tree sequence translation rule r 6 R can be further defined as a triple r =< sequence, covering the span set M =• TS(f (M.fc ))is a non-contiguous source tree",
        "A < jl which means each subspan has nonzero width and )\\ < which means there is a non-zero gap between each pair of consecutive intervals.",
        "A gap of interval [/2,7i+1] is denoted as < *** >, and ti",
        "• TS(e(iV.j)) is a non-contiguous target tree",
        "sequence, covering the span set N = {[i[,il2]\\l = l,..-,n} in T(e[), where i{ < i| which means each subspan has non-zero width and i| < which means there is a non-zero gap between each pair of consecutive intervals.",
        "A gap of interval [il, is denoted as < *** >, and",
        "• A are the alignments between leaf nodes of the source and target non-contiguous tree sequences, satisfying the following conditions :",
        "In SncTSSG, the leaf nodes in a non-contiguous tree sequence rule can be either non-terminal symbols (grammar tags) or terminal symbols (lexical words) and the non-terminal symbols with the same index which are subsumed simultaneously are not required to be contiguous.",
        "Fig.",
        "4 shows two examples of non-contiguous tree sequence rules (\"non-contiguous rule\" for short in the following context) derived from the noncontiguous tree sequence pair (in Fig. 3) which is extracted from the bilingual tree pair in Fig. 2.",
        "Between them, ncTSr1 is a tree rule with internal nodes non-contiguously subsumed from a contiguous tree sequence pair (dashed in Fig. 2) while ncTSr2 is a non-contiguous rule with a contiguous source side and a non-contiguous target side.",
        "Obviously, the non-contiguous tree sequence rule ncTSr2 is more flexible by neglecting the context among the gaps of the tree sequence pair while capturing all aligned counterparts with the corresponding syntactic structure information.",
        "We expect these properties can well address the issues of non-contiguous phrase modeling.",
        "Given the source and target sentence /^and e\\, as well as the corresponding parse trees T(f^) and T(e[), our approach directly approximates the posterior probability Pr(T(e{')\\T(fi')') based on the log-linear framework:",
        "In this model, the feature function hm is log-linearly combined by the corresponding parameter .^(Och and Ney, 2002).",
        "The following features are utilized in our model:",
        "1) The bi-phrasal translation probabilities",
        "2) The bi-lexical translation probabilities",
        "3) The target language model",
        "4) The # of words in the target sentence",
        "5) The # of rules utilized",
        "6) The average tree depth in the source side of the rules adopted",
        "7) The # of non-contiguous rules utilized",
        "8) The # of reordering times caused by the utilization of the non-contiguous rules",
        "Feature 1~6 can be applied to either STSSG or SncTSSG based models, while the last two targets SncTSSG only."
      ]
    },
    {
      "heading": "3. Tree Sequence Pair Extraction",
      "text": [
        "In training, other than the contiguous tree sequence pairs, we extract the non-contiguous ones as well.",
        "Nevertheless, compared with the contiguous tree sequence pairs, the non-contiguous ones suffer more from the tree sequence pair redundancy problem that one non-contiguous tree sequence pair can be comprised of two or more unrelated and nonadjacent contiguous ones.",
        "To model the contiguous phrases, this problem is actually trivial, since the contiguous phrases stay adjacently and share the related syntactic constraints; however, as for non-contiguous phrase modeling, the cohesion of syntactically and semantically unrelated tree sequence pairs is more likely to generate noisy rules which do not benefit at all.",
        "In order to minimize the number of redundant tree sequence pairs, we limit the # of gaps of non-contiguous tree seAlgorithm 1: Tree Sequence Pair Extraction_ Input: source tree and target tree Output: the set of tree sequence pairs_ Data structure:",
        "p\\jn j2] to store tree sequence pairs covering source 1: foreach source span j2], do",
        "2: find a target span [ij;i2] with minimal length covering all the target words aligned to j2]",
        "3: if all the target words in [i1,i2] are aligned with source words only in j2], then",
        "4: Pair each source tree sequence covering [jj, j2] with those in target covering [ij,i2] as a contiguous tree sequence pair",
        "7: create sub-span set s([ij,i2]) to cover all the target words aligned to [jj, j2]",
        "8: Pair each source tree sequence covering j2] with each target tree sequence covering s([ij,i2]) as a non-contiguous tree sequence pair 12: foreach target span [ij,i2], do 13: find a source span [jj, j2] with minimal length",
        "covering all the source words aligned to [ij,i2] 14: if any source word in j2] is aligned with target words outside [ij,i2], then 15: create sub-span set s([jj, j2]) to cover all the",
        "source words aligned to [ij,i2] 16: Pair each source tree sequence covering s([jj, j2]) with each target tree sequence covering [ij,i2] as a non-contiguous tree sequence pair 17: Insert them into p[jj, j2] 18: end if 19: end do quence pairs to be 0 in either source or target side.",
        "In other words, we only allow one side to be noncontiguous (either source or target side) to partially reserve its syntactic and semantic cohesion.",
        "We further design a two-phase algorithm to extract the tree sequence pairs as described in Algorithm 1.",
        "For the first phase (line 1-11), we extract the contiguous tree sequence pairs (line 3-5) and the non-contiguous ones with contiguous tree sequence in the source side (line 6-9).",
        "In the second phase (line 12-19), the ones with contiguous tree sequence in the target side and non-contiguous tree sequence on the source side are extracted.",
        "Data structure:",
        "The extracted tree sequence pairs are then utilized to derive the translation rules.",
        "In fact, both the contiguous and non-contiguous tree sequence pairs themselves are applicable translation rules; we denote these rules as Initial rules.",
        "By means of the Initial rules, we derive the Abstract rules similarly as in Zhang et al.",
        "(2008a).",
        "Additionally, we develop a few constraints to limit the number of Abstract rules.",
        "The depth of a tree in a rule is no greater than h. The number of non-terminals as leaf nodes is no greater than c. The tree number is no greater than d. Besides, the number of lexical words at leaf nodes in an Initial rule is no greater than l. The maximal number of gaps for a non-contiguous rule is no greater than g."
      ]
    },
    {
      "heading": "4. The Pisces decoder",
      "text": [
        "We implement our decoder Pisces by simulating the span based CYK parser constrained by the rules of SncTSSG.",
        "The decoder translates each span iteratively in a bottom up manner which guarantees that when translating a source span, any of its sub-spans is already translated.",
        "For each source span j2], we perform a three-phase decoding process.",
        "In the first phase, the source side contiguous translation rules are utilized as described in Algorithm 2.",
        "When translating using a source side contiguous rule, the target tree sequence of the rule whether contiguous or noncontiguous is directly considered as a candidate translation for this span (line 3), if the rule is an Initial rule; otherwise, the non-terminal leaf nodes are replaced with the corresponding sub-spans' translations (line 5).",
        "In the second phase, the source side noncontiguous rules for [ji, j2] are processed.",
        "As for Algorithm 2: Contiguous rule processing_ h[jj, j2]to store translations covering source span[jj, j2] 1: foreach rule r contiguous in source span [jj, j2], do",
        "if r is an Initial rule, then insert r into h[jj, j2]",
        "else IIAbstract rule generate translations by replacing the nonterminal leaf nodes of r with their corresponding spans' translation insert the new translation into h[jj, j2] the ones with non-terminal leaf nodes, the replacement with corresponding spans' translations is initially performed in the same way as with the contiguous rules in the first phase.",
        "After that, an operation specified for the source side noncontiguous rules named \"Source gap insertion\" is performed.",
        "As illustrated in Fig. 5, to use the noncontiguous rule ri, which covers the source span attained, then the translations to the gap span [1,3] is acquired from the previous steps and is inserted either to the right or to the left of \"IN(in)\".",
        "The insertion is rather cohesion based but leaves a gap <***> for further \"Target tree sequence reordering\" in the next phase if necessary.",
        "In the third phase, we carry out the other noncontiguous rule specific operation named \"Target tree sequence reordering\".",
        "Algorithm 3 gives an overview of this operation.",
        "For each source span, we first binarize the span into the left one and the right one.",
        "The translation hypothesis for this span is generated by firstly inserting the candidate translations of the right span to each gap in the ones of the left span respectively (line 2-9) and then repeating in the alternative direction (line10-17).",
        "The gaps for the insertion of the tree sequences in the target side are generated from either the inheritAlgorithm 3: Target tree sequence reordering Data structure:",
        "h[jj, j2]to store translations covering source span[jj, 2: foreach translation it e h[j1, k], do 3: foreach gap gt in ih do 4: foreach translation ir 6 h[k+1, j2], do 5: insert ir into the position of gt 6: insert the new translation into h[ji, j2] 10: foreach translation iT E h[k+1, j2], do 11: foreach gap gr in tr, do 12: foreach translation ire h[j1, k], do 13: insert tj into the position of gr 14: insert the new translation into h [j1, j2] ance of the target side non-contiguous tree sequence pairs or the production of the previous operations of \"Source gap insertion\".",
        "Therefore, the insertion for target gaps helps search for a better order of the non-contiguous constituents in the target side.",
        "On the other hand, the non-contiguous tree sequences with rich syntactic information are reordered, nevertheless, without much consideration of the constraints of the syntactic structure.",
        "Consequently, this distortional operation, like phrase-based models, is much more flexible in the order of the target constituents than the traditional syntax-based models which are limited by the syntactic structure.",
        "As a result, \"Target tree sequence reordering\" enhances the reordering ability of the model.",
        "To speed up the decoder, we use several thresholds to limit the searching space for each span.",
        "The maximal number of the rules in a source span is no greater than a.",
        "The maximal number of translation candidates for a source span is no greater than fi.",
        "On the other hand, to simplify the computation of language model, we only compute for source side contiguous translational hypothesis, while neglecting gaps in the target side if any."
      ]
    },
    {
      "heading": "5. Experiments",
      "text": [
        "In the experiments, we train the translation model on FBIS corpus (7.2M (Chinese) + 9.2M (English) words) and train a 4-gram language model on the Xinhua portion of the English Gigaword corpus (181M words) using the SRILM Toolkits (Stolcke, 2002).",
        "We use these sentences with less than 50 characters from the NIST MT-2002 test set as the development set and the NIST MT-2005 test set as our test set.",
        "We use the Stanford parser (Klein and Manning, 2003) to parse bilingual sentences on the training set and Chinese sentences on the development and test set.",
        "The evaluation metric is case-sensitive BLEU-4 (Papineni et al., 2002).",
        "We base on the m-to-n word alignments dumped by GI-ZA++ to extract the tree sequence pairs.",
        "For the MER training, we modify Koehn's version (Koehn, 2004).",
        "We use Zhang et al's implementation (Zhang et al., 2004) for 95% confidence intervals significant test.",
        "We compare the SncTSSG based model against two baseline models: the phrase-based and the STSSG-based models.",
        "For the phrase-based model, we use Moses (Koehn et al., 2007) with its default settings; for the STSSG and SncTSSG based models we use our decoder Pisces by setting the following parameters: d = 4, h = 6, c = 6, 1 = 6, a = 50, p = 50.",
        "Additionally, for STSSG we set g = 0, and for SncTSSG, we set 5 = 1.",
        "Table 1 compares the performance of different models across the two systems.",
        "The proposed SncTSSG based model significantly outperforms (p < 0.05) the two baseline models.",
        "Since the SncTSSG based model covers the STSSG based model in its modeling ability and obtains a superset in rules, the improvement empirically verifies the effectiveness of the additional non-contiguous rules.",
        "Table 1: Translation results of different models (cBP refers to contiguous bilingual phrases without syntactic structural information, as used in Moses)",
        "Table 2 measures the contribution of different combination of rules.",
        "cR refers to the rules derived from contiguous tree sequence pairs (i.e., all STSSG rules); ncPR refers to non-contiguous phrasal rules derived from contiguous tree sequence pairs with at least one non-terminal leaf node between two lexicalized leaf nodes (i.e., all non-contiguous rules in STSSG defined as in Zhang et al. (2008a)); srcncR refers to source side non-contiguous rules (SncTSSG rules only, not STSSG rules); tgtncR refers to target side noncontiguous rules (SncTSSG rules only, not STSSG rules) and src&tgtncR refers non-contiguous rules with gaps in either side (srcncR+ tgtncR).",
        "The last three kinds of rules are all derived from noncontiguous tree sequence pairs.",
        "System",
        "Model",
        "BLEU",
        "Moses",
        "cBP",
        "23.S6",
        "Pisces",
        "STSSG",
        "25.92",
        "SncTSSG",
        "26.53",
        "1) From Exp 1 and 2 in Table 2, we find that non-contiguous phrasal rules (ncPR) derived from contiguous tree sequence pairs make little impact on the translation performance which is consistent with the discovery of Zhang et al. (2008a).",
        "However, if we append the non-contiguous phrasal rules derived from non-contiguous tree sequence pairs, no matter whether non-contiguous in source or in target, the performance statistically significantly (p < 0.05) improves (as presented in Exp 2~5), which validates our prediction that the noncontiguous rules derived from non-contiguous tree sequence pairs contribute more to the performance than those acquired from contiguous tree sequence pairs.",
        "2) Not only that, after comparing Exp 6,7,8 against Exp 3,4,5 respectively, we find that the ability of rules derived from non-contiguous tree sequence pairs generally covers that of the rules derived from the contiguous tree sequence pairs, due to the slight change in BLEU score.",
        "3) The further comparison of the noncontiguous rules from non-contiguous spans in Exp.",
        "6&7 as well as Exp 3&4, shows that non-contiguity in the target side in Chinese-English translation task is not so useful as that in the source side when constructing the non-contiguous phrasal rules.",
        "This also validates the findings in Wellington et al.",
        "(2006) that varying the gaps on the English side (the target side in this context) seldom reduce the hierarchical alignment failures.",
        "Table 3 explores the contribution of the noncontiguous translational equivalence to phrase-based models (all the rules in Table 3 has no grammar tags, but a gap <***> is allowed in the last three rows).",
        "tgtncBP refers to the bilingual phrases with gaps in the target side; srcncBP refers to the bilingual phrases with gaps in the source side; src&tgtncBP refers to the bilingual phrases with gaps in either side.",
        "1) As presented in Table 3, the effectiveness of the bilingual phrases derived from noncontiguous tree sequence pairs is clearly indicated.",
        "Models adopting both tgtncBP and srcncBP significantly (p < 0.05) outperform the model adopting cBP only.",
        "2) Pisces underperforms Moses when utilizing cBPs only, since Pisces can only perform monotonic search with cBPs.",
        "3) The bilingual phrase model with both tgtncBP and srcncBP even outperforms Moses.",
        "Compared with Moses, we only utilize plain features in Pisces for the bilingual phrase model (Feature 1~5 for all phrases and additional 7, 8 only for non-contiguous bilingual phrases as stated in Section 2.2; None of the complex reordering features or distortion features are employed by Pisces while Moses uses them), which suggests the effectiveness of the non-contiguous rules and the advantages of the proposed decoding algorithm.",
        "Table 4 studies the impact on performance when setting different maximal gaps allowed for either side in a tree sequence pair (parameter g) and the relation with the quantity of rule set.",
        "Significant improvement is achieved when allowing at least one gap on either side compared with when only allowing contiguous tree sequence pairs.",
        "However, the further increment of gaps does not benefit much.",
        "The result exhibits the accordance with the growing amplitude of the rule set filtered for the test set, in which the rule size increases more slowly as the maximal number of gaps increments.",
        "As a result, this slow increase against the increment of gaps can be probably attributed to the small augmentation of the effective non-contiguous rules.",
        "ID",
        "Rule Set",
        "BLEU",
        "1",
        "cR (STSSG)",
        "25.92",
        "2",
        "cR w/o ncPR",
        "25.S7",
        "3",
        "cR w/o ncPR + tgtncR",
        "26.14",
        "4",
        "cR w/o ncPR + srcncR",
        "26.50",
        "5",
        "cR w/o ncPR + src&tgtncR",
        "26.51",
        "6",
        "cR + tgtncR",
        "26.11",
        "7",
        "cR + srcncR",
        "26.56",
        "S",
        "cR+src&tgtncR(SncTSSG)",
        "26.53",
        "System",
        "Rule Set",
        "BLEU",
        "Moses",
        "cBP",
        "23.S6",
        "cBP",
        "22.63",
        "Pisces",
        "cBP + tgtncBP",
        "23.74",
        "cBP + srcncBP",
        "23.93",
        "cBP + src&tgtncBP",
        "24.24",
        "Max gaps allowed",
        "Rule #",
        "BLEU",
        "source",
        "target",
        "0",
        "0",
        "1,661,045",
        "25.92",
        "1",
        "1",
        "+S41,263",
        "26.53",
        "2",
        "2",
        "+447,161",
        "26.55",
        "3",
        "3",
        "+17,7S2",
        "26.56",
        "00",
        "co",
        "+S,223",
        "26.57",
        "In order to facilitate a better intuition to the ability of the SncTSSG based model against the STSSG based model, we present in Table 5, two translation outputs produced by both models.",
        "In the first example, GIZA++ wrongly aligns the idiom word \")^f|^ St/confront at court\" to a noncontiguous phrase \"confront other countries at court, ***, leisurely manner\" in training, in which only the first constituent \"confront other countries at court\" is reasonable, indicated from the key rules of SncTSSG leant from the training set.",
        "The STSSG or any contiguous translational equivalence based model is unable to attain the corresponding target output for this idiom word via the non-contiguous word alignment and consider it as an out-of-vocabulary (OOV).",
        "On the contrary, the SncTSSG based model can capture the noncontiguous tree sequence pair consistent with the word alignment and further provide a reasonable target translation.",
        "It suggests that SncTSSG can easily capture the non-contiguous translational candidates while STSSG cannot.",
        "Besides, SncTSSG is less sensitive to the error of word alignment when extracting the translation candidates than the contiguous translational equivalence based models.",
        "In the second example, \"it/in iSJIfj/recent fHj/'s M",
        "/survey /middle\" is correctly translated into \"in the recent surveys\" by both the STSSG and SncTSSG based models.",
        "This suggests that the short non-contiguous phrase \"it/in *** pf'/middle\" is well handled by both models.",
        "Nevertheless, as for the one with a larger gap, \"#J/will *** Jtie /continue\" is correctly translated and well reordering into \"will continue\" by SncTSSG but failed by",
        "STSSG.",
        "Although the STSSG is theoretically able to capture this phrase from the contiguous tree sequence pair, the richer context in the gap as in this example, the more difficult STSSG can correctly translate the non-contiguous phrases.",
        "This exhibits the flexibility of SncTSSG to the rich context among the non-contiguous constituents."
      ]
    },
    {
      "heading": "6. Conclusions and Future Work",
      "text": [
        "In this paper, we present a non-contiguous tree sequence alignment model based on SncTSSG to enhance the ability of non-contiguous phrase modeling and the reordering caused by non-contiguous constituents with large gaps.",
        "A three-phase decoding algorithm is developed to facilitate the usage of non-contiguous translational equivalences (tree sequence pairs in this work) which provides much flexibility for the reordering of the non-contiguous constituents with rich syntactic structural information.",
        "The experimental results show that our model outperforms the baseline models and verify the effectiveness of non-contiguous translational equivalences to non-contiguous phrase modeling in both syntax-based and phrase-based systems.",
        "We also find that in Chinese-English translation task, gaps are more effective in Chinese side than in the English side.",
        "Although the characteristic of more sensitiveness to word alignment error enables SncTSSG to capture the additional non-contiguous language phenomenon, it also induces many redundant noncontiguous rules.",
        "Therefore, further work of our studies includes the optimization of the large rule set of the SncTSSG based model.",
        "Output & References",
        "Source",
        ";^7only jj/pass TVnull E^/five years , MA/two people gfc/null X^HE-^'J^/confront at court",
        "Reference",
        "after only five years the two confronted each other at court",
        "STSSG",
        "only in the five years , the two candidates would ^Sfc&'S:",
        "SncTSSG key rules",
        "the two people can confront other countries at court leisurely manner only in the five years",
        "VV^^W^#0-»VB(confront)NP(JJ(other),NNS(countries))IN(at) NN(court) *** JJ(leisurely)NN(manner)",
        "Source",
        "©CTU/Euro ffa/'s zfclfg/substantial Jf-tft/appreciation ft/will fll/in ifrJW/recent ffa/'s ii^/survey ^/middle g|/continue ^f/for #ni?F/economy |h'^/confidence f^^Si/produce ftJuft/impact",
        "Reference",
        "substantial appreciation of the euro will continue to impact the economic confidence in the recent surveys",
        "STSSG",
        "substantial appreciation of the euro has continued to have an impact on confidence in the economy , in the recent surveys will",
        "SncTSSG key rules",
        "substantial appreciation of the euro will continue in the recent surveys have an impact on economic confidence",
        "AD(&) *** W(j#g|) -»• VP(MD(will),VB(continue)) P(ft) *** LC(tO -»• IN(in)"
      ]
    }
  ]
}
