{
  "info": {
    "authors": [
      "Jeanne Villaneau",
      "Jean-Yves Antoine"
    ],
    "book": "Proceedings of SRSL 2009, the 2nd Workshop on Semantic Representation of Spoken Language",
    "id": "acl-W09-0507",
    "title": "Deeper Spoken Language Understanding for Man-Machine Dialogue on Broader Application Domains: A Logical Alternative to Concept Spotting",
    "url": "https://aclweb.org/anthology/W09-0507",
    "year": 2009
  },
  "references": [
    "acl-P98-2231",
    "acl-W05-1525"
  ],
  "sections": [
    {
      "text": [
        "Deeper spoken language understanding for man-machine dialogue on broader application domains: a logical alternative to concept spotting",
        "Jeanne Villaneau Jean-Yves Antoine",
        "UEB (Université Européenne de Bretagne) Université François Rabelais - Tours VALORIA LI Françe Françe villanea@univ-ubs.fr Jean-Yves.Antoine@univ-tours.fr",
        "Logus is a French-speaking spoken language understanding (SLU) system which carries out a deeper analysis than those achieved by standard concept spotters.",
        "It is designed for multi-domain conversational systems or for systems that are working on complex application domains.",
        "Based on a logical approach, the system adapts the ideas of incremental robust parsing to the issue of SLU.",
        "The paper provides a detailed description of the system as well as results from two evaluation campaigns that concerned all of current French-speaking SLU systems.",
        "The observed error rates suggest that our logical approach can stand comparison with concept spotters on restricted application domains, but also that its behaviour is promising for larger domains.",
        "The question of the generality of the approach is precisely addressed by our current investigations on a new task: SLU for an emotional robot companion for young hospital patents."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Despite the indisputable advances of automatic speech recognition (ASR), highly spontaneous speech remains an important barrier to the wide spreading of speech based applications.",
        "The goal of spontaneous speech understanding remains feasible, provided the interaction between the user and the system is restricted to a task-oriented dialogue (restricted vocabulary).",
        "Present research is investigating mixed or user initiated dialogue for less restricted tasks.",
        "It is the purpose ofthis paper, which focuses on spontaneous speech understanding in such complex applications.",
        "Generally speaking, information speech dialogue systems are based on the same architecture.",
        "At first, a speech recognizer processes the speech signal and provides a string (or a lattice) of words that should correspond to the spoken sentence.",
        "Then, this string is parsed by a spoken language understanding module (SLU) in order to build a semantic representation that represents its prepositional meaning.",
        "Finally, this semantic structure is sent to a dialogue manager which controls the interaction with the user (database interrogation, dialogue management, answer generation).",
        "The answers to the user can be displayed on screen and/or through a message generated by a text-to-speech synthesis.",
        "This paper focuses on the SLU module of such a dialogue system.",
        "On the whole, SLU has to cope with two main difficulties:",
        "• speech recognition errors: highly spontaneous speech remains hard to recognize for current ASR systems (Zue et al., 2000).",
        "Therefore, the SLU module has to work on a strongly corrupted string ofwords.",
        "• spoken disfluencies: filled pauses, repetitions and repairs make the parsing of conversational spoken language signiicantly harder to achieve (Heeman, Allen, 2001).",
        "In order to overcome those difficulties, most SLU systems follow a selective strategy which comes down to a simple concept spotting: they restrict the semantic analysis to a mapping ofthe sentence with the main expectations of the user in relation with the task (Minker W. et al., 1999; Bangalore S. et al., 2006).",
        "Consider, for instance, an air transport information system and the following spoken utterance:",
        "(1) Cou- could you list me the flights uh the scheduled flights for Tenerife Tenerife Tenerife North please",
        "Satisfying the speaker's goals only requires detecting the nature of their requests (list flights) and the required destination (Tenerife North).",
        "Those two concepts (list, Tenerife North) will fill a shallow semantic frame which is supposed to represent the useful meaning of the sentence.",
        "Such task-driven approaches meet, to a great extent, the needs of SLU in terms of robustness, since they only involve a partial analysis of the sentence.",
        "Whether the processing is based on a statistical or a knowledge-based approach, several evaluation campaigns proved that concept spotting is suitable for spoken language understanding, provided the application task is sufficiently restricted.",
        "However, concept spotters suffer from noticeable limitations:",
        "• Although they resist gracefully speech recognition errors, they are not able to detect their eventual presence, since they do not consider the global structure of the sentence.",
        "This limitation can be particularly penalizing when the error is related to a key element, for example when the error prevents the system to determine the type (dialogue act) of the utterance.",
        "Indeed, concept spotters often base SLU on the initial characterization of the question type.",
        "When analyzing the errors of his statistical concept spotter, Minker has shown that the correct identification of the question type is a key issue in terms of final robustness (Minker W. et al., 1999).",
        "• Since they are based on the identification of rather flat semantic frames, these approaches hardly succeed in representing complex syntactic relations such as overlapping coordinate phrases or negations.",
        "• Although it is well known that generality is an important issue for SLU, this question is generally approached in term of technical portability from one (narrow) task to another.",
        "Now, one should wonder whether concept spotting is still suitable on larger application domains.",
        "It seems that the robustness of the spotting process depends strongly on the degree of lexical ambiguity of the considered task.",
        "For instance, Bousquet has shown that the concept error rate of her stochastic spotter is two times higher on ambiguous words than on non ambiguous ones (Bousquet et al., 2003).",
        "Such considerations tend to show that to apply concept spotting to more complex tasks could be difficult.",
        "Such observations are well known (Zechner K., 1998; Van Noord et al., 1999), and noticeable attempts have already been done to reach a deeper semantic analysis.",
        "However, statistical or knowledge-based concept spotting remains the prevailing paradigm in SLU, mainly because of engineering motivations (quick and easy building).",
        "on the contrary, we have decided to develop a SLU system (Logus) which carries out a complete analysis of the utterance while keeping the robustness of standard concept spotting approaches.",
        "The system, which is based on a logical approach, adapts the ideas of incremental robust parsing (Ait-Mokhtar S., 2002; Basili, 2003) to the issue of speech conversational systems.",
        "In section 2, we will describe the system into detail.",
        "Then, section 3 will present results from different evaluation campaigns in which we participated.",
        "These experiments concerned standard restricted tasks (hotel reservation for instance) for which concept spotting is well adapted.",
        "As a result, this section does not aim to prove a superiority of our approach, but simply to show that this deeper processing is able to keep a satisfactory robustness, by comparison with prevailing approaches.",
        "Finally, we give in section 4 a brief description on our present work concerning the integration of Logus in a conversational robot which is dedicated to general interaction with children who are in hospital for a long-stay.",
        "This example will illustrate the portability abilities of our approach on complex application tasks, in addition with our previous works on general tourism information."
      ]
    },
    {
      "heading": "2. Description of the Logus system",
      "text": [
        "The task of a SLU is to turn a sequence or a graph of words into a semantic representation; so a SLU system has to perform a translation from natural language to a formal target language.",
        "This section begins with the description of the formal language chosen for the Logus system.",
        "We then explain the basic principles of parsing and its main steps.",
        "When it comes to the choice of a target language for the system, the following points must be taken into account.",
        "• We want to implement automatic understanding in application domains where predefined",
        "semantic frames are not suficient to represent all the possible queries (Van Noord et al., 1999).",
        "Furthermore, any SLU aims at providing results usable by a dialogue manager: the target language must reconcile simplicity with precision.",
        "• This semantic representation must obviously extend to a pragmatic one.",
        "That means that it should involve the characterization of the dialogue acts related to the speech turn (Austin J.-L., 1962).",
        "We have chosen a formalism compatible with these constraints and inspired by the illocutionary logic of D. Vanderveken (Vanderveken D., 1981).",
        "In this formalism, the form of an elementary illo-cutionary act is F(P) where F is the illocutionary force, and P its propositional content.",
        "The Logus system thus provides a logical formula as the semantic representation of an utterance.",
        "A language act contains clues about the intentions of the speaker: it is labelled illocutionary force, while the propositional content is a structure built with the domain objects and their properties which is called an object string.",
        "The following example shows a single speech turn uttered for a tourism information system:",
        "(2) j'ai reserve une chambre dans un deux etoiles l'hôtel euh l'hôtel Rexpour y aller d'ici comment est-ce que je peux faire (I booked a room in a two-star hotel in the hotel hum in the Rex hotel from here how can I go at there)",
        "This turn expresses two different language acts, which is quite usual in conversational speech: a piece of information (I booked a room...) is followed by the user question (... how can I go....",
        "Such complex speech turns are dificult to analyze for concept spotters, since they usually base the parsing on one language act detection.",
        "The logical formula Logus provides is split into two language acts: (information act) and (question how).",
        "The second act is interpreted by the system in the context of the irst one: ((information act) (of (reservation [])",
        "In the formula, reservation, hotel and togo are object labels; (ident.",
        "(name \"Rex\")), (star (int 2)) are properties.",
        "The two objects of labels reservation and hotel are linked with the generic relation of, which indicates a subordination relation.",
        "It is the main relation, (in addition with logical coordinations and, or and not) which is used for building complex object strings.",
        "Incremental parsing methodology is used for text parsing in order to combine efficiency with robustness (Ait-Mokhtar S., 2002).",
        "With Logus, we tried to show that such methods can be extended to spoken language parsing.",
        "The system has to parse out-of-grammar constructions but spoken language studies have shown that minimal syntactic structures are generally preserved in repairs and false-starts (Mc Kelvie D., 1998).",
        "We have thus chosen to carry out an incremental bottom-up parsing, where words are gradually combined.",
        "At the beginning, the parser groups words according to mainly syntactic rules in order to form minimal chunks that correspond to basic concepts of the application domain.",
        "Then, as word group size increases, their meaning becomes more precise, enough to relax syntactic criteria and thereby overcome the problem of out-of-grammar sentences.",
        "The general architecture of the system is shown in Figure 1.",
        "The parsing is essentially split into three stages.",
        "The first stage is chunking (Ab-ney S., 1991) where grammatical words are linked to the lexical words to which they are referred.",
        "The following stage gradually builds links between the chunks in order to detect semantic relations between the corresponding concepts, and the last one achieves a contextual interpretation (anaphoric resolution for instance).",
        "The process of building links between chunks and contextual understanding uses a domain ontology.",
        "only one formalism is used during these parsing stages.",
        "It is designed to distinguish syntax and semantics and to preserve genericity of the parsing rules.",
        "Each component is specified by a list of what we can call definitions; each of them is a triplet < C, R, T > where",
        "C: is a syntactic label, called syntactic category: for example adjective, (verb 1 present).",
        "R: points out the semantic function of the component.",
        "It is called semantic role: for example object, (prop price) where prop is for property.",
        "yyord sequence i lexicon ] chunking domain ontology ] chunk dependencies ^ j-contextual understanding - semantic kernel dependencies logical formula",
        "T: is the semantic translation.",
        "It is an element of the logical formula built by the system.",
        "It belongs thus to the target language.",
        "The first two triplet elements, C and R, are widely domain independent.",
        "A basic principle is to define parsing rules from these elements in order to preserve the genericity of the system.",
        "Each parsing rule combines two or three triplets in order to build a new result triplet.",
        "Our experiments with Logus have clearly shown that chunking is effective for spoken language, provided the chunks are very short: more precisely, errors made at the speech recognition level make it dangerous to link objects or properties according to pure syntactic criteria, without checking these links with semantic criteria.",
        "Therefore the chunks built by Logus include only one content word: we call them minimal chunks.",
        "Chunking is based on the principle of linking function words to the near content word.",
        "The formalism used in this step is inspired by Categorial Grammars of the AB type, whose rules are generalized from the first two elements of the constituent triplets.",
        "Function words have definitions in which syntactic category and semantic role are fractional.",
        "In such definitions, the semantic translation is a A-abstraction (in the A-calculus meaning).",
        "The semantic translation of the result triplet is achieved by applying this abstraction to the semantic translation of the un-fractional triplet.",
        "Formally, the following two rules are applied, where F is an abstraction:",
        "In the following example only one definition is shown for each component (gn is for nominal group).",
        "By applying the second rule, we obtain the following chunk:",
        "\"trois etoiles\" (three stars) <gn, (prop nb star), (star (int 3))>.",
        "The semantic translation of the result triplet is obtained by ^-reduction of the A-term (Ax.",
        "(star x) (int 3)).",
        "For example, the utterance",
        "(3) \"A l'hotel Caumartin quels sont le les tarifs pour pour une chambre double \" (In Caumartin hotel what are the the prices for for a double room) is segmented into six chunks during the chunking stage.",
        "Their semantic translations are:",
        "[2] (identity (name \"Caumartin\"))]), [3] (what (interrogation)), [4] (price []), [5] (room []), [6] (size double).",
        "At the end of the chunking process, the determiner le and the first occurrence of the preposition pour are deleted because they are fragments without semantic content.",
        "Deletions such as these are a first way of dealing with repairs.",
        "The limited scope of the application domain makes it possible to describe exhaustively the pragmatic and semantic domain knowledge.",
        "A domain ontology specifies how objects and properties can be compounded.",
        "The handled processings are expected to be generic while using a domain dependent ontology: to achieve that, the ontology is defined by generic predicates whose domain objects and domain properties are the arguments.",
        "For example, the possibility of building the conceptual relation ofbetween two objects (cf. 2.1) is defined by the predicate issubobject whose arguments are two object labels: so the relation isjsubjobject(room, hotel) expresses a part-whole relation possibility between such two objects.",
        "Chunk dependencies are built by an incremental process which is compound of several successive stages.",
        "Each stage is based on rewriting rules which are specified from the first two components of the constituent triplets and from the generic ontology predicates.",
        "They are thus not specific to the domain of application, what assures, to a certain extent, the genericity of the process.",
        "trois (three)",
        "etoiles (stars)",
        "C",
        "adjjium",
        "adj_num\\gn",
        "R",
        "(prop nb)",
        "(prop nb)\\(prop nb_star)",
        "S",
        "(int 3)",
        "Ax.",
        "(star x)",
        "Consider for instance the following rule, which leads to the binding of two consecutive chunks which share a meronomic (part_of) relation:",
        "- Oi simple object of label Et\\ - O2 object string of label Et2 - isjsubjobject(Eti, Et2)",
        "< C, object, (of Oi O2) > where C is obtained by composing Ci and C2.",
        "As an illustration, this rule will form a complex object (of (price []) (room [(size double)])) from the initial two chunks (price []) and (room (size double)).",
        "This rule is completely generic and should apply on any task.",
        "The knowledge specific to the task intervenes only on the definition of the predicate is sub object.",
        "As a result, one could speak of procedural genericity to qualify our system.",
        "As long as possible, the first processing stages try to respect syntactic criteria.",
        "However, in presence of spoken disfluencies or speech recognition errors, it is likely that the utterance is out-of-grammar.",
        "Therefore, since the detected links between chunks make the meaning of the linked chunks more specific, the next stage tries to detect chunk dependencies more on more on semantic or pragmatic features only.",
        "Subsequently, studying dependencies between the components makes it possible to eliminate some components, especially in the case of word recognition errors.",
        "As an illustration, Figure 2 shows how links are gradually built during the parsing stage of utterance (3) (cf. section 2.3).",
        "The chunks are in rectangular boxes in dotted lines.",
        "The first step of chunk binding links the first two chunks into the object:",
        "(hotel [(ident.",
        "(name \"Caumartin\"))]).",
        "The second step links the object (room []) with the property (size (double)) to obtain the object (room [(size double)]).",
        "Then, the two objects price and room are linked with the conceptual relation of to obtain (of (price []) (room [(size double)])) and this object string is connected to the language act: (question what).",
        "The position of the prepositional phrase a l'hotel Caumartin is not usual in French syntagmatic ordering.",
        "It is indeed an example of extraposition which is not accepted by the syntactic constraints considered by the system.",
        "As a result, the conceptual relation of, which links the object of label room with the object (hotel [ident.",
        "(name \"Caumartin \")]) is built later, when these constraints are relaxed.",
        "Many sentences are elliptical and incomplete in a dialogue.",
        "Therefore, it is necessary to use the current context of the task and the dialogue history in order to complete their understanding.",
        "The objectives of the contextual understanding in Logus are thus close to the objectives ofthe authors ofthe OntoSem system (McShane M., 2005): the completion of semantic fragments.",
        "Reference resolution is thereby extended to a more general completion of the semantic representation.",
        "While syntactic anaphora criteria are generally respected in texts, anaphora gender and number are frequently broken in spoken language.",
        "Moreover, gender and number morphological marks are hardly perceptible in spoken French.",
        "They are therefore very often corrupted by speech recognition errors.",
        "So, in the Logus system, anaphora resolution is based on the same principles as the rest of the parsing: combining syntactic and semantic criteria.",
        "Both nominal and pronominal anaphora (with definite expressions) are considered during this contextual interpretation stage.",
        "Completion is based on the concept of object string.",
        "A property or an object may be completed by an \"over-object\" of the context, if the ontology makes it possible to do so.",
        "For example, the object price of the sentence \"quel est le tarif\" (what is the price) is automatically completed in (of (price []) (of (room []) (hotel[(name \"Rex\")])) if the object string (of (room []) (hotel [(name \"Rex\")])) is an object string which is part of the previous utterance."
      ]
    },
    {
      "heading": "3. Evaluations and results",
      "text": [
        "Logus is a French-speaking system.",
        "It took part in the two evaluation campaigns that were carried out in the last year designed for French spoken language understanding: the GDR-I3 challenge-based campaign and the MEDIA project.",
        "Logus took part in the challenge-based campaign, held by the GDR-I3 consortium of the",
        "After chunking process and elimination of le and pour question [les tarifs] [pour une : chambre] conceptual relation [double]",
        "Figure 2: Characterization of chunk dependencies : example on the utterance \" àl'hotel Caumartin quels sont le les tarifs pour pour une chambre double\" (in Caumartin hotel what are the the prices for for a double room.",
        "French CNRS research agency (Antoine et al., 2002).",
        "We won't describe here in detail the results of this campaign, since it concerned a former version of Logus.",
        "It seems however interesting to analyse the distribution of the errors made by Logus to have an idea of the benefits of our approach.",
        "The evaluation corpus was divided among several tests which were respectively related to a specific difficulty: speech recognition errors, speech repairs and other disfluences, and finally messages of a structural complexity (embedded coordination or subordination, for instance) significantly higher than those usually met in standard ATIS-like application domains.",
        "The distribution of the concept error rates of the Logus SLU system is the following:",
        "Speech recognition: 9.5%",
        "Complex structures: 9.8%",
        "Repairs: 15% It should be noted here that the robustness of Logus decreases rather gracefully on complex messages, while SLU systems based on concept spotting meet real difficulties on such utterances.",
        "For instance, Cacao (Bousquet-Vernhettes et al., 1999; Bousquet-Vernhettes et al., 2003) is a concept spotter which participated to the GDR-I3 campaign.",
        "It has been shown that most of its errors resulted from its difficulties to resolve lexical ambiguities in complex sentences.",
        "This observation suggests that our logical deep parsing should fulfill better than concept spotting the needs of complex application domains such as general purpose tourist information or collaborative planning (Allen J. et al., 2002), or even multi-domain applications (Dzikovska M. et al., 2005).",
        "Unfortunatedly, French evaluation campaigns have never investigated such difficult tasks.",
        "MEDIA-EVALDA was an evaluation campaign hold by the French Ministry of Research.",
        "It concerned all the French laboratory working on SLU.",
        "once again, this evaluation investigated a rather restricted application domain: hotel reservation.",
        "It is well known that concept spotters fit succes-fully such simple tasks.",
        "Nevertheless, we decided to take part in this evaluation in order to see to which extent Logus should be compared to standard concept spotters in such disavantageous conditions.",
        "Participants defined reservation scenarios which were used to build a corpus made up of 1250 recorded dialogues.",
        "Recording used a WOZ system simulating vocal tourist phone server (Dev-illers et al., 2004).",
        "The MEDIA corpus, which is made up of real-life French spontaneous dialogues, is surely to become a benchmark reference for French contextual SLU.",
        "The evaluation paradigm forced every participant to convert his own semantic representation into a common reference, which relies-on an attribute/value frame: each utterance is divided into semantic segments, aligned on the sentence, and each segment is represented by a triplet: (mode, attribute, value).",
        "Relations between attributes are represented by their order in the representation and the composed attribute names.",
        "Nine systems participated to this first campaign.",
        "An error was count for any difference with one of the elements of the reference (mode, attribute or value).",
        "Table 1 summarises the results of the best five systems.",
        "At first glance, one should find the reported error rates rather deceptive.",
        "However, one must realize that the test corpus involved highly spontaneous conversational speech, with very frequent speech disfluences.",
        "As a result, these results should be compared, for instance, to ASR errors rates observed on the SWITCHBOARD corpus (Greenberg S. et al., 2000).",
        ": [a l hotel] :",
        "[Caumartin]",
        "'■ hotel h'i'-",
        "*\" (^identity )",
        "♦",
        "name \"Caumartin\"",
        "i",
        "Logus was ranked fourth and its robustness was rather close to the best participants.",
        "Now, if you consider that the systems ranked 1st, 2nd and 5th were using a concept spotter, these results shows that our approach can bear comparison with standard approaches even on this task.",
        "These encouraging performances suggest that it is possible to achieve a deep understanding of conversational speech while respecting at the same time some robustness requirements: our approach seems indeed competitive even in a domain where concept spotters are known to be very efficient.",
        "To our mind, the interest of our approach is that this robustness should remain on larger application domains.",
        "We are precisely trying to test this gener-icity by adapting Logus to a wider application domain in the framework of the Emotirob project."
      ]
    },
    {
      "heading": "4. Genericity and portability experiment",
      "text": [
        "We are currently testing the portability of our approach by adapting Logus to a really different task, which corresponds to an unrestricted application domain, general purpose understanding of child language, with additional emotional state detection.",
        "The whole project, supported by ANR (National French Research Agency), aims at achieving a robot companion which can interact with sick or disabled young children with the help of facial expressions.",
        "Although the robot does not have to react to every speech act of the child, we have to deal with spoken understanding in an unrestricted domain.",
        "Fortunately, the age of the children involved (3-5) implies a restricted vocabulary.",
        "This work is still in progress.",
        "Our first investigations suggest however that Logus is a suitable understanding system for the pursued purpose: since there will never be significant corpora related to this kind of task, we can't use statistical methods.",
        "Moreover, because of the generic-ity of Logus, the main part of the analysis can be reused without important changes.",
        "Thus, three-month work was enough to build a first prototype of the system and the problem is restricted to the main problem of this project: building an ontology which models the cognitive and emotional world of young children.",
        "The generality of the used formalism makes it possible to include an emotional component by turning the triplet structure into a quadruplet structure.",
        "of course, composition rules have to include this new component.",
        "We are currently working on the computation of the emotional states from both prosodic and lexical cues.",
        "Whereas many works have investigated a prosodic-based detection (Devillers et al., 2005), word-based approaches remain quite original.",
        "our hypothesis is that emotion is compositional, e.g. that is possible to compute the global emotion carried by a sentence from the emotion of every content word.",
        "This calculation depends obviously of the semantic structure of the utterance: our system will precisely benefit from the characterization of the chunk dependencies carried on by Logus.",
        "For the moment being, we are working on the definition of a complete lexical norm of emotional values from children of 3, 5 and 7 years.",
        "This norm will be established in collaboration with psycholinguists from Montpellier university, France."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "When we started implementing the Logus system, one of our objectives was to achieve robust parsing of spontaneous spoken language while making the application domain much wider than is currently done.",
        "Logical formalisms are not usually viewed as efficient tools for pragmatic applications.",
        "The promising results of Logus show that they can be brought into interesting new approaches.",
        "System",
        "1",
        "2",
        "3",
        "4 (Logus)",
        "5",
        "Approach",
        "concept",
        "concept",
        "syntactic",
        "logical",
        "concept",
        "spotting",
        "spotting",
        "deep parsing",
        "deep parsing",
        "spotting",
        "Error rate",
        "29.0%",
        "30.3%",
        "36.3%",
        "37.8%",
        "41.3%",
        "Another objective was to have a rather generic system, despite the use of a domain-based semantic knowledge.",
        "We have fulfilled this constraint through the definition of generic predicates as well as generic rules working on semantic triplets or quadruplets which makes it possible to have generic chunk linking rules.",
        "The performances of Logus show that a deeper understanding can bear comparison with concept spotting approaches."
      ]
    }
  ]
}
