{
  "info": {
    "authors": [
      "Weiwei Sun",
      "Zhifang Sui",
      "Meng Wang"
    ],
    "book": "ACL-IJCNLP: Short Papers",
    "id": "acl-P09-2064",
    "title": "Prediction of Thematic Rank for Structured Semantic Role Labeling",
    "url": "https://aclweb.org/anthology/P09-2064",
    "year": 2009
  },
  "references": [
    "acl-A00-2018",
    "acl-J02-3001",
    "acl-J05-1004",
    "acl-J08-2005",
    "acl-W05-0625"
  ],
  "sections": [
    {
      "text": [
        "Weiwei Sun and Zhifang Sui and Meng Wang",
        "Institute of Computational Linguistics Peking University Key Laboratory of Computational Linguistics Ministry of Education, China",
        "weiwsun@gmail.com;{wm,szf}@pku.edu.cn",
        "In Semantic Role Labeling (SRL), it is reasonable to globally assign semantic roles due to strong dependencies among arguments.",
        "Some relations between arguments significantly characterize the structural information of argument structure.",
        "In this paper, we concentrate on thematic hierarchy that is a rank relation restricting syntactic realization of arguments.",
        "A log-linear model is proposed to accurately identify thematic rank between two arguments.",
        "To import structural information, we employ re-ranking technique to incorporate thematic rank relations into local semantic role classification results.",
        "Experimental results show that automatic prediction of thematic hierarchy can help semantic role classification."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In Semantic Role Labeling (SRL), it is evident that the arguments in one sentence are highly correlated.",
        "Lor example, a predicate will have no more than one Agent in most cases.",
        "It is reasonable to label one argument while taking into account other arguments.",
        "More structural information of all arguments should be encoded in SRL approaches.",
        "Lhis paper explores structural information of predicate-argument structure from the perspective of rank relations between arguments.",
        "Lhe-matic hierarchy theory argues that there exists a language independent rank of possible semantic roles, which establishes priority among arguments with respect to their syntactic realization (Levin and Hovav, 2005).",
        "Lhis construct has been widely implicated in linguistic phenomena, such as in the subject selection rule of Lillmore's Case Grammar (1968): \"If there is an A [=Agent], it becomes the subject; otherwise, if there is an I [=Instrument], it becomes the subject; otherwise, the subject is the O [=Object, i.e., Patient/Lheme]\".",
        "Lhis rule implicitly establishes precedence relations among semantic roles mentioned and can be simplified to:",
        "Agent y Instrument y Patient/Theme",
        "Emerging from a range of more basic semantic properties of the ranked semantic roles, thematic hierarchies can help to construct mapping from semantics to syntax.",
        "It is therefore an appealing option for argument structure analysis.",
        "Lor example, if the the rank of argument a» is shown higher than cij, then the assignment [ai=Patient, dj=Agent] is illegal, since the role Agent is the highest role.",
        "We test the hypothesis that thematic rank between arguments can be accurately detected by using syntax clues.",
        "In this paper, the concept \"thematic rank\" between two arguments a% and aj means the relationship that a» is prior to cij or cij is prior to a».",
        "Assigning different labels to different relations between a» and cij, we formulate prediction of thematic rank between two arguments as a multi-class classification task.",
        "A log-linear model is put forward for classification.",
        "Experiments on CoNLL-2005 data show that this approach can get an good performance, achieving 96.42% accuracy on gold parsing data and 95.14% accuracy on Charniak automatic parsing data.",
        "Most existing SRL systems divide this task into two sub tasks: Argument Identification (AI) and Semantic Role Classification (SRC).",
        "Lo add structural information to a local SRL approach, we incorporate thematic hierarchy relations into local classification results using re-ranking technique in the SRC stage.",
        "Lwo re-ranking approaches, 1) hard constraint re-ranking and 2) soft constraint re-ranking, are proposed to filter out unlike global semantic role assignment.",
        "Experiments on CoNLL-2005 data indicate that our method can yield significant improvement over a state-of-the-art SRC baseline, achieving 0.93% and 1.32% absolute accuracy improvements on hand-crafted and automatic parsing data."
      ]
    },
    {
      "heading": "2. Prediction of Thematic Rank",
      "text": [
        "There are two main problems in modeling thematic hierarchy for SRL on PropBank.",
        "On the one hand, there is no consistent meaning of the core roles (i.e. ArgO-5/ArgA).",
        "On the other hand, there is no consensus over hierarchies of the roles in the thematic hierarchy.",
        "For example, the Patient occupies the second highest hierarchy in some linguistic theories but the lowest in some other theories (Levin and Hovav, 2005).",
        "In this paper, the proto-role theory (Dowty, 1991) is taken into account to rank PropBank arguments, partially resolving the two problems above.",
        "Lhere are three key points in our solution.",
        "Lirst, the rank of ArgO is the highest.",
        "Lhe Agent is almost without exception the highest role in proposed hierarchies.",
        "Lhough PropBank defines semantic roles on a verb by verb basis, for a particular verb, ArgO is generally the argument exhibiting features of a prototypical Agent while Argl is a prototypical Patient or Theme (Palmer et al., 2005).",
        "As being the proto-Agent, the rank of ArgO is higher than other numbered arguments.",
        "Second, the rank of the Argl is second highest or lowest.",
        "Both hierarchy of Argl are tested and discussed in section 4.",
        "Lhird, we do not rank other arguments.",
        "Two sets of roles closely correspond to numbered arguments: 1) referenced arguments and 2) continuation arguments.",
        "To adapt the relation to help these two kinds of arguments, the equivalence relation is divided into several sub-categories.",
        "In summary, relations of two arguments and cij in this paper include: 1) ai y ay.",
        "ai is higher than a,j, 2) ai -< ay.",
        "ai is lower than aj, 3) aiARay.",
        "aj is the referenced argument of ai, 4) aiRAay ai is the referenced argument of aj, 5) ai AC ay.",
        "aj is the continuation argument of ai, 6) c^C'Aay ai is the continuation argument of aj, 7) ai = ay.",
        "ai and aj are labeled as the same role label, and 8) ai ~ ay.",
        "ai and aj are labeled as the Arg2-5, but not in the same type.",
        "Assigning different labels to possible rank between two arguments and aj, such as labeling ai y aj as \">-\", identification of thematic rank can be formulated as a classification problem.",
        "Delemma, POS Tag, voice, and SCF of predicate categories, position of two arguments; rewrite rules expanding subroots of two arguments content and POS tags of the boundary words and head words category path from the predicate to candidate arguments single character category path from the predicate to candidate arguments conjunction of categories, position, head words, POS of head words category and single character category path from the first argument to the second argument note the set of relations 1Z.",
        "Lormally, given a score function Sth '■ ■A x A x 1Z i – > R, the relation r is recognized in argmax flavor:",
        "A probability function is chosen as the score function and the log-linear model is used to estimate the probability:",
        "where ip is the feature map and w is the parameter vector to learn.",
        "Note that the model predicts the rank of a» and aj through calculating STH(ai,aj,r) rather than Sy^a-,-, e^, r), where ai precedes aj.",
        "In other words, the position information is implicitly encoded in the model rather than explicitly as a feature.",
        "Lhe system extracts a number of features to represent various aspects of the syntactic structure of a pair of arguments.",
        "All features are listed in Lable 1.",
        "Lhe Path features are designed as a sequential collection of phrase tags by (Gildea and lurafsky, 2002).",
        "We also use Single Character Category Path, in which each phrase tag is clustered to a category defined by its first character (Pradhan et al., 2005).",
        "Lo characterize the relation between two constituents, we combine features of the two individual arguments as new features (i.e. conjunction features).",
        "Lor example, if the category of the first argument is NP and the category of the second is S, then the conjunction of category feature is NP-S."
      ]
    },
    {
      "heading": "3. Re-ranking Models for SRC",
      "text": [
        "Loutanova et al.",
        "(2008) empirically showed that global information is important for SRL and that structured solutions outperform local semantic role classifiers.",
        "Punyakanok et al.",
        "(2008) raised an inference procedure with integer linear programming model, which also showed promising results.",
        "Identifying relations among arguments can provide structural information for SRL.",
        "Take the sentence \"[Argo She] [y addressed] [Argi her husband] [ArgM-MNR with her favorite nickname].\"",
        "for example, if the thematic rank of she and her husband is predicted as that she is higher than her husband, then her husband should not be assigned the highest role.",
        "To incorporate the relation information to local classification results, we employ re-ranking approach.",
        "Assuming that the local semantic classifier can produce a list of labeling results, our system then attempts to pick one from this list according to the predicted ranks.",
        "Two different polices are implemented: 1) hard constraint re-ranking, and 2) soft constraint re-ranking.",
        "Hard Constraint Re-ranking The one picked up must be strictly in accordance with the ranks.",
        "If the rank prediction result shows the rank of argument cii is higher than a,j, then role assignments such as [di=Patient and cij=Agent] will be eliminated.",
        "Formally, the score function of a global semantic role assignment is:",
        "where the function Si locally scores an argument; r* : A x A i – > TZ is to predict hierarchy of two arguments; r : S x S i – > 1Z is to point out the thematic hierarchy of two semantic roles.",
        "For example, r(Agent, Patient) = \">-\"./: TZ x TZ ^ {0,1} is identity function.",
        "In some cases, there is no role assignment satisfies all predicted relations because of prediction mistakes.",
        "For example, if the hierarchy detection result of a = (a\\, a2, as) is {r*{a\\, 02) =>-, r*(a2,03) =y, r*{a\\, 03) =-<), there will be no legal role assignment.",
        "In these cases, our system returns local SRL results.",
        "Soft Constraint Re-ranking In this approach, the predicted confidence score of relations is added as factor items to the score function of the semantic role assignment.",
        "Lormally, the score function in soft constraint re-ranking is:"
      ]
    },
    {
      "heading": "4. Experiments",
      "text": [
        "We evaluated our system using the CoNLL-2005 shared task data.",
        "Hierarchy labels for experimental corpora are automatically set according to the definition of relation labels described in section 2.1.",
        "Charniak parser (Charniak, 2000) is used for POS tagging and full parsing.",
        "UIUC Semantic Role Labeler is a state-of-the-art SRL system.",
        "Its argument classification module is used as a strong local semantic role classifier.",
        "Lhis module is retrained in our SRC experiments, using parameters described in (Koomen et al., 2005).",
        "Experiments of SRC in this paper are all based on good argument boundaries which can filter out the noise raised by argument identification stage.",
        "Lable 2: Accuracy on different hierarchies",
        "Lable 2 summarizes the performance of thematic rank prediction and SRC on different thematic hierarchies.",
        "All experiments are tested on development corpus.",
        "Lhe first row shows the performance of the local sematic role classifier.",
        "Lhe second to the forth rows show the performance based on three ranking approach.",
        "A means that the rank of Agent is the highest; P] means that the rank of Patient is the second highest; P[ means that the rank of the Patient is the lowest.",
        "Column SRL(S) shows SRC performance based on soft constraint re-ranking approach, and column SRL(G) shows SRC performance based on gold hierarchies.",
        "Lhe data shows that the third thematic hierarchy fits SRL best, but is harder to learn.",
        "Compared with Pj, Pj is more suitable for SRL.",
        "In the following SRC experiments, we use the first hierarchy because it is most helpful when predicted relations are used.",
        "Lable 3 summarizes the precision, recall, and F-measure of this task.",
        "Lhe second column is frequency of relations in the test data, which can be seen as a simple baseline.",
        "Moreover, another natural baseline system can predict hierarchies according to the roles classified by local classifier.",
        "For example, if the a» is labeled as ArgO and cij is labeled as Arg2, then the relation is predicted as y.",
        "The third column BL shows the F-measure of this baseline.",
        "It is clear that our approach significantly outperforms the two baselines.",
        "Detection",
        "SRL (S)",
        "SRL (G)",
        "Baseline A",
        "A&P| A&PI",
        "94.65% 95.62% 94.09%",
        "94.77% 95.44% 95.07% 95.13%",
        "96.89% 96.39% 97.22%",
        "Lable 3: Lhematic rank prediction performance",
        "Lable 4 summarizes overall accuracy of SRC.",
        "Baseline performance is the overall accuracy of the local classifier.",
        "We can see that our re-ranking methods can yield significant improvemnts over the baseline.",
        "Lable 4: Overall SRC accuracy.",
        "Hierarchy prediction and re-ranking can be viewed as modification for local classification results with structural information.",
        "Lake the sentence \"[Some 'circuit breakers' installed after the October 1987] crash failed [their first test].\"",
        "for example, where phrases \"Some ... 1987\" and \"their ... test\" are two arguments.",
        "Lhe table below shows the local classification result (column Score(L)) and the rank prediction result (column Score(H)).",
        "Lhe baseline system falsely assigns roles as ArgO+Argl, the rank relation of which is y. Laking into account rank prediction result that relation ~ gets a extremely high probability, our system returns Argl+Arg2 as SRL result."
      ]
    },
    {
      "heading": "5. Conclusion and Future Work",
      "text": [
        "Inspired by thematic hierarchy theory, this paper concentrates on thematic hierarchy relation which characterize the structural information for SRL.",
        "Lhe prediction of thematic rank is formulated as a classification problem and a log-linear model is proposed to solve this problem.",
        "Lo improve SRC, we employ re-ranking technique to incorporate thematic rank information into the local semantic role classifier.",
        "Experimental results show that our methods can construct high-performance thematic rank detector and that identification of arguments' relations can significantly improve SRC."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "Lhis work is supported by NSLC Project 60873156, 863 High Lechnology Project of China 2006AA01Z144 and the project of Loshiba (China) Co., Ltd. R&D Center.",
        "Rel",
        "Freq.",
        "BL",
        "P(%)",
        "R(%)",
        "L",
        "y",
        "57.40",
        "94.79",
        "97.13",
        "98.33",
        "97.73",
        "-<",
        "9.70",
        "51.23",
        "98.52",
        "97.24",
        "97.88",
        "23.05",
        "13.41",
        "94.49",
        "93.59",
        "94.04",
        "=",
        "0.33",
        "19.57",
        "93.75",
        "71.43",
        "81.08",
        "AR",
        "5.55",
        "95.43",
        "99.15",
        "99.72",
        "99.44",
        "AC",
        "3.85",
        "78.40",
        "87.77",
        "82.04",
        "84.81",
        "CA",
        "0.16",
        "30.77",
        "83.33",
        "50.00",
        "62.50",
        "All",
        "-",
        "75.75",
        "96.42",
        "Gold",
        "Charniak",
        "Baseline",
        "Hard",
        "Soft",
        "95.14% 95.71% 96.07%",
        "94.12% 94.74% 95.44%",
        "Assignment",
        "Score(L)",
        "Score(H)",
        "ArgO+Argl",
        "78.97% x 82.30%",
        ">-:0.02%",
        "Arg 1+Arg 2",
        "14.25% x 11.93%",
        "~:99.98%"
      ]
    }
  ]
}
