{
  "info": {
    "authors": [
      "Dani Yogatama",
      "Kumiko Tanaka-Ishii"
    ],
    "book": "EMNLP",
    "id": "acl-D09-1091",
    "title": "Multilingual Spectral Clustering Using Document Similarity Propagation",
    "url": "https://aclweb.org/anthology/D09-1091",
    "year": 2009
  },
  "references": [
    "acl-C00-1024",
    "acl-C04-1138",
    "acl-W05-0802"
  ],
  "sections": [
    {
      "text": [
        "Dani Yogatama and Kumiko Tanaka-Ishii",
        "We present a novel approach for multilingual document clustering using only comparable corpora to achieve cross-lingual semantic interoperability.",
        "The method models document collections as weighted graph, and supervisory information is given as sets of must-linked constraints for documents in different languages.",
        "Recursive k-nearest neighbor similarity propagation is used to exploit the prior knowledge and merge two language spaces.",
        "Spectral method is applied to find the best cuts of the graph.",
        "Experimental results show that using limited supervisory information, our method achieves promising clustering results.",
        "Furthermore, since the method does not need any language dependent information in the process, our algorithm can be applied to languages in various alphabetical systems."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Document clustering is unsupervised classification of text collections into distinct groups of similar documents.",
        "It has been used in many information retrieval tasks, including data organization (Siersdorfer and Sizov, 2004), language modeling (Liu and Croft, 2004), and improving performances of text categorization system (Aggar-wal et al., 1999).",
        "Advance in internet technology has made the task of managing multilingual documents an intriguing research area.",
        "The growth of internet leads to the necessity of organizing documents in various languages.",
        "There exist thousands of languages, not to mention countless minor ones.",
        "Creating document clustering model for each language is simply unfeasible.",
        "We need methods to deal with text collections in diverse languages simultaneously.",
        "Multilingual document clustering (MLDC) involves partitioning documents, written in more than one languages, into sets of clusters.",
        "Similar documents, even if they are written in different languages, should be grouped together into one cluster.",
        "The major challenge of MLDC is achieving cross-lingual semantic interoperability.",
        "Most monolingual techniques will not work since documents in different languages are mapped into different spaces.",
        "Spectral method such as Latent Semantic Analysis has been commonly applied for MLDC task.",
        "However, current techniques strongly rely on the presence of common words between different languages.",
        "This method would only work if the languages are highly related, i.e., languages that share the same root.",
        "Therefore, we need another method to improve the robustness of MLDC model.",
        "In this paper, we focus on the problem of bridging multilingual space for document clustering.",
        "We are given text documents in different languages and asked to group them into clusters such that documents that belong to the same topic are grouped together.",
        "Traditional monolingual approach is impracticable since it is unable to predict how similar two multilingual documents are.",
        "They have two different spaces which make conventional cosine similarity irrelevant.",
        "We try to solve this problem utilizing prior knowledge in the form of must-linked constraints, gathered from comparable corpora.",
        "Propagation method is used to guide the language-space merging process.",
        "Experimental results show that the approach gives encouraging clustering results.",
        "This paper is organized as follows.",
        "In section 2, we review related work.",
        "In section 3, we propose our algorithm for multilingual document clustering.",
        "The experimental results are shown in section 4.",
        "Section 5 concludes with a summary.",
        "Proceedings of the 2009 Conference on Empirical Methods in Natural Language Processing, pages 871-879, Singapore, 6-7 August 2009.",
        "©2009 ACL and AFNLP"
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "Chen and Lin (2000) proposed methods to cluster multilingual documents using translation technology, relying on cross-lingual dictionary and machine-translation system.",
        "Multilingual ontology, such as Eurovoc, is also popular for MLDC (Pouliquen et al., 2004).",
        "However, such resources are scarce and expensive to build.",
        "Several other drawbacks of using this technique include dictionary limitation and word ambiguity.",
        "More recently, parallel texts have been used to connect document collections from different languages (Wei et al., 2008).",
        "This is done by collapsing columns in a term by document matrix that are translations of each other.",
        "Nevertheless, building parallel texts is also expensive and requires a lot of works, hence shifting the paradigm of multilingual works to comparable corpora.",
        "Comparable corpora are collections of texts in different languages regarding similar topics produced at the same time.",
        "The key difference between comparable corpora and parallel texts is that documents in comparable corpora are not necessarily translations of each other.",
        "They are easier to be acquired, and do not need exhaustive works to be prepared.",
        "News agencies often give information in many different languages and can be good sources for comparable corpora.",
        "Terms in comparable corpora, being about the same topic, up to some point explain the same concepts in different languages.",
        "Pairing comparable corpora with spectral method such as Latent Semantic Analysis has become prevalent, e.g. (Gliozzo and Strappar-ava, 2005).",
        "They rely on the presence of common words and proper nouns among various languages to build a language-independent space.",
        "The performance of such method is highly dependent on the languages being used.",
        "Here, we present another approach to exploit knowledge in comparable corpora; using propagation method to aid spreading similarity between collections of documents in different languages.",
        "Spectral clustering is the task of finding good clusters by using information contained in the eigenvectors of a matrix derived from the data.",
        "It has been successfully applied in many applications including information retrieval (Deerwester et al., 2003) and computer vision (Meila and Shi, 2000).",
        "An in-depth analysis of spectral algorithm for clustering problems is given in (Ng et al., 2002).",
        "Zhang and Mao (2008) used a related technique called Modularity Eigenmap to extract community structure features from the document network to solve hypertext classification problem.",
        "Semi-supervised clustering enhances clustering task by incorporating prior knowledge to aid clustering process.",
        "It allows user to guide the clustering process by giving some feedback to the model.",
        "In traditional clustering algorithm, only unlabeled data is used to find assignments of data points to clusters.",
        "In semi-supervised clustering, prior knowledge is given to improve performance of the system.",
        "The supervision is usually given as pair of must-linked constraints and cannot link constraints, first introduced in (Wagstaff and Cardie, 2000).",
        "Kamvar et al.",
        "(2003) proposed spectral learning algorithm that can take supervisory information in the form of pairwise constraints or labeled data.",
        "Their algorithm is intended to be used in monolingual context, while our algorithm is designed to work in multilingual context."
      ]
    },
    {
      "heading": "3. Multilingual Spectral Clustering",
      "text": [
        "There have been several works on multilingual document clustering as mention previously in Section 2.",
        "Our key contribution here is the propagation method to make spectral clustering algorithm works for multilingual problems.",
        "The clustering model exploits the supervisory information by detecting k nearest neighbors of the newly-linked documents, and propagates document similarity to these neighbors.",
        "The model can be applied to any multilingual text collections regardless of the languages.",
        "Overall algorithm is given in Section 3.1 and the method to merge multilingual spaces by similarity propagation is given in Section 3.2.",
        "Spectral clustering tries to find good clusters by using top eigenvectors of normalized data affinity matrix.",
        "The document set is being modeled as undirected graph G(V, E, W), where V, E, and W denote the graph vertex set, edge set, and transition probability matrix, respectively.",
        "In graph G, v G V represents a document, and weight Wij G W represents transition probability between document Vi to Vj.",
        "The transition probabilities can be interpreted as edge flows in Markov random walk over graph vertices (documents in collections).",
        "Algorithm to perform spectral clustering is given in Algorithm 1.",
        "Let A be affinity matrix where element is cosine similarity between document Viand Vj (Algorithm 1, line 1).",
        "It is straightforward that documents belonging to different languages will have similarity zero.",
        "Rare exception occurs when they have common words because the languages are related one another.",
        "As a consequence, the similarity matrix will have many zeros.",
        "Our model amplifies prior knowledge in the form of comparable corpora by performing document similarity propagation, presented in Section 3.2 (Algorithm 1, line 4; Algorithm 2, explained in Section 3.2).",
        "After propagation, the affinity matrix is post-processed (Algorithm 1, line 6, explained in Section 3.2) before being transformed into transition probability matrix.",
        "The transformation can be done using any normalization for spectral methods.",
        "Define N = D~lA, as in (Meila and Shi, 2001), where D is the diagonal matrix whose elements Dij = J2j Aij (Algorithm 1, line 7).",
        "Alternatively, we can define N = D~l/AD-/ (Ng et al., 2002), or N = (A + dmaxI - D)/dmax (Fiedler, 1975), where dmax is the maximum rowsum of A.",
        "For our experiment, we use the first normalization method, though other methods can be applied as well.",
        "Meila and Shi (2001) show that probability transition matrix N with t strong clusters will have t piecewise constant eigenvectors.",
        "They also suggest using these t eigenvectors in clustering process.",
        "We use the information contains in t largest eigenvectors of N (Algorithm 1, line 8-11) and perform K-means clustering algorithm to find the data clusters (Algorithm 1, line 12).",
        "We use information obtained from comparable corpora to merge multilingual language spaces.",
        "Suppose we have text collections in L different languages.",
        "We combine this collections with comparable corpora, also in L languages, that act as our supervisory information.",
        "Comparable corpora are used to gather prior knowledge by making must-linked constraints for documents in different languages that belong to the same topic in the corpora, propagating similarity to other documents while doing so.",
        "Initially, our affinity matrix A represents cosine similarity between all pairs of documents.",
        "is set to zero if j is not the top k nearest neighbors of i and likewise.",
        "Next, set Aij and Aji to 1 if document i and document j are different in lan-",
        "Algorithm 1 Multilingual Spectral Clustering Input: Term by document matrix M, pairwise constraints Output: Document clusters",
        "1: Create graph affinity matrix A G Wixn where each element A^ represents the similarity between document v% and Vj.",
        "2: for all pairwise constraints in comparable corpora do 3: Aij < 1, Aji < 1.",
        "4: Recursive Propagation (A, S, ß,k,Vi,Vj).",
        "6: Post-process matrix A so that every value in A is greater than ö and less than 1.",
        "7: Form a diagonal matrix D, where Da = Y,j A^.",
        "Normalize N = D~l A.",
        "8: Find x\\, X2 • • • ,xt,thet largest eigenvectors of N.",
        "9: Form matrix X = [x\\, X2, • • • , Xt] G Rrax*.",
        "10: Normalize row X to be unit length.",
        "ll: Project each document into eigen-space spanned by the above t eigenvectors (by treating each row of X as a point in R*, row i represents document Vi).",
        "12: Apply K-means algorithm in this space to find document clusters.",
        "guage and belong to the same topic in our comparable corpora.",
        "This will incorporate the must-linked constraint to our model.",
        "We can also give supervisory information for pairs of document in the same language, but this is optional.",
        "We also do not use cannot-linked constraints since the main goal is to merge multilingual spaces.",
        "In our experiment we show that using only must-linked constraints with propagation is enough to achieve encouraging clustering results.",
        "The supervisory information acquired from comparable corpora only connects two nodes in our graph.",
        "Therefore, the number of edges between documents in different languages is about as many as the number of must-linked constraints given.",
        "We argue that we need more edges between pairs of documents in different languages to get better results.",
        "We try to build more edges by propagating similarity to other documents that are most similar to the newly-linked documents.",
        "Figure 1 gives an illustration of edge-creation process when two multilingual documents (nodes) are connected.",
        "Sup-",
        "(a) Connect two nodes (b) Effect on neighbor nodes",
        "Figure 1 : Pairing two multilingual documents affect their neighbors.",
        "Vi and Vj are documents in two different languages.",
        "yx and zx are neighbors of Viand Vj respectively.",
        "pose that we have six documents in two different languages.",
        "Initially, documents are only connected with other documents that belong to the same language.",
        "The supervisory information tells us that two multilingual documents v% and Vj should be connected (Figure 1(a)).",
        "We then build an edge between these two documents.",
        "Furthermore, we also use this information to build edges between Viand neighbors of Vj and likewise (Figure 1(b)).",
        "This follows from the hypothesis that bringing together two documents should also bring other documents that are similar to those two closer in our clustering space.",
        "Klein et al.",
        "(2002) stated that a good clustering algorithm, besides satisfying known constraints, should also be able to satisfy the implications of those constraints.",
        "Here, we allow not only instance-level inductive implications, but utilize it to get higher-level inductive implications.",
        "In other words, we alter similarity space so that it can detect other clusters by changing the topology of the original space.",
        "The process is analogous to shortening the distance between sets of documents in Euclidean space.",
        "In vector space model, two documents that are close to each other have high similarity, and thus will belong to the same cluster.",
        "Pairing two documents can be seen as setting the distance in this space to 0, thus raising their similarity to 1.",
        "While doing so, each document would also draw sets of documents connected to it closer to the centre of the merge, which is equivalent to increasing their similarities.",
        "Suppose we have document Viand Vj, and y and z are sets of their respective k nearest neighbors, where \\y\\ = \\z\\ = k. The propagation method is a recursive algorithm with base S, the number of desired level of propagation.",
        "Recursive k-nearest neighbor makes decision to give high similarity between multilingual documents not only determined by their similarity to the newly-linked documents, but also their similarity to the k nearest neighbors of the respective document.",
        "Several documents are affected by a single supervisory information.",
        "This will prove useful when only limited amount of supervisory information given.",
        "It uses document similarity matrix A, as defined in the previous section.",
        "1.",
        "For yx G y we propagate ßAViVx to AVjVx.",
        "Set AVxVj = AVjVx (Algorithm 2, line 5-6).",
        "In other words, we propagate the similarity between document Viand y nearest neighbors of Vi to document Vj.",
        "2.",
        "Similarly, for zx G z we propagate ßAVjZxto AViZx.",
        "Set AZxVi = AViZx (Algorithm 2, line 10-11).",
        "In other words, we propagate the similarity between document Vj and z nearest neighbors of Vj to document Vi.",
        "3.",
        "Propagate higher order similarity to k nearest neighbors of y and z, discounting the similarity quadratically, until required level of propagation S is reached (Algorithm 2, line 7 and 12).",
        "The coefficient ß represents the degree of enforcement that the documents similar to a document in one language, will also have high similarity with other document in other language that is paired up with its ancestor.",
        "On the other hand, k represents the number of documents that are affected by pairing up two multilingual documents.",
        "After propagation, similarity of documents that falls below some threshold ö is set to zero (Algorithm 1, line 6).",
        "This post-processing step is performed to nullify insignificant similarity values propagated to a document.",
        "Additionally, if there exists similarity of documents that is higher than one, it is set to one.",
        "4: for all yx G k-NN document Vi do 5: AVjyx < – AV.yx + ßAViyx 7: Recursive Propagation (A,S – 1, 9: for all zx G k-NN document Vj do 10: Set AViZx < – AViZx + ßAVjZx il: Set AZxVi < – AViZx 12: Recursive Propagation (A, 5 – 1,"
      ]
    },
    {
      "heading": "4. Performance Evaluation",
      "text": [
        "The goals of empirical evaluation include (1) testing whether the propagation method can merge multilingual space and produce acceptable clustering results; (2) comparing the performance to spectral clustering method without propagation.",
        "We tested our model using Reuters Corpus Volume 2 (RCV2), a multilingual corpus containing news in thirteen different languages.",
        "For our experiment, three different languages: English, French, and Spanish; in six different topics: science, sports, disasters accidents, religion, health, and economy are used.",
        "We discarded documents with multiple category labels.",
        "We do not apply any language specific preprocessing method to the raw text data.",
        "Monolingual TFIDF is used for feature weighting.",
        "All document vectors are then converted into unit vector by dividing by its length.",
        "Table 1 shows the average length of documents in our corpus.",
        "For our experiment, we used Rand Index (RI) which is a common evaluation technique for clustering task where the true class of unlabeled data",
        "Table 1 : Average number of words of documents in the corpus.",
        "Each language consists of 600 documents, and each topic consists of 100 documents (per language).",
        "is known.",
        "Rand Index measures the percentage of decisions that are correct, or simply the accuracy of the model.",
        "Rand Index is defined as:",
        "Rand Index penalizes false positive and false negative decisions during clustering.",
        "It takes into account decision that assign two similar documents to one cluster (TP), two dissimilar documents to different clusters (TN), two similar documents to different clusters (FN), and two dissimilar documents to one cluster (FP).",
        "We do not include links created by supervisory information when calculating true positive decisions and only consider the number of free decisions made.",
        "We also used Fa-measure, the weighted harmonic mean of precision (P) and recall (R).",
        "Fa-measure is defined as:",
        "Last, we used purity to evaluate the accuracy of assignments.",
        "Purity is defined as:",
        "max \\ut H Cj\\",
        "where N is the number of documents, t is the number of clusters, j is the number of classes, uot and Cj are sets of documents in cluster t and class j respectively.",
        "Algorithm 2 Recursive Propagation",
        "English",
        "French",
        "Spanish",
        "Total",
        "Input: Affinity matrix A, level of propagation 5,",
        "Science",
        "290.10",
        "165.10",
        "213.45",
        "222.88",
        "ß, number of nearest neighbors k, document Vi",
        "Sports",
        "182.55",
        "156.83",
        "189.75",
        "176.37",
        "and Vj",
        "Disasters",
        "154.29",
        "175.89",
        "165.31",
        "165.16",
        "Output: Propagated affinity matrix",
        "Religion",
        "317.77",
        "177.91",
        "242.67",
        "246.11",
        "Health",
        "251.19",
        "233.70",
        "227.25",
        "237.38",
        "l: if 5 = Othen",
        "Economy",
        "266.89",
        "192.55",
        "306.11",
        "255.08",
        "2: return",
        "Total",
        "243.79",
        "183.61",
        "224.09",
        "217.16",
        "Ct.",
        "With propagation Without propagation LSA",
        "(a) Rand Index for 6 topics",
        "Wth propagation Wthout propagation LSA",
        "(b) Rand Index for 4 topics",
        "Figure 2: Rand Index on the RCV2 task with (a) 1800 documents, 6 topics; and (b) 1200 documents, 4 topics as the proportion of supervisory information increases.",
        "fc = 30,£ = 0.03,/3 = 0.5,i = number of topics, and 5 = 2.",
        "(a) Purity for 6 topics (b) Purity for 4 topics",
        "Figure 3: Purity on the RCV2 task with (a) 1800 documents, 6 topics; and (b) 1200 documents, 4 topics as the proportion of supervisory information increases, k = 30, ö = 0.03, ß = 0.5, t = number of topics, and 5 = 2.",
        "To prove the effectiveness of our clustering algorithm, we performed the following experiments on our data set.",
        "We first tested our algorithm on four topics, science, sports, religion, and economy.",
        "We then tested our algorithm using all six topics to get an understanding of the performance of our model in larger collections with more topics.",
        "We used subset of our data as supervisory information and built must-linked constraints from it.",
        "The proportion of supervisory information provided to the system is given in a>axis (Figure 2 - Figure 4.3).",
        "0.2 here means 20% of documents in each language are taken to be used as prior knowledge.",
        "Since the number of documents in each language for our experiment is the same, we have the same numbers of documents in subset of English collection, subset of French collection, and subset of Spanish collection.",
        "We also ensure there are same numbers of documents for a particular topic in all three languages.",
        "We can build must-linked constraints as follows.",
        "For each document in the subset of English collection, we create must-linked constraints with one randomly selected document from the subset of French collection and one randomly selected document from the subset of Spanish collection that belong to the same topic with it.",
        "We then create must-linked constraint between the respective French and Spanish documents.",
        "The constraints given to the algorithm are chosen so that there are several links that connect every topic in every language.",
        "Note that the class label in-",
        "With propagation Without propagation LSA ~ • \"With propagation Wthout propagation LSA",
        "(a) F2 measure for 6 topics (b) F2 measure for 4 topics",
        "Figure 4: ^-measure on the RCV2 task with (a) 1800 documents, 6 topics; and (b) 1200 documents, 4 topics as the proportion of supervisory information increases.",
        "fc = 30,£ = 0.03,/3 = 0.5,i = number of topics, and 5 = 2.",
        "formation is only used to build must-linked constraints between documents, and we do not assign the documents to a particular cluster.",
        "Figure 2 shows the Rand Index as proportion of supervisory information increases.",
        "Figure 3 and Figure 4.3 give purity and ^-measure for the algorithm respectively.",
        "To show the importance of the propagation in multilingual space, we give comparison with spectral clustering model without propagation.",
        "Three lines in Figure 2 to Figure 4.3 indicate: (1) results with propagation (solid line); (2) results without propagation (long-dashed line); and (3) results using Latent Semantic Analysis(LSA)-based method by exploiting common words between languages (short-dashed line).",
        "For each figure, 6 plots are taken starting from 0 in 0.2-point-increments.",
        "We conducted the experiments three times for each proportion of supervisory information and use the average values.",
        "As we can see from Figure 2, Figure 3, and Figure 4.3, the propagation method can significantly improve the performance of spectral clustering algorithm.",
        "For 1800 documents in 6 topics, we manage to achieve RI = 0.91, purity = 0.84, and ^-measure = 0.76 with only 20% of documents (360 documents) used as supervisory information.",
        "Spectral clustering algorithm without propagation can only achieve 0.69, 0.30, 0.28 for RI, purity, and F2-measure respectively.",
        "The propagation method is highly effective when only small amount of supervisory information given to the algorithm.",
        "Obviously, the more supervisory information given, the better the performance is.",
        "As the number of supervisory information increases, the difference of the model performance with and without propagation becomes smaller.",
        "This is because there are already enough links between multilingual documents, so we do not necessarily build more links through similarity propagation anymore.",
        "However, even when there are already many links, our model with propagation still outperforms the model without propagation.",
        "We compare the performance of our algorithm to LSA-based multilingual document clustering model.",
        "We performed LSA to the multilingual term by document matrix.",
        "We do not use parallel texts and only rely on common words across languages as well as must-linked constraints to build multilingual space.",
        "The results show that exploiting common words between languages alone is not enough to build a good multilingual semantic space, justifying the usage of supervisory information in multilingual document clustering task.",
        "When supervisory information is introduced, our method achieves better results than LSA-based method.",
        "In general, the LSA-based method performs better than the model without propagation.",
        "We assess the sensitivity of our algorithm to parameter ß, the penalty for similarity propagation.",
        "We assess the sensitivity of our algorithm to parameter ß, the penalty for similarity propagation.",
        "We tested our algorithm using various ß, starting from 0 to 1 in 0.2-point-increments, while other parameters being held constant.",
        "Figure 5(a) shows that changing ß to some extent affects the performance of the algorithm.",
        "However, after some value of reasonable ß is found, increasing ß does not have significant impact on the per-",
        "Figure 5: Rand Index on the RCV2 task with 1800 documents and 6 topics as (a) ß increases; (b) k increases; and (c) t increases, ö = 0.03,5* = 2, and 20% of documents are used as supervisory information.",
        "formance of the algorithm.",
        "We also tested our algorithm using various k, starting from 0 to 100 in 20-point-increments.",
        "Figure 5(b) reveals that the performances of the model with different k are comparable, as long as k is not too small.",
        "However, using too large k will slightly decrease the performance of the model.",
        "Too many propagations make several dissimilar documents receive high similarity value that cannot be nullified by the post-processing step.",
        "Last, we experimented using various t ranging from 2 to 20.",
        "Figure 5(c) shows that the method performs best when t = 10, and for reasonable value of t the method achieves comparable performance."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "We present here a multilingual spectral clustering model that is able to work irrespective of the languages being used.",
        "The key component of our model is the propagation algorithm to merge multilingual spaces.",
        "We tested our algorithm on Reuters RCV2 Corpus and compared the performance with spectral clustering model without propagation.",
        "Experimental results reveal that using limited supervisory information, the algorithm achieves encouraging clustering results."
      ]
    }
  ]
}
