{
  "info": {
    "authors": [
      "Beata Beigman Klebanov",
      "Eyal Beigman"
    ],
    "book": "Computational Linguistics",
    "id": "acl-J09-4005",
    "title": "Squibs: From Annotator Agreement to Noise Models",
    "url": "https://aclweb.org/anthology/J09-4005",
    "year": 2009
  },
  "references": [
    "acl-W08-1202"
  ],
  "sections": [
    {
      "text": [
        "Squibs",
        "From Annotator Agreement to Noise Models",
        "Beata Beigman Klebanov* Northwestern University",
        "Eyal Beigman** Northwestern University",
        "This article discusses the transition from annotated data to a gold standard, that is, a subset that is sufficiently noise-free with high confidence.",
        "Unless appropriately reinterpreted, agreement coefficients do not indicate the quality of the data set as a benchmarking resource: High overall agreement is neither sufficient nor necessary to distill some amount of highly reliable data from the annotated material.",
        "Amathematical framework is developed that allows estimation of the noise level ofthe agreed subset ofannotated data, which helps promote cautious benchmarking."
      ]
    },
    {
      "heading": "1.. Introduction",
      "text": [
        "By and large, the reason a computational linguist engages in an annotation project is to build a reliable data set for the eventual testing, and possibly training, of an algorithm performing the task.",
        "Hence, the crucial question regarding the annotated data set is whether it is good for benchmarking.",
        "For classification tasks, the current practice is to infer this information from the value of an inter-annotator agreement coefficient such as the k statistic (Cohen 1960; Siegel and Castellan 1988; Carletta 1996).",
        "If agreement is high, the whole of the data set is good for training and testing; the remaining disagreements are typically adjudicated by an expert (Snyder and Palmer 2004; Palmer, Kingsbury, and Gildea 2005; Girju, Badulescu, and Moldovan 2006) or through discussion (Litman, Hirschberg, and Swerts 2006), or, in case of more than two annotators, the majority label is chosen (Vieira and Poesio 2000).",
        "There are some studies where cases of disagreement were removed from test data (Markert and Nissim 2002; Dagan, Glickman, and Magnini 2006).",
        "If agreement is low, the whole data set is discarded as unreliable.",
        "The threshold of acceptability seems to have stabilized around k = 0.67 (Carletta 1996; Di Eugenio and Glass 2004).",
        "There is little understanding, however, of exactly how and how well the value of k reflects the quality of the data for benchmarking purposes.",
        "We develop a model of annotation generation that allows estimation of the level of noise in a specially constructed gold standard.",
        "A gold standard with a noise figure supports cautious benchmarking,",
        "* Kellogg School of Management, Northwestern University, Evanston, IL, beata@northwestern.edu.",
        "** Kellogg School of Management, Northwestern University, Evanston, IL, e-beigman@northwestern.edu.",
        "1 In many studies, the procedure for handling disagreements is not clearly specified.",
        "For example, Gildea and Jurafsky (2002) mention a \"consistency check\"; in Lapata (2002), two annotators attained k = 0.78on 200 test instances, but it is not clear how cases of disagreements were settled.",
        "Submission received: 30 June 2008; revised submission received: 3 December 2008; accepted for publication: 26 January 2009.",
        "by requiring that the performance of an algorithm be better than baseline by more than that which can be attributed to noise.",
        "Articulating an annotation generation model also allows us to shed light on the information k can contribute to benchmarking."
      ]
    },
    {
      "heading": "2.. Annotation Noise",
      "text": [
        "We are interested in finding out which parts of the annotated data are sufficiently reliable.",
        "This question presupposes a division of instances into two types: reliable and unreliable, or, as we shall call them, easy and hard, under the assumption that items that are easy are reliably annotated, whereas items that are hard display confusion and disagreement.",
        "The plausibility of separation into easy and hard instances is supported by researchers conducting annotation projects: \"With many judgments that characterize natural language, one would expect that there are clear cases as well as borderline cases that are more difficult to judge\" (Wiebe, Wilson, and Cardie 2005, page 200).",
        "This suggests a model of annotation generation with latent variables for types, thus, for every instance i, there is a variable li with values E (easy) and H (hard).",
        "Let n be the number of instances, k the number of annotators, and Xj the classification of the ith instance by the jth annotator.",
        "An annotation generation model assigns a functional form to the joint distribution conditioned on the latent variable P(Xü, ..., Xik\\li).",
        "Similar models have been studied in biometrics (Aickin 1990; Hui and Zhou 1998; Albert, McShane, and Shih 2001; Albert and Dodd 2004).",
        "The main assumption is that, conditioned on the type, annotators agree on easy instances and independently flip a coin on hard ones.",
        "The joint distribution satisfies:",
        "We want to take only easy instances into the gold standard, so that it contains only settled, trustworthy judgments.",
        "The problem is that the fact of being easy or hard is not directly observable, but has to be inferred from the observed annotations.",
        "In particular, some of the observed agreements will in fact be hard instances, since coin-flips could occasionally come out all-heads or all-tails.",
        "Our objective is to estimate, with a given degree of confidence (a), the proportion y of hard instances in the agreed annotations, based on the number of observed disagreements.",
        "The value of y is the level of annotation noise in the gold standard comprising agreed annotations.",
        "Let p be the probability that the annotators agree on a hard instance in a binary classification task:",
        "Denote by Ad the event that there are d disagreed instances; these are hard, and are assumed to be labeled by coin-flips.",
        "Let Bh be the event that there are overall h hard",
        "2 On the status of hard instances, see Section 5.1.",
        "instances; some of these may be unobserved as they surface as random agreements.",
        "We note that P(Ad\\Bh) = q) • (1 - p)d • ph – d for d < h, hence:",
        "Let X be a random variable designating the number of coin-flips.",
        "It follows that",
        "Let t0 be the smallest integer for which P(X > t0\\Ad) < 1 – a.Given d observed disagreements, we estimate the noise level of the agreed subset of the annotations as at most y = , with confidence a."
      ]
    },
    {
      "heading": "3.. Relation to k Statistic",
      "text": [
        "Suppose 1,000 instances have been annotated by two people, such that 900 are instances of agreement.",
        "Both in the 900 agreed instances and in the 100 disagreed ones, the categories were estimated to be equiprobable for both annotators.",
        "In this case p = 0.5, k = 0.8, which is usually taken to be an indicator of sufficiently agreeable guidelines, and, by implication, of a high quality data set.",
        "Our candidate gold standard is the 900 instances of agreement.",
        "What is its 95% confidence noise rate?",
        "We find, using our model, that with more than 5% probability up to 125 agreements are due to coin-flipping, hence y = 13.8%.",
        "This scenario is not hypothetical.",
        "In Poesio and Vieira (1998) Experiment 1, the classification of definite descriptions into Anaphoric-or-Associative versus Unfamiliar has n = 992, d = 121, p = 0.47, which, with 95% confidence, yields y = 15%.",
        "Let us reverse the question: For a two-annotator project with 1,000 instances, how many disagreements could we tolerate, so that the agreed part is 95% noise-free with 95% confidence?",
        "Only 33 disagreements, corresponding to k = 0.93.",
        "In practice, this means that a two-annotator project of this size is unlikely to produce a high-quality gold standard, the high k notwithstanding.",
        "Suppose now 1,000 instances are annotated by five people, with 660 agreements.",
        "With categories equiprobable in both hard and easy instances, p = 0.0625.",
        "The exact value of k depends on the distribution of votes in the 340 disagreed cases, from k = 0.73 when all disagreements are split 4-to-1, to k = 0.52 when all disagreements are split 3-to-2.",
        "Assuming disagreements are coin-flips, the most likely measurement would be about k = 0.637, where the 340 observed coin-flips yielded the most likely pattern.",
        "This value of k is considered low, yet the 660 agreed items make a gold standard within the",
        "3 We estimate P(Xj = = H) by the proportion of disagreed instances that annotator j put in category 1.",
        "4 For calculating k, we use the version shown in Equation (2).",
        "5 In all our calculations P(B1) =... = P(Bn), that is, a priori, any number of hard instances is equiprobable.",
        "6 That is, there are twice as many 3-to-2 cases than 4-to-1, corresponding to () as opposed to @.",
        "Klebanov and noise rate of y = 5% with 95% confidence, according to our model.",
        "Hence it is possible for the overall annotation to have lowish k, but the agreement of all five annotators, if observed sufficiently frequently, is reliable, and can be used to build a clean gold standard.",
        "3.3 Interpreting the k Statistic in the Annotation Generation Model",
        "The k statistic is defined as k = where PA is the observed agreement and PE is the agreement expected by chance, calculated from the marginals.",
        "We use the Siegel and Castellan (1988) version, referred to as K in Artstein and Poesio (2008):",
        "where n is the number of items; m is the number of categories; k is the number of annotators; and aij is the number of annotators who assigned the ith item to the jth category.",
        "Suppose there are h hard instances and e easy ones, and m = 2.",
        "Suppose further that all annotators flip the same coin on hard instances, and that the distribution of the categories in easy and hard instances is the same and is given by q1,qm.",
        "Then the probability for chance agreement between two annotators is q = YH==1 qj, of which PE is an estimator.",
        "Agreement on a particular instance PAi is measured by the proportion of agreeing pairs of annotators out of all such pairs, and PA is an estimator of the expected agreement across all instances.",
        "Our model assumes perfect agreement on easy instances and agreement with probability q on hard ones, so we expect to see e+q-h agreed instances, hence PA is an estimator of ee-^.",
        "Putting these together, k = P1a~p'e is an estimator of \\_0j = , the proportion of easy instances.",
        "In fact, Aickin (1990) shows that k is very close to this ratio when the marginal distribution over the categories is uniform, with a more substantial divergence for skewed category distributions.",
        "The correspondence between k and the proportion of easy instances makes it clear why k is not a sufficient indicator of data quality for benchmarking.",
        "For when k = 0.8, 20% of the data are hard cases.",
        "Using all data, especially for testing, is thus potentially hazardous, and the crucial question is: Can we zero in on the easy instances effectively, without admitting much noise?",
        "This is exactly the question answered by the model.",
        "When the distribution of categories is the same in easy and hard instances and uniform, k can be used to address this question as well.",
        "Recall that in the two-annotator case in Section 3.1, k = 0.8, that is, 80% of instances are estimated to be easy.",
        "Because easy cases are a subset of agreed ones in our model, 800 of the agreed 900 instances are easy, giving an estimate of 11% noise in the gold standard.",
        "Requiring 95% confidence in noise estimation, we found y = 13.8%, using our model.",
        "Similarly, in the five-annotator",
        "7 The proportion of easy cases is positive, whereas the estimator k can be negative with non-negligible probability when e = O(\\fh).",
        "8 In Aickin (1990), category distribution on easy cases is derived from that in the hard cases.",
        "The closer the categories are to uniform distribution in the hard cases, the closer their distribution in hard cases is to that in easy cases.",
        "For example, if the categories are distributed uniformly in hard cases, they are also so distributed in the easy ones.",
        "If the categories are distributed ( 3, 3 ) in the hard cases, they are distributed ( i, 5 ) in the easy cases.",
        "For this reason, in Aickin's model, it is not possible to distinguish between category imbalance (many more 0s than 1s) and differences in category distributions in easy and hard cases.",
        "His simulations show that in cases of category imbalance (which imply, in his model, differences in category distributions in easy and hard cases), k tends to underestimate the proportion of easy instances.",
        "scenario in Section 3.2, k = 0.637 tells us that about 637 out of 1,000 instances are easy; they are captured quite precisely by the 660 agreements, yielding a noise estimate of 3.5%, again somewhat lower than the high confidence one we gave using the model."
      ]
    },
    {
      "heading": "4.. Training and Testing in the Presence ofAnnotation Noise",
      "text": [
        "We discuss two uses of a gold standard within the benchmarking enterprise.",
        "The data could be used for testing, and, if there is enough of it and after an appropriate partition, for training as well.",
        "We consider each case separately in the following sections.",
        "The two questions one wants to answer using the data are: How well does an algorithm capture the phenomenon?",
        "For any two algorithms, which one is better?",
        "Consider the algorithm comparison situation.",
        "Suppose we have a gold standard with L items of which up to R are noise (y= R).",
        "Two algorithms might differ in performance on the easy cases, the hard ones, or both.",
        "Because we cannot distinguish between easy and hard instances in the gold standard, we are unable to attribute the difference in performance correctly.",
        "Moreover, as the annotations of the hard instances are random coin-flips, there is an expected difference in performance that is a result of pure chance.",
        "Suppose two algorithms perform equally well on easy instances; their performance on the hard ones is as good as agreement-by-coin-flipping would allow.",
        "Thus, the difference in the number of \"correct\" answers on hard instances for algorithms A and B is a random variable S satisfying S = er=1 X where X1,..., Xr are independent and identically distributed random variables which obtain values – 1 (A \"right\", B \"wrong\") and 1 (A \"wrong\", B \"right\") with probability 4 and 0 with probability ^thus u.S = 0; <7S = y/TR.",
        "By Chebyshev's inequality Pr(\\S\\ > ka) < that is, the chance difference between the algorithms will be within 4.5<r with 95% probability.",
        "In our example, L = 900 and R = 125, hence a difference of up to 35 \"correct\" answers (3.9% of the gold standard) can be attributed to chance.",
        "This example shows that even if getting a clean data set is not feasible, it is important to report the noise rate of the data set that has been produced.",
        "This would allow calibrating the benchmarking procedure by requiring the difference between the two competing algorithms to be larger than the chance difference scale.",
        "Some perils of testing on noisy data were discussed in a recent article in this journal by Reidsma and Carletta (2008).",
        "They showed that a machine-learning classifier is sensitive to the type of noise in the data.",
        "Specifically, if the noise is in the form of category overuse (an annotator disproportionately favors a certain category), when algorithm performance is measured against the noisy data, accuracy estimates are often inflated relative to performance on the real data, uncorrupted by noise (see Figure 3(b) therein).",
        "This is because \"when the observed data is used to test performance, some of",
        "9For large R, normal approximation can be used with the tighter 2a bound for 95% confidence.",
        "10 We note that because the difference attributable to coin-flipping is O(^pL ), and assuming noise rate is constant, the scale of chance difference diminishes with larger data sets (see also footnote 9).",
        "The issue is more important when dealing with small-to-moderate data sets.",
        "However, even for a 130K test set (Sections 22-24 of the Wall Street Journal corpus, standardly used as a test set in POS-tagging benchmarks), it is useful to know the estimated noise rate, as it is not clear that all reported improvements in performance would come out significant.",
        "For example, Shen, Satta, and Joshi (2007) summarize performance of five previously published and three newly reported algorithms, all between 97.10% and 97.33%.",
        "Klebanov and the samples match not because the classifier gets the label right, but because it overuses the same label as the human coder\" (Reidsma and Carletta 2008, page 232).",
        "On the other hand, if disagreements are random classification noise (the label of any instance can be flipped with a certain probability), a performance estimate based on observed data would often be lower than performance on the real data, because the noise that corrupted it was ignored by the classifier (see Figure 2(d) therein).",
        "Reidsma and Carletta (2008) suggest that the community develops methods to investigate the patterns of disagreements between annotators to gain insight into the potential of incorrect performance estimation.",
        "Although we agree on the general point that human agreements and disagreements should bear directly on the practice of estimating the performance of an algorithm, we focus on improving the quality of performance estimation.",
        "We suggest (1) mitigating the effect of annotation noise on performance estimation by using the least noisy part of the data set for testing, that is, a gold standard with agreed items; (2) providing an estimate of the level of noise in the gold standard, which can be used to gauge the divergence between the estimate of performance using the gold standard from the real performance figure on the easy instances (i.e., on noise-free data), similarly to the algorithm comparison scenario provided herein.",
        "The problem with noise in the training data is the potential for misclassification of easy instances in the test data as a result of hard instances in the training data, the problem we call hard case bias.",
        "Learning in the presence of noise is an active research area in machine learning.",
        "However, annotation noise is different from existing well-understood noise models.",
        "Specifically, random classification noise, where each instance has the same probability of having its label flipped, is known to be tolerable in supervised learning (Blum et al.",
        "1996; Cohen 1997; Reidsma and Carletta 2008).",
        "In annotation noise, coin-flipping is confined to hard instances, which should not be assumed to be uniformly distributed across the feature space.",
        "Indeed, there is reason to believe that they form clusters; certain feature combinations tend to give rise to hard instances.",
        "The finding reported by Reidsma and op den Akker (2008) that a classifier trained on data from one annotator tended to agree much better with test data from the same annotator than with that of another annotator exemplifies a situation where observed hard cases (i.e., cases where the annotators disagree) constitute a pattern in the feature space that a classifier picks up.",
        "In a separate article, we establish a number of properties of learning under annotation noise (Beigman and Beigman Klebanov 2009).",
        "We show that the 0-1 loss model may be vulnerable to annotation noise for small data sets, but becomes increasingly robust the larger the data set, with worst-case hard case bias of 0().",
        "We also show that learning with the popular voted-perceptron algorithm (Freund and Schapire 1999) could suffer a constant rate of hard case bias irrespective of the size of the data set."
      ]
    },
    {
      "heading": "5.. Discussion",
      "text": [
        "We suggested that only the easy instances should be taken into the gold standard.",
        "This is not to say that hard cases should be eliminated from the researcher's attention; we merely argue that they should not be used for testing algorithms for benchmarking purposes.",
        "Hard cases are interesting for theory development, because this is where the theory might have a difficulty, but they do not allow for a fair comparison, as their correct label cannot be determined under the current theory.",
        "The agreed data embodies the well-articulated parts of the theory, which are ready for deployment as a gold standard for machine learning.",
        "Once the theory is improved to a stage where some of the previously hard cases receive an unproblematic treatment, those items can be added to the data set, which can make the task more challenging for the machine.",
        "Linguistic theories-in-the-making can have limited coverage; they do not immediately attain the status of medical conditions, for example, where there presumably exists a true label even for the hardest-to-diagnose cases.",
        "Beyond the separation into easy and hard instances, our model prescribes certain annotator behavior for each type.",
        "In our work on metaphor, we observed that certain metaphor markups were retracted by their authors, when asked after 4-8 weeks to revisit the annotations (Beigman Klebanov, Beigman, and Diermeier 2008).",
        "These were apparently hard cases, with people resolving their doubts inconsistently on the two occasions; coin-flipping is a reasonable first-cut model for such cases.",
        "The model also accommodates category overuse bias (Di Eugenio and Glass 2004; Artstein and Poesio 2008; Reidsma and Carletta 2008), as P(Xj = bj\\li = H) may vary across annotators.",
        "Still, this model is clearly a simplification.",
        "For example, it is possible that there is more than one degree of hardness, and annotator behavior changes accordingly.",
        "Another extension is modeling imperfect annotators, allowed to commit random errors on easy cases; this extension would be needed if a large number of annotators is used.",
        "Such extensions, as well as methods for estimating these more complex models, should clearly be put on the community's research agenda.",
        "The main contribution of the simple model is in outlining the trajectory from agreement to gold standard with a noise estimate, and indicating the potential benefit of the latter to data utilization (low overall agreement does not preclude the existence of a reliable subset) and to prudent benchmarking.",
        "Furthermore, the simple model helps us improve the understanding of the information provided by the k statistic, and to appreciate its limitations.",
        "It also allows us to see the benefit of adding annotators, as discussed in the next section.",
        "If we want the test data to be able to detect small advances in machines' handling of the task, we need to produce gold standards with low noise levels.",
        "The level of noise in agreed data depends on two parameters: (a) the number of agreed items, and (b) the probability of chance agreement between annotators.",
        "Although the first is not under the researcher's control once the data set is chosen, the second is, by changing the number of annotators.",
        "Obviously, the more annotators are required to agree, the lower P will be, and the smaller the number of agreements that can be attributed to coin-flipping.",
        "If indeed 800 out of 1,000 items are easy, agreement between two annotators can only detect them with up to 13.8% noise.",
        "Adding a third annotator means p = 0.25.",
        "11 As one of the anonymous reviewers pointed out, some medical conditions, such as autism, are also only partially understood.",
        "Klebanov and",
        "We are most likely to observe 850 agreed instances, which would not contain more than 7.7% noise, with 95% confidence.",
        "Effectively, we got rid of about half the random agreements."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We thank Eli Shamir and Bei Yu for reading earlier drafts of this article, as well as the editor and the anonymous reviewers for comments that helped us improve the article significantly."
      ]
    }
  ]
}
