{
  "info": {
    "authors": [
      "Sebastian Varges",
      "Silvia Quarteroni",
      "Giuseppe Riccardi",
      "Alexei V. Ivanov",
      "Pierluigi Roberti"
    ],
    "book": "ACL-IJCNLP: Software Demos",
    "id": "acl-P09-4011",
    "title": "Combining POMDPs trained with User Simulations and Rule-based Dialogue Management in a Spoken Dialogue System",
    "url": "https://aclweb.org/anthology/P09-4011",
    "year": 2009
  },
  "references": [
    "acl-P03-1031",
    "acl-W08-0109"
  ],
  "sections": [
    {
      "text": [
        "Sebastian Varges, Silvia Quarteroni, Giuseppe Riccardi, Alexei V. Ivanov, Pierluigi Roberti",
        "{varges|silviaq|riccardi|ivanov|roberti}@disi.unitn.it",
        "Over several years, we have developed an approach to spoken dialogue systems that includes rule-based and trainable dialogue managers, spoken language understanding and generation modules, and a comprehensive dialogue system architecture.",
        "We present a Reinforcement Learning-based dialogue system that goes beyond standard rule-based models and computes on-line decisions of the best dialogue moves.",
        "The key concept of this work is that we bridge the gap between manually written dialog models (e.g. rule-based) and adaptive computational models such as Partially Observable Markov Decision Processes (POMDP) based dialogue managers."
      ]
    },
    {
      "heading": "1. Reinforcement Learning-based Dialogue Management",
      "text": [
        "In recent years, Machine Learning techniques, in particular Reinforcement Learning (RL), have been applied to the task of dialogue management (DM) (Levin et al., 2000; Williams and Young, 2006).",
        "A major motivation is to improve robustness in the face of uncertainty, for example due to speech recognition errors.",
        "A further motivation is to improve adaptivity w.r.t.",
        "different user behaviour and application/recognition environments.",
        "The Reinforcement Learning framework is attractive because it offers a statistical model representing the dynamics of the interaction between system and user.",
        "This is in contrast to the supervised learning approach of learning system behaviour based on a fixed corpus (Higashinaka et al., 2003).",
        "To explore the range of dialogue management strategies, a simulation environment is required that includes a simulated user (Schatz-mann et al., 2006) if one wants to avoid the prohibitive cost of using human subjects.",
        "We demonstrate the various parameters that influence the learnt dialogue management policy by using pre-trained policies (section 4).",
        "The application domain is a tourist information system for accommodation and events in the local area.",
        "The domain of the trained DMs is identical to that of a rule-based DM that was used by human users (section 2), allowing us to compare the two directly.",
        "The state of the POMDP keeps track of the SLU hypotheses in the form of domain concepts (10 in the application domain, e.g. main activity, star rating of hotels, dates etc.)",
        "and their values.",
        "These values may be abstracted into 'known/unknown,' for example, increasing the likelihood that the system revisits a dialogue state which it can exploit.",
        "Representing the verification status of the concepts in the state, influences - in combination with the user model (section 1.2) and N best hypotheses - if the system learns to use clarification questions.",
        "1.1 The exploration/exploitation trade-off in reinforcement learning",
        "The RL-DM maintains a policy, an internal data structure that keeps track of the values (accumulated rewards) of past state-action pairs.",
        "The goal of the learner is to optimize the long-term reward by maximizing the 'Q-Value' Q7T(st, a) of a policy 7T for taking action a at time t. The expected cumulative value V of a state s is defined recursively as V*(st) =",
        "Since an analytic solution to finding an optimal value function is not possible for realistic dialogue scenarios, V{s) is estimated by dialogue simulations.",
        "To optimize and populate the policy with expected values, the learner needs to explore untried actions (system moves) to gain more experiences, and combine this with exploitation of the",
        "# sessions # sessions",
        "(a) 0% exploration, 100% exploitation: learner does not find (b) 20% exploration, 80% exploitation: noticeable increase in optimal dialogue strategy reward, hitting upper bound",
        "Figure 1 : Exploration/exploitation trade-off already known successful actions to also ensure high reward.",
        "In principle there is no distinction between training and testing.",
        "Learning in the RL-based dialogue manager is strongly dependent on the chosen exploration/exploitation trade-off.",
        "This is determined by the action selection policy, which for each system turn decides probabilistically (e-greedy, softmax) if to exploit the currently known best action of the policy for the believed dialogue state, or to explore an untried action.",
        "Figure 1(a) shows, for a subdomain of the application domain, how the reward (expressed as minimizing costs) reaches an upper bound early during 10,000 simulated dialogue sessions (each dot represents the average of 10 rewards at a particular session number).",
        "Note that if the policy provides no matching state, the system can only explore, and thus a certain amount of exploration always takes place.",
        "In contrast, with exploration the system is able to find lower cost solutions (figure 1(b)).",
        "In order to conduct thousands of simulated dialogues, the DM needs to deal with heterogeneous but plausible user input.",
        "For this purpose, we have designed a User Simulator (US) which bootstraps likely user behaviors starting from a small corpus of 74 in-domain dialogs, acquired using the rule-based version of the SDS (section 2).",
        "The task of the US is to simulate the output of the SLU module to the DM, hence providing it with a ranked list of SLU hypotheses.",
        "A list of possible user goals is stored in a database table (section 3) using a frame/slot representation.",
        "For each simulated dialogue, one or more user goals are randomly selected.",
        "The User Simulator's task is to mimic a user wanting to perform such task(s).",
        "At each turn, the US mines the previous system dialog act to obtain the concepts required by the DM and obtains the corresponding values (if any) from the current user goal.",
        "The output of the user model proper is passed to an error model that simulates the \"noisy channel\" recognition errors based on statistics from the dialogue corpus.",
        "These concern concept values as well as other dialogue phenomena such as noln-put, noMatch and hangUp.",
        "If the latter phenomena occur, they are propagated to the DM directly; otherwise, the following US step is to attach plausible confidences to concept-value pairs, also based on the dialogue corpus.",
        "Finally, concept-value pairs are combined in an SLU hypothesis and, as in the regular SLU module, a cumulative utterance-level confidence is computed, determining the rank of each of the n hypotheses.",
        "The probability of a given concept-value observation at time t+1 given the system act at time t, named as,t, and the session user goal gu, P(ot+i\\as,t,9u), is obtained by combining the error model and the user model:",
        "P{ot+i\\au>t+i) ■ P(au>t+i\\as>t,gu) where aUtt+i is the true user action."
      ]
    },
    {
      "heading": "2. Rule-based Dialogue Management",
      "text": [
        "A rule-based dialogue manager was developed as a meaningful comparison to the trained DM, to obtain training data from human-system interaction for the user simulator, and to understand the properties of the domain (Varges et al., 2008).",
        "Rule-based dialog management works in two stages: retrieving and preprocessing facts (tuples) taken from a dialogue state database (section 3), and inferencing over those facts to generate a system response.",
        "We distinguish between the 'context model' of the first phase - essentially allowing more recent values for a concept to override less recent ones - and the 'dialog move engine' (DME) of the second phase.",
        "In the second stage, acceptor rules match SLU results to dialogue context, for example perceived user concepts to open questions.",
        "This may result in the decision to verify the application parameter in question, and the action is verbalized by language generation rules.",
        "If the parameter is accepted, application dependent task rules determine the next parameter to be acquired, resulting in the generation of an appropriate request."
      ]
    },
    {
      "heading": "3. Data-centric System Architecture",
      "text": [
        "All data is continuously stored in a database which web-service based processing modules (such as SLU, DM and language generation) access.",
        "This architecture also allows us to access the database for immediate visualization.",
        "The system presents an example of a \"thick\" intermodule information pipeline architecture.",
        "Individual components exchange data by means of sets of hypotheses complemented by the detailed conversational context.",
        "The database concentrates heterogeneous types of information at various levels of description in a uniform way.",
        "This facilitates dialog evaluation, data mining and online learning because data is available for querying as soon as it has been stored.",
        "There is no need for separate logging mechanisms.",
        "Multiple systems/applications are available on the same infrastructure due to a clean separation of its processing modules (SLU, DM, NLG etc.)",
        "from data storage (DBMS), and monitoring/analysis/visualization and annotation tools."
      ]
    },
    {
      "heading": "4. Visualization Tool",
      "text": [
        "We developed a live web-based dialogue visualization tool that displays ongoing and past dialogue utterances, semantic interpretation confidences and distributions of confidences for incoming user acts, the dialogue manager state, and policy-based decisions and updating.",
        "An example of the visualization tool is given in figures 3 (dialogue logs) and 4 (annotation view).",
        "We are currently extending the visualization tool to display the POMDP-related information that is already present in the dialogue database.",
        "The visualization tool shows how our dedicated SLU module produces a number of candidate semantic parses using the semantics of a domain ontology and the output of ASR.",
        "The visualization of the internal representation of the POMDP-DM includes the N best dialogue states after each user utterance and the reranking of the action set.",
        "At the end of each dialogue session, the reward and the policy updates are shown, i.e. new or updated state entries and action values.",
        "Another plot relates the current dialogue's reward to the reward of previous dialogues (as in plots 1(b) and 1(a)).",
        "Users are able to talk with several systems (via SIP phone connection to the dialogue system server) and see their dialogues in the visualization tool.",
        "They are able to compare the rule-based system, a randomly exploring learner that has not been trained yet, and several systems that use various pre-trained policies.",
        "These policies are obtained by dialogue simulations with user models based on data obtained from human-machine dialogues with the original rule-based dialogue manager.",
        "The web tool is available at http://cicerone.dit.unitn.it/ DialogStatisties/."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work was partially supported by the European Commission Marie Curie Excellence Grant for the ADAMACH project (contract No.",
        "022593) and by LUNA STREP project (contract No.",
        "33549).",
        "Figure 2: Architecture for",
        "Thtm",
        "ServerVoxnauta Dialc-gID",
        "Asterisk Reoordi-giD",
        "Duratonl „ 1",
        "17.58.01",
        "voxnauU.ditumtn.it 123635B677",
        "tmp_Fr Mar g 17:58:00 cet 2009 [IN' OUTI IMIXl",
        "3",
        "■ùi",
        "14.56.51",
        "voxna uU .dit uiiln.it 123638B610",
        "123gc8&g 11.1385",
        "[IN' OUTI IMIX]",
        "-",
        "14:51«",
        "voxna uta.dit-unitn.ri 123638B3C8",
        "1236088308.1381 UN' OUTI IMIXl",
        "88",
        "14.47.09",
        "voxnauU.dit unitn.■!",
        "1236088029.1377 [IN' OUTI IMIXl",
        "s2",
        "té\\",
        "14 46 14",
        "1236387973",
        "123g087974.1375",
        "UN' 'OUTI IMIXl",
        "42",
        "té\\",
        "14:44:30",
        "voxneuU.dil.unitn.it 12363878G9",
        "1236087870.1373 UN' OUTI IMIXl",
        "69",
        "té",
        "14.43.41",
        "voxnauU.dit umtn.it 123B087820",
        "123g087b21.1371 UN' OUTI IMIXl",
        "37",
        "té",
        "14 35 39",
        "voxnaula.dit unitn.it ■2'jË-Dg7338",
        "123g087339 1361",
        "[IN' 'OUTI IMIXl",
        "•7",
        "té",
        "14:34:06",
        "voxna uta.dit-unitn.il 1236087245",
        "1236087245.1359 [IN' OUTI IMIXl",
        "17 57.42",
        "voxnauU.dit.unitn.it 12360130G1",
        "12360130g2.1337 [IN' OUT) IMIX]",
        "38",
        "té",
        "17 55 22",
        "voxnauta.dit unitn.it",
        "123g012921.1335",
        "[IN; 'OUTI IMIXl",
        "05",
        "té",
        "12:44 52",
        "voxna uta.dit-unitn.il",
        "1236994291.1313",
        "UN' 'OUTI IMIXl",
        "32",
        "té\\",
        "12.43.50",
        "voxnauU.dit unitn..!",
        "1235994230.1311",
        "[IN' OUT) IMIXl",
        "- té",
        "12 42 08",
        "voxnauta.dit unitn.il 1235994128",
        "1235994128.1309",
        "[IN; 'OUT) IMIX]",
        "80",
        "té",
        "12:29:17",
        "voxna uta.dit-unitn.il 1235993357",
        "1235993357.1307 [IN' OUTI IMIXl",
        "- \\té\\",
        "12.27.05",
        "voxnaula.dit unitn.1",
        "1235993225 1305 [IN' PUD IMIX]",
        "118",
        "12:24 13",
        "voxnauta.dit unitn.il",
        ":-.",
        ":li:::::.",
        "1235993053.1303 [IN' 'OUTI IMIXl",
        "12s",
        "té",
        "12:22 52",
        "voxnauU.dit-unitn.it 1235992972",
        "■2'iG;Jrj2rJ72 YiSUN' 'OUTI IMIXl",
        "86",
        "té",
        "12.20.07",
        "voxnauU.dit unitn..!",
        "1235992b07 1299",
        "88",
        "Data",
        "».",
        "Se *ve 'Voxna jU Voxrau U DiaioglD",
        "CalilD",
        "Du-ation (sec)",
        "( Print Page ^ fSave Page J",
        "02/03/2009",
        "17:57:42",
        "voxnauta.dit unitn it 1236013061",
        "1236013062.1337 UNI IQUTI IMIXt",
        "36",
        "Included in Statistics",
        "[Raspa ünda 1203/2008 12:67 40]yet [Quarteron.",
        "Silvia 16703/2009 17:57:23]ye",
        "TURN -Slarll me",
        "Event",
        "TaskyAction",
        "Crammer",
        "Levels Confidence",
        "Sensitiv ty",
        "Speed va",
        "ftcc-öcy",
        "1 -17:57:42",
        "io:>",
        "/sun",
        "Quest onHMIHY",
        "voiceAdSLser.",
        "'adasearch Ir'vxm osne-afion",
        "■■; .",
        ": ':.",
        "'■::■: ::L ■: :.",
        ":L.-:\"-: >: - _.ï",
        "0.33-0.66",
        "D.80",
        "ASR Ra-k",
        "ASR Utterance",
        "ASR Utterarce Cef der ce",
        "ASR Concept",
        "ASR Interpretern",
        "ASR Interpretation Confiée nee",
        "Sjrface",
        "Word",
        "1",
        "boo< a notel",
        "0 615553",
        "Adv ty_actv.",
        "tyName",
        "bote Reservat on",
        "0.520528",
        "book a bote 1",
        "|HID£'",
        "2",
        "booking a hotel",
        "0.572455",
        "Aciv ty_actvtytjame",
        "bote Reservation",
        "0.499250",
        "bookirg a hotel",
        "[SHOW IHIOfcl",
        "3",
        "book a hotel",
        "3 557984",
        "Acfcv ty_ act v. tyName",
        "bote Reservat on",
        "0.392611",
        "boo* a notel",
        "[S-OW IHIDEi",
        "4",
        "book rooms Oookirg",
        "0 488593",
        "Act vty_a ct vty Na me",
        "bote Reservat on",
        "0.46125",
        "[SHOW IHIDEI",
        "'co ■",
        "0 522627",
        "Actvty_actv tyName",
        "bote Reservat on",
        "0.37G652",
        "hSek'oom",
        "[SHOW [HIDE'",
        "G",
        "Dook a room",
        "0.486067",
        "Acli vty_a ct vityNa me",
        "bote Reservaten",
        "0.364710",
        "book a room",
        "[SHOW IHIDE'",
        "7",
        "oookirg",
        "0.46467",
        "Act: v tya ct vityNa me",
        "note Reservation",
        "C.43020G",
        "book\"",
        "[SHOW IHIDE'",
        "B",
        "oookirg",
        "0 4G1G08",
        "Ac(i vty_a ct vityName",
        "hotel Reservat-on",
        "0.311B35",
        "baoTnmg",
        "[SHOW IHIDEI",
        "8",
        "0.458709",
        "Aclivty^ast vty Name",
        ">:■, e -tb\"rj- r>",
        "0.458709",
        "rouncjable",
        "[SHOW IHIDEi",
        "Ever t_type",
        "conference",
        "0.458709",
        ":;:.",
        "-",
        "SLU Ran<",
        "Utterance",
        "SLU Utterance Confidence",
        "SLU Concept",
        "SLU InterpreUtion",
        "SLU Inte-c-etalor Confidence",
        "Surface",
        "Sou-ce",
        "1",
        "booi a notel",
        "i:.L.",
        ":::.",
        "Activ ly_act v tyName",
        "bote Reservation",
        "0.5205",
        "too- -v.c-",
        "voice",
        "2",
        "•omdjab-e",
        "0.4587",
        "Acti v ty _a ct vityNa me",
        "aventEnquiry",
        "0.4507",
        "rounajable",
        "•d.",
        "Event_type",
        "oorterence",
        "0.45B7",
        "rouncjable",
        "Dialog Turn n':1 - Start Time:12:13:3E - Duratfc>n:D SSL",
        "_ DIALOG TRANSCRIPTION _",
        "DIALOG ANNOTATION",
        "T-a&k;Label Value Surface",
        "Welcome to the Trentino Into Service!",
        "How may 1 help yo-u^",
        "hello 1 would like to find en eooommodetbn in Belvedere tor the seventeenth of March",
        "A",
        "Completed by sys-ti nOKriHÛTO",
        ":!",
        "K",
        "Location locat D-Narre .",
        "*j Belvedere ^ 1 Tune day t 1 1 /f",
        "Belvedere ■seventeenth",
        "Requested by user ( Hotel Enc u irv ■ * j",
        "Tmie monch Mereh y",
        "fvlerch"
      ]
    }
  ]
}
