{
  "info": {
    "authors": [
      "Mamoru Komachi",
      "Shimpei Makimoto",
      "Kei Uchiumi",
      "Manabu Sassano"
    ],
    "book": "ACL-IJCNLP: Short Papers",
    "id": "acl-P09-2048",
    "title": "Learning Semantic Categories from Clickthrough Logs",
    "url": "https://aclweb.org/anthology/P09-2048",
    "year": 2009
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Nara Institute of Science and Technology (NAIST) 8916-5 Takayama, Ikoma, Nara 630-0192, Japan mamoru-k@is.naist.jp",
        "Shimpei Makimoto and Kei Uchiumi and Manabu Sassano",
        "Yahoo Japan Corporation Midtown Tower, 9-7-1 Akasaka, Minato-ku, Tokyo 107-6211, Japan {smakimot,kuchiumi,msassano}@yahoo-corp.jp",
        "As the web grows larger, knowledge acquisition from the web has gained increasing attention.",
        "In this paper, we propose using web search clickthrough logs to learn semantic categories.",
        "Experimental results show that the proposed method greatly outperforms previous work using only web search query logs."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Compared to other text resources, search queries more directly reflect search users' interests (Sil-verstein et al., 1998).",
        "Web search logs are getting a lot more attention lately as a source of information for applications such as targeted advertisement and query suggestion.",
        "However, it may not be appropriate to use queries themselves because query strings are often too heterogeneous or inspecific to characterize the interests of the user population.",
        "Although it is not clear that query logs are the best source of learning semantic categories, all the previous studies using web search logs rely on web search query logs.",
        "Therefore, we propose to use web search clickthrough logs to learn semantic categories.",
        "Joachims (2002) developed a method that utilizes clickthrough logs for training ranking of search engines.",
        "A search clickthrough is a link which search users click when they see the result of their search.",
        "The intentions of two distinct search queries are likely to be similar, if not identical, when they have the same clickthrough.",
        "Search clickthrough logs are thus potentially useful for learnin semantic categories.",
        "Clickthrough logs have the additional advantage that they are available in abundance and can be stored at very low cost.",
        "Our proposed method employs search click-",
        "'As for data availability, MSN Search query logs (KFP 2006 dataset) were provided to WSCD09: Work-",
        "through logs to improve semantic category acquisition in both precision and recall.",
        "We cast semantic category acquisition from search logs as the task of learning labeled instances from few labeled seeds.",
        "To our knowledge this is the first study that exploits search click-through logs for semantic category learning."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "There are many techniques that have been developed to help elicit knowledge from query logs.",
        "These algorithms use contextual patterns to extract a category or a relation in order to learn a target instance which belongs to the category (e.g. cat in animal class) or a pair of words in specific relation (e.g. headquarter to a company).",
        "In this work, we focus on extracting named entities of the same class to learn semantic categories.",
        "Pa§ca and Durme (2007) were the first to discover the importance of search query logs in natural language processing applications.",
        "They focused on learning attributes of named entities, and thus their objective is different from ours.",
        "Another line of new research is to combine various resources such as web documents with search query logs (Pa§ca and Durme, 2008; Talukdar et al., 2008).",
        "We differ from this work in that we use search clickthrough logs rather than search query logs.",
        "Komachi and Suzuki (2008) proposed a bootstrapping algorithm called Tchai, dedicated to the task of semantic category acquisition from search query logs.",
        "It achieves state-of-the-art performance for this task, but it only uses web search query logs.",
        "shop on Web Search Click Data 2009 participants, http:// research.microsoft.com/en-US/um/people/nickcr/WSCD09/ After the submission of this paper, we found that (Xu et al., 2009) also applies search clickthrough logs to this task.",
        "This work independently confirms the effectiveness of click-through logs to this task using different sources.",
        "Singapore"
      ]
    },
    {
      "heading": "3. Quetchup 3 Algorithm",
      "text": [
        "In this section, we describe an algorithm for learning semantic categories from search logs using label propagation.",
        "We name the algorithm Quetchup.",
        "Graph-based semi-supervised methods such as label propagation are known to achieve high performance with only a few seeds and have the advantage of scalability.",
        "Figure 1 illustrates the process of label propagation using a seed term \"Singapore\" to learn the Travel domain.",
        "This is a bipartite graph whose left-hand side nodes are terms and right-hand side nodes are patterns.",
        "The strength of lines indicates relatedness between each node.",
        "The darker a node, the more likely it belongs to the Travel domain.",
        "Starting from \"Singapore,\" the pattern \"jj airlines\" is strongly related to \"Singapore,\" and thus the label of \"Singapore\" will be propagated to the pattern.",
        "On the other hand, the pattern \"jj map\" is a neutral pattern which co-occurs with terms other than the Travel domain such as \"google\" and \"yahoo.\"",
        "Since the term \"china\" shares two patterns, \"jj airlines\" and \"jj map,\" with \"Singapore,\" the label of the seed term \"Singapore\" propagates to \"china.\"",
        "\"China\" will then be classified in the Travel domain.",
        "In this way, label propagation gradually propagates the label of seed instances to neighbouring nodes, and optimal labels are given as the",
        "Seed instance vector F(0)",
        "Instance similarity matrix A Output:",
        "Instance score vector F(t) 1: Construct the normalized Laplacian matrix L = I – ",
        "labels at which the label propagation process has converged.",
        "Figure 2 describes label propagation based on the regularized Laplacian.",
        "Let a sample Xi be Xi G X, F(0) be a score vector of x comprised of a label set iji e y, and F(t) be a score vector of x after step t. Instance-instance similarity matrix A is defined as A = WTW where Wis, a row-normalized instance-pattern matrix.",
        "The (i,j)-th element of Wij contains the normalized frequency of co-occurrence of instance Xi and pattern pj.",
        "D is a diagonal degree matrix of N where the (i, i)th element of D is given as Da = J2j ^ij-",
        "This algorithm in Figure 2 is similar to (Zhou et al., 2004) except for the method of constructing A and the use of graph Laplacian.",
        "Zhou et al.",
        "proposed a heuristic to set An = 0 to avoid self-reinforcement because Gaussian kernel was used to create A.",
        "The Laplacian label propagation does not need such a heuristic because the graph Laplacian automatically reduces self-reinforcement by assigning negative weights to self-loops.",
        "In the task of learning one category, scores of labeled (seed) instances are set to 1 whereas scores of unlabeled instances are set to 0.",
        "The output is a score vector which holds relatedness to seed instances in descending order.",
        "In the task of learning two categories, scores of seed instances are set to either 1 or – 1, respectively, and the final label of instance Xi will be determined by the sign of output score vector j/j.",
        "Label propagation has a parameter a G (0,1] that controls how much the labels of seeds are emphasized.",
        "As a approaches 0 it puts more weight on labeled instances, while as a increases it employs both labeled and unlabeled data.",
        "There exists a closed-form solution for Laplacian label propagation:",
        "'Avoiding self-reinforcement is important because it causes semantic drift, a phenomenon where frequent instances and patterns unrelated to seed instances infect semantic category acquisition as iteration proceeds.",
        "Category Seed",
        "Travel jal (Japan Airlines), ana (All Nippon Airways), jr (Japan Railways), D b hi (jalan: online travel guide site), his (H.I.S.Co.,Ltd.",
        ": travel agency)",
        "Finance B^gff (Mizuho Bank), S^feittBt?",
        "(Sumitomo Mitsui Banking Corporation), jcb, ff^lBtf (Shinsei Bank), (Nomura Securities)",
        "However, the matrix inversion leads to (9(n) complexity, which is far from realistic in a real-world configuration.",
        "Nonetheless, it can be approximated by fixing the number of steps for label propagation."
      ]
    },
    {
      "heading": "4. Experiments with Web Search Logs",
      "text": [
        "We will describe experimental result comparing a previous method Tchai to the proposed method Quetchup with clickthrough logs (Quetchup ciick) and with query logs (Quetchup qnery).",
        "Search logs We used Japanese search logs collected in August 2008 from Yahoo!",
        "JAPAN Web Search.",
        "We thresholded both search query and clickthrough logs and retained the top 1 million distinct queries.",
        "Search logs are accompanied by their frequencies within the logs.",
        "Construction of an instance-pattern matrix",
        "We used clicked links as clickthrough patterns.",
        "Links clicked less than 200 times were removed.",
        "After that, links which had only one co-occurring query were pruned.",
        "On the other hand, we used two term queries as contextual patterns.",
        "For instance, if one has the term \"Singapore\" and the query \"Singapore airlines,\" the contextual pattern \"jj airlines\" will be created.",
        "Query patterns appearing less than 100 times were discarded.",
        "The (i,j)-th element of a row-normalized instance-pattern matrix W is given by Target categories We used two categories, Travel and Finance, to compare proposed methods with (Komachi and Suzuki, 2008).",
        "When a query was a variant of a term or contains spelling mistakes, we estimated original form and manually assigned a semantic category.",
        "We allowed a query to have more than two categories.",
        "When a query had more than two terms, we assigned a semantic category to the whole query taking each term into account.",
        "System We used the same seeds presented in Table 1 for both Tchai and Quetchup.",
        "We used the same parameter for Tchai described in (Komachi and Suzuki, 2008), and collected 100 instances by iterating 10 times and extracting 10 instances per iteration.",
        "The number of iteration of Quetchup is set to 10.",
        "The parameter a is set to 0.0001.",
        "Evaluation It is difficult in general to define recall for the task of semantic category acquisition since the true set of instances is not known.",
        "Thus, we evaluated all systems using precision at k and relative recall (Pantel and Ravichandran, 2004).Relative recall is the coverage of a system given another system as baseline.",
        "Figures 3 to 6 plot precision and relative recall for three systems to show effectiveness of search clickthrough logs in improvement of precision and relative recall.",
        "Relative recall of Quetchup\\^c± and Tchai were calculated against Quetchup qnery.",
        "Quetchupdick gave the best precision among three systems, and did not degenerate going down through the list.",
        "In addition, it was demonstrated that Quetchupdick gives high recall.",
        "This result shows that search clickthrough logs effectively improve both precision and recall for the task of semantic category acquisition.",
        "On the other hand, Quetchupquery degraded in precision as its rank increased.",
        "Manual check of the extracted queries revealed that the most prominent queries were Pornographic queries, followed by Food, Job and Housing, which frequently appear in web search logs.",
        "Other co-occurrence metrics such as pointwise mutual information would be explored in the future to suppress the effect of frequent queries.",
        "In addition, Quetchuprjick constantly outperformed Tchai in both the Travel and Fi-",
        "Quetchup (query) Tchai",
        "Figure 5 : Relative recall of Travel domain nance domains in precision and outperfomed ments and suggestions.",
        "between the two domains of query-based systems seem to lie in the size of correct instances.",
        "The Finance domain is a closed set which has only a few effective query patterns, whereas Travel domain is an open set which has many query patterns that match correct instances.",
        "Quetchupcuck has an additional advantage that it is stable across over the ranked list, because the variance of the number of clicked links is small thanks to the nature of the ranking algorithm of search engines."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "We have proposed a method called Quetchup to learn semantic categories from search click-through logs using Laplacian label propagation.",
        "The proposed method greatly outperforms previous method, taking the advantage of search click-through logs."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The first author is partly supported by the grant-in-aid JSPS Fellowship for Young Researchers.",
        "We thank the anonymous reviewers for helpful corn-",
        "Quetchup (click) -",
        "Quetchup (query) -----------",
        "Tchai ............."
      ]
    }
  ]
}
