{
  "info": {
    "authors": [
      "Sean Igo",
      "Ellen Riloff"
    ],
    "book": "Proceedings of the Workshop on Unsupervised and Minimally Supervised Learning of Lexical Semantics",
    "id": "acl-W09-1703",
    "title": "Corpus-based Semantic Lexicon Induction with Web-based Corroboration",
    "url": "https://aclweb.org/anthology/W09-1703",
    "year": 2009
  },
  "references": [
    "acl-C02-1114",
    "acl-C02-1144",
    "acl-C04-1111",
    "acl-C92-2082",
    "acl-E06-1003",
    "acl-M92-1001",
    "acl-N04-1041",
    "acl-P02-1053",
    "acl-P06-1038",
    "acl-P07-1030",
    "acl-P08-1119",
    "acl-P98-2182",
    "acl-P99-1016",
    "acl-W02-1017",
    "acl-W02-1028",
    "acl-W02-1111",
    "acl-W97-0313"
  ],
  "sections": [
    {
      "text": [
        "Sean P. Igo Ellen Riloff",
        "Center for High Performance Computing School of Computing",
        "Salt Lake City, UT 84112 USA Salt Lake City, UT 84112 USA",
        "Various techniques have been developed to automatically induce semantic dictionaries from text corpora and from the Web.",
        "Our research combines corpus-based semantic lexicon induction with statistics acquired from the Web to improve the accuracy of automatically acquired domain-specific dictionaries.",
        "We use a weakly supervised bootstrapping algorithm to induce a semantic lexicon from a text corpus, and then issue Web queries to generate co-occurrence statistics between each lexicon entry and semantically related terms.",
        "The Web statistics provide a source of independent evidence to confirm, or disconfirm, that a word belongs to the intended semantic category.",
        "We evaluate this approach on 7 semantic categories representing two domains.",
        "Our results show that the Web statistics dramatically improve the ranking of lexicon entries, and can also be used to filter incorrect entries."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Semantic resources are extremely valuable for many natural language processing (NLP) tasks, as evidenced by the wide popularity of WordNet (Miller, 1990) and a multitude of efforts to create similar \"WordNets\" for additional languages (e.g. (Atserias et al., 1997; Vossen, 1998; Stamou et al., 2002)).",
        "Semantic resources can take many forms, but one of the most basic types is a dictionary that associates a word (or word sense) with one or more semantic categories (hypernyms).",
        "For example, truck might be identified as a vehicle, and dog might be identified as an animal.",
        "Automated methods for generating such dictionaries have been developed under the rubrics of lexical acquisition, hyponym learning, semantic class induction, and Web-based information extraction.",
        "These techniques can be used to rapidly create semantic lexicons for new domains and languages, and to automatically increase the coverage of existing resources.",
        "Techniques for semantic lexicon induction can be subdivided into two groups: corpus-based methods and Web-based methods.",
        "Although the Web can be viewed as a (gigantic) corpus, these two approaches tend to have different goals.",
        "Corpus-based methods are typically designed to induce domain-specific semantic lexicons from a collection of domain-specific texts.",
        "in contrast, Web-based methods are typically designed to induce broad-coverage resources, similar to WordNet.",
        "ideally, one would hope that broad-coverage resources would be sufficient for any domain, but this is often not the case.",
        "Many domains use specialized vocabularies and jargon that are not adequately represented in broad-coverage resources (e.g., medicine, genomics, etc.).",
        "Furthermore, even relatively general text genres, such as news, contain subdomains that require extensive knowledge of specific semantic categories.",
        "For example, our work uses a corpus of news articles about terrorism that includes many arcane weapon terms (e.g., M-79, AR-15, an-fo, and gelignite).",
        "Similarly, our disease-related documents mention obscure diseases (e.g., psittacosis) and contain many informal terms, abbreviations, and spelling variants that do not even occur in most medical dictionaries.",
        "For example, yf refers to yellow fever, tularaemia is an alternative spelling for tularemia, and nv-cjd is frequently used to refer to new variant Creutzfeldt Jacob Disease.",
        "The Web is such a vast repository of knowledge that specialized terminology for nearly any domain probably exists in some niche or cranny, but finding the appropriate corner of the Web to tap into is a challenge.",
        "You have to know where to look to find specialized knowledge.",
        "in contrast, corpus-based methods can learn specialized terminology directly from a domain-specific corpus, but accuracy can be a problem because most corpora are relatively small.",
        "in this paper, we seek to exploit the best of both worlds by combining a weakly supervised corpus-based method for semantic lexicon induction with statistics obtained from the Web.",
        "First, we use a bootstrapping algorithm, Basilisk (Thelen and Riloff, 2002), to automatically induce a semantic lexicon from a domain-specific corpus.",
        "This produces a set of words that are hypothesized to belong to the targeted semantic category.",
        "Second, we use the Web as a source of corroborating evidence to confirm, or disconfirm, whether each term truly belongs to the semantic category.",
        "For each candidate word, we search the Web for pages that contain both the word and a semantically related term.",
        "We expect that true semantic category members will co-occur with semantically similar words more often than non-members.",
        "This paper is organized as follows.",
        "Section 2 discusses prior work on weakly supervised methods for semantic lexicon induction.",
        "Section 3 overviews our approach: we briefly describe the weakly supervised bootstrapping algorithm that we use for corpus-based semantic lexicon induction, and then present our procedure for gathering corroborating evidence from the Web.",
        "Section 4 presents experimental results on seven semantic categories representing two domains: Latin American terrorism and disease-related documents.",
        "Section 5 summarizes our results and discusses future work."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "Our research focuses on semantic lexicon induction, where the goal is to create a list of words that belong to a desired semantic class.",
        "A substantial amount of previous work has been done on weakly supervised and unsupervised creation of semantic lexicons.",
        "Weakly supervised corpus-based methods have utilized noun co-occurrence statistics (Riloff and Shepherd, 1997; Roark and Char-niak, 1998), syntactic information (Widdows and Dorow, 2002; Phillips and Riloff, 2002; Pantel and Ravichandran, 2004; Tanev and Magnini, 2006), and lexico-syntactic contextual patterns (e.g., \"resides in <location>\" or \"moved to <location> \") (Riloff and Jones, 1999; Thelen and Riloff, 2002).",
        "Due to the need for POS tagging and/or parsing, these types of methods have been evaluated only on fixed corpora, although (Pantel et al., 2004) demonstrated how to scale up their algorithms for the Web.",
        "The goal of our work is to improve upon corpus-based bootstrapping algorithms by using cooccurrence statistics obtained from the Web to rerank and filter the hypothesized category members.",
        "Techniques for semantic class learning have also been developed specifically for the Web.",
        "Several Web-based semantic class learners build upon Hearst's early work (Hearst, 1992) with hyponym patterns.",
        "Hearst exploited patterns that explicitly identify a hyponym relation between a semantic class and a word (e.g., \"such authors as <X>\") to automatically acquire new hyponyms.",
        "(Pa§ca, 2004) applied hyponym patterns to the Web and learned semantic class instances and groups by acquiring contexts around the patterns.",
        "Later, (Paşca, 2007) created context vectors for a group of seed instances by searching Web query logs, and used them to learn similar instances.",
        "The KnowltAll system (Etzioni et al., 2005) also uses hyponym patterns to extract class instances from the Web and evaluates them further by computing mutual information scores based on Web queries.",
        "(Kozareva et al., 2008) proposed the use of a doubly-anchored hyponym pattern and a graph to represent the links between hyponym occurrences in these patterns.",
        "Our work builds upon Turney's work on semantic orientation (Turney, 2002) and synonym learning (Turney, 2001), in which he used a PMi-iR algorithm to measure the similarity ofwords and phrases based on Web queries.",
        "We use a similar PMi (point-wise mutual information) metric for the purposes of semantic class verification.",
        "There has also been work on fully unsupervised semantic clustering (e.g., (Lin, 1998; Lin and Pan-tel, 2002; Davidov and Rappoport, 2006; Davidov et al., 2007)), however clustering methods may or may not produce the types and granularities of semantic classes desired by a user.",
        "Another related line of work is automated ontology construction, which aims to create lexical hierarchies based on semantic classes (e.g., (Caraballo, 1999; Cimiano and Volker, 2005; Mann, 2002))."
      ]
    },
    {
      "heading": "3. Semantic Lexicon Induction with Web-based Corroboration",
      "text": [
        "Our approach combines a weakly supervised learning algorithm for corpus-based semantic lexicon induction with a follow-on procedure that gathers corroborating statistical evidence from the Web.",
        "in this section, we describe both of these components.",
        "First, we give a brief overview of the Basilisk bootstrapping algorithm that we use for corpus-based semantic lexicon induction.",
        "Second, we present our new strategies for acquiring and utilizing corroborating statistical evidence from the Web.",
        "For corpus-based semantic lexicon induction, we use a weakly supervised bootstrapping algorithm called Basilisk (Thelen and Riloff, 2002).",
        "As input, Basilisk requires a small set of seed words for each semantic category, and a collection of (unanno-tated) texts.",
        "Basilisk iteratively generates new words that are hypothesized to belong to the same semantic class as the seeds.",
        "Here we give an overview of Basilisk's algorithm and refer the reader to (Thelen and Riloff, 2002) for more details.",
        "The key idea behind Basilisk is to use pattern contexts around a word to identify its semantic class.",
        "Basilisk's bootstrapping process has two main steps: Pattern Pool Creation and Candidate Word Selection.",
        "First, Basilisk applies the AutoSlog pattern generator (Riloff, 1996) to create a set of lexico-syntactic patterns that, collectively, can extract every noun phrase in the corpus.",
        "Basilisk then ranks the patterns according to how often they extract the seed words, under the assumption that patterns which extract known category members are likely to extract other category members as well.",
        "The highest-ranked patterns are placed in a pattern pool.",
        "Second, Basilisk gathers every noun phrase that is extracted by at least one pattern in the pattern pool, and designates each head noun as a candidate for the semantic category.",
        "The candidates are then scored and ranked.",
        "For each candidate, Basilisk collects all of the patterns that extracted that word, computes the logarithm of the number of seeds extracted by each of those patterns, and finally computes the average of these log values as the score for the candidate.",
        "intuitively, a candidate word receives a high score if it was extracted by patterns that, on average, also extract many known category members.",
        "The N highest ranked candidates are automatically added to the list of seed words, taking a leap of faith that they are true members of the semantic category.",
        "The bootstrapping process then repeats, using the larger set of seed words as known category members in the next iteration.",
        "Basilisk learns many good category members, but its accuracy varies a lot across semantic categories (Thelen and Riloff, 2002).",
        "One problem with Basilisk, and bootstrapping algorithms in general, is that accuracy tends to deteriorate as bootstrapping progresses.",
        "Basilisk generates candidates by identifying the contexts in which they occur and words unrelated to the desired category can sometimes also occur in those contexts.",
        "Some patterns consistently extract members of several semantic classes; for example, \"attack on <NP> \" will extract both people (\"attack on the president\" ) and buildings (\"attack on the U.S. embassy\").",
        "Idiomatic expressions and parsing errors can also lead to undesirable words being learned.",
        "incorrect words tend to accumulate as bootstrapping progresses, which can lead to gradually deteriorating performance.",
        "(Thelen and Riloff, 2002) tried to address this problem by learning multiple semantic categories simultaneously.",
        "This helps to keep the bootstrapping focused by flagging words that are potentially problematic because they are strongly associated with a competing category.",
        "This improved Basilisk's accuracy, but by a relatively small amount, and this approach depends on the often unrealistic assumption that a word cannot belong to more than one semantic category.",
        "in our work, we use the single-category version of Basilisk that learns each semantic category independently so that we do not need to make this assumption.",
        "The novel aspect of our work is that we introduce a new mechanism to independently verify each candidate word's category membership using the Web as an external knowledge source.",
        "We gather statistics from the Web to provide evidence for (or against) the semantic class of a word in a manner completely independent of Basilisk's criteria.",
        "Our approach is based on the distributional hypothesis (Harris, 1954), which says that words that occur in the same contexts tend to have similar meanings.",
        "We seek to corroborate a word's semantic class through statistics that measure how often the word co-occurs with semantically related words.",
        "For each candidate word produced by Basilisk, we construct a Web query that pairs the word with a semantically related word.",
        "Our goal is not just to find Web pages that contain both terms, but to find Web pages that contain both terms in close proximity to one another.",
        "We consider two terms to be collocated if they occur within ten words of each other on the same Web page, which corresponds to the functionality of the NEAR operator used by the AltaVista search engine.",
        "Turney (Turney, 2001; Tur-ney, 2002) reported that the NEAR operator outperformed simple page co-occurrence for his purposes; our early experiments informally showed the same for this work.",
        "We want our technique to remain weakly supervised, so we do not want to require additional human input or effort beyond what is already required for Basilisk.",
        "With this in mind, we investigated two types of collocation relations as possible indicators of semantic class membership:",
        "Hypernym Collocation: We compute cooccurrence statistics between the candidate word and the name of the targeted semantic class (i.e., the word's hypothesized hypernym).",
        "For example, given the candidate word jeep and the semantic category VEHICLE, we would issue the Web query \"jeep NEAR vehicle\".",
        "Our intuition is that such queries would identify definition-type Web hits.",
        "For example, the query \"cow NEAR animal\" might retrieve snippets such as \"A cow is an animal found on dairy farms\" or \"An animal such as a cow has...\".",
        "Seed Collocation: We compute co-occurrence statistics between the candidate word and each seed word that was given to Basilisk as input.",
        "For example, given the candidate word jeep and the seed word truck, we would issue the Web query \"jeep NEAR truck\".",
        "Here the intuition is that members of the same semantic category tend to occur near one another - in lists, for example.",
        "As a statistical measure of co-occurrence, we compute a variation of Pointwise Mutual Information (PMI), which is defined as:",
        "where p(x, y) is the probability that x and y are collocated (near each other) on a Web page, p(x) is the probability that x occurs on a Web page, and p(y) is the probability that y occurs on a Web page.",
        "p(x) is calculated as cour^(-x\"1 ; where count(x) is the number of hits returned by AltaVista, searching for x by itself, and N is the total number of documents on the World Wide Web at the time the query is made.",
        "Similarly, p(x,y) is -^-^- – .",
        "Given this, the PMI equation can be rewritten as:",
        "N is not known, but it is the same for every query (assuming the queries were made at roughly the same time).",
        "We will use these scores solely to compare the relative goodness of candidates, so we can omit N from the equation because it will not change the relative ordering of the scores.",
        "Thus, our PMI score for a candidate word and related term (hypernym or seed) is:",
        "Finally, we created three different scoring functions that use PMI values in different ways to capture different types of co-occurrence information:",
        "Hypernym Score: PMI based on collocation between the hypernym term and candidate word.",
        "Average of Seeds Score: The mean of the PMI scores computed for the candidate and each seed word:",
        "se^ds PMI (candidate, seedi)",
        "Max of Seeds Score: The maximum (highest) of the PMI scores computed for the candidate and each seed word.",
        "The rationale for the Average of Seeds Score is that the seeds are all members of the semantic category, so we might expect other members to occur near many of them.",
        "Averaging over all of the seeds can diffuse unusually high or low collocation counts that might result from an anomalous seed.",
        "The rationale for the Max of Seeds Score is that a word may naturally co-occur with some category members more often than others.",
        "For example, one would expect dog to co-occur with cat much more frequently than with frog.",
        "A high Max of Seeds Score indicates that there is at least one seed word that frequently co-occurs with the candidate.",
        "Since Web queries are relatively expensive, it is worth taking stock of how many queries are necessary.",
        "Let N be the number of candidate words produced by Basilisk, and S be the number of seed words given to Basilisk as input.",
        "To compute the Hypernym Score for a candidate, we need 3 queries: count(hypernym), count(candidate), and count(hypernym NEAR candidate).",
        "The first query is the same for all candidates, so for N candidate words we need 2N + 1 queries in total.",
        "To compute the Average or Max of Seeds Score for a candidate, we need S queries for count(seedi), S queries for count(seedi NEAR candidate), and 1 query for count(candidate).",
        "So for N candidate words we need N * (2S + 1) queries.",
        "S is typically small for weakly supervised algorithms (S =10 in our experiments), which means that this Web-based corroboration process requires O(N) queries to process a semantic lexicon of size N."
      ]
    },
    {
      "heading": "4. Evaluation",
      "text": [
        "We ran experiments on two corpora: 1700 MUC-4 terrorism articles (MUC-4 Proceedings, 1992) and a combination of 6000 disease-related documents, consisting of 2000 ProMed disease outbreak reports (ProMed-mail, 2006) and 4000 disease-related",
        "PubMed abstracts (PubMed, 2009).",
        "For the terrorism domain, we created lexicons for four semantic categories: Building, Human, Location, and Weapon.",
        "For the disease domain, we created lexicons for three semantic categories: Animal, Disease, and Symptom.",
        "For each category, we gave Basilisk 10 seed words as input.",
        "The seeds were chosen by applying a shallow parser to each corpus, extracting the head nouns of all the NPs, and sorting the nouns by frequency.",
        "A human then walked down the sorted list and identified the 10 most frequent nouns that belong to each semantic category .",
        "This strategy ensures that the bootstrapping process is given seed words that occur in the corpus with high frequency.",
        "The seed words are shown in Table 1.",
        "Building: embassy office headquarters church",
        "offices house home residence hospital airport Human: people guerrillas members troops",
        "Cristiani rebels president terrorists soldiers leaders Location: country ELSalvador Salvador",
        "United_States area Colombia city countries",
        "department Nicaragua Weapon: weapons bomb bombs explosives arms",
        "missiles dynamite rifles materiel bullets Animal: bird mosquito cow horse pig chicken",
        "sheep dog deer fish Disease: sars bse anthrax influenza wnv",
        "fmd encephalitis malaria pneumonia flu Symptom : fever diarrhea vomiting rash paralysis weakness necrosis chills headaches hemorrhage",
        "To evaluate our results, we used the gold standard answer key that Thelen & Riloff created to evaluate Basilisk on the MUC4 corpus (Thelen and Riloff, 2002); they manually labeled every head noun in the corpus with its semantic class.",
        "For the ProMed / PubMed disease corpus, we created our own answer key.",
        "For all of the lexicon entries hypothesized by Basilisk, a human annotator (not any of the authors)",
        "Table 2: Ranking results for 7 semantic categories, showing accuracies for the top-ranked N words.",
        "(Ba=Basilisk, Hy=Hypernym Re-ranking, Av=Average of Seeds Re-ranking, Mx=Max of Seeds Re-ranking labeled each word as either correct or incorrect for the hypothesized semantic class.",
        "A word is considered to be correct if any sense of the word is semantically correct.",
        "We ran Basilisk for 60 iterations, learning 5 new words in each bootstrapping cycle, which produced a lexicon of 300 words for each semantic category.",
        "The columns labeled Ba in Table 2 show the accuracy results for Basilisk.",
        "As we explained in Section 3.1, accuracy tends to decrease as bootstrapping progresses, so we computed accuracy scores for the top-ranked 100 words, in increments of 25, and also for the entire lexicon of 300 words.",
        "Overall, we see that Basilisk learns many correct words for each semantic category, and the top-ranked terms are generally more accurate than the lower-ranked terms.",
        "For the top 100 words, accuracies are generally in the 50-70% range, except for Location which achieves about 80% accuracy.",
        "For the HUMAN category, Basilisk obtained 82% accuracy over all 300 words, but the top-ranked words actually produced lower accuracy.",
        "Basilisk's ranking is clearly not as good as it could be because there are correct terms co-mingled with incorrect terms throughout the ranked lists.",
        "This has two ramifications.",
        "First, if we want a human to manually review each lexicon before adding the words to an external resource, then the rankings may not be very helpful (i.e., the human will need to review all of the words), and (2) incorrect terms generated during the early stages of bootstrapping may be hindering the learning process because they introduce noise during bootstrapping.",
        "The HUMAN category seems to have recovered from early mistakes, but the lower accuracies for some other categories may be the result of this problem.",
        "The purpose of our Web-based corroboration process is to automatically re-evaluate the lexicons produced by Basilisk, using Web-based statistics to create more separation between the good entries and the bad ones.",
        "Our first set of experiments uses the Web-based co-occurrence statistics to re-rank the lexicon entries.",
        "The Hy, Av, and M x columns in Table 2 show the re-ranking results using each of the Hypernym, Average of Seeds, and Maximum of Seeds scoring functions.",
        "in all cases, Web-based re-ranking outperforms Basilisk's original rankings.",
        "Every semantic category except for Building yielded accuracies of 80-100% among the top candidates.",
        "For each row, the highest accuracy for each semantic category is shown in boldface (as are any tied for highest).",
        "Overall, the Max of Seeds Scores were best, performing better than or as well as the other scoring functions on 5 of the 7 categories.",
        "it was only outperformed once by the Hypernym Scores (Building) and once by the Average of Seeds Scores (Symptom).",
        "N",
        "Ba",
        "BUIL",
        "Hy",
        "DING",
        "Av",
        "Mx",
        "Ba",
        "Hui Hy",
        "vlAN",
        "Av",
        "Mx",
        "Ba",
        "LOC/ ffy",
        "«TON",
        "Av",
        "Mx",
        "Ba",
        "WE/ Hy",
        "\\PON",
        "Av",
        "Mx",
        "25",
        ".40",
        ".56",
        ".52",
        ".56",
        ".40",
        ".72",
        ".80",
        ".84",
        ".68",
        ".88",
        ".88",
        "1.0",
        ".56",
        ".84",
        "1.0",
        "1.0",
        "50",
        ".44",
        ".56",
        ".46",
        ".40",
        ".56",
        ".80",
        ".88",
        ".86",
        ".80",
        ".86",
        ".84",
        ".98",
        ".52",
        ".74",
        ".76",
        ".90",
        "75",
        ".44",
        ".45",
        ".41",
        ".39",
        ".65",
        ".84",
        ".85",
        ".85",
        ".80",
        ".88",
        ".80",
        ".99",
        ".52",
        ".63",
        ".65",
        ".79",
        "100",
        ".42",
        ".41",
        ".38",
        ".36",
        ".69",
        ".81",
        ".80",
        ".87",
        ".81",
        ".85",
        ".78",
        ".95",
        ".55",
        ".55",
        ".56",
        ".63",
        "300",
        ".22",
        ".82",
        ".75",
        ".26",
        "Animal",
        "Disease",
        "Symptom",
        "N",
        "Ba",
        "Hy",
        "Av",
        "Mx",
        "Ba",
        "Hy",
        "Av",
        "Mx",
        "Ba",
        "Hy",
        "Av",
        "Mx",
        "25",
        ".48",
        ".88",
        ".92",
        ".92",
        ".64",
        ".84",
        ".80",
        ".84",
        ".64",
        ".84",
        ".92",
        ".80",
        "50",
        ".58",
        ".82",
        ".84",
        ".80",
        ".72",
        ".84",
        ".60",
        ".82",
        ".62",
        ".76",
        ".90",
        ".74",
        "75",
        ".55",
        ".68",
        ".67",
        ".69",
        ".69",
        ".83",
        ".59",
        ".81",
        ".61",
        ".68",
        ".79",
        ".71",
        "100",
        ".45",
        ".55",
        ".54",
        ".57",
        ".69",
        ".78",
        ".58",
        ".80",
        ".59",
        ".71",
        ".77",
        ".64",
        "300",
        ".20",
        ".62",
        ".38",
        "The strong performance of the Max of Seeds scores suggests that one seed is often an especially good collocation indicator for category membership - though it may not be the same seed word for all of the lexicon words.",
        "The relatively poor performance of the Average of Seeds scores may be attributable to the same principle; perhaps even if one seed is especially strong, averaging over the less-effective seeds' scores dilutes the results.",
        "Averaging is also susceptible to damage from words that receive the special-case score of -99999 when a hit count is zero (see Section 3.2).",
        "Table 3 shows the 10 top-ranked candidates for each semantic category based on the Max of Seeds scores.",
        "The table illustrates that this scoring function does a good job of identifying semantically correct words, although of course there are some mistakes.",
        "Mistakes can happen due to parsing errors (e.g., bird-to-bird is an adjective and not a noun, as in bird-to-bird transmission), and some are due to issues associated with Web querying.",
        "For example, the nonsense term \"bse).austria\" was ranked highly because Altavista split this term into 2 separate words because of the punctuation, and bse by itself is indeed a disease term (bovine spongiform encephalitis).",
        "Table 2 revealed that the 300-word lexicons produced by Basilisk vary widely in the number of true category words that they contain.",
        "The least dense category is Animal, with only 61 correct words, and the most dense is Human with 247 correct words.",
        "interestingly, the densest categories are not always the easiest to rank.",
        "For example, the HUman category is the densest category but Basilisk's ranking of the human terms was poor.",
        "The ultimate goal behind a better ranking mechanism is to completely automate the process of semantic lexicon induction.",
        "if we can produce high-quality rankings, then we can discard the lower ranked words and keep only the highest ranked words for our semantic dictionary.",
        "However, this presupposes that we know where to draw the line between the good and bad entries, and Table 2 shows that this boundary varies across categories.",
        "For HUmans, the top 100 words are 87% accurate, and in fact we get 82% accuracy over all 300 words.",
        "But for Animals we achieve 80% accuracy only for the top 50 words.",
        "it is paramount for semantic dictionaries to have high integrity, so accuracy must be high if we want to use the resulting lexicons without manual review.",
        "Building",
        "Human",
        "Location",
        "Weapon",
        "Animal",
        "Disease",
        "Symptom",
        "consulate",
        "guerrilla",
        "San_Salvador",
        "shotguns",
        "bird-to-bird",
        "meningo-encephalitis",
        "nausea",
        "pharmacies",
        "extremists",
        "Las_Hojas",
        "carbines",
        "cervids",
        "bse).austria",
        "diarrhoea",
        "aiport",
        "sympathizers",
        "Tejutepeque",
        "armaments",
        "goats",
        "inhalational",
        "myalgias",
        "zacamil",
        "assassins",
        "Ayutuxtepeque",
        "revolvers",
        "ewes",
        "anthrax_disease",
        "chlorosis",
        "airports",
        "patrols",
        "Copinol",
        "detonators",
        "ruminants",
        "otitis_media",
        "myalgia",
        "parishes",
        "militiamen",
        "Cuscatancingo",
        "pistols",
        "swine",
        "airport_malaria",
        "salivation",
        "Masariegos",
        "battalion",
        "Jiboa",
        "car_bombs",
        "calf",
        "taeniorhynchus",
        "dysentery",
        "chancery",
        "Ellacuria",
        "Chinameca",
        "calibers",
        "lambs",
        "hyopneumonia",
        "cramping",
        "residences",
        "rebel",
        "Zacamil",
        "M-16",
        "wolsington",
        "monkeypox",
        "dizziness",
        "police_station",
        "policemen",
        "Chalantenango",
        "grenades",
        "piglets",
        "kala-azar",
        "inappetance",
        "e",
        "Category",
        "Acc",
        "Cor/Tot",
        "Weapon",
        ".88",
        "46/52",
        "Location",
        ".98",
        "59/60",
        "Human",
        ".80",
        "8/10",
        "-22",
        "Building",
        ".83",
        "5/6",
        "Animal",
        ".91",
        "30/33",
        "Disease",
        ".82",
        "64/78",
        "Symptom",
        ".65",
        "64/99",
        "Weapon",
        ".79",
        "59/75",
        "Location",
        ".96",
        "82/85",
        "Human",
        ".85",
        "23/27",
        "-23",
        "Building",
        ".71",
        "12/17",
        "Animal",
        ".87",
        "40/46",
        "Disease",
        ".78",
        "82/105",
        "Symptom",
        ".62",
        "86/139",
        "Weapon",
        ".63",
        "63/100",
        "Location",
        ".93",
        "111/120",
        "Human",
        ".87",
        "54/62",
        "-24",
        "Building",
        ".45",
        "17/38",
        "Animal",
        ".75",
        "47/63",
        "Disease",
        ".74",
        "94/127",
        "Symptom",
        ".60",
        "100/166",
        "As an alternative to ranking, another way that we could use the Web-based corroboration statistics is to automatically filter words that do not receive a high score.",
        "The key question is whether the values of the scores are consistent enough across categories to set a single threshold that will work well across the different categories.",
        "Table 4 shows the results of using the Max of Seeds Scores as a filtering mechanism: given a threshold 6, all words that have a score < 6 are discarded.",
        "For each threshold value 6 and semantic category, we computed the accuracy (Acc) of the lexicon after all words with a score < 6 have been removed.",
        "The Cor/Tot column shows the number of correct category members and the number of total words that passed the threshold.",
        "We experimented with a variety of threshold values and found that 6=-22 performed best.",
        "Table 4 shows that this threshold produces a relatively high-precision filtering mechanism, with 6 of the 7 categories achieving lexicon accuracies > 80%.",
        "As expected, the Cor/Tot column shows that the number of words varies widely across categories.",
        "Automatic filtering represents a trade-off: a relatively high-precision lexicon can be created, but some correct words will be lost.",
        "The threshold can be adjusted to increase the number of learned words, but with a corresponding drop in precision.",
        "Depending upon a user's needs, a high threshold may be desirable to identify only the most confident lexicon entries, or a lower threshold may be desirable to retain most of the correct entries while reliably removing some of the incorrect ones."
      ]
    },
    {
      "heading": "5. Conclusions",
      "text": [
        "We have demonstrated that co-occurrence statistics gathered from the Web can dramatically improve the ranking of lexicon entries produced by a weakly-supervised corpus-based bootstrapping algorithm, without requiring any additional supervision.",
        "We found that computing Web-based cooccurrence statistics across a set of seed words and then using the highest score was the most successful approach.",
        "Co-occurrence with a hypernym term also performed well for some categories, and could be easily combined with the Max of Seeds approach by choosing the highest value among the seeds as well as the hypernym.",
        "in future work, we would like to incorporate this Web-based re-ranking procedure into the bootstrapping algorithm itself to dynamically \"clean up\" the learned words before they are cycled back into the bootstrapping process.",
        "Basilisk could consult the Web-based statistics to select the best 5 words to generate before the next bootstrapping cycle begins.",
        "This integrated approach has the potential to substantially improve Basilisk's performance because it would improve the precision of the induced lexicon entries during the earliest stages of bootstrapping when the learning process is most fragile."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "Many thanks to Julia James for annotating the gold standards for the disease domain.",
        "This research was supported in part by Department of Homeland Security Grant N0014-07-1-0152."
      ]
    }
  ]
}
