{
  "info": {
    "authors": [
      "Oi Yee Kwong"
    ],
    "book": "Proceedings of the 2009 Named Entities Workshop: Shared Task on Transliteration (NEWS 2009)",
    "id": "acl-W09-3537",
    "title": "Graphemic Approximation of Phonological Context for English-Chinese Transliteration",
    "url": "https://aclweb.org/anthology/W09-3537",
    "year": 2009
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Olivia.Kwong@cityu.edu.hk",
        "Although direct orthographic mapping has been shown to outperform phoneme-based methods in English-to-Chinese (E2C) transliteration, it is observed that phonological context plays an important role in resolving graphemic ambiguity.",
        "In this paper, we investigate the use of surface graphemic features to approximate local phonological context for E2C.",
        "In the absence of an explicit phonemic representation of the English source names, experiments show that the previous and next character of a given English segment could effectively capture the local context affecting its expected pronunciation, and thus its rendition in Chinese."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Proper names including personal names, place names, and organization names, make up a considerable part of naturally occurring texts.",
        "Personal names, in particular, do not only play an important role in identifying an individual, but also carry the family history, parental expectation, as well as other information about a person.",
        "In natural language processing, the proper rendition of personal names, especially between dissimilar languages such as Chinese and English, often contributes significantly to machine translation accuracy and intelligibility, and cross-lingual information retrieval.",
        "This paper addresses the problem of automatic English-Chinese forward transliteration (referred to as E2C hereafter) of personal names.",
        "Unlike many other languages, Chinese names are characteristic in their relatively free choice and combination of characters, particularly for given names.",
        "Such apparent flexibility does not only account for the virtually infinite number of authentic Chinese names, but also leads to a considerable sample space when foreign names are transliterated into Chinese.",
        "Underlying the large sample space, however, is not entirely a random distribution.",
        "On the one hand, there are no more than a few hundred Chinese characters which are used in names (e.g. Sproat et al., 1996).",
        "On the other hand, beyond linguistic and phonetic properties, many other social and cognitive factors such as dialect, gender, domain, meaning, and perception, are simultaneously influencing the naming process and superimposing on the surface graphemic correspondence.",
        "As the state-of-the-art approach, direct orthographic mapping (e.g. Li et al., 2004), making use of graphemic correspondence between English and Chinese directly, has been shown to outperform phoneme-based methods (e.g. Virga and Khudanpur, 2003).",
        "In fact, transliteration of foreign names into Chinese is often based on the surface orthographic forms, as exemplified in the transliteration of Beckham, where the supposedly silent h in \"ham\" is taken as pronounced, resulting in han4-mu3 in Mandarin Chinese and JfSc haam4 in Cantonese.",
        "However, as we have observed, there is considerable graphemic ambiguity in E2C, where an English segment might correspond to different Chinese segments.",
        "Such multiple mappings, to a large extent, is associated with the phonological context embedding the English segment, thus affecting its expected pronunciation.",
        "Hence, if such phonological context could be considered in the transliteration model, some of the graphemic ambiguity could be resolved.",
        "However, instead of going for an explicit phonemic representation, which might introduce an extra step for error propagation, in the current study we investigate the usefulness of surface graphemic features for approximating the local phonological context in E2C.",
        "Experiments show that the previous and next character of a given segment could effectively capture the local phonological context and improve transliteration accuracy.",
        "A short note on terminology before we move on: We use \"segment\" to refer to a minimal gra-phemic transliteration unit in the names.",
        "For instance, in the data, the name Amyx is transliterated as PrJ^J^Dt a1-mi3-ke4-si1, the grapheme pairs are <a, M>, <my, ^>, and <x, J^lSJt>.",
        "There are three English segments: \"a\", \"my\" and \"x\"; and three Chinese segments: M, and J^l St. A segment may or may not correspond to exactly a syllable, although it often does.",
        "In Section 2, we will briefly review some related work.",
        "In Section 3, we will discuss some observations on graphemic ambiguity in E2C.",
        "The proposed method will be presented in Section 4.",
        "Experiments will be reported in Section 5, with results discussed in Section 6, followed by a conclusion in Section 7."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "There are basically two categories of work on machine transliteration.",
        "On the one hand, various alignment models are used for acquiring transliteration lexicons from parallel corpora and other resources (e.g. Lee et al., 2006; Jin et al., 2008; Kuo and Li, 2008).",
        "On the other hand, statistical transliteration models are built for transliterating personal names and other proper names, such as by means of noisy channel models or direct models amongst others, phoneme-based (e.g. Knight and Graehl, 1998; Virga and Khudanpur, 2003), or grapheme-based (e.g. Li et al.",
        ", 2004), or a combination of them (Oh and Choi, 2005), or based on phonetic (e.g. Tao et al., 2006; Yoon et al., 2007) and semantic (e.g. Li et al., 2007) features.",
        "Li et al.",
        "(2004), for instance, used a Joint Source-Channel Model under the direct orthographic mapping (DOM) framework, skipping the middle phonemic representation in conventional phoneme-based methods, and modelling the segmentation and alignment preferences by means of contextual n-grams of the transliteration units.",
        "Their method was shown to outperform phoneme-based methods and those based on the noisy channel model.",
        "The n-gram model used in Li et al.",
        "(2004) was based on previous local context of grapheme pairs.",
        "However, as we are going to show in Section 3, contexts on both sides of a segment are important in determining the actual rendition of it in Chinese.",
        "In addition, graphemic ambiguity could in part be resolved by means of the phonological context embedding the segment.",
        "Hence in the current study, we propose a method modified from the Joint Source-Channel Model to take into account contexts on both sides of a segment, and to approximate local phonological context by means of surface graphemic features."
      ]
    },
    {
      "heading": "3. Some Observations",
      "text": [
        "In this section, we will quantitatively analyse some properties of E2C based on our data, and show the importance of considering neighbouring context on both sides of a certain segment, as well as the possibility of approximating phonological properties graphemically.",
        "The data used in the current study are based on the English-Chinese (EnCh) training and development data provided by the organisers of the NEWS 2009 Machine Transliteration Shared Task.",
        "There are 31,961 English-Chinese name pairs in the training set, and 2,896 English-Chinese name pairs in the development set.",
        "The data were manually cleaned up and aligned with respect to the correspondence between English and Chinese segments, e.g. Aa/l/to M//K/fE.",
        "The analysis in this section is based on the training set.",
        "The Chinese transliterations in the data basically correspond to Mandarin Chinese pronunciations of the English names, as used by media in Mainland China (Xinhua News Agency, 1992).",
        "Note that transliterations for English names could differ considerably in Chinese, depending on the dialect in question.",
        "Names transliterated according to Mandarin Chinese pronunciations are very different from those according to Cantonese pronunciations, for instance.",
        "Transliterations used in Mainland China are also different from those used in Taiwan region, despite both are based on Mandarin Chinese.",
        "A well cited example is a syllable initial /d/ may surface as in Baghdad Efê-ii ba1-ge2-da2, but the syllable final /d/ is not represented.",
        "This is true for transliteration based on Mandarin Chinese pronunciations.",
        "For Cantonese, however, it is different since ending stops like -p, t and k are allowed in Cantonese syllables.",
        "Hence the syllable final /d/ in Baghdad is already captured in the last syllable of G$£SH baa1-gaak3-daat6 in Cantonese.",
        "Such phonological properties of Mandarin Chinese might also account for the observation that extra syllables are often introduced for certain consonant segments in the middle of an English name, as in Hamilton, transliterated as /K ^ han4-mi4-er3-dun4 in Mandarin Chinese (c.f.",
        "JjjStJUJJl haam4-mei5-deon6 in Cantonese); and Beckham, transliterated as JJll&BL'M bei4-ke4-han4-mu3 in Mandarin Chinese (c.f.",
        "H-jfjc bik1-haam4 in Cantonese).",
        "Table 1 quantitatively describes the training data.",
        "On average each English name has around 3.14 segments, or transliteration units.",
        "On average each English segment has around 1.7 different renditions in Chinese.",
        "On the other hand, although the number of unique Chinese segments is just a few hundred, on average one Chinese segment could correspond to about 10 different English segments.",
        "This suggests that English-Chinese graphemic segment correspondence could be quite ambiguous.",
        "Further analysis is therefore needed to see if any systematic patterns could be found among such ambiguity.",
        "Assume transliteration pair mappings are in the form <efo {cw,Ck2,...,Ckn}>, where ek stands for the kth unique English segment, and {ck1,ck2,...,ckn} for the set of n unique Chinese segments observed for it in the data.",
        "It was found in the training data that n varies from 1 to 15, while 32.2% of the distinct English segments have multiple grapheme correspondence.",
        "Table 2 shows the degree of graphemic ambiguity with illustrative examples.",
        "Some of the ambiguity, however, is the result of homophones.",
        "The effect of homophones (whether or not tones are taken into account) in E2C transliteration is worth more in-depth investigation, but it is beyond the scope of the current study.",
        "Unique English names",
        "3i,822",
        "Total English segments",
        "99,930",
        "Unique English segments",
        "2,822",
        "Unique Chinese segments",
        "458",
        "Unique grapheme pairs",
        "4,750",
        "Table i. Quantitative Aspects of the Data",
        "Examples",
        "n",
        "Proportion",
        "English",
        "Chinese",
        "Source Name",
        "Transliteration",
        "Segment",
        "Segments",
        "nei4",
        "Abernathy",
        "» na4",
        "Adamina",
        "M ni2",
        "Cranage",
        ">5",
        "4.8%",
        "na",
        "♦ na2",
        "Buonaparte",
        "3H nao3",
        "Kenall",
        "Ift na4",
        "Stranahan",
        "ii nuo4",
        "Widnall",
        "msü/k",
        "jf dan1",
        "Lafontain",
        "4",
        "2.9%",
        "tain",
        "S tan3",
        "Stainton",
        "M ting2",
        "Sartain",
        "$M dun4",
        "Chastain",
        "mm",
        "JÈÉ.",
        "lan2",
        "Granberg",
        "teilte",
        "3",
        "7.3%",
        "ran",
        "m lang3",
        "Francine",
        "jfe lun2",
        "Karran",
        "2",
        "i7.2%",
        "ty",
        "di4",
        "Christy",
        "tai4",
        "Style",
        "M/K",
        "i",
        "67.8%",
        "gie",
        "a ji2",
        "Angie",
        "%a",
        "Cowgiel",
        "#0f/K",
        "The other multiple correspondences are nevertheless genuine ambiguity.",
        "The same English graphemic segment, depending on its pronunciation within the name, could be rendered in various Chinese segments of very different pronunciations.",
        "To determine the expected pronunciation of the ambiguous English segment, however, the phonological context embedding the segment has an important role to play.",
        "For instance, the graphemic segment \"na\", when appearing at the end of a name, is often pronounced as /na/ and rendered as U na4, especially for female names.",
        "But when it is in the middle of a name, and especially before \"th\", it is often pronounced as /nei/ and rendered as F*3 nei4.",
        "Similarly, the segment \"ty\" is often pronounced as /ti/ at the end of a name and transliterated as H di4.",
        "On the other hand, if it is in the middle of a name, after an \"s\" or in front of \"le\" or \"re\", it is often pronounced as /tai/ and therefore transliterated as tai4.",
        "Take another segment \"le\" as an example.",
        "It is found to correspond to as many as 15 different Chinese segments, including MJ li4, M le4, M li4, /K er3, M lai2, M li3, etc.",
        "When \"le\" appears at the end of a name, all but a few cases are pronounced as /l/ and rendered as /K er3, particularly when it follows \"a\", e.g. Dale H/K dai4-er3 and Dipasquale ^ttffi^/ di2-pa4-si1-kui2-er3.",
        "Exceptions are when \"le\" at the end of a name follows \"r\", where it is often rendered as MJ li4 instead.",
        "On the other hand, when \"le\" appears at the beginning of a name where the vowel is often prominently pronounced, it is usually rendered as M le4 or M lai2, e.g. Lepke M iaj^l lai2-pu3-ke4, except when it is followed by the vowel \"o\", where it is then often transliterated as M li4, e.g. Leonor MlJiiiS li4-ao4-nuo4.",
        "When \"le\" appears in the middle of a name, the transliteration is nevertheless more variable.",
        "Still it is remarkable that \"le\" is transliterated as M li4 when it is followed by \"c\" or \"x\", e.g. Alex MMi'lM a4-li4-ke4-si1.",
        "Such observations thus suggest two important points for E2C.",
        "First, contexts on both sides of a given segment do play a role in determining its likely rendition in Chinese.",
        "Second, the phonological context is important for determining the expected pronunciation of an English segment given its position in a name.",
        "Hence we propose a method, making use of contexts on both sides of a segment, to approximate the local phonological context of a segment via surface gra-phemic features."
      ]
    },
    {
      "heading": "4. Proposed Method",
      "text": [
        "The Joint Source-Channel Model in Li et al.",
        "(2004) making use of direct orthographic mapping and a bigram language model for the segment pairs (or token pairs in their terms) is as follows:",
        "where E refers to the English source name and C refers to the transliterated Chinese name.",
        "With K segments aligned between E and C, ek and ck refer to the kth English segment and its corresponding Chinese segment respectively.",
        "While we have grounds for orthographic mapping as mentioned in the introduction, there is some modification we hope to make to the above model.",
        "As pointed out in the last section, local contexts on both sides of a given segment should be important and useful for modelling the context embedding the segment, which in turn could help determine its expected pronunciation.",
        "In addition, the phonological environment might be sufficiently represented by a neighbouring phoneme instead of even a syllable.",
        "Thus we take the last character from the previous segment and the first character of the next segment (instead of the whole neighbouring segment) into account, irrespective of their corresponding Chinese segments.",
        "This could be considered an attempt to approximate the local phonological context of a given segment by means of surface graphemic features, even if we do not go for an explicit phonemic representation of the source name.",
        "Hence we propose to make use of bigrams in both directions with equal weighting, and assign a score, Score(E,C), to a transliteration candidate as below:",
        "where lc(ek-1) refers to the last character of the previous English segment, and fc(ek+1) refers to the first character of the next English segment.",
        "In the rest of this paper, we will refer to this method as GAP, which stands for Graphemic Approximation of Phonological context."
      ]
    },
    {
      "heading": "5. Experiments",
      "text": [
        "The 31,961 English-Chinese name pairs from the NEWS shared task training set were used for training, and the 2,896 names in the development set were used for testing.",
        "The data were first manually cleaned up and aligned with respect to the correspondence between English segments and Chinese segments.",
        "Each test name was first segmented.",
        "All possible segmentations were obtained based on the unique English segments obtained from the manual alignment above.",
        "The graphemic units are made case-insensitive.",
        "When finding all possible graphemic segmentations of the English source names, segments with length 1 are only allowed if no longer segment with that initial letter followed by a vowel is possible.",
        "For example, while \"a\", \"k\", \"l\", \"o\", \"v\", \"s\" and \"y\" are all observed segments in the training data, when computing the transliteration for the test name Akalovsky, only two of the possible segmentations, A/ka/lo/v/s/ky and A/kal/o/v/s/ky, were considered while the rest involving more single-letter segments were ignored.",
        "This is justified by three reasons.",
        "First, the more alternative segmentations, the more alternative transliteration candidates are to be evaluated.",
        "This is computationally expensive, and many alternatives are in fact quite unlikely.",
        "Second, single-letter segments are redundant if a longer segment is possible.",
        "On the one hand, transliterations are usually based on a consonant-vowel combination as a unit.",
        "A consonant will only be on its own as a segment if it occurs among a consonant cluster, which has no direct syllable correspondence in Chinese.",
        "For example, it is useless to single out the second \"k\" in Akalovsky as the longer segment \"ka\" is pronounceable anyway, unlike in names with consonant clusters like Akst.",
        "On the other hand, in the cases of doubling consonants like Ross, both \"s\" and \"ss\" will correspond to similar sounds.",
        "Third, the n-gram models favour transliterations with fewer segments anyway, so the segmentations with more single-letter segments will be less probable in any case.",
        "The possible segmentations obtained were then ranked by a method similar to GAP.",
        "The score for each segmentation candidate S, Score(S), is computed by:",
        "where skis the kth segment in a name, lc(sk-1) is the last character of the previous segment and fc(sk+1) is the first character of the next segment.",
        "In the experiments, we selected the top N segmentation candidates for use in subsequent steps, where N was varied from 1 to 3.",
        "With the top N segmentation candidates, the transliteration candidates were generated by looking up the grapheme pairs obtained from manual alignment with frequency over a certain threshold f We tested with f > 3 and f > 5.",
        "If there is no grapheme pair for a certain segment above the threshold, all pairs below the threshold would be considered.",
        "All combinations obtained were then subject to ranking by the GAP transliteration method.",
        "The transliteration candidates were evaluated and ranked by the GAP method.",
        "For comparison, we also run the Joint Source-Channel Model (JSCM) described in Li et al.",
        "(2004) on the test data.",
        "In addition, we also tested a variation of GAP, called GAP-s, where the neighbouring characters are replaced by the neighbouring segments in the computation of the scores, that is, lc(ek-1) is replace by <ek-1,ck-1> and fc(ek+1) is replaced by <ek+1,ck+1>.",
        "Note that similar changes were applied to the ranking of the source name segmentations for both methods accordingly.",
        "System performance was measured by the Mean Reciprocal Rank (MRR) (Kantor and Voorhees, 2000), as well as the Word Accuracy in Top-1 (ACC) and Fuzziness in Top-1 (Mean F-score) used in the NEWS shared task.",
        "Only the top 10 transliteration candidates produced by the systems were considered."
      ]
    },
    {
      "heading": "6. Results and Discussion",
      "text": [
        "As mentioned in the last section, candidates were filtered in two stages.",
        "First, when the source English name was segmented, only the top N segmentation candidates were retained for subsequent processes.",
        "Second, when transliteration candidates were generated, only those grapheme pairs with frequency > f where applicable, were considered for the candidates.",
        "Table 3 shows the results of GAP with various combinations of N and f.",
        "As seen in Table 3, although the top 1 segmentation candidate could already achieve a certain performance level, taking the top 3 segmentation candidates could nevertheless considerably improve the MRR.",
        "This apparently suggests that the source name segmentation step could have significantly affected the overall performance of transliteration.",
        "Taking more segmentation candidates into account could help raise some correct transliterations to a higher rank, but there was not much improvement in terms of the accuracy at the top 1 position.",
        "In terms of the grapheme pair frequency, setting the threshold at 3 gave only slightly better results than setting it at 5.",
        "A possible reason is that about 70% of all unique grapheme pairs have frequency below 5, and out of these over 47% only have single correspondence.",
        "In other words, there are a lot of grapheme pairs of low frequency, and for those ambiguous English segments, the distribution of their corresponding Chinese segments could be relatively uneven.",
        "Hence the following comparison between various transliteration methods was based on the combination of N=3 and f > 3.",
        "To show the effectiveness of our proposed method, GAP was compared with JSCM and GAP-s. Table 4 shows the results of the three methods.",
        "As evident from Table 4, system GAP-s outperformed JSCM.",
        "The accuracy at top 1 position is much improved, thus boosting the MRR too.",
        "This improvement therefore supports our hypothesis that contexts on both sides of a given segment are important for determining its rendition in Chinese, where part of the graphemic ambiguity could be successfully resolved.",
        "Meanwhile, system GAP further improves the results from GAP-s, bringing ACC up to 0.6450 and MRR to 0.7319.",
        "This shows that the phonological context could be better captured, though only approximately, by means of the last character of the previous segment and the first character of the next segment, instead of the whole neighbouring segments.",
        "This is because the phonological context is often most closely related to the neighbouring phonemes instead of a whole syllable.",
        "In this section we show two examples from the experimental outcomes to illustrate the usefulness of the GAP method.",
        "The name Abercromby, according to the gold standard, should be transliterated as MHSj^lyffctfc a4-bo2-ke4-long2-bi3.",
        "This transliteration came third in the JSCM system, whose top first and second candidates were |^{Qj^§7#ikb a4-bo2-ke4-luo2-mu3-bi3 and MRft'&^Mth a4-bei4-er3-ke4-luo2-mu3-bi3 respectively.",
        "On the contrary, the expected transliteration came first in the GAP system.",
        "The top 3 source name segmentation candidates for both methods are shown in Table 5.",
        "The expected segmentation has already been identified as the best candidate in GAP, while it came third in JSCM.",
        "When it comes to the evaluation of the transliteration candidates, the longer candidates could even score higher than the expected outcome in JSCM.",
        "The statistical data show that the bigram c/j^l+ro/:§7 is far more likely than c/j^l+rom/M, but P(<ek,ck>=<rom, M > | fc(ek+1)=b) is much stronger than P(<ek,ck>=<m, M > | fc(ek+0=b).",
        "Hence, taking the character on both sides of a segment, GAP managed to rank MH£j£M ft highest.",
        "Another example is the name Regelson, which is transliterated as Jlflr/Kft li3-ge2-er3-sen1 in the gold standard.",
        "The expected transliteration is ranked 8th in JSCM and 2nd in GAP.",
        "Although",
        "f \\ n",
        "1",
        "2",
        "3",
        "ACC",
        "0.6357",
        "0.6443",
        "0.6450",
        "Mean F",
        "3",
        "0.8558",
        "0.8600",
        "0.8598",
        "MRR",
        "0.696i",
        "0.7279",
        "0.7319",
        "ACC",
        "0.6336",
        "0.6423",
        "0.6430",
        "Mean F",
        "5",
        "0.8547",
        "0.8597",
        "0.8595",
        "MRR",
        "0.69i0",
        "0.7233",
        "0.7280",
        "Top",
        "JSCM",
        "GAP",
        "1",
        "a/ber/c/ro/m/by",
        "a/ber/c/rom/by",
        "2",
        "a/be/r/c/ro/m/by",
        "a/ber/c/ro/m/by",
        "3",
        "a/ber/c/rom/by",
        "a/be/r/c/rom/by",
        "JSCM",
        "GAP-s",
        "GAP",
        "ACC",
        "0.5760",
        "0.6i74",
        "0.6450",
        "Mean F",
        "0.8309",
        "0.8507",
        "0.8598",
        "MRR",
        "0.688i",
        "0.7i75",
        "0.7319",
        "P(<ek,ck>=<ge,*> | <ek-1,ck-1>=<re,M>) is much higher than P(<ek,ck>=<ge,f#> | <ek-1,ck-1>=<re, M>), when taking the next segment <l,/K> into account, the likelihood of <ge,^> is lowered.",
        "Hence the expected transliteration is ranked higher in GAP.",
        "As the proposed method stands, errors could have been propagated from two steps.",
        "The first is the source name segmentation step.",
        "If it happens that the top segmentation candidates are already wrong to start with, there is no way to reach the expected transliteration at all.",
        "Hence it is even more important to maintain a high accuracy for the segmentation step.",
        "The other error-propagation step is certainly when transliteration candidates are evaluated.",
        "The results for this step often heavily rely on the training data.",
        "If it happens that the grapheme pair distributions are somewhat skewed, particular Chinese segments would be preferred irrespective of relevant linguistic or other factors.",
        "On the other hand, if many homophones are used for a particular English segment, the chance of reaching the expected transliteration with one of the homophones is again loosened.",
        "More on this will be discussed in the next section.",
        "For the latter error-propagation step, our attempt to make use of contexts on both sides of a segment has been shown to be able to improve the results.",
        "To see how much of the errors is attributable to the segmentation step, we roughly made an estimation by comparing the length of the top 1 candidates given in JSCM and GAP with the gold standard.",
        "It was found that 17.8% and 14.2% of the first candidates in JSCM and GAP respectively do not match the length of the gold standard.",
        "More detailed analysis of the segmentation results is in progress.",
        "Our current treatment of neighbouring context and graphemic approximation of phonological context is shown to outperform pure DOM based on previous context only.",
        "Nevertheless, there are several directions of work which would require more investigation to further improve E2C performance.",
        "First, the source name segmentation step needs further improvement to minimise error propagation from an early step.",
        "Phonological knowledge is obviously important in this regard as how a given English name should be segmented and pronounced is determined by its phonological context.",
        "Even without an explicit phonemic representation of the source names, more could be done in terms of modelling the phonological context via the surface graphemes.",
        "Second, relating to the above, foreign names of different origins often have very different phonological properties leading to different pronunciations for the same orthographic forms.",
        "The silent h in Beckham mentioned earlier is one example, even though Chinese transliterations are often based on surface orthographic properties.",
        "Other problematic cases could be from languages like Russian and German where there are relatively more consonant clusters.",
        "For instance, the segment \"scho\" is often transliterated as one syllable (e.g. £H shao4, f| xiao4, or llr she4) but the segment \"stro\" often leads to three syllables (e.g. Mf^f^ si1-te4-luo2).",
        "It is therefore important to incorporate more phonological knowledge into the transliteration model, not only to generate more reliable and acceptable transliteration candidates, but also to reduce effort in evaluating phonologically invalid segmentation candidates and syllable structures, thus making the task computationally less expensive.",
        "Third, as one of our separate ongoing studies shows, homophones are not only abundant in Chinese language per se, but also in E2C transliteration.",
        "The situation is particularly salient in Chinese transliterations based on Cantonese pronunciations.",
        "For example, while some names might have two transliterations with different pronunciations, like Jackson as fitlM zik1-seon3 or fitIS zik1-san4, the same name might also be rendered in two forms with a different character having the same pronunciation, such as Adam as iSiS or Mis (both pronounced as aa3-dong1 in Cantonese).",
        "Two transliterations for the same name might have the same sound but different tones, e.g. Ashley as aai6-syu4-lei6 or 55",
        "§y^[J aai6-syu1-lei6.",
        "We therefore attempt to model the English-Chinese segment correspondence via an intermediate representation of the phonetic transcription of the Chinese characters.",
        "Preliminary results are reported in Kwong (2009).",
        "Although it happens that only one transliteration is given for each name in the gold standard data used in this study, the variability of E2C in reality is evident.",
        "It is therefore important for systems to be able to accommodate acceptable transliteration alternatives, particularly for transliteration extraction and information retrieval.",
        "Fourth, given that tonal patterns could help distinguish some homophone ambiguity, the effect of the tonal factor and its potential association with the pitch and accent in the English names is worth further investigation."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "Hence in this paper, we have reported our work on approximating phonological context for E2C with surface graphemic features.",
        "This is based on the observation that certain graphemic ambiguity is closely associated with the local contexts on both sides of a given segment, the phonological properties of which often determine its expected pronunciation.",
        "Experiments have shown that in the absence of an explicit phonemic representation of the English source names, the previous and next character of a given segment could be effectively employed to approximate the local phonological context affecting the rendition of a given segment in Chinese.",
        "Our proposed method GAP gives better results than the conventional JSCM which only makes use of previous context, and GAP-s which considers the whole neighbouring segments.",
        "Future work includes improving the source name segmentation step to minimise error propagation from an early stage, incorporating other factors like name origin and special phonological properties of different source languages into the transliteration model, as well as effectively handling homophones and tonal patterns in E2C transliteration."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The work described in this paper was substantially supported by a grant from City University of Hong Kong (Project No.",
        "7002203)."
      ]
    }
  ]
}
