{
  "info": {
    "authors": [
      "M. G. Abbas Malik",
      "Laurent Besacier",
      "Christian Boitet",
      "Pushpak Bhattacharyya"
    ],
    "book": "Proceedings of the 2009 Named Entities Workshop: Shared Task on Transliteration (NEWS 2009)",
    "id": "acl-W09-3536",
    "title": "A Hybrid Model for Urdu Hindi Transliteration",
    "url": "https://aclweb.org/anthology/W09-3536",
    "year": 2009
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Abbas Malik Laurent Besacier Christian Boitet Pushpak Bhattacharyya",
        "GETALP, Laboratoire d'Informatique Grenoble (LIG) IIT Bombay",
        "Université Joseph Fourier",
        "Abbas.Malik, Laurent.Besacier, pb@cse.iitb.ac.in",
        "Christian.Boitet@imag.fr",
        "We report in this paper a novel hybrid approach for Urdu to Hindi transliteration that combines finite-state machine (FSM) based techniques with statistical word language model based approach.",
        "The output from the FSM is filtered with the word language model to produce the correct Hindi output.",
        "The main problem handled is the case of omission of diacritical marks from the input Urdu text.",
        "Our system produces the correct Hindi output even when the crucial information in the form of diacritic marks is absent.",
        "The approach improves the accuracy of the transducer-only approach from 50.7% to 79.1%.",
        "The results reported show that performance can be improved using a word language model to disambiguate the output produced by the transducer-only approach, especially when diacritic marks are not present in the Urdu input."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Transliteration is a process to transcribe a word written in one language, in another language by preserving its articulation.",
        "It is crucial for handling out-of-vocabulary (OOV) words in different domains of Natural Language Processing (NLP), especially in Machine Translation (Knight and Graehl, 1998; Knight and Stall, 1998; Paola and Sanjeev, 2003), Cross-Lingual Information Retrieval (Pirkola et al., 2003), the development of multilingual resources (Yan et al.",
        ", 2003) and multilingual text and speech processing.",
        "It is also useful for Inter-dialectal translation without lexical changes and sometimes it is mandatory when the dialects in question use mutually incomprehensible writing systems.",
        "Such cases exists in Malay (written in 2 different scripts), Turkish (2 scripts), Kurdish (3 scripts), Hindi/Urdu (2 scripts), Punjabi (2 scripts), etc., where words are transliterated from one script to the other, irrespective of their type (noun, verb, etc., and not only proper nouns and unknown words).",
        "In this study, we will focus on Hindi/Urdu example.",
        "Hindi and Urdu are written in two mutually incomprehensible scripts, Devanagari and Urdu script - a derivative of Persio-Arabic script respectively.",
        "Hindi and Urdu are the official languages of India and the later is also the National language of Pakistan (Rahman, 2004).",
        "Table 1 gives an idea about the number of speakers of Hindi and Urdu.",
        "Notwithstanding the transcriptional differences, Hindi and Urdu share phonology, grammar, morphology, literature, cultural heritage, etc.",
        "People from Hindi and Urdu communities can understand the verbal expressions of each other but the written expression of one community is alien to the other community.",
        "A finite-state transliteration model for Hindi and Urdu transliteration using the Universal Intermediate Transcription (UIT - a pivot between the two scripts) was proposed by Malik et al.",
        "(2008).",
        "The non-probabilistic finite-state model is not powerful enough to solve all problems of Hindi <-» Urdu transliteration.",
        "We visit and analyze Hindi <-» Urdu transliteration problems in the next section and show that the solution of these problems is beyond the scope of a non-probabilistic finite-state transliteration model.",
        "Native Speaker",
        "2nd Lang.",
        "Speaker",
        "Total",
        "Hindi",
        "366",
        "487",
        "853",
        "Urdu",
        "60.29",
        "104",
        "164.29",
        "Total",
        "426.29",
        "591",
        "1,017.29",
        "Source: (Grimes, 2000) all numbers are in millions",
        "Following this, we show how a statistical model can be used to solve some of these problems, thereby enhancing the capabilities of the finite-state model.",
        "Thus, we propose a hybrid transliteration model by combining the finite-state model and the statistical word language model for solving Hindi <-» Urdu transliteration problems, discussed in section 2.",
        "Section 3 will throw light on the proposed model, its different components and various steps involved in its construction.",
        "In section 4, we will report and various aspects of different experiments and their results.",
        "Finally, we will conclude this study in section 5."
      ]
    },
    {
      "heading": "2. Hindi Urdu Transliteration",
      "text": [
        "In this section, we will analyze Hindi <-» Urdu transliteration problems and will concentrate on Urdu to Hindi transliteration only due to shortage of space and will discuss the reverse transliteration later.",
        "Thus, the remainder of the section analyzes the problems from Urdu to Hindi transliteration.",
        "Urdu is written in a derivation of Persio-Arabic script.",
        "Urdu vowels are represented with the help of four long vowels Alef-madda 0), Alef (I), Waw (j), Yeh (<_s) and diacritical marks.",
        "One vowel can be represented in many ways depending upon its context or on the origin of the word, e.g. the vowel [a] is represented by Alef-madda",
        "0) at the beginning of a word, by Alef (I) in the middle of a word and in some Persio-Arabic loan word, it is represented by the diacritical mark Khari Zabar (6).",
        "Thus Urdu has very complex vowel system, for more details see Malik et al.",
        "(2008).",
        "Urdu contains 10 vowels, and 7 of them also have their nasalization forms (Hussain, 2004; Khan, 1997) and 15 diacritical marks.",
        "Thou diacritical marks form the cornerstone of the Urdu vowel system, but are sparingly used (Zia, 1999).",
        "They are vital for the correct Urdu to Hindi transliteration using the finite-state transliteration model.",
        "The accuracy of the finite-state transliteration model decreases from above 80% to 50% in the absence of diacritical marks.",
        "Figure 1 shows two example Urdu phrases (i) with and (ii) without the diacritical marks and their Hindi transliteration using the finite-state transliteration model.",
        "Due to the absence of Zabar (6) in the first and the last words in (1)(ii) and in the 5th word in (2)(ii), vowels © [ae] and 3$ [0] are",
        "transliterated into vowels © [e] and 3TT [o] respectively.",
        "Similarly, due to the absence of Pesh (6) and Zer (■;:■) in 3rd and 4th words respectively verted into the vowel [e].",
        "All wrongly converted words are underlined.",
        "In Hindi, each vowel is represented by a character and a vowel sign except the vowel [e], which is only represented by the character 3 and do not have a vowel sign (Malik et al., 2008).",
        "Table 2 gives all vowel conversion problems.",
        "* Zero (0) means deleted.",
        "Long vowels Yeh (<_s) [j] and Waw (j) [v] are also used as consonants and certain contextual rules help us to decide whether they are used as a consonant or as a vowel, e.g., Yeh (s) and Waw (j) are used as consonants at the start of a word and after the long vowel Alef-madda ( ), etc.",
        "Fi(i) i 1 ^^cT Sfteff cfiTJT aft fcPUT t",
        "I have not done a lot of work (ii) fere sttt 3fr 33r tt^tu sttt 3fr",
        "Both at the central level and at the state level_",
        "Sr.",
        "IPA",
        "Vowel Conversion Problems",
        "Hindi",
        "1",
        "i",
        "i – e",
        "f or f© – 3 or 0*",
        "2",
        "u",
        "u – e",
        "5 or © – 3 or 0*",
        "3",
        "i",
        "i – e",
        "f or ■:©■ – T or ©",
        "4",
        "ae",
        "ae – e",
        "$ or © – T or ©",
        "5",
        "u",
        "u – o",
        "or o – 33\" or ©T",
        "6",
        "0",
        "0 – o",
        "3T or ©T – 33\" or ©T",
        "7",
        "j",
        "j – e",
        "U – ©",
        "8",
        "v",
        "v – o",
        "cT – CT",
        "nite-state transliteration model can exploit such contextual rules but it is not possible to decide Yeh (s) and Waw (j) as consonants in the absence of diacritics.",
        "Thus a finite-state transliteration model wrongly converts consonant Yeh (<_s) and Waw (j) into vowels © [e] and ©t [o], also given in Table 2, instead of consonants Ya (U) and Wa (TT) respectively, e.g., in the word jj£ (prince) [kufivr], Waw is wrongly converted into the vowel [o] due to the absence of Zabar (6) after it and the word becomes [kunor], which is not a valid word of Hindi/Urdu.",
        "The Hindi writing system contains some native sounds/characters, e.g., vocalic R (^) [r], retroflex form of Na (W) [IT], etc.",
        "On the other hand",
        "Urdu does not have their equivalents.",
        "Thus words containing such sounds are transcribed in Urdu with their approximate phonetic equivalents.",
        "All such cases are problematic for Urdu to Hindi transliteration and are given in Table 3.",
        "The Hindi alphabet is partly syllabic because each consonant inherits the vowel [e].",
        "Two or more consonants may be combined together to form a cluster called Conjunct that marks the absence of the inherited vowel [e] between consonants (Kellogg, 1872; Montaut, 2004).",
        "Conjunction is also used to represent the gemination cial meaning but native speakers use conjunct forms without any explicit rule (Montaut, 2004).",
        "On the other hand, Urdu uses Jazam (■:::■ - a diacritic) and Shadda (6) to mark the absence of a vowel between two consonants and gemination of a consonant respectively.",
        "In the absence of these diacritics in the input Urdu text, it is not possible to decide on the conjunct form of consonants except in the case of aspiration.",
        "In Urdu, aspiration of a consonant is marked with the special character Heh-Doachashmee (■*) (Malik et al., 2008), thus a finite-state transducer can easily decide about the conjunction for aspiration with a simple contextual rule, e.g. the word o^-(bride) [dulhn] is correctly transliterated by our finite-state transliteration model into c^<?-$i.",
        "Sanskrit highly influences Hindi and especially its vocabulary.",
        "In some words of Sanskrit origin, the vowel <©' [i] and © [u] are transcribed as f©",
        "[i] and © [u] respectively at the end of a word.",
        "Javaid and Ahmed (2009) have pointed to this issue in these words \"Hindi language can have words that end on short vowel...\".",
        "Table 4 gives some examples of such native words.",
        "On the other hand in Urdu, short vowels can never come at the end of a word (Javaid and Ahmed, 2009;",
        "Malik et al., 2008).",
        "Examples",
        "(person) [vjekti] ST^jfa - ^jS^i\"\" (culture) [sejlskreti] iwjeblfe - t^JV (high) [uffkoti] fcg - J% (for) [hetu] fefrFg - Ji£ (but) [kintu] yTg - jtaj (metal) [daju]",
        "It is clear from above examples that short vowels at the end of a Hindi word can easily be transliterated in Urdu using a contextual rule of a finite-state transducer, but it is not possible to do so for Urdu to Hindi transliteration using a non-probabilistic finite-state transliteration model.",
        "Thus Urdu to Hindi transliteration can also be considered as a special case of Back Transliteration.",
        "Sr.",
        "IPA",
        "Hindi",
        "Urdu",
        "1",
        "r",
        "3t or ©",
        "J [r]",
        "2",
        "n.",
        "W",
        "o [n]",
        "3",
        "J",
        "*T",
        "^ [n",
        "4",
        "Half h",
        "» [h]",
        "[hue], TldH^T (name of a city) [racfeenpur].",
        "Some of these cases are regular and can be implemented as contextual rules in a finite-state transducer but it is not possible in every case.",
        "Ain - glottal stop) exists in the Arabic alphabet and native Arabic speakers pronounce it properly.",
        "Urdu also has adopted Ain (£) in its alphabet as well as Arabic loan words but native speakers of the subcontinent cannot produce its sound properly, rather they produce a vowel sound by replacing Ain (£) with Alef (I).",
        "The Hindi alphabet follows one character for one sound rule and it does not have any equivalent of Ain (£).",
        "Then, Ain (£) in Urdu words is transcribed in Hindi by some vowel representing the pronunciation of the word by native subcontinent speakers.",
        "Thus it is always transliterated in some vowel in Hindi.",
        "For example, Ain (£) gives the sound of the vowel [e] in Softer (strange) [ecfeib] and the vowel [a] with and without Alef (I) in words ^ - 3TT2T (common) [am] and - rncc (after) [bad] respectively.",
        "In some words, Ain (£) is not pronounced at all and should be deleted while transliterating from Urdu to Hindi, e.g., £jJ^ - (to start)",
        "[fUru], etc.",
        "Conversion of Ain (£) is a big problem for transliteration.",
        "Noonghunna (j) [p] is the nasalization marker of vowels in Urdu.",
        "Interestingly, it is only used to nasalize a vowel at the end of a word.",
        "In the middle of a word, Noon (0) [n] is used to mark the nasalization of a vowel and it is also used as a consonant.",
        "It is difficult to differentiate between nasalized and consonant Noon (0).",
        "There are certain contextual rules that help to decide that Noon (0) is used as a consonant or a nasalization marker, but it not possible in all cases.",
        "Urdu borrows a considerable portion of it vocabulary from Persian and Arabic and transliteration of these words in Hindi is not regular.",
        "Table 5 explains it with few examples."
      ]
    },
    {
      "heading": "3. Hybrid Transliteration Model",
      "text": [
        "The analysis of the previous section clearly shows that solution of these problems is beyond the scope of the non-probabilistic Hindi Urdu Finite-state transliteration model (Malik et al., 2008).",
        "We propose a hybrid transliteration model that takes the input Urdu text and converts it in Hindi using the Finite-state Transliteration Model (Malik et al., 2008).",
        "After that, it tries to correct the orthographic errors in the transducer-only Hindi output string using a statistical word language model for Hindi with the help of a Hindi Word Map described later.",
        "The approach used is rather similar to what is done in text recapitalization (Stolcke et al.",
        "1998) for instance.",
        "Input Urdu Text",
        "Urdu Hindi Transliteration Finite-state Machine (UHT-FSM)",
        "UHT-FSM Hindi output UHT-FSM Hindi Output",
        "Preprocessed UHT-FSM Hindi output",
        "Hindi Word Language Model k – ",
        "Output Hindi Text",
        "Normally, the Urdu text does not contain necessary diacritical marks that are mandatory for the correct transliteration by the finite-state component Urdu Hindi Transliteration",
        "Urdu",
        "Hindi",
        "FST Conversion",
        "Correct",
        "(surely)",
        "[bilkül]",
        "(with reference of)",
        "[bilvasta]",
        "(in fact)",
        "[filheqiqet]",
        "Finite-state Machine (UHT-FSM), described by Malik et al.",
        "(2008).",
        "The proposed hybrid model focuses on the correct transliteration of Urdu texts without diacritical marks.",
        "Figure 2 gives the proposed Model architecture.",
        "The goal of this preprocessing is to generate a more \"normalized\" (and consequently more ambiguous) form of Hindi, e.g. preprocessing transforms both corpus words fS (this) [is] and",
        "5S (that) [us] (if encountered in the UHT-FSM Hindi output) into the default input Hindi word 3TS* [es] (not a valid Hindi word but is a finite-state transliteration of the input Urdu word <j*I, a word without diacritical marks).",
        "Thus preprocessing is vital for establishing connections between the UHT-FSM Hindi output words (from the Urdu input without diacritical marks) and the Hindi corpus words.",
        "In the example",
        "above, the word 3TS* [es] is aligned to two Hindi corpus words.",
        "All such alignments are recorded in the Hindi Word Map.",
        "This ambiguity will be solved by the Hindi word language model, trained on a large amount of Hindi data.",
        "Thus preprocessing is a process that establishes connections between the most likely expected input Hindi word forms (UHT-FSM Hindi output from the Urdu input without diacritical marks) and the correct Hindi word forms (words that are present in the Hindi corpus).",
        "The Preprocessing component is a finite-state transducer that normalizes the Hindi output of UHT-FSM component for the Hindi word language model .",
        "The transducer converts all cases of gemination of consonants into a simple consonant.",
        "For example, the UHT-FSM converts the Urdu word (God) [rebb] into T^rr and the",
        "Preprocessing converts it into [rb].",
        "The",
        "transducer also removes the conjunct marker (©) from the output of the UHT-FSM except when it is preceded by one of the consonant from the set the consonant t [h] (first 3 lines of Figure 3), e.g., UHT-FSM converts the Urdu words (Hindi) [hindi] and O^- (bride) [dulhn] into ft^t and c^cti respectively and the Preprocessing component converts them into fgl^t (removes ©) and c^e-ti (no change).",
        "Actually, Preprocessing deteriorates the accuracy of the output of the UHT-FSM component.",
        "We will come back to this point with exact figures in the next section.",
        "The code of the finite-state transducer is given in XFST (Beesley and Karttunen, 2003) style in Figure 3.",
        "In XFST, the rules are applied in reverse order due to XFST's transducer stack, i.e. a rule written at the end of the XFST script file will apply first and so on.",
        "The Hindi Word Language Model is an important component of the hybrid transliteration model.",
        "For the development of our statistical word language model, we have used the Hindi Corpus freely available from the Center for Indian Language Technology, Indian Institute of Technology Bombay (IITB), India.",
        "First, we extracted all Hindi sentences from the Hindi corpus.",
        "Then we removed all punctuation marks from each sentence.",
        "Finally, we added '<s>' and '</s>' tags at the start and at the end of each sentence.",
        "We trained a tri-gram Hindi Word Language Model with the",
        "SRILM (Stolcke, 2002) tool.",
        "The processed Hindi corpus data contains total 173,087 unique sentences and more than 3.5 million words.",
        "The SRILM toolkit command 'disambig is used to generate the final Hindi output using the statistical word language model for Hindi and the Hindi Word Map described in the next section.",
        "The Hindi Word Map is another very important component of the proposed hybrid transliteration model.",
        "It describes how each \"normalized\" Hindi word that can be seen after the Preprocessing step and can be converted to one or several correct Hindi words, the final decision being made by the statistical word language model for Hindi.",
        "We have developed it from the same processed Hindi corpus data that was used to build the Hindi Word Language Model.",
        "We extracted all unique Hindi words (120,538 unique words in total).",
        "The hybrid transliteration model is an effort to correctly transliterate the input Urdu text without diacritical marks in Hindi.",
        "Thus we take each unique Hindi word and try to generate all possible Hindi word options that can be given as input to the Hindi Word Language Model component for the said word.",
        "Consider the Urdu word mj (God) [rebb]; its correct Hindi spellings are T^r.",
        "If we remove the diacritical mark Shadda (6) after the last character of the word, then the word becomes mj and UHT-FSM transliterates it in TT*.",
        "Thus the Hindi Word Language Model will encounter either T^T or",
        "TT* for the Hindi word T^T (two possible word",
        "options).",
        "In other words, the Hindi Word Map is a computational model that records all possible alignments between the \"normalized\" or preprocessed words (most likely input word forms) and the correct Hindi words from the corpus.",
        "We have applied a finite-state transducer that generates all possible word options for each unique Hindi word.",
        "We cannot give the full XFST code of the 'Default Input Creator' due to space shortage, but a sample XFST code is given in Figure 4.",
        "If the Urdu input contains all necessary diacritical marks, then preprocessing of the output of the UHT-FSM tries to remove the effect of some of these diacritical marks from the Hindi output.",
        "In the next section, we will show that actually it increases the accuracy at the end.",
        "Practically, the Hindi Word Map is a file in which each line contains a possible input word to Hindi Word Language Model, followed by a list of one (see line 3 of Figure 5) or more (see line 1 of Figure 5) words from the corpus that are associated with this possible input word.",
        "The 'Default Input Creator' transducer has generated in total 961,802 possible input words for 120,538 unique Hindi words.",
        "For implementation reasons, we also added non-ambiguous pair entries in the word map (see line 2 of Figure 5), thus the initial word map contains in total 1,082,340 entries.",
        "We extract unique option words and finally, Hindi Word Map contains in total 962,893 entries.",
        "Some examples from Hindi Word Map file are given in Table 5.",
        "(4) cpr^Hifl cpro^uifl cprßMiRifl",
        "For testing purposes, we extracted 200 Hindi sentences from the Hindi corpus before removing punctuation marks.",
        "These sentences were of course removed from the training corpus used to build the statistical word language model for Hindi.",
        "First we converted these 200 Hindi sentences in Urdu using Hindi Urdu Finite-state transliteration model (Malik et al., 2008).",
        "Transliterated Urdu sentences were post edited manually for any error and we also made sure that the Urdu text contained all diacritical marks.",
        "200 original Hindi sentences served as Hindi reference for evaluation purposes.",
        "From the post-edited Urdu sentences, we developed two test corpora.",
        "The first test corpus was the Urdu test with all diacritical marks.",
        "In the second test corpus, all diacritical marks were removed.",
        "We calculated both word level and character level accuracy and error rates using the SCLITE tool.",
        "Our 200 sentence test contains 4,250 words and 16,677 characters in total.",
        "First we converted both Urdu test data using UHT-FSM only and compared the transliterated Hindi texts with the Hindi reference.",
        "UHT-FSM shows a word error rate of 21.5% and 51.5% for the Urdu test data with and without diacritics respectively.",
        "Results are given in Table 6, row 1.",
        "These results support our claims that the absence of diacritical marks considerably increases the error rate.",
        "Both outputs of UHT-FSM are first passed directly to Hindi Word Language Model without preprocessing.",
        "The Hindi Word Language Model converts UHT-FSM Hindi output in the final Hindi output with the help of Hindi Word Map.",
        "Two final outputs were again compared with the Hindi reference and results are given in Table 6, row 2.",
        "For Urdu test data without diacritics, error rate decreased by 28.4% due to the Hindi Word Language Model and Hindi Word Map as compared to the UHT-FSM error rate.",
        "The Hindi Word Language Model also decreases the error rate by 1.9% for the Urdu test data with diacritics.",
        "In this test, both outputs of UHT-FSM were preprocessed and the intermediate Hindi outputs were compared with the Hindi reference.",
        "Results are given in Table 6, row 3.",
        "After the comparison of results of row 1 and row 3, it is clear that preprocessing deteriorates the accuracy of Urdu test data with diacritics and does not have any effect on Urdu test data without diacritics.",
        "Hindi Language Model",
        "Preprocessed UHT-FSM Hindi outputs of the test of Section 4.3 were passed to the Hindi Word Language Model that produced final Hindi outputs with the help of the Hindi Word Map.",
        "Results are given in Table 6, row 4.",
        "They show that the Hindi Word Language Model increases the accuracy by 5.1% and 18.3% when compared with the accuracy of UHT-FSM and UHT-FSM + Preprocessing tests respectively, for the Urdu test data with diacritical marks.",
        "For the Urdu test data without diacritical marks, the Hindi Word Language Model increases the accuracy rate by 28.3% in comparison to the accuracy of the UHT-FSM output (whether preprocessed or not).",
        "All outputs of tests of Sections 4.1, 4.2, 4.3 and 4.4 and the Hindi reference are processed to calculate the character level accuracy and error rates.",
        "Results are given in Table 7.",
        "Urdu Test Data",
        "With diacritics",
        "Without diacritics",
        "UHT-FSM Accuracy/Error",
        "80.7% / 21.5%",
        "50.7% / 51.5%",
        "UHT-FSM + HLM",
        "82.6% / 19.6%",
        "79.1% / 23.1%",
        "UHT-FSM + PrePro",
        "67.5% / 32.4%",
        "50.7% / 51.5%",
        "UHT-FSM + PrePro + HLM",
        "85.8% / 16.4%",
        "79.1% / 23.1%",
        "Urdu Test Data",
        "With diacritics",
        "Without diacritics",
        "UHT-FSM",
        "94.1% / 6.5%",
        "77.5% / 22.6%",
        "UHT-FSM + HLM",
        "94.6% / 6.1%",
        "89.8% / 10.7",
        "UHT-FSM + PreP",
        "87.5% / 13.0%",
        "77.5% / 22.6",
        "UHT-FSM + PreP + HLM",
        "94.5% / 6.1%",
        "89.8% / 10.7",
        "The Hindi Word Language Model increases the accuracy of Urdu Hindi transliteration, especially for the Urdu input without diacritical marks.",
        "Consider the examples of Figure 7.",
        "Figure 1 is reproduced here by adding the Hindi transliteration of example sentences using the proposed hybrid transliteration model and Hindi reference.",
        "(i) # d sffH 3Tfäcfi cT5T?T dft fcC^TI t (ii) it d 35H 3TOcF cRi dt efjgi t I have not done a lot of work_",
        "Output of Hybrid Transliteration Model (ii) i d sign arfäcfi ^itr dft fCczn t",
        "Hindi Reference",
        "id sffH ari^c cii aft fCczn t",
        "(i) Center thi qr aft atfr ri3^r thi qr aft (ii) fere sal qr aft air ri^rer sar qr aft Both at the central level and at the state level Output of Hybrid Transliteration Model (i) Cbc-äü thi qr aft aftr ri3^ thi qr aft (ii) Ccfest thi qr aft aftr ri3^r thi qr aft",
        "Center Tar qr aft aftr ri3^r thi qr aft",
        "By comparing Hindi outputs of Hindi Word Language Model with the Hindi reference, only the first word of (2)(ii) is wrong and other errors due to the absence of diacritical marks in the source Urdu sentences are corrected properly."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "From the test results of the previous section we can conclude that the statistical word language model increases the accuracy of Urdu to Hindi transliteration, especially for Urdu input text without diacritical marks.",
        "The proposed Hybrid Transliteration Model improves the accuracy and produces the correct Hindi output even when the crucial information in the form of diacritical marks is absent.",
        "It increases the accuracy by 28.3% in comparison to our previous Finite-state Transliteration Model.",
        "This study also shows that diacritical marks are crucial and necessary for Hindi Urdu transliteration."
      ]
    }
  ]
}
