{
  "info": {
    "authors": [
      "Sandra Kübler",
      "Erhard W. Hinrichs",
      "Wolfgang Maier"
    ],
    "book": "Conference on Empirical Methods in Natural Language Processing",
    "id": "acl-W06-1614",
    "title": "Is It Really That Difficult to Parse German?",
    "url": "https://aclweb.org/anthology/W06-1614",
    "year": 2006
  },
  "references": [
    "acl-A97-1014",
    "acl-C04-1056",
    "acl-P03-1013",
    "acl-P03-1014",
    "acl-P03-1054",
    "acl-P03-1056",
    "acl-P05-1039",
    "acl-P06-3004"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper presents a comparative study of probabilistic treebank parsing of German, using the Negra and T¨uBa-D/Z treebanks.",
        "Experiments with the Stanford parser, which uses a factored PCFG and dependency model, show that, contrary to previous claims for other parsers, lexical-ization of PCFG models boosts parsing performance for both treebanks.",
        "The experiments also show that there is a big difference in parsing performance, when trained on the Negra and on the T¨uBaD/Z treebanks.",
        "Parser performance for the models trained on T¨uBa-D/Z are comparable to parsing results for English with the Stanford parser, when trained on the Penn treebank.",
        "This comparison at least suggests that German is not harder to parse than its West-Germanic neighbor language English."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "There have been a number of recent studies on probabilistic treebank parsing of German (Dubey, 2005; Dubey and Keller, 2003; Schiehlen, 2004; Schulte im Walde, 2003), using the Negra treebank (Skut et al., 1997) as their underlying data source.",
        "A common theme that has emerged from this research is the claim that lexicalization of PCFGs, which has been proven highly beneficial for other languages1, is detrimental for parsing accuracy of German.",
        "In fact, this assumption is by now so widely held that Schiehlen (2004) does not even consider lexicalization as a possible",
        "parameter and concentrates instead only on treebank transformations of various sorts in his experiments.",
        "Another striking feature of all studies mentioned above are the relatively low parsing F-scores achieved for German by comparison to the scores reported for English, its West-Germanic neighbor, using similar parsers.",
        "This naturally raises the question whether German is just harder to parse or whether it is just hard to parse the Negra treebank.",
        "The purpose of this paper is to address precisely this question by training the Stanford parser (Klein and Manning, 2003b) and the LoPar parser (Schmid, 2000) on the two major treebanks available for German, Negra and T¨uBa-D/Z, the T¨ubingen treebank of written German (Telljohann et al., 2005).",
        "A series of comparative parsing experiments that utilize different parameter settings of the parsers is conducted, including lexicalization and markovization.",
        "These experiments show striking differences in performance between the two treebanks.",
        "What makes this comparison interesting is that the treebanks are of comparable size and are both based on a newspaper corpus.",
        "However, both treebanks differ significantly in their syntactic annotation scheme.",
        "Note, however, that our experiments concentrate on the original (context-free) annotations of the treebank.",
        "The structure of this paper is as follows: section 2 discusses three characteristic grammatical features of German that need to be taken into account in syntactic annotation and in choosing an appropriate parsing model for German.",
        "Section 3 introduces the Negra and T¨uBa-D/Z treebanks and",
        "discusses the main differences between their annotation schemes.",
        "Section 4 explains the experimental setup, sections 5-7 the experiments, and section 8 discusses the results."
      ]
    },
    {
      "heading": "2 Grammatical Features of German",
      "text": [
        "There are three distinctive grammatical features that make syntactic annotation and parsing of German particularly challenging: its placement of the finite verb, its flexible phrasal ordering, and the presence of discontinuous constituents.",
        "These features will be discussed in the following subsections."
      ]
    },
    {
      "heading": "2.1 Finite Verb Placement",
      "text": [
        "In German, the placement of finite verbs depends on the clause type.",
        "In non-embedded assertion clauses, the finite verb occupies the second position in the clause, as in (1a).",
        "In yes/no questions, as in (1b), the finite verb appears clause-initially, whereas in embedded clauses it appears clause finally, as in (1c).",
        "c. dass Peter das Buch gelesen haben wird.",
        "that Peter the book read have will",
        "’... that Peter will have read the book.’ Regardless of the particular clause type, any cluster of non-finite verbs, such as gelesen haben in (1a) and (1b) or gelesen haben wird in (1c), appears at the right periphery of the clause.",
        "The discontinuous positioning of the verbal elements in verb-first and verb-second clauses is the traditional reason for structuring German clauses into so-called topological fields (Drach, 1937; Erdmann, 1886; H¨ohle, 1986).",
        "The positions of the verbal elements form the Satzklammer (sentence bracket) which divides the sentence into a Vorfeld (initial field), a Mittelfeld (middle field), and a Nachfeld (final field).",
        "The Vorfeld and the Mittelfeld are divided by the linke Satzklammer (left sentence bracket), which is realized by the finite verb or (in verb-final clauses) by a comple-mentizer field.",
        "The rechte Satzklammer (right sentence bracket) is realized by the verb complex and consists of verbal particles or sequences of verbs.",
        "This right sentence bracket is positioned between the Mittelfeld and the Nachfeld.",
        "Thus, the theory of topological fields states the fundamental regularities of German word order.",
        "The topological field structures in (2) for the examples in (1) illustrate the assignment of topological fields for different clause types.",
        "(2a) and (2b) are made up of the following fields: LK (for: linke Satzklammer) is occupied by the finite verb.",
        "MF (for: Mittelfeld) contains adjuncts and complements of the main verb.",
        "RK (for: rechte Satzklammer) is realized by the verbal complex (VC).",
        "Additionally, (2a) realizes the topological field VF (for: Vorfeld), which contains the sentence-initial constituent.",
        "The left sentence bracket (LK) in (2c) is realized by a complemen-tizer field (CF) and the right sentence bracket (RK) by a verbal complex (VC) that contains the finite verb wird."
      ]
    },
    {
      "heading": "2.2 Flexible Phrase Ordering",
      "text": [
        "The second noteworthy grammatical feature of German concerns its flexible phrase ordering.",
        "In (3), any of the three complements and adjuncts of the main verb (ge)lesen can appear sentence-initially.",
        "In addition, the ordering of the elements that occur in the Mittelfeld is also free so that there are two possible linearizations for each of the examples in (3a) - (3b), yielding a total of six distinct orderings for the three complements and adjuncts.",
        "Due to this flexible phrase ordering, the grammatical functions of constituents in German, unlike for English, cannot be deduced from the constituents’ location in the tree.",
        "As a consequence, parsing approaches to German need to be based on treebank data which contain a combination of constituent structure and grammatical functions – for parsing and evaluation."
      ]
    },
    {
      "heading": "2.3 Discontinuous Constituents",
      "text": [
        "A third characteristic feature of German syntax that is a challenge for syntactic annotation and for parsing is the treatment of discontinuous constituents.",
        "(4) Der Mann hat gestern den Roman gelesen, The man has yesterday the novel read den ihm Peter empfahl.",
        "’Yesterday the man read the novel which Peter recommended to him.’",
        "(5) Peter soll dem Mann empfohlen haben, den Peter is to the man recommended have the Roman zu lesen.",
        "novel to read ’Peter is said to have recommended to the man to read the novel.’ (4) shows an extraposed relative clause which is separated from its head noun den Roman by the non-finite verb gelesen.",
        "(5) is an example of an extraposed non-finite VP complement that forms a discontinuous constituent with its governing verb empfohlen because of the intervening non-finite auxiliary haben.",
        "Such discontinuous structures occur frequently in both treebanks and are handled differently in the two annotation schemes, as will be discussed in more detail in the next section."
      ]
    },
    {
      "heading": "3 The Negra and the T¨uBa-D/Z Treebanks",
      "text": [
        "Both treebanks use German newspapers as their data source: the Frankfurter Rundschau newspaper for Negra and the ’die tageszeitung’ (taz) newspaper for T¨uBa-D/Z.",
        "Negra comprises 20 000 sentences, T¨uBa-D/Z 15 000 sentences.",
        "There is evidence that the complexity of sentences in both treebanks is comparable: sentence length as well as the percentage of clause nodes per sentence is comparable.",
        "In Negra, a sentence is 17.2 words long, in T¨uba-D/Z, 17.5 words.",
        "Negra has an average of 1.4 clause nodes per sentence, T¨uBa-D/Z 1.5 clause nodes.",
        "Both treebanks use an annotation framework that is based on phrase structure grammar and that is enhanced by a level of predicate-argument structure.",
        "Annotation for both was performed semi-automatically.",
        "Despite all these similarities, the treebank annotations differ in four important aspects: 1) Negra does not allow unary branching whereas T¨uBa-D/Z does; 2) in Negra, phrases receive a flat annotation whereas T¨uBa-D/Z uses phrase internal structure; 3) Negra uses crossing branches to represent long-distance relationships whereas T¨uBa-D/Z uses a pure tree structure combined with functional labels to encode this information; 4) Negra encodes grammatical functions in a combination of structural and functional labeling whereas T¨uBa-D/Z uses a combination of topological fields functional labels, which results in a flatter structure on the clausal level.",
        "The two treebanks also use different notions of grammatical functions: T¨uBa-D/Z defines 36 grammatical functions covering head and non-head information, as well as subcategorization for complements and modifiers.",
        "Negra utilizes 48 grammatical functions.",
        "Apart from commonly accepted grammatical functions, such as SB (subject) or OA (accusative object), Negra grammatical functions comprise a more extended notion, e.g. RE (repeated element) or RC (relative clause).",
        "(6) Diese Metapher kann die Freizeitmalerin This metaphor can the amateur painter durchaus auch auf ihr Leben anwenden.",
        "by all means also to her life apply.",
        "’The amateur painter can by all means apply this metaphor also to her life.’ Figure 1 shows a typical tree from the Negra treebank for sentence (6).",
        "The syntactic categories are shown in circular nodes, the grammatical functions as edge labels in square boxes.",
        "A major",
        "phrasal category that serves to structure the sentence as a whole is the verb phrase (VP).",
        "It contains non-finite verbs (here: anwenden) together with their complements (here: the accusative object Diese Metapher) and adjuncts (here: the adverb durchaus and the PP modifier auch auf ihr Leben).",
        "The subject NP (here: die Freizeitmalerin) stands outside the VP and, depending on its linear position, leads to crossing branches with the VP.",
        "This happens in all cases where the subject follows the finite verb as in Figure 1.",
        "Notice also that the PP is completely flat and does not contain an internal NP.",
        "Another phenomenon that leads to the introduction of crossing branches in the Negra treebank are discontinuous constituents of the kind illustrated in section 2.3.",
        "Extraposed relative clauses, as in (4), are analyzed in such a way that the relative clause constituent is a sister of its head noun in the Negra tree and crosses the branch that dominates the intervening non-finite verb gelesen.",
        "The crossing branches in the Negra treebank cannot be processed by most probabilistic parsing models since such parsers all presuppose a strictly context-free tree structure.",
        "Therefore the Negra trees must be transformed into proper trees prior to training such parsers.",
        "The standard approach for this transformation is to reattach crossing non-head constituents as sisters of the lowest mother node that dominates all constituents in question in the original Negra tree.",
        "Figure 2 shows the result of this transformation of the tree in Figure 1.",
        "Here, the fronted accusative object Diese Metapher is reattached on the clause level.",
        "Crossing branches do not only arise with respect to the subject at the sentence level but also in cases of extraposition and fronting of partial constituents.",
        "As a result, approximately 30% of all Negra trees contain at least one crossing branch.",
        "Thus, tree transformations have a major impact on the type of constituent structures that are used for training probabilistic parsing models.",
        "Previous work, such as Dubey (2005), Dubey and Keller (2003), and Schiehlen (2004), uses the version of Negra in which the standard approach to resolving crossing branches has been applied.",
        "(7) Den vorigen Sonntag h¨atte Frank Michael The previous Sunday would have Frank Michael Nehr am liebsten aus dem Kalender gestrichen.",
        "Nehr preferably from the calendar deleted.",
        "’Frank Michael Nehr would rather have deleted the previous Sunday from the calendar.’ Figure 3 shows the T¨uBa-D/Z annotation for sentence (7), a sentence with almost identical phrasal ordering to sentence (6).",
        "Crossing branches are avoided by the introduction of topo",
        "logical structures (here: VF, MF and VC) into the tree.",
        "Notice also that compared to the Negra annotation, T¨uBa-D/Z introduces more internal structure into NPs and PPs.",
        "(8) F¨ur diese Behauptung hat Beckmeyer bisher For this claim has Beckmeyer yet keinen Nachweis geliefert.",
        "no evidence provided.",
        "’For this claim, Beckmeyer has not provided evidence yet.’ In T¨uBa-D/Z, long-distance relationships are represented by a pure tree structure and specific functional labels.",
        "Figure 4 shows the T¨uBa-D/Z annotation for sentence (8).",
        "In this sentence, the prepositional phrase F¨ur diese Behauptung is fronted.",
        "Its functional label (OA-MOD) provides the information that it modifies the accusative object (OA) keinen Nachweis."
      ]
    },
    {
      "heading": "4 Experimental Setup",
      "text": [
        "The main goals behind our experiments were twofold: (1) to reinvestigate the claim that lexicalization is detrimental for treebank parsing of German, and (2) to compare the parsing results for the two German treebanks.",
        "To investigate the first issue, the Stanford Parser (Klein and Manning, 2003b), a state-of-the-art probabilistic parser, was trained with both lexical-ized and unlexicalized versions of the two treebanks (Experiment I).",
        "For lexicalized parsing, the Stanford Parser provides a factored probabilistic model that combines a PCFG model with a dependency model.",
        "For the comparison between the two treebanks, two types of experiments were performed: a purely constituent-based comparison using both the Stanford parser and the pure PCFG parser LoPar (Schmid, 2000) (Experiment II), and an in-depth evaluation of the three major grammatical functions subject, accusative object, and dative object, using the Stanford parser (Experiment III).",
        "All three experiments use gold POS tags extracted from the treebanks as parser input.",
        "All parsing results shown below are averaged over a tenfold cross-validation of the test data.",
        "Experiments I and II used versions of the treebanks that excluded grammatical information, thus only contained constituent labeling.",
        "For Experiment III, all syntactic labels were extended by their grammatical function (e.g NX-ON for a subject NP in T¨uBa-D/Z or NP-SB for a Negra subject).",
        "Experiments I and II included all sentences of a maximal length of 40 words.",
        "Due to memory limitations (7 GB), Experiment III had to be restricted to sentences of a maximal length of 35 words."
      ]
    },
    {
      "heading": "5 Experiment I: Lexicalization",
      "text": [
        "Experiment I investigates the effect of lexicalization on parser performance for the Stanford Parser.",
        "The results, summarized in Table 1, show that lexicalization improves parser performance for both the Negra and the T¨uBa-D/Z treebank in comparison to unlexicalized counterpart models: for labeled bracketing, an F-score improvement from 86.48 to 88.88 for T¨uBa-D/Z and an improvement from 66.92 to 67.13 for Negra.",
        "This directly contradicts the findings reported by Dubey and Keller (2003) that lexicalization has a negative effect on probabilistic parsing models for German.",
        "We therefore conclude that these previous claims, while valid for particular configurations of",
        "parsers and parameters, should not be generalized to claims about probabilistic parsing of German in general.",
        "Experiment I also shows considerable differences in the overall scores between the two treebanks, with the F-scores for T¨uBa-D/Z parsing approximating scores reported for English, but with Negra scores lagging behind by an average margin of appr.",
        "20 points.",
        "Of course, it is important to note that such direct comparisons with English are hardly possible due to different annotation schemes, different underlying text corpora, etc.",
        "Nevertheless, the striking difference in parser performance between the two German treebanks warrants further attention.",
        "Experiments II and III will investigate this matter in more depth."
      ]
    },
    {
      "heading": "6 Experiment II: Different Parsers",
      "text": [
        "The purpose of Experiment II is to rule out the possibility that the differences in parser performance for the two German treebanks produced by Experiment I may just be due to using a particular parser – in this particular case the hybrid PCFG and dependency model of the Stanford parser.",
        "After all, Experiment I also yielded different results concerning the received wisdom about the utility of lexicalization from previously reported results.",
        "In order to obtain a broader experimental base, un-lexicalized models of the Stanford parser and the pure PCFG parser LoPar were trained on both treebanks.",
        "In addition we experimented with two different parameter settings of the Stanford parser, onewithandonewithoutmarkovization.Theex-perimentwithmarkovizationusedparentinforma-tion(v=1)andasecondorderMarkovmodelforhorizontalmarkovization(h=2).Theresults,sum-marizedinTable2,showthatparsingresultsforallunlexicalizedexperimentsshowroughlythesame20pointdifferenceinF-scorethatwereobtainedforthelexicalizedmodelsinExperimentI.Wecanthereforeconcludethatthedifferenceinpars-ingperformanceisrobustacrosstwoparserswithdifferentparametersettings,suchaslexicalizationandmarkovization.ExperimentIIalsoconfirmsthefindingofKleinandManning(2003a)andofSchiehlen(2004)thathorizontalandverticalmarkovizationhasapos-itiveeffectonparserperformance.",
        "Notice also that markovization with unlexicalized grammars yields almost the same improvement as lexicalization does in Experiment I.",
        "ist l¨angst weiter.",
        "is already further that are at the same time the most comparable for the two treebanks.",
        "These are the functions of subject (encoded as SB in Negra and as ON in T¨uBaD/Z), accusative object (OA), and dative object (DA in Negra and OD in T¨uBa-D/Z).",
        "Once again, the results are consistently better for T¨uBa-D/Z (cf. lines 3-5 in Table 3), with subjects yielding the highest results (71.08 vs. 55.12 F-score) and dative objects the lowest results (14.07 vs. 5.00).",
        "The latter results must be attributed to data sparseness, dative object occur only appr.",
        "1 000 times in each treebank while subjects occur more than 15 000 times."
      ]
    },
    {
      "heading": "8 Discussion",
      "text": [
        "The experiments presented in sections 5-7 show that there is a difference in results of appr.",
        "20% between Negra and T¨uBa-D/Z.",
        "This difference is consistent throughout, i.e. with different parsers, under lexicalization and markovization.",
        "These results lead to the conjecture that the reasons for these differences must be sought in the differences in the annotation schemes of the two treebanks.",
        "In section 3, we showed that one of the major differences in annotation is the treatment of discontinuous constituents.",
        "In Negra, such constituents are annotated via crossing branches, which have to be resolved before parsing.",
        "In such cases, constituents are extracted from their mother constituents and reattached at higher constituents.",
        "In the case of the discontinuous VP in Figure 1, it leads to a VP rule with the following daughters: head (HD) and modifier (MO), while the accusative object is directly attached at the sentence level as a sister of the VP.",
        "This conversion leads to inconsistencies in the training data since the annotation scheme requires that object NPs are daughters of the VP rather than of S. The inconsistency introduced by tree conversion are considerable since they cover appr.",
        "30% of all Negra trees (cf. section 3).",
        "One possible explanation for the better performance of T¨uba-D/Z might be that it has more information about the correct attachment site of extraposed constituents, which is completely lacking in the context-free version of Negra.",
        "For this reason, K¨ubler (2005) and Maier (2006) tested a version of Negra which contained information of the original attachment site of these discontinuous constituents.",
        "In this version of Negra, the grammatical function OA in Figure 2 would be changed to OA VP to show that it was originally attached to the VP.",
        "Experiments with this version showed a decrease in F-score from 52.30 to 49.75.",
        "Consequently, adding this information in a similar way to the encoding of discontinuous constituents in T¨uba-D/Z harms performance.",
        "By contrast, T¨uBa-D/Z uses topological fields as the primary structuring principle, which leads to a purely context-free annotation of discontinuous structures.",
        "There is evidence that the use of topological fields is advantageous also for other parsing approaches (Frank et al., 2003; K¨ubler, 2005; Maier, 2006).",
        "Another difference in the annotation schemes concerns the treatment of phrases.",
        "Negra phrases are flat, and unary projections are not annotated.",
        "T¨uBa-D/Z always projects to the phrasal category and annotates more phrase-internal structure.",
        "The deeper structures in T¨uBa-D/Z lead to fewer rules for phrasal categories, which allows the parser a more consistent treatment of such phrases.",
        "For example, the direct attachment of one word subjects on the clausal level in Negra leads to a high number of different S rules with different POS tags for the subject phrase.",
        "An empirical proof for the assumption that flat phrase structures and the omission of unary nodes decrease parsing results is presented by K¨ubler (2005) and Maier (2006).",
        "We want to emphasize that our experiments concentrate on the original context-free annotations of the treebanks.",
        "We did not investigate the influence of treebank refinement in this study.",
        "However, we would like to note that by a combination of suffix analysis and smoothing, Dubey (2005) was able to obtain an F-score of 85.2 for Negra.",
        "For other work in the area of treebank refinement using the German treebanks see K¨ubler (2005), Maier (2006), and Ule (2003)."
      ]
    },
    {
      "heading": "9 Conclusion and Future Work",
      "text": [
        "We have presented a comparative study of probabilistic treebank parsing of German, using the Negra and T¨uBa-D/Z treebanks.",
        "Experiments with the Stanford parser, which uses a factored PCFG and dependency model, show that, contrary to previous claims for other parsers, lexicalization of PCFG models boosts parsing performance for both treebanks.",
        "The experiments also show that there is a big difference in parsing performance, when trained on the Negra and on the T¨uBa-D/Z treebanks.",
        "This difference remains constant across",
        "lexicalized, unlexicalized (also using the LoPar parser), and markovized models and also extends to parsing of major grammatical functions.",
        "Parser performance for the models trained on T¨uBa-D/Z are comparable to parsing results for English with the Stanford parser, when trained on the Penn treebank.",
        "This comparison at least suggests that German is not harder to parse than its West-Germanic neighbor language English.",
        "Additional experiments with the T¨uBa-D/Z treebank are planned in future work.",
        "A new release of the T¨uBa-D/Z treebank has become available that includes appr.",
        "22 000 trees, instead of the release with 15 000 sentences used for the experiments reported in this paper.",
        "This new release also contains morphological information at the POS level, including case and number.",
        "With this additional information, we expect considerable improvement in grammatical function assignment for the functions subject, accusative object, and dative object, which are marked by nominative, accusative, and dative case, respectively."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We are grateful to Helmut Schmid and to Chris Manning and his group for making their parsers publicly available as well as to Tylman Ule for providing the evaluation scripts.",
        "We are also grateful to the anonymous reviewers for many helpful comments.",
        "And we are especially grateful to Roger Levy for all the help he gave us in creating the language pack for T¨uBa-D/Z in the Stanford parser."
      ]
    }
  ]
}
