{
  "info": {
    "authors": [
      "Wei Lu",
      "Hwee Tou Ng"
    ],
    "book": "EMNLP",
    "id": "acl-D11-1149",
    "title": "A Probabilistic Forest-to-String Model for Language Generation from Typed Lambda Calculus Expressions",
    "url": "https://aclweb.org/anthology/D11-1149",
    "year": 2011
  },
  "references": [
    "acl-A00-2023",
    "acl-C80-1061",
    "acl-C96-2141",
    "acl-C96-2155",
    "acl-D07-1071",
    "acl-D08-1082",
    "acl-D09-1042",
    "acl-J04-4002",
    "acl-J07-2003",
    "acl-J90-1004",
    "acl-J93-2003",
    "acl-N03-1017",
    "acl-N06-1014",
    "acl-N06-1056",
    "acl-N07-1022",
    "acl-N10-1140",
    "acl-P02-1040",
    "acl-P03-1021",
    "acl-P05-1033",
    "acl-P06-1115",
    "acl-P07-1121",
    "acl-P07-2045",
    "acl-P09-1069",
    "acl-P09-1110",
    "acl-P96-1041",
    "acl-W04-3250"
  ],
  "sections": [
    {
      "text": [
        "This paper describes a novel probabilistic approach for generating natural language sentences from their underlying semantics in the form of typed lambda calculus.",
        "The approach is built on top of a novel reduction-based weighted synchronous context free grammar formalism, which facilitates the transformation process from typed lambda calculus into natural language sentences.",
        "Sentences can then be generated based on such grammar rules with a log-linear model.",
        "To acquire such grammar rules automatically in an unsupervised manner, we also propose a novel approach with a generative model, which maps from sub-expressions of logical forms to word sequences in natural language sentences.",
        "Experiments on benchmark datasets for both English and Chinese generation tasks yield significant improvements over results obtained by two state-of-the-art machine translation models, in terms of both automatic metrics and human evaluation."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "This work focuses on the task of generating natural language sentences from their underlying meaning representations in the form of formal logical expressions (typed lambda calculus).",
        "Many early approaches to generation from logical forms make use of rule-based methods (Wang, 1980; Shieber et al., 1990), which concern surface realization (ordering and inflecting of words) but largely ignore lexical acquisition.",
        "Recent approaches start to employ corpus-based probabilistic methods, but many of them assume the underlying meaning representations are of specific forms such as variable-free tree-structured representations (Wong and Mooney, 2007a; Lu et al., 2009) or database entries (Angeli et al., 2010).",
        "While these algorithms usually work well on specific semantic formalisms, it is unclear how well they could be applied to a different semantic formalism.",
        "In this work, we propose a general probabilistic model that performs generation from underlying formal semantics in the form of typed lambda calculus expressions (we refer to them as X-expressions throughout this paper), where both lexical acquisition and surface realization are integrated in a single framework.",
        "One natural proposal is to adopt a state-of-the-art statistical machine translation approach.",
        "However, unlike text to text translation, which has been extensively studied in the machine translation community, translating from logical forms into text presents additional challenges.",
        "Specifically, logical forms such as X-expressions may have complex internal structures and variable dependencies across subexpressions.",
        "Problems arise when performing automatic acquisition of a translation lexicon, as well as performing lexical selection and surface realization during generation.",
        "In this work, we tackle these challenges by making the following contributions:",
        "• A novel forest-to-string generation algorithm: Inspired by the work of Chiang (2007), we introduce a novel reduction-based weighted binary synchronous context-free grammar formalism for generation from logical forms (X-expressions), which can then be integrated with a probabilistic forest-to-string generation algo-",
        "rithm.",
        "• A novel grammar induction algorithm: To automatically induce such synchronous grammar rules, we propose a novel generative model that establishes phrasal correspondences between logical sub-expressions and natural language word sequences, by extending a previous model proposed for parsing natural language into meaning representations (Lu et al., 2008).",
        "To our best knowledge, this is the first probabilistic model for generating sentences from the lambda calculus encodings of their underlying formal meaning representations, that concerns both surface realization and lexical acquisition.",
        "We demonstrate the effectiveness of our model in Section 5."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "The task of language generation from logical forms has a long history.",
        "Many early works do not rely on probabilistic approaches.",
        "Wang (1980) presented an approach for generation from an extended predicate logic formalism using handwritten rules.",
        "Shieber et al.",
        "(1990) presented a semantic head-driven approach for generation from logical forms based on rules written in Prolog.",
        "Shemtov (1996) presented a system for generation of multiple paraphrases from ambiguous logical forms.",
        "Langkilde (2000) presented a probabilistic model for generation from a packed forest meaning representation, without concerning lexical acquisition.",
        "Specifically, we are not aware of any prior work that handles both automatic unsupervised lexical acquisition and surface realization for generation from logical forms in a single framework.",
        "Another line of research efforts focused on the task of language generation from other meaning representation formalisms.",
        "Wong and Mooney (2007a) as well as Chen and Mooney (2008) made use of synchronous grammars to transform a variablefree tree-structured meaning representation into sentences.",
        "Lu et al.",
        "(2009) presented a language generation model using the same meaning representation based on tree conditional random fields.",
        "Angeli et al.",
        "(2010) presented a domain-independent probabilistic approach for generation from database entries.",
        "All these models are probabilistic models.",
        "Recently there are also substantial research efforts on the task of mapping natural language to meaning representations in various formalisms - the inverse task of language generation called semantic parsing.",
        "Examples include Zettlemoyer and Collins (2005; 2007; 2009), Kate and Mooney (2006), Wong and Mooney (2007b), Lu et al.",
        "(2008), Ge and Mooney (2009), as well as Kwiatkowski et al.",
        "(2010).",
        "Of particular interest is our prior work Lu et al.",
        "(2008), in which we presented a joint generative process that produces a hybrid tree structure containing words, syntactic structures, and meaning representations, where the meaning representations are in a variable-free tree-structured form.",
        "One important property of the model in our prior work is that it induces a hybrid tree structure automatically in an unsupervised manner, which reveals the correspondences between natural language word sequences and semantic elements.",
        "We extend our prior model in the next section, so as to support X-expressions.",
        "The model in turn serves as the basis for inducing the synchronous grammar rules later."
      ]
    },
    {
      "heading": "3. A Hybrid Tree",
      "text": [
        "In Lu et al.",
        "(2008), a generative model was presented to model the process that jointly generates both natural language sentences and their underlying meaning representations of a variable-free tree-structured form.",
        "The model was defined over a hybrid tree, which consists of meaning representation tokens as internal nodes and natural language words as leaves.",
        "One limitation of the hybrid tree model is that it assumes a single fixed tree structure for the meaning representation.",
        "However, X-expressions exhibit complex structures and variable dependencies, and thus it is not obvious how to represent them in a single tree structure.",
        "In this section, we present a novel X-hybrid tree model that provides the following extensions over the model of Lu et al.",
        "(2008):",
        "1.",
        "The internal nodes of a meaning representation tree involve X-expressions which are not necessarily of variable-free form;",
        "2.",
        "The meaning representation has a packed forest representation, rather than a single deterministic tree structure.",
        "We represent a X-expression with a packed forest of meaning representation trees (called X-meaning for est).",
        "Multiple different meaning representation trees (called X-meaning trees) can be extracted from the same X-meaning forest, but they all convey equivalent semantics via reductions, as discussed next.",
        "Constructing a X-meaning forest for a given X-expression requires decomposition of a complete X-expression into semantically complete and syntactically correct sub-expressions in a principled manner.",
        "This can be achieved with a process called higher order unification (Huet, 1975).",
        "The process was known to be very complex and was shown to be undecidable in unrestricted form (Huet, 1973).",
        "Recently a restricted form of higher order unification was applied to a semantic parsing task (Kwiatkowski et al., 2010).",
        "In this work, we employ a similar technique for building the X-meaning forest.",
        "For a given X-expression e, our algorithm finds either two expressions h and f such that (h f ) = e, or three expressions h, f, and g such that ((h f ) g) = e, where the symbol = is interpreted as a-equivalent after reductions (Barendregt, 1985).",
        "We then build the X-meaning forest based on the expressions h, f, and g. In practice, we develop a BUILDFOREST(e) procedure which recursively builds X-forests by applying restricted higher-order unification rules on top of the X-expression e. Each node of the X-forest is called a X-production, to which we will give more details in Section 3.2.",
        "For example, once a candidate triple (h, f, g) as in ((h f) g) = e has been identified, the procedure creates a X-forest with the root node being a X-production involving h, and two sets of child X-forests given by BUILDFOREST(f) and BUILDFOREST(g) respectively.",
        "For restricted higher-order unification, besides the similar assumptions made by Kwiatkowski et al.",
        "(2010), we also impose one additional assumption: limited free variable, which states that the expression h must contain no more than one free variable.",
        "Note that this process provides a semantically equivalent packed forest representation of the original X-expression, without altering its semantics in any way.",
        "ample, the expression Xx.state(x) A loc(6osion, x) can be represented as the functional application form of [Xf.Xx.f (x) A loc(6osion, x)] < Xx.state(x).",
        "Such a packed forest representation contains exponentially many tree structures which all convey the same semantics.",
        "We believe such a semantic representation is more advantageous than the single fixed tree-structured representation.",
        "In fact, one could intuitively regard a different decomposition path as a different way of interpreting the same semantics.",
        "Thus, such a representation could potentially accommodate a wider range of natural language expressions, which all share the same semantics but with very different word choices, phrase orderings, and syntactic structures (like paraphrases).",
        "It may also alleviate the non-isomorphism issue that was commonly faced by researchers when mapping meaning representations and sentences (Wong and Mooney, 2007b).",
        "We will validate our belief later through experiments.",
        "Figure 1: The joint generative process of both A-meaning tree and its corresponding natural language sentence, which results in a A-hybrid tree.",
        "The generative process for a sentence together with its corresponding X-meaning tree is illustrated in Figure 1, which results in a X-hybrid tree.",
        "Internal nodes of a X-hybrid tree are called X-productions, which are building blocks of a X-forest.",
        "Each X-production in turn has at most two child X-productions.",
        "A X-production has the form ra : na < Tb, where Ta is the expected type after type evaluation of the terms to its right, na is a X-expression (serves as the functor), and Tb are types of the child X-productions (as the arguments).",
        "The leave nodes",
        "For better readability, we introduce the symbol < as an alternative notation for functional application.",
        "In other words, h < f refers to (h f ) or h(f ), and h < f < g refers to ((h f ) g).",
        "For ex-",
        "the states states that : miss-v runs through the mississippi",
        "Figure 2: One example A-hybrid tree for the sentence \"give me the states bordering states that the mississippi runs through\" together with its logical form \"Axo.state(xo) A 3xl.",
        "[loc(miss-r,xl) A state(xl) A nextJto(xl, xo)]\".",
        "w are contiguous word sequences.",
        "The model repeatedly generates X-hybrid sequences, which consist of words intermixed with X-productions, from each X-production at different levels.",
        "Consider part of the example X-hybrid tree in Figure 2.",
        "The probability associated with generation of the subtree that spans the sub-sentence \"that the mississippi runs through\" can be written as:",
        "P (^Ax.loc(missjr, x), that the mississippi runs through",
        "where p1 = e : miss_r.",
        "Following the work of Lu et al.",
        "(2008), the generative process involves three types of parameters Ö = (0, p}: 1) pattern parameters 0, which model in what way the words and child X-productions are intermixed; 2) emission parameters which model the generation process of words from X-productions, where either a unigram or a bigram assumption can be made (Lu et al., 2008); and 3) meaning representation (MR) model parameters p, which model the generation process from one X-production to its child X-productions.",
        "An analogous inside-outside algorithm (Baker, 1979) used there is employed here.",
        "Since we allow a packed X-meaning forest representation rather than a fixed tree structure, the MR model parameters p in this work should be estimated with the inside-outside algorithm as well, rather than being estimated directly from the training data by simple counting, as was done in Lu et al.",
        "(2008)."
      ]
    },
    {
      "heading": "4. The Language Generation Algorithm",
      "text": [
        "Now we present the algorithm for language generation.",
        "We introduce the grammar first, followed by the features we use.",
        "Next, we present the method for grammar induction, and then discuss the decoder.",
        "We use a weighted synchronous context free grammar (SCFG) (Aho and Ullman, 1969), which was previously used in Chiang (2007) for hierarchical phrase-based machine translation.",
        "The grammar is defined as follows:",
        "where T is the type associated with the X-production pX , and hw is a sequence consisting of natural language words intermixed with types.",
        "The symbol ~ denotes the one-to-one correspondence between nonterminal occurrences (i.e., in this case types of X-expressions) in both pX and hw.",
        "We allow a maximum of two nonterminal symbols in each synchronous rule, as was also assumed in Chiang (2007), which makes the grammar a binary SCFG.",
        "Two example rules are:",
        "where the boxed indices give the correspondences between nonterminals.",
        "A derivation with the above two synchronous rules results in the following X-expression paired with its natural language counterpart:",
        "\\x.loc(miss_r, x) A state(x) , states that the mississippi runs through ) \\x.loc(missjr, x) , that the mississippi runs through^ (e, t) – ^Ax.loc(rnissjr, x) , that the mississippi runs through^)",
        "where the source side A-expression is constructed from the application Ay.Ax.loc(y, x) < miss-V followed by a reduction (ß-conversion).",
        "Assuming the A-expression to be translated is Ax.loc(miss-V,x), the above rule in fact gives one candidate translation \"that the mississippi runs through\".",
        "Following the work of Chiang (2007), we assign scores to derivations with a log-linear model, which are essentially weighted products of feature values.",
        "For generality, we only consider the following four simple features in this work:",
        "2.",
        "3.",
        "4.",
        "where v G D refers to a rule v that appears in the derivation D, ss is the target side (sentence) associated with the derivation D, and fi is a rule-specific feature (one of features 1-3 above) which is weighted with wi.",
        "The language model feature is weighted with wLM.",
        "Once the feature values are computed, our goal is to find the optimal weight vector W* that maximizes a certain evaluation metric when used for decoding, as we will discuss in Section 4.4.",
        "Following popular approaches to learning feature weights in the machine translation community (Och and Ney, 2004; Chiang, 2005), we use the minimum error rate training (MERT) (Och, 2003) algorithm to learn the feature weights that directly optimize certain automatic evaluation metric.",
        "Specifically, the Z-MERT (Zaidan, 2009) implementation of the algorithm is used in this work.",
        "Automatic induction of the grammar rules as described above from training data (which consists of pairs of A-expressions and natural language sentences) is a challenging task.",
        "Current state-of-the-art string-based translation systems (Koehn et al., 2003; Chiang, 2005; Galley and Manning, 2010) typically begin with a word-aligned corpus to construct phrasal correspondences.",
        "Word-alignment information can be estimated from alignment models, such as the IBM alignment models (Brown et al., 1993) and HMM-based alignment models (Vogel et al., 1996; Liang et al., 2006).",
        "However, unlike texts, logical forms have complex internal structures and variable dependencies across sub-expressions.",
        "It is not obvious how to establish alignments between logical terms and texts with such alignment models.",
        "Fortunately, the generative model for A-hybrid tree introduced in Section 3 explicitly models the mappings from A-sub-expressions to (possibly discontiguous) word sequences with a joint generative process.",
        "This motivates us to extract grammar rules from the A-hybrid trees.",
        "Thus, we first find the Viterbi A-hybrid trees for all training instances,",
        "1. p(hw\\p\\): the relative frequency estimate of a hybrid sequence hw given the A-production p\\; p(px\\hw,t): the relative frequency estimate of a A-production p\\ given the phrase hw and the type t ; exp( – wc(hw)): the number of words generated, where wc(hw) refers to the number of words in hw (i.e., word penalty); and Plm(s): the language model score of the generated sentence s. The first three features, which are also widely used in state-of-the-art machine translation models (Koehn et al., 2003; Chiang, 2007), are rule-specific and thus can be computed before decoding.",
        "The last feature is computed during the decoding phase in combination with the sibling rules used.",
        "We score a derivation D with a log-linear model:",
        ": \"states that eg runs through\"",
        "Figure 4: Construction of a two-level A-hybrid sequence rule via substitution and reductions from a tree fragment.",
        "Note that the subtree rooted by erg : missjr gets \"abstracted\" by its type e. The auxiliary variable y' of type e is thus introduced to facilitate the construction process.",
        "based on the learned parameters of the generative Ahybrid tree model.",
        "Next, we extract grammar rules on top of these A-hybrid trees.",
        "Specifically, we extract the following three types of synchronous grammar rules, with examples given in Figure 3:",
        "g. A-hybrid sequence rules: They are the conventional rules constructed from one A-production and its corresponding A-hybrid sequence.",
        "2.",
        "Subtree rules: These rules are constructed from a complete subtree of the A-hybrid tree.",
        "Each rule provides a mapping between a complete sub-expression and a contiguous sub-sentence.",
        "3.",
        "Two-level A-hybrid sequence rules: These rules are constructed from a tree fragment with one of its grandchild subtrees (the subtree rooted by one of its grandchild nodes) being abstracted with its type only.",
        "These rules are constructed via substitution and reductions.",
        "Figure 4 gives an example based on a tree fragment of the A-hybrid tree in Figure 2.",
        "Note that the first step makes use of the auxiliary variable y' of type e to represent the grandchild subtree.",
        "Ay' is introduced so as to allow any A-expression of type e serving as this expression's argument to replace y'.",
        "In fact, if the semantics conveyed by the grandchild subtree serves as its argument, we will obtain the exact complete semantics of the current subtree.",
        "As we can see, the resulting rule is more general, and is able to capture longer structural dependencies.",
        "Such rules are thus potentially more useful.",
        "The overall algorithm for learning the grammar rules is sketched in Figure 5.",
        "Our goal in decoding is to find the most probable sentence s for a given A-expression e:",
        "s = si arg max w(D) I",
        "where e(D) refers to the source side (A-expression) of the derivation D, and s(D) refers to the target side (natural language sentence) of D.",
        "A conventional CKY-style decoder as used by Chiang (2007) is not applicable to this work since the source side does not exhibit a linear structure.",
        "As discussed in Section 3.g, A-expressions are represented as packed A-meaning forests.",
        "Thus, in this work, we make use of a bottom-up dynamic programming chart-parsing algorithm that works directly on translating forest nodes into target natural language words.",
        "The algorithm is similar to that of Langkilde (2000) for generation from an underlying packed semantic forest.",
        "Language models are incorporated when scoring the n-best candidates at each forest node, where the cube-pruning algorithm of Chiang (2007) is used.",
        "In order to accommodate type 2 and type 3 rules as discussed in Section 4.3, whose source side A-productions are not present in the nodes of the original A-meaning forest, new A-productions are created (via substitution and reductions) and attached to the original A-meaning forest.",
        "Procedures",
        "• f – BUILDFOREST(e)",
        "It takes in a A-expression e and outputs its A-meaning forest f. (Sec.",
        "3.g)",
        "• é> – TRAINGENMODEL(f, s)",
        "It takes in A-meaning forest-sentence pairs (f, s), performs EM training of the generative model, and outputs the parameters 9.",
        "(Sec.",
        "3.2)",
        "• h – FINDHYBRIDTREE(f, s,9)",
        "It finds the most probable A-hybrid tree h containing the given f-s pair, under the generative model parameters 9 .",
        "(Sec.",
        "4.3)",
        "• Th – ExtractRules (h)",
        "It takes in a A-hybrid tree h, and extracts a set of grammar rules Th out of it.",
        "(Sec.",
        "4.3) Algorithm"
      ]
    },
    {
      "heading": "1.. Inputs and initializations:",
      "text": []
    },
    {
      "heading": "2.. Learn the grammar:",
      "text": [
        "• For each ei e e, find its A-meaning forest: fi = BuILDFoREST(ei).",
        "This gives the set",
        "(f, s).",
        "• Learn the generative model parameter :",
        "Ö* = TRAINGENMODEL(f, s).",
        "• For each (fi; si) e (f, s), find the most probable A-hybrid tree hi, and then extract the grammar rules from it:",
        "hi = FINDHYBRIDTREE(fi,si,ö*) T = T U EXTRACTRULES(hi)",
        "3.",
        "Output the learned grammar rule set T. Figure 5: The algorithm for learning the grammar rules"
      ]
    },
    {
      "heading": "5. Experiments",
      "text": [
        "For experiments, we evaluated on the Geoquery dataset, which consists of 880 queries on U.S. geography.",
        "The dataset was manually labeled with A-expressions as their semantics in Zettlemoyer and Collins (2005).",
        "It was used in many previous research efforts on semantic parsing (Zettlemoyer and Collins, 2005; Wong and Mooney, 2006; Zettlemoyer and Collins, 2007; Kwiatkowski et al., 2010).",
        "The original dataset was annotated with English sentences only.",
        "In order to assess the generation performance across different languages, in our work the entire dataset was also manually annotated with Chinese by a native Chinese speaker with linguistics background.",
        "For all the experiments we present in this section, we use the same split as that of Kwiatkowski et al.",
        "(2010), where 280 instances are used for testing, and the remaining instances are used for learning.",
        "We further split the learning set into two portions, where 500 instances are used for training the models, which includes induction of grammar rules, training a language model, and computing feature values, and the remaining 100 instances are used for tuning the feature weights.",
        "As we have mentioned earlier, we are not aware of any previous work that performs generation from formal logical forms that concerns both lexical acquisition and surface realization.",
        "The recent work by Angeli et al.",
        "(2010) presented a generation system from database records with an additional focus on content selection (selection of records and their subfields for generation).",
        "It is not obvious how to adopt their algorithm in our context where content selection is not required but the more complex logical semantic representation is used as input.",
        "Other earlier approaches such as the work of Wang (1980) and Shieber et al.",
        "(1990) made use of rule-based approaches without automatic lexical acquisition.",
        "We thus compare our system against two state-of-the-art machine translation systems: a phrase-based translation system, implemented in the Moses toolkit (Koehn et al., 2007), and a hierarchical phrase-based translation system, implemented in the Joshua toolkit (Li et al., 2009), which is a reimplementation of the original Hiero system (Chiang, 2005; Chiang, 2007).",
        "The state-of-the-art unsupervised Berkeley aligner (Liang et al., 2006) with default setting is used to construct word alignments.",
        "We train a trigram language model with modified Kneser-Ney smoothing (Chen and Goodman, 1996) from the training dataset using the SRILM toolkit (Stolcke, 2002), and use the same language model for all three systems.",
        "We use an n-best list of size 100 for all three systems when performing MERT.",
        "For automatic evaluation, we measure the original IBM BLEU score (Papineni et al., 2002) (4-gram precision with brevity penalty) and the TER score (Snover et al., 2006) (the amount of edits required to change a system output into the reference).",
        "Note that TER measures the translation error rate, thus a smaller score indicates a better result.",
        "For clarity, we report 1 – TER scores.",
        "Following the tuning procedure as conducted in Galley and Manning (2010), we perform MERT using BLEU as the metric.",
        "We compare our model against state-of-the-art statistical machine translation systems.",
        "As a baseline, we first conduct an experiment with the following naive approach: we treat the A-expressions as plain texts.",
        "All the bound variables (e.g., x in Ax.state(x)) which do not convey semantics are removed, but free variables (e.g., state in Ax.state(x)) which might convey semantics are left intact.",
        "Quantifiers and logical connectives are also left intact.",
        "While this naive approach might not appear very sensible, we merely want to treat it as our simplest baseline.",
        "Alternatively, analogous to the work of Wong and Mooney (2007a), we could first parse the A-expressions into binary tree structures with a deterministic procedure, and then linearize the tree structure as a sequence.",
        "Since there exists different ways to linearize a binary tree, we consider preorder, inorder, and postorder traversal of the trees, and linearize them in these three different ways.",
        "As for our system, during the grammar learning phase, we initialize the generative model parameters with output from the IBM alignment model 1 (Brown et al., 1993), and run the A-hybrid tree generative model with the unigram emission assumption for 10 iterations, followed by another 10 iterations with the bigram assumption.",
        "Grammar rules are then extracted based on the A-hybrid trees obtained from such learned generative model parameters.",
        "Since MERT is prone to search errors, we run each experiment 5 times with randomly initialized feature weights, and report the averaged scores.",
        "Experimental results for both English and Chinese are presented in Table 1.",
        "As we can observe, the way that a meaning representation tree is linearized has a significant impact on the translation performance.",
        "Interestingly, for both Moses and Joshua, the pre-order setting yields the best performance for English, whereas it is inorder that yields the best performance for Chinese.",
        "This is perhaps due to the fact that Chinese presents a very different syntactic structure and word ordering from English.",
        "Our system, on the other hand, employs a packed forest representation for A-expressions.",
        "Therefore, it eliminates the ordering constraint by encompassing exponentially many possible tree structures during both the alignment and decoding stage.",
        "As a result, our system obtains significant improvements in both BLEU and 1 – TER using the significance test under the paired bootstrap resampling method of Koehn (2004).",
        "We obtain p < 0.01 for all cases, except when comparing against Joshua-preorder for English, where we obtain p < 0.05 for both metrics.",
        "Table 1: Performance on generating English and Chinese from A-expressions with automatic evaluation metrics (we report percentage scores).",
        "We also conducted human evaluation with 5 evaluators each on English and Chinese.",
        "We randomly selected about 50% (139) test instances and obtained output sentences from the three systems.",
        "Moses and Joshua were run with the top-performing settings in terms of automatic metrics (i.e., preorder for English and inorder for Chinese).",
        "Following Angeli et al.",
        "(2010), evaluators are instructed to give scores based on language fluency and semantic correctness, on the following scale:",
        "For each test instance, we first randomly shuffled the output sentences of the three systems, and presented them together with the correct reference to the evaluators.",
        "The evaluators were then asked to score all the output sentences at once.",
        "This evaluation process not only ensures that the annotators have no access to which system generated the out-",
        "English",
        "Chinese",
        "Bleu",
        "1-Ter",
        "Bleu",
        "1-Ter",
        "text",
        "48.93",
        "61.08",
        "43.23",
        "51.71",
        "preorder Moses .",
        ", inorder",
        "51.13",
        "63.73",
        "42.08",
        "50.43",
        "46.72",
        "57.59",
        "48.03",
        "55.29",
        "postorder",
        "44.30",
        "55.05",
        "46.36",
        "54.59",
        "text",
        "37.40",
        "48.97",
        "36.60",
        "46.20",
        "preorder Joshua .",
        ", inorder",
        "51.40",
        "64.69",
        "40.05",
        "49.70",
        "40.31",
        "50.47",
        "48.32",
        "54.64",
        "postorder",
        "31.10",
        "42.44",
        "41.31",
        "49.71",
        "This work (t)",
        "54.58",
        "67.65",
        "55.11",
        "63.77",
        "(t) w/o type 2 rules",
        "53.77",
        "66.43",
        "54.30",
        "62.49",
        "(t) w/o type 3 rules",
        "53.68",
        "66.17",
        "50.96",
        "60.13",
        "Score",
        "Language Fluency",
        "Semantic Correctness",
        "5",
        "Flawless",
        "Perfect",
        "4",
        "Good",
        "Near Perfect",
        "3",
        "Non-native",
        "Minor Errors",
        "2",
        "Disfluent",
        "Major Errors",
        "1",
        "Gibberish",
        "Completely Wrong",
        "Table 2: Human evaluation results on English and Chinese generation.",
        "Flu: language fluency; Sem: semantic correctness.",
        "put, but also minimizes bias associated with scoring different outputs for the same input.",
        "The detailed and averaged results (with one standard deviation) for human evaluation are presented in Table 2 for English and Chinese respectively.",
        "For both languages, our system achieves a significant improvement over Moses and Joshua (p < 0.01 with paired t-tests), in terms of both language fluency and semantic correctness.",
        "This set of results is important, as it demonstrates that our system produces more fluent texts with more accurate semantics when perceived by real humans.",
        "We also performed the following additional experiments.",
        "First, we attempted to increase the number of EM iterations (to 100) when training the model with the bigram assumption, so as to assess the effect of the number of EM iterations on the final generation performance.",
        "We observed similar performance.",
        "Second, in order to assess the importance of the two types of novel rules - subtree rules (type 2) and two-level A-hybrid sequence rules (type 3), we also conducted experiments without these rules for generation.",
        "Experiments show that these two types of rules are important.",
        "Specifically, type 3 rules, which are able to capture longer structural dependencies, are of particular importance for generating Chinese.",
        "Detailed results for these additional experiments are presented in Table 1.",
        "Finally, we also assess the effectiveness of our model on an alternative meaning representation formalism in the form of variable-free tree structures.",
        "Specifically, we tested on the Robocup dataset (Kuhlmann et al., 2004), which consists of 300 English instructions for coaching robots for soccer games, and a variable-free version of the Geo-query dataset.",
        "These are the standard datasets used in the generation tasks of Wong and Mooney (2007a) and Lu et al.",
        "(2009).",
        "Similar to the technique introduced in Kwiatkowski et al.",
        "(2010), our proposed algorithm could still be applied to such datasets by writing the tree-structured representations as function-arguments forms.",
        "The higher order unification-based decomposition algorithm could be applied on top of such forms accordingly.",
        "For example, midfield(opp) = Ax.midfield(x) < opp.",
        "See Kwiatkowski et al.",
        "(2010) for more details.",
        "However, since such forms present monotonous structures, and thus give less alternative options in the higher-order unification-based decomposition process, it prevents the algorithm from creating many disjunctive nodes in the packed forest.",
        "It is thus hypothesized that the advantages of the packed forest representation could not be fully exploited with such a meaning representation formalism.",
        "Following previous works, we performed 4 runs of 10-fold cross validation based on the same split as that of Wong and Mooney (2007a) and Lu et al.",
        "(2009), and measured standard Bleu percentage and Nist (Doddington, 2002) scores.",
        "For experimentation on each fold, we trained a trigram language model on the training data of that fold, and randomly selected 70% of the training data for grammar induction, with the remaining 30% for learning of the feature weights using Mert.",
        "Next, we performed grammar induction with the complete training data of that fold, and used the learned feature weights for decoding of the test instances.",
        "The averaged results are shown in Table 3. our approach outperforms the previous system Wasp-1++ (Wong and Mooney, 2007a) significantly, and achieves comparable or slightly better performance as compared to Lu et al.",
        "(2009).",
        "This set of results is particularly striking.",
        "We note",
        "English",
        "Judge E1",
        "Flu Sem",
        "Judge E2",
        "Flu Sem",
        "Judge E3",
        "Flu Sem",
        "Judge E4",
        "Flu Sem",
        "Judge E5",
        "Flu Sem",
        "Average Flu Sem",
        "Moses preorder",
        "4.56",
        "4.57",
        "4.58",
        "4.54",
        "4.52",
        "4.52",
        "4.48",
        "4.14",
        "4.28",
        "4.22",
        "4.48 ± 0.12",
        "4.40 ± 0.20",
        "Joshua preorder",
        "4.50",
        "4.43",
        "4.49",
        "4.29",
        "4.44",
        "4.36",
        "4.46",
        "4.04",
        "4.12",
        "4.06",
        "4.40 ± 0.16",
        "4.24 ± 0.18",
        "This work",
        "4.76",
        "4.73",
        "4.73",
        "4.70",
        "4.68",
        "4.60",
        "4.64",
        "4.37",
        "4.49",
        "4.44",
        "4.66 ± 0.10",
        "4.57 ± 0.16",
        "Chinese",
        "Judge C1",
        "Flu Sem",
        "Judge C2",
        "Flu Sem",
        "Judge C3",
        "Flu Sem",
        "Judge C4",
        "Flu Sem",
        "Judge C5",
        "Flu Sem",
        "Average Flu Sem",
        "Moses inorder",
        "4.38",
        "4.22",
        "3.95",
        "3.99",
        "4.01",
        "3.80",
        "4.27",
        "4.19",
        "4.09",
        "4.01",
        "4.14 ± 0.18",
        "4.04 ± 0.17",
        "Joshua inorder",
        "4.32",
        "4.04",
        "3.74",
        "3.91",
        "3.76",
        "3.55",
        "4.21",
        "4.04",
        "3.96",
        "3.97",
        "4.00 ± 0.26",
        "3.90 ± 0.21",
        "This work",
        "4.61",
        "4.47",
        "4.53",
        "4.43",
        "4.50",
        "4.31",
        "4.71",
        "4.55",
        "4.57",
        "4.32",
        "4.59 ± 0.08",
        "4.42 ± 0.10",
        "Figure 6: Sample English outputs for various datasets.",
        "For the variable-present dataset, we also show outputs from Moses and Joshua.",
        "that the algorithm of Lu et al.",
        "(2009) is capable of modeling dependencies over phrases, which gives global optimization over the sentence generated, and works by building conditional random fields (Laf-ferty et al., 2001) over trees.",
        "But the algorithm of Lu et al.",
        "(2009) is also limited to handling tree-structured meaning representation, and is therefore unable to accept inputs such as the variable version of A-expressions.",
        "our algorithm works well by introducing additional new types of synchronous rules that are able to capture longer range dependencies.",
        "Wasp-1++, on the other hand, also makes use of a synchronous parsing-based statistical machine translation approach.",
        "Their system, however, requires linearization of the tree structure for both alignment and translation.",
        "In contrast, our model directly performs alignment and translation from a packed forest representation to a sentence.",
        "As a result, though Wasp-1++ made use of additional features (lexical weights), our system yielded better performance.",
        "Sample English output sentences are given in Figure 6."
      ]
    },
    {
      "heading": "6. Conclusions and Future Work",
      "text": [
        "in this work, we presented a novel algorithm for generating natural language sentences from their underlying semantics in the form of typed lambda calculus.",
        "We tackled the problem by introducing a novel reduction-based weighted synchronous context-free grammar formalism, which allows sentence generation with a log-linear model.",
        "in addition, we proposed a novel generative model that jointly generates lambda calculus expressions and natural language sentences.",
        "The model is then used for automatic grammar induction.",
        "Empirical results show that our model outperforms state-of-the-art machine translation models, for both English and Chinese, in terms of both automatic and human evaluation.",
        "Furthermore, we have demonstrated that the model can also effectively handle inputs with a variablefree version of meaning representation.",
        "We believe the algorithm used for inducing the reduction-based synchronous grammar rules may find applications in other research problems, such as statistical machine translation and phrasal synchronous grammar induction.",
        "We are interested in exploring further along such directions in the future."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This research was done for CSIDM Project No.",
        "CSiDM-200804 partially funded by a grant from the National Research Foundation (NRF) administered by the Media Development Authority (MDA) of Singapore.",
        "We would like to thank Tom Kwiatkowski and Luke Zettlemoyer for sharing their dataset, and Omar F. Zaidan for his help with Z-",
        "MERT.",
        "Variable-present dataset",
        "A-expression :",
        "Reference : Moses : Joshua :",
        "This work :",
        "argmax(x, river(x) A 3y.",
        "[state(y) a nextJ,o(y, indias) a loc(x, y)], len(x))",
        "what is the longest river that flows through a state that borders indiana",
        "what is the states that border long indiana",
        "what is the longest river surrounding states border indiana",
        "what is the longest river in the states that border indiana",
        "A-expression : Reference : Moses : Joshua : This work :",
        "density (ix.loc(argmax(y, loc(y, usci-co) A river(y), size(y)), x) A state(x)) which is the density of the state that the largest river in the united states runs through what is the population density in lie on the state with the smallest state in the us what is the population density of states lie on the smallest state in the us what is the population density of the state with the largest river in the us",
        "Variable-free datasets",
        "A-expression : Reference : This work :",
        "populati<on(largest-<one-density (state-all))",
        "what is the population of the state with the highest population density",
        "how many people live in the state with the largest population density",
        "A-expression :",
        "Reference : This work :",
        "rule(and(bpos(fr<om-goalJine(our, jnum(n0.0, n32.0))),not(bpos(left(penalty_area(our))))),-dont(player_our(n3), intercept))",
        "player 3 should not intercept the ball if the ball is within 32 meters of our goal line and not in our left penalty area",
        "if the ball is within 32 meters from our goal line and not on the left side of our penalty area then player 3 should not",
        "intercept it",
        "Robocup",
        "Bleu Nist",
        "Geoquery Bleu Nist",
        "Wasp-1++",
        "Lu et al.",
        "(2009)",
        "This work",
        "60.22 6.8976 62.20 6.9845 62.45 7.0011",
        "53.70 6.4808 57.33 6.7459 57.62 6.6867"
      ]
    }
  ]
}
