{
  "info": {
    "authors": [
      "Hua Wu",
      "Haifeng Wang"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C04-1005",
    "title": "Improving Statistical Word Alignment With a Rule-Based Machine Translation System",
    "url": "https://aclweb.org/anthology/C04-1005",
    "year": 2004
  },
  "references": [
    "acl-J00-2004",
    "acl-J93-2003",
    "acl-J97-3002",
    "acl-P00-1056",
    "acl-P03-1012",
    "acl-P98-1004",
    "acl-W01-1406",
    "acl-W03-1610"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The main problems of statistical word alignment lie in the facts that source words can only be aligned to one target word, and that the inappropriate target word is selected because of data sparseness problem.",
        "This paper proposes an approach to improve statistical word alignment with a rule-based translation system.",
        "This approach first uses IBM statistical translation model to perform alignment in both directions (source to target and target to source), and then uses the translation information in the rule-based machine translation system to improve the statistical word alignment.",
        "The improved alignments allow the word(s) in the source language to be aligned to one or more words in the target language.",
        "Experimental results show a significant improvement in precision and recall of word alignment."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Bilingual word alignment is first introduced as an intermediate result in statistical machine translation (SMT) (Brown et al.",
        "1993).",
        "Besides being used in SMT, it is also used in translation lexicon building (Melamed 1996), transfer rule learning (Menezes and Richardson 2001), example-based machine translation (Somers 1999), etc.",
        "In previous alignment methods, some researches modeled the alignments as hidden parameters in a statistical translation model (Brown et al.",
        "1993; Och and Ney 2000) or directly modeled them given the sentence pairs (Cherry and Lin 2003).",
        "Some researchers used similarity and association measures to build alignment links (Ahrenberg et al.",
        "1998; Tufis and Barbu 2002).",
        "In addition, Wu (1997) used a stochastic inversion transduction grammar to simultaneously parse the sentence pairs to get the word or phrase alignments.",
        "Generally speaking, there are four cases in word alignment: word to word alignment, word to multi-word alignment, multi-word to word alignment, and multi-word to multi-word alignment.",
        "One of the most difficult tasks in word alignment is to find out the alignments that include multi-word units.",
        "For example, the statistical word alignment in IBM translation models (Brown et al.",
        "1993) can only handle word to word and multi-word to word alignments.",
        "Some studies have been made to tackle this problem.",
        "Och and Ney (2000) performed translation in both directions (source to target and target to source) to extend word alignments.",
        "Their results showed that this method improved precision without loss of recall in English to German alignments.",
        "However, if the same unit is aligned to two different target units, this method is unlikely to make a selection.",
        "Some researchers used preprocessing steps to identity multi-word units for word alignment (Ahrenberg et al.",
        "1998; Tiedemann 1999; Melamed 2000).",
        "The methods obtained multi-word candidates based on continuous N-gram statistics.",
        "The main limitation of these methods is that they cannot handle separated phrases and multi-word units in low frequencies.",
        "In order to handle all of the four cases in word alignment, our approach uses both the alignment information in statistical translation models and translation information in a rule-based machine translation system.",
        "It includes three steps.",
        "(1) A statistical translation model is employed to perform word alignment in two directions1 (English to Chinese, Chinese to English).",
        "(2) A rule-based English to Chinese translation system is employed to obtain Chinese translations for each English word or phrase in the source language.",
        "(3) The translation information in step (2) is used to improve the word alignment results in step (1).",
        "A critical reader may pose the question “why",
        "not use a translation dictionary to improve statistical word alignment?” Compared with a translation dictionary, the advantages of a rule-based machine translation system lie in two aspects: (1) It can recognize the multi-word units, particularly separated phrases, in the source language.",
        "Thus, our method is able to handle the multi-word alignments with higher accuracy, which will be described in our experiments.",
        "(2) It can perform word sense disambiguation and select appropriate translations while a translation dictionary can only list all translations for each word or phrase.",
        "Experimental results show that our approach improves word alignments in both precision and recall as compared with the state-of-the-art technologies."
      ]
    },
    {
      "heading": "2 Statistical Word Alignment",
      "text": [
        "Statistical translation models (Brown, et al.",
        "1993) only allow word to word and multi-word to word alignments.",
        "Thus, some multi-word units cannot be correctly aligned.",
        "In order to tackle this problem, we perform translation in two directions (English to Chinese and Chinese to English) as described in Och and Ney (2000).",
        "The GIZA++ toolkit is used to perform statistical alignment.",
        "Thus, for each sentence pair, we can get two alignment results.",
        "We use S1 and S2 to represent the alignment sets with English as the source language and Chinese as the target language or vice versa.",
        "For alignment links in both sets, we use i for English words and j for Chinese words.",
        "Where, ax (x = i, j) represents the index position of the source word aligned to the target word in position x.",
        "For example, if a Chinese word in position j is connected to an English word in position i, then aj = i.",
        "If a Chinese word in position j is connected to English words in positions i 1 and '2, then Aj _ V1,'2} ?",
        "We call an element in the alignment set an alignment link.",
        "If the link includes a word that has no translation, we call it a null link.",
        "If k(k > 1) words have null links, we",
        "Based on S1 and S2, we obtain their intersection set, union set and subtraction set.",
        "Thus, the subtraction set contains two different alignment links for each English word."
      ]
    },
    {
      "heading": "3 Rule-Based Translation System",
      "text": [
        "We use the translation information in a rule-based English-Chinese translation system3 to improve the statistical word alignment result.",
        "This translation system includes three modules: source language parser, source to target language transfer module, and target language generator.",
        "From the transfer phase, we get Chinese translation candidates for each English word.",
        "This information can be considered as another word alignment result, which is denoted as",
        "lation candidates for the k-th English word or phrase.",
        "The difference between S3 and the common alignment set is that each English word or phrase in S3 has one or more translation candidates.",
        "A translation example for the English sentence “He is used to pipe smoking.” is shown in Table 1.",
        "English Words Chinese Translations He 他 is used to 习1 pipe 烟41 MR smoking 吸, [am",
        "From Table 1, it can be seen that (1) the translation system can recognize English phrases (e.g. is used to); (2) the system can provide one or more translations for each source word or phrase; (3) the translation system can perform word selection or word sense disambiguation.",
        "For example, the word “pipe” has several meanings such as “tube”, “tube used for smoking” and “wind instrument”.",
        "The system selects “tube used for smoking” and translates it into Chinese words “烟” and “烟”.",
        "The recognized translation 3 This system is developed based on the Toshiba English-Japanese translation system (Amano et al.",
        "1989).",
        "It achieves above-average performance as compared with the English-Chinese translation systems available in the market.",
        "candidates will be used to improve statistical word alignment in the next section."
      ]
    },
    {
      "heading": "4 Word Alignment Improvement",
      "text": [
        "As described in Section 2, we have two alignment sets for each sentence pair, from which we obtain the intersection set S and the subtraction set F. We will improve the word alignments in S and F with the translation candidates produced by the rule-based machine translation system.",
        "In the following sections, we will first describe how to calculate monolingual word similarity used in our algorithm.",
        "Then we will describe the algorithm used to improve word alignment results."
      ]
    },
    {
      "heading": "4.1 Word Similarity Calculation",
      "text": [
        "This section describes the method for monolingual word similarity calculation.",
        "This method calculates word similarity by using a bilingual dictionary, which is first introduced by Wu and Zhou (2003).",
        "The basic assumptions of this method are that the translations of a word can express its meanings and that two words are similar in meanings if they have mutual translations.",
        "Given a Chinese word, we get its translations with a Chinese-English bilingual dictionary.",
        "The translations of a word are used to construct its feature vector.",
        "The similarity of two words is estimated through their feature vectors with the cosine measure as shown in (Wu and Zhou 2003).",
        "If there are a Chinese word or phrase w and a Chinese word set Z , the word similarity between them is calculated as shown in Equation (1)."
      ]
    },
    {
      "heading": "4.2 Alignment Improvement Algorithm",
      "text": [
        "As the word alignment links in the intersection set are more reliable than those in the subtraction set, we adopt two different strategies for the alignments in the intersection set S and the subtraction set F. For alignments in S, we will modify them when they are inconsistent with the translation information in S3.",
        "For alignments in F, we classify them into two cases and make selection between two different alignment links or modify them into a new link.",
        "In the intersection set S, there are only word to word alignment links, which include no multi-word units.",
        "The main alignment error type in this set is that some words should be combined into one phrase and aligned to the same word(s) in the target sentence.",
        "For example, for the sentence pair in Figure 1, “used” is aligned to the Chinese word “习”, and “is” and “to” have null links in S. But in the translation set S3, “is used to\" is a phrase.",
        "Thus, we combine the three alignment links into a new link.",
        "The words “is”, “used” and “ to” are all aligned to the Chinese word“习”, denoted as (is used to, 习).",
        "Figure 2 describes the algorithm employed to improve the word alignment in the intersection set S.",
        "(phk, w)∉ WA to WA.",
        "a) There is an element (phk , Ck) ∈ S3, and the English word i is a constituent of the phrase phk .",
        "b) The other words in the phrase phk also have alignment links in S .",
        "c) For each word s in phk , we get T = {t |(s, t) ∈ S} and combine 4 all words in T into a phrase w, and the similarity sim(w, Ck ) > δ1 .",
        "(2) Otherwise, add ( i, j) to WA.",
        "Output: Word alignment set WA",
        "In the subtraction set, there are two different links for each English word.",
        "Thus, we need to select one link or to modify the links according to the translation information in S3 .",
        "For each English word i in the subtraction set, there are two cases:",
        "is a word to word or word to multi-word alignment link (i, Ai) ∈ S2 .",
        "For Case 1, we first examine the translation set S3 .",
        "If there is an element (i, Ci ) ∈ S3, we calculate the Chinese word similarity between j in (i, j) ∈ S1 and Ci with Equation (1) shown in Section 4.1.",
        "We also combine the words in A i ( (i, Ai) ∈ S2 ) into a phrase and get the word similarity between this new phrase and Ci.",
        "The alignment link with a higher similarity score is selected and added to WA.",
        "Input: Alignment sets S 1 and S2 Translation unit ( phk , Ck ) ∈ S3",
        "(2) Combine words in T1 and T2 into phrases w1 and w2 respectively.",
        "(3) Obtain the word similarities ws1 = sim(w1,Ck) and ws2 = sim(w2,Ck) .",
        "(4) Add a new alignment link to WA according to the following steps.",
        "a) If ws1 > ws2 and ws1 > δ1 , add ( phk, w1 ) to WA; b) If ws 2 > ws1 and ws2 >δ1, add ( phk, w2) to WA;",
        "c) If ws1 = ws2 >δ1 , add (phk, w1) or (phk , w2) to WA randomly.",
        "Output: Updated alignment set WA",
        "If, in S31 there is an element (phk, Ck) and i is a constituent of phk, the English word i of the alignment links in both S1 and S2 should be",
        "sequences of this phrase are w1, w2, w3, w1w2, w2w3 .",
        "combined with other words to form phrases.",
        "In this case, we modify the alignment links into a multi-word to multi-word alignment link.",
        "The algorithm is described in Figure 3.",
        "For example, given a sentence pair in Figure 4, in S1, the word “whipped” is aligned to and “out” is aligned to “抽”.",
        "In S2, the word“whipped” is aligned to both “突” and “抽” and “out” has a null link.",
        "In S3, “whipped out” is a phrase and translated into “迅 \".",
        "And the word similarity between “突 ” and “迅l – A 出 ” is larger than the threshold δ1 .",
        "Thus, we combine the aligned target words in the Chinese sentence into “突抽 ”.",
        "The final alignment link should be (whipped out, 突 抽).",
        "Figure 4 .",
        "Multi-Word to Multi-Word Alignment Example For Case 2, we first examine S3 to see whether there is an element (i, Ci ) ∈ S3 .",
        "If true, we combine the words in Ai ((i, Ai) ∈ S2) into a word or phrase and calculate the similarity between this new word or phrase and Ci in the same way as in Case 1.",
        "If the similarity is higher than a threshold δ1 , we add the alignment link (i, Ai) into WA.",
        "If there is an element (phk, Ck) a S3 and i is a constituent of phk , we combine the English words in Aj ((Aj,j)∈ S1) into a phrase.",
        "If it is the same as the phrase phk and sim(j, Ck) > δ1 , we add (Aj , j) into WA.",
        "Otherwise, we use the multi-word to multi-word alignment algorithm in Figure 3 to modify the links.",
        "After applying the above two strategies, there are still some words not aligned.",
        "For each sentence pair, we use E and C to denote the sets of the source words and the target words that are not aligned, respectively.",
        "For each source word in E, we construct a link with each target word in C. We use L = {(i, j) |i ∈ E, j ∈ C} to denote the alignment candidates.",
        "For each candidate in L, we look it up in the translation set S3 .",
        "If there is an element ( i, Ci) ∈ S3 and sim(j, Ci) >δ2 , we add the link into the set WA."
      ]
    },
    {
      "heading": "5 Experiments",
      "text": []
    },
    {
      "heading": "5.1 Training and Testing Set",
      "text": [
        "We did experiments on a sentence aligned English-Chinese bilingual corpus in general domains.",
        "There are about 320,000 bilingual sentence pairs in the corpus, from which, we randomly select 1,000 sentence pairs as testing data.",
        "The remainder is used as training data.",
        "The Chinese sentences in both the training set and the testing set are automatically segmented into words.",
        "The segmentation errors in the testing set are post-corrected.",
        "The testing set is manually annotated.",
        "It has totally 8,651 alignment links including 2,149 null links.",
        "Among them, 866 alignment links include multi-word units, which accounts for about 10% of the total links."
      ]
    },
    {
      "heading": "5.2 Experimental Results",
      "text": [
        "There are several different evaluation methods for word alignment (Ahrenberg et al.",
        "2000).",
        "In our evaluation, we use evaluation metrics similar to those in Och and Ney (2000).",
        "However, we do not classify alignment links into sure links and possible links.",
        "We consider each alignment as a sure link.",
        "If we use SG to indicate the alignments identified by the proposed methods and SC to denote the reference alignments, the precision, recall and f-measure are calculated as described in Equation (2), (3) and (4).",
        "According to the definition of the alignment error rate (AER) in Och and Ney (2000), AER can be calculated with Equation (5).",
        "In this paper, we give two different alignment results in Table 2 and Table 3.",
        "Table 2 presents alignment results that include null links.",
        "Table 3 presents alignment results that exclude null links.",
        "The precision and recall in the tables are obtained to ensure the smallest AER for each method.",
        "In the above tables, the row “Ours” presents the result of our approach.",
        "The results are obtained by setting the word similarity thresholds to δ 1=0.1 and δ2=0.5.",
        "The Chinese-English dictionary used to calculate the word similarity has 66,696 entries.",
        "Each entry has two English translations on average.",
        "The row “Dic” shows the result of the approach that uses a bilingual dictionary instead of the rule-based machine translation system to improve statistical word alignment.",
        "The dictionary used in this method is the same translation dictionary used in the rule-based machine translation system.",
        "It includes 57,684 English words and each English word has about two Chinese translations on average.",
        "The rows “IBM E-C” and “IBM C-E” show the results obtained by IBM Model-4 when treating English as the source and Chinese as the target or vice versa.",
        "The row “IBM Inter” shows results obtained by taking the intersection of the alignments produced by “IBM E-C” and “IBM C-E”.",
        "The row “IBM Refined” shows the results by refining the results of “IBM Inter” as described in Och and Ney (2000).",
        "Generally, the results excluding null links are better than those including null links.",
        "This indicates that it is difficult to judge whether a word has counterparts in another language.",
        "It is because the translations of some source words can be omitted.",
        "Both the rule-based translation system and the bilingual dictionary provide no such information.",
        "It can be also seen that our approach performs (2) the best among others in both cases.",
        "Our approach achieves a relative error rate reduction of 26% and 25% when compared with “IBM E-C” and “IBM C-E” respectively7.",
        "Although the precision of our method is lower than that of the “IBM Inter” method, it achieves much higher recall, resulting in a 30% relative error rate reduction.",
        "Compared with the “IBM refined” method, our method also achieves a relative error rate reduction of 30%.",
        "In addition, our method is better than the “Dic” method, achieving a relative error rate reduction of 8.8%.",
        "In order to provide the detailed word alignment information, we classify word alignment results in Table 3 into two classes.",
        "The first class includes the alignment links that have no multi-word units.",
        "The second class includes at least one multi-word unit in each alignment link.",
        "The detailed information is shown in Table 4 and Table 5.",
        "In Table 5, we do not include the method “Inter” because it has no multi-word alignment links.",
        "All of the methods perform better on single word alignment than on multi-word alignment.",
        "In Table 4, the precision of our method is close to the “IBM Inter” approach, and the recall of our method is much higher, achieving a 47% relative error rate reduction.",
        "Our method also achieves a 37% relative error rate reduction over the “IBM Refined” method.",
        "Compared with the “Dic” method, our approach achieves much higher precision without loss of recall, resulting in a 12% 7 The error rate reductions in this paragraph are obtained from Table 2.",
        "The error rate reductions in Table 3 are omitted.",
        "relative error rate reduction.",
        "Our method also achieves much better results on multi-word alignment than other methods.",
        "However, our method only obtains one third of the correct alignment links.",
        "It indicates that it is the hardest to align the multi-word units."
      ]
    },
    {
      "heading": "6 Discussion",
      "text": [
        "Readers may pose the question “why the rule-based translation system performs better on word alignment than the translation dictionary?” For single word alignment, the rule-based translation system can perform word sense disambiguation, and select the appropriate Chinese words as translation.",
        "On the contrary, the dictionary can only list all translations.",
        "Thus, the alignment precision of our method is higher than that of the dictionary method.",
        "Figure 5 shows alignment precision and recall values under different similarity values for single word alignment including null links.",
        "From the figure, it can be seen that our method consistently achieves higher precisions as compared with the dictionary method.",
        "The t-score value (t=10.37, p=0.05) shows the improvement is statistically significant.",
        "For multi-word alignment links, the translation system also outperforms the translation dictionary.",
        "The result is shown in Table 5 in Section 5.2.",
        "This is because (1) the translation system can automatically recognize English phrases with higher accuracy than the translation dictionary; (2) The translation system can detect separated phrases while the dictionary cannot.",
        "For example, for the sentence pairs in Figure 6, the solid link lines describe the alignment result of the rule-base translation system while dashed lines indicate the alignment result of the translation dictionary.",
        "In example (1), the phrase “be going to” indicates the tense not the phrase “go to” as the dictionary shows.",
        "In example (2), our method detects the separated phrase “turn ... on” while the dictionary does not.",
        "Thus, the dictionary method produces the wrong alignment link."
      ]
    },
    {
      "heading": "7 Conclusion and Future Work",
      "text": [
        "This paper proposes an approach to improve statistical word alignment results by using a rule-based translation system.",
        "Our contribution is that, given a rule-based translation system that provides appropriate translation candidates for each source word or phrase, we select appropriate alignment links among statistical word alignment results or modify them into new links.",
        "Especially, with such a translation system, we can identify both the continuous and separated phrases in the source language and improve the multi-word alignment results.",
        "Experimental results indicate that our approach can achieve a precision of 85% and a recall of 71 % for word alignment including null links in general domains.",
        "This result significantly outperforms those of the methods that use a bilingual dictionary to improve word alignment, and that only use statistical translation models.",
        "Our future work mainly includes three tasks.",
        "First, we will further improve multi-word alignment results by using other technologies in natural language processing.",
        "For example, we can use named entity recognition and transliteration technologies to improve person name alignment.",
        "Second, we will extract translation rules from the improved word alignment results and apply them back to our rule-based machine translation system.",
        "Third, we will further analyze the effect of the translation system on the alignment results."
      ]
    }
  ]
}
