{
  "info": {
    "authors": [
      "Jian-Cheng Wu",
      "Thomas C. Chuang",
      "Wen-Chi Shei",
      "Jason S. Chang"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics – Interactive Poster and Demonstration Sessions",
    "id": "acl-P04-3004",
    "title": "Subsentential Translation Memory for Computer Assisted Writing and Translation",
    "url": "https://aclweb.org/anthology/P04-3004",
    "year": 2004
  },
  "references": [
    "acl-J00-2004",
    "acl-J90-2002",
    "acl-P91-1023"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes a database of translation memory, TotalRecall, developed to encourage authentic and idiomatic use in second language writing.",
        "TotalRecall is a bilingual concordancer that support search query in English or Chinese for relevant sentences and translations.",
        "Although initially intended for learners of English as Foreign Language (EFL) in Taiwan, it is a gold mine of texts in English or Mandarin Chinese.",
        "TotalRecall is particularly useful for those who write in or translate into a foreign language.",
        "We exploited and structured existing high-quality translations from bilingual corpora from a Taiwan-based Sinorama Magazine and Official Records of Hong Kong Legislative Council to build a bilingual concordance.",
        "Novel approaches were taken to provide high-precision bilingual alignment on the subsentential and lexical levels.",
        "A browser-based user interface was developed for ease of access over the Internet.",
        "Users can search for word, phrase or expression in English or Mandarin.",
        "The Web-based user interface facilitates the recording of the user actions to provide data for further research."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Translation memory has been found to be more effective alternative to machine translation for translators, especially when working with batches of similar texts.",
        "That is particularly true with so-called delta translation of the next versions for publications that need continuous revision such as an encyclopaedia or user’s manual.",
        "On another area of language study, researchers on English Language Teaching (ELT) have increasingly looked to concordancer of very large corpora as a new resource for translation and language learning.",
        "Concordancers have been indispensable for lexicographers.",
        "But now language teachers and students also embrace the concordancer to foster data-driven, student-centered learning.",
        "A bilingual concordance, in a way, meets the needs of both communities, the computer assisted translation (CAT) and computer assisted language learning (CALL).",
        "A bilingual concordancer is like a monolingual concordance, except that each sentence is followed by its translation counterpart in a second language.",
        "“Existing translations contain more solutions to more translation problems than any other existing resource.” (Isabelle 1993).",
        "The same can be argued for language learning; existing texts offer more answers for the learner than any teacher or reference work do.",
        "However, it is important to provide easy access for translators and learning writers alike to find the relevant and informative citations quickly.",
        "For instance, the English-French concordance system, TransSearch provides a familiar interface for the users (Macklovitch et al.",
        "2000).",
        "The user type in the expression in question, a list of citations will come up and it is easy to scroll down until one finds translation that is useful much like using a search engine.",
        "TransSearch exploits sentence alignment techniques (Brown et al. 1990; Gale and Church 1990) to facilitate bilingual search at the granularity level of sentences.",
        "In this paper, we describe a bilingual concordancer which facilitate search and visualization with fine granularity.",
        "TotalRecall exploits subsentential and word alignment to provide a new kind of bilingual concordancer.",
        "Through the interactive interface and clustering of short subsentential bilingual citations, it helps translators and non-native speakers find ways to translate or express themselves in a foreign language."
      ]
    },
    {
      "heading": "2 Aligning the corpus",
      "text": [
        "Central to TotalRecall is a bilingual corpus and a set of programs that provide the bilingual analyses to yield a translation memory database out of the bilingual corpus.",
        "Currently, we are working with",
        "for alignment.",
        "We combine length-based and punctuation-based approach to cope with the difficulties in subsentential alignment.",
        "Punctuations in one language translate more or less consistently into punctuations in the other language.",
        "Therefore the information is useful in compensating for the weakness of length-based approach.",
        "In addition, we seek to further improve the accuracy rates by employing cognates and lexical information.",
        "We experimented with an implementation of the proposed method on a very large Mandarin-English parallel corpus of records of Hong Kong Legislative Council with satisfactory results.",
        "Experiment results show that the punctuation-based approach outperforms the length-based approach with precision rates approaching 98%."
      ]
    },
    {
      "heading": "Subsentential alignment results",
      "text": []
    },
    {
      "heading": "2.2 Word and Collocation Alignment",
      "text": [
        "After sentences and their translation counterparts are identified, we proceeded to carry out finer-grained alignment on the word level.",
        "We employed the Competitive Linking Algorithm (Melamed 2000) produce high precision word alignment.",
        "We also extract English collocations and their translation equivalent based on the result of word alignment.",
        "These alignment results were subsequently used to cluster citations and highlight translation equivalents of the query."
      ]
    },
    {
      "heading": "3 Aligning the corpus",
      "text": [
        "TotalRecall allows a user to look for instances of specific words or expressions and its translation counterpart.",
        "For this purpose, the system opens up two text boxes for the user to enter queries in any or both of the two languages involved.",
        "We offer some special expressions for users to specify the following queries:",
        "• Single or multi-word query – spaces between words in a query are considered as “and.” For disjunctive query, use “||” to denote “or.” • Every word in the query will be expanded to all surface forms for search.",
        "That includes singular and plural forms, and various tense of the verbs.",
        "• TotalRecall automatically ignore high frequency words in a stoplist such as “the,” “to,” and “of.” • It is also possible to ask for exact match by submitting query in quotes.",
        "Any word within the quotes will not be ignored.",
        "It is useful for searching named entities.",
        "Once a query is submitted, TotalRecall displays the results on Web pages.",
        "Each result appears as a pair of segments in English and Chinese, in side-by-side format.",
        "A “context” hypertext link is included for each citation.",
        "If this link is selected, a new page appears displaying the original document of the pair.",
        "If the user so wishes, she can scroll through the following or preceding pages of context in the original document.",
        "TotalRecall present the results in a way that makes it easy for the user to grasp the information returned to her: • When operating in the monolingual mode, TotalRecall presents the citation according to lengths.",
        "• When operating in the bilingual mode, TotalRecall clusters the citations according to the translation counterparts and presents the user with a summary page of one example each for different translations.",
        "The query words and translation counterparts are highlighted."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "In this paper, we describe a bilingual concordance designed as a computer assisted translation and language learning tool.",
        "Currently, TotalRecll uses Sinorama Magazine and HKLEGCO corpora as the databases of translation memory.",
        "We have already put a beta version on line and experimented with a focus group of second language learners.",
        "Novel features of TotalRecall include highlighting of query and corresponding translations, clustering and ranking of search results according translation and frequency.",
        "TotalRecall enable the non-native speaker who is looking for a way to express an idea in English or Mandarin.",
        "We are also adding on the basic functions to include a log of user activities, which will record the users’ query behavior and their background.",
        "We could then analyze the data and find useful information for future research."
      ]
    },
    {
      "heading": "Acknowledgement",
      "text": [
        "We acknowledge the support for this study through grants from National Science Council and Ministry of Education, Taiwan (NSC 91-2213-E007-061 and MOE EX-92-E-FA06-4-4) and a special grant for preparing the Sinorama Corpus for distribution by the Association for Computational Linguistics and Chinese Language Processing."
      ]
    }
  ]
}
