{
  "info": {
    "authors": [
      "Po Hu",
      "Tingting He",
      "Ji Donghong"
    ],
    "book": "Workshop on Text Summarization Branches Out",
    "id": "acl-W04-1018",
    "title": "Chinese Text Summarization Based on Thematic Area Detection",
    "url": "https://aclweb.org/anthology/W04-1018",
    "year": 2004
  },
  "references": [
    "acl-C00-1072",
    "acl-W00-0403"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Automatic summarization is an active research area in natural language processing.",
        "This paper has proposed a special method that produces text summary by detecting thematic areas in Chinese document.",
        "The specificity of the method is that the produced summary can both cover many different themes and reduce its redundancy obviously at the same time.",
        "In this method, the detection of latent thematic areas is realized by adopting K-medoids clustering method as well as a novel clustering analysis method, which can be used to determine automatically K, the number of clusters..",
        "In addition, a novel parameter, which is known as representation entropy, is used for summarization redundancy evaluation.",
        "Experimental results indicate a clear superiority of the proposed method over the traditional non-thematic-area-detection method under the proposed evaluation scheme when dealing with different genres of text documents with free style and flexible theme distribution."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "With the approaching information explosion, people begin to feel at a loss about the mass of information.",
        "Because the effectiveness of the existing information retrieval technology is still unsatisfactory, it becomes a problem to efficiently find the information mostly related to the needs of customers retrieval results so that customers can easily accept or reject the retrieved information without needing to look at the original retrieval results.",
        "This paper has proposed a new summarization method, where K-medoid clustering method is applied to detect all possible partitions of thematic areas, and a novel clustering analysis method, which is based on a self-defined objective function, is applied to automatically determine K, the number of latent thematic areas in a document This method consists of three main stages: 1) Find out the thematic areas in the document by adopting the K-medoid clustering method (Kaufmann and Rousseeuw, 1987as well as a novel clustering analysis method.",
        "2) From each thematic area, find a sentence which has the maximum semantic similarity value with this area as the representation.",
        "3) Output the selected sentences to form the final summary according to their positions in the original document.",
        "To validate the effectiveness of the proposed method, use this method as well as the traditional non-thematic-areas-detection method on our experimental samples to generate two groups of summaries.",
        "Next, make a comparison between them.",
        "The final results show a clear superiority of our method over the traditional one in the scores of the evaluation parameters.",
        "The remainder of this paper is organized as follows.",
        "In the next section, we review related methods that are commonly discussed in the automatic summarization literature.",
        "Section 3 describes our method in detail.",
        "The evaluation methodology and experimental results are presented in Section 4.",
        "Finally, we conclude with a discussion and future work."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "The research of automatic summarization begins with H.P.Luhn’s work.",
        "By far, a large number of scholars have taken part in the research and had many achievements.",
        "Most of the researchers have concentrated on the sentence-extraction summarization method (the so-called shallower approach) (Wang et al., 2003; Nomoto and Matsumoto, 2001; Gong and Liu, 2001), but not the sentence-generation method (the so-called deeper approach)(Yang and Zhong., 1998).",
        "On the one hand, it is caused by the high complexity and the severe limitation of practical fields of rational natural language processing technology and knowledge engineering technology.",
        "On the other hand, it is closely associated with the great achievements in many fields of natural language processing by statistical research methods, machine learning methods and pattern recognition methods in recent years (Mani, 2001).",
        "The summarization method of sentence-extraction can roughly be divided into two kinds: supervised and unsupervised (Nomoto and Matsumoto, 2001).",
        "Generally, the realization of the former relies on plenty of manual summaries, that is so-called “Gold Standards” which help determining the relevant parameters of the statistical model for summarization.",
        "However, not all people believe that manual summaries are reliable, so the researchers have begun to investigate the general unsupervised method, which can avoid the requirement of support of manual summaries.",
        "Nevertheless it is soon discovered that the summaries produced by this method can’t cover all the themes and have great redundancy at the same time.",
        "Usually, it can only cover those intensively distributed themes while neglects others.",
        "So researchers in Nanjing University proposed a summarization method based on the analysis of the discourse structure to overcome these problems (Wang et al., 2003).",
        "By making statistics of the reduplicated words in the adjacent paragraphs of the document, the semantic distances among them can be worked out.",
        "Then analyse the thematic structure of the document and extract sentences from each theme to form a summary.",
        "It is ideal to employ this method while dealing with those documents with standard discourse structure, because it can effectively avoid the problems caused by the summarization method without discourse structure analysis.",
        "Yet when the writing style of a document is rather free and the distribution of the themes is variable, that is the same theme can be distributed in several paragraphs not adjacent to each other, then the use of this method can’t be equally effective.",
        "To deal with a lot of Chinese documents which have free style of writing and flexible themes, a sentence-extraction summarization method created by detecting thematic areas is tried following such work as (Nomoto and Matsumoto, 2001; Salton et al., 1996; Salton et al., 1997; Carbonell and Goldstein, 1998; Lin and Hovy, 2000).",
        "The thematic areas detection in a document is obtained through the adaptive clustering of paragraphs (cf. Moens et al.",
        "1999), so it can overcome in a certain degree the defects of the above methods in dealing with the documents with rather flexible theme distribution."
      ]
    },
    {
      "heading": "3 The Algorithm",
      "text": [
        "In this section, the proposed method will be introduced in detail.",
        "The method consists of the following three main stages: Stage 1: Find the different thematic areas in the document through paragraph clustering and clustering analysis.",
        "Stage 2: Select the most suitable sentence from each thematic area as the representative one.",
        "Stage 3: Make the representative sentences form the final summary according to certain requirements."
      ]
    },
    {
      "heading": "3.1 Stage 1: Thematic Area Detection",
      "text": [
        "The process of thematic area detection is displayed in Figure 1.",
        "The each step of Figure 1 is explained in the following subsections.",
        "Different from the general word segmentation operation adopted in the traditional Chinese automatic summarization research, we do not take the general operation when preprocessing the original document, but make use of the method introduced by (Liu et al., 2003) to extract terms from the document and then express its content by such metadata elements as terms.",
        "The greatest advantage of term extraction technology is that it needs no support of fixed thesaurus, only through the continuous updating and making statistics of a real corpus.",
        "We can dynamically establish and update a term bank and improve the extraction quality through continuous correcting of the parameters for extraction.",
        "Thus it is of wide practical prospects for natural language processing.",
        "In addition, the terms can represent a relative specific meaning, because most of them are phrases, which consist of multi-characters."
      ]
    },
    {
      "heading": "3.1.2 Step 2: Vector Representation and Weight Calculation of Paragraph",
      "text": [
        "The advantage of the vector space model (VSM) is that it successfully makes the unstructured documents structured which makes it possible to handle the massive real documents by adopting the existing mathematical instruments.",
        "All the terms extracted from the document are considered as the features of a vector, while the values of the features are statistics of the terms.",
        "According to this, we can set up the VSM of paragraphs, that is each paragraph Pi (i:1 ~M,M is the number of all paragraphs in a document) is represented as the vector of weights of terms, VPi, VPi Input: <a, b>, they respectively denote the paragraph matrix composed by all the paragraph vectors in the document and the number of clusters, k (the range of k is set to 2~M).",
        "Output: <A, B, C>, they respectively denote the cluster id, the representative paragraph vector and all the paragraph vectors of each cluster under the k clusters.",
        "suitably, then the corresponding clustering results can well distinguish the different themes in the document, and correspondingly the average of the sum of the weight of the representative paragraph under each theme will tend to maximize.",
        "We call this the maximum property of the objective function.",
        "Correspondingly, we define the following objective function Objf(K) to reflect clustering quality and determine the number of clusters, K.",
        "Where W(Pj) denotes the weight of the selected representative paragraph in the j-th cluster, here the selected representative paragraph Pj can be regarded as the medoid in the j-th cluster which is determined by the final output of the presented K-medoid paragraph clustering process, and the weight of Pj is calculated by formula (2).",
        "Put the objective function in K clustering results corresponding",
        "then make good use of the maximum property of the objective function to adaptively determine the final number of clusters, K. Figure 2 shows the concrete distribution of the values of objective function obtained in the example document ”On the Situation and Measures That Face Fishing in the Sea in Da Lian City” when adopting the proposed clustering analysis method.",
        "According to the maximum property of objective function, that is take the value of K when the values of the objective function take maximum as the final number of clusters.",
        "From the results in Figure 2, we can know that K equals to six, that is we find six latent thematic areas from nine paragraphs in the document with this method.",
        "Output the complete information table of each thematic area in the form of the representative paragraph and all the paragraphs and sentences covered by the thematic area."
      ]
    },
    {
      "heading": "3.2 Stage 2: Selection of the Thematic Representative Sentences",
      "text": [
        "To select a most suitable representative sentence from each thematic area, the author proposes the following method.",
        "This is in contrast with a method proposed by Radev (Radev et al., 2000 ), where the centroid of a cluster is selected as the representative one.",
        "Method: select the sentence which is most similar to the thematic area semantically as representative one.",
        "Before carrying out the method in detail, there are two problems to be solved: 1) The vector representation of sentence and thematic area The vector representation of sentence and thematic area is similar to that of paragraph introduced before.",
        "We only need to change the weight calculation field of the terms from the interior of paragraph to the interior of sentence or thematic area.",
        "Accordingly, we can describe the sentence vector and thematic area vector as follows VSj",
        "d10000901 1192 7 5 0.64 The value of RE (Mitra et al., 2002) is calculated as follows:"
      ]
    },
    {
      "heading": "RE",
      "text": []
    }
  ]
}
