{
  "info": {
    "authors": [
      "Richard Wicentowski",
      "Grace Ngai",
      "Dekai Wu",
      "Marine Carpuat",
      "Emily Thomforde",
      "Adrian Packel"
    ],
    "book": "SENSEVAL International Workshop on the Evaluation of Systems for the Semantic Analysis of Text",
    "id": "acl-W04-0863",
    "title": "Joining Forces to Resolve Lexical Ambiguity: East Meets West in Barcelona",
    "url": "https://aclweb.org/anthology/W04-0863",
    "year": 2004
  },
  "references": [
    "acl-W04-0822",
    "acl-W04-0845",
    "acl-W04-0862"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes the component models and combination model built as a joint effort between Swarthmore College, Hong Kong PolyU, and HKUST.",
        "Though other models described elsewhere contributed to the final combination model, this paper focuses solely on the joint contributions to the ”Swat-HK” effort."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "This paper describes the two joint component models of the Swat-HK systems entered into four of the word sense disambiguation lexical sample tasks in Senseval-3: Basque, Catalan, Italian and Romanian, as well as a combination model for each language.",
        "The feature engineering (and construction of three other component models which are described in (Wicentowski et al., 2004)) was performed at Swarthmore College, while the Hong Kong team constructed two component models based on well-known machine learning algorithms.",
        "The combination model, which was constructed at Swarthmore, uses voting to combine all five models."
      ]
    },
    {
      "heading": "2 Experimental Features",
      "text": [
        "A full description of the experimental features for all four tasks can be found in the report submitted by the Swarthmore College Senseval team (Wicentowski et al., 2004).",
        "Briefly, the systems used lexical and syntactic features in the context of the target word:",
        "• The “bag of words (and lemmas)” in the context of the ambiguous word.",
        "• Bigrams and trigrams of words (and lemmas,",
        "part-of-speech tags, and, for Basque, case information) surrounding the ambiguous word.",
        "• The topic (or code) of the document containing the current instance of the word was extracted.",
        "(Basque and Catalan only.)",
        "These features have been shown to be effective in previous WSD research.",
        "Since our systems were all supervised, all the data used was provided by the Senseval organizers; no additional (unlabeled) data was included."
      ]
    },
    {
      "heading": "3 Methodology",
      "text": [
        "The systems that were constructed by this team included two component models: a boosting model and a maximum entropy model as well as a combination system.",
        "The component models were also used in other Senseval-3 tasks: Semantic Role Labeling (Ngai et al., 2004) and the lexical sample tasks for Chinese and English, as well as the Multilingual task (Carpuat et al., 2004).",
        "To perform parameter tuning for the two component models, 20% of the samples from the training set were held out into a validation set.",
        "Since we did not expect the senses of different words to share any information, the training data was partitioned by the ambiguous word in question.",
        "A model was then trained for each ambiguous word type.",
        "In total, we had 40 models for Basque, 27 models for Catalan, 45 models for Italian and 39 models for Romanian."
      ]
    },
    {
      "heading": "3.1 Boosting",
      "text": [
        "Boosting is a powerful machine learning algorithm which has been shown to achieve good results on a variety of NLP problems.",
        "One known property of boosting is its ability to handle large numbers of features.",
        "For this reason, we felt that it would be well suited to the WSD task, which is known to be highly lexicalized with a large number of possible word types.",
        "Our system was constructed around the Boostex-ter software (Schapire and Singer, 2000), which implements boosting on top of decision stumps (decision trees of one level), and was originally designed for text classification.",
        "Tuning a boosting system mainly lies in modifying the number of iterations, or the number of base models it would learn.",
        "Larger number of iterations contribute to the boosting model’s power.",
        "However, they also make it more prone to overfitting and increase the training time.",
        "The latter, a simple disadvantage in another problem, becomes a real issue for Senseval, since large numbers of models (one for each word type) need to be trained in a short period of time.",
        "Since the available features differed from language to language, the optimal number of iterations also varied.",
        "Table 1 shows the performance of the model on the validation set with respect to the number of iterations per language.",
        "The final systems for the languages used 2000 iterations for Basque and Catalan and 500 iterations for Italian and Romanian.",
        "The test set results are shown in Table 4"
      ]
    },
    {
      "heading": "3.2 Maximum Entropy",
      "text": [
        "The other individual system was based on the maximum entropy model, another machine learning algorithm which has been successfully applied to many NLP problems.",
        "Our system was implemented on top of the YASMET package (Och, 2002).",
        "Due to lack of time, we did not manage to fine-tune the maximum entropy model.",
        "The YASMET package does provide a number of easily variable parameters, but we were only able to try varying the feature selection count threshold and the smoothing parameter, and only on the Basque data.",
        "Experimentally, however, smoothing did not seem to make a difference.",
        "The only change in performance was caused by varying the feature selection count threshold, which controls the number of times a feature has to be seen in the training set in order to be considered.",
        "Table 2 shows the performances of the system on the Basque validation set, with count thresholds of 0, 1 and 2.",
        "Since word sense disambiguation is known to be",
        "a highly lexicalized task involving many feature values and sparse data, it is not too surprising that setting a low threshold of 1 proves to be the most effective.",
        "The final system kept this threshold, smoothing was not done and the GIS iterations allowed to proceed until it converged on its own.",
        "These parameters were used for all four languages.",
        "The maximum entropy model was not entered into the competition as an official contestant; however, it did participate in the combined system."
      ]
    },
    {
      "heading": "3.3 Combined System",
      "text": [
        "Ensemble methods have been widely studied in NLP research, and it is well-known that a set of systems will often combine to produce better results than those achieved by the best individual system alone.",
        "The final system contributed by the Swarthmore-Hong Kong team was such an ensemble.",
        "In addition to the boosting and maximum entropy models mentioned earlier, three other models were included: a nearest-neighbor clustering model, a decision list, and a Naive Bayes model.",
        "The five models were then combined by a simple weighted majority vote, with an ad-hoc weight of 1.1 given to the boosting and decision lists systems, and 1.0 otherwise, with ties broken arbitrarily.",
        "Due to an unfortunate error with the input data of the voting algorithm (Wicentowski et al., 2004), the official submitted results for the combined system were poorer than they should have been.",
        "Table 3 compares the official (submitted) results to the corrected results on the test set.",
        "The decrease in performance caused by the error ranged from 0.9% to 3.3%."
      ]
    },
    {
      "heading": "4 Test Set Results",
      "text": [
        "Final results from all the systems are shown in Table 4.",
        "As a reference, the results of a simple baseline system which assigns the most frequent sense as seen in the training set is also provided.",
        "Due to the error in the voting system, the official results for the combination system were lower than they should have been – as a result, boosting was officially the top ranked system for 3 of the 4 languages.",
        "With the corrected results, however, the combined system outperforms the individual models, as expected.",
        "The only exception is Basque, where the booster had an exceptionally strong performance.",
        "This is probably due to the fact that Basque has a much richer feature set than the other languages, which boosting was better able to take advantage of.",
        "The poor performance of the maximum entropy model was also unexpected at first; however, it is perhaps not too surprising, given the lack of time spent on fine-tuning the model.",
        "As a result, most of the parameters were left at their default values.",
        "One thing worth noting is the fact that the systems were combined as “closed systems” – i.e. all that was known about them was the output result, and nothing else.",
        "The result was that no confidence measures from the boosting and maximum entropy could be used in the combined system.",
        "It is likely that the performance could have been further improved if more information had been available."
      ]
    },
    {
      "heading": "5 Conclusions and Discussion",
      "text": [
        "This paper describes the “Swat-HK” systems which were the result of collaborative work between Swarthmore College, Hong Kong Polytechnic University and HKUST.",
        "Several base systems were constructed on the same feature set, and a weighed majority voting system was used to combine the results.",
        "The individual systems all achieve good results, easily beating the baseline.",
        "As expected, the combined system outperforms the best individual system for the majority of the tasks."
      ]
    }
  ]
}
