{
  "info": {
    "authors": [
      "Leif Arda Nielsen"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics – Student Research Workshop",
    "id": "acl-P04-2009",
    "title": "Robust VPE Detection Using Automatically Parsed Text",
    "url": "https://aclweb.org/anthology/P04-2009",
    "year": 2004
  },
  "references": [
    "acl-A00-2018",
    "acl-E93-1025",
    "acl-H94-1020",
    "acl-J95-4004",
    "acl-J97-4002",
    "acl-P02-1018",
    "acl-W02-2018",
    "acl-W99-0705"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes a Verb Phrase Ellipsis (VPE) detection system, built for robustness, accuracy and domain independence.",
        "The system is corpus-based, and uses machine learning techniques on free text that has been automatically parsed.",
        "Tested on a mixed corpus comprising a range of genres, the system achieves a 70% F1-score.",
        "This system is designed as the first stage of a complete VPE resolution system that is input free text, detects VPEs, and proceeds to find the antecedents and resolve them."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Ellipsis is a linguistic phenomenon that has received considerable attention, mostly focusing on its interpretation.",
        "Most work on ellipsis (Fiengo and May, 1994; Lappin, 1993; Dalrymple et al., 1991; Kehler, 1993; Shieber et al., 1996) is aimed at discerning the procedures and the level of language processing at which ellipsis resolution takes place, or ambiguous and difficult cases.",
        "The detection of elliptical sentences or the identification of the antecedent and elided clauses within them are usually not dealt with, but taken as given.",
        "Noisy or missing input, which is unavoidable in NLP applications, is not dealt with, and neither is focusing on specific domains or applications.",
        "It therefore becomes clear that a robust, trainable approach is needed.",
        "An example of Verb Phrase Ellipsis (VPE), which is detected by the presence of an auxiliary verb without a verb phrase, is seen in example 1.",
        "VPE can also occur with semi-auxiliaries, as in example 2.",
        "(1) John3 {loves his3 wife}2.",
        "Bill3 does1 too.",
        "(2) But although he was terse, he didn’t {rage at me}2 the way I expected him to1.",
        "Several steps of work need to be done for ellipsis resolution: 1.",
        "Detecting ellipsis occurrences.",
        "First, elided verbs need to be found.",
        "2.",
        "Identifying antecedents.",
        "For most cases of ellipsis, copying of the antecedent clause is enough for resolution (Hardt, 1997).",
        "3.",
        "Resolving ambiguities.",
        "For cases where ambiguity exists, a method for generating the full list of possible solutions, and suggesting the most likely one is needed.",
        "This paper describes the work done on the first stage, the detection of elliptical verbs.",
        "First, previous work done on tagged corpora will be summarised.",
        "Then, new work on parsed corpora will be presented, showing the gains possible through sentence-level features.",
        "Finally, experiments using unannotated data that is parsed using an automatic parser are presented, as our aim is to produce a standalone system.",
        "We have chosen to concentrate on VP ellipsis due to the fact that it is far more common than other forms of ellipsis, but pseudo-gapping, an example of which is seen in example 3, has also been included due to the similarity of its resolution to VPE (Lappin, 1996).",
        "Do so/it/that and so doing anaphora are not handled, as their resolution is different from that of VPE (Kehler and Ward, 1999).",
        "(3) John writes plays, and Bill does novels."
      ]
    },
    {
      "heading": "2 Previous work",
      "text": [
        "Hardt’s (1997) algorithm for detecting VPE in the Penn Treebank (see Section 3) achieves precision levels of 44% and recall of 53%, giving an F11 of 48%, using a simple search technique, which relies on the parse annotation having identified empty expressions correctly.",
        "In previous work (Nielsen, 2003a; Nielsen, 2003b) we performed experiments on the British National Corpus using a variety of machine learning techniques.",
        "These earlier results are not directly comparable to Hardt’s, due to the different corpora used.",
        "The expanded set of results are summarised in Table 1, for Transformation Based Learning (TBL) (Brill, 1995), GIS based Maximum Entropy Modelling (GIS-MaxEnt) (Ratnaparkhi, 1998), L-BFGS based Maximum Entropy Modelling (L-BFGS-MaxEnt)2 (Malouf, 2002), Decision Tree Learning (Quinlan, 1993) and Memory Based Learning (MBL) (Daelemans et al., 2002).",
        "For all of these experiments, the training features consisted of lexical forms and Part of Speech (POS) tags of the words in a three word forward/backward window of the auxiliary being tested.",
        "This context size was determined empirically to give optimum results, and will be used throughout this paper.",
        "The L-BFGS-MaxEnt uses Gaussian Prior smoothing which was optimized for the BNC data, while the GIS-MaxEnt has a simple smoothing option available, but this deteriorates results and is not used.",
        "MBL was used with its default settings.",
        "While TBL gave the best results, the software we used (Lager, 1999) ran into memory problems and proved problematic with larger datasets.",
        "Decision trees, on the other hand, tend to oversimplify due to the very sparse nature of ellipsis, and produce a single rule that classifies everything as non-VPE.",
        "This leaves Maximum Entropy and MBL for further experiments."
      ]
    },
    {
      "heading": "3 Corpus description",
      "text": [
        "The British National Corpus (BNC) (Leech, 1992) is annotated with POS tags, using the CLAWS-4 tagset.",
        "A range of V sections of the BNC, containing around 370k words3 with 645 samples of VPE was used as training data.",
        "The separate test data consists of around 74k words4 with 200 samples of VPE.",
        "The Penn Treebank (Marcus et al., 1994) has more than a hundred phrase labels, and a number of empty categories, but uses a coarser tagset.",
        "A mixture of sections from the Wall Street Journal and Brown corpus were used.",
        "The training section5 consists of around 540k words and contains 522 samples of VPE.",
        "The test section6 consists of around 140k words and contains 150 samples of VPE."
      ]
    },
    {
      "heading": "4 Experiments using the Penn Treebank",
      "text": [
        "To experiment with what gains are possible through the use of more complex data such as",
        "parse trees, the Penn Treebank is used for the second round of experiments.",
        "The results are presented as new features are added in a cumulative fashion, so each experiment also contains the data contained in those before it."
      ]
    },
    {
      "heading": "Words and POS tags",
      "text": [
        "The Treebank, besides POS tags and category headers associated with the nodes of the parse tree, includes empty category information.",
        "For the initial experiments, the empty category information is ignored, and the words and POS tags are extracted from the trees.",
        "The results in Table 2 are seen to be considerably poorer than those for BNC, despite the comparable data sizes.",
        "This can be accounted for by the coarser tagset employed.",
        "Close to punctuation A very simple feature, that checks for auxiliaries close to punctuation marks was tested.",
        "Table 3 shows the performance of the feature itself, characterised by very low precision, and results obtained by using it.",
        "It gives a 2% increase in F1 for MBL, 3% for GIS-MaxEnt, but a 1.5% decrease for L-BFGS-MaxEnt.",
        "This brings up the point that the individual success rate of the features will not be in direct correlation with gains in overall results.",
        "Their contribution will be high if they have high precision for the cases they are meant to address, and if they produce a different set of results from those already handled well, complementing the existing features.",
        "Overlap between features can be useful to have greater confidence when they agree, but low precision in the feature can increase false positives as well, decreasing performance.",
        "Also, the small size of the test set can contribute to fluctuations in results."
      ]
    },
    {
      "heading": "Heuristic Baseline",
      "text": [
        "A simple heuristic approach was developed to form a baseline.",
        "The method takes all auxiliaries",
        "as possible candidates and then eliminates them using local syntactic information in a very simple way.",
        "It searches forwards within a short range of words, and if it encounters any other verbs, adjectives, nouns, prepositions, pronouns or numbers, classifies the auxiliary as not elliptical.",
        "It also does a short backwards search for verbs.",
        "The forward search looks 7 words ahead and the backwards search 3.",
        "Both skip ‘asides’, which are taken to be snippets between commas without verbs in them, such as : “... papers do, however, show ...”.",
        "This feature gives a 4.5% improvement for MBL (Table 4), 4% for GIS-MaxEnt and 3.5% for L-BFGSMaxEnt."
      ]
    },
    {
      "heading": "Surrounding categories",
      "text": [
        "The next feature added is the categories of the previous branch of the tree, and the next branch.",
        "So in the example in Figure 1, the previous category of the elliptical verb is ADVP-PRD-TPC-2, and the next category NP-SBJ.",
        "The results of using this feature are seen in Table 5, giving a 3.5% boost to MBL, 2% to GIS-MaxEnt, and 1.6% to L-BFGSMaxEnt."
      ]
    },
    {
      "heading": "Auxiliary-final VP",
      "text": [
        "For auxiliary verbs parsed as verb phrases (VP), this feature checks if the final element in the VP is an auxiliary or negation.",
        "If so, no main verb can be present, as a main verb cannot be followed by an auxiliary or negation.",
        "This feature was used by Hardt (1993) and gives a 3.5% boost to performance for MBL, 6% for GIS-MaxEnt, and 3.4% for L-BFGS-MaxEnt (Table 6)."
      ]
    },
    {
      "heading": "Empty VP",
      "text": [
        "Hardt (1997) uses a simple pattern check to search for empty VP’s identified by the Treebank, (VP (-NONE- *?",
        "*)), which achieves 60% F1 on our test set.",
        "Our findings are in line with Hardt’s, who reports 48% F1, with the difference being due to the different sections of the Treebank used.",
        "It was observed that this search may be too restrictive to catch some examples of VPE in the corpus, and pseudo-gapping.",
        "Modifying the search pattern to be ‘(VP (-NONE- *?",
        "*)’ instead improves the feature itself by 10% in F1 and gives the results seen in Table 7, increasing MBL’s F 1 by 10%, GIS-MaxEnt by 14% and L-BFGS-MaxEnt",
        "Empty categories Finally, including empty category information completely, such that empty categories are treated as words and included in the context.",
        "Table 8 shows that adding this information results in a 4% increase in F1 for MBL, 4.9% for GIS-MaxEnt, and 2.5% for L-BFGS-MaxEnt."
      ]
    },
    {
      "heading": "5 Experiments with Automatically",
      "text": []
    },
    {
      "heading": "Parsed data",
      "text": [
        "The next set of experiments use the BNC and Treebank, but strip POS and parse information, and parse them automatically using two different parsers.",
        "This enables us to test what kind of performance is possible for real-world applications."
      ]
    },
    {
      "heading": "5.1 Parsers used",
      "text": [
        "Charniak’s parser (2000) is a combination probabilistic context free grammar and maximum entropy parser.",
        "It is trained on the Penn Treebank, and achieves a 90.1% recall and precision average for sentences of 40 words or less.",
        "Robust Accurate Statistical Parsing (RASP) (Briscoe and Carroll, 2002) uses a combination of statistical techniques and a hand-crafted grammar.",
        "RASP is trained on a range of corpora, and uses a more complex tagging system (CLAWS-2), like that of the BNC.",
        "This parser, on our data, generated full parses for 70% of the sentences, partial parses for 28%, while 2% were not parsed, returning POS tags only."
      ]
    },
    {
      "heading": "5.2 Reparsing the Treebank",
      "text": [
        "The results of experiments using the two parsers (Table 9) show generally similar performance.",
        "Compared to results on the original treebank with similar data (Table 6), the results are 4-6% lower, or in the case of GIS-MaxEnt, 4% lower or 2% higher, depending on parser.",
        "This drop in performance is not surprising, given the errors introduced by the parsing process.",
        "As the parsers do not generate empty-category information, their overall results are 14-20% lower, compared to those in Table 8.",
        "The success rate for the features used (Table 10) stay the same, except for auxiliary-final VP, which is determined by parse structure, is only half as successful for RASP.",
        "Conversely, the heuristic baseline is more successful for RASP, as it relies on POS tags, which is to be expected as RASP has a more detailed tagset."
      ]
    },
    {
      "heading": "5.3 Parsing the BNC",
      "text": [
        "Experiments using parsed versions of the BNC corpora (Table 11) show similar results to the original results (Table 1) - except L-BFGS-MaxEnt which scores 4-8% lower - meaning that the added information from the features mitigates the errors introduced in parsing.",
        "The performance of the features (Table 12) remain similar to those for the re-parsed treebank experiments.",
        "Feature"
      ]
    },
    {
      "heading": "5.4 Combining BNC and Treebank data",
      "text": [
        "Combining the re-parsed BNC and Treebank data diversifies and increases the size of the test data, making conclusions drawn empirically more reliable, and the wider range of training data makes it more robust.",
        "This gives a training set of 1167 VPE’s and a test set of 350 VPE’s.",
        "The results in Table 13 show little change from the previous experiments."
      ]
    },
    {
      "heading": "6 Conclusion and Future work",
      "text": [
        "This paper has presented a robust system for VPE detection.",
        "The data is automatically tagged and parsed, syntactic features are extracted and machine learning is used to classify instances.",
        "Three different machine learning algorithms, Memory Based Learning, GIS-based and L-BFGS-based maximum entropy modeling are used.",
        "They give similar results, with L-BFGS-MaxEnt generally giving the highest performance.",
        "Two parsers were used, Charniak’s and RASP, achieving similar results.",
        "To summarise the findings:",
        "• Using the BNC, which is tagged with a complex tagging scheme but has no parse data, it is possible to get 76% F 1 using lexical forms and POS data alone • Using the Treebank, the coarser tagging scheme reduces performance to 67%.",
        "Adding extra features, including sentence-level ones, raises this to 74%.",
        "Adding empty category information gives 88%, compared to previous results of 48% (Hardt, 1997) • Re-parsing the Treebank data , top performance is 63%, raised to 68% using extra features • Parsing the BNC, top performance is 71%, raised to 72% using extra features • Combining the parsed data, top performance is 67%, raised to 71% using extra features",
        "The results demonstrate that the method can be applied to practical tasks using free text.",
        "Next, we will experiment with an algorithm (Johnson, 2002) that can insert empty-category information into data from Charniak’s parser, allowing replication of features that need this.",
        "Cross-validation experiments will be performed to negate the effects the small test set may cause.",
        "As machine learning is used to combine various features, this method can be extended to other forms of ellipsis, and other languages.",
        "However, a number of the features used are specific to English VPE, and would have to be adapted to such cases.",
        "It is difficult to extrapolate how successful",
        "such approaches would be based on current work, but it can be expected that they would be feasible, albeit with lower performance."
      ]
    }
  ]
}
