{
  "info": {
    "authors": [
      "Jui-Feng Yeh",
      "Chung-Hsien Wu",
      "Ming-Jun Chen",
      "Liang-Chih Yu"
    ],
    "book": "SIGHAN Workshop on Chinese Language Processing",
    "id": "acl-W04-1110",
    "title": "Automated Alignment and Extraction of Bilingual Domain Ontology for Medical Domain Web Search",
    "url": "https://aclweb.org/anthology/W04-1110",
    "year": 2004
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper proposes an approach to automated ontology alignment and domain ontology extraction from two knowledge bases.",
        "First, WordNet and HowNet knowledge bases are aligned to construct a bilingual universal ontology based on the co-occurrence of the words in a parallel corpus.",
        "The bilingual universal ontology has the merit that it contains more structural and semantic information coverage from two complementary knowledge bases, WordNet and HowNet.",
        "For domain-specific applications, a medical domain ontology is further extracted from the universal ontology using the island-driven algorithm and a medical domain corpus.",
        "Finally, the domain-dependent terms and some axioms between medical terms based on a medical encyclopaedia are added into the ontology.",
        "For ontology evaluation, experiments on web search were conducted using the constructed ontology.",
        "The experimental results show that the proposed approach can automatically align and extract the domain-specific ontology.",
        "In addition, the extracted ontology also shows its promising ability for medical web search."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In intelligent mining, in order to obviate the unnecessary keyword expansion, some knowledge base should be involved in the intelligent information system.",
        "In recent years, considerable progress has been invested in developing the conceptual bases for building technology that allows knowledge reuse and sharing.",
        "As information exchangeability and communication becomes increasingly global, multiple-language lexical resources that can provide transnational services are becoming increasingly important.",
        "Over the last few years, significant effort has been made to construct the ontology manually according to the domain expert’s knowledge.",
        "Manual ontology merging using conventional editing tools without intelligent support is difficult, labor intensive and error prone.",
        "Therefore, several systems and frameworks for supporting the knowledge engineer in the ontology merging task have recently been proposed.",
        "To avoid the reiteration in ontology construction, the algorithm of ontology merge (UMLS http://umlsks.nlm.nih.gov/) (Langkilde and Knight 1998) and ontology alignment (Vossen and Peters 1997) (Weigard and Hoppenbrouwers 1998) (Asanoma 2001) were invested.",
        "The final ontology is a merged version of the original ontologies.",
        "The two original ontologies persist, with links established between them in alignment.",
        "Alignment usually is performed when the ontologies cover domains that are complementary to each other.",
        "In the past, domain ontology was usually constructed manually according to the knowledge or experience of the experts or ontology engineers.",
        "Recently, automatic and semi-automatic methods have been developed.",
        "OntoExtract (Fensel et al.",
        "2002) (Missikoff et al.",
        "2002) provided an ontology engineering chain to construct the domain ontology from WordNet and SemCor.",
        "On the other hand, multilingual ontology is very important for natural language processing, such as machine translation (MT), web mining and cross language information retrieval (CLIR).",
        "Generally, a multilingual ontology maps the keyword set of one language to another language, or compute the co-occurrence of the words among languages.",
        "In addition, a key merit for multilingual ontology is that it can increase the relation and structural information coverage by aligning two or more language-dependent ontologies with different semantic features.",
        "Nowadays large collections of information in various styles are available on the Internet.",
        "And finding desired information on the World Wide Web is becoming a critical issue.",
        "Some general-purpose search engine like Google (http://www.google.com) and Altavista (http://www.altavista.com/) provide the facility to mine the web.",
        "There are three major research areas about web mining: web content mining, web structure mining and web usage mining.",
        "This paper proposes a novel method to web content mining with unstructured web pages.",
        "There are many approaches in the view of natural language processing.",
        "According to the representation of web pages, there are three kinds of the content: bag of words (with order or not) (Kargupta et al.",
        "1997) (Nahm and Mooney, 2000), phrases (Ahonen et al.",
        "1998) (Frank et al.",
        "1999)(Yang et al.",
        "1999), relational terms (Cohen, 1998) (Junker 1999) and concept categories.",
        "We proposed an ontology-based web search approach.",
        "Unfortunately, there are some irrelevant pages obtained and these pages result in low precision rate and recall rate due to the problem of polysemy.",
        "To solve this problem, domain knowledge becomes necessary.",
        "The domain-specific web miners like SPIRAL, Cora (Cohen, 1998), WebKB (Martin and Eklund 2000) and HelpfulMed (Chen et al.",
        "2003) are employed as the special search engine for the interesting topic.",
        "These ones dedicated to recipes are less likely to return irrelevant web pages when the query is entered.",
        "In this paper, WordNet and HowNet knowledge bases are aligned to construct a bilingual universal ontology based on the co-occurrence of the words in a parallel corpus.",
        "For domain-specific applications, a medical domain ontology is further extracted from the universal ontology using the island-driven algorithm (Lee et al.",
        "1995) and a medical domain corpus.",
        "Finally, the axioms between medical terms are derived based on semantic relations.",
        "A web search system for medical domain based on the extracted domain ontology is realized to demonstrate the feasibility of the methods proposed in this paper.",
        "The rest of the paper is organized as follows.",
        "Section 2 describes ontology construction process and the web searching system framework.",
        "Section 3 presents the experimental results for the evaluation of our approach.",
        "Section 4 gives some concluding remarks."
      ]
    },
    {
      "heading": "2 Methodologies",
      "text": [
        "Figure 1 shows the block diagram for ontology construction and the framework of the domain-specific web search system.",
        "There are four major processes in the proposed system: bilingual ontology alignment, domain ontology extraction, knowledge representation and domain-specific web search."
      ]
    },
    {
      "heading": "2.1 Bilingual Ontology Alignment",
      "text": [
        "In this approach, the cross-lingual ontology is constructed by aligning the words in WordNet with their corresponding words in HowNet.",
        "First, the Sinorama (Sinorama 2001) database is adopted as the bilingual language parallel corpus to compute the conditional probability of the words in WordNet, given the words in HowNet.",
        "Second, a bottom up algorithm is used for relation mapping.",
        "In WordNet a word may be associated with many synsets, each corresponding to a different sense of the word.",
        "When we look for a relation between two different words we consider all the synsets associated with each word (Christiane 1998).",
        "In HowNet, each word is composed of primary features and secondary features.",
        "The primary features indicate the word’s category.",
        "The purpose of this approach is to increase the relation and structural information coverage by aligning the above two language-dependent ontologies, WordNet and HowNet, with different semantic features.",
        "The relation “is-a” defined in WordNet corresponds to the primary feature defined in HowNet.",
        "Equation (1) shows the mapping between the words in HowNet and the synsets in WordNet.",
        "Given a Chinese word, CW, , the probability of the word related to synset, synsetk , can be obtained via its corresponding English synonyms, EWjk, j =1, ..., m , which are the elements in synsetk .",
        "The probability is estimated as follows.",
        "where",
        "In the above equation, N(synsetjk , EWjk, CW,. )",
        "represents the number of co-occurrences of CW, , EWjk and synset .",
        "The probability Pr(EWk |CW,) is set to one when at least one of the primary features, PFl (CW,) , of the Chinese word defined in the HowNet matches one of the ancestor nodes of synset , synset, (EWj) except the root nodes in the hierarchical structures of the noun and verb; Otherwise set to zero.",
        "That is,",
        "(3) where {enitity,event,act,play} is the conceptsetin the rootnodes ofHowNetand WordNet.",
        "There are two phases to construct the domain ontology: 1) extractthe ontology fromthe cross-language ontology byisland-drivenalgorithm, and 2) integrate the terms and axioms definedina medical encyclopaediainto the domainontology.",
        "2.2.1 Extraction byisland-drivenalgorithm Ontologyprovides consistent concepts andworld representations necessary forclearcommunication withinthe knowledge domain.",
        "Evenindomain-specific applications, the numberofwords canbe expectedto be numerous.",
        "Synonympruning is an effective alternative to wordsense disambiguation.",
        "This paperproposes acorpus-basedstatistical approachto extracting the domainontology.",
        "The steps are listedas follows:",
        "in the domain corpus is higherthan that in its corresponding contrastive (out-of-domain) corpus.",
        "That is,",
        "0, Otherwise where Tf − idfDomain (li) = fregi,Domain × log ni,Domain + ni,Contrastive ni,Domain Tf − idfContrastive (li) = fregi,Contrastive × log In the above equations, fregi,Domain and fregi,Contrastive are the frequencies of word Wi in the domain documents and its contrastive (out-of-domain) documents, respectively.",
        "ni,Domain and ni,Contrastive are the numbers of the documents containing word Wi in the domain documents and its contrastive documents, respectively.",
        "The nodes with bold circle in Figure 2 represent the operative nodes.",
        "Step 3: Relational expansion using the island-driven algorithm: There are some domain concepts not operative after the previous steps due to the problem of insufficient data.",
        "From the observation in ontology construction, most of the inoperative concept nodes have operative hypernym nodes and hyponym nodes.",
        "Therefore, the island-driven algorithm is adopted to activate these inoperative concept nodes if their ancestors and descendants are all operative.",
        "The nodes with gray background shown in Figure 2 are the activated operative nodes.",
        "Step 4: Domain ontology extraction: The final step is to merge the linear vertex list sequence into a hierarchical tree.",
        "However, some noisy concepts not belonging to this domain ontology are operative after step 3.",
        "These noisy nodes with inoperative noisy concepts should be filtered out automatically.",
        "Finally, the domain ontology is extracted and the final result is shown in Figure 3.",
        "After the above steps, a dummy node is added as the root node of the domain concept tree.",
        "Figure 3 The domain ontology after filtering out the isolated concepts",
        "In practice, specific domain terminologies and axioms should be derived and introduced into the ontology for domain-specific applications.",
        "In our approach, 1213 axioms derived from a medical encyclopaedia have been integrated into the domain ontology.",
        "Figure 4 shows an example of the axiom.",
        "In this example, the disease “diabetes” is tagged as level “A” which represents that this disease is frequent in occurrence.",
        "And the degrees for the corresponding syndromes represent the causality between the disease and the syndromes.",
        "The axioms also provide two fields “department of the clinical care” and “the category of the disease” for medical information retrieval."
      ]
    },
    {
      "heading": "2.3 Domain-specific web search",
      "text": [
        "This paper proposed a medical web search engine based on the constructed medical domain ontology.",
        "The engine consists of natural language interface, web crawler and indexer, relation inference module and axiom inference module.",
        "The functions and techniques of these modules are described as follows."
      ]
    },
    {
      "heading": "2.3.1 Natural language interface and web crawler and indexer",
      "text": [
        "Natural language interface is generally considered as an enticing prospect because it offers many advantages: it would be easy to learn and easy to remember, because its structure and vocabulary are already familiar to the user; it is particularly powerful because of the multitude of ways in which to accomplish a search action by using the natural language input.",
        "A natural language query is transformed to obtain the desired representation after the word segmentation, removing the stop words, stemming and tagging process.",
        "The web crawler and indexer are designed to seek medical web pages from Internet, extract the content and establish the indices automatically."
      ]
    },
    {
      "heading": "2.3.2 Concept inference module",
      "text": [
        "For semantic representation, traditionally, the keyword-based systems will introduce two problems.",
        "First, ambiguity usually results from the polysemy of words.",
        "The domain ontology will give a clear description of the concepts.",
        "In addition, not all the synonyms of the word should be expanded without constraints.",
        "Secondly, relations between the concepts should be expanded and weighted in order to include more semantic information for semantic inference.",
        "We treat each of the user’s input and the content of web pages as a sequence of words.",
        "This means that the sequence of words is treated as a bag of words regardless of the word order.",
        "For the word sequence of the user’s input,",
        "and the word sequence of the web page,",
        "The similarity between input query and the page is defined as the similarity between the two bags of words.",
        "The similarity measure based on key concepts in the ontology is defined as follows.",
        "ofaweb searchsystemin atechnical domain are definedto describe the relationship between syndromes anddiseases.",
        "This aspect is the use of specific terms usedinthe medical domain.",
        "We collectedthe dataaboutsyndromes and diseases fromamedical encyclopediaan d tagged the",
        "To evaluate the proposedapproach, amedical web search systemwas constructed.",
        "The web pages were collectedfromseveral Websites andtotally 2322 web pages formedical domain and 8133 web pages forcontrastive domain were collected.",
        "Onthe otherhand, the training and testqueries fortrainingand evaluating the systemperformance were also collected.",
        "Forty users, who do nottake partinthe systemdevelopment, were askedto provide aset ofqueries given the collectedweb pages.",
        "Afterpost-processing, the duplicate queries andthe queries outofthe medical domainare removed.",
        "Finally, 3207 testqueri es mixed Chinese with English words using natural language were obtained."
      ]
    },
    {
      "heading": "3.1 Keyword-Based VSMApproach: A",
      "text": [
        "baseline system forcomparison Inrecentyears, mostofthe information retrieval approaches were basedonthe Vector-Space Model (VSM).",
        "Assumingthatthe query is denotedas a vectorq = (q1, q2,..., qn) an d the web page is diseases with three levels accordingto its occurrence andsyndromes with fourlevels according to its significance to the specific disease.",
        "ifadisease occurs inthe inputqueryandits correspondingsyndromes appearin the web page.",
        "Similarly, ifsyndrome occurs in the inputqueryand its correspondingdisease appears in the web page,",
        "where Hkl is concept similarity of wAl and wqk.",
        "Most of the keyword expansion approaches use the extension of scope by the synonyms.",
        "In this paper the similarity, Hkl, is defined as",
        "represented as a vector A = (a1 , a2,..., an) .",
        "The Tf-idf measure is employed and the similarity can be measured by the cosine function defined as follows."
      ]
    },
    {
      "heading": "3.3 Evaluation on different inference modules",
      "text": [
        "In the following experiments, web pages were separately evaluated by focusing on one inference module based on the domain-specific ontology at a time.",
        "That is, the mixture weight is set to 1 for one inference module and the other is set to 0 in each evaluation.",
        "For comparison, the keyword-based VSM approach and the ontology-based system are also evaluated and shown in Figure 6.",
        "The precision and recall rates are used as the evaluation measures.",
        "And the ontology based approach means the combination of concept inference and axiom inference described in the section 3.2."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "This paper has presented an approach to automated ontology alignment and domain ontology extraction from two knowledge bases.",
        "In this approach, a bilingual ontology is developed using a corpus-based statistical approach from two well established language-dependent knowledge bases, WordNet and HowNet.",
        "A domain-dependent ontology is further extracted from the universal ontology using the island-driven algorithm and a domain corpus.",
        "In addition, domain-specific terms and axioms are also added into the domain ontology.",
        "We have applied the domain-specific ontology to the web page search in medical domain.",
        "The experimental results show that the proposed approach outperformed the keyword-based and synonym expansion approaches."
      ]
    },
    {
      "heading": "References",
      "text": [
        "N. Asanoma.",
        "2001 Alignment of Ontologies: WordNet and Goi-Taikei.",
        "WordNet and Other Lexical Resources Workshop Program, NAACL2001.",
        "89-94 Christiane Fellbaum, 1998 WordNet an electronic Lexical Database, The MIT Press 1998. pp307308 Fensel, D., Bussler, C., Ding, Y., Kartseva1, V., Klein, M., Korotkiy, M., Omelayenko, B. and Siebes R. 2002 Semantic Web Application Areas, the 7th International Workshop on Applications of Natural Language to Information Systems (NLDB02).",
        "M. Missikoff,, R. Navigli, and P. Velardi.",
        "2002 Integrated approach to Web ontology learning and engineering, Computer , Volume: 35 Issue: 11 .",
        "60 –63",
        "where a =1 .",
        "This approach for key term expansion based on synonym set is also adopted in the baseline system.",
        "The results and discussions are described in the following sections."
      ]
    },
    {
      "heading": "3.2 Weight determination using 11-avgP score",
      "text": [
        "The medical domain web search system is modeled by the linear combination of relational inference model and axiom inference model.",
        "The normalized weight factor, α , is employed for concept expansion as follows.",
        "Sim(A. , q) = (1− α)Simlation (Ai., q) + α × Simaxiom (Ai., q) (9) This experiment is conducted on the estimation of the combination weights for each model.",
        "The results are shown in Figure 5.",
        "The performance measure called 11-AvgP [Eichmann and Srinivasan 1998] was used to summarize the precision and recall rates.",
        "The best 11-AvgP score will be obtained when the weight α = 0.428."
      ]
    }
  ]
}
