{
  "info": {
    "authors": [
      "Caroline Sporleder",
      "Mirella Lapata"
    ],
    "book": "SIGDAT Conference on Empirical Methods in Natural Language Processing",
    "id": "acl-W04-3210",
    "title": "Automatic Paragraph Identification: A Study Across Languages and Domains",
    "url": "https://aclweb.org/anthology/W04-3210",
    "year": 2004
  },
  "references": [
    "acl-A00-1012",
    "acl-A97-1004",
    "acl-E03-1053",
    "acl-J02-1002",
    "acl-J97-1003",
    "acl-P01-1017",
    "acl-P01-1064",
    "acl-W03-1009"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper we investigate whether paragraphs can be identified automatically in different languages and domains.",
        "We propose a machine learning approach which exploits textual and discourse cues and we assess how well humans perform on this task.",
        "Our best models achieve an accuracy that is significantly higher than the best baseline and, for most data sets, comes to within 6% of human performance."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Written texts are usually broken up into sentences and paragraphs.",
        "Sentence splitting is a necessary preprocessing step for a number of Natural Language Processing (NLP) tasks including part-of-speech tagging and parsing.",
        "Since sentence-final punctuation can be ambiguous (e.g., a period can also be used in an abbreviation as well as to mark the end of a sentence), the task is not trivial and has consequently attracted a lot of attention (e.g., Rey-nar and Ratnaparkhi (1997)).",
        "In contrast, there has been virtually no previous research on inferring paragraph boundaries automatically.",
        "One reason for this is that paragraph boundaries are usually marked unambiguously by a new line and extra white space.",
        "However, a number of applications could benefit from a paragraph detection mechanism.",
        "Text-to-text generation applications such as single and multidocument summarisation as well as text sim-plifi cation usually take naturally occurring texts as input and transform them into new texts satisfying specific constraints (e.g., length, style, language).",
        "The output texts do not always preserve the structure and editing conventions of the original text.",
        "In summarisation, for example, sentences are typically extracted verbatim and concatenated to form a summary.",
        "Insertion of paragraph breaks could improve the readability of the summaries by indicating topic shifts and providing visual targets to the reader (Stark, 1988).",
        "Machine translation is another application for which automatic paragraph detection is relevant.",
        "Current systems deal with paragraph boundary insertion in the target language simply by preserving the boundaries from the source language.",
        "However, there is evidence for cross-linguistic variation in paragraph formation and placement, particularly for languages that are not closely related such as English and Chinese (Zhu, 1999).",
        "So, a paragraph insertion mechanism that is specific to the target language, instead of one that relies solely on the source language, may yield more readable texts.",
        "Paragraph boundary detection is also relevant for speech-to-text applications.",
        "The output of automatic speech recognition systems is usually raw text without any punctuation or paragraph breaks.",
        "This naturally makes the text very hard to read, which can cause processing difficulties, especially if speech recognition is used to provide deaf students with real-time transcripts of lectures.",
        "Furthermore, sometimes the output of a speech recogniser needs to be processed automatically by applications such as information extraction or summarisation.",
        "Most of these applications (e.g., Christensen et al., (2004)) port techniques developed for written texts to spoken texts and therefore require input that is punctuated and broken into paragraphs.",
        "While there has been some research on finding sentence boundaries in spoken text (Stevenson and Gaizauskas, 2000), there has been little research on determining paragraph boundaries.1 If paragraph boundaries were mainly an aesthetic device for visually breaking up long texts into smaller chunks, as has previously been suggested (see Longacre (1979)), paragraph boundaries could be easily inserted by splitting a text into several equal-size segments.",
        "Psycholinguistic research, however, indicates that paragraph boundaries are not purely aesthetic.",
        "For example, Stark (1988)",
        "asked her subjects to reinstate paragraph boundaries into fiction texts from which all boundaries had been removed and found that humans are able to do so with an accuracy that is higher than would be expected by chance.",
        "Crucially, she also found that (a) individual subjects did not make all their paragraphs the same length and (b) paragraphs in the original text whose length deviated significantly from the average paragraph length were still iden-tifi ed correctly by a large proportion of subjects.",
        "These results show that people are often able to identify paragraphs correctly even if they are exceptionally short or long without defaulting to a simple template of average paragraph length.",
        "Human agreement on the task suggests that the text itself provides cues for paragraph insertion, even though there is some disagreement over which specific cues are used by humans (see Stark (1988)).",
        "Possible cues include repeated content words, pronoun coreference, paragraph length, and local semantic connectedness.",
        "In this paper, we investigate whether it is possible to exploit some of these textual cues together with syntactic and discourse related information to determine paragraph boundaries automatically.",
        "We treat paragraph boundary identification as a classi-fi cation task and examine whether the difficulty of the task and the utility of individual textual cues varies across languages and across domains.",
        "We also assess human performance on the same task and whether it differs across domains."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Previous work has focused extensively on the task of automatic text segmentation whose primary goal is to divide individual texts into subtopics.",
        "Despite their differences, most methods are unsupervised and typically rely on the distribution of words in a given text to provide cues for topic segmentation.2 Hearst’s (1997) TextTiling algorithm, for example, determines subtopic boundaries on the basis of term overlap in adjacent text blocks.",
        "In more recent work, Utiyama and Isahara (2001) combine a statistical segmentation model with a graph search algorithm to find the segmentation with the maximum probability.",
        "Beeferman et al.",
        "(1999) use supervised learning methods to infer boundaries between texts.",
        "They employ language models to detect topic shifts and combine them with cue word features.",
        "Our work differs from these previous approaches in that paragraphs do not always correspond to subtopics.",
        "While topic shifts often correspond to paragraph breaks, not all paragraph breaks indicate a topic change.",
        "Breaks between paragraphs are often inserted for other (not very well understood) reasons (see Stark (1988)).",
        "Therefore, the segment granularity is more fine-grained for paragraphs than for topics.",
        "An important advantage for methods developed for paragraph detection (as opposed to those developed for text-segmentation) is that training data is readily available, since paragraph boundaries are usually unambiguously marked in texts.",
        "Hence, supervised methods are “cheap” for this task."
      ]
    },
    {
      "heading": "3 Our Approach",
      "text": []
    },
    {
      "heading": "3.1 Corpora",
      "text": [
        "Our study focused on three languages: English, German, and Greek.",
        "These languages differ in terms of word order (fixed in English, semi-free in German, fairly flexible in Greek).",
        "Greek and German also have richer morphology than English.",
        "Additionally, Greek has a non-Latin writing system.",
        "For each language we created corpora representative of three domains: fiction, news, and parliamentary proceedings.",
        "Previous work on the role of paragraph markings (Stark, 1988) has focused exclusively on fiction texts, and has shown that humans can identify paragraph boundaries in this domain reliably.",
        "It therefore seemed natural to test our automatic method on a domain for which the task has been shown to be feasible.",
        "We selected news texts since most summarisation methods today focus on this domain and we can therefore explore the relevance of our approach for this application.",
        "Finally, parliamentary proceedings are transcripts of speech, and we can examine whether a method that relies solely on textual cues is also useful for spoken texts.",
        "For English, we used the whole Hansard section of the BNC, as our corpus of parliamentary proceedings.",
        "We then created a fiction corpus of similar size by randomly selecting prose files from the fiction part of the BNC.",
        "In the same way a news corpus was created from the Penn Treebank.",
        "For German, we used the prose part of Project Gutenberg’s e-book collection3 as our fiction corpus and the complete Frankfurter Rundschau part of the ECI corpus4 as our news corpus.",
        "The corpus of parliamentary proceedings was obtained by randomly",
        "selecting a subset of the German section from the Europarl corpus (Koehn, 2002).",
        "For Greek, a fiction corpus was compiled from the ECI corpus by selecting all prose files that contained paragraph markings.",
        "Our news corpus was downloaded from the WWW site of the Modern Greek newspaper Eleftherotypia and consists of fi - nancial news from the period of 2001–2002.",
        "A corpus of parliamentary proceedings was again created by randomly selecting a subset of the Greek section of the Europarl corpus (Koehn, 2002).",
        "Parts of the data were further preprocessed to insert sentence boundaries.",
        "We trained a publicly available sentence splitter (Reynar and Ratnaparkhi, 1997) on a small manually annotated sample (1,000 sentences per domain per language) and applied it to our corpora.",
        "Table 1 shows the corpus sizes.",
        "All corpora were split into training (72%), development (24%) and test set (4%)."
      ]
    },
    {
      "heading": "3.2 Machine Learning",
      "text": [
        "We used BoosTexter (Schapire and Singer, 2000) as our machine learning system.",
        "BoosTexter was originally developed for text categorisation and combines a boosting algorithm with simple decision rules.",
        "For all domains and languages our training examples were sentences.",
        "Class labels encoded for each sentence whether it was starting a paragraph or not.",
        "The features we used fall broadly into three different areas: non-syntactic features, language modelling features and syntactic features.",
        "The latter were only applied to English as we did not have suitable parsers for German and Greek.",
        "The values of our features are numeric, boolean or “text”.",
        "BoosTexter applies unigram models when forming classification hypotheses for features with “text” values.",
        "These can be simply words or annotations such as part-of-speech tags.",
        "We deliberately did not include anaphora-based features.",
        "While anaphors can help determine paragraph boundaries (paragraph initial sentences tend to contain few or no anaphors), anaphora structure is dependent on paragraph structure rather than the other way round.",
        "Hence, in applications which manipulate texts and thereby potentially “mess-up” the anaphora structure (e.g., multi-document summarisation), anaphors are not a reliable cue for paragraph identifi cation.5",
        "Distance (Ds, D,,,): These features encode the distance of the current sentence from the previous paragraph break.",
        "We measured distance in terms of the number of intervening sentences (Ds) as well as in terms of the number of intervening words (D,,,).",
        "If paragraph breaks were driven purely by aesthetics one would expect this feature to be among the most successful ones.6 Sentence Length (Length): This feature encodes the number of words in the current sentence.",
        "Average sentence length is known to vary with text position (Genzel and Charniak, 2003) and it is possible that it also varies with paragraph position.",
        "Relative Position (Pos): The relative position of a sentence in the text is calculated by dividing the current sentence number by the number of sentences in the text.",
        "The motivation for this feature is that paragraph length may vary with text position.",
        "For example, it is possible that paragraphs at the beginning and end of a text are shorter than paragraphs in the middle and hence a paragraph break is more likely at the two former text positions.",
        "Quotes (Quotep, Quote,, Quotes): These features encode whether the previous or current sentence contain a quotation (Quotep and Quote,, respectively) and whether the current sentence continues a quotation that started in a preceding sentence (Quotes).",
        "The presence of quotations can provide cues for speaker turns, which are often signalled by paragraph breaks.",
        "Final Punctuation (FinPun): This feature keeps track of the final punctuation mark of the previous sentence.",
        "Some punctuation marks may provide hints as to whether a break should be introduced.",
        "For example, in the news domain, where there is hardly any dialogue, if the previous sentence ended in a question mark, it is likely that the current sentence supplies an answer to this question, thus making a paragraph break improbable.",
        "Words (W1, W2, W3, Wall): These text-valued features encode the words in the sentence.",
        "Wall takes the complete sentence as its value.",
        "W1, W2 and W3 encode the first word, the first two words and the first three words, respectively."
      ]
    },
    {
      "heading": "3.2.2 Language Modelling Features",
      "text": [
        "Our motivation for including language modelling features stems from Genzel and Charniak’s (2003) work where they show that the word entropy rate is lower for paragraph initial sentences than for non-paragraph initial ones.",
        "We therefore decided to examine whether word entropy rate is a useful feature for the paragraph prediction task.",
        "Using the training set for each language and domain, we created language models with the CMU language modelling toolkit (Clarkson and Rosenfeld, 1997).",
        "We experimented with language models of variable length (i.e., 1–5) and estimated two features: the probability of a given sentence according to the language model (LMp) and the per-word entropy rate (LMpw,).",
        "The latter was estimated by dividing the sentence probability as assigned by the language model by the number of sentence words (see Genzel and Charniak (2003)).",
        "We additionally experimented with character level n-gram models.",
        "Such models are defined over a relatively small vocabulary and can be easily constructed for any language without preprocessing.",
        "Character level n-gram models have been applied to the problem of authorship attribution and obtained state-of-the art results (Peng et al., 2003).",
        "If some characters are more often attested in paragraph starting sentences (e.g., “A” or “T”), then we expect these sentences to have a higher probability compared to non-paragraph starting ones.",
        "Again, we used the CMU toolkit for building the character level n-gram models.",
        "We experimented with models whose length varied from 2 to 8 and estimated the probability assigned to a sentence according to the character level model (CMp)."
      ]
    },
    {
      "heading": "3.2.3 Syntactic Features",
      "text": [
        "For the English data we also used several features encoding syntactic complexity.",
        "Genzel and Charniak (2003) suggested that the syntactic complexity of sentences varies with their position in a paragraph.",
        "Roughly speaking, paragraph initial sentences are less complex.",
        "Hence, complexity measures may be a good indicator of paragraph boundaries.",
        "To estimate complexity, we parsed the texts with Charniak’s (2001) parser and implemented the following features: Parsed: This feature states whether the current sentence could be parsed.",
        "While this is not a real measure of syntactic complexity it is probably correlated with it.",
        "Number of phrases (nums, numvp, numnp, numpp): These features measure syntactic complexity in terms of the number of S, VP, NP, and PP constituents in the parse tree.",
        "Signature (Sign, Signp): These text-valued features encode the sequence of part-of-speech tags in the current sentence.",
        "Sign only encodes word tags, while Signp also includes punctuation tags.",
        "Children of Top-Level Nodes (Childrsl, Childrs): These text-valued features encode the top-level complexity of a parse tree: Childrsl takes as its value the sequence of syntactic labels of the children of the S1-node (i.e., the root of the parse tree), while Childrs encodes the syntactic labels of the children of the highest S-node(s).",
        "For example, Childrsl may encode that the sentence consists of one clause and Childrs may encode that this clause consists of an NP, a VP, and aPP.",
        "Branching Factor (Branchs, Branchvp, Branchnp, Branchpp): These features express the average number of children of a given non-terminal constituent (cf. Genzel and Charniak (2003)).",
        "We compute the branching factor for S, VP, NP, and PP constituents.",
        "Tree Depth: We define tree depth as the average length of a path (from root node to leaf node).",
        "Cue Words (Cues, Cuem, Cue,): These features are not strictly syntactic but rather discourse-based.",
        "They encode discourse cues (such as because) at the start (Cues), in the middle (Cuem) and at the end (Cue,) of the sentence, where “start” is the first word, “end” the last one, and everything else is “middle”.",
        "We keep track of all cue word occurrences, without attempting to distinguish between their syntactic and discourse usages.",
        "For English, there are extensive lists of discourse cues (we used Knott (1996)), but such lists are not widely available for German and Greek.",
        "Hence, we only used this feature on the English data."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": [
        "BoosTexter is parametrised with respect to the number of training iterations.",
        "In all our experiments, this parameter was optimised on the development set; BoosTexter was initially trained for 500 iterations, and then retrained with the number of iterations that led to the lowest error rate on the development set.",
        "Throughout this paper all results are reported on the unseen test set and were obtained using models optimised on the development set.",
        "We report the models’ accuracy at predicting the right label (i.e., paragraph starting or not) for each sentence."
      ]
    },
    {
      "heading": "4.1 The Influence of Non-syntactic Features",
      "text": [
        "In the first set of experiments, we ran BoosTexter on all 9 corpora using non-syntactic and language modelling features.",
        "To evaluate the contribution of individual features to the classification task, we built one-feature classifiers in addition to a classifier that combined all features.",
        "Table 2 shows the test set classification accuracy of the individual features and their combination (all,,,, l�,,,�).",
        "The length of the language and character models was optimised on the development set.",
        "The test set accuracy of the optimised models is shown as BestLMp and BestLMpal� (language models) and BestCMp (character models).7 The results for the three best performing one-feature classifiers and the combined classifier are shown in boldface.",
        "BoosTexter’s classification accuracy was further compared against two baselines.",
        "A distance-based baseline (Bd) was obtained by hypothesising a paragraph break after every d sentences.",
        "We estimated d in the training data by counting the average number of sentences between two paragraphs.",
        "Our second baseline, B,,,, defaults to the majority class, i.e., assumes that the text does not have paragraph breaks.",
        "For all languages and domains, the combined models perform better than the best baseline.",
        "In order to determine whether this difference is signifi - cant, we applied χ2 tests.",
        "The diacritic ( ) in Ta-7Which language and character models perform best varies slightly across corpora but no clear trends emerge.",
        "ble 2 indicates whether a given model is (not) sig-nifi cantly different from the best baseline.",
        "Signifi - cant results are achieved across the board with the exception of German fiction.",
        "We believe the reason for this lies in the corpus itself, as it is very heterogeneous, containing texts whose publication date ranges from 1766 to 1999 and which exhibit a wide variation in style and orthography.",
        "This makes it difficult for any given model to reliably identify paragraph boundaries in all texts.",
        "In general, the best performing features vary across domains but not languages.",
        "Word features (W1–W3 , Wall) yield the best classification accuracies for news and parliamentary domains, whereas for fiction, quotes and punctuation seem more useful.",
        "The only exception is the German fiction corpus, which consists mainly of 19th century texts.",
        "These contain less direct speech than the two fi ction corpora for English and Greek (which contain contemporary texts).",
        "Furthermore, while examples of direct speech in the English corpus often involve short dialogues, where a paragraph boundary is introduced after each speaker turn, the German corpus contains virtually no dialogues and examples of direct speech are usually embedded in a longer narrative and not surrounded by paragraph breaks.",
        "Note that the distance in words from the previous paragraph boundary (Distal) is a good indicator for a paragraph break in the English news domain.",
        "However, this feature is less useful for the other two languages.",
        "An explanation might be that the English news corpus is very homogeneous (i.e., it contains articles that not only have similar content but are also structurally alike).",
        "The Greek news corpus is relatively homogeneous; it mainly contains financial news articles but also some interviews, so there is greater variation in paragraph length, which means that the distance feature is overtaken by the word-based features.",
        "Finally, the German news corpus is highly heterogeneous, containing not only news stories but also weather forecasts, sports results and cinema listings.",
        "This leads to a large variation in paragraph length, which in turn means that the distance feature performs worse than the best baseline.",
        "The heterogeneity of the German news corpus may also explain another difference: while the fi - nal punctuation of the previous sentence (FinPun) is among the less useful features for English and Greek (albeit still outperforming the baseline), it is the best performing feature for German.",
        "The German news corpus contains many “sentences” that end in atypical end-of-sentence markers such as semicolons (which are found often in cinema listings).",
        "Atypical markers will often not occur before paragraph breaks, whereas typical markers will.",
        "This fact renders final punctuation a better predictor of paragraph breaks in the German corpus than in the other two corpora.",
        "The language models behave similarly across domains and languages.",
        "With the exception of the news domain, they do not seem to be able to outperform the majority baseline by more than 1%.",
        "The word entropy rate yields the worst performance, whereas character-based models perform as well as word-based models.",
        "In general, our results show that language modelling features are not particularly useful for this task."
      ]
    },
    {
      "heading": "4.2 The Influence of Syntactic Features",
      "text": [
        "Our second set of experiments concentrated solely on the English data and investigated the usefulness of the syntactic features (see Table 3).",
        "Again, we created one-feature classifiers and a classifier that combined all features, i.e., language and character models, non-syntactic, and syntactic features (all,,s lc,p sy,,).",
        "Table 3 also repeats the performance of the two baselines (Bd and B,p) and the combined non-syntactic models (all,,slc,p).",
        "The accuracies of the three best performing one-feature models and the combined model are again shown in boldface.",
        "As can be seen, syntactic features do not contribute very much to the overall performance.",
        "They only increase the accuracy by about 1%.",
        "A x2 test",
        "revealed that the difference between all,,s lc,p and all,,s lc,p sy,, is not statistically significant (indicated by ✁† in Table 3) for any of the three domains.",
        "The syntactic features seem to be less domain dependent than the non-syntactic ones.",
        "In general, the part-of-speech signature features (Sign, Signp) are a good predictor, followed by the syntactic labels of the children of the top nodes (Childrs, Childrs1 ).",
        "The number of NPs (Num,,p) and their branching factor (Branch,,p) are also good indicators for some domains, particularly the news domain.",
        "This is plausible since paragraph initial sentences in the Wall Street Journal often contain named entities, such as company names, which are parsed as flat NPs, i.e., have a relatively high branching factor."
      ]
    },
    {
      "heading": "4.3 The Effect of Training Size",
      "text": [
        "Finally, we examined the effect of the size of the training data on the learner’s classification accuracy.",
        "We conducted our experiments solely on the English data, however we expect the results to generalise to German and Greek.",
        "From each English training set we created ten progressively smaller data sets, the first being identical to the original set, the second containing 9/10 of sentences in the original train-Fiction",
        "ing set, the third containing 8/10, etc.",
        "The training instances in each data set were selected randomly.",
        "BoosTexter was trained on each of these sets (using all features), as described previously, and tested on the test set.",
        "Figure 1 shows the learning curves obtained this way.",
        "The curves are more or less flat, i.e., increasing the amount of training data does not have a large effect on the performance of the model.",
        "Furthermore, even the smallest of our training sets is big enough to outperform the best baseline.",
        "Hence, it is possible to do well on this task even with less training data.",
        "This is important, given that for spoken texts, paragraph boundaries may have to be obtained by manual annotation.",
        "The learning curves indicate that relatively modest effort would be required to obtain training data were it not freely available."
      ]
    },
    {
      "heading": "4.4 Human Evaluation",
      "text": [
        "We established an upper bound against which our automatic methods could be compared by conducting an experiment that assessed how well humans agree on identifying paragraph boundaries.",
        "Five participants were given three English texts (one from each domain), selected randomly from the test corpus.",
        "Each text consisted of approximately a tenth of the original test set (i.e., 200–400 sentences).",
        "The participants were asked to insert paragraph breaks wherever it seemed appropriate to them.",
        "No other instructions were given, as we wanted to see whether they could independently perform the task without any specific knowledge regarding the domains and their paragraphing conventions.",
        "We measured the agreement of the judges using the Kappa coefficient (Siegel and Castellan, 1988) but also report percentage agreement to facilitate comparison with our models.",
        "In all cases, we compute pairwise agreements and report the mean.",
        "Our results are shown in Table 4.",
        "As can be seen, participants tend to agree with each other on the task.",
        "The least agreement is observed for the news domain.",
        "This is somewhat expected as the Wall Street Journal texts are rather dif-fi cult to process for non-experts.",
        "Also remember, that our subjects were given no instructions or training.",
        "In all cases our models yield an accuracy lower than the human agreement.",
        "For the fiction domain the best model is 5.67% lower than the upper bound, for the news domain it is 5.62% and for the parliament domain it is 5.42% (see Tables 4 and 3)."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "In this paper, we investigated whether it is possible to predict paragraph boundaries automatically using a supervised approach which exploits textual, syntactic and discourse cues.",
        "We achieved accuracies between 71.83% and 83.92%.",
        "These were in all but one case significantly higher than the best baseline.",
        "We conducted our study in three different domains and languages and found that the best features for the news and parliamentary proceedings domains are based on word co-occurrence, whereas features that exploit punctuation are better predictors for the fiction domain.",
        "Models which incorporate syntactic and discourse cue features do not lead to significant improvements over models that do not.",
        "This means that paragraph boundaries can be predicted by relying on low-level, language independent features.",
        "The task is therefore feasible even for languages for which parsers or cue word lists are not readily available.",
        "We also experimented with training sets of different sizes and found that more training data does not necessarily lead to significantly better results and that it is possible to beat the best baseline comfortably even with a relatively small training set.",
        "Finally, we examined how well humans do on this task.",
        "Our results indicate that humans achieve an average accuracy of about 77.45% to 88.58%, where some domains seem to be easier than others.",
        "Our models achieved accuracies of within 6% of human performance.",
        "In the future, we plan to apply our model to new domains (e.g., broadcast news or scientific papers), to non-Indo-European languages such as Arabic and Chinese, and to machine generated texts."
      ]
    }
  ]
}
