{
  "info": {
    "authors": [
      "Robert W. Morris",
      "Jon A. Arrowood",
      "Peter S. Cardillo",
      "Mark A. Clements"
    ],
    "book": "Workshop on Interdisciplinary Approaches to Speech Indexing and Retrieval",
    "id": "acl-W04-2904",
    "title": "Scoring Algorithms for Wordspotting Systems",
    "url": "https://aclweb.org/anthology/W04-2904",
    "year": 2004
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "When evaluating wordspotting systems, one normally compares receiver operating characteristic curves and different measures of accuracy.",
        "However, there are many other factors that are relevant to the system’s usability for searching speech.",
        "In this paper, we discuss both measures of quality for confidence scores and propose algorithms for producing scores that are optimal with respect to these criteria.",
        "algorithms for producing scores that are optimal with respect to these criteria."
      ]
    },
    {
      "heading": "2 Assumptions",
      "text": [
        "In order to derive a scoring algorithm, a key assumption must be made by the wordspotting algorithm: each match must have a numeric score associated with it.",
        "In addition, there must be some theoretical basis for an additive decomposition of this score.",
        "This decomposition is given by",
        "In order to evaluate any system, it is useful to have objective quality measures that can be automatically applied to systems for comparison.",
        "For wordspotting systems, these measures are oriented towards recall accuracy.",
        "Most of these measures are based on receiver operating characteristic (ROC) curves and functions of these curves.",
        "However, there are many other factors that are relevant to the systems usability.",
        "When a user enters a query to the Nexidia wordspot-ter (Clements et al., 2001), the system returns a sorted result list that marks the times where the query matches the audio.",
        "In addition, scores are associated with each result.",
        "These scores are related to the likelihood that the tagged audio matches the query.",
        "Although this score gives an indication of the strength of the match, users have had difficulty interpreting the scores.",
        "We found that most users want to use the score in one of two ways.",
        "The first application is to provide a score threshold for monitoring applications.",
        "Alternatively, people also assume that the score reflects the probability that the tagged audio segment is actually a match.",
        "However, without any objective quality measure of these scores, it was difficult to evaluate different score generation algorithms.",
        "In this paper, we discuss both measures of quality for confidence scores and propose where R(q) is the score returned by query q, and R(q) is the score associated with the lth phoneme in the query.",
        "With this assumption, we also assume that these components can be modeled with a Gaussian distribution with dependence on whether the match is truly a hit or a miss.",
        "The distributions are then given by",
        "where Sl(q) is the lth phoneme in query q.",
        "In this model, the means, µ are dependent on the phoneme, but the variance, a2, is not.",
        "Using the additive model, the raw scores are distributed by"
      ]
    },
    {
      "heading": "3 Performance Measures",
      "text": [
        "We propose two scoring evaluation measures.",
        "In each of these methods, the raw score is modified by some scoring function F().",
        "The first measure evaluates a scoring algorithms usefulness for setting detection thresholds.",
        "This method assumes that the scoring function calculates the cdf of the missed score distributions.",
        "The measurement is based on the Kolmogorov-Smirnov test statistic, which is given by",
        "where R(i)M are the raw scores for the false alarms in descending order.",
        "A metric for measuring scoring algorithms based on result confidence is given by where NM and NH are the number of hits and misses.",
        "This value is equal to zero when all hits are scored to one and all misses are scored as zero.",
        "On the other hand, B is equal to 0.5 if F(R) is set to 0.5 regardless of the input."
      ]
    },
    {
      "heading": "4 Algorithms",
      "text": [
        "If one is interested in setting a detection threshold based on false alarms per hour, then one can set the score using the cumulative density function of the misses.",
        "This yields the score",
        "where Q is the cdf of the unit normal distribution.",
        "To set a threshold for K false alarms per hour, then the threshold should be set to",
        "where KT is the range of false alarms per hour that the miss model is trained.",
        "If one is looking at a list of scores, one might be interested in the probability that the score was generated by a true match.",
        "By Bayes law, the conditional probability can be calculated by",
        "where PH is the prior probability of a hit."
      ]
    },
    {
      "heading": "5 ModelTraining",
      "text": [
        "Each of the scoring methods described above require models of how the phonemes relate to the scores through the parameters: µM, µH, σ2M, and σ2H.",
        "For this purpose, a series of hits and misses over the desired range of false alarms rates must be collected from the wordspotter.",
        "With these scores, it is possible to train the miss and hit models independently.",
        "For this reason, only the miss model training is described here.",
        "Given the model in Equation 5, the following distribution holds with N observations:",
        "The maximum likelihood solution for µM and σ2M is a difficult optimization problem.",
        "However, if the phoneme components Rin) from Equation 1, the distribution simplifies to observations of the Gaussian components.",
        "By using the Expectation Maximization (EM) algorithm, the overall likelihood in Equation 11 can be iteratively maximized (Dempster et al., 1977).",
        "Similarly, the training problem can also be viewed in a Bayesian framework, where a Minimum Mean Squared Error (MMSE) estimate can be calculated.",
        "Like the maximum likelihood estimate, this requires an iterative method where the components of the score are generated.",
        "This can be computed by a Gibbs sampler (Gamerman, 1997).",
        "In addition to providing a mechanism for creating meaningful scores, these models can be useful for other purposes.",
        "For example, one can analyze the mean vectors to determine which phonemes provide better discrimination for wordspotting.",
        "These can also be used to diagnose problems in performance that are phoneme specific."
      ]
    },
    {
      "heading": "6 Results",
      "text": [
        "The experiments for this algorithm were conducted using the Nexidia wordspotting system trained on broadcast quality North American English speech.",
        "The effect of using different scoring algorithms was accomplished using a nine hour subset of the HUB-4 1996 North American English broadcast corpus.",
        "This data was chosen since this corpus is widely available and is disjoint from the training data used for the wordspotter.",
        "From this corpus, 8500 search terms were randomly selected from the transcripts.",
        "These queries were equally distributed in length from 4 to 20 phonemes, and then split into a testing and training set.",
        "For each search term, results ranging from the top score down to the 90th false alarm were collected.",
        "The results from the training terms were then used to train the",
        "score models using both the EM algorithm and a Gibbs sampler.",
        "These trained models were then then used to generate both FB and FC for all of the test queries.",
        "In addition, the “Standard” scores were generated.",
        "These scores are what the Nexidia wordspotting product reveals to the users, and are calculated by scaling the raw scores by the number of phonemes and mapping these from zero to one.",
        "The resulting scores from these tests are listed in Table 1.",
        "As expected, the CFAR based score performed well on the KS metric, while the Bayesian score was more accurate on the B measure.",
        "Both of these methods performed much better than the previous ad-hoc “Standard” method.",
        "However, performance improvements on one measure resulted in very poor scores on the other.",
        "This is due to the fact that the objective of each measure is very different.",
        "In addition, the estimation scheme had little effect on the overall scores.",
        "Since the EM algorithm requires a small fraction of the computation that the Gibbs sampler requires, this method is preferable.",
        "To illustrate the differences between the three scoring algorithms, the hits and misses were also collected and plotted in Figure 6.",
        "In each subplot, there are histograms of the hits and misses.",
        "In all three cases, most of the hits tend to have scores close to one.",
        "However, the misses in the standard scoring scheme are concentrated from 0.5 to 0.8.",
        "When the Bayes scoring method is used, half of the hits are very close to 1.0, while half of the misses are very close to 0.0.",
        "The other half of the scores are distributed along the score range.",
        "Finally, the misses from the CFAR scoring algorithm are distributed evenly along entire range of scores.",
        "Because the normal score assumption does not strictly hold, this distribution is not perfectly flat at the start and the end, but it is fairly close."
      ]
    },
    {
      "heading": "7 Conclusions",
      "text": [
        "Several methods for for both generating and evaluating scores from wordspotting systems have been proposed.",
        "These methods can operate on any system that generates scores where an additive model based on phonemes is valid.",
        "The scores that are produced by the algorithms described can be used to both give intuitive confidence levels, as well as provide a simple mechanisms for setting thresholds in monitoring environments.",
        "These methods have been shown to provide superior performance when compared to their relevant metrics."
      ]
    }
  ]
}
