{
  "info": {
    "authors": [
      "Yves Lepage"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C04-1106",
    "title": "Lower and Higher Estimates of the Number of \"true Analogies\" Between Sentences Contained in a Large Multilingual Corpus",
    "url": "https://aclweb.org/anthology/C04-1106",
    "year": 2004
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The reality of analogies between words is refuted by noone (e.g., I walked is to to walk as I laughed is to to laugh, noted I walked: to walk :: I laughed: to laugh).",
        "But computational linguists seem to be quite dubious about analogies between sentences: they would not be enough numerous to be of any use.",
        "We report experiments conducted on a multilingual corpus to estimate the number of analogies among the sentences that it contains.",
        "We give two estimates, a lower one and a higher one.",
        "As an analogy must be valid on the level of form as well as on the level of meaning, we relied on the idea that translation should preserve meaning to test for similar meanings."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "A long tradition in linguistics views analogy as a means for the speaker to analyze or produce new sentences1.",
        "To be linguistically relevant, an analogy should hold on the level of form as well as on the level of meaning.",
        "In contrast to that, in Greek and Latin antiquity, anomaly designated those cases2 where an analogy of meaning is not reflected by an analogy of form.",
        "(e.g., ‘I drink.’ : ‘I’d like to drink.’ :: ‘I can swim.’ : ‘I’d like to be able to swim.’3).",
        "Conversely, the existence of analogies of form that are not verified on the level of meaning has been taken by the Generativists to indicate the independence of syntax (e.g., Abby is baking vegan pies.",
        ": Abby is baking.",
        ":: Abby is too tasteful to pour gravy",
        "on vegan pies.",
        ": Abby is too tasteful to pour gravy on.",
        "4).",
        "The purpose of this study is to estimate the number of “true analogies” present in a large corpus, i. e., analogies which hold both on the level of form, as well as on the level of meaning.",
        "Formally, let us denote ‘A’ as some meaning, and L(‘A’) as the set of all possible ways of realising ‘A’ in a particular language L. Let us denote A as some realisation of ‘A’, i.e., A ∈ L(‘A’).",
        "With these notations, we want to count, in a given corpus, all cases where the following holds5.",
        "The reason for estimating the number of “true analogies” in a large corpus comes from the fact that it has been felt that “true analogies” between sentences are rare.",
        "There is a general feeling that analogy is well attested between words, i.e., on the level of morphology, but not so much between sentences6.",
        "We will show that, at least in the corpus we used, this feeling has to be reconsidered."
      ]
    },
    {
      "heading": "2 The corpus used",
      "text": [
        "For this study, we used the Basic Traveler’s Expression Corpus, or BTEC, for short7.",
        "This is a multilingual corpus of expressions from the travel and tourism domain.",
        "It contains 162,318 aligned translations in several languages.",
        "Here, we shall use Chinese, English and Japanese.",
        "There are 96,234 different sentences in Chinese, 97,769 in English and 103,274 in Japanese8.",
        "The sentences in BTEC are quite short as the figures in Table 1 show."
      ]
    },
    {
      "heading": "3 Analogies on the level of form 3.1 Method",
      "text": [
        "On the level of form, a possible formalisation of analogy between strings of symbols has been proposed (LEPAGE, 2001) which renders an account of some analogies9.",
        "Here, a is a character, whatever the writing system, and A, B, C and D are strings of characters.",
        "IAIa stands for the number of occurrences of a’s in A. dist(A, B) is the edit distance between strings A and B, i.e., the minimal number of insertions and deletions10 of characters necessary to transform A into B.",
        "Obviously, applied to sentences considered as strings of characters (not strings of words), this formalisation can only render an account of analogies on the level of form.",
        "Figure 1 shows examples of analogies meeting the above definition."
      ]
    },
    {
      "heading": "3.2 Results",
      "text": [
        "It takes some ten days to gather all possible analogies of form using the above definition on a Pentium 4 computer at 2.8 Hz with 2 Gb memory for a corpus of around 100,000 sentences.",
        "Of course, we",
        "do not inspect all possible quadruples of sentences.",
        "Rather, a hierarchical coding of sentences based on counts of characters allows us to infer the absence of any analogy within large sets of sentences.",
        "This cuts the computational load.",
        "To compute edit distances, a fast bit string similarity computation algorithm (ALLISON and DIX, 1986) is used.",
        "We counted the number of analogies of form in each of the monolingual Chinese, English and Japanese parts of the corpus using the previous formula.",
        "The examples of Figure 1 are actual examples of analogies retrieved.",
        "Table 2 shows the counts for each language.",
        "The numbers obtained are quite large.",
        "For English, we report around 2.5 million analogies of form involving more than 50,000 sentences.",
        "That is to say, half of the sentences of the corpus are already in immediate analogy with other sentences of the same corpus."
      ]
    },
    {
      "heading": "3.3 Discussion",
      "text": [
        "The average number of analogies of form per sentence in each different language over all unique sentences may be estimated in the following way: 1,639,068 / 96,234 = 17.03 for Chinese, 2,384,202 / 97,769 = 24.39 for English and 1,910,065 / 103,274 = 18.50 for Japanese.",
        "Averaging the sentences involved, this becomes: 5, 059, 979 / 49, 675 = 33, 00 for Chinese, 2, 384, 202 / 53, 250 = 44.77 for English and 1, 910, 065 / 53, 572 = 35.65 for Japanese, which indicates that, on average, there are dozens of different ways to obtain these sentences by analogy with other sentences.",
        "These counts are necessarily higher bounds of the numbers of “true analogies”, as they rely on form only.",
        "For instance, the first analogy in Figure 1 is not a “true analogy”.",
        "However, it is quite difficult to spot such analogies, so that the overall impression is that analogies of form which are not analogies of meaning are exceptions.",
        "So, our next problem will be to try to retain only those analogies which are also analogies of meaning."
      ]
    },
    {
      "heading": "4 A lower estimate: meaning preservation through translation",
      "text": []
    },
    {
      "heading": "4.1 Method",
      "text": [
        "Computing analogies between structural representations is possible11.",
        "Unfortunately, the corpus we have at our disposal does not offer any structural representation.",
        "And it does not seem that tools are yet available which would deliver semantic (not syntactic) representations for all sentences of our corpus in all three languages we deal with.",
        "Fortunately, common sense has it that translation preserves meaning12, and, by definition, a multilingual corpus, like the one we use, contains corresponding utterances in different languages.",
        "Consequently, we shall assume that if two sentences A1 and A2 in two different languages are translations of one another (noted A1 ↔ A2), then, they should be the linguistic realisations of the same meaning, and reciprocally13.",
        "Suppose that at least one analogy of form can be found to hold in every possible language of the world for some possible realisations of four given meanings.",
        "Then, for sure, the analogy of meaning can be said to hold.",
        "If we suppose that the number of languages is finite, let us denote it n, counting the number of “true analogies” in a set of sentences in a given language, say L1, is tantamount to counting the cases described by the following formula (ii).",
        "Of course, the problem is: how to test again all possible languages?",
        "Obviously, relying on more languages should give a higher accuracy to the method.",
        "Here, we have only three languages at our disposal.",
        "By relying on languages which are typologically different like Chinese, English and Japanese, it is reasonable to think that we somewhat counterbalance the small number of languages used.",
        "To summarize, by using Equivalence (i), and by considering only sentences attested in our corpus, Formula (ii) can be restated as follows, when restricted to three languages.",
        "Practically, thus, the number of “true analogies” is just the cardinal of the intersection set of the sets of analogies for each possible language."
      ]
    },
    {
      "heading": "4.2 Results 4.2.1 Pairwise intersection",
      "text": [
        "Out of a total of 2,384,202 English analogies on the level of form, 238,135 are common with Chinese.",
        "They involve 25,554 sentences.",
        "Consequently, 10% of the English analogies of form may be thought to be analogies of form and meaning, i.e., “true analogies”, when relying only on Chinese.",
        "Between English and Japanese the number of analogies in common is 336,287 (involving 24,674 sentences) which represents 14% of the English analogies.",
        "An example is given in Figure 2.",
        "Between Chinese and Japanese very similar figures are obtained, as the number of analogies in common between these two languages is 329,429 (involving 25,127 sentences).",
        "Taking the intersection of Chinese, English and Japanese leads to a figure of 68,164 “true analogies”, involving 13,602 different sentences."
      ]
    },
    {
      "heading": "4.3 Discussion",
      "text": [
        "Although the number of analogies dropped from 2.5 million analogies of form in English, down to less than 70,000 when intersecting with Chinese and Japanese, one cannot say that the obtained figure is small.",
        "The average number of “true analogies” per sentence over all the corpus is: 162,318 / 68,184 = 0.42.",
        "In other words, in this corpus, one sentence is involved in about half a “true analogy” in average, taking it for granted that the linguistic differences between Chinese, English and Japanese filter real oppositions in meaning out of the oppositions captured by analogies of form.",
        "The number of sentences involved in at least one analogy is 13,602, so that, more than one tenth of the sentences of the corpus are in an immediate analogical relation with other sentences of the corpus.",
        "Such a figure is not negligeable.",
        "Averaging those sentences involved in at least one analogy gives the figure of 162,318 / 13,602 = 11.93 “true analogies”, which indicates that, on average, there are ten different ways to obtain these sentences by analogy with other sentences.",
        "It is questionable whether those analogies that were lost in the successive intersections were really not analogies on the meaning level.",
        "In fact, the impression is that our experiment yielded a figure which is excessively low.",
        "An inspection by hand convinced us that almost all analogies which were discarded would have been considered by a human evaluator as “true analogies”.",
        "Figure 1 shows two such examples.",
        "The problem is that the corresponding translations in other languages did not make an analogy of form.",
        "Other ways of saying could have made valid analogies of form.",
        "Consequently, the low number of translation equivalents available in our corpus is responsible of the low number of “true analogies” found by this method.",
        "5 A higher estimate: translation by enforcement of “true analogies”"
      ]
    },
    {
      "heading": "5.1 Method",
      "text": [
        "The corpus we used is rather poor in translation equivalents, or paraphrases: an English sentence gets only 1.20 equivalent sentences on average when translated into Chinese, and only 1.52 into Japanese.",
        "If we would like to get a more accurate estimate of the number of “true analogies” in English, then our problem becomes that of increasing the number of possible translations of English sentences in Chinese and in Japanese, i.e., to increase the number of paraphrases in Chinese and Japanese.",
        "To address this problem, we adopted a view which is the opposite of our previous view.",
        "We decided to enforce “true analogies”: given an analogy of form in a first language we forced it, when possible, to be reflected by an analogy of form in the second language.",
        "This should yield an estimate of the number of analogies in common between two languages which, if not necessarily more accurate, will at least be a higher estimate.",
        "To do so, the formula mentioned in section 3.1 is used in production, i.e., D2 is generated from the three sentences A2, B2 and C2 when it is possible."
      ]
    },
    {
      "heading": "5.2 Results",
      "text": [
        "Using the method described above, we automatically produced Chinese translations for those English sentences of the corpus which intervene in at least one analogy of form.",
        "This delivered an average of 51 different candidate sentences.",
        "As a whole, 48,351 sentences among 53,250 could be translated.",
        "By doing the same for Japanese, the average number of different sentences is higher: 174 for 47,702 translated sentences14.",
        "(For the reader to judge, Figure 3 shows examples of Japanese-to-English translations, rather than English-to-Japanese.)",
        "The obtained translations were added to the corpus so as to increase the number of paraphrases in Chinese and Japanese.",
        "Then all counts were redone, and the new figures are listed under the title “Higher estimate” in Table 2."
      ]
    },
    {
      "heading": "5.3 Discussion",
      "text": [
        "The new figure of 1,507,380 analogies for 49,052 sentences involved should be compared with the previous figures for the lower estimate.",
        "It is much higher, but it seems closer to the impression one gets when screening the analogies: analogies of form which are not analogies of meaning are very rare.",
        "However, the sentences that were obtained by enforcing analogies and then included in the corpus, are not always valid sentences.",
        "Figure 3 shows some such examples.",
        "14 Here again, we suspect the cause of the difference to be the indifferent use of kanji and hiragana.",
        "Future works should thus consider the problem of filtering in some ways the translations obtained automatically using, for example, N-gram statistical models.",
        "After such a filtering, new counts should be performed again.",
        "However, the problem with such a filtering is that it may lose the morphological productivity of analogy."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "In this paper, we reported experiments of counting the number of “true analogies,” i.e., analogies of form and meaning, between sentences contained in a large multilingual corpus, making the assumption that translation preserves meaning.",
        "We computed a lower and a higher estimates.",
        "Using an English corpus of almost 100,000 different sentences, we obtained a lower estimate of almost 70,000 “true analogies” involving almost 14,000 sentences by intersecting analogies of form between Chinese, English and Japanese.",
        "A higher estimate was obtained by enforcing analogies of form, i.e., generating new sentences to fulfil analogies of form, so as to increase the number of paraphrases.",
        "More than a million and a half “true analogies” were found.",
        "They involve almost 50,000 sentences, i.e., half of the sentences of the corpus.",
        "This meets our impression that almost all analogies of form between the English sentences of our corpus are also analogies of meaning.",
        "Although we do not claim that analogy can explain everything about language, this work shows that, even when considering the lower estimate obtained, the number of “true analogies” that can be found in a corpus is far from being negligeable.",
        "Further research should focus on the way analogies are distributed over sentences, i.e., on the characterisation of sentences involved in analogies.",
        "Finally, as a speculative remark, similar count-ings as the ones reported above could contribute to the debate about “the argument from the poverty of the stimulus” if it were possible to reproduce them on such corpora as the CHILDES corpus15."
      ]
    },
    {
      "heading": "7 Acknowledgements",
      "text": [
        "The research reported here was supported in part by a contract with the National Institute of Information and Communications Technology entitled ”A study of speech dialogue translation technology based on a large corpus”."
      ]
    }
  ]
}
