{
  "info": {
    "authors": [
      "Taylor Berg-Kirkpatrick",
      "Alexandre Bouchard-Côté",
      "John DeNero",
      "Dan Klein"
    ],
    "book": "Human Language Technologies: the 2010 Annual Conference of the North American Chapter of the Association for Computational Linguistics",
    "id": "acl-N10-1083",
    "title": "Painless Unsupervised Learning with Features",
    "url": "https://aclweb.org/anthology/N10-1083",
    "year": 2010
  },
  "references": [
    "acl-A94-1009",
    "acl-C02-1032",
    "acl-C02-1145",
    "acl-D07-1031",
    "acl-H05-1009",
    "acl-J07-4003",
    "acl-J93-2004",
    "acl-J94-2001",
    "acl-N06-1014",
    "acl-N06-1041",
    "acl-N09-1009",
    "acl-N09-1036",
    "acl-N09-1069",
    "acl-P00-1056",
    "acl-P04-1061",
    "acl-P05-1044",
    "acl-P06-1085",
    "acl-P07-1003",
    "acl-P07-1094",
    "acl-P09-1104"
  ],
  "sections": [
    {
      "text": [
        "Taylor Berg-Kirkpatrick Alexandre Bouchard-Cote John DeNero Dan Klein",
        "We show how features can easily be added to standard generative models for unsupervised learning, without requiring complex new training methods.",
        "In particular, each component multinomial of a generative model can be turned into a miniature logistic regression model if feature locality permits.",
        "The intuitive EM algorithm still applies, but with a gradient-based M-step familiar from discriminative training of logistic regression models.",
        "We apply this technique to part-of-speech induction, grammar induction, word alignment, and word segmentation, incorporating a few linguistically-motivated features into the standard generative model for each task.",
        "These feature-enhanced models each outperform their basic counterparts by a substantial margin, and even compete with and surpass more complex state-of-the-art models."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Unsupervised learning methods have been increasingly successful in recent NLP research.",
        "The reasons are varied: increased supplies of unlabeled data, improved understanding of modeling methods, additional choices of optimization algorithms, and, perhaps most importantly for the present work, incorporation of richer domain knowledge into structured models.",
        "Unfortunately, that knowledge has generally been encoded in the form of conditional independence structure, which means that injecting it is both tricky (because the connection between independence and knowledge is subtle) and time-consuming (because new structure often necessitates new inference algorithms).",
        "In this paper, we present a range of experiments wherein we improve existing unsupervised models by declaratively adding richer features.",
        "In particular, we parameterize the local multinomials of existing generative models using features, in a way which does not require complex new machinery but which still provides substantial flexibility.",
        "In the featureengineering paradigm, one can worry less about the backbone structure and instead use hand-designed features to declaratively inject domain knowledge into a model.",
        "While feature engineering has historically been associated with discriminative, supervised learning settings, we argue that it can and should be applied more broadly to the unsupervised setting.",
        "The idea of using features in unsupervised learning is neither new nor even controversial.",
        "Many top unsupervised results use feature-based models (Smith and Eisner, 2005; Haghighi and Klein, 2006).",
        "However, such approaches have presented their own barriers, from challenging normalization problems, to neighborhood design, to the need for complex optimization procedures.",
        "As a result, most work still focuses on the stable and intuitive approach of using the EM algorithm to optimize data likelihood in locally normalized, generative models.",
        "The primary contribution of this paper is to demonstrate the clear empirical success of a simple and accessible approach to unsupervised learning with features, which can be optimized by using standard NLP building blocks.",
        "We consider the same generative, locally-normalized models that dominate past work on a range of tasks.",
        "However, we follow Chen (2003), Bisani and Ney (2008), and Bouchard-Cote et al.",
        "(2008), and allow each component multinomial of the model to be a miniature multi-class logistic regression model.",
        "In this case, the EM algorithm still applies with the E-step unchanged.",
        "The M-step involves gradient-based training familiar from standard supervised logistic regression (i.e., maximum entropy models).",
        "By integrating these two familiar learning techniques, we add features to unsupervised models without any specialized learning or inference.",
        "A second contribution of this work is to show that further gains can be achieved by directly optimizing data likelihood with LBFGS (Liu et al., 1989).",
        "This alternative optimization procedure requires no additional machinery beyond what EM uses.",
        "This approach is still very simple to implement, and we found that it empirically outperforms EM.",
        "This paper is largely empirical; the underlying optimization techniques are known, even if the overall approach will be novel to many readers.",
        "As an empirical demonstration, our results span an array of unsupervised learning tasks: part-of-speech induction, grammar induction, word alignment, and word segmentation.",
        "In each task, we show that declaring a few linguistically motivated feature templates yields state-of-the-art results."
      ]
    },
    {
      "heading": "2. Models",
      "text": [
        "We start by explaining our feature-enhanced model for part-of-speech (POS) induction.",
        "This particular example illustrates our approach to adding features to unsupervised models in a well-known NLP task.",
        "We then explain how the technique applies more generally.",
        "POS induction consists of labeling words in text with POS tags.",
        "A hidden Markov model (HMM) is a standard model for this task, used in both a frequen-tist setting (Merialdo, 1994; Elworthy, 1994) and in a Bayesian setting (Goldwater and Griffiths, 2007; Johnson, 2007).",
        "A POS HMM generates a sequence of words in order.",
        "In each generation step, an observed word emission yi and a hidden successor POS tag Zi+\\ are generated independently, conditioned on the current POS tag Zi .",
        "This process continues until an absorbing stop state is generated by the transition model.",
        "There are two types of conditional distributions in the model – emission and transition probabilities – that are both multinomial probability distributions.",
        "The joint likelihood factors into these distributions:",
        "The emission distribution Pg(Yi = yi\\Zi = zi) is parameterized by conditional probabilities #y,Z)EMITfor each word y given tag z. Alternatively, we can express this emission distribution as the output of a logistic regression model, replacing the explicit conditional probability table by a logistic function parameterized by weights and features:",
        "This feature-based logistic expression is equivalent to the flat multinomial in the case that the feature function f (y, z, emit) consists of all indicator features on tuples (y,z, emit), which we call Basic features.",
        "The equivalence follows by setting weight Wy,z,EMiT = log(öy>z,EMiT).",
        "This formulation is known as the natural parameterization of the multinomial distribution.",
        "In order to enhance this emission distribution, we include coarse features in f(y, z, EMIT), in addition to the Basic features.",
        "Crucially, these features can be active across multiple (y, z) values.",
        "In this way, the model can abstract general patterns, such as a POS tag co-occurring with an inflectional morpheme.",
        "We discuss specific POS features in Section 4.",
        "Like the HMM, all of the models we propose are based on locally normalized generative decisions that condition on some context.",
        "In general, let X = (Z, Y) denote the sequence of generation steps (random variables) where Z contains all hidden random variables and Y contains all observed random variables.",
        "The joint probability of this directed model factors as:",
        "where Xn(i) denotes the parents of Xi and I is the index set of the variables in X.",
        "In the models that we use, each factor in the above expression is the output of a local logistic regression model parameterized by w:",
        "Above, d is the generative decision value for Xipicked by the model, c is the conditioning context tuple of values for the parents of Xi, and t is the type of decision being made.",
        "For instance, the POS HMM has two types of decisions: transitions and emissions.",
        "In the emission model, the type t is EMIT, the decision d is a word and the context c is a tag.",
        "The denominator normalizes the factor to be a probability distribution over decisions.",
        "The objective function we derive from this model is the marginal likelihood of the observations y, along with a regularization term:",
        "This model has two advantages over the more prevalent form of a feature-rich unsupervised model, the globally normalized Markov random field.",
        "First, as we explain in Section 3, optimizing our objective does not require computing expectations over the joint distribution.",
        "In the case of the POS HMM, for example, we do not need to enumerate an infinite sum of products of potentials when optimizing, in contrast to Haghighi and Klein (2006).",
        "Second, we found that locally normalized models empirically outperform their globally normalized counterparts, despite their efficiency and simplicity."
      ]
    },
    {
      "heading": "3. Optimization",
      "text": [
        "In this section, we describe the EM algorithm applied to our feature-rich, locally normalized models.",
        "For models parameterized by standard multinomials, EM optimizes L(6) = log Pg(Y = y) (Dempster et al., 1977).",
        "The E-step computes expected counts for each tuple of decision d, context c, and multinomial type t:",
        "These expected counts are then normalized in the M-step to re-estimate 6:",
        "Normalizing expected counts in this way maximizes the expected complete log likelihood with respect to the current model parameters.",
        "EM can likewise optimize L(w) for our locally normalized models with logistic parameterizations.",
        "The E-step first precomputes multinomial parameters from w for each decision, context, and type:",
        "Then, expected counts e are computed according to Equation 2.",
        "In the case of POS induction, expected counts are computed with the forward-backward algorithm in both the standard and logistic parameterizations.",
        "The only change is that the conditional probabilities 6 are now functions of w.",
        "The M-step changes more substantially, but still relies on canonical NLP learning methods.",
        "We wish to choose w to optimize the regularized expected complete log likelihood:",
        "We optimize this objective via a gradient-based search algorithm like LBFGS.",
        "The gradient with respect to w takes the form",
        "This gradient matches that of regularized logistic regression in a supervised model: the difference A between the observed and expected features, summed over every decision and context.",
        "In the supervised case, we would observe the count of occurrences of (d, c,t), but in the unsupervised M-step, we instead substitute expected counts ed)C)t.",
        "This gradient-based M-step is an iterative procedure.",
        "For each different value of w considered during the search, we must recompute 6(w), which requires computation in proportion to the size of the parameter space.",
        "However, e stays fixed throughout the M-step.",
        "Algorithm 1 outlines EM in its entirety.",
        "The subroutine climb(-, •, •) represents a generic optimization step such as an LBFGS iteration.",
        "Algorithm 1 Feature-enhanced EM repeat",
        "Compute expected counts e > Eq.",
        "2",
        "w – climb(w, l(w, e), Vl(w, e)) until convergence until convergence",
        "Another approach to optimizing Equation 1 is to compute the gradient of the log marginal likelihood directly (Salakhutdinov et al., 2003).",
        "The gradient turns out to have the same form as Equation 4, with the key difference that ed)C)t is recomputed for every different value of w. Algorithm 2 outlines the procedure.",
        "Justification for this algorithm appears in the Appendix.",
        "Algorithm 2 Feature-enhanced direct gradient",
        "In practice, we find that this optimization approach leads to higher task accuracy for several models.",
        "However, in cases where computing ed)C)tis expensive, EM can be a more efficient alternative."
      ]
    },
    {
      "heading": "4. Part-of-Speech Induction",
      "text": [
        "We now describe experiments that demonstrate the effectiveness of locally normalized logistic models.",
        "We first use the bigram HMM described in Section 2.1 for POS induction, which has two types of multinomials.",
        "For type emit, the decisions d are words and contexts c are tags.",
        "For type trans, the decisions and contexts are both tags.",
        "We use the same set of features used by Haghighi and Klein (2006) in their baseline globally normalized Markov random field (MRF) model.",
        "These are all coarse features on emission contexts that activate for words with certain orthographic properties.",
        "We use only the Basic features for transitions.",
        "For an emission with word y and tag z, we use the following feature templates:",
        "CONTAINS-DIGIT: Check if y contains digit and conjoin with z:",
        "( containsDigit(y) = , z = ) CONTAINS-HYPHEN: 1 (containsHyphen(x) = -,z = •) INITIAL-CAP: Check if the first letter of y is",
        "capitalized: l(isCap(y) = -,z = •) N-GRAM: Indicator functions for character ngrams of up to length 3 present in y.",
        "We train and test on the entire WSJ tag corpus (Marcus et al., 1993).",
        "We attempt the most difficult version of this task where the only information our system can make use of is the unlabeled text itself.",
        "In particular, we do not make use of a tagging dictionary.",
        "We use 45 tag clusters, the number of POS tags that appear in the WSJ corpus.",
        "There is an identifiability issue when evaluating inferred tags.",
        "In order to measure accuracy on the hand-labeled corpus, we map each cluster to the tag that gives the highest accuracy, the many-1 evaluation approach (Johnson, 2007).",
        "We run all POS induction models for 1000 iterations, with 10 random initializations.",
        "The mean and standard deviation of many-1 accuracy appears in Table 1.",
        "We compare our model to the basic HMM and a bigram version of the feature-enhanced MRF model of Haghighi and Klein (2006).",
        "Using EM, we achieve a many-1 accuracy of 68.1.",
        "This outperforms the basic HMM baseline by a 5.0 margin.",
        "The same model, trained using the direct gradient approach, achieves a many-1 accuracy of 75.5, outperforming the basic HMM baseline by a margin of 12.4.",
        "These results show that the direct gradient approach can offer additional boosts in performance when used with a feature-enhanced model.",
        "We also outperform the globally normalized MRF, which uses the same set of features and which we train using a direct gradient approach.",
        "To the best of our knowledge, our system achieves the best performance to date on the WSJ corpus for totally unsupervised POS tagging."
      ]
    },
    {
      "heading": "5. Grammar Induction",
      "text": [
        "We next apply our technique to a grammar induction task: the unsupervised learning of dependency parse trees via the dependency model with valence (DMV) (Klein and Manning, 2004).",
        "A dependency parse is a directed tree over tokens in a sentence.",
        "Each edge of the tree specifies a directed dependency from a head token to a dependent, or argument token.",
        "Thus, the number of dependencies in a parse is exactly the number of tokens in the sentence, not counting the artificial root token.",
        "The DMV defines a probability distribution over dependency parse trees.",
        "In this head-outward attachment model, a parse and the word tokens are derived together through a recursive generative process.",
        "For each token generated so far, starting with the root, a set of left dependents is generated, followed by a set of right dependents.",
        "There are two types of multinomial distributions in this model.",
        "The Bernoulli STOP probabilities 0d)C)STOP capture the valence of a particular head.",
        "For this type, the decision d is whether or not to stop generating arguments, and the context c contains the current head h, direction Ö and adjacency adj.",
        "If a head's stop probability is high, it will be encouraged to accept few arguments.",
        "The ATTACH multinomial probability distributions 0d c ATTACH capture attachment preferences of heads.",
        "For this type, a decision d is an argument token a, and the context c consists of a head h and a direction <5.",
        "We take the same approach as previous work (Klein and Manning, 2004; Cohen and Smith, 2009) and use gold POS tags in place of words.",
        "One way to inject knowledge into a dependency model is to encode the similarity between the various morphological variants of nouns and verbs.",
        "We encode this similarity by incorporating features into both the STOP and the ATTACH probabilities.",
        "The attachment features appear below; the stop feature templates are similar and are therefore omitted.",
        "Noun: Generalize the morphological variants of",
        "Verb: Same as above, generalizing verbs instead of nouns by using isVerb(-)",
        "Back-Off: We add versions of all other features that ignore direction or adjacency.",
        "While the model has the expressive power to allow specific morphological variants to have their own behaviors, the existence of coarse features encourages uniform analyses, which in turn gives better accuracies.",
        "Cohen and Smith's (2009) method has similar characteristics.",
        "They add a shared logistic-normal prior (SLN) to the DMV in order to tie multinomial parameters across related derivation events.",
        "They achieve their best results by only tying parameters between different multinomials when the corresponding contexts are headed by nouns and verbs.",
        "This observation motivates the features we choose to incorporate into the DMV.",
        "For our English experiments we train and report directed attachment accuracy on portions of the WSJ corpus.",
        "We work with a standard, reduced version of WSJ, WSJ10, that contains only sentences of length 10 or less after punctuation has been removed.",
        "We train on sections 2-21, and use section 22 as a development set.",
        "We report accuracy on section 23.",
        "These are the same training, development, and test sets used by Cohen and Smith (2009).",
        "The regularization parameter (k) is tuned on the development set to maximize accuracy.",
        "For our Chinese experiments, we use the same corpus and training/test split as Cohen and Smith (2009).",
        "We train on sections 1-270 of the Penn Chinese Treebank (Xue et al., 2002), similarly reduced (CTB10).",
        "We test on sections 271-300 of CTB10, and use sections 400-454 as a development set.",
        "The DMV is known to be sensitive to initialization.",
        "We use the deterministic harmonic initializer from Klein and Manning (2004).",
        "We ran each optimization procedure for 100 iterations.",
        "The results are reported in Table 1.",
        "We are able to outperform Cohen and Smith's (2009) best system, which requires a more complicated variational inference method, on both English and Chinese data sets.",
        "Their system achieves an accuracy of 61.3 for English and an accuracy of 51.9 for Chinese.",
        "Our feature-enhanced model, trained using the direct gradient approach, achieves an accuracy of 63.0 for English, and an accuracy of 53.6 for Chinese.",
        "To our knowledge, our method for feature-based dependency parse induction outperforms all existing methods that make the same set of conditional independence assumptions as the DMV."
      ]
    },
    {
      "heading": "6. Word Alignment",
      "text": [
        "Word alignment is a core machine learning component of statistical machine translation systems, and one of the few NLP tasks that is dominantly solved using unsupervised techniques.",
        "The purpose of word alignment models is to induce a correspondence between the words of a sentence and the words of its translation.",
        "We consider two classic generative alignment models that are both used heavily today, IBM Model 1 (Brown et al., 1994) and the HMM alignment model (Ney and Vogel, 1996).",
        "These models generate a hidden alignment vector z and an observed foreign sentence y, all conditioned on an observed English sentence e. The likelihood of both models takes the form:",
        "Table 1: Locally normalized feature-based models outperform all proposed baselines for all four tasks.",
        "LBFGS outperformed EM in all cases where the algorithm was sufficiently fast to run.",
        "Details of each experiment appear in the main text.",
        "The distortion term p(zj = i\\zj-1) is uniform in Model 1, and Markovian in the HMM.",
        "See Liang et al.",
        "(2006) for details on the specific variant of the distortion model of the HMM that we used.",
        "We use these standard distortion models in both the baseline and feature-enhanced word alignment systems.",
        "The bilexical emission model öy)6)ALIGN differentiates our feature-enhanced system from the baseline system.",
        "In the former, the emission model is a standard conditional multinomial that represents the probability that decision word y is generated from context word e, while in our system, the emission model is re-parameterized as a logistic regression model and feature-enhanced.",
        "Many supervised feature-based alignment models have been developed.",
        "In fact, this logistic parameterization of the HMM has been proposed before and yielded alignment improvements, but was trained using supervised estimation techniques (Varea et al., 2002).",
        "However, most full translation systems today rely on unsupervised learning so that the models may be applied easily to many language pairs.",
        "Our approach provides efficient and consistent unsupervised estimation for feature-rich alignment models.",
        "Model",
        "Inference",
        "Reg",
        "Eval",
        "POS Induction",
        "K",
        "Many-1",
        "Basic-HMM",
        "EM",
        "-",
        "63.1 (1.3)",
        "£ Feature-MRF ^ Feature-HMM",
        "LBFGS",
        "0.1",
        "59.6 (6.9)",
        "EM",
        "1.0",
        "68.1 (1.7)",
        "LBFGS",
        "1.0",
        "75.5 (1.1)",
        "Grammar Induction",
        "K",
        "Dir",
        "Basic-DMV £ Feature-DMV",
        "EM",
        "-",
        "47.8",
        "EM",
        "0.05",
        "48.3",
        "LBFGS",
        "10.0",
        "63.0",
        "(Cohen and Smith, 2009)",
        "61.3",
        "0 Basic-DMV g Feature-DMV",
        "EU",
        "EM",
        "-",
        "42.5",
        "EM",
        "1.0",
        "49.9",
        "LBFGS",
        "5.0",
        "53.6",
        "(Cohen and Smith, 2009)",
        "51.9",
        "Word Alignment",
        "K",
        "AER",
        "[§ Basic-Model 1 (j Feature-Model 1",
        "EM",
        "-",
        "38.0",
        "EM",
        "-",
        "35.6",
        "£ Basic-HMM Z Feature-HMM",
        "EM",
        "-",
        "33.8",
        "EM",
        "-",
        "30.0",
        "Word Segmentation",
        "K",
        "F1",
        "Basic-Unigram",
        "EM",
        "-",
        "76.9 (0.1)",
        "& Feature-Unigram",
        "EM",
        "0.2",
        "84.5 (0.5)",
        "LBFGS",
        "0.2",
        "88.0 (0.1)",
        "(Johnson and Goldwater, 2009)",
        "87",
        "The Basic features on pairs of lexical items provide strong baseline performance.",
        "We add coarse features to the model in order to inject prior knowledge and tie together lexical items with similar characteristics.",
        "Edit-Distance: 1 (dist(y,e) = •) Dictionary: l((y, e) e D) for dictionary D. Stem: l(stem(e) = = •) for Porter stemmer.",
        "length 4.",
        "Character: l(e = •, charAt(y,i) = •) for index i in the Chinese word.",
        "These features correspond to several common augmentations of word alignment models, such as adding dictionary priors and truncating long words, but here we integrate them all coherently into a single model.",
        "We evaluate on the standard hand-aligned portion of the NIST 2002 Chinese-English development set (Ayan et al., 2005).",
        "The set is annotated with sure S and possible P alignments.",
        "We measure alignment quality using alignment error rate (AER) (Och and",
        "Ney, 2000).",
        "We train the models on 10,000 sentences of FBIS Chinese-English newswire.",
        "This is not a large-scale experiment, but large enough to be relevant for low-resource languages.",
        "LBFGS experiments are not provided because computing expectations in these models is too computationally intensive to run for many iterations.",
        "Hence, EM training is a more appropriate optimization approach: computing the M-step gradient requires only summing over word type pairs, while the marginal likelihood gradient needed for LBFGS requires summing over training sentence alignments.",
        "The final alignments, in both the baseline and the feature-enhanced models, are computed by training the generative models in both directions, combining the result with hard union competitive thresholding (DeNero and Klein, 2007), and using agreement training for the HMM (Liang et al., 2006).",
        "The combination of these techniques yields a state-of-the-art unsupervised baseline for Chinese-English.",
        "For both IBM Model 1 and the HMM alignment model, EM training with feature-enhanced models outperforms the standard multinomial models, by 2.4 and 3.8 AER respectively.",
        "As expected, large positive weights are assigned to both the dictionary and edit distance features.",
        "Stem and character features also contribute to the performance gain."
      ]
    },
    {
      "heading": "7. Word Segmentation",
      "text": [
        "Finally, we show that it is possible to improve upon the simple and effective word segmentation model presented in Liang and Klein (2009) by adding phonological features.",
        "Unsupervised word segmentation is the task of identifying word boundaries in sentences where spaces have been removed.",
        "For a sequence of characters y = (y1, ...,yn), a segmentation is a sequence of segments z = (z1, ...,z|z|) such that z is a partition of y and each Zi is a contiguous subsequence of y. Unsupervised models for this task infer word boundaries from corpora of sentences of characters without ever seeing examples of well-formed words.",
        "Liang and Klein's (2009) unigram double-exponential model corresponds to a simple derivational process where sentences of characters x are generated a word at a time, drawn from a multinomial over all possible strings #z,SEGMENT.",
        "For this type, there is no context and the decision is the particular string generated.",
        "In order to avoid the degenerate MLE that assigns mass only to single segment sentences it is helpful to independently generate a length for each segment from a fixed distribution.",
        "Liang and Klein (2009) constrain individual segments to have maximum length 10 and generate lengths from the following distribution: #/,LENGTH = exp( – I-) when 1 < l < 10.",
        "Their model is deficient since it is possible to generate lengths that are inconsistent with the actual lengths of the generated segments.",
        "The likelihood equation is given by:",
        "We train and test on the phonetic version of the Bernstein-Ratner corpus (1987).",
        "This is the same set-up used by Liang and Klein (2009), Goldwater et al.",
        "(2006), and Johnson and Goldwater (2009).",
        "This corpus consists of 9790 child-directed utterances transcribed using a phonetic representation.",
        "We measure segment F1 score on the entire corpus.",
        "We run all word segmentation models for 300 iterations with 10 random initializations and report the mean and standard deviation of F1 in Table 1.",
        "The SEGMENT multinomial is the important distribution in this model.",
        "We use the following features:",
        "Number-Vowels: l(numVowels(z) = •) Phono-Class-Pref: l(prefix(coarsePhonemes(z)) = •) Phono-Class-Pref: l(suffix(coarsePhonemes(z)) = •)",
        "The phonological class prefix and suffix features project each phoneme of a string to a coarser class and then take prefix and suffix indicators on the string of projected characters.",
        "We include two versions of these features that use projections with different levels of coarseness.",
        "The goal of these features is to help the model learn general phonetic shapes that correspond to well-formed word boundaries.",
        "As is the case in general for our method, the feature-enhanced unigram model still respects the conditional independence assumptions that the standard unigram model makes, and inference is still performed using a simple dynamic program to compute expected sufficient statistics, which are just segment counts.",
        "To our knowledge our system achieves the best performance to date on the Bernstein-Ratner corpus, with an F1 of 88.0.",
        "It is substantially simpler than the non-parametric Bayesian models proposed by Johnson et al.",
        "(2007), which require sampling procedures to perform inference and achieve an F1 of 87 (Johnson and Goldwater, 2009).",
        "Similar to our other results, the direct gradient approach outperforms EM for feature-enhanced models, and both approaches outperform the baseline, which achieves an F1 of76.9."
      ]
    },
    {
      "heading": "8. Conclusion",
      "text": [
        "We have shown that simple, locally normalized models can effectively incorporate features into unsupervised models.",
        "These enriched models can be easily optimized using standard NLP building blocks.",
        "Beyond the four tasks explored in this paper – POS tagging, DMV grammar induction, word alignment, and word segmentation – the method can be applied to many other tasks, for example grounded semantics, unsupervised PCFG induction, document clustering, and anaphora resolution."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We thank Percy Liang for making his word segmentation code available to us, and the anonymous reviewers for their comments.",
        "In this section, we derive the gradient of the log marginal likelihood needed for the direct gradient approach.",
        "Let wo be the current weights in Algorithm 2 and e = e(w0) be the expectations under these weights as computed in Equation 2.",
        "In order to justify Algorithm 2, we need to prove that VL(w0 ) = Vl(w0, e).",
        "We use the following simple lemma: if </>, ip are real-valued functions such that: (1) </>(w0) = pi(w0) for some w0; (2) i/>(w) < pi(w) on an open set containing w0; and (3), </> and pi are differentiable at w0; then Vpi(w0) = V</>(w0).",
        "We set p(w) = L(w) and </>(w) = l(w, e)-pz Pw0 (Z = z| Y = y) log PW0 (Z = z|Y = y).",
        "If we can show that pi, <f> satisfy the conditions of the lemma we are done since the second term of </> depends on w0, but not on w.",
        "Property (3) can be easily checked, and property (2) follows from Jensen's inequality.",
        "Finally, property (1) follows from Lemma 2 of Neal and Hinton (1998)."
      ]
    }
  ]
}
