{
  "info": {
    "authors": [
      "Dana Dannells",
      "Aarne Ranta",
      "Ramona Enache",
      "Mariana Damova",
      "Maria Mateva"
    ],
    "book": "LaTeCH",
    "id": "acl-W13-2715",
    "title": "Multilingual access to cultural heritage content on the Semantic Web",
    "url": "https://aclweb.org/anthology/W13-2715",
    "year": 2013
  },
  "references": [
    "acl-L08-1035",
    "acl-W05-1617"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the 7th Workshop on Language Technology for Cultural Heritage, Social Sciences, and Humanities, pages 107?115, Sofia, Bulgaria, August 8 2013. c?2013 Association for Computational Linguistics Multilingual access to cultural heritage content"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "As the amount of cultural data available on the Semantic Web is expanding, the demand of accessing this data in multiple languages is increasing.",
        "Previous work on multilingual access to cultural heritage information has shown that at least two different problems must be dealt with when mapping from ontologies to natural language: (1) mapping multilingual metadata to interoperable knowledge sources; (2) assigning multilingual knowledge to cultural data.",
        "This paper presents our effort to deal with these problems.",
        "We describe our experiences with processing museum data extracted from two distinct sources, harmonizing this data and making its content accessible in natural language.",
        "We extend prior work in two ways.",
        "First, we present a grammar-based system that is designed to generate coherent texts from Semantic Web ontologies in 15 languages.",
        "Second, we describe how this multilingual system is exploited to form queries using the standard query language SPARQL.",
        "The generation and retrieval system builds on W3C standards and is available for further research."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "As the amount of cultural data available on the Semantic Web is expanding (Dekkers et al., 2009; Brugman et al., 2008), the demand of accessing this data in multiple languages is increasing (Stiller and Olensky, 2012).",
        "There have been several applications that applied Natural Language Generation (NLG) technologies to allow multilingual access to Semantic Web ontologies (Androutsopoulos et al., 2001; O?Donnell et al., 2001; Androutsopoulos and Karkaletsis, 2005; Androutsopoulos and Karkaletsis, 2007; Davies, 2009; Bouayad-Agha et al., 2012).",
        "The above authors have shown it is necessary to have an extensive lexical and syntactic knowledge when generating multilingual natural language from Semantic Web ontologies.",
        "However, because previous applications are mainly concerned with two or three languages, it is still not clear how to minimize the efforts in assigning lexical and syntactic knowledge for the purpose of enhancing automatic generation of adequate descriptions in multiple languages.",
        "This paper presents our work on making Cultural Heritage (CH) content available on the Semantic Web and accessible in 15 languages using the Grammatical Framework, GF (Ranta, 2011).",
        "The objective of our work is both to form queries and to retrieve semantic content in multiple languages.",
        "We describe our experiences with processing museum data extracted from two different sources, harmonizing this data and making its content accessible in natural language (NL).",
        "The generation and retrieval system builds on the World Wide Web Consortium (W3C) standards and is available for further research.",
        "The remainder of this paper is structured as followed.",
        "We present the related work in Section 2.",
        "We describe the underlying tech",
        "nology in Section 3.",
        "We provide a detailed description of the data and present the approach taken to make this data accessible in the Linked Open Data (LOD) in Section 4.",
        "We outline the multilingual approach and discuss the challenges we faced in Section 5.",
        "We discuss the results in Section 6.",
        "We end with some conclusions and pointers to future work in Section 7."
      ]
    },
    {
      "heading": "2 Related work",
      "text": [
        "Lately there has been a lot of interest in enabling multilingual access to cultural heritage content that is available on the Semantic Web.",
        "Androutsopoulos et al. (2001) and O?Donnell et al. (2001) have shown that accessing ontology content in multiple languages requires extensive linguistic data associated with the ontology classes and properties.",
        "However, they did not attempt to generate descriptions in real time from a large set of ontologies.",
        "Similar to Bouayad-Agha et al. (2012), our system relies on a multi-layered ontology approach for generating multilingual descriptions.",
        "In contrast to Dekkers et al. (2009) and Brugman et al. (2008) whose systems make use of Google translation services, which are data driven, our system is grammar driven.",
        "Moreover, we present a multilingual grammar-based approach to SPARQL (SPARQL Protocol and RDF Query Language) (Garlik and Andy, 2013).",
        "The method differs from the verbalization methods presented by Ngonga Ngomo et al. (2013) and Ell et al. (2012) in that it realizes the ontology content rather than the ontology axioms.",
        "Thus providing a more natural realization of the query language."
      ]
    },
    {
      "heading": "3 The technological infrastructure",
      "text": [
        "Although the architecture of the Semantic Web and Linked Open Data provides access to distributed data sets,2 many of the resources available in these sets are not accessible because of cross-language meta-data.",
        "To overcome this limitation, the knowledge representation infrastructure adopted in our approach is designed as a Reasonable View of",
        "the Web of Data.",
        "The Reasonable View is a compound dataset composed of several Resource Description Frameworks (RDFs).",
        "To query such a compound dataset, the user has to be intimately familiar with the schemata of each single composing dataset.",
        "That is why the Reasonable View approach is extended with the so called ontological reference layer, which introduces a unification ontology, mapped to the schemata of all single datasets from a given Reasonable View and thus provides a mechanism for efficient access and navigation of the data."
      ]
    },
    {
      "heading": "3.1 Museum Reasonable View (MRV)",
      "text": [
        "The Museum Reasonable View is an assembly of cultural heritage dominated RDF datasets (Danne?lls et al., 2011).",
        "It is loaded into OWLIM-SE (Bishop et al., 2011) with inference preformed on the data with respect to OWL Horst (ter Horst, 2005)."
      ]
    },
    {
      "heading": "3.2 The ontological reference layer The Museum Reasonable View gathers:",
      "text": [
        "(a) datasets from LOD, including DBpe-dia;3 (b) the unification ontology PROTON,4 an upper-level ontology, consisting of 542 classes and 183 properties; (c) two cultural heritage specific ontologies: (i) CIDOC-CRM (Crofts et al., 2008),5 consisting of 90 classes and 148 properties; (ii) Museum Artifacts Ontology (MAO),6 developed for mapping between museum data and the K-samso?k schema.7 It has 10 classes and 20 properties; (d) the Painting ontology,8 an application ontology developed to cover detailed information about painting objects in the framework 3DBPedia, structured information from Wikipedia:",
        "of the Semantic Web.",
        "It contains 197 classes and 107 properties of which 24 classes are equivalent to classes from the CIDOC-CRM and 17 properties are sub-properties of the CIDOC-CRM properties."
      ]
    },
    {
      "heading": "3.3 Grammatical Framework (GF)",
      "text": [
        "The Grammatical Framework (GF) (Ranta, 2004) is a grammar formalism targeted towards parsing and generation.",
        "The key feature of GF is the distinction between an abstract syntax, representing the domain, and concrete syntaxes, representing lineariza-tions in various target languages, natural or formal.",
        "GF comes with a resource grammar library (RGL) (Ranta, 2009) which aids the development of new grammars for specific domains by providing syntactic operations for basic grammatical constructions (Ranta, 2011).",
        "More than 30 languages are available in the RGL.",
        "Our application targets 15 of"
      ]
    },
    {
      "heading": "4 Cultural heritage data",
      "text": [
        "The data we have been experimenting with to enable multilingual descriptions of museum objects and answering to queries over them is a subset of the Gothenburg City Museum (GCM) database,9 and a subset of the DBpedia dataset.",
        "Because these two datasets are very different in size and nature, the preprocessing of each set differs substantially.",
        "In the following we describe each of the sets and the preprocessing steps in more details."
      ]
    },
    {
      "heading": "4.1 Gothenburg City Museum (GCM)",
      "text": [
        "The set from the GCM contains 48 painting records.",
        "Its content, both the metadata and data that were originally in Swedish, were translated to English.",
        "An example of a record from GCM is shown in Table 1."
      ]
    },
    {
      "heading": "4.2 DBpedia",
      "text": [
        "The set from DBpedia contains 662 painting records, the data covers at least 5 languages,",
        "GCM database.",
        "the metadata is in English.",
        "An example of a record from DBpedia is shown in Table 2."
      ]
    },
    {
      "heading": "4.3 Transition of data to the MRV",
      "text": [
        "Making the museum data available through the knowledge infrastructure required translations of the record fields and values, and mapping to a unified ontology.",
        "This process also required preprocessing of the free text fields such as Description and History (see Table 1) to enrich the data content.",
        "To make the DBpedia data accessible through the knowledge infrastructure, it required some preprocessing, cleaning, and mapping to the Painting ontology for data consistency.",
        "This unification was needed to use a consistent SPARQL queries from where NL descriptions could be generated.",
        "Firstly, we attempted to clean data noise and results that would make a single painting reappear in the query results.",
        "Then, we transformed year and size strings into only numbers.",
        "For each painter, museum and painting literal we had a single representation in the data.",
        "All names were normalized, for example, Salvador Dal??",
        "was converted",
        "source Identifiers (URIs) pointing to the same painting, we used the OWL (W3C, 2012) construct owl:sameAs.",
        "With this construct we were able to keep the data linked in the other graphs in the LOD cloud."
      ]
    },
    {
      "heading": "5 Multilingual linked data",
      "text": [
        "Our application is targeted towards lay users who wish to formulate queries and retrieve information in any language.",
        "Such users do not have any knowledge about ontologies or semantic data processing.",
        "For us it was therefore necessary to enable interactions in a simple use.",
        "The work towards making Semantic Web data accessible to different users required lexicalizations of ontology classes, properties and individuals (literal strings associated with a certain class).",
        "Following the GF mechanism, lexicalizations is accomplished through linearizations of functions.",
        "Linearization of functions varies depending on the language."
      ]
    },
    {
      "heading": "5.1 Lexicalizations of classes and",
      "text": [
        "properties Most of the ontology classes defined in our grammar are linearized with noun phrases in the concrete syntaxes.",
        "These were translated manually by a native speaker of the language.",
        "Examples from four languages are shown below.",
        "In the examples we find the following RGL constructions: mkCN (Common noun) and mkN (Noun).",
        "Two of the ontology classes that are not linearized with a noun phrase are: Year and Size.",
        "These are linearized with prepositional phrases in which the preposition is language dependent.",
        "Below are some examples which show how the Year string, i.e. YInt function, is realized in six languages.",
        "In the examples we find the following RGL constructions: mkAdv (Verb Phrase modifying adverb), Prep (Preposition) and symb (Symbolic).",
        "Bul.",
        "YInt i = mkAdv prez_Prep (symb (i.s ++ year_Str)); Fin.",
        "YInt i = mkAdv (prePrep nominative \"vuonna\") (symb i); Fre.",
        "YInt i = mkAdv en_Prep (symb i); Ger.",
        "YInt i = mkAdv in_Prep (symb i); Swe.",
        "YInt i = mkAdv noPrep",
        "The ontology properties are defined with operations in the concrete syntaxes.",
        "Because",
        "an ontology property is linearized differently depending on how it is realized in the target language, these operations are of type: verbs (e.g. paint V2), adverbs (e.g. painted A) and prepositions (e.g. Prep).",
        "Examples from three languages are shown below.",
        "The above functions correspond to three ontological properties, namely painted by, painted and created in.",
        "This approach to ontology lexicalization permits variations regarding the lexical units the ontology properties should be mapped to.",
        "It allows to make principled choices about the different realizations of an ontology property."
      ]
    },
    {
      "heading": "5.2 Lexicalizations of literals",
      "text": [
        "The part of the MRV to which we provide translations for consists of 906 individuals, their distribution across four classes is provided in Table 3.",
        "The lexical units assigned to paining titles, painters and museum literals are by default the original strings as they appear in the data.",
        "The majority of strings are given in English.",
        "However, because without translations of the name entities the results can become artificial and for some languages ungrammatical, we run a script that translates museum literals from Wikipedia automatically.",
        "Automatic translation was done by:",
        "(1) curling for Web pages for a museum",
        "lated entry for each string; (3) reducing the retrieved list by removing duplicated and ambiguous entries.",
        "This process was repeated for each language.",
        "As a result of the translation process, a list of lexical pairs was created for each language.",
        "Museum literals were then linearized automatically by consulting the created list for each language.",
        "In the cases where no translation was found, the original string, as it appears in the dataset was used.",
        "Unfortunately, the amount of the translated museum names was not equal for all languages.",
        "The distribution of the translated names is given in Table 4.",
        "Below follow some examples of how museum names are represented in the grammar:",
        "Where the construct mkMuseum has been defined to build a noun phrase from a given string.",
        "A special case of mkMuseum appears in four languages: Italian, Catalan, Spanish and French, where a masculine gender is assigned to the museum string to get the correct inflection form of the noun."
      ]
    },
    {
      "heading": "5.3 Realization of sentences",
      "text": [
        "To generate sentences from a set of classes we had to make different judgements about how to order the different classes.",
        "Below we provide an example of a sentence linearization from four languages.",
        "The sentence comprises four semantic classes: Painting, Material, Painter and Year.",
        "In the examples we find following RGL constructors: mkText (Text), mkS (Sentence), mkCl (Clause), mkNP (Noun Phrase), and mkVP (Verb Phrase).",
        "Some of the distinguishing differences between the languages are: in Finnish the use of an active voice, in Italian, present tense, in French, past participle, in Spanish, present simple.",
        "The order of the categories is also different.",
        "In German the material string appears at the end of the sentence as opposed to the other languages where year is often the last string."
      ]
    },
    {
      "heading": "5.4 Realizations of texts",
      "text": [
        "The text grammar has been designed to generate a coherent natural language descriptions from a selected set of the returned triples.",
        "More specifically, our grammar covers eight concepts that are most commonly used to describe a painting, including: Title, Painter, Painting type, Material, Colour, Year, Museum and Size.",
        "In the grammar module called TextPainting they are defined as categories and are captured in one function DPainting which has the following representation in the abstract syntax.",
        "In the function DPainting five arguments have been implemented as optional, i.e. OptColour, OptSize, OptMaterial, OptYear and OptMuseum.",
        "Each of these categories can be left out in a text.",
        "In the current implementation we limited the length of a description to three sentences.",
        "A minimal description consists of only one sentences.",
        "Below follow some examples of texts generated in English to exemplify the different descriptions we are able to generate from one single function call with a varying number of instantiated parameters.",
        "?",
        "Interior was painted on canvas by Edgar Degas in 1868.",
        "It measures 81 by 114 cm and it is painted in red and white.",
        "This painting is displayed at the Philadelphia Museum of Art.",
        "?",
        "Interior was painted by Edgar Degas in 1868.",
        "It measures 81 by 114 cm.",
        "This painting is displayed at the Philadelphia Museum of Art.",
        "?",
        "Interior was painted on canvas by Edgar Degas in 1868.",
        "It is painted in red and white.",
        "This painting is displayed at the",
        "?",
        "Interior was painted by Edgar Degas.",
        "It measures 81 by 114 cm and it is painted in red and white.",
        "This painting is displayed at the Philadelphia Museum of Art.",
        "?",
        "Interior was painted on canvas by Edgar Degas.",
        "It measures 81 by 114 cm and it is painted in red and white.",
        "?",
        "Interior was painted by Edgar Degas in 1868.",
        "This painting is displayed at the Philadelphia Museum of Art.",
        "?",
        "Interior was painted by Edgar Degas."
      ]
    },
    {
      "heading": "5.5 Multilingual querying",
      "text": [
        "Semantic Web technologies offer the technological backbone to meet the requirement of integrating heterogeneous data easily, but they are still more adapted to be consumed by computers than by humans.",
        "As a consequence, to retrieve semantic content from the knowledge base the user must: 1. master SPARQL, the query language for RDF; 2. have knowledge about each integrated dataset in the knowledge base.",
        "Ngonga Ngomo et al. (2013) have shown that realizations of SPARQL queries in natural language enhance the user understanding of the formulated queries and the retrieved results.",
        "We have implemented an extra SPARQL module that allow us to map from any of the 15 supported languages to SPARQL and from SPARQL to any of the 15 supported languages.",
        "The grammar reuses a more generic query module that allows to form both domain specific and domain independent queries.",
        "Some examples of the queries that can be formulated with the multilingual grammar and transformed to",
        "SPARQL are: 1.",
        "Some X 2.",
        "All About X 3.",
        "Show everything about X 4.",
        "All X painted by Y 5.",
        "Some X painted on Y 6.",
        "What is the material of X 7.",
        "Show everything about all X that are painted on Y",
        "In GF, realization of SPARQL queries is done by introducing new parameters, for example:",
        "?painter rdfs:label ?author .\"} ; The function QPainter defined to formulate a query such as who painted Mona Lisa?",
        "has been added two additional parameters, i.e. wh1 and wh2.",
        "With these parameters it is possible to formulate SPARQL queries such as the one below."
      ]
    },
    {
      "heading": "5.6 Multilingual text generation",
      "text": [
        "Our approach allows different texts to be generated depending on the information that is available in the ontology.",
        "A minimal description consists of three classes: a title, a painter and a painting type.",
        "A complete description consists of nine classes, as illustrated in Figure 1.",
        "With only one function DPainting our system is able to generate 16 different text variants.",
        "Figure 2 illustrates a generation results in 15 languages."
      ]
    },
    {
      "heading": "6 Discussion",
      "text": [
        "The majority of the challenges in the production of the CH data pool stemmed from the very nature of the Linked Open Data.",
        "The data in the LOD cloud are notoriously noisy and inconsistent.",
        "The multilingual labels from the FactForge datasets and more precisely from DBpedia, are not always available in all the supported languages.",
        "Although DBpedia in its large pool of data provides access to multilingual content, it is inconsistent.",
        "Many of the entries it contains are missing translations.",
        "There is a mixture of numeric and string literals.",
        "There are many duplications, most of them occur because the same ID appears in different languages.",
        "The content of the data is verbose, for example place-names and museum-names are represented with one string, for example: ?Rijksmuseum, Amsterdam?, instead of two different strings linked by two separate concepts, i.e. Museum and Place.",
        "This kind of inconsistent data representation had an impact on the translation of museum names.",
        "Another problem was that not all art objects are uniformly described with the same set of characteristics.",
        "For instance, some paintings were missing a title or a painter name.",
        "Because we constructed the grammar in such a way that disallows absence of this information, we had to replace titles with id numbers and empty painter names with the string unknown.",
        "Moreover, the data contained many duplications.",
        "This occurred because some of the property assertions were presented with different strings and triggered many RDF triples.",
        "We also faced many linguistic challenges on different levels.",
        "Lexicalizations of ontology classes and properties regarding use of compounds, variations of verbs, adverbs and prepositions.",
        "On sentence level, order of classes, variations of tense and voice.",
        "On both sentence and discourse levels, aggregation variations and use of coreference elements."
      ]
    },
    {
      "heading": "7 Conclusions",
      "text": [
        "We presented an ontology-based multilingual application developed in the Grammatical Framework and a cross-language retrieval system that uses this application for generating museum object descriptions in the Semantic Web.",
        "The generation and retrieval system builds on W3C standards.",
        "It covers semantic data from the Gothenburg City Museum database and DBpedia.",
        "The grammar enables descriptions of paintings and answering to queries over them, covering 15 languages for baseline functionality."
      ]
    }
  ]
}
