{
  "info": {
    "authors": [
      "Sina Zarrieß",
      "Jonas Kuhn"
    ],
    "book": "ACL",
    "id": "acl-P13-1152",
    "title": "Combining Referring Expression Generation and Surface Realization: A Corpus-Based Investigation of Architectures",
    "url": "https://aclweb.org/anthology/P13-1152",
    "year": 2013
  },
  "references": [
    "acl-A00-1017",
    "acl-A00-2026",
    "acl-C04-1097",
    "acl-C10-1011",
    "acl-C10-1012",
    "acl-C98-1112",
    "acl-D12-1085",
    "acl-E12-1078",
    "acl-E12-2021",
    "acl-J95-2003",
    "acl-P04-1052",
    "acl-P07-1041",
    "acl-P09-1092",
    "acl-P10-1160",
    "acl-P11-1101",
    "acl-P84-1107",
    "acl-P88-1020",
    "acl-P89-1009",
    "acl-S10-1008",
    "acl-S12-1030",
    "acl-W05-0618",
    "acl-W05-1601",
    "acl-W10-4226",
    "acl-W12-1506",
    "acl-W94-0316",
    "acl-W94-0319"
  ],
  "sections": [
    {
      "heading": "5.5 Discussion",
      "text": [
        "The results presented in the preceding evaluations consistenly show the tight connections between decisions at the level of reference, syntax and word order.",
        "These interactions entail highly interdependent modelling steps: Although there is a direct error propagation effect from predicted verb transformation on RE accuracy, predicted syntax still leads to informative intermediate lineariza-tions that improve the RE prediction.",
        "Our optimal generation architecture thus has a sequential set-up, where the first linearization step can be seen as an intermediate feedback that is revised in the final linearization.",
        "This connects to work in, e.g. (Hovy, 1988; Robin, 1993).",
        "In Figure 3, we compare two system outputs for the last two sentences of the text in Figure 2.",
        "The output of the sequential system is severely incoherent and would probably be rejected by a human reader: In sentence (5a) the victim subject of an active verb is deleted, and the relation between the possessive and the embedded victim RE is not clear.",
        "In sentence (5b) the first conjunct realizes a pronominal perp RE and the second conjunct a nominal perp RE.",
        "The output of the revision-based system reads much more natural.",
        "This example shows that the extension of the REG problem to texts with more than one main referent (as in the GREC data set) yields interesting inter-sentential interactions that affect textual coherence.",
        "We are aware of the fact that our automatic evaluation might only partially render certain effects, especially with respect to textual coherence.",
        "It is likely that the BLEU scores do not capture the magnitude of the differences in text quality illustrated by the Examples (5-6).",
        "Ultimately, a human evaluation for this task is highly desirable.",
        "We leave this for future work since our integrated set-up rises a number of questions with respect to evaluation design.",
        "In a preliminary analysis, we noticed the problem that human readers find it difficult to judge discourse-level properties of a text like coherence or naturalness when the generation output is not perfectly grammatical or fluent at the sentence level."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "We have presented a data-driven approach for investigating generation architectures that address discourse-level reference and sentence-level syntax and word order.",
        "The data set we created for our experiments basically integrates standards from previous research on REG and surface realization and extends the annotations to further types of implicit referents.",
        "Our results show that interactions between the different generation levels are best captured in a sequential, revision-based pipeline where the REG component has access to predictions from the syntax and the linearization module.",
        "These empirical findings obtained from experiments with generation architectures have clear connections to theoretical accounts of textual coherence."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": []
    }
  ]
}
