{
  "info": {
    "authors": [
      "Alisa Zhila",
      "Wen-tau Yih",
      "Christopher Meek",
      "Geoffrey Zweig",
      "Tomas Mikolov"
    ],
    "book": "NAACL",
    "id": "acl-N13-1120",
    "title": "Combining Heterogeneous Models for Measuring Relational Similarity",
    "url": "https://aclweb.org/anthology/N13-1120",
    "year": 2013
  },
  "references": [
    "acl-C08-1114",
    "acl-C94-2125",
    "acl-D12-1111",
    "acl-J06-1003",
    "acl-J06-3003",
    "acl-J92-4003",
    "acl-N09-1003",
    "acl-N10-1013",
    "acl-N12-1077",
    "acl-N13-1090",
    "acl-P10-1040",
    "acl-S12-1047",
    "acl-S12-1055",
    "acl-S12-1070",
    "acl-S12-1071",
    "acl-W01-0511"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this work, we study the problem of measuring relational similarity between two word pairs (e.g., silverware:fork and clothing:shirt).",
        "Due to the large number of possible relations, we argue that it is important to combine multiple models based on heterogeneous information sources.",
        "Our overall system consists of two novel general-purpose relational similarity models and three specific word relation models.",
        "When evaluated in the setting of a recently proposed SemEval-2012 task, our approach outperforms the previous best system substantially, achieving a 54.1% relative increase in Spearman's rank correlation."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The problem of measuring relational similarity is to determine the degree of correspondence between two word pairs.",
        "For instance, the analogous word pairs silverware:fork and clothing:shirt both exemplify well a Class-Inclusion:Singular Collective relation and thus have high relational similarity.",
        "Unlike the problem of attributional similarity, which measures whether two words share similar attributes and is addressed in extensive research work (Bu-danitsky and Hirst, 2006; Reisinger and Mooney, 2010; Radinsky et al., 2011; Agirre et al., 2009; Yih and Qazvinian, 2012), measuring relational similarity is a relatively new research direction pioneered by Turney (2006), but with many potential applications.",
        "For instance, problems of identifying specific relations between words, such as synonyms, ?Work conducted while interning at Microsoft Research.",
        "antonyms or associations, can be reduced to measuring relational similarity compared to prototypical word pairs with the desired relation (Turney, 2008).",
        "In scenarios like information extraction or question answering, where identifying the existence of certain relations is often the core problem, measuring relational similarity provides a more flexible solution rather than creating relational classifiers for predefined or task-specific categories of relations (Turney, 2006; Jurgens et al., 2012).",
        "In order to promote this research direction, Ju-rgens et al. (2012) proposed a new shared task of measuring relational similarity in SemEval-2012 recently.",
        "In this task, each submitted system is required to judge the degree of a target word pair having a particular relation, measured by its relational similarity compared to a few prototypical example word pairs.",
        "The system performance is evaluated by its correlation with the human judg-ments using two evaluation metrics, Spearman's rank correlation and MaxDiff accuracy (more details of the task and evaluation metrics will be given in Sec. 3).",
        "Although participating systems incorporated substantial amounts of information from lexical resources (e.g., WordNet) and contextual patterns from large corpora, only one system (Rink and Harabagiu, 2012) is able to outperform a simple baseline that uses PMI (pointwise mutual information) scoring, which demonstrates the difficulty of this task.",
        "In this paper, we explore the problem of measuring relational similarity in the same task setting.",
        "We argue that due to the large number of possible relations, building an ensemble of relational simi",
        "larity models based on heterogeneous information sources is the key to advance the state-of-the-art on this problem.",
        "By combining two general-purpose relational similarity models with three specific word-relation models covering relations like IsA and synonymy/antonymy, we improve the previous state-of-the-art substantially ?",
        "having a relative gain of 54.1% in Spearman's rank correlation and 14.7% in the MaxDiff accuracy!",
        "Our main contributions are threefold.",
        "First, we propose a novel directional similarity method based on the vector representation of words learned from a recurrent neural network language model.",
        "The relation of two words is captured by their vector offset in the latent semantic space.",
        "Similarity of relations can then be naturally measured by a distance function in the vector space.",
        "This method alone already performs better than all existing systems.",
        "Second, unlike the previous finding, where SVMs learn a much poorer model than naive Bayes (Rink and Harabagiu, 2012), we show that using a highly-regularized log-linear model on simple contextual pattern features collected from a document collection of 20GB, a discriminative approach can learn a strong model as well.",
        "Third, we demonstrate that by augmenting existing word-relation models, which cover only a small number of relations, the overall system can be further improved.",
        "The rest of this paper is organized as follows.",
        "We first survey the related work in Sec. 2 and formally define the problem in Sec. 3.",
        "We describe the individual models in detail in Sec. 4.",
        "The combination approach is depicted in Sec. 5, along with experimental comparisons to individual models and existing systems.",
        "Finally, Sec. 6 concludes the paper."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Building a classifier to determine whether a relationship holds between a pair of words is a natural approach to the task of measuring relational similarity.",
        "While early work was mostly based on hand-crafted rules (Finin, 1980; Vanderwende, 1994), Rosario and Hearst (2001) introduced a machine learning approach to classify word pairs.",
        "They targeted classifying noun modifier pairs from the medical domain into 13 classes of semantic relations.",
        "Features for each noun modifier pair were constructed using large medical lexical resources and a multi-class classifier was trained using a feed-forward neural network with one hidden layer.",
        "This work was later extended by Nastase and Szpakowicz (2003) to classify general domain noun-modifier pairs into 30 semantic relations.",
        "In addition to extracting features using WordNet and Roget's Thesaurus, they also experimented with several different learners including decision trees, memory-based learning and inductive logic programming methods like RIPPER and FOIL.",
        "Using the same dataset as in (Nastase and Szpakowicz, 2003), Turney and Littman (2005) created a 128-dimentional feature vector for each word pair based on statistics of their co-occurrence patterns in Web documents and applied the k-NN method (k = 1 in their work).",
        "Measuring relational similarity, which determines whether two word pairs share the same relation, can be viewed as an extension of classifying relations between two words.",
        "Treating a relational similarity measure as a distance metric, a testing pair of words can be judged by whether they have a relation that is similar to some prototypical word pairs having a particular relation.",
        "A multi-relation classifier can thus be built easily in this framework as demonstrated in (Turney, 2008), where the problems of identifying synonyms, antonyms and associated words are all reduced to finding good analogous word pairs.",
        "Measuring relational similarity has been advocated and pioneered by Turney (2006), who proposed a latent vector space model for answering SAT analogy questions (e.g., mason:stone vs. carpenter:wood).",
        "In contrast, we take a slightly different view when building a relational similarity measure.",
        "Existing classifiers for specific word relations (e.g., synonyms or Is-A) are combined with general relational similarity measures.",
        "Empirically, mixing heterogeneous models tends to make the final relational similarity measure more robust.",
        "Although datasets for semantic relation classification or SAT analogous questions can be used to evaluate a relational similarity model, their labels are either binary or categorical, which makes the datasets suboptimal for determining the quality of a model when evaluated on instances of the same relation class.",
        "As a result, Jurgens et al. (2012) proposed a new task of ?Measuring Degrees of Relational Similarity?",
        "at SemEval-2012, which includes 79 relation",
        "categories exemplified by three or four prototypical word pairs and a schematic description.",
        "For example, for the Class-Inclusion:Taxonomic relation, the schematic description is ?Y is a kind/type/instance of X?.",
        "Using Amazon Mechanical Turk1, they collected word pairs for each relation, as well as their degrees of being a good representative of a particular relation when compared with defining examples.",
        "Participants of this shared task proposed various kinds of approaches that leverage both lexical resources and general corpora.",
        "For instance, the Duluth systems (Pedersen, 2012) created word vectors based on WordNet and estimated the degree of a relation using cosine similarity.",
        "The BUAP system (Tovar et al., 2012) represented each word pair as a whole by a vector of 4 different types of features: context, WordNet, POS tags and the average number of words separating the two words in text.",
        "The degree of relation was then determined by the cosine distance of the target pair from the prototypical examples of each relation.",
        "Although their models incorporated a significant amount of information of words or word pairs, unfortunately, the performance were not much better than a random baseline, which indicates the difficulty of this task.",
        "In comparison, a supervised learning approach seems more promising.",
        "The UTD system (Rink and Harabagiu, 2012), which mined lexical patterns between co-occurring words in the corpus and then used them as features to train a Naive Bayes classifier, achieved the best results.",
        "However, potentially due to the large feature space, this strategy did not work as well when switching the learning algorithm to SVMs."
      ]
    },
    {
      "heading": "3 Problem Definition & Task Description",
      "text": [
        "Following the setting of SemEval-2012 Task 2 (Jurgens et al., 2012), the problem of measuring the degree of relational similarity is to rate word pairs by the degree to which they are prototypical members of a given relation class.",
        "For instance, comparing to the prototypical word pairs, {cutlery:spoon, clothing:shirt, vermin:rat} of the Class-Inclusion:Singular Collective relation, we would like to know among the input word pairs {dish:bowl, book:novel, furniture:desk}, which one",
        "best demonstrates the relation.",
        "Because our approaches are evaluated using the data provided in this SemEval-2012 task, we describe briefly below how the data was collected, as well as the metrics used to evaluate system performance.",
        "The dataset consists of 79 relation classes that are chosen according to (Bejar et al., 1991) and broadly fall into 10 main categories, including Class-Inclusion, Part-Whole, Similar and more.",
        "With the help of Amazon Mechanical Turk, Jurgens et al. (2012) used a two-phase approach to collect word pairs and their degrees.",
        "In the first phase, a lexical schema, such as ?a Y is one item in a collection/group of X?",
        "for the aforementioned relation Class-Inclusion:Singular Collective, and a few prototypical pairs for each class were given to the workers, who were asked to provide approximately a list of 40 word pairs representing the same relation class.",
        "Naturally, some of these pairs were better examples than the others.",
        "Therefore, in the second phase, the goal was to measure the degree of their similarity to the corresponding relation.",
        "This was done using the MaxDiff technique (Louviere and Woodworth, 1991).",
        "For each relation, about one hundred questions were first created.",
        "Each question consists of four different word pairs randomly sampled from the list.",
        "The worker was then asked to choose the most and least representative word pairs for the specific relation in each question.",
        "The set of 79 word relations were randomly split into training and testing sets.",
        "The former contains 10 relations and the latter has 69.",
        "Word pairs in all 79 relations were given to the task participants in advance, but only the human judgments of the training set were available for system development.",
        "In this work, we treat the training set as the validation set ?",
        "all the model exploration and refinement is done using this set of data, as well as the hyper-parameter tuning when learning the final model combination.",
        "The quality of a relational similarity measure is estimated by its correlation to human judgments.",
        "This is evaluated using two metrics in the task: the MaxDiff accuracy and Spearman's rank correlation coefficient (?).",
        "A system is first asked to pick the most and least representative word pairs of each question in the MaxDiff setting.",
        "The average accuracy of the predictions compared to the human answers is then reported.",
        "In contrast, Spearman's ?",
        "measures the correlation between the total orderings of all word pairs of a relation, where the total ordering is derived from the MaxDiff answers (see (Jurgens et al., 2012) for the exact procedure)."
      ]
    },
    {
      "heading": "4 Models for Relational Similarity",
      "text": [
        "We investigate three types of models for relational similarity.",
        "Operating in a word vector space, the directional similarity model compares the vector differences of target and prototypical word pairs to estimate their relational similarity.",
        "The lexical pattern method collects contextual information of pairs of words when they co-occur in large corpora, and learns a highly regularized log-linear model.",
        "Finally, the word relation models incorporate existing, specific word relation measures for general relational similarity."
      ]
    },
    {
      "heading": "4.1 Directional Similarity Model",
      "text": [
        "Our first model for relational similarity extends previous work on semantic word vector representations to a directional similarity model for pairs of words.",
        "There are many different methods for creating real-valued semantic word vectors, such as the distributed representation derived from a word co-occurrence matrix and a low-rank approximation (Landauer et al., 1998), word clustering (Brown et al., 1992) and neural-network language model-ing (Bengio et al., 2003; Mikolov et al., 2010).",
        "Each element in the vectors conceptually represents some latent topicality information of the word.",
        "The goal of these methods is that words with similar meanings will tend to be close to each other in the vector space.",
        "Although the vector representation of single words has been successfully applied to problems like semantic word similarity and text classification (Turian et al., 2010), the issue of how to represent and compare pairs of words in a vector space remains unclear (Turney, 2012).",
        "In a companion paper (Mikolov et al., 2013), we present a vector offset method which performs consistently well in identifying both syntactic and semantic regularities.",
        "This method measures the degree of the analogy ?a is to b as c is to d?",
        "using the cosine score of (~vb?~va +~vc, ~vd), where a, b, c, d are the four given words and ~va, ~vb, ~vc, ~vd are the corresponding vec",
        "tions of clothing:shirt and furniture:desk respectively in this semantic vector space.",
        "The relational similarity of these two word pairs is estimated by the cosine of ?.",
        "tors.",
        "In this paper, we propose a variant called the directional similarity model, which performs better for semantic relations.",
        "Let ?i = (wi1 , wi2) and ?j = (wj1 , wj2) be the two word pairs being compared.",
        "Suppose (~vi1 , ~vi2) and (~vj1 , ~vj2) are the corresponding vectors of these words.",
        "The directional vectors of ?i and ?j are defined as ~?i ?",
        "~vi2 ?",
        "~vi1 and ~?j ?",
        "~vj2 ?",
        "~vj1 , respectively.",
        "Relational similarity of these two word pairs can be measured by some distance function of ?i and ?j , such as the cosine function: ~?i ?",
        "~?j ?~?i??~?j?",
        "The rationale behind this variant is as follows.",
        "Because the difference of two word vectors reveals the change from one word to the other in terms of multiple topicality dimensions in the vector space, two word pairs having similar offsets (i.e., being relatively parallel) can be interpreted as they have similar relations.",
        "Fig.",
        "1 further illustrates this method.",
        "Compared to the original method, this variant places less emphasis on the similarity between words wj1 and wj2 .",
        "That similarity is necessary for syntactic relations where the words are often related by morphology, but not for semantic relations.",
        "On semantic relations studied in this paper, the directional similarity model performs about 18% relatively better in Spearman's ?",
        "than the original one.",
        "The quality of the directional similarity method depends heavily on the underlying word vector space model.",
        "We compared two choices with dif",
        "the directional similarity method, evaluated on the training set.",
        "The 1600-dimensional RNNLM vector space achieves the highest Spearman's ?",
        "and MaxDiff accuracy.",
        "ferent dimensionality settings: the word embedding learned from the recurrent neural network language model (RNNLM)2 and the LSA vectors, both were trained using the same Broadcast News corpus of 320M words as described in (Mikolov et al., 2011).",
        "All the word vectors were first normalized to unit vectors before applying the directional similarity method.",
        "Given a target word pair, we computed its relational similarity compared with the prototypical word pairs of the same relation.",
        "The average of these measurements was taken as the final model score.",
        "Table 1 summarizes the results when evaluated on the training set.",
        "As shown in the table, the RNNLM vectors consistently outperform their LSA counterparts with the same dimensionality.",
        "In addition, more dimensions seem to preserve more information and lead to better performance.",
        "Therefore, we take the 1600-dimensional RNNLM vectors to construct our final directional similarity model."
      ]
    },
    {
      "heading": "4.2 Lexical Pattern Model",
      "text": [
        "Our second model for measuring relational similarity is built based on lexical patterns.",
        "It is well-known that contexts in which two words co-occur often provide useful cues for identifying the word relation.",
        "For example, having observed frequent text fragments like ?X such as Y?, it is likely that there is a Class-Inclusion:Taxonomic relation between X and Y; namely, Y is a type of X.",
        "Indeed, by mining lexical patterns from a large corpus, the UTD system (Rink and Harabagiu, 2012) managed to outperform other participants in the SemEval-2012 task of measuring",
        "In order to find more co-occurrences of each pair of words, we used a large document set that consists of the Gigaword corpus (Parker et al., 2009), Wikipedia and LA Times articles3, summing up to more than 20 Gigabytes of texts.",
        "For each word pair (w1, w2) that co-occur in a sentence, we collected the words in between as its context (or so-called ?raw pattern?).",
        "For instance, ?such as?",
        "would be the context extracted from ?X such as Y?",
        "for the word pair (X, Y).",
        "To reduce noise, contexts with more than 9 words were dropped and 914,295 patterns were collected in total.",
        "Treating each raw pattern as a feature where the value is the logarithm of the occurrence count, we then built a probabilistic classifier to determine the association of the context and relation.",
        "For each relation, we treated all its word pairs as positive examples and all the word pairs in other relations as negative examples4.",
        "79 classifiers were trained in total, where each one was trained using 3,218 examples.",
        "The degree of relational similarity of each word pair can then be judged by the output of the corresponding classifier5.",
        "Although this seems like a standard supervised learning setting, the large number of features poses a challenge here.",
        "Using almost 1M features and 3,218 examples, the model could easily overfit if not regularized properly, which may explain why learning SVMs on pattern features performed poorly (Rink and Harabagiu, 2012).",
        "Instead of employing explicit feature selection methods, we used an efficient L1 regularized log-linear model learner (Andrew and Gao, 2007) and chose the hyper-parameters based on model performance on the training data.",
        "The final models we chose were trained with L1 = 3, where 28,065 features in average were selected automatically by the algo",
        "ing all words pairs except the four target pairs appears to be a better setting, as it would avoid including the target pairs in the training process.",
        "We did not use this setting because it is more complicated and performed roughly the same empirically.",
        "rithm.",
        "The performance on the training data is 0.322 in Spearman's ?",
        "and 41.8% in MaxDiff accuracy."
      ]
    },
    {
      "heading": "4.3 Word Relation Models",
      "text": [
        "The directional similarity and lexical pattern models can be viewed as general purpose methods for relational similarity as they do not differentiate the specific relation categories.",
        "In contrast, for specific word relations, there exist several high-quality methods.",
        "Although they are designed for detecting specific relations between words, incorporating them could still improve the overall results.",
        "Next, we explore the use of some of these word relation models, including information encoded in the knowledge base and a lexical semantic model for synonymy and antonymy.",
        "Predetermined types of relations can often be found in existing lexical and knowledge databases, such as WordNet's Is-A taxonomy and the extensive relations stored in the NELL (Carlson et al., 2010) knowledge base.",
        "Although in theory, these resources can be directly used to solve the problem of relational similarity, such direct approaches often suffer from two practical issues.",
        "First, the word coverage of these databases is usually very limited and it is common that the relation of a given word pair is absent.",
        "Second, the degree of relation is often not included, which makes the task of measuring the degree of relational similarity difficult.",
        "One counter example, however, is Probase (Wu et al., 2012), which is a knowledge base that establishes connections between more than 2.5 million concepts discovered automatically from the Web.",
        "For the Is-A and Attribute relations it encodes, Probase also returns the probability that two input words share the relation, based on the co-occurrence frequency.",
        "We used some relations in the training set to evaluate the quality of Probase.",
        "For instance, its Is-A model performs exceptionally well on the relation Class-Inclusion:Taxonomic, reaching a high Spearman's ?",
        "= 0.642 and MaxDiff accuracy 55.8%.",
        "Similarly, its Attribute model performs better than our lexical pattern model",
        "on Attribute:Agent Attribute-State with Spearman's ?",
        "= 0.290 and MaxDiff accuracy 32.7%.",
        "Most lexical semantics measures focus on the semantic similarity or relatedness of two words.",
        "Since our task focuses on distinguishing the difference between word pairs in the same relation category.",
        "The crude relatedness model does not seem to help in our preliminary experimental study.",
        "Instead, we leverage the recently proposed polarity-inducing latent semantic analysis (PILSA) model (Yih et al., 2012), which specifically estimates the degree of synonymy and antonymy.",
        "This method first forms a signed co-occurrence matrix using synonyms and antonyms in a thesaurus and then generalizes it using a low-rank approximation derived by SVD.",
        "Given two words, the cosine score of their PILSA vectors tend to be negative if they are antonymous and positive if synonymous.",
        "When tested on the Similar:Synonymity relation, it has a Spearman's ?",
        "= 0.242 and MaxDiff accuracy 42.1%, both are better than those of our directional similarity and lexical pattern models."
      ]
    },
    {
      "heading": "5 Model Combination",
      "text": [
        "In order to fully leverage the diverse models proposed in Sec. 4, we experiment with a model combination approach and conduct a model ablation study.",
        "Performance of the combined and individual models is evaluated using the test set and compared with existing systems.",
        "We seek an optimal linear combination of all the individual models by treating their output as features and use a logistic regression learner to learn the weights6.",
        "The training setting is essentially the same as the one used to learn the lexical pattern model (Sec.",
        "4.2).",
        "For each relation, we treat all the word pairs in this relation group as positive examples and all other word pairs as negative ones.",
        "Consequently, 79 sets of weights for model combination are learned in total.",
        "The average Spearman's ?",
        "of the 10 training relations is used for selecting the values of the L1 and L2 regularizers7.",
        "Evaluated on the remaining 69 relations (i.e., the test set), the average results of each main relation group and the overall",
        "testing relations.",
        "The best result in each row is highlighted in boldface font.",
        "Statistical significance tests are conducted by comparing each of our systems with the previous best performing system, UTDNB .",
        "?",
        "and ?",
        "indicate the difference in the average results is statistically significant with 95% or 99% confidence level, respectively.",
        "results are presented in Table 2.",
        "For comparison, we also show the performance of a random baseline and the best performing system of each participant in the SemEval-2012 task.",
        "We draw two conclusions from this table.",
        "First, both of our general relational similarity models, the directional similarity (DS) and lexical pattern (Pat) models are fairly strong.",
        "The former outperforms the previous best system UTDNB in both Spear-man's ?",
        "and MaxDiff accuracy, where the differences are statistically significant8; the latter has comparable performance, where the differences are not statistically significant.",
        "In contrast, while the IsA relation from Probase is exceptionally good in identifying Class-Inclusion relations, with high Spearman's ?",
        "= 0.619 and MaxDiff accuracy 8We conducted a paired-t test on the results of each of the 69 relation.",
        "The difference is considered statistically significant if the p-value is less than 0.05.",
        "59.6%, it does not have high correlations with human judgments in other relations.",
        "Like in the case of Probase Attribute and PILSA, specific word-relation models individually are not good measures for general relational similarity.",
        "Second, as expected, combining multiple diverse models (Com) is a robust strategy, which provides the best overall performance.",
        "It achieves superior results in both evaluation metrics compared to UTDNB and only a lower Spearman's ?",
        "value in one of the ten relation groups (namely, Reference).",
        "The differences are statistically significant with p-value less than 10?3.",
        "In order to understand the interaction among different component models, we conducted an ablation study by iteratively removing one model from the final combination.",
        "The weights are retrained using the same procedure that finds the best regularization parameters with the help of training data.",
        "Table 3 summarizes the results and compares them with the",
        "ing all models, where other columns show the results when the specified model is removed.",
        "The best result in each row is highlighted in boldface font.",
        "Statistical significance tests are conducted by comparing each ablation configuration with Com.",
        "?",
        "indicates the difference in the average results is statistically significant with 99% confidence level.",
        "original combination model.",
        "Overall, it is clear that the directional similarity method based on RNNLM vectors is the most critical component model.",
        "Removing it from the final combination decreases both the Spearman's ?",
        "and MaxDiff accuracy by a large margin; both differences (Com vs. -DS) are statistically significant.",
        "The Probase IsA model also has an important impact on the performance on the Class-Inclusion relation group.",
        "Eliminating the IsA model makes the overall MaxDiff accuracy statistically significantly lower (Com vs. -IsA).",
        "Again, the benefits of incorporating Probase Attribute and PILSA models are not clear.",
        "Removing them from the final combination lowers the MaxDiff accuracy, but neither the difference in Spearman's ?",
        "nor MaxDiff accuracy is statistically significant.",
        "Compared to the RNNLM directional similarity model, the lexical pattern model seems less critical.",
        "Removing it lowers the Similar and Contrast relation groups, but improves some other relation groups like Class-Inclusion and Case Relations.",
        "The final MaxDiff accuracy becomes slightly higher but the Spearman's ?",
        "drops a little (Com vs. -Pat); neither is statistically significant.",
        "Notice that the main purpose of the ablation study is to verify the importance of an individual component model when a significant performance drop is observed after removing it.",
        "However, occasionally the overall performance may go up slightly.",
        "Typically this is due to the fact that some models do not provide useful signals to a particular relation, but instead introduce more noise.",
        "Such effects can often be alleviated when there are enough quality training data, which is unfortunately not the case here."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "In this paper, we presented a system that combines heterogeneous models based on different information sources for measuring relational similarity.",
        "Our two individual general-purpose relational similarity models, directional similarity and lexical pattern methods, perform strongly when compared to existing systems.",
        "After incorporating specific word-relation models, the final system sets a new state-of-the-art on the SemEval-2012 task 2 test set, achieving Spearman's ?",
        "= 0.353 and MaxDiff accuracy 45.4% ?",
        "resulting in 54.1% and 14.7% relative improvement in these two metrics, respectively.",
        "Despite its simplicity, our directional similarity approach provides a robust model for relational similarity and is a critical component in the final system.",
        "When the lexical pattern model is included, our overall model combination method can be viewed as a two-stage learning system.",
        "As demonstrated in our work, with an appropriate regularization strategy, high-quality models can be learned in both stages.",
        "Finally, as we observe from the positive effect of adding the Probase IsA model, specific word-relation models can further help improve the system",
        "although they tend to cover only a small number of relations.",
        "Incorporating more such models could be a steady path to enhance the final system.",
        "In the future, we plan to pursue several research directions.",
        "First, as shown in our experimental results, the model combination approach does not always outperform individual models.",
        "Investigating how to select models to combine for each specific relation or relation group individually will be our next step for improving this work.",
        "Second, because the labeling process of relational similarity comparisons is inherently noisy, it is unrealistic to request a system to correlate human judgments perfectly.",
        "Conducting some user study to estimate the performance ceiling in each relation category may help us focus on the weaknesses of the final system to enhance it.",
        "Third, it is intriguing to see that the directional similarity model based on the RNNLM vectors performs strongly, even though the RNNLM training process is not related to the task of relational similarity.",
        "Investigating the effects of different vector space models and proposing some theoretical justifications are certainly interesting research topics.",
        "Finally, we would like to evaluate the utility our approach in other applications, such as the SAT analogy problems proposed by Turney (2006) and question answering."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We thank Richard Socher for valuable discussions, Misha Bilenko for his technical advice and anonymous reviewers for their comments."
      ]
    }
  ]
}
