{
  "info": {
    "authors": [
      "Carmen Banea",
      "Yoonjung Choi",
      "Lingjia Deng",
      "Samer Hassan",
      "Michael Mohler",
      "Bishan Yang",
      "Claire Cardie",
      "Rada Mihalcea",
      "Jan Wiebe"
    ],
    "book": "*SEM",
    "id": "acl-S13-1032",
    "title": "CPN-CORE: A Text Semantic Similarity System Infused with Opinion Knowledge",
    "url": "https://aclweb.org/anthology/S13-1032",
    "year": 2013
  },
  "references": [
    "acl-D12-1122",
    "acl-E09-1065",
    "acl-H05-2018",
    "acl-J90-1003",
    "acl-J98-1004",
    "acl-N03-1020",
    "acl-N04-3012",
    "acl-P02-1040",
    "acl-P11-1076",
    "acl-P94-1019",
    "acl-S12-1051",
    "acl-S12-1094",
    "acl-S13-1004"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This article provides a detailed overview of the CPN text-to-text similarity system that we participated with in the Semantic Textual Similarity task evaluations hosted at *SEM 2013.",
        "In addition to more traditional components, such as knowledge-based and corpus-based metrics leveraged in a machine learning framework, we also use opinion analysis features to achieve a stronger semantic representation of textual units.",
        "While the evaluation datasets are not designed to test the similarity of opinions, as a component of textual similarity, nonetheless, our system variations ranked number 38, 39 and 45 among the 88 participating systems."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Measures of text similarity have been used for a long time in applications in natural language processing and related areas.",
        "One of the earliest applications of text similarity is perhaps the vector-space model used in information retrieval, where the document most relevant to an input query is determined by ranking documents in a collection in reversed order of their angular distance with the given query (Salton and Lesk, 1971).",
        "Text similarity has also been used for relevance feedback and text classification (Rocchio, 1971), word sense disambiguation (Lesk, 1986; Schütze, 1998), and extractive summa-rization (Salton et al., 1997), in the automatic evaluation of machine translation (Papineni et al., 2002), ?carmen.banea@gmail.com ?",
        "rada@cs.unt.edu text summarization (Lin and Hovy, 2003), text coherence (Lapata and Barzilay, 2005) and in plagiarism detection (Nawab et al., 2011).",
        "Earlier work on this task has primarily focused on simple lexical matching methods, which produce a similarity score based on the number of lexical units that occur in both input segments.",
        "Improvements to this simple method have considered stemming, stopword removal, part-of-speech tagging, longest subsequence matching, as well as various weighting and normalization factors (Salton and Buckley, 1997).",
        "While successful to a certain degree, these lexical similarity methods cannot always identify the semantic similarity of texts.",
        "For instance, there is an obvious similarity between the text segments ?she owns a dog?",
        "and ?she has an animal,?",
        "yet these methods will mostly fail to identify it.",
        "More recently, researchers have started to consider the possibility of combining the large number of word-to-word semantic similarity measures (e.g., (Jiang and Conrath, 1997; Leacock and Chodorow, 1998; Lin, 1998; Resnik, 1995)) within a semantic similarity method that works for entire texts.",
        "The methods proposed to date in this direction mainly consist of either bipartite-graph matching strategies that aggregate word-to-word similarity into a text similarity score (Mihalcea et al., 2006; Islam and Inkpen, 2009; Hassan and Mihalcea, 2011; Mohler et al., 2011), or data-driven methods that perform component-wise additions of semantic vector representations as obtained with corpus measures such as latent semantic analysis (Landauer et al., 1997), explicit semantic analysis (Gabrilovich and Markovitch, 2007), or salient semantic analysis",
        "(Hassan and Mihalcea, 2011).",
        "In this paper, we describe the system variations with which we participated in the *SEM 2013 task on semantic textual similarity (Agirre et al., 2013).",
        "The system builds upon our earlier work on corpus-based and knowledge-based methods of text semantic similarity (Mihalcea et al., 2006; Hassan and Mihalcea, 2011; Mohler et al., 2011; Banea et al., 2012), while also incorporating opinion aware features.",
        "Our observation is that text is not only similar on a semantic level, but also with respect to opinions.",
        "Let us consider the following text segments: ?she owns a dog?",
        "and ?I believe she owns a dog.?",
        "The question then becomes how similar these text fragments truly are.",
        "Current systems will consider the two sentences semantically equivalent, yet to a human, they are not.",
        "A belief is not equivalent to a fact (and for the case in point, the person may very well have a cat or some other pet), and this should consequently lower the relatedness score.",
        "For this reason, we advocate that STS systems should also consider the opinions expressed and their equivalence.",
        "While the *SEM STS task is not formulated to evaluate this type of similarity, we complement more traditional corpus and knowledge-based methods with opinion aware features, and use them in a meta-learning framework in an arguably first attempt at incorporating this type of information to infer text-to-text similarity."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Over the past years, the research community has focused on computing semantic relatedness using methods that are either knowledge-based or corpus-based.",
        "Knowledge-based methods derive a measure of relatedness by utilizing lexical resources and ontologies such as WordNet (Miller, 1995) to measure definitional overlap, term distance within a graphical taxonomy, or term depth in the taxonomy as a measure of specificity.",
        "We explore several of these measures in depth in Section 3.3.1.",
        "On the other side, corpus-based measures such as Latent Semantic Analysis (LSA) (Landauer et al., 1997), Explicit Semantic Analysis (ESA) (Gabrilovich and Markovitch, 2007), Salient Semantic Analysis (SSA) (Hassan and Mihalcea, 2011), Pointwise Mutual Information (PMI) (Church and Hanks, 1990), PMI-IR (Turney, 2001), Second Order PMI (Islam and Inkpen, 2006), Hyperspace Analogues to Language (Burgess et al., 1998) and distributional similarity (Lin, 1998) employ probabilistic approaches to decode the semantics of words.",
        "They consist of unsupervised methods that utilize the contextual information and patterns observed in raw text to build semantic profiles of words.",
        "Unlike knowledge-based methods, which suffer from limited coverage, corpus-based measures are able to induce a similarity between any given two words, as long as they appear in the very large corpus used as training."
      ]
    },
    {
      "heading": "3 Semantic Textual Similarity System",
      "text": []
    },
    {
      "heading": "3.1 Task Setup",
      "text": [
        "The STS task consists of labeling one sentence pair at a time, based on the semantic similarity existent between its two component sentences.",
        "Human assigned similarity scores range from 0 (no relation) to 5 (semantivally equivalent).",
        "The *SEM 2013 STS task did not provide additional labeled data to the training and testing sets released as part of the STS task hosted at SEMEVAL 2012 (Agirre et al., 2012); our system variations were trained on SEMEVAL 2012 data.",
        "The test sets (Agirre et al., 2013) consist of text pairs extracted from headlines (headlines, 750 pairs), sense definitions from WordNet and OntoNotes (OnWN, 561 pairs), sense definitions from WordNet and FrameNet (FNWN, 189 pairs), and data used in the evaluation of machine translation systems (SMT, 750 pairs)."
      ]
    },
    {
      "heading": "3.2 Resources",
      "text": [
        "Various subparts of our framework use several resources that are described in more detail below.",
        "Wikipedia1 is the most comprehensive encyclo-pedia to date, and it is an open collaborative effort hosted on-line.",
        "Its basic entry is an article which in addition to describing an entity or an event also contains hyperlinks to other pages within or outside of Wikipedia.",
        "This structure (articles and hyperlinks) is directly exploited by semantic similarity methods such as ESA (Gabrilovich and Markovitch, 2007),",
        "based methods are trained on the English Wikipedia download from October 2008.",
        "WordNet (Miller, 1995) is a manually crafted lexical resource that maintains semantic relationships such as synonymy, antonymy, hypernymy, etc., between basic units of meaning, or synsets.",
        "These relationships are employed by various knowledge-based methods to derive semantic similarity.",
        "The MPQA corpus (Wiebe and Riloff, 2005) is a newswire data set that was manually annotated at the expression level for opinion-related content.",
        "Some of the features derived by our opinion extraction models were based on training on this corpus."
      ]
    },
    {
      "heading": "3.3 Features",
      "text": [
        "Our system variations derive the similarity score of a given sentence-pair by integrating information from knowledge, corpus, and opinion-based sources3.",
        "Following prior work from our group (Mihalcea et al., 2006; Mohler and Mihalcea, 2009), we employ several WordNet-based similarity metrics for the task of sentence-level similarity.",
        "Briefly, for each open-class word in one of the input texts, we compute the maximum semantic similarity4 that can be obtained by pairing it with any open-class word in the other input text.",
        "All the word-to-word similarity scores obtained in this way are summed and normalized to the length of the two input texts.",
        "We provide below a short description for each of the similarity metrics employed by this system.",
        "The shortest path (Path) similarity is equal to:",
        "where length is the length of the shortest path be",
        "where length is the length of the shortest path between two concepts using node-counting, and D is the maximum depth of the taxonomy.",
        "The Lesk (Lesk) similarity of two concepts is defined as a function of the overlap between the corresponding definitions, as provided by a dictionary.",
        "2004).",
        "It is based on an algorithm proposed by Lesk (1986) as a solution for word sense disambiguation.",
        "The Wu & Palmer (Wu and Palmer, 1994) (WUP ) similarity metric measures the depth of two given concepts in the WordNet taxonomy, and the depth of the least common subsumer (LCS), and combines these figures into a similarity score:",
        "The measure introduced by Resnik (Resnik, 1995) (RES) returns the information content (IC) of the LCS of two concepts:",
        "and P (c) is the probability of encountering an instance of concept c in a large corpus.",
        "The measure introduced by Lin (Lin, 1998) (Lin) builds on Resnik's measure of similarity, and adds a normalization factor consisting of the information content of the two input concepts:",
        "While most of the corpus-based methods induce semantic profiles in a word-space, where the semantic profile of a word is expressed in terms of its co-occurrence with other words, LSA, ESA and SSA rely on a concept-space representation, thus expressing a word's semantic profile in terms of the implicit (LSA), explicit (ESA), or salient (SSA) concepts.",
        "This departure from the sparse word-space to a denser, richer, and unambiguous concept-space resolves one of the fundamental problems in semantic relatedness, namely the vocabulary mismatch.",
        "on the term-by-context matrix T, where the matrix is induced from a large corpus.",
        "This reduction entails the abstraction of meaning by collapsing similar contexts and discounting noisy and irrelevant ones, hence transforming the real world term-context space into a word-latent-concept space which achieves a much deeper and concrete semantic representation of words5.",
        "Random Projection (RP ) (Dasgupta, 1999).",
        "In RP, a high dimensional space is projected onto a lower dimensional one, using a randomly generated matrix.",
        "(Bingham and Mannila, 2001) show that unlike LSA or principal component analysis (PCA), RP is computationally efficient for large corpora, while also retaining accurate vector similarity and yielding comparable results.",
        "Explicit Semantic Analysis (ESA) (Gabrilovich and Markovitch, 2007).",
        "ESA uses encyclopedic knowledge in an information retrieval framework to generate a semantic interpretation of words.",
        "It relies on the distribution of words inside Wikipedia articles, thus building a semantic representation for a given word using a word-document association.",
        "Salient Semantic Analysis (SSA) (Hassan and Mihalcea, 2011).",
        "SSA incorporates a similar semantic abstraction as ESA, yet it uses salient concepts gathered from encyclopedic knowledge, where a ?concept?",
        "represents an unambiguous expression which affords an encyclopedic definition.",
        "Saliency in this case is determined based on the word being hyperlinked in context, implying that it is highly relevant to the given text.",
        "In order to determine the similarity of two text fragments, we employ two variations: the typical cosine similarity (cos) and a best alignment strategy (align), which we explain in more detail in the paragraph below.",
        "Both variations were paired with the ESA, and SSA systems resulting in four similarity scores that were used as features by our meta-system, namely ESAcos, ESAalign, SSAcos, and SSAalign; in addition, we also used BOWcos, LSAcos, and RPcos.",
        "Best Alignment Strategy (align).",
        "Let Ta and Tb be two text fragments of size a and b respectively.",
        "After removing all stopwords, we first determine the num-5We use the LSA implementation available at code.",
        "google.com/p/semanticvectors/.",
        "ber of shared terms (?)",
        "between Ta and Tb.",
        "Second, we calculate the semantic relatedness of all possible pairings between non-shared terms in Ta and Tb.",
        "We further filter these possible combinations by creating a list ?",
        "which holds the strongest semantic pairings between the fragments?",
        "terms, such that each term can only belong to one and only one pair.",
        "where ?i is the similarity score for the ith pairing.",
        "We design opinion-aware features to capture sentence similarity on the subjectivity level based on the output of three subjectivity analysis systems.",
        "Intuitively, two sentences are similar in terms of subjectivity if there exists similar opinion expressions which also share similar opinion holders.",
        "OpinionFinder (Wilson et al., 2005) is a publicly available opinion extraction model that annotates the subjectivity of new text based on the presence (or absence) of words or phrases in a large lexicon.",
        "The system consists of a two step process, by feeding the sentences identified as subjective or objective by a rule-based high-precision classifier to a high-recall classifier that iteratively learns from the remaining corpus.",
        "For each sentence in a STS pair, the two classifiers provide two predictions; a subjectivity similarity score (SUBJSL) is computed as follows.",
        "If both sentences are classified as subjective or objective, the score is 1; if one is subjective and the other one is objective, the score is -1; otherwise it is 0.",
        "We also make use of the output of the subjective expression identifier in OpinionFinder.",
        "We first record how many expressions the two sentences have: feature NUMEX1 and NUMEX2.",
        "Then we compare how many tokens these expressions share and we normalize by the total number of expressions (feature EXPR).",
        "We compute the difference between the probabilities of the two sentences being subjective (SUBJDIFF), by employing a logistic regression classifier using LIBLINEAR (Fan et al., 2008) trained on the MPQA corpus.",
        "The smaller the difference, the more similar the sentences are in terms of subjectivity.",
        "We also employ features produced by the opinion-extraction model of Yang and Cardie (Yang and Cardie, 2012), which is better suited to process ex",
        "pressions of arbitrary length.",
        "Specifically, for each sentence, we extract subjective expressions and generate the following features.",
        "SUBJCNT is a binary feature which is equal to 1 if both sentences contain a subjective expression.",
        "DSEALGN marks the number of shared words between subjective expressions in two sentences, while DSESIM represents their similarity beyond the word level.",
        "We represent the subjective expressions in each sentence as a feature vector, containing unigrams extracted from the expressions, their part-of-speech, their WordNet hypernyms and their subjectivity label6, and compute the cosine similarity between the feature vectors.",
        "The holder of the opinion expressions is extracted with the aid of a dependency parser7.",
        "In most cases, the opinion holder and the opinion expression are related by the dependency relation subj.",
        "This relation is used to expand the verb dependents in the opinion expression and identify the opinion holder or AGENT."
      ]
    },
    {
      "heading": "3.4 Meta-learning",
      "text": [
        "Each metric described above provides one individual score for every sentence-pair in both the training and test set.",
        "These scores then serve as input to a meta-learner, which adjusts their importance, and thus their bearing on the overall similarity score predicted by the system.",
        "We experimented with regression and decision tree based algorithms by performing 10-fold cross validation on the 2012 training data; these types of learners are particularly well suited to maintain the ordinality of the semantic similarity scores (i.e. a score of 4.5 is closer to either 4 or 5, implying that the two sentences are mostly or fully equivalent, while also being far further away from 0, implying no semantic relatedness between the two sentences).",
        "We obtained consistent results when using support vector regression with polynomial kernel (Drucker et al., 1997; Smola and Schoelkopf, 1998) (SV R) and random subspace meta-classification with tree learners (Ho, 1998) (RandSubspace)8.",
        "We submitted three system variations based",
        "tem name) or the learning methodology (second word) used: comb.RandSubspace, comb.SV R and indv.RandSubspace.",
        "For comb, training was performed on the merged version of the entire 2012 SEMEVAL dataset.",
        "For indv, predictions for OnWN and SMT test data were based on training on matching OnWN and SMT 9 data from 2012, predictions for the other test sets were computed using the combined version (comb)."
      ]
    },
    {
      "heading": "4 Results and Discussion",
      "text": [
        "Table 2 lists the correlations obtained between the scores assigned by each one of the features we used and the scores assigned by the human judges.",
        "It is interesting to note that overall, corpus-based measures are stronger performers compared to knowledge-based measures.",
        "The top contenders in the former group are ESAalign, SSAalign, LSAcos, and RPcos, indicating that these methods are able to leverage a significant amount of semantic information from text.",
        "While LSAcos achieves high correlations on many of the datasets, replacing the singular value decomposition operation by random projection to a lower-dimension space (RP ) achieves competitive results while also being computationally efficient.",
        "This observation is in line with prior literature (Bingham and Mannila, 2001).",
        "Among the knowledge-based methods, JCN and Path achieve high performance on more than five of the datasets.",
        "In some cases, particularly on the 2013 test data, the shortest path method (Path) peforms better or on par with the performance attained by other knowledge-based measures, despite its computational simplicity.",
        "While opinion-based measures do not exhibit the same high correlation, we should remember that none of the datasets displays consistent opinion content, nor were they annotated with this aspect in mind, in order for this information to be properly leveraged and evaluated.",
        "Nonetheless, we notice several promising features, such as DSEALIGN and EXPR.",
        "Lower correlations seem to be associated with shorter spans of text, since when averaging all opinion-based correlations per dataset, MSRvid (x2), OnWN (x2), and headlines display the lowest average correlation, ranging from 0 to 0.03.",
        "This matches the expectation that opinionated content can be easier identified in longer contexts, as additional subjective elements amount to a stronger prediction.",
        "The other seven datasets consist of longer spans of text; they display an average opinion-based correlation between 0.07 and 0.12, with the exception of FNWN and SMTnews at 0.04 and 0.01, respectively.",
        "Our systems performed well, ranking 38, 39 and 45 among the 88 competing systems in *SEM 2013 (see Table 1), with the best being comb.SVR and comb.RandSubspace, both with a mean correlation of 0.494.",
        "We noticed from our participation in SEMEVAL 2012 (Banea et al., 2012), that training and testing on the same type of data achieves the best results; this receives further support when considering the performance of the indv.RandSubspace variation on the OnWN data10, which exhibits a 10The SMT test data is not part of the same corpus as either 0.034 correlation increase over our next best system (comb.RandSubspace).",
        "While we do surpass the bag-of-words cosine baseline (baseline-tokencos) computed by the task organizers by a 0.13 difference in correlation, we fall short by 0.124 from the performance of the best system in the STS task."
      ]
    },
    {
      "heading": "5 Conclusions",
      "text": [
        "To participate in the STS *SEM 2013 task, we constructed a meta-learner framework that combines traditional knowledge and corpus-based methods, while also introducing novel opinion analysis based metrics.",
        "While the *SEM data is not particularly suited for evaluating the performance of opinion features, this is nonetheless a first step toward conducting text similarity research while also considering the subjective dimension of text.",
        "Our system variations ranked 38, 39 and 45 among the 88 participating systems."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This material is based in part upon work supported by the National Science Foundation CAREER award #0747340 and IIS awards #1018613, SMTep or SMTnews.",
        "#0208798 and #0916046.",
        "This work was supported in part by DARPA-BAA-12-47 DEFT grant #12475008.",
        "Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the National Science Foundation or the Defense Advanced Research Projects Agency."
      ]
    }
  ]
}
