{
  "info": {
    "authors": [
      "Marion Weller",
      "Max Kisselew",
      "Svetlana Smekalova",
      "Alexander Fraser",
      "Helmut Schmid",
      "Nadir Durrani",
      "Hassan Sajjad",
      "Richárd Farkas"
    ],
    "book": "Workshop on Statistical Machine Translation",
    "id": "acl-W13-2230",
    "title": "Munich-Edinburgh-Stuttgart Submissions at WMT13: Morphological and Syntactic Processing for SMT",
    "url": "https://aclweb.org/anthology/W13-2230",
    "year": 2013
  },
  "references": [
    "acl-C08-1098",
    "acl-D11-1017",
    "acl-E12-1068",
    "acl-E12-1074",
    "acl-I08-2089",
    "acl-J13-1005",
    "acl-L08-1539",
    "acl-N12-1047",
    "acl-N13-1001",
    "acl-P05-1022",
    "acl-P08-1059",
    "acl-P10-1052",
    "acl-P11-1044",
    "acl-P11-1105",
    "acl-P12-1049",
    "acl-P12-1050",
    "acl-W09-0420",
    "acl-W10-1734",
    "acl-W10-1749",
    "acl-W13-2213",
    "acl-W13-2228"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We present 5 systems of the Munich-Edinburgh-Stuttgart1 joint submissions to the 2013 SMT Shared Task: FR-EN, EN-FR, RU-EN, DE-EN and EN-DE.",
        "The first three systems employ inflectional generalization, while the latter two employ parser-based reordering, and DE-EN performs compound splitting.",
        "For our experiments, we use standard phrase-based Moses systems and operation sequence models (OSM)."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Morphologically complex languages often lead to data sparsity problems in statistical machine translation.",
        "For translation pairs with morphologically rich source languages and English as target language, we focus on simplifying the input language in order to reduce the complexity of the translation model.",
        "The preprocessing of the source-language is language-specific, requiring morphological analysis (FR, RU) as well as sentence reordering (DE) and dealing with compounds (DE).",
        "Due to time constraints we did not deal with inflection for DE-EN and EN-DE.",
        "The morphological simplification process consists in lemmatizing inflected word forms and dealing with word formation (splitting portmanteau prepositions or compounds).",
        "This needs to take into account translation-relevant features (e.g. number) which vary across the different language pairs: while French only has the features number and gender, a wider array of features needs to be considered when modelling Russian (cf. table 6).",
        "In addition to morphological reduction, we also apply transliteration models learned from automatically 1The language pairs DE-EN and RU-EN were developed in collaboration with the Qatar Computing Research Institute and the University of Szeged.",
        "mined transliterations to handle out-of-vocabulary words (OOVs) when translating from Russian.",
        "Replacing inflected word forms with simpler variants (lemmas or the components of split compounds) aims not only at reducing the general complexity of the translation model, but also at decreasing the amount of out-of-vocabulary words in the input data.",
        "This is particularly the case with German compounds, which are very productive and thus often lack coverage in the parallel training data, whereas the individual components can be translated.",
        "Similarly, inflected word forms (e.g. adjectives) benefit from the reduction to lemmas if the full inflection paradigm does not occur in the parallel training data.",
        "For EN-FR, a translation pair with a morphologically complex target language, we describe a two-step translation system built on non-inflected word stems with a post-processing component for predicting morphological features and the generation of inflected forms.",
        "In addition to the advantage of a more general translation model, this method also allows the generation of inflected word forms which do not occur in the training data."
      ]
    },
    {
      "heading": "2 Experimental setup",
      "text": [
        "The translation experiments in this paper are carried out with either a standard phrase-based Moses system (DE-EN, EN-DE, EN-FR and FR-EN) or with an operation sequence model (RU-EN, DE-EN), cf. Durrani et al. (2013b) for more details.",
        "An operation sequence model (OSM) is a state-of-the-art SMT-system that learns translation and reordering patterns by representing a sentence pair and its word alignment as a unique sequence of operations (see e.g. Durrani et al. (2011), Durrani et al. (2013a) for more details).",
        "For the Moses systems we used the old train-model perl scripts rather than the EMS, so we did not perform Good-Turing smoothing; parameter tuning was carried out with batch-mira (Cherry and Foster, 2012).",
        "1 Removal of empty lines 2 Conversion of HTML special characters like \" to the corresponding characters 3 Unification of words that were written both with an ?",
        "or with an oe to only one spelling 4 Punctuation normalization and tokenization 5 Putting together clitics and apostrophes like l ?",
        "or d ?",
        "to l?",
        "and d?",
        "Definite determiners la / l?",
        "/ les ?",
        "le Indefinite determiners un / une ?",
        "un Adjectives Infl.",
        "form ?",
        "lemma Portmanteaus e. g. au ?",
        "a` le Verb participles Reduced to inflected for gender non-inflected and number verb participle form ending in e?e/e?s/e?es ending in e?",
        "Clitics and apostroph- d?",
        "?",
        "de, ized words are converted qu?",
        "?",
        "que, to their lemmas n?",
        "?",
        "ne, ... Table 2: Rules for morphological simplification.",
        "The development data consists of the concatenated news-data sets from the years 2008-2011.",
        "Unless otherwise stated, we use all constrained data (parallel and monolingual).",
        "For the target-side language models, we follow the approach of Schwenk and Koehn (2008) and train a separate language model for each corpus and then interpolate them using weights optimized on development data."
      ]
    },
    {
      "heading": "3 French to English",
      "text": [
        "French has a much richer morphology than English; for example, adjectives in French are inflected with respect to gender and number whereas adjectives in English are not inflected at all.",
        "This causes data sparsity in coverage of French inflected forms.",
        "We try to overcome this problem by simplifying French inflected forms in a preprocessing step in order to adapt the French input better to the English output.",
        "Processing of the training and test data The preprocessing of the French input consists of two steps: (1) normalizing not well-formed data (cf. table 1) and (2) morphological simplification.",
        "In the second step, the normalized training data is annotated with Part-of-Speech tags (PoS-tags) and word lemmas using RFTagger (Schmid and Laws, 2008) which was trained on the French treebank (Abeille?",
        "et al, 2003).",
        "French forms are then simplified according to the rules given in table 2.",
        "Data and experiments We trained a French to",
        "(WMT-2012).",
        "The marked system (*) corresponds to the system submitted for manual evaluation.",
        "(cs: case-sensitive, ci: case-insensitive) simplified constrained parallel data.",
        "Due to tractability problems with word alignment, the 109 French-English corpus and the UN corpus were filtered to a more manageable size.",
        "The filtering criteria are sentence length (between 15 and 25 words), as well as strings indicating that a sentence is neither French nor English, or otherwise not well-formed, aiming to obtain a subset of good-quality sentences.",
        "In total, we use 9M parallel sentences.",
        "For the English language model we use large training data with 287.3M true-cased sentences (including the LDC Giga-word data).",
        "We compare two systems: a baseline with regular French text, and a system with the described morphological simplifications.",
        "Results for the WMT-2012 test set are shown in table 3.",
        "Even though the baseline is better than the simplified system in terms of BLEU, we assume that the translation model of the simplified system benefits from the overall generalization ?",
        "thus, human annotators might prefer the output of the simplified system.",
        "For the WMT-2013 set, we obtain BLEU scores of 29,97 (cs) and 31,05 (ci) with the system built on simplified French (mes-simplifiedfrench)."
      ]
    },
    {
      "heading": "4 English to French",
      "text": [
        "Translating into a morphologically rich language faces two problems: that of asymmetry of morphological information contained in the source and target language and that of data sparsity.",
        "In this section we describe a two-step system designed to overcome these types of problems: first, the French data is reduced to non-inflected forms (stems) with translation-relevant morphological features, which is used to built the translation model.",
        "The second step consists of predicting all necessary morphological features for the translation output, which are then used to generate fully inflected forms.",
        "This two-step setup decreases the complexity of the translation task by removing language-specific features from the translation model.",
        "Furthermore, generating inflected forms based on word stems and morphological features allows to gener",
        "ate forms which do not occur in the parallel training data ?",
        "this is not possible in a standard SMT setup.",
        "The idea of separating the translation into two steps to deal with complex morphology was introduced by Toutanova et al. (2008).",
        "Fraser et al.",
        "(2012) applied this method to the language pair English-German with an additional special focus on word formation issues such as the splitting and merging of portmanteau prepositions and compounds.",
        "The presented inflection prediction systems focuses on nominal inflection; verbal inflection is not addressed.",
        "Morphological analysis and resources The morphological analysis of the French training data is obtained using RFTagger, which is designed for annotating fine-grained morphological tags (Schmid and Laws, 2008).",
        "For generating inflected forms based on stems and morphological features, we use an extended version of the finite-state morphology FRMOR (Zhou, 2007).",
        "Additionally, we use a manually compiled list of abbreviations and named entities (names of countries) and their respective grammatical gender.",
        "Stemming For building the SMT system, the French data (parallel and monolingual) is transformed into a stemmed representation.",
        "Nouns, i.e. the heads of NPs or PPs, are marked with inflection-relevant features: gender is considered as part of the stem, whereas number is determined by the source-side input: for example, we expect source-language words in plural to be translated by translated by stems with plural markup.",
        "This stem-markup is necessary in order to guarantee that the number information is not lost during translation.",
        "For a better generalization, portmanteaus are split into separate parts: au?",
        "a`+le (meaning, ?to the?).",
        "Predicting morphological features For predicting the morphological features of the SMT output (number and gender), we use a linear chain CRF (Lavergne et al., 2010) trained on data annotated with these features using n-grams of stems and part-of-speech tags within a window of 4 positions to each side of the current word.",
        "Through the CRF, the values specified in the stem-markup (number and gender on nouns) are propagated over the rest of the linguistic phrase, as shown in column 2 of table 4.",
        "Based on the stems and the morphological features, inflected forms can be generated using FRMOR (column 3).",
        "Post-processing As the French data has been normalized, a post-processing step is needed in order to generate correct French surface forms: split portmanteaus are merged into their regular forms based on a simple rule set.",
        "Furthermore, apostrophes are reintroduced for words like le, la, ne, ... if they are followed by a vowel.",
        "Column 4 in table 4 shows post-processing including portmanteau formation.",
        "Since we work on lowercased data, an additional recasing step is required.",
        "Experiments and evaluation We use the same set of reduced parallel data as the FR-EN system; the language model is built on 32M French sentences.",
        "Results for the WMT-2012 test set are given in table 5.",
        "Variant 1 shows the results for a small system trained only on a part of the training data (Europarl+News Commentary), whereas variant 2 corresponds to the submitted system.",
        "A small-scale analysis indicated that the inflection prediction system tends to have problems with subject-verb agreement.",
        "We trained a factored system using additional PoS-tags with number information which lead to a small improvement on both variants.",
        "While the small model is significantly better than the baseline2 as it benefits more from the generalization, the result for the full system is worse than the baseline3.",
        "Here, given the large amount of data, the generalization effect has less influence.",
        "However, we assume that the more general model from the inflection prediction system produces better translations than a regular model containing a large amount of irrelevant inflectional information, particularly when considering that it can produce well-formed inflected sequences that are inaccessible to the baseline.",
        "Even though this is not reflected in terms of BLEU, humans might prefer the inflection prediction system.",
        "For the WMT-2013 set, we obtain BLEU scores of 29.6 (ci) and 28.30 (cs) with the inflection prediction system mes-inflection (marked in table 5)."
      ]
    },
    {
      "heading": "5 Russian-English",
      "text": [
        "The preparation of the Russian data includes the following stages: (1) tokenization and tagging and (2) morphological reduction.",
        "Tagging and tagging errors For tagging, we use a version of RFTagger (Schmid and Laws, 2008)",
        "SMT-output predicted generated after post-gloss with stem-markup in bold print features forms processing",
        "that has been developed based on data tagged with TreeTagger (Schmid, 1994) using a model from Sharoff et al. (2008).",
        "The data processed by TreeTagger contained errors such as wrong definition of PoS for adverbs, wrong selection of gender for adjectives in plural and missing features for pronouns and adverbs.",
        "In order to train RFTagger, the output of TreeTagger was corrected with a set of empirical rules.",
        "In particular, the morphological features of nominal phrases were made consistent to train RFTagger: in contrast to TreeTagger, where morphological features are regarded as part of the PoS-tag, RFTagger allows for a separate handling of morphological features and POS tags.",
        "Despite a generally good tagging quality, some errors seem to be unavoidable due to the ambiguity of certain grammatical forms in Russian.",
        "A good example of this are neuter nouns that have the same form in all cases, or feminine nouns, which have identical forms in singular genitive and plural nominative (Sharoff et al., 2008).",
        "Since Russian has no binding word order, and the case of nouns cannot be determined on that basis, such errors cannot be corrected with empirical rules implemented as post",
        "on the WMT-2012 test set.",
        "The marked system (*) corresponds to the system submitted for manual evaluation.",
        "processing.",
        "Similar errors occur when specifying the case of adjectives, since the suffixes of adjectives are even less varied as compared to the nouns.",
        "In our application, we hope that this type of error does not affect the result due to the following suppression of a number of morphological attributes including the case of adjectives.",
        "Morphological reduction In comparison to Slavic languages, English is morphologically poor.",
        "For example, English has no morphological attributes for nouns and adjectives to express gender or case; verbs have no gender either.",
        "In contrast, Russian is morphologically very rich ?",
        "there are e.g. 6 cases and 3 grammatical genders, which manifest themselves in different suffixes for nouns, pronouns, adjectives and some verb forms.",
        "When translating from Russian into English, many of these attributes are (hopefully) redundant and are therefore deleted from the training data.",
        "The morphological reduction in our system was applied to nouns, pronouns, verbs, adjectives, prepositions and conjunctions.",
        "The rest of the POS (adverbs, particles, interjections and abbreviations) have no morphological attributes.",
        "The list of the original and the reduced attributes is given in Table 6.",
        "Transliteration mining to handle OOVs The machine translation system fails to translate out-of-vocabulary words (OOVs) as they are unknown to the training data.",
        "Most of the OOVs are named entities and transliterating them to the target language script could solve this problem.",
        "The transliteration system requires a list of transliteration pairs for training.",
        "As we do not have such a list, we use the unsupervised transliteration mining system of Sajjad et al. (2012) that takes a list of word pairs for",
        "be used for the training of the transliteration system.",
        "The procedure of mining transliteration pairs and transliterating OOVs is described as follows: We word-align the parallel corpus using GIZA++ and symmetrize the alignments using the grow-diagfinal-and heuristic.",
        "We extract all word pairs which occur as 1-to-1 alignments (Sajjad et al., 2011) and later refer to them as a list of word pairs.",
        "We train the unsupervised transliteration mining system on the list of word pairs and extract transliteration pairs.",
        "We use these mined pairs to build a transliteration system using the Moses toolkit.",
        "The transliteration system is applied as a post-processing step to transliterate OOVs.",
        "The morphological reduction of Russian (cf. section 5) does not process most of the OOVs as they are also unknown to the POS tagger.",
        "So OOVs that we get are in their original form.",
        "When translit",
        "erating them, the inflected forms generate wrong English transliterations as inflectional suffixes get transliterated too, specially OOV named entities.",
        "We solved this problem by stemming the OOVs based on a list of suffixes ( , , , , , ) and transliterating the stemmed forms.",
        "Experiments and results We trained the systems separately on GIZA++ and transliteration augmented-GIZA++ (TA-GIZA++) to compare their results; for more details see Sajjad et al. (2013).",
        "All systems are tuned using PROv1 (Nakov et al., 2012).",
        "The translation output is post-processed to transliterate OOVs.",
        "Table 7 summarizes the results of RU-EN translation systems trained on the original corpus and on the morph-reduced corpus.",
        "Using TA-GIZA++ alignment gives the best results for both WMT2012 and WMT-2013, leading to an improvement of 0.4 BLEU points.",
        "The system built on the morph-reduced data leads to decreased BLEU results.",
        "However, the percentage of OOVs is reduced for both test sets when using the morph-reduced data set compared to the original data.",
        "An analysis of the output showed that the morph-reduced system makes mistakes in choosing the right tense of the verb, which might be one reason for this outcome.",
        "In the future, we would like to investigate this issue in detail.",
        "6 German to English and English to German We submitted systems for DE-EN and EN-DE which used constituent parses for pre-reordering.",
        "For DE-EN we also deal with word formation issues such as compound splitting.",
        "We did not perform inflectional normalization or generation for German due to time constraints, instead focusing",
        "our efforts on these issues for French and Russian as previously described.",
        "German to English German has a wider diversity of clausal orderings than English, all of which need to be mapped to the English SVO order.",
        "This is a difficult problem to solve during inference, as shown for hierarchical SMT by Fabienne Braune and Fraser (2012) and for phrase-based SMT by Bisazza and Federico (2012).",
        "We syntactically parsed all of the source side sentences of the parallel German to English data available, and the tuning, test and blindtest sets.",
        "We then applied reordering rules to these parses.",
        "We use the rules for reordering German constituent parses of Collins et al. (2005) together with the additional rules described by Fraser (2009).",
        "These are applied as a preprocess to all German data.",
        "For parsing the German sentences, we used the generative phrase-structure parser BitPar with optimizations of the grammar, as described by Fraser et al. (2013).",
        "The parser was trained on the Tiger Treebank (Brants et al., 2002) along with utilizing the Europarl corpus as unlabeled data.",
        "At the training of Bitpar, we followed the targeted self-training approach (Katz-Brown et al., 2011) as follows.",
        "We parsed the whole Europarl corpus using a grammar trained on the Tiger corpus and extracted the 100- best parse trees for each sentence.",
        "We selected the parse tree among the 100 candidates which got the highest usefulness scores for the reordering task.",
        "Then we trained a new grammar on the concatenation of the Tiger corpus and the automatic parses from Europarl.",
        "The usefulness score estimates the value of a parse tree for the reordering task.",
        "We calculated this score as the similarity between the word order achieved by applying the parse tree-based reordering rules of Fraser (2009) and the word order indicated by the automatic word alignment between the German and English sentences in Europarl.",
        "We used the Kendall's Tau Distance as the similarity metric of two word orderings (as suggested by Birch and Osborne (2010)).",
        "Following this, we performed linguistically-informed compound splitting, using the system of Fritzinger and Fraser (2010), which disambiguates competing analyses from the high-recall Stuttgart Morphological Analyzer SMOR (Schmid et al., 2004) using corpus statistics.",
        "We also split German portmanteaus like zum?",
        "zu dem (meaning to the).",
        "English to German The task of mapping English SVO order to the different clausal orders in German is difficult.",
        "For our English to German systems, we solved this by parsing the English and applying the system of Gojun and Fraser (2012) to reorder English into the correct German clausal order (depending on the clause type which is detected using the English parse, see (Gojun and Fraser, 2012) for further details).",
        "We primarily used the Charniak-Johnson generative parser (Charniak and Johnson, 2005) to parse the English Europarl data and the test data.",
        "However, due to time constraints we additionally used Berkeley parses of about 400K Europarl sentences and the other English parallel training data.",
        "We also left a small amount of the English parallel training data unparsed, which means that it was not reordered.",
        "For tune, test and blindtest (WMT2013), we used the Charniak-Johnson generative parser.",
        "Experiments and results We used all available training data for constrained systems; results for the WMT-2013 set are given in table 8.",
        "For the contrastive BitPar results, we reparsed WMT-2013."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "We presented 5 systems dealing with complex morphology.",
        "For two language pairs with a morphologically rich source language (FR and RU), the input was reduced to a simplified representation containing only translation-relevant morphological information (e.g. number on nouns).",
        "We also used reordering techniques for DE-EN and EN-DE.",
        "For translating into a language with rich morphology (EN-FR), we applied a two-step method that first translates into a stemmed representation of the target language and then generates inflected forms based on morphological features predicted on monolingual data."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We would like to thank the anonymous reviewers for their helpful feedback and suggestions, Daniel Quernheim for providing Berkeley parses of some of the English data, Stefan Ru?d for help with the manual evalution, and Philipp Koehn and Barry Haddow for providing data and alignments."
      ]
    }
  ]
}
