{
  "info": {
    "authors": [
      "Arturo Curiel",
      "Christophe Collet"
    ],
    "book": "ACL",
    "id": "acl-P13-2059",
    "title": "Sign Language Lexical Recognition With Propositional Dynamic Logic",
    "url": "https://aclweb.org/anthology/P13-2059",
    "year": 2013
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper explores the use of Propositional Dynamic Logic (PDL) as a suitable formal framework for describing Sign Language (SL), the language of deaf people, in the context of natural language processing.",
        "SLs are visual, complete, standalone languages which are just as expressive as oral languages.",
        "Signs in SL usually correspond to sequences of highly specific body postures interleaved with movements, which make reference to real world objects, characters or situations.",
        "Here we propose a formal representation of SL signs, that will help us with the analysis of automatically-collected hand tracking data from French Sign Language (FSL) video corpora.",
        "We further show how such a representation could help us with the design of computer aided SL verification tools, which in turn would bring us closer to the development of an automatic recognition system for these languages."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Sign languages (SL), the vernaculars of deaf people, are complete, rich, standalone communication systems which have evolved in parallel with oral languages (Valli and Lucas, 2000).",
        "However, in contrast to the last ones, research in automatic SL processing has not yet managed to build a complete, formal definition oriented to their automatic recognition (Cuxac and Dalle, 2007).",
        "In SL, both hands and non-manual features (NMF), e.g. facial muscles, can convey information with their placements, configurations and movements.",
        "These particular conditions can difficult the construction of a formal description with common natural language processing (NLP) methods, since the existing modeling techniques are mostly designed to work with one-channel sound productions inherent to oral languages, rather than with the multichannel partially-synchronized information induced by SLs.",
        "Our research strives to address the formalization problem by introducing a logical language that lets us represent SL from the lowest level, so as to render the recognition task more approachable.",
        "For this, we use an instance of a formal logic, specifically Propositional Dynamic Logic (PDL), as a possible description language for SL signs.",
        "For the rest of this section, we will present a brief introduction to current research efforts in the area.",
        "Section 2 presents a general description of our formalism, while section 3 shows how our work can be used when confronted with real world data.",
        "Finally, section 4 present our final observations and future work.",
        "Images for the examples where taken from (DictaSign, 2012) corpus."
      ]
    },
    {
      "heading": "1.1 Current Sign Language Research",
      "text": [
        "Extensive efforts have been made to achieve efficient automatic capture and representation of the subtle nuances commonly present in sign language discourse (Ong and Ranganath, 2005).",
        "Research ranges from the development of hand and body trackers (Dreuw et al., 2009; Gianni and Dalle, 2009), to the design of high level SL representation models (Lejeune, 2004; Lenseigne and Dalle, 2006).",
        "Linguistic research in the area has focused on the characterization of corporal expressions into meaningful transcriptions (Dreuw et al., 2010; Stokoe, 2005) or common patterns across SL (Aronoff et al., 2005; Meir et al., 2006; Wittmann, 1991), so as to gain understanding of the un",
        "derlying mechanisms of SL communication.",
        "Works like (Losson and Vannobel, 1998) deal with the creation of a lexical description oriented to computer-based sign animation.",
        "Report (Filhol, 2009) describes a lexical specification to address the same problem.",
        "Both propose a thoroughly geometrical parametric encoding of signs, thus leaving behind meaningful information necessary for recognition and introducing data beyond the scope of recognition.",
        "This complicates the reutilization of their formal descriptions.",
        "Besides, they don't take in account the presence of partial information.",
        "Treating partiality is important for us, since it is often the case with automatic tools that incomplete or unrecognizable information arises.",
        "Finally, little to no work has been directed towards the unification of raw collected data from SL corpora with higher level descriptions (Dalle, 2006)."
      ]
    },
    {
      "heading": "2 Propositional Dynamic Logic for SL",
      "text": [
        "Propositional Dynamic Logic (PDL) is a multi-modal logic, first defined by (Fischer and Lad-ner, 1979).",
        "It provides a language for describing programs, their correctness and termination, by allowing them to be modal operators.",
        "We work with our own variant of this logic, the Propositional Dynamic Logic for Sign Language (PDLSL), which is just an instantiation of PDL where we take signers?",
        "movements as programs.",
        "Our sign formalization is based on the approach of (Liddell and Johnson, 1989) and (Filhol, 2008).",
        "They describe signs as sequences of immutable key postures and movement transitions.",
        "In general, each key posture will be characterized by the concurrent parametric state of each body articulator over a time-interval.",
        "For us, a body articulator is any relevant body part involved in signing.",
        "The parameters taken in account can vary from articulator to articulator, but most of the time they comprise their configurations, orientations and their placement within one or more places of articulation.",
        "Transitions will correspond to the movements executed between fixed postures."
      ]
    },
    {
      "heading": "2.1 Syntax",
      "text": [
        "We need to define some primitive sets that will limit the domain of our logical language.",
        "Definition 2.1 (Sign Language primitives).",
        "Let BSL = {D,W,R,L} be the set of relevant body articulators for SL, where D, W, R and L represent the dominant, weak, right and left hands, respectively.",
        "Both D and W can be aliases for the right or left hands, but they change depending on whether the signer is right-handed or left-handed, or even depending on the context.",
        "Let ?",
        "be the two-dimensional projection of a human body skeleton, seen by the front.",
        "We define the set of places of articulation for SL as ?SL = {HEAD, CHEST, NEUTRAL, .",
        ".",
        ".",
        "}, such that for each ?",
        "?",
        "?SL, ?",
        "is a sub-plane of ?, as shown graphically in figure 1.",
        "Let CSL be the set of possible morphological configurations for a hand.",
        "Let ?",
        "= {?,?,?,?, ?,?,?,?}",
        "be the set of relative directions from the signer's point of view, where each arrow represents one of eight possible two-dimensional direction vectors that share the same origin.",
        "For vector ?",
        "?",
        "?, we define vector ???",
        "as the same as ?",
        "but with the inverted abscissa axis, such that ???",
        "?",
        "?.",
        "Let vector ??",
        "indicate movement with respect to the dominant or weak hand in the following manner:",
        "Finally, let ?",
        "?v1 and ?",
        "?v2 be any two vectors with the same origin.",
        "We denote the rotation angle between the two as ?(?",
        "?v1 ,??v2).",
        "Now we define the set of atomic propositions that we will use to characterize fixed states, and a set of atomic actions to describe move",
        "Intuitively, ?1?",
        "?2 indicates that articulator ?1is placed in relative direction ?",
        "with respect to articulator ?2.",
        "Let the current place of articulation of ?2 be the origin point of ?2's Cartesian system (C?2).",
        "Let vector ??",
        "?1 describe the current place of articulation of ?1 in C?2.",
        "Proposition ?1?",
        "?2 holds when ??",
        "?v ?",
        "?,",
        "??1?",
        "asserts that articulator ?1 is located in ?.",
        "T ?1?2 is active whenever articulator ?1 physically touches articulator ?2.",
        "F?1c indicates that c is the morphological configuration of articulator ?1.",
        "Finally, ??",
        "?1 means that an articulator ?1 isoriented towards direction ?",
        "?",
        "?.",
        "For hands, ??",
        "?1 will hold whenever the vector perpendicular to the plane of the palm has the smallest rotation angle with respect to ?.",
        "Definition 2.3 (Atomic Actions for SL Body Articulators ?SL).",
        "The atomic actions for SL articulators ( ?SL) are given by the following set:",
        "where ?",
        "?",
        "?",
        "and ?1 ?",
        "BSL.",
        "Let ?1's position before movement be the origin of ?1's Cartesian system (C?1) and ??",
        "?1 be the position vector of ?1 in C?1 after moving.",
        "Action ?",
        "?1 indicates that ?1 moves in relative",
        "Action !",
        "?1 occurs when articulator ?1 moves rapidly and continuously (thrills) without changing it's current place of articulation.",
        "Definition 2.4 (Action Language for SL Body Articulators ASL).",
        "The action language for body articulators (ASL) is given by the following rule: ?",
        "::= pi |?",
        "?",
        "?",
        "|?",
        "?",
        "?",
        "|?;?",
        "|??",
        "where pi ?",
        "?SL.",
        "Intuitively, ?",
        "?",
        "?",
        "indicates the concurrent execution of two actions, while ?",
        "?",
        "?",
        "means that at least one of two actions will be non-deterministically executed.",
        "Action ?;?",
        "describes the sequential execution of two actions.",
        "Finally, action ??",
        "indicates the reflexive transitive closure of ?."
      ]
    },
    {
      "heading": "2.2 Semantics",
      "text": [
        "PDLSL formulas are interpreted over labeled transition systems (LTS), in the spirit of the possible worlds model introduced by (Hin-tikka, 1962).",
        "Models correspond to connected graphs representing key postures and transitions: states are determined by the values of their propositions, while edges represent sets of executed movements.",
        "Here we present only a small extract of the logic semantics.",
        "We also need to define a structure over sequences of states to model internal dependencies between them, nevertheless we decided to omit the rest of our semantics, alongside satisfaction conditions, for the sake of readability."
      ]
    },
    {
      "heading": "3 Use Case: Semi-Automatic Sign",
      "text": []
    },
    {
      "heading": "Recognition",
      "text": [
        "We now present an example of how we can use our formalism in a semi-automatic sign recognition system.",
        "Figure 2 shows a simple module diagram exemplifying information flow in the system's architecture.",
        "We proceed to briefly describe each of our modules and how they work together."
      ]
    },
    {
      "heading": "3.1 Tracking and Segmentation Module",
      "text": [
        "The process starts by capturing relevant information from video corpora.",
        "We use an existing head and hand tracker expressly developed for SL research (Gonzalez and Collet, 2011).",
        "This tool analyses individual video instances, and returns the frame-by-frame positions of the tracked articulators.",
        "By using this information, the module can immediately calculate speeds and directions on the fly for each hand.",
        "The module further employs the method proposed by the authors in (Gonzalez and Collet, 2012) to achieve sub-lexical segmentation from the previously calculated data.",
        "Like them, we use the relative velocity between hands to identify when hands either move at the same time, independently or don't move at all.",
        "With these, we can produce a set of possible key postures and transitions that will serve as input to the modeling module."
      ]
    },
    {
      "heading": "3.2 Model Extraction Module",
      "text": [
        "This module calculates a propositional state for each static posture, where atomic PDLSL formulas codify the information tracked in the previous part.",
        "Detected movements are interpreted as PDLSL actions between states.",
        "Here, each key posture is codified into propositions acknowledging the hand positions with respect to each other (R?L ), their place of articulation (e.g. ?left hand floats over the torse?",
        "with ?LTORSE), their configuration (e.g. ?right hand is open?",
        "with FROPENPALM_CONFIG) and their movements (e.g. ?left hand moves to the up-left direction?",
        "with ?L).",
        "This module also checks that the generated graph is correct: it will discard simple tracking errors to ensure that the resulting LTS will remain consistent."
      ]
    },
    {
      "heading": "3.3 Verification Module",
      "text": [
        "First of all, the verification module has to be loaded with a database of sign descriptions encoded as PDLSL formulas.",
        "These will characterize the specific sequence of key postures that morphologically describe a sign.",
        "For example, let's take the case for sign ?route?",
        "in FSL, shown in figure 4, with the following PDLSL formulation,",
        "with two key postures, connected by a two-hand simultaneous movement (represented with operator ?).",
        "It also indicates the position of each hand, their orientation, whether they touch and their respective configurations (in this example, both hold the same CLAMP configuration).",
        "The module can then verify whether a sign formula in the lexical database holds in any subsequence of states of the graph generated in the previous step.",
        "Algorithm 1 sums up the process.",
        "1: Proposals_For[state_qty] 2: for state s ?",
        "GSL do 3: for sign ?",
        "?",
        "DBSL where s ?",
        "?",
        "do 4: if MSL, s |= ?",
        "then 5: Proposals_For[s].append(?)",
        "6: end if 7: end for 8: end for 9: return Proposals_For",
        "For each state, the algorithm returns a set of possible signs.",
        "Expert users (or higher level algorithms) can further refine the process by introducing additional information previously missed by the tracker."
      ]
    },
    {
      "heading": "4 Conclusions and Future Work",
      "text": [
        "We have shown how a logical language can be used to model SL signs for semi-automatic recognition, albeit with some restrictions.",
        "The traits we have chosen to represent were imposed by the limits of the tracking tools we had to our disposition, most notably working with 2D coordinates.",
        "With these in mind, we tried to design something flexible that could be easily adapted by computer scientists and linguists alike.",
        "Our primitive sets, were intentionally defined in a very general fashion due to the same reason: all of the perceived directions, articulators and places of articulation can easily change their domains, depending on the SL we are modeling or the technological constraints we have to deal with.",
        "Propositions can also be changed, or even induced, by existing written sign representation languages such as Zebedee (Filhol, 2008) or HamNoSys (Hanke, 2004), mainly for the sake of extend-ability.",
        "From the application side, we still need to create an extensive sign database codified in PDLSL and try recognition on other corpora, with different tracking information.",
        "For verification and model extraction, further optimizations are expected, including the handling of data inconsistencies and repairing broken queries when verifying the graph.",
        "Regarding our theoretical issues, future work will be centered in improving our language to better comply with SL research.",
        "This includes adding new features, like incorporating probability representation to improve recognition.",
        "We also expect to finish the definition of our formal semantics, as well as proving correction and complexity of our algorithms."
      ]
    }
  ]
}
