{
  "info": {
    "authors": [
      "Phillippe Langlais"
    ],
    "book": "ACL",
    "id": "acl-P13-2120",
    "title": "Mapping Source to Target Strings without Alignment by Analogical Learning: A Case Study with Transliteration",
    "url": "https://aclweb.org/anthology/P13-2120",
    "year": 2013
  },
  "references": [
    "acl-C08-2013",
    "acl-D07-1092",
    "acl-E09-1056",
    "acl-E93-1007",
    "acl-J98-4003",
    "acl-N03-1017",
    "acl-N07-1047",
    "acl-P04-1021",
    "acl-P07-2045",
    "acl-P11-1041",
    "acl-P12-1049",
    "acl-P97-1055",
    "acl-P98-1120",
    "acl-W05-0616",
    "acl-W09-3501",
    "acl-W09-3506",
    "acl-W10-2406"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Analogical learning over strings is a holistic model that has been investigated by a few authors as a means to map forms of a source language to forms of a target language.",
        "In this study, we revisit this learning paradigm and apply it to the transliteration task.",
        "We show that alone, it performs worse than a statistical phrase-based machine translation engine, but the combination of both approaches outperforms each one taken separately, demonstrating the usefulness of the information captured by a so-called formal analogy."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "A proportional analogy is a relationship between four objects, noted [x : y :: z : t], which reads as ?x is to y as z is to t?.",
        "While some strategies have been proposed for handling semantic relationships (Turney and Littman, 2005; Duc et al., 2011), we focus in this study on formal proportional analogies (hereafter formal analogies or simply analogies), that is, proportional analogies involving relationships at the graphemic level, such as [atomkraftwerken : atomkriegen :: kraftwerks : kriegs] in German.",
        "Analogical learning over strings has been investigated by several authors.",
        "Yvon (1997) addressed the task of grapheme-to-phoneme conversion, a problem which continues to be studied actively, see for instance (Bhargava and Kondrak, 2011).",
        "Stroppa and Yvon (2005) applied analogical learning to computing morphosyntactic features to be associated with a form (lemma, part-of-speech, and additional features such as number, gender, case, tense, mood, etc.).",
        "The performance of the analogical engine on the Dutch language was as good as or better than the one reported in (van den Bosch and Daelemans, 1993).",
        "Lepage and Denoual (2005) pioneered the application of analogical learning to Machine Translation.",
        "Different variants of the system they proposed have been tested in a number of evaluation campaigns, see for instance (Lepage et al., 2009).",
        "Langlais and Patry (2007) investigated the more specific task of translating unknown words, a problem simultaneously studied in (Denoual, 2007).",
        "Analogical learning has been applied to various other purposes, among which query expansion in information retrieval (Moreau et al., 2007), classification of nominal and binary data, and handwritten character recognition (Miclet et al., 2008).",
        "Formal analogy has also been used for solving Raven IQ tests (Correa et al., 2012).",
        "In this study, we investigate the relevance of analogical learning for English proper name transliteration into Chinese.",
        "We compare it to the statistical phrase-based machine translation approach (Koehn et al., 2003) initially proposed for transliteration by Finch and Sumita (2010).",
        "We show that alone, analogical learning underper-forms the phrase-based approach, but that a combination of both outperforms individual systems.",
        "We describe in section 2 the principle of analogical learning.",
        "In section 3, we report on experiments we conducted in applying analogical learning on the NEWS 2009 English-to-Chinese transliteration task.",
        "Related works are discussed in section 4.",
        "We conclude in section 5 and identify avenues we believe deserve investigations."
      ]
    },
    {
      "heading": "2 Analogical Learning 2.1 Formal Analogy",
      "text": [
        "In this study, we use the most general definition of formal analogy we found, initially described in (Yvon et al., 2004).",
        "It handles a large variety of relations, including but not limited to affixation operations (i.e. [capital : anticapitalisme :: commun : anticommuniste] in French), stem mu-684 tations (i.e. [lang : la?nge :: stark : sta?rke] in German), and even templatic relations (i.e [KaaTiB : KuTaaB :: QaaRi?",
        ": QuRaa? ]",
        "in Arabic).",
        "Informally,1 this definition states that 4 forms x, y, z and t are in analogical relation iff we can find a d-factorization (a factorization into d factors) of each form, such that the ith factors (i ?",
        "[1, d]) of x and z equal (in ensemble terms) the ith factors of y and t. For instance, [this guy drinks : this boat sinks :: these guys drank : these boats sank ] holds because of the following 4-uple of 5-factorizations, whose factors are aligned column-wise for clarity, and where spaces (underlined) are treated as regular characters ( designates the empty factor): fx ?",
        "( this guy drinks ) fy ?",
        "( this boat s inks ) fz ?",
        "( these guy s drank ) ft ?",
        "( these boat s sank ) This analogy ?captures?",
        "among other things that in English, changing this for these implies a plural mark (s) to the corresponding noun.",
        "Note that analogies can relate arbitrarily distant sub-strings.",
        "For instance the 3rd-person singular mark of the verbs relates to the first substring this ."
      ]
    },
    {
      "heading": "2.2 Analogical Learning",
      "text": [
        "We now clarify the process of analogical learning.",
        "Let L = {(i(xk), o(xk))k} be a training set (or memory) gathering pairs of input i(xk) and output o(xk) representations of elements xk.",
        "In this study, the elements we consider are pairs of English / Chinese proper names in a transliteration relation.",
        "Given an element t for which we only know i(t), analogical learning works by:",
        "training set that stand in analogical proportion with t in the input space,",
        "2. building Eo(t) = {[o(x) : o(y) :: o(z) : ?]",
        "|(x, y, z) ?",
        "Ei(t)}, the set of solutions to the output analogical equations obtained, 3. selecting o(t) among the solutions aggregated into Eo(t).",
        "In this description, we define an analogical equation as an analogy with one form missing, and 1We refer the reader to (Stroppa and Yvon, 2005) for a more technical exposition.",
        "we note [x : y :: z : ? ]",
        "the set of its solutions (i.e.",
        "the English proper name Zemansky.",
        "31 solutions have been identified in total (4 by the first equation reported); the one underlined (actually the most frequently generated) is the sanctioned one.",
        "Figure 1 illustrates this process on a transliteration session for the English proper name Zemansky.",
        "The training corpus L is a set of pairs of English proper names and their Chinese Transliteration(s).",
        "Step 1 identifies analogies among English proper names: 7 such analogies are identified, 3 of which are reported (marked with a .",
        "sign).",
        "Step 2 projects the English forms in analogical proportion into their known transliteration (illustrated by a ?",
        "sign) in order to solve Chinese analogical equations.",
        "Step 3 aggregates the solutions produced during the second step.",
        "In the example, it consists in sorting the solutions in decreasing order of the number of time they have been generated during step 2 (see next section for a better strategy).",
        "There are several important points to consider when deploying the learning procedure shown above.",
        "First, the search stage (step 1) has a time complexity that can be prohibitive in some applications of interest.",
        "We refer the reader to (Langlais and Yvon, 2008) for a practical solution to this.",
        "Second, we need a way to solve an analogical 2Analogical equation solvers typically produce several solutions to an equation.685 equation.",
        "We applied the finite-state machine procedure described in (Yvon et al., 2004).",
        "Suffice it to say that typically, this solver produces several solutions to an equation, most of them spurious,3 reinforcing the need for an efficient aggregation step (step 3).",
        "Last, it might happen that the overall approach fails at producing a solution, because no input analogy is identified during step 1, or because the input analogies identified do not lead to analogies in the output space.",
        "This silence issue is analyzed in section 3.",
        "A detailed account of those problems and possible solutions are discussed in (Somers et al., 2009).",
        "We underline that analogies in both source and target languages are considered independently: the approach does not attempt to align source and target substrings, but relies instead on the inductive bias that input analogies (often) imply output ones."
      ]
    },
    {
      "heading": "3 Experiments",
      "text": []
    },
    {
      "heading": "3.1 Setting",
      "text": [
        "The task we study is part of the NEWS evaluation campaign conducted in 2009 (Li et al., 2009).",
        "The dataset consists of 31 961 English-Chinese transliteration examples for training the system (TRAIN), 2 896 ones for tuning it (DEV), and 2 896 for testing them (TEST).",
        "We compare two different approaches to transliteration: a statistical phrase-based machine translation engine ?",
        "which according to Li et al.",
        "(2009) was popular among participating systems to NEWS ?",
        "as well as differently flavored analogical systems.",
        "We trained (on TRAIN) a phrase-based translation device with the Moses toolkit (Koehn et al., 2007), very similarly to (Finch and Sumita, 2010), that is, considering each character as a word.",
        "The coefficients of the log-linear function optimized by Moses?",
        "decoder were tuned (with MERT) on DEV.",
        "For the analogical system, we investigated the use of classifiers trained in a supervised way to recognize the good solutions generated during step 2.",
        "For this, we first transliterated the DEV dataset using TRAIN as a memory.",
        "Then, we trained a classifier, taking advantage of the DEV corpus for the supervision.",
        "We tried two types of learners ?",
        "support vector machines (Cortes and Vapnik, 1995) and voted perceptrons (Freund 3A spurious solution is a string that does not belong to the language under consideration.",
        "See Figure 1 for examples.",
        "and Schapire, 1999)4 ?",
        "and found the former to slightly outperform the latter.",
        "Finally, we transliterated the TEST corpus using both the TRAIN and DEV corpora as a memory,5 and applied our classifiers on the solutions generated.",
        "The lack of space prevents us to describe the 61 features we used for characterizing a solution.",
        "We initially considered a set of features which characterizes a solution (frequency, rank in the candidate list, language model likelihood, etc.",
        "), and the process that generated the solution (i.e. number of analogies involved), but no feature that would use scored pairs of substrings (such as mutual information of substrings).6 Thus, we also considered in a second stage a set of features that we collected thanks to a n-best list of solutions computed by Moses (Moses?",
        "score given to a solution, its rank in the n-best list, etc.",
        ")."
      ]
    },
    {
      "heading": "3.2 Results",
      "text": [
        "We ran the NEWS 2009 official evaluation script7 in order to compute ACC (the accuracy of the first solution), F1 (the F-measure which gives partial credits proportional to the longest subsequence between the reference transliteration and the first candidate), and the Mean Reciprocal Rank (MRR), where 100/MRR roughly indicates the average rank of the correct solution over the session.",
        "Table 1 reports the results of several transliteration configurations we tested.",
        "The first two systems are pure analogical devices, (M) is the Moses configuration, (AM1) is a variant discussed further, (AM2) is the best configuration we tested (a combination of Moses and analogical learning), and the last two lines show the lowest and highest performing systems among the 18 standard runs registered at NEWS 2009 (Li et al., 2009).",
        "Several observations have to be made.",
        "First, none of the variants tested outperformed the best system reported at NEWS 2009.",
        "This is not surprising since we conducted only preliminary experiments with analogy.",
        "Still, we were pleased to observe that the best configuration we devised (AM2) would have ranked fourth on this task.",
        "The ana-freq system is an analogical device where the aggregation step consists in sorting solutions in decreasing order of frequency.",
        "It is clearly outperformed by the Moses system.",
        "The ana-svma system is an analogical device where the solutions are selected by the SVM trained on analogical features only.",
        "Learning to recognize good solutions from spurious ones improves accuracy (over A1).",
        "Still, we are far from the accuracy we would observe by using an oracle classifier (ACC = 81.5).",
        "Clearly, further experiments with better feature engineering must be conducted.",
        "It is noteworthy that the pure analogical devices we tested (A1 and A2) did not return any solution for 3.7% of the test forms, which explains some loss in performance compared to the SMT approach, which always delivers a solution.8 System ana-svma+m (AM1) is an analogical device where the classifier makes uses of the features extracted by Moses.",
        "Obviously, those features drastically improve accuracy of the classifier.",
        "Configuration (AM2) is a combination which cascades the hybrid device (AM1) with the SMT engine (M).",
        "This means that the former system is trusted whenever it produces a solution, and the latter one is used as a backup.",
        "This configuration outperforms Moses, which demonstrates the complementarity of the analogical information.",
        "with the metrics used at NEWS.",
        "The last column indicates the rank of systems as if we had submitted the top 5 configurations to NEWS 2009."
      ]
    },
    {
      "heading": "4 Related Work",
      "text": [
        "the 3.7% test forms that receive no solution from the analogical devices would result in an accuracy score of 65.0.",
        "Graehl, 1998; Li et al., 2004; Jiampojamarn et al., 2007), or it can be indirectly modeled as in (Oh et al., 2009) where transliteration is seen as a tagging task (that is, labeling each source grapheme with a target one), and where the model learns correspondences at the substring level.",
        "See also the semi-supervised approach of (Sajjad et al., 2012).",
        "Analogical inference differs drastically from those approaches, since it finds relations in the source material and solves target equations independently.",
        "Therefore, no alignment whatsoever is required.",
        "Transliteration by analogical learning has been attempted by Dandapat et al. (2010) for an English-to-Hindi transliteration task.",
        "They compared various heuristics to speed up analogical learning, and several combinations of phrase-based SMT and analogical learning.",
        "Our results confirm the observation they made that combining an analogical device with SMT leads to gains over individual systems.",
        "Still, their work differs from the present one in the fact that they considered the top frequency aggregator (similar to A1), which we showed to be suboptimal.",
        "Also, they used the definition of formal analogy of Lepage (1998), which is provably less general than the one we used.",
        "The impact of this choice for different language pairs remains to be investigated.",
        "Aggregating solutions produced by analogical inference with the help of a classifier has been reported in (Langlais et al., 2009).",
        "The authors investigated an arguably more specific task: translating medical terms.",
        "Another difference is that we classify solutions produced by analogical learning (roughly 100 solutions per test form), while they classified pairs of input/target analogies, whose number can be rather high, leading to huge and highly unbalanced learning tasks.",
        "The authors report training experiments with millions of examples and only a few positive ones.",
        "In fact, we initially attempted to recognize fruitful analogical pairs, but found it especially slow and disappointing."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "We considered the NEWS 2009 English-to-Chinese transliteration task for investigating analogical learning, a holistic approach that does not rely on an alignment or segmentation model.",
        "We have shown that alone, the approach fails to translate 3.7% of the test forms, underperforms the state-of-the-art SMT engine Moses, while still de-687 livering decent performance.",
        "By combining both approaches, we obtained a system which outperforms the individual ones we tested.",
        "We believe analogical inference over strings has not delivered all his potential yet.",
        "In particular, we have observed that there is a huge room for improvements in the aggregation step.",
        "We have tested a simple classifier approach, mining a tiny subset of the features that could be put at use.",
        "More research on this issue is warranted, notably looking at machine-learned ranking algorithms.",
        "Also, the silence issue we faced could be tackled by the notion of analogical dissimilarity introduced by Miclet et al. (2008).",
        "The idea of using near analogies in analogical learning has been successfully investigated by the authors on a number of standard classification testbeds."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work has been founded by the Natural"
      ]
    },
    {
      "heading": "Sciences and Engineering Research Council of",
      "text": [
        "Canada.",
        "We are grateful to Fabrizio Gotti for his contribution to this work, and to the anonymous reviewers for their useful comments.",
        "We are also indebted to Min Zhang and Haizhou Li who provided us with the NEWS 2009 English-Chinese datasets."
      ]
    }
  ]
}
