{
  "info": {
    "authors": [
      "Wanxiang Che",
      "Mengqiu Wang",
      "Christopher D. Manning",
      "Ting Liu"
    ],
    "book": "NAACL",
    "id": "acl-N13-1006",
    "title": "Named Entity Recognition with Bilingual Constraints",
    "url": "https://aclweb.org/anthology/N13-1006",
    "year": 2013
  },
  "references": [
    "acl-C04-1197",
    "acl-D09-1127",
    "acl-D10-1030",
    "acl-D10-1069",
    "acl-J92-4003",
    "acl-J94-2001",
    "acl-N01-1026",
    "acl-N04-1043",
    "acl-N06-2015",
    "acl-P05-1045",
    "acl-P08-1068",
    "acl-P09-1039",
    "acl-P10-1065",
    "acl-P11-1061",
    "acl-P11-1062",
    "acl-P12-1073",
    "acl-W10-2906"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Different languages contain complementary cues about entities, which can be used to improve Named Entity Recognition (NER) systems.",
        "We propose a method that formulates the problem of exploring such signals on unannotated bilingual text as a simple Integer Linear Program, which encourages entity tags to agree via bilingual constraints.",
        "Bilingual NER experiments on the large OntoNotes 4.0 Chinese-English corpus show that the proposed method can improve strong baselines for both Chinese and English.",
        "In particular, Chinese performance improves by over 5% absolute F1 score.",
        "We can then annotate a large amount of bilingual text (80k sentence pairs) using our method, and add it as up-training data to the original monolingual NER training corpus.",
        "The Chinese model retrained on this new combined dataset outperforms the strong baseline by over 3% F1 score."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Named Entity Recognition (NER) is an important task for many applications, such as information extraction and machine translation.",
        "State-of-the-art supervised NER methods require large amounts of annotated data, which are difficult and expensive to produce manually, especially for resource-poor languages.",
        "A promising approach for improving NER performance without annotating more data is to exploit unannotated bilingual text (bitext), which are relatively easy to obtain for many language pairs, borrowing from the resources made available by statistical machine translation research.1 Different languages contain complementary cues about entities.",
        "For example, in Figure 1, the word ??",
        "(Ben)?",
        "is common in Chinese but rarely appears as a translated foreign name.",
        "However, its aligned word on the English side (?Ben?)",
        "provides a strong clue that this is a person name.",
        "Judicious use of this type of bilingual cues can help to recognize errors a monolingual tagger would make, allowing us to produce more accurately tagged bitext.",
        "Each side of the tagged bitext can then be used to expand the original monolingual training dataset, which may lead to higher accuracy in the monolingual taggers.",
        "Previous work such as Li et al. (2012) and Kim et al. (2012) demonstrated that bilingual corpus annotated with NER labels can be used to improve monolingual tagger performance.",
        "But a major drawback of their approaches are the need for manual annotation efforts to create such corpora.",
        "To avoid this requirement, Burkett et al. (2010) suggested a ?multi-view?",
        "learning scheme based on re-ranking.",
        "Noisy output of a ?strong?",
        "tagger is used as training data to learn parameters of a log-linear re-ranking model with additional bilingual features, simulated by a ?weak?",
        "tagger.",
        "The learned parameters are then reused with the ?strong?",
        "tagger to re-rank its own outputs for unseen inputs.",
        "Designing good ?weak?",
        "taggers so that they complement the ?view?",
        "of bilingual features in the log-linear re-ranker is crucial to the success of this algorithm.",
        "Unfortunately there is no principled way of designing such ?weak?",
        "taggers.",
        "In this paper, we would like to explore a conceptually much simpler idea that can also take advantage",
        "of the large amount of unannotated bitext, without complicated machinery.",
        "More specifically, we introduce a joint inference method that formulates the bilingual NER tagging problem as an Integer Linear Program (ILP) and solves it during decoding.",
        "We propose a set of intuitive and effective bilingual constraints that encourage NER results to agree across the two languages.",
        "Experimental results on the OntoNotes 4.0 named entity annotated Chinese-English parallel corpus show that the proposed method can improve the strong Chinese NER baseline by over 5% F1 score and also give small improvements over the English baseline.",
        "Moreover, by adding the automatically tagged data to the original NER training corpus and retraining the monolingual model using an up-training regimen (Petrov et al., 2010), we can improve the monolingual Chinese NER performance by over 3% F1 score."
      ]
    },
    {
      "heading": "2 Constraint-based Monolingual NER",
      "text": [
        "NER is a sequence labeling task where we assign a named entity tag to each word in an input sentence.",
        "One commonly used tagging scheme is the BIO scheme.",
        "The tag BX (Begin) represents the first word of a named entity of type X, for example, PER (Person) or LOC (Location).",
        "The tag IX (Inside) indicates that a word is part of an entity but not first word.",
        "The tag O (Outside) is used for all nonentity words.2 See Figure 1 for an example tagged sentence.",
        "Conditional Random Fields (CRF) (Lafferty et al., 2001) is a state-of-the-art sequence labeling model widely used in NER.",
        "A first-order linear-chain CRF 2While the performance of NER is measured at the entity level (not the tag level).",
        "defines the following conditional probability:",
        "where x and y are the input and output sequences, respectively, Z(x) is the partition function, and Mi is the clique potential for edge clique i. Decoding in CRF involves finding the most likely output sequence that maximizes this objective, and is commonly done by the Viterbi algorithm.",
        "Roth and Yih (2005) proposed an ILP inference algorithm, which can capture more task-specific and global constraints than the vanilla Viterbi algorithm.",
        "Our work is inspired by Roth and Yih (2005).",
        "But instead of directly solving the shortest-path problem in the ILP formulation, we redefine the conditional probability as:",
        "where P (yi|x) is the marginal probability given by an underlying CRF model computed using forward-backward inference.",
        "Since the early HMM literature, it has been well known that using the marginal distributions at each position works well, as opposed to Viterbi MAP sequence labeling (Me?rialdo, 1994).",
        "Our experimental results also supports this claim, as we will show in Section 6.",
        "Our objective is to find an optimal NER tag sequence:",
        "Then an ILP can be used to solve the inference problem as classification problem with constraints.",
        "The objective function is:",
        "ity that the ith word is tagged with y, and zyi is an indicator that equals 1 iff the ith word is tagged y; otherwise, zyi is 0.",
        "If no constraints are identified, then Eq.",
        "(4) achieves maximum when all zyi are assigned to 1, which violates the condition that each word should only be assigned a single entity tag.",
        "We can express this with constraints:",
        "After adding the constraints, the probability of the sequence is maximized when each word is assigned the tag with highest probability.",
        "However, some invalid results may still exist.",
        "For example a tag O may be wrongly followed by a tag I-X, although a named entity cannot start with I-X.",
        "Therefore, we can add the following constraints:",
        "which specifies that when the ith word is tagged with IX (zI-Xi = 1), then the previous word can only be tagged with BX or IX (zB-Xi?1 + zI-Xi?1 ?",
        "1)."
      ]
    },
    {
      "heading": "3 NER with Bilingual Constraints",
      "text": [
        "This section demonstrates how to jointly perform NER for two languages with bilingual constraints.",
        "We assume sentences have been aligned into pairs, and the word alignment between each pair of sentences is also given."
      ]
    },
    {
      "heading": "3.1 Hard Bilingual Constraints",
      "text": [
        "We first introduce the simplest hard constraints, i.e., each word alignment pair should have the same named entity tag.",
        "For example, in Figure 1, the Chinese word ?????",
        "was aligned with the English words ?the?, ?Federal?",
        "and ?Reserve?.",
        "Therefore, they have the same named entity tags ORG.3 3The prefix Band I-are ignored.",
        "Similarly, ???",
        "and ?Ben?",
        "as well as ?????",
        "and ?Bernanke?",
        "were all tagged with the tag PER.",
        "The objective function for bilingual NER can be expressed as follows:",
        "where P yi and P y j are the probabilities of the i th Chinese word and jth English word to be tagged with y, respectively.",
        "xc and xe are respectively the Chinese and English sentences.",
        "Similar to monolingual constrained NER (Section 2), monolingual constraints are added for each language as shown in Eqs.",
        "(8) and (9):",
        "Bilingual constraints are added in Eq.",
        "(10): ?",
        "(i, j) ?",
        "A,?X : zB-Xi + zI-Xi = zB-Xj + zI-Xj (10) where A = {(i, j)} is the word alignment pair set, i.e., the ith Chinese word and the jth English word were aligned together.",
        "Chinese word i is tagged with a named entity type X (zB-Xi + zI-Xi = 1), iff English word j is tagged with X (zB-Xj +zI-Xj = 1).",
        "Therefore, these hard bilingual constraints guarantee that when two words are aligned, they are tagged with the same named entity tag.",
        "However, in practice, aligned word pairs do not always have the same tag because of the difference in annotation standards across different languages.",
        "For example, in Figure 2(a), the Chinese word ???",
        "??",
        "is a location.",
        "However, it is aligned to the words, ?development?",
        "and ?zone?, which are not named entities in English.",
        "Word alignment error is another serious problem that can cause violation of hard constraints.",
        "In Figure 2(b), the English word ?Agency?",
        "is wrongly aligned with the Chinese word ??",
        "(report)?.",
        "Thus, these two words cannot be assigned with the same tag.",
        "To address these two problems, we present a probabilistic model for bilingual NER which can lead to",
        "an optimization problem with two soft bilingual constraints: 1) allow word-aligned pairs to have different named entity tags; 2) consider word alignment probabilities to reduce the influence of wrong word alignments."
      ]
    },
    {
      "heading": "3.2 Soft Constraints with Tag Uncertainty",
      "text": [
        "The new probabilistic model for bilingual NER is:",
        "where yc and ye respectively denotes Chinese and English named entity output sequences.",
        "A is the set of word alignment pairs.",
        "If we assume that named entity tag assignments in Chinese is only dependent on the observed Chinese sentence, then we can drop the A and xe term in the first factor of Eq.",
        "(11), and arrive at the first factor of Eq.",
        "(12); similarly we can use the same assumption to derive the second factor in Eq.",
        "(12) for English; alternatively, if we assume the named entity tag assignments are only dependent on the cross-lingual word associations via word alignment, then we can drop xc and xe terms in the third factor of Eq.",
        "(11) and arrive at the third factor of Eq.",
        "(12).",
        "These factors represent the two major sources of information in the model: monolingual surface observation, and cross-lingual word associations.",
        "The first two factors of Eq.",
        "(12) can be further decomposed into the product of probabilities of all words in each language sentence like Eq.",
        "(2).",
        "Assuming that the tags are independent between different word alignment pairs, then the last factor of Eq.",
        "(12) can be decomposed into:",
        "where yca and yea respectively denotes Chinese and English named entity tags in a word alignment pair a.",
        "?ycye = P (ycye)P (yc)P (ye) is the pointwise mutual information (PMI) score between a Chinese named entity tag yc and an English named entity tag ye.",
        "If yc = ye, then the score will be high; otherwise the score will be low.",
        "A number of methods for calculating the scores are provided at the end of this section.",
        "We use ILP to maximize Eq.",
        "(12).",
        "The new objective function is expressed as follow:",
        "where zycyea is an indicator that equals 1 iff the Chinese and English named entity tags are yc and ye respectively, given a word alignment pair a; otherwise, zycyea is 0.",
        "Monolingual constraints such as Eqs.",
        "(8) and (9) need to be added.",
        "In addition, one and only one possible named entity tag pair exists for a word alignment pair.",
        "This condition can be expressed as the following constraints:",
        "When the tag pair of a word alignment pair is determined, the corresponding monolingual named en",
        "tity tags can also be identified.",
        "This rule can be expressed by the following constraints:",
        "equal to 1.",
        "Here, the ith Chinese word and the jth English word are aligned together.",
        "In contrast to hard bilingual constraints, inconsistent named entity tags for an aligned word pair are allowed in soft bilingual constraints, but are given lower ?ycye scores.",
        "To calculate the ?ycye score, an annotated bilingual NER corpus is consulted.",
        "We count from all word alignment pairs the number of times yc and ye occur together (C(ycye)) and separately (C(yc) and C(ye)).",
        "Afterwards, ?ycye is calculated with maximum likelihood estimation as follows:",
        "where N is the total number of word alignment pairs.",
        "However, in this paper, we assume that no named entity annotated bilingual corpus is available.",
        "Thus, the above method is only used as Oracle.",
        "A realistic method for calculating the ?ycye score requires the use of two initial monolingual NER models, such as baseline CRF, to predict named entity tags for each language on an unannotated bitext.",
        "We count from this automatically tagged corpus the statistics mentioned above.",
        "This method is henceforth referred to as Auto.",
        "A simpler approach is to manually set the value of ?ycye : if yc = ye then we assign a larger value to ?ycye ; else we assign an ad-hoc smaller value.",
        "In fact, if we set ?ycye = 1 iff yc = ye; otherwise, ?ycye = 0, then the soft constraints backs off to hard constraints.",
        "We refer to this set of soft constraints as Soft-tag."
      ]
    },
    {
      "heading": "3.3 Constraints with Alignment Uncertainty",
      "text": [
        "So far, we assumed that a word alignment set A is known.",
        "In practice, only the word alignment probability Pa for each word pair a is provided.",
        "We can set a threshold ?",
        "for Pa to tune the set A: a ?",
        "A iff Pa ?",
        "?.",
        "This condition can be regarded as a kind of hard word alignment.",
        "However, the following problem exists: the smaller the ?, the noisier the word alignments are; the larger the ?, the more possible word alignments are lost.",
        "To ameliorate this problem, we introduce another set of soft bilingual constraints.",
        "We can re-express Eq.",
        "(13) as follows:",
        "where A is the set of all word pairs between two languages.",
        "Ia = 1 iff Pa ?",
        "?",
        "; otherwise, Ia = 0.",
        "We can then replace the hard indicator Ia with the word alignment probability Pa, Eq.",
        "(14) is then transformed into the following equation:",
        "We name the set of constraints above Soft-align, which has the same constraints as Soft-tag, i.e., Eqs.",
        "(8), (9), (15) and (16)."
      ]
    },
    {
      "heading": "4 Experimental Setup",
      "text": [
        "We conduct experiments on the latest OntoNotes 4.0 corpus (LDC2011T03).",
        "OntoNotes is a large, manually annotated corpus that contains various text genres and annotations, such as part-of-speech tags, named entity labels, syntactic parse trees, predicate-argument structures and co-references (Hovy et al., 2006).",
        "Aside from English, this corpus also contains several Chinese and Arabic corpora.",
        "Some of these corpora contain bilingual parallel documents.",
        "We used the Chinese-English parallel corpus with named entity labels as our development and test data.",
        "This corpus includes about 400 document pairs (chtb 0001-0325, ectb 1001-1078).",
        "We used odd-numbered documents as development data and even-numbered documents as test data.",
        "We used all other portions of the named entity annotated corpus as training data for the monolingual systems.",
        "There were a total of?660 Chinese documents (?16k sentences) and ?1,400 English documents (?39k sentences).",
        "OntoNotes annotates 18 named entity types, such as person, location, date and money.",
        "In this paper, we selected the four most common named entity types, i.e., PER (Person), LOC (Location),",
        "ORG (Organization) and GPE (Geo-Political Entities), and discarded the others.",
        "Since the bilingual corpus is only aligned at the document level, we performed sentence alignment using the Champollion Tool Kit (CTK).4 After removing sentences with no aligned sentence, a total of 8,249 sentence pairs were retained.",
        "We used the BerkeleyAligner,5 to produce word alignments over the sentence-aligned datasets.",
        "BerkeleyAligner also gives posterior probabilities Pa for each aligned word pair.",
        "We used the CRF-based Stanford NER tagger (using Viterbi decoding) as our baseline monolingual NER tool.6 English features were taken from Finkel et al. (2005).",
        "Table 1 lists the basic features of Chinese NER, where ?",
        "means string concatenation and yi is the named entity tag of the ith word wi.",
        "Moreover, shape(wi) is the shape of wi, such as date and number.",
        "prefix/suffix(wi, k) denotes the k-characters prefix/suffix of wi.",
        "radical(wi, k) denotes the radical of the kth Chinese character of wi.7 len(wi) is the number of Chinese characters in wi.",
        "To make the baseline CRF taggers stronger, we added word clustering features to improve generalization over unseen data for both Chinese and English.",
        "Word clustering features have been suc",
        "NER (Miller et al., 2004) and dependency parsing (Koo et al., 2008).",
        "To our knowledge, this work is the first use of word clustering features for Chinese NER.",
        "A C++ implementation of the Brown",
        "word clustering algorithms (Brown et al., 1992) was used to obtain the word clusters (Liang, 2005).8 Raw text was obtained from the fifth edition of Chinese Gigaword (LDC2011T13).",
        "One million paragraphs from Xinhua news section were randomly selected, and the Stanford Word Segmenter with LDC standard was applied to segment Chinese text into words.9 About 46 million words were obtained which were clustered into 1,000 word classes."
      ]
    },
    {
      "heading": "5 Threshold Tuning",
      "text": [
        "During development, we tuned the word alignment probability thresholds to find the best value.",
        "Figure 3 shows the performance curves.",
        "When the word alignment probability threshold ?",
        "is set to 0.9, the hard bilingual constraints perform well for both Chinese and English.",
        "But as the thresholds value gets smaller, and more noisy word alignments are introduced, we see the hard bilingual constraints method starts to perform badly.",
        "In Soft-tag setting, where inconsistent tag assignments within aligned word pairs are allowed but penalized, different languages have different optimal threshold values.",
        "For example, Chinese has an optimal threshold of 0.7, whereas English has 0.2.",
        "Thus, the optimal thresholds for different languages need to be selected with care when Soft-tag is applied in practice.",
        "Soft-align eliminates the need for careful tuning of word alignment thresholds, and therefore can be more easily used in practice.",
        "Experimental results of Soft-align confirms our hypothesis ?",
        "the performance of both Chinese and English NER systems improves with decreasing threshold.",
        "However, we can still improve efficiency by setting a low threshold to prune away very unlikely word alignments.",
        "We set the threshold to 0.1 for Soft-align to increase speed, and we observed very minimal performance lost when doing so.",
        "We also found that automatically estimated bilingual tag PMI scores (Auto) gave comparable results",
        "to Oracle.",
        "Therefore this technique is effective for computing the PMI scores, avoiding the need of manually annotating named entity bilingual corpus."
      ]
    },
    {
      "heading": "6 Bilingual NER Results",
      "text": [
        "The main results on Chinese and English test sets with the optimal word alignment threshold for each method are shown in Table 2.",
        "The CRF-based Chinese NER with and without word clustering features are compared here.",
        "The word clustering features significantly (p < 0.01) improved the performance of Chinese NER, 10 giving us a strong Chinese NER baseline.11 The effectiveness of word clustering for English NER has been proved in previous work.",
        "The performance of ILP with only monolingual constraints is quite comparable with the CRF results, especially on English.",
        "The greater ILP performance on English is probably due to more accurate marginal probabilities estimated by the English CRF model.",
        "The ILP model with hard bilingual constraints gives a slight performance improvement on Chinese, but affects performance negatively on English.",
        "Once we introduced tagging uncertainties into the Soft-tag bilingual constraints, we see a very sig-10We use paired bootstrap resampling significance test (Efron and Tibshirani, 1993).",
        "11To the best of our knowledge, there was no performance report of state-of-the-art NER results on the latest OntoNotes dataset.",
        "nificant (p < 0.01) performance boost on Chinese.",
        "This method also improves the recall on English, with a smaller decrease in precision.",
        "Overall, it improves English F1 score by about 0.4%, which is unfortunately not statistically significant.",
        "Compared with Soft-tag, the final Soft-align method can further improve performance on both Chinese and English.",
        "This is likely to be because: 1) Soft-align includes more word alignment pairs, thereby improving recall; and 2) uses probabilities to cut wrong word alignments, thereby improving precision.",
        "In particular, compared with the strong CRF baseline, the gain on Chinese side is almost 5.5% in absolute F1 score.",
        "Decoding/inferenc efficiency of different methods are shown in the last column of Table 2.12 Compared with Viterbi decoding in CRF, monolingual ILP decoding is about 2.3 times slower.",
        "Bilingual ILP decoding, with either hard or soft constraints, is significantly slower than the monolingual methods.",
        "The reason is that the number of monolingual ILP constraints doubles, and there are additionally many more bilingual constraints.",
        "The difference in speed between the Soft-tag and Soft-align methods is attributed to the difference in number of word alignment pairs.",
        "Since each sentence pair can be decoded indepen-12CPU: Intel Xeon E5-2660 2.20GHz.",
        "And the speed calculation of ILP inference methods exclude the time needed to obtain marginal probabilities from the CRF models.",
        "dently, parallelization the decoding process can result in significant speedup."
      ]
    },
    {
      "heading": "7 Semi-supervised NER Results",
      "text": [
        "The above results show the usefulness of our method in a bilingual setting, where we are presented with sentence aligned data, and are tagging both languages at the same time.",
        "To have a greater impact on general monolingual NER systems, we employ a semi-supervised learning setting.",
        "First, we tag a large amount of unannotated bitext with our bilingual constraint-based NER tagger.",
        "Then we mix the automatically tagged results with the original monolingual Chinese training data to train a new model.",
        "Our bitext is derived from the Chinese-English part of the Foreign Broadcast Information Service corpus (FBIS, LDC2003E14).",
        "The best performing bilingual model Soft-align with threshold ?",
        "= 0.1 was used under the same experimental setting as described in Section 4",
        "supervised method improves with more additional data.",
        "We simply appended these data to the original training data.",
        "We also have done the experiments to down weight the additional training data by duplicating the original training data.",
        "There was some slight improvements, but not very significant.",
        "Finally, when we add 80k sentences, the F1 score is improved by 3.32%, which is significantly (p < 0.01) better than the baseline, and most of the contribution comes from recall improvement.",
        "Before the end of experimental section, let us summarize the usage of different kinds of data resources used in our experiments, as shown in Table 4, where and ?",
        "denote whether the corresponding resources are required.",
        "In the bilingual case, during training, only the monolingual named entity annotated data (NE-mono) is necessary to train a monolingual NER tagger.",
        "During the test, unannotated bitext (Bitext) is required by the word aligner and our bilingual NER tagger.",
        "Named entity annotated bitext (NE-bitext) is used to evaluate our bilingual model.",
        "In the semi-supervised case, besides the original NE-mono data, the Bitext is used as input to our bilingual NER tagger to product additional training data.",
        "To evaluate the final NER model, only NE-mono is needed."
      ]
    },
    {
      "heading": "8 Related Work",
      "text": [
        "Previous work explored the use of bilingual corpora to improve existing monolingual analyzers.",
        "Huang et al. (2009) proposed methods to improve parsing performance using bilingual parallel corpus.",
        "Li et al.",
        "(2012) jointly labeled bilingual named entities with a cyclic CRF model, where approximate inference was done using loopy belief propagation.",
        "These methods require manually annotated bilingual",
        "corpora, which are expensive to construct, and hard to obtain.",
        "Kim et al. (2012) proposed a method of labeling bilingual corpora with named entity labels automatically based on Wikipedia.",
        "However, this method is restricted to topics covered by Wikipedia.",
        "Similar to our work, Burkett et al. (2010) also assumed that annotated bilingual corpora are scarce.",
        "Beyond the difference discussed in Section 1, their re-ranking strategy may lose the correct named entity results if they are not included in the top-N outputs.",
        "Furthermore, we consider the word alignment probabilities in our method which can reduce the influence of word alignment errors.",
        "Finally, we test our method on a large standard publicly available corpus (8,249 sentences), while they used a much smaller (200 sentences) manually annotated bilingual NER corpus for results validation.",
        "In addition to bilingual corpora, bilingual dictionaries are also useful resources.",
        "Huang and Vogel (2002) and Chen et al. (2010) proposed approaches for extracting bilingual named entity pairs from unannotated bitext, in which verification is based on bilingual named entity dictionaries.",
        "However, large-scale bilingual named entity dictionaries are difficult to obtain for most language pairs.",
        "Yarowsky and Ngai (2001) proposed a projection method that transforms high-quality analysis results of one language, such as English, into other languages on the basis of word alignment.",
        "Das and Petrov (2011) applied the above idea to part-of-speech tagging with a more complex model.",
        "Fu et al. (2011) projected English named entities onto Chinese by carefully designed heuristic rules.",
        "Although this type of method does not require manually annotated bilingual corpora or dictionaries, errors in source language results, wrong word alignments and inconsistencies between the languages limit application of this method.",
        "Constraint-based monolingual methods by using ILP have been successfully applied to many natural language processing tasks, such as Semantic Role Labeling (Punyakanok et al., 2004), Dependency Parsing (Martins et al., 2009) and Textual Entailment (Berant et al., 2011).",
        "Zhuang and Zong (2010) proposed a joint inference method for bilingual semantic role labeling with ILP.",
        "However, their approach requires training an alignment model with a manually annotated corpus."
      ]
    },
    {
      "heading": "9 Conclusions",
      "text": [
        "We proposed a novel ILP based inference algorithm with bilingual constraints for NER.",
        "This method can jointly infer bilingual named entities without using any annotated bilingual corpus.",
        "We investigate various bilingual constraints: hard and soft constraints.",
        "Out empirical study on large-scale OntoNotes Chinese-English parallel NER data showed that Soft-align method, which allows inconsistent named entity tags between two aligned words and considers word alignment probabilities, can significantly improve over the performance of a strong Chinese NER baseline.",
        "Our work is the first to evaluate performance on a large-scale standard dataset.",
        "Finally, we can also improve monolingual Chinese NER performance significantly, by combining the original monolingual training data with new data obtained from bitext tagged by our method.",
        "The final ILP-based bilingual NER tagger with soft constraints is publicly available at: github.com/carfly/bi_ilp Future work could apply the bilingual constraint-based method to other tasks, such as part-of-speech tagging and relation extraction."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The authors would like to thank Rob Voigt and the three anonymous reviewers for their valuable comments and suggestions.",
        "We gratefully acknowledge the support of the National Natural Science Foundation of China (NSFC) via grant 61133012, the National ?863?",
        "Project via grant 2011AA01A207 and 2012AA011102, the Ministry of Education Research of Social Sciences Youth funded projects via grant 12YJCZH304, the Defense Advanced Research Projects Agency (DARPA) Machine Reading Program under Air Force Research Laboratory (AFRL) prime contract no.",
        "FA8750-09-C-0181 and the support of the DARPA Broad Operational Language Translation (BOLT) program through IBM.",
        "Any opinions, findings, and conclusion or recommendations expressed in this material are those of the authors and do not necessarily reflect the view of the DARPA, AFRL, or the US government."
      ]
    }
  ]
}
