{
  "info": {
    "authors": [
      "Jey Han Lau",
      "Paul Cook",
      "Timothy Baldwin"
    ],
    "book": "*SEM",
    "id": "acl-S13-2051",
    "title": "unimelb: Topic Modelling-based Word Sense Induction",
    "url": "https://aclweb.org/anthology/S13-2051",
    "year": 2013
  },
  "references": [
    "acl-E12-1060",
    "acl-S12-1027",
    "acl-S13-2051"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes our system for shared task 13 ?Word Sense Induction for Graded and Non-Graded Senses?",
        "of SemEval-2013.",
        "The task is on word sense induction (WSI), and builds on earlier SemEval WSI tasks in exploring the possibility of multiple senses being compatible to varying degrees with a single contextual instance: participants are asked to grade senses rather than selecting a single sense like most word sense disambiguation (WSD) settings.",
        "The evaluation measures are designed to assess how well a system perceives the different senses in a contextual instance.",
        "We adopt a previously-proposed WSI methodology for the task, which is based on a Hierarchical Dirichlet Process (HDP), a non-parametric topic model.",
        "Our system requires no parameter tuning, uses the English ukWaC as an external resource, and achieves encouraging results over the shared task."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In our previous work (Lau et al., 2012) we developed a word-sense induction (WSI) system based on topic modelling, specifically a Hierarchical Dirichlet Process (Teh et al., 2006).",
        "In evaluations over the SemEval-2007 and SemEval-2010 WSI tasks we achieved performance on par with the current state-of-the art.",
        "The SemEval-2007 and SemEval-2010 WSI tasks assumed that each usage of a word has a single gold-standard sense.",
        "In this paper we apply this WSI method ?off-the-shelf?, with no adaptation, to the novel SemEval-2013 task of ?Word Sense Induction for Graded and Non-Graded Senses?.",
        "Given that the topic model allocates a multinomial distribution over topics to each word usage (?document?, in topic modelling terms), the SemEval-2013 WSI task is an ideal means for evaluating this aspect of the topic model."
      ]
    },
    {
      "heading": "2 System Description",
      "text": [
        "Our system is based on the WSI methodology proposed by Lau et al. (2012), and also applied to SemEval-2013 Task 11 on WSI for web snippet clustering (Lau et al., to appear).",
        "The core machinery of our system is driven by a Latent Dirichlet Allocation (LDA) topic model (Blei et al., 2003).",
        "In LDA, the model learns latent topics for a collection of documents, and associates these latent topics with every document in the collection.",
        "A topic is represented by a multinomial distribution of words, and the association of topics with documents is represented by a multinomial distribution of topics, a distribution for each document.",
        "The generative process of LDA for drawing word w in document d is as follows:",
        "1. draw latent topic z from document d; 2. draw word w from the chosen latent topic z.",
        "The probability of selecting word w given a document d is thus given by:",
        "where t is the topic variable, and T is the number of topics.",
        "The number of topics, T , is a parameter in LDA.",
        "We relax this assumption by extending the model to be non-parametric, using a Hierarchical Dirichlet Process (HDP: (Teh et al., 2006)).",
        "HDP learns the number of topics based on data, with the concentration parameters ?",
        "and ?0 controlling the variability of topics in the documents (for details of HDP please refer to the original paper).",
        "To apply HDP to WSI, the latent topics are interpreted as the word senses, and the documents are usages that contain the target word of interest.",
        "That is, given a target word (e.g. paper), a ?document?",
        "in our application is a sentence context surrounding the target word.",
        "In addition to the bag of words surrounding the target word, we also include positional context word information, which was used in our earlier work (Lau et al., 2012).",
        "That is, we introduce an additional word feature for each of the three words to the left and right of the target word.",
        "An example of the topic model features is given in"
      ]
    },
    {
      "heading": "2.1 Background Corpus and Preprocessing",
      "text": [
        "The test dataset provides us with contextual instances for each target word, and these instances constitute the documents for the topic model.",
        "The text of the test data is tokenised and lemmatised using OpenNLP and Morpha (Minnen et al., 2001).",
        "Note, however, that there are only 100 instances for most target words in the test dataset, and as such the dataset may be too small for the topic model to induce meaningful senses.",
        "To this end, we turn to the English ukWaC ?",
        "a web corpus of approximately 1.9 billion tokens ?",
        "to expand the data, by extracting context sentences that contain the target word.",
        "Each extracted usage is a three-sentence context containing the target word: the original sentence that contains the actual usage and its preceding and succeeding sentences.",
        "The extraction of usages from the ukWaC significantly increases the amount of information for the topic model to learn the senses for the target words from.",
        "However, HDP is computationally intensive, so we limit the number of extracted usages from the ukWaC using two sampling approaches:",
        "randomly-sampled usages to 50,000 instances.",
        "The usages from the ukWaC are tokenised and lemmatised using TreeTagger (Schmid, 1994), as provided by the corpus.",
        "To summarise, for each target word we apply the HDP model to the combined collection of the test instances (provided by the shared task) and the extracted usages from the English ukWaC (noting that each instance/usage corresponds to a topic model ?document?).",
        "The topic model learns the senses/topics for all documents in the collection, but we only use the sense/topic distribution for the test instances as they are the ones evaluated in the shared task."
      ]
    },
    {
      "heading": "3 Experiments and Results",
      "text": [
        "Following Lau et al. (2012), we use the default parameters (?",
        "= 0.1 and ?0 = 1.0) for HDP.1 For each target word, we apply HDP to induce the senses, and a distribution of senses is produced for each ?document?",
        "in the model.",
        "To grade the senses for the instances in the test dataset, we apply the sense probabilities learnt by the topic model as the sense weights without any modification.",
        "To illustrate the senses induced by our model, we present the top-10 words of the induced senses for the verb strike in Table 2.",
        "Although 13 senses in total are induced and some of them do not seem very coherent, only the first 8 senses ?",
        "the more coherent ones ?",
        "are observed (i.e., have non-zero probability for any usage) in the test dataset.",
        "Two forms of evaluation are used in the task: WSD evaluation and clustering comparison.",
        "For WSD evaluation, three measures are used: (1) Jaccard Index (JI), which measures the degree of overlap between the induced senses and the gold senses; (2) positionally-weighted Kendall's tau (KT: (Kumar and Vassilvitskii, 2010)), which measures the correlation between the ranking of the induced senses and that of the gold senses; and (3) normalised discounted cumulative gain (NDCG), which 1These settings were considered ?vague?",
        "priors in Teh et al.",
        "(2006).",
        "They were tested in Lau et al. (2012) and the model was shown to be robust under different parameter settings.",
        "As such we decided to keep the settings.",
        "The implementation of our WSI system can be accessed via GitHub: https://github.com/jhlau/hdp-wsi.",
        "Target word dogs Context sentence Most breeds of dogs are at most a few hundred years old Bag-of-word features most, breeds, of, are, at, most, a, few, hundred, years, old Positional word features most #-3, breeds #-2, of #-1, are #1, at #2, most #3",
        "measures the correlation between the weights of the induced senses and that of the gold senses.",
        "For clustering comparison, fuzzy normalised mutual information (FNMI) and fuzzy b-cubed (FBC) are used.",
        "Note that the WSD systems participating in this shared task are not evaluated with clustering comparison metrics, as they do not induce senses/clusters in the same manner as WSI systems.",
        "WSI systems produce senses that are different to the gold standard sense inventory (WordNet 3.1), and the induced senses are mapped to the gold standard senses using the 80/20 validation setting.",
        "Details of this mapping procedure are described in Jurgens (2012).",
        "Results for all test instances are presented in Table 3.",
        "Note that many baselines are used, only some of which we present in this paper, namely: (1) RANDOM ?",
        "label instances with one of three random induced senses; (2) SEMCOR MFS ?",
        "label instances with the most frequently occurring sense in Semcor; (3) TEST MFS ?",
        "label instances with the most frequently occurring sense in the test dataset.",
        "To benchmark our method, we present one or two of the best systems from each team.",
        "Looking at Table 3, our system performs encouragingly well.",
        "Although not the best system, we achieve results close to the best system for each evaluation measure.",
        "Most of the instances in the data were annotated with only one sense; only 11% were annotated with two senses, and 0.5% with three.",
        "As a result, the task organisers categorised the instances into single-sense instances and multi-sense instances to better analyse the performance of participating systems.",
        "Results for single-sense and multi-sense instances are presented in Table 4 and Table 5, respectively.",
        "Note that for single-sense instances, only precision is used for WSD evaluation as the Jaccard Index, positionally-weighted Kendall's tau and normalised discounted cumulative gain are not applicable.",
        "Our system performs relatively well, and trails marginally behind the best system in most cases."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "We adopt a WSI methodology from Lau et al. (2012) for the task of grading senses in a WSD setting.",
        "With no parameter tuning and using only the English ukWaC as an external resource, our system performs relatively well at the task."
      ]
    }
  ]
}
