{
  "info": {
    "authors": [
      "Yvette Graham",
      "Bahar Salehi",
      "Timothy Baldwin"
    ],
    "book": "*SEM",
    "id": "acl-S13-2024",
    "title": "Umelb: Cross-lingual Textual Entailment with Word Alignment and String Similarity Features",
    "url": "https://aclweb.org/anthology/S13-2024",
    "year": 2013
  },
  "references": [
    "acl-C10-3010",
    "acl-D11-1062",
    "acl-N10-1045",
    "acl-P07-2045",
    "acl-P11-1134",
    "acl-S12-1053",
    "acl-S12-1105",
    "acl-S13-1039",
    "acl-W99-0604"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes The University of Melbourne NLP group submission to the Cross-lingual Textual Entailment shared task, our first tentative attempt at the task.",
        "The approach involves using parallel corpora and automatic word alignment to align text fragment pairs, and statistics based on unaligned words as features to classify items as forward and backward before a compositional combination into the final four classes, as well as experiments with additional string similarity features."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Cross-lingual Textual Entailment (CLTE) (Negri et al., 2012) proposes the task of automatically identifying the kind of relation that exists between pairs of semantically-related text fragments written in two distinct languages, a variant of the traditional Recognizing Textual Entailment (RTE) task (Bentivogli et al., 2009; Bentivogli et al., 2010).",
        "The task targets the cross-lingual content synchronization scenario proposed in Mehdad et al. (2010, 2011).",
        "Compositional classification can be used by training two distinct binary classifiers for forward and backward entailment classification, before combining labels into the four final entailment categories that now include bidirectional and no entailment labels.",
        "The most similar previous work to this work is the cross-lingual approach of the FBK system (Mehdad et al., 2012) from Semeval 2012 (Negri et al., 2012), in which the entailment classification is obtained without translating T1 into T2 for the Spanish?",
        "English language pair.",
        "We apply the cross-lingual approach to German?English and instead of cross-lingual matching features, we use Giza++ (Och et al., 1999) and Moses (Koehn et al., 2007) to automatically word align text fragment pairs to compute statistics of unaligned words.",
        "In addition, we include some additional experiments using string similarity features."
      ]
    },
    {
      "heading": "2 Compositional Classification",
      "text": [
        "Given a pair of topically related fragments, T1 (German) and T2 (English), we automatically annotate it with one of the following entailment labels: bidirectional, forward, backward, no entailment.",
        "We take the compositional approach and separately train a forward, as well as a backward binary classifier.",
        "Each classifier is run separately on the set of text fragment pairs to produce two binary labels for forward and backward entailment.",
        "The two sets of labels are logically combined to produce a final classification for each test pair of forward, backward, bidirectional or no entailment."
      ]
    },
    {
      "heading": "3 Word Alignment Features",
      "text": [
        "The test set of topically-related text fragments, T1 (German) and T2 (English) were added to Europarl German?English parallel text (Koehn, 2005) and Giza++ was used for automatic word alignment in both language directions.",
        "Moses (Koehn et al., 2007) was then used for symmetrization with the grow diag final and algorithm.",
        "This produces a many-to-many alignment between the words of the",
        "German, T1, and English, T2, with words also remaining unaligned.",
        "The following features are computed for each test pair feature scores for the forward classifier: ?",
        "A1: count of unaligned words in T2 ?",
        "A2: count of words comprised soley of digits in T2 not in T1 ?",
        "A3: count of unaligned words in T2 with low probability of appearing unaligned in Europarl (with threshold p=0.11) The number of words in T2 (English) that are not aligned with anything in T1 (German) should provide an indication that, for example, the English text fragment contains information not present in the corresponding German text fragment and subsequently evidence against the presence of forward entailment.",
        "We there include the feature, A1, that is simply a count of unaligned words in English T2.",
        "In addition, we hypothesize that the absence of a number from T2 may be a more significant missing element of T2 from T1.",
        "We therefore include as a feature the count of tokens comprised of digits in T2 that are not also present in T1.",
        "The final word alignment feature attempts to refine A1, by distinguishing words that are rarely unaligned in German?English translations.",
        "Statistics are computed for every lexical item from German?English Europarl translations to produce a lexical unalignment probability, computed for each lexical item based on its relative frequency in the corpus when it is not aligned to any other word.",
        "The backward classifier uses the same features but computed for each test pair on counts of unaligned T1 words."
      ]
    },
    {
      "heading": "4 Results",
      "text": [
        "Results for several combinations of features are shown in Table 1 when the system is trained on the 500-pair development set training corpus and tested on the 500-pair held-out development test set (DEV), in addition to results for feature combinations when trained on the entire 1000-pair development data and tested on the held-out 500-pair gold standard (TEST) (Negri et al., 2011), when the system is evaluated as two separate binary forward and backward classifiers (2-CLASS) as well as the final evaluation including all four entailment classes (4- CLASS).",
        "The highest accuracy is achieved by the classifier using the single feature of counts of unaligned words, A1, of 34.6%.",
        "As two separate binary classifiers, the alignment features, A1+A2+A3, achieve a relatively high accuracy of 74.0% for forward with somewhat less accurate for backward (65.8%) classification (both over the DEV data).",
        "When combined to the final four CLTE classes, however, accuracy drops significantly to an overall accuracy of 50% (also over DEV).",
        "A main cause is inaccurate labeling of no entailment gold standard test pairs, as the most severe decline is for recall of test pairs for this label (38.4%).",
        "Accuracy on the development set for the word alignment features, A1+A2+A3, compared to the test set shows a sever decline, from 50% to 32%.",
        "On the test data, however, a main cause of inaccuracy is that backward gold standard test pairs, although achieving close accuracy to forward when evaluated as binary classifiers, are inaccurately labeled in the 4-class evaluation, as recall for backward drops to only 18.4% for this label.",
        "Another insight revealed for the alignment features, A1+A2+A3, in the 4-class evaluation is that when run on the development set, the classes forward and backward achieve significantly higher f-scores compared to no entailment.",
        "However, the contrary is observed for the test data, as no entailment achieve higher results than both unidirectional classes.",
        "This appears at first to be a somewhat counter-intuitive result, but in this case, the system is simply better at predicting forward and backward when no entailment exists for a translation pair compared to when a unidirectional entailment is present."
      ]
    },
    {
      "heading": "4.1 String Similarity Features",
      "text": [
        "In addition to the word alignment features, subsequent to submitting results to the shared task, we have carried out additional experiments using string similarity features, based on our recent success in apply string similarity to both the estimation of com-positionality of MWEs (Salehi and Cook, to appear) and also the estimation of similarity between short",
        "= count of unaligned words in T2, A2 = count of unaligned numbers in T2, A3 = count of unaligned words in T2 with unaligned probability < 0.11, S1 = Number of matched words in the aligned sequence given by Smith-Waterman algorithm, S2 = Penalty of aligning sentences using Smith-Waterman algorithm, S3 = Levenshtein distance between the sentences",
        "texts in the *SEM 2013 Shared Task (Gella et al., to appear).",
        "Using the alignments, we replace each English word with its corresponding word in German.",
        "The resulting German sentence is compared with the actual one using string similarity measures.",
        "As the structure of both English and German sentences are usually SVO, we hypothesize that when there is no entailment between the two given sentences, the newly-made German sentence and the original German sentence will differ a lot in word order.",
        "In order to compare the two German sentences, we use the Levenshtein (Levenshtein, 1966) and the Smith-Waterman (Smith and Waterman, 1981) algorithm.",
        "The Levenshtein algorithm measures the number of world-level edits to change one sentence into another.",
        "The edit operators consist of insertion and deletion.",
        "We consider substitution as two edits (combination of insertion and deletion) based on the findings of Baldwin (2009).",
        "We also use Smith-Waterman (SW) algorithm, which was originally developed to find the most similar region between two proteins.",
        "The algorithm looks for the longest common substring, except that it permits small numbers of penalized editions consisting of insertion, deletion and substitution.",
        "We call the best found substring the ?SW aligned sequence?.",
        "In this experiment, we consider the number of matched words and the number of penalties in the SW aligned sequence as features.",
        "Results for the string similarity features are shown in Table 1.",
        "Since the string similarity feature scores do not take the entailment direction into account, i.e. there is a single set of feature scores for each text fragment pair as there is no distinction between forward and backward entailment, and they are not suited for standalone use in compositional classification.",
        "We do, however, include these scores in Table 1 to illustrate how with the compositional approach using the same set of features for forward and backward ultimately results in a classification of test pairs as either bidirectional or no entailment.",
        "When individual string similarity features are added to the word alignment features, minor gains in accuracy are achieved over the word alignment features alone, +1% for S1, +0.6% for S2 and +0.8% for S3 (= Levenstein)."
      ]
    },
    {
      "heading": "5 Possible Additions: Dictionary Features",
      "text": [
        "We hypothesize that when there is no entailment between the two sentences, the aligner may not accurately align words.",
        "An on-line dictionary containing lemmatized words, such as Panlex (Baldwin and Colowick, 2010), could be used to avoid errors in such cases.",
        "Dictionary-based feature scores based on the presence or absence of alignments in the dictionary could then be applied."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "This paper describes a compositional cross-lingual approach to CLTE with experiments carried out for the German-English language pair.",
        "Our results showed that in the first stages of binary classification as forward and backward, the word alignment features alone achieved good accuracy but when combined suffer severely.",
        "Accuracy of the approach using word alignment features could benefit from a more directional multi-class classification as opposed to the compositional approach we used.",
        "In addition, results showed minor increases in accuracy can be achieved using string similarity measures."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work was supported by the Australian Research Council."
      ]
    }
  ]
}
