{
  "info": {
    "authors": [
      "Stephan Peitz",
      "Saab Mansour",
      "Matthias Huck",
      "Markus Freitag",
      "Hermann Ney",
      "Eunah Cho",
      "Teresa Herrmann",
      "Mohammed Mediani",
      "Jan Niehues",
      "Alex Waibel",
      "Alexander Allauzen",
      "Quoc Khanh Do",
      "Bianka Buschbeck",
      "Tonio Wandmacher"
    ],
    "book": "Workshop on Statistical Machine Translation",
    "id": "acl-W13-2223",
    "title": "Joint WMT 2013 Submission of the QUAERO Project",
    "url": "https://aclweb.org/anthology/W13-2223",
    "year": 2013
  },
  "references": [
    "acl-D08-1089",
    "acl-D09-1022",
    "acl-E03-1076",
    "acl-J03-1002",
    "acl-J04-2004",
    "acl-J06-4004",
    "acl-N04-4026",
    "acl-N12-1005",
    "acl-P03-1021",
    "acl-P07-2045",
    "acl-W05-0836",
    "acl-W07-0732",
    "acl-W07-0734",
    "acl-W08-0303",
    "acl-W08-0310",
    "acl-W08-1006",
    "acl-W09-0413",
    "acl-W09-0435",
    "acl-W10-1704",
    "acl-W11-2124",
    "acl-W11-2135",
    "acl-W12-3140",
    "acl-W13-0805"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes the joint submission of the QUAERO project for the German?English translation task of the ACL 2013 Eighth Workshop on Statistical Machine Translation (WMT 2013).",
        "The submission was a system combination of the output of four different translation systems provided by RWTH Aachen University, Karlsruhe Institute of Technology (KIT), LIMSI-CNRS and SYSTRAN Software, Inc.",
        "The translations were joined using the RWTH's system combination approach.",
        "Experimental results show improvements of up to 1.2 points in BLEU and 1.2 points in TER compared to the best single translation."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "QUAERO is a European research and development program with the goal of developing multimedia and multilingual indexing and management tools for professional and general public applications (http://www.quaero.org).",
        "Research in machine translation is mainly assigned to the four groups participating in this joint submission.",
        "The aim of this submission was to show the quality of a joint translation by combining the knowledge of the four project partners.",
        "Each group develop and maintain their own different machine translation system.",
        "These single systems differ not only in their general approach, but also in the preprocessing of training and test data.",
        "To take advantage of these differences of each translation system, we combined all hypotheses of the different systems, using the RWTH system combination approach.",
        "This paper is structured as follows.",
        "First, the different engines of all four groups are introduced.",
        "In Section 3, the RWTH Aachen system combination approach is presented.",
        "Experiments with different system selections for system combination are described in Section 4.",
        "This paper is concluded in Section 5."
      ]
    },
    {
      "heading": "2 Translation Systems",
      "text": [
        "For WMT 2013, each QUAERO partner trained their systems on the parallel Europarl (EPPS), News Commentary (NC) corpora and the web-crawled corpus.",
        "All single systems were tuned on the newstest2009 and newstest2010 development set.",
        "The newstest2011 development set was used to tune the system combination parameters.",
        "Finally, on newstest2012 the results of the different system combination settings are compared.",
        "In this Section, all four different translation engines are presented."
      ]
    },
    {
      "heading": "2.1 RWTH Aachen Single System",
      "text": [
        "For the WMT 2013 evaluation, RWTH utilized a phrase-based decoder based on (Wuebker et al., 2012) which is part of RWTH's open-source SMT toolkit Jane 2.1 1.",
        "GIZA++ (Och and Ney, 2003) was employed to train a word alignment, language models have been created with the SRILM toolkit (Stolcke, 2002).",
        "After phrase pair extraction from the word-aligned parallel corpus, the translation probabilities are estimated by relative frequencies.",
        "The standard feature set alo includes an n-gram language model, phrase-level IBM-1 and word-, phrase-and distortion-penalties, which are combined in log-linear fashion.",
        "Furthermore, we used an additional reordering model as described in (Galley and Manning, 2008).",
        "By this model six",
        "additional feature are added to the log-linear combination.",
        "The model weights are optimized with standard Mert (Och, 2003a) on 200-best lists.",
        "The optimization criterion is BLEU.",
        "In order to reduce the source vocabulary size translation, the German text was preprocessed by splitting German compound words with the frequency-based method described in (Koehn and Knight, 2003).",
        "To further reduce translation complexity for the phrase-based approach, we performed the long-range part-of-speech based reordering rules proposed by (Popovic?",
        "et al, 2006).",
        "We applied filtering and weighting for domain-adaptation similarly to (Mansour et al., 2011) and (Mansour and Ney, 2012).",
        "For filtering the bilingual data, a combination of LM and IBM Model 1 scores was used.",
        "In addition, we performed weighted phrase extraction by using a combined LM and IBM Model 1 weight.",
        "During decoding a 4-gram language model is applied.",
        "The language model is trained on the parallel data as well as the provided News crawl, the 109 French-English, UN and LDC Gigaword Fourth Edition corpora."
      ]
    },
    {
      "heading": "2.2 Karlsruhe Institute of Technology Single System 2.2.1 Preprocessing",
      "text": [
        "The training data was preprocessed prior to the training.",
        "Symbols such as quotes, dashes and apostrophes are normalized.",
        "Then the first words of each sentence are smart-cased.",
        "For the German part of the training corpus, the hunspell2 lexicon was used, in order to learn a mapping from old German spelling to new German writing rules.",
        "Compound-splitting was also performed as described in Koehn and Knight (2003).",
        "We also removed very long sentences, empty lines, and sentences which show big mismatch on the length.",
        "The web-crawled corpus was filtered using an SVM classifier as described in (Mediani et al., 2011).",
        "The lexica used in this filtering task were obtained from Giza alignments trained on the",
        "corpus is very noisy, we biased our classifier more towards precision than recall.",
        "This was realized by giving higher number of false examples (80% of the training data).",
        "This filtering technique ruled out more than 38% of the corpus (the unfiltered corpus contains around 2.4M pairs, 0.9M of which were rejected in the filtering task).",
        "The in-house phrase-based decoder (Vogel, 2003) is used to perform decoding.",
        "Optimization with regard to the BLEU score is done using Minimum Error Rate Training (MERT) as described in Venu-gopal et al. (2005).",
        "We applied part-of-speech (POS) based reordering using probabilistic continuous (Rottmann and Vogel, 2007) and discontinuous (Niehues and Kolss, 2009) rules.",
        "This was learned using POS tags generated by the TreeTagger (Schmid, 1994) for short and long range reorderings respectively.",
        "In addition to this POS-based reordering, we also used tree-based reordering rules.",
        "Syntactic parse trees of the whole training corpus and the word alignment between source and target language are used to learn rules on how to reorder the constituents in a German source sentence to make it match the English target sentence word order better (Herrmann et al., 2013).",
        "The training corpus was parsed by the Stanford parser (Rafferty and Manning, 2008).",
        "The reordering rules are applied to the source sentences and the reordered sentence variants as well as the original sequence are encoded in a word lattice which is used as input to the decoder.",
        "Moreover, our reordering model was extended so that it could include the features of lexicalized reordering model.",
        "The reordering probabilities for each phrase pair are stored as well as the original position of each word in the lattice.",
        "During the decoding, the reordering origin of the words is checked along with its probability added as an additional score.",
        "The translation model uses the parallel data of EPPS, NC, and the filtered web-crawled data.",
        "As word alignment, we used the Discriminative Word Alignment (DWA) as shown in (Niehues and Vo",
        "gel, 2008).",
        "The phrase pairs were extracted using different source word order suggested by the POS-based reordering models presented previously as described in (Niehues et al., 2009).",
        "In order to extend the context of source language words, we applied a bilingual language model (Niehues et al., 2011).",
        "A Discriminative Word Lexicon (DWL) introduced in (Mauser et al., 2009) was extended so that it could take the source context also into the account.",
        "For this, we used a bag-of-ngrams instead of representing the source sentence as a bag-of-words.",
        "Filtering based on counts was then applied to the features for higher order n-grams.",
        "In addition to this, the training examples were created differently so that we only used the words that occur in the n-best list but not in the reference as negative example.",
        "We build separate language models and combined them prior to decoding.",
        "As word-token based language models, one language model is built on EPPS, NC, and giga corpus, while another one is built using crawled data.",
        "We combined the LMs linearly by minimizing the perplexity on the development data.",
        "As a bilingual language model we used the EPPS, NC, and the web-crawled data and combined them.",
        "Furthermore, we use a 5-gram cluster-based language model with 1,000 word clusters, which was trained on the EPPS and NC corpus.",
        "The word clusters were created using the MKCLS algorithm."
      ]
    },
    {
      "heading": "2.3 LIMSI-CNRS Single System",
      "text": [
        "LIMSI's system is built with n-code (Crego et al., 2011), an open source statistical machine translation system based on bilingual n-gram3.",
        "In this approach, the translation model relies on a specific decomposition of the joint probability of a sentence pair using the n-gram assumption: a sentence pair is decomposed into a sequence of bilingual units called tuples, defining a joint segmentation of the source and target.",
        "In the approach of (Marin?o et al., 2006), this segmentation is a by-product of source reordering which ultimately derives from initial word and phrase alignments.",
        "The baseline translation model is implemented as a stochastic finite-state transducer trained using",
        "a n-gram model of (source,target) pairs (Casacu-berta and Vidal, 2004).",
        "Training this model requires to reorder source sentences so as to match the target word order.",
        "This is performed by a stochastic finite-state reordering model, which uses part-of-speech information4 to generalize reordering patterns beyond lexical regularities.",
        "In addition to the translation model, eleven feature functions are combined: a target-language model; four lexicon models; two lexicalized reordering models (Tillmann, 2004) aiming at predicting the orientation of the next translation unit; a ?weak?",
        "distance-based distortion model; and finally a word-bonus model and a tuple-bonus model which compensate for the system preference for short translations.",
        "The four lexicon models are similar to the ones use in a standard phrase based system: two scores correspond to the relative frequencies of the tuples and two lexical weights estimated from the automatically generated word alignments.",
        "The weights associated to feature functions are optimally combined using a discriminative training framework (Och, 2003b).",
        "The overall search is based on a beam-search strategy on top of a dynamic programming algorithm.",
        "Reordering hypotheses are computed in a preprocessing step, making use of reordering rules built from the word reorderings introduced in the tuple extraction process.",
        "The resulting reordering hypotheses are passed to the decoder in the form of word lattices (Crego and Mario, 2006)."
      ]
    },
    {
      "heading": "2.3.3 Continuous space translation models",
      "text": [
        "One critical issue with standard n-gram translation models is that the elementary units are bilingual pairs, which means that the underlying vocabulary can be quite large, even for small translation tasks.",
        "Unfortunately, the parallel data available to train these models are typically order of magnitudes smaller than the corresponding monolingual corpora used to train target language models.",
        "It is very likely then, that such models should face severe estimation problems.",
        "In such setting, using neural network language model techniques seem all the more appropriate.",
        "For this study, we follow the recommendations of Le et al. (2012), who propose to factor the joint probability of a sentence pair by decomposing tuples in two (source and target) parts, and further each part in words.",
        "This yields a word factored translation model that 4Part-of-speech labels for English and German are computed using the TreeTagger (Schmid, 1995).",
        "can be estimated in a continuous space using the SOUL architecture (Le et al., 2011).",
        "The design and integration of a SOUL model for large SMT tasks is far from easy, given the computational cost of computing n-gram probabilities.",
        "The solution used here was to resort to a two pass approach: the first pass uses a conventional back-off n-gram model to produce a k-best list; in the second pass, the k-best list is reordered using the probabilities of m-gram SOUL translation models.",
        "In the following experiments, we used a fixed context size for SOUL of m= 10, and used k = 300.",
        "All the parallel data allowed in the constrained task are pooled together to create a single parallel corpus.",
        "This corpus is word-aligned using MGIZA++5 with default settings.",
        "For the English monolingual training data, we used the same setup as last year6 and thus the same target language model as detailed in (Allauzen et al., 2011).",
        "For English, we also took advantage of our in-house text processing tools for the tokenization and detokenization steps (Dchelotte et al., 2008) and our system is built in ?true-case?.",
        "As German is morphologically more complex than English, the default policy which consists in treating each word form independently is plagued with data sparsity, which is detrimental both at training and decoding time.",
        "Thus, the German side was normalized using a specific preprocessing scheme (described in (Allauzen et al., 2010; Durgar El-Kahlout and Yvon, 2010)), which notably aims at reducing the lexical redundancy by (i) normalizing the orthography, (ii) neutralizing most inflections and (iii) splitting complex compounds."
      ]
    },
    {
      "heading": "2.4 SYSTRAN Software, Inc. Single System",
      "text": [
        "In the past few years, SYSTRAN has been focusing on the introduction of statistical approaches to its rule-based backbone, leading to Hybrid Machine Translation.",
        "The technique of Statistical Post-Editing (Dugast et al., 2007) is used to automatically edit the output of the rule-based system.",
        "A Statistical Post-Editing (SPE) module is generated from a bilingual corpus.",
        "It is basically a translation module by itself, however it is trained on rule-based",
        "translations and reference data.",
        "It applies corrections and adaptations learned from a phrase-based 5-gram language model.",
        "Using this two-step process will implicitly keep long distance relations and other constraints determined by the rule-based system while significantly improving phrasal fluency.",
        "It has the advantage that quality improvements can be achieved with very little but targeted bilingual data, thus significantly reducing training time and increasing translation performance.",
        "The basic setup of the SPE component is identical to the one described in (Dugast et al., 2007).",
        "A statistical translation model is trained on the rule-based translation of the source and the target side of the parallel corpus.",
        "Language models are trained on each target half of the parallel corpora and also on additional in-domain corpora.",
        "Moreover, the following measures - limiting unwanted statistical effects - were applied: ?",
        "Named entities are replaced by special tokens on both sides.",
        "This usually improves word alignment, since the vocabulary size is significantly reduced.",
        "In addition, entity translation is handled more reliably by the rule-based engine.",
        "?",
        "The intersection of both vocabularies (i.e. vocabularies of the rule-based output and the reference translation) is used to produce an additional parallel corpus (whose target is identical to the source).",
        "This was added to the parallel text in order to improve word align",
        "ment.",
        "?",
        "Singleton phrase pairs are deleted from the phrase table to avoid overfitting.",
        "?",
        "Phrase pairs not containing the same number of entities on the source and the target side are also discarded.",
        "?",
        "Phrase pairs appearing less than 2 times were",
        "pruned.",
        "The SPE language model was trained on 2M phrases from the news/europarl and Common-Crawl corpora, provided as training data for WMT 2013.",
        "Weights for these separate models were tuned by the Mert algorithm provided in the Moses toolkit (Koehn et al., 2007), using the provided news development set."
      ]
    },
    {
      "heading": "3 RWTH Aachen System Combination",
      "text": [
        "System combination is used to produce consensus translations from multiple hypotheses generated with different translation engines.",
        "First, a word to word alignment for the given single system hypotheses is produced.",
        "In a second step a confusion network is constructed.",
        "Then, the hypothesis with the highest probability is extracted from this confusion network.",
        "For the alignment procedure, each of the given single systems gen",
        "tence is the union of all confusion networks generated from the different primary systems.",
        "That allows the system combination to select the word order from different system outputs.",
        "Before performing system combination, each translation output was normalized by tokenization and lowercasing.",
        "The output of the combination was then truecased based on the original truecased output.",
        "The model weights of the system combination are optimized with standard Mert (Och, 2003a) on 100-best lists.",
        "We add one voting feature for each single system to the log-linear framework of the system combination.",
        "The voting feature fires for each word the single system agrees on.",
        "Moreover, a word penalty, a language model trained on the input hypotheses, a binary feature which penalizes word deletions in the confusion network and a primary feature which marks the system which provides the word order are combined in this log-linear model.",
        "The optimization criterion is 4BLEU-TER."
      ]
    },
    {
      "heading": "4 Experimental Results",
      "text": [
        "In this year's experiments, we tried to improve the result of the system combination further by combining single systems tuned on different develop",
        "ment sets.",
        "The idea is to achieve a more stable performance in terms of translation quality, if the single systems are not optimized on the same data set.",
        "In Table 1, the results of each provided single system tuned on newstest2009 and newstest2010 are shown.",
        "For RWTH, LIMSI and SYSTRAN, it seems that the performance of the single system depends on the chosen tuning set.",
        "However, the translation quality of the single systems provided by KIT is stable.",
        "As initial approach and for the final submission, we grouped single systems with dissimilar approaches.",
        "Thus, KIT (phrase-based SMT) and SYSTRAN (rule-based MT) tuned their system on newstest2010, while RWTH (phrase-based SMT) and LIMSI (n-gram) optimized on newstest2009.",
        "To compare the impact of this approach, all possible combinations were checked (Table 2).",
        "However, it seems that the translation quality can not be improved by this approach.",
        "For the test set (newstest2012), BLEU is steady around 25.6 points.",
        "Even if the single system with lowest BLEU are combined (KIT 2010, LIMSI 2009, SYSTRAN 2010, RWTH 2009), the translation quality in terms of BLEU is comparable with the combination of the best single systems (KIT 2009, LIMSI 2010, SYSTRAN 2010, RWTH 2010).",
        "However, we could gain 1.0 point in TER.",
        "Due to the fact, that for the final submission the initial grouping was available only, we kept this",
        "face) compared with best single system on newstest2012.",
        "combination.",
        "To improve this baseline further, two additional models were added.",
        "We applied lexical smoothing (IBM-1) and an additional language model (bigLM) trained on the English side of the parallel data and the News shuffle corpus.",
        "The results are presented in Table 3.",
        "The baseline was slightly improved by 0.2 points in BLEU and TER.",
        "Note, this system combination was the final submission."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "For the participation in the WMT 2013 shared translation task, the partners of the QUAERO project (Karlsruhe Institute of Technology, RWTH Aachen University, LIMSI-CNRS and SYSTRAN Software, Inc.) provided a joint submission.",
        "By joining the output of four different translation systems with RWTH's system combination, we reported an improvement of up to 1.2 points in BLEU and TER.",
        "Combining systems optimized on different tuning sets does not seem to improve the translation quality.",
        "However, by adding additional model, the baseline was slightly improved.",
        "All in all, we conclude that the variability in terms of BLEU does not influence the final result.",
        "It seems that using different approaches of MT in a system combination is more important (Freitag et al., 2012)."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work was achieved as part of the Quaero Programme, funded by OSEO, French State agency for innovation."
      ]
    }
  ]
}
