{
  "info": {
    "authors": [
      "Efsun Sarioglu",
      "Kabir Yadav",
      "Hyeong-Ah Choi"
    ],
    "book": "ACL",
    "id": "acl-P13-3010",
    "title": "Topic Modeling Based Classification of Clinical Reports",
    "url": "https://aclweb.org/anthology/P13-3010",
    "year": 2013
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Electronic health records (EHRs) contain important clinical information about patients.",
        "Some of these data are in the form of free text and require preprocessing to be able to used in automated systems.",
        "Efficient and effective use of this data could be vital to the speed and quality of health care.",
        "As a case study, we analyzed classification of CT imaging reports into binary categories.",
        "In addition to regular text classification, we utilized topic mod-eling of the entire dataset in various ways.",
        "Topic modeling of the corpora provides interpretable themes that exist in these reports.",
        "Representing reports according to their topic distributions is more compact than bag-of-words representation and can be processed faster than raw text in subsequent automated processes.",
        "A binary topic model was also built as an unsupervised classification approach with the assumption that each topic corresponds to a class.",
        "And, finally an aggregate topic classifier was built where reports are classified based on a single discriminative topic that is determined from the training dataset.",
        "Our proposed topic based classifier system is shown to be competitive with existing text classification techniques and provides a more efficient and interpretable representation."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Large amounts of medical data are now stored as electronic health records (EHRs).",
        "Some of these data are in the form of free text and they need to be processed and coded for better utilization in automatic or semi-automatic systems.",
        "One possible utilization is to support clinical decision-making, such as recommending the need for a certain medical test while avoiding intrusive tests or medical costs.",
        "This type of automated analysis of patient reports can help medical professionals make clinical decisions much faster with more confidence by providing predicted outcomes.",
        "In this study, we developed several topic modeling based classification systems for clinical reports.",
        "Topic modeling is an unsupervised technique that can automatically identify themes from a given set of documents and find topic distributions of each document.",
        "Representing reports according to their topic distributions is more compact and can be processed faster than raw text in subsequent automated processing.",
        "It has previously been shown that the biomedical concepts can be well represented as noun phrases (Huang et al., 2005) and nouns, compared to other parts of speech, tend to specialize into topics (Griffiths et al., 2004).",
        "Therefore, topic model output of patient reports could contain very useful clinical information."
      ]
    },
    {
      "heading": "2 Background",
      "text": [
        "This study utilized prospective patient data previously collected for a traumatic orbital fracture project (Yadav et al., 2012).",
        "Staff radiologists dictated each CT report and the outcome of acute orbital fracture was extracted by a trained data abstractor.",
        "Among the 3,705 reports, 3,242 had negative outcome while 463 had positive.",
        "A random subset of 507 CT reports were double-coded, and inter-rater analysis revealed excellent agreement between the data abstractor and study physician, with Cohen's kappa of 0.97."
      ]
    },
    {
      "heading": "2.1 Bag-of-Words (BoW) Representation",
      "text": [
        "Text data need to be converted to a suitable format for automated processing.",
        "One way of doing this is bag-of-words (BoW) representation where each document becomes a vector of its words/tokens.",
        "The entries in this matrix could be binary stating the existence or absence of a word in a document or it could be weighted such as number of times a word exists in a document."
      ]
    },
    {
      "heading": "2.2 Topic Modeling",
      "text": [
        "Topic modeling is an unsupervised learning algorithm that can automatically discover themes of a document collection.",
        "Several techniques can be used for this purpose such as Latent Semantic Analysis (LSA) (Deerwester et al., 1990), Probabilistic Latent Semantic Analysis (PLSA) (Hofmann, 1999), and Latent Dirichlet Allocation (LDA) (Blei et al., 2003).",
        "LSA is a way of representing hidden semantic structure of a term-document matrix where rows are documents and columns are words/tokens (Deerwester et al., 1990) based on Singular Value Decomposition (SVD).",
        "One of the problems of LSA is that each word is treated as having the same meaning due to the word being represented as a single point; therefore in this representation, polysemes of words cannot be differentiated.",
        "Also, the final output of LSA, which consists of axes in Euclidean space, is not interpretable or descriptive (Hofmann, 2001).",
        "PLSA is considered probabilistic version of LSA where an unobserved class variable zk ?",
        "{z1, ..., zK} is associated with each occurrence of a word in a particular document (Hofmann, 1999).",
        "These classes/topics are then inferred from the input text collection.",
        "PLSA solves the polysemy problem; however it is not considered a fully generative model of documents and it is known to be overfitting (Blei et al., 2003).",
        "The number of parameters grows linearly with the number of documents.",
        "LDA, first defined by (Blei et al., 2003), defines topic as a distribution over a fixed vocabulary, where each document can exhibit them with different proportions.",
        "For each document, LDA generates the words in a two-step process:",
        "1.",
        "Randomly choose a distribution over topics.",
        "2.",
        "For each word in the document: (a) Randomly choose a topic from the distribution over topics.",
        "(b) Randomly choose a word from the cor",
        "responding distribution over the vocabulary.",
        "The probability of generating the word wj from document di can be calculated as below:",
        "where ?",
        "is sampled from a Dirichlet distribution for each document di and ?",
        "is sampled from a Dirichlet distribution for each topic zk.",
        "Either sampling methods such as Gibbs Sampling (Griffiths and Steyvers, 2004) or optimization methods such as variational Bayes approximation (Asun-cion et al., 2009) can be used to train a topic model based on LDA.",
        "LDA performs better than PLSA for small datasets since it avoids overfitting and it supports polysemy (Blei et al., 2003).",
        "It is also considered a fully generative system for documents in contrast to PLSA."
      ]
    },
    {
      "heading": "2.3 Text Classification",
      "text": [
        "Text classification is a supervised learning algorithm where documents?",
        "categories are learned from pre-labeled set of documents.",
        "Support vector machines (SVM) is a popular classification algorithm that attempts to find a decision boundary between classes that is the farthest from any point in the training dataset.",
        "Given labeled training data (xt, yt), t = 1, ..., N where xt ?",
        "RM and yt ?",
        "{1,?1}, SVM tries to find a separating hyperplane with the maximum margin (Platt, 1998).",
        "Once the classifier is built, its performance is evaluated on training dataset.",
        "Its effectiveness is then measured in the remaining unseen documents in the testing set.",
        "To evaluate the classification performance, precision, recall, and F-score measures are typically used (Manning et al., 2008)."
      ]
    },
    {
      "heading": "3 Related Work",
      "text": [
        "For text classification, topic modeling techniques have been utilized in various ways.",
        "In (Zhang et al., 2008), it is used as a keyword selection mechanism by selecting the top words from topics based on their entropy.",
        "In our study, we removed the most frequent and infrequent words to have a manageable vocabulary size but we did not utilize topic model output for this purpose.",
        "(Sarioglu et al., 2012) and (Sriurai, 2011) compare BoW representation to topic model representation for classification using varying and fixed number of topics respectively.",
        "This is similar to our topic vec",
        "tor classification results with SVM, however (Sriurai, 2011) uses a fixed number of topics, whereas we evaluated different number of topics since typically this is not known in advance.",
        "In (Banerjee, 2008), topics are used as additional features to BoW features for the purpose of classification.",
        "In our approaches, we used topic vector representation as an alternative to BoW and not additional.",
        "This way, we can achieve great dimension reduction.",
        "Finally, (Chen et al., 2011) developed a re-sampling approach based on topic modeling when the class distributions are not balanced.",
        "In this study, resampling approaches are also utilized to compare skewed dataset results to datasets with equal class distributions; however, we used randomized resampling approaches for this purpose."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": [
        "Figure 1 shows the three approaches of using topic model of clinical reports to classify them and they are explained below."
      ]
    },
    {
      "heading": "4.1 Preprocessing",
      "text": [
        "During preprocessing, all protected health information were removed to meet Institutional Review Board requirements.",
        "Medical record numbers from each report were replaced by observation numbers, which are sequence numbers that are automatically assigned to each report.",
        "Frequent words were also removed from the vocabulary to prevent it from getting too big.",
        "In addition, these frequent words typically do not add much information; most of them were stop words such as is, am, are, the, of, at, and."
      ]
    },
    {
      "heading": "4.2 Topic Modeling",
      "text": [
        "LDA was chosen to generate the topic models of clinical reports due to its being a generative probabilistic system for documents and its robustness to overfitting.",
        "Stanford Topic Modeling Toolbox (TMT) 1 was used to conduct the experiments which is an open source software that provides ways to train and infer topic models for text data."
      ]
    },
    {
      "heading": "4.3 Topic Vectors",
      "text": [
        "Topic modeling of reports produces a topic distribution for each report which can be used to represent them as topic vectors.",
        "This is an alternative representation to BoW where terms are replaced",
        "with topics and entries for each report show the probability of a specific topic for that report.",
        "This representation is more compact than BoW as the vocabulary for a text collection usually has thousands of entries whereas a topic model is typically built with a maximum of hundreds of topics."
      ]
    },
    {
      "heading": "4.4 Supervised Classification",
      "text": [
        "SVM was chosen as the classification algorithm as it was shown that it performs well in text classification tasks (Joachims, 1998; Yang and Liu, 1999) and it is robust to overfitting (Sebastiani, 2002).",
        "Weka was used to conduct classification which is a collection of machine learning algorithms for data mining tasks written in Java (Hall et al., 2009).",
        "It uses attribute relationship file format (ARFF) to store data in which each line represents a document followed by its assigned class.",
        "Accordingly, the raw text of the reports and topic vectors are compiled into individual files with their corresponding outcomes in ARFF and then classified with SVM."
      ]
    },
    {
      "heading": "4.5 Aggregate Topic Classifier (ATC)",
      "text": [
        "With this approach, a representative topic vector for each class was composed by averaging their corresponding topic distributions in the training dataset.",
        "A discriminative topic was then chosen so that the difference between positive and negative representative vectors is maximum.",
        "The reports in the test datasets were then classified by analyzing the values of this topic and a threshold was chosen to determine the predicted class.",
        "This threshold could be chosen automatically based on class distributions if the dataset is skewed or cross validation methods can be applied to pick a threshold that gives the best classification performance in a validation dataset.",
        "This approach is called Aggregate Topic Classifier (ATC) since training labels were utilized in an aggregate fashion using an average function and not individually."
      ]
    },
    {
      "heading": "4.6 Binary Topic Classification (BTC)",
      "text": [
        "Topic modeling of the data with two topics was also analyzed as an unsupervised classification technique.",
        "In this approach, binary topics were assumed to correspond to the binary classes.",
        "After topic model was learned, the topic with the higher probability was assigned as the predicted class for each document.",
        "If the dataset is skewed, which topic corresponds to which class was found out by checking predicted class proportions.",
        "For datasets",
        "with equal class distributions, each of the possible assignments were checked and the one with the better classification performance was chosen."
      ]
    },
    {
      "heading": "5 Results",
      "text": [
        "Classification results using ATC and SVM are shown in Figures 2, 3, and 4 for precision, recall, and f-score respectively.",
        "They are each divided into five sections to show the result of using different training/testing proportions.",
        "These training and test datasets were randomized and stratified to make sure each subset is a good representation of the original dataset.",
        "For ATC, we evaluated different quantile points: 75, 80, 82, 85, 87 as threshold and picked the one that gives the best classification performance.",
        "These were chosen as candidates based on the positive class ratio of original dataset of 12%.",
        "Best classification performance was achieved with 15 topics for ATC and 100 topics for SVM.",
        "For smaller number of topics, ATC performed better than SVM.",
        "As number of topics increased, it got harder to find a very discriminative single topic and therefore ATC's performance got worse whereas SVM's performance got better as it got more information with more number of topics.",
        "However, using topic vectors to represent reports still provided great dimension reduction as raw text of the reports had 1,296 terms and made the subsequent classification with SVM faster.",
        "Finally, different training and test set proportions did not have much effect on both of ATC's and SVM's performance.",
        "This could be considered a good outcome as using only 25% of data for training would be sufficient to build an accurate classifier.",
        "We analyzed the performance of classification using binary topics with three datasets: original, undersampled, and oversampled.",
        "In the undersampled dataset, excess amount of negative cases were removed and the resulting dataset consisted of 463 documents for each class.",
        "For oversampled dataset, positive cases were oversampled while keeping the total number of documents the same.",
        "This approach produced a dataset consisting of 1,895 positive and 1,810 negative cases.",
        "With the original dataset, we could see the performance on a highly skewed real dataset and with the re-sampled datasets, we could see the performance on data with equal class distributions.",
        "Classification results using this approach are summarized in Table 2.",
        "As a baseline, a trivial rejector/zero rule classifier was used.",
        "This classifier simply predicted the majority class.",
        "Balanced datasets performed better compared to skewed original dataset using this approach.",
        "This is also due to the fact that skewed dataset had a higher baseline compared to the undersampled and oversampled datasets.",
        "In Table 3, the best performance of each",
        "technique for the original dataset is summarized.",
        "Although BTC performed better than baseline for",
        "datasets with equal class distribution, for the original skewed dataset, it got worse results than the baseline.",
        "ATC, on the other hand, got comparable results with SVM using both topic vectors and raw text.",
        "In addition, ATC used fewer number of topics than SVM for its best performance."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "In this study, topic modeling of clinical reports are utilized in different ways with the end goal of classification.",
        "Firstly, bag-of-words representation is replaced with topic vectors which provide good dimensionality reduction and still get comparable classification performance.",
        "In aggregate topic classifier, representative topic vectors for positive and negative classes are composed and used as a guide to classify the reports in the test dataset.",
        "This approach was competitive with classification with SVM using raw text and topic vectors.",
        "In addition, it required few topics to get the best performance.",
        "And finally, in the unsupervised setting, binary topic models are built for each dataset with the assumption that each topic corresponds to a class.",
        "For datasets with equal class distribution, this approach showed improvement over baseline approaches."
      ]
    }
  ]
}
