{
  "info": {
    "authors": [
      "Tadayoshi Hara",
      "Chen Chen",
      "Yoshinobu Kano",
      "Akiko Aizawa"
    ],
    "book": "Workshop on Predicting and Improving Text Readability for target reader populations",
    "id": "acl-W13-2906",
    "title": "Modeling Comma Placement in Chinese Text for Better Readability using Linguistic Features and Gaze Information",
    "url": "https://aclweb.org/anthology/W13-2906",
    "year": 2013
  },
  "references": [
    "acl-D10-1018",
    "acl-P06-3008",
    "acl-P11-2111",
    "acl-W04-1101"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Comma placements in Chinese text are relatively arbitrary although there are some syntactic guidelines for them.",
        "In this research, we attempt to improve the readability of text by optimizing comma placements through integration of linguistic features of text and gaze features of readers.",
        "We design a comma predictor for general Chinese text based on conditional random field models with linguistic features.",
        "After that, we build a rule-based filter for categorizing commas in text according to their contribution to readability based on the analysis of gazes of people reading text with and without commas.",
        "The experimental results show that our predictor reproduces the comma distribution in the Penn Chinese Treebank with 78.41 in F1-score and commas chosen by our filter smoothen certain gaze behaviors."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Chinese is an ideographic language, with no natural apparent word boundaries, little morphology, and no case markers.",
        "Moreover, most Chinese sentences are quite long.",
        "These features make it especially difficult for Chinese learners to identify composition of a word or a clause in a sentence.",
        "Punctuation marks, especially commas, are allowed to be placed relatively arbitrarily to serve as important segmentation cues (Yue, 2006) for providing syntactic and prosodic boundaries in text; commas indicate not only phrase or clause boundaries but also sentence segmentations, and they capture some of the major aspects of a writer's prosodic intent (Chafe, 1988).",
        "The combination of both aspects promotes cognition when reading text (Ren and Yang, 2010; Walker et al., 2001).",
        "However, although there are guidelines and research on the syntactic aspects of comma placement, prosodic aspects have not been explored, since they are more related with cognition.",
        "It is as yet unclear how comma placement should be optimized for reading, and it has thus far been up to the writer (Huang and Chen, 2011).",
        "In this research, we attempt to optimize comma placements by integrating the linguistic features of text and the gaze features of readers.",
        "Figure 1 illustrates our approach.",
        "First, we design a comma predictor for general Chinese text based on conditional random field (CRF) models with various linguistic features.",
        "Second, we build a rule-based filter for classifying commas in text into ones facilitating or obstructing readability, by comparing the gaze features of persons reading text with and without commas.",
        "These two steps are connected by applying our rule-based filter to commas predicted by our comma predictor.",
        "The experimental results for each step validate our approach.",
        "Related work is described in Section 2.",
        "The functions of Chinese commas are described in Section 3.",
        "Our CRF model-based comma predictor is examined in Section 4, and our rule-based comma filter is constructed and examined in Section 5 and 6.",
        "Section 7 contains a summary and outlines future directions of this research.",
        "[Case 1] When a pause between a subject and a predicate is needed.",
        "(?",
        "(,) means the original or comparative position of the comma in Chinese text.)",
        "e.g.",
        "????????????????????????",
        "(The stars we can see (,)?",
        "are mostly fixed stars that are far away from the earth.)",
        "[Case 2] When a pause between an inner predicate and an object of a sentence is needed.",
        "e.g.",
        "?????????????????????",
        "(We should see that (,) science needs a person to devote all his/her life to it.)",
        "[Case 3] When a pause after an inner (adverbial, prepositional, etc.)",
        "modifier of a sentence is needed.",
        "e.g.",
        "?????????????",
        "(He is no stranger (,) to this city.)",
        "(The order of the modifier and the main clause is opposite in the English translation.)",
        "[Case 4] When a pause between clauses in a complex sentence is needed, besides the use of semicolon (?).",
        "e.g.",
        "??????????????????????",
        "(It is said that there are more than 100 Suzhou traditional gardens, (,) no more than 10 of which I have been to.)",
        "[Case 5] When a pause between phrases of the same syntactic type is needed.",
        "e.g.",
        "???????????????",
        "(The students prefer young (,) and energetic teachers.)",
        "(a) Screenshot of a material Display PC Monitor SubjectEye TrackerHost PC Monitor (b) Scene of the experiment (c) Window around a gaze point"
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Previous work on Chinese punctuation prediction mostly focuses on sentence segmentation in automatic speech recognition (Shriberg et al., 2000; Huang and Zweig, 2002; Peitz et al., 2011).",
        "Jin et al. (2002) classified commas for sentence segmentation and succeeded in improving parsing performance.",
        "Lu and Ng (2010) proposed an approach built on a dynamic CRF for predicting punctuations, sentence boundaries, and sentence types of speech utterances without prosodic cues.",
        "Zhang et al. (2006) suggested that a cascade CRF-based approach can deal with ancient Chinese prose punctuation better than a single CRF.",
        "Guo et al. (2010) implemented a three-tier maximum entropy model incorporating linguistically motivated features for generating commonly used Chinese punctuation marks in unpunctuated sentences output by a surface realizer."
      ]
    },
    {
      "heading": "3 Functions of Chinese Commas",
      "text": [
        "There are five main uses of commas in Chinese text, as shown in Table 1.",
        "Cases 1 to 4 are from ZDIC.NET (2005), and Case 5 obviously exists in Chinese text.",
        "The first three serve the function of emphasis, while the latter two indicate coordinating or subordinating clauses or phrases.",
        "In Cases 1 and 2, a comma is inserted as a kind of pause between a short subject and a long predicate, or between a short remainder predicate, such as??",
        "(see/know),??/??",
        "(indicate),?",
        "?",
        "(find) etc., and following long clause-style objects.",
        "English commas, on the other hand, seldom have such usages (Zeng, 2006).",
        "In Cases 3 and 4, commas instead of conjunctions sometimes connect two clauses in a relation of either coordination or subordination.",
        "English commas, on the other hand, are only required between independent clauses connected by conjunctions (Zeng, 2006).",
        "Liu et al. (2010) proved that Chinese commas can change the syntactic structures of sentences by playing lexical or syntactic roles.",
        "Ren and Yang (2010) claimed that inserting commas as clause boundaries shortens the fixation time in post-comma regions.",
        "Meanwhile, in computational linguistics, Xue and Yang (2011) showed",
        "that Chinese sentence segmentation can be viewed as detecting loosely coordinated clauses separated by commas."
      ]
    },
    {
      "heading": "4 CRF Model-based Comma Predictor",
      "text": [
        "We first predict comma placements in existing text.",
        "The prediction is formalized as a task to annotate each word in a word sequence with an IOB-style tag such as I-Comma (following a comma), B-Comma (preceding a comma) or O (neither I-Comma nor B-Comma).",
        "We utilize a CRF model for this sequential labeling (Lafferty et al., 2001)."
      ]
    },
    {
      "heading": "4.1 CRF Model for Comma Prediction",
      "text": [
        "A conditional probability assigned to a label sequence Y for a particular sequence of words X in a first-order linear-chain CRF is given by:",
        "where w is a word position in X , fi is a binary function describing a feature for Yw?1, Yw, X , and w, ?i is a weight for that feature, and Z0 is a normalization factor over all possible label sequences.",
        "The weight ?i for each fi is learned on training data.",
        "For fi, the linguistic features shown in Table 2 are derived from a syntactic parse of a sentence1.",
        "The first three were used initially; the rest were added after we got feedback from construction of our rule-based filters (see Section 5).",
        "Figure 2 shows an example of a parsing tree and its corresponding training data.",
        "the previous research, such as bi-/tri-gram, a preceding word (L-1) or its POS (POS-1), and IO-style tag (Leaman and Gonzalez, 2008) were also examined, but they did not work that well, probably because of the difference in task settings."
      ]
    },
    {
      "heading": "4.2 Experimental Settings",
      "text": [
        "The Penn Chinese Treebank (CTB) 7.0 (Nai-wen Xue and Palmer, 2005) consists of 2,448 articles in five genres.",
        "It contains 1,196,329 words, and all sentences are annotated with parse trees.",
        "We selected four genres for written Chinese (newswire, news magazine, broadcast news and newsgroups/weblogs) from this corpus as our dataset.",
        "These were randomly divided into training (90%) and test data (10%).",
        "We also corrected errors in tagging and inconsistencies in the dataset, mainly by solving problems around strange characters tagged as PU (punctuation).",
        "The commas and characters after this preprocessing numbered 63,571 and 1,533,928 in the training data and 4,116 and 111,172 in the test data.",
        "MALLET (McCallum, 2002) and its application ABNER (Settles, 2005) were used to train the CRF model.",
        "We evaluated the results in terms of precision (P = tp/(tp + fp)), recall (R = tp/(tp+fn)), F1-score (F1 = 2PR/(P+R)), and accuracy (A = (tp + tn)/(tp + tn + fp + fn)), where tp, tn, fp and fn are respectively the number of true positives, true negatives, false positives and false negatives, based on whether the model and the corpus provided commas at each location."
      ]
    },
    {
      "heading": "4.3 Performance of the CRF Model",
      "text": [
        "Table 3 shows the performance of our CRF model2.",
        "We can see that WS contributed much more to the performance than other features, probably because a word surface itself has a lot of information on both prosodic and syntactic functions.",
        "Combining WS with other features greatly improved performance, and as a result, with all 2Precision, recall, F1-score, and accuracy with WS + POS",
        "96.84%, respectively (lower than those with WS+POS+DIP).",
        "+ WL), precision, recall, F1-score and accuracy were 83.97%, 73.54%, 78.41 and 97.36%.",
        "We also found that a large number of false positives seemed helpful according to native speakers (see the description of the subjects in Section 5 and 6).",
        "Although these commas do not appear in the CTB text, they might smoothen the reading experience.",
        "We constructed a rule-based filter in order to pick out such commas."
      ]
    },
    {
      "heading": "5 Rule-based Comma Filter",
      "text": [
        "We constructed a rule-based comma filter for classifying commas in text into ones facilitating (positive) or obstructing (negative) the reading process as follows: [Step 1]: Collect gaze data from persons reading text with or without commas (Section 5.1).",
        "[Step 2]: Compare gaze features around commas to find those features that reflect the effect of comma placement.",
        "(Section 5.2).",
        "[Step 3]: Annotate commas with categories based on the obtained features (Section 5.3), and devise rules to explain the annotation (Section 5.4)."
      ]
    },
    {
      "heading": "5.1 Collecting Human Eye-movement Data",
      "text": [
        "Eye-movements during reading contain rich information on how the document is being read, what the reader is interested in, where difficulties happen, etc.",
        "The movements are characterized by fixations (short periods of steadiness), saccades (fast movements), and regressions (backward saccades) (Rayner, 1998).",
        "In order to analyze the effect of commas on reading through the features, we collected gaze data from subjects reading text in the following settings.",
        "[Subjects and Materials] Four native Man",
        "darin Chinese speakers (graduate students and researchers) read 15 newswire articles selected from CTB 7.0 (included in the test data in Section 4.2).",
        "Table 4 and Figure 3(a) show the materials assigned to each subject and a screenshot of one material.",
        "Each article was presented in 12-15 points of boldfaced Fang-Song font occupying 13?13, 14?15, 15?16 or 16?16 pixels along with a line spacing of 5-10 pixels3.",
        "[Apparatus] Figure 3(b) shows a scene of the experiment.",
        "An EyeLink 1000 eye tracker (SR Research Ltd., Toronto, Canada) with a desktop mount monitored the movements of a right eye at 1,000 Hz.",
        "The subject's head was supported at the chin and forehead.",
        "The distance between the eyes and the monitor was around 55 cm, and each Chinese character subtended a visual angle 1?.",
        "Text was presented on a 19?",
        "monitor at a resolution of 800?600 pixels, with the brightness adjusted to a comfortable level.",
        "The displayed article was masked except for the area around a gaze point (see Figure 3(c)) in order to confirm that the gaze point was correctly detected and make the subject concentrate on the area (adjusted for him/her).",
        "[Procedure] Each article was presented twice (once with/once without commas) to each subject.",
        "3These values, as well as the screen position of the article, were adjusted for each subject.",
        "The one without commas was presented first4 (not necessarily in a row).",
        "We did not give any comprehension test after reading; we just asked the subjects to read carefully and silently at their normal or lower speed, in order to minimize the effect of the first reading on the second.",
        "The subjects were informed of the presence or absence of commas beforehand.",
        "The apparatus was calibrated before the experiment and between trials.",
        "The experiment lasted around two hours for each subject.",
        "[Alignment of eye-tracking data to text] Figure 4 shows an example of the obtained eye-movement trace map, where circles and lines respectively mean fixation points and saccades, and color depth shows their duration.",
        "The alignment of the data to the text is a critical task, and although automatic approaches have been proposed (Mart?",
        "?nez-Go?mez et al., 2012a; Mart?",
        "?nez-Go?mez et al., 2012b), they do not seem robust enough for our purpose.",
        "Accordingly, we here just compared the entire layout of the gaze point distribution and that of the actual text, and adjusted them to have relatively coherent positions on the x-axis; i.e., the beginning and end of the gaze point sequence in a line were made as close as possible to those of the line in the text."
      ]
    },
    {
      "heading": "5.2 Analysis of Eye-movement Data",
      "text": [
        "The gaze data were analyzed by focusing on regions around each comma or where each one should be (three characters left and right to the",
        "knowledge about original comma distribution, and this would cause abnormally quick reading of the text without commas.",
        "With the order we set, conflicts between false segmentations (made in first reading) and correct ones might bother the subject, which is trade-off (though minor) in the second reading.",
        "1.",
        "If L Seg and R Seg are both very long, a comma must be put between them.",
        "2.",
        "If two ?",
        "appear serially, one is necessary whereas the other might be optional or judged negative, but it still depends on the lengths of the siblings.",
        "3.",
        "If two neighboring commas appear very close to each other, one of them is judged as negative whereas judgment on the other one is reserved.",
        "4.",
        "If several (more than 2) 's appear continually, one or more 's might be reserved in consideration of the global condition.",
        "5.",
        "A comma is always needed after a long sentence or clause without any syntactically significant punctuation with the function of segmentation.",
        "6.",
        "If a ?",
        "appears near a ?, it might be judged as negative with a high probability.",
        "However, the judgment process is always from the bottom up, which means ?",
        "?",
        "2?",
        "???.",
        "For example, if a 2 appears near a ?, we judge 2 first (to be positive or negative), then judge the ?",
        "in the condition with or without the comma of 2.",
        "mer two were shorter and the latter was smaller for the articles with commas than without.",
        "The diversity of the subjects was also observed in Figure 6.",
        "Figure 8 and 9 show the saccade length per comma for different measures.",
        "The former (latter) figure considers a saccade in which at least one edge (both edges) was in the region.",
        "We cannot see any global trend, probably because of the difference in global layout of materials brought by the presence or absence of commas."
      ]
    },
    {
      "heading": "5.3 Categorization of Commas",
      "text": [
        "Using the features shown to be effective to represent the effect of comma placement, we analyzed the statistics for each comma in order to manually construct an estimation formula for judging the contribution of each comma to readability.",
        "The contribution was classified into four categories (Table 5), and the formula is described in Table 67.",
        "The adjustment formula was based on our observation that the number of regressions could only be regarded as an aid.",
        "For example, for subject C, if ?FT=200ms and ?RT =?2, ?FT?=?350, and therefore, the comma is annotated as negative.",
        "All parameters were decided empirically and manually checked twice (self-judgment and feedback from the subjects).",
        "On the basis of this estimation formula, all articles in Table 4 were manually annotated.",
        "Table 7 shows the distribution of the assigned categories8.",
        "ter to the left and right of the final character of the last line were analyzed.",
        "6Calculated by counting the instances where the x-position of [a fixation / end point of a saccade ] was ahead of [the former fixation / its start point].",
        "Although the counts of these two types were almost the same, by counting both of them, we expected to cover any possible regression."
      ]
    },
    {
      "heading": "5.4 Implementation of Rule-based Filter",
      "text": [
        "The annotated commas were classified into Cases 1 to 5 in Table 1, based on the types of left and right segment conjuncts (L Seg and R Seg, which were obtained from the parse trees in CTB).",
        "For each of the five cases, the reason for the assignment of a category (?, ?, 2 or ?)",
        "to each comma was explained by a manually constructed rule which utilized information about L Seg and R Seg.",
        "The rules were constructed so that they would cover as many instances as possible.",
        "Table 8 shows the general rules utilized as a reference, and Table 9 shows the finally obtained rules.",
        "The rightmost column in this table shows the number of commas matching each rule.",
        "These rules were then implemented as a filter for classifying commas in a given text.",
        "For several rules (?10, 28, 210, 211 and 212), there were only single instances.",
        "In addition, although our rules were built carefully, a few exceptions to the detailed threshold were found.",
        "Collecting and investigating more gaze data would help to make our rules more sophisticated."
      ]
    },
    {
      "heading": "6 Performance of the Rule-based Filter",
      "text": [
        "We assumed that our comma predictor provides a CTB text with the same distribution as the original one in CTB (see Figure 1).",
        "Accordingly, we examined the quality of the comma categorization by our rule-based filter through gaze experiments."
      ]
    },
    {
      "heading": "6.1 Experimental Settings",
      "text": [
        "Another five native Mandarin Chinese speakers were invited as test subjects.",
        "The CTB articles assigned to the subjects are listed in Table 10.",
        "These articles were selected from the test data in Section 4.2 in such a way that 520<#characters<700, #commas>17, #commas/#punctuations>38%, and #commas/#characters>3.1%, since we needed articles of appropriate length with a fair number of commas.",
        "After that, we manually chose articles that seemed to attract the subjects?",
        "interest from those that satisfied the conditions.",
        "?3 Moderate-length clause (>10), but connected with familiar CC or ADVP 6 ?5 Three or more consecutive moderate-length clauses (all<15, and at least one ?10) 12 ?7 Very short L c + R c (both <5), something like slogan) 1 Case 5: L p + R p #commas ?1 Short coordinate modifiers (Both side <5) 4 ?4 Short L p+R p (both<c15w5, and at least one <10), but pre-L p (e.g., SBJ) is too long (>18) 2 ?5 Between two moderate-length/long phrases (both ?15; or L p?17, R p=10-14; Or L p=10-14, R p>20) 39 ?11 Long pre-L p (SBJ /ADV, etc.",
        ">16) + short L p (?5) + long R p (?18) 2 (?3 Moderate-length phrase (>10), but connected with familiar CC or ADVP) (6) ?6 Three or more consecutive short/moderate-length phrases (both<15, at least one<8) 5 21 Between short phrases (both ?c13w5), and pre-L p (SBJ/ADV, etc.)",
        "is short/moderate-length (<11) 13 27 Coordinate VPs, and L VP is a moderate-length VP (PP-MNR VP) 4 29 Phrasal coordination between a long (?18) and a short (<10) phrase 3 210 Moderate-length coordinate VPs (>10<15), and R VP has the structure like VP (MSP VP) 1 212 Between two short/moderate-length NP phrases (both ?15, e.g., L NP-TPC+R NP-SBJ) 1 ?1 Moderate-length/short phrase ((i) c:one>10<18, The other >5?10, w:one?5, the other>5?10; (ii) c:both?10<15, 13 w:both>5?7), and pre-L p (SBJ/ADV, etc.)",
        "is short (?5) ?",
        "L x/R x: the left/right segment of a target comma which is x.",
        "(x can be ?p?",
        "(phrase) / ?c?",
        "(clause), syntactic tags (with function tags) such as ?VP?",
        "and ?IP-SBJ?, or general functions such as ?Subject?",
        "and ?Predicate?.)",
        "?",
        "Org Len: the number of characters in a segment (including other commas or punctuation inside).",
        "?",
        "In Seg Len/Ttl Len: the number of characters between the comma and nearest punctuation (inside a long/outside a short target segment).",
        "?",
        "SPO: subject + predicate + object, belonging to the outermost sentence.",
        "The length is defined in the similar way as In Seg Len.",
        "?",
        "MSPO: modifier + subject + predicate + object.",
        "The length is defined in the similar way as In Seg Len.",
        "?",
        "-XX or -XXX: arbitrary type of possible functional tag (or without any functional tag) connected with the former syntactic tag.",
        "?",
        "?ciwj: #characters?i and #words?j.",
        "?",
        "In some cases (in Case 3, 4 and 5), the length is calculated after negative (or judged negative) commas are eliminated.",
        "?",
        "The rules related with TMP are applied faster than ones related with LCP (in Case 3).",
        "?",
        "?3 appears in both Case 4 (clause) and Case 5 (phrase).",
        "The number of commas is given by the sum of those in both cases.",
        "Our rule-based filter was applied to the commas of each article9, and the commas were classified",
        "into two distributions: a positive one (positive + semi-positive commas) and a negative one (negative + semi-negative commas).",
        "Two types of materials were thus generated by leaving the commas in one distribution and removing the others.",
        "manually checked and corrected.",
        "The apparatus and procedure were almost the same as those in Section 5.1, whereas, on the basis of the feedback from the previous experiments, the font size, number of characters in a line, and line spacing were fixed to single optimized values, respectively, 14-point Fang-Song font occupying 15?16 pixels, 33 characters and 7 pixels."
      ]
    },
    {
      "heading": "6.2 Evaluation Metrics",
      "text": [
        "We examined whether our positive/negative distributions really facilitated/obstructed the subjects?",
        "reading process by using the following metrics:",
        "where TT, FT, RT and CN are total viewing time, fixation time, number of regressions, and number of commas respectively, as described in Section 5.2.",
        "FFT and SLO are additionally introduced metrics respectively for the ?total duration for all first-pass fixations in a target region that exclude any regressions?",
        "and for the ?length of saccades from inside a target region to the outside?13.",
        "All of the areas around commas appearing in the original article were considered target areas for the metrics.",
        "The other settings were the same as in Section 5."
      ]
    },
    {
      "heading": "6.3 Contribution of Categorized Commas",
      "text": [
        "Figure 10, 11, 12, 13 and 14 respectively show TT, EMFFT , EMFT , EMRT and EMSLO for two types of comma distributions in each trial.",
        "For TT, we cannot see any general trend, mainly because this time, the reading order of the text was random, which spread out the second reading effect evenly between the two distributions.",
        "For EMFFT , we cannot reach a conclusion either.",
        "In contrast, in more than half of the trials, EMFFT was larger for positive distributions, which would imply that the positive commas helped to prevent the reader's gaze from revisiting the target regions.",
        "For most trials, except for subject S whose calibration was poor and reading process was poor in M56, EMFT and EMRT decreased and EMSLO increased for positive distributions, which implies that the positive commas smoothed the reading process around the target regions."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "We proposed an approach for modeling comma placement in Chinese text for smoothing reading.",
        "In our approach, commas are added to the text on the basis of a CRF model-based comma predictor trained on the treebank, and a rule-based filter then classifies the commas into ones facilitating or obstructing reading.",
        "The experimental results on each part of this approach were encouraging.",
        "In our future work, we would like see how commas affect reading by using much more material, and thereby refine our framework in order to bring a better reading experience to readers."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This research was partially supported by Kakenhi, MEXT Japan [23650076] and JST PRESTO."
      ]
    }
  ]
}
