{
  "info": {
    "authors": [
      "Isao Goto",
      "Masao Utiyama",
      "Eiichiro Sumita",
      "Akihiro Tamura",
      "Sadao Kurohashi"
    ],
    "book": "ACL",
    "id": "acl-P13-1016",
    "title": "Distortion Model Considering Rich Context for Statistical Machine Translation",
    "url": "https://aclweb.org/anthology/P13-1016",
    "year": 2013
  },
  "references": [
    "acl-C04-1030",
    "acl-C04-1073",
    "acl-C10-2033",
    "acl-D08-1089",
    "acl-J07-2003",
    "acl-J96-1002",
    "acl-J97-3002",
    "acl-N04-1035",
    "acl-N04-4026",
    "acl-N10-1129",
    "acl-P01-1067",
    "acl-P02-1040",
    "acl-P03-1021",
    "acl-P06-1067",
    "acl-P06-1077",
    "acl-P07-2045",
    "acl-P09-2061",
    "acl-P12-1095",
    "acl-W04-3250",
    "acl-W08-0401"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper proposes new distortion models for phrase-based SMT.",
        "In decoding, a distortion model estimates the source word position to be translated next (NP) given the last translated source word position (CP).",
        "We propose a distortion model that can consider the word at the CP, a word at an NP candidate, and the context of the CP and the NP candidate simultaneously.",
        "Moreover, we propose a further improved model that considers richer context by discriminating label sequences that specify spans from the CP to NP candidates.",
        "It enables our model to learn the effect of relative word order among NP candidates as well as to learn the effect of distances from the training data.",
        "In our experiments, our model improved 2.9 BLEU points for Japanese-English and 2.6 BLEU points for Chinese-English translation compared to the lexical reordering models."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Estimating appropriate word order in a target language is one of the most difficult problems for statistical machine translation (SMT).",
        "This is particularly true when translating between languages with widely different word orders.",
        "To address this problem, there has been a lot of research done into word reordering: lexical reordering model (Tillman, 2004), which is one of the distortion models, reordering constraint (Zens et al., 2004), pre-ordering (Xia and Mc-Cord, 2004), hierarchical phrase-based SMT (Chiang, 2007), and syntax-based SMT (Yamada and Knight, 2001).",
        "In general, source language syntax is useful for handling long distance word reordering.",
        "However, obtaining syntax requires a syntactic parser, which is not available for many languages.",
        "Phrase-based SMT (Koehn et al., 2007) is a widely used SMT method that does not use a parser.",
        "Phrase-based SMT mainly1 estimates word reordering using distortion models2.",
        "Therefore, distortion models are one of the most important components for phrase-based SMT.",
        "On the other hand, there are methods other than distortion models for improving word reordering for phrase-based SMT, such as pre-ordering or reordering constraints.",
        "However, these methods also use distortion models when translating by phrase-based SMT.",
        "Therefore, distortion models do not compete against these methods and are commonly used with them.",
        "If there is a good distortion model, it will improve the translation quality of phrase-based SMT and benefit to the methods using distortion models.",
        "In this paper, we propose two distortion models for phrase-based SMT.",
        "In decoding, a distortion model estimates the source word position to be translated next (NP) given the last translated source word position (CP).",
        "The proposed models are the pair model and the sequence model.",
        "The pair model utilizes the word at the CP, a word at an NP candidate site, and the words surrounding the CP and the NP candidates (context) simultaneously.",
        "In addition, the sequence model, which is the further improved model, considers richer context by identifying the label sequence that specify the span from the CP to the NP.",
        "It enables our model to learn the effect of relative word order among NP candidates as well as to learn the effect of distances from the training data.",
        "Our model learns the preference relations among NP",
        "which are intended to estimate the source word position to be translated next in decoding, are called distortion models.",
        "This estimation is used to produce a hypothesis in the target language word order sequentially from left to right.",
        "kinou kare wa pari de hon wo katta he bought books in Paris yesterday",
        "and arrows indicate the translation order of the phrases.",
        "candidates.",
        "Our model consists of one probabilistic model and does not require a parser.",
        "Experiments confirmed the effectiveness of our method for Japanese-English and Chinese-English translation, using NTCIR-9 Patent Machine Translation Task data sets (Goto et al., 2011)."
      ]
    },
    {
      "heading": "2 Distortion Model for Phrase-Based SMT",
      "text": [
        "A Moses-style phrase-based SMT generates target hypotheses sequentially from left to right.",
        "Therefore, the role of the distortion model is to estimate the source phrase position to be translated next whose target side phrase will be located immediately to the right of the already generated hypotheses.",
        "An example is shown in Figure 1.",
        "In Figure 1, we assume that only the kare wa (English side: ?he?)",
        "has been translated.",
        "The target word to be generated next will be ?bought?",
        "and the source word to be selected next will be its corresponding Japanese word katta.",
        "Thus, a distortion model should estimate phrases including katta as a source phrase position to be translated next.",
        "To explain the distortion model task in more detail, we need to redefine more precisely two terms, the current position (CP) and next position (NP) in the source sentence.",
        "CP is the source sentence position corresponding to the rightmost aligned target word in the generated target word sequence.",
        "NP is the source sentence position corresponding to the leftmost aligned target word in the target phrase to be generated next.",
        "The task of the distortion model is to estimate the NP3 from NP candidates (NPCs) for each CP in the source sentence.4",
        "methods, CP is the rightmost position of the last translated source phrase and NP is the leftmost position of the source phrase to be translated next.",
        "Note that existing methods do",
        "source sentence and the sentence underneath is a target hypothesis for each example.",
        "The NP is in bold, and the CP is in bold italics.",
        "The point of an arrow with a ?",
        "mark indicates a wrong NP candidate.",
        "Estimating NP is a difficult task.",
        "Figure 2 shows some examples.",
        "The superscript numbers indicate the word position in the source sentence.",
        "In Figure 2 (a), the NP is 8.",
        "However, in Figure 2 (b), the word (kare) at the CP is the same as (a), but the NP is different (the NP is 10).",
        "From these examples, we see that distance is not the essential factor in deciding an NP.",
        "And it also turns out that the word at the CP alone is not enough to estimate the NP.",
        "Thus, not only the word at the CP but also the word at a NP candidate (NPC) should be considered simultaneously.",
        "In (c) and (d) in Figure 2, the word (kare) at the CP is the same and karita (borrowed) and katta (bought) are at the NPCs.",
        "Karita is the word at the NP and katta is not the word at the NP for (c), while katta is the word at the NP and karita is not the word at the NP for (d).",
        "From these examples, considering what the word is at the NP not consider word-level correspondences.",
        "is not enough to estimate the NP.",
        "One of the reasons for this difference is the relative word order between words.",
        "Thus, considering relative word order is important.",
        "In (d) and (e) in Figure 2, the word (kare) at the CP and the word order between katta and karita are the same.",
        "However, the word at the NP for (d) and the word at the NP for (e) are different.",
        "From these examples, we can see that selecting a nearby word is not always correct.",
        "The difference is caused by the words surrounding the NPCs (context), the CP context, and the words between the CP and the NPC.",
        "Thus, these should be considered when estimating the NP.",
        "In summary, in order to estimate the NP, the following should be considered simultaneously: the word at the NP, the word at the CP, the relative word order among the NPCs, the words surrounding NP and CP (context), and the words between the CP and the NPC.",
        "There are distortion models that do not require a parser for phrase-based SMT.",
        "The linear distortion cost model used in Moses (Koehn et al., 2007), whose costs are linearly proportional to the reordering distance, always gives a high cost to long distance reordering, even if the reordering is correct.",
        "The MSD lexical reordering model (Tillman, 2004; Koehn et al., 2005; Galley and Manning, 2008) only calculates probabilities for the three kinds of phrase reorderings (monotone, swap, and discontinuous), and does not consider relative word order or words between the CP and the NPC.",
        "Thus, these models are not sufficient for long distance word reordering.",
        "Al-Onaizan and Papineni (2006) proposed a distortion model that used the word at the CP and the word at an NPC.",
        "However, their model did not use context, relative word order, or words between the CP and the NPC.",
        "Ni et al. (2009) proposed a method that adjusts the linear distortion cost using the word at the CP and its context.",
        "Their model does not simultaneously consider both the word specified at the CP and the word specified at the NPCs.",
        "Green et al. (2010) proposed distortion models that used context.",
        "Their model (the outbound model) estimates how far the NP should be from the CP using the word at the CP and its con",
        "sider both the word specified at the CP and the word specified at an NPC.",
        "For example, the outbound model considers the word specified at the CP, but does not consider the word specified at an NPC.",
        "Their models also do not consider relative word order.",
        "In contrast, our distortion model solves the aforementioned problems.",
        "Our distortion models utilize the word specified at the CP, the word specified at an NPC, and also the context of the CP and the NPC simultaneously.",
        "Furthermore, our sequence model considers richer context including the relative word order among NPCs and also including all the words between the CP and the NPC.",
        "In addition, unlike previous methods, our models learn the preference relations among NPCs."
      ]
    },
    {
      "heading": "3 Proposed Method",
      "text": [
        "In this section, we first define our distortion model and explain our learning strategy.",
        "Then, we describe two proposed models: the pair model and the sequence model that is the further improved model."
      ]
    },
    {
      "heading": "3.1 Distortion Model and Learning Strategy",
      "text": [
        "First, we define our distortion model.",
        "Let i be a CP, j be an NPC, S be a source sentence, andX be the random variable of the NP.",
        "In this paper, distortion probability is defined as P (X = j|i, S), which is the probability of an NPC j being the NP.",
        "Our distortion model is defined as the model calculating the distortion probability.",
        "Next, we explain the learning strategy for our distortion model.",
        "We train this model as a discriminative model that discriminates the NP from NPCs.",
        "Let J be a set of word positions in S other than i.",
        "We train the distortion model subject to",
        "The model parameters are learned to maximize the distortion probability of the NP among all of the NPCs J in each source sentence.",
        "This learning strategy is a kind of preference relation learning (Evgniou and Pontil, 2002).",
        "In this learning, the that estimates reverse direction distance.",
        "Each NPC is regarded as an NP, and the inbound model estimates how far the corresponding CP should be from the NP using the word at the NP and its context.",
        "distortion probability of the actual NP will be relatively higher than those of all the other NPCs J .",
        "This learning strategy is different from that of (Al-Onaizan and Papineni, 2006; Green et al., 2010).",
        "For example, Green et al. (2010) trained their outbound model subject to ?c?C P (Y = c|i, S) = 1, where C is the set of the nine distortion classes6 and Y is the random variable of the correct distortion class that the correct distortion is classified into.",
        "Distortion is defined as j ?",
        "i ?",
        "1.",
        "Namely, the model probabilities that they learned were the probabilities of distortion classes in all of the training data, not the relative preferences among the NPCs in each source sentence."
      ]
    },
    {
      "heading": "3.2 Pair Model",
      "text": [
        "The pair model utilizes the word at the CP, the word at an NPC, and the context of the CP and the NPC simultaneously to estimate the NP.",
        "This can be done by our distortion model definition and the learning strategy described in the previous section.",
        "In this work, we use the maximum entropy method (Berger et al., 1996) as a discriminative machine learning method.",
        "The reason for this is that a model based on the maximum entropy method can calculate probabilities.",
        "However, if we use scores as an approximation of the distortion probabilities, various discriminative machine learning methods can be applied to build the distortion model.",
        "Let s be a source word and sn1 = s1s2...sn be a source sentence.",
        "We add a beginning of sentence (BOS) marker to the head of the source sentence and an end of sentence (EOS) marker to the end, so the source sentence S is expressed as sn+10 (s0 = BOS, sn+1 = EOS).",
        "Our distortion model calculates the distortion probability for an NPC",
        "6(?",
        "?,?8], [?7,?5], [?4,?3], ?2, 0, 1, [2, 3], [4, 6], and [7,?).",
        "In (Green et al., 2010), ?1 was used as one of distortion classes.",
        "However, ?1 represents the CP in our definition, and CP is not an NPC.",
        "Thus, we shifted all of the distortion classes for negative distortions by ?1.",
        "Template ?o?, ?o, sp?1, ?o, ti?, ?o, tj?, ?o, d?, ?o, sp, sq?2, ?o, ti, tj?, ?o, ti?1, ti, tj?, ?o, ti, ti+1, tj?, ?o, ti, tj?1, tj?, ?o, ti, tj , tj+1?, ?o, si, ti, tj?,",
        "w is a weight parameter vector, each element of f(?)",
        "is a binary feature function, and Zi =?",
        "j?",
        "{j|1?j?n+1 ?",
        "j ?=i}(numerator of Equation 1) is a normalization factor.",
        "o is an orientation of i to j and d is a distance class.",
        "The binary feature function that constitutes an element of f(?)",
        "returns 1 when its feature is matched and if else, returns 0.",
        "Table 1 shows the feature templates used to produce the features.",
        "A feature is an instance of a feature template.",
        "In Equation 1, i, j, and S are used by the feature functions.",
        "Thus, Equation 1 can utilize features consisting of both si, which is the word specified at i, and sj , which is the word specified at j, or both the context of i and the context of j simultaneously.",
        "Distance is considered using the distance class d. Distortion is represented by distance and orientation.",
        "The pair model considers distortion using six joint classes of d and o."
      ]
    },
    {
      "heading": "3.3 Sequence Model",
      "text": [
        "The pair model does not consider relative word order among NPCs or all the words between the CP and an NPC.",
        "In this section, we propose a further improved model, the sequence model, which considers richer context including relative word order among NPCs and also including all the words between the CP and an NPC.",
        "In (c) and (d) in Figure 2, karita (borrowed) and katta (bought) occur in the source sentences.",
        "The pair model considers the effect of distances using only the distance class d. If these positions are in the same distance class, the pair model cannot consider the differences in distances.",
        "In this case, these are conflict instances during training and it is difficult to distinguish the NP for translation.",
        "Now to explain how to consider the relative word order by the sequence model.",
        "The sequence model considers the relative word order by discriminating the label sequence corresponding to the NP from the label sequences corresponding to"
      ]
    },
    {
      "heading": "Label Description",
      "text": [
        "C A position is the CP.",
        "I A position is a position between the CP and the NPC.",
        "N A position is the NPC.",
        "are the label sequences.",
        "each NPC in each sentence.",
        "Each label sequence corresponds to one NPC.",
        "Therefore, if we identify the label sequence that corresponds to the NP, we can obtain the NP.",
        "The label sequences specify the spans from the CP to each NPC using three kinds of labels indicating the type of word positions in the spans.",
        "The three kinds of labels, ?C, I, and N,?",
        "are shown in Table 2.",
        "Figure 3 shows examples of the label sequences for the case of Figure 2 (c).",
        "In Figure 3, the label sequences are represented by boxes and the elements of the sequences are labels.",
        "The NPC is used as the label sequence ID for each label sequence.",
        "The label sequence can treat relative word order.",
        "For example, the label sequence ID of 10 in Figure 3 knows that karita exists to the left of the NPC of 10.",
        "This is because karita6 carries a label I while katta10 carries a label N, and a position with label I is defined as relatively closer to the CP than a position with label N. By utilizing the label sequence and corresponding words, the model can reflect the effect of karita existing between the CP and the NPC of 10 on the probability.",
        "For the sequence model, karita (borrowed) and katta (bought) in (c) and (d) in Figure 2 are not conflict instances in training, whereas they are conflict instances in training for the pair model.",
        "The reason is as follows.",
        "In order to make the probability of the NPC of 10 smaller than the NPC of 6, instead of making the weight parameters for the features with respect to the word at the position of 10 with label N smaller than the weight parameters for the features with respect to the word at the position of 6 with label N, the sequence model can give negative weight parameters for the features with respect to the word at the position of 6 with label I.",
        "We use a sequence discrimination technique based on CRF (Lafferty et al., 2001) to identify the label sequence that corresponds to the NP.",
        "There are two differences between our task and the CRF task.",
        "One difference is that CRF discriminates label sequences that consist of labels from all of the label candidates, whereas we constrain the label sequences to sequences where the label at the CP is C, the label at an NPC is N, and the labels between the CP and the NPC are I.",
        "The other difference is that CRF is designed for discriminating label sequences corresponding to the same object sequence, whereas we do not assign labels to words outside the spans from the CP to each NPC.",
        "However, when we assume that another label such as E has been assigned to the words outside the spans and there are no features involving label E, CRF with our label constraints can be applied to our task.",
        "In this paper, the method designed to discriminate label sequences corresponding to the different word sequence lengths is called partial CRF.",
        "The sequence model based on partial CRF is derived by extending the pair model.",
        "We introduce the label l and extend the pair model to discriminating the label sequences.",
        "There are two extensions to the pair model.",
        "One extension uses labels.",
        "We suppose that label sequences specify the spans from the CP to each NPC.",
        "We conjoined all the feature templates in Table 1 with an additional feature template ?li, lj?",
        "to include the labels into features where li is the label corresponding to the position of i.",
        "The other extension uses sequence.",
        "In the pair model, the position pair of (i, j) is used to derive features.",
        "In contrast, to descriminate label sequences in the sequence model, the position pairs of (i, k), k ?",
        "{k|i < k ?",
        "j ?",
        "j ?",
        "k < i}",
        "and (k, j), k ?",
        "{k|i ?",
        "k < j ?",
        "j < k ?",
        "i} are used to derive features.",
        "Note that in the feature templates in Table 1, i and j are used to specify two positions.",
        "When features are used for the sequence model, one of the positions is regarded as k. The distortion probability for an NPC j being the NP given a CP i and a source sentence S is calculated as:",
        "Equation 2) is a normalization factor.",
        "Since j is used as the label sequence ID, discriminating j also means discriminating label sequence IDs.",
        "The first term in exp(?)",
        "in Equation 2 considers all of the word pairs located at i and other positions in the sequence, and also their context.",
        "The second term in exp(?)",
        "in Equation 2 considers all of the word pairs located at j and other positions in the sequence, and also their context.",
        "By designing our model to discriminate among different length label sequences, our model can naturally handle the effect of distances.",
        "Many features are derived from a long label sequence because it will contain many labels between the CP and the NPC.",
        "On the other hand, fewer features are derived from a short label sequence because a short label sequence will contain fewer labels between the CP and the NPC.",
        "The bias from these differences provides important clues for learning the effect of distances.7 7Note that the sequence model does not only consider larger context than the pair model, but that it also considers labels.",
        "The pair model does not discriminate labels, whereas the sequence model uses label N and label I for the positions except for the CP, depending on each situation.",
        "For example, in Figure 3, at position 6, label N is used in the label sequence ID of 6, but label I is used in the label sequence IDs of 7 to 11.",
        "Namely, even if they are at the same position, the labels in the label sequences are different.",
        "The sequence model discriminates the label differences.",
        "BOS kare wa pari de hon wo katta EOS BOS he bought books in Paris EOS",
        "The lines represent word alignments.",
        "The English side arrows point to the nearest word aligned on the right."
      ]
    },
    {
      "heading": "3.4 Training Data for Discriminative Distortion Model",
      "text": [
        "To train our discriminative distortion model, supervised training data is needed.",
        "The training data is built from a parallel corpus and word alignments between corresponding source words and target words.",
        "Figure 4 shows examples of training data.",
        "We select the target words aligned to the source words sequentially from left to right (target side arrows).",
        "Then, the order of the source words in the target word order is decided (source side arrows).",
        "The source sentence and the source side arrows are the training data."
      ]
    },
    {
      "heading": "4 Experiment",
      "text": [
        "In order to confirm the effects of our distortion model, we conducted a series of Japanese to English (JE) and Chinese to English (CE) translation experiments.8"
      ]
    },
    {
      "heading": "4.1 Common Settings",
      "text": [
        "We used the patent data for the Japanese to English and Chinese to English translation subtasks from the NTCIR-9 Patent Machine Translation Task (Goto et al., 2011).",
        "There were 2,000 sentences for the test data and 2,000 sentences for the development data.",
        "Mecab9 was used for the Japanese morphological analysis.",
        "The Stanford segmenter10 and tag-ger11 were used for Chinese segmentation and POS tagging.",
        "The translation model was trained using sentences of 40 words or less from the training data.",
        "So approximately 2.05 million sentence pairs consisting of approximately 54 million 8We conducted JE and CE translation as examples of language pairs with different word orders and of languages where there is a great need for translation into English.",
        "Japanese tokens whose lexicon size was 134k and 50 million English tokens whose lexicon size was 213k were used for JE.",
        "And approximately 0.49 million sentence pairs consisting of 14.9 million Chinese tokens whose lexicon size was 169k and 16.3 million English tokens whose lexicon size was 240k were used for CE.",
        "GIZA++ and grow-diag-final-and heuristics were used to obtain word alignments.",
        "In order to reduce word alignment errors, we removed articles {a, an, the} in English and particles {ga, wo, wa} in Japanese before performing word alignments because these function words do not correspond to any words in the other languages.",
        "After word alignment, we restored the removed words and shifted the word alignment positions to the original word positions.",
        "We used 5 gram language models that were trained using the English side of each set of bilingual training data.",
        "We used an in-house standard phrase-based SMT system compatible with the Moses decoder (Koehn et al., 2007).",
        "The SMT weighting parameters were tuned by MERT (Och, 2003) using the development data.",
        "To stabilize the MERT results, we tuned three times by MERT using the first half of the development data and we selected the SMT weighting parameter set that performed the best on the second half of the development data based on the BLEU scores from the three SMT weighting parameter sets.",
        "We compared systems that used a common SMT feature set from standard SMT features and different distortion model features.",
        "The common SMT feature set consists of: four translation model features, phrase penalty, word penalty, and a language model feature.",
        "The compared different distortion model features are: the linear distortion cost model feature (LINEAR), the linear distortion cost model feature and the six MSD bidirectional lexical distortion model (Koehn et al., 2005) features (LINEAR+LEX), the outbound and inbound distortion model features discriminating nine distortion classes (Green et al., 2010) (9-CLASS), the proposed pair model feature (PAIR), and the proposed sequence model feature (SEQUENCE)."
      ]
    },
    {
      "heading": "4.2 Training for the Proposed Models",
      "text": [
        "Our distortion model was trained as follows: We used 0.2 million sentence pairs and their word alignments from the data used to build the translation model as the training data for our distortion models.",
        "The features that were selected and used were the ones that had been counted12, using the feature templates in Table 1, at least four times for all of the (i, j) position pairs in the training sentences.",
        "We conjoined the features with three types of label pairs ?C, I?, ?I,N?, or ?C,N?",
        "as instances of the feature template ?li, lj?",
        "to produce features for SEQUENCE.",
        "The L-BFGS method (Liu and Nocedal, 1989) was used to estimate the weight parameters of maximum entropy models.",
        "The Gaussian prior (Chen and Rosenfeld, 1999) was used for smoothing."
      ]
    },
    {
      "heading": "4.3 Training for the Compared Models",
      "text": [
        "For 9-CLASS, we used the same training data as for our distortion models.",
        "Let ti be the part of speech of si.",
        "We used the following feature templates to produce features for the outbound model: ?si?2?, ?si?1?, ?si?, ?si+1?, ?si+2?, ?ti?, ?ti?1, ti?, ?ti, ti+1?, and ?si, ti?.",
        "These feature templates correspond to the components of the feature templates of our distortion models.",
        "In addition to these features, we used a feature consisting of the relative source sentence position as the feature used by (Green et al., 2010).",
        "The relative source sentence position is discretized into five bins, one for each quintile of the sentence.",
        "For the inbound model13, i of the feature templates was changed to j.",
        "Features occurring four or more times in the training sentences were used.",
        "The maximum entropy method with Gaussian prior smoothing was used to estimate the model parameters.",
        "The MSD bidirectional lexical distortion model was built using all of the data used to build the translation model."
      ]
    },
    {
      "heading": "4.4 Results and Discussion",
      "text": [
        "We evaluated translation quality based on the case-insensitive automatic evaluation score BLEU-4 (Papineni et al., 2002).",
        "We used distortion limits of 10, 20, 30, and unlimited (?",
        "), which limited the number of words for word reordering to a maximum number.",
        "Table 3 presents our main results.",
        "The proposed SEQUENCE outperformed the baselines for both Japanese to English and Chinese to English translation.",
        "This demonstrates the effectiveness of the proposed SEQUENCE.",
        "The scores of the proposed SEQUENCE were higher than those 12When we counted features for selection, we only counted features that were from the feature templates of ?si, sj?, ?ti, tj?, ?si, ti, tj?, and ?sj , ti, tj?",
        "in Table 1 when j was not the NP, in order to avoid increasing the number of features.",
        "13The inbound model is explained in footnote 5.",
        "based SMT.",
        "of the proposed PAIR.",
        "This confirms the effectiveness for considering relative word order and words between the CP and an NPC.",
        "The proposed PAIR outperformed 9-CLASS, confirming that considering both the word specified at the CP and the word specified at the NPC simultaneously was more effective than that of 9-CLASS.",
        "For translating between languages with widely different word orders such as Japanese and English, a small distortion limit is undesirable because there are cases where correct translations cannot be produced with a small distortion limit, since the distortion limit prunes the search space that does not meet the constraint.",
        "Therefore, a large distortion limit is required to translate correctly.",
        "For JE translation, our SEQUENCE achieved significantly better results at distortion limits of 20 and 30 than that at a distortion limit of 10, while the baseline systems of LINEAR, LINEAR+LEX, and 9-CLASS did not achieve this.",
        "This indicate that SEQUENCE could treat long distance reordering candidates more appropriately than the compared methods.",
        "We also tested hierarchical phrase-based SMT (Chiang, 2007) (HIER) using the Moses implementation.",
        "The common data was used to train HIER.",
        "We used unlimited max-chart-span for the system setting.",
        "Results are given in Table 4.",
        "Our SEQUENCE outperformed HIER.",
        "The gain for JE was large but the gain for CE was modest.",
        "Since phrase-based SMT is generally faster in decoding speed than hierarchical phrase-based SMT, achieving better or comparable scores is worth",
        "for Japanese-English translation.",
        "while.",
        "To investigate the tolerance for sparsity of the training data, we reduced the training data for the sequence model to 20,000 sentences for JE translation.14 SEQUENCE using this model with a distortion limit of 30 achieved a BLEU score of 32.22.15 Although the score is lower than the score of SEQUENCE with a distortion limit of 30 in Table 3, the score was still higher than those of LINEAR, LINEAR+LEX, and 9-CLASS for JE in Table 3.",
        "This indicates that the sequence model also works even when the training data is not large.",
        "This is because the sequence model considers not only the word at the CP and the word at an NPC but also rich context, and rich context would be effective even for a smaller set of training data.",
        "14We did not conduct experiments using larger training data because there would have been a very high computational cost to build models using the L-BFGS method.",
        "15To avoid effects from differences in the SMT weighting parameters, we used the same SMT weighting parameters for SEQUENCE, with a distortion limit of 30, in Table 3.",
        "To investigate how well SEQUENCE learns the effect of distance, we checked the average distortion probabilities for large distortions of j ?",
        "i?",
        "1.",
        "Figure 5 shows three kinds of probabilities for distortions from 3 to 20 for Japanese-English translation.",
        "One is the average distortion probabilities in the Japanese test sentences for each distortion for SEQUENCE, and another is this for PAIR.",
        "The third (CORPUS) is the probabilities for the actual distortions in the training data that were obtained from the word alignments used to build the translation model.",
        "The probability for a distortion for CORPUS was calculated by the number of the distortion divided by the total number of distortions in the training data.",
        "Figure 5 shows that when a distance class feature used in the model was the same (e.g., distortions from 5 to 20 were the same distance class feature), PAIR produced average distortion probabilities that were almost the same.",
        "In contrast, the average distortion probabilities for SEQUENCE decreased when the lengths of the distortions increased, even if the distance class feature was the same, and this behavior was the same as that of CORPUS.",
        "This confirms that the proposed SEQUENCE could learn the effect of distances appropriately from the training data.16"
      ]
    },
    {
      "heading": "5 Related Works",
      "text": [
        "We discuss related works other than discussed in Section 2.",
        "Xiong et al. (2012) proposed a model predicting the orientation of an argument with respect to its verb using a parser.",
        "Syntactic structures and predicate-argument structures are useful for reordering.",
        "However, orientations do not handle distances.",
        "Thus, our distortion model does not compete against the methods predicting orientations using a parser and would assist them if used 16We also checked the average distortion probabilities for the 9-CLASS outbound model in the Japanese test sentences for Japanese-English translation.",
        "We averaged the average probabilities for distortions in a distortion span of [4, 6] and also averaged those in a distortion span of [7, 20], where the distortions in each span are in the same distortion class.",
        "The average probability for [4, 6] was 0.058 and that for [7, 20] was 0.165.",
        "From CORPUS, the average probabilities in the training data for each distortion in [4, 6] were higher than those for each distortion in [7, 20].",
        "However, the converse was true for the comparison between the two average probabilities for the outbound model.",
        "This is because the sum of probabilities for distortions from 7 and above was larger than the sum of probabilities for distortions from 4 to 6 in the training data.",
        "This comparison indicates that the 9-CLASS outbound model could not appropriately learn the effects of large distances for JE translation.",
        "together.",
        "There are word reordering constraint methods using ITG (Wu, 1997) for phrase-based SMT (Zens et al., 2004; Yamamoto et al., 2008; Feng et al., 2010).",
        "These methods consider sentence level consistency with respect to ITG.",
        "The ITG constraint does not consider distances of reordering and was used with other distortion models.",
        "Our distortion model does not consider sentence level consistency, so our distortion model and ITG constraint methods are thought to be complementary.",
        "There are tree-based SMT methods (Chiang, 2007; Galley et al., 2004; Liu et al., 2006).",
        "In many cases, tree-based SMT methods do not use the distortion models that consider reordering distance apart from translation rules because it is not trivial to use distortion scores considering the distances for decoders that do not generate hypotheses from left to right.",
        "If it could be applied to these methods, our distortion model might contribute to tree-based SMT methods.",
        "Investigating the effects will be for future work."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "This paper described our distortion models for phrase-based SMT.",
        "Our sequence model simply consists of only one probabilistic model, but it can consider rich context.",
        "Experiments indicate that our models achieved better performance and the sequence model could learn the effect of distances appropriately.",
        "Since our models do not require a parser, they can be applied to many languages.",
        "Future work includes application to other language pairs, incorporation into ITG constraint methods and other reordering methods, and application to tree-based SMT methods."
      ]
    }
  ]
}
