{
  "info": {
    "authors": [
      "Yoav Artzi",
      "Nicholas FitzGerald",
      "Luke Zettlemoyer"
    ],
    "book": "ACL",
    "id": "acl-P13-5002",
    "title": "Semantic Parsing with Combinatory Categorial Grammars",
    "url": "https://aclweb.org/anthology/P13-5002",
    "year": 2013
  },
  "references": [],
  "sections": [
    {
      "heading": "1 Abstract",
      "text": [
        "Semantic parsers map natural language sentences to formal representations of their underlying meaning.",
        "Building accurate semantic parsers without prohibitive engineering costs is a long-standing, open research problem.",
        "The tutorial will describe general principles for building semantic parsers.",
        "The presentation will be divided into two main parts: modeling and learning.",
        "The modeling section will include best practices for grammar design and choice of semantic representation.",
        "The discussion will be guided by examples from several domains.",
        "To illustrate the choices to be made and show how they can be approached within a real-life representation language, we will use ?-calculus meaning representations.",
        "In the learning part, we will describe a unified approach for learning Combinatory Categorial Grammar (CCG) semantic parsers, that induces both a CCG lexicon and the parameters of a parsing model.",
        "The approach learns from data with labeled meaning representations, as well as from more easily gathered weak supervision.",
        "It also enables grounded learning where the semantic parser is used in an interactive environment, for example to read and execute instructions.",
        "The ideas we will discuss are widely applicable.",
        "The semantic modeling approach, while implemented in ?-calculus, could be applied to many other formal languages.",
        "Similarly, the algorithms for inducing CCGs focus on tasks that are formalism independent, learning the meaning of words and estimating parsing parameters.",
        "No prior knowledge of CCGs is required.",
        "The tutorial will be backed by implementation and experiments in the University of Washington Semantic"
      ]
    },
    {
      "heading": "2 Outline",
      "text": [
        "1.",
        "Introduction to CCGs 2.",
        "Modeling (a) Questions for database queries (b) Plurality and determiner resolution in grounded applications (c) Event semantics and imperatives in instructional language 3.",
        "Learning (a) A unified learning algorithm (b) Learning with supervised data i. Lexical induction with templates ii.",
        "Unification-based learning (c) Weakly supervised learning without labeled meaning representations"
      ]
    },
    {
      "heading": "3 Instructors",
      "text": [
        "Yoav Artzi is a Ph.D. candidate in the Computer Science & Engineering department at the University of Washington.",
        "His research studies the acquisition of grounded natural language understanding within interactive systems.",
        "His work focuses on modeling semantic representations and designing weakly supervised learning algorithms.",
        "He is a recipient of the 2012 Yahoo KSC award.",
        "Nicholas FitzGerald is a Ph.D. student at the University of Washington.",
        "His research interests are grounded natural language understanding and generation.",
        "He is a recipient of an Intel Science"
      ]
    }
  ]
}
