{
  "info": {
    "authors": [
      "Tsutomu Hirao",
      "Yasuhisa Yoshida",
      "Masaaki Nishino",
      "Norihito Yasuda",
      "Masaaki Nagata"
    ],
    "book": "EMNLP",
    "id": "acl-D13-1158",
    "title": "Single-Document Summarization as a Tree Knapsack Problem",
    "url": "https://aclweb.org/anthology/D13-1158",
    "year": 2013
  },
  "references": [
    "acl-C04-1057",
    "acl-E09-1089",
    "acl-P02-1057",
    "acl-P09-1075",
    "acl-W01-1605",
    "acl-W04-1013",
    "acl-W08-1105",
    "acl-W98-1124"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Recent studies on extractive text summarization formulate it as a combinatorial optimization problem such as a Knapsack Problem, a Maximum Coverage Problem or a Budgeted Median Problem.",
        "These methods successfully improved summarization quality, but they did not consider the rhetorical relations between the textual units of a source document.",
        "Thus, summaries generated by these methods may lack logical coherence.",
        "This paper proposes a single document summarization method based on the trimming of a discourse tree.",
        "This is a twofold process.",
        "First, we propose rules for transforming a rhetorical structure theory-based discourse tree into a dependency-based discourse tree, which allows us to take a tree-trimming approach to summarization.",
        "Second, we formulate the problem of trimming a dependency-based discourse tree as a Tree Knapsack Problem, then solve it with integer linear programming (ILP).",
        "Evaluation results showed that our method improved ROUGE scores."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "State-of-the-art extractive text summarization methods regard a document (or a document set) as a set of textual units (e.g. sentences, clauses, phrases) and formulate summarization as a combinatorial optimization problem, i.e. selecting a subset of the set of textual units that maximizes an objective without violating a length constraint.",
        "For example, McDonald (2007) formulated text summarization as a Knapsack Problem, where he selects a set of textual units that maximize the sum of significance scores of each unit.",
        "Filatova et al. (2004) proposed a summarization method based on a Maximum Coverage Problem, in which they select a set of textual units that maximizes the weighted sum of the conceptual units (e.g. unigrams) contained in the set.",
        "Although, their greedy solution is only an approximation, Takamura et al. (2009a) extended it to obtain the exact solution.",
        "More recently, Takamura et al.",
        "(2009b) regarded summarization as a Budgeted Median Problem and obtain exact solutions with integer linear programming.",
        "These methods successfully improved ROUGE (Lin, 2004) scores, but they still have one critical shortcoming.",
        "Since these methods are based on subset selection, the summaries they generate cannot preserve the rhetorical structure of the textual units of a source document.",
        "Thus, the resulting summary may lack coherence and may not include significant textual units from a source document.",
        "One powerful and potential way to overcome the problem is to include discourse tree constraints in the summarization procedure.",
        "Marcu (1998) regarded a document as a Rhetorical Structure Theory (RST) (William Charles, Mann and Sandra An-near, Thompson, 1988)-based discourse tree (RSTDT) and selected textual units according to a preference ranking derived from the tree structure to make a summary.",
        "Daume?",
        "et al (2002) proposed a document compression method that directly models the probability of a summary given an RST-DT by using a noisy-channel model.",
        "These methods generate well-organized summaries, however, since they do not formulate summarizations as combinatorial op",
        "timization problems, the optimality of the generated summaries is not guaranteed.",
        "In this paper, we propose a single document summarization method based on the trimming of a discourse tree based on the Tree Knapsack Problem.",
        "If a discourse tree explicitly represents parent-child relationships between textual units, we can apply the well-known tree-trimming approach to a discourse tree and reap the benefit of combinatorial optimization methods.",
        "In other words, to apply the tree-trimming approach, we need a tree whose all nodes represent textual units.",
        "Unfortunately, the RST-DT does not allow it, because textual units in the RST-DT are located only on leaf nodes and parent-child relationship between textual units are represented implicitly at higher positions in a tree.",
        "Therefore, we first propose rules that transform an RST-DT into a dependency-based discourse tree (DEP-DT) that explicitly defines the parent-child relationships.",
        "Second, we treat it as a rooted subtree selection, in other words, a Tree Knapsack Problem and formulate the problem as an ILP."
      ]
    },
    {
      "heading": "2 From RST-DT to DEP-DT",
      "text": []
    },
    {
      "heading": "2.1 RST-DT",
      "text": [
        "According to RST, a document is represented as an RST-DT whose terminal nodes correspond to elementary discourse units (EDU)s1 and whose non-terminal nodes indicate the role of the contiguous",
        "EDUs namely, ?nucleus (N)?",
        "or ?satellite (S)?.",
        "A nucleus is more important than a satellite in terms of the writer's purpose.",
        "That is, a satellite is a child of a nucleus in the RST-DT.",
        "Some discourse relations such as ?Elaboration?, ?Contrast?",
        "and ?Evidence?",
        "between a nucleus and a satellite or two nuclei are defined.",
        "Figure 1 shows an example of an RST-DT."
      ]
    },
    {
      "heading": "2.2 DEP-DT",
      "text": [
        "An RST-DT is not suitable for tree trimming because it does not always explicitly define parent-child relationships between textual units.",
        "For example, if we consider how to trim the RST-DT in Figure 1, when we drop e8, we have to drop e7 because of the parent-child relationship defined between e7 and e8, i.e. e7 is a satellite (child) of the nucleus (parent) e8.",
        "On the other hand, we cannot judge whether we have to drop e9 or e10 because the parent-child relationships are not explicitly defined between e8 and e9, e8 and e10.",
        "This view motivates us to produce a discourse tree that explicitly defines parent-child relationships and whose root node represents the most important EDU in a source document.",
        "If we can obtain such a tree, it is easy to formulate summarization as a Tree Knapsack Problem.",
        "To construct a discourse tree that represents the parent-child relationships between EDUs, we propose rules for transforming an RST-DT to a dependency-based discourse tree (DEP-DT).",
        "The procedure is defined as follows:",
        "ent of an EDU in the RST-DT, we define a ?head?.",
        "Here, a ?head?",
        "of a non-terminal node is the leftmost descendant EDUwhose parent is N. In Figure 2, ?H?",
        "indicates the ?head?",
        "of each node.",
        "2.",
        "For each EDU whose parent is N, we pick the nearest S with a ?head?",
        "from the EDU's ancestors and we add the EDU to the DEP-DT as a child of the head of the S's parent.",
        "If there is no nearest S, the EDU is the root of the DEP-DT.",
        "For example, in Figure 2, the nearest S to e3 that has a head is node 5 and the head of node 5's parent is e2.",
        "Thus, e3 is a child of e2.",
        "3.",
        "For each EDU whose parent is S, we pick the nearest non-terminal with a ?head?",
        "from the ancestors and we add the EDU to the DEP-DT as a child of the head of the non-terminal node.",
        "For example, the nearest non-terminal node of e9 that has a head is node 16 and the head of node 16 is e10.",
        "Thus, e9 is a child of e10.",
        "Figure 3 shows the DEP-DT obtained from the RST-DT in Figure 1.",
        "The DEP-DT expresses the parent-child relationship between the EDUs.",
        "Therefore, we have to drop e7, e9 and e10 when we drop e8.",
        "Note that, by applying the rules, discourse relations defined between non-terminals of an RST-DT are eliminated.",
        "However, we believe that these relations are no needed for the summarization that we are attempting to realize."
      ]
    },
    {
      "heading": "3 Tree Knapsack Model for",
      "text": []
    },
    {
      "heading": "Single-Document Summarization 3.1 Formalization",
      "text": [
        "We denote T as a set of all possible rooted subtrees obtained from a DEP-DT.",
        "F (t) is the significance score for a rooted subtree t ?",
        "T and L is the maximum number of words allowed in a summary.",
        "The optimal subtree t?",
        "is defined as follows:",
        "Here, we define F (t) as",
        "E(t) is the set of EDUs contained in t, Depth(e) is the depth of an EDU e within the DEP-DT.",
        "For example, Depth(e2) = 1, Depth(e6) = 4 for the DEP-DT of Figure 3.",
        "W(e) is defined as follows:",
        "tf(w,D) is the term frequency of word w in a docu"
      ]
    },
    {
      "heading": "ment D. 3.2 ILP Formulation",
      "text": [
        "We formulate the optimization problem in the previous section as a Tree Knapsack Problem, which is a kind of Precedence-Constrained Knapsack Problem (Samphaiboon and Yamada, 2000) and we can obtain the optimal rooted subtree by solving the following ILP problem2:",
        "dataset.",
        "In the table, G,H,K,L indicate a method statistically significant against Marcu(G), Marcu(H), KP, LEAD, respectively.",
        "where x is an N dimensional binary vector that represents the summary, i.e. xi=1 denotes that the i-th EDU is included in the summary.",
        "N is the number of EDUs in a document, ?i is the length (the number of words) of the i-th EDU, and parent(i) indicates the ID of the parent of the i-th EDU in the DEP-DT.",
        "Constraint (6) ensures that the length of a summary is less than limit L. Constraint (7) ensures that a summary is a rooted subtree of the DEP-DT.",
        "Thus, xparent(i) is always 1 when the i-th EDU is included in the summary.",
        "In general, the Tree Knapsack Problem is NP-hard, but fortunately we can obtain the optimal solution in a feasible time by using ILP solvers for documents of practical tree size.",
        "In addition, bottom-up DP (Lukes, 1974) and depth-first DP algorithms (Cho and Shaw, 1997) are known to find the optimal solution efficiently."
      ]
    },
    {
      "heading": "4 Experimental Evaluation",
      "text": []
    },
    {
      "heading": "4.1 Settings",
      "text": [
        "We conducted an experimental evaluation on the test collection for single document summarization evaluation contained in the RST Discourse Treebank (RST-DTB)(Carlson et al., 2001) distributed by the Linguistic Data Consortium (LDC)3.",
        "The RST-DTB Corpus includes 385 Wall Street Journal articles with RST annotation, and 30 of these documents also have one human-made reference summary.",
        "The average length of the reference summaries corresponds to about 10 % of the words in the source",
        "document.",
        "We compared our method (TKP) with Marcu's method (Marcu) (Marcu, 1998), a simple knapsack model (KP), a maximum coverage model (MCP) and a lead method (LEAD).",
        "MCP is known to be a state-of-the-art method for multiple document summarization and we believe that MCP also performs well in terms of single document summarization.",
        "LEAD is also a widely used summarizer that simply takes the first K textual units of the document.",
        "Although this is a simple heuristic rule, it is known as a state-of-the-art summarizer (Nenkova and McKe-own, 2011).",
        "For our method, we examined two types of DEP-DT.",
        "One was obtained from the gold RST-DT.",
        "The other was obtained from the RST-DT produced by a state-of-the-art RST parser, HILDA (duVerle and Prendinger, 2009; Hernault et al., 2010).",
        "For Marcu's method, we examined both the gold RST-DT and HILDA's RST-DT.",
        "We reimplemented HILDA and retrained it on the RST-DT Corpus excluding the 30 documents used in the evaluation.",
        "The F-score of the parser was around 0.5.",
        "For KP, we exclude constraint (7) from the ILP formulation of TKP and set the depth of all EDUs in equations (3) and (5) at 1.",
        "For MCP, we use tf (equation (4)) as the word weight.",
        "We evaluated the summarization systems with ROUGE version 1.5.5 4.",
        "Performance metrics were the recall (R) and F-score (F) of ROUGE-1,2."
      ]
    },
    {
      "heading": "4.2 Results and Discussion",
      "text": [
        "Table 1 shows the evaluation results.",
        "In the table, TKP(G) and TKP(H) denote methods with the DEP-DT obtained from the gold RST-DT and from HILDA, respectively.",
        "Marcu(G) and Marcu(H) denote Marcu's method described in (Marcu, 1998) with gold RST-DT and with HILDA, respectively.",
        "We performed a multiple comparison test for the differences among ROUGE scores, we calculated the p-values between systems with the Wilcoxon signed-rank test (Wilcoxon, 1945) and used the False Discovery Rate (FDR) (Benjamini and Hochberg, 1995) to calculate adjusted p-values, in order to limit false positive rate to 5%.",
        "From the table, TKP(G) and Marcu(G) achieved",
        "Reference: The Fuji apple may one day replace the Red Delicious as the number one U.S. apple.",
        "Since the Red Delicious has been over-planted and prices have dropped to new lows, the apple industry seems ready for change.",
        "Along with growers, supermarkets are also trying different varieties of apples.",
        "Although the Fuji is smaller and not as perfectly shaped as the Red Delicious, it is much sweeter, less mealy and has a longer shelf life.",
        "TKP(G): We?ll still have mom and apple pie.",
        "A Japanese apple called the Fuji.",
        "Some fruit visionaries say the Fuji could someday tumble the Red Delicious from the top of America's apple heap.",
        "It has a long shelf life.",
        "Now, even more radical changes seem afoot.",
        "The Delicious hegemony won't end anytime soon.",
        "New apple trees grow slowly.",
        "But the apple industry is ripe for change.",
        "There's a Fuji apple cult.",
        "Marcu(G): We?ll still have mom and apple pie.",
        "On second thought, make that just mom.",
        "The Fuji could someday tumble the Red Delicious from the top of America's apple heap.",
        "Now, even more radical changes seem afoot.",
        "The Delicious hegemony won't end anytime soon.",
        "More than twice as many Red Delicious apples are grown as the Golden variety, America's No.",
        "2 apple.",
        "But the apple industry is ripe for change.",
        "MCP: Called the Fuji.",
        "It has a long shelf life.",
        "New apple trees grow slowly.",
        "Its roots are patriotic.",
        "I'm going to have to get another job this year.",
        "Scowls.",
        "They still buy apples mainly for big, red good looks.",
        "Japanese researchers have bred dozens of strains of Fujis.",
        "Mr. Auvil, the Washington grower, says.",
        "Stores sell in summer.",
        "The ?",
        "big boss ?",
        "at a supermarket chain even rejected his Red Delicious recently.",
        "Many growers employ.",
        "LEAD: Soichiro Honda's picture now hangs with Henry Ford's in the U.S.",
        "Automotive Hall of Fame, and the game-show ?",
        "Jeopardy ?",
        "is soon to be Sony-owned.",
        "But no matter how much Japan gets under our skin, we?ll still have mom and apple pie.",
        "On second thought, make that just mom.",
        "A Japanese apple called the Fuji is cropping up in orchards the way Hondas did on U.S. roads.",
        "Figure 4: Summaries obtained from wsj 1128. better results than MCP, KP and LEAD, although some of the comparisons are not significant.",
        "In particular, TKP(G) achieved the highest ROUGE scores on all measures.",
        "On ROUGE-1 Recall, TKP(G) significantly outperformed Marcu(G), Marcu(H), KP and LEAD.",
        "These results support the effectiveness of our method that utilizes the discourse structure.",
        "Comparing TKP(H) with Marcu(H), the former achieved higher scores with statistical significance on ROUGE-1.",
        "In addition, Marcu(H) was outperformed by MCP, KP and LEAD.",
        "The results confirm the effectiveness of our summarization model and trimming proposal for DEP-DT.",
        "Moreover, the difference between TKP(G) and TKP(H) was smaller than that between Marcu(G) and Marcu(H).",
        "This implies that our method is more robust against discourse parser error than Marcu's method.",
        "Figure 4 shows the example summaries generated by TKP(G), Marcu(G), MCP and LEAD, respectively for an article, wsj 1128.",
        "Since TKP(G) and Marcu(G) utilize a discourse tree, the summary generated by TKP(G) is similar to that generated by Marcu(G) but it is different from those generated by MCP and LEAD."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "This paper proposed rules for transforming an RST-DT to a DEP-DT to obtain the parent-child relationships between EDUs.",
        "We treated a single document summarization method as a Tree Knapsack Problem, i.e. the summarizer selects the best rooted subtree from a DEP-DT.",
        "To demonstrate the effectiveness of our method, we conducted an experimental evaluation using 30 documents selected from the RST Discourse Treebank Corpus.",
        "The results showed that our method achieved the highest ROUGE-1,2 scores."
      ]
    }
  ]
}
