{
  "info": {
    "authors": [
      "Malvina Nissim",
      "Andrea Zaninello"
    ],
    "book": "MWE",
    "id": "acl-W13-1015",
    "title": "A Repository of Variation Patterns for Multiword Expressions",
    "url": "https://aclweb.org/anthology/W13-1015",
    "year": 2013
  },
  "references": [],
  "sections": [
    {
      "heading": "1 Introduction and Background",
      "text": [
        "One of the crucial issues in the analysis and processing of MWEs is their internal variability.",
        "Indeed, the feature that mostly characterises MWEs is their fixedness at some level of linguistic analysis, be it morphology, syntax, or semantics.",
        "The morphological aspect is not trivial in languages which exhibit a rich morphology, such as Romance languages.",
        "The issue is relevant in at least three aspects of MWE representation and processing: lexicons, identification, and extraction (Calzolari et al., 2002).",
        "At the lexicon level, MWEs are usual stored as one form only, the so-called quotation form (or citation form).",
        "However, some variations of the quotation form might also be valid instances of MWEs (Bond et al., 2005) ?",
        "some but not all, as some of them might actually be plain compositional phrases.",
        "This becomes relevant for automatic identification and extraction.",
        "If a lexicon stores the quotation form only, identification on a corpus done via matching lexicon strings as such would miss valid variations of a given MWE.",
        "Identification could be done exploiting lemmas rather than quotation forms, but an unrestricted match would also possibly return compositional phrases.",
        "Extraction is usually done applying association measures over instances of given POS patterns (Evert and Krenn, 2005), and because lemmas are matched, no restrictions on internal variation is enforced as such.",
        "Knowing which variations should be allowed for the quotation form of a given MWE would help in increasing recall while keeping precision high.",
        "However, specifying such variations for each MWE would be too costly and wouldn't help in extraction, as no specifications could be done a priori on yet unknown MWEs.",
        "Optimally, one would need to find more general variation patterns that could be applied to classes of MWEs.",
        "Indeed, the main idea behind this work is that MWEs can be handled through more general patterns.",
        "This is also claimed, for instance, by Masini (2007) whose analysis on Italian MWEs takes a constructionist perspective (Goldberg, 2003), by Weller and Heid (2010), who treat verbal expressions in German, and also by Gre?goire (2010), who bases his work on the Equivalence Class Method (ECM, (Odijk, 2004)) assuming that MWEs may be clustered according to their syntactic pattern and treated homogeneously.",
        "We suggest that variation patterns can be found and defined over POS sequences.",
        "Working on Italian, in this paper we report the results of ongoing research and show how such patterns can be derived, we then propose a way to encode them in a repository, which can be combined with existing lexicons of MWEs.",
        "For the moment, we restrict our study to contiguous MWEs although we are aware that non-contiguous expressions are common and should be treated, too (see also (Pianta and Bentivogli, 2004)).",
        "Thus, only morphological variation is considered at this stage, while phenomena such as insertion and word order variation are left for future work."
      ]
    },
    {
      "heading": "2 Obtaining Variation Patterns",
      "text": [
        "Variation patterns refer to POS sequences and rely on frequencies.",
        "The main resources needed for obtaining them are a MWE lexicon and a reference corpus (pos-tagged and lemmatised).We use a MWE lexicon derived from an existing online dictionary",
        "for Italian (Zaninello and Nissim, 2010), and the corpus ?La Repubblica?",
        "(Baroni et al., 2004) for obtaining frequencies.",
        "A variation pattern encodes the way a given instance of a MWE morphologically differs from its original quotation form in each of its parts.",
        "All tokens that correspond to the quotation form are marked as fix whereas all tokens that do not are marked as flex.",
        "Consider Example (1):",
        "(1) a. quotation form: ?casa di cura?",
        "(nursing home) b. instance: ?case di cura?",
        "(nursing homes) c. variation pattern: flex fix fix",
        "The pattern for the instance in (1b) is flex fix fix because the first token, ?case?",
        "(houses) is a plural whereas the quotation form features a singular (?casa?, house), thus is assigned a flex label, whereas the other two tokens are found exactly as they appear in the quotation form, and are therefore labelled as fix.",
        "At this point, it is quite important to note that a binary feature applied to each token makes flexibility underspecified in at least two ways.",
        "First, the value flex does not account by itself for the degree of variation: a token is flex if it can be found in one variation as well as many.",
        "We have addressed this issue elsewhere via a dedicated measure (Nissim and Zaninello, 2011), but we do not pick it up here again.",
        "In any case, the degree of variation could indeed be included as additional information.",
        "Second, we only specify which part of the MWEs varies but do not make assumptions on the type of variation encountered (for example, it doesn't distinguish at the level of gender or number).",
        "We believe this is a fair tradeoff which captures generalisations at a level which is intermediate between a word-by-word analysis and considering the entire MWE as a single unit.",
        "Additionally, it does not require finer-grained annotation than POS-tagging and lemmatisation, and allows for the discovery of possibly unknown and unpredicted variations.",
        "Morphological analysis, when needed, is of course still possible a posteriori on the instances found, but it is useful that at this stage flexibility is left underspecified.",
        "As said, validating variation patterns per MWE would be impractical and uninformative with respect to the extraction of previously unseen MWEs.",
        "Thus, we define variation patterns over part-of-speech sequences.",
        "More specifically, we operate as follows:",
        "1. search all MWEs contained in a given lexicon on a large corpus, matching all possible variations (lemma-based, or unconstrained, search); 2. obtain variation patterns for all MWEs by comparing each instance to its quotation form; 3. group all MWEs with the same POS sequence; 4. for each POS sequence collect all variation patterns of all pertinent MWEs.",
        "In previous work (Nissim and Zaninello, 2013), we have observed that frequency is a good indicator of valid patterns: the most frequent variation patterns correlate with variations annotated as correct by manual judges.",
        "Patterns for two nominal POS were evaluated, and they were found to be successful.",
        "In this paper we pick three further POS sequences per expression type for a total of nine POS patterns, and evaluate the precision of a pattern selection measure.",
        "The availability of variation patterns per POS sequences (and expression type) can be of use both in identification as well as in extraction.",
        "In identification, patterns can be used as a selection strategy for all of the matched instances.",
        "One could just use frequency directly from the corpus where the identification is done, but this might not always be possible due to corpus size.",
        "This is why using an external repository of patterns evaluated against a large reference corpus for a given language might be useful.",
        "In extraction tasks, patterns can be used as filters, either as a post-processing phase after matching lemmas for given POS sequences, or directly extracting only allowed configurations which could be specified for instance in extraction tools such as mwetoolkit (Ramisch et al., 2010).",
        "In previous work we have shown that patterns can be derived comparing found instances against their lemmatised form, making this a realistic setting even in extraction where quotation forms are not known (Nissim and Zaninello, 2013)."
      ]
    },
    {
      "heading": "3 Ranking",
      "text": [
        "For ranking variation patterns we take into account the following figures: ?",
        "the total number of different variation patterns per POS sequence ?",
        "the total number of instances (hits on the corpus) with a given variation pattern For example, the POS sequence ADJ PRE NOUN characterising some adjectival expressions is featured by 9 different original multiword expressions that were found in the corpus.",
        "The variations with respect to the quotation form (indicated as fix fix fix and found for seven different types) in which instances have been found are four: flex fix fix (13 times), flex fix flex (7 times), fix fix flex (3 times), and fix flex flex (one time), for a total of 31 variations.",
        "Each instance yielding a given pattern was found at least once in the corpus, but possibly more times.",
        "We take into account this value as well, thus counting the number of single instances of a given pattern.",
        "So, while ?degni di nota?",
        "(?worthpl mentioning?, quotation form: ?degno di nota?, ?worthsg mentioning?)",
        "would serve as one variation of type flex fix fix, counting instances would account for the fact that this expression was found in the corpus 38 times.",
        "For the ADJ PRE NOUN sequence, instances of pattern fix fix fix were found 130 times, instances of flex fix fix 219, flex fix flex 326, fix fix flex 90, and fix flex flex just once, for a total of 766 instances.",
        "Such figures are the basis for pattern ranking and are used in the repository to contribute to the description of variation patterns (Figure 1).",
        "We use the share of a given variation pattern (vp) over the total number of variations (pattern share).",
        "In the example above, the share of flex fix fix (occurring 13 times) would be 13/31 (41.9%), as 31 is the total of encountered variations for the ADJ PRE NOUN POS sequence.",
        "We also use the instance share, which for the same variation pattern would be 219/766 (12.0%) and combine it with the pattern share to obtain an overall share (sharevp):",
        "As a global ranking score (GRSvp), the resulting average share is combined with the spread, namely the ratio of instances over variations (219/13 for flex fix fix), a pattern-internal measure indicating the average instances per variation pattern.",
        "Only patterns with GRS > 1 are kept, with the aim of maximising precision.",
        "Evaluation is done against some POS sequences for which extracted instances have been manually annotated.",
        "Precision, recall, and f-score are reported in Table 1.",
        "Results for an unconstrained search (no pattern selection) are also included for comparison.",
        "The number of variation patterns that we keep on the basis of the ranking score includes the fix fix fix pattern.",
        "From the table, we can see that in most cases precision is increased over an unconstrained match.",
        "However, while for verbal expressions the boost in precision preserves recall high, thus yielding f-scores that are always higher than for an unconstrained search, the same isn't true for adjectives and adverbs.",
        "In two cases, both featuring the same POS sequence (PRE NOUN ADJ) though for different expression types, recall is heavily sacrificed.",
        "In three cases, the GRS doesn't let discard any patterns, thus being of no use in boosting precision.",
        "These are cases where only two variation patterns were observed, indicating that possibly other ranking measures could be explored for better results under such conditions.",
        "In previous work we have seen that selecting variation patterns works well for nominal expressions (Nissim and Zaninello, 2013).",
        "Overall, even though in some cases our method does not yield different results than an unconstrained search, whenever it does, precision is always higher.",
        "It is therefore worth applying whenever boosting precision is desirable."
      ]
    },
    {
      "heading": "4 Repository and Encoding",
      "text": [
        "We create an XML-based repository of POS patterns with their respective variation patterns.",
        "Variation patterns per POS sequence are reported according to the ranking produced by the GRS.",
        "However, we",
        "include all observed patterns equipped with the frequency information we used, so that other ranking measures or different thresholds could be applied.",
        "The repository is intended as connected to two sources, namely a lexicon to obtain quotation forms of MWEs to be searched, and the corpus where expressions were searched, which provides the figures.",
        "POS patterns are listed as elements for each expression element, whose attribute type specifies the grammatical type?for example ?verbal?.",
        "The same POS pattern can feature under different expression types, and could have different constraints on variation according to the grammatical category of the MWE (in extraction this issue would require dedicated handling, as the grammatical category is not necessarily known in advance).",
        "For the element pattern, which specifies the POS sequence, the attribute mwes indicates how many different original mews were found for that sequence, and the attributes variations and instances the number of variations and instances (Section 3).",
        "Actual patterns are listed as data of a vp (variation pattern) element, according to decreasing GRS, with values obtained from the reference corpus (specified via a corpus element).",
        "Attributes for the vp element are vshare (variation share), ishare (instance share), spread, and grs (see again Section 3).",
        "In Figure 1 we provide a snapshot of what the repository looks like.",
        "The POS sequence of a MWE in the original lexicon can be matched to the same value in the repository, and so can the expression type, which should also be specified in the lexicon, so that the relative variation patterns can be inherited by the MWE."
      ]
    }
  ]
}
