{
  "info": {
    "authors": [
      "Helmut Horacek"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E91-1033",
    "title": "Exploiting Conversational Implicature for Generating Concise Explanations",
    "url": "https://aclweb.org/anthology/E91-1033",
    "year": 1991
  },
  "references": [
    "acl-J88-3006"
  ],
  "sections": [
    {
      "heading": "EXPLOITING CONVERSATIONAL IMPLICATURE FOR GENERATING CONCISE EXPLANATIONS",
      "text": [
        "HELMUT HORACEK Universitat Bielefeld Fakultat fair Linguistik and Literaturwissenschaft Postfach 8640, D-4800 Bielefeld 1, Deutschland"
      ]
    },
    {
      "heading": "ABSTRACT",
      "text": [
        "This paper presents an approach for achieving conciseness in generating explanations, which is done by exploiting formal reconstructions of aspects of the Gricean principle of relevance to simulate conversational implicature.",
        "By applying contextually motivated inference rules in an anticipation feedback loop, a set of propositions explicitly representing an explanation's content is reduced to a subset which, in the actual context, can still be considered to convey the message adequately."
      ]
    },
    {
      "heading": "1. INTRODUCTION",
      "text": [
        "The task of providing informative natural language explanations for illustrating the results produced by decision support systems has been given increased attention recently.",
        "The proposed methods preferably address tailoring of explanations to the needs of their addressees, including, for instance, object descriptions 181 and presentation of taxonomic knowledge [7].",
        "In addition, particular emphasis has been put on reactive explanation techniques for selecting an appropriate content according to contextual interpretation [6], and on the way of presenting explanations by taking the information seeking person's knowledge into account [1].",
        "Whereas these approaches attack various issues important for the generation of natural language explanations, none of them has focussed on the conciseness of explanations in a broader context.",
        "Aiming at the production of natural and concise texts, we have concentrated our efforts on presenting different types of knowledge and their interrelations because this kind of information is typically relevant for explanations.",
        "We formally reconstruct aspects of the Gricean principle of relevance [3] and exploit the results obtained for creating concise explanations to questions about solutions proposed by the expert system OFFICE-PLAN [5].",
        "This system is able to appropriately assign a set of employees to a set of rooms in offices, which is guided by a number of constraints expressing various kinds of the persons' requirements."
      ]
    },
    {
      "heading": "2. REPRESENTING DOMAIN AND INFERENCE KNOWLEDGE",
      "text": [
        "Terminological knowledge is represented in a sorted type hierarchy, which identifies classes of entities and their relevant subsorts, as well as relations that may hold between two types of entities.",
        "Moreover, assertions which refer to the referential level must be consistent with the ontology provided by these taxonomic definitions.",
        "Inferential knowledge is represented in terms of rules which express constraints to be satisfied in the problem solving process.",
        "Rules are represented according to the syntax of IRS [2], which is loosely based on predicate logic.",
        "The quantifiers used in our system are all, some, and unique.",
        "The predications contained are restricted to be one or two-place predications corresponding to class and relation definitions introduced in the taxonomic hierarchy.",
        "In addition, the meta-predicate implies is contained in the innermost predication of a rule, which constitutes the rule's conclusion (see Figure 1).",
        "The original representation of an explanation to a certain question consists of a set of propositions (created by the preceeding component in the generation process [4]) which includes inference rules and individual facts that completely identify the reasons behind.",
        "The task is then to reduce this set of propositions as much as possible by exploiting a given context so that the subset obtained still conveys the same information - in a partially implicit and more concise form, but without leading to wrong implications.",
        "The intuition behind this mechanism is as follows: After having asked a certain explanation seeking question the questioner mentally attempts to build links between entities referred to in the question and facts or rules provided as 'explanation'.",
        "Hence, if a regularity valid for a class of entities is uttered, the person attempts to find out which of the entities mentioned previously this rule is thought to apply to.",
        "((all g (group-leader g)) ((some r (and (room r) (in r g))) (implies (single-room r))))",
        "•"
      ]
    },
    {
      "heading": "3. EXPRESSING CONVERSATIONAL IMPLICATURE",
      "text": [
        "The reduction of the set of propositions that originally represents the explanation is performed by exploiting a set of rules which are contextually motivated and express conversational implicature.",
        "These rules represent formal reconstructions of aspects of the Gricean principle of relevance.",
        "They have the same format as the rules which constitute the system's inferential knowledge, but, in addition, they contain meta-predications referring to contextual, conversational, or processing states associated with the individuals referred to (see Figure 2 below).",
        "The rules expressing conversational implicature allow variables to denote propositions, though in an extremely limited sense only: a variable x denoting a proposition must always be restricted by the predication (newinfo x) so that the evaluation process can rely on a definite set of entities when generating legal instances of x.",
        "We have defined three rules that constitute a fundamental repertoire for exploiting conversational implicature (see Figure 3).",
        "They express contextually motivated inferences of a fact from another one, of a fact from an inference rule, and the relevance of an inference rule justified by a fact.",
        "Moreover, logical substitution is applied to those domain inference rules which become bound to variables of a contextually motivated inference rule at some processing stage.",
        "The first rule, C-Rule 1, refers to two (sets of) entities eland e2, which have been both addressed (expressed by topic) in the question and share the most general superclass (topclass).",
        "If",
        "the explanation also contains new facts p (newin-fo) about eland the same assertion also applies to e2 (expressed by subst), and nothing is said about e2 (no-newinfo), conversational relevance dictates that the contrary of the newly introduced facts p is true for e2 (otherwise, the relevant part of the message would also mention e2).",
        "C-Rule 2 may be applicable if the explanation contains an inference rule r (referred to by newinfo).",
        "In that case an attempt is made to establish a link between a class el which occurs (about) in the rule's premise and all entities e2 mentioned in the prior question (topic) which could fit (not-false) the class membership of el.",
        "If this is successful for some e2, their class membership concerning el is considered to be valid.",
        "Finally, C-Rule 3 tries to strenghten the relevance of a proposition (newinfo) concerning an entity el.",
        "First, a unique inference rule r has to be found (in the addressee's mental state) which contains a variable e2 in its premise such that el could fit (not-false) the class membership of e2.",
        "Secondly, the rule's conclusion must be consistent with the information available so far; hence, it must be possible to associate all variables e3 occurring in the conclusion with variables e4 by means of a class membership relation.",
        "Then the rule is considered to be relevant.",
        "the entity referred to by a is mentioned in the explanation seeking question the most general class a is a subclass of (the root wide does not count) the truth value of proposition p is considered to be unknown to the user p is contained in the set of propositions constituting the explanation the information about the entity referred to by variable a is not effected by the explanation given b is substituted for a in proposition p proposition p refers to entity a formula f contains a proposition asserting variable a to belong to class c"
      ]
    },
    {
      "heading": "4. THE INFERENCE MECHANISM",
      "text": [
        "The inference mechanism is applied by using a simulated anticipation feedback loop fed by heuristically generated hypotheses.",
        "They are subsets of the set of propositions that originally represent the explanation.",
        "After the first successful application of a contextually motivated rule only C-Rule 1 and logical substitution are taken into account for further inferencing.",
        "This process is continued until all propositions contained in the explanation's explicit form occur",
        "• in the current hypothesis, or • in the user model, or • in the set of propositions inferred,",
        "(thus, the explanation is complete) and no contradictions have been derived (it is also implicature-free) - hence, the hypothesis considered represents a valid explanation.",
        "The hypotheses are created by starting with the smallest subsets, so that the first valid hypothesis can be expected to be the best choice.",
        "In addition, all inference rules referred to in the explicit form of the explanation and unknown to the user are also contained in each hypothesis, as there is no chance to infer the relevance of a rule without being acquainted with it (see the clause (knows user r) in C-Rule 3).",
        "Even if the addressee is familiar with a certain rule, this rule must either be mentioned or it must be inferable, because evidence for its relevance in the actual instance is required.",
        "In fact, hypotheses not including such a rule are preferred because triggering the inference of a rule's relevance by means of uttering an additonal fact can usually be achieved by shorter utterances than by expressing the inference rule explicitly.",
        "This heuristics has its source in the Gricean principle of brevity."
      ]
    },
    {
      "heading": "5. EXAMPLES",
      "text": [
        "The mechanism described has been implemented in CommonLisp on a SUN4.",
        "We demonstrate the system's behavior by means of the effects of three different user models when expressing most adequately the explanation (represented in Figure 4) to the question: 'Why is person A in room B and not in room C?' The user models applied comprise stereotypes for a 'local employee' (he/she is acquainted with all information about the actual office), for a 'novice' (who does not know anything), and for an 'office plan expert' (who is assumed to know I-Rule 1 (1) only).",
        "Fact (5) is known to anybody, as it is presupposed by the question.",
        "The process is simple for the 'local employee': Since he/she also knows facts (2) to (4), the first hypothesis (I-Rule 1) provides the missing information.",
        "The first hypothesis is identical for the 'novice', but a series of inferences is needed to prove its adequacy.",
        "First, a part of C-Rule 2 matches (1) and, as A is the only person referred to in the question, it is inferred that A is a group leader, which is what fact (2) expresses.",
        "Then, substituting A and B in I-Rule 1 results in the evidence that B is a single room, thus proving fact (3) as well.",
        "Finally, C-Rule 1 is applicable by substituting B and C for the variables eland e2, respectively, concluding that C is not a single room (and, in fact, a double room if this is the only other possible type of room).",
        "The first hypothesis for the 'expert' consists of (2) only.",
        "Because experts are assumed to be acquainted with I-Rule 1, C-Rule 3 can be applied proving the relevance of (1).",
        "Then, processing can continue as this is done after the first inference step for the 'novice', so that fact (2) is obtained as the best explanation for the expert."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
