{
  "info": {
    "authors": [
      "Christine H. Nakatani"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P91-1053",
    "title": "Resolving a Pragmatic Prepositional Phrase Attachment Ambiguity",
    "url": "https://aclweb.org/anthology/P91-1053",
    "year": 1991
  },
  "references": [
    "acl-H90-1052",
    "acl-J86-3001",
    "acl-P83-1017"
  ],
  "sections": [
    {
      "heading": "1. Introduction",
      "text": [
        "To resolve or not to resolve, that is the structural ambiguity dilemma.",
        "The traditional wisdom is to disambiguate only when it matters in terms of the meaning of the utterance, and to do so using the computationally least costly information.",
        "NLP work on PP-attachment has followed this wisdom, and much effort has been focused on formulating structural and lexical strategies for resolving noun-phrase and verb-phrase (NP-PP vs. VP-PP) attachment ambiguity (e.g. [8, 11]).",
        "In one study, statistical analysis of the distribution of lexical items in a very large text yielded 78% correct parses while two humans achieved just 85%[5].",
        "The close performance of machine and human led the authors to pose two issues that will be addressed in this paper: is the predictive power of distributional data due to \"a complementation relation, a modification relation, or something else\", and what characterizes the attachments that escape prediction?"
      ]
    },
    {
      "heading": "2. Pragmatically ambiguous PPs",
      "text": [
        "Although structural and lexical rules alone do not suffice to disambiguate all kinds of PPs, discourse modelling is viewed as computationally costly (cf. [1]).",
        "The debate over resolution strategies is not simply about practicality, but rather, at stake is the notion of what exactly it means for a PP to attach.",
        "This paper defends discourse-level strategies by arguing that a certain PP-attachment ambiguity, sentential vs. verb-phrase (S-PP vs. VP-PP), reflects a third kind of relation that is pragmatic in nature.",
        "As noted in [11], context-dependent preferences cannot be computed a priori, so pragmatic PP-attachment ambiguities are among those that defy structural and lexical rules for disambiguation.",
        "Another criticism aimed at discourse-level approaches is that pragmatic ambiguities can be left unresolved because they do not affect the meaning of an utterance.",
        "In the case of S-PPs and VP-PPs, however, the linguistic evidence points to significant meaning differences (section 3).",
        "This paper offers a unified account of the linguistic behavior of these PPs which is expressed in a new formalism (section 4), and concludes that the resolution of pragmatic PP-attachment ambiguity is necessary for language understanding (section 5)."
      ]
    },
    {
      "heading": "3. The need to disambiguate",
      "text": []
    },
    {
      "heading": "3.1 Linguistic evidence",
      "text": [
        "Linguists have identified instrumental, locative and temporal adverbial PPs as the most structurally unrestricted, context-dependent types of PPs [6, 101.",
        "These kinds of PPs often can attach either to S or VP.",
        "Thus, Warren sang in the park can be paraphrased as either Where Warren sang was in the park or What Warren did in the park was sing.",
        "Kuno argues that the former interpretation involves a place-identifying VP-PP, and the latter a scene-setting S-PP.",
        "Also, the following meaning differences occur: given-new/theme-rheme S-PPs are given/themes, VP-PPs are new/themes.",
        "preposability S-PPs can be preposed, preposed VP-PPs sound awkward and often change meaning.",
        "entailments S-PP utterances have no entailments of the utterance without the PP.",
        "For VP-PPs, the utterance without the PP is entailed only if the utterance is affirmative.",
        "negation S-PPs always lie outside the scope of negation, VP-PPs may or may not lie inside the scope of negation."
      ]
    },
    {
      "heading": "These aspects of meaning cannot be dismissed as spurious. Consider Kuno's pair of sentences:",
      "text": [
        "• Jim didn't visit museums in Paris, but he did in London (1).",
        "• Jim didn't visit museums in Paris: he visited museums in London (2).",
        "Kuno assigns (1) the interpretation in which the PPs are sentential and two events are described: although Jim visited museums only in London, he also went to Paris.",
        "Sentence (2) is assigned the reading that Jim was not in Paris at all but went only to London where he visited museums.",
        "The PPs are verb-phrasal and only one event is being talked about."
      ]
    },
    {
      "heading": "3.2 A pragmatic relation",
      "text": [
        "The behavior of these adverbial PPs reflects neither a complementation nor a modification relation.",
        "If attachment is dictated by complementation, an instrumental PP should always appear as an argument of the verb predicate in logical form.",
        "But this sacrifices entailments for affirmative VP-PP utterances; `butter(toast,knife)' does not logically entail 'butter(toast)' [2, 3].",
        "If construed as a modification relation, attachment is redundant with phrase structure information and curiously depends on whether the subject, or any other constituent outside the VP, is or is not modified by the PP.",
        "There may well be reasons to preserve these relations in the syn.tactic structure, but they are not the relations that desribe the behavior of pragmatically ambiguous PPs.",
        "The linguistic evidence suggests that the S-PP vs. VP-PP distinction reflects a pragmatic relation, namely a discourse entity specification relation where specify means to refer in a model [4].",
        "Since this relation cannot be represented by traditional phrase structure trees, the meaning differences that distinguish the two kinds of PPs must be captured by a different formal structure.",
        "The proposed event formalism treats utterances with adverbial PPs as descriptions of events and is adapted from Davidson's logical form for action sentences [2] using restricted quantification."
      ]
    },
    {
      "heading": "4. A unified formal account",
      "text": []
    },
    {
      "heading": "4.1 Event representations",
      "text": [
        "Davidson's logical form consists of an existentially quantified event entity variable and predication, as in (3e)(Agt(Jones, e) A Act(butter, e) A Obj (toast, e) A I nstr(kni f e, e)) for Jones buttered the toast with the knife.",
        "Davidson assigns equal status to all modifiers, thereby allowing events, like objects and people, to be described by any combination of their properties.",
        "This flattening of the argument structure clears the way for using restricted quantification to 'elevate' some predicates to event-specifying status.",
        "Following [12], the structure 3eP restricts the range of e to those entities",
        "that satisfy P, an arbitrarily complex predicate of the form AuPi (xl , u) A ... A P,n(z,n, u).",
        "In expressions of the form (3e : AuPi (xi , u)A...AP,n(z,n, u))[Ri (yi , e)A...ARn(yn, e)], event-specifying predicates appear in the A-expression while the other predicates remain in the predication Re.",
        "Hereafter, the term event description refers to the A-expression, and event predication to the sentence predicate Re.",
        "The two parts together comprise an event representation."
      ]
    },
    {
      "heading": "4.2 Applying the formalism",
      "text": [
        "In the formalism, (3) represents sentence (1) and (4), (2):",
        "In (3), the thematic S-PPs (in bold) are represented in the event descriptions, whereas in (4), the nonthematic VP-PPs are in the event predications.",
        "Now the well-worn given-new distinction can be replaced by the more precise distinction made by the event formalism.",
        "Event-specifying PPs appear in the event description and contribute to the specification of an event entity in the discourse model.",
        "Predication PPs appear in the event predication and convey new information about the specified entity.",
        "The formalism shows how preposing a VP-PP can change the meaning of the utterance.",
        "If the PPs in (2) are preposed, as in In Paris, Jim didn't visit museums: in London, he visited museums, the original reading is lost.",
        "This is shown in the representation: – .",
        "(3e : AuAgt(J, u) A Act(v, u) A Ob j(m, u) A Loc(P, u)) A (3e : AuAgt(J, u) A Act(v, u) A Obj(m, u) A Loc(L, u)).",
        "Since the event descriptions conflict – one event cannot take place in two places – this sentence can no longer be understood as describing a single event.",
        "The formalism also shows different effects of negation on event-specifying and predication PPs.",
        "Sentence (2) denies the existence of any 'Jim visiting museums in Paris' event, so the quantifier lies within the scope of negation in (4).",
        "In (3) negation scopes only the event predication; sentence (1) expresses a negative fact about one event, and an affirmative fact about another.",
        "In general, a PP that lies outside the scope of negation appears in the description Pu of a representation of form (3e : )tuPu) – [Re].",
        "A PP that lies inside appears in the predication Re of form – ,(3e : AuPu)[Re].",
        "Finally, the formalism lends insight into differences in entailments.",
        "The following entailment relationship holds for affirmative VP-PP sentences, where Rn(yn, e) represents the PP predicate: (3e : AuPu)[Ri (yi , e) A... A R.-1(y.-1, e) A Rn(y., e)] (3e : AuPu)[Ri (yi , e) A ... A Rn – i (Yn-1 901 A PP predicate Rn(yn, e) in a negated event predication may or may not be negated, so the entailment for negative VP-PP sentences is blocked: (3e : AuPu)--1[Ri (y1, e) A ... A Rn-1 (tin-1 e) A Rn(yn, e)] pt.",
        "(3e : AuPu) – .",
        "[Ri (yi , e) A ... A R_1 (tin – I, e)].",
        "Why S-PP sentences have no entailments is a separate matter.",
        "Eliminating an event-specifying PP from an event description yields a representation with a different description.",
        "Intuitively, it seems desirable that no entailment relations hold between different types of entities.",
        "The formalism preserves this condition.",
        "The proposed formalism succeeds in capturing the discourse entity specification relation and lends itself naturally to processing in an NLP system that takes seriously the dynamic nature of context.",
        "Such a system would for each utterance construct an event representation, search for a discourse entity that satisfies the event description, and use the event predication to update the information about that entity in the discourse model."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "A preliminary algorithm for processing highly ambiguous PPs has been worked out in [7].",
        "The algorithm uses intonation [9], centering and word order information to construct and process event representations in a discourse model structured after [4].",
        "The wider applicability of the two-part event formalism has not yet been tested.",
        "Nevertheless, one conclusion is that the value of resolving any structural ambiguity can only be measured in terms of the semantics of the structural formalism itself.",
        "In the case of VP-PP vs. S-PP ambiguity, an NLP system must not idly wait for syntax to choose how a PP should pragmatically function.",
        "The traditional wisdom – find the meaning and do so efficiently – instead suggests that more productive than demanding of syntax unreasonably diverse expressive powers is to search for direct linguistic correlates of pragmatic meaning that can be efficiently encoded in a dynamic pragmatic formalism."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The author thanks Barbara Grosz and Julia Hirschberg, who both advised this research, for valuable comments and guidance; and acknowledges current support from a National Science Foundation Graduate Fellowship.",
        "This paper stems from research carried out at Harvard University and at AT&T Bell Laboratories."
      ]
    }
  ]
}
