{
  "info": {
    "authors": [
      "Sabine Reinhard",
      "Dafydd Gibbon"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E91-1023",
    "title": "Prosodic Inheritance and Morphological Generalisations",
    "url": "https://aclweb.org/anthology/E91-1023",
    "year": 1991
  },
  "references": [
    "acl-C86-1065",
    "acl-C90-2064",
    "acl-C90-3009",
    "acl-E87-1002",
    "acl-E89-1008",
    "acl-E89-1009"
  ],
  "sections": [
    {
      "heading": "PROSODIC INHERITANCE AND MORPHOLOGICAL GENERALISATIONS",
      "text": [
        "Sabine Reinhard Dafydd Gibbon Universitat Bielefeld Fakultat fur Linguistik and Literaturwissenschaft P 8640 D-4800 Bielefeld 1 email: reinhard@lili11.uni-bielefeld.de gibbonglili11.uni-bielefeld.de"
      ]
    },
    {
      "heading": "ABSTRACT",
      "text": [
        "Prosodic Inheritance (PI) morphology provides uniform treatment of both concatenative and non-concatenative morphological and phonological generalisations using default inheritance.",
        "Models of an extensive range of German Umlaut and Arabic intercalation facts, implemented in DATR, show that the PI approach also covers 'hard cases' more homogeneously and more extensively than previous computational treatments."
      ]
    },
    {
      "heading": "1. INTRODUCTION",
      "text": [
        "Computational models of sentence syntax are increasingly based on well-defined linguistic theories and implemented using general formalisms; by contrast, morphology and phonology in the lexicon tend to be handled with tailor-made hybrid formalisms selected for properties such as finite state compilability, object orientation, default inheritance, or procedural efficiency.",
        "The linguistically motivated Prosodic Inheritance (PI) model with defaults captures morphotactic and morphophonological generalisations in a unified declarative formalism, and has broad linguistic coverage of both concatenative morphology and the notorious 'hard cases' of non-concatenative morphology.",
        "This paper integrates the PI concepts underlying previous descriptions of German Umlaut (Reinhard 1990a, 1990b), Bantu tone morphology and Arabic CV intercalation (Gibbon 1990); Umlaut and intercalation are treated here.",
        "PI descriptions are currently implemented in a DATR dialect (Gibbon 1989; for DATR cf. Evans & Gazdar 1989, 1990, 1989a, 1989b); DATR was chosen for its syntactic simplicity and its explicit formal semantics."
      ]
    },
    {
      "heading": "2. INHERITANCE AND NON-CONCATENATIVE MORPHOLOGY",
      "text": [
        "Morphological generalisations are of three basic kinds: morphotactic, the combinatorial principles of word composition in terms of immediate dominance (ID) relations, morpho-semantic, interpretation functions from morphotactic structures to semantic representations, and morphophonological (or 'morphographia interpretation functions from morphotactic structures to surface phonological or orthographic representations.",
        "This paper is mainly concerned with modelling morphotactic and morphophonological generalisations.",
        "Simple abstract morphotactic combinations (denoted by the operator '*') may be represented as follows: Ger.",
        ": [Rad * singular], pad * plural] Eng.",
        ": [cat * plural], [dog * plural], [horse * plural] Morpheme ID combinations receive a compositional morphophonological interpretation based on the forms of the component morphemes and the kind of construction involved.",
        "Phonological interpretations are composed primarily by means of concatenation, with phonological feature variation at morpheme boundaries: Ger.",
        ": Rad-Rades, /ra:t/-/ra:des/ (Voicing specification of stem final C) Eng.",
        ": cats-dogs-horses, /kEets/-/dogz/-/ho:siz/ (Voicing specification of C and epenthetic V in suffix) Non-concatenative morphophonological composition (which we will here refer to as morphoprosody) deals specifically with temporal feature overlap phenomena such as infixing, vowel gradation, consonant mutation, morphological tone and stress patterning, involving the structural 'association' of temporally coextensive categories such as features and autosegmental tiers:",
        "Kikuyu: h h I I.h h h I h. ma mo rori re, ma mo tomh re (tone) Morphoprosodic operations generally occur in combination with concatenation.",
        "Concatenation and association operators ('quasi-linear precedence, OLP, operators') are represented here by ''\" and '°' respectively.",
        "QLP representations are intermediate specifications of morphotactic detail between abstract ID and concrete phonological representations.",
        "Morphophonological generalisations thus require three levels of abstraction:",
        "Details of phonological feature structure will not be dealt with here.",
        "The only explicit computational treatment of association operations is by Kay (1987; .but cf• also the formal account by Bird & Klein, 1990), who models autosegmental phonological association with a multi-tape finite state transducer.",
        "Like autosegmental descriptions, Kay's finite state tranducers explicitly operate with directional (left-to-right or right-to-left) algorithms.",
        "Other approaches rely on lists of stem variants, string permutations, or string position indices (Cahill 1990).",
        "By contrast, the PI approach to morphoprosody does not rely on algorithmic conditions such as left-right rule application, but on a general default principle:"
      ]
    },
    {
      "heading": "Assign a default value everywhere in a given context unless a) a designated value, and b) a designated position are otherwise specified in an explicit constraint. E.g. Ger.: Assign non-umlaut everywhere in a stem",
      "text": [
        "unless a) an umlauting stem, and b) an umlaut-triggering affix cooccur.",
        "Arab.",
        ": Assign the default vowel of a vocalism (default consonant of a radical) everywhere in a word unless a) a designated vowel (designated consonant), and b) a designated position in stem syllable structure are explicitly specified.",
        "In the PI approach, lexemes are treated as individual (or 'most specific') nodes in an inheritance net.",
        "They are underspecified and inherit their full representations from semantic, syntactic, and phonological default inheritance hierarchies.",
        "Each node in these hierarchies represents a morphophonological generalisation and is associated with a set of special cases (relative exceptions) over which a default priority ordering in terms of relative specificity is defined.",
        "Fully specified phonological and orthographic lexeme representations are inherited from a hierarchy of general templates representing word, syllable and segment structures, and marked with QLP operators.",
        "The template slots are instantiated with properties inherited from specific lexemes.",
        "In the DATR implementation, inheritance of representations is implemented by local inheritance, and inheritance of specific exceptions and template instantiations is implemented by global inheritance."
      ]
    },
    {
      "heading": "3. MORPHOLOGICAL GENERAUSATIONS: UMLAUT AND INTERCALATION",
      "text": [
        "Two superficially related cases of non-concatenative morphology are Umlaut in German and vowel-consonant-intercalation in Arabic.",
        "They are similar in respect of the QLP operation of stem vowel variation in different morphological contexts, though the Arabic case is more complex, with additional variation of syllable structure and consonant position; in German, Umlaut primarily affects the vowel fronting feature."
      ]
    },
    {
      "heading": "3.1. GERMAN UMLAUT",
      "text": [
        "Current computational descriptions of German vowel fronting (Umlaut) are linguistically inadequate, in that they do not take into account the complexity of mutual conditioning between stem classes and inflectional and derivational affixes: either they ignore the complexities of derivational morphology (Schiller & Steffens 1990), or overgeneralise, with lists of absolute exceptions (Trost 1990).",
        "In the PI model of German Umlaut, a wide range of 'exceptions' turn out to be important subregularities.",
        "The inflectional properties of stems are taken as defaults for both inflection and derivation, and captured in an inheritance hierarchy.",
        "Lexemes inherit fully specified stem forms, inflectional and derivational affixes, and Umlaut specification, via this hierarchy.",
        "The hierarchy for nouns specifies that Umlaut with zero-suffix plurals depends on gender, is arbitrarily specified for each lexeme with e-suffix plurals (Umlaut being the default case), always occurs with er-suffix plurals, never with en-, s-, and exotic plurals.",
        "Derivational suffixes are also specified for their Umlaut-triggering properties, but different subregularities hold for different derivational suffixes in non-default cases.",
        "stem plur.",
        "infl.",
        "-isch deriv.",
        "Fuchs Fuchs-e fiichs-isch fuchs-ig"
      ]
    },
    {
      "heading": "Hund Hund-e hand-isch hund-ig",
      "text": [
        "Consequently, Umlaut conditions must be inherited from several sources.",
        "The three levels of morphophonological generalisation for an umlauted plural form like FOchse have the following representations:",
        "L1, Morphotactic ID: [Fuchs * Plural] L2, Morphotactic QLP: [[Fuchs ° Umlaut] \" e] L3, Phonological: /f Y k s @/ Orthographic: \"fachse\"",
        "The DATR implementation fragment shown below can be interpreted fairly straightforwardly as a representation of a semantic inheritance net, in which the 'most specific' node is Fuchs, which has some typed properties of its own and inherits others via Noun E. Queries specify a starting node and an attribute path.",
        "The left hand side of an equation is required to match a prefix of the query path; if there is more than one match for a node, the longest matching path overrides any others.",
        "Inheritance from more general nodes on the right hand side of an equation is explicitly constrained by associating them with a path.",
        "This path replaces the matching prefix of the query path in any further inheritance.",
        "If node or path are not specified, the node or path from the current local (or global) query environment is transferred.",
        "In this implementation, the lexeme Fuchs inherits a full morphologically conditioned phonological/orthographic representation.",
        "In the lexical representation of Fuchs, the vowel is not specified for orthographic or phonological Umlaut.",
        "The vowel representation is inherited from a template with a vowel slot which conditionally inherits a [ + umlaut] or [- umlaut] morphological subcategory by multiple inheritance from the stem and affix concerned.",
        "The condition is implemented in DATR as nested inheritance:",
        "depending on the value of Plur: <stem cond> for the lexeme concerned.",
        "A fragment of the PI implementation in DATR is stated below.",
        "Typical PI mappings in DATR notation are: Fuchs: <orth infl plur> = (F u c h s e).",
        "Fuchs:<orth deriv ig-af > = uchsi g).",
        "A detailed account of the linguistic basis for the PI Umlaut model and the DATR implementation are given in Reinhard (1990a, 1990b)."
      ]
    },
    {
      "heading": "3.2. INTERCALATION IN ARABIC VERB MORPHOLOGY",
      "text": [
        "A number of linguistic descriptions and computational implementations have treated various aspects of Arabic verb conjugation (McCarthy 1982, Hudson 1984, Kay 1987, Calder 1989, Cahill 1990, Bird 1990, Gibbon 1990).",
        "The full range of generalisations is dealt with in the P1 model in an integrated morphological hierarchy, which is shown in the feature structure in Figure 1.",
        "The generalisations cover stem type (CV-skeleton) exceptions and subregularities, interactions between different morphological categories, and the relations between intercalation, prefixation and suffixation.",
        "Arabic morphology has an agglutinative (concatenative) verb inflectional structure (cf. Table 1).",
        "It is combined with a radical (consisting only of consonants) and a vocalism (determined by three morphological categories: aspect, voice, and stem type) which are both intercalated in complex consonant-vowel skeletons, which are themselves derivational morphemes (cf. the DATR theorems in Table 2).",
        "These different stem types in Arabic verb morphology modify the meaning of the radical In partially predictable ways (e.g. as causative, reflexive).",
        "Morphophonological intercalation involves association of marked vowels and consonants to fixed skeleton positions, and \"spreading\" of the initial vowel and the final consonant, e.g. imperfective active in stem type xi: [qtl ° <a,i> ° VCCWCVC] = naqtaalil\".",
        "Spreading is represented in feature structures by coindexing, and is implemented in DATR by treating the spreading vowel and consonant as defaults.",
        "The categories involved in a word like vanqatilna with radical It, as in yanqatilna min halaali al-harbi 'they (fem) are being killed in the war', are:",
        "Thus the morphological generalisations are the following:",
        "The fully specified representation for yanaatilna at level 2 is shown in a conventional feature notation In Figure 1.",
        "The attribute \"surf\" (= \"surface\") subsumes phonology and orthography.",
        "The QLP operators of concatenation and association are represented by Prefix and Suffix attributes and by re-entrancy indexing, respectively.",
        "gt1 ('to kill') and clW ('to roll').",
        "(Asterisks denote overgenerated unacceptable forms; unacceptability is due to morphophonological irregularity in stem type i and to semantic subregularities in the other stem types.",
        "Idiosyncratic unacceptability is not marked.)",
        "The compact lexeme representation in DATR Stem templates: notation is simply the following: Stem: The default root consonant (in this example 'I') spreads over all C positions in skeleton constituents which are unspecified for C1 or C2 radical consonants (e.g. in CVCVC, stem type vii, only the last consonant).",
        "The main generalisations about the skeleton template hierarchy are shown in the following excerpt from the DATR implementation (note the resemblance to context-free phrase structure rules; the concatenation operation is implicit in DATR list ordering):",
        "% glottal prefix stem t. iv % t prefix stem type v % n prefix stem type vii % st prefix stem type x Stem_type_prefix: == 0",
        "Syllable templates with morphotactic conditions for derivational class and instantiation from global root node:",
        "All other information about morphological composition and phonological QLP and feature structure is predictable, and derived from constituent node constraints.",
        "Coverage of the verb system is fairly complete, with all 15 triliteral and 4 quadriliteral stem types, including subregularities, stem type and aspect prefixes, and other inflectional prefixes and suffixes for person, number and gender."
      ]
    },
    {
      "heading": "4. CONCLUSION",
      "text": [
        "The PI approach to morphologically conditioned phonological and orthographic variation relates linguistically to word grammar (Hudson 1984), word syntax (Selkirk 1982) and to prosodic phonologies, and derives its computational features from DATR (Evans & Gazdar 1989); formally it relates closely to object-oriented morphology (Daelemans 1987), paradigmatic morphology (Calder 1989), and Bird's constraint-based phonology (1990).",
        "PI models use a unified formalism throughout, and thus differ radically from computational morphological systems with hybrid formalisms.",
        "These include two-level morphology with continuation lexica and two-level rules (Koskenniemi 1983), its derivates with feature-based lexicon and two-level rules (Karttunen 1987, Bear 1986, Trost 1990), and Cahill's DATR-driven morphology with phonological descriptions In MOLUSC (1990).",
        "Finally, PI models have broad linguistic coverage, capture significant generalisations over a wide range of typologically interesting morphological systems without ad hoc diacritics, and have a straightforward and well-defined implementation in DATR."
      ]
    },
    {
      "heading": "5. REFERENCES",
      "text": []
    }
  ]
}
