{
  "info": {
    "authors": [
      "Rebecca J. Passonneau"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P91-1009",
    "title": "Some Facts About Centers, Indexicals, And Demonstratives",
    "url": "https://aclweb.org/anthology/P91-1009",
    "year": 1991
  },
  "references": [
    "acl-J86-3001",
    "acl-P83-1007",
    "acl-P86-1031",
    "acl-P89-1007"
  ],
  "sections": [
    {
      "text": [
        "ABSTRACT' Certain pronoun contexts are argued to establish a local center (LC), i.e., a conventionalized indexical similar to lst/2nd pers.",
        "pronouns.",
        "Demonstrative pronouns, also indexicals, are shown to access entities that are not LCs because they lack discourse relevance or because they are not yet in the universe of discourse."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Referring expressions in discourse are multifunctional and dual-faced.",
        "Besides functioning to specify referents, they also indicate the status of their referents in the evolving discourse model, such as the informational status of being given or new [Pri81], or maintain the attentional status of being in focus {Sid83} [Gro77].",
        "They are dual-faced in that the surface form of a referring expression is constrained by the prior discourse context, and then increments the context, serving to constrain subsequent utterances [Isa75].",
        "As a consequence of this latter property, the communicative effect of many referring forms, especially pronouns, is relative to specific types of discourse contexts.",
        "The discourse reference functions of a few types of pronouns are examined, taking into account their multifunctionality and their dual nature, in order to clarify their processing requirements in dialogic natural language systems.",
        "In particular, a comparison of the conversational usage of it with two types of indexical pronouns indicates that certain uses of a, referred to as local centering, resemble what Kaplan [Kap89] refers to as pure indexicals.",
        "Several functions of that are also identified and shown to contrast with local centering with respect to their preconditions and effects.",
        "Third person, definite (3d) pronouns contrast with indexical pronouns because the referents of the former are arbitrary, and must be actively established as part of the current universe of discourse in order for the intended referent to be",
        "identified.",
        "In contrast, the referents of indexicals such as I and you (i.e., the speaker and addressee) are necessary components of the discourse circumstances.2 Indexical pronouns can be further classified into pure indexicals versus demonstratives,3 depending on how the current discourse circumstances provide their referents.",
        "The referent of a pure indexical is fully determined by the semantic rules and a context, which together pick out a unique referent for each use.",
        "Thus I refers to the person who utters it (assuming that I is used to refer).",
        "A pure indexical cannot refer to alternative entities, nor can any other expression pick out the relevant entity via the same type of referring function.",
        "Pure indexicals do not add entities to a context, or change the attentional status of their referents.",
        "In contrast, the referent of a demonstrative pronoun is not completely determined by the context plus the semantic rules.",
        "An accompanying demonstration is required, such as a physical or vocal gesture to something in the immediate discourse circumstances.",
        "Further, demonstratives can refer to anything in the context that can be demonstrated.",
        "In the cases of discourse deixis discussed by Webber [VVeb90], e.g., demonstrative pronouns are used to refer to discourse segments.",
        "Webber notes that in these cases, the demonstration consists in the intention to refer signalled by the use of the demonstrative, plus the semantics of the containing clause, plus attentional constraints on which discourse segments can be demonstrated.4 Thus, 3d pronouns, pure indexical pronouns, and demonstratives all differ with respect to the set of contextual elements that are available referents, and the manner in which the referent is related to the referring expression.",
        "Investigating their distinct discourse functions leads to extensions to the tri-2 The term indexical includes devices whose meaning pertains to the time, the place and the perceived environment of a discourse context, e.g., tense, deictic adverbs (here, there) and deictic pronouns (this, that) [Pei35).",
        "partite discourse model of attentional state, intentional structure and segmental structure proposed by Grosz and Sidner [GS86].5 The data presented here come from a set of dialogic interviews, originally described in [Sch85] (cf. also [Pas89]).",
        "The methodology, fully described in [Pas90], primarily involves the examination of linguistic choices that are in principle independent, but which are found to covary significantly often.",
        "Such covariation is presumed to serve communicative functions that discourse processing models need to replicate and explain.",
        "It should be remembered that the patterns of covariation described here represent pragmatically significant usage patterns, rather than obligatory ones."
      ]
    },
    {
      "heading": "2 Local Center",
      "text": [
        "In previous work, I presented the results of an analysis of the distribution of occurrences of it and that having explicit antecedents in conversational data from 4 interviews, involving 5 different speakers (N = 678) [Pas89].",
        "The two pronouns have similar syntactic contexts of occurrence thus differences in their distribution are pragmatic in nature, and stem primarily from the semantic contrast of demonstrativity with non-demonstrativity.",
        "Previously, I had noted that the data supported the centering rule (CR) [GJW83] and the property sharing principle (PSP) [Kam86].",
        "A review of the assumptions of the centering model, and of the conversational data, argues for an alternative view.",
        "In this section I reinterpret the results as establishing a distinct attentional state, local center.",
        "I explain the two property sharing patterns of Kameyama's PSP (subject and non-subject, [Kam86]) with respect to local center, and discuss the similarity between local centers and pure indexicals.",
        "Finally, I discuss the relation of local centering to intentional and segmental structure.",
        "According to the centering model, every utterance has a backward-looking center-the currently most salient entity, but it need not be overtly mentioned in the current utterance [GJW83].",
        "The centering rule (CR) [GJ W83], in combination with the property-sharing principle (PSP) [Kam86], predict certain preferred surface choices for maintaining the backward-looking center (Cb).",
        "The CR says that when the same Cb is maintained in a new utterance, it is likely to be expressed by ,a (3d) pronoun [GJW83].",
        "The PSP says that when 3d pronouns realize the Cb in adjacent utterances, they",
        "antecedents on pronoun choice, with observed frequency, expected frequency, and k-squares for each cell (individual cells are numbered for convenient reference) should both be subjects (canonical center retention) or both not subjects (non-canonical center retention) [Kam86].",
        "Given that the Cb can potentially be realized in non-preferred ways, that the Cb may change, or that it may be unexpressed, Cb has many possible surface realizations within a local discourse context of two s-adjacent utterances.",
        "The distinct effects of alternate realizations of Cb on segmental structure and intentional structure have not been explored.",
        "Also, since the centering model focusses on 3d pronouns, no claims are made regarding the relation of indexical pronouns to the discourse model.",
        "The empirical results presented in [Pas89) showed that two features of the utterances containing a pronoun and its antecedent were extremely",
        "predictive of lexical choice between it and that: the form of the antecedent (FA), and the grammatical role (GR) of both expressions.",
        "The best classifications were where FA had the three values – pronominal antecedent (PRO), full NP antecedent (NP), and other (OTH) – and where GR had the two values – subject (SUB) and non-subject (non-SUB).",
        "No other classifications of FA or GR were as predictive.7 It is crucial to note that these classifications were the minimal set that still preserved the distinctiveness of the distributions.",
        "Seven other surface features had previously been found to be non-predictive [Sch85].8 Table 1 shows a very strong correlation (p = .01%)9 between the form and GR of the antecendent (N1) and the lexical choice and GR of the co-specifying pronoun (N2).",
        "Exactly 2 contexts selected for it, as shown by the combination of the high cell x2s, and the low values for expected frequency, which together indicate that the observed frequency was significantly high.",
        "These 2 contexts were where the antecedent was PRO and where both expressions maintained the same GR value (cells 1, 7; PROGR, by itaR.",
        ")• Of these 2, the more significant context, and indeed the most significant context in the whole table, was where the antecedent was PROGR,„ (cell x2 = 27.1).",
        "This is also the context type where the demonstrative was predicted not to occur (i.e., where the antecedent was PROsuBJ; cells 2,4), indicating a functional opposition between it and that.1° Most of the cases of the PRO antecedents consisted of occurrences of it (65%), indicating that N1 and N2 often have the same form: it.",
        "Previously unreported data bear on the likelihood that adjacent tokens of it will co-specify.",
        "An analysis of all adjacent utterance pairs where each contained at least one token of referential it revealed that 30% were cases where both were subjects, of which 90% co-specified.",
        "In contrast, it occurred with opposing GR values 20% of the time, with comparatively fewer instances where both tokens co-specified (65%).",
        "In sum, the data show that given ari occurrence of it with an antecedent, the antecedent is likely 7Cf.",
        "fSch85] [Sch84] for how it was determined that these were the maximally predictive classifications.",
        "8Viz., speaker alternation, clause type (main or subordinate), parallelism, and various measures of distance between pronoun and antecedent (e.g., intervening utterances, intervening referents, syntactic depth).",
        "Note also that no significant variation with respect to FA and GR was found across individual speakers or conversations.",
        "9 Note that a probability of 5% or less is generally taken to be highly significant.",
        "1° The remaining 4 of the 8 PRO antecedent contexts were non-predictive.",
        "to be it, the GR of both expressions is likely to be SUB, and in either case (SUB or non-SUB), they will have the same GR value.",
        "The opposing GR pattern is not predictive (where GR of N1 is not the same as GR of N2).",
        "Nor is it predicted to occur with an antecedent NP, and is predicted not to occur with an antecedent 0TH.",
        "The 2 contexts singled out here indicate that it is a likely form for re-referring to a known, given entity – because the antecedent is PRO.",
        "Conversely, successive occurrences of it in Ui and Ui4.1 generally co-specify if they have the same GR.",
        "The entity referred to by it in these two patterns is called a local center.",
        "The following local center establishment (LCE) rule encapsulates how a local center is anticipated and maintained, both for discourse understanding (A) and generation (B).",
        "A: Recognizing a Local Center: Two s-adjacent utterances U1 and U2 establish entity E as a local center only if Ill contains a 3ds pronoun N1 referring to t, U2 contains a co-specifying 3ds pronoun N2, and N1 and N2 are both subjects or both non-subjects.",
        "In the canonical case, both are subjects.",
        "B: Generating a Local Center: To establish e as a local center in a pair of s-adjacent utterances IJ1 and U2, use an expression of type N to refer to E in both utterances where each token, N1 and N2, is a 3ds pronoun, and each is the subject of its clause or each is not the subject of its clause.",
        "In the canonical case, both should be subjects.",
        "(Precondition: To establish an entity E as a local center, e must be in the current focus space, and it must be possible to refer to it with a 3ds pronoun.)",
        "Recall from §1 that the process of interpreting a pure index requires no search or inference, but depends only on how the discourse circumstances are currently construed.",
        "The semantic value of a pure index is a contextual attribute – e.g., current speaker – that must have a particular referential value whenever an utterance occurs.",
        "In many ways, a pronoun fulfilling the LC function is like a pure index.",
        "Discourse initially, there is no LC, because the LCE rule depends minimally on an utterance pair.",
        "But for any utterance pair where the LCE rule has applied, there will be a discourse entity – a component of the speech situation – that is by default indexed to the use of subsequent referring expressions with the right lexico-grammatical properties.",
        "An LC conforms to the characteristics of a pure indexical in that it becomes established as a transient attribute of the speech situation analogous to the essential attribute current speaker.",
        "The relation of the referent to the referring expression is one",
        "to-one; no other referents are candidate LCs, and no other form can access the LC.",
        "The processing mechanism for interpreting subsequent expressions conforming to the LCE rule is highly constrained.",
        "It is analogous to, although not identical with, that for pure indexicals.",
        "The difference is that the local center is not lexicalized, but rather, must be established and maintained by certain conventions of usage.",
        "CPs can choose not to establish a LC, or can choose not to maintain it.11 Kameyama [Kam86] proposed canonical and non-canonical property sharing patterns, but did not discuss what governs the choice between them.",
        "Here it is suggested that the non-canonical LC pattern, illustrated in 1), results from the interaction of two distinct pragmatic effects.",
        "In the non-canonical LC contexts, where the LC was realized by non-SUB, the grammatical subjects were most often 1st or 2nd person pronouns.12 This data conforms to an empirically supported proposal made by Givon and others [Giv76] [Li76] that preferred subjects are animate rather than inanimate, definite rather than indefinite, pronouns rather than full NPs, and 1st or 2nd person rather than 3rd person, due to the facts that in English, grammatical subjects often express discourse topics (cf. also [FJ84]), that people prefer to talk about themselves and other people, and that discourse topics are given.",
        "The interviews examined here were intentionally biased towards the discussion of non-animate entities.13 But Givon's subject hierarchy predicts that, given a non-animate and an animate entity in a single utterance, the latter will more often occur as the subject.",
        "Since every matrix-clause utterance can have only one subject, there is potential competition for the subject role.",
        "The data show that when SUB, reserved by the LCE rule for establishing a local center, is preempted by a 1st or 2nd person pronoun, it is still possible for LC to be realized by alternate means, namely by sharing of non-SUB.",
        "Thus the sharing of the GR value across utterances is a defining characteristic, as noted by Kameyama [Kam86].",
        "The non-canonical LC con11 That CPs often do maintain an LC is borne out by data pertaining to cohesive chains, a succession of utterance pairs in which every utterance contains a co-specifying pronoun token.",
        "There were 101 cohesive chains in the interview data, ranging in length from 2 to 13 successive utterances, containing 506 pronouns, the majority of which involved LC contexts; cf. [Pas90].",
        "12 The two next most likely possibilities were an animate full NP, or a non-referential pleonastic element, e.g., existential there.",
        "After that, there was a very small heterogeneous category.",
        "Note: subject always refers to a surface grammatical function.",
        "13E.g., college courses, degree requirements, career options, resumês, and so on.",
        "figuration results from an interaction between two separate organizing forces: the LC status of the 3d pronoun referent, and the attentional prominence of the speaker and hearer.",
        "Sic: which'd be philosophy or history at U of C Sit: uh with that level students urn S2a: maybe with time and experience S21): I'll gain it S3: but I don't have it now In example 1), the utterance pair S2 and S3 share a 1st person subject and a non-canonical local center.14 In this case, the centering model cannot provide a principled answer to the question of whether the speaker – the grammatical subject – or the speaker's 'mental capacity' – referred to by successive 3d pronoun direct objects – is the current center.",
        "In the model proposed here, S2 and S3 establish 'mental capacity' as a local center, an attentional status for regulating the generation and production of 3ds pronouns, and the question of which entity is more salient does not arise.",
        "But local centering does seem to have a secondary function pertaining to the linkage between utterances at the level of intentional and segmental structure.",
        "In addition to sharing a default referent, clauses containing LC pronouns are often semantically alike in other ways.",
        "In an initial attempt to test for this similarity, utterance pairs with PRO antecedents were classified into those that did and did not conform to the LCE rule.",
        "No other contexts were examined because contexts with 0TH and NP antecedents were presumed to be even less like LC contexts.",
        "These utterance pairs were sorted into cases where the lexical root of the matrix verb in both clauses was identical (i.e., the verb of which the pronoun was an argument), but where the utterances were not verbatim repetitions.15 The results were that 30% of the LC contexts had the same verb, but only 11% of contexts differing from LC in that N2 was that instead of iL None of the contexts with opposing GR values for the two pronouns had the same verb, which is not surprising given that for most verbs, each argument position has a very distinct semantic role.",
        "In sum, by maintaining an LC and the same lexical verb,",
        "the speaker continues to predicate the same type of information about the same entity.",
        "This presumably serves as a cue that the speaker maintains a common Discourse Segment Purpose (DSP, [GS86]) throughout both utterances – to convey information about the local center with respect to the state of affairs conveyed by the verb.",
        "Insofar as local centering pertains to segment continuation, or to relating a new utterance to the DSP of a preceding utterance, a discourse plan to continue the current DSP need not refer directly to the surface grammatical choices which reflect that plan, but only to the current status of LC.",
        "If there is a current LC, then maintaining it would reflect the speaker's intention for the next utterance to continue the same DSP as the prior utterance.",
        "The data assembled here indicate that local centering not only constrains the interpretation of certain pronouns, but also conveys the inter-utterance relevance of locally centered entities in a larger discourse segment, or in the discourse as a whole.",
        "However, most of the entities referred to in the contexts represented in Table I are not LCs.",
        "Logically, that means they can fall into several classes: e.g., entities that are former or potential LCs because they are in the universe of discourse and are relevant to a former or future DSP; entities that are in the universe of discourse but are not LCs because they are peripheral to the current DSP; and finally, entities that are not yet in the universe of discourse.",
        "The next section will illustrate how the demonstrative picks out entities in the latter two classes."
      ]
    },
    {
      "heading": "3 New Entities, Anti-centers, and Non Entities",
      "text": [
        "The results presented in the preceding section indicate that referential it has different discourse effects, depending on its grammatical role, and on various properties of its antecedent, which in turn depend on the status of the referent in the discourse context.",
        "Just as local centering is only one discourse referring function that it participates in, it will be seen that there are several referring functions the demonstrative participates in, each with distinct preconditions and effects.",
        "Although pronouns are often thought of as identifying topical entities, that is not necessarily the case.",
        "English has a relatively impoverished inventory of pronouns in comparison to the Bantu language Chichewa, which has two sets of definite pronouns, one of which is morphologically incorporated into the verb stem, and the other of which consists of indepen",
        "dent morphemes [BM871.16 In their analysis of Chichewa, Bresnan and Mchombo argue that of the two non-argument grammatical roles in LFG, TOP(ic) and FOC(us), the independent pronouns can only fill the FOC role, not TOP [BM87].",
        "In their framework, no expression can simultaneously be TOP and FOC.17 This is reminiscent of the pragmatic contrast in English between it and that in focus-marking constructions, as illustrated in 2ab) below.",
        "That is acceptable, while it is not, as a syntactically focussed element:",
        "These examples are compatible with the conversational data in the following way.",
        "If TOP and FOC are truly contrastive grammatical functions, the above examples show that that is more acceptable as FOC.",
        "We have seen that it is less likely when the antecedent is NP or 0TH than when it is PRO, that it occurs often as SUB, and often with SUB antecedents.",
        "Thus it, whether fullfill-ing LC or not, correlates with other properties of discourse topics.",
        "An entity that has been referred to by an antecedent pronoun has already been located in the universe of discourse, and already has the informational status of given prior to the occurrence of the pronoun itself, and thus is a likely topic.",
        "We have also seen that that is unlikely with PROsuB antecedents, which would correlate with a presumed likelihood for that to not express TOP.",
        "But further evidence regarding the informational and attentional status of the likely referents of that reinforces the presumed TOP/FOG contrast.",
        "The first case we'll look at involves NP antecedents.",
        "Table 2 shows the distribution of antecedent NPs, classifed according to whether they were given or not, by lexical choice of it or that.",
        "A referent was classified as given if it had been",
        "mentioned previously, if it was closely associated with a previously mentioned entity (e.g., social worker and the social work profession), or if it was a commonly known individual entity whose identity would would be known to either speaker (e.g., places such as New York City).",
        "The very low probability for the )(2 of Table 2 (p = .01%) indicates that the tendency for that to occur with new antecedents and for it to occur with given antecedents is extremely significant.",
        "Further classifying the local utterance contexts by GR in various ways did not reveal any further significant distinctions.",
        "This result, while not counter-intuitive, is not one that would be obvious without looking at frequency distributions in actual on-line discourse, since it can easily and naturally be used to co-specify with a new antecedent, or that with a given antecedent.",
        "Some examples from the interviews are shown in 3-4) with the relevant pronoun token and its NP antecedent in boldface.",
        "They have been particularly selected to show that the occurring pronoun can be felicitously replaced with the opposite choice (shown in parentheses).",
        "Clo: it is the service that you give to other Clb: people be it as a doctor or a social worker a psychiatrist or a lawyer C2 you have a certain expertise C3: and people use that (it) C1: I know we've had information about it C2a: and uh if not you can a-C2b: just write directly to Bryn Mawr C3: and ask them about the program C4: and see if they still have it (that)",
        "One way to interpret these results is that a single reference to a new entity is insufficient to establish the entity as part of the universe of discourse, given the processing demands of actual on-line discourse.",
        "In the cases where an entity is already given, but is referred to by a full NP rather than a pronoun (for whatever reason), the entity can be successfully reinvoked in the immediately following utterance by a 3ds pronoun.",
        "If the entity is new, a single prior mention is not in general sufficient, with respect to these data, to predispose the use of a 3ds pronoun to reinvoke it.",
        "Instead, the demonstrative functions to incorporate these new entities into the context.",
        "The demonstrative has another singular function with NP antecedents.",
        "Table 1 singles out 2 significant contexts where there was a full NP",
        "an NP there was an increased likelihood for thatnonsuBJ and a decreased likelihood for itsuBJ.",
        "Because itsuBJ is the canonical indicator of LC, and because LCs are presumed to have discourse relevance (i.e., play a central role in the current DSP), I hypothesized that the linkage between an antecedent NPoS U BJ and a co-specifying thatno served nsu J to mark the referent as being unlike a local center by being peripheral to the current DSP.",
        "This was tested by examining how often an entity mentioned in the NP contexts was mentioned later in the discourse.",
        "Table 3 depicts the contexts in which an antecedent NP was followed by it or that, where GR for each was SUB or non-SUB, or where the GR values differed (X).",
        "These 6 contexts were coded for whether the referent was referred to again within the 10 utterances following the utterance containing the pronoun.",
        "If so, the entity was coded as relevant; else it was non-relevant.",
        "The low probability of 1.6% indicates a significant correlation.",
        "The 2 cells contributing the most to the overall significance were for the NP - non-suB/THATnon-suB context, with non-relevant entities occurring significantly often, and relevant entities occurring significantly rarely.",
        "This evidence supports the view that the features of this context function to re-invoke entities while simultaneously signalling their peripheral status.",
        "The final referring function discussed here is where the demonstrative has an 0TH antecedent.",
        "When N1 is OTHnonSUB (contexts 21-24), itsua is unlikely (context 21), and both cases of thatsuB (context 22) and thatnon-suB (context 24) are significantly frequent.",
        "I will argue that these 0TH contexts exemplify intra-textual deixis, which is analogous to the cases of discourse deixis studied by Webber [Web90].",
        "I refer to these cases as intra-textual deixis because the deictic reference involves referents related to grammatical constituents rather than to discourse segments.",
        "In previous work, I pointed out that the critical feature of the antecedent type which favors the lexical choice of that is syntactic, namely the distinction between NPs with lexical noun heads and other types of constituents [Sch84].",
        "Contexts where N1 is an NP whose head is a derived nominalization (such as the careful choice of one's words) pattern like those where the head is a lexical noun.I8 Gerundives fall into the 0TH class.",
        "Unlike NPs, the 0TH antecedents cannot be marked for definiteness: *a /*the carefully choosing one's words versus a jthe careful choice of words.",
        "Definiteness is one of the means for indicating whether a referent is presupposed to be part of the current context.",
        "Thus a possible difference between the interpretation of the two types of phrases carefully choosing one's words and a careful choice of words would have to do with whether there is a discourse entity in the context as a consequence of the occurrence of the phrase itself.",
        "Cay: about how to go about interviewing C4: and that's that's going to be important Another feature of 0TH antecedents pertains to their ability to evoke specific entities into the universe of discourse.",
        "Compare the two pronouns in example 5).",
        "The token of it in C2a unambiguously refers to the one book called Sweaty Palms.",
        "The referent of that in C4 is much harder to pin down.",
        "Does it correspond to interviewing, or to how to go about interviewing?",
        "This example illustrates an inherent vagueness in the processing of finding a textual referent for a demonstrative which I will now describe in more detail.",
        "Webber [Web90] notes that deictic reference is inherently ambiguous, although I prefer the term vague, in that vagueness connotes an underspecified interpretation that can be given a number of more specific readings.",
        "Webber argues persuasively that deictic reference to a discourse segment is restricted to references to open segments on the right frontier, but that there is still an ambiguity as to which segment might be referred to, due to the recursive nature of discourse segmentation.",
        "Since an open segment on the right frontier may contain 18 Mixed norninals, such as the careful choosing of one's words, occurred too rarely to have a discriminating effect on contexts favoring it or that.",
        "within it an embedded open segment that is also on the right frontier, a token of the demonstrative that refers to a discourse segment can be ambiguous between a more inclusive segment and a less inclusive one [Web90].",
        "The vagueness may be eliminated if the context in which the deictic expression occurs clearly selects one of the possible readings.",
        "This phenomenon pertaining to deictic reference to segments is replicated in the cases where that has an 0TH antecedent, thus in C4 of 5), the antecedent of the demonstrative pronoun could be interviewing, or the more inclusive expression go about interviewing, or the more inclusive one yet how to go about interviewing.",
        "I will now argue that such expressions do not in and of themselves introduce entities into the universe of discourse.",
        "The examples in 6)-8) show that entities introduced by referential NPs in U1 are still available for pronominal reference in U3, after an intervening U2.",
        "U1 introduces the referring expressions Carol and her dresses.",
        "Example 6) shows that the referent of her dresses is still available in U3 even though it is not mentioned in U2.",
        "Instead, U2 contains a pronoun that refers to the fact that is asserted by the whole utterance U1.",
        "In contrast, the referent of the non-nominal sentence constituent – Carol insisted on sewing her dresses from non-synthetic fabric – is not available after an intervening sentence that contains a deictic reference to a different non-nominal constituent, as in 7), or after an intervening sentence that contains a reference to a discourse entity mentioned in U1, as in 8).",
        "The preceding examples show that 0TH constituents do not introduce entities into the discourse context.",
        "With such antecedents, the demon",
        "strative does not access a preexisting discourse entity, but rather, plays a role in a referring function by virtue of which a new discourse entity is added to the context.",
        "The occurrence of the demonstrative triggers a referring function that is constrained by the semantics of the demonstrative pronoun and its local semantic context, the antecedent, and other contextual considerations.",
        "The result of applying an appropriate referring function is to increment the context with the new discourse entity that is found to be the referent of the demonstrative pronoun.",
        "This investigation has shown that a pronoun does not achieve discourse reference in and of itself.",
        "In combination with various linguistic properties of the prior utterance, and depending on the status of the referent in the context, a pronoun may have distinct referring functions.",
        "Although this investigation has focussed primarily on non-animate pronouns, future research is expected to show that elements of the contrast between it and that occur with animate 3d pronouns (e.g., he, she) since these pronouns have both demonstrative and non-demonstrative uses."
      ]
    }
  ]
}
