{
  "info": {
    "authors": [
      "Yves Lepage",
      "Shinichi Ando"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-2121",
    "title": "Saussurian Analogy: A Theoretical Account and Its Application",
    "url": "https://aclweb.org/anthology/C96-2121",
    "year": 1996
  },
  "references": [
    "acl-C90-3101"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In the Coups de linguisligue generale, Saussure mentions a phenomenon of tremendous importance in language, analogy.",
        "For example, given the series walk, walked and look, how cart we coin the fourth term, looked'?",
        "We give a possible account of this phenomenon in terms of edition distances, thus paving the way to computational applications.",
        "This explanation accounts for prefixing, suffixing and infixing.",
        "We show how it is possible to perform the analogical analysis and generation of sentences, using a treebank and approximate pattern-matching.",
        "As a consequence, our proposal finds its place in the example-based approach to natural language processing."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In the Coups de linguislique general, which dates hack to 1916, Saussure mentions a phenomenon of tremendous importance in language, analogy: given some series of three words, human beings are able to coin a fourth one.",
        "One can see a reactualisation of this principle in the example-based approach to machine translation.",
        "Analogy seems to have never been theorised in a monolingual framework, making its bilingual application questionable.",
        "The purpose of this article is to propose a possible, mathematically sound explanation, and to show the path to computational applications."
      ]
    },
    {
      "heading": "2 Saussurian analogy",
      "text": [
        "In Chapter four, Part tit of the Coups de linguislique Saussure points out what he calls analogy: given two forms of a given word, and only one form of a second word, it is possible to All examples in this section are from the Coors.",
        "coin the missing form2.",
        "In this particular case, Saussure was interested in explaining the competition of honor with the older (Orin hones.",
        "honor is not a phonetic transformation of honos by rhotacisrn, but simply the result of analogy.",
        "Analogy is very general, and its effects are seen in a number of other places.",
        "It may explain all flexional paradigms, from conjugation to declension`;.",
        "German: setzen : setzle ac en : x lachle Analogy also explains what is called the productivity of language, i.e., the fact that understandable words can be coined, which are not registered in dictionaries, and may have never been uttered before by the speaker nor heard before by the listener'.",
        "Finally, analogy also explains incorrect forms or barbarisms, examples of which are frequent in child language'.",
        "French: eleindrai: eleindre, viendrai : x x Our goal is to give one possible account of this phenomenon in computational terms, and to show that, given a treebank, a possible application may be the analysis or generation of sentences.",
        "2 6VeilOr (orator, speaker) and honor (honour) nominative singular, Oratorern and honOrent acensative singular.",
        "3 lochen (to laugh) and 8(4v:it (to put), Indite, set-zte past forms.",
        "4 reaction (reaction) and repression (repression) :nouns, r&ielionnairc (reactionary) adjective; reprcs-sionnaire sounds perfectly French, but will not be found in a dictionary.",
        "eterrolre (to extinguish; to turn off) infinitive, eleindrai and viendrai future tense; viendre is a barbarism in place of venir (to come) (compare, in :English, good for went)."
      ]
    },
    {
      "heading": "3 A possible account",
      "text": []
    },
    {
      "heading": "3.1 Notations",
      "text": [
        "Let V be a non-empty finite set, called the vocabulary.",
        "(V*, .)",
        "is the monoid over V where .",
        "denotes concatenation.",
        "V* is also the infinite union of all V' for n E IN.",
        "By convention, V° = -tel with E being the empty string.",
        "Using these notations, analogies are equations with one unknown on V*: u : v = w : x.",
        "To be able to solve analogies, it is necessary to give a meaning to such a notation."
      ]
    },
    {
      "heading": "3.2 A geometrical view",
      "text": [
        "In our attempt to discover a mathematical explanation of analogy, we were long hindered by the notation itself.",
        "Of course, the idea behind it is that analogy could be considered a similar psychological process as the one intervening in proportions:",
        "But Q, the set of rationals, is mathematically well equipped.",
        "Addition defines a commutative group, and multiplication makes it a field.",
        "Proportions in Q are thus well understood, and safely solved.",
        "What is true for Q is not for V. The basic operation, concatenation, is riot commutative and does not define a group, but a relaxed structure, that of a monoid.",
        "And no one knows what the meaning of u : v could possibly be.",
        "In fact, looking at analogy from the previous point of view is misleading because, intentionally or not, we think of numbers, which enforces too many constraints.",
        "A better, more relaxed view of the problem is that of a rectangle.",
        "In a rectangle, opposite sides and diagonals are equal (see Figure 1)."
      ]
    },
    {
      "heading": "3.3 Formalisation",
      "text": [
        "'['his view makes explicit that analogy sets a relation between an unknown on one hand, and three terms on the other hand.",
        "Now, carrying on with the geometrical parallel, analogy may be interpreted in terms of distances as follows : the distance of any term to the unknown is the same as the distance between the two remaining terms.",
        "We thus posit the following equivalence.",
        "The rectangle view does not forbid commutativity for dist, a notable difference with division on numbers, where 2/4 is not the same as 4/2."
      ]
    },
    {
      "heading": "3.3.1 Linguistic interpretation",
      "text": [
        "Let us linguistically interpret the previous system of equations.",
        "Suppose we get the following analogy to solve: mathematics : mathematical = physics : x.",
        "Of course, x = physical.",
        "The first two equations show that the terms on the diagonal may be exchanged.",
        "A linguistic interpretation is that analogy involves two orthogonal dimensions reflecting the duality of the lexeme/morpheme (or root/affix, or meaning/function, etc.)",
        "separation.",
        "On each side of the equal sign something is conserved (one dimension), and something changes (second dimension).",
        "• In the example, the first equation stands for a conservation in meaning (\"mathematics\" as opposed to \"physics\") and a change in categories, • whereas the second equation stands for a conservation of grammatical categories (N as opposed to A), but a change in meanings.",
        "The third equation means that, somehow, analogy neutralises changes performed at the same time along the two previous dimensions.",
        "On each side of the equality sign, both changes in meanings and categories, performed at the same time, leave the proportion unchanged."
      ]
    },
    {
      "heading": "3.3.2 Complete formalisation",
      "text": [
        "In order to complete the formalisation, dist remains to be defined.",
        "Edition distances which have been proposed in many works (1Levenshtein 65), (Wagner Fischer 74), (Selkow 77), etc., are a good candidate.",
        "They are mathematically sound as well as intuitively relevant: they reflect a sensible notion, that of keystrokes, and turn out to be metrics under some hypotheses.",
        "They answer the correction problem: what is the minimal number of edit operations needed to transform one word into another one?",
        "in our example, how many characters need to be changed to transform mathematical into physics?",
        "Edit operations are insertion (for instance, r p) , deletion (like 1 e) mathematical",
        "and replacement (like a –4 s).",
        "A distance can be defined by assigning weights to these three operations, 1 for each of them, for simplification.",
        "The edit distance is then a simple extension from edit operations to strings.",
        "Definition 2 (Edition distance) Let V be a vocabulary, dist is defined on V* as a commutative operation, in the following way:",
        "With this definition and a weight of 1 for each of the three edit operations, the distance between mathematical and physics becomes 9.",
        "As a mathematical result, with more general weights, it can be proved that, if the edit operations define a metric on V U {E}, then the edit distance on V* is also a metric.",
        "We recall the formal definition of a metric.",
        "• (commulativity) V(a, E S2, dist(a, dist(b, a) • (triangle inequality) V(a, b, E S3,",
        "dist(a, < dist(a, dist(b, c)"
      ]
    },
    {
      "heading": "3.4 Coverage",
      "text": [
        "Having defined what we understand by analogy in a formal way, we inspect some of its properties.",
        "We first make a very strong but necessary assumption about the nature of the solution of an analogy.",
        ":Following the linguistic feeling, we impose that the solution of an analogy be built only with the elements of the vocabulary present in the three given terms.",
        "In other words, no material from outside should be used.",
        "This constraint does not prevent analogies from having multiple solutions.",
        "It suffices that the distances become too large relative to the lengths of the words.",
        "a : the = of : x is such a case.",
        "The constraint eliminates, for instance, all words of the form txy, with x and y two letters outside of the set {a, e, f,h,o,L}, but does not bar tit, hhh, eee, which are solutions of this analogy.",
        "But, as a matter of fact, this kind of example does not make much linguistic sense."
      ]
    },
    {
      "heading": "3.4.1 Equality",
      "text": [
        "A degenerated case of analogy is when two of the three terms are equal.",
        "The only possible solution is then the third term.",
        "In other words, nothing new can really be said.",
        "This meets common sense.",
        "V(u, v) C (V*)2, u:u=v:x x=v This property is always true.",
        "It is proved thanks to the equality property of a metric: u : u = v : x dist(u, u) = 0 = dist(v, x) x v. Some important linguistic phenomena are covered by our proposal for linguistic examples.",
        "But the corresponding mathematical properties appear not to hold in the general case.",
        "In fact, studying the necessary and sufficient conditions under which they are true remains an open problem.",
        "It seems that, in all cases, it has to do with some \"weakest links\" along the pair of strings considered (minimisation of a sum of distances)."
      ]
    },
    {
      "heading": "3.4.2 Transitivity",
      "text": [
        "An important property which works in many cases, and at least on linguistic examples, but may not be true in the general case, is transitivity:",
        "Tins accounts for the fact that any representative in a group of conjugation/declension/etc.",
        "may be chosen as the model.",
        "In Ancient Greek, Ao-yoc is always taken as a model for the declension of the 1st group of masculine nouns, although any other word from the same group would have been as good."
      ]
    },
    {
      "heading": "3.4.3 Prefixes and suffixes",
      "text": [
        "Our definition of analogy fortunately captures linguistic cases where prefixes (or suffixes) are involved.",
        "u.t: tt.v = w.t : x x = w.v This is riot true in the general case.",
        "At least, x w.v always verifies the first two distance equations: dist(wt, u.v) dist(t, v) dist(w.t, w.v) dist(t, v) dist(u.t, w.i) dist(u, iv) dist(u.v, w.v) dist(u, w) thanks to a property of edit distances, which we give here without a proof: V (u, v, w) E (V*)3,",
        "dist(u.v, u.w) = dist(v, w).",
        "But the third equation may not always be verified.",
        "A sufficient condition for it to hold is that the joints between prefixes and suffixes minimise some sums of distances: dist(u.v, w.t) = dist(u, w) dist(t, v) dist(wi, w.v) This is the case when prefixes and suffixes arc dissimilar enough, as in our example with mathematics and phys-i-cal, but in the general case, only dist(u.v, tv .i) < dist(u, w) dist(v, ,t) holds."
      ]
    },
    {
      "heading": "3.4.4 Infixes and umlauts",
      "text": [
        "Sirnilarly to prefixing arid suffixing, our formalisation accounts for linguistic examples of in-fixing, a phenomenon well illustrated by semitic languages?",
        "(here, the replacement of an a by an i).",
        "it also accounts for some (not all) examples of sound changes, like umlaut in German'.",
        "These linguistic cases work partly thanks to the previous property of distances with prefixes."
      ]
    },
    {
      "heading": "3.4.5 Reduplication",
      "text": [
        "Unfortunately, our proposal does not render an account of reduplication.",
        "This would be necessary if we wanted to describe, for example, the formation of plurals in Malay/Indonesian: orang orang-orang9 .",
        "Here, a speculative remark would link the power of analogy with some class of languages; our proposal seems riot to go beyond regular languages."
      ]
    },
    {
      "heading": "4 Application",
      "text": [
        "In the sequel, we will apply the principle of analogy not on words anymore, but on sentences.",
        "In the same way as words are strings of characters, sentences are strings of words.",
        "So, the shift from words to sentences is just of matter of reformulation.",
        "We also recall that edit distances and edit operations are not confined to strings; they extend in a natural way to forests, and hence to trees.",
        "In fact, it is possible to give a definition of an edit distance on forests which generalises the definitions on strings (Wagner & Fischer 74) and on",
        "7 arsala (he sent) and aslama (he became converted) verbs 3rd person singular past; rnursilun (a sender) and rnuslimun (a convert) agent nouns.",
        "'Bala (pelt, skin) and Hals (neck) singular; Beilge and Hiilse plural.",
        "9 orang (human being) singular, orang-orang plural.",
        "trees (Selkow 77).",
        "Hence the possibility of applying analogy to trees.",
        "The example-based approach in machine translation, inaugurated by (Nagao 84) and illustrated by (Sadler and Vendelmans 90) or (Sato 90), for instance, relies on the assumption that, if two sentences are \"close\", then, their analyses should be \"close\" too.",
        "By consequence, if the analysis of a first sentence is known, the analysis of the second one could be obtained by performing slight \"modifications\" on it.",
        "A problem arises: where are the slight \"modifications\" to be performed, and what are they?",
        "In that matter, edit distances could help a lot: \"close\" means at a distance not too large, and \"modifications\" are edit operations."
      ]
    },
    {
      "heading": "4.1 Analysis by analogy 4.1.1 Principle",
      "text": [
        "Suppose we have a collection of sentences (a data-base) already analysed (in fact, a treebank).",
        "For a new sentence, called the prototype, our goal is to build its analysis, i.e., a corresponding tree.",
        "Of course, the ideal case is when the prototype is already present in the treebank, which means that the analysis is found there too.",
        "In general, the prototype will not be found in the treebank.",
        "The search may thus be relaxed to similar sentences.",
        "Now, if at least two different sentences are retrieved by approximate matching, a fourth one can be built by analogy.",
        "Figure 2 illustrates this: the prototype is in the upper left corner; the two sentences on its right and under it have been obtained by approximate matching.",
        "Knowing the respective distances between these three sentences (on the arrows), sentence x can be computed by analogy.",
        "If by chance sentence x belongs to the treebank, its analysis is also in the treebank.",
        "Now, a reverse process on trees delivers an analysis for the prototype, as illustrated in Figure 3.",
        "The three trees in the right and bottom corners are the corresponding analyses of the sentences of Figure 2.",
        "They were taken from the treebank.",
        "The distances are given on the arrows.",
        "Tree y is the solution of the analogy, and we claim that it is the analysis of the prototype sentence."
      ]
    },
    {
      "heading": "4.1.2 Implementation",
      "text": [
        "Approximate matching is retrieval of all sentences at a distance less than a threshold from a given prototype.",
        "Efficient algorithms, using dynamic programming, have been proposed to perform approximate matching (Ukkonen 83) and (Landau & Vishkin 88).",
        "Our method is somewhat different.",
        "We do as if we wanted to generate the entire set of sentences at a distance less than or equal to the threshold.",
        "In doing that, we introduce a don't care symbol representing any possible word.",
        "Pattern-matching with don't care symbols has already been studied (Pinter 85).",
        "Of",
        "the green lamp turns off 3 the green signal is on",
        "course, this naive solution implies an exponential explosion, but, fortunately, it is not necessary to consider the entire set of sentences, neither to generate them.",
        "Only sentences winch are substrings of other strings may be coded.",
        "'this allows us to use a simple non-deterministic version of the Aho k Corasick algorithm (Aho 8z (lorasick 75), which only checks the possible presence of patterns on an array of integer triples.",
        "Tins algorithm competes well with one of the most efficient, algorithm agrep (Wu k Manber 92), as it is faster in average."
      ]
    },
    {
      "heading": "4.1.3 Use and usefulness",
      "text": [
        "In a first implementation, rather than really computing solutions of analogies on trees, we retrieve them from the treebank using approximate matching.",
        "hxecution times are below one second for the analysis of short chunks of text (about 5 words).",
        "This technique helps a lot in the construction of treebanks.",
        "Firstly, building new linguistic structures for new sentences is definitely made faster.",
        "Secondly, this technique enforces consistency, a sensible issue in treebank construction, especially if treebanks are to be used to train probabilistic models.",
        "To have a more precise idea about the power of the method, we carried out some experiments on an excerpt of the treebank of the University of Pennsylvania (787 sentences with their corresponding analyses).",
        "For all possible 4-tuples of sentences which verify the analogy definition, we computed the analysis of the first sentence by analogy.",
        "We recall that there may be no solution, one solution, or several solutions.",
        "As a restriction in this experiment, we did riot consider distances between objects over half of the lengths of the objects.",
        "Recall in document retrieval, recall is defined as the ratio of the number of relevant documents retrieved over the total number of relevant documents in the data base.",
        "Here, we define the recall as the number of times the exact structure was computed by analogy, divided by the number of sentence pairs having the same structure in the treebank.",
        "In our experiment, the recall is 0.69, a quite good figure, which shows that the technique is promising.",
        "Precision Again, in document retrieval, precision is defined as the ratio of the number of rele",
        "vant documents retrieved over the total number of documents retrieved.",
        "Here, we define the precision as the number of times when the exact structure was computed by analogy divided by the number of solutions delivered.",
        "In the experinwnt, the precision is 0.43, which means that in almost half of the cases, one of the structures delivered is the right one.",
        "Now, in average, the structures delivered are far from the exact structure by 1.61 node, with a standard deviation of 1.86.",
        "This means that in average less that two nodes have to be edited in order to get the exact structure, the size of a structure in the treebank being 9.8 + 5.4 nodes."
      ]
    },
    {
      "heading": "4.2 Generation by analogy",
      "text": [
        "Generation may be performed in the same way as analysis, the difference being that the prototype is a tree and pattern-matching is performed on trees.",
        "The overall process is similar to the one for analysis, but in the opposite direction.",
        "The tool we have built for the edition of text with trees, allows approximate matching on trees, and generation is performed using the same functions as for analysis."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "We have proposed a possible theoretical explanation of analogy in terms of edit distances.",
        "As expected, this proposal renders an account of some important linguistic phenomena, in particular, prefixing, suffixing and infixing.",
        "Also, transitivity is verified by linguistic examples.",
        "Nevertheless, the exact mathematical properties, and especially, the necessary and sufficient conditions on strings under which the above mentioned properties hold remain for the large part to be studied.",
        "A possible application is analysis and generation by analogy.",
        "The proposed technique falls tinder the example-based approaches to natural language processing, but we think it may be safer than previous methods, because it relies on more information, and linguistically founded information.",
        "We have built a first implementation, which shows to be of great utility in accelerating the construction of treebanks and improving their consistency."
      ]
    }
  ]
}
