{
  "info": {
    "authors": [
      "Daniel Hardt"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-1088",
    "title": "Centering in Dynamic Semantics",
    "url": "https://aclweb.org/anthology/C96-1088",
    "year": 1996
  },
  "references": [
    "acl-J95-2003"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Centering theory posits a discourse center, a distinguished discourse entity that is the topic of a discourse.",
        "A simplified version of this theory is developed in a Dynamic Semantics framework.",
        "In the resulting system, the mechanism of center shift allows a simple, elegant analysis of a variety of phenomena involving sloppy identity in ellipsis and \"paycheck pronouns\"."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Centering (Grosz et al., 1995) and Dynamic Semantics' both concern the sequential processing of discourses, with particular emphasis on the resolution of pronouns.",
        "In Dynamic Semantics, the semantic structure of a discourse gives rise to constraints on the resolution of anaphoric expressions.",
        "Centering theory claims that a discourse always has a single topic, or center.",
        "Constraints on the resolution of anaphoric expressions arise, in part, from the ways in which the center can change in a discourse.",
        "There is an important difference in the way discourses are viewed in Centering and in Dynamic Semantics.",
        "In Dynamic Semantics, a discourse is viewed as a monotonic increase in information, as discourse referents are constantly added to the domain of discourse.",
        "Centering draws attention to a particular role that a discourse entity can hold; from time to time, the current center will be shifted with a new center.",
        "In this paper, I will implement a simplified version of the centering theory in a dynamic system, and of phenomena involving sloppy identity in ellipsis and \"paycheck pronouns\".",
        "Since Montague, a major goal of semantics has been to describe a compositional method for converting a syntactic representation of a sentence into a logical representation of the sentence meaning, and then to evaluate that representation with respect to a given context.",
        "A primary insight of dynamic semantics is that sentences have a systematic relation to context in two ways: not only are they evaluated with respect to the current context, but they also systematically change that context.",
        "This insight has particular relevance for the apparent puzzle presented by sloppy identity and related phenomena.",
        "While anaphoric expressions are normally thought to be identical in meaning to their antecedents, they receive a different interpretation than their antecedents in these cases.",
        "Given the dynamic perspective, the puzzle evaporates: the anaphoric expression and its antecedent might represent exactly the same meaning, since meaning is fundamentally a potential to be evaluated with respect to some context.",
        "What changes is the context, in the discourse intervening between antecedent and anaphoric expression.",
        "Consider the following example involving sloppy identity in VP ellipsis: (1) Tom1 loves hiss cat.",
        ".Iohni does too.",
        "[loves his, cat] The sloppy reading results from a change in context, in which the value of 1 becomes John rather than Tom.",
        "This allows an extremely simple account of the \"recovery mechanism\" involved in sloppy identity; the elided VP is exactly identical to its antecedent.",
        "Several authors (Gardent, 1991; Hardt, 1994) have suggested a dynamic account along these lines, arguing that sloppy identity and related phenomena reflect the reassignment of an index in the discourse context.2 Alternative approaches postulate complex recovery mechanisms for sloppy identity, such as higher-order matching (Dalrymple et al., 1991) or the syntactic matching of parallel dependencies (Fiengo and May, 1994).",
        "Below, I will argue that the dynamic account is more general and empirically adequate, as well as being simpler than alternative accounts.",
        "The dynamic account raises the following problem: since the index of the the initial \"controller\" is reassigned, it becomes inaccessible in subse",
        "served for the discourse center, and the discourse center will always occupy another index as well as 0.",
        "We will use the * to designate references to the discourse center.",
        "Thus the above example will be notated as follows: (2) Torn'* loves his* cat.",
        "John2* does too.",
        "[loves his* cat] In the first sentence, Tom is the value of index I, and is also the discourse center, i.e., the value of index 0.",
        "The pronoun his* is equivalent to hiso, and thus refers to the discourse center.",
        "In the second sentence, John becomes the value of index 2, and also replaces Torn as the discourse center and thus John becomes the value of index 0.",
        "'this center shift gives rise to the sloppy reading.",
        "However, both Torn and John remain accessible in subsequent discourse.",
        "The paper is organized as follows: In Section Two, I present a dynamic framework based on the system described in (Muskens, 1996), with extensions for the discourse center, VP ellipsis, and paycheck pronouns.",
        "Section Three concerns an \"expanded paradigm\" for sloppy identity; it is shown that the proposed approach uniformly accounts for a broad range of sloppy identity phenomena, including some not previously examined in the literature.",
        "Conclusions and plans for future work are given in Section Four."
      ]
    },
    {
      "heading": "2 A Dynamic Framework",
      "text": [
        "The basic dynamic framework is the dynamic logic system of (Muskens, 1996).",
        "This framework has, for the sake of simplicity, restricted the study of anaphora to pronouns that are extensionally identified with their antecedents'.",
        "I will extend Musket's' system to permit anaphora involving VP's as well as NP's, and to allow antecedents to be dynamic as well as ordinary (extensional) objects.",
        "In Muskens' system, linearized DRT boxes are integrated with the type logic (Church, 1940) that underlies Montague Semantics.",
        "Linearized DRT boxes are simply a more concise way of writing standard DRT boxes (Kamp, 1980).",
        "Muskens shows that DWI boxes can be viewed as abbreviations for expressions in ordinary type logic.",
        "Consider the following discourse: the discourse: A1 farmer walks.",
        "Het laughed.",
        "This is represented by the following linearized DRT box: [ui farmer(ui), walk(u1),laugh(Th )] 'There are several researchers who have extended dynamic frameworks to account for ellipsis and related phenomena: (Klein, 1984) is an early example.",
        "(Asher, 1993) examines a variety of extensions to the DRT framework.",
        "(van Eijck and Francez, 1993) explore similar issues of indexing and ellipsis in a dynamic setting.",
        "(Gardent, 1991) also extends a dynamic semantics system for ellipsis and anaphora.",
        "This is an abbreviation for the following type logic formula:",
        "In the above formula, the variables i and j represent input and output states, and the variable (akin to a discourse marker) is a function from states to individuals.",
        "In what follows, we use the DRT abbreviations without further comment.",
        "The reader is referred to (Muskens, 1996) for further examples and the details of the system.",
        "We now define a simple fragment of English, based on the one given in (Musket's, 1996).",
        "Note that the translation for hen refers to dr(ont(he„)).",
        "This is defined as the discourse representation of the antecedent of he„(see (Musket's, 1996, page 20)).",
        "The translation for and is the sequencing operator, ;.",
        "As described in (Muskens, 1996), the sequencing of two boxes K,K' is an abbreviation for the following type logic expression: I[1( I; K211 { I Ak(<i,k> e[If(11 Jz <k,j> c V211)1 Typically, two DIU' boxes appearing in sequence can be 'merged into a single box, consisting of the union of the discourse markers in the two boxes and the union of the conditions.",
        "This is described in the Merging Lemma of (Muskens, 1996, page 8).",
        "In the representations that follow, we will often merge boxes without comment to simplify representations.",
        "However, the merge of two boxes is not always possible - if there is a reassignment of an index, it will not be possible to perform the merge.",
        "This will arise in the cases of sloppy identity examined below.",
        "The above fragment, following the Kamp/Heim accounts, considers only one type of anaphora, involving individuals.",
        "We will extend the fragment in the following ways:",
        "• we will add the idea of a discourse center to the system • we will allow dynamic properties to be added to contexts, as antecedents for VP ellipsis • we will allow dynamic individuals to be added to contexts, to account for \"paycheck pronouns\""
      ]
    },
    {
      "heading": "2.1 Discourse Center",
      "text": [
        "We define position 0 in the context as the Pis-CMITSC Center.",
        "Al.",
        "any RiVell point in the discourse, the discourse entity designated as the discourse center occupies position 0 as well as its other position.",
        "We designate this with a *, as in the following example: (3) Al * farmer walks.",
        "-lie* laughed.",
        "This is represented as follows: [no,iii uo ui , farmer(in), walk(ut),laugh(u„ )1 In this discourse, the entity introduced by A] * farmer is the discourse center, and thus occupies position 0 as well as position We must add additional rules for indefinite expressions and names, when they add an object to context that is the discourse center.",
        "We will apply a very simplified version of centering theory, consisting of the following c:onstraints:",
        "• Every discourse utterance (except the discourse initial utterance) must have a center.",
        "• If any pronouns occur in an utterance, at least one pronoun must refer to the center.",
        "We define two types of transitions from one utterance to the next:",
        "1.",
        "Center Continuation: the center remains the same 2.",
        "Center Shift: the center changes",
        "The actual centering theory involves an additional data structure, the forward-looking centers, and defines four transition types, with a preference ordering among them.",
        "The reader is referred to (Gross et al., 1995) for a full account of this.",
        "For Our purposes, we will rely on the mechanism of center shift to implement the reassignment that we argue is crucial to the dynamic account of sloppy identity."
      ]
    },
    {
      "heading": "2.2 VP Ellipsis",
      "text": [
        "Next, we extend the system for VP ellipsis: first, verbs are separated into a base form and an inflection (INFL).",
        "This facilitates the treatment of VP ellipsis; the [NFL category adds the new property to the context, just, as the determiner \"a\" adds a new individual to the context.",
        "An alternative meaning for the IN.FL category is given for VPE occurrences, where a property is accessed from the input context.",
        "INFL„ A P Ax [P,„ 11.'„ Pi ; P(x) =->- dr (ant (INEL,„)) The -INF.",
        "!, category ranges over verbal inflections (PAST, PRES, etc.)",
        "and auxiliary verbs (do, should, etc.",
        ")4 Consider the following example of VP ellipsis: (1) a.",
        "'fora walks.",
        "john (loos too.",
        "h. Toni i * PRES2 walk.",
        "John3 does., too.",
        "The two sentences receive the following interpretations:",
        "Next, we join the two sentence interpretations with the sequencing operator, and we apply the value of P2 to",
        "Next, we will consider an example involving sloppy identity.",
        "To do this, it will be necessary to add genitive NP's, such as \"his cat\" to our system.",
        "We need two indices: 7/ is the index of he: this is an individual defined in input context.",
        "The index in is the index of the object possessed by he.,,; this object is added to the output context.",
        "(For clarity, we will often write hisncat,„; but; the \"official usage\" is hen 's„, cat.)",
        "Now, we examine a simple case of sloppy identity in VP ellipsis:",
        "(5) a.",
        "`Torn loves his cat,.",
        "John does too.",
        "b. Toni i* PRES2 love his* cat3.",
        "John does2 too.",
        "Next, we join the two sentences together and apply the value of P2 Is) 114:",
        "The antecedent for the VPE is \"love his cat\".",
        "This object (P2) is introduced into the context by PRES2.",
        "P2 represents the property of \"loving uo's cat\", where uo is the discourse center defined in the input context.",
        "In the first sentence, the center is TOM.",
        "The second sentence shifts the center to JOHN.",
        "It is this change in context that gives rise to the sloppy reading.",
        "Thus a sloppy reading is made possible when there is a center shift.",
        "Finally, we allow the possibility that a property might be the discourse center.",
        "This means we must add an alternative rule for INFL, so that it adds a property that is the discourse center: AP Ax [P„ I Po = Pr, = P] ; P(x)"
      ]
    },
    {
      "heading": "2.3 Paycheck Pronouns",
      "text": [
        "The phenomenon of \"paycheck pronouns\",5 is illustrated by the following example",
        "(6) Smith spent his paycheck.",
        "Jones saved it.",
        "The reading of interest is where the pronoun \"it\" refers to Jones' paycheck, although its antecedent (\"his paycheck\") refers to Smith's paycheck.",
        "Our account for this parallels the account of sloppy identity in VP ellipsis.",
        "The antecedent \"hisi paycheck\" introduces a dynamic individual: a relation between contexts that introduces i's paycheck to the output context, where the value of i is determined by the input context.",
        "The following rule makes it possible for NP's like \"his paycheck\" to add dynamic individuals to the context.",
        "We use variables of the form ui to denote ordinary extensional individuals; we use variables of the form xi to denote dynamic individuals.",
        "There are two distinct effects on the output context.",
        "First, the dynamic individual x„, is added to context: this object adds an individual um to a given context, such that urn is of un in that context.",
        "Second, x,„ is applied to the property P2.",
        "This actually adds urn to the current context.",
        "Finally, we need an alternative form for pronouns that refer to dynamic individuals: he„ 6 where 6 = dr(ant(he„)) The pronoun hen recovers x„ from the current context.",
        "The desired reading can now be derived as follows:",
        "(7) a. Smith spent his paycheck.",
        "Jones saved it.",
        "b. Smithi* PAST2 spend his* paycheck3.",
        "Jones4* PASTS save it3.",
        "We take the two sentences individually.",
        "The first sentence introduces the dynamic individual x3, as follows':",
        "This term comes from Kartunnen's example: The man who gave his paycheck to his wife was wiser than the one who gave it to his mistress.",
        "Various accounts of this phenomenon have been proposed, such as (Cooper, 1979; Engdahl, 1986; Jacobson, 1992; Gardent, 1991).",
        "(Heim, 1990) proposed extending the Sag/Williams account of VPE to the case of paycheck pronouns.",
        "Gardent makes a proposal similar to the current account: a dynamic approach in which paycheck pronouns and VPE are treated uniformly.",
        "We substitute the value of x3 for dr(ant(it3)):",
        "We perform A reductions, resulting in: 'To simplify the representation, we omit the values for VP variables P2 and P5, since they are not relevant to the current example.",
        "The complete discourse is represented as follows: Smith i* PAST2 spend his* paycheck3.",
        "The dynamic individual x3 adds the paycheck of 110 (the discourse center) to the context.",
        "In the second sentence, the discourse center is Jones.",
        "Thus we get the reading in which \"Jones saved Jones' paycheck\", as desired."
      ]
    },
    {
      "heading": "3 An Expanded Paradigm for Sloppy Identity",
      "text": [
        "The proposed theory permits a simple, uniform treatment of sloppy identity ill VPE and paycheck pronouns.",
        "Tins uniformity extends further.",
        "We simply permit sloppy identity for any pro-form, whenever the antecedent contains a proform within it.",
        "This is schematically represented as follows: CI• • • [xi' • • • [y ... C2 ... Ex1\"1 (C1, C2: \"controllers\" of sloppy variable YP) Here, XP is the antecedent for some proform XP', and VP is the sloppy variable, i.e., a proform embedded within XP.",
        "A sloppy reading results whenever there is a center shift involving and C2.",
        "That is, the interpretation of YP switches from controller Cl to C2.",
        "Since the dynamic theory treats VP ellipsis uniformly with NP proforms, XP and YP both range over NP and VP.",
        "This predicts four possibilities.",
        "All four possibilities in fact occur, as shown by the following examples:",
        "(8) Toni [vi' loves [NI, his] cat].",
        "John does too.",
        "(9) Smith spent [N1' his] paycheck].",
        "Jones saved it.",
        "(10) I'll help you if you [vi' want me to ] ].",
        "I'll kiss you even if you don't.'",
        "7 This example was provided by Marc: Gawron (p.c.",
        "), who attributed it to Carl Pollard.",
        "When Harry drinks, I always conceal [NP my belief that he shouldn't [vp ] ].",
        "When he gambles, 1 can't conceal it.",
        "Examples (8) and (9) have already been discussed.",
        "(8) is the familiar case in which the VP antecedent (XP) contains a sloppy pronoun (YP).",
        "P switches from Cl, Than, to C2, John.",
        "In example (9), we have an NP antecedent (XP) containing a sloppy pronoun (YP), and the two controllers for YP are Smith and Jones.",
        "Example (10) involves a VP antecedent containing a sloppy VP ellipsis; the VP ellipsis switches from help you to kiss you.",
        "Finally, example (11) involves an NP antecedent containing a sloppy VP ellipsis, switching from drinks to gambles.",
        "We have already seen how the sloppy reading is derived for (8) and for (9).",
        "We now show the derivation for (10) (example (11) can be derived in a similar fashion.",
        ")8: WILI1,2* help you3 [if] you3 PRES4 want mei to2.",
        "WILLS* kiss you3 [even if] you3 DO4 NOT.",
        "-=:>.",
        "[ill 430,1'2 ,u3 ,P4 I It] = LP() = P2 ,u3 = You,",
        "The variable P4 represents the property of \"wanting u1 to Po\".",
        "Below, we substitute the value Av([ I want(v,Po(nt ))]) for P4, and then substitute the value Av([ I help(v,u3)]) for Po, and apply it to 113, giving the following.",
        "result: WILL2* help you3 [if] you3 PRES4 want mei to2.",
        "WILI,5* kiss you3 [even if] you3 1)04 NOT.",
        "It is the \"center shift\" involving P2 (\"help you\") and P5 (\"kiss you\") that makes the desired reading possible.",
        "That is, \"what 113 doesn't; want is for ill to kiss u•\".",
        "The dynamic theory explains all four of these cases in the same way; the embedded proform in the antecedent can be sloppy, because the controller for the embedded proform can undergo a center shift.",
        "The cases illustrated by (10) and (11) 8We construct a representation as if the connectives if and even if were simple conjunctions.",
        "This allows us to avoid the complex issues involved in representing such \"backwards conditionals\" in a dynamic system.",
        "myclieck(u3), save(u4 ,u3)]",
        "have not, to my knowledge, been discussed previously in the literature.",
        "It is not clear how such examples could be handled by alternative theories, such as (Fiengo and May, 1994) or (Dalrymple et al., 1991), since these theories do not treat NP and VP anaphora in a uniform fashion."
      ]
    },
    {
      "heading": "4 Conclusions and Future Work",
      "text": [
        "The dynamic perspective provides a framework for a simple, intuitive account; of sloppy identity and related phenomena, by explaining the interpretive facts in terms of changes in context.",
        "This requires contexts to change in a way that is somewhat foreign to the dynamic perspective; a given position in the context must be reassigned, or shift its value.",
        "To implement this, I have incorporated the notion of discourse center, together with the mechanism of center shift, into a dynamic system.",
        "This makes it possible to give a novel, dynamic account of sloppy identity phenomena.",
        "I have shown that this approach accounts for an expanded paradigm of sloppy identity, going beyond the data addressed in alternative accounts.",
        "In future work, we will investigate incorporating additional aspects of centering theory, including the forward-looking centers list, and the preference orderings on transitions."
      ]
    },
    {
      "heading": "5 Acknowledgments",
      "text": [
        "Thanks to Claire Gardent, Aravind Joshi, Shalom Lappin, Mats Rooth, Stuart Shieber, Mark Steed-man, and Bonnie Webber for help in developing the basic approach described in this paper.",
        "Thanks to Reinhard Muskens for helpful comments on an earlier version of tins work.",
        "This work was partially supported by a Villanova University Summer Research Grant (1995), and an NSF Career Grant, no.",
        "1M-9502257."
      ]
    }
  ]
}
