{
  "info": {
    "authors": [
      "Yoshikazu Takemoto",
      "Takahiro Wakao",
      "Hiroshi Yamada",
      "Robert J. Gaizauskas",
      "Yorick Wilks"
    ],
    "book": "Workshop on TIPSTER Text Program",
    "id": "acl-X96-1059",
    "title": "NEC Corporation and University of Sheffield: Description of NEC/Sheffleld System Used for MET Japanese",
    "url": "https://aclweb.org/anthology/X96-1059",
    "year": 1996
  },
  "references": [
    "acl-M93-1014",
    "acl-M95-1017"
  ],
  "sections": [
    {
      "heading": "1 Introduction",
      "text": [
        "Recognition of proper nouns in Japanese text has been studied as a part of the more general problem of morphological analysis in Japanese text processing ([1] [2]).",
        "It has also been studied in the framework of Japanese information extraction ([3]) in recent years.",
        "Our approach to the Multilingual Evaluation Task (MET) for Japanese text is to consider the given task as a morphological analysis problem in Japanese.",
        "Our morphological analyzer has done all the necessary work for the recognition and classification of proper names, numerical and temporal expressions, i.e. Named Entity (NE) items in the Japanese text.",
        "The analyzer is called \"Amorph\".",
        "Amorph recognizes NE items in two stages: dictionary lookup and rule application.",
        "First, it uses several kinds of dictionaries to segment and tag Japanese character strings.",
        "Second, based on the information resulting from the dictionary lookup stage, a set of rules is applied to the segmented strings in order to identify NE items.",
        "When a segment is found to be an NE item, this information is added to the segment and it is used to generate the final output'."
      ]
    },
    {
      "heading": "2 System Description",
      "text": []
    },
    {
      "heading": "2.1 System Overview",
      "text": [
        "The main processes in the Amorph system are as follows:",
        "1.",
        "A basic morphological analysis is carried out on the input text using a simple dictionary.",
        "Part-of-speech information is added to the text.",
        "Since proper noun is not one of the parts of speech, all the nouns are tagged simply as noun.",
        "2.",
        "Three proper noun dictionaries (organization, person, location) are consulted for each noun in the text.",
        "If there is an exact match between a noun in the text and an item in one of these dictionaries, the noun is tagged as such.",
        "3.",
        "A \"co-occurrence\" (kyoukigo) dictionary which is a collection of key words is consulted.",
        "These",
        "key words are words which indicate that the segment is a part of a Named Entity item, or the segment is immediately before or after an NE item.",
        "When such a key word is found, it is marked as such.",
        "4.",
        "A set of rules for each type of NE items (organization, person, location, date, time, money, percent) is applied to the result so far.",
        "Some organization names are recorded temporarily in the system to identify the names which appear somewhere else in the text (name learning).",
        "If a segment (or segments) is judged to be an NE item by some rule or name learning, then it is marked so.",
        "5.",
        "Finally the output generation module produces the final output, marking NE items in the text with the specified SGML markup.",
        "The use of dictionaries (or lists) of proper names and key words, and the application of rules based on the dictionary lookup have also been adopted in the Sheffield English MUC-6 system ([4]).",
        "Figure 1 shows the overview of the Amorph system illustrating how the input text is processed."
      ]
    },
    {
      "heading": "3 Dictionaries",
      "text": [
        "The Amorph system uses three proper noun dictionaries and a key word dictionary.",
        "Table 1 shows the size of the proper noun dictionaries.",
        "The key word dictionary has 785 items in total.",
        "For example, \"A.\" (city) is a key word for a location name, \")cug\" (President) for a person name, and \"4±\" (Company) for an organization name.",
        "It has 61 key words for location, 324 for organization, 351 for person, and 49 for number and time expressions.",
        "Table 2 shows the sizes of key words for different types of the NE items."
      ]
    },
    {
      "heading": "4 Extraction Rules",
      "text": [
        "A set of rules is applied to the text after the dictionary lookup is done.",
        "These rules have been produced manually in order to capture different types of proper names as well as number and temporal expressions in the text.",
        "The Japanese language has four different kinds of characters: Hiragana, Katakana, Kanji (Chinese characters), and alphabetic characters, besides numerical and punctuation symbols.",
        "Some of the rules below use this feature, i.e. what kind of characters the given string is made of.",
        "Here are some rules for person and organization names.",
        "1. if the segment is positioned immediately before or after a person key word, and it is marked as",
        "either location or ambiguous between location and person name, then it is recognized as person.",
        "e.g. 4c.i...Ev: (Chiba) is ambiguous between location and person name, but since it is followed by a person key word, (Mr. in this case), \"--S\" is recognized as person.",
        "2. the segments are a Kanji-, Katakana-, or alphabet-character-only string and followed by a specific expression such as \" (AK4±\" (headquarters), they are judged to be an organization name.",
        "e.g. \"N E C (*4±I t\" (NEC, headquarters in Tokyo): \"N E C\" is an alphabet-character-only string and recognized as an organization name."
      ]
    },
    {
      "heading": "5 Name learning",
      "text": [
        "When a segment (or a set of segments) is recognized as organization name and at the same time it is an alphabet-character-only or katakana-character-only string, the system records it temporarily and use it to recognize appearances of the name in other places in the text.",
        "For example, a katakana-character-only string, )4 )1i • '2 (Mercedes Benz) is once recognized as organization name, both segments (.",
        ")1, 1 ?.X and 7:/ '2) are remembered as organization name to capture later appearances of the name (2 )t' ?",
        "A in this case) in the text.",
        "This mechanism of learning names is useful for recognizing organization names in the headline since organization names tend to be in shortened forms in the headline and their full names appear in the body of the text."
      ]
    },
    {
      "heading": "6 Acknowledgments",
      "text": [
        "We would like to thank Mr. Miyabe of NEC for his help in data analysis.",
        "We also thank Mr. Muraki of NEC for encouraging us to carry out the task."
      ]
    }
  ]
}
