{
  "info": {
    "authors": [
      "Barbara Di Eugenio"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-1060",
    "title": "The Discourse Functions of Italian Subjects: A Centering Approach",
    "url": "https://aclweb.org/anthology/C96-1060",
    "year": 1996
  },
  "references": [
    "acl-C90-2047",
    "acl-J94-2003",
    "acl-J95-2003",
    "acl-P87-1022"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper examines the discourse functions that different types of subjects perform in Italian within the centering framework (Grosz et al., 1995).",
        "I build on my previous work (Di Eugenio, 1990) that accounted for the alternation of null and strong pronouns in subject position.",
        "I extend my previous analysis in several ways: for example, I refine the notion of CONTINUE and discuss the centering functions of full NPs."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Interpreting referential expressions is important for any large coverage NL system; while such systems do exist for Italian, e.g. (Stock et al., 1993; Lombardo and Lesmo, 1994), to my knowledge not much attention has been devoted to the interpretation of Italian referential expressions.",
        "Some exceptions are (Samek-Lodovici and Strapparava, 1990), that discusses interpretation of referential expressions within dialogues to access a videodisc on Italian art; (Not and Zancanaro, 1995), that adopts a systemic grammar approach (Halliday, 1976); and (Di Eugenio, 1990), which uses centering theory (Grosz et al., 1995) to account for the alternation of null and strong subjects.",
        "In this paper, I build on and expand (Di Eugenio, 1990) in several ways.",
        "First, I reanalyze the hypotheses I proposed earlier with respect to a corpus of naturally occurring data:1 I show that those hypotheses are basically supported, and that when they aren't an elegant explanation can be found by looking at a two member sequence of centering transitions rather than at just one transition.",
        "Second, I extend my previous analysis by also discussing the centering functions of full NPs in subject position, and some occurrences of pronouns unaccounted for by centering."
      ]
    },
    {
      "heading": "2 Centering theory",
      "text": [
        "Centering theory (Grosz et al., 1986; Brennan et al., 1987; Grosz et al., 1995) models local coherence in discourse: it keeps track of how local focus varies from one utterance to the next.",
        "Centering postulates that:2 Each utterance U has associated with it a set of discourse entities, the FORWARD-WOKING CENTERS or Cfs.",
        "The Cf list is ranked according to discourse salience.",
        "The BACKWARD-LOOKING CENTER, or Cb, is the member of the Cf list that U most centrally concerns, and that links Unto the previous discourse.",
        "Finally, the PREFERRED CENTER, or Cp, is the highest ranked member of the Cf list.",
        "The Cp represents a prediction about the Cb of the following utterance.",
        "Transitions between two adjacent utterances Un__I and U, can be characterized as a function of looking backward whether Cb(U1) is the same as Cb(U_i) and of looking forward whether Cb(Um) is the same as Cp(U).",
        "Table 1 illustrates the four transitions that are defined according to these constraints.",
        "(Brennan et al., 1987) proposes a default ordering on transitions which correlates with discourse coherence: CONTINUE is preferred to RETAIN is preferred to SMOOTH-SHIFT is pre-'The examples in (Di Eugenio, 1990) were2 The version of centering I present here is from constructed.",
        "(Brennan et al., 1987).",
        "ferred to itouGli-sliwr.",
        "The saliency ordering on the Cf list, which is generally equated with grammatical function, for Western languages is SUBJECT > 013JECT2 > OBJECT > orrliElts, where OTHERS includes prepositional phrases and adjuncts.",
        "(Kameyama, 1985) was the first to point out that for languages such as Japanese empathy and topic marking affect the Cf ordering, and proposed the following ranking",
        "Western languages.",
        "Turan argues that a notion analogous to empathy arises in Western languages as well: e.g. with perception verbs, it is the experience') which is often in object position, rather than the grammatical subject, that should be ranked higher.",
        "Flintily, centering provides an interesting framework for studying the functions of pronouns, as the observation that the Cb is often deleted or pronominalized can be stated as the following rule: Rule 1 If some element of Cf(U, 4) is realized as a pronoun in U, then so is Cb(U).",
        "This rule has been computationally interpreted to individuate the Ch.",
        "If U has: oa single pronoun, that is Cb(U); zero or more than one pronoun, Ch(U) is: C1)(15. i) if Ch(U_. )",
        "is realized in U; - otherwise the highest ranked Cf(U. )",
        "which is realized in U.",
        "Let's apply centering to the constructed example in (2).",
        "In (2a) Cb = ?",
        "because the CI) of a segment initial utterance is left unspecified; in (2b) the Cb is John, as it is the only pronoun, and also the only entity belonging to the Cf list of (2a) 3(Grosz et al., 1986; Grosz et al., 1995) propose that the ordering on transitions pertains to sequences of transitions rather than to single transitions.",
        "realized in (21)).",
        "(2a) John is a nice guy.",
        "ii.",
        "She likes him.",
        "(RETAIN) Cb = John, Cf = [Mary > John] iii.",
        "She was with Lucy.",
        "(SMOOTH-SHIFT) Cb = Mary, Cf = [Mary > Lucy] iv.",
        "Lucy was with her.",
        "(RolICII-SHIFT) Cb = Mary, Cf = [Lucy > Mary] In (2c).i we have a CONTINUE, as its Cb is John (the highest entity on the Cf list of (2b)), and so is its Cp.",
        "In (2c).ii, the CI) is still John as in (2c).i, but the Cp now is Mary, thus we have a RETAIN.",
        "In both (2c).iii and (24iy the Cb is Mary (the only entity belonging to the Cf list in (2b) that is realized): as Mary is also the Cp in (2c).iii, a smoo'ru-suirr occurs.",
        "Instead, as Lucy is the Cp in (2c).iv, a itoticti-silWr occurs.",
        "Centering theory has appealing traits from both cognitive and computational points of view.",
        "From a cognitive perspective, it explains certain phenomena of local discourse coherence (e.g. pronominal \"garden paths\"), and is supported by psycholinguistic experiments (Gordon et al., 1993).",
        "Computationally, it is a simple mechanism, and thus it has been the basis for simple algorithms for anaphora resolution (Brennan et al., 1987).",
        "Much work still remains to be done on centering.",
        "For example, most development so far has been based on simple constructed examples: to apply centering to real text, issues such as how possessives and subordinate clauses affect referring expression resolution must be addressed.",
        "This paper is a contribution in that direction."
      ]
    },
    {
      "heading": "3 The Italian pronominal system",
      "text": [
        "Italian has two pronominal systems (Calabrese, 1986): weak pronouns, that must always be cliti-cized to the verb (e.g. lo, le, gli - respectively him, accusative; them, feminine accusative or her, dative; him, dative), and strong pronouns (lui, lei,",
        "loro - respectively he or him; she or her; they or them).4 The null subject is considered part of the system of weak pronouns.",
        "Weak and strong pronouns are often in complementary distribution, as strong pronouns have to be used in prepositional phrases, e.g. per lui, for him.",
        "However, this syntactic alternation doesn't apply in subject position.",
        "The choice of null versus strong pronoun depends on pragmatic factors; the centering explanation offered in (Di Eugenio, 1990) goes as follows: (3a) Typically, a null subject signals a CONTINUE, and a strong pronoun a RETAIN or a SHIFT.",
        "(3b) A null subject can be felicitously used in cases of RETAIN or SHIFT if in U the syntactic context up to and including the verbal form(s) carrying tense and / or agreement forces the null subject to refer to a particular referent and not to Cb(Un-i )- The evidence for (3b) provided in (Di Eugenio, 1990) derived, among others, from modal and control verb constructions, in which chides may be diticized to the infinitival complement of the higher verb or may climb in front of the higher verb.",
        "When the clitic climbs, certain pronominal \"garden path\" effects, deriving from a wrong interpretation initially assigned to the null subject and later retracted, are avoided."
      ]
    },
    {
      "heading": "4 Italian subjects in discourse",
      "text": []
    },
    {
      "heading": "4.1 The corpus",
      "text": [
        "The corpus amounts to about 25 pages of text, and 12,000 words; it is composed of excerpts from two books (von Arnim, 1989; Fallaci, 1989), a letter (Mila, 1993), a posting on the Italian bulletin board (SCI, 1994), a short story (Nichetti, 1993), and three articles from two newspapers (del Buono, 1993; Pagetti, 1993; La Nazione, 1994).",
        "The excerpts are of different lengths, with the excerpts from the two books being the longest.",
        "Texts were chosen to cover a variety of contemporary written Italian prose, from formal (newspaper articles about politics and literature), to informal (posting on the Italian bulletin board), and according to the following criteria: a) minimal direct speech, which has not; been addressed in cen-4Lui, lei, loro are the oblique forms of the strong system, while the nominative forms are respectively egli, ella, essi/e: in current Italian the latter forms are rarely used as the oblique forms have replaced them in subject position in my corpus there are only four occurrences of these nominative forms, and they all occur in the same article (Pagetti, 1993).",
        "tering yet; b) prose that describes situations involving several animate referents, because strong pronouns can refer only to animate referents.",
        "Table 2 shows the distribution of animate third person subjects partitioned into: full NPs - - the numbers in parentheses refer to possessive NPs; strong pronouns; null subjects - I counted only those whose antecedents are not determined by contraindexing constraints (Chomsky, 1981).",
        "; other anaphors (e.g. tutte, altf,) --- they won't be analyzed in this paper."
      ]
    },
    {
      "heading": "4.2 Issues",
      "text": [
        "When applying centering to real text, one realizes that many issues have not been solved yet.",
        "I will comment here on how deictics, possessives, and subordinate clauses affect centering.",
        "Deictics such as I, you, etc.",
        "The problem is whether they are part of the Cf list or not.",
        "I follow (Walker, 1993) in assuming that deictics are always available as part of global focus, and therefore are outside centering.",
        "Possessives.",
        "Table 3 includes a category marked possessive, which refers to full NPs that include a possessive adjective referring to an animate entity, such as i suoi sforzihis efforts.",
        "The problem is how possessives affect Cb computation and Cf ordering.",
        "While Cb computation does not appear to be affected by a possessive, that behaves like a, pronoun, the Cf ranking needs to be modified.",
        "An NP of type possessive refers to two entities, the possessor P07.",
        "and the possessed Ped.",
        "Ped corresponds to the full NP, and thus its position in Cf is determined by the NP's grammatical function; as regards P,., my working heuristics is to rank it as immediately preceding",
        "work, but needs to be rigorously tested.",
        "Subordinates.",
        "Another important issue, that has not been extensively addressed yet - but see (Kameyama, 1997; Suri and McCoy, 1993) -- is how to deal with complex sentences that include coordinates and subordinates.",
        "The questions that arise concern whether there are independent Cb's and Cf lists for every clause; if not, how the Cb of the complex sentence is computed, and how semantic entities appearing in different clauses are ordered on the global Cf list.",
        "In this paper, I will loosely adopt Kameyama's proposal (1997) that sentences containing conjuncts and tensed adjuncts are broken down into a linear sequence of centering \"units\", while tense354"
      ]
    },
    {
      "heading": "4.3 Centering Transitions",
      "text": [
        "Table 3 illustrates the distribution of referring expressions with respect to centering transitions.",
        "The number of full NPs in Table 3 is about half their number in Table 2: in fact, full NPs often introduce entities new to the discourse, in which case centering does not apply.",
        "Table 3 includes two columns that don't refer to centering transitions.",
        "The column labeled CENT-EST encodes referring expressions that don't refer to a member of Cf(U 1), but to an entity available in the discourse.",
        "While such transitions do not belong to centering, that models how centers change from one centering unit to the next, they constitute referential usages of pronouns that need to be explained.",
        "I call these transitions CENT-ESTAI3, for CENTER ESTAIII,NIIMENT, because such references appear to establish the new center of local discourse.",
        "Finally, orruEll includes e.g. expressions that build a set out of Cb(tin_ and some other entity, such as sia lui cite sna moglieboth him arid his wife.",
        "It is not clear how to deal with these constructions within the centering framework, and thus, I have left them unanalyzed for the Lime being.",
        "The results are as follows.",
        "Null subjects are, not surprisingly, the most frequently used expression - 58% - for CONTINUE'S; the difference between null subjects and all the other referring expressions is also statistically significant (x2 = 7.128, p <0.01).6 Vice versa, CONTiNUE's account for 70% of null subjects.",
        "However, even full NPs can be used for CONTINUE's - such usages accounts for 16% of coNTiNuE's, and for 20% of full NPs.",
        "'The situation for complements is more complicated, and space prevents me from discussing it.",
        "I3x2 test results are reported here more as a source of suggestive evidence than as strong indicators, as the observations in the corpus, which come from only 8 authors, are not totally independent.",
        "Also, 12% of CoNTIN lux's are encoded by means of possessive NP's, and vice versa, 41% of possessive NP's are used for co NT The situation for RETAIN's and SHIVr's is not very clear, as none of the four categories of referring expressions is predominant.",
        "All these suIrr's are actually SMOOTII-SIIIITIn's, i.e., there are no itomm-snwr's at all.",
        "This is not surprising for null subjects, that are never used for Roucu-suirr (Turan, 1995), however it is puzzling for full NPs.",
        "Apparently the Italian writers I selected adhere to the default ranking of transitions, in which ROUCTI-SIIIFT's are the least preferred.",
        "A significant difference in the usages of the four referring expressions regards C ENT-EST.",
        "In this case, full NP's are used 59% of the times, and the difference between full NP's, and all the other expressions is significant (x2 = 8.88, p <0.11).",
        "1 will now focus on the contrast between zeros and strong pronouns, in order to assess the strategies proposed in (3).",
        "Initially, (3a) - - zeros used for CONTINUE, strong pronouns for RETAIN and SHIFT - appeared not to be supported, not even as regards the preference for null subjects for CONTINUE: given the numbers in Table 3, the difference between zeros and strong pronouns used for CONTINUE is not significant (X2 2.436, p < (1.20).",
        "This finding puzzled me, because the usage of null subjects for CONTINUE seems to be a robust cross-linguistic phenomenon: it occurs in languages as diverse as ;Japanese (Kameyama, 1985; Walker et al., 1994; Shima, 1995) and Turkish (Turan, 1995).",
        "The puzzle can be solved by examining the transition preceding the CONTINUE in question.",
        "Table 4 shows the different possible transitions in U, that precedes IT_11 in which a CONTINUE occurs.",
        "The configuration in which a CONTINUE is preceded by a RETAIN, which I call R1 I'-CONY, differs from the other two because of the constraint Cp(U) Cb(U) in the RETAIN.",
        "This in a sense predicts that the center will shift: butt in a RE r355",
        "CONi' such prediction is not fulfilled.",
        "As Table 5 shows, this has some consequences on the usage of null and strong pronouns.",
        "Compared to strong",
        "(D Incomincero a ricondurre it suo pensiero sui suoi doveri chiedendole ogni giorno (I) will start to bring her thoughts back to her duties by asking her every day",
        "pronouns, null subjects are used 87% of the times for CONY-coNT and SHIFT-CONT taken together and only 45% of the times for ItET-CONT, and the puzzle discussed above is explained.",
        "In fact, in the case of CONT-CONT and SHIFT-CONT, there is a significant difference between zeros and strong pronouns, X2 = 6.279, p < 0.02.",
        "Instead, in the case of RET-CONT, there is no significant difference, x2 = 2.986, p < 0.10.7 Fig. 1 presents two examples of RET-CONT, one in (4c) realized with a strong pronoun, the second in (4e) realized with a null subject.",
        "In the utterance preceding (4a), Cb = Irais and Cf = [Irais].",
        "As far as RETA IN's and SH IFT's go, the numbers are both too small to draw any conclusion, and they don't seem t6 identify any preferred usage for strong pronouns, contrary to what claimed by (3a); also in the case of CENT-EST there doesn't seem to be any significant difference in usage.",
        "A topic for future work is to verify whether there are any factors affecting the choice between null and 'Also (Turan, 1995) independently noticed the existence of RET-corr's, and reports results similar to mine.",
        "Cf : [Irais] , Cb : Irais , continue",
        "strong pronouns in these cases, especially because null subjects used for shirr or for CENT-EST sometimes result in a slightly less coherent discourse.",
        "The second part of the claim, (3b) a null subject can be used if U provides syntactic clues that force the null subject not to refer to Cb(U0 I ) is supported; however, given the small numbers (four RETAIN's and six shir'r's) this conclusion can just be tentative.",
        "The most frequent clue is agreement in gender and / or number."
      ]
    },
    {
      "heading": "5 Conclusions",
      "text": [
        "In this paper, I examined the referring functions that different types of subjects perform in Italian within the centering framework.",
        "I built on the analysis presented in (Di Eugenio, 1990), and extended it in several directions: first, I used a corpus of really occurring examples; second, I included phenomena such as possessives and subordinate clauses; third, I refined the notion of",
        "CONTINUE by pointing out the peculiarity of BET-coNT's; fourth, I included full NPs; fifth, I illustrated a type of pronominal usage, tENT-EST, outside the purview of centering.",
        "Future work includes further analysis of a somewhat, surprising finding from the current study, i.e. that NP's encoding CONTINUE's are not, so rare.",
        "It, is worth while to examine the data farther, to see under which conditions a full NP is licensed to encode a CONTI N I 1 E. I also want to collect more HETCONT's, RETAIN's, and SM00T1I-Stillvt's to reline the analysis presented in this paper.",
        "Finally, another topic of research is EN'r-EST, even if it, is outside the centering framework, and under what, conditions zeros are used to encode it,."
      ]
    }
  ]
}
