{
  "info": {
    "authors": [
      "Michael A. Covington"
    ],
    "book": "Computational Linguistics",
    "id": "acl-J96-4002",
    "title": "An Algorithm to Align Words for Historical Comparison",
    "url": "https://aclweb.org/anthology/J96-4002",
    "year": 1996
  },
  "references": [
    "acl-J94-3004"
  ],
  "sections": [
    {
      "text": [
        "The first step in applying the comparative method to a pair of words suspected of being cognate is to align the segments of each word that appear to correspond.",
        "Finding the right alignment may require searching.",
        "For example, Latin do 'I give' lines up with the middle do in Greek diclmi, not the initial di.",
        "This paper presents an algorithm for finding probably correct alignments on the basis of phonetic similarity.",
        "The algorithm consists of an evaluation metric and a guided search procedure.",
        "The search algorithm can be extended to implement special handling of metathesis, assimilation, or other phenomena that require looking ahead in the string, and can return any number of alignments that meet some criterion of goodness, not just the one best.",
        "It can serve as a front end to computer implementations of the comparative method."
      ]
    },
    {
      "heading": "1. The Problem",
      "text": [
        "The first step in applying the comparative method to a pair of words suspected of being cognate is to align the segments of each word that appear to correspond.",
        "This alignment step is not necessarily trivial.",
        "For example, the correct alignment of Latin da with Greek dickimi is do didomi and notdo---- didomid--o-di----do di domi i or numerous other possibilities.",
        "The segments of two words may be misaligned because of affixes (living or fossilized), reduplication, and sound changes that alter the number of segments, such as elision or monophthongization.",
        "Alignment is a neglected part of the computerization of the comparative method.",
        "The computer programs developed by Frantz (1970), Hewson (1974), and Wimbish (1989) require the alignments to be specified in their input.",
        "The Reconstruction Engine of Lowe and Mazaudon (1994) requires the linguist to specify hypothetical sound changes and canonical syllable structure.",
        "The cognateness tester of Guy (1994) ignores the order of segments, matching any segment in one word with any segment in the other.",
        "This paper presents a guided search algorithm for finding the best alignment of one word with another, where both words are given in a broad phonetic transcription."
      ]
    },
    {
      "heading": "* Artificial Intelligence Center, The University of Georgia, Athens, Georgia 30602-7415. E-mail: mcovingt@ai.uga.edu 1996 Association for Computational Linguistics",
      "text": [
        "Computational LinguisticsVolume 22, Number 4 The algorithm compares surface forms and does not look for sound laws or phonological rules; it is meant to correspond to the linguist's first look at unfamiliar data.",
        "A prototype implementation has been built in Prolog and tested on a corpus of 82 known cognate pairs from various languages.",
        "Somewhat surprisingly, it needs little or no knowledge of phonology beyond the distinction between vowels, consonants, and glides."
      ]
    },
    {
      "heading": "2. Alignments",
      "text": [
        "If the two words to be aligned are identical, the task of aligning them is trivial.",
        "In all other cases, the problem is one of inexact string matching, i.e., finding the alignment that minimizes the difference between the two words.",
        "A dynamic programming algorithm for inexact string matching is well known (Sankoff & Kruskal 1983, Ukkonen 1985, Waterman 1995), but I do not use it, for several reasons.",
        "First, the strings being aligned are relatively short, so the efficiency of dynamic programming on long strings is not needed.",
        "Second, dynamic programming normally gives only one alignment for each pair of strings, but comparative reconstruction may need the n best alternatives, or all that meet some criterion.",
        "Third, the tree search algorithm lends itself to modification for special handling of metathesis or assimilation.",
        "More about this later; first I need to sketch what the aligner is supposed to accomplish.",
        "An alignment can be viewed as a way of stepping through two words concurrently, consuming all the segments of each.",
        "At each step, the aligner can perform either a match or skip.",
        "A match is what happens when the aligner consumes a segment from each of the two words in a single step, thereby aligning the two segments with each other (whether or not they are phonologically similar) A skip is what happens when it consumes a segment from one word while leaving the other word alone.",
        "Thus, the alignment a b c - - b d e is produced by skipping a, then matching b with b, then matching c with d, then skipping e. Here as elsewhere, hyphens in either string correspond to skipped segments in the other.'",
        "The aligner is not allowed to perform, in succession, a skip on one string and then a skip on the other, because the result would be equivalent to a match (of possibly dissimilar segments).",
        "That is, of the three alignments a b - c a - b c a b c a - d c a d - c a d c only the third one is permitted; pursuing all three would waste time because they are equivalent as far as linguistic claims are concerned.",
        "(Determining whether b and d actually correspond is a question of historical reconstruction, not of alignment.)",
        "I call this restriction the no-alternating-skips rule.",
        "To identify the best alignment, the algorithm must assign a penalty (cost) to every skip or match.",
        "The best alignment is the one with the lowest total penalty.",
        "As a first",
        "CovingtonAn Algorithm to Align Words approximation, we can use the following penalties: 0.0 for an exact match; 0.5 for aligning a vowel with a different vowel, or a consonant with a different consonant; 1.0 for a complete mismatch; 0.5 for a skip (so that two alternating skipsthe disallowed casewould have the same penalty as the mismatch to which they are equivalent).",
        "Then the possible alignments of Spanish eland French le (phonetically [la]) are: e 1 1 a2 complete mismatches= 2.0 -el l a 2 skips + 1 vowel pair= 1.5 e 1 - - 1 a2 skips + 1 exact match= 1.0 The third of these has the lowest penalty (and is the etymologically correct alignment).",
        "3.",
        "The Search Space Figure 1 shows, in the form of a tree, all of the moves that the aligner might try while attempting to align two three-letter words (English [hz] and German [hat]).",
        "We know that these words correspond segment-by-segment,2 but the aligner does not.",
        "It has to work through numerous alternatives in order to conclude that h x z hat is indeed the best alignment.",
        "The alignment algorithm is simply a depth-first search of this tree, beginning at the top of Figure 1.",
        "That is, at each position in the pair of input strings, the aligner tries first a match, then a skip on the first word, then a skip on the second, and computes all the consequences of each.",
        "After completing each alignment it backs up to the most recent untried alternative and tries a different one.",
        "\"Dead ends\" in the tree are places where further computation is blocked by the no-alternating-skip rule.",
        "As should be evident, the search tree can be quite large even if the words being aligned are fairly short.",
        "Table 1 gives the number of possible alignments for words of various lengths; when both words are of length n, there are about 3n-1 alignments, not counting dead ends.",
        "Without the no-alternating-skip rule, the number would be about 5\"/2.",
        "Exact formulas are given in the appendix.",
        "Fortunately, the aligner can greatly narrow the search by putting the evaluation metric to use as it works.",
        "The key idea is to abandon any branch of the search tree",
        "Search space for aligning English /hz/ with German /hat/.",
        "as soon as the accumulated penalty exceeds the total penalty of the best alignment found so far.",
        "Figure 2 shows the search tree after pruning according to this principle.",
        "The total amount of work is roughly cut in half.",
        "With larger trees, the saving can be even greater.",
        "To ensure that a relatively good alignment is found early, it is important, at each stage, to try matches before trying skips.",
        "Otherwise the aligner would start by generating a large number of useless displacements of each string relative to the other, all of which have high penalties and do not narrow the search space much.",
        "Even so, the algorithm is quite able to skip affixes when appropriate.",
        "For example, when asked to align Greek didOmi with Latin dO, it tries only three alignments, of which the best two are:",
        "(reflecting the fact that affixes tend to be contiguous) 50Skip not preceded by another skip in the same word It follows that the input to the aligner should be in broad phonetic transcription, using symbols with closely similar values in both langauges.",
        "Excessively narrow phonetic transcriptions do not help; they introduce too many subtle mismatches that should have been ignored.",
        "Phonemic transcriptions are acceptable insofar as they are also broad phonetic, but, unlike comparative reconstruction, alignment does not benefit by taking phonemes as the starting point.",
        "One reason is that alignment deals with syntagmatic rather than paradigmatic relations between sounds; what counts is the place of the sound in the word, not the place of the sound in the sound system.",
        "Another reason is that earlier and later languages are tied together more by the physical nature of the sounds than by the structure of the system.",
        "The physical sounds are handed down from earlier generations but the system of contrasts is constructed anew by every child learning to talk.",
        "The aligner 's only job is to line up words to maximize phonetic similarity.",
        "In the absence of known sound correspondences, it can do no more.",
        "Its purpose is to simulate a linguist's first look at unfamiliar data.",
        "Linguistic research is a bootstrapping process in which data leads to analysis and analysis leads to more and better-interpreted data.",
        "In its present form, the aligner does not participate in this process."
      ]
    },
    {
      "heading": "5. Results on Actual Data",
      "text": [
        "Tables 3 to 10 show how the aligner performed on 82 cognate pairs in various languages.",
        "(Tables 5-8 are loosely based on the Swadesh word lists of Ringe 1992.)",
        "These are \"difficult\" language pairs.",
        "On closely similar languages, such as Spanish/Italian or German/Danish, the aligner would have performed much better.",
        "Even so, on Spanish and Frenchchosen because they are historically close but phonologically very differentthe aligner performed almost flawlessly (Tables 3 and 4).",
        "Its only clear mistake is that it missed the 1:r correspondence in arbre : tirbol, but so would the linguist without other data.",
        "With English and German it did almost as well (Tables 5 and 6).",
        "The s in this is aligned with the wrong s in dieses because that alignment gave greater phonetic similarity; taking off the inflectional ending would have prevented this mistake.",
        "The alignments of mouth with Mund and eye with Auge gave the aligner some trouble; in each case it produced two alternatives, each getting part of the alignment right.",
        "English and Latin (Tables 7 and 8) are much harder to pair up, since they are separated by millennia of phonological and morphological change, including Grimm's Law.",
        "Nonetheless, the aligner did reasonably well with them, correctly aligning, for example, star with stella and round with rotundus.",
        "In some cases it was just plain wrong, e.g., aligning tooth with the -tis ending of dentis.",
        "In others it was indecisive; although it found the correct alignment of fish with piscis, it could not distinguish it from three alternatives.",
        "In all of these cases, eliminating the inflectional endings would have resulted in correct or nearly correct alignments."
      ]
    },
    {
      "heading": "6. Improving the Alignment Algorithm",
      "text": [
        "This alignment algorithm and its evaluation metric are, in effect, a formal reconstruction of something that historical linguists do intuitively.",
        "As such, they provide an empirical test of theories about how historical reconstruction is practiced.",
        "There are limits to how well an aligner can perform, given that it knows nothing about comparative reconstruction or regularity of correspondences.",
        "Nonetheless, the present algorithm could be improved in several ways.",
        "Alignments obtained with test set of English-Latin cognate pairs.",
        "and : ante at : ad blow :flare ear : auris eat : edere fish : piscis flow :fluere star : stela full : pltnus grass : gra-men heart : cordis (gen.) horn : coma",
        "CovingtonAn Algorithm to Align Words Table 8 Alignments obtained with test set of English-Latin cognate pairs (continued).",
        "knee : genii mother : mdter mountain : mins--niy g e n fi ma wn t on m(5 - n s - - name : nO-menma 6 a r ma t e rnyuwn owu s new : novus one : Rnus round : rotundusmawn t on ma - n - s sew : suere sit : sedere three : tresn e ym - - n(3 men tooth : dentis (gen.) thin : tennisn y uw - - n - owu s",
        "Kay (1964) noted that the \"right\" set of alignments (of each of the cognate pairs) is the set that produces the smallest total number of sound correspondences.",
        "Steps 1 and 2 could therefore be automated by generating all possible alignments of all of the cognate pairs, then choosing the set of alignments that gives the fewest correspondence sets.",
        "As Kay notes, this is not practical.",
        "Suppose the putative cognates are each 3 segments long.",
        "There are then 9 different alignments of each cognate pair, and if 100 cognate pairs are to be considered, there are 9100 :----- 2.65 x 1095 sets of alignments to choose from, far too many to try on even the fastest computer.",
        "However, a guided search along the same lines might well be worthwhile.",
        "First choose one alignment for each cognate pairthe best according to the evaluation metric, or if several are equally good, choose one arbitrarily.",
        "Construct the entire set of correspondence sets.",
        "Then go back and try one or two alternative alignments for each",
        "pair, noting whether the size of the set of correspondence sets decreases.",
        "If so, adopt the new alignment instead of the previous one.",
        "For a set of 100 cognate pairs, this requires a total of only a few hundred steps, and the result should be close to the optimal solution.",
        "Reduction of correspondence sets to proto-phonemes is, of course, a separate task requiring a knowledge base of phonological features and information about phonetic plausibility.",
        "Appendix: Size of the Search Space The total number of alignments of a pair of words of lengths m and n can be calculated as follows.'",
        "Recall that a match consumes a segment of both words; a skip consumes a 4 For assistance with mathematics here I am greatly indebted to E. Rodney Canfield.",
        "I also want to thank other mathematicians Who offered helpful advice, among them John Kececioglu, Jeff Clark, Jan Willem Nienhuys, Oscar Lanzi III, Les Reid, and other participants in sci.math on the Internet."
      ]
    }
  ]
}
