{
  "info": {
    "authors": [
      "Done-Young Lee"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-2117",
    "title": "Computation of Relative Social Status on the Basis of Honorification in Korean",
    "url": "https://aclweb.org/anthology/C96-2117",
    "year": 1996
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper presents a way to compute relative social status of the individuals involved in Korean dialogue.",
        "Every Korean sentence indicates whether honorification occurs in it.",
        "The occurrence of honorification in a sentence is constrained by relative social status of the individuals involved in the sentence.",
        "By using the information about social status and the information about sentence-external individuals such as speaker and addressee, we can explain why a sentence is felicitous in a restricted context and whether a dialogue is coherent or not.",
        "Since it is possible and easy to include such contextual information in the HPSG formalism, that formalism is adopted here.",
        "The implementation of Korean dialogue processing and the computation of social status is made based on ALE system."
      ]
    },
    {
      "heading": "1 Preliminaries",
      "text": [
        "In the conventional approach to honorification in Korean, attention has been paid to subject honorifica-lion and a sentence itself though the Korean honorification system consists of three types of honorification (that is, subject honorification, object honorification, and addressee honorification) and the sentence-external individuals (i.e., speaker and addressee) play an important role in the honorification system.",
        "In our approach speaker and addressee are specified for each sentence and all three types of honorification are considered simultaneously.",
        "In addition the approach uses the information about the sentence-external individuals as well as the individuals mentioned in a sentence to compute relative social status.",
        "In Head-driven Phrase Structure Grammar (HPSG) (Pollard and Sag, 1994) the information about speaker and addressee can he included in a lexical sign and thus that grammar formalism is adopted in our approach.",
        "This paper shows how to compute relative social status of the persons involved in a dialogue which is a series of sentences.",
        "The attempt to compute social status of the individuals involved in a dialogue has never been made before.",
        "A dialogue processing and the computation of relative social status are implemented using the system of ALE (Carpenter and Penn, 1995).",
        "Knowledge of honorific morphemes in Korean is requisite to the inference of social status and thus it is explained in Section 2.",
        "The problem with the previous approach and the reason why a sign-based approach is suitable to the computation of social status are presented in Section 3.",
        "Section 4 deals with the inference of social status in a coherent dialogue and the detection of an incoherent dialogue.",
        "Section 5 presents the implementation of dialogue parsing and the computation of relative social status within the ALE system.",
        "Finally in Section 6 the importance of the contextual information and the advantages of our approach are discussed."
      ]
    },
    {
      "heading": "2 Morphemes Relevant to Honorification",
      "text": [
        "Depending on who is respected by speaker, the honorification type is determined (for example, when a subject referent, an object referent, and addressee are honored by speaker, subject honorification, object honorification, and addressee honorification occur, respectively).",
        "The linguistic realization of these types of honorification is manifested by specific morphemes such as an honorific suffix, honorific case markers, an honorific infix, honorific verbal endings, and humble verb forms.",
        "Let us look at them one by one.",
        "First, when the honorific suffix nim attaches to an NP, the referent of the NP is respected by speaker.",
        "Second, if an honorific case marker is used, the referent of the NP to which the honorific case marker attaches is respected by speaker.",
        "Plain (i.e., non-honorific) case markers and honorific case markers corresponding to them are as shown in (1 )."
      ]
    },
    {
      "heading": "(1) Case Markers",
      "text": [
        "---------,nominativegenitivedativeaccusative plainka, iHyeykeyul, lul honorifickkeysekkey-Since neither an honorific genitive case marker nor a honorific accusative case marker exists, the referent of a genitive NP or an accusative NP is respected when the genitive NP or the accusative NP contains the honorific suffix nim.",
        "It is also possible to attach both the honorific suffix nim and an honorific case marker to an NP.",
        "Third, the honorific infix si appearing in a verb indicates that the referent of a subject NP is respected by speaker.",
        "Fourth, honorific verbal endings indicate that speaker shows honor or courtesy to addressee.",
        "The plain verbal endings and honorific verbal endings are as illustrated in (2).",
        "(2) a. Declarative Verbal Ending -----------_,formalinformal plaintoe, a honorific(su)pnita((y)e)yo h. Interrogative Verbal Ending ----------____formalinformal plain(nu)nkani, e, a honorific(su)pnikka((y)e)yo The relationship between speaker and addressee determines whether a formal verbal ending or an informal verbal ending can be used.",
        "For example, when a conversation is made between friends, an informal verbal ending is used.",
        "On the other hand, when a businessman talks to another businessman, a formal verbal ending is used.",
        "An honorific verbal ending is used when the social status of addressee is higher than that of speaker (in this case speaker shows honor to addressee) or when the social status of speaker is higher than that of addressee (in this case speaker shows courtesy to addressee).",
        "Thus from an honorific verbal ending we can infer that the social status of speaker and addressee is not equal.",
        "Finally, the use of a humble verb form indicates that an object referent is respected by speaker and that the social status of an object referent is higher than that of a subject referent."
      ]
    },
    {
      "heading": "3 Background and Framework",
      "text": [
        "Without considering the extra-sentential individuals such as speaker and addressee, it is not possible to compute relative social status of the persons involved in a sentence."
      ]
    },
    {
      "heading": "3.1 Previous Work",
      "text": [
        "All earlier works (Kim, 1988; Kuno and Kim, 1985; Suh, 1978) were done about subject honorification in the frame of pure syntactic theory.",
        "Their claim is that there is a syntactic agreement between a subject NP and its corresponding verb.",
        "In other words, if an honorific morpheme attaches to a subject NP, the honorific infix si must appear in a verb as shown in (3).",
        "(3) Han sensayng-nim-io-si-ess-ta.",
        "teacher-hon-nom come-hon-past-dec `Teacher Han came.'",
        "As far as subject honorification is concerned, their assertion is correct.",
        "Their approach, however, is incomplete and cannot be applied to the computation of social status for the following reasons.",
        "First, every sentence has a verb.",
        "Addressee honorification is indicated in a verb.",
        "Subject honorification is manifested in a subject NP and a verb.",
        "Thus even if a sentence itself is looked at, it is necessary to consider both addressee honorification and subject honorification.",
        "Second, the consideration of a sentence itself is not enough because honorification phenomenon is related to the sociolinguistic factor such as social status.",
        "In their approach, it cannot be explained why the sentence in (4) instead of the sentence in (5) must be used when speaker has higher social status than the",
        "subject referent though the two sentences are equally grammatical.",
        "(4) Park kwacang-inaka-ss-c. chief section-nomgo out-past-dec `Chief section Park went out.'",
        "(5) Park kwacang-nim-inaka-si-ess-e.",
        "chief section-hon-nom go out-hon-past-dec `Chief section Park went out.'",
        "Finally, it is not possible to compute social status at all just by the information that the subject referent who is mentioned in a sentence is respected.",
        "In the computation of social status it is necessary to know the binary relation such as the person A is respected by the person B.",
        "In the honorification system the person who respects others is always speaker.",
        "Thus in computing social status speaker should be available.",
        "Their approach, however, cannot gain access to speaker, who is a sentence-external individual because only a sentence itself is considered."
      ]
    },
    {
      "heading": "3.2 A Sign-Based Approach",
      "text": [
        "In HPSG which adopts a sign-based approach, the information about sentence-external individuals such as speaker and addressee as well as the information about the persons mentioned in a sentence can be included in a lexical sign.",
        "The feature structure of a lexical sign is as shown in (6).",
        "(6) PHON a list of phoneme strings CAT an object of category",
        "CONX a structure of context The contextual information about social status and sentence-external individuals can be included in the",
        "attribute CONTEXT (CONX).",
        "In order to see values the attribute CONTEXT may have, let us consider the sentence in (7).",
        "(7) J-kkeyseW-nim-ul",
        "Since the LOCAL (LOC) value of the constituents appearing in (7) is relevant to our discussion, it is considered.",
        "First, the LOCAL value of the constituent J-kkeyse is as shown in (8) because the honorific nominative case marker kkeyse attaches to the subject NP J."
      ]
    },
    {
      "heading": "C-INDICES [SPEAKER ADDRESSEE",
      "text": [
        "The diagra ri in (8) provides the contextual in brmation that speaker shows honor to a subject referent and that the social status of the subject referent is higher than that of speaker and addressee.",
        "Second, the LOCAL value of the constituent W-nimul is as illustrated in (9) because the honorific suffix nitn attaches to the object NP W.",
        "The diagram in (9) supplies the information that speaker shows honor to an object referent and that the social status of the object referent is higher than that of speaker and addressee.",
        "Finally, the constituent towatuli-si-ess-supnikka contains the humble form of the verb towacwu, the honorific infix si, and the honorific verbal ending supnikka.",
        "So the LOCAL value of the constituent towatuli-si-ess-supnikka is as shown in diagram (10).",
        "The diagram in (10) provides the contextual information that speaker respects an object referent and a subject referent, that the social status of the object referent and the subject referent is higher than that of speaker and addressee, and that the object referent has higher social status than the subject referent.",
        "In addition, it supplies the information that the social status of speaker is not equal to that of addressee.",
        "As shown in diagrams (8-10), there is no conflict in the information provided by the attribute CONTEXT.",
        "From the information supplied by the attribute S-STATUS we can infer that El>a R , alp> and (where `>' and `' stand for the relation 'higher than' and 'not equal to', respectively).",
        "Thus the sentence in (7) is felicitous in the context where the social status of the object referent is higher than that of any other individuals involved in the sentence, where the social status of the subject referent is higher than that of speaker and addressee, and where the social status of speaker is not equal to that of addressee.",
        "Within a sentence speaker and addressee do not change.",
        "This fact is guaranteed by the Contextual",
        "token-identical to that of any of its daughters.",
        "The information about who honors whom and about relative social status of the individuals involved in a sentence is collected at sentence level by the Background and Social Status Consistency Principle stated in (12).",
        "Thus within a sign-based approach it is possible to compute relative social status on the basis of the collected relations of social status.",
        "The information about relative social status provides the context in which a sentence is felicitous."
      ]
    },
    {
      "heading": "4 Inference of Relative Social Status",
      "text": [
        "Relative social status of the individuals involved in a dialogue can be inferred by collecting and computing the relations of social status collected at sentence level.",
        "4.1 Template for a Relation of Social Status When a subject referent or an object referent is respected by speaker, the social status of the subject referent or the object referent is higher than that of both speaker and addressee as formalized in (13).",
        "(13) Inds/0 > Indsp, Inds/0 > Indad On the other hand, if a subject referent or an object referent is not respected by speaker, the social status of speaker is equal to or higher than that of the subject referent or the object referent as shown in (14).",
        "(14) Indsp .. Inds/0",
        "When a humble form of a verb is used in a sentence, the social status of an object referent is higher than that of any other individuals (that is, speaker, addressee, and a subject referent) involved in a sentence as represented in (15).",
        "(15) Indo > Indsp, Indo > Indad, Indo > Inds If a humble form of a verb is available but is not used, the social status of speaker is equal to or higher than that of an object referent as illustrated in (16).",
        "(16) Indsp Indo When the honorific infix si occurs in a verb, the social status of a subject referent is higher than that of speaker and addressee as represented in (17).",
        "(17) Inds > Indsp, Inds > Indad If the honorific infix si does not occur in a verb, the social status of speaker is equal to or higher than that of a subject referent as shown in (18).",
        "(18) Indsp Inds",
        "Finally, when an honorific verbal ending is used, the social status of speaker is different from that of addressee as illustrated in (19).",
        "(19) Indsp Indad If a plain verbal ending is used, the social status of speaker is equal to or higher than that of addressee as shown in (20).",
        "(20) Indsp Indad 4.2 Inference in a Coherent Dialogue By a coherent dialogue we mean that there is no conflicting inference of social status from the sentences occurring in the dialogue.",
        "Let us look at the dialogue shown in (21).",
        "(21) a. K-kkeysehoyuy-ey nom (hon) meeting-postp chamsekha-si-ess-eyo.",
        "attend-hon-past-dec (hon) IC attended at the meeting.'",
        "The above dialogue occurs between the person S and the person L. In their utterance the person K and the person P are mentioned.",
        "Let us infer the relative social status of those four persons.",
        "From the sentence (21a) the order in (22) is drawn.",
        "(22) K>S, K>L, SQL Similarly, the orders shown in (23) and (24) are derived from the sentences (21 b) and (21c), respectively.",
        "(23) P>L, P>S, K>L, K>S, K>P, LS (24) LS, P>L, P>S",
        "The relative orders illustrated in (22-24) are collapsed into the one illustrated in (25).",
        "(25) K>P>L>S So the relative order of social status shown in (25) is derived from the dialogue in (21)."
      ]
    },
    {
      "heading": "4.3 Detection of an Incoherent Dialogue",
      "text": [
        "It is possible to recognize whether a sentence in a dialogue is consistent with the previous sentence(s) with respect to the honorification of a certain person.",
        "Let us consider the dialogue shown in (26).",
        "(26) a. R-kkeyseM-kkcy nom (hon)dat (hon) sikycy-lulsensaha-si-css-c. clock-acc present-hon-past-dec `R presented a clock to M.'",
        "In the sentence (26a) four persons are involved: Youngsoo, Sungmin, the person R, and the person M. The order of their relative social status is as illustrated in (27).",
        "(27) R>Youngsoo, R>Sungmin, M>Youngsoo, M>Sungmin, RM, YoungsooSunginin Likewise, from (26b) we draw the relative order shown in (28).",
        "It is derived from sentence (26a) that the social status of M is higher than that of Sungmin as shown in (27), whereas it is derived from (26h) that the social status of M is not higher than that of Sungmin as illustrated in (28).",
        "The latter derivation cannot be compatible with the former derivation.",
        "Thus the dialogue in (26) is not coherent with respect to the honorification of the person M. This kind of incoherence can he detected only by considering relative social status of the individuals involved in a dialogue."
      ]
    },
    {
      "heading": "5 Implementation",
      "text": [
        "To compute relative social status of the individuals involved in a dialogue, the dialogue should be parsed and contextual information about social status must be available at dialogue level."
      ]
    },
    {
      "heading": "5.1 Dialogue Parsing",
      "text": [
        "In ALE the primary predicate for parsing is `rec'.",
        "For example, the query for parsing the sentence in (29) should have the format illustrated in (30).",
        "(29) Soonchul-iMinyoung-ulmanna-ss-e. nomace meet-past-dec `Soonchul met Minyoung.'",
        "(Speaker: Mansoo, Addressee: Chulho) (30) j ?- rec [manse, chulho, soonchuli, minyoung_ul, manna_s.",
        "As shown in the query, the first member of the input list is speaker of the input sentence, the second member of the input list is addressee, and the remaining members are the constituents of the input sentence.",
        "Although the indexes of speaker and addressee are variables in the entry of lexicons, these variables are instantiated to speaker and addressee specified in the input string when a sentence is parsed.",
        "A dialogue is composed of sentences.",
        "As a device of linking sentences, the conjunctive kuliko 'and' is used.",
        "The conjunctive, however, does not contribute anything to a dialogue.",
        "For instance, the query for parsing the dialogue in (21) is as illustrated in (31).",
        "(31)?- rec [s,l,k_kkeyse,hoyuy_ey, chamsekha_si_ess_eyo,kuliko, 1,s,p_kkeyse,k_nimul, towatuli_si_ess_e,kuliko, 1,s,s_nun,p_nimul,poy_ess_ni].",
        "As shown in (31), the conjunctive kuliko is not inserted after the last sentence in a dialogue because no further sentence follows.",
        "In query (31) both speaker and addressee are specified for each sentence.",
        "Since a series of sentences forms a dialogue, the feature structure of a dialogue is as shown in (32).",
        "list of sentence-signs set of background set of social status The value of the feature COMPOSED-OF is a list.",
        "Each member of the list is the result of parsing each sentence occurring in a dialogue.",
        "On the other hand, the value of the feature BACKGR is a set.",
        "Each element of the set contains the information about who honors whom, which is collected during a parsing of each sentence in a dialogue.",
        "The value of the feature S-STATUS is also a set whose elements provide the information about relative social status of the persons involved in a dialogue."
      ]
    },
    {
      "heading": "5.2 Computation of Relative Social Status",
      "text": [
        "All pieces of information that arc necessary for the computation of social status are stored in the value of the feature S-STATUS.",
        "Let us consider how relative social status is computed using the dialogue in (21).",
        "When a dialogue is processed, the information about relative social status is provided in the form of feature structure.",
        "Feature structures are converted into Prolog facts since the reasoning component comprised of inference rules accepts Prolog facts, not feature structures.",
        "In the case of dialogue (21), the Prolog facts shown in (33) are obtained.",
        "(33) a. higher (k, s) , higher (k, 1) .",
        "b. not_egual (1, s) .",
        "c. higher (p , 1) , higher (p, s ) .",
        "e. equal_higher(l,^).",
        "When the inference rule in (34) is applied to (33b) and (33e), the result is (35).",
        "Finally when the inference rule in (39) is applied to (37) and (35), the result is as shown in (40).",
        "(39) higher_inf_four (X, Y, Z,W) if % X>Y>Z>W higher_inf_three (X, Y, Z ) ,% X>Y>Z higher ( Z , W) .% Z>W (40) higher_inf_f our (k, p, 1, s ) .",
        "Thus the inference in (40) is the result of computing relative social status of the individuals involved in dialogue (21)."
      ]
    },
    {
      "heading": "5.3 Conflicting Inference",
      "text": [
        "Let us consider why the dialogue in (26) is not coherent.",
        "After the dialogue is parsed, the feature structures in (41) are collected together with other feature structures.",
        "The Prolog facts in (42a) and (42b) arc obtained from the feature structures in (41a) and (41b), respectively.",
        "(42) a. higher (m, sm) .",
        "h. equal_higher(sm,m).",
        "The two facts, however, are not compatible because higher (m, sm) means 'not equal_higher(sm,m)'.",
        "Thus dialogue (26) is incoherent in that the relative order of social status between the person M whose index is m and the person Sungmin whose index is sm is not consistent."
      ]
    },
    {
      "heading": "6 Concluding Remarks",
      "text": [
        "In this paper we have discussed a method to compute relative social status of the individuals involved in a dialogue.",
        "The main points are as follows: First, the problem with previous works is that they cannot incorporate sentence-external individuals such as speaker and addressee in honorification phenomenon because just a sentence itself is considered.",
        "Second, since the Korean honorification system consists of subject honorification, object honorification and addressee honorification, these types of honorification should be considered simultaneously when we look at a sentence.",
        "Finally, sentence-external individuals set the criteria for all relations of social status and thus they should be available in the computation of social status.",
        "Our approach makes good use of contextual information such as information about social status and sentence-external individuals.",
        "The advantages of including contextual information in the implementation are that it is possible to catch the context where a sentence is felicitous and it is also possible to detect whether a dialogue is coherent.",
        "If a dialogue is coherent, the order of the social status of the individuals involved in the dialogue is produced, whereas when a dialogue is found incoherent, the reason for incoherence is produced.",
        "Our approach sets a new direction of processing Korean in that it considers and implements the important fact that a Korean sentence is constrained by relative social status of the individuals involved in the sentence."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "I am grateful to Matt Crocker and Lex Holt for valuable discussion and comments.",
        "This research was supported by a scholarship from Owoon Cultural Foundation."
      ]
    }
  ]
}
