{
  "info": {
    "authors": [
      "Kenji Satoh"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-2152",
    "title": "Disambiguation by Prioritized Circumscription",
    "url": "https://aclweb.org/anthology/C96-2152",
    "year": 1996
  },
  "references": [
    "acl-C88-2163",
    "acl-C90-3029"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper presents a method of resolving ambiguity by using a variant of circumscription, prioritized circumscription.",
        "In a disambiguation task, human seems to use various preferences which have various strength.",
        "In prioritized cir cumscription, we can express these preferences as defensible constraints with various strength and we infer the most preferable logical models which satisfy stronger constraints as much as possible.",
        "This representation is very natural for disambiguation since we can regard a logical interpretation as a possible reading and the most preferable logical models as the most preferable readings.",
        "We argue that prioritized circumscription is another promising method for the task.",
        "We also discuss an implementation of prioritized circumscription by a hierarchical logic programming (HCIA.))",
        "language."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "This paper presents a method of disambiguation task by a variant of circumscription, prioritized circumscription (Mx:earthy, 1986; Lifschitz, 1985) and discuss its implementation by a hierarchical constraint logic programming (Held)) language such as (11orning et al., 1989).",
        "Disambiguation is a very important task in natural language processing.",
        "TO resolve ambiguity, humans seem to use not only syntactic constraints but also various levels of heuristics such as grammatical preferences (Hobbs, 1990) and semantic preferences (Wilks, 1975).",
        "For example, suppose that we have the following sentences.",
        "John just saw a man with a telescope.",
        "(a) He bought the telescope yesterday.",
        "(b) Although there is an ambiguity on meaning of the phrase, \"with a telescope\" (the telescope is either used by John or carried by the man), we might conclude the preferred reading as follows.",
        "From the above sentences, \"He\" would be equal to john because the subject tends to be continued to the next sentence and John probably had a telescope at the time of seeing a man from the sentence (b) and inertia of possession.",
        "Therefore, from this preferred reading, we conclude that the telescope is used as a device to see a man.",
        "however, this reading is not final since at least the following preferences are involved in the above reading and these preferences can be defeated by stronger information.",
        "Syntactic preference: The subject tends to be continued.",
        "Semantic preference: If a person buys something at time i, then he should have it at time j where i < j.",
        "In order to demonstrate &feasibility of preference rules, suppose the following sentence is added after the above sentences (a) and (b).",
        "But, he gave the man the telescope ((; this morning. )",
        "Then, we might change a preferred reading that the man should have had a telescope and therefore, the telescope was carried by the man at the time of John's seeing the man.",
        "In this reading, at least, the following preference rule of another inertia of possession is used.",
        ";If a person gives something to the other person at time i, then the other person should have it at time j where i < j.",
        "This conflicts with the former semantic preference of inertia of possession by buying, but the above preference is stronger than the former since the time of giving is later than the time of buying.",
        "Thus, the former preference becomes no loner applicable by the new sentence.",
        "This kind of revision of reading cannot be represented by inference in classical logic since in classical logic, once we get a inferred result, we can no longer retract the result; (monotonic property).",
        "Therefore, to understand the phenomena, we need other reasoning methods and in fact,",
        "many researches have been using general reasoning fKameworks in Artificial Intelligence such as • abduction (Hobbs et al., 1993), probabilistic network (Charniak and Goldman, 1989), truth maintenance system (Zernik and Brown, 1988), default logic (Quantz, 1993) and conditional logic (Las-carides, 1993).",
        "In this paper, we propose another alternative, that is, circumscription (McCarthy, 1986: Lifschitz, 1985).",
        "Even though circumscription is one of the most popular formalisms in the community of nonmonotonic reasoning research, it is surprising that very few has examined feasibility of circumscription for disainbiguation.",
        "Our work of disambiguation by interpretation ordering is originated from (Satoh, 1991) and in a more recent work, Kameyama (Kameyama, 1994) has independently proposed usage of circumscription for interpretation of pronominal anaphora.",
        "In this paper, we explore this direction further.",
        "In circumscription, we give a preference order over logical interpretations and consider the most preferable models.",
        "This representation naturally corresponds with a disambiguation task since we can regard a logical interpretation as a possible reading, and disambiguation as a task to get the most preferable reading among possible readings.",
        "Among variants of circumscription, prioritized circumscription is suitable to represent various strength of preference rules.",
        "In prioritized circumscription, we can divide preference rules into hierarchy and this hierarchy gives a priority relation over preferences.",
        "Therefore, we directly represent rules in the hierarchy in prioritized circumscription.",
        "We believe that circumscription has the following advantages in the task of resolving ambiguity.",
        "• Since we use a first-order predicate calculus for a basic language, we can represent various kinds of information such as grammatical rules and semantical rules in one framework.",
        "• There is only one extra underlying mechanism besides inference rules for the first-order predicate calculus.",
        "that is, introducing an order over logical interpretations.",
        "Therefore, reasoning process can be understood easily compared to other mechanism using numerical reasoning or complex inference rules.",
        "• We do not need to assign detailed numerical values to preference rules in order to express priority over preference rules, but just specify a preference level of the rules.",
        "This representation can be regarded as an assignment of qualitative strength for preference rules and reduces a burden of representing a priority over preference rules greatly.",
        "Moreover, this prioritization is general since we can represent a various kind of priority besides specificity.",
        "• It is important to retain possible readings if we",
        "can not resolve ambiguity yet.",
        "In circumscription, we can consider multiple preferable models, not necessary the single preferable model.",
        "So, if there are yet multiple possible readings as a result of disambiguation, we can keep these possible readings as multiple preferable models.",
        "In this paper, we also discuss an implementation by using hierarchical constraint logic programming (HCLP) language such as (Horning et al., 1989).",
        "HCLP language is similar to constraint logic programming language except that we can represent a constraint hierarchy.",
        "Thus, there is a correspondence between a solution of an HCLP language and the most preferable models of prioritized circumscription.",
        "In this paper, we use our HCLP language based on a boolean constraint solver to get the most preferable models from preference rules represented as boolean constraints in the HCLP language.",
        "We demonstrate how the above example of the disambiguation is treated in the HCLP language."
      ]
    },
    {
      "heading": "2 Prioritized Circumscription",
      "text": [
        "in this section, we briefly review prioritized circumscription.",
        "For simplicity sake, we modify the definition of prioritized circumscription by (McCarthy, 1986; Lifschitz, 1985).",
        "The difference is that we let all predicates vary and maximize preference rules whereas Lifschitz minimize abnormal predicates for preference rules.",
        "Let (1)(x) and 111(x) be formulas with the same number of free variables x.",
        "We say that 111 and cis are similar.",
        "4) > IP stands for Vx( kls(x) 3 4)(x)).",
        "We extend this notation to tuples of formulas 4), 4) where 4) = sP„ and kls = 1111,...,111,, and 4) and kis are similar (each 4)j and qfj are similar): > 111 stands for A7,,Shi > 111i.",
        "We also write > 11) A 11!",
        "> 4) as = and 4) > IP A -1(1P > ) as 111>1P.",
        "Let a triple of formulas 4. be broken into disjoint parts 4)1, 412, ..., 4)4'.",
        "Let 4i be similar to 4)i.",
        "We define cD r4S d(-1 A (Ai.1.",
        "(DI = 1113 3 (pi > kpi).",
        "We also write kis A --,(4) 4)) as kh qt.",
        "According to the result of (Lifschitz, 1.985), we give a model theoretic definition of the above formula (1) as follows.",
        "I)ciliation 2 We define an order > ovcr logical in telpre la lions as folio ws",
        "where",
        "1.",
        "M and M have the same domain.",
        "2. cycry constant and function symbol has the Sal 111!",
        "interpretation in M and.",
        "M.",
        "In the above order, a greater interpretation is more preferable.",
        "The above order intuitively means that logical interpretations which maximally satisfy a, subset of (1.0 are preferable, and if there are interpretations which satisfy the same formulas in (Di , then interpretations which!",
        "maximally satisfy a subset of +2 are preferable, and... and if' there are interpretations which_ satisfy the same formulas in Ci?k-- 1, then interpretations which maximally satisfy a subset of (Di' are preferable.",
        "According to the result of (Lifschitz, 1985), we have the following correspondence between syntactic definition and semantic definition."
      ]
    },
    {
      "heading": "3 Disambiguation by Prioritized Circumscription",
      "text": [
        "in order to use prioritized circumscription for a, disambiguation task, we make the following correspondence between formulas in the definition of prioritized circumscription and information in natural language.",
        "In the syntactic definition of prioritized circumscription in Section 2, we correspond A with information about given sentences and background knowledge winch is always true in any situation.",
        "And, we regard (1, as a tuple of preference rules.",
        "Note that preference rules are put, into hierarchy according to strength of preference rules.",
        "Then, the most, preferable models correspond with the most preferable readings since each model satisfies stronger preference rules as much as possible and therefore, the syntactic definition becomes a specification of the preferable readings by 'Theorem I.",
        "In the subsequent subsections, we firstly fix_ an experimental_ logical representation of sentences, background knowledge and preferences.",
        "Then, we treat the exallq)le in Section 1 by the logical representation."
      ]
    },
    {
      "heading": "3.1 Logical Representation of Sentences and Background Knowledge",
      "text": [
        "We use an adaptation of Kowalski's event, calculus (Kowalski and ,.-;ergot, 1.986).",
        "However, the idea of disambiguation in tins paper does not depend on a particular representation.",
        "We assume that each sentence expresses an event.",
        "For example, a sentence \"John gave the telescope to the man\" is represented as the following liormula.",
        "A complex sentence is supposed to be decomposed into a set, of simple sentences which is translated into the above representation.",
        "Ambiguities are expressed by disjunctions.",
        "For example, the sentence John saw a man with a telescope\" is expressed as follows.",
        "The last conjunct expresses ambiguity in the phrase \"with a telescope\" (used as a device or carried by the man).",
        "In addition to the semantic representation, we also use syntactical information front a, parser so that grammatical preference rules can be expressed.",
        "For example, we show some of the grammatical information of the sentence John gave Hie telescope to the man\" as follows.",
        "(We assume that, sentence number is 1).",
        "Ily using these basic predicates, we can represent background knowledge which are always valid.",
        "1,Mr example, background knowledge \"If a1 has o at time i, and a1 is not equal to a9, then a2 does not, have a at time i\" can be expressed in the following formulas."
      ]
    },
    {
      "heading": "3.2 Logical Representation. of Preferences",
      "text": [
        "We represent a preference rule as a formula in (D in the syntactic definition of prioritized circumscription and handle a priority among preferences by",
        "putting stronger preferences into a stronger hierarchy of preferences.",
        "For example, consider the following two grammatical preferences.",
        "1.",
        "If \"He\" appears in a sentence as the subject and the subject in the previous sentence is male, then it is preferable that \"He\" refers to the previous subject.",
        "2.",
        "If \"He\" appears in a sentence as the subject and someone in the previous sentence is male, then it is preferable that \"He\" refers to the one in the previous sentence.",
        "Suppose that the former is stronger than the latter.",
        "This priority of the preferences means that the formula:",
        "should be satisfied as much as possible for every a and i, and if it is maximally satisfied then the following formula:",
        "should be satisfied as much as possible for every a and i.",
        "We can represent semantic preferences as well.",
        "For example, a preference \"If a1 sees a2, then a2 and al are not equal\" means that the following expression should be satisfied as much as possible for every e, a1 and a2:",
        "Note that the above is a preference rule because there is a possibility of reflexive use of \"see\"."
      ]
    },
    {
      "heading": "3.3 Example",
      "text": [
        "Now, we are ready to treat disambiguation of the sentences used in Section 1 by prioritized circumscription.",
        "We consider the following background knowledge which is always true.",
        "We denote the conjunctions of the following axioms as 110 (P) where",
        "1.",
        "If al is equal to a2 then a2 is equal to al Val V a,2(eq(al, a2) 3 eq(a2, ai)) 2.",
        "If al and a9 are equal and a2 and a3 are equal, then al and a3 are equal.",
        "ValVa2Va3((eq(ai, a,2) A eq(a2, 0,3 )) 3 cq(ai,a3)) 3.",
        "If a1 is equal to a2, then a2 is an actor of al's action, too.",
        "VeValVa2 ( (eq(al , a2 ) A actor(e, aq)) 3 actor (e, a2 )) 4.",
        "If a use o as a device at time i then a has o at time i.",
        "5.",
        "If al has a at time i, and al is not equal to a2, then a2 does not have a at time i.",
        "This is same as (2).",
        "We consider the following preferences.",
        "1.",
        "If al sees a2, then al and a2 are not equal.",
        "(1.1(P,e,a,i,a2) =(5) 2.",
        "If a is male and a is the subject of i-th sentence and \"He\" is in the next sentence, then a is equal to \"He\".",
        "(DT(P,e,a,i) =(3) 3.",
        "If a is male and a is in i-th sentence and \"He\" is in the next sentence, then a is equal to \"He\".",
        "(1q(P, a, i) =(4) 4.",
        "If someone gives o to a at time i, then a has o at time i 1.",
        "This expresses inertia of ownership.",
        "411(P, e, a, o, i) = (act(e, Give) A object(e, o) Arecipient(e, a) A time(e, i)) 3 ]ei (a,ct(ei, Have) A actor (ei, a) Aobject(ei, a) A time(e i + 1)) 5.",
        "If a buys a at time i, then a has a at time i + 2.",
        "This preference of another inertia of ownership is weaker than the former preference because time interval is longer than the former preference.",
        "eDr'(P, c, a, o, i) = (act(e, Buy) A actor(e, a) Aobject(e, a) A time(e, i)) 3 (act(ei,Have) A actor (el , a) Aobj ect(ei , a) A time (ei , i + 2))",
        "We assume that 4)1 is a formula which should he satisfied in the first place, hl in the second place, 40 in the third place, ,D1 in the fourth place and it,)_ in the fifth place.",
        "Example 1 We consider the following sentences.",
        "John just saw a man with a telescope.",
        "He bought the telescope yesterday.",
        "A logical representation of the above sentences is as follows and we denote it as AI (P).",
        "Note that we represent \"just\" as time 2 and \"yesterday\" as time 0.",
        "In the syntactic definition of the most preferable reading (1), we let A(P) be Ao(P) A ./14 (P) and be 5.",
        "We show an intuitive explanation of inference of getting the most preferable reading as follows.",
        "From the preference 2, -.//e\" preferably refers to John.",
        "Note that although the preference 3 seems to be applicable, it is not actually used since the stronger preference 2 overrides the preference 3.",
        "Then, from the preference 5, John had the telescope at time 2.",
        "From the preference 1, John is not equal to the man.",
        "Then, the man cannot have the telescope at time 2 from the background knowledge 5 and therefore, the telescope was used as a device from the disjunction in Al (P).",
        "We can actually prove that device(El,telescope) is true in the most preferable readings.",
        "Example 2 Suppose we add the following sentence to the previous sentences.",
        "But, he gave the telescope to the man this morning.",
        "A logical representation related to this sentence is as follows.",
        "We denote the formula as A9 (P).",
        "Note that we represent \"this morning' as time 1.",
        "In this case, we let A(P) be A0(P) A A1(P) A A2(P ) in the syntactic definition.",
        "Then, reading of \"with a telescope\" is changed.",
        "From the preference 4, the man should have had the telescope at time 2.",
        "If the telescope were used as a device at time 2, John would also have the telescope at the same time according to background knowledge 4 and it contradicts background knowledge 5.",
        "Then, the weaker preference 5 is retracted to avoid contradiction and the stronger preference 4 is survived.",
        "Therefore, in the most preferable reading, the man had the telescope at time 2."
      ]
    },
    {
      "heading": "4 HCLP language",
      "text": [
        "Now, we discuss an implementation of prioritized circuinscription by HCLP.",
        "Firstly, we briefly review a hierarchical constraint logic program-ming(HCLP) language.",
        "We follow the definition of Morning et al., 1989).",
        "An HCLP program consists of rules of the form: h: , b„ where h is a predicate and each of b„ is a predicate or a constraint or a labeled constraint.",
        "A labeled constraint is of the form: label C where C is a constraint in specific domain and label is a label which expresses strength of the constraint C. The operational semantics for HCLP is similar to CLP except manipulating a constraint hierarchy.",
        "In RCLP, we accumulate labeled constraints to form a constraint hierarchy by each label while executing CLP until CLP solves all goals and gives a reduced required constraints.",
        "Then, we solve constraint hierarchy with required constraints.",
        "To solve constraint hierarchy, we firstly find a maximal subset of constraints for the strongest level which is consistent with the required constraints.",
        "Then, we try to find a maximal subset of constraints in the second strongest level with respect to the union of the required constraints and the maximal consistent subset for the strongest level,.., and so on until a maximal consistent subset of constraints in the k-th strongest level is added.",
        "Then, an assignment which satisfies the final set of constraints is called a solution.",
        "Lei; 0 and a be assignments and Col (and Co1') lie a set of constraints in the strongest level of the hierarchy satisfied by 0(and a), and CO2(and C) be a set of constraints in the second strongest level of the hierarchy satisfied by 0(and and C1 (and C) be a set of constraints in the k-th strongest level of the hierarchy satisfied by 0(and a) 0 is locally-predicate-better (Borning et al., 1989) than a w.r.t.",
        "the constraint hierarchy if there exists i(1 < i < li;) such that for every",
        "We can prove that if 0 is a solution, then there is no assignment a which satisfies the required constraints and is locally-predicate-better than 0.",
        "Note that the definition of locally-predicate-better comparator is similar to the definition of the order over logical interpretation in the prioritized circumscription.",
        "The difference is that locally-predicate-better comparator considers assignments for variables in constraints in IICLP whereas the order over logical interpretation considers assignments of truth-value for formulas in prioritized circumscription.",
        "5 Implementation by HCLP language In order to nse HCLP language for implementation of prioritized circumscription, we need to change formulas in prioritized circumscription into constraints in HCLP.",
        "It is done as follows.",
        "We introduce a domain closure axiom so that we only consider relevant constants used in the given sentences.",
        "Then, we instantiate universal-quantified variables in background knowledge and free variables in preferences with the relevant constants and introduce Skolem functions for existential-quan ti lied variables.",
        "For example, we have the following formula by instantiating preference 4 in Section 3.3 with E3 for c and the man for a and the telescope for o and 1 for i and introducing a Skolem function f:",
        "By this translation, every formula becomes ground and we regard a different ground atone as a different propositional symbol.",
        "Then, every formula in prioritized circumscription can be regarded as a Boolean constraint in HCLP.",
        "We translate all formulas in the syntactic definition of the background knowledge and the sentences in Examples 1 and 2 into Boolean constraints in our IICLP language (Satoh, 1990).",
        "Then, from the two sentences in Example 1, our IICLP language gives the following result as a part, of a solution:",
        "which means that, the telescope is used as a device.",
        "And, our HCLP language gives the following result for the sentences in Example 2:",
        "which means that, the man has the telescope (and it is not used as a device)."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "We believe that the following are contributions of this paper.",
        "E We examine a feasibility of prioritized circumscription for specifying the most preferable reading by considering a disambiguation task in the concrete examples and show that we can represent, the task quite naturally.",
        "We discuss an implementation of disambiguation within an HCLP language by showing a correspondence between a priority over preference rules in prioritized circumscription and a constraint hierarchy in Asa future research, we need the following.",
        "1.",
        "We would like to examine a computational complexity of disambiguation by HCLP.",
        "2.",
        "It is better 1:o learn preferences automatically in stead of specifying preferences by user.",
        "One approach for learning is to build an interactive system such that the system shows to a user a set of possible readings for given sentences and the user gives an order over possible readings.",
        "Then, the system would be able to learn preferences by generalizing the order."
      ]
    }
  ]
}
