{
  "info": {
    "authors": [
      "António H. Branco"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-1027",
    "title": "Branching Split Obliqueness At the Syntax-Semantics Interface",
    "url": "https://aclweb.org/anthology/C96-1027",
    "year": 1996
  },
  "references": [
    "acl-E95-1002"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper it is argued that the accuracy of the syntax-semantics interface is improved by adopting a non-linear obliqueness hierarchy for subcategorized arguments."
      ]
    },
    {
      "heading": "0 Introduction",
      "text": [
        "In the context of the emerging research area of computational semantics, topics related to the syntax-semantics interface have deserved special attention.",
        "One such topic is the SUBCAT feature and the information encoded in it.",
        "In IIPSG framework, this feature has been shown to be a critical point of articulation between highly autonomous principle-based syntax and semantics components (vd.",
        "a.o.",
        "Prank and Reyle 1995).",
        "On the one hand, the SUBCAT list records information about strict subcategorization properties of the corresponding predicator through the nature and number of its elements.",
        "On the other hand, by means of the linear order hierarchy assigned to these elements, syntactic generalizations concerned with word order, binding, alternations, etc.",
        "are also registered (Pollard and Sag 1987, Ch.",
        "5).",
        "Recent research, namely by 1 ida, Manning, ()'Neil and Sag (1994) and Sag and Godard (1994), brought to light evidence that, contrary to what was originally assumed in (Pollard and Sag 1987; 1994), those different syntactic generalizations may not be encoded by one and the same ordering of the subcategorized elements.",
        "This issue was directly addressed by Manning and Sag (1995), who proposed to recast the SUBCAT information into two different lists.",
        "One of the lists displays the subcategorized elements according to an order relevant to their linear surface concatenation.",
        "This \"valence\" list results from the append of SU lid, SPEC and COMPS lists, which are but the result of a previous segmentation of the SUBCAT list proposed by Itorsley (1987) and taken up by Pollard and Sag (1994, Ch.",
        "9).",
        "The other list, in turn, orders the subcategorized elements according to a hierarchy relevant to set up the binding relations between them.",
        "This \"argument\" list is the value of the new ARG-S feature.",
        "In this connection, the crucial point I want to argue for in this paper is that, in order to increase the syntax-semantics interface accuracy, the reshuffling of the old SUBCAT list must be further extended.",
        "In particular, on a par with its segmentation into sub-lists and its splitting into possibly different obliqueness hierarchies, a branching obliqueness ordering should be also admitted.",
        "This paper is developed along three parts.",
        "First, the main arguments of Manning and Sag (1995) for the dissociation between the ordering for linear surface concatenation and the ordering for binding are briefly reviewed.",
        "Second, I present empirical justification FM the adoption of a non-linear order for the ARG-S value.",
        "Third, the definition of o-command is specified for this new obliqueness format."
      ]
    },
    {
      "heading": "1 Empirical Motivation for Split Obliqueness",
      "text": [
        "The main arguments presented by Manning and Sag (1995) for splitting obliqueness into valence obliqueness and binding obliqueness rest on the analysis of two linguistic phenomena: reflexives in Toba Ratak, a western austronesian language, and reflexives in Japanese causative constructions."
      ]
    },
    {
      "heading": "1.1 Toba Batak reflexives",
      "text": [
        "The pair of sentences in (1) illustrates the distinction between the objective voice, in (1)a.,",
        "expressed by the di- verbal prefix and used in unmarked contexts, and its active voice counterpart, in (1)b., expressed by the mang-prefix (Manning and Sag 1995, (16)).",
        "di-ida si Torus si Ria.",
        "ov-see PM Torus PM Ria 'Torus sees/saw Ria.'",
        "mang-ida si Ria si Torus.",
        "AV-see PM Ria PM Torus 'Torus sees/saw Ria.'",
        "In Toba Batak there is strong evidence that, in transitive constructions, a verb and the following NP form a VP constituent regardless of the voice chosen.",
        "Therefore, the constituent structure of (1)a. and b. is presented in (2)a. and b., together with the corresponding lexical entry of the verb (Manning and Sag 1995, (21), (20)).",
        "(2) a.",
        "Objective voice: Torus saw Ria.'",
        "transitive structures illustrated in (1).",
        "In (3)a. and a'., the reflexive occurs in objective constructions, respectively, as an immediate constituent of VP and as an immediate constituent of S. The corresponding active constructions are displayed in (3)b. and b'.",
        "(Manning and Sag 1995, (22), (23))."
      ]
    },
    {
      "heading": "SUBCAT I NPi , 121 NPJ) CONT [SEER LSEEN ji",
      "text": [
        "Now, the examples in (3) show all the possible occurrences of one reflexive NP in the basic"
      ]
    },
    {
      "heading": "CONT [SEER [SEEN LI",
      "text": [
        "The pair of grammatical constructions (3)a'./(3)b. confirms that binding principles cannot be defined in terms of linear word order or c-command.",
        "In (3)a'.",
        "the antecedent precedes the reflexive, but in (3)b. it is the reflexive that precedes the antecedent; in (3)b. the antecedent c-command the reflexive, but in (3)a'.",
        "it is the other way around.",
        "However, contrary to the assumptions of the Binding Theory of Pollard and Sag (1994), also the",
        "definition of binding principles cannot be based on the SUBCAT valence order.",
        "This is made evident by (3)a. and (3)a'., whose grammatical status is not correctly predicted.",
        "In (3)a., the reflexive is bound by a less oblique element in the SUBCAT list, in accordance with Principle A, but the construction is not acceptable.",
        "In (3)b., the reflexive is bound by a more oblique element in the SUBCAT list, in violation of Principle A, but the construction is acceptable.",
        "The solution adopted by Manning and Sag (1995) consists of a three step move: i) to keep the Binding Theory unchanged; ii) to create a new list of subcategorized elements, which is named ARG-S (from argument structure); iii) to define o-command relations on the basis of the obliqueness hierarchy established on this new list, which may be different from the obliqueness hierarchy established in the SUBCAT list.",
        "Let us then see how this solution works for the problematic examples in (3).",
        "In (4) we find the lexical entries of (3) after their reshuffling according to Manning and Sag's proposal (for the sake of readability, the representation of SUBJ and COMPS features is omitted).",
        "It is easy to check that the correct predictions are made if the relevant o-command relations are established on the ARG-S list: the reflexive is now coindexed with a more oblique element in (3)a./(4)a., and with a less oblique antecedent in (3)a'./(4)a'."
      ]
    },
    {
      "heading": "1.2 Reflexives in Japanese causatives",
      "text": [
        "The other linguistic evidence put forward to support this obliqueness split is the behavior of reflexives in Japanese causative constructions, as originally argued for by Iida, Manning, O'Neil and Sag (1994).",
        "The analysis of case marking, agreement and word order phenomena in Japanese causatives reveals that this construction exhibits properties of a single clause sentence.",
        "As to the Japanese reflexive zibun, like English reflexives, it must be locally o-bound, with some particulars, as for instance its being subject-oriented, that is it can be bound only by a subject.",
        "Now, the example of (5) illustrates that, in the context of causatives, zibun is not restricted to being bound by the subject of its clause (Manning and Sag 1994, (44)).",
        "(5) a. Tarooi ga Zirooj ni aete",
        "zibun-zisini/j o hihans-ase-ta.",
        "Taroo NOM Ziro DAT purposefully self ACC criticize-CADS-PAST 'Tarooi purposefully made Zirooj criticize himselfi/j.'",
        "Also, pronouns exhibit a special behavior in the context of causatives.",
        "Contrary to the requirements of Principle B, in such contexts pronouns may be bound by an antecedent occurring in the same clause, but only if it is the subject of the causative construction.",
        "This is illustrated in (6) (Iida et al.",
        "1994, (17)).",
        "(6) Tarooi wa Zirooj ni karei pkj 0",
        "bengos-ase-ta.",
        "Taroo TOP Ziroo DAT he ACC defend-CADS-PAST 'Tarooi made Zirooj defend himi /*j.'",
        "The solution proposed in (Iida et al.",
        "1994) for accounting for the apparent peculiar properties of binding constraints in causatives relies on the assumption that the derived lexical representation of a causative verb, like tazune-sase ('made sb.",
        "visit'), has the form sketched in (7), where tazune is the verb 'to visit' and -sase the causative suffix (Iida et al.",
        "1994, (25)).",
        "only by a subject.",
        "Examples of such languages are Malayalam and Hindi, from India, Lango from Uganda, Bahasa from Indonesia, Japanese, Korean and Russian (vd.",
        "(Palmer 1994, p. NOM and (Manning and Sag 1995)).",
        "Example (8) is taken from Lango (Palmer 1994, p. 101).",
        "(8) ökelei eliwne alabil • pirE kEnflip-Okelo asked Alaba about self 'Okeloi asked Alaba • about himselfr: ' t ,i• The solution put forward in (Manning and Sag 1995, (6)) to account for this particular sort of reflexives is to formulate a new binding principle, the A-Subject Principle, where an a-subject is defined as the \"entity that is first in some ARG-S list\":",
        "Consequently, this solution relies also on the three basic assumptions adopted for the analysis of Toba Batak reflexives: i) the principles of Binding Theory remain invariant; ii) a new list of subcategorized elements, termed ARG-S, is adopted; iii) o-command relations are defined on the basis of the obliqueness hierarchy established in this new list.",
        "Moreover, there is a fourth assumption which proposes that Principles A and B should be validated in at least one of the two ARG-S features occurring in the derived lexical entry of a causative verbal form.",
        "Looking at the lexical representation of causative verbs in (7) and the examples (5) and (6), it is easy to check that Principle A is satisfied in the lower ARG-S list for the binding Ziroo/himself, where Ziroo is the subject, and in the upper ARG-S for the binding Taroo/hirnself, where Taroo is now the subject.",
        "As to the contrast in (6), Principle B is satisfied in the lower ARG-S list, where the pronoun is locally o-free."
      ]
    },
    {
      "heading": "2 Empirical Motivation for Branching Obliqueness",
      "text": [
        "Once the binding obliqueness is unpacked from the valence list and gets an autonomous status, it becomes easier to increase the empirical adequacy of Binding Theory, in particular, and the syntax-semantics accuracy, in general.",
        "In this section I argue this can be done by letting the ARG-S value have a non-linear ordering."
      ]
    },
    {
      "heading": "2.1 Subject-oriented reflexives",
      "text": [
        "There are languages in which the reflexives, though they must be locally-bound, can be bound",
        "(9) A-Subject Principle",
        "Anaphors must be a-subject-bound (in some languages).",
        "Deciding whether the Binding Theory should include Principle A or A-Subject Principle depends thus on the language which it is being applied to.",
        "The alternative solution I propose does not involve different formulations for binding principles or additional principles.",
        "In this solution, the Binding Theory is kept invariant.",
        "One simply has to state that, for those languages, like Lango, that have subject-oriented reflexives, the binding obliqueness hierarchy is not as sketched in (10)a., but as in (10)h..",
        "In other words, languages may vary with regards to the configuration given to the ARG-S value.",
        "(10) a.",
        "[ARG - S (argl, arg2, arg3,..., argn)] •",
        "argil arg2 arg3 argn ----• argn"
      ]
    },
    {
      "heading": "2.2 Chinese long-distance subject-oriented ziji",
      "text": [
        "Chinese ziji is a subject-oriented reflexive pronoun which does not obey either Principle B or Principle A.",
        "As illustrated in (11), ziji may be bound by an antecedent from outside or inside its",
        "clause, but it cannot be bound by an antecedent which is not a subject (Xue et al.",
        "1994, (2)).",
        "(11) Zhangsani tong chu tingshuo Wangwuk bu xihuan / *h. Zhangsan from Lisi place hear Wangwu not like self 'Zhangsani heard from Lisii 1Wangwuk does not like himip:i /himself/el.'",
        "Xue, Polard and Sag (1.994) discussed at length the properties of this anaphor.",
        "The authors elucidated its particulars, namely that ziji is inherently animate, and ambiguous between a discourse pronoun and a (syntactic) z-pronoun.",
        "As a z-pronoun it obeys Principle Z (Xue et al.",
        "1994, (38)):",
        "(12) Principle Z Z-pronouns must be o-hound.",
        "Nevertheless, the authors offered no solution for accounting fin the fact that syntactic ziji is subject-oriented.",
        "That solution follows now naturally and immediately from the assumption that the elements of each ARG-S value receive the non linear order of (10)b..",
        "Principle Z alone is thus now enough to make the correct predictions about ziji as soon as the o-command relations are established over the binding obliqueness hierarchy of multi-clausal sentences displayed in (13), typical of languages with subject-oriented reflexives.",
        "Any node in the hierarchy is preceded only by subjects because in each (clausal) ARG-S value only subjects can be less oblique than any other argument."
      ]
    },
    {
      "heading": "2.3 Reflexives in Russian passives",
      "text": [
        "Binding Theory predicts that binding constraints on subcategorized elements may change by virtue of the application of lexical rules.",
        "The correctness of this prediction is confirmed, for instance, by English passives (Pollard and Sag 1994, Ch.",
        "6, (1.11)).",
        "In (14)a., John cannot bind himself.",
        "But after the reordering of subcategorized elements by the passive rule, John can now bind himself, as shown in (14)b..",
        "The contrast of (14) is correctly accounted for because John is less oblique than himself in (14)b., but it is more oblique in (14)a..",
        "(1.4) a.",
        "*Himself shaved John.",
        "[SUBCAT (NP: aria, NP: npro)1 b. John was shaved by himself.",
        "SUBCAT ( NP: //pro, NP: ana)1",
        "In connection with this possibility for lexical rules to change obliqueness relations, it would be interesting to find cases where lexical rules change o-command relations in a way that the result requires a branching configuration.",
        "This would he an interesting empirical confirmation of the need for non-linear obliqueness.",
        "One such case can be found in the context of Russian passives.",
        "Russian sebe is a subject-oriented reflexive.",
        "In active constructions it may he bound only by the subject.",
        "Nevertheless, in the context of a passive sentence, like (1.5), sebe can also be bound by the by-phrase (Manning and Sag 1994, (9)).",
        "(15) Eta kniga byla kuplena Borisomi cilia sebjai.",
        "this book.NOM was bought Boris.INSTR for self 'This book was bought by Borisi for The subject-oriented behavior of sebe in active sentences results, like in other languages with subject-oriented reflexives, from the non-linear ordering of the elements of ARG-S value, with all argi (2 i n) being preceded by arg 1 .",
        "As to passives in Russian, the lexical rule, among other things, must give a new ordering to the ARG-S value where all argi (3 5 i a) are preceded only by argl and arg2."
      ]
    },
    {
      "heading": "2.4 Reflexives in Portuguese oblique complements",
      "text": [
        "Another problematic case for the current Binding Theory comes from Portuguese as it fails to make the correct predictions for binding patterns involving reflexives in the context of verbs with two oblique complements.",
        "One such verb is falar_com_acerca ('talk_to_about'):",
        "(17) a.",
        "A Maria falou corn o Pedro acerca do novo Director.",
        "the Maria talked with the Pedro about of the new Director 'Mary talked to Pedro about the new Director.'",
        "a'.",
        "A Maria falou acerca do novo Director corn o Pedro.",
        "the Maria talked about of_ the new Director with the Pedro 'Mary talked about the new Director to Pedro.'",
        "Given the linear order for the ARG-S value the current theory assumes, it is predicted that if a reflexive occurring as the oblique complement Y is grammatically bound by an antecedent occurring as the oblique complement X, then X is less oblique than Y.",
        "Moreover, it is also predicted that the reversed binding configuration, where the reflexive would occur as the oblique complement X, will be ungrammatical.",
        "These predictions are sketched in the following contrast schemata, where si prOprio is a reflexive ruled by Principle A:",
        "(18) a.",
        "A Maria falou [PREP-X o Pedrod",
        "The failure of these predictions is illustrated in (19), which presents the instantiation of schemata (18).",
        "In (19)a./a'., PREP-X is made equal to corn ('to') and PREP-Y to acerca de ('about'); in (19)b./b'.",
        "it is the opposite.",
        "The pairs a./a'.",
        "and b./b'.",
        "simply exhibits different surface orders of the oblique complements in the sentence, a grammatical possibility illustrated in (17)a./a'..",
        "In all examples the binding of the reflexive is ungrammatical 1.",
        "1 Vd.",
        "Pollard and Sag (94), p. 264, n. 17, for a related issue in English.",
        "(19) a.",
        "*A Maria falou com o Pedroi acerca de si prOprioi.",
        "Maria talked to Pedroi about himselfi a'.",
        "*A Maria falou acerca de si prOprioi corn o Pedroi.",
        "Maria talked about himselfi to Pedroi b.",
        "*A Maria falou consigo prOprioi acerca do Pedroi.",
        "Maria talked to himselfi about Pedroi b'.",
        "*A Maria falou acerca do Pedroi consigo prOprioi.",
        "Maria talked about Pedroi to himselfi This is another puzzle for the current Binding Theory which receives a neat solution with a branching hierarchy for the ARG-S value.",
        "In particular, the data presented in (19) receive an adequate account if the ARG-S feature of verbs like falar_com_acerca is as follows, where the two PP complements do not precede each other and a reflexive occurring in one of them cannot be bound by an expression occurring in the other:",
        "All the solutions proposed for the above binding puzzles are similar in the sense that they rest upon the same two very simple assumptions.",
        "First, the Binding Theory remains unaltered, as defined by Pollard and Sag (1994, Ch.",
        "6) with the subsequent specifications, put forward by Iida, Pollard and Sag (1994) and Manning and Sag (1995), that the binding principles must be validated on at least one of the relevant ARG-S features.",
        "Second, the elements of ARG-S value may have a non-linear order.",
        "Giving some attention to the first of these two assumptions, it is worth noting that not only the binding principles remained unchanged, but also the formal notions used in its make-up, (e.g. the relations of o-command and o-binding) were kept unaltered.",
        "This worked fine in the examples tackled above, but it is expected that a notion like o-command, ultimately defined on the basis of the precedence relation, may need some further specification.",
        "This is so because, given the second assumption that non-linear orderings are acceptable, new cases must be taken into account,",
        "namely those where the relevant elements do not precede each other in the hierarchy.",
        "Consider the definition of o-command for linear obliqueness (simplified version, (Xue et al.",
        "1994, (35)): (21) (Linear) 0-command X 0-COMMANDS Y iff X is a less oblique coargument of Z that dominates Y.",
        "In case Z=Y, X is said to LOCALLY o-command Y. where X is less oblique than Y iff X precedes Y in an ARG-S list.",
        "This definition was shown to be adequate for the data considered so far.",
        "Notice, however, that in the examples above we were mainly concerned with the validation of Principle A. Consequently, in those examples one was checking only whether a given X preceded a certain Y.",
        "For this kind of cases, having a linear or a branching obliqueness makes no difference for the definition of o-command as such.",
        "Now, when it is Principle B that must be validated, it must be checked whether a given element X does not locally o-command another element Y.",
        "If X and Y are not in the same ARG-S list, they do not locally o-command each other, irrespective of the option for a linear or a non-linear obliqueness.",
        "However, if they are in the same list, assuming a linear or a branching obliqueness hierarchy makes a difference.",
        "In a linear order, two cases occur: either X precedes Y or Y precedes X.",
        "Therefore, X does not a-command Y iff Y precedes X.",
        "(i.e. Y is more oblique than X).",
        "In a branching order, however, a third case also occurs: X is as oblique as Y (they do not precede each other).",
        "Therefore, we would like to have an empirical basis to ascertain whether X does not o-command Y. in this case.",
        "Suitable empirical evidence for settling this issue comes from the counterparts of the Portuguese examples in (19), where the reflexive is replaced by the pronoun ele, ruled by Principle B.",
        "(22) presents examples where the.",
        "pronoun and its antecedent occur in the same ARG-S list and they are equally oblique.",
        "(22) a.",
        "*A Maria falou com o Pedroi acerca Maria talked to Pedroi about himi a'.",
        "'''A Maria talon acerca delei corn o Pedroi.",
        "Maria talked about himi to Pedroi b.",
        "*A Maria falou com elei acerca do Pedroi.",
        "Maria talked to himi about Pedroi b'.",
        "*A Maria falou acerca do Pedroi com Maria talked about Pedroi to himi The ungrammatically of these examples shows that the pronoun is not locally o-free there and, consequently, it is not the case that the local antecedent does not o-command it.",
        "The data from (19) and (22) present thus the empirical basis for a proper definition of o-command in non-linear obliqueness hierarchies.",
        "(19) shows that, when X and Y are equally oblique, it is not the case that X o-commands Y.",
        "(22), in turn, shows that, under the same circumstances, it is also not the case that X does not o-command Y. Consequently, the definition of the o-command relation must be adequately specified for branching obliqueness hierarchies as follows (italics indicates the specification added to (21))2.",
        "(23) (Non-linear) 0-command • X 0-COMMANDS Y iff X is a less oblique coargument of Z that dominates Y; X LOCALLY o-commands Y if • X DOES NOT 0-COMMAND Y iff X is not a less oblique coargument of Z that dominates Y and is not as oblique as Y; X does not LOCALLY o-commands Y. if"
      ]
    },
    {
      "heading": "Conclusions",
      "text": [
        "It is was shown that the accuracy of the syntax-semantics interface in HPSG grammars, in general, and the empirical adequacy of Binding Theory, in particular, are improved by allowing the obliqueness hierarchy to have a branching configuration.",
        "Data involving subject-oriented reflexives, both in active and passive constructions, subject-oriented reflexive pronouns, and reflexives in double oblique constructions presented difficult, apparently unrelated, puzzles for the current Binding Theory which received a neat and unified solution under the present account."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "I am grateful to Hans Uszkoreit and Palmira Marrafa for their advice.",
        "This research was supported in part by the PRAXIS XXI Program of the Portuguese Ministry of Science.",
        "2 Due to space constraints other cases where X and do not precede each other but one is not as oblique as the other were not discussed in this paper.",
        "But it will be easy to check that (23) is adequately defined for such cases, for whose current analyses the improvements proposed here have no impact."
      ]
    }
  ]
}
