{
  "info": {
    "authors": [
      "T. E. Forster",
      "C. M. Rood"
    ],
    "book": "Computational Linguistics",
    "id": "acl-J96-3005",
    "title": "Sethood and Situations",
    "url": "https://aclweb.org/anthology/J96-3005",
    "year": 1996
  },
  "references": [],
  "sections": [
    {
      "text": [
        "In Situations and Attitudes (Barwise and Perry 1983) Barwise and Perry decide that meaning should be taken to be a triadic relation not a dyadic one.",
        "While there may be good reasons for deciding to procede on this basis, one of the reasons they give is definitely a bad one, and this is the principal subject of this note.",
        "On pages 222-23 they remark that if meaning is to be a dyadic relation it is necessary that the complement of a situation should – at least sometimes – be another situation.",
        "In the set theory that is the basis for their development – KPU – it is elementary that the complement of a set is never a set.",
        "This compels the designers of situation semantics to make meaning a triadic relation as we will now explain.",
        "Barwise and Perry take individuals, properties, relations, and locations as primitives.",
        "A situation-type is a partial function from nary relations and n individuals to the set {0,1} (p. 8).",
        "In modern situation-semantic parlance, this is often referred to as an infon, or (more precisely) a basic infon.",
        "An event, or course-of-events (coe), is a function from locations to situation-types.",
        "For example, the situation-type corresponding to a (real-world) situation in which a dog named Molly barks would be: (at 1, barks, Molly, 1) and one related coe might be: e { (at 1, barks, Molly, 1), (at 1', shouts at, Mr. Levine, Molly, 1), (at I\", barks, Molly, 0) } Consider the predicate SO (seeing option) on coes.",
        "In a given event, s, an individual, a, classifies events according to what s/he sees and knows.",
        "That is: (SO, a, e1,1) E s if el is compatible with what a sees and knows; (SO, a, e2, 0) E s if e2 is incompatible with what a sees and knows.",
        "This is a partial classification of events; i.e., some events may be neither SO-yes nor SO-no.",
        "Further to this:"
      ]
    },
    {
      "heading": "• Definition",
      "text": [
        "In a given situation, s, an event, e, is a visual option for agent a if (SO, a, e, 1) E s"
      ]
    },
    {
      "heading": "• Definition",
      "text": [
        "Similarly, e is a visual alternative for a if it is not the case that (SO, a, e, 0) E s Given s as above, let: Xvo = {e : (SO, a, e, 1) E s} = collection of events that are visual/seeing options for a in s. © 1996 Association for Computational Linguistics  Also, let:",
        "= collection of events that a classifies as not being visual options.",
        "Then: XvA = collection of visual alternatives for a = XNVO.",
        "(In general, we cannot assume XNVO = Xvo•) An utterance, 0, determines a triple 43.",
        "= (d, c, 0) composed of a discourse situation, d, a speaker connection function, c, and the utterance, 0.",
        "Furthermore, our interpretation relation (a function from utterances of the above form to collections of events) is given as: [43.1 = interpretation of 0 according to d and c = {e : d, cricie holds) .",
        "The speaker connection function, c, (or anchor) grounds the individuals, relations, and locations mentioned in 0 to actual entities participating in the discourse situation, d. F]] is thus a binary relation, relating the utterance triple to the described situation, 1141.",
        "Note that the discourse situation, d, is the situation in which 0 is uttered and thus is usually distinct from the described situation, 1141, except in cases of self-reflexive discourse.",
        "For example, if 0 = FIDO RAN, c(FIDO) [\"FIDO\" is mentioned] = Fido [\"Fido\" is used], and c(RAN) = 1 [a location], then if:",
        "we have e E [(13].",
        "There is a problem with this analysis that leads Barwise and Perry to seek a representation of mental states and events with which to augment the interpretation relation.",
        "The problem involves a distinction Barwise and Perry make between epistemic and non-epistemic perception.",
        "Attitudinal reports involving the phrase \"see that\" followed by a finite complement involve epistemic perception – that is, they yield information about the inference an agent has performed after seeing a given coe or situation (p. 207).",
        "The problem comes about when Barwise and Perry attempt to characterize attitude reports involving \"see that\" in terms of the relation SO.",
        "On pages 209-11 Barwise and Perry claim: a sees that 0 > le : not d, 401jel C XNVO(*) i.e., those events not in the interpretation of y5 must be classified as SO-no.",
        "They give the following proof, on page 211."
      ]
    },
    {
      "heading": "Proof",
      "text": [
        "\"A situation e is one where a sees that cb if 0 holds in each of a's visual alternatives at",
        "and since XvA C FI)Il <=> Fil C XNVO (taking complements), we obtain the result.",
        "This yields the following situational analysis of attitudinal reports involving epistemic perception.",
        "Given an utterance:",
        "The fact that any SO-no event must be classified as such by the event e (the event corresponding to the attitude report) means that if we view e as a collection of infons, we will have: lel > I XNVOI and by a result above, IXNvol > MI It is Barwise and Perry's contention (p. 222) that F13➢ is a proper class, therefore e is as well.",
        "Consider the utterance: al := JOE SAW THAT JACKIE WAS BITING MOLLY.",
        "Barwise and Perry argue that there is a proper class of events el in which Jackie was not biting Molly, events that must be classified with SO-no.",
        "But then [the event] e required to classify Joe's visual state must be a proper class.",
        "(p. 222) Thus such events cannot, for example, be constituents of other situations.",
        "In particular, iterated (or embedded) attitude reports cannot be handled in this framework.",
        "A report such as:",
        "would require that the event, e, classifying Joe's visual state be a constituent of o-2's interpretation, F2II.",
        "This is because the interpretation relation, d, 4E2➢e holds: intuitively, the putative event corresponding to the situation described in a2 would have to include e since Joe's visual state in fact comprises the complement of the outer \"see that\" clause.",
        "Yet e is a proper class and so we cannot have e E 1[E2]] as we require.",
        "This can be rectified by adopting as a set-theoretic basis a set theory in which the complement of a set is always a set.",
        "In this case, the analysis proceeds as before, saving that the collection 1441 (as above) is now a set.",
        "With the collection XNVO no longer formally constrained to being a class, arguments of the type rife throughout (Barwise and Perry 1983) can be lodged to illustrate XNvo'S \"set-ness,\" as well as that of",
        "the interpretations of utterances such as an.",
        "Thus the situational analysis of attitudinal reports extends to iterated reports such as o-2 without violation of set membership dicta.",
        "Whatever reasons caused Barwise and Perry to desire a set theory with ur-elements should presumably still be respected, so if we can find a consistent set theory with ur-elements and a universal set, the outlook will be a lot brighter.",
        "Fortunately there is such a system, the Jensen-Quine system of set theory known as NFU.",
        "For more on this see Holmes (1994, 1996).",
        "Of course, an easy consequence of an axiom of complementation such as we have in NFU is the negation of the axiom of foundation.",
        "Barwise has elsewhere (1984) argued that we should not regard the axiom of foundation as essential."
      ]
    }
  ]
}
