{
  "info": {
    "authors": [
      "I. Dan Melamed"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-2129",
    "title": "Automatic Detection of Omissions in Translations",
    "url": "https://aclweb.org/anthology/C96-2129",
    "year": 1996
  },
  "references": [
    "acl-P91-1023",
    "acl-P93-1001",
    "acl-W93-0301",
    "acl-W96-0201"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "AD OMIT is an algorithm for Automatic Detection of °Missions in Translations.",
        "The algorithm relies solely on geometric analysis of bitext maps and uses no linguistic information.",
        "This property allows it to deal equally well with omissions that do not correspond to linguistic units, such as might result from word-processing mishaps.",
        "ADOMIT has proven itself by discovering many errors in a hand-constructed gold standard for evaluating bitext mapping algorithms.",
        "Quantitative evaluation on simulated omissions showed that, even with today's poor bitext mapping technology, ADOMIT is a valuable quality control tool for translators and translation bureaus."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Omissions in translations arise in several ways.",
        "A tired translator can accidentally skip a sentence or a paragraph in a large text.",
        "Pressing a wrong key can cause a word processing system to delete several lines without warning.",
        "Such anomalies can usually be detected by careful proofreading.",
        "However, price competition is forcing translation bureaus to cut clown on this labor-intensive practice.",
        "An automatic method of detecting omissions can be a great help in maintaining translation quality.",
        "ADOMIT is an algorithm for Automatic Detection of °Missions in Translations.",
        "ADOMIT rests on principles of geometry, and uses no linguistic information.",
        "This property allows it to deal equally well with omissions that do not correspond to linguistic units, such as might result from word-processing mishaps.",
        "ADOMIT is limited only by the quality of the available bitext map.",
        "The paper begins by describing the geometric properties of bitext maps.",
        "These properties enable the Basic Method for detecting omissions.",
        "Section 5 suggests how the omission detection technique can be embodied in a translators' tool.",
        "The main challenge to perfect omission detection is noise in bitext maps, which is characterized in Section 6.",
        "ADOMIT is a more robust variation of the Basic Method.",
        "Section 7 explains how ADOMIT filters out some of the noise in bitext maps.",
        "Section 8 demonstrates ADOMI'l\"s performance and its value as a quality control tool."
      ]
    },
    {
      "heading": "2 Bitext Maps",
      "text": [
        "Any algorithm for detecting omissions in a translation must use a process of elimination: It must first decide which segments of the original text have corresponding segments in the translation.",
        "This decision requires a detailed description of the correspondence between units of the original text and units of the translation.",
        "To understand such correspondence, think of the original text and the translation as a single bitext (Harris, 1988).",
        "A description of the correspondence between the two halves of the bitext is called a bitext map.",
        "At least two methods for finding bitext maps have been described in the literature (Church, 1993; Warned, 1996).",
        "Both methods output a sequence of corresponding character positions in the two texts.",
        "The novelty of the omission detection method presented in this paper lies in analyzing these correspondence points geometrically.",
        "A text and its translation can form the axes of a rectangular bitext space, as in Figure 1.",
        "The height and width of the rectangle correspond to the lengths of the two texts, in characters.",
        "The lower left corner of the rectangle represents the texts' beginnings.",
        "The upper right corner represents the texts' ends.",
        "If we know other corresponding character positions between the two texts, we can plot them as points in the bitext space.",
        "The bitext map is the real-valued function obtained by interpolating successive points in the bitext space.",
        "The bitext map between two texts that are translations of each other (mutual translations) will be injective (one to one).",
        "Bitext maps have another property that is crucial for detecting omissions in translations.",
        "There is a very high correlation between the lengths of mutual translations (I) = .991) (Gale & Church, 1991).",
        "This implies that the slope of segments of the bitext map function fluctuates very little.",
        "The slope of any segment of the",
        "map will, in probability, lie very close to the ratio of the lengths of the two texts.",
        "In other words, the slope of map segments has very low variance."
      ]
    },
    {
      "heading": "3 The Basic Method",
      "text": [
        "Omissions in translations give rise to distinctive patterns in bitext maps, as illustrated in Figure -I.",
        "The nearly horizontal part of the bitext snap in",
        "region 0 takes up almost no part of the vertical axis.",
        "This region represents a section of the text, on the horizontal axis that has no corresponding section in the text on the vertical axis -- - the very definition of an omission.",
        "The slope between the end points of the region is unusually low.",
        "An omission in the text on the horizontal axis would manifest itself as a nearly vertical region in the bitext space.",
        "These unusual slope conditions are the key to detecting omissions.",
        "Given a noise-free bitext map, Omissions are easy to detect.",
        "First, a bitext space is constructed by placing the original text on the y-axis, and the translation on the x-axis.",
        "Second, the known points of correspondence are plotted in the bitext space.",
        "Hach adjacent pair of points bounds a segment of the bitext map.",
        "Any segment whose slope is unusually low is a likely omission.",
        "This notion can be made precise by specifying a slope angle threshold I.",
        "So, third, segments with slope angle a < t are flagged as omitted segments."
      ]
    },
    {
      "heading": "4 Noise-Free Bitext Maps",
      "text": [
        "'['he only way to ensure that a bitext map is noise-free is to construct one by hand.",
        "Simard et, al.",
        "(1992) hand-aligned corresponding sentences in two excerpts of the Canadian Hansards (parliamentary debate transcripts available in Filly;lish and French).",
        "l'or historical reasons, these bi-texts are named \"easy\" and \"hard\" in the literature.",
        "The sentence-based alignments were converted to character-based alignments by noting the corresponding character positions at the end of each pair of aligned sentences.",
        "The result was two hand-constructed bitext maps.",
        "Several researchers have iised these particular bitext niaps as a gold standard for evaluating bitext mapping and alignment algorithms (Simard et al.",
        "1992; Church, 1993; nagan et al., 1993; Metamed, 1996).",
        "Surprisingly, ADOM H' found many errors in these hand-aligned bitexts, both in the alignment and in the original translation.",
        "ADOM1T processed both halves of both bitexts using slope angle thresholds from 5° to 20°, in increments of 5°.",
        "For each run, ADOMEI1 produced a list of the bitext map's segments whose slope angles were below the specified threshold I.",
        "The output for the French half of the \"easy\" bitext, with 15°, consisted of the following 10 items: (26869, 29175) to (26917, 29176) (42075, 45647) to (42179, 45648) (44172, 47794) to (44236, 47795) (211071, 230935) to (211379, 231007) (211725, 231714) to (211795, 231715) (319179, 348672) to (319207, 348673) (436118, 479850) to (436163, 479857) (453064, 499175) to (453116, 499176) (504626, 556847) to (504663, 556848) (658098, 726197) to (658225, 726198) Each ordered pair is a. coordinate in the bitext space; each pair of coordinates delimits one omitted segment.",
        "litmunination of these 10 pairs of character ranges in the bitext revealed that",
        "• 4 omitted segments pointed to omissions in the original translation, • 4 omitted segments pointed to alignment errors, • 1 omitted segment pointed to an omission which apparently caused an alignment error (i.e. the segment contained one of each), • 1 omitted segment pointed to a piece of text that was accidentally repeated in the",
        "but only translated once.",
        "With t 10°, 9 of the 10 segments in the list still came up; 8 out of 10 remained with 5°.",
        "Similar errors were discovered in the other half of the \"easy\" bitext, arid in the \"hard\" bitext, including one omission of more than 450 characters.",
        "Other segments appeared in the list for t > 15°.",
        "None of the other segments were outright omissions or misalignments.",
        "However, all of them corresponded to non-literal translations or paraphrases.",
        "For instance, with 20°, A DOM1T discovered an instance of \"Why is the government doing this?\"",
        "translated as \"Po urquoi?\"",
        "The hand-aligned bitexts were also used to measure ADOMIT's recall.",
        "The human aligners marked omissions in the original translation by 1-0 alignments (Gale & Church, 1991; Isabelle, 1995).",
        "ADOMIT did not use this information; the algorithm has no notion of a line of text.",
        "However, a simple cross-check showed that ADOMIT found all of the omissions.",
        "The README file distributed with the bitexts admitted that the \"human aligners weren't infallible\" and predicted \"probably no more than five or so\" alignment errors.",
        "ADOMIT corroborated this prediction by finding exactly five alignment errors.",
        "ADOMIT's recall on both kinds of errors implies that when the ten troublesome segments were hand-corrected in the \"easy\" bitext, the result was very likely the world's first noise-free bitext map."
      ]
    },
    {
      "heading": "5 A Translators' Tool",
      "text": [
        "As any translator knows, many omissions are intentional.",
        "Translations are seldom word for word.",
        "Metaphors and idioms usually cannot be translated literally; so, paraphrasing is common.",
        "Sometimes, a paraphrased translation is much shorter or much longer than the original.",
        "Segments of the bitext map that represent such translations will have slope characteristics similar to omissions, even though the translations may be perfectly valid.",
        "These cases arc termed intended omissions to distinguish them from omission errors.",
        "To be useful, the omission detection algorithm must be able to tell the difference between intended and unintended omissions.",
        "Fortunately, the two kinds of omissions have very different length distributions.",
        "Intended omissions are seldom longer than a few words, whereas accidental omissions are often on the order of a sentence or more.",
        "So, an easy automatic way to separate the accidental omissions from the intended omissions is to sort all the omitted segments from longest to shortest.",
        "The longer accidental omissions will float to the top of the sorted list.",
        "Translators can search for omissions after they finish a translation, just like other writers run spelling checkers , after they finish writing.",
        "A translator who wants to correct omission errors can find them by scanning the sorted list of omitted segments from the top, and examining the relevant regions of the bitext.",
        "Each time the list points to an accidental omission, the translator can make the appropriate correction in the translation.",
        "If the translation is reasonably complete, the accidental omissions will quickly stop appearing in the list and the correction process can stop.",
        "Only the smallest errors of omission will remain."
      ]
    },
    {
      "heading": "6 The Problem of Noisy Maps",
      "text": [
        "The results of Experiment #1 demonstrate ADOMIT's potential.",
        "However, such stellar performance is only possible with a nearly perfect bitext map.",
        "Such bitext maps rarely exist outside the laboratory; today's best automatic methods for finding bitext maps are far from perfect (Church, 1993; Dagan et al., 1993; Melamed, 1996).",
        "At least two kinds of map errors can interfere with omission detection.",
        "One kind results in spurious omitted segments, while the other hides real omissions.",
        "Figure 2 shows how erroneous points in a bitext map can be indistinguishable from omitted segments.",
        "When such errors occur in the map,",
        "ADOMIT cannot help but announce an omission where there isn't one.",
        "This kind of map error is the main obstacle to the algorithm's precision.",
        "The other kind of map error is the main obstacle to the algorithm's recall.",
        "A typical manifestation is illustrated in Figure 1.",
        "The map points in Region 0 contradict the injective property of bitext maps.",
        "Most of the points in Region 0 are probably noise, because they map many positions on the x-axis to just a few positions on the y-axis.",
        "Such spurious points break up large omitted segments into sequences of small ones.",
        "When the omitted segments are sorted by length for presentation to the translator, the fragmented omitted segments will sink to the bottom of the list along with segments that correspond to small intended omissions.",
        "The translator is likely to stop scanning the sorted list of omissions before reaching Chem."
      ]
    },
    {
      "heading": "7 ADOMIT",
      "text": [
        "sC A DOMIT alleviates the fragmentation problem by finding and ignoring extraneous map points.",
        "A couple of definitions help to explain the technique.",
        "Recall that omitted segments arc defined with respect to a chosen slope angle threshold Any segment of the bitext map with slope angle less than t is an omitted segment.",
        "An omitted segment that contains extraneous points can be characterized as a sequence of minimal omitted segments, interspersed with one or more interfering segments.",
        "A minimal omitted segment is an omitted seginent between two adjacent points in the bitext map.",
        "A maximal omitted segment is an omitted segment that is not a proper subsegment of another omitted segment.",
        "Interfering segments are subsegments of maximal omitted segments with a slope angle above the chosen threshold.",
        "Interfering segments are always delimited by extraneous map points.",
        "If it were not for interfering segments, the fragmentation problem could he solved by simply concatenating adjacent minimal omitted segments.",
        "Using these definitions, the problem of reconstructing maximal omitted segments can be stated as follows: Which sequences of minimal omitted segments re-suited from fragmentation of a maximal omitted segment?",
        "A maximal omitted segment must have a slope angle below the ch OS011 threshold t. So, the problem can be solved by considering each pair of minimal omitted segments, to see if the slope angle between the starting point of the first and the end point of the second is less than This brute force solution requires approximately comparisons.",
        "Since a large bitext may have tens of thousands of minimal omitted segments, a faster method is desirable.",
        "1.",
        "'heorein l suggests a fast algorithm to search for pairs or minimal omitted segments that are farthest apart, and that may have resulted from fragmentation of a maximal omitted segment.",
        "The theorem is illustrated in Figure 3.",
        "13 and 7' are mnemonics for \"bottom\" and \"top.\"",
        "then the slope angle of segment se would be greater than the slope angle of 7' t, so se could not be an omitted segment.",
        "CI ADOMIT exploits Theorem t as follows.",
        "minimal omitted segment z in A is considered in turn.",
        "Starting at z, ADOMIT searches the array A for the last e. rightmost) segment whose right end point e is in the triangle Asib.",
        "Usually, this segment will be z itself, in which case the single minimal omitted segment is deemed a maximal omitted segment.",
        "When e is not on the same minimal omitted segment as s, A DOM I'!'",
        "concatenates all the segments between s and e to form a maximal orintted segment.",
        "The search starting from segment z can stop as soon as it encounters a segment with a right end point higher than i.",
        "For useful values of each search will span only a handful of candidate end points.",
        "Processing the entire array A in this manner produces the desired set of maximal omitted segments very quickly."
      ]
    },
    {
      "heading": "8 Evaluation",
      "text": [
        "To accurately evaluate a system for detecting omissions in translations, it is necessary to use a bitext with many omissions, whose locations are known in advance.",
        "For perfect validity, the omissions should he those of a real translator, working on a real translation, detected by a perfect; proofreader.",
        "Unfortunately, first drafts of translations that had been subjected to careful revision were not readily available.",
        "'therefore, the evaluation proceeded by simulation.",
        "The advantage of a simulation was complete control over the lengths and relative positions of omissions.",
        "'this is important because the noise in a bitext map is more likely to obscure a short omission than a long one.",
        "The simulated omissions' lengths were chosen to represent the lengths of typical sentences and paragraphs in real texts.",
        "A corpus of 61479 Lc Monde paragraphs yielded a median French paragraph length of 553 characters.",
        "I had no corpus of French sentences, so I estimated the median French sentence length less directly.",
        "A corpus of 43747 Wall Street Journal sentences yielded a median English sentence length of 126 characters.",
        "This number was multiplied by 1.103, the ratio of text lengths in the \"easy\" bitext, to yield a median French sentence length of 139.",
        "Of course, the lengths of sentences and paragraphs in other text genres will vary.",
        "The median lengths of sentences and paragraphs in this paper are 114 and 730 characters, respectively.",
        "Longer omissions are easier to detect.",
        "The placement of simulated omission.s in the text was governed by the assumption that transla-tors' errors of omission occur independently from one another.",
        "This assumption implied that it was reasonable to scatter the simulated omissions in the text using any memoryless distribution.",
        "Such a distribution simplified the experimental design, because performance on a fixed number of omissions in one text would be the same as performance on the same number of omissions scattered among multiple texts.",
        "As a result, the bitext mapping algorithm had to be run only once per parameter set, instead of separately for each of the 100 omissions in that parameter set.",
        "A useful evaluation of any omission detection algorithm must take the human factor into account.",
        "A translator is unlikely to slog through a long series of false omissions to make sure that there are no more true omissions in the translation.",
        "Several consecutive false omissions will deter the translator from searching any further.",
        "On average, the more consecutive false omissions it takes for a translator to give up, the more true omissions they will find.",
        "Thus, recall is highly correlated with the amount of patience that a translator has.",
        "Translator patience is one of the independent variables in this experiment, quantified in terrns of the number of consecutive false omissions that the translator will tolerate.",
        "Separate evaluations were carried out for the Basic Method and for A DOMIT, and each method was evaluated separately on the two different omission lengths.",
        "The 2x2 design necessitated four repetitions of the following steps:",
        "1.",
        "100 segments of the given length were deleted from the French half of the bitext.",
        "The position of each simulated omission was randomly generated from a uniform distribution, except that, to simplify subsequent evaluation, the omissions were spaced at least 1000 characters apart.",
        "2.",
        "A hand-constructed bitext map was used to find the segments in the English half of",
        "the bitext that corresponded to the deleted French segments.",
        "For the purposes of the simulation, these English segments served as the \"true\" omitted segments.",
        "3.",
        "The SIMR, bitext mapping algorithm (Melamed, 1996) was used to find a map between the original English text and the French text containing the simulated omissions.",
        "Note that SIMR can be used with or without a translation lexicon.",
        "Use of a translation lexicon results in more accurate bitext maps, which make omission detection easier.",
        "However, wide-coverage translation lexicons are rarely available.",
        "To make the evaluation more representative, SIMR was run without this resource.",
        "4.",
        "The bitext map resulting from Step 3 was fed into the Basic Method for detecting omissions.",
        "The omitted segments flagged by the Basic Method were sorted in order of decreasing length.",
        "5.",
        "Each omitted segment in the output from Step 4 was compared to the list of true omitted segments from Step 2.",
        "If any of the true omitted segments overlapped the flagged omitted segment, the \"true omissions\" counter was incremented.",
        "Otherwise, the \"false omissions\" counter was incremented.",
        "An example of the resulting pattern of increments is shown in Figure 4.",
        "6.",
        "The pattern of increments was further analyzed to find the first point at which the \"false omissions\" counter was incremented 3 times in a row.",
        "The value of the \"true omissions\" counter at that point represented the recall achieved by translators who give up after 3 consecutive false omissions.",
        "To measure the recall that would be achieved by 'more patient translators, the \"true omissions\" counter was also recorded at the first occurrence of 4 and 5 consecutive false omissions.",
        "7.",
        "Steps 1 to 6 were repeated 10 times, in order to measure 95% confidence intervals.",
        "The low slope angle thresholds used in Section 4 are suboptimal in the presence of map noise, because much of the noise results in segments of very low slope.",
        "The optimum.",
        "value t ------ 37° was deter mined using a separate development bitext.",
        "With frozen at the optimum value, recall was measured on the corrected \"easy\" bitext.",
        "Figures 5 and 6 plot the mean recall scores for translators with different degrees of patience.",
        "A.DOMIT outperformed the Basic Method by up to 48 percentage points.",
        "A.DOMIT is also more robust, as indicated by its shorter confidence intervals.",
        "Figure 6 shows that ADOMIT can help translators catch more than 90% of all paragraph-size omissions, and more than one half of all sentence-size omissions.",
        "ADOMIT is only limited by the quality of the input bitext map.",
        "The severity of this limitation is yet to be determined.",
        "This paper evaluated ADOMFt on a pair of languages for winch SIMIR can reliably produce good bitext maps (Melamed, 1996).",
        "SIMR will soon he tested on other language pairs.",
        "ADOMIT will become even more useful as better bitext mapping technology becomes available."
      ]
    },
    {
      "heading": "9 Conclusion",
      "text": [
        "ADOMIT is the first published automatic method for detecting omissions in translations.",
        "ADOM:11\"s performance is limited only by the accuracy of the input bitext map.",
        "Given an accurate bitext map, ADOM IT can reliably detect even the smallest errors of omission.",
        "Even with today's poor bitext mapping technology, ADOMI.T finds a large enough proportion of typical omissions to be of great practical benefit.",
        "The technique is easy to implement and easy to integrate into a transla",
        "tor's routine.",
        "ADOMIT is a valuable quality control tool for translators and translation bureaus."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "'Phis research began while I was a visitor at the Centre d'Innovation en 'technologies de 'Information in Laval, Canada.",
        "The problem of omission detection was suggested to nice by Elliott Macklovitch.",
        "I am grateful to the following people for commenting on earlier drafts: Pierre Isabelle, Mickey Chanclrasekar, Mike Collins, Mitch Marcus, Adwait Ratnaparkhi, Srinivas, and two anonymous reviewers.",
        "My work was partially funded by ARO grant DAA.L03-89-00031 PRIME and by ARIA grants N0001'1.-90-.I-1863 and N6600194C 6043."
      ]
    }
  ]
}
