{
  "info": {
    "authors": [
      "Beate Firzlaff",
      "Daniela S. Kunz"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-1065",
    "title": "Discourse Semantics Meets Lexical Field Semantics",
    "url": "https://aclweb.org/anthology/C96-1065",
    "year": 1996
  },
  "references": [
    "acl-E91-1046"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The focus of this article is the integration of two different perspectives on lexical semantics: Discourse Representation Theory's (DRT) inferentially motivated approach and Semantic Emphasis Theory's (SET) lexical field based view.",
        "A new joined representation format is developed which is exemplified by analyses of German verbs.",
        "The benefits thereof are on both sides.",
        "DRT gains basic entries for whole lexical fields and, furthermore, a systematic interface between semantic and syntactic argument structures.",
        "SET profits both from the much larger semantic coverage and from the fine grained lexical analyses which reflect inferential behaviour."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The construction of lexical entries is one of the crucial and challenging tasks given in the field of computational linguistics.",
        "In the ideal case, lexical entries fulfill, among others, two requirements.",
        "First, the representations are suitably fine grained such that they capture lexeme-specific distinctions.",
        "Second, the lexical entries are sufficiently general.",
        "for reflecting similarities between single lexemes.",
        "Furthermore, the information they contain should systematically link various levels of description, e.g. syntax and semantics as well as referential and inferential potential.",
        "The latter is of special interest for text analysis as opposed to sentence analysis (cf. for example (Haenelt, 1994); (Haenelt and KOnyves-Toth, 1991)).",
        "Corresponding to these requirements, we exploit the specific strengths of two distinct semantic theories.",
        "These theories are Discourse Representation Theory (DRT) ((Kamp and Reyle, 1993); (FraCaS-D8, 1994)) and Semantic Emphasis Theory (SET) ((Kunze, 1991); (Kunze, 1993)).",
        "However, our central goal is an integration of DRT and SET.",
        "It will be shown that this integration is possible and of benefit to both theories as well as to the construction of lexical entries.",
        "To achieve our overall objective, the following four points will be exemplified by joined representations of German verbs:",
        "• DRT profits from SET's systematic derivations of thematic roles and of morpho-syntactic features on the basis of predicate-argument-structures.",
        "These features include both grammatical and prepositional case.",
        "• DIRT gains a purely semantically motivated orientation towards lexical fields.",
        "• DET covers much more semantic phenomena than SET.",
        "Therefore, DRT offers SET the possibility to test its results against a semantic background that e.g. includes plurals, tenses, and attitudes.",
        "• DRT's fine grained lexical analyses are",
        "grounded in inferential behaviour.",
        "These lexical distinctions mark possible starting points for refining SET's representations.",
        "The paper is structured as follows: DRT's and SET's basic motivations, principles arid formal means concerning lexical semantics are retraced in sections 2 and 3.",
        "The new joined representation format is introduced in section 4 by analysing the German verbs leihen (in its variant to lend) and verschenken (in its variant to give as a present).",
        "Moreover, section 4 provides evidence that the four main points stated above are backed up by the joined analyses.",
        "Finally, directions for further research are pointed out in section 5."
      ]
    },
    {
      "heading": "2 DRT Inferentially Motivated",
      "text": [
        "Discourse Representation Theory (DRT) is first and foremost a theory about discourse interpretation, i.e., it is essentially textually oriented in nature.",
        "The meaning of sequences of sentences is seen as strongly connected with their",
        "inferential behaviour.",
        "Therefore, work on lexical semantics in the DRT :framework ((Kamp and Rof3deutscher, 1994a); (Kamp and Roildeutscher, 1994b); (Roi3deutscher, 1994)) investigates the role of lexical information in supporting inferences.",
        "Consequently, lexical distinctions correlate with non-equivalent sets of associated inferences.",
        "The following examples illustrate that the German verb leihen (in its variant to lend) implies in contrast to the German verb verschenken (in its variant to give as a present) the lending person's belief in a return of the involved object:",
        "(la) Calvin leiht Hobbes eine Krawatte.",
        "(Calvin lends Hobbes a tie) (lb) Calvin glaubt, daft Hobbes ihin die Krawatte zurlickgeben wird.",
        "(Calvin believes that Hobbes him the tie will give back) (2a) Calvin MI'S chenkt ein Ruch an Hobbes.",
        "(Calvin gives as a present a book to Hobbes) 77?",
        "(2b) Calvin, glaubt, daft Hobbes ihm das Bitch zuriickgeben wird.",
        "(Calvin believes that Hobbes him the book will give back)",
        "In line with the representation format developed by Kamp and Rolideutscher, the corresponding lexical entries are twofold structures: They consist of a presuppositional and an assertoric Discourse Representation Structure (DRS).",
        "The underlying anaphoric notion of presupposition was originally proposed by (Sande, 1992).",
        "Presuppositional information is embedded in the discourse context by a process called justification, which combines binding (verification) with contextual enrichment (accommodation) in varying proportions.",
        "Kamp and Rofideutscher model the interface between syntactic and semantic arguments as a list of pairs.",
        "Each pair consists of the generalized case information and the corresponding thematic role of the argument slot under consideration.",
        "This mapping offers two starting points for an integration of DRT and SET.",
        "Firstly, the representation format for the generalized case information is only sketched, an algorithm for case assignment is not given: With each verb is associated a given set of so-called theta roles These theta roles are arranged in a fixed hierarchy, the theta-hierarchy.",
        "[...] Those argument phrases which get assigned a theta role also get assigned a particular case (Nom, Acc, etc.).",
        "[...] Case assignment is partially determined by the theta hierarchy in that the argument phrase which bears the highest theta role (in the sense of this hierarchy) always gets nominative case.",
        "((Kamp and Rolideutscher, 1994a): pp.",
        "109f) Secondly, the thematic roles are specified individually for each lexical entry, there is no generalization with respect to lexical fields.",
        "As an.",
        "example, the interface list of verschenken is given in Figure IL, where the components of each pair are displayed vertically.",
        "ec: verschenken [< ,NOM > < 02, ACC > (< 03, an + ACC >)1 Agent&Source Theme Goal",
        "The discourse referent cc and the thematic roles of the interface are direct links to the DRS representing the meaning of the German verb verschenken (cf.",
        "Figure 2).",
        "The event complex ec, winch stands for the verb itself, is described as a process e, winch is caused by an action e* of a person p. p represents the one who gives the present, u to another person q.",
        "The giving itself is characterized by the concept CHANGE-SIGN.",
        "The signs changed are those of the disposal and ownership relations so and s, : p looses the disposal and ownership of u and q gains them.",
        "The former circumstances of disposal and ownership (s0 and .51 abut on cc: so DC: cc st Dc.",
        "ec) are presupposed, the poststates (cc DC s2 ec DC 53) are asserted.",
        "The example inferences (la) to (lb) and (2a) to (2b) result from differences in the lexical DliSs of leihen and verschenken.",
        "The main point here is that the German verb leihen implies the lending person's belief in a return of the involved object.",
        "On the basis of this belief it is easy to infer from (la) to (11)).",
        "However, there is no similar support for inferring from (2a) to (2b).",
        "A detailed lexical representation of leihen will be given in section 4."
      ]
    },
    {
      "heading": "3 SET Lexical Field Based",
      "text": [
        "Semantic Emphasis Theory (SET) has identified principles that allow to link a prototypical description of a situation to a number of prototypical meaning descriptions of concrete lexemes",
        "that are suitable to refer to that situation.",
        "The link is based on a set of well-defined and systematically occurring mappings (cf. (Firzlaff and Kunze, 1995)) rather than on intuitive criteria.",
        "Given a basic semantic form (BSF) as a common starting point, we derive semantic and syntactic case frames and construct prototypical meaning descriptions of concrete lexemes by refining the BSF.",
        "Additionally, the rule based interpretation of a BSF delivers a prototypical description of the corresponding situation.",
        "The set of lexemes that are suitable to refer to the same situation constitutes a lexical field.",
        "The field as a whole is characterized by a BSF.",
        "A BSF is a propositional description.",
        "It consists of a predicate and a number of arguments, each of which is either a predicate-argument structure or an elementary argument.",
        "In general, elementary arguments are represented by variables that have to be filled in by phrases which denote reference objects (participants of a situation).",
        "The number of arguments, as well as the decision whether the arguments are elementary or propositional, both depend on the predicate that directly takes these arguments.",
        "We derive the participants' thematic roles (deep cases) in accordance with a set of general rules.",
        "Semantically, each pair of a role and the predicate directly dominating an elementary argument demands particular selectional features for that argument.",
        "The BSF describing the field of change-of-possession (with one object to be transferred) and the derived deep cases are given in Figure 3.",
        "From both the syntactic and the semantic point of view, the BSF delivers the maximum case frame of the lexemes that constitute the lexical field.",
        "Some of the roles of the maximum case frame can be put into the foreground; these are said to have emphasis.",
        "Some roles must riot be verbalized explicitly; these are said to be blocked.",
        "In the subset of roles that are riot blocked there are, on the one hand, roles referring to obligatory actants and, on the other hand, roles referring to optional actants.",
        "Which roles have emphasis and which do not have emphasis, which are the ones that must be verbalized, and which are the ones that need not be verbalized is determined according to general rules.",
        "Exploiting the field specific possibilities to make some variables denote the same reference object (by renaming of variables) results in more specific BSFs.",
        "These then describe partial lexical fields like, e.g. to give or to take.",
        "By adding information about emphasis and blocking of roles, a BSF is transformed into a number of prototypical meaning descriptions.",
        "We can then derive systematically which are the suitable grammatical realizations of each role.",
        "However, there are two important points concerning the determination of which grammatical realizations are possible: Firstly, the predicate that takes the corresponding elementary argument directly and, secondly, the choice of that subset of roles of the maximum case frame that are not blocked.",
        "One of the three prototypical meaning descriptions that constitute the partial field of to give and the grammatical case assignment of verschenkeni is given in Figure 4.",
        "(Those parts of the description that have emphasis are written in bold face.",
        "The oc-curence of a variable preceded by \"7\" is blocked.",
        "The grammatical realization of the optional actant (an+accusative) is put in brackets.2)",
        "e.g.: Calvin versehenkt ein Buell an Hobbes .",
        "(Calvin gives as a present a book to Hobbes )",
        "'lace clan+acc Figruirle°471.",
        "Prototypical meaning description and grammatical case assignments.",
        "However, BSFs do not only provide the ground for the derivation of grammatical features.",
        "They are also suitable to derive prototypical situation descriptions.",
        "In order to do so, instantiation rules must be applied to a BSF in a recursive way.",
        "The application of instantiation rules has to be regarded as an interpretation of every partial description in a BSF.",
        "Some of these parts are then represented by variables that have to be filled in by objects referring to states or events, and other parts deliver relationships between these states or events.",
        "In addition, sonic of the instantiation rules provide temporal and/or spatial constraints that are applicable to (the corresponding parts of) a prototypical situation description, e.g., etime is a mapping from the set of events or states to the set of temporal entities (etime: E In general, the instantiation rules provide struc-'Generally, this grammatical case assignment is suitable for about 20 verbs of the partial field to give.",
        "2 More precisely, there is a mapping from the set of variables into the set of nominal phrases (more generally, parts of speech) f: V –+",
        "turing mechanisms in terms of presuppositions and assertions.",
        "As an example, consider the predicate BEC: It has one argument which is a predicate-argument-structure.",
        "This structure is to be interpreted as the final state of a transition.",
        "Because of the instantiation rule of EEC the initial state (init(e)) of the transition ( e) is the \"opposite\" of the final state (lin(e)), i.e., BEC(A) is interpreted as e: TRANSITION ( – IA, A).",
        "According to (Jung and Kiistner, 1990), init(e) (i.e. -,A) is the presupposition of e, and \"-,\" does not affect A's presupposition, e.g. selectional restrictions for A's elementary arguments.",
        "A more extensive example of the derivation of prototypical situation descriptions is given in Figure 5.3 The situation prototypically described in Figure 5 can be referred to by about 65 German verbs, i.e., the elements of the partial field to give including our sample verbs verschenken (in its variant to give as a present) and leihen (iii its variant to lend).",
        "As far as the degree of specification is concerned the description is at least suitable as common denominator.",
        "Since SErl.\"s principal orientation is towards the systematic description of lexical fields rather than of single lexical entries, it provides representations which tend to be underspecified with respect to e.g.:DB.1\"s requirements.",
        "However, due to SET's general approach any further specification of its descriptions leads to an enlargement of the representation rather titan to a change of the common denominator.",
        "The descriptions provided by SET are suitable as the basis for fine grained representations.",
        "Therefore, one can expand the lexical entries rather than constructing them each and every time from.",
        "scratch.",
        "'lb exemplify this, in the next section, the representation of leihen (in its variant to lend) is enriched by the lending person's belief in a return of the involved object.",
        "3ref(f(x)): V 4 4 P. And D is the set of reference objects."
      ]
    },
    {
      "heading": "4 The Puzzle Fits",
      "text": [
        "I lased on the hypothesis that SEl.\"s prototypical situation descriptions can be interpreted in the same way as DB,Ss we have proceeded to a new joined representation format.",
        "Since variables in a BSI\" have to be filled in by reference objects and, furthermore, the recursive application of instantiation rules provides variables of the same kind for events and states, SErs reference objects and Dltrrs discourse referents are regarded as equivalent means of expression.",
        "Therefore, the joined representation format uses I)IIT's boxes.",
        "However, it is enriched with, among others, a revised interface to syntax where the thematic roles are derived according to 1-3Sirs.",
        "The sample representations given in lids section exploit Kamp and Rolideutscher's idea of lexical axioms (cf. (Kamp and Rofideutscher, 1994a); (Kamp and Rofideutscher, 19941)); (Rolideutscher, 1994)).",
        "We can distinguish in a parametric fashion between the semantic components of the entries that characterize (partial) lexical fields and the concept specific information in the axioms.",
        "'The first, pair of axioms introduced below mirrors the fact that the configuration abbreviated by e2 : (c21, c22) (cf.",
        "Figure 5) is suitable to specify a variety of lexical fields wherein the semantics of the elements involves a special kind of' 'change'.",
        "Some examples of these fields are change-of-place (e.g. to travel from one place to another), change-of-class (e.g. to promote somebody to a certain rank), and change-of-possession.",
        "Accordingly, we propose a predicate hierarchy, whereby the predicates PLACE, ISA, HAVE are specializations of the predicate STATE.",
        "Note, however, that this does not affect the mechanism of role derivation presented in section 3.",
        "In the prototypical situation description (cf.",
        "Figure 5), e2 includes e21 and e22.",
        "Each of these denotes a TRANSITION from an initial state to a final state, i.e., from init(e21) and iniqe22) (the presupposition) to 17. d.it,e21, and fin(c22) (the",
        "assertion).",
        "Because of the temporal identity of e21 and e22, there are temporal overlaps between the initial states as well as between the final states.",
        "In the axiom defining CHANGE-SIGN'S prestate, so's consequences sl and s2 correspond to init(e2i) and init(e22).",
        "In the axiom defining CHANGE-SIGN'S result state, so's consequences 51 and s2 correspond to fin(e21) and fin(e22).",
        "The axioms have in common that they involve the concept CIIANGE",
        "The concepts defined by means of these axioms are, then, used to specify the lexical entry of verschenken (in its variant to give as a present).",
        "The thematic roles and the corresponding grammatical realizations result from the derivation presented in section 3.",
        "PRE(CHANGE-SIGN) delivers the first part of verschenken's presupposition.",
        "The parameter STATE is filled in by DISP&OWN which is added to the predicate hierarchy sketched already as a specialization of the predicate HAVE.",
        "Thereby, it is possible to distinguish between the pure disposal and the disposal that is accompanied by ownership.",
        "Furthermore, verschenken's presupposition includes the semantic roles delivered by its prototypical meaning description.",
        "However, the selectional restrictions for discourse referents do riot differ from the restrictions given in the prototypical situation description (cf.",
        "Figure 5).",
        "With respect to the semantic interpretation, each of source-have, goal-have, arid locat-have just means is suitable as first argument in a HAVE-proposition.",
        "Generally, the predicate directly determines the selectional restrictions of its arguments, i.e., the discourse referents.",
        "Furthermore, for those predicates that take more than one argument, it is the order of the arguments which additionally determines the selectional restrictitms.4 In accordance with the prototypical situation description given in Figure 5 the DRS for verschenken is as follows: 4Clearly, these are just two pieces of information for the selectional restrictions.",
        "The entities constituting ec (the action, the transitions, and the causation) are located in a common time span.",
        "Therefore, the transitions' initial states precede ec (so X cc) arid the tran-sitions' final states follow ec (cc DC Si).",
        "The lexical entry of leihen (in its variant to lend) consists of an interface list, whose thematic roles are based on SET, and of semantic structures, which include and extend verschenken's semantic components.",
        "The inferential behaviour of leihen (exemplified in section 2) motivates a formal description that contains more than the basic distinctions provided by the partial lexical field to give.",
        "Additionally, there is the lending person's belief in a return of the involved object, in other words, the belief that the CHANGE-SIGN from so to si is temporary.",
        "Therefore, leihen's representations make use of CHANGE-SIGN's subconcept CIIANGE-SIGN-TEMP.",
        "This subconcept entails a transformation of its superconcept's prestate so (so DC cc) to its superconcept's poststate si (cc Si) as well as the new poststate s2 (ec DC 82), i.e. the belief in a return of the involved object.",
        "ec: leihen [NOM DAT ACC agens, act > < goal, have > < to – obj, have > Figure 9a.",
        "Interface list of leihen's entry.",
        "To make the description of leihen complete, a further lexical axiom which explicitly notes the belief in a return of the involved object is needed.",
        "One of the formal means provided by MIT is the possibility to model components of psychological",
        "attitude states, e.g. beliefs or desires (cf. (FraCaS-D8, 1994)).",
        "This possibility can be used to state the axiom which represents the specific semantic contribution of CHANGE-SIGN-TEMP: its poststate characterized by the state .s2 of the person To being in an psychological attitude state one of whose components (c) is a certain belief.",
        "This belief consists of an inversed cuANGE-siGN-event e, i.e. a return, with its resulting disposal configuration s3.",
        "Thereby, the former circumstances of disposal Si, that result from the CHANGE-SIGN-TEMP-event itself, are supposed to abut on the return event e.",
        "On the one hand, these results mark directions for the development of a comprehensive lexical theory, that includes, for example, an elaborated concept hierarchy with associated axioms.",
        "On the other hand, they can be used for a detailed reconstruction of the inferences mentioned in section 2."
      ]
    },
    {
      "heading": "5 Conclusion and Future Work",
      "text": [
        "In this article, we have first shown that it is sensible and promising to combine DRT's and SET's perspectives on lexical semantics.",
        "We made use of the theory-specific strengths of the single approaches in order to overcome their specific weaknesses and to gain a powerful means of expression for modelling the semantics of lexical entries.",
        "Second, we have proposed that and described how joined representations can be constructed by exploiting the merits of both theories.",
        "Future work will concentrate on evaluating the benefits of this approach for computational text analysis.",
        "The joined representation format proposed here is likely to facilitate and improve lexical modelling as well as the automatic construction of text representations.",
        "Further investigations in other lexical fields and word classes are required in order to achieve a larger lexical coverage.",
        "In correspondence with the theory-specific strengths, promising subtasks will be reference resolution and the construction of conceptual representations."
      ]
    }
  ]
}
