{
  "info": {
    "authors": [
      "Manabu Okumura",
      "Tamura Kouji"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-2147",
    "title": "Zero Pronoun Resolution in Japanese Discourse Based on Centering Theory",
    "url": "https://aclweb.org/anthology/C96-2147",
    "year": 1996
  },
  "references": [
    "acl-A92-1028",
    "acl-C94-2107",
    "acl-C94-2188",
    "acl-J86-3001",
    "acl-J94-2003",
    "acl-J94-2006",
    "acl-J95-2003",
    "acl-P86-1031",
    "acl-P87-1022",
    "acl-P93-1009"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Recently there have been a number of works that model the zero pronoun resolution with the concept called 'center.' However, the usefulness of the previous centering frameworks has not fully evaluated with naturally occurring discourses.",
        "Furthermore, the previous centering theory has handled only the phenomena in successive simple sentences and has not adequately addressed the way to handle complex sentences that are prevalent in naturally occurring discourses.",
        "In this paper, we present a method to handle complex sentences with the centering theory and describe our framework that, identifies the antecedents of zero pronouns in naturally occurring Japanese discourses.",
        "We also present the evaluation of our framework with real discourses."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In many natural languages, elements that can be easily deduced by the reader are frequently omitted from the expressions in discourses.",
        "Particularly in Japanese discourses, tins omission occurs more frequently and a zero pronoun is often used to avoid repeating a noun phrase that appeared in the previous sentences.",
        "A zero pronoun can be considered as a noun phrase which is of an obligatory case and which is not expressed but can be understood through the context(Yoshimoto, 1986).",
        "Therefore, to understand a Japanese discourse, it is important to identify the antecedents of zero pronouns.",
        "Recently there have been a number of works that model the (zero) pronoun resolution with the concept, called `center'(Grosz et al., 1.995; Brennan et al., 1987; Walker et al., 1994; Kameyama, :1.986).",
        "The centering theory tries to identify the antecedent of a (zero) pronoun by the idea that the entity that a sentence most centrally con-cerns(center) tends to he expressed by a (zero) pronoun.",
        "The centering theory has the following advantages.",
        "Because it uses only the surface information in sentences and does not need a huge amount of common sense knowledge to resolve (zero) pronouns, it is easy to implement it on computer systems.",
        "Secondly, it can he applied to many languages(Grosz et al., 1995; Walker et al., 1994).",
        "In spite Of these advantages, unfortunately, the usefulness of the previous centering frameworks has not, fully tested because only a small 1111.111- her of constructed discourses have been used for evaluation.",
        "We think they should be tested with a corpus of naturally occurring discourses.",
        "However, such a test is now difficult because the previous centering theory has only handled the phenomena in successive simple sentences and has not adequately addressed the way to handle complex sentences that are prevalent in naturally occurring discourses.",
        "In tins paper, we present a method to handle complex sentences with the centering theory and describe our framework that identifies the antecedents of zero pronouns in naturally occurring Japanese discourses.",
        "We also present the evaluation of our framework with real discourses.",
        "In section two we outline two versions of the centering theory that have been applied to Japanese zero pronoun resolution.",
        "In section three we explain how zero pronouns in complex sentences can be handled based on the centering theory.",
        "1-.11 section four we describe a set of the experiments that our zero pronoun resolution method in section three is applied to real Japanese discourses."
      ]
    },
    {
      "heading": "2 Two Versions of the Centering Theory",
      "text": [
        "In the centering theory, each sentence has two structures associated with it,: a set of discourse entities called forward-looking centers, Cf s, that appear in the sentence, and a special member of ef s called the backward-looking center, Cb.",
        "The CI, is the discourse entity that, the sentence most centrally concerns.",
        "A Cf may become a C,, later",
        "in the discourse.",
        "The set of Cf s is ordered by their grammatical properties which are considered to reflect their degrees of salience.",
        "The centering theory specifies the following (heuristic) rule: If the Cb of the current sentence is the same as the Cb of the previous sentence, a (zero) pronoun should be used.",
        "There are two versions of the centering theory that have been applied to Japanese zero pronoun resolution: Kameyama's(Kameyama, 1986) and Walker's(Walker et al., 1994).",
        "Roughly both versions use the following same forward center ranking for Japanese:",
        "where Empathy is a grammatical property that indicates the speaker's position in describing a situation.",
        "In addition to the above rule, Kameyama's version uses the property sharing constraint that two zero pronouns in adjacent sentences, which co-specify the same Cb, should share one of the grammatical properties.",
        "This constraint is used for ranking discourse entities in the order of preference as the antecedent of a zero pronoun.",
        "Walker's version, on the other hand, uses the following additional rules and constraint:",
        "• Constraint For each sentence",
        "The center, Cb(Ui), is the highest-ranked element of C1 (Ui_1) that appears in Ui.",
        "• Rules For each sentence 1.",
        "If a certain element of Cf (Ui_i) appears as a (zero) pronoun in then so is C b (U i).",
        "2.",
        "Transition states are ordered, where the transition state is determined based on two factors: whether Cb of the current sentence is the same as of the previous sentence, arid whether Cb is the same as the highest-ranked member of C. of the current sentence.",
        "This transition ordering is used for ranking discourse entities in the order of preference as the antecedent of a zero pronoun.",
        "Basically, when the centering algorithm is used for the (zero) pronoun resolution, the algorithm first generates all possible antecedents for (zero) pronouns in a sentence by enumerating all possible CI, and C1 pairs for the sentence, and then filters and ranks these possible antecedents with the constraint and rules that are mentioned above.",
        "The Cb of the sentence is computed as the side effect of performing the (zero) pronoun resolution."
      ]
    },
    {
      "heading": "3 Processing Complex Sentences with the Centering Theory",
      "text": [
        "In the centering theory that we outlined in the last section, 'sentence', that is its basic unit of processing, means the simple sentence that contains only one predicate(verb).",
        "The centering theory, therefore, has not adequately addressed the way to handle complex sentences that contain multiple verbs.",
        "However, it is necessary to handle complex sentences that are prevalent in naturally occurring discourses with the centering algorithms.",
        "We can think of (at least) two ways to handle complex sentences.",
        "For instance, consider processing a complex sentence of the form `SX Conj SY,' where SX and SY each consists of a simple sentence and Conj is a conjunctive element(Suri and McCoy, 1994)1.",
        "One can imagine processing SX first and then SY as if they are a linear sequence of simple sentences and applying the centering theory to each sentence successively and updating the data structures for centering.",
        "On the other hand, the whole sentence can be treated as a single unit.",
        "This approach, however, has two problems.",
        "First, the intrasentential ellipsis that the antecedent exists in the same sentence' cannot be handled with the centering theory, because the centering theory only handles the intersentential ellipsis.",
        "Therefore, the in-trasentential ellipsis must be dealt with separately from the intersentential ellipsis.",
        "Secondly, in the centering theory, it is unclear whether two zero pronouns with the same grammatical property in the different simple sentences (of a complex sentence) can be simultaneously handled without any extension to the original theory.",
        "Comparing these two approaches, we adopt the former.",
        "And if a sentence contains multiple verbs, we partition it into multiple simple sentences and apply the centering theory to a sequence of partitioned simple sentences individually for the zero pronoun resolution.",
        "Using this approach, we need not modify the original centering algorithm drastically to handle complex sentences.",
        "Even the in-trasentential ellipsis can be handled with the centering theory, because different simple sentences contain the antecedent and the zero pronoun respectively, after partitioning."
      ]
    },
    {
      "heading": "3.1 The range of search for the antecedent",
      "text": [
        "Since the centering theory uses only the information in the previous and current sentences, this might be problematic when we adopt the `partition' approach.",
        "For example, if the previous sentence consists of three simple sentences, 'In case of Japanese, it is a conjunctive postposition.",
        "20f course, the antecedent does not exist in the same simple sentence.",
        "the first simple sentence in the previous sentence becomes the third from the current sentence, after partitioning.",
        "Partitioning might cause that the information in the previous and current (post-partitioned simple) sentences does not include even the information in the current (prepartitioned) sentence.",
        "We think it is inadequate, since the antecedents of zero pronouns often appear in the previous (pre-partitioned) sentence.",
        "Therefore, it is necessary to extend the range of search for the antecedent to more previous (post-partitioned simple) sentences.",
        "To determine to what extent we should extend the range of search for the antecedent, we make the following investigations and experiment:",
        "• How many simple sentences does a naturally occurring sentence consist of?",
        "• How many sentences from the current sentence do we find the antecedent of a zero pronoun in real discourses?",
        "• flow does the accuracy of the zero pronoun resolution change if we vary the range of simple sentences where the antecedent of a zero pronoun is searched?",
        "The first investigation is performed manually, and the result shows that 10,000 sentences of the review articles from the newspaper consist of 24,332 simple sentences.",
        "Therefore, a naturally occurring Japanese sentence can be considered to consist of 2.0 -- 2.5 simple sentences on average.",
        "The second investigation is performed manually on one of the test discourses that are mentioned in the next section, and the result shows that 95% of the antecedents appear in the previous or current (pre-partitioned) sentence.",
        "This result is consistent with the larger-scale investigation that Fir-jisawa et al.",
        "(Fujisawa et al., 1991) made for the same purpose.",
        "Fujisawa's investigation, on 1,087 sentences of the scientific journal and 1,426 sentences of the review articles from the newspaper, showed that 87.6% of the antecedents appeared in the previous or current sentence and 95.1% appeared in the previous two sentences or current sentence.",
        "The third experiment is performed on two of the test discourses in the next section, by implementing two versions of the centering algorithms that are mentioned in the last section and varying the range of simple sentences where the antecedent of a zero pronoun is searched from the previous sentence to the previous ten sentences.",
        "The experiment shows that the accuracy improves until the previous 2 --- 4 sentences are searched, but degrades after that.",
        "Totally taking into account these results, we determine that the antecedents are searched in the previous four simple sentences.",
        "Since the antecedent tends to appear in the closer sentence to the zero pronoun, as Fujisawa's investigation indicates, we determine the following forward center ranking among the C fs of the previous four simple sentences: > C2 > C3 > C4 f where C'f' represents the Cf of the nth simple sentence from the current sentence."
      ]
    },
    {
      "heading": "3.2 Taking into account the information of conjunctive postpositions",
      "text": [
        "Even if the antecedents are searched in the previous four simple sentences, simple 'partition' approach might riot yield good performance, because the information of conjunctive postpositions that are between two adjacent simple sentences is not taken into account.",
        "For example, consider the following sentences:",
        "he did riot notice him.",
        "Here 0 represents a zero pronoun.",
        "Applying the centering algorithm to these sentences, the process becomes as follows:",
        "Therefore, the counter-intuitive interpretation that 'Jiro did riot notice Taro' is obtained.",
        "Since two adjacent simple sentences in a complex sentence are combined together by the conjunctive postposition that indicates the relationship between them, using the information of the conjunctive postposition might improve the performance of the zero pronoun resolution.",
        "To clarify how the zero pronoun resolution relies on the information of conjunctive postpositions, we perform the investigation whether the noun phrases with the same grammatical property agree in two adjacent simple sentences that have a conjunctive postposition between them, by extracting sentences with conjunctive postpositions from the review articles in the newspaper and enumerating the agreement and disagreement.",
        "The enumeration is performed in cases where both sentences have zero pronouns and only either sentence has 'The first sentence in a discourse has no Cb•",
        "a zero pronoun.",
        "Twelve main conjunctive postpositions are investigated.",
        "The result of the investigation is quite similar to the Yoshimoto's and Mi-nami's investigations(Yoshimoto, 1986; Minami, 1974) that classify the conjunctive postpositions into three classes:",
        "• Class A: `nagara' (`and'), `tutu' ('while'), 'te' (`and')4",
        "If two sentences have a conjunctive postposition of class A between them, the subject noun phrases tend to coincide, in both cases where both sentences have zero pronouns and only either sentence has a zero pronoun.",
        "• Class B: 'temo' (`although'), 'node' (`be-cause'), `nom' (`although'), leredo' (`al-though'), `ba' (`if'), `kara' (`because'), `to' ('when')",
        "If two sentences have a conjunctive postposition of class B between them, the antecedent tends to be not the subject of the other sentence, in case where only either sentence has the zero pronoun of the subject position.",
        "In case where both sentences have zero pronouns, the agreement/disagreement depends on the context and does not have any tendency.",
        "• Class C: `ga' (`but')",
        "The agreement/disagreement, depends on the context and does not have any tendency.",
        "i,Frorn this result of the investigation, we determine to apply to the zero pronoun resolution the following heuristics that are concerned with conjunctive postpositions.",
        "Since conjunctive postpositions of class A have a strong preference that two subjects in adjacent sentences tend to coincide, instead of the centering algorithm, we use this preference for the zero pronoun resolution in the simple sentence after the conjunctive postpositions of class A, and try to find the antecedents of zero pronouns in the same position of the adjacent sentence, if any.",
        "In this case also, the center of the current sentence is computed similarly to the ordinary algorithm, and the antecedent of the zero pronoun becomes the Cb of the current sentence.",
        "In case of conjunctive postpositions of class B, the antecedent tends to be not the subject of the other sentence if one of the sentences has the zero pronoun of the subject position.",
        "We think this tendency implies that noun phrases in the sentence before the conjunctive postpositions of class B tend to be not the antecedents of zero pronouns in the next sentences.",
        "Therefore, we give these noun phrases the least preference as the antecedents, although the zero pronoun resolution is performed by the original centering algorithm.",
        "41n parentheses, we show the direct translation of conjunctive postpositions into English.",
        "Since conjunctive postpositions of class C have no preference for the antecedents of zero pronouns, the zero pronoun resolution is performed as usual.",
        "Consider again the following sentences: (a) Taro wa issyoukenrnei benkyou siteita.",
        "Topic Taro was studying hard.",
        "(b1)Jiro ga (fi ni ) koe wo lmke temo, Subs Conk Although Jiro called out to him, (b2X chi ga ) (cq ni ) kizukanakatta.",
        "he did not notice him.",
        "If the original centering algorithm is applied to each sentence uniformly, the counter-intuitive interpretation is obtained, as mentioned above.",
        "Taking into account the information of conjunctive postpositions and applying the above heuristics to the points, since (b1) and (b2) have the conjunctive postposition of class B, `temp' (`al-though'), between them, the noun phrases in sentence (b1) have the least preference and the order of Cf in the sentence (b1) becomes the opposite to the case of the original centering algorithm.",
        "Therefore, the antecedents of the zero pronouns in sentence (b2) are identified as follows:",
        "Here this interpretation that \"faro did not notice Jiro' fits our intuition."
      ]
    },
    {
      "heading": "4 Experiment and Discussion",
      "text": [
        "In the last section, we described our zero pronoun resolution method that can handle complex sentences based on the centering theory.",
        "It differs from the original centering algorithm in the following two points.",
        "After partitioning complex sentences into multiple simple sentences, it, searches the antecedents in the previous four simple sentences, instead of only a previous sentence.",
        "Secondly, it takes into account the information of conjunctive postpositions that are between two simple sentences, by classifying them into three classes.",
        "In this section, we describe the experiments that our zero pronoun resolution method is applied to real Japanese discourses, to evaluate the effectiveness.",
        "We implement two versions of our zero pronoun resolution systems which are based on two versions of the centering algorithms that are mentioned in section two respectively, and evaluate the performance by comparing ours with the performance of the original centering algorithms.",
        "As our test, discourses, we use 275 (pre-partitioned) sentences from five discourses in total, which are a review article in the newspaper, a folk-tale, and a novel.",
        "Before the experiments,",
        "these discourses are automatically partitioned into simple sentences and received structural analysis, and the positions of zero pronouns are automatically identified as missing obligatory cases of verbs.",
        "Then, the results of tins preprocessing are manually corrected.",
        "The zero pronoun whose antecedent appears after it, i.e., the cataphoric one, and the zero pronoun whose antecedent does not appear in the discourse, are outside the scope of this paper.",
        "Those zero pronouns are 30% of all the zero pronouns in our test discourses.",
        "The correct antecedents are manually identified beforehand against each zero pronoun, and the performance is computed based on these answers.",
        "The experiments are made on the following three cases:",
        "1.",
        "The original centering algorithm that uses the information of only a previous simple sentence 2.",
        "The algorithm that searches the antecedents in the previous four simple sentences 3.",
        "The algorithm not only searches the antecedents in the previous four simple sentences, but also takes into account the information of conjunctive postpositions that are between two simple sentences",
        "'the results of the experiments on two versions of our systems are shown in 'liable 1 and 2, where the columns of 'correct' and 'incorrect' show the numbers of the correct and incorrect answers that the system outputs respectively, and the columns of 'in' and 'not in' show the numbers of cases where candidates of antecedents it) the system in-chide the correct answer and the number of cases where the system does not have the correct answer as the candidates, respectively.",
        "Although time original centering algorithms yield the performance of 60 - 70%, they have many cases where the system cannot get the correct answer as the candidates(`not in') and cannot output correct; answers.",
        "This indicates that there are many cases where the correct antecedents do not appear in the previous sentence, and implies the plausibility of our first; modification to the original algorithm.",
        "The improvement of the performance in method 2 also implies the plausibility of our method.",
        "Furthermore, taking into account the information of conjunctive postpositions improves tile performance by 3 - 6%.",
        "Totally, compared with the original centering algorithms, the performance of our method improves by 7 -- 10%.",
        "Since the zero pronoun resolution method that is based on the centering theory uses the results of the zero pronoun resolution in previous sentences, 'error-chaining' might occur many times.",
        "Error-chaining occurs when the identification of a wrong antecedent; causes another wrong zero pronoun resolution successively.",
        "in case of our system(method 3) based on Kameyama's algorithm, 30.2% of the incorrect answers are due to this error-chaining.",
        "There is also the possibility where the correct answers are output because of the wrong zero pronoun resolution in the previous sentences.",
        "In case of our system(inethod 3) based out Kameyarna's algorithm, only 1.2% of the correct; answers are due to tins 'false negative.' As you notice from the above two tables, there exist; about 30 cases where the antecedents appear in more than five sentences from the correct simple sentence and cannot be found by our method.",
        "We think these cases should not be handled simply by extending the search range for ti) antecedents, but, by utilizing the information of global structure of discourses(Grosz and Sidner, 1986), because the digressive sub-discourse is inserted between the antecedents and the zero pronouns in most of these cases.",
        "Of course, there have been the zero pronoun resolution approaches that take into account the information of conjunctive elements(Nakaiwa and Ficeliara, 1992; Nakagawa and Nishizawa, 1994; Yoshimoto, 1986; Suri and McCoy, 1994).",
        "Ile-cause Nakaiwa's(Nakalwa and lkehara, 1992) and Nakagawa's(Nahagawa and Nishizawa, 1994) approaches use the information in a restricted domain or too fine-grained grammatical information, we think they are difficult to be tuned to the broad coverage zero pronoun resolution system.",
        "Furthermore, Nakagawa's and YOshimoto's(Yoshimoto, -1986) approaches are not fully evaluated with real discourses.",
        "Although Nakaiwa's approach yields high success rate of 93%, he uses rather small test, sets(1(12 sentences from 29 articles), and the input is restricted to the first paragraphs of newspaper articles.",
        "Surf's work(Suri and McCoy, 1994) might be one of the few works that extend the centering framework to handle complex sentences, although",
        "she handles only sentences of the form 'SX because SY,' and uses Sidner's focusing framework(Sidner, 1983), that is different from the centering theory that our method is based on.",
        "Furthermore, the effectiveness of her work is not evaluated with real discourses.",
        "Takada's work(Takada and Doi, 1994) might be the only exception that proposes the zero pronoun resolution method based on the centering theory and evaluates its effectiveness with real discourses.",
        "Since he handles not only zero pronouns but also overt pronouns, the exact comparison is difficult, but his approach, that is based on Kameyama's approach, yields the performance of 74.8% if the results for overt pronouns are excluded.",
        "In addition, to handle complex sentences, he adopts the other approach where they are treated as a single unit, and admits that some problems arise because of this approach.",
        "Taking into account the information of conjunctive elements in the pronoun resolution reminds us of the works that use the establishment of coherence relations between clauses for pronoun resolution(Hobbs, 1979; Kehler, 1993).",
        "They try to establish coherence relations by the costly inference, while we use only the surface information."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "In this paper, we presented a simple method to handle complex sentences with the centering theory and described our framework that can identify the antecedents of zero pronouns in naturally occurring Japanese discourses.",
        "We also presented the evaluation of our framework with real discourses, although the evaluation is not so large-scale to assert the effectiveness of our framework.",
        "Our simple method yielded the accuracy of 78% for the zero pronoun resolution.",
        "Since our method that is presented in this paper is based on the centering theory arid basically uses only syntactic information, we plan to incorporate the semantic constraints that filter anomalous antecedents for zero pronouns, and take into account the global structure of discourses.",
        "We think the preliminary results of our system in this paper are promising since incorporating the information of semantic constraints and the global structure of discourses will improve the performance."
      ]
    }
  ]
}
