{
  "info": {
    "authors": [
      "Young S. Han",
      "Key-Sun Choi"
    ],
    "book": "Computational Linguistics",
    "id": "acl-J96-3007",
    "title": "A Chart Re-Estimation Algorithm for a Probabilistic Recursive Transition Network",
    "url": "https://aclweb.org/anthology/J96-3007",
    "year": 1996
  },
  "references": [
    "acl-E93-1040",
    "acl-H91-1046",
    "acl-J93-1002"
  ],
  "sections": [
    {
      "text": [
        "Illustration of PRTN.",
        "A parse is composed of dark-headed transitions.",
        "A is a transition matrix containing transition probabilities, and B is a word matrix containing the probability distribution of the words observable at each terminal transition.",
        "F specifies the types of transitions, and E represents a stack.",
        "S and F denote start and final states, respectively.",
        "Stack operations are associated with transitions; transitions are classified into three types, according to the stack operation.",
        "The first type is nonterminal transition, in which state identification is pushed into the stack.",
        "The second type is pop transition, in which transition is determined by the content of the stack.",
        "The third type is transitions not committed to stack operation; these are terminal and empty transitions.",
        "In general, the grammar expressed in PRTN consists of layers.",
        "A layer is a fragment of network that corresponds to a nonterminal.",
        "A table of the probability distribution of words is defined at each terminal transition.",
        "Pop transitions represent the returning of a layer to one of its (possibly multiple) higher layers.",
        "In this paper, parses are assumed to be sequences of dark-headed transitions (see Figure 1).",
        "States at which pop transitions are defined are called pop states.",
        "Other notations are listed below.",
        "first(1) returns the first state of layer 1. last(1) returns the last state of layer 1. layer(s) returns the layer state s belongs to.",
        "bout(1) returns the states from which layer / branches out.",
        "bin(1) returns the states to which layer / returns.",
        "terminal(1) returns a set of terminal edges in layer I. nonterminal(1) returns a set of nonterminal edges in layer 1. ij denotes the edge between states i and j.",
        "[0] denotes the network segment between states i and j. Wn,b is a word sequence covering the ath to bill word.",
        "Han and ChoiA Chart Re-estimation Algorithm"
      ]
    },
    {
      "heading": "3. Re-estimation Algorithm",
      "text": [
        "The task of a re-estimation algorithm is to assign probabilities to transitions and the word symbols defined at each terminal transition.",
        "The Inside-Outside algorithm provides a formal basis for estimating parameters of context free languages so that the probabilities of the word sequences (sample sentences) may be maximized.",
        "The re estimation algorithm for PRTN uses a variation of the Inside-Outside algorithm customized for PRTN.",
        "Let a word sequence of length N be denoted by: W = W1 W2 WN Now define the Inside probability.",
        "Definition 1 The Inside probability denoted by Pi(i),,,t of state i is the probability that layer(i) generates the string positioned from s to t starting at state i given a model A.",
        "where e last(layer(i)).",
        "And by definition:",
        "where ik E terminal(layer(i)), ij E nonterminal(layer(i)), u = last(layer(j)),v E bin(layer(j)), and layer(i) = layer(v).",
        "After the last word is generated, the last state of layer(i) should be reached.",
        "(i)t-Ei-tf 1 if i = last(layer(i)), 1 0 otherwise.",
        "Figure 2 is the pictorial view of the Inside probability.",
        "A valid sequence can begin only at state S, thus to be strict, Pi(S) has an additional product, P(S).",
        "When the immediate transition ij is of terminal type, the transition probability a,j and the probability of the 9th word at the transition b(ij, Ws) are multiplied together with the Inside probability of the rest of the sequence, Ws+i-t Now define the Outside probability.",
        "Illustration of Outside probability.",
        "where x E bout(layer(0), y E bin(layer(i)), f first(layer(i)), elast(layer(i)), layer(i) = layer(j), and layer(x) = layer(y).",
        "The summation on x is defined only when a 1 or b N (i.e., there are words left to be generated).",
        "Nonterminal and its corresponding pop transitions are defined to be 1 when a = 1 and b= N. For a boundary case of the Outside probability where f is the first state of a layer in the above equation:",
        "Figure 3 shows the network configuration in computing the Outside probability.",
        "In equation 2, (f , i),_i is the probability that sequence, Wa-s-i, is generated by layer(i) left to state i, and /31(j)t1_b is the probability that sequence Wt+ib is generated by layer(i) right to state j.",
        "The computation of Pi'(f,slight variation of the Inside probability in which the P (f)a_b's in equation 1 are replaced by P(f, i)bis done as follows:",
        "It is basically the same as the Inside probability except that it carries an i that indicates a stop state.",
        "Now we can derive the re-estimation algorithm for A and B using the Inside and Outside probabilities.",
        "As the result of constrained maximization of Baum's auxiliary",
        "Han and ChoiA Chart Re-estimation Algorithm function, we have the following form of re-estimation for each transition (Rabiner 1989).",
        "=expected number of transitions from state i to state j expected number of transitions from state i The expectation of each transition type is computed as follows: For a terminal transition:",
        "where u = last(layer(j)), v E bin(layer(j)), layer(i)layer(v), layer(j) = layer(u), and uv is a pop transition.",
        "For a pop transition:",
        "where u E bout(layer(i)), j c bin(layer(i)), v = first(layer(i)), layer(u) = layer(j), layer(v) -layer(i), and uv is a nonterminal transition.",
        "Since transitions of terminal and nonterminal types can occur together at a state, terminal transitions are estimated as follows:",
        "Outside computation with chart.",
        "Inside computation builds a table of computed Insides."
      ]
    },
    {
      "heading": "4. Chart Re-estimation Algorithm",
      "text": [
        "It can be shown that the complexity of the Inside algorithm is 0(N3G3) and that of the Outside algorithm is 0(N4G3) where N is the input size and G is the number of states.",
        "The complexity is too much for current workstations when either N or G becomes bigger than a few 10s.",
        "A basic implementation of the algorithm is to use a chart and avoid doing the same computations more than once.",
        "For instance, the table for storing Inside computations takes 0(N2G2C) store, where C is the number of terminal and nonterminal categories.",
        "A chart item is a function of five parameters, and returns an Inside probability.",
        "I(i, j, s, t, c) = (i,j)st. A chart item is associated with categories implying that the item is valid on the specified categories that begin the net fragment of the item.",
        "Suppose a net fragment [i,j] begins with NP and ADJP, then given a sentence fragment Ws_t, ADJP may not participate in generating Wst, while NP may.",
        "The information of valid categories is useful when the chart is used in computing Outside probabilities.",
        "An Outside probability is the result of computing many Inside probabilities.",
        "Computing an Inside probability even in an application of moderate size can be impractical.",
        "A naive implementation of Outside computation takes numerous Inside computations, so estimating even a parameter will not be realistic in a serial workstation (Lan i and Young 1990).",
        "The proposed estimation algorithm aims at reducing the redundant Inside computations in computing an Outside probability.",
        "The idea is to identify the Inside probabilities used in generating an input sentence and to compute an Outside probability using mainly those Insides.",
        "This is done first by computing an Inside probability of the input sentence, which can return a table of Insides used in the computation.",
        "Note that the Insides in the deepest depth are produced first, as the recursion is released, thus there can be many Insides that are not relevant to the given sentence.",
        "The Insides that participate in generating the input sentence can be identified by running the Inside algorithm one more time, top-down.",
        "Figure 4 illustrates the steps of the revised Outside computation.",
        "The identified Insides, however, do not cover all the Insides needed in computing an Outside probability.",
        "This is because the Inside algorithm works on a network from",
        "Han and ChoiA Chart Re-estimation Algorithm left to right and one transition at a time.",
        "Many Insides that are missed in the table are compositions of smaller Insides.",
        "Once charts of selected Insides are prepared, an Outside probability is computed as follows: Po(i, j)st =axfaeyI(f i, a, s 1)I(j , tb)P0 (x , Y)aI7 {xl1(x,y,a,b,c)>O} (a,b)Ea(f,e,s,t) where x E bout(layer(i)), y c bin(layer(i)), f = first(layer(i)), e = last(layer(i)), c c {nonterminal}, layer (i) = layer(j), and layer (x) = layer(y).",
        "The function o-(f, , e, s, t) returns a set of (a, b) pairs where there are Inside items I(f, ,e,a,b) defined at the chart such that a < s and b > t. In short, the items for state f indicate the possible combinations of sentence segments inclusive of the given fragment Wst because the chart contains items of all the valid sentence segments that were generated through the layer [f, e] .",
        "When the current layer [f, e] is completed with the two Insides computed, the computation extends to the Outside.",
        "Useless advancements into high layers that do not lead to the successful completion of a given sentence can be avoided by making sure that [x, y] generates Wab and the category of current layer c is defined, which can be checked by consulting the chart items for state x."
      ]
    },
    {
      "heading": "5. Experiments",
      "text": [
        "The goal of our experiments is to see how much saving the new estimation algorithm achieves in computational cost.",
        "Out of 14,132 Wall Street Journal trees of the Penn tree corpus, 1,543 trees corresponding to sentences with 10 words or less were chosen, and the programs written in C language were run at a Sparc10 workstation.",
        "The basic implementation of an Inside-Outside algorithm assumes tables for Insides and Outsides so that identical Insides and Outsides need not be recomputed.",
        "A chart Outside or re-estimation algorithm assumes a refined table of Insides that contains only valid Insides used in generating the input sentence as discussed earlier, and Outside computation is done based on the refined table.",
        "The improvement from the chart re-estimation algorithm is measured in the number of actual Inside and Outside computations done to estimate the parameters.",
        "Figure 5 shows the average counts of Insides used in estimating 50 trees randomly selected from 1,543 samples.",
        "Before the re-estimation algorithm is applied, an RTN that faithfully encodes the input trees without any overgeneration is constructed from the 50 trees.",
        "The gain in Insides from the chart re-estimation algorithm is very clear, and in the case of Outsides the gain is even more conspicuous (see Figure 6).",
        "The number of Insides counted in chart version also includes the Insides computed in preparing the chart."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "We have presented an efficient re-estimation algorithm for a PRTN that made use of only valid Insides.",
        "The method requires the preparation of a chart by running Inside computation twice over a whole sentence.",
        "The suggested method focuses mainly on reducing the computational overhead of Outside computation, which is a major portion of a re-estimation.",
        "The computation of an Inside probability may be improved further using a similar technique introduced in this paper.",
        "Han and ChoiA Chart Re-estimation Algorithm"
      ]
    }
  ]
}
