{
  "info": {
    "authors": [
      "Lahcene Si Ameur",
      "Jacques Rouault"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-2207",
    "title": "How the Linguistic Negation Can Have an Effect in Object-Based Knowledge Representation Model",
    "url": "https://aclweb.org/anthology/C96-2207",
    "year": 1996
  },
  "references": [
    "acl-C92-2071"
  ],
  "sections": [
    {
      "heading": "HOW THE LINGUISTIC NEGATION CAN HAVE AN EFFECT IN OBJECT-BASED KNOWLEDGE REPRESENTATION MODEL",
      "text": []
    },
    {
      "heading": "Abstract",
      "text": [
        "In tins paper, the coherence is considered within the framework of knowledge representation of texts.",
        "Though the incoherence of a text may result from a lot of phenomena, we restrict ourselves in tins communication to incoherence steinnting from negations.",
        "We present the model and the effect of negation on its objects."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "'this communication aims to clarify the concept of coherence in knowledge representation for natural language discourses and to pose the first foundations for formal representation and automatic processing of coherence.",
        "We raust emphasize first that coherence in natural language discourses may result, from incoherent parts : a part of a discourse may be contradictory with what is said in other parts without questioning the coherence of the whole.",
        "['or example, a digression, a supposition, an invalid hypothesis may be included as a part of a discourse and ruled out by what follows.",
        "So, a \"lapse of memory\" operates often in text comprehension and protects the text from deep incoherence, 'this means, of course, that coherence in natural language discourses is quite different from the consistency in a mathematical theory, which has to be consistent in each of its sets of propositions.",
        "So, a coherence theory for natural language representation systems must take into account this fact and limit the coherence verification to parts of texts actually asserted.",
        "At a deep level at least, we pose the hypothesis that a text is generally coherent...",
        "So the problem we address to is to try to detect incoherence.",
        "Though the incoherence of a text may result from a lot of phenomena, we restrict ourselves in this communication to incoherence stemming from negations.",
        "Hut surface negations must he interpreted in the framework of linguistics theory : this is the first, part of our work (not included here due to lack of space).",
        "This study shows that negation is very seldom at the origin of incoherence, l'he last part of the communication is devoted to the taking into account of negation in a specific case of knowledge in our of knowledge representation system."
      ]
    },
    {
      "heading": "2 The knowledge representation model",
      "text": []
    },
    {
      "heading": "2.1 Origin of the 1110(101",
      "text": [
        "Many knowledge representation systems exist.",
        "; the need for a new one cante front the type of knowledge we aim to represent and from the reasonings we try to implement.",
        "The framework of the model is linguistic pragmatics : we want to represent the linguistic marks of pragmatics (and not the pragmatics of an application).",
        "Thus, the knowledge associated to a discourse is represented at two levels : a knowledge representation of the application domain (which is outside the natural language system) and the model we are concerned with here, and which is the deepest level of our natural language analysis (the pragmatic level).",
        "'these constraints explain why the existing knowledge representation systems are not convenient, for our purpose : the information is specific and, above all, the reasonings to perform are proper to natural language discourses.",
        "The prototype of these reasonings is the abductive one, in which, from a property asserted in the text we infer an object winch possesses tins property and, then, we consider all the characteristics of the selected object as valid for the text."
      ]
    },
    {
      "heading": "2.2 Outline of the representation model",
      "text": [
        "The knowledge representation model is an object one, expressed in a particular logic formalism.",
        "The underlying logic is that of LESNIEWSKI's logical systems [Lesniewski ,1989], FM idvi le,I 984], [ltouault,1991].",
        "in these systems, the primitives of an object model correspond to the \"is-a\" of the Calculus of Names and the ingredient fitnctor of the Mereology [Achouba and 1110uault, 1989].",
        "We have thus a logical basis for the primitives of most object models and a framework for the inductive part of the system.",
        "The individuals of the knowledge base are objects.",
        "This base is divided into worlds.",
        "A world is a structured set of objects which is coherent : the exceptions, change of meanings are taken into account by a change of world.",
        "A world is divided into two universes : its intension and its extension.",
        "The intension contains those objects whose representation is supposed valid for speakers and situations related to discourse enunciation and to the application domain : there exists a consensus between the speakers of the discourse about these objects, which reflects \"general\" background knowledge (The dog is a stupid and spiteful animal).",
        "The intensional objects are then kinds of \"logical\" concepts in their world.",
        "The extension of a world contains objects which are particular to a specific situation, a specific time, ... (Peter's dog barked all night long).",
        "There is inheritance from intension to extension of the same world, but the extensions of two different worlds do not communicate.",
        "In case of change of world, a complex inheritance procedure must transmit only knowledge which insures the coherence of the new world from the old intension to the new one (This, also stresses the necessity to be able to detect incoherence in a discourse).",
        "There are three kinds of objects in the model (and hence in any world and universe) : the individual objects, the action schemata [Gallo and Rouault, 1992] and the state schemata."
      ]
    },
    {
      "heading": "2.3 The individual objects",
      "text": [
        "In our model, an individual object has the following structure:[Rouault, 1992] Status World Universe Cardinality Definitional part Denomination Other-names Structural Functive",
        "I is the name of the described object.",
        "\"world\" is the formative functor of name, the variable M is the value of the world that the discourse created.",
        "When the knowledge coming from the discourse is incoherent with the knowledge base, there is world change.",
        "This change can come equally from a difference of view points between speakers expressed in the discourse [Fredj, 1992].",
        "Universes An universe denotes to a couple (I,R) formed of an intension (I) and an extension (11).",
        "The object is defined in the world by a formative functor of name, from I [Berrendonner and Rouault, 1991].",
        "E Universe (0 U takes the value Int or Ext.",
        "Individual and class An object can be an individual or a class.",
        "This distinction is based on the singular plural opposition.",
        "The individuality is defined by a formative functor of name, from I: in e indiv (I) In takes the value Ind or Cl."
      ]
    },
    {
      "heading": "2.3.2 Definitional part of an object",
      "text": [
        "Here, we discovered two kind of sub-objects: those which are part of the described object and those which relate the object described and others objects of the world.",
        "The name of an object represents the sub-object of the denomination.",
        "We also can associate to a name of an object other synonyms.",
        "These sub-objects are defined by the formative functor of name whose the argument is the name of object.",
        "Structural sub-objects represent the part of ingredien.ce, \"part-all\", in the sans of the mere-ology.",
        "It means that it describes the relation between an object and its constitive parts.",
        "They are of the form:",
        "part of the bike.",
        "Functive It indicates a relation between the object considered and another object.",
        "This relation is marked on the surface by a verb or normalised verbal form [Berrendonner and al, 1992].",
        "A func-tive has the following form: f j) Where I is the object described and J is the object, with which I is connected by the Inactive f"
      ]
    },
    {
      "heading": "2.4 Predicative objects",
      "text": [
        "The functives of an individual object act as relations between objects.",
        "We have to pose the properties of such relations : depending on if they refer to.",
        "an action or a state, a relation is defined by an action schema or a state schema.",
        "An action schema contains the following sub-objects [Gallo and Rouault, 1992] : the name(s) of the action,",
        "This part indicate the conditions of validity of an object.",
        "It be composed of several objects: World A discourse can generate worlds.",
        "For each object, the system must specify in what world it must be introduced, where it is valid and where we can make inferences that bring it into play.",
        "We therefore pose:",
        "the nature of the arguments, the state(s) eventually entailed by the action (result, product, ...) and the scenario associated to the process, which depends on the discourse domain.",
        "2.5 Structuring of the knowledge base In the intensional universe of a world, the individuals (also named types) are nodes of a lattice (the lattice of types), the hierarchy being represented by the ingredience functor.",
        "The types are also linked by their structural and functive sub-objects.",
        "Of course, the extensional objects are linked also by their structural and functives sub-objects.",
        "And each such object is in accord with its underlying type."
      ]
    },
    {
      "heading": "3 Negations in the object-based knowledge representation model",
      "text": []
    },
    {
      "heading": "3.1 Negations and objects",
      "text": [
        "The aim of the model is to represent dynamically the knowledge associated with a discourse at a gi yen point (time) of its progression.",
        "Thus, each object may change during this progress : we must then distinguish between this \"punctual\" representation and the history of objects (which it is necessary to maintain in the case of a dialogue, for example).",
        "We are concerned here only with the updating of a knowledge base containing the knowledge valid for a discourse at a given time of its progression.",
        "Under this restriction, the knowledge stored in the base is positive : when the discourse asserts a negative fact (Dogs are not stupid), this presupposes that the positive corresponding fact (Dogs are stupid) has already been asserted (explicitly or itnplicitly) and that a contradiction may arise.",
        "In a mono-speaker discourse (text), the general situation seems to be : the assertion of a negative fact simply erases the positive one (of course, this erasing is virtual when the positive fact is only presupposed).",
        "In a multi-speaker discourse (dialogue, for example, a negotiation is suitable to decide which of the two possibilities (the positive or the negative fact) is to be include in the knowledge base.",
        "In all these cases, we have to be able to infer properties about objects from negative assertions; which in turn, need to represent the formal properties of different kinds of negations operating on sub-objects of an object."
      ]
    },
    {
      "heading": "3.2 Negation on types",
      "text": [
        "As indicated previously, only the intensional objects (the types) have a \"logical\" behaviour : they represent general knowledge valid in the discourse.",
        "The inference rules about negations are valid only in the intensional universe.",
        "We then have to define what are the types of negations involved in the type representation.",
        "The type is negated in the present world but supposed valid elsewhere.",
        "Por the linguists, the negation is not a simple problem.",
        "For the mathematical logician, a negation is a simple problem Starting from a world where the negation is a simple problem (which, for example, is mathematical logician), the previous assertion entails the opening of a new world, in which the new fact is asserted (The negation is not a simple problem).",
        "When a discourse is expressed by mono-speaker, the assertion of a positive fact (the negation is not a simple fact) provoke a contradiction in the same world.",
        "This contradiction can be based at least on the difference between sub-objects of type: 'is', 'is not'.",
        "The solution seemingly substitutes a positive fact by a negative fact one.",
        "A fact presented as a type is negated as such and related to extensional objects (or the converse) : The dog is not a stupid animal, but Peter's is.",
        "It is simply a change of value of the cardinality value.",
        "Negation can focus on the \"denominations\" and \"others-names\" sob-objects.",
        "Denying a \"denomination\" or \"other- names\", means to denying a property of the object.",
        "in this case, a new property is substi tiled to a sub-object.",
        "Pixample: the personal computer is not an '.IBM', but a 'COPA Al-C.",
        "Note, before replacing a new property, the model must verify that the new property is really a property of a type because there is a case where a substitution makes no sense: the personal computer is not an ', but a 'printer\""
      ]
    },
    {
      "heading": "3.2.5 Negation on structural sub-objects",
      "text": [
        "Here it is the ingredience relation which is negated i.e.",
        "The wall is part of a house.",
        "In some cases, the negation of [A is ingr II] suggests the ingreclience of the object A to another type C, such that there exists a type D which is greater than 13 and C in the lattice of types : The spoke wheel is not a part of a car (it is part of a bike)."
      ]
    },
    {
      "heading": "3.2.6 Negation on notional sub-objects",
      "text": [
        "The leaves are green The leaves are not green The inference possibilities from the negative assertion are of two kinds : - There is a finite opposition between the notion and its \"lexical negation\" (Blood is red / Blood is not red = It is of another colour).",
        "- There is a continuum (its in big/small) and we Call not infer small from not big."
      ]
    },
    {
      "heading": "3.2.7 Negation on functive sub-objects",
      "text": [
        "As indicated previously, the number of attested arguments of the predicate may change the interpretation of the negation :",
        "1.",
        "'The cow does not eat' is time negation of 'The cow eats' 2.",
        "'The cow does not cat meat' is generally not the negation of the property 'The cow eats meat among",
        "other kinds of food)' but the assertion of 'The cow cats something' and the negation of the choice of meat as food.",
        "here we still refer to another type having with meat the same generic class (food) in the lattice of types.",
        "3.",
        "We have the same situation in: The cow does not eat with a knife The cow does not eat grass with a knife The cow does not eat meat in Paris In these examples, only the choice of the last argument seems to be concerned by the negation."
      ]
    },
    {
      "heading": "3.3 Negation of extensional objects",
      "text": [
        "A type underlies extensional objects : a change in the properties of a type entails the same change in the associated extensional objects.",
        "Of course, the reverse is not true : an extensional object may have properties not possessed by the underlying type.",
        "From this it results that the only coherence for an extensional object is internal : it can not have contradictory sub-objects.",
        "Note that an extensional object may be an individual or a class ; of course, all the elements of the class Must have the same properties.",
        "In fact, class and individual always coexist.",
        "Therefore, it is legal to infer a class of type T when the discourse introduces an individual of type T. This is obvious in 'It is one of the neighbour's dogs' and also in 'Ile does not have children, only one'.",
        "The last example shows that the negation of a property about a class may have two interpretation: the ordinary one, in which the property is negated for the individual of the class and the negation of the class itself (or, conversely, of the individual) to pose the property about an individual (a class).",
        "In the sentence : 'Only Peter came', we pose a property about Peter; then 'only' introduces the class and, of the same time, indicates that the class contains only Peter.",
        "This entails that the negation may focus on only (negation that the class contains only one individual) or on the property (Peter came), then asserted about 'only Peter'.",
        "Another interesting example is 'All students suc-ceed' : we assert a property about the class student and, then, specify that the class is studious, that is : the property is valid for all individuals of the class.",
        "In other words, that the class is the extensional projection of the type student: As in previous example, the negation can operate on all (the class is not studious) or on the property asserted about all students."
      ]
    },
    {
      "heading": "4 CONCLUSION",
      "text": [
        "in this paper, we have presented an object-based knowledge representation model that allows to extract and to represent knowledge in the knowledge base from discourse.",
        "This model can be used in the context of man-machine dialogue or for information retrieval.",
        "We have posed the problem of coherence as regarding the knowledge represented in the knowledge base, taking into account the apparent contradictions within discourse.",
        "The incoherence can be result from a lot of phenomena but we restrict ourselves in this communication to incoherence stemming from negation.",
        "All the cases treated (among others) show that a surface negation does not always fit a deep negation and, in fact, seldom entails an incoherence.",
        "Consequently, the negation can have an effect in object-based knowledge representation model such as to update properties of objects but it rarely provoke an incoherence between the objects of discourse and the objects of knowledge base."
      ]
    }
  ]
}
