{
  "info": {
    "authors": [
      "Francis Bond",
      "Kentaro Ogura",
      "Satoru Ikehara"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-1023",
    "title": "Classifiers in Japanese-To-English Machine Translation",
    "url": "https://aclweb.org/anthology/C96-1023",
    "year": 1996
  },
  "references": [
    "acl-C94-1002",
    "acl-C94-1005",
    "acl-C94-1091",
    "acl-P87-1018"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper proposes an analysis of classifiers into four major types: UNIT, mt:Thic, (mow' and sPE(Ths, based on properties of both Japanese and English.",
        "The analysis makes possible a. uniform and straightf4ward of 1101111 phrases headed by classifiers in Japanese-to-English machine translation, and has been implemented in the MT system ALT-J/E.",
        "Although the analysis is based on the characteristics of, and differences between, Japanese and English, it is shown to be also applicable to the unrelated language Thai."
      ]
    },
    {
      "heading": "1 introduction",
      "text": [
        "Noun phrases in Japanese differ from those in English in two important ways.",
        "First, Japanese has no equivalent syntactic category to English determiners.",
        "Second, there is no grammatical inarking of number.' Because of these differences, numerical expressions are realized very differently in Japanese and English.",
        "In countable nouns can be directly modified by a numeral: 2 dogs.",
        "In Japanese, however, numerals cannot directly modify common nouns, instead a classifier is used, ill the same way that ft partitive noun is used with an uncountable noun in English: 2 pieces of furniture.",
        "In addition, when Japanese is translated into English, the selection of appropriate determiners, such as articles and possessive pronouns, and the determination of countability amid number is problematic.",
        "Various solutions to the problems of generating articles and possessive pronouns and determining countability ;01(1 number have been proposed (Murata and Nagao, 1993; Cornish, Fajita, and Sugimura, 1994; Bond, Ogura, arid Kawaoka, 1995).",
        "l'he differences between the way numerical expressions are realized in Japanese and English has been less studied (Asahioka, and ArnatIO, 1.990).",
        "In this paper we propose an analysis of classifiers based on properties of both Japanese and English.",
        "Our category of classifier includes both Japanese josUslii 'numeral clas",
        "sifiers' and 1-iglish partitive nouns.",
        "We divide classifiers into four major types: UNIT, METRIC, (I10)111I and SI'l1C105.",
        "UNIT classifiers are farther divided into (:t;NERAt,, TYPicm, and siq;(\"1,m,, while mErrita: classifiers are divided into MEASU and CONTAINER classifiers.",
        "Although our analysis was based on the characteristics of, and differences between, Japanese and English, we found it to he strikingly similar to the analysis for Thai proposed by Sornlerthinivanich et al.",
        "(1.994), which suggests that the results may be useful for examining other languages.",
        "The analysis introduced in this paper has been inqm1( nented iu N'I C0111111M1 ication Science Laboratories' Japanese-to-English machine translation system ALT-JOE (Ikehara et, al., 1.99.1; Ogura el, al., 1993) since 1994.",
        "Exainples of how it, has been implemented in ALT-J/E are woven throughout the text, although the analysis itself is not tied to any formalism or particular representation, so is adaptable to arty system, We start, off by examining monolingual finaly-ses of Japanese classifiers and English partitive expressions (Section 2).",
        "1'11e11 we introduce our bilingual analysis of classifiers and show how tins analysis can be used in a Japanese-to-English machine translation system (Section 3).",
        "We also examine fuore complex cases where classifiers are used like normal 110)1115 (Section 4).",
        "Finally we compare our analysis to other a people's (Section 5).",
        "l'hroughout the paper we use the following abbreviations: A, l3 or N: noun or noun phrase; C: classifier, X: Numeral, with Japanese in italics."
      ]
    },
    {
      "heading": "2 Monolingual Analyses of Classifiers",
      "text": []
    },
    {
      "heading": "2.1 :Japanese 'Classifiers'",
      "text": [
        "Japanese is a numeral classifier language (Allan, 1977), in which classifiers are obligatory in many expressions of quantity.",
        "We will refer to prototypical Japanese classifiers as jos'iisIti 'numerical classifiers'.",
        "Syntactically, ,jos)ishi are a subclass of nouns (Miyazaki, Shirai, and lkehara, 1995).",
        "The main property distinguishing them front normal nouns is that they can postfix to numerals, the quantifier sir.",
        "'some' or tile interrogative nani 'what', to form a noun phrase.",
        "Unlike normal nouns in Japanese,",
        "josiishi can not form grammatical noun phrases on their own.2",
        "(1) 2-hiki '2 animals' (Numeral) (2) sg-hiki 'some animals' (Quant.)",
        "(3) nan-hiki 'how many animals' (Int.)",
        "The resulting numeral-classifier noun phrase can modify another noun phrase, either linked by no `of\"XC-no-N', or 'floating' elsewhere in the sentence, typically directly after the noun phrase it modifies `1\\TXC'.",
        "It can also occur on its own, with anaphoric or deictic reference.",
        "Asahioka, Hirakawa, and Amano (1990) identify seven different patterns of use.",
        "In order to concentrate on the translation of classifiers and number, we will restrict our discussion to noun phrases of the type 9C-no-N' and not discuss the problems of resolving anaphoric reference and floating quantifiers.",
        "Semantically, each classifier relates to a class of nouns (Kuno, 1973, 25), often fairly arbitrarily.",
        "For example -hiki `(small) animal' is used to count small animals excluding rabbits, which are counted with -wa 'bird'.",
        "There is a default classifier -tsu `piece' which can be used to count almost anything."
      ]
    },
    {
      "heading": "2.2 English 'Classifiers'",
      "text": [
        "In English, numerals can directly modify countable nouns 'X N'.",
        "In order to enumerate uncountable nouns, either the uncountable nouns have to be reclassified as countable nouns, or embedded in a partitive construction: two beers or two cans of beer 'X N' or 'X C of N' (Quirk et al., 1985, 249).",
        "This partitive construction is similar to the Japanese quantifying construction 9C-no-N'.",
        "Quirk et al.",
        "(1985, 249-51) divide partitive nouns into three main categories QUALITY PARTITIVES, QUANTITY PARTITIVES, and MEASURE PARTITIVES.",
        "QUANTITY PARTITIVES are further divided into three cases, the first where the embedded noun phrase is uncountable, the second where it is plural, and the third where it is singular and countable.",
        "All the partitive nouns themselves are fully countable.",
        "QUANTITY PARTITIVES where the embedded noun phrase is headed by an uncountable noun, the first case, are then divided into GENERAL PARTITIVES such as piece which serve only to quantify and TYPICAL PARTITIVES such as grain which are more descriptive.",
        "2 There are some examples of words that can be either a common noun or jovishi: for example gyo `line' or hako 'box', which can follow a numeral or stand alone.",
        "These nouns can be handled in two ways: (a) as a lexical class that combines the properties of common nouns and jostishi, or (b) as two separate lexical entities.",
        "ALT-J/E follows option (b), such nouns are entered into the lexicon twice, once as a common noun and once as a josfishi."
      ]
    },
    {
      "heading": "3 A Bilingual Analysis of classifiers",
      "text": [
        "As there is no direct fit between English and Japanese, it is necessary to categorize the Japanese and English classifiers and to define rules which will enable effective machine translation.",
        "We divide classifiers into four major types: UNIT (Section 3.1), METRIC (Section 3.2), GROUP (Section 3.3) and SPECIES (Section 3.4).",
        "The main criteria for the analysis are the restrictions placed, in English, on the countability and number of the embedded noun phrase in a partitive construction.",
        "Whether a noun is a classifier, and if so which type, is marked in the lexicon for each Japanese/English noun pair.",
        "We distinguish between five major different noun countability preferences, based on the analysis of Allan (1980), adapted for use in machine.",
        "translation by Bond, Ogura, and Ikehara (1994).",
        "`Fully countable' nouns, such as knife, have both singular and plural forms, and cannot be used with determiners such as much.",
        "'Uncountable' nouns, such as furniture, have no plural form, and can be used with much.",
        "Between these two extremes are nouns such as cake, which can be used in both countable and uncountable noun phrases.",
        "They have both singular and plural forms, and can also be used with much.",
        "We divide such nouns into two groups: 'strongly countable', those that are more often used to refer to discrete entities, such as cake, and 'weakly countable', those that are more often used to refer to unbounded referents, such as beer.",
        "The fifth major type of countability preference is 'pluralia tanta': nouns that only have a plural form, such as scissors."
      ]
    },
    {
      "heading": "3.1 Unit classifiers",
      "text": [
        "UNIT classifiers are the prototypical classifiers.",
        "A UNIT classifier will be realized in Japanese aA a josgshi.",
        "However, there are three possible translations of a Japanese noun phrase of the form `XC-no-N', where C is a unit classifier: Individuate: Translate as 'X N', where the classifier C is not translated and the numeral directly modifies the countable English noun phrase: 1-hiki-no-inu '1-piece of dog' 4 1 dog.",
        "Part: Translate as 'X C of N', where the classifier is translated by its translation equivalent (from the transfer dictionary) and N is uncountable (headed by a bare singular noun): 1-tsubu-no-kome '1-grain of rice' 4 1 grain of rice.",
        "Default: Translate as 'X C of N' where the classifier is replaced by a default that depends on the embedded noun and N is uncountable.",
        "The default is normally piece, but this can be overridden by an explicit entry for N's default classifier in the lexicon:",
        "1-tsu-no-kagu `1-piece of furniture' -41 piece of furniture.",
        "The three types of UNIT classifier are summarized in Table i.3 Having established three possible translations of the `XC-no-N' construction, we can proceed to divide UNIT classifiers into three types, depending on which of the above alternatives is most suitable.",
        "The first, GENERAL classifiers, are those that have no special meaning of their own, but are used only to quantify the denotation of a noun.",
        "Typical examples are - tsu 'piece' and -ko 'piece'.",
        "If N is fully, strongly or weakly countable, then the classifier is not translated (individuate).",
        "If N is uncountable, then the classifier is translated as the default (default).",
        "The second type of classifier, TYPICAL, consists of those classifiers which are descriptive in their own right, such as -teki 'drop'.",
        "If N is fully countable, then the classifier will not be translated (individuate), otherwise the classifier is translated (part).",
        "The final type of classifier, SPECIAL, is rare: classifiers which force an uncountable interpretation of even countable nouns, for example -kire 'slice'.",
        "N is always parted: 1-kireno-inu '1-slice of dog' -->1 slice of dog.",
        "The translation of classifiers is complicated by the fact that classifiers and their relationships to nouns are both arbitrary and language dependent.",
        "Consider the Japanese classifier -rnai `sheet', which is used for counting flat objects.",
        "This has no direct English equivalent.",
        "As a default, it is entered in the dictionary as a GENERAL classifier with the translation piece.",
        "There are however several flat objects for which piece is inappropriate in English: foodstuffs (slice); paper, glass, cloth and leather (sheet); bacon (rasher); and financial contracts (contract).",
        "The selection of an appropriate translation is not dependent on this analysis and can be left to the normal machine translation process.",
        "In ALT-J/E it is done by examining the semantic category of the embed-3If N's countability preference is pluralia tanta then N will never be individuated.",
        "If N is parted or defaulted there are two possibilities: either, if the dictionary entry for N has the default classifier pair then it will be used as the classifier or, if N has no default classifier, then a different translation is searched for in the dictionary and used instead.",
        "If there is no non-pluralia tanta translation equivalent, then the translation will default to 'X C of N' as above, but with N headed by a bare plural noun.",
        "ded noun.",
        "Once an appropriate translation of the classifier has been found, knowledge of its type allows the system to decide the appropriate form of the final translation."
      ]
    },
    {
      "heading": "3.2 Metric classifiers",
      "text": [
        "The next overall category is METRIC classifiers, A noun phrase of the form 9W-no-N', where C is a METRIC classifier will be translated as 'X C of N', where N will be plural if it is headed by a fully countable or pluralia tanta noun.",
        "We further subdivide METRIC classifiers depending on whether the resulting English noun phrase will have singular verb agreement (MEASURE classifiers), or plural verb agreement (CONTAINER classifiers) as its default.",
        "(4) 2-kg-no-kami-ha jiibun da '2 kg of paper-TOP enough is' 2 kg of paper is enough (5) 2-hako-no-kami-ha jfibun da '2 box of paper-TOP enough is' 4 2 boxes of paper are enough",
        "In fact both (4) and (5) could be translated with singular or plural verb agreement.",
        "The differentiation into MEASURE and CONTAINER provides a graceful default.",
        "Examples are given in Table 2."
      ]
    },
    {
      "heading": "3.3 Group classifiers",
      "text": [
        "GROUP classifiers combine with plural or uncountable noun phrases to make a countable noun phrase representing a group or set.",
        "A noun phrase of the form WC-no-N', where C is a GROUP classifier will be translated as 'X C of N', where N will be plural if it is headed by a fully or strongly countable noun or a pluralia tanta.",
        "Noun phrases of the form 'N-no-C', where C is a GROUP classifier (but not a josiishi) will also be translated as `C of N' where N will be plural if it is headed by a fully or strongly countable noun or a pluralia tanta.",
        "This allows us to give a uniform treatment of noun phrases such as (6) and (7) during English generation, even though their Japanese structure is very different.",
        "(6) 2-hako-no-pen '2 box of pen' - 2 boxes of pens `XC-no-N' (7) pen-no-hako 'box of pen' 4 a box of pens `N-no-C'",
        "Whether a noun is a GROUP classifier or not can also be used to help determine the number of ascriptive and appositive noun phrases.",
        "For example, in ALT-J/E the countability and number of two appositive noun phrases are made to match each other, unless one element is plural and the other is a ciltouP classifier.",
        "For example, many insects, a whole swarm, ... as opposed to many insects, bees I think, ... (Bond, Ogura, arid Kawaoka, 1995).",
        "Examples of GROUP classifiers are given in Table 3."
      ]
    },
    {
      "heading": "3.4 Species classifiers",
      "text": [
        "The last type of classifier is seNciEs classifiers.",
        "SPECIES classifiers are partitives of quality and can occur with countable or uncountable noun phrases.",
        "The embedded noun phrase will agree in number with the head noun phrase if fully or strongly countable: a kind of car, 2 kinds of cars; a kind of equipment, 2 kinds of equipment.",
        "Examples of SPECIES classifiers are given in Table 3.",
        "In the analysis given above for Japanese noun phrases of the form WC-no-N', we have given no consideration to the denotation of N, except for when choosing the appropriate translation for C. Thus we assume that `XC-no-1\\1' will be translated as 'X C of N' or just 'X N' if N is countable, as in (8) or (9).",
        "(8) 1-pai-no miza `1-cup of water' - 1 cup of water (CONTAINER) (9) 1-tsu-no koppu `1-piece of cup' - 1 cup (GENERAL)",
        "However if N is a noun that denotes an attribute, such as PRicE or WEIGHT, then the translation process becomes more complicated.",
        "In the simplest case the noun phrase 9C-no-N' should be translated as though the classifier were a normal noun, giving 'the N of X C', for example (10), (11).",
        "(10) 1-pai-no nedan `1-eup of price' f the price of 1 cup (11) 1-1su-no nedan [-ha /Den daJ 4-piece of price [-Tor, 10 yen is]' - the price of 1 (thing) [is 10 yen]",
        "In other words, if N has the attribute AMOUNT then the noun phrase should normally be translated as though C were not a classifier.",
        "The interpretation of C is, however, ambiguous.",
        "C could be used as a classifier with the amount N in its scope (12), or C could have anaphoric reference (13).",
        "ALT-J/E chooses the interpretation shown in example (13) as its default.",
        "(12) 1-Shli-710 nedan '1 kind of price' - 1 kind of price (13) 1-shii-no nedan kind of price' - the price of .1 kind [of something]",
        "Further, when.",
        "N is an attribute and C measures the same attribute, the interpretation is again different.",
        "For example, if C measures N's attribute then the resulting noun phrase will he indefinite by default: a height of 10m or a price of 10 yen.",
        "However if the noun phrase is used ascriptively then it should be converted either to an adjective it is /Om high or a prepositional phrase it is 10 yen in price.",
        "Finally, if a noun phrase of this type is used to modify another noun then it needs to be converted to an adjective a ./Dra high building c)r a post modifying prepositional phrase a chocolate 10 yen in price.",
        "The combinations of nouns and classifiers mentioned above can all be translated by the machine translation system ALT-J/E using the analysis of classifiers presented in this paper in combination with a semantic hierarchy of 2,800 categories common to all nouns, as described in Ikehara et al.",
        "(1991).",
        "The particle no 'of', has many possible interpretations, Shimazu, Naito, and Nomura (1987) identify five main types of A-no-B expressions, and sonic 80",
        "sub types.",
        "Our analysis cuts across Shimazu et al.'s types, including at least three of the subtypes, and also makes clear some relations that, are not explicitly named."
      ]
    },
    {
      "heading": "5 Comparisons with other Analyses",
      "text": [
        "We summarize our analysis of classifiers in Table 1.",
        "Our analysis was based mainly on the properties of the generated English, so is naturally quite close to the division of partitive nouns proposed by Quirk et al.",
        "(1985).",
        "The analysis is also quite close to those proposed by Kamei and Muraki (1995) for Japanese and Sornlertlamvanich et al.",
        "(1994) for Thai.",
        "Tins supports Allan's (1977) assertion that \"diverse language communities categorize perceived phenomena in similar ways\".",
        "The different, analyses are compared in Table 5.",
        "We make the distinction between classifiers of frequency and other uNirl.",
        "classifiers by using our general semantic hierarchy.",
        "Sornlertlamvanich et al.'s V classifiers \"any classifier which is derived from a verb [...] /kraal has muan/ 'five rolls of paper'.\"",
        "can be included in the mErritic category, although it may be the case that they have a different, part of speech in Thai.",
        "Kamei and Muraki (1995) put UNIT classifiers into two classes: 'Counting Total Amount': 3kg of sugar.",
        "and 'Counting an Attribute Value': a speed of 601-aph.",
        "This distinction belongs to the interpretation of the (classifier in context, rather than its inherent; properties, so we feel the distinction should he made during processing, as described in Section 1, rather than as part of the analysis of the classifiers themselves."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "In this paper we present; au analysis of classifiers, suitable for use in a Japanese-to-English machine translation system.",
        "We divide classifiers into four IllajOr types: UNIT, METRIC, CROUP and SPECIES.",
        "UNIT classifiers are further divided into (IENERAL, TYPICAL and sPEcin, while METRIC classifiers are divided into MEASURE and c(iNTAINvit classifiers.",
        "The analysis is based on characteristics peculiar to Japanese and 'English, as well as the differences between them.",
        "The resulting analysis is shown to be similar to one proposed for Thai, an urn-elated language, suggesting that, it, may be more widely applicable.",
        "1.1e analysis has been implemented in Nrl.",
        "\"s Japanese-to-English machine translation system ALT-JOE since 1994.",
        "It makes possible a uniform and straightforward treatment, of noun phrases headed by classifiers.",
        "Further work remains to be done in examining the distribution of classifiers in different domains, and possibly identifying classifiers automatically."
      ]
    }
  ]
}
