{
  "info": {
    "authors": [
      "Claire Gardent",
      "Michael Kohlhase"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P96-1001",
    "title": "Higher-Order Coloured Unification and Natural Language Semantics",
    "url": "https://aclweb.org/anthology/P96-1001",
    "year": 1996
  },
  "references": [
    "acl-C96-1073"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper, we show that Higher-Order Coloured Unification - a form of unification developed for automated theorem proving - provides a general theory for modeling the interface between the interpretation process and other sources of linguistic, non semantic information.",
        "In particular, it provides the general theory for the Primary Occurrence Restriction which (Dalrymple et al., 1991)'s analysis called for."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "It is well known that Higher-Order Unification (HOU) can be used to construct the semantics of Natural Language: (Dalrymple et al., 1991) - henceforth, DSP - show that it allows a treatment of VP-Ellipsis which successfully captures the interaction of VPE with quantification and nominal anaphora; (Pulman, 1995; Gardent and Kohlhase, 1996) use HOU to model the interpretation of focus and its interaction with focus sensitive operators, adverbial quantifiers and second occurrence expressions; (Gardent et al., 1996) shows that HOU yields a simple but precise treatment of corrections; Finally, (Pinkal, 1995) uses linear HOU to reconstruct underspecified semantic representations.",
        "However, it is also well known that the HOU approach to NL semantics systematically over-generates and that some general theory of the interface between the interpretation process and other sources of linguistic information is needed in order to avoid this.",
        "In their treatment of VP-ellipsis, DSP introduce an informal restriction to avoid over-generation: the Primary Occurrence Restriction (P OR).",
        "Although this restriction is intuitive and linguistically well-motivated, it does not provide a general theoretical framework for extra-semantic constraints.",
        "In this paper, we argue that Higher-Order Coloured Unification (HOCU, (cf. sections 3,6), a restricted form of HOU developed independently for theorem proving, provides the needed general framework.",
        "We start out by showing that the HOCU approach allows for a precise and intuitive modeling of DSP's Primary Occurrence Restriction (cf. section 3.1).",
        "We then show that the POR can be extended to capture linguistic restrictions on other phenomena (focus, second occurrence expressions and adverbial quantification) provided that the notion of primary occurrence is suitably adjusted (cf. section 4).",
        "Obviously a treatment of the interplay of these phenomena and their related notion of primary occurrence is only feasible given a precise and well-understood theoretical framework.",
        "We illustrate this by an example in section 4.4.",
        "Finally, we illustrate the generality of the HOCU framework by using it to encode a completely different constraint, namely Kratzer's binding principle (cf. section 5)."
      ]
    },
    {
      "heading": "2 Higher-Order Unification and NL semantics",
      "text": [
        "The basic idea underlying the use of HOU for NL semantics is very simple: the typed A-calculus is used as a semantic representation language while semantically underspecified elements (e.g. anaphors and ellipses) are represented by free variables whose value is determined by solving higher-order equations.",
        "For instance, the discourse (la) has (lb) as a semantic representation where the value of R is given by equation (1c) with solutions (1d) and (le), Dan likes golf.",
        "Peter does too.",
        "like ( dan, golf)A R(peter)",
        "The process of solving such equations is traditionally called unification and can be stated as follows:",
        "given two terms M and N, find a substitution of terms for free variables that will make M and N equal.",
        "For first order logic, this problem is decidable and the set of solutions can be represented by a single most general unifier.",
        "For the typed A-calculus, the problem is undecidable, but there is an algorithm which - given a solvable equation - will enumerate a complete set of solutions for this equation (Huet, 1975).",
        "Note that in (1), unification yields a linguistically valid solution (1d) but also an invalid one: (le).",
        "To remedy this shortcoming, DSP propose an informal restriction, the Primary Occurrence Restriction: Given a labeling of occurrences as either primary or secondary, the POR excludes of the set of linguistically valid solutions, any solution which contains a primary occurrence.",
        "Here, a primary occurrence is an occurrence that is directly associated with a source parallel element.",
        "Neither the notion of direct association, nor that of parallelism is given a formal definition; but given an intuitive understanding of these notions, a source parallel element is an element of the source (i.e. antecedent) clause which has a parallel counterpart in the target (i.e. elliptic or anaphoric) clause.",
        "To see how this works, consider example (1) again.",
        "In this case, dan is taken to be a primary occurrence because it represents a source parallel element which is neither anaphoric nor controlled i.e. it is directly associated with a source parallel element.",
        "Given this, equation (lc) becomes (2a) with solutions (2b) and (2c) (primary occurrences are underlined).",
        "Since (2c) contains a primary occurrence, it is ruled out by the POR and is thus excluded from the set of linguistically valid solutions.",
        "Although the intuitions underlying the POR are clear, two main objections can be raised.",
        "First, the restriction is informal and as such provides no good basis for a mathematical and computational evaluation.",
        "As DSP themselves note, a general theory for the POR is called for.",
        "Second, their method is a generate-and-test method: all logically valid solutions are generated before those solutions that violate the POR and are linguistically invalid are eliminated.",
        "While this is sufficient for a theoretical analysis, for actual computation it would be preferable never to produce these solutions in the first place.",
        "In what follows, we present a unification framework which solves both of these problems."
      ]
    },
    {
      "heading": "3 Higher – Order Coloured Unification (HOCU)",
      "text": [
        "There is a restricted form of HOU which allows for a natural modeling of DSP's Primary Occurrence Restriction: Higher-Order Coloured Unification developed independently for theorem proving (Hutter and Kohlhase, 1995).",
        "This framework uses a variant of the simply typed A-calculus where symbol occurrences can be annotated with so-called colours and substitutions must obey the following constraint: For any colour constant c and any c-coloured variable Vc, a well-formed coloured substitution must assign to Vc a c-monochrome term i.e., a term whose symbols are c-coloured."
      ]
    },
    {
      "heading": "3.1 Modeling the Primary Occurrence Restriction",
      "text": [
        "Given this coloured framework, the POR is directly modelled as follows: Primary occurrences are pe-coloured whilst free variables are -ye-coloured.",
        "For the moment we will just consider the colours pe (primary for ellipsis) and -ipe (secondary for ellipsis) as distinct basic colours to keep the presentation simple.",
        "Only for the analysis of the interaction of e.g. ellipsis with focus phenomena (cf. section 4.4) do we need a more elaborate formalization, which we will discuss there.",
        "Given the above restriction for well-formed coloured substitutions, such a colouring ensures that any solution containing a primary occurrence is ruled out: free variables are -9e-coloured and must be assigned a -9e-monochrome term.",
        "Hence no substitution will ever contain a primary occurrence (i.e. ape-coloured symbol).",
        "For instance, discourse (la) above is assigned the semantic representation (3a) and the equation (313) with unique solution (3c).",
        "In contrast, (3d) is not a possible solution since it assigns to an -9e-coloured variable, a term containing ape-coloured symbol i.e. a term that is not -ipemonochrome."
      ]
    },
    {
      "heading": "3.2 HOCU theory",
      "text": [
        "To be more formal, we presuppose a finite set C = {a, b, c, pc, -9e, ...} of colour constants and a",
        "countably infinite supply CV = {A, B, ...} of colour variables.",
        "As usual in A-calculus, the set wff of well-formed formulae consists of (coloured') constants ca, runsb, runsA, .., (possibly uncoloured) variables x,xa,yb,... (function) applications of the form MN and A-abstractions of the form Ax.M.",
        "Note that only variables without colours can be abstracted over.",
        "We call a formula M c-monochrome, if all symbols in M are bound or tagged with c. We will need the so-called colour erasure 'MI of M, i.e. the formula obtained from M by erasing all colour annotations in M. We will also use various elementary concepts of the A-calculus, such as free and bound occurrences of variables or substitutions without defining them explicitly here.",
        "In particular we assume that free variables are coloured in all formulae occuring.",
        "We will denote the substitution of a term N for all free occurrences of x in M with [Nlx]M. It is crucial for our system that colours annotate symbol occurrences (i.e. colours are not sorts!",
        "), in particular, it is intended that different occurrences of symbols carry different colours (e.g. f(xb, xa)) and that symbols that carry different colours are treated differently.",
        "This observation leads to the notion of coloured substitutions, that takes the colour information of formulae into account.",
        "In contrast to traditional (uncoloured) substitutions, a coloured substitution a is a pair (o-t, al, where the term substitution o-t maps coloured variables (i.e. the pair x, of a variable x and the colour c) to formulae of the appropriate type and the colour substitution o-c maps colour variables to colours.",
        "In order to be legal (a C-substitution) such a mapping ci must obey the following constraints:",
        "• If a and b are different colours, then Icr(xa )1 = lo-(xb)j, i.e. the colour erasures have to be equal.",
        "• If c E C is a colour constant, then c(x) is c-monochrome.",
        "The first condition ensures that the colour erasure of a C-substitution is a well-defined classical substitution of the simply typed A-calculus.",
        "The second condition formalizes the fact that free variables with constant colours stand for monochrome subformu-lae, whereas colour variables do not constrain the substitutions.",
        "This is exactly the trait, that we will exploit in our analysis.",
        "'Colours are indicated by subscripts labeling term occurrences; whenever colours are irrelevant, we simply omit them.",
        "Note that On-reduction in the coloured A-calculus is just the classical notion, since the bound variables do not carry colour information.",
        "Thus we have all the known theoretical results, such as the fact that /3n-reduction always terminates producing unique normal forms and that On-equality can be tested by reducing to normal form and comparing for syntactic equality.",
        "This gives us a decidable test for validity of an equation.",
        "In contrast to this, higher-order unification tests for satisfiability by finding a substitution o that makes a given equation M = N valid (cr(M) =on a-(N)), even if the original equation is not (M Ofin N).",
        "In the coloured A-calculus the space of (semantic) solutions is further constrained by requiring the solutions to be C-substitutions.",
        "Such a substitution is called a C-unifier of M and N. In particular, C-unification will only succeed if comparable formulae have unifiable colours.",
        "For instance, introa(Pa,i137 Xa) unifies with introa(Ya,..M,sa) but not with intrOa (Pa ja sa) because of the colour clash on j.",
        "It is well-known, that in first-order logic (and in certain related forms of feature structures) there is always a most general unifier for any equation that is solvable at all.",
        "This is not the case for higher-order (coloured) unification, where variables can range over functions, instead of only individuals.",
        "Fortunately, in our case we are not interested in general unification, but we can use the fact that our formulae belong to very restricted syntactic subclasses, for which much better results are known.",
        "In particular, the fact that free variables only occur on the left hand side of our equations reduces the problem of finding solutions to higher-order matching, of which decidability has been proven for the subclass of third-order formulae (Dowek, 1992) and is conjectured for the general case.",
        "This class, (intuitively allowing only nesting functions as arguments up to depth two) covers all of our examples in this paper.",
        "For a discussion of other subclasses of formulae, where higher-order unification is computationally feasible see (Prehofer, 1994).",
        "Some of the equations in the examples have multiple most general solutions, and indeed this multiplicity corresponds to the possibility of multiple different interpretations of the focus constructions.",
        "The role of colours in this is to restrict the logically possible solutions to those that are linguistically sound."
      ]
    },
    {
      "heading": "4 Linguistic Applications of the POR",
      "text": [
        "In section 3.1, we have seen that HOCU allowed for a simple theoretical rendering of DSP's Primary Occurrence Restriction.",
        "But isn't this restriction fairly idiosyncratic?",
        "In this section, we show that the restriction which was originally proposed by DSP to model VP-ellipsis, is in fact a very general constraint which far from being idiosyncratic, applies to many different phenomena.",
        "In particular, we show that it is necessary for an adequate analysis of focus, second occurrence expressions and adverbial quantification.",
        "Furthermore, we will see that what counts as a primary occurrence differs from one phenomenon to the other (for instance, an occurrence directly associated with focus counts as primary w.r.t focus semantics but not w.r.t to VP-ellipsis interpretation).",
        "To account for these differences, some machinery is needed which turns DSP's intuitive idea into a fully-blown theory.",
        "Fortunately, the HOCU framework is just this: different colours can be used for different types of primary occurrences and likewise for different types of free variables.",
        "In what follows, we show how each phenomenon is dealt with.",
        "We then illustrate by an example how their interaction can be accounted for."
      ]
    },
    {
      "heading": "4.1 Focus",
      "text": [
        "Since (Jackendoff, 1972), it is commonly agreed that focus affects the semantics and pragmatics of utterances.",
        "Under this perspective, focus is taken to be the semantic value of a prosodically prominent element.",
        "Furthermore, focus is assumed to trigger the formation of an additional semantic value (henceforth, the Focus Semantic Value or FSV) which is in essence the set of propositions obtained by making a substitution in the focus position (cf. e.g. (Kratzer, 1991)).",
        "For instance, the FSV of (4a)2 is (4b), the set of formulae of the form 1(j,x) where x is of type e, and the pragmatic effect of focus is to presuppose that the denotation of this set is under consideration.",
        "(4) a. Jon likes SARAH b.",
        "{/(j,x) I x E wife}",
        "This yields a focus semantic value which is in essence Kratzer's presupposition skeleton.",
        "For instance, given (4a) above, the required equation will be /(j, s) = Gd(s) with two possible values for Gd: Ax.l(j, x) and Ax (j, s).",
        "Given definition (4.1), (4a) is then assigned two FSVs namely",
        "That is, the HOU treatment of focus over-generates: (5a) is an appropriate FSV, but not (5b).",
        "Clearly though, the POR can be used to rule out (5b) if we assume that occurrences that are directly associated with a focus are primary occurrences.",
        "To capture the fact that those primary occurrences are different from DSP's primary occurrences when dealing with ellipsis, we colour occurrences that are directly associated with focus (rather than a source parallel element in the case of ellipsis) pf.",
        "Consequently, we require that the variable representing the FSV be --9f coloured, that is, its value may not contain any pf term.",
        "Under these assumptions, the equation for (4a) will be (6a) which has for unique solution (6b).",
        "(6) a.",
        "/(j,spf) = FSV_pf(spf) b. FSV-pf Ax .1(j, x)"
      ]
    },
    {
      "heading": "4.2 Second Occurrence Expressions",
      "text": [
        "A second occurrence expression (SOE) is a partial or complete repetition of the preceding utterance and is characterised by a de-accenting of the repeating part (Bartels, 1995).",
        "For instance, (7b) is an SOE whose repeating part only likes Mary is deaccented.",
        "be the target and source parallel elements3, then the interpretation of an SOE must respect the following equations:"
      ]
    },
    {
      "heading": "4.3 Adverbial quantification",
      "text": [
        "Finally, let us briefly examine some cases of adverbial quantification.",
        "Consider the following example from (von Fintel, 1995): Tom always takes SUE to Al's mother.",
        "Yes, and he always takes Sue to JO's mother.",
        "In (Gardent and Kohlhase, 1996), we suggest that such cases are SOEs, and thus can be treated as involving a deaccented anaphor (in this case, the anaphor he always takes Sue to _'s mother).",
        "Given some standard assumptions about the semantics of 3 As in DSP, the identification of parallel elements is taken as given.",
        "always, the equations constraining the interpretation An of this anaphor are:",
        "(Tom take Sue to Jo's mother) Consider the first equation.",
        "If An is the semantics shared by target and source clause, then the only possible value for An is",
        "Once again, we see that the POR is a necessary restriction: by labeling as primary, all occurrences representing a parallel element, it can be ensured that only the first solution is generated."
      ]
    },
    {
      "heading": "4.4 Interaction of constraints",
      "text": [
        "Perhaps the most convincing way of showing the need for a theory of colours (rather than just an informal constraint) is by looking at the interaction of constraints between various phenomena.",
        "Consider the following discourse",
        "(9) a. Jon likes SARAH b. Peter does too",
        "Such a discourse presents us with a case of interaction between ellipsis and focus thereby raising the question of how DSP' POR for ellipsis should interact with our POR for focus.",
        "As remarked in section 3.1, we have to interpret the colour --ipe as the concept of being not primary for ellipsis, which includes pf (primary for focus).",
        "In order to make this approach work formally, we have to extend the supply of colours by allowing boolean combinations of colour constants.",
        "The semantics of these ground colour formula is that of propositional logic, where --,c1 is taken to be equivalent to the disjunction of all other colour constants.",
        "Consequently we have to generalize the second condition on C-substitutions",
        "• For all colour annotations d of symbols in u(x) c in propositional logic.",
        "Thus X – ,d can be instantiated with any coloured formula that does not contain the colour d. The",
        "HOCU algorithm is augmented with suitable rules constraint must be enforced: a term occurrence ap-for boolean constraint satisfaction for colour equa- pearing in an equation must appear unchanged in tions.",
        "the term assigned by substitution to the free vari-The equations resulting from the interpretation of able occurring in this equation.",
        "The following ex-(9b) are: ample illustrates this.",
        "1(ipe, Spf) R – pe(jpe) (Chomsky, 1976) observes that focused NPs R-134) = FSV-,pf (F) pattern with quantified and wh-NPs with re-where the first equation determines the interpre- spect to pronominal anaphora: when the quantitation of the ellipsis whereas the second fixes the fied/wh/focused NP precedes and c-commands the value of the FSV.",
        "Resolution of the first equation pronoun, this pronoun yields an ambiguity between yields the value Ax.l(x, spf) for R – pe.",
        "As required, a co-referential and a bound-variable reading.",
        "This no other solution is possible given the colour con is illustrated in example straints; in particular Ax./(jpe, spy) is not a valid so (10) We only expected HIM, to claim lution.",
        "The value of R-pe(jpe) is now /(ppe, spy) so that hei was brilliant that the second equation is4: where the presence of the pronoun hey gives rise l(p, spf) = FSV_,pf(F) to two possible FSVs5 Under the indicated colour constraints, three so FSV = {Ax.ex(x,y,i) I y E wife} lutions are possible: FSV = {Ax.ex(x,y,y) I y E wife} FSIT_py = Ax.l(p,x), F = spf thus allowing two different readings: the corefen-FSV-,pf = .\\0.0(p), F Ax.l(x, spf) tial or strict reading FSV-pf = AX F = l(p, spf) V P[P E {Ax.ex(x,y,i) I y E wffe} The first solution yields a narrow focus read A P(we) P = Ax.ex(x,i, i)] ing (only SARAH is in focus) whereas the second and the bound-variable or sloppy reading.",
        "and the third yield wide focus interpretations corre- V P[P E {Ax.ex(x,y,y)) I y E wife} sponding to a VP and an S focus respectively.",
        "That A P(we) P = Ax .ex(x, is, not only do colours allow us to correctly capture In contrast, if the quantified/wh/focused NP does the interaction of the two PORs restricting the in not precede and c-command the pronoun, as interpretation of ellipsis of focus, they also permit a (11) We only expected himi to claim natural modeling of focus projection (cf. (Jackend- that HE, was brilliant off, 1972)).",
        "there is no ambiguity and the pronoun can only 5 Another constraint give rise to a co-referential interpretation.",
        "For in-An additional argument in favour of a general the stance, given (11) only one reading arises ory of colours lies in the fact that constraints that V P[P E {Ax.ex(x,i,y) I y E wffe} are distinct from the POR need to be encoded to A P(we) P = Ax.ex(x,i, i)] prevent HOU analyses from over-generating.",
        "In this where the FSV is {Ax.ex(x,i,y) I y E wffe}.",
        "section, we present one such constraint (the so-called To capture this data, Government and Binding weak-crossover constraint) and show how it can be analyses postulate first, that the antecedent is raised implemented within the HOCU framework.",
        "by quantifier raising and second, that pronouns that In essence, the main function of the POR is to en are c-commanded and preceded by their antecedent sure that some occurrence occuring in an equation are represented either as a Abound variable or as appears as a bound variable in the term assigned a constant whereas other pronouns can only be rep-by substitution to the free variable occurring in this resented by a constant (cf. e.g. (Kratzer, 1991)'s equation.",
        "However, there are cases where the dual binding principle).",
        "Using HOCU, we can model this restriction directly.",
        "As before, the focus term is pf-and the FSV variable -pf-coloured.",
        "Furthermore, we assume that pronouns that are preceded and c-commanded by a quantified/wh/focused antecedent are variable coloured whereas other pronouns are -9f-coloured.",
        "Finally, all other terms are taken to 4 Note that this equation falls out of our formal system in that it is untyped and thus cannot be solved by the algorithm described in section 6 (as the solutions will show, we have to allow for FSV and F to have different types).",
        "However, it seems to be a routine exercise to augment HOU algorithms that can cope with type variables like (Hustadt, 1991; Dougherty, 1993) with the colour methods from (Hutter and Kohlhase, 1995).",
        "6 'We abbreviate exp(x,cl(y,blt(i))) to ex(x,y,i) to increase legibility.",
        "be -,pf-coloured.",
        "Given these assumptions, the rep 7 them.",
        "The rule for abstractions transforms equa-resentation for (10) is eX-vf, (We-.pf ipf, iA) and the tions of the form Ax.A =t Ay.B to [c144 t [c/y].13, corresponding FSV equation and Ax.A =t B to [clx]A.",
        "=t Bc where c is a new R-,pf (ipf ) AX.eX-9f (X, ipf, jA) constant, which may not appear in any solution.",
        "The has two possible solutions rule for applications decomposes ha (si, sn) R_pf = Ay•Ax•ex-pf (x, y, i-pf) hb(tl, , tn) to the set {a b,si = t1,.5 sn R-pf = Ay .Ax.ex-pf (x ,y , x) tn}, provided that h is a constant.",
        "Furthermore In contrast, the representation for (11) is equations are kept in 077-normal form.",
        "ex-pf(we-pf, i-pf, ipf) and the equation is The variable elimination process for colour vari-R-pf Ax .ex-, (x5 ipf ) ables is very simple, it allows to transform a set with only one well-coloured solution U {A d} of equations to [d/Ale U {A =c d}, R-pf Ay•Ax.ex-pf (x, Y) making the equation {A C d} solved in the result.",
        "Importantly, given the indicated colour con For the formula case, elimination is not that simple, straints, no other solutions are admissible.",
        "Intu- since we have to ensure that la(xA )1 = la(xB)I to itively, there are two reasons for this.",
        "First, the obtain a C-substitution a.",
        "Thus we cannot simply definition of coloured substitutions ensures that the transform a set E U {xd =t M} into [M/xd]EU{xd =t term assigned to R-pf is --ipf-monochrome.",
        "In par M}, since this would (incorrectly) solve the equa-ticular, this forces any occurrences of ipf to appear tions {xc = fc,Xd = gd } The correct variable as a bound variable in the value assigned to R-pf elimination rule transforms E U {xd =t M} into whereas iA can appear either as i-pf (a colour vari- a(E)U {xd =tM,x, Afn}, able unifies with any colour constant) or as a bound where variable - this in effect models the sloppy/strict am ci are all colours of the variable x occurring in M and biguity.",
        "Second, a colour constant only unifies with E, the M1 are appropriately coloured variants (same itself.",
        "This in effect rules out the bound variable colour erasure) of M, and a is the C-substitution reading in (11): if the i-pf occurrence were to be that eliminates all occurrences of x from E. come a bound variable, the value of R-npf would Due to the presence of function variables, sys-then Ay.Ax.ex_pf (x, y, y) .",
        "But then by 0-reduction, tematic application of these rules can terminate R_pf(ipf) would be Ax.ex_pf(x, ipf, ipf) which does with equations of the form x,(s sn) =t not unify with the right hand side of the original hd (ti, , tm).",
        "Such equations can neither be fur-equation i.e Ax.ex-pf (x, i-pf, ipf).",
        "ther decomposed, since this would loose unifiers (if For a more formal account of how the unifiers are G and F are variables, then Ga = Fb as a solution calculated see section 6.1.",
        "Ax.c for F and G, but IF = G,a = b} is unsolv6 Calculating Coloured Unifiers able), nor can the right hand side be substituted for Since the HOCU is the principal computational de x as in a variable elimination rule, since the types vice of the analysis in this paper, we will now try would clash.",
        "Let us consider the uncoloured equa-to give an intuition for the functioning of the algo- tion x(a) a which has the solutions (Az.a) and rithm.",
        "For a formal account including all details and (Az.z) for x. proofs see (Hutter and Kohlhase, 1995).",
        "The standard solution for finding a complete set Just as in the case of unification for first-order of solutions in this so-called flex/rigid situation is terms, the algorithm is a process of recursive decom- to substitute a term for x that will enable decompo-position and variable elimination that transform sets sition to be applicable afterwards.",
        "It turns out that of equations into solved forms.",
        "Since C-substitutions for finding all C-unifiers it is sufficient to bind x to have two parts, a term and a colour part, we need terms of the same type as x (otherwise the unifier two kinds (M =t N for term equations and c =e d would be ill-typed) and compatible colour (other-for colour equations).",
        "Sets of equations in solved wise the unifier would not be a C-substitution) that form (i.e. where all equations are of the form x = M either such that the variable x does not occur anywhere else • have the same head as the right hand side; the in M or E) have a unique most general C-unifier so-called imitation solution (Az.a in our exam-that also C-unifies the initial equation.",
        "ple) or There are several rules that decompose the syntac- • where the head is a bound variable that enables tic structure of formulae, we will only present two of the head of one of the arguments of x to become head; the so-called projection binding (Az.z).",
        "In order to get a better understanding of the situation let us reconsider our example using colours.",
        "x(ac) = ad.",
        "For the imitation solution (Az.ad) we clash6.",
        "So we can only bind R.f to the imitation \"imitate\" the right hand side, so the colour on a binding Ayx.ex_pf (H_,1 pf (y, x), H_,2pf (y, x), H3 (y, x)).",
        "must be d. For the projection solution we instantiate Now, we can directly eliminate the variable R-vf (Az.z) for x and obtain (Az.z)ac, which /3-reduces to since there are no other variants.",
        "The resulting equa-a.",
        "We see that this \"lifts\" the constant a, from the tion argument position to the top.",
        "Incidentally, the pro (H,1 pf (ipf , pf, (ipf 07 H3 (ipf, e)) jection is only a C-unifier of our coloured example, eX-pf (C7 ipf, jA) if c and d are identical.",
        "can be decomposed to the equations Fortunately, the choice of instantiations can be (17) H_,lpf(ipf, c) =t c further restricted to the most general terms in the mpf (ipf, =t ipf categories above.",
        "If xc has type On -+ a and hd has H_,3pf (ipf ,C) =t iA type 57,, 4 a, then these so-called general bind Let us first look at the first equation; in this ings have the following form: flex/rigid situation, only the projection binding = Az\"' z\"-.hd(H:i , HZ, (7)) Azw.w can be applied, since the imitation binding where the Hi are new variables of type i3i, – > 'yi and Azw.c contains the forbidden constant c and the the ei are either distinct colour variables (if c E CV) other projection leads to a clash.",
        "This solves the or e2 = d c (if c E C).",
        "If h is one of the bound equation, since (Azw.w)(ipf, c) 0-reduces to c, giv-variables ei , then g(it is called an imitation binding the trivial equation c =t c which can be deleted ing, and else, (h is a constant or a free variable), a by the decomposition rules.",
        "projection binding.",
        "Similarly, in the second equation, the projection The general rule for flex/rigid equations trans- binding Azw.z for H2 solves the equation, while the forms {xc(sl, , s\") =i hd(t1,...,tm)} into second projection clashes and the imitation binding hd(ti,..., tin), xc z=t gchl Azw.ipf is not -pf-monochrome.",
        "Thus we are left which with the third equation, where both imitation and in essence only fixes a particular binding for the projection bindings yield legal solutions: head variable xc.",
        "It turns out (for details and proofs • The imitation binding for Hf is Azw.i_pf, and see (Hutter and Kohlhase, 1995)) that these general not Azw.iA, as one is tempted to believe, since bindings suffice to solve all flex/rigid situations, pos- it has to be -9f-monochrome.",
        "Thus we are left sibly at the cost of creating new flex/rigid situations with i-,pf iA, which can (uniquely) be solved after elimination of the variable xc and decompo- by the colour substitution [--pf /A].",
        "sition of the changed equations (the elimination of • If we bind 1-/-_,3pf to Azw.z, then we are left with x changes xc (si sn) to 0(31 sn) which has ipf =t iA, which can (uniquely) be solved by the head h).",
        "colour substitution [pf /A].",
        "6.1 Example If we collect all instantiations, we arrive at exactly To fortify our intuition on calculating higher-order the two possible solutions for R-pf in the original coloured unifiers let us reconsider examples (10) and equations, which we had claimed in section 5: (11) with the equations R_pf = Ayx.ex_pf (x, y, i_pf) R-pf (ipf) =t AX.eX-pf (x, 2pf, ZA) R-pf = AY X .eX-pf (X, y , x) R-pf(ipf) =t Ax.ex_pf(x,i-pf,ipf) Obviously both of them solve the equation and We will develop the derivation of the solutions for furthermore, none is more general than the other, the first equations (10) and point out the differences since i-pf cannot be inserted for the variable x in for the second (11).",
        "As a first step, the first equation the second unifier (which would make it more general is decomposed to than the first), since x is bound.",
        "R-pf(ipf,c) ex_pf(c,ipf,iA) In the case of (11) the equations corresponding where c is a new constant.",
        "Since li-pf is a vari- to (17) are Hf(c, ipf) =t c, 11_2 pf(c,ipf) i_pf and able, we are in a flex/rigid situation and have the 1/_,3pf (ipf) t ipf.",
        "Given the discussion above, it is impossibilities of projection and imitation.",
        "The pro mediate to see that IL,lpf has to be instantiated with jection bindings Axy.x and Axy.y for li_pf would the projection binding Azw.w, H2 with the imitation lead us to the equations iv =t ex-pf(c, ipf, iA) and C =t ex-pf (c, ipf, iA), which are obviously unsolvable, since the head constants i pf (and c resp.)",
        "and ex-pf 8 6 For (11) we have the same situation.",
        "Here the corresponding equation is ipf =t ex-pf(c,i-pf,ipf).",
        "binding Azw.ipf, since the projection binding leads to a colour clash (if =t ipf) and finally M3 pf has to be bound to the projection binding Azw.z, since the imitation binding Azw.ipf is not – 9f-monochrome.",
        "Collecting the bindings, we arrive at the unique solution R,pf = AYX.eX-vf (X, X)."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "Higher – Order Unification has been shown to be a powerful tool for constructing the interpretation of NL.",
        "In this paper, we have argued that Higher – Order Coloured Unification allows a precise specification of the interface between semantic interpretation and other sources of linguistic information, thus preventing over – generation.",
        "We have substantiated this claim by specifying the linguistic, extra – semantic constraints regulating the interpretation of VP – ellipsis, focus, SOEs, adverbial quantification and pronouns whose antecedent is a focused NP.",
        "Other phenomena for which the HOCU approach seems particularly promising are phenomena in which the semantic interpretation process is obviously constrained by the other sources of linguistic information.",
        "In particular, it would be interesting to see whether coloured unification can appropriately model the complex interaction of constraints governing the interpretation and acceptability of gapping on the one hand, and sloppy/strict ambiguity on the other.",
        "Another interesting research direction would be the development and implementation of a monos-tratal grammar for anaphors whose interpretation are determined by coloured unification.",
        "Colours are tags which decorate a semantic representation thereby constraining the unification process; on the other hand, there are also the reflex of linguistic, non-semantic (e.g. syntactic or prosodic) information.",
        "A full grammar implementation would make this connection more precise."
      ]
    },
    {
      "heading": "8 Acknowledgements",
      "text": [
        "The work reported in this paper was funded by the Deutsche Forschungsgemeinschaft (DFG) in Sonder-forschungsbereich SFB-378, Project C2 (LISA)."
      ]
    }
  ]
}
