{
  "info": {
    "authors": [
      "Sabine Lehmann",
      "Stephan Oepen",
      "Sylvie Regnier-Prost",
      "Klaus Netter",
      "Veronika Lux",
      "Judith Klein",
      "Kirsten Falkedal",
      "Frederik Fouvry",
      "Dominique Estival",
      "Eva Dauphin",
      "Herve Compagnion",
      "Judith Baur",
      "Lorna Balkan",
      "Doug J. Arnold"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-2120",
    "title": "TSNLP - Test Suites for Natural Language Processing",
    "url": "https://aclweb.org/anthology/C96-2120",
    "year": 1996
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The growing language technology industry needs measurement tools to allow researchers, engineers, managers, and customers to track development, evaluate and assure quality, and assess suitability for a variety of applications.",
        "The TSNIA' (lest Suites for Natural Language Processing) project has investigated various aspects of the construction, maintenance and application of systematic test suites as diagnostic and evaluation tools for NIA) applications.",
        "'rho paper summarizes the motivation and main results of TSNLP: besides the solid methodological foundation of the project, TSNIA' has produced substantial (i.e. larger than any existing general test suites) multi-purpose and multi-user test, suites for three European languages together with a set of specialized tools that facilitate the construction, extension, maintenance, retrieval, and customization of the test data.",
        "The publicly available results of Tsm,u represent a valuable linguistic resource that has the potential of providing a widespread pre-standard diagnostic and evaluation tool for both developers and users of NIA) applications."
      ]
    },
    {
      "heading": "1 Background and Motivation",
      "text": [
        "Evaluation of NLP applications plays an increasingly important role in both the academic and industrial NI, communities.",
        "Two tools traditionally used for evaluating and testing NLP systems axe test, suites and test corpora.",
        "The two can he seen as serving complementary purposes (see Dauphin et al.",
        "(1995a)): in contrast to text corpora, whose main advantage is that they reflect naturally occurring data, the key properties of test suites are (i) systonaticity, (ii) control ore7' data, (iii) inclusion of neg alive data, and (iv) exhaustiv-ity.",
        "'The project was started in necember 1993 and completed in March 1996.",
        "Most of the project results (documents, bibliography, test data, and software) as well as on-line access to the test suite databame and email addresses of the project members can he obtained through the worldwide web from the TSNIA' \"tonic page `http://tsulp.",
        "dfki The TSNLP project, was funded within the Linguistic.",
        "Research Engineering (1,iii,;) programme of the European ( lommission (DC NM) under research grant 62-089 and by the Swiss Federal lovernment.",
        "Among the main motivations for the rrstvit) project were the lack of general guidelines for the test suite construction, of adequate and comprehensive test material, and of appropriate tools.",
        "The resulting duplication of effort among test suite developers obviously leads to a waste of time and resources.",
        "In addition, one of the main conclusions of a study of existing tests suites conducted during the first stage of the project (l'stival et al.",
        "(1994)) was that the reusability of existing test suites is severely hampered by their lack of structure and annotations.",
        "Indeed, despite the pioneering efforts of Flickinger et al.",
        "(1987) and Nerbonne et al.",
        "(1993), most of the existing test suites were written for some specific system or simply enumerate a number of interesting examples and, thus, (lo not, meet the demand for large, systematic, well-documented, highly-structured and annotated collections of linguistic material, which is now required by a growing number of NLP applications.",
        "The TSNLP test, suite addresses these demands and provides powerful tools fill: the construction and manipulation of the test data.",
        "On the one hand, since every NLP system (whether commercial or under development) exhibits specific features which make it unique, and every user (or developer) of an NLP system has specific needs and requirements, the TSNI,P approach is based on the assumption that, ill order to yield informative and interpretable results, any test suite used for an actual test or evaluation must be specific (at, least to some degree) to the system and the user.",
        "On the other hand, since testing or evaluating NLP systems is performed for a variety of purposes, the TsNIT approach is also guided by the need to provide test material which is easily reusable.",
        "To achieve these two goals of specificity and reusability, the traditional notion of a test suite as a monolithic set of test, items has been abandoned in favour of the notion of a database in which test items are stored together with a rich inventory of associated linguistic: and non-linguistic annotations.",
        "Thus, the test suite database serves as a virtual (or meta) test, suite that provides the means to extract, the relevant subset of the test data suiLdde for some specific: task.",
        "Using the explicit struct•",
        "ture of the data and the TSNLP annotations, the database engine allows searching and retrieving data from the virtual test suite, thereby creating a concrete test suite instance according to arbitrary linguistic and extralinguistic constraints.",
        "Since, additionally, there are tools provided for the maintenance and extension of the test suite database, the TSNLP virtual test suite approach is an essential innovation leading the way to a new generation of highly-structured reusable test suites."
      ]
    },
    {
      "heading": "2 Test Suite Design and Methodology",
      "text": [
        "Based on a survey of existing test suites and an analysis of the diagnostic and evaluation requirements of both NL technology developers arid users, TSNLP has developed the methodology for the construction of core test data, that is, test items reflecting central language phenomena and that are applicable to a wide range of applications, including parsers,•grammar checkers, and controlled language checkers (Balkan et al.",
        "(1996)).",
        "The TSNLP methodology is designed to optimize (i) control over test data, (ii) progressivity, and (iii) systematicity.",
        "These are necessary qualities for an adequate, reusable test suite, which are difficult to find in test corpora.",
        "The methodology also addresses the specific goals of TSNLP to produce multi-purpose, multi-user, and multilingual test suites.",
        "Control over test data What makes test suites valuable in comparison to corpora is that they can focus on specific linguistic phenomena and that each phenomenon can be presented both in isolation and controlled combinations in which as many linguistic parameters as possible are being kept under control.",
        "This is particularly the case when a phenomenon is illustrated by systematic variation over the parameters used to describe this phenomenon, while all other parts of the test items remain constant.",
        "Vocabulary is an aspect of the test data that needs to be controlled.",
        "TSNLP achieves this by restricting the vocabulary in size as well as in domain.",
        "Categorially and semantically ambiguous words are avoided where possible and only included when ambiguity is explicitly tested for.",
        "Additionally, TSNLP attempts to control the interaction of phenomena by keeping the test items as small as possible.",
        "Therefore, a number of guidelines for this purpose (such as use declarative sentences and avoid modifiers and adjuncts) is provided.",
        "Progressivity Progressivity is the principle of starting from simple test items and increasing their complexity.",
        "In TSNLP, this aspect is addressed by requiring that each test item focuses only on a single phenomenon (or rather subphe-nomenon or even feature) which distinguishes it from all other test items.",
        "This principle not only ensures systematicity during the test data construction but also allows test data users to apply the test data in a progressive order obtained from the special attribute presupposition in the phenomena classification.",
        "Thus, the precise identification of the coverage of a system and of its deficiencies is rendered easier.",
        "Systematicity Systematicity refers to the depth of coverage of a test suite, with respect to both well-formed and ill-formed items.",
        "Systematicity in TSNLP is achieved for well-formed items by the explicit classification of test items according to phenomena and sub-phenomena.",
        "Negative test data permits testing for overgeneration as well as for coverage.",
        "Ill-formed items are derived from well-formed ones by systematic variation of the parameters through the application of one (or more) of four operations, namely:",
        "• REPLACEMENT (e.g. change of person) (French) L' ingenieur vient.",
        "(French) *L' ingenieur viens.",
        "• ADDITION (e.g. of an object NP) (German) Der Manager arbeitet.",
        "(German) *Der Manager arbeitet den Vortrag.",
        "• DELETION (e.g. of an obligatory complement) (German) Der Manager halt den Vortrag.",
        "(German) *Der Manager halt.",
        "• PERMUTATION (e.g. inverting word order ) (English) He saw the boy.",
        "(English) *He the boy saw.",
        "In general, the systematicity of test data was greatly enhanced through the use of special-purpose tools in the data construction and validation process (see section 5 below).",
        "Multilinguality Multilinguality is achieved in the TSNLP test suites by covering the same range of phenomena in English, French and German, and adopting the same classification for these phenomena in the three languages.",
        "Furthermore, the choice of related terminology for the categoiial and structural description contributes to the comparability and consistency of the test items (see section 4 for details).",
        "Documentation To enhance the usability and extensibility of TSNI,P results, a three-volume user guide is under preparation providing clear instructions for the assessment of the methodology, test data, and tools developed."
      ]
    },
    {
      "heading": "3 TSNLP Annotation Schema",
      "text": [
        "A detailed annotation schema was designed for the test data which does not presuppose a specific linguistic theory, a particular evaluation situation or application type.",
        "Test data and annotations in TSNLP test suites are organized at four distinct representational levels:",
        "• Core Data The core of the test data consists of the individual test items together with all general, categorial and structural information that is independent of a token phenomenon or application.",
        "Besides the actual input string, annotations at this level include (i) bookkeeping and documentation information (author, date, id number), (ii) the item format, its length, category and well-formedness code, (iii) the (morpho)syntactic categories and string positions of the lexical and phrasal elements constituting the test item, and (iv) an (underspecitied) representation of its functional structure.",
        "Encoding a dependency or functor-argument graph rather than a phrase structure tree allows generalizations over potentially controversial phrase structure configurations and, thus, avoids imposing a specific constituent structure but still can be mapped onto one.",
        "• Phenomenon-Related Data Based on a hierarchical classification of linguistic (and extra-linguistic) phenomena (e.g. verb valency as a subtype of general complementation), each phenomenon is identified by a phenomenon id and by its supertype(s).",
        "Interaction with other phenomena as well as the phenomena which must he presupposed are also given.",
        "In addition, the (syntactic) parameters which are relevant for the phenomenon (e.g. the number and type of complements in the case of verb valency) are described.",
        "Individual test items can he assigned to one or several phenomena and annotated according to the corresponding parameters.",
        "• Test Sets Test items can optionally be grouped",
        "into test sets.",
        "A test set is a group of test items containing typically one positive example and one or more negative examples.",
        "The relation between positive and negative test items has been one of the most challenging questions in designing test data and, as has been mentioned, is based on the systematic variation of phenomenon-specific parameters.",
        "• User and Application Parameters information that typically correlates with the use of a test suite for different; types of evaluation and for different applications (e.g. ratings of frequency or relevance for a particular domain) is factored from the remainder of the data into user application profiles.",
        "As part of the customization process users of the TSNLP test suites are encouraged to extend this part of the test suite database and add whatever (formal or informal) information is necessary for their specific requirements.",
        "In addition to the parts of the annotation schema that follow a formal specification, there is room for textual comments at the various levels to accommodate information that cannot or need not be formalized.",
        "i'igure 1: Sample instance of the TSNIA' annotation schema for one test item: the annotations are given in tabular form for the test item, analysis, and phe-no7O,C7LOTE levels."
      ]
    },
    {
      "heading": "4 Test Data Construction",
      "text": [
        "lAfflowing the TSN1,1) test suite guidelines (Estival et al.",
        "(1904)) and using the annotation schema sketched above, the construction of test data was based on a classification of the (syntactic) phenomena to be covered.",
        "From judgements on the linguistic relevance and frequency for the individual languages, the following list of core phe-71,0111C7la for TSNLP was compiled:",
        "• complementation; • agreement; • modification; • diathesis; • modality, tense, and aspect; • sentence and clause types; • word order; • coordination; • negation; and • extragranunatical (e.g. parentheticals and temporal expressions).",
        "A further sub-classification of phenomena is made according to the relevant syntactic domains in which a phenomenon occurs (e.g. sentences (S), clauses (C), noun phrases (NP) et al.).",
        "Figure 2 gives an overview of the test material available.",
        "For each of the three languages sore 5000 test items are provided.",
        "Therefore, TSNIT has already achieved a substantially broader and deeper coverage than previous general-purpose test suites (the still very popular Hewlett-Packard test suite, for instance, has a coverage of 3000 test items for English only).",
        "In order to enforce consistency of annotations across the three languages, canonical lists of the categories and functions used in the description of categorial and dependency structure were established (see Lehmann et al.",
        "(1996)).",
        "The dimensions chosen in the classification attempt to avoid",
        "the presupposition of very specific assumptions of a particular theory of grammar (or of a language), and rather try to capture those distinctions that seem to be relevant across the set of TSNLP core phenomena."
      ]
    },
    {
      "heading": "5 Test Suite Technology",
      "text": [
        "Because the test data construction proper as well as the customization and application of a general-purpose test suite to a specific NLP system or domain are laborious, cost-intensive and error-prone tasks, TSNLP put strong emphasis on supplying suitable special-purpose tools to facilitate both the development as well as usage of the TSNLP test data (Oepen et al.",
        "(1996a) give an overview)."
      ]
    },
    {
      "heading": "5.1 Test Data Construction",
      "text": [
        "To ease the time-consuming test data construction and to reduce erratic variations in filling in the TSNLP annotation schema, a graphical test suite construction tool (tsct) was implemented.",
        "The tool instantiates the annotation schema (see section 3) as a form-based input mask and provides for (limited) consistency checking of the field values.",
        "Additionally, tsct allows reusing previously constructed and annotated data, as quite often when constructing a series of test items it can be easier to duplicate and adapt a similar item rather than produce annotations from scratch.",
        "For some of the test data a DCG-based test suite generation tool (Arnold et al.",
        "(1994)) was deployed to automatically produce systematically varied (i.e. both grammatical and ungrammatical) test items together with some part of the annotations."
      ]
    },
    {
      "heading": "5.2 Test Data Maintenance and Retrieval",
      "text": [
        "To implement the TSNLP virtual test suite approach (see section 1), the test data is mounted on a relational database to satisfy the following key desiderata:",
        "• usability: to facilitate the application of the methodology, technology, and test data developed in TSNLP to a wide variety of diagnosis and evaluation purposes for different applications by developers or users with varied backgrounds; • suitability: to meet the specific necessities of storing and maintaining natural language test data (e.g. in string processing) and to provide maximally flexible interfaces; • adaptability and extensibility: to enable and encourage users of the database to add test data and annotations according to their needs without changes to the underlying data model; and • portability and simplicity: to make the results of TSNLP available on several different hard and software platforms and easy to use.",
        "To account for the potentially different requirements of NLP developers and users and in order to provide suitable interfaces to human test suite users as well as to external application programs, a dual database implementation was carried out: (i) while a proprietary implementation (called tsdb1) allowed the fine-tuning of both the query language and interfaces, (ii) a second version (tsdb2) builds on a commercial database product and, thus, is compliant to common industry standards allowing (industrial) users of the TSNLP test suite to acquire on-site technical support where necessary.",
        "The tsdbi implementation is a small and efficient relational database engine in ANSI C. It was designed with an open and documented interface layer (see figure :3) that enables test suite users to bidirectionally link an application being tested to the database and run automated retrieve, process, and compare cycles.",
        "Diagnostic results obtained can be stored in the database as part of the 71,8C7-e'V application profile for use in continuous progress evaluation (section 6 gives an example).",
        "An ASCII-based command shell interprets a. simplified SQL-style query language and provides editing, completion, and command and query result history.",
        "A network database server gives remote (though read-only) access to the test data.",
        "For the alternative implementation tsdb2 the competitively priced database package Microsoft,",
        "FoxPro was deployed because it is available for both Apple Macintosh and personal computers running MS Windows' and has a very wide distribution.",
        "The database provides convenient graphical browsing and editing of the data (using pull-down menus for finite domain fields; see figure 4) as well as standard import and export facilities to exchange data with external applications."
      ]
    },
    {
      "heading": "5.3 Query and Retrieval: An Example",
      "text": [
        "'lb illustrate the capacity and flexibility of the TSNLP annotation schema in conjunction with a relational database retrieval engine, a query example in the simplified SQL-like query language interpreted by tsdbi together with an informal English paraphrase is given:'",
        "• find all grammatical test items that are associated with the phenomenon of clausal (i.e. subject verb) agreement and have pronominal subjects:"
      ]
    },
    {
      "heading": "select i-input",
      "text": [
        "where i-wf rr,r 1 & p-name \"C_Agreement\" a-function \"subj\" & a--category v \"\"PROM\""
      ]
    },
    {
      "heading": "6 Customization and Testing",
      "text": [
        "rl'o validate the TSNLP annol4ition methodology, test data, and tools, the project results have been tested against three different application types, viz. a commercial grammar checker for French, a, controlled language checker (S fl(!",
        "(l) for English and a parser (the PN:F; system developed at I K 1)",
        "for German.",
        "As in this setup the evaluation situations ranged from user-level black box evaluation of a commercial product to glass box diagnosis of a research prototype under development, (the 1)I?-KI system), a number of interesting results were obtained on both the adequacy of the TSNLP approach as well as the quality of the systems being tested.",
        "French Grammar Checker The real life evaluation scenario (i.e. the diagnostic evaluation of a commercial NEP product) enabled Aerospatiale to give a precise account of the type of information obtainable from the use of TSNLP.",
        "The following major performance characteristics were revealed:",
        "• TSNLP ill-formed test items are frequently not detected as such.",
        "• The system performs well on (both well-formed and ill-formed) test items illustrating the phenomenon of agreement, in clauses as well as in noun phrases.",
        "• The system does not master the phenomenon of complementation, especially not, in adjectival phrases.",
        "• Sentential test, items produce better results than subsentential ones.",
        "• The analysis capabilities of the system are limited (19% of the TsN1.1' test items were not hilly analysed).",
        "The interpretation of the results produced by the system and the comparison with the linguistic information proviiled in the TSNLP annotations led to an identification of the major short:unitings of the system in terms of systematicity, lexical and morpho-syntactic deficiencies, and interference with other system components."
      ]
    },
    {
      "heading": "English Controlled Language Checker",
      "text": [
        "l!",
        ";ssex tested the controlled language checker SF; (Ail•iaens (1994)).",
        "Like Aerospatiale, Essex was mostly in a black box Situation with respect.",
        "to the system, except that.",
        "they had access to the controlled grammar language descriptions (but not to the system rides).",
        "l'he testing involved the writing of a. large nuni1111: of customised test items, dile to the fact that many Cl, rules are lexically based, whereas the core test, suite concentrates on syntactic phenomena.. rUlie testing proved very valnille in highlighting deficiencies in the system perfor mance, as well as in the rule descriptions and gave pointers to the possible source of those errors.",
        "German Parser lri connecting tile German TSN1,P test.",
        "suite to the .DV1<1 PM:r; parser' hotb `The DI NI l'AC;E (Platform for Advanced Grammar fingineering) system is a, state-of-the-art NI, core It/I.",
        "gine and grammar engineering platform; 0, is in active use at several international research institutions, primarily for ilPs(-style grammar development for ( Japanese, and Italian.",
        "the test data as well as the TSNLP technology were validated.",
        "Building on the C version of the TSNLP database (tsdbi), a bidirectional interface to the application was established allowing the instantiation of a DFKI user & application profile for the storage of application-specific data (including performance measures and a semantic specification of the expected output).",
        "The seamless coupling between the test suite and the NL system allows running fully automated retrieve, process, and compare cycles in the continuous progress evaluation of the grammar and software such that ---- after making changes to the system - the impact on coverage and performance can be determined in an overnight batch job.",
        "The TSNLP test data and database technology proved to be a highly adequate tool for glass-box diagnostic evaluation; besides, the testing experience provided valuable feedback for both the test suite and the application tested (Dauphin et al.",
        "(1995b))."
      ]
    },
    {
      "heading": "7 Conclusion and Future Work",
      "text": [
        "The TSNLP project has laid the foundations for building large scale reference data for diagnostic and evaluation purposes.",
        "The project has produced a substantial set of test items for three different, languages, which are based on a systematic and controlled methodology, comprehensively annotated, and embedded in an environment allowing for easy access and maintenance of the data.",
        "The approach has been successfully tested against commercial and research NLP applications and components.",
        "However, while this work can be seen as an important step in the right direction, we are very well aware of future developments which will be essential for a widespread acceptance of the system in a broad user community.",
        "These developments comprise amongst others further extensions of the test data (possibly taking into account aspects of morphology and discourse), customization tools, which support the adaptation of the test data to specific domains and applications, as well as tools and methods which relate the isolated test items to corpora in order to determine their frequency and relevance.",
        "While the members of the project will continue this work, outside developers and users of NLP applications are invited to contribute to these resources which can become a reference standard only if they are truly public domain."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "In its initial specification and in the early phase of the project, TSNLP 'was greatly inspired by the conceptional and administrative contributions of Siety Meijer of University of Essex.",
        "Additionally, substantial parts of the implementation work at DEM and the University of Essex have been carried out by Tom Fettig, Fred Oberhauser, and Martin Ron-dell.",
        "We especially want to thank Roger Havenith, the TSNLP project officer at DC XIII, for his help throughout the project and the two external reviewers, Dan Flickinger and John Nerbonne, for their constructive comments and suggestions."
      ]
    }
  ]
}
