{
  "info": {
    "authors": [
      "Jonas Kuhn"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-2113",
    "title": "An Underspecified HPSG Representation for Information Structure",
    "url": "https://aclweb.org/anthology/C96-2113",
    "year": 1996
  },
  "references": [
    "acl-C96-1057"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Information structure can be of great use in linguistic applications, especially in those involving a speech component.",
        "However, focus marking by prosody is often ambiguous.",
        "Existing theories capture this by rules that produce alternative focus structures.",
        "This disjunction is hard to handle computationally.",
        "In this paper, a compact, graphically underspecified representation is proposed, along with composition principles and a resolution routine based on context information."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "This paper proposes an underspecified representation for information structure (IS) and HPSG' principles that build up this representation for German.",
        "The representation is designed as a basis for use in applications like text-to-speech and speech translation systems.",
        "It is obvious that for a non-tiring, natural output, especially the prosodic side of IS has to be taken into account.",
        "In this section, examples from sentence-based translation with semantic transfer visualize the role of IS in several empirical domains.",
        "For one thing, ignoring IS may result in confusing translations: (2) with default accenting,2 despite being truth-conditionally equivalent, is not a suitable translation for (1B) in the given context.",
        "System users will probably presume that a serious mistranslation occured.",
        "(1) A: Zu unserem Treffen wird also Frau Otto von der Firma Muller kommen?",
        "(`So, Frau Otto of Muller's will participate in our meeting?')",
        "Moreover, IS can be exploited to choose between certain translation alternatives on sentence level (cf. (Eberle, 1996)).",
        "The particle noch has different translations depending on accentuation:",
        "(3) G. Maria sucht noch einen BRIEFKASTEN.",
        "Maria looks-for still a postbox E. Maria is still looking for a post box.",
        "(4) G. Maria sucht NOCII einen Briefkasten.",
        "E. Maria is looking for another post box.",
        "Concluding the set of initial examples, (5) shows that focus can play a role in simple inferences drawn from context to resolve lexical ambiguities (or similarly for ellipsis and anaphora resolution).",
        "Since the ambiguous Besuch in (5) is not focus-marked, it has to be contextually given.",
        "Even a simple context model will resolve the reference back to the besuchen event mentioned in the preceding sentence, so the noun visit is chosen as a translation.",
        "The last example showed that certain ambiguities require inferences from context.",
        "However, the other examples make clear that focus can be effectively applied in sentence-based translation exploiting the existing linguistic focus marking within the sentence.",
        "Costly reasoning can thus be restricted to doubtful cases.",
        "A sentence-based account of IS faces one problem: in the general case, a certain prosodic marking of a sentence does not correspond to a unique IS.",
        "These cases of focus ambiguity have been discussed extensively in the literature and will be briefly reviewed in sec. 2.",
        "The existing HPSG account of IS by Engdahl/Vallduvi (1994) generates a disjunction of alternative sentence analyses for ambiguous sentences.'",
        "Since focus ambiguity multiplies with all other kinds of ambiguity, a disjunctive treatment makes the use of IS in computational applications unattractive.",
        "Therefore, an underspecified representation of IS is proposed in this paper (sec.",
        "3) along with a resolution routine on the basis of context information (sec.",
        "4).",
        "Finally, the linguistic principles that compose the representation are worked out in HPSG (sec.",
        "5).",
        "The data discussed are German, but English is very similar."
      ]
    },
    {
      "heading": "2 Focus marking",
      "text": [
        "The basic data are well-known.'",
        "A pitch accent on a direct object like Buell, in (7), can serve to mark a number of constituents as focused: (8).5 The focus feature is usually assumed to project.",
        "(7) Karl hat ein Been gelesen.",
        "Karl has a book read (8) a. Karl hat [ein Buc0]r gelesen.",
        "b. Karl hat [ein HUGH gelesenit, c. [Karl hat ein Buell gelesenIF",
        "A pitch accent on the subject Karl however cannot project focus (9), neither do adjuncts project focus (10).",
        "(12) F Projection a. F-marking of the head of a phrase licenses the F-marking of the phrase.",
        "b. F-marking of an internal argument of a head licenses the F-marking of the head.",
        "According to these rules, the head itself can project focus, which appears to be refuted by data like the following.",
        "(13) Karl hat ein Buch [GELEsENIF",
        "However, (13) can have a wider focus if books are contextually given (this effect has been called deaccenting).",
        "Note the difference between (14) and (15), both marked according to (11) and (12): although their maximal focus domain is identical, cin Duch is F-marked only in (15).",
        "(14) Karl hat [ein Duch [cEixsEN.",
        "]1;11,, (15) Karl hat [[ein Bucii]1, [gelesen.]",
        "This is reflected in Schwarzschild's (1995) interpretation of the F-feature.",
        "All constituents that are not F-marked need to be given, where givenness is defined as entailment by prior discourse.",
        "Entailment is extended to expressions of other type than propositions by existentially binding unfilled arguments.?",
        "Even non-F-marked constituents embedded in an F-marked constituent, like ein Buch in (14) have to pass this givenness filter.",
        "So, deaccenting is no longer a special case for the theory.",
        "To restrict the optional focus projection from (12) further, Schwarzschild assumes an additional pragmatic filter Avoid F that selects the tree with the least F-marking.8 Non-F-marked constituents that contain F-marked subconstituents need to be given as well, The context has to entail their F-skeleton -- the \"The exact definition is as follows ((Schwarzschild, 1995), pp.",
        "5-6.",
        "): An expression T (for target) is GIVEN iff it has an antecedent, A, such that the existential closure of A entails the result of existentially binding F-variables in the existentially closed F-skeleton of 'I' [where the existential quantifier binding F-variables quantifies over contextually salient values].",
        "The F-skeleton of an expression is the result of replacing F-marked elements with variables (working top to bottom).",
        "The existential closure of an expression is the result of existentially binding all unfilled arguments of the expression.",
        "if a is type t, ExClo(a) = a. if a is of con joinable type (a, b), ExClo(cr) = xa[ExClo(a(x„))].",
        "if a is type e, ExClo(a) = al-'(,,t)[P(a)].",
        "81 consider the status of this filter somewhat problematic.",
        "Why should a tree with less F-marking be pragmatically preferred?",
        "One could as well argue that since a sentence should be as informative as possible, given constituents should be avoided.",
        "The underspecified account developed here recasts Schwarzschild's ideas in a way that makes Avoid F redundant.",
        "result of replacing embedded F-marked elements with variables.9 This condition allows to explain data like (16) - a puzzle for theories based on the question test for focus (cf. fn.",
        "5 above).",
        "(16) A: Paula hat eine rote Rose fotografiert.",
        "Paula has a red rose photographed Was hat sie davor getan?",
        "What has she before done B: Sie hat eine [WEISSE]F Rose fotografiert.",
        "She has a white rose photographed A's question leads to expect focus marking of the complete VP, but intonational marking plus projection rules produce a narrow focus on weifle.",
        "Schwarzschild (1995) predicts the indicated F-marking, since the F-skeleton of the NP eine weifle Rose, for instance, (a X rose) is actually entailed by the context.",
        "While non-F-marked constituents have to be given, F-marked constituents need not necessarily be new.",
        "This is to account for data like the following, where ihn in (17B) is given:",
        "(17) A: Wen hat Peters Mutter gelobt?",
        "Whom has Peter's mother praised?",
        "B: Sie hat [llirs]r gelobt.",
        "She has him praised The indicated F-marking follows from the theory: there has to be some F-marking, since the meaning of the complete sentence (Peter's mother praised Peter) is not entailed by the context.",
        "The F-skeleton variant Peter's mother praised X is actually entailed by the question (17A), thus the F-marking of ihn."
      ]
    },
    {
      "heading": "3 An underspecified representation",
      "text": [
        "In computational applications, a compact representation is a prerequisite for any successful treatment of IS.",
        "Take the following short sentence with two pitch accents.",
        "(18) Die Direktorin der Firma MULLER BEGRUSST The director of company Wier welcomes ihren Besuch.",
        "her visit/visitors Even if functional elements are ignored, the rules in (12) produce nine alternative F-markings that have to be checked against the context for givenness.",
        "In order to resolve the lexical ambiguity of Besuch however (cf. the discussion of (5) above), some partial information about IS suffices.",
        "The representation developed here is relatively independent of the underlying semantic theory of focus.",
        "Two semantical partitions for focus (FOC) and background (BG) are assumed, each of them a set of semantic conditions.",
        "Underspecification is expressed in a graphical way.",
        "The interpretationi° °There is some affinity to the f-semantic value in Rooth's (1985) alternative semantics, although the specific details arc different.",
        "mThe interpretation is given informally in the following examples.",
        "of each syntactic constituent forms a node in the graph, while the directed edges express accessibility relations.",
        "The solid line arrows signify obligatory inclusion in the respective IS partition, the dashed line arrows defeasible inclusion.",
        "The VP can, e.g., either belong to FOC (via a chain of arrows) or to 13G.",
        "The graph in (20) represents the amount of information that is encoded on sentence level without reference to context.",
        "Additional knowledge may introduce further solid arrows.",
        "If, e.g., a begriiflen event is contextually given (like in a question Who greets whom?",
        "), the arrow from begriiflt to BG will become an obligatory arrow.",
        "This arrow again will overrule the dashed arrow from begrafit to ihren Besuch.",
        "Since the latter was the only path to access the FOC partition, the complete graph will collapse into a fully specified representation of IS.",
        "Resolution will be dealt with in more detail in sec. 4.",
        "The principles composing the representation are worked out formally in sec. 5.",
        "Here is an intuitive overview: the arrows pointing directly to the FOC and BG partition originate from accenting or non-accenting of the single words, respectively.",
        "The additional arrows between the constituent nodes are introduced by the grammatical principles of F-projection - irrespective of the actual prosodic marking.",
        "This becomes clear when we regard the following alternative prosodic marking of (19): (21) MARIA BEGRUSST ihren Besuch.",
        "Maria begriiflt ihren Besuch ss, begriifft 'ihren Besuch ss, ihren Maria Besuch BC FOC Note that here, the dashed arrow from begriiflt to ihren Besuch is overruled right away, since the accented begriiflt is strictly tied to FOC.",
        "The",
        "phrase ihren Besuch is forced into the 13G partition, thus the utterance is correctly predicted to be restricted to contexts where Besuch is given.",
        "As anticipated above in the discussion of the lexical ambiguity involved, this conclusion can be drawn even if other points remain underspecified."
      ]
    },
    {
      "heading": "4 Resolution",
      "text": [
        "An underspecified IS arising from the prosodic marking of a sentence can be resolved by information from the context.",
        "As noted above, entailment by context introduces additional solid line arrows.",
        "To cover more than just trivial cases, the counterpart of Schwarzschild's (1995) F-skeleton has to be kept track of in the underspecified representation.",
        "At first glance, this seems to be incompatible with the idea of underspecification, since the F-skeleton that is checked against the context for entailment requires settlement on what the actual F-marking is.",
        "For instance, to check the givenness of the VP in (23), reads a book about X has to be entailed, whereas on the basis of the marking in (24), reads Y has to be entailed.",
        "(23) Franz liest ein Buch fiber [Scinymiu, Franz reads a book about ships (24) Franz liest [ein Buch fiber [ScuirrEluir",
        "The solution lies in the observation that the latter F-skeleton entails the former.",
        "So, when a certain constituent (e.g., again the VP in the above examples) is checked for givenness, it suffices to assume F-marking of the maximal potentially F-marked subconstituents (I call this the maximality assumption).",
        "If it turns out that the actual F-marking is more restricted, this will be detected at a lower level.",
        "For example, if (23) is the right solution, this will be discovered even if reads a book about X is not checked, since in this case, a book about X will be contextually given as well.",
        "To illustrate resolution in the graph representation, take the following example in context:",
        "(25) a. Anna hat Otto fotografiert.",
        "b. HANs hat Otto ein Buell gegeben.",
        "Hans has to-Otto a book given",
        "The nodes are now labelled by pairs.",
        "The first element of a pair is the semantic value of the constituent corresponding to the node (here again expressed informally in natural language); the second element is the F-skeleton based on the maximality assumption – the F-skeleton is obtained by (i) replacing the maximal F-marked subcon-stituents (or sister constituents, in the case of indirect F-marking of the head, following (121))) by a variable, (ii) existentially binding unfilled arguments, and (iii) existentially quantifying over the variables from the F-skeleton (cf. also fri. 7).",
        "The latter quantification is restricted by the set of contextually salient values C. In resolving underspecification from context, it is checked for each node with access to the BG partition\"- whether its F-skeleton is entailed by an antecedent in the context.",
        "For gegeben and the lowest verb projection ein Duch gegeben, there is no such antecedent in the context.",
        "However, for the VP Otto ein Duch gegeben the VP from (25a) Otto JO-tografiert is a suitable antecedent: after existential binding, (1x) fotografieren(x,Otto) entails PR E C)(1r) [R(x,Otto)].",
        "Similarly for the complete sentence: fotografieren(Anna,Otto) entails (PP, u E C)[P(u)].",
        "So, solid line arrows replace the two dashed arrows pointing to 13G (suggested in (26) by the longer dashes).",
        "The status of the lower verb projections in (26) is still underspecified.",
        "If a wider context was considered, antecedents could possibly be found, so it makes sense to end up with such a representation after processing the discourse (25).",
        "Once we know that all salient context has been considered, a rule of Focus Closure is applied.",
        "This strengthens the arrows pointing towards FOG for all unresolved constituents, predicting ein Buch gegeben as the focus for the example.",
        "In an application, heuristics may trigger Focus Closure earlier, to avoid unneccessary inferences.",
        "The representation proposed here conies close to Schwarzschild's (1995) theory of F-marking in coverage,' avoiding the computationally expensive disjunction of alternative analyses in favour of a single graph representation that is underspecified when based on sentence internal infor\"Constraining the givenness check to nodes with access to the BC, partition makes sure that narrow (contrastive) focus on given entities (like in (17)) is treated correctly.",
        "Since an accent on a word introduces just an arrow towards FOC, narrow focus on a word survives the check even in cases where the word is given.",
        "12 For examples with several ambiguous accents, the modified account collapses some F-markings with minimal differences in interpretation into one.",
        "For instance, two of the twelve F-markings for (i) are indistinguishable: (ii) and (iii).",
        "A context that would enforce the latter in Schwarzschild's theory produces (ii) in the underspecified account.",
        "mation only.",
        "Furthermore, Schwarzschild's pragmatic condition Avoid F that selects the analysis with the least F-marking (cf. fn.",
        "8) is no longer needed."
      ]
    },
    {
      "heading": "5 HPSG principles",
      "text": [
        "The representation proposed in sec. 3 and 4 can be implemented directly in a sign-based formalism like HPSG.",
        "In this section, the central composition principles for German are worked out.",
        "A binary branching structure is assumed.",
        "Again, the representation will be fairly open as to which particular semantic formalism is chosen.",
        "This is reflected in the Semantics Principle I assume, which specifies the semantic value of a phrase as the application of a two-place function compose to the semantic values of both daughters.",
        "The function can be spelt out in different ways depending on the choice of a semantic theory.\" Furthermore, a function variable is assumed that maps a semantic object to a new variable of the same type.",
        "The HPSG type cont (the value of the coNT(ENT) feature) has the following four new features: 0-SEM (`ordinary semantics') and F-SKEL (F-skeleton) of the type of a semantic object, the set-valued IS-CSTR (IS constraints) and the binary MAX-F (for potential maximal focus).",
        "The phonological information is enriched by a feature PROM (prominence) with values accented and unaccented.",
        "The following principles specify the IS-CSTR set for a sign, introducing arrows, or links, between",
        "However, such a context is quite intricate to construct.",
        "Here is an example: (iv) Der Direktor der Firma ABC sail im Café.",
        "The director of company ABC sat in-the cafe Der Kellner begrinite eine Bekannte.",
        "The waiter greeted a friend Context (iv) does not entail der Direktor der X begrUfite Y, so (ii) is ruled out according to Schwarzschild's system.",
        "The resolution process proposed in this paper is based on the maximality assumption, and thus checks givenness for the complete sentence only once, with the complete subject F-marked.",
        "To rescue the difference between (ii) and (iii), it would have to be enforced that resolution of the subject NP takes place before the resolution of the focus projected from the object.",
        "This is a conceivable solution - however, declarative perspicuity would be sacrificed for a very moderate benefit, considering the main point of this paper.",
        "\"In the example below, simple predicate-argument semantics is used for illustration.",
        "semantic objects.",
        "(The IS partitions foe and bg are here also treated as semantic objects.)",
        "The h_link relation corresponds to the obligatory (solid line) arrows in the graphs, s_link reflects defeasible (dashed line) arrows.",
        "In the following, the link relations are expressed verbally.",
        "(27) is the counterpart to (11); (28) and (29) reflect clauses (12a) and (12b).",
        "The 0-SEM value of a pitch accented word is h_linked to foe.",
        "The 0-SEM value of a phrase is s_linked to the 0-SEM value of its head daughter.",
        "In a head-complement-structure, where none of the head daughter's arguments have yet been saturated,14 the 0-SEM of the head daughter is s_linked to the 0-SEM value of the complement daughter.",
        "These three principles establish direct or indirect links towards foe.",
        "For the constituents that are not obligatorily focus marked, the underspecified representation requires additional defensible links to bg:",
        "The O-SEM value of every sign that is not accented is s_linked to bg.",
        "The principles just presented compose the representation introduced in sec. 3, with the nodes in the graph corresponding to the 0-SEM values.",
        "To provide the input for the resolution routine, the representation was enriched in sec. 4 by the F-skeleton.",
        "This is kept track of in the F-SKEL feature (assuming independent existential binding of unfilled arguments and free variables)."
      ]
    },
    {
      "heading": "(31) F-Skeleton Instantiation",
      "text": [
        "The F-SKEL value of a word with [o-sEM a] is (i) the function variable(a), if cx is h_linked to foe; (ii) a, if the word is marked [MAX-I,' – [;15 (iii) composition(a,0) (where Q is the F-SKEL value of the word's complement), if the word is marked [mAx-r -E], but a is not h_linked to foe."
      ]
    },
    {
      "heading": "(32) F-Skeleton Principle",
      "text": [
        "The F-SKEL value of a phrase is the function compose applied to (i) the F-SKEL value of a daughter with [MAX-F – ]; or (ii) the function variable(a) of a daughter with [MAX-r +] and [o-sEm a]; for both daughters.",
        "14 This formulation will be subject to changes once there is a clear concept of integration (cf. fn.",
        "6) - (29) applies to integrated constituents.",
        "\"The feature MAX-F is actually redundant.",
        "It has been introduced for convenience, signifying that a chain of links to foe exists - a condition that could be checked directly in the graph.",
        "But it does not hurt much to carry the feature along in the principles (27) - (29).",
        "der [SPARKASSE]F]F begriiffte",
        "A sample analysis for (33), a slight simplification of (25b), is given in fig 1.",
        "The graph produced by the linking constraints is the one in (26).",
        "(33) (Ich weif3, da13) HANS Otto ein Bucn gab.",
        "I know that Hans to-Otto a book gave Let us briefly see how the principles interact to produce the phrase ein Buch gab (For simplicity, the NP is treated as if it was a word).",
        "Since ein Buch bears a pitch accent, the Focus Linking Principle (27) applies, introducing an obligatory link to FOC (h_link(11, foe)).",
        "For the unaccented gab, the Background Linking Principle applies, giving rise to a defeasible link (s_link(El,bg)).",
        "At phrase level, the Indirect Head F-Marking Principle (29) and the Head F-Marking Principle apply (introducing ,sdink(0,1=1) for the head, and s_link011, lip for the phrase, respectively).",
        "In addition, (27) applies again: s_link(11,bg).",
        "As for the F-Skeleton, subclause (i) of (31) applies at ein Buch, subclause (iii) at gab, causing the function compose to apply to gab's own semantic value and to its sister's F-SKEL value.",
        "The phrase is covered by (32), where both daughters are marked [MAX-F +] and thus fulfil subclause (ii)."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "This paper shows that a fully expressive underspecified representation of IS can be effectively composed by linguistic principles, circumvening the computational problems that the disjunctive analyses of existing theories pose.",
        "Also, a resolution routine was presented.",
        "The idea is to leave ein Bucli gab HPSG analysis the representation underspecified in applications, unless resolution is required for a specific reason."
      ]
    }
  ]
}
