{
  "info": {
    "authors": [
      "Willem J. M. Levelt"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-1002",
    "title": "A Theory of Lexical Access in Speech Production",
    "url": "https://aclweb.org/anthology/C96-1002",
    "year": 1996
  },
  "references": [],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "The generation of words in speech involves a number of processing stages.",
        "There is, first, a stage of conceptual preparation; this is followed by stages of lexical selection, phonological encoding, phonetic encoding and articulation.",
        "In addition, the speaker monitors the output and, if necessary, self-corrects.",
        "Major parts of the theory have been computer modelled.",
        "The paper concentrates on experimental reaction time evidence in support of the theory.",
        "Central to the skill of speaking is our ability to select words that appropriately express our intentions, to retrieve their syntactic and phonological properties and to compute the ultimate articulatory shape of these words in the context of the utterance as a whole (2).",
        "In the multi-stage theory of word production (3) the first stage, conceptual preparation, involves activating a lexical concept, given the intention.",
        "In picture naming, for instance, there is no \"hard-wired\" link between the object depicted and the ultimate referential expression.",
        "The same object can be veridically referred to by a multitude of different terms.",
        "The mediating process here is called perspective taking.",
        "Its output is a lexical concept, i.e., a concept for which there is a word in the speaker's mental lexicon.",
        "In the computational model, lexical concepts figure in a semantic, spreading-activation network.",
        "The lexical concept is input to a process called lexical selection.",
        "Lexical concepts spread their information to lemmas in the mental lexicon.",
        "Lemmas are syntactic words.",
        "The probability that a lemma is selected within a minimal time interval is its relative activation (following Luces choice rule).",
        "From this hazard rate expected retrieval times can be computed for various experimental conditions.",
        "These predictions find solid experimental support (5).",
        "A selected lemma spreads its activation to the word's phonological code.",
        "The speed of accessing this code is word-frequency dependent (1).",
        "During phonological encoding the segmental and metrical features of the word's phonological code are \"spelled out\".",
        "The metrical structures of adjacent words may get combined to compute larger-size metrical units, so-called phonological words.",
        "The spelled-out segments are incrementally (\"from left to right\") attached to the metrical frame, on the fly creating the phonological word's syllabification.",
        "In phonetic encoding an articulatory gesture is computed for each phonological syllable as it comes available.",
        "This process probably involves a syllabary, a store of high-frequent syllabic gestures (4).",
        "Articulation can be initiated as soon as all of a word's syllabic gestures have been prepared.",
        "A speaker self-monitors conceptual preparation, acoustic output, but also an intermediary level of representation, namely the syllabified phonological word (2, 6)."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
