{
  "info": {
    "authors": [
      "Jung H. Shin",
      "Young S. Han",
      "Key-Sun Choi"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-1040",
    "title": "Bilingual Knowledge Acquisition from Korean-English Parallel Corpus Using Alignment",
    "url": "https://aclweb.org/anthology/C96-1040",
    "year": 1996
  },
  "references": [
    "acl-C90-3031",
    "acl-J93-2003",
    "acl-J96-1002",
    "acl-P91-1034"
  ],
  "sections": [
    {
      "heading": "email: jhshinstissbs.kordic.re.kr Abstract",
      "text": [
        "This paper suggests a method to align Korean-English parallel corpus.",
        "The structural dissimilarity between Korean and Indo-European languages requires more flexible measures to evaluate the alignment candidates between the bilingual units than is used to handle the pairs of Indo-European languages.",
        "The flexible measure is intended to capture the dependency between bilingual items that can occur in different units according to different ordering rules.",
        "The proposed method to accomplish Korean-English alignment takes phrases as an alignment unit that is a departure from the existing methods taking words as the unit.",
        "Phrasal alignment avoids the problem of alignment units and appease the problem of ordering mismatch.",
        "The parameters are estimated using the EM algorithm.",
        "The proposed alignment algorithm is based on dynamic programming.",
        "In the experiments carried out on 253,000 English words and its Korean translations the proposed method achived 68.7% in accuracy at phrase level and 89.2% in accuracy with the bilingual dictionary induced from the alignment.",
        "The result of the alignment may lead to richer bilingual data than can be derived from only word-level aligments."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Studies on parallel corpus consisting of multilingual texts are often guided with the purpose to obtain linguistic resources such as bilingual dictionary, bilingual grammars (Wu 1995) and translation examples.",
        "Parallel texts have proved to be useful not only in the development of statistical",
        "in other applications such as word sense disambiguation (Brown et al.",
        "1991) and bilingual lexicography (Klavans and Tzoukerrnann 1990).",
        "As the parallel corpora become more and more accessible, many researches based on the bilingual corpora are now encouraged that were once considered impractical.",
        "Alignment as a study of parallel corpus refers to the process of establishing the correspondences between matching elements in parallel corpus.",
        "Alignment methods tend to approach the problem differently according to the alignment units the methods adopt.",
        "Of various alignment options, the alignment of word units is to compute a sequence of the matching pairs of words in a parallel corpus.",
        "Figure 1 show the aligned results of a parallel corpus that was originally paired in a sentence level.",
        "In figure 1, the right-hand side of pairwise alignment is the corresponding Korean words.",
        "Described in the parentheses on the right of each Korean word are corresponding English meaning and syntactic functions of the word.",
        "The existing methods for the alignment of indo-European language pairs such as English and French take words as aligning units and restrict the correspondences between words to be one of the functional mappings (one-to-one, one-to-The",
        "many) (Brown et al.",
        "1993, Smadja 1992).",
        "These methods made extensive use of the position information of words at matching pairs of sentences, which turned out useful (Brown et al.",
        "1993).",
        "The structural similarity in word order and units between English and French must be one of the major factor to the success of the methods.",
        "The alignment of the pairs of structurally dissimilar languages such as Korean and English re.",
        "quires different strategy to compensate the lack of structural information such word order and to handle the difference of alignment units.",
        "An early attempt to align Asian and Indo-European language pairs is found from the work by Wu and Xia (1994).",
        "Their result is promising with the demonstration of high accuracy of learning bilingual lexicon between English and Chinese for frequently used words without the consideration of word order.",
        "'the Chinese-English alignment consists of segmentation of an input.",
        "Chinese sentence and aligning the segmented sentence with the candidate English sentence.",
        "The generation of segments to be aligned is an additional problem to the decision of aligning units before the alignment takes place.",
        "Wu and Xia (1994) used bilingual dictionary to segment the sentence, but the selection of segment candidates is hard to make with reliable accuracy.",
        "The bilingual dictionaries arc not always available and take considerable resources to build.",
        "'['lie method we suggest integrates the procedures to solve the two critical problems: deciding aligning units and aligning the candidates of different word orders and accomplishes the alignment without using any dictionary.",
        "The proposed alignment method assumes a preprocessing step before iterative applications of alignment step as is illustrated in figure 2.",
        "Part-ofl-speech tagging is done before the actual alignment so that the word-phrases (a spacing unit in Korean) may be decomposed into proper words and functional morphemes and the Korean and English words may be assigned with appropriate tags.",
        "l'he proposed alignment is clone first for phrase pairs and then word pairs that eventually induces the bilingual dictionary.",
        "The alignment method is realized through the reestimation of its probabilistic parameters from the aligned sentences.",
        "In particular, the parameters account.",
        "for the coocur-rence probilities of bilingual word pairs and phrase pairs.",
        "The repetitive application of the alignment and reestimation leads to a convergent stationary state where the training stops.",
        "In the following section, our proposed method for aligning Korean-English sentences is described and parameter reesti nation algorithm is ex-planted.",
        "Section 3 summarizes the results of experiments and Conclusion is given in section 4."
      ]
    },
    {
      "heading": "2 Korean/English Alignment",
      "text": []
    },
    {
      "heading": "Model 2.1 English/French alignment model",
      "text": [
        "define p(f le); the probability of the French sentence f given the English sentence e, Brown et, al.",
        "(1991) adopted the translation model in which each word in e acts independently to produce the words in f. When a typical alignment is denoted by a, the probability of f given e can he written as the sum over all possible alignments (Brown et 1991) p(f le) =p(f, ale)( l) a Given an alignment a between e and f, Brown et al.",
        "(1991) has shown that one can estimate p(f , ale) as the product, of the following three terms (Berger et al.",
        "1995).",
        "In the above equation, p(n lc) denotes the probability that the English word e generates n French words and p(fle) denotes the probability that the English word e generates the French word f. d(f, ale) represents the distortion probability that, is about how the words are reordered in the French output.",
        "In the above methods, only one English word is related to one or n French words.",
        "'File distortion probabilities are defined on the positional relations such as absolute or relative positions of matching words."
      ]
    },
    {
      "heading": "2.2 Characteristics of Korean/English alignment",
      "text": [
        "Unlike the case of English-Erench alignment, Korean and English have different word units to",
        "TableThe result of manual analysis about matching unitP(elk)P( he aligned, for an English sentence consists of words whereas a Korean sentence consists of word-phrases (compound words).",
        "Typically a word-phrase is composed of one or more content words and postpositional function words.",
        "A Korean word is usually a smaller unit than an English word and a word-phrase is larger than an English word.",
        "For this reason the exact match as in English-French pair is hard to establish for the case of Koean- English (Shin et al.",
        "1995).",
        "Consequently word-to-word or word-to-word-phrase alignment between Korean and English will stiffer from unit mismatch and low accuracy.",
        "The complication of unit mismatch often implies the need of non-functional alignment such as many-to-many mapping.",
        "Non-functional mapping may also occur in the English-French case, but with much less frequency.",
        "The table 1 shows the degree of mismatch between English words and Korean words that are analyzed by our automatic POS tagger and 'morphological analyzer.",
        "When we checked randomly selected 200 sentence pairs by hand, only 33.8% of all pairs have one-to-one correspondences between English words and Korean words."
      ]
    },
    {
      "heading": "2.3 Korean to English Alignment",
      "text": [
        "In this section, we propose a Korean to English alignment method that aligns in both word and phrase levels at the same time.",
        "First, we introduce the method in word-to-word alignment, and then extend it to include phrase-to-phrase alignment.",
        "By definition, a phrase in this paper refers to a linguistic unit of more general structure than it is recognized in general from the terms, noun and adverb phrases.",
        "A phrase is any arbitrary sequence of adjacent words in a sentence.",
        "word-to-word correspondences) In the development of our method, we follow the basic idea of statistical translation proposed by Brown et al.",
        "(1993).",
        "To every pair of sentences of e and k, we assign a value p(elk), the probability that a translator will produce e as its translation of k, where e is a sequence of English words and k is a sequence of Korean words.",
        "In equation 3, n and rn are the number of words in the English sentence e and its corresponding Korean sentence k respectively.",
        "ei and ki are the aligning unit between English sentence e and Korean sentence k. of represents j-th word in English sentence and k represents i-th word in Korean sentence.",
        "For example, in Figure 1 English word \"the\" is eland Korean word \"ku\" is",
        "The base method of word level alignment is extended with phrase-level alignment that overcomes the difference of matching unit and provides more opportunity for the extraction of richer linguistic information such as phrasal-level bilingual dictionary.",
        "To cope with the data sparseness problem caused by considering all possible phrases, we represent phrases by the tag sequences of their component words.",
        "If an English sentence e and its Korean translation k are partitioned into a sequence of phrases pc and pk of all possible sequences s(e, k), we can write P(elk) as in equation 5 where pc and pk are phrase sequences and a(pe, pm) denotes all possible alignments between pc and pk.",
        "If we represent the phrase-to-phrase correspondences using the tag sequence of phrase and words composing phrase, The equation 5 can be rewritten as in equation 6 letting phrase match be represented by the tag sequence of phrases as well as words.",
        "In equation 6, kip' is j-tli phrase of kPk , and ./(kPk) denotes the tag sequence of words composing phrase k 31!'",
        "I'M is the iu of phrases in a phrase sequence pc.",
        "The likelihood of all alignable cases within bilingual phrase is defined as in equation 7, where",
        "Figure :1 shows how the problem of word unit mismatch can be dealt with in the phrase level alignment.",
        "In the example, cP\"(The house) (is gradually disintegrating) (with age), and ciL'\"(The house), The,= (detertallICI.'",
        "noun),(ku cip-un), kiii === kn respectively."
      ]
    },
    {
      "heading": "2.4 Parameter reestimation",
      "text": [
        "With the constraint, that the sum over all alignments should be 1, the reestiination algorithm call be derived to give equation 8 for word translation probability and equation I() for phrase correspondence probability.",
        "This process, when applied repeatedly, must give a locally optimal estimation of the parameters following the principle of the EM algorithm (Brown et al.",
        "I993)( Dempster et al.",
        "1977).",
        "k('ik)< condition> denotes the alignment candidates that satisfies < emu/Rion >.",
        "For calculating Meik), only constant t cases of alignments need to be considered in the proposed alignment algorithm because most alignment candidates have very low probability that they may be ignored.",
        "total expected mnaer of e given k. expected number of given A,",
        "Let us call the expected number of' times, that k matches with c in the corresponding sentence k and e, the count of' e given k. IV using the notation c(( 1k), the reestimation [(militia of p(c1k) call be induced as equation 8 using EM method.",
        "When we denote c(1. k) the expected number of ti Ines that, a tag sequence of English phrase corresponds to a tag sequence of Korean phrase as in equation I. I.",
        "'lien the reestimation algorithm of' is given as in equation 10.",
        "expected number of t given tk total expected number of t given",
        "t'or the extended method of phrase alignment, the base model is an intermediate stage for the estimation of word-to-word probabilities.",
        "The phase-to-plirase probabilities are reestimated upon the initial values of word-to-word probabilties."
      ]
    },
    {
      "heading": "2.5 Alignntent algorithm",
      "text": [
        "The alignment process of generating Korean phrases and selecting their matching phrases in English can be formulated around the principle of dynamic programming.",
        "The probability value defined in equation 0 and 7 is used to compute matching probability' of p(ki,) and kci,b).",
        "p(ei,b) stand for the phrase composed of b number of words from j-th word in a sentence.",
        "is used to keep the selected phrase sequence up to i-th word and (pi denotes its score.",
        "N and M are number of' words of Korean sentence and English sentence respectively.",
        "The constant value I is defined as maximum number of words which consist, of a phrase.",
        "a((11,.)",
        "is a in (h, =b) Although the alignment algorithm described above with the complexity of' 0(1,2 N) is simple and efficient, this algorithm has the limitation caused by the assumption of dynamic programming.",
        "The dynamic programming in the context of alignment assumes that the previous",
        "selections do not interfere with the future decisions.",
        "The alignment decision, however, may depend on the .previous matches to the extent that the results from dynamic programming may not be sufficiently accurate.",
        "One popular solution is to maintain upper t-best cases instead of just one as following where rnax-t denotes the t-th max candidate.",
        "A.s a result, the running complexity of the proposed algorithm becomes 0(712 M N).",
        "Taking T and L as constants, the order of complexity becomes 0(M N).",
        "As another method to relax the problem of decision dependency on the previous matches, preemptive scheme to find max matching of phrase k,i, is adopted.",
        "In the preemptive alignment, the previous selection can be rematched with the better selection found by later decision.",
        "In following algorithm, e(k,i,a,n) denote ej,b which has nth highest matching value with Korean phrase ki , among all possible matching Korean phrase and v(ki ,n) carry the weight for the matching.",
        "indicate matched Korean phrase with ei,b in current status and i9j,b denote their matching weight.",
        "The established matching in previous stage can be changed when another matching, which has Niger matching weight, is identified in this algorithm.",
        "Although the proposed algorithm can not cover all possible alignment cases, the proposed algorithm produces resonably accurate alignment results efficiently as is demonstrated in the following section."
      ]
    },
    {
      "heading": "2.6 Experiments",
      "text": [
        "The total training corpus for our experiments consists of 254,100 English words and 178,300 Korean word-phrases.",
        "The content of training corpus is summarized in table 2.",
        "A IIMM Part-of-Speech tagger is used to tag words before alignments.",
        "An accurate IIMMI designed by the authors for Korean sentences taking into account the fact that a Korean sentence is a sequence of word-phrases is used (Shin et al.",
        "95).",
        "The Penn Treebank POS tagset that is composed of 48 tags and 52 Korean tagset is used in the tagging.",
        "The errors that is generated by morphological analysis and tagging cause many of the alignment errors.",
        "To avoid the noise due to the insufficient bilingual sentences, we adopted two significance filtering methods that were introduced by Wu and Xia (1994).",
        "First, the Korean sentences consisting of words with more than 5 occurrences in the corpus are considered in the experiment.",
        "Second, we selected the English words that accounts for the top 0.80 of the translation probability density given a Korean word.",
        "When we selected 200 sentence pairs randomly and manually tested aligned results, we obtained 68.7% precision at the phrase level and 89.2% precision of bilingual dictionary induced from the alignment.",
        "The table 3 and 4 illustrate the bilingual knowledge acquired from the aligned results.",
        "The information in table 4 is the unique product of phrase-level alignment."
      ]
    },
    {
      "heading": "3 Conclusion",
      "text": [
        "With the alignment of Korean-English sentences, the most serious problem, that is seldom found at Indo-European language pairs, is how to overcome the differences of word unit and word order.",
        "The proposed method is an extension of word level alignment and solves the problems of word unit mismatch and word order through phrase level alignment.",
        "We have also described several alternatives of alignment and parameter estimation.",
        "ey kwansim i issinterested in maywu kupkyekvery fast ha ko ttoand dangerous moscianh keydangerous wuihemas anything else It produces more accurate bilingual dictionary than the method using only word correspondence information.",
        "Moreover, we can extract phrase-level information from the results of phrase level alignment.",
        "Also in the proposed method, the whole process of generating phrase, units and finding matching phrases, is done mechanically without human intervention.",
        "One negative aspect is that the method requires large amount of training corpus for the saturated estimation of the model though larger data will increase the accuracy of the performance.",
        "The proposed method may well be applied to other language pairs of similar structures as well as dissimilar ones.",
        "Since the results from the method are richer with linguistic information, other applications such as machine translation and multilingual information retrieval are promising research areas."
      ]
    }
  ]
}
