{
  "info": {
    "authors": [
      "Richard W. Sproat",
      "Michael D. Riley"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P96-1029",
    "title": "Compilation of Weighted Finite-State Transducers from Decision Trees",
    "url": "https://aclweb.org/anthology/P96-1029",
    "year": 1996
  },
  "references": [
    "acl-H89-2048",
    "acl-H94-1050",
    "acl-J94-3001",
    "acl-P95-1002",
    "acl-P95-1037",
    "acl-P96-1031"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We report on a method for compiling decision trees into weighted finite-state transducers.",
        "The key assumptions are that the tree predictions specify how to rewrite symbols from an input string, and the decision at each tree node is stateable in terms of regular expressions on the input string.",
        "Each leaf node can then be treated as a separate rule where the left and right contexts are constructable from the decisions made traversing the tree from the root to the leaf.",
        "These rules are compiled into transducers using the weighted rewrite-rule rule-compilation algorithm described in (Mohri and Sproat, 1996)."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Much attention has been devoted recently to methods for inferring linguistic models from data.",
        "One powerful inference method that has been used in various applications are decision trees, and in particular classification and regression trees (Breiman et al., 1984).",
        "An increasing amount of attention has also been focussed on finite-state methods for implementing linguistic models, in particular finite-state transducers and weighted finite-state transducers; see (Kaplan and Kay, 1994; Pereira et al., 1994, inter alia).",
        "The reason for the renewed interest in finite-state mechanisms is clear.",
        "Finite-state machines provide a mathematically well-understood computational framework for representing a wide variety of information, both in NLP and speech processing.",
        "Lexicons, phonological rules, Hidden Markov Models, and (regular) grammars are all representable as finite-state machines, and finite-state operations such as union, intersection and composition mean that information from these various sources can be combined in useful"
      ]
    },
    {
      "heading": "Michael Riley AT&T Research 600 Mountain Avenue Murray Hill, NJ, USA rileyOresearch.att.com",
      "text": [
        "and computationally attractive ways.",
        "The reader is referred to the above-cited papers (among others) for more extensive justification.",
        "This paper reports on a marriage of these two strands of research in the form of an algorithm for compiling the information in decision trees into weighted finite-state transducers.' Given this algorithm, information inferred from data and represented in a tree can be used directly in a system that represents other information, such as lexicons or grammars, in the form of finite-state machines."
      ]
    },
    {
      "heading": "2 Quick Review of Tree-Based Modeling",
      "text": [
        "A general introduction to classification and regression trees ('CART') including the algorithm for growing trees from data can be found in (Breiman et al., 1984).",
        "Applications of tree-based modeling to problems in speech and NLP are discussed in (Riley, 1989; Riley, 1991; Wang and Hirschberg, 1992; Magerman, 1995, inter alia).",
        "In this section we presume that one has already trained a tree or set of trees, and we merely remind the reader of the salient points in the interpretation of those trees.",
        "Consider the tree depicted in Figure 1, which was trained on the TIMIT database (Fisher et al., 1987), and which models the phonetic realization of the English phoneme /aa/ (/a/) in various environments (Riley, 1991).",
        "When this tree is used in predicting the allophonic form of a particular instance of /aa/, one starts at the root of the tree, and asks questions about the environment in which the /aa/ is found.",
        "Each non-leaf node n, dominates two daughter nodes conventionally labeled as 2n and 2n + 1; the decision on whether to go left to 2n or right to 2n + 1 depends on the answer to the question that is being asked at node n.",
        "A concrete example will serve to illustrate.",
        "Consider that we have /aa/ in some environment.",
        "The first question that is asked concerns the number of segments, including the /aa/ itself, that occur to the left of the /aa/ in the word in which /aa/ occurs.",
        "(See Table 1 for an explanation of the symbols used in Figure 1.)",
        "In this case, if the /aa/ is initial – i.e., lseg is 1, one goes left; if there is one or more segments to the left in the word, go right.",
        "Let us assume that this /aa/ is initial in the word, in which case we go left.",
        "The next question concerns the consonantal 'place' of articulation of the segment to the right of /aa/; if it is alveolar go left; otherwise, if it is of some other quality, or if the segment to the right of /aa/ is not a consonant, then go right.",
        "Let us assume that the segment to the right is /z/, which is alveolar, so we go left.",
        "This lands us at terminal node 4.",
        "The tree in Figure 1 shows us that in the training data 119 out of 308 occurrences of /aa/ in this environment were realized as [ao], or in other words that we can estimate the probability of /aa/ being realized as [ao] in this environment as .385.",
        "The full set of realizations at this node with estimated non-zero probabilities is as follows (see Table 2 for a relevant set of ARPABET-IPA correspondences): phone probability – log prob.",
        "(weight) ao 0.385 0.95 aa 0.289 1.24 q+aa 0.103 2.27 q+ao 0.096 2.34 ah 0.069 2.68 ax 0.058 2.84 An important point to bear in mind is that a decision tree in general is a complete description, in the sense that for any new data point, there will be some leaf node that corresponds to it.",
        "So for the tree in Figure 1, each new novel instance of /aa/ will be handled by (exactly) one leaf node in the tree, depending upon the environment in which the /aa/ finds itself.",
        "Another important point is that each decision tree considered here has the property that its predictions specify how to rewrite a symbol (in context) in an input string.",
        "In particular, they specify a two-level mapping from a set of input symbols (phonemes) to a set of output symbols (allophones)."
      ]
    },
    {
      "heading": "3 Quick Review of Rule Compilation",
      "text": [
        "Work on finite-state phonology (Johnson, 1972; Koskenniemi, 1983; Kaplan and Kay, 1994) has shown that systems of rewrite rules of the familiar form 0 – + O/A p, where 0, 0, A and p are regular expressions, can be represented computationally as finite-state transducers (FSTs): note that 0 represents the rule's input rule, V) the output, and A and p, respectively, the left and right contexts.",
        "Kaplan and Kay (1994) have presented a concrete algorithm for compiling systems of such rules into FSTs.",
        "These methods can be extended slightly to include the compilation of probabilistic or weighted rules into weighted finite-state-transducers (WFSTs – see (Pereira et al., 1994)); Mohri and Sproat (1996) describe a rule-compilation algorithm which is more efficient than the Kaplan-Kay algorithm, and which has been extended to handle weighted rules.",
        "For present purposes it is sufficient to observe that given this extended algorithm, we can allow in the expression 0 – + O/A.",
        "p, to represent a weighted regular expression.",
        "The compiled transducer corresponding to that rule will replace 0 with b with the appropriate weights in the context A p."
      ]
    },
    {
      "heading": "4 The Tree Compilation Algorithm",
      "text": [
        "The key requirements on the kind of decision trees that we can compile into WFSTs are (1) the predictions at the leaf nodes specify how to rewrite a particular symbol in an input string, and (2) the decisions at each node are stateable as regular expressions over the input string.",
        "Each leaf node represents a single rule.",
        "The regular expressions for each branch describe one aspect of the left context A, right context p, or both.",
        "The left and right contexts for the rule consist of the intersections of the partial descriptions of these contexts defined for each branch traversed between the root and leaf node.",
        "The input 0 is predefined for the entire tree, whereas the output 7,b is defined as the union of the set of outputs, along with their weights, that are associated with the leaf node.",
        "The weighted rule belonging to the leaf node can then be compiled into a transducer using the weighted-rule-compilation algorithm referenced in the preceding section.",
        "The transducer for the entire tree can be derived by the intersection of the entire set of transducers associated with the leaf nodes.",
        "Note that while regular relations are not generally closed under intersection, the subset of same-length (or more strictly speaking length-preserving) relations is closed; see below.",
        "To see how this works, let us return to the example in Figure 1.",
        "To start with, we know that this tree models the phonetic realization of /aa/, so we can immediately set 0 to be aa for the whole tree.",
        "Next, consider again the traversal of the tree from the root node to leaf node 4.",
        "The first decision concerns the number of segments to the left of the /aa/ in the word, either none for the left",
        "cpn place of articulation of consonant n segments to the right cp-n place of articulation of consonant n segments to the left values: alveolar; bilabial; labiodental; dental; palatal; velar; pharyngeal; n/a if is a vowel, or there is no such segment vpn place of articulation of vowel n segments to the right vp-n place of articulation of vowel n segments to the left values: central-mid-high; back-low; back-mid-low; back-high; front-low; front-mid-low; front-mid-high; front-high; central-mid-low; back-mid-high n/a if is a consonant, or there is no such segment lseg number of preceding segments including the segment of interest within the word rseg number of following segments including the segment of interest within the word values: 1, 2, 3, many sir stress assigned to this vowel values: primary, secondary, no (zero) stress n/a if there is no stress mark",
        "branch, or one or more for the right branch.",
        "Assuming that we have a symbol a representing a single segment, the symbol # representing a word boundary, and allowing for the possibility of intervening optional stress marks – ' – which do not count as segments, these two possibilities can be represented by the regular expressions for A in (a) of Table 3.2 At this node there is no decision based on the righthand context, so the right-hand context is free.",
        "We can represent this by setting p at this node to be E*, where E (conventionally) represents the entire alphabet: note that the alphabet is defined to be an alphabet of all 0:0 correspondence pairs that were determined empirically to be possible.",
        "The decision at the left daughter of the root node concerns whether or not the segment to the right is an alveolar.",
        "Assuming we have defined classes of segments alv, blab, and so forth (represented as unions of segments) we can represent the regular expression for p as in (b) of Table 3.",
        "In this case it is A which is unrestricted, so we can set that at E*.",
        "We can derive the A and p expressions for the rule at leaf node 4 by intersecting together the expressions for these contexts defined for each branch traversed on the way to the leaf.",
        "For leaf node 4, A = #Opt(') n E* = #Opt('), and p = E* n Opt(')(alv) = Opt(1)(alv).3 The rule input 0 has already been given as aa.",
        "The output 1,1) is defined as the union of all of the possible expressions – at the leaf node in question – that aa could become, with their associated weights (negative log probabilities), which we represent here as subscripted floating-point numbers: = ao0.95 U aa1.24 U q+aa2.27 U q+a02.34U ah2.68 U aX2.84 Thus the entire weighted rule can be written as",
        "follows:",
        "By a similar construction, the rule at node 6, for example, would be represented as:",
        "Each node thus represents a rule which states that a mapping occurs between the input symbol 0 and the weighted expression 0 in the condition described by A p. Now, in cases where 0 finds itself in a context that is not subsumed by A p, the rule behaves exactly as a two-level surface coercion rule (Koskenniemi, 1983): it freely allows 0 to correspond to any 0 as specified by the alphabet of pairs.",
        "These 0:0 correspondences are, however, constrained by other rules derived from the tree, as we shall see directly.",
        "The interpretation of the full tree is that it represents the conjunction of all such mappings: for rules 1, 2 ...n, cb corresponds to 01 given condition Ai pi and 0 corresponds to 02 given condition A2 p2 ...and 0 corresponds to On given condition An_ pn.",
        "But this conjunction is simply the intersection of the entire set of transducers defined for the leaves of the tree.",
        "Observe now that the 0:0 correspondences that were left free by the rule of one leaf node, are constrained by intersection with the other leaf nodes: since, as noted above, the tree is a complete description, it follows that for any leaf node i, and for any context A p not subsumed by Ai pi, there is some leaf node j such that Ai pj subsumes A_ p. Thus, the transducers compiled for the rules at nodes 4 and 6, are intersected together, along with the rules for all the other leaf nodes.",
        "Now, as noted above, and as discussed by Kaplan and Kay (1994) regular relations – the algebraic counterpart of FSTs – are not in general closed under intersection; however, the subset of same-length regular relations is closed under intersection, since they can be thought of as finite-state acceptors ex",
        "pressed over pairs of symbols.4 This point can be extended somewhat to include relations that involve bounded deletions or insertions: this is precisely the interpretation necessary for systems of two-level rules (Koskenniemi, 1983), where a single transducer expressing the entire system may be constructed via intersection of the transducers expressing the individual rules (Kaplan and Kay, 1994, pages 367-376).",
        "Indeed, our decision tree represents neither more nor less than a set of weighted two-level rules.",
        "Each of the symbols in the expressions for A and p actually represent (sets of) pairs of symbols: thus (zit), for example, represents all lexical alveolars paired with all of their possible surface realizations.",
        "And just as each tree represents a system of weighted two-level rules, so a set of trees – e.g., where each tree deals with the realization of a particular phone – represents a system of weighted two-level rules, where each two-level rule is compiled from each of the individual trees.",
        "We can summarize this discussion more formally as follows.",
        "We presume a function Compile which given a rule returns the WFST computing that rule.",
        "The WFST for a single leaf L is thus defined as follows, where OT is the input symbol for the entire tree, OL is the output expression defined at L, PL represents the path traversed from the root node to L, p is an individual branch on 4 One can thus define intersection for transducers analogously with intersection for acceptors.",
        "Given two machines G1 and G2, with transition functions 61 and 62, one can define the transition function of G, 6, as follows: for an input-output pair (i, o), 6((qi , q2), (i, o)) = (q, q) if and only if bi (qi , (i, o)) = q; and 62 (q2 , (i, o)) = q;.",
        "that path, and Ap and pp are the expressions for A and p defined at p:",
        "Finally, the transducer for a forest F of trees is just:"
      ]
    },
    {
      "heading": "5 Empirical Verification of the Method.",
      "text": [
        "The algorithm just described has been empirically verified on the Resource Management (RM) continuous speech recognition task (Price et al., 1988).",
        "Following somewhat the discussion in (Pereira et al., 1994; Pereira and Riley, 1996), we can represent the speech recognition task as the problem of finding the best path in the composition of a grammar (language model) G, the transitive-closure of a dictionary D mapping between words and their phonemic representation, a model of phone realization (I., and a weighted lattice representing the acoustic observations A.",
        "Rule T can be constructed out of the forest F of 40 trees, one for each phoneme, trained on the TIMIT database.",
        "The size of the trees range from 1 to 23 leaf nodes, with a total of 291 leaves for the entire forest.",
        "The model was tested on 300 sentences from the RM task containing 2560 word tokens, and approximately 10,500 phonemes.",
        "A version of the model of recognition given in expression (1), where (I) is a transducer computed from the trees, was compared with a version where the trees were used directly following a method described in (Ljolje and Riley, 1992).",
        "The phonetic realizations and their weights were identical for both methods, thus verifying the correctness of the compilation algorithm described here.",
        "The sizes of the compiled transducers can be quite large; in fact they were sufficiently large that instead of constructing (I) beforehand, we intersected the 40 individual transducers with the lattice D* at runtime.",
        "Table 4 gives sizes for the entire set of phone trees: tree sizes are listed in terms of number of rules (terminal nodes) and raw size in bytes; transducer sizes are listed in terms of number of states and arcs.",
        "Note that the entire alphabet comprises 215 symbol pairs.",
        "Also given in Table 4 are the compilation times for the individual trees on a Silicon Graphics R4400 machine running at 150 MHz with 1024 Mbytes of memory.",
        "The times are somewhat slow for the larger trees, but still acceptable for off-line compilation.",
        "While the sizes of the resulting transducers seem at first glance to be unfavorable, it is important to bear in mind that size is not the only consideration in deciding upon a particular representation.",
        "WFSTs possess several nice properties that are not shared by trees, or handwritten rule-sets for that matter.",
        "In particular, once compiled into a WFST, a tree can be used in the same way as a WFST derived from any other source, such as a lexicon or a language model; a compiled WFST can be used directly in a speech recognition model such as that of (Pereira and Riley, 1996) or in a speech synthesis text-analysis model such as that of (Sproat, 1996).",
        "Use of a tree directly requires a special-purpose interpreter, which is much less flexible.",
        "It should also be borne in mind that the size explosion evident in Table 4 also characterizes rules that are compiled from hand-built rewrite rules (Kaplan and Kay, 1994; Mohri and Sproat, 1996).",
        "For example, the text-analysis ruleset for the Bell Labs German text-to-speech (TTS) system (see (Sproat, 1996; Mohri and Sproat, 1996)) contains sets of rules for the pronunciation of various orthographic symbols.",
        "The ruleset for <a>, for example, contains 25 ordered rewrite rules.",
        "Over an alphabet of 194 symbols, this compiles, using the algorithm of (Mohri and Sproat, 1996), into a transducer containing 213,408 arcs and 1,927 states.",
        "This is 72% as many arcs and 48% as many states as the transducer for /ah/ in Table 4.",
        "The size explosion is not quite as great here, but the resulting transducer is still large compared to the original rule file, which only requires 1428 bytes of storage.",
        "Again, the advantages of representing the rules as a transducer outweigh the problems of size.'"
      ]
    },
    {
      "heading": "6 Future Applications",
      "text": [
        "We have presented a practical algorithm for converting decision trees inferred from data into weighted finite-state transducers that directly implement the models implicit in the trees, and we have empirically verified that the algorithm is correct.",
        "Several interesting areas of application come to mind.",
        "In addition to speech recognition, where we hope to apply the phonetic realization models described above to the much larger North American Business task (Paul and Baker, 1992), there are also applications to TTS where, for example, the decision trees for prosodic phrase-boundary prediction discussed in (Wang and Hirschberg, 1992) can be compiled into transducers and used directly in the WFST-based model of text analysis used in the multilingual version of the Bell Laboratories TTS system, described in (Sproat, 1995; Sproat, 1996)."
      ]
    },
    {
      "heading": "7 Acknowledgments",
      "text": [
        "The authors wish to thank Fernando Pereira, Mehryar Mohri and two anonymous referees for useful comments."
      ]
    }
  ]
}
