{
  "info": {
    "authors": [
      "Hiroyuki Kaji",
      "Toshiko Aizono"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C96-1006",
    "title": "Extracting Word Correspondences from Bilingual Corpora Based on Word Co-Occurrence Information",
    "url": "https://aclweb.org/anthology/C96-1006",
    "year": 1996
  },
  "references": [
    "acl-C94-1009",
    "acl-H91-1026",
    "acl-J93-1006",
    "acl-P91-1022",
    "acl-P91-1023",
    "acl-P93-1002",
    "acl-P93-1003",
    "acl-P95-1032",
    "acl-W93-0301"
  ],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "A new method has been developed for extracting word correspondences from a bilingual corpus.",
        "First, the co-occurrence information for each word in both languages is extracted from the corpus.",
        "Then, the correlations between the co-occurrence features of the words are calculated pairwisely with the assistance of a basic word bilingual dictionary.",
        "Finally, the pairs of words with the highest correlations are output selectively.",
        "This method is applicable to rather small, unaligned corpora; it can extract correspondences between compound words as well as simple words.",
        "An experiment using bilingual patent-specification corpora achieved 28% recall and 76% precision; this demonstrates that the method effectively reduces the cost of bilingual dictionary augmentation."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Bilingual dictionaries are essential components for machine translation systems.",
        "One of the major problems with bilingual dictionaries is that they are expensive to build, since a huge number of terms are used in a variety of fields.",
        "Computer support is thus needed to reduce the cost of dictionary building.",
        "With the growing volume of text available in electronic form, a number of methods have been proposed for extracting word correspondences from bilingual corpora automatically.",
        "These methods can be divided into those taking a statistical approach (Gale & Church 1991a; Kupiec 1993; Dagan et al.",
        "1993; Inoue & Nogaito 1993; Fung 1995) and those taking a linguistic approach (Yamamoto & Sakamoto 1993; Kumano & Hirakawa 1994; Ishimoto & Nagao 1994).",
        "The statistical approach utilizes the occurrence frequencies and locations of words in a parallel corpus to calculate the pairwise correlations between the words in the two languages.",
        "The linguistic approach primarily extracts correspondences between compound words by consulting a bilingual dictionary of simple words.",
        "These proposed methods for extracting word correspondences from bilingual corpora have the following drawbacks.",
        "First, most of them assume that the input corpora are aligned sentence by sentence, which reduces their applicability remarkably.",
        "Although a number of automatic sentence alignment methods have been proposed (Brown et al.",
        "1991; Gale & Church 19911); Kay & Roscheisen 1993; Chen 1993), they are not very reliable for real noisy bilingual texts.",
        "Second, the statistical methods usually require a very large corpus as their input.",
        "However, it is not easy to obtain a very large corpus.",
        "Third, the linguistic methods are restricted to extracting correspondences between compound words.",
        "We have developed an extraction method that is free from the above drawbacks.",
        "In Sec. 2 we describe the basic idea of our method and give an overview.",
        "In Sec. 3 we describe the technical details, and in Sec. 4 we describe an experiment using patent-specification texts.",
        "In Sec. 5 we make a remark on the effectiveness of the proposed method, and discuss directions for improvement."
      ]
    },
    {
      "heading": "2 Overview of Proposed Method",
      "text": [
        "The finding underlying our proposed method is as follows.",
        "In a bilingual corpus, a pair of words corresponding to each other generally accompany the same context, although expressed in the two different languages.",
        "If we calculate the pairwise correlations between the contexts in which the words occur, a correponding pair of words will show a high correlation.",
        "Although one occurrence of a word may not give a sufficient context to characterize the word, accumulating all the contexts in which the word occurs throughout the text allows the word to be distinguished from the other words in the same language text.",
        "Figure 1 shows how two words are associated through their contexts, each expressed in its respective language.",
        "We use the set of words co-occurring with word w, which we refer to as the co-occurrence set of w, to concisely represent the accumulated contexts characterizing the word.",
        "To associate two co-occurrence sets whose elements are words in different languages, we consult a bilingual dictionary and extract the possible word correspondences between them.",
        "The point is that even if the pair of words to be associated is missing in the bilingual dictionary, their co-occurrence sets can be associated through the bilingual dictionary.",
        "Of cource, some of the correspondences between the co-occurrence sets may be also missing in the bilingual dictionary.",
        "Nevertheless, the co-occurrence sets can be still associated, owing to the other correspondences between them that are contained in the bilingual dictionary.",
        "Om proposed method (Fig.",
        "2) is based on the above",
        "idea.",
        "While the examples shown here are for Japanese and English, the method is applicable to any pair of languages.",
        "The method is divided into three parts: Japanese text processing, English text processing, and bilingual processing.",
        "The Japanese text processing is composed of sentence segmentation, morphological analysis, and co-occurrence data extraction.",
        "It extracts a co-occurrence set for each word from a Japanese text.",
        "Likewise, the English text processing extracts a co-occurrence set for each word from an Engish text.",
        "The bilingual processing then calculates the pairwise correlations between the co-occurrence sets for Japanese words and those for English words, and selects the pairs of words with the highest correlations."
      ]
    },
    {
      "heading": "3 Technical Details",
      "text": []
    },
    {
      "heading": "3.1 Extraction of words from text",
      "text": [
        "Natural language texts are composed of two types of words: content words and function words.",
        "The target of extraction can usually be restricted to the correspondences between content words, which are characterized by both dominance in number and straightforwardness.",
        "Additionally, the function words arc useless as elements of co-occurrence sets, since they do not indicate specific contexts.",
        "Therefore, we extract only the content words from the texts in both languages.",
        "The content words are divided into simple words and",
        "compound words.",
        "The former are extracted by dictionary look up and morphological analysis.",
        "To extract the latter, we are describing a set of rules or patterns.",
        "So far, we have only addressed nominal compounds (simple noun phrases), whose patterns are given below.",
        "Here, N, A, and NP stand for noun, adjective, and simple noun phrase, respectively.",
        "N+ stands for a string of one or more Ns.",
        "• Japanese nominal compounds: NP := N N+",
        "English nominal compounds: NP N N+ I A N+ The nominal compounds are extracted from the morphological analysis results by pattern matching.",
        "Here, an NP included in a larger NP is rejected, since only self-contained NPs qualify as nominal compounds.",
        "One exception is an English NP starting with a noun that is included in an NP starting with an adjective, because the case of an adjective modifying a nominal compound is just as likely as the case of an adjective being a part of a nominal compound."
      ]
    },
    {
      "heading": "3.2 Extraction of co-occurrence data",
      "text": [
        "Definitions of 'co-occurrence' include syntactic co-occurrence, co-occurrence in a k-word window, co-occurrence in a sentence, and co-occurrence in a document.",
        "We use co--occurrence in a sentence, in which a pair of words occurring within the same sentence is regarded as a co-occurrence.",
        "While co-occurrence in a k-word window may produce better results when a sentence in one language corresponds to a sequence of two or more shorter sentences in the other language, it is difficult to determine an appropriate value of k because word order differs considerably between Japanese and English.",
        "The relations between a compound word and its constituent words arc not, strictly speaking, co-occurrence relations.",
        "Moreover, if we treated them in the same manner as co-occurrence relations, it would cause some confusion.",
        "Suppose that compound word w is composed of two simple words, w' and w\".",
        "If we included both w' and w\" in the co-occurrence set of w, and vice versa, the differences between the co-occurrence set of w and those of w' and w\" would decrease.",
        "Therefore, we exclude the constituent words from the co-occurrence set of a compound word and vice versa.",
        "As mentioned in Section 2, the co-occurrence sets of a word are accumulated.",
        "This is not a mere union operation, but a union operation accompanied by frequency counting.",
        "The resultant co-occurrence set i s expressed as",
        "which shows that word uco-occurs with word w t; times."
      ]
    },
    {
      "heading": "3.3 Calculation of correlations between words",
      "text": [
        "We define correlation R(jw, ow) between Japanese word jw and English word cw as follows.",
        "j= 1,••, n} are the co-occurrence sets of jw and ow, respectively.",
        "C(jw) fl C(ew)= ((jw, , ew) I 110 I i 1,• • • , in; j= 1,• •• , n} is the intersection of C(jw) and C(ew), whose elements are pairs of a Japanese word and an English word with their frequency.",
        "I • I means the sum of frequencies of all elements.",
        "Generating intersection C(jw) fl C(ew) from C(jw) and C(ew) is not easy because the procedure of pairing jw, (C C(jW)) and ow, (C C(ew) ) is nondeterministic.",
        "A pair of words cannot he determined independently of the other possible pairs.",
        "To reduce processing time, we calculate C(jw) C(ew) I approximately, as illustrated in Fig. 3.",
        "For example, the English-based approximate calculation is done as follows.",
        "First, Japanese co-occurrence set C(jw) is transformed into pseudo co-occurrence set Cp(jw) by consulting bilingual dictionary ll, which is a set of pairs of words: Cp(jw) f j 1,• • •, n } , where f = Z fi .",
        "The intersection of pseudo co-occurrence set Cp(jw) and English co-occurrence set C( ow) is then generated: Ci,(jw) n C(cw) min{ f , j 1 ,• • •, n1.",
        "Finally, I Cp(jw) 0 C(ew) I is calculated as the approximate value of I C(jw) fl C(ew) :",
        "This approximate calculation is likely to result in an overestimated correlation when there is ambiguity in pairing jw, (( C(jw) ) and cw, ( E C(cw)), as occurs in Fig. 3(a).",
        "Figure 3(a) shows that the number of elements in the intersection exceeds that in the Japanese co-occurrence set.",
        "The English-based and Japanese-based approximate calculations therefore do not always coincide with each other.",
        "While selecting the minimum of the two approximate values is safer, it does not guarantee a precise value.",
        "Since ambiguity in associating co-occurrence sets does not occur too often, and considering the need for efficiency, we execute either of the two approximate calculations rather than make a precise calculation.",
        "To increase the reliability of the correlation values, we remove the useless words from the co-occurrence sets before calculating the correlations.",
        "The useless Japanese word i s jwsuch that ew (jW, ew) new ow( L TE) =- 0 (F„ is the input English text), and the useless English word is ow such that (jw I (jw, ow) E D} (jw I jw T,} = (T, is the input Japanese text).",
        "These words do not contribute to the word-pair correlations."
      ]
    },
    {
      "heading": "3.4 Selection of pairs of words with high correlation",
      "text": [
        "The absolute values of the correlations are not significant because they are sensitive to the numbers of words in the co-occurrence sets, which vary considerably from word to word.",
        "However, their relative values are significant when either a Japanese or an English word i s fixed.",
        "We take the strategy of selecting the mutually best-matched pairs having no highly probable competitors.",
        "We call (jw,",
        "When for a mutually best-matched pair (jw, ew), there exists either ew' such that",
        "we call (jw, ew) or (jw', ow) a highly probable competitor.",
        "Here, a is a predetermined constant a <1), and D i s the bilingual dictionary."
      ]
    },
    {
      "heading": "3.5 Feedback of extracted pairs of words",
      "text": [
        "Obviously, the performance of the proposed method depends upon the coverage of the bilingual dictionary over the corpus.",
        "The coverage is the proportion of the word correspondences in the corpus that are already contained in the bilingual dictionary.",
        "Generally speaking, the wider the coverage, the more reliable the correlation values.",
        "Accordingly, the feedback of extracted pairs will probably improve performance, even though some of them are erroneous.",
        "In Fig. 2, the feedback is represented by dotted line."
      ]
    },
    {
      "heading": "4 Experiment and Results",
      "text": [
        "We implemented our proposed method on a workstation and carried out an experiment using patent-specification documents in Japanese and English and a bilingual dictionary for a machine translation system.",
        "The dictionary contains approximately 60,000 Japanese entry words, each having several English translations.",
        "The quantitative profile of the sample patent documents is shown in Table 1(a).",
        "We executed the word correspondence extraction program for each document.",
        "Parameter a in the selection of pairs of words was assumed to be 0.",
        "This means that the output pairs were limited as much as possible.",
        "Both results before and after feedback were obtained to evaluate the effect of feedback.",
        "The extracted pairs of words were divided into two groups: those which are already contained in the bilingual dictionary and those which are not yet contained in the bilingual dictionary.'",
        "The former are insignificant from the practical point of view.",
        "However, they are signficant in evaluating the effectiveness of the proposed correlation measure because the dictionary information regarding a particular pair of words does not contribute to the correlation between the pair itself.",
        "Accordingly, we evaluated two cases: Case A - the already known pairs of words are included - and Case B - the already known pairs of words are excluded.",
        "A good way to evaluate word correspondence extraction methods is to measure their recall and precision.",
        "These measures are defined as follows.",
        "The recall is the proportion of all word correspondences in a \" We neglected the reference numbers peculiar to the patent documents because their correpondences are trivial.",
        "The underlined numerals in the following pair of sentences is an example of a reference number: 7 1 I/AILOU 5 0 4 OW4KJ.1h----Vc-J- z / the two inputs to address comparator 504 coincide with •",
        "bilingual corpus that are actually extracted.",
        "The precision is the proportion of extracted word correspondences that are actually correct.",
        "While the precision is rather easy to calculate, the recall is difficult to calculate because it is a time-consuming task to manually identify all the word correspondences in the bilingual corpus.",
        "Therefore, instead of calculating the recall according to its de,-nition, we make a rough estimation using the ratio of the number of correct pairs of words extracted to the number of words in either the Japanese or English text.",
        "We call this the pseudo-recall.",
        "The pseudo-recall indicates the lowest limit of the recall since a word in the Japanese text does not always have a straightforward counterpart in the English text, and vice versa.",
        "precision in Cases A and 11, respectively.",
        "In Case A, the 30.4% and 88.0%.",
        "In Case B, the pseudo-recall and pseudo-recall and precision before feedback were 27.8% precision before feedback were 25.7% and 74.9%",
        "respectively, and those after feedback were 28.0% and 75.6%.",
        "The experiment confirmed that the proposed method can extract not only compound word correspondences but also simple word correspondences from a small corpus.",
        "Examples of word correspondences extracted from a patent document are shown in Table 2.",
        "The comparison of results before and after feedback supported the effectiveness of using feedback.",
        "That is, feedback increases recall while preserving precision.",
        "We also ascertained that repeating the feedback one more time did not result in significant improvement."
      ]
    },
    {
      "heading": "5 Discussion",
      "text": [
        "The experiment shows that the proposed method is effective in reducing the cost of bilingual dictionary augmentation.",
        "The recall of the method is not high.",
        "Furthermore, it cannot extract more than one correspondence for a word.",
        "Still, the method is effective because it can extract from a small corpus.",
        "Bilingual documents should be handled separately.",
        "Even if a correspondence pair of words fails to be extracted from one bilingual document, it may be extracted from another bilingual document, where it occurs prevailingly.",
        "The following are directions for further improvement.",
        "(1) Refinement of nominal compound extraction procedure:",
        "The simplified procedure described in Sec. 3.1 often causes omission (a nominal compound is not extracted) and noise (an inappropriate word string is extracted).",
        "These are major causes of errors in word correspondence extraction; refining the nominal compound extraction procedure will considerably improve recall and precision.",
        "(2) Use of symbol/numeral correspondences: In the present implementation, the correspondences of symbols and numerals are not used in calculating the correlation because the bilingual dictionary does not contain them.",
        "However, they have the potential of increasing the reliablilty of the correlation values.",
        "A character-string-matching routine to identify the correspondences of symbols/numerals should thus be added to the correlation calculation module.",
        "(3) Use of the constituent word information of compound words:",
        "The key idea of our method is to associate a pair of words through their co-occurrence information with the assistance of a bilingual dictionary.",
        "In contrast, that of the previous linguistic methods is to associate a pair of compound words through their constituent word information with the assistance of a bilingual dictionary.",
        "These two are not incompatible.",
        "Combining them would surely increase the recall and precision for compound word correspondences."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "We have developed a new method for extracting word correspondences from bilingual corpora.",
        "The essence of the method is to calculate correlations between words based on their co-occurrence information with the assistance of a basic word bilingual dictionary.",
        "This method is applicable to rather small, unaligned corpora; it can extract correspondences between not only simple words but also between compound words.",
        "In an experiment with patent corpora, 28.0% pseudo-recall and 75.6% precision were achieved.",
        "Acknowledgments: We would like to thank Dr. Michiharu Nakamura, Dr. Testuo Yokoyama and Dr. Hiromichi Fujisawa for their constant support and encouragement."
      ]
    }
  ]
}
