{
  "info": {
    "authors": [
      "Wanying Jin"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2203",
    "title": "Chinese Segmentation Disambiguation",
    "url": "https://aclweb.org/anthology/C94-2203",
    "year": 1994
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "A technique of reasoning under uncertainty is studied in an attempt to solve disambiguation problems of Chinese segmentation.",
        "A knowledge-based inexact reasoning theory incorporating knowledge in morphology, syntax, semantics arid pragmatics is presented."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Processing Chinese texts is specifically difficult in its computation because normally sentences in Chinese texts are represented as strings of Chinese characters without spaces to indicate word boundaries.",
        "This causes a problem for Chinese machine translation, statistical analysis of Chinese corpora, Chinese information retrieval, etc.",
        "; as usually these projects are based on the assumption that all lexicon distinctions have been recognized in ad van cc.",
        "Several approaches aimed to transfer a Chinese character string into a word string have been studied in recent decades.",
        "Two corn-petin.g approaches commonly used for Chinese text segmentation are the statistical approach (Chang, et al., 1991; Sproat and Shill, 1991; Chiang, et al., 1992) and the heuristic approach (Chen and Liu, 1992; Ile, et al., 1991; .lin and Nie, 1993; Jin, 1992; Liang and Zhen, 1991; Wang, et al., 1991).",
        "Although a high degree of precision has been reported for both methods, each has its limitations particularly in identifying unknown words and disambiguating multiple segmentations.",
        "Recently, a hybrid approach incorporating heuristics with statistics has been studied in an attempt to solve unknown word recognition problems (Chen and Lin, 1992; Nie and Jin, 1994).",
        "However, ambiguous segmentation is still a difficult problem.",
        "In this paper a method of reasoning under 111tcertainty intending to disambiguate Chinese segmentation is presented.",
        "A model of evidential strength in inexact reasoning has been studied by (13uchanan and Shortliffe, 1984).",
        "In the process of Chinese segmentation knowledge in morphology, syntax, semantics and pragmatics is used as evidence to support the disambiguation hypotheses.",
        "The similarity of uncertain knowledge and inexact reasoning between medical diagnosis and natural language interpretation makes it possible to apply MYCIN technique to Chinese text segmentation."
      ]
    },
    {
      "heading": "2 Difficulties in Chinese segmentation",
      "text": [
        "As claimed in (Liu, 1987),the main causes of segmentation ambiguity are vagueness in word definitions and the phenomenon of word chains.",
        "The vagueness of the word definitions causes segmentation ambiguities, as in the string it can stands either for UME IL) r (modern factory) or for 11.0; tar (modern chemical factory).",
        "A word chain is a sequence of Chinese characters from which several words can be produced witli or without overlap.",
        "Two types of word chains have been recognized in Chinese literature, i.e. multi-sense combinations and intersection combinations (Huang and :Liu, 1988).",
        "The string",
        "Oct is an example of multi-sense combination; '01( (ice), 4(box) and i7J(14(refrigerator) are all words.",
        "The character string am.",
        "* is an example of intersection combination; *M(paddle) is a word and MA(sell-at-sale-price) is also a word, whereas 10 is the intersection character.",
        "The example of the string •5'.-*IfIA%-f illustrates the typical segmentation ambiguity caused by word chains.",
        "The segmentation of this string can be either -.17-a R.:* MA '.",
        "'F-s-6-10 (The ping-pong-balls were sold outat sale price.)",
        "or am A 'AT.",
        "(The paddles for table tennis were sold out.)",
        "Some ambiguities can be solved by word structure knowledge.",
        "Others can be disambiguated by syntactic and/or semantic knowledge.",
        "The most difficult disambiguation is that requiring contextual or pragmatic knowledge to arrive at an appropriate interpretation as in the string *t-t'qf which can be segmented into: (students will write a paper.)",
        "or (student-association writes a paper.)",
        "Both are syntactically and semantically correct.",
        "In ads case, contextual information would allow the reader to trace the information claimed in the previous statements to solve ambiguity problems."
      ]
    },
    {
      "heading": "3 Reasoning theory for Chinese segmentation disambiguation",
      "text": [
        "A model of evidential strength in inexact reasoning studied by (Buchanan and Shortliffe, 1984) has been successfully implemented in the MYCIN system.",
        "The theory is that, if a hypothesis can be derived from various types of mutually exclusive evidence, then the strength of truth of the hypothesis can be increased to reach a plausible conclusion.",
        "Two concepts MB[h,e] and MD[h,e] have been introduced as the measures of belief and disbelief.",
        "MB[h,e] means the measure of increased belief in the hypothesis h, based on the evidence e. M.D[11,e] means the measure of increased disbelief in the hypothesis h, based on the evidence e. To facilitate comparison of the evidential strength of competing hypotheses, certainty factor CE is introduced to combine degrees of belief and disbelief as follows: C , e] MB[h, e] – MD[h, c] In the case that a hypothesis is derived from a number of mutually exclusive observations, the combining functions are defined as: if MD[h, &e2] = 1 then MB[h, eiSze2] = 0 otherwise",
        "In the case that two hypotheses are established with positive evidence from syntactic and semantic knowledge with the same degree, no discrimination of the strength of truth hypotheses can be drawn.",
        "If world knowledge provides positive evidence for the first hypothesis and negative evidence to the second; then the strength of the first hypothesis is stronger than that of the second.",
        "Therefore, the first hypothesis would be the most likely correct segmentation.",
        "A weighted certainty factor is proposed here to represent the importance of various linguistic aspects.",
        "The weight is a vector of four elements representing the importance of morphology, syntax, semantics and pragmatics, respectively, which total 1, i.e. C F[h , e] = W * C .11h , e] where Wi is the weight of the certainty factor CTS in hypothesis h supported by the evidence e with respect to one of the linguistic",
        "aspects.",
        "Suppose the weight vector (0.1, 0.2, 0.3, 0.4) is assigned for morphology, syntax, semantics and pragmatics, respectively, then the following example illustrates the function of the weighted certainty factor C For the string ifi440/A.411W.,7-_-_AElfi'ttff:1%.5xkli (the third leader in our company does not have much power) the word chain Of produces two segmentations: /h.Hil1 WI': 'Rif a:ff (the third leader in our company does not have much power) or ft1l1 .1,13.1i it!",
        "A V.±.1 (the third piece-of hand in our company does not have Much power) To estimate the strength of truth of the first hypothesis, suppose: • the word structure rule gives the evidential strength (0.5) for the hypothesis because the word chain 4[9T can he either VI if (piece-of hand) or IP-T, (leader).",
        "Therefore,",
        "• the syntactic rule gives the evidential strength (I) because it definitely is a grammatical sentence.",
        "'Therefore,",
        "• the semantic rule gives the evidential strength 1) since -MT.",
        "(the leader) can have power.",
        "Therefore,",
        "= 114.",
        "13[h, e (Vs.,T,82kCal -- 114 .1)[h, c k c2k,e3] = 0.46",
        "• the world knowledge rule gives the evidential strength (0.8) because it is quite true that the leader has less power than that of the first or second leader.",
        "Therefore,",
        "The certainty factor CF of the hypothesis 414 /./;:i--ij (Ki INT a:#5.",
        "15t.",
        "),; is 0.63.",
        "Therefore, this segmentation is likely to be a coherent string.",
        "To estimate the evidential strength of the second hypothesis, suppose: • the word structure rule gives the evidential strength (0.5) for this hypothesis since MT can be either 4PI 41(piece-of hand) or in' (leader).",
        "Therefore,",
        "• the syntactic rule gives the evidential strength (I) because it is a grammatical sentence.",
        "Therefore,",
        "e the semantic rule gives the negative evidential strength (-I) because tire phrase the hand of a company violates the se-.",
        "mantic constraint.",
        "Therefore,",
        "- -0.06",
        "• tire world knowledge rule gives a negative evidential strength (-I.)",
        "because a company does not have a hand as one of its coinponerits.",
        "- --0.34 'Tire certainty factor of the hypothesis It /./_ tYJ 1)5t Jr is - 0.31.",
        "Therefore, this segmentation is unlikely to be a coherent string."
      ]
    },
    {
      "heading": "4 Discussion",
      "text": [
        "The assignment for the weight vector is empirical.",
        "It is based on the following analysis in which '1's reresent the truth of each evidence/hypothesis and 'O's represent the false.",
        "Since the segmentation algorithm always produces a segmented string, it is assumed that the evidence from morphology is true in varying degrees depending on the complexity of the word chain.",
        "The justification of a hypothesis is based on the evidence presented by the pragmatic, semantic and syntactic aspects shown in the following table.",
        "• Case(1) indicates that if no evidence can prove the truth of the hypothesis, then the hypothesis is false.",
        "• Case(2) indicates that if the evidence supports an incoherent grammatical sentence inconsistent with the context/circumstance, then the hypothesis is false as in the case of MC otR-T-(a banana ate a monkey).",
        "• Case(3) indicates that if the evidence supports a meaningful but ungrammatical string inconsistent with the context/circumstance, then the hypothesis is false, i.e. fthtS53f (he wretch) against the real fact that he is a nice guy.",
        "• Case(4) indicates that even if the evidence supports a grammatical meaning",
        "ful sentence but is inconsistent with the context/circumstance, then the hypothesis is false, i.e., PA 1 a l (the president's forced resignation makes people angry) violates the circumstance that people hate the president.",
        "• Case(5) indicates the case of an idiomatic expression where the string is literally ungrammatical and incoherent, but as a whole it can be interpreted figuratively to make perfect sense.",
        "Therefore, we assume that the hypothesis is true as in the case of :tizt(Aitc;, literally means \"car-water-horse-dragon\", but figuratively, it means \"very crowded\".",
        "• Case(6) indicates the case of a, metaphor or metonymy which superficially it is an incoherent grammatical string, but by reasoning with the support of world knowledge it can be interpreted as a meaningful string.",
        "Then, it is assumed that the hypothesis is true, i.e., TI4 PI lb (I drink North-West wind) means \"I have nothing to eat\".",
        "• Case(7) indicates that the evidence supports a meaningful but ungrammatical string consistent with the context/circumstance.",
        "then the hypothesis is true as in (0,,t4 (he wretch) is consistent with the real fact that he is a bad guy.",
        "• Case(8) indicates that if all evidence gives positive support to the hypothesis, then the hypothesis is true.",
        "From the analysis, it seems to be that pragmatic knowledge provides the strongest evidence for the hypothesis.",
        "Therefore, the highest weight is assigned to the pragmatic aspect of the certainty factor.",
        "In the absence of pragmatic information a default assumption, that semantic evidence is more important than syntactic evidence, is made.",
        "This can be observed in daily life people communicate through many ungrammatical expressions without having a problem of transferring the message such as a brief email message:' DRAFT-comments-hard copy best – asap to yw pls.",
        "It means \"To",
        "write the comment for the DRAVI' on the hard copy would be the best.",
        "Please return it to Yorick Wilks as soon as possible.\"",
        "The certainty factor CF is used under the premise that all of the evidence is rendered by mutually exclusive observations.",
        "Since language is an expression integrating syntactic, semantic and pragmatic information, is the syntactic, semantic and pragmatic evidence mutually exclusive?",
        "This is not so clear.",
        "All knowledge is culturally dependent, i.e. one particular instance may be acceptable in one culture but not in another.",
        "In this research a default assumption is made that the observations from various language aspects are independent.",
        "The question is left open for further discussion."
      ]
    },
    {
      "heading": "5 References",
      "text": []
    }
  ]
}
