{
  "info": {
    "authors": [
      "Gábor Prószéky",
      "Miklos Pal",
      "László Tihanyi"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2208",
    "title": "Humor-Based Applications",
    "url": "https://aclweb.org/anthology/C94-2208",
    "year": 1994
  },
  "references": [
    "acl-A88-1031",
    "acl-C92-1014",
    "acl-C92-3145",
    "acl-E89-1008",
    "acl-E93-1067"
  ],
  "sections": [
    {
      "heading": "HUMOR-BASED APPLICATIONS",
      "text": []
    },
    {
      "heading": "INTRODUCTION",
      "text": [
        "There are several linguistic phenomena that can be processed by morphological tools of agglutinative and other highly inflectional languages, while processing of the same features need syntactic parsers in case of other languages, like English.",
        "There are, however, only a few morphological systems that are both fast enough and linguistically sound.",
        "Humor, a reversible, string-based, unification approach is introduced in the paper that has been used for creating a variety of lingware applications, like spell-checking, hyphenation, lemmatization, and of course, full morphological analysis and synthesis.",
        "Having discussed the philosophical and design decisions we show the above mentioned systems and then survey some competing approaches."
      ]
    },
    {
      "heading": "DESIGN PHILOSOPHY OF HUMOR",
      "text": [
        "Several philosophical commitments regarding the NLP systems are summarized in Slocum (1988).",
        "Humor has been designed according to the Slocum requirements.",
        "it is language independent, that is, it allows multilingual applications.",
        "Besides agglutinative languages (e.g. Hungarian, Turkish) and highly inflectional languages (e.g. Polish, Latin) it has been applied to languages of major economic and demographic significance (e.g. English, German, French), Humor overcomes simple orthographic errors and inis-typings, thus it is a fault-tolerant system.",
        "The morphological analyzer version, for example, is able to analyze Hungarian texts from the 19th century when the orthographic system was not as uniform as nowadays.",
        "Word-forms are first \"autocorrected\" into the standard orthography and then analyzed properly.",
        "Humor descriptions are reversible.",
        "It means that there is an opportunity to input a stem and several suffixes and the system generates every possible word-form satisfying the request.",
        "The basic strategy of Humor is inherently suited to parallel execution.",
        "Search in the main dictionary, secondary dictionaries and affix dictionaries can happen at the same time.",
        "What is more, a simultaneous processing level (higher than morphology) based on the same strategy is under development.",
        "In real-world applications, number of linguistic rules is an important source of grammatical complexity.",
        "In the Humor strategy there is a single rule only that checks unifiability of feature graphs of subsequent substrings in the actual word-form.",
        "It is very simple and clear, based on surface-only analyses, no transformations are used; all the complexity of the system is hidden in the graphs describing tnorpho-graphemic behavior.",
        "Humor is rigorously tested on \"real\" end-users.",
        "Root dictionaries of the above mentioned languages contain 25.000--I 00.000 entries.",
        "The Hungarian version (90.000 stems) has been tested in everyday work since 1991 both by researchers of the Institute of Linguistics of the Hungarian Academy of Sciences (Preszeky and Tihanyi 1992) and users of word-processors and DTP systems (Humor-based proofing tools have been licensed by Microsoft, Lotus and other software developers)."
      ]
    },
    {
      "heading": "MORPHOLOGICAL PROCESSES SUPPORTED BY HUMOR",
      "text": [
        "The morphological analyzer is the kernel module of the system: almost all of the applications derived from Humor based on it.",
        "Humor has a guessing strategy that is based on orthographic, tnorpho-phonological, morphological and lexical properties of the words.",
        "It operates after the analysis module, mostly used in the spelling checkers based on Humor and in the above mentioned 19th century corpus application.",
        "Synthesis is based on analysis, that is, all the possible morphemic combinations built by the core synthesis module are filtered by the analyzer.",
        "(2) String concatenation: monciel,mondol,monda],mondsz, mondaF10,mondew/ (3) Analysis, one by one: %mondet,%mondo],%mond61, monds7,,mondar4z,%mondsz (4) Filtering:",
        "rmndsz mondasz For internal use we have developed a defaulting subsystem that is able to propose the most likely inflectional paradigm(s) for a base word.",
        "There are only a few morphologically open word classes in the languages we have studied.",
        "Paradigms that are difficult to classify are generally closed; no new words of the language follow their morpho-graphemic patterns.",
        "The behavior of existing, productive paradigms is rather easy to describe algorithmically .",
        "The coding subsystem of Slocum (1988) is represented by the so-called paradigm matrix of Humor systems.",
        "It is defined for every possible allomorph: it gives information about the potential behavior of the stem allomorph before morphologically relevant affix families."
      ]
    },
    {
      "heading": "COMPARISON WITII OTHER METHODS",
      "text": [
        "There arc only a few general, reversible morphological systems that can be used for more than a single language.",
        "Besides the well-known two-level morphology (Koskenniemi 1983) and its modifications (Karttunen 1985, 1993) we mention the Nabu system (Slocum 1988).",
        "Morphological description systems without large implementations (like the paradigmatic morphology of Calder (1989), or Paradigm Description Language of Anick and Artemieff (1992) are not listed here, because their importance is mainly theoretical (at least, for the time being).",
        "Two-level morphology is a reversible, orthography-based system that has several advantages from a linguist's point of view.",
        "Namely, the morpho-phonemic/graphemie rules can be formalized in a general and very elegant way.",
        "It also has computational advantages, but the lexicons must contain entries with diacritics and other sophistications in order to produce the needed surface forms.",
        "Non-linguist users need an easy-to-extend dictionary into which words can be inserted (almost) automatically.",
        "The lexical basis of Humor contain surface characters only and no transformations are applied.",
        "Compile time of a large Humor dictionary (of 90.000 entries) is 1-2 minutes on an average PC, that is another advantage (at least, for the linguist) if comparing it with the two-level systems' compilers.",
        "The result of the compilation is a compressed structure that can be used by any applications derived from Humor.",
        "The compression ratio is less than 20%.",
        "The size of the dictionary does not influence the speed of the runtime system, because a special paging algorithm of our own is used."
      ]
    },
    {
      "heading": "HUMOR-BASED IMPLEMENTATIONS",
      "text": [
        "Humor systems have been implemented (at various depth) for English, German, French, Italian, Latin, Ancient Greek, Polish, Turkish, and it is fully implemented for Hungarian.",
        "The whole software package is written in standard C using C3-1 like objects.",
        "It runs on any platforms where C compiler can be found] .",
        "The Hungarian morphological analyzer which is the largest and most precise implementation needs 900 Kbytes disk space and around 100 Kbytes of core memory.",
        "The stem dictionary contains more than 90.000 stems which cover all (approx.",
        "70.000) lexemes of the Concise Explanatory Dictionary of the Hungarian Language.",
        "Suffix dictionaries contain all the inflectional suffixes and the productive derivational morphemes of present-day Hungarian.",
        "With the help of these dictionaries Humor is able to analyze and/or generate around 2.000.000.000 well-formed Hungarian word-forms.",
        "Its speed is between 50 and 100 words/s on an average 40 MHz 386 machine.",
        "The whole system can be tuned' according to the speed requirements: the needed RAM size can be between 50 and 900 Kbytes.",
        "There are several Humor subsystems with simplified output: leminatizers, hyphenators, spelling checkers and correctors.",
        "They (called HelvesLem, Hemel and Helyes-e?, respectively) have been built into several word-processing and full-text retrieval systems' Hungarian versions (Word, Excel, AmiPro, Word-Perfect, Topic, etc.",
        ").4 Besides the above well-known applications there are two new tools based on the same strategy, the inflectional thesaurus called Helvetii (PrOszeky and Tihanyi 1992) and the series of intelligent bilingual dictionaries called MoBiDie.",
        "Both are dictionaries with morphological knowledge: Helyette is monolingual, while MoBi Die -- as its name suggests bilingual.",
        "Having analyzed the input word the both systems look for the found stem in the main dictionary.",
        "The inflectional thesaurus stores the information encoded in the analyzed affixes and adds to the synonym word chosen by the user.",
        "The synthesis module of Humor starts to work now, and provides the user with the adequate inflected form of the word in question.",
        "This procedure has a great importance in case of highly inflectional languages.",
        "The synonym system of Helyette contains 40.000 headwords.",
        "The first version of the inflectional thesaurus Helvetii needs 1.6 Mbytes disk space and runs under MS-Windows.",
        "The size of the MoBi Die dictionary packages vary depending on the applied terminological collection.",
        "E.g. the Hungarian English Business Dictionary (Example 4) needs 1.8 Mbytes space.`` Besides the above mentioned products, a Hungarian grammar checker (called Helyesebb) and other syntax-based (and higher level ) mono and multilingual applications derived also from the basic Humor algorithm are under development."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": [
        "I;or 01lM partners there is a well-delined to Humor.",
        "MoBiDic's language Tecilie and not application specilicpatts need not be multiplied because vocabularies of the same Ian guages use a single C07111/1011 morphological knowledge base."
      ]
    }
  ]
}
