{
  "info": {
    "authors": [
      "Gerrit Rentier"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2130",
    "title": "Dutch Cross Serial Dependencies in HPSG",
    "url": "https://aclweb.org/anthology/C94-2130",
    "year": 1994
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We present an analysis of Dutch cross serial dependencies in Head-driven Phrase Structure Grammar ([P&S(1994)]).",
        "We start out from the assumption that causative and perceptual verbs, like auxiliaries, can lexically 'raise' the arguments of the non-finite verbs they govern to their own list of arguments through \"argument composition\" ([H&N(1989)])."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Dutch cross serial dependencies (DCSDs), well-known from (1) and (2), still challenge computational linguistics for an efficient treatment.",
        "(1) dat ik, hair, de nijlpaarden, zag1 voeren, that I her the hippos saw feed \"that I saw her feed the hippos\" (2) dat ik, Henk, haar3 de nijlpaarden3 zag, that I Henk her the hippos saw helpen, voeren3",
        "help feed \"that I saw Henk help her feed the hippos\" The problematic aspects of DCSDs are of course the bounded discontinuous relation between the NPs and the verbs of which they are arguments, indicated in (1) and (2) by the subscripted integers, and the recursiveness of the phenomenon.",
        "The construction is only licensed by members of two closed classes of verbs, the class of perceptual verbs like zien(\"see\"), horen(\"hear\") and voelen(\"feel\"), and the class of causative verbs like laten(\"let/make\") and helpen(\"help\").",
        "In the analysis put forward here we emphasize this lexical aspect of the phenomenon; in our analysis DCSDs are strictly tied to the subcate-gorization and semantics of perceptual and causative verbs.",
        "We analyze them as verbs which select, apart from their subject, a nonfinite V-projection which denotes an event.",
        "More particularly, as is proposed for German auxiliaries in [H&N(1989)], they subcatego",
        "rise for the arguments of the verb they govern, a mechanism frequently referred to as argument composition or argument inheritance.",
        "Recently DCSDs have been analyzed in a non-standard version of IIPSG1 in [Reape(fc.)].",
        "In his so-called sequence union approach, the standard concept of phrase structure grammar (i.e. that a string is defined as the terminal yield of a phrase structure tree) is abandoned.",
        "Our analysis is more standard, in the sense that we only need to refer to the lexicon and the HPSG-mechanism of structure sharing.' Our preferred explanatory mechanism, argument composition, is not so much an additional mechanism as an effect which derives from careful specification of structure sharing, and structure sharing is already at the theoretical core of HPSG.",
        "Furthermore, argument composition is independently motivated, because Dutch is like German with respect to the phrase-structural behaviour of auxiliaries, and argument composition in German constructions with auxiliaries is well-motivated ([11&N(1989)]).",
        "So we have good reason to assume argument composition present in the theory, regardless of DCSDs."
      ]
    },
    {
      "heading": "2 Event Semantics in HPSG",
      "text": [
        "The choice of semantics in terms of a theory of events, known from [Davidson(1967)], offers interesting advantages and explanations of logical and linguistic phenomena, motivating the development of a constraint-based version of it.3 So, in the spirit of event semantics we propose that main verbs like voeren(\"feed\") in (3) should denote a discourse referent, which is in fact a very natural assumption.",
        "In (3) and throughout the paper, recurring kis indicate structure sharing, that is token-identity of information, as is common usage in HPSG.",
        "Note also that we follow [Borsley(1987)] in representing subjects as values of SIJBJ and follow [P&S(1994)] (chapter 9) in representing non-subject",
        "arguments as values of cow's. (3)",
        "The constraint-based event semantics of the base form verb uneven as it is depicted in (3), with the quasi-determiner HVHNT, should be interpreted as an existentially quantified event with a parameter L41 which is restricted to involve a relation of feeding, an argument with the role of agent which is associated4 with a semantic content L2 and an argument associated with a semantic content 3 which is the theme' Here the value of DKr is a 'shallow' representation of a quantifier,8 and the value of PARA, which is an abbreviation for 'parameter', is structure shared with the value of a feature INST which is short for 'instance'.",
        "We will suppose that the value of PARA corresponds with a discourse referent in the discourse representation associated with a natural language expression, without formally defining this relation here.",
        "The value of REsTR, which abbreviates 'restrictions', is a set of constraints on the value of this parameter."
      ]
    },
    {
      "heading": "3 An Argument Composition Analysis",
      "text": [
        "We assume that the clause structure of DCSDs is one where we have a binary left-branching verbal complex.",
        "This verbal complex then locally selects the sum of the arguments of the verbs which constitute it.",
        "We feel that a binary branching analysis is empirically motivated by auxiliary flip in the same way as auxiliary flip motivates a binary right-branching structure for the German verbal complex, following [H&N(1989)].",
        "'Here and throughout the paper, \"C*\" means \"feature structure ‘I?",
        "with as CONTENT Valve We assume that our constraint-based event semantics is inductively translated to a level of underspecified logical form, and that this ULF-level then can be mapped to a level of logical form and a model-theoretic interpretation.",
        "The auxiliary levels are not defined here, but cf.",
        "[Rentier(ins.)].",
        "'The concept of semantics we will outline here will be shallow for instance in the sense that we do not discuss quantification as it is commonplace in formal semantics.",
        "However, cf. chapter 8 of [IStS(1994)] for discussion of a treatment of quantifier scope which could he combined with our approach, if so desired.",
        "A governing auxiliary will apply argument composition and raise all the complements from the governed verb(s) to become arguments of the auxiliary, as proposed in [H&N(1989)].",
        "We assume that causative and perceptual verbs syntactically behave just like auxiliaries in this respect.",
        "The difference between auxiliaries on the one hand and perceptual and causative verbs on the other we view as basically semantic.",
        "We take it that auxiliaries semantically more or less operate on events, affecting features for tense and aspect or modality.",
        "Causative and perceptual verbs on the other hand will be analyzed as events themselves, events which take other events as their argument, in general as a theme (viz., a value of Ai tc2, cf. the entry in (7) below).",
        "hi chapter 9 of [P&S(1994)] the approach to local selection from [Borsley(1987)] is developed further and leads to the Valence Principle, which refers to the valence features SUEJ and COMPS through 'F':",
        "(4) Valence Principle Chapter 9, [P&S(1994)] In a headed phrase, for each valence feature F, the value of the head-daughter is the concatenation of the phrase's value with the list of SY NSEM values of the F-daughters' value.",
        "The general effect of the principle on a phrase which is headed by some sign is that this headed sign can only become 'complete' (or \"saturated\") if it is combined with the appropriate arguments.",
        "For example, in the case of a transitive verb, such a verb must find a subject NP (selected through SERI) and some oh-ject (selected through cimft'S).",
        "If we assume a flat clause structure analysis of Dutch and we furthermore assume lexical signs like (3) and (7), then the immediate dominance statements (5) and (6) will suffice to describe the construction of Dutch we are concerned with here.7 Here the 11,S and C indicate that the daughters of the phrase include a head, a subject and complements, not necessarily in that order (cf. chapter 9 of [P&S(1994)] for details).",
        "Note that in addition to the valency features S U13.I and cow's, we also assume the presence of the Gov-feature, ranging over l complements",
        "(5) X.P[LEx--] –> S,C,,.., ), (6) X[i.t.x-f] - Ii[Gov ( ), 1,tx-f] ,",
        "The second schema is in a sense not a \"phrase\" structure schema but is instead a \"cluster-formation\"schema.",
        "This is because normally the combination of two or more words leads to a sign which is I,f;x phrasal sign, but here it leads to a 'complex.",
        "word' which is 1,10C+.",
        "Also (6) is strictly binary: it takes one argument, namely the argument which is the value of"
      ]
    },
    {
      "heading": "RESTR",
      "text": [
        "GOV.",
        "We arrange the lexicon so that any value of Gov will always be an unsaturated base form verb which is defined as LEX+ as well.",
        "By the Valency Principle, this selection requirement of the governing verb will be appropriately 'cancelled' after string concatenation during parsing.",
        "Central to our analysis of the case-markings of NPs in the Dutch Mittelfeld is the assumption from [Pollard(fc.)]",
        "that base forms of verbs do not assign any case to their subject.",
        "The value for the subject-NP's CASE-feature in (3), \"CASE\", is the supertype in the type hierarchy for those atomic types that are appropriate values of the feature CASE.",
        "So, the value cAsE is the supertype of NOM and Acc in Dutch and English, and in German also of CAl and GEN.",
        "The result of assigning the subject-NP this supertype for case in practice boils down to giving this NP some kind of \"any\"-value for case; the case-value CASE of such an NP will unify with any other possible case value.",
        "In our analysis, the discontinuous relation between arguments and verbs in DCSDs is brought about firstly by lexically defining finite perceptuals like zag (and finite causatives) as argument composition verbs, along the following lines:9",
        "The finite argument composition verb zag selects a singular nominative NP through its SUBJ-feature.",
        "As non-subject arguments it selects through its COMPS-feature first the NP tagged as 5 which is unified with the SUBJ-value of the governed verb(s), and secondly the list LI.",
        "I of zero or more non-subject arguments of the governed verb(s).",
        "And crucially, being a governing verb, zag selects through GOV a governed base form verb,19 with as SUBJ-value \", as COMPS-value",
        "' and as semantics \"T '.",
        "Note that, since the governed V[esE] is selected as missing a subject and a list of complements, it must not 'find' this subject or these complements, which it indeed doesn't (cf. the tree in Figure 1).",
        "As it were in passing, the governing perceptual verb (or causative verb alike) imposes accusative case on the NP which denotes the subject-argument of the governed verb.",
        "The unification of [CASE CASE] and [CASE Acc] will be forced through the structure-sharing indicated in (7) as \"EP , and will result in the more specific restriction [CAW.",
        "Acc].",
        "This accounts for the accusative case-marking on hoar (\"her\") in examples (1) and (2), and in general on all non-subject arguments in such constructions.",
        "The second and crucial step in our account of the discontinuity is accounting for the linear order in the verb cluster with DCSDs.",
        "The linear order of the verb cluster in Dutch we account for through (8):",
        "(8) Linear Precedence Rule Dutch Verb Clusters [GOV (x)] <X (9) Linear Precedence Rule German Verb Clusters X < [GOV ( X )]",
        "By these LP-rules, in each part of the binary branching verb cluster the governing verb will appear head-initial in Dutch, and head-final in German.' It is straightforward to show that the above approach has the desired effect also for the sentence (2) mentioned in the introduction if we define a lexical entry for the causative helpen with a syntax and semantics along the same lines as the perceptual zag.",
        "The only difference must be that such nonfinite entries do not assign NOM to their subject, but \"CASE\".",
        "Other than that, there will just be additional embeddings in the semantics as well as in the verb cluster.",
        "Thus, by the ID-rule in (6) and the lexical entries for causatives and perceptuals, we account for the recursiveness of the phenomenon, cf. the tree in Figure 2."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "We extended the [H&N(1989)]-analysis of German to Dutch, accounting for the difference, resp.",
        "nested vs. cross serial dependencies, through one single LP-parameter.",
        "Also, we argued that such an argument composition approach is to be preferred over several alternative approaches, since argument composition isn't an 'additional' mechanism.",
        "Further linguistic advantages of this approach, i.e. accounts of irregular case assignments and constraints on double infinitives, are discussed in (Rentier(1994)].",
        "We are able to derive verb second constructions by standard application of",
        "the Dutch versions of the extraction lexical rules (see [Rentier(1993)]) to the verbs at the lexical level."
      ]
    }
  ]
}
