{
  "info": {
    "authors": [
      "Rieks op den Akker",
      "Hugo Ter Doest"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2150",
    "title": "Weakly Restricted Stochastic Grammars",
    "url": "https://aclweb.org/anthology/C94-2150",
    "year": 1994
  },
  "references": [
    "acl-J91-3004",
    "acl-J93-1002"
  ],
  "sections": [
    {
      "text": [
        "The proof of this theorem is analoguous to the proof of the related theorem in [2] and we will not treat it here (see [5] for a proof).",
        "Example 3.1 Consider the weakly restricted stochastic grammar (G,, A) where G(VN , VT , P, Z)",
        "The first-moment matrix E is given by",
        "The characteristic equation is given by (x)x((x",
        "For the proof of Theorem 3.3 we refer to [5].",
        "Applying this theorem to the example learns us that if q + r = 1, the grammar is consistent if and only if there is no final class of nonterminals.",
        "Looking at the grammar we see that there is a final class of occurrences if q = 1 or r 1 (or both); the final classes then are {,52},{S3} and {82, S3}, respectively; if in addition p -= 1, then the final classes are {S1, S2},{S1, Sal and {Si, S2, S3}, respectively.",
        "Hence, the grammar is consistent if and only if q-Fr <1Aq0 lAr1.",
        "Notice that if qr then all trees of an have different probabilities."
      ]
    },
    {
      "heading": "4 Equivalence",
      "text": [
        "In this section we will show that a weakly restricted stochastic grammar can be transformed into an equivalent unrestricted grammar.",
        "We define two grammars G and H to be equivalent if DL(G) DWI).",
        "The transformation is performed as follows.",
        "With each nonterminal occurrence A in the right-hand side of a production rule associate a new unique non terminal Aij; for each new nonterminal Aij copy the set of production rules with nonterminal Ai as left hand side, replace the left-hand sides with Aij and replace in the right-hand sides each nonterminal with its new (associated) nonterminal; assign probability piik to the k-th production rule with left-hand side",
        "where CA;(j) is the set of productions CA, with left-hand sides Ai replaced by Aij and the nonterminals in the right-hand sides of the production rules replaced by their associated nonterminals."
      ]
    },
    {
      "heading": "3 The probabilities to be assigned to the production rules in C71, (j) are deduced from the",
      "text": [
        ", pp ICA1): the k-th production rule in C71, (j) is assigned probability pp t. Theorem 4.1 For every weakly restricted stochastic grammar there is an unrestricted stochastic grammar which is distributively equivalent.",
        "Proof We can prove the theorem by proving that the algorithm finds for every weakly restricted grammar an unrestricted grammar that is distributively equivalent.",
        "From the algorithm it immediately follows that the languages (without the probabilities) generated by the weakly restricted grammar and the unrestricted grammar generated by the algorithm are equal.",
        "The production rules introduced by the algorithm in the unrestricted grammar cannot generate any other strings than the string generated by"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "A new type of stochastic grammars is introduced for investigation: weakly restricted stochastic grammars.",
        "In this paper we will concentrate on the consistency problem.",
        "'1:o find conditions for stochastic grammars to be consistent, the theory of multitype Galton-Watson branching processes and generating functions is of central importance.",
        "The unrestricted stochastic grammar formalism generates the same class of languages as the weakly restricted formalism.",
        "The inside-outside algorithm is adapted for use with weakly restricted grammars."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "If we consider a natural languages as a structure modelled by a formal grammar we do not consider it any more as a language that is used.",
        "Formal (context-free) grammars are often advocated as a model for the \"linguistic competence\" of an ideal natural language user.",
        "It is also noticed that this mathematical concept is far from a sufficient model for describing all aspects of the language.",
        "What cannot be expressed by this model is the fact that some sentences or phrases are more likeley to occur than others.",
        "This notion of occurrence refers to the use of language and therefore considering this kind of statistical knowledge about language has to do with the pragmatics of language laid down in a corpus of the language.",
        "With a particular context of use in mind a syntactically ambiguous sentence will often have a most likely meaning and hence a most likely analysis.",
        "Some of the shortcomings of the pure (context-free) grammar model can maybe be solved by stochastic grammars, a model that makes it possible to incorporate certain statistical facts about the language use into a model of the possible structures of sentences as we conceive them from a mathematical, formal, point of view.",
        "Natural languages are now seen as stochastic; a user of a language as a stochastic source producing sentences.",
        "A stochastic language over some alphabet is simply a formal language L over together with a probability function 0 assigning to each string a: in the language a real number ch(a0 in [0, 1].",
        "Since 0(x) is interpretedas the chance that the event x, or the event that a language-source produces x, will occur, it will be clear that the sum of 0(x) where x ranges over all possible sentences is equal to one.",
        "The stochastic language is called context-free if the language L is context-free.",
        "The usual grammatical model for a stochastic context-free language is a context-free grammar together with a probability function f that assigns a real number in [0, 1] to each of the productions of the grammar.",
        "The meaning of this function is the following.",
        "A step in a. derivation of a sentential form, in which a nonterminal A is rewritten using production p has chance f (p) to occur, independent, of which A is rewritten in the sentential form and independent of the history of the proces that produced the sentential form.",
        "The probability of a derivation(- tree) is the product of the probabilities of the derivation steps that produces the tree.",
        "The probability of a sentence generated by the grammar is the sum of the probabilities of all the trees of a sentence.",
        "So given a stochastic grammar we can compute the probabilities of all its sentences.",
        "The distribution language generated by a stochastic grammar C, .1) L(Ci), is defined as the set of all derivation trees with their probabilities, The stochastic language generated by a stochastic grammar G(iL(G), is defined as the set of all sentences generated by the grammar with their probabilities.",
        "A stochastic grammar G is an adequate model of a language L if on its basis we can correctly.",
        "compute the probabilities of the sentences in the language L. Of course this assumes a statistical analysis of a language corpus.",
        "A stochastic grammar that generates a stochastic language is called consistent.",
        "Definition 1.1A stochastic grammar G is called consistent if for the probability measure p induced by G onto the language generated by its underlying grammar:",
        "Otherwise the grammar is called inconsistent.",
        "Not all stochastic grammars generate a stochastic language.",
        "Even proper, and reduced grammars do not",
        "the weakly restricted grammar.",
        "Also it can be seen from the algorithm that the unrestricted grammar associates the same probabilities with its strings as the unrestricted grammar.",
        "Hence, the theorem holds.",
        "0 A corollary of this theorem is that for each weakly restricted grammar there exists an unrestricted grammar that is stochastically equivalent.",
        "The time-complexity of the algorithm can easily be found.",
        "We observe that, if we denote the number of nonterminals in the weakly restricted grammar by k, each step can be done in in 0(k) steps.",
        "Then the total time complexity is 0(k).",
        "We define the size of a. grammar to be the product of the number of non terminals and the number of productions.",
        "The size of the newly created grammar can be found to be polynomial in the size of the weakly restricted grammar.",
        "in GNP.",
        "Using thus fact we can simplify the way non terminal occurrences are indexed: Ago,.)",
        "(A,.0,0) denotes the occurrence of A5 (A,.)",
        "in the production ; for this production also the notation (pqr) is used and for the production Ai, a, (pq).",
        "Similarly the probability of occurrence A50},.)",
        "to be rewritten using rule (qst) is denotes by pg(p.,.)(,1.0.",
        "For the start production a special provision has to be taken: the nonterminal occurrence in its right-hand side is denoted by Ai(s..).",
        "A stochastic grammar in C1NF over these sets can then be specified by >:18(Ai)1Pi probabilities.",
        "Since we require stochastic grammars to be proper, we know that for p, q, r1, .",
        ", n"
      ]
    },
    {
      "heading": "5 Inference",
      "text": [
        "The inside-outside algorithm is originally a reestimation procedure for the rule probabilities of an unrestricted stochastic grammar in Chomksy Normal Form (CNF) [4].",
        "It takes as input an initial unrestricted stochastic grammar C in CN and a sample set E of strings and it iteratively reestimates rule probabilities to maximize the probability that the grammar would produce the sample set.",
        "The basic idea of the inside-outside algorithm is to use the current rule probabilities to estimate from the sample set the expected frequencies of certain derivation steps, and then compute new rule probability estimates as appropriate frequency rates.",
        "Therefore, each iteration of the algorithm starts by calculating the inside and outside probabilities for all strings in the sample set.",
        "These probabilities are in fact probability functions which have as arguments a string w from the sample set, indexes which indicate what substring of w is to be considered, and an occurrence of a nonterminal, say A.",
        "With these arguments, the inside probability now is the probability that the occurrence of A derives the substring of w; the outside probability is the probability that the occurrence of nonterminal A appears in the intermediate string of some derivation of string w. In what follows, we will take UN, V}, as fixed n IN, VT, and assume that VN= An Ai, A2, An} and (.t}.",
        "By definition it is required that the grammar has one production for start symbol A: A S. Parallel to the definition of generating functions for weakly restricted grammars, we have to distinguish all nonterminal occurrences in right-hand sides of productions; we remind that the probability of each production depends on the particular nonterminal occurrence to be rewritten.",
        "The inside and outside probabilities now have to be specified for each nonterminal occurrence seperately.",
        "As already stated in the introduction, the inside-outside algorithm is designed only for context-free grammars If we want to use the inside-outside algorithm for grammar inference, then the grammar probabilities have to meet the above condition in order for the roestimation to make sense.",
        "If string tt)701102 W1tv , then ouj, 0 < i < j < fad denotes the substring zw+iwj.",
        "The inside probability ./,,,j) estimates the likelihood that occurrence Apo,.)",
        "derives itnj, while the outside probability 00.0(i, j) estimates the likelihood of deriving (-) wi.A.(q.,.",
        ")j wind from the start symbol S. The inside-probability f.or string w and nonterminal occurrence A(5,.)",
        "is defined by the recurrent relation",
        "Similarly, the outside,probabilities for shorter spans of W can be computed from the inside probabilities and the outside probabilities for longer spans by the following recurrence:",
        "The second equation above is somewhat simpler than the corresponding one for unrestricted stochastic grammars, because the occurrence Ap(5.,.)",
        "for which the outside probability 077(5.0(i, k) is computed specifies the production used for creating it and consequently the probability for A7115.0 to generate win} is the sum of much less possibilities.",
        "Once the inside and outside probabilities are computed for each string in the sample set E, the reestimated probability of binary rules, Pp(q,r)(ps(), and the",
        "where 1 < k, < ICA]m The probability of a string is defined as the sum of the probabilities of all distinct derivation trees that yield this string.",
        "Definition 2.3 The probability of a string x in 1:(0,) is defined as then we know that it corresponds to a production for Ai of the form - ari, Axi where the a pH V. The production has, if it is used for rewriting occurrence A1 probability a of beMg applied.",
        "In Example 3 it will be illustrated how the terms of the generating functions correspond to the productions of the grammar.",
        "Theorem 3.1 Let.=>.",
        "a; thus the j-th occurrence of nonterininal Ai is rewritten using exactly one production.",
        "The probability that a contains the nth occurrence of nonterininal A, is given by 31,1..,,k,r(Ak)=1.",
        "Proof In general the generating function can be written as",
        "The distribution language DL(G) and stochastic language SF(G,) of a weakly restricted grammar (C. A) are defined analoguous to the distribution language and stochastic language of an unrestricted g r am mar ."
      ]
    },
    {
      "heading": "3 Consistency",
      "text": [
        "In this section consistency of weakly restricted stochastic grammars will be considered.",
        "The theory of multitype branching processes will be used to come to a similar theorem as is given in [2] for unrestricted stochastic grammars.",
        "Definition 3.1 For the j-1/i occurrence of 110711e71112- nal Ai p VN the production generating function for weakly restricted stochastic grammars is defined as:",
        "where rn,(k) is 1 if nonterminal-occurrence A, appears in the right-hand side of the k-t/i production rule with nonterminal Ai as left-hand side and 0 otherwise.",
        "Note that for each right-hand side nonterminal occurrence a dummy-variable is introduced: sjj corresponds to the j-th occurrence of nonterminal Ai.",
        "A special variable is it corresponds to the start symbol which is the right-hand side of the start production s E P of the form Z S. The generating function for nonterminal occurrence A13 entails for each production for Ai a term.",
        "If gp has a term of the form asi, Si2 si where g,i(s],r, ,sk,inno) only contains terms dependent on sr , r skAA5) and where c1 is a constant term.",
        "The terms dependent on .",
        ", Sk,12(Ak) came from productions for Ai that contain nonte.rminals in their right-hand sides and the constant terms from productions for Ai that only contain terminals in their right-hand sides.",
        "When partial derivatives are taken from gij we can just as well consider since the constant term will become zero.",
        "We know that the terms in f-/i In not contain any powers higher than 1 of the variables in it.",
        "This leads us to the insight that taking the mn-th partial derivative of fp; results in at most one term consisting of the form sk,R(A0) where f does not depend on s, and is one of the probabilities resulting from applying pi to j and some k in 1... CA,I.",
        "If we substi- tute 1 for all remaining, variables in the partial derivative we find as value for the probability that the j-th occurrence of nonterminal Ai is rewritten by the production that contains in its right-hand side non terminal occurrence The first-moment matrix for weakly restricted grammars is defined just like the first-moment matrix for unrestricted grammars: Definition 3.2 The first-moment matrix E associated with the weakly restricted grammar (7 is [eijmni Where 1 < 771 1VN and 1 < j, n < R(Ai).",
        "We order the set of eigenvalues of the first-moment matrix from the largest one to the smallest, such that pi presents the maximum.",
        "Theorem 3.2 A proper weakly restricted grammar is consistent if f]] <1 and is not consistent if p], > 1",
        "reestimated probability of unary rules, P,(0.,.",
        ")(), are computed using the following reestimation formulae:",
        "The denominator of the estimates /30(q.,.",
        ")(0,t) and /30(, 0(p8) estimates the probability that a derivation of a string w E E will involve at least one expansion of the nonterminal occurrence Apo The numerator of i10(,,)(0,t) estimates the probability that a derivation of a string w E E will involve rule Ap AgAr, while the numerator of Pr(q.,.",
        ")(0,) estimates the probability that a derivation of a string w E E will rewrite A, to a,.",
        "Thus 130(q.,.",
        ")(080 estimates the probability that a rewrite of Ap(,,,.)",
        "in a string from E will use rule A0 AsAt, and 730(q )(98) estimates the probability that occurrence A0(q.,.)",
        "in a string from E will be rewritten to a,.",
        "Clearly, these are the best current estimates for the binary and unary rule probabilities.",
        "The process is then repeated with the reestimated probabilities until the increase in the estimated probability of the sample set given the model becomes negligible.",
        "We presented the inside, outside and (estimated) production probabilities only for the nonterminal occurrences of the form A0(q.,.",
        "); for occurrences Akgr,) these can simply be found by adapting the equations we have given for them.",
        "The reestimation algorithm can be used both to refine the current estimated probabilities of a stochastic grammar and to infer a stochastic grammar from scratch.",
        "The former application can be said to be incremental.",
        "In the latter case, the initial weakly restricted grammar for the inside-outside algorithm consists of all possible CNE rules over the given sets VN of nonterminals and VT of terminals, with suitable nonzero probabilities assigned to the nonterminal occurrences.",
        "Following the technique presented in [2] we find that the production generating function is given by Usi +1 q, and that the first moment matrix E is given by {2q].",
        "We can conclude that the grammar is consistent if and only if q < 1/2.",
        "For details we refer to [5].",
        "Notice that all the different trees of string on have the same probability.",
        "Hence, they cannot be distinguished according to their probabilities.",
        "It has been noticed that the usual model of a stochastic grammar as presented above, and which we from now on call the unrestricted stochastic grammar model, has some disadvantages for modelling \"real\" languages.",
        "In this paper we present a more adequate model, the weakly restricted stochastic grammar model.",
        "We give necessary and sufficient conditions to test in an efficient way whether such a grammar defines a stochastic language.",
        "Moreover, we will show that these grammars can be transformed into an equivalent model of the usual type.",
        "The nice thing about the new model is that it models \"context- dependent\" probabilities of production-rules directly in terms of the grammar specification of the language and not in terms of some particular implementation of the grammar as a parser.",
        "The latter is done by Briscoe and Carroll [3] by assigning probabilities to the transitions of the LB-parser constructed for the grammar.",
        "In section 2 weakly restricted grammars are introduced, in section 3 conditions for their consistency are investigated; in section 4 it is proven that weakly restricted grammars and unrestricted grammars generate the same class of stochastic languages and section 5 presents the inside-outside algorithm for weakly restricted grammars."
      ]
    },
    {
      "heading": "2 Weakly Restricted Stochastic Grammars",
      "text": [
        "To add context-sensitivity to the assignment of probabilities to the application of production rules, we take into account (and distinguish) the occurrences of the nonterminals.",
        "Then, for each nonterminal occurrence distinct probabilities can be given for the production rules that can be used to rewrite the nonterminal.",
        "This way of assigning probabilities to the application 2 Although we found in [1 by Jelinek and Lafferty the (false) statement that a stochastic grammar is consistent if and only if it is proper, given that the underlying grammar is reduced.",
        "The example gives a clear counter example of their statement.",
        "of production rules seems unknown in literature, although we found some other formalisms that were designed to add context-sensitivity to the assignment of probabilities.",
        "For instance, the definition of stochastic grammars by Salomaa.",
        "in [8] is somewhat different from the definition we gave in our introduction: the probability of a production to be applied is here dependent on the production that was last applied.",
        "To escape the bootstrap problem (when a derivations is started, there is no last applied production) an initial stochastic vector.",
        "is added to the grammar.",
        "Weakly restricted stochastic grammars are introduced in [1].",
        "In the following definition CA, denotes the set of productions for Ai and 11(A.1) denotes the number of right-hand side occurrences of nonterminal Definition 2.1 A weakly restricted stochastic grammar G,, is a pair (G0, A), where G, = (VN,VT,P,5) is a context-free grammar and A is a set of functions A = c VAT} where, if j E 1.. .R(A1) and k E 1 Pi( j, Pip C [0, 1] The set of productions P contains exactly one production for start symbol S. In words, Put stands for the probability that the k-th production with left-hand side Ai is used for rewriting the j-th right-hand side-occurrence of nonterminal A.",
        "The usefullness of this context-dependency can be seen immediately from the following unrestricted stochastic grammar, which is taken (in part) from the example grammar in [3] (p. 29):",
        "Unrestricted stochastic grammars cannot model context dependent use of productions.",
        "For example, an NP is more likely to be expanded as a pronoun in subject position than elsewhere.",
        "Exactly this dependence on where a nonterminal was introduced can be modeled by using a weakly restricted stochastic grammar.",
        "Since in a weakly restricted stochastic grammar the probabilities of applying a production are dependent on the particular occurrence of a nonterminal in the right-hand side of a production, it is useful to require that there is only one start production.",
        "The characteristic grammar of a weakly restricted grammar is the underlying context free grammar.",
        "The next step is to compute probabilities for strings with respect to weakly restricted stochastic grammars.",
        "For this purpose a tree is written in terms of its subtrees (trees with a nonterminal as root) as ti00,,,I, in which q is a production, n(q) is the number of nonterminals in the right-hand side of q and tq denotes a (sub)tree with the j-th"
      ]
    }
  ]
}
