{
  "info": {
    "authors": [
      "Sandiway Pong"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2162",
    "title": "Towards a Proper Linguistic and Computational Treatment of Scrambling: An Analysis of Japanese",
    "url": "https://aclweb.org/anthology/C94-2162",
    "year": 1994
  },
  "references": [
    "acl-E91-1005"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes how recent linguistic results in explaining Japanese short and long distance scrambling can be directly incorporated into an existing principles-and-parameters-based parser with only trivial modifications.",
        "The fact that this is realizable on a parser originally designed for a fixed-word-order language, together with the fact that Japanese scrambling is complex, attests to the high degree of cross-linguistic generalization present in the theory."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Boring the past several years, the phenomenon known as \"scrambling\" has become a topic of some interest; it is of particular importance in languages like German, Japanese, Korean and Hindi among others, as opposed to fixed-word-order languages like English.",
        "Scrambling can pose both severe linguistic and computational difficulties for natural language parsers.",
        "This paper describes how these problems are dealt with in a Principles-and-Parameters-based parser.",
        "Japanese, at first glance, seems to permit fairly-free permutation of objects:",
        "(I) Short distance (VP-internal) scrambling (a) John-ga Mary-ni kono hon-o ageta (koto)' John gave this book to Mary (b) John-ga kono Mary-ni ageta (koto) (2) Short (or medium) distance scrambling to IP (a) Mary-ga John-ni sono hon-o watasita (koto) Mary handed that book to John (b) Sono hon-o John-ni Mary-ga watasita (koto) (c) John-ni sono hon-o Mary-ga watasita (koto) (3) Long distance scrambling (a) John-ga Mary-ga scum hon-o katta to omotte llrll (koto) John thinks that Mary bought that book (b) sono John-ga. Mary-ga katta to omotte iru (koto)",
        "(c) Mary-ga John-ga, Bill-ni sono hon-o watasita to omotte iru (koto) Mary thinks John handed that book to Bill (d) sono hon-o Mary-ga John-ga watasita to omotte inn (koto) (Example (1) is taken from (Tada, 1993), and (2) and (3) from (Saito, 1985).)",
        "To handle examples like these, computational linguists have sometimes adopted the straightforward strategy of adding permutation machinery on Lop of an existing formalism: for example, Becker et al.",
        "(1990) augment the Tree Adjoining Grammar (TAG) system using either: (1) multicomponent (set-based) adjunction (MG-TAG), or (2) relaxed linear prece-deuce (F0-TAG), to handle so-called \"long distance\" scrambling in German (that is, scrambling over clausal boundaries).2 This augmentation aims to directly repair the lack of permutation in ordinary TAGs by adding a mechanism that can (over)generate many different scramblings.",
        "However, as so often happens, when one turns to a richer set of examples in other languages, or the interaction of scrambling with other phenomena such as anaphor binding and weak crossover, things are not as simple as they appear and the straightforward solution breaks down.",
        "An altogether different approach is taken in this paper.",
        "The goal is to produce an analysis of scrambling that works for different languages and a wider variety of examples wiihoui introducing new machinery.",
        "The essential idea is to rely on the same (universal) constraints and parsing algorithms already in place for non-scrambling languages, e.g. English.",
        "In other words, we adopt the null hypothesis.",
        "So, we begin with a computationally-modelled linguistic framework that is already capable of handling scrambling as the deductive result of interactions of basic principles, such as general movement (Move-n) with Binding theory.",
        "The point is that scrambling (like the so-called \"passive\" and \"dative\" constructions) obeys the same restrictions already shown to be operative for other syntactic phenomena, and so should follow from in",
        "dependently justified principles; this is why it should be easy to add.",
        "hence we gain, ahnost \"for free\", all account of its (rather subtle) interactions with previously described phenomena ---- not handled in the (Becker et al., 1990) account,.",
        "As we will see, the system directly handles a surprisingly large number of examples from the recent literature.",
        ":However, as can be expected our experiments do reveal some surprises.",
        "The thoroughness of the parser in exploring all possibilities leads it to derive alternative analyses that are identical save for the presence of string vacuous scrambling.",
        "We note here that under more recent conceptions on Inovement e.g. (Chomsky, 1990), such options are never taken.",
        "Here, we will simply eliminate the unwanted alternatives without compromising empirical coverage by assuming that scrambling must he non-vacuous in the sense that every instance must.",
        "be visible.",
        "We will translate this non-vacuity constraint into the lit(k)-parsing framework, and exhibit two different implementations, and end with a comparison of their computational efficiency.",
        "liut first, we consider a much wider variety of scrambling examples, including both positive and negative data (since scrambling in Japanese is not completely free), to show that simply adding permutation machinery to a base grammar cannot be descriptively adequate."
      ]
    },
    {
      "heading": "2 Interactions with Scrambling",
      "text": [
        "Sentences (I) (3) showed that Japanese exhibits non-clause-bounded, or long distance, scrambling as well as clause-bounded scrambling.",
        "Multiple scrambling is also possible; see (2b), (2c) and (3d).",
        "In each case, the ni- and o-marked objects have both been scrambled.",
        "Note that (3d), the long distance case, is classified by Saito as \"unnatural but, perfectly grammatical\":",
        "(3) (d) scum Mary-ga.[, John-ga ti walasita to] omotte irit (koto)",
        "By drawing on (Saito, 1985),(1992) and ('Lida, 1993), and by extension, on the extensive literature cited there, this section will summarize the data showing that Japanese scrambling is not only productive, but far from simple, exhibiting many subtle and complex interactions."
      ]
    },
    {
      "heading": "2.1 Basic Assumptions",
      "text": [
        "It is not surprising that there are differences between the model described here and the theory assumed by Saito (1985).",
        "Originally, the system was designed to parse all and only the English sentences from \"A Course in 011 Syntax\" (Lasnik Uriagereka, 1988).a In subsequent work, see for example (Berwick k Fong, 1992), the system has been extended to handle basic examples in Japanese (from (Lasnik k Saito, 7984))",
        "and Dutch.",
        "The basic modules in the current system are as follows: • Move-a.",
        ": with substitution and adjunction being the two basic operations and Subjacency.",
        "Also, that movement leaves traces.",
        "• Binding theory, namely, Free Indexation along with Conditions A, 13 and C. Plus a simple PRO Control module.",
        "• Case theory: structural and inherent Case, the Case filter and conditions on traces.",
        "• Theta theory: including the Theta Criterion.",
        "• Quantifier raising (QR) and Wh-movement at Logical Form (1,10).",
        "• The Empty Category Principle (1X I')operating at LI° and S-structure.",
        "• Elements of Full Interpretation at LF including licensing operator/variable constructions, reanalysis of A-hound pro-forms, quantifier scoping, Wh-Comp condition from (Lasnik & Saito, 1984), and the like.",
        "• Functional Determination for empty NPs.",
        "We make use of the following classes: variables, anaphors, pro and PRO, traces and empty operators.4",
        "In all, there are about thirty principles.",
        "We assume basic phrase structure is binary branching and generated in accordance with X-theory and the Projection principle.",
        "Furthermore, we currently assume only two functional categories, I and C, no VP-internal subjects, and finally that Japanese has SPEC(CP) only for 1,10 movement and empty operators at S-structure (to handle relative clauses).",
        "Figure 1 shows a typical example of Japanese phrase structure as produced by the parser.",
        "Lot: scrambling, we will add two assumptions: -I.",
        "It is movement by adjunction in syntax; adjoining to either VP (short-distance) or IP (medium or long), and 2.",
        "The landing site is (tentatively) in an A-position.",
        "Part of the evidence for assumption (I) will come, of course, front the data below; in other words, scranr-1)fing obeys the same kinds of constraints as for regular movement,.",
        "As for the reasons for VP and IP, arguments are given in (Saito, 1985).",
        "Assumption (2) which will be revised later differs from (Saito, 1985), where it is assumed that scrambling is A-movement.",
        "Despite this difference, it is surprising to see how many of Saito's examples actually go through.",
        "We note here that the A/A-distinction is a crucial one since so many principles, e.g.",
        "Binding conditions, Abound pro-form"
      ]
    },
    {
      "heading": "'For a detailed description of the theory and inipleinenta- a Obviously, space limits us to a brief listing of the principles.",
      "text": [
        "Lion, see (long, 1991).",
        "However, note that this by no means a fixed nor exhaustive list.",
        "reanalysis and the ECP, and therefore analyses, turn on it.",
        "Much has also been written on this issue as it relates to scrambling in other languages, see (Mahajan, 1990) on Hindi and (Webellimth, 1989) on Germanic languages."
      ]
    },
    {
      "heading": "2.2 Scrambling and Binding",
      "text": [
        "Our goal in this and the following sections is to reinterpret the data in terms of the implemented theory outlined above, and see how far we get.",
        "We will point out any oddities and problems along the way.",
        "All examples are taken from (Saito, 1985) and have been verified to work on the parser unless otherwise stated.",
        "(4) (a)* Karel-ga Mary-ga johni-ni okutta tegami-o mada yonde inai (koto)5 (b) Mary-ga Johni-ni okutta tegami-o karei-ga mada yonde inai (koto)",
        "The letter that Mary sent to John, he has not yet read it",
        "(c);?",
        "Masao-ga otagaii-no sensei-ni karerai-o syookaisita (koto) (d) Karerai-o Masao-ga otagaii- no sensei-ni syookaisita (koto)",
        "Themi, Masao introduced ti to each otheri's teachers In each case, scrambling the pronoun or anaphor saves the ungrammatical sentence.",
        "(4a) is straightforwardly ruled out by Condition C of the Binding theory since",
        "kare binds John.",
        "(4c) and (44) from (Saito, 1992) are also handled by Binding theory.",
        "In (4c) olagai is unbound which violates Condition A (all anaphors have to be A-bound).",
        "In (4d) it is A-boimd since we have assumed scrambling to A-positions.",
        "hence, these data involving the scrambling of anaphors and pronouns constitutes evidence that scrambled elements obey the usual principles."
      ]
    },
    {
      "heading": "2.3 Scrambling and Weak Crossover",
      "text": [
        "Weak Crossover (WCO) effects are a well-known phenomenon in English.",
        "For example:",
        "(5) (a) Who; loves his; mother (b)* Who; does his; mother love",
        "(5a) can be interpreted Os asking the question for which person a, loves a, 's mother.",
        "Crucially, (5b) cannot be interpreted as asking the question: for which person s, a's mother loves a.",
        "In the parser, the unavailability of (5b) is explained by an LF principle, Reanalyze Pro-Forms, which reanalyzes as variables those pro-forms (e.g. pronouns) bound by an operator in an A-position, as suggested by the above logical analysis.",
        ":however, this fails when the pro-form intervenes between the operator and its trace, as is the case in (51)).",
        "Johni-o karei-no hahaoya-ga. aisiteru Johni, hisi mother loves John-wa Mary-ga prof yomu maeni sono honi-o yonda John read that booki before Mary read John-wa Mary-ga prof yomu maeni dono honi-o yonda no Which booki did John read before Mary read iti (d) Done honi-o John-wa Mary-ga prof yomu maeni yonda no SoiLui-no hahaoya-ga darei-o aisiteru 110 Who; does `the guyi's' mother love (f) ?",
        "Darei-o soitui-no hahaoya-ga aisiteru no (g)* arerai-o Masao-ga otagaii-no sensei-ni fianako-ga ti hihansita to Ma (koto) ']Terri, Masao said to each otheri's teachers that Ii anako criticized ti (h)* Soitui-o hitome mita hito-ga Mary-ga daret-o sukininaru to omotta no The person who took a glance at the guyi thought that Mary would fall in love with whoi (i) * Darei-o soitui-o hitome mita Vito-ga Mary-go li sukininaru to omotta no We note the following:",
        "• In (6a), John \"crosses over\" karc.",
        "However, since John scrambles to an A-position by definition, the parser correctly reports no WCO violation.",
        "In Saito's original Abased account, this example is problematic.",
        "• (61)) and (6c) show WCO effects can be found even with empty pronouns (pro).",
        "'Hie parser rules out (6c) since dono hon., mist raise at ix to fire matrix clause.?",
        "No W(A) violation is reported for the scrambled counterpart (6d).",
        "This is coin-Patible with the A-position hypothesis.",
        "Running the parser produces the 1,1' structure in figure 1.",
        "• (6e) from (Saito, 1992) is the Japanese counterpart, of the English WC() violation (51)).",
        "As expected, it is ungrammatical.",
        "On the A-hypothesis, (6f) would he predicted to lie as had as (GO.",
        "• (6g) and ((ii) are both examples of long distance scrambling from (Saito, 1992) and (Tada, 1993)).",
        "We need to assume that long distance scrambling is to A-positions to account for this Under W(A), as in ('Calla, 1993).",
        "We retain 1Fine A-position option for short distance scrambling only.8 This is currently implemented as a stipulation.",
        "Note, empirical support for this dichotomy conies from Hindi, see (Maltajan, 1999).",
        "Scrambling, by its interactive nature, also reveals shortcomings in the implemented theory.",
        "We now turn our attention to data not handled in the parser from (Saito, 1992):",
        "(7) (a)?",
        "Dono Masao-ga Ranako-ga, li tosyokaffkara karidasita lea siritagatteiru koto 'Ile fact that which hook,,, Masao wants to know Hanako checked out ti from the library (b) Zibunzisini-o Hanakoi-ga ti hiliansita (koto)",
        "flerselfi, llanakai criticized Our essentially \"for free\" approach breaks down here.",
        "So far we have been successfully relying on existing principles to see us through the maze of scrambling facts.",
        "As Saito observes, ECP blocks the 1.1?-lowering 'An interesting point is that the similar sentence: karei-ga tt syookaisita (lame) cited as an example of a crossover violation is traced to other reasons in the framework of the parser.",
        "It reports a Condition H violation irrespective of the API-status of John.",
        "The trace i functions as PRO since it is locally Abiound by (hare) with an independent 0-role.",
        "Since the trace is an argument, it will violate one of the Binding Conditions.",
        "of Juno hon-o in (7a).9 However, in contrast to typical cases of FAT violations, Saito classifies (7a) as only being mildly ungranunatical ziban-zisin A-binds Ilanako in the (grammatical) example (7b).",
        "however, the parser reports a Condition C violation.",
        "According to Saito, the former case can be handled by making traces optional, and the latter by applying some form of Mt Reconstruction.\"",
        "We note that.",
        "neither proposal is generally considered to be scrambling-specific and therefore points to the general incompleteness of the implemented system."
      ]
    },
    {
      "heading": "2.4 Scrambling and NQ Float",
      "text": [
        "As a final case, consider the phenomenon of Numeral Qumitifier (NQ) float, as shown in (8).",
        "Saito lyzed (8d) as an instance of scrambling, i.e. sake has been scrambled out to IP.",
        "Leaving aside the structure of NQ-NP, it, is not clear whether yaklisci in (81)) undergoes scrambling.",
        "Since Saito assumed that subjects do not scramble for inherent, Case reasons - thereby explaining the migrant-maticality of (80, it appears not to be the case.",
        "I Finally, we observe that there are other cases we have not, tested, such as clausal and adjunct scrambling, the effects of Subjacency, and the distinction between medium and short, distance scrambling."
      ]
    },
    {
      "heading": "3 Scrambling and Computation",
      "text": [
        "Although'Japanese scrambling is complex, we have seen that by leveraging existing principles, many examples of short 1-ind long distance scrambling can be accommodated almost without change to the existing theory.",
        "At first glance, the same seems to he the case for computation.",
        "General phrase structure including the additional adjunction to II' and VP is covered by the existing 1,11,(1)-based bottom-up shift-reduce parser (Knuth, 1965).",
        "The relation between a scrambled object and its launch site is computed as one part of the general rule of movement, Move-a )2 °Two points: (1) Saito refers to the Proper Binding Condition rather than the FCP.",
        "(2) demo loon-o lowers fin the same reason it raises in (6c).",
        "See note 7. to We note here that the interaction between Ileconstrum thin effects and scrambling is also discussed in (Multi, 1993).",
        "The problem that arises is that the parser produces extra parses not eliminated by the existing principles, involving vacuous scrambling of the form shown in figure 2.",
        "Let us define the obvious notion of \"non-vacuous\" or visible scrambling as scrambling that \"passes over\" one or more overt elements at S-structure.",
        "Adopting this definition immediately eliminates cases (a)--(c), and more importantly, the repeated application of case (a) which causes parsing non-termination.13 In particular, this rules out vacuous scrambling over empty subjects, e.g. pro or PRO.",
        "As far the data from (Saito, 1985),(1992) and (Tada, 1993) goes, this is no restriction at all.",
        "This leaves case (d) which is vacuous only when considered as a \"pair\", i.e. each sub-instance is clearly non-vacuous.",
        "We will make use of the following assumptions:",
        "1.",
        "Scrambling is always to the left.",
        "2.",
        "Empty NPs don't scramble.",
        "Again, judging from the data, these appear to be no restriction all.",
        "Now, it is simple to implement the non-vacuity (NV) constraint as a licensing condition on phrasal adjunction: IPi sNP, {NV(x)} VPi sNP, VPi(x), {NV(x)} Here, we assume that there are two phrasal adjunction rules, for IP and VP, that introduce scrambled NPs (sNPs).14 Here, {NV(x)} is a semantic action which checks the frontier of x, the (P or VP phrase, for non-vacuity using the following left-to-right, two state machine: State 0: (Start) See an overt node, go to State 1.",
        "State 1: (End) Skip until see an NP gap, halt.",
        "Note tins is potentially inefficient since the NV constraint is only checked when the Lit-machine completes the RHS of a rule, i.e. when it completes an IP or VP phrase.",
        "By operating at the level of the terminal string, instead of waiting for the complete IP or VP, 13 Note that the string vacuous empty operator movement shown in (c) does not count as an instance of scrambling.",
        "It's not adjunction at VP or IP.",
        "\"The tricky case of (d) shown earlier can be handled by restricting sNP to overt NI's only.",
        "we can take advantage of the fact that scrambling is always to the left to implement the non-vacuity check in a strictly left-to-right fashion.",
        "As before, when we see a potentially scrambled NP, we start the two state machine.",
        "Here, the basic idea is that a shift action (read a terminal) corresponds to the state 0 to state 1 transition.",
        "Similarly, a NP – , A reduce action corresponds to the \"see an NP gap and halt\" part.",
        "Comparing the two algorithms on 50 Japanese sentences (25 scrambling examples) from (Saito, 1985) Si (Lasnik & Saito, 1984), an average speed-up factor of 2.3 per sentence and a total of 3.2 over the 50 sentences was observed for the second algorithm over just the phrase structure recovery portion.",
        "Due to the varying effects from the participation of other principles, the improvement for the total parsing time was less clearcut, generally varying between no speed-up at all to a factor of two depending on the sentence.",
        "Using the 25 non-scrambling examples from the test set, an additional experiment between two variants of the parser, one with and one without the ability to handle scrambling, showed that the ability to handle scrambling exacts a penalty of about 30-.50% in total parsing time, In conclusion, given the perhaps disproportionate effect of scrambling on parsing time, we suggest that although scrambling comes virtually for free linguistically speaking, the same certainly does not appear to be the case for computation."
      ]
    }
  ]
}
