{
  "info": {
    "authors": [
      "Hervé Blanchon"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-1017",
    "title": "Perspectives of DBMT for Monolingual Authors on the Basis of LIDIA-1, An Implemented Mock-Up",
    "url": "https://aclweb.org/anthology/C94-1017",
    "year": 1994
  },
  "references": [
    "acl-C92-3165"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "DBMT is researched here in the context of future systems for the general public, where a monolingual author wants to translate into several languages.",
        "We have produced a complete mock-up, LID1A-1, which demonstrates how a French II yperCardim stack could be translated into German, Russian and English.",
        "We present the computational, linguistic and ergonomic aspects of the mock-up, and discuss them in the perspective of building an operational prototype in the future."
      ]
    },
    {
      "heading": "Keywords",
      "text": []
    },
    {
      "heading": "Introduction",
      "text": [
        "Our Lumn project aims at studying the concept of `Personal Machine Translation', or more precisely, 1)13MT for monolingual authors [Bonet & 11lanchon 19931, in a multilingual setting.",
        "We have now completed the first implementation of a mock-up, I.11)1A-1.",
        "Working on a mock-up first, and not on a prototype, has made it possible to tackle all aspects of such future systems, computational, linguistic and ergonomic.",
        "Even if we could not solve all problems, we fell they are put in perspective.",
        "Almost all other attempts in the direction of 1)13MT have considered only some aspects of the paradigm, leading to unbalanced and sometimes inadequate architectures.",
        "Before a demonstration which shows the principles of the translation process, we present an overview of the context of the mock-up.",
        "Then, we give some more details about the mock-up itself, the implementation techniques used and the principles of (he interactive disambiguation process.",
        "Finally, we discuss some important points (interface, implementation techniques and tools, and disambiguation process) of the mock-up in the perspective of building an operational prototype in the future."
      ]
    },
    {
      "heading": "1. Framework",
      "text": []
    },
    {
      "heading": "1.1. The DBMT",
      "text": [
        "Interactive MT was first proposed in the sixties by M. Kay for the MINI) system [Kay 19731, and several projects experimented with variations of this design, notably the us project [Melhy 19811 at Provo (75 - 81), the Alvey N-tran project [Wood 19891 at Manchester (85 - 87), the DLT project [Sadler 19891 at Utrecht (82 - 88), the I.MT project [Rimon, et a!.",
        "19911 from 1989 at several IBM research centers, and the JETS project 1Tsutstuni, et a!.",
        "1993] fom 1989 at IBM Tokyo Labs.",
        "In KBM'l'-89 [Goodman & Nirenburg 1991] at CMU-CCL, questions were also asked by the \"augmentor\" if ambiguities could not he solved by the ontology.",
        "Among those projects where an interactive disambiguation component was integrated, we were inspired by: -- the interface proposed in KBMT-89, the pattern-based disambiguation process used for several ambiguities in LMT, – the distributed architecture of JETS."
      ]
    },
    {
      "heading": "1.2. The LIDIA-1 mock-up",
      "text": [
        "We have chosen a well-defined situation as regard to the profile of the task and the profile of the user.",
        "We have integrated the use of an interactive disambiguation process at the very beginning of the design.",
        "This means that the whole set of constraints was well established before we started the implementation.",
        "The translation process organization is described in [Boitet & 131anchon 1993].",
        "In the scenario we propose, a monolingual French engineer creates technical documentation, in the form of an HyperCard stack, on a middle-range Macintosh, and helps the system translate it into English, German and Russian.",
        "We have opted for a distributed architecture (author workstation on a Macintosh and MT server on a mini – IBM-4361).",
        "We have produced a demonstration stack about the linguistics ambiguity we have chosen to cope with in I:rench."
      ]
    },
    {
      "heading": "1.3. The demonstation stack",
      "text": [
        "Our demonstration stack, called 'LIMA les histoires' is made of story cards (I ig.",
        "2) and treatment cards (Fig.",
        "1).",
        "it Lunn ii.",
        "Ids loin\" Fields Trallement de PhIstolre cholsle I Le cap t tine a rappot ti; un VItS4- de Chine.",
        "is i ....-- -,, cf rrgu_Iff,f f sAfT(iff 0 i ,-, rs: a e (5..e t cep) telne rin)4(ffeel (et, repperte(1.04..nv (ent, t vese&n (de& s Chine (f.n)& e onfn) (f .0 b i ( Spnuct) 12,4 M Window Feedback buttons DIr - In 1..o, Stack Button lir",
        "A story card is a collection of two or three stories sharing an ambiguous sentence.",
        "The author is supposed to solve the ambiguities through his understanding of the stories.",
        "Here is an example of a story card (see translationsl ).",
        ".",
        ":or the purpose of the demonstration, each story is presented in a treatment card, where the context of the ambiguous sentence may be shown or hidden.",
        "Mere is the card for the story on the right.",
        "To have the story translated, the user will ask for the translation of the fields of the treatment stack.",
        "Note that the user is never interrupted by a question.",
        "Objects show they arc waiting for answers, and the user decides when and which question to answer."
      ]
    },
    {
      "heading": "2. Demonstration",
      "text": [
        "The user can choose the selection tool (✓) and select the object to be translated (Fig.",
        "4).",
        "The button of treatment state then appears.",
        "When clicking on it (fig 5), a windoid or pop-up window appears (Fig.",
        "7).",
        "Le capitaine a rapporte un vase de Chine.",
        "I Left story : 'From China, the captain has bring back a vase.",
        "This vase is English'.",
        "Right story: \"the captain has bring back a Chinese vase.",
        "Ills boat is soiled.' The task in progress is displayed in bold, the previous ones in plain, and the following ones in italic.",
        "Thus, in figure 7 the system is currently analyzing the text fragment.",
        "If the sentence has to be disarribiguated, the author is asked to answer some questions.",
        "The author is advised a new question is ready by a new item in the menu Message and by a button which appears over the concerned object as in figure 7.",
        "The user can choose to interact at once or later Le capitaine a rapporte un vase de Chine.",
        "Suppose the user clicks on the button.",
        "A first question appears (Fig.",
        "8).",
        " – arnbigulte r 11 a plusleurs Interpretations pour la phrase : Le capitaine a rapporte un vase de chine.",
        "rhelsissoz le bonne.",
        "() de Chine, le capitaine a rapporte un vase.",
        "6) Le capitaine a rapporte (un vase de chine).",
        "With the dialogue (Fig.",
        "8), the author select the attachement of 'de Chine' (Chinese).",
        "Then, a second dialogue appears (Fig.",
        "9) where the author chooses the Sense of 'capitaine'.",
        "The senses are found in l'arax, a multilingual lexical database mock-up [S6rasset 19931.",
        "Once the disambiguation step has been performed, the user can ask for the annotated forte of the text (Hg.",
        "10) which contains the syntactic class of each occurrence and the syntactic function of each phrase.",
        "treatments' progress, show the reverse translation, show the annotations, show the palette, modiq the preferences and build the target stacks.",
        "(Le.&cirt cord tolne.&4&puj (a.&„y rupportè,&v).&nv (un,&ert vase.&n (de.&s Chtneto).&comp).&obt ( Anonct)",
        "These annotations should help the user understand the structure produced by the analyser.",
        "We think that experienced users would like to shortcut some dialogues by inserting some disambiguation marks themselves.",
        "To check the translation produced in each target language, the user can ask for the \"reverse translation\".",
        "From German and for the second interpretation of the example, he get :"
      ]
    },
    {
      "heading": "3. Other aspects",
      "text": [
        "As a demonstration can not show all external aspects of the mock-up, let us now give more details about the interface, the implementation techniques, and the methodology for disambiguation."
      ]
    },
    {
      "heading": "3.1. Interaction tools",
      "text": [
        "Once the preferences have been defined, the author uses a menu and a palette to interact with The interaction with the author is made through the LIDIA menu (Fig.",
        "13), the Messages menu, a palette (Fig.",
        "14), feedback buttons (Fig.",
        "1) and windoids (Fig.",
        "l).",
        "The menu shown here otters S choices: process the selected object according to the set of preferences, process some object with a particular preference set, show the 2 'The captain has brought back a Chinese vase.' The user can also ask for the frequent treatments with a palette.",
        "In the first line are displayed the LIMA tools (process the selected object, show the treatment progress, show the annotations and show the reverse translation).",
        "In the second line are the browsing tools.",
        "The translation process is divided into two steps: the standardisation and the clarification.",
        "We have seen the clarification process during the demonstration, let us have a took on the standardization step."
      ]
    },
    {
      "heading": "3.2. Implementation",
      "text": [
        "The implementation is characterized by the use of a distributed architecture, a whiteboard approach, and object-oriented techniques.",
        "a Distributed architecture Three machines (Fig.",
        "15) are involved in the translation process.",
        "On the author's workstation the HyperCard Kernel sends and receives messages from the LIDIA kernel which organises the translation process for each object.",
        "'The LIDIA Kernel sends translation jobs to the Translation server via the Communication server.",
        "'time LIDIA Kernel also asks to prepare the disambiguation questions."
      ]
    },
    {
      "heading": "b. Whiteboard approach",
      "text": [
        "For each object to be translated, the LIDIA Kernel creates a mirror object (a text file) in which are stored all information required by the translation process and necessary for the construction of the target stack.",
        "We distinguish between static and dynamic information.",
        "Static information is what is attached by HyperCard to each object.",
        "It is necessary to construct target stacks.",
        "Dynamic information is any information used by LIDIA to translate the content of an object.",
        "These files can be considered as whiieboards as defined in [Seligman Boilet 19941.",
        "Unlike the blackboard, the whiteboard is accessed only by a coordinator (the LIDIA Kernel), and not by the components (Disambiguation kernel and RemoteMacMain-Frame).",
        "'the main advantage of this architecture is to allow easy integration of existing new components without having to modify them.",
        "c. Object oriented techniques",
        "Except the lingware, all components use object-oriented programming.",
        "The module for the Terminology, the idioms and the Typage as the kernel of the Communication server are written in HyperTalk the HyperCard scripting language.",
        "The LIDIA serveur is written with CT.OS (MCL).",
        "Although encapsulated within the same environment, the LIDIA Kernel and the Disambiguation Kernel communicate by exchanging messages and can then be distributed.",
        "The use of messages and object-oriented programming techniques is close to the actor model used in the context of distributed cooperative systems.",
        "The disambiguation process is organized around a pattern matcher [Blanchon 1992].",
        "For five out of the eight classes of ambiguity considered in the mock-up, we use a mechanism of pattern matching with unification of variables which allows to recognize the ambiguity and produce the disambiguation dialogue.",
        "A dialogue construction method is associated with each pattern.",
        "These methods rely on a set of thirteen operators.",
        "Figure 16 shows the trees produced for the sentence 'Le capitaine a rapporte un vase de Chine.' The patterns (Patron 12 & Patron 13) used to recognize the ambiguity in our example arc shown in Fig. 17.",
        "The method associated with pattern 12 is:",
        "which produces the following text: Le capitaine a rapporte (un vase de chine.)",
        "The method associated with pattern 13 is: qt:ctle (V) , a,x1:e (Y) `112xte (Z) S:xte ('r) which produces the following text: de Chine, le capitaine a rapporte un vase."
      ]
    },
    {
      "heading": "4. Towards an operational prototype 4.1. Interface",
      "text": [
        "For a prototype, the modules for the terminology and the idioms should use, at least, a lemmatizer, and with the text categorization module they should not rely on I lyperCard any more (Fig.",
        "17).",
        "Our implementation of the 'guided languages' idea is still very primitive.",
        "We hope to develop working techniques from our studies on 'utterence styles' and 'text genres'.",
        "The interfaces of the standardization 'nodules are only a first sketch.",
        "The iconic buttons used to ask for the user intervention have to be redesigned (we haven't found a good solution yet).",
        "On the other hand, the cursors for the LAMA tools and the feedback buttons are homogenous and could be kept (Fig.",
        "1 & 7).",
        "In a future work, it will he necessary to adapt the dialogue type to the skills of the author.",
        "The kind of dialogue we have developed allows only the user to select the right analysis.",
        "A new dialogue type could allow the user to get information and examples about the ambiguity currently solved.",
        "The user could then change its text or insert disambiguating marks."
      ]
    },
    {
      "heading": "4.2. Implementation techniques",
      "text": [
        "The current implementation in terms of software and hardware may he characterized as integrated, distributed and extensible.",
        "Using four servers (MIA, Disambiguation, Communication, and Translation) collaborating through messages and text files as made it relatively easy to integrate tools running in different hardware and/or software environments.",
        "For using DBMT at home, a simple communication server could pilote a modem to request services from a LIMA server, exactly as a mail utility.",
        "With such an architecture, a low-cost personal computer would be usable for authoring and translating.",
        "Using object-oriented programming techniques makes the system easy to customize."
      ]
    },
    {
      "heading": "4.3. Implementation tools",
      "text": [
        "The dictionaries used by the Ariane-G5 lingware are build from Paiax [Serasset & Blanc 1993].",
        "For a prototype we need a more powerful!",
        "and flexible tool, as also described in [Serasset & Blanc 1993].",
        "For developing the lingware, we have used Ariane-G5, designed for heuristic programming in the context of sublanguages.",
        "We plan to develop some new Specialized Languages for Linguistic.",
        "Programming, thereby working in the direction of `ambiguous programming' !Bonet 1993]."
      ]
    },
    {
      "heading": "4.4. Disambiguation process",
      "text": [
        "It has been clear from the beginning that we would not be able to find, for each class of ambiguity we have chosen to solve, a unique resolution method.",
        "Keeping in mind the kind of dialogues we wanted, we have examined a large quantity of ambiguity configurations and have arrived at 9 problem patterns.",
        "The use of a strategy, organizing the disambiguation process, the use of patterns and methods implemented with a set of basic operators make the process highly customizable.",
        "That's why we think about an environment for the description of disambiguation process.",
        "This environment integrates three modules: a module for the patterns definition, a module for the definition of the dialogue production methods, and finally a module for the description of the disambiguation strategy."
      ]
    },
    {
      "heading": "Conclusion",
      "text": [
        "The implementation of our mock-up LIDIA- first concrete experiment towards the DBM\"I\"for everybody', has been done 'in breadth' at first, and 'in depth' on certain points.",
        "It was very important to tackle all the aspects.",
        "Previous experiments have shown the necessity of a broad conception for a MT system to succeed.",
        "During our work we have seen that the ergonomics goals can trigger computational and linguistic choices.",
        "The situation is the same for the computational or linguistic goals.",
        "The idea of the interactive clarification approach in the context of natural language processing seems now to interest a real community.",
        "For M'I', the current work of [Wehrli 1993], [Yamaguchi, et al.",
        "1993], and the ongoing work on JETS rrsutsumi, et al.",
        "1993] are some good examples.",
        "For speech systems, the interactive clarification approach is also a solution as shown in [Frankish, et al.",
        "19921 and proposed in [Ainsworth & Pratt 1992] and [Saito 1992].",
        "As far as the future is concerned, we Lava begun to study multimodal interactive disambiguation with A'I'R-ITL in a more general framework than LIDIA-1.",
        "We hope to get adequate support for developing a more larger-scale prototype in the next few years."
      ]
    }
  ]
}
