{
  "info": {
    "authors": [
      "Hideo Watanabe"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-1003",
    "title": "A Method for Distinguishing Exceptional and General Examples in Example-Based Transfer Systems",
    "url": "https://aclweb.org/anthology/C94-1003",
    "year": 1994
  },
  "references": [
    "acl-C86-1021",
    "acl-C92-2097",
    "acl-C92-2101",
    "acl-C92-2115",
    "acl-C94-1003"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Distinguishing exceptional translation examples is an important issue in example-based transfer systems, because such systems use exceptional and general translation examples uniformly.",
        "This paper describes a mechanism for dealing with exceptional translation examples in our example-based transfer system, SimILYLti, and proposes a method for identifying such examples in a translation example-base."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In recent years, the example-based approach has been used in many areas of natural language processing [3, 7, 8, 10, 9, 1].",
        "We have been using this approach to develop a transfer system called Sim nun [13, 14, 1.6].",
        "However, a bottleneck occured in the collection of large numbers of translation examples consisting of pairs of parsed structures in the source and target languages (hereafter we call these structures translation patterns), because parsing is not a perfect process.",
        "We now have some methods for overcoming this problem.",
        "For instance, recent studies [2, 11, 6, 12] have proposed mechanisms for collecting pairs of parsed structures automatically from translation examples, and in the previous paper [15], 1 proposed a method for extracting relevant translation patterns by comparing a wrong translation result and its correct translation.",
        "Using these methods, we can now collect translation patterns relatively easily.",
        "There is, however, another problem called example interference, which means that an exceptional (or idiomatic) translation pattern is selected when a general translation pattern should be selected; this has a side-effect on the construction of a. target structure.",
        "Suppose that we have the following two translation examples from Japanese to English (el) and (e2), (el) watashi(I) Ita konpyuntaa(computer) wo kyouy-ousuru.",
        "I share the use of a computer.",
        "(e2) watashi(I) ha kuruma(car) wo tsukau.",
        "I use a car.",
        "and that we are given the following Japanese input sentence (sl): (sl) watashi(l) ha dentaku(calculator) wo shiy-oust: ru.",
        "In the above examples, (s1) is likely to be more similar to (el) than (e2), because the three Japanese verbs \"kyouyousurti,\" \"tsukan,\" and \"shiyousurit\" are all very similar,' and \"dentaku\" (\"calculator\") is more similar to \"konpytintaa\" (\"computer\") than \"lcuruma\" (\"car\").",
        "If this is the case, the English output obtained by using (el) is (t1),2 whereas it should be (t2): (LI) I use the use of a calculator.",
        "(L2) I use a calculator.",
        "This problem occurs Because example-based transfer systems choose examples simply on the basis of similarity.",
        "This can be considered by using the analogy of cells like those shown in Figure I.",
        "In the figure, a dot represents a translation example, and a cell represents a space in which an input is determined to be similar.",
        "According to this analogy, an example-based system checks the cell in which an input is located, and uses an example governing the cell.",
        "If a new example is added in this space, a cell for it is created as if cell division.",
        "If an input happens to fall into the cell of an exceptional example, it is wrongly translated.",
        "'Therefore, an exceptional example should he added as a special cell (a shaded dot in Figure I) that has no extent in the example-based space, so that it.",
        "cannot be used unless it matches the input exactly.",
        "Thus, an example-based transfer system must deal with exceptional translation patterns separately when calculating similarity.",
        "This paper describes a mechanism used in Sim 'Iran for dealing with exceptional translation patterns in the same framework as general translation patterns, and proposes a method for identifying exceptional translation patterns in a translation pattern base.",
        "'The next section describes a mechanism for dealing with such translation patterns, and Section 3 de",
        "scribes a method for identifying exceptional translation patterns.",
        "Some experiments are reported in Section 4, and some issues are discussed in Section 5.",
        "Finally, some concluding remarks bring this paper to an end.",
        "2 Mechanism for dealing with exceptional translation patterns Simlinn calculates the similarity between a subgraph of an input structure and the source part of a translation pattern on the basis of both the structural similarity and the similarity of the lexical-forms of corresponding nodes.",
        "For instance, the distance (the inverse of similarity) between two Japanese lexical-forms is expressed by the difference of their values in a Japanese thesaurus called Bunrui-Goi-Ilyou [5]3 as follows:",
        "where bghcode(w) is the code value in the Bunrui-Goi-Hyou, bghrnax is the maximal difference of the bghcodes, and d is a penalty value incurred when to, and w2 are not identical.",
        "This equation is used for lexical-forms in general translation patterns.",
        "If one is a lexical-form which requires exact-match in an exceptional translation pattern, then the distance is calculated as follows:",
        "3Bunrui-Goi-llyou is a Japanese thesaurus consisting of large trees for nominate, adjectives, and verbs.",
        "Each node is assigned a unique number.",
        "Similar concept words are located in similar positions (or assigned similar numbers) in these trees.",
        "A lexical-form has a distinctive feature that makes it possible to determine which equation should be used in calculating similarity; if one of two lexical-forms is expressed by a single-quoted string, then the distance between the lexical-forms is calculated by using the second equation; on the other hand, if both lexical-forms are expressed by double-quoted strings, then their distance is calculated by using the first equation.",
        "Thus, an exceptional translation pattern is distinguished by having nodes whose lexical-forms are single-quoted strings in its source part, while a general translation pattern is distinguished by having nodes whose lexical-forms are all double-quoted strings in its source part.",
        "Not all nodes in the source part of an exceptional translation pattern are necessarily single-quoted strings; single-quoted string nodes and double-quoted string nodes may be mixed in a translation pattern.",
        "In Figure 2, (tpl) is an exceptional translation pattern and (tp2) is a general translation pattern.",
        "Note that the root node of the Japanese part is the only single-quoted string in (tpl), and it matches only an input whose root node is 'kyouyousuru.' By using this distinction of lexical-forms, we can integrate exceptionality handling into the similarity calculation framework without separating this task as a pre-process or post-process.",
        "'",
        "3 Method for identifying exceptional translation patterns For most people, an exceptional translation pattern is likely to mean a pattern of translation for an idiomatic or colloquial expression.",
        "In general, an idiomatic translation pattern is a translation pattern whose target part is markedly different from that of translation patterns whose source parts are similar to that of the idiomatic pattern.",
        "Front the viewpoint of the transfer process, what we would like to identify are translation patterns that may have side-effects when they are selected instead of general translation patterns.",
        "We call such translation patterns exceptional translation patterns.",
        "According to this definition, exceptional translation patterns are not restricted to idiomatic patterns, in fact, more translation patterns other than idiomatic ones fall into this category.",
        "Here, we classify exceptional translation patterns into the following two categories:",
        "• Extra-Exceptional Translation Patterns: These have some extra elements in the target part in addition to those in similar translation patterns.",
        "• Intra-Exceptional Translation Patterns: These are almost same as similar translation patterns, but several target words are different.",
        "When exceptional translation patterns are found, it is hoportant to know whether two translation patterns are equivalent or not.",
        "Therefore, equivalent transla-tMo patterns are defined as follows: Given two dependency structures d1 and (12, then they are called equivalent if and only if they are structurally identical and corresponding nodes have the similar semantic code.4 Further, given two translation patterns tpi = tt, mt) tp2 (s2, 12, m2), where si is a. source part, ti is a target part, and is a mapping from 8i to then these two translation patterns are called equivalent if they satisfy the following conditions:",
        "(1) Both source parts are equivalent, and both target parts are structurally identical.",
        "(2) The roots of 11 and /2 are the same string.",
        "(3) For each node n in Mt(n) is one of translation words of n. (4) For each node n in s2, m2(n) is one of translation words of n.",
        "The algorithm for identifying exceptional translation patterns is as follows:",
        "Step 1 Divide translation patterns into several groups, each of which consists of equivalent translation patterns.",
        "Step 2 For each pair of distinct translation pattern groups 91 and 92, if any pattern of 91 is equivalent to any pattern of 92 other than nodes governed by the root of the source part, then the translation patterns in 91 and 92 are marked genera/.",
        "Step 3 For each pair of distinct translation pattern groups 91 and 92, if the source part of any pattern (pi) of gi is equivalent to the soured part of any pattern of 92, but target parts of them are not structurally identical, because pi has extra elements, then the translation patterns of 91 are marked extra-exceptional.",
        "Step 4 For each non-exceptional translation pattern group 91, if there is another general translation pattern group 92 such that any pattern (pt) of 91 is equivalent to any pattern of 92 other than the root node in the target part of pi, then the translation patterns of gi are marked infra-exceptional.",
        "Step 2 identifies possible general translation patterns if they are used in a relatively wide range of words, because in general an exceptional pattern is restricted in the usage of words.",
        "This approach, however, is not perfect for identifying general translation patterns, because there is a case such that the excep-tionality derives from a single special word.",
        "Therefore, in the next step, checking does not exclude these possible general translation patterns.",
        "Step 3 identifies extra-exceptional translation patterns by checking the structure of the target part.",
        "Step 4 then iclentifies intra-exceptional ones by comparing the root node in the target part with the root nodes in the target part of possible general translation patterns.",
        "The reason why this comparison is restricted to possible general translation patterns is that intra-exceptional translation patterns have side-effects only when they are similar to general translation patterns.",
        "Figure 3 shows an example of the identification of exceptional translation patterns, in which the Japanese verbs \"kyouyousuru\" and \"tsukau\" have the same bghcode, and the Japanese nouns \"kuruma,\" \"denwa,\" and \"mahou\" have different bghcodes, on the other hand, \"kuruma\" and \"jitensya\" have the same bghcode.",
        "First, step 1 divides these translation patterns into four groups: group 1 consists of (tpl), group 2 consists of (tp2) and (tp3), group 3 consists of (tp4), and group 4 consists of (tp5).",
        "Step 2 identifies group 2 and 3 as general translation patterns, because \"kuruma\" and \"denwa\" have different bghcodes.",
        "Subsequently, step 3 identifies (tpl) as an extra-exceptional translation pattern, because (tp1) has extra elements \"the use of\" for (4)21).",
        "Further, step 4 identifies (tp5) as an intra-exceptional translation pattern, because (tp5) is equivalent to the general translation patterns (tp2), (tp3) and (tp4), other than \"use\" and \"practice\" in the root nodes of the target parts."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": [
        "We have tested the above-mentioned algorithm with translation patterns in a Japanese-to-English transfer dictionary that was previously used in our laboratory.",
        "For each bghcode, we collected translation patterns such that the root of the source part has the code, and applied the algorithm to the translation pattern set of each category.",
        "Table 1 shows the resulting top 10 categories with respect to the total number of occurrences.",
        "In most categories, more than 90% of translation patterns were identified as exceptional.",
        "The reason for the lopsidedness of this result is that the translation patterns described in the previous transfer dictionary were almost all exceptional cases that could not be dealt with by the default procedures coded in the transfer module.",
        "Therefore, this result indicates that the algorithm is able to idenitfy exceptional translation patterns correctly."
      ]
    },
    {
      "heading": "5 Discussion",
      "text": [
        "In conventional transfer systems [4], transfer rules are roughly divided into general ones and exceptional (or idiomatic) ones.",
        "The transfer system checks the exceptional cases first, and if they cannot match the input then the system applies general rules.",
        "On the other hand, example-based transfer systems deal with translation patterns (or examples) uniformly on the basis of similarity, according to the example-based principle.",
        "This mechanism causes the example interference problem.",
        "A very useful property of the example-based approach is that it allows a sentence to be added as an example if it cannot be dealt with properly.",
        "'Phis holds if the same input as the newly added example is given, but when the resolution of the similarity calculation is not enough, an input that is similar to but not exactly the same as the added example may not be dealt with properly, because there may be another similar example that is exceptional.",
        "'Therefore, it is very important to identify whether an example is general or exceptional.",
        "After application of the algorithm described in this paper, translation patterns are classified into the following categories: general, exceptional (extra- and intra-), and neutral.",
        "Neutral translation patterns, which are not marked general or exceptional, are",
        "translation patterns that do not have side-effects.",
        "They are not used for a wide variety of words in the current translation pattern base.",
        "If more translation patterns are added later, they may be identified as general or exceptional.",
        "By this method, one can enable the system to identify exceptional translation patterns automatically by adding some general translation patterns similar to them.",
        "This is a very useful feature for bootstrapping of a translation pattern base.",
        "A weak point of this algorithm, however, is that it requires a large number of translation patterns.",
        "If enough translation patterns are not given, exceptional translation patterns might not be identified.",
        "However, collecting many translation patterns is no longer a serious problem, since several methods for collecting them automatically have_ been proposed in recent studies [2, 11, 14, 6].",
        "The method proposed in this paper probably does not comply with human intuition regarding idiomatic translation patterns; rather, it detects translation patterns that are idiomatic for the system, in other words, patterns that might have side-effects in the current set of translation patterns.",
        "It probably requires deeper semantic processing to identify translation patterns that are idiomatic in the conventional sense."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "In this paper, we have shown a problem of example-based transfer systems, example interference, and described a mechanism for dealing with exceptional translation patterns and general translation patterns uniformly in similarity calculation without destroying the whole framework of example-based processing.",
        "I.1'urther, we have proposed a method for distinguishing exceptional translation patterns front general translation patterns.",
        "In some cases, this method gives results that do not match human intuition regarding idiomatic translation patterns, but it can detect, from the viewpoint of example-based processing, translation patterns in the current translation pattern base that might have side-effects."
      ]
    }
  ]
}
