{
  "info": {
    "authors": [
      "Fumiyo Fukumoto",
      "Jun'ichi Tsujii"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2122",
    "title": "Automatic Recognition of Verbal Polysemy",
    "url": "https://aclweb.org/anthology/C94-2122",
    "year": 1994
  },
  "references": [
    "acl-A88-1019",
    "acl-J93-1007",
    "acl-P90-1034",
    "acl-P91-1034"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Polysemy is one of the major causes of difficulties in semantic clustering of words in a corpus.",
        "In this paper, we first give a definition of polysemy from the viewpoint of clustering and then, based on this definition, we propose a clustering method which recognises verbal polysemies from a textual corpus.",
        "The results of experiments demonstrate the effectiveness of the proposed method."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "There has been quite a lot of research concerned with automatic clustering of semantically similar words or automatic recognition of collocations among them from corpora [Church, 1991], [Hindle, 1991], [Smadja, 1991].",
        "Most of this work is based on similarity measures derived from the distribution of words in corpora.",
        "However, the facts that a single word does have more than one meaning and that the distribution of a word in a corpus is a mixture of usages of different meanings of the same word often hamper such attempts.",
        "The meaning of a word depends on the domain in which it is used; the same word can be used differently in different domains.",
        "It is also often the case that a word which is polysemous in general is not polysemous in a restricted subject domain.",
        "In general, restriction of I he subject domain makes the problem of polysemy less problematic.",
        "However, even in texts from a restricted domain such as Wall Street Journal', one encounters quite a large number of polysemous words.",
        "In particular, unlike nouns, verbs are often polysemous even in a restricted subject domain.",
        "Because polysemous verbs are usually also high-frequency verbs, their treatment is crucial in actual applications.",
        "Furthermore, because of their high-frequency, polysemous verbs tend to have a harmful influence on the semantic clustering of nouns, because semantic clustering of nouns is usually performed based on their collocational behaviour with verbs.",
        "Although polysemy is said to be widespread in language, the definition of polysemy is highly subjective.",
        "Polysemy can only be recognised by human intuition and different linguists often identify a different number of senses in the same word.",
        "In this paper, we first give a definition of polysemy from the viewpoint of clustering, and propose an overlapping clustering method which automatically recognises polysemous words.",
        "The results of experiments are also given to demonstrate the effectiveness of our method."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Although there have been several attempts to extract semantically similar words from a given corpus, few studies seriously deal with the problem of polysemy; of these, even fewer are based on real texts.",
        "The techniques developed by Zernik [Zernik, 1991] and Brown [Brown, 1991] seem to cope with the discrimination of polysemy and be based on real texts.",
        "Zernik used monolingual texts which consist of about 1 million words tagged by part-of-speech.",
        "His method associates each word sense of a polysemous word with a set of its co-occurring words.",
        "If a word has several senses, then the word is associated with several different sets of co-occurring words, each of which corresponds to one of the senses of the word.",
        "The limitation of Zernik's method, however, is that it solely relies on human intuition for identifying different senses of a word, i.e. the human editor has to determine, by her/his intuition, how many senses a word has, and then identify the sets of co-occurring words (signatures) that correspond to the different senses.",
        "Brown used bilingual texts, which consist of 12 million words.",
        "The results of Brown's technique, when applied to a French-English machine translation system, seems to show its effectiveness and validity.",
        "However, as he admits, the approach is limited because it can only assign at most two senses to a word.",
        "More seriously, polysemy is defined in terms of translation, i.e. only when a word is translated into two different words in a target language, it is recognised as polysemous.",
        "The approach can be used only when a large parallel corpus is available, Furthermore, individual senses thus identified do not necessarily constitute single semantic units in the monolingual domain to which plausible semantic properties (i.e. semantic restrictions,",
        "collocations, etc.)",
        "can be associated.",
        "'Phu defects of these two methods show that it is crucial to have an appropriate definition of polysemy terms of distributional behaviours of words in monolingual texts.",
        "The approach proposed in this paper focuses on this problem.",
        "Like Brown's approach, our approach adopts a relativistic view of polysemy.",
        "That is, a word is recognised as polysemous in terms of other related words.",
        "However, while Brown's approach identities polysemous words in terms of related words of another language, we use semantically similar words of the same language to identify polysemous words.",
        "Whether a word is polysemous or not depends 011 whether a set of other, semantically similar words exists whose distributional behaviours correspond to a subset of the distributional behaviour of the word.",
        "Because the distributional behaviour of a word is characterised by its co-occurring words, the process of identifying such subsets essentially corresponds to the process performed manually by the human editor in Zernik's approach.",
        "The experiments in this paper use a corpus annotated only by part-of-speech but not structurally annotated.",
        "However, the clustering algorithm, which automatically recognises polysemous words, only assumes that words are semantically characterised by a vector in an n-dimensional space so that it can be applied to au data satisfying this condition."
      ]
    },
    {
      "heading": "3 Polysemy in Context",
      "text": [
        "The basic assumption of this work is the same as that made ill previous corpus-based approaches, i.e. semantically similar words appear in a similar context.",
        "Semantically similar verbs, for example, co-occur with the saline nouns.",
        "The following sentences front the Wall Street Journal corpus show the point:",
        "(s1) New York Times said it offered to buy the shares of pop radio corp. (s2) He may sell more shares in the open market or in private transactions.",
        "It is intuitively obvious that buy mid sell are semantically related and that the semantic closeness of these two verbs is manifested by the fact that they co-occur with the same 1101111 shares.",
        "We can think of all dimensional space, each dimension of which is associated with a specific liotili and in which a verb is assigned a vector whose value of the i-th dimension is the value of mutual information (mu ill short) [Church, 1991] between the verb and the noun assigned to the i-th axis.",
        "If the basic assumption is correct, then semantically similar verbs forum a cluster in the space, and therefore, statistical clustering algorithms can be applied to verb vectors in order to discover semantic classes of verbs.",
        "tIowever, this straightforward method is often hampered by the existence of polysemous words.",
        "'Cie lowing-sentences show polysemous usages of take.",
        "(s3) In the past, however, coke has typically taken a minority stake in such ventures.",
        "(s3') Guber and peters tried to buy a stake in Inge in 1988.",
        "(s4) That process of sorting out specifies is likely to take tulle.",
        "(s4') We spent a lot of time and money in building our group of stations.",
        "(s5) People are queuing at the door to take his product but Ile doesn't have the working capital to make the thing.",
        "(s5') Goodyear used atwood trade credits to obtain chemicals and other products and services in the U.S. We can make the following observations.",
        "1. take and buy in (s3) and (s3'), take and spend in (s4) and (s4'), take and obtain in (s5) and (s5') co-occur with the noun stake, time and product, respectively, and the verbs of each of these pairs have almost the same sense.",
        "2.",
        "While certain usages of take have senses similar to buy, spend, and obtain, these three specific verbs have distinct, senses and we hardly see synonymy among these verbs.",
        "In the space spanned by the three axes, each associated with stake, time, mid product, take, does not constitute a cluster with any of the three verbs.",
        "take co-occurs with the three nouns and has high (1111 values with them, while buy, spend and obtain have high roll values only with one of the three nouns.",
        "Therefore, the distances between take and these three verbs are large and the synonymy of take with them disappears.",
        "In order to capture the synonymy of take with the three verbs correctly, One has to decompose the vector assigned to take into three component vectors, each of which corresponds to the three distinct usages of take.",
        "The decomposition of a vector into a set of its component vectors requires a proper decomposition of context in which the word occurs.",
        "Figure 1 shows the decomposition of the verb take in the three-dimensional spaces.",
        "takel, take2, and take3 are the component vectors which collectively constitute the vector assigned to take.",
        "For the sake of simplicity, we assume in the above that the three nouns characterise the contexts where the verb take occurs and, at the same time, each of them characterises a distinct usage of take.",
        "However, in a general situation, a polysemous verb co-occurs with a large group of nouns and one has to divide the group of nouns into a set of subgroups, each of which correctly characterises the context for a specific sense of the polysemous word.",
        "The algorithm has to be able to determine when the context of a word should be divided and how.",
        "There are clustering algorithms, called overlapping clustering [Jardine, 11991], which allow an entity to be",
        "time long to more than one cluster.",
        "However, these algorithms assume that even an entity which belongs to more than one clusters is still a single entity.",
        "An entity belongs to several clusters because it can be seen from several different viewpoints.",
        "The same entity, for example, egg, can be seen as food, like bread, and as ingredients-of-food, like flour, at the same time.",
        "However, as we saw in the above, polysemous verbs can be captured more naturally by seeing them as multiple entities, which happen to take the same surface form.",
        "takel, take2 and take3 are distinct; entities (we call them hypothetical verbs in the following) with which different sets of nouns co-occur, and with which, therefore, different contexts are associated.",
        "Therefore, unlike standard overlapping clustering algorithms, our algorithm explicitly introduces new entities when an entity is judged polysemous and associates them with contexts which are subcontexts of the context of the original entity.",
        "Our algorithm has two basic operations, splitting and lumping.",
        "Splitting means to divide a polysemous verb into two hypothetical verbs and lumping means to combine two hypothetical verbs to make one verb out of them."
      ]
    },
    {
      "heading": "4 Measuring the Compactness",
      "text": []
    },
    {
      "heading": "of a Group of Verbs",
      "text": [
        "The algorithm should decide when a verb has to be split into two hypothetical verbs.",
        "The decision is based on a measure of the semantic compactness of a group of verbs.",
        "The semantic compactness of a group of verbs is a measure which shows the degree of dispersion of the group in an it-dimensional space.",
        "The compactness of a group of verbs, VG= {vi, v2, • • •, am}, is defined as follows.",
        "1.",
        "Let vibe one of the verbs vi , • • •, v,„, and a vector assigned to vibe (vii, • • •, v,„).",
        "Each (1 < j < n) is computed by the following formula.",
        "Here, nru(v , nj) is the value of mutual information defined in [Church, 1991] between viand a is a threshold value given in advance.",
        "2.",
        "The centre of gravity of a group of verbs, • • •, v51, is the mean vector of the vectors assigned to the verbs, which is used to compute the dispersions of the individual verbs in the group.",
        "The centre of gravity j = (g1,• • , and the length of it g 1, are defined as follows.",
        "3.",
        "The dispersion, disp(vH.",
        "• • ,.v„), indicates the compactness of a group and is defined as: disp(m, • • , v,„) 4.",
        "Let us think of two clusters of verbs, A and B, which have the same degree of dispersions.",
        "If I of A is larger than that of B, the absolute value",
        "of mu calculated for A is larger than that of B.",
        "This means that the absolute probabilities of co-occurrences of each noun and the verbs of A is larger than those of B; as a result, A should be judged to be semantically more compact than B.",
        "Therefore, the dispersion of (3) is normalised as:",
        "5. disp„„ of (4) is proportional to the number of verbs.",
        "This means that a cluster of a greater number of verbs tends to be judged to be less compact than those of a smaller number of verbs.",
        "Therefore, the dispersion of (4) should be further normalised to compensate the effect of the number of verbs in a group.",
        "This normalisation is done by least square estimation.",
        "The result is (5), which will be used to memsure the compactness of a group of verbs.",
        "In the following, we use (5) as the value which shows the compactness of a group.",
        "A group with a smaller value of (5) is judged semantically more compact."
      ]
    },
    {
      "heading": "5 Clustering Method",
      "text": [
        "In this section, we present our clustering algorithm.",
        "We first explain the operations of splitting and Lumping.",
        "Then, we show' the flow of the i.lgoritltin mid explain how the whole algorithm works."
      ]
    },
    {
      "heading": "5.1 The Basic idea",
      "text": [
        "The clustering algorithm proposed in this paper belongs to the overlapping type.",
        "The 134.",
        "(1.",
        "1,2,3.. • •) method, proposed by :Jardine, is one ()I' the typical overlapping clustering algorithms [Jardine, .199 1.1.",
        "The essential difference between our ilgorit Ion and the 131; method is that our algorithm explicitly introduces a condition when an entity (a verb) should be split and assigned to several clusters.",
        "in our method.",
        "whether a verb t■ has two senses or not is judged by comparing the semantic compactness values of groups of verbs to be produced.",
        "That is, there are possibilities of creating the following' three clusters:",
        "where r'I and in (6) in.",
        "(' new, hypothetical verbs which correspond to two distinct senses of the same verb, c. These two newly introduced verbs are supposed to appear in dilferent contexts.",
        "Their contexts are actually hypothesised by dividing the set of nouns that co-occur with the verb 1. into two distinct sets of nouns.",
        "This division of the context of the original verb r is hypothesised based oh the set of nouns that co-occurs with tul and the set of nouns that co-occu•s with w2."
      ]
    },
    {
      "heading": "5.2 5'1)1Wing and Lumping",
      "text": [
        "'the operations of splitting and lumping are defined as follows: I.",
        "Function spl it(r, cp., v) returns co and l',3.",
        "I.; is a verb whose coordinate ill an n-dimensional space is (1'; 1, • • • , vi„).",
        "and ri3 are hypothesised verbs whose coordinates in the II dinieusimlitl space are made from the coordinates of the original verb I'; by dividing the set of nouns that co-o•cur with 1.; into two distinct sets.",
        "The division is made in terms of two sets of nouns: one is the set of nouns which co-occur wit h and the other is the set of nouns which co-occur with I it/it(r'f, ci„ c„) z I where C'om(c,„ < ('om(ri, (8) if rpj f PR'0 otherwise { 0 if (cqj 0 and 0) otherwise Note that if the noun associated with t he dimension •/ which co-occurs wit also co-occurs with both of and the values of the j-th dimension of co and 1.",
        "1.",
        "(co.; and 1,,I;), are the same value, i.e. the value of the mu between the noun associated wit It t lie /Alt dimension and Furthermore.",
        "if t lie noun associated wit h I he dimension j, which co-occurs with ci, does not (•o-occu• with both 1,1, and the value of the ntu between the 11(11111 associated with the j-th dimension and 1'; is set to the values of the j-th dimension of 1.",
        "3. fiery.",
        "we call this value the surplus value.",
        "\\'‘'e recall that the compactness value of a group of P; and c5is smaller than that of I'; and This means that the former is more compact than the latter.",
        "If the surplus value is not set to both co and 1.3. the group of (+I and ryis more compact than that of I'll and Therefore, ill order to make ro and as symmetrical as possible, the surplus value is set to 1.,3.",
        "2.",
        "Function mp(igt, has the opposite effect of"
      ]
    },
    {
      "heading": "5.3 Flow of the Algorithm",
      "text": [
        "Given a group of verbs, I'2.",
        "• • cw.",
        "the algorithm produces a. set of semantic clusters, which are ordered in t he ascending order of their semantic compactness values.",
        "If ri is non-polysemous.",
        "it belongs to at least one of the resultant semantic clusters.",
        "If it is polysemous, the algorithm splits it into several hypothetical verbs and each of them belongs I o at least one of the semantic clusters.",
        "flow of the algorithm is shown ill Figure 2.",
        "As shown in f'igure 2. the algorithm is composed of three procedures: Make-Initial-Cluster-Set, Make-Tern porary-Cluster-Set and Recognition-of-Polysemy.",
        "store the newly obtained cluster ; if Hie newly obtained cluster contains all the verbs in input then exit from the loop ;",
        "of pairs which are sorted in the ascending order of their semantic compactness values.",
        "The list is called ICS (Initial Cluster Set).",
        "ICS contains nit I ta' • the FOR p in the algorithm, 2 e .",
        "n .",
        "- 00 a pair of verbs is retrieved from ICS, one at each iteration, and passed to the next two procedures.",
        "2.",
        "Make-Temporary-Cluster-Set",
        "The procedure takes two arguments: The first argument is a pair of verbs from ICS and the second one is a set of clusters (CCS - Created Cluster Set).",
        "CCS consists of the clusters which have been created so far.",
        "When the algorithm terminates, CCS is the output of the algorithm.",
        "Make-Temporary-Cluster-Set retrieves the clusters from CCS which contain one of the verbs of the first argument (a pair from IC'S).",
        "The dusters thus retrieved from CCS are passed to the next procedure for further consideration.",
        "If there is no CC'S which contains one of the verbs of a pair from IC'S, a pair of verbs from ICS is stored in CCS as a newly obtained cluster.",
        "3.",
        "Recognition-of-Polysemy",
        "This procedure, which recognises a polysemous verb, also takes two arguments: the pair of verbs from ICS and a set of clusters retrieved 1)y Ma ke-Tem pora ry- CI uster-Set.",
        "We recall the discussion in section 5.1.",
        "Let -{1,, wi } be the pair of verbs from ICS and U'2 } be one of the clusters of the second argument, the clusters so far obtained which contain one of the verbs, o inn the pair.",
        "We have to determine whether the verb // has two senses, which corresponds to II, I and iv2, respectively.",
        "This is determined by comparing the semantic compactness values of the three different clusters shown in (6) and (T).",
        "The splitting function (8) is applied to v, and 1172 and produced newly hypothetical verbs, ni and 07.",
        "The lumping function (9) is applied to v/ and .0.2 and makes one verb v out of them.",
        "If both of the semantic compactness values of each set shown in (6) are smaller than a set shown in (7), the sets (6) are selected, otherwise, (7) is selected and stored CCS as a newly obtained cluster.",
        "If the newly obtained cluster does not contain all the verbs in input, the next pair of verbs is taken front ICS.",
        "and then the whole process is repeated."
      ]
    },
    {
      "heading": "6 Experiments",
      "text": [
        "We have conducted two experiments.",
        "The first experiment is concerned with the clustering technique and with verifying the effect of the proposed method.",
        "The second experiment is conducted to see how various part-of-speech pairs affect the clustering results."
      ]
    },
    {
      "heading": "6.1 Data for the Experiments",
      "text": [
        "The corpus we have used is the Wall Street Journal which consists of 2,878,688 occurrences of part-ob speech tagged words [Church, 1991], 73,225 different words.",
        "From this corpus, We obtained 5,940,193 word pairs in a window size of 5 words, 2,743,974 different word pairs.",
        "26 groups of verbs were used in the experiments, 108 verb tokens with 56 different original form of verbs.",
        "These groups contain 10 different polysemous verbs.",
        "The groups of verbs are divided into two different types.",
        "dypel' and 6tYpe2'; 'typel' is a set of verbs containing one or more polysemous verbs, and 'type2' does not contain any polysemous verbs.",
        "Each group is composed of 3 to 10 different verbs.",
        "The selection of verbs of Ityper was made with the intention of processing verbs with wide usages, as identified in the Collins dictionary and thesaurus [MeLeod, 1991).",
        "Then, a monber of synonyms of the chosen verbs were selected from the thesaurus.",
        "The clustering analysis is applied to each group of verbs.",
        "l'he same corpus and the groups of verbs are used throughout the experiments."
      ]
    },
    {
      "heading": "6.2 Experiment-I",
      "text": [
        "In Experiment-I, w'e used verb-noun pairs, i.e. we assume an n-dimensional space.",
        "in which a verb is assigned a vector whose value of the i-th dimension is the value of MU between the verb and the noun assigned to the i-th axis.",
        "This is because, in the small window sizes, the semantic relationships between these two words might be quite strong, especially those between a verb and its object which permits the effective recognition of verbal polysenly.",
        "The inflected forms of the same nouns and verbs are treated as single units.",
        "For example, 'time'(noun, singular) and Itimes'(nottn, plural) are treated as single units.",
        "We obtained 228,665 different verb-noun pairs from 2,743,974 and 'from",
        "tlo we selected 6,768 different verb-noun pairs.",
        "701 different verbs and 1,796 nouns on condition that, frequencies and mu are not low (N„„ > 5, in a(a., y) 3) to permit a reliable statistical analysis and used the] n in the experiment's. The results are shown in Table 1.",
        "In Table 1, `group' means the number of each group, type].",
        "and type2; 'correct' means the number of groups of verbs which are clustered correctly: 'incorrect'.",
        "means that they are not.",
        "Figure 3 shows each sant.-ply of the results, i.e. typel-correct, type2-correct.",
        "typel-incorrect, and type2-incorrect.",
        "Each value in Figure 3 shows the value of the semantic compactness of a group of verbs.",
        "In Figure 3, under the heading typel-correct, we Call see that `take' is recognised as a polysemous verb and has three different senses, 'spend', 'buy', and 'obtain'.",
        "In a similar way, 'close' has two different senses, 'end' and `open' and semantically close verbs are grouped together.",
        "Under the heading type2-correct semantically similar verbs are grouped together.",
        "However, under the heading typel-incorrect 'leave' is incorrectly recognised as a non-polysemous verb; also under the heading type2-incorrect 'come' is incorrectly recognised as a polysemous verb."
      ]
    },
    {
      "heading": "6.3 .Experimen1;-II",
      "text": [
        "\\\\'e have conducted an experiment.",
        "using the various parts-of-speech shown in liable 2.",
        "In Table 2, :r-y shows the type of part-of-speech pair of stud yin this order, where .1' and y are the part-of-speech of the words.",
        "•pair(1 )\" shows the number of different part-of-speech pairs from 2,713,974 and •pair(2)' show's the number of different part-of-speedi pairs on condition that frequencies and mu are l\\T„.„ > 5. to 11(.r, y) 3; and y show the number of different word.",
        "We used these in Experiment-II.",
        "'Ile results are shown in Table 3.",
        "31Iere, Ivry in the number al total.",
        "co-occurrence, of the words .r and yin tins order in a window."
      ]
    },
    {
      "heading": "7 Discussion",
      "text": [
        "In Experiment-I, described ire the previous section, 18 out of 26 groups of verbs are analysed correctly and the percentage attains 60.2 V, in all.",
        "however, as shown in 'Fable 1, there are 8 groups which could not he recognised correctly.",
        "The errors are classified into two types:1 1.",
        "Errors of recognition of polysemous verbs as non-polysemous ones; and 2.",
        "Errors of recognition of non-polysemous verbs as polysemous ones.",
        "'Fite number of groups classified into each error type is 4 and 7, respectively.",
        "'Fite cause of these errors is that, co-occurring 110110S shared by two verbs seem to be slanted in these data.",
        "For example, observing dm corpus, we can see that 'leave' has at least two senses.",
        "`retire' and 'remain'.",
        "The following sentences are from",
        "(s6) kaplan left his job at warner-lambert.",
        "(s6') About 12 '/ have retired from a full-time job.",
        "They can even leave a sticky problem, in the form of higher brokerage commissions.",
        "(s7') but remain a serious problem.",
        "However, type1-incorrect, in Figure 3 shows that leave.",
        "is incorrectly recognised as a non-polysemous verb.",
        "This elT01.",
        "was caused by the fact that.",
        "the value of the semantic compactness of 'retire' :old •runittinl was smaller than that of ui)' other pair of words and Icy the fact that the cardinality of a set of nouns which co-occur with 'retire' and 'remain' is larger than that of any other pair of words.",
        "We provisionally conclude that the use of verb-noun pairs alone is not appropriate for all the groups of verbs.",
        "In Experiment-11.",
        "the overall results are not as good as those of 'Experiment-I.",
        "However, we cmdd observe some interesting characteristics.",
        "namely, some groups which could not lie analysed correctly by using verb-noun pairs could lie analysed correctly by using verb • adverb pairs or verb-preposition pairs.",
        "The results show that 3 out of 8 groups such as typel-incorrect ill Figure 3 which were incorrect in Experiment-I could be analysed correctly by using verb-adverb pairs.",
        ",Also, an other 3 groups such as type2-incorrect could be analysed correctly by using verb-preposition pairs.",
        "\\Ve \\Ve do not considerennsidor here general errors of semantic clusters, i.e. the .ast, of Iwo verbs which e nnl sernaut icit Ily clone but ere judged to ( (■11S1 it ,C111i1111 Because kill(' Or error did Hifi occur ill the l'111:10111 expeljnients,",
        "can therefore expect that we may he able to obtain more accurate clusters by merging these three kinds of part-Of-speech pairs into one larger set.",
        "Because these three different pairs show distinct characteristics of contexts ill which a verb appears.",
        "We have been conducting more experiments on these."
      ]
    },
    {
      "heading": "8 Conclusion",
      "text": [
        "We have given a definition of polysemy from the viewpoint of clustering, and proposed tut overlapping clustering method which automatically recognises verbal polysemies from a textual corpus.",
        "The significant feature of our approach is that every separate meaning of a word is recognised in terms of other words that appear ill tile corpus.",
        "Whether a word is polysemous or not depends on whether a set of other words exists whose usage corresponds to one of the meanings of a. polysemous word.",
        "As a result, our method can avoid human intuition 111 the judgement of distinct word meanings and thus, human intervention.",
        "The results of the experiments demonstrate the applicability of automatic method of recognition of polysemous verbs.",
        "We have conducted more experiments by changing parameters such as the threshold values for frequencies (N,„) and I's (m 14.0, y)) in order to see how these parameters affect the performance of the clustering algorithm.",
        "We have also extended our technique to the disambiguation of word senses.",
        "We hope to report these results soon."
      ]
    }
  ]
}
