{
  "info": {
    "authors": [
      "Kumiko Tanaka-Ishii",
      "Kyoji Umemura"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-1048",
    "title": "Construction of a Bilingual Dictionary Intermediated by a Third Language",
    "url": "https://aclweb.org/anthology/C94-1048",
    "year": 1994
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "When using a third language to construct a bilingual dictionary, it is necessary to discriminate equivalencies from inappropriate words derived as a result; of ambiguity in the third language.",
        "We propose a method to treat this by utilizing Ow structures of dictionaries to measure the nearness of the meanings of words.",
        "The resulting die-tionary is a word-to-word bilingual dictionary of nouns and can be used to refine the entries and equivalencies in published bilingual dictionaries."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "When vocabulary cannot be found in bilingual dictionaries, it is frequently obtained by using a third language as an intermediary.",
        "This indicates that supplemental information may lie in other forms in other dictionaries.",
        "lien, we try using electronic dictionaries winch cart be reformed on a large scale, to extract this informations so that we can obtain subsidiary data and refine a direct bilingual dictionary.",
        "Looking up words ill bilingual dictionaries intermediating the third language is a method often used by people who handle uncommon languages in a specific domain.",
        "If this pro CeSS can be auto-mated, bilingual dictionaries of any kind between any languages may be obtained as long as these concerned languages have dictionaries to a common language.",
        "One objective of the research reported here is to establish a first step in automating this process.",
        "To construct a japanese+-+French dictionary, we chose English as the intermediary language because Japanese4-4English and English4-4 French dictionaries exist; in electronic forms and because published Japanesed-A'rench dictionaries provide enough vocabulary in comparison with the result* dictionary.",
        "In Section 2 we describe a method for extracting equivalencies for a given word.",
        "Its fundamental concepts are stated in Section 3.",
        "The whole procedure used to construct the new dictionary is shown in Section 4 and in Section 5 the resulting dictionary is evaluated.",
        "and Dicf.",
        "is called an inverse die-bonier!'",
        "of Dicy_..„.",
        "Japanese words have information in the following format: pronunciation in romaji, and its equivalence in English.",
        "English words are written in this font and French words in this font.",
        "2 Overview of the' :Method"
      ]
    },
    {
      "heading": "2.1. Inverse Consultation",
      "text": [
        "The most, naive way to use English to obtain 1,'rench words corresponding to a Japanese word is to look up the Japanese word in a Dic,j_,„ and then look up the resultant English words in a Dice__ ,T.",
        "'.1.",
        "'he resulting French words can be regarded as equivaltmce candidates (ECs) of the original Japanese word.",
        "For example, in Fig. 1, ECs for a Japanese word \"3,0' (kyouson : competition) are competition, concours, race etc.",
        "Amour; these, race alai like are inadedptate as equivalents of \"Mi.\".",
        "As for race, the English word race has several meanings with the same spelling: one is to compete and another is human race.",
        "ft is human ruee which induces the inadequate :EC race.",
        "As for hate, the English.",
        "word race has the wider mealt-ing to hurry which the original Japanese word \"O.",
        "11-\" does not.",
        "Since hate is a direct; translation of to hurry, it is inappropriate as an equivalence.",
        "Che following three case; generate irrelevant ECs.",
        "1.. An English word with the same spelling but with diGrent meanings is intermediated.",
        "(race in the above example)",
        "2.",
        "An English word with a wider meaning [ban that; of original Japanese word is intermediated].",
        "(like in the above example) 3.",
        "'1.",
        "'here are mistakes in dictionaries.",
        "The first two cases are due to the ambiguity in English.",
        "An English word with a narrower meaning than the Japanese source may miss Hinny French equivalents.",
        "We think that; if the original word has ambiguity and several meanings, the dictionary gives the corresponding English words.",
        "We could itandle the problem of choosing equivalencies front among Ees by semantic processing, but expressing meaning of vocabulary in dictionaries is a great problem.",
        "A simpler way is to look the ECs up in the inverse dictionary.",
        "For example, one can consult Dicf_ .,j for competition, concours, and race and thereby get \".V,;;1).\", \"fg",
        "It\", and \"Aft\" (jinshu : human race) as their respective equivalencies.",
        "Since \"AO\" has nothing to do with \"Mi.\", race is excluded.",
        "We call this method of looking up ECs in the inverse dictionaries when choosing relevant equivalencies inverse consultation, and we call the words obtained by looking up inverse dictionaries the selection area (SA).",
        "Inverse consultation utilizes the structure of dictionaries to measure the nearness of the meanings of words in different languages.",
        "The simplest application of inverse consultation is to use Dicf.„.",
        "In the above example, each EC is looked up in Dicf and the results are compared with the English equivalencies of \"Mi.\" (E); namely, competition, contest, and race.",
        "The SA of competition is competition, contest and match, which have the elements contest and competition in common with F) (Fig.",
        "2).",
        "As competition derived from competition, competition should be put aside, but contest is still left as a common element and thus competition is selected as an equivalence of \"Mr.\".",
        "As for race, the SA of race consists of race and ancestry, whose intersection with E only gives race; so race is judged as an inadequate EC.",
        "In short, the number of elements in common between the selection area and E indicates the nearness of the meaning between the EC and the original word.",
        "For the inverse consultation described above, the SA was in English.",
        "If we use Dice_,i as an inverse dictionary successively after consulting Dicii„, then the SA is in Japanese and we compare \"M'-\" with the SA (Fig.",
        "3).",
        "The SA for Fig. 3 Two times inverse consultation (IC) .",
        "competition consists of two \"S'inims and three \"Mr s (kyougi : game).",
        "For race, the SA has \"011', *11.\"(senzo : ancestry).",
        "Since \"OA.\" appears only once for race, we discard the EC race.",
        "There can be a infinite number of inverse consultations according to the number of consulted inverse dictionaries.",
        "If the inverse dictionaries are consulted n times, we call the method n times inverse consultation (IC„).",
        "Which inverse dictionary to use does not always have a unique answer.",
        "For 162 for example, we may consult Dice__,f after consulting Dicf.„ with the SA in French."
      ]
    },
    {
      "heading": "2.2 Selection Procedure",
      "text": [
        "Once the SA for a given word is obtained, equivalencies are selected by handling two collections of words.",
        "We call this process the selection procedure.",
        "One way to do this is to count the number of specific elements in the SA.",
        "For example, if the SA is in Japanese, the number of the element \".l'a itself is counted.",
        "Another way is to count how many parts of words (PWs) are contained in the SA.",
        "For example, the number of \"0\" and c`-fi'\" contained in the SA is considered Wills \"M\" in \"Mfr is also counted).",
        "If we handle the meaning of words, a third way is to look up \"011-\" in a Japanese thesaurus and count how many times tire synonyms appear in the SA.",
        "For example, if \"OR\" is a synonym of \"lAqi-\", then the munber of appearances of IA R\" is added to that of' \"Wfl.\".",
        "if we go further to handle the meaning, we might as well process words by semantic processing.",
        "Since a kanji is an ideogram, the second method also handles the meaning.",
        "When the selection area is in English or French, the corresponding method is to count morphemes such as \"inter\" and \"national\" for the word \"international\".",
        "We are interested in to what extent the method that does not explicitly concern the meaning may be used to handle the meaning of words.",
        "In the following, we focus on the former two methods."
      ]
    },
    {
      "heading": "3 Fundamental Concepts",
      "text": []
    },
    {
      "heading": "3.1 Harmonized Dictionary",
      "text": [
        "A bilingual dictionary forms a graph whose nodes are words and whose branches are correspondences between the words.",
        "Branches have directions, which make the graph asymmetric.",
        "is a graph with all the branches in in inverse direction.",
        "Since the purpose of bilingual dictionaries is to denote the correspondences of words that have the same meaning t1ar831, it is natural that branches are bidirectional.",
        "We therefore design symmetrical dictionaries and .",
        "we denote a dictionary from language x to y ,calling it a harmonized dictionary.",
        "WhenD,._,,1and are constructed from the same dictionaries, Dy.„.,, y holds.",
        "We remove the overlaps of branches."
      ]
    },
    {
      "heading": "3.2 Syntactic Selection Procedure",
      "text": [
        "A multiset here is a set in which each element has a weight that is a natural number.",
        "The weight of an element is defined as the number of times it appears when looking up words in dictionaries.",
        "In the example shown in Pig.",
        "3, the multiset SA for competition consists of \"011-\" with weight 2 and \"OR\" with weight 3.",
        "We denote the weight of element x in multiset X as 6 „(X , x); for instance, 6„,(SA,'01-) = 2.",
        "Using the same notation, 6,,(X, Y) is defined as follows when X and Y are multisets:",
        "The notation 6b (X, x) represents the sum of the weights of the elements that contain PWs of a; in multiset X.. For instance, if PWs are debited as kanji, fib(SA,-tV10 is 7 by adding 5 (stun of weights of elements in the SA that have kanji \"0\") and 2 (sun' of weights of elements in the SA that have kanji \"qi-\").",
        "Using the same notation, 6a(X, Y) is defined as follows when X and Y are multisets:",
        "For instance, 6b(S A, Z) = 12; that is 7 plus 5 (=---8b(SA,04I)).We use the notation S as a parameter for 6a or 6b."
      ]
    },
    {
      "heading": "3.3 Properties of Inverse Consultation",
      "text": [
        "In the following, we use Df.,e and De___,j as inverse dictionaries when starting from Japanese words and we use Dj.„ and 11:10_,f as inverse dictionaries when starting from French words.",
        "French ECs for a Japanese word j form a multiset F expressed as F=De fDj • French equivalencies selected by /CI form a",
        "multiset whose element f satisfies",
        "French equivalencies selected by IC2 form a mid-tiset whose element f satisfies f C F and li(De_JDf – e1, > 1 .",
        "In the following, we focus on the ICI and 109 described above and examine their properties.",
        "This property indicates that when using selection procedure 6„, equivalencies selected by .IC1 and 1C2 are exactly the same.",
        "Moreover, it is sufficient to choose ECs whose weights are greater than 1 in F. The proof of Property 1 is shown in Appendix.",
        "This property is clear with symmetrically struc-Lured dictionaries.",
        "When fir, is used, the resulting dictionary depends on how PW is defined and does not always become a harmonized dictionary.",
        "Property 3 If there is a structure such as shown.",
        "in Fig.",
        "tib must be used as 6 to exclude imelevant ECs.",
        "When 6„ is used, the SA for two ECs will be exactly the same, which makes it impossible to discard inappropriate ECs.",
        "Although this kind of structure seems to he rare, it can exist because of the historical transition of words.",
        "When a single English word is intermediated, inappropriate ECs cannot be discarded by using tia for ICI •"
      ]
    },
    {
      "heading": "4 :Experiment",
      "text": []
    },
    {
      "heading": "4.1 Dictionary Data",
      "text": [
        "The dictionaries used in the experiment are Dici„ [14190], Dic0_,i [Koi90], Dice_d [For82], 11)(1f_,e[Led82].",
        "The whole experimental procedure is shown in Fig. 5.",
        "Word-to-word dictionaries are first extracted front each dictionary.",
        "All words are nouns; in particular, they are one word nouns in English and French.",
        "Since the dictionary syntax was not always consistent, word-to-word dictionaries contain some mistakes (inadequate correspondences), Harmonized dictionaries are then constructed from the word-to-word dictionaries as follows: D„,1=U Dice_,i",
        "Although there are other ways to symmetrize dictionaries, (for example, by removing all branches that are not bidirectional), we chose the above procedures for the lexicographical reason described below [Har831.",
        "There are two kinds of bilingual dictionaries, one is from a foreign language (f) to the mother language (Dicf_,„,), and the other is from a mother language (m) to a foreign language (Dic,_,f).",
        "In Die f.„, when there are no equivalencies in m for a foreign word, the dictionary gives its definition or explanation of the word in m. Therefore, all the foreign words can be contained in the dictionary.",
        "In Dic,„,f on the other hand, if there are no equivalencies in f for a word of m, the word itself is often dropped from the dictionary.",
        "The words contained in the dictionary are therefore a part of in, and Dic,„ – f lacks many entries.",
        "A harmonized dictionary is a solution to this problem because it contains equivalencies of Dicf_„„ as entries of Dic,„_,f."
      ]
    },
    {
      "heading": "4.2 Procedure of Inverse Consultation",
      "text": [
        "From Property 1, we use 5„ with /Ci and we use 5e with IC2.",
        "The PW for Sb are defined as follows: • Japanese 0353 kanjis.",
        "• French morphemes [Maar)].",
        "1151 prefix and 710 suffix, From Property 2, inverse consultation is applied to both Japanese and French entries, and then the results are put together to construct a harmonized dictionary.",
        "We denote it as Dj._,f or Df._,j.",
        "Each entry within and Df_,0 is classified into one of five types according to the procedure used to select its equivalencies from ECs.",
        "• Type A A single EC exists and is selected unconditionally as the equivalence.",
        "• Type B Equivalencies by /Ci exist; all are selected and the rest of the ECs are discarded.",
        "• Type C There are no equivalencies by /Ct but there are by IC2 .",
        "One third (empirically decided) of ECs by IC2 are selected according to the value of the following fraction (larger ones are selected): Value of function 151, SA (byte) • Type D No equivalencies by ICI nor by IC2 appeared but there are several ECs.",
        "For this entry, it is impossible to select the relevant equivalencies.",
        "• Type E There are no ECs.",
        "Entries of Type A acquire more appropriate equivalencies than do entries of Type B, and entries of Type B acquire more appropriate equivalencies than do entries of Type C."
      ]
    },
    {
      "heading": "5 Evaluation of Experiment",
      "text": []
    },
    {
      "heading": "5.1 Result, of the Example",
      "text": [
        "Equivalencies obtained for the Japanese word II: are contours, Hyalite, competition, course, concurrence, emulation and the intermediated English words are competition, contest, rival, rivalry, race.",
        "The entry \"301\" is of Type 13.",
        "The number of ECs is 41 (including overlaps), and 13 of them are selected by 1C1.",
        "The number of ECs in each category of irrelevant words described in Section 2.1 is listed in Table 1, which indicates that inverse consultation can detect the relevant words even when there are mistakes in the dictionaries.",
        "The word winch should not be dropped was joute.",
        "Equivalencies for `Ini:\" in [Tain851 are",
        "course, concurrence.",
        "Our result contains emulation (which means 'rivalry) in addition to the entries in the published dictionary."
      ]
    },
    {
      "heading": "5.2 Evaluation of Entries",
      "text": [
        "Table 2 lists the each number of entries belonging to the Types ADD (defined in Section 4.2).",
        "Type D consists of the following entries.",
        "• One English word is intermediated ;sod several ECs appear.",
        "• The entry contains no PW.",
        "The Type D percentage difference between Dj__,f and Df__,j shows that the number of entries of Type D depends on the number of registered PWs.",
        "Original words are apt to be translated into tin-common English words, so they normally do not, appear as entries if the same kind of words do not exist; in the objective langauge.",
        "Technical terms and proper nouns depend very much on culture.",
        "Many French placenaines, for instance, are 'I.",
        "'ype E. Borrowed worth are expressed in inconsistent spellings, and which of them are to be found in the diction try also deii)ends on the culture (aperitif is the equivalence in Dicj,...„).",
        "Since a harmonizing dictionary augments the entries, the resulting dictionary contains entries that are not in the published dictionary.",
        "As explained in Section 4.1, this phenomenon is conspicuous when we conware Dj_,f with the published dictionary [Suz70].",
        "These entries can be categorized as follows:",
        "1.",
        "Colloquial words.",
        "Ex.",
        ";h (wanchan : puppy) 2.",
        "Technical terms or proper mums.",
        "Ex.",
        "7 (asultesuto : ashest.e) 3.",
        "Compound nouns.",
        "Harmonizing dictionaries help to gather correspondences between the mother language 1.11(1 a foreign language and are useful in revising published dictionaries."
      ]
    },
    {
      "heading": "5.3 Evaluation of Equivalencies",
      "text": [
        "We evaluated the equivalencies or resulting dictionaries by comparing then) with those or published dictionaries [Tain85] (S117,701.",
        "For random 100 entries in both dictionaries, the following two percentages (calculated manually) are listed in `1.",
        "'able 4: Ri Fraction of equivalencies in the published dictionary which were also found by this method.",
        "• R,2 Fraction of emlivalencies found by this",
        "method which were judged appropriate.",
        "Note that entries with greater R2 contain appropriate equivalencies on higher rate.",
        "Tins is not, true for It1 , since III indicates the discrepancy of equivalencies between the resulting dictionary and published dictionaries.",
        "Entries of 112=100% can be classified as follows:",
        "The entries tend to have either R1=80%,-,100% or R1,---0%,,20%.",
        "Of the latter, some examples are listed in Table 5 and 6.",
        "For distique in Table 5, which is a term in French literature, Df_.j translates it into the term for the corresponding kind of Japanese literature.",
        "Although it resembles to the direct translation of distique, it is only an analogy.",
        "On the other hand, since the direct translation of distique in the published dictionary adopts the concept; of French poems, it is uncommon and cannot be understood by most Japanese readers.",
        "The same is true for boulier except that the common Japanese is indicated in a published dictionary.",
        "Pull is borrowed front the English word pullover whose direct translation is contained in a published dictionary, and it is not a common word in Japanese.",
        "In the first example in Table 6, grive is the generic name equivalent to thrush, whereas merle is a kind of thrush.",
        "The second example shows that more equivalencies are found in Di To sum up, the resulting dictionary can be utilized in conjunction with the published dictionaries as follows:",
        "• To revise the equivalencies.",
        "• To supplement the equivalencies.",
        "Sections of the resulting dictionaries is listed in Table 7.",
        "List 1 is Dj___,f and List 2 is Df – j.",
        "For each list, entries are in the first row and their equivalencies are in the third row.",
        "Symbols in the second row indicate how appropriate each equivalence is.",
        "(Refer to the notes beside.)"
      ]
    },
    {
      "heading": "6 Related Work",
      "text": [
        "The use of a third language English as an intermediary in the construction of a bilingual dictionary was tested manually on a large scale on editing the Spanish-Japanese dictionary [Kuw90].",
        "It is now a representative middle-sized dictionary having a large quantity of information.",
        "Tokunaga and Tanaka [T01(90] tried to extract a conceptual dictionary from Japanese-English and English-Japanese dictionaries.",
        "Although they used a concept; similar to ours that; is the graph structure of a dictionary related to meaning of words, their frameworks and final product differ from ours.",
        "7 Conclusion and Future Works The proposed method for using a intermediate language to construct a bilingual dictionary utilizes the structure of dictionaries and morphemes and can choose appropriate equivalencies for most entries.",
        "Comparing the resulting dictionary with published dictionaries showed that data obtained are useful for revising and supplementing the vocabulary of existing dictionaires.",
        "To increase the accuracy with winch equivalencies can be selected, mistakes in word-to-word dictionaries must be corrected even if our method may detect appropriate equivalencies.",
        "One way to do this would be to use thesaurus to check whether the extracted correspondences are relevant.",
        "Nouns were taken into consideration ill this research, and the next step will be to apply the proposed method to other parts of speech.",
        "We also need to establish a way to handle compound words in European languages.",
        "Acknowledgements We express our gratitude to Prof. Ilideya Iwasaki of University of Tokyo for Ins guidance on theoretical aspects and essential remarks on experiments.",
        "We are also thankful to Prof. Nigel Ward of University of Tokyo for his lexicographical advice and for his invaluable aid in shaping our idea."
      ]
    },
    {
      "heading": "References",
      "text": []
    },
    {
      "heading": "Appendix",
      "text": [
        "The following two lemmas are needed to prove Property 1.",
        "Lenuna 1-1 a: C <=7 This is clear front the symmetric structure of the harmonized dictionary.",
        "Lemma 1-2 /f X is a set (every element has a weight of 1) then lia(1);, – ,9X, p) = ha (X, Dy--t.0) Proof: OM denotes the number of elements in X)",
        "As branches do not overlap, Df._..of is a set.",
        "Front Lemma 1.-2, the proof for Property 1 is given as follows:",
        "The proof for the second equation is the same."
      ]
    }
  ]
}
