{
  "info": {
    "authors": [
      "Tao Hong"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P94-1049",
    "title": "Integration of Visual Inter-Word Constraints and Linguistic Knowledge in Degraded Text Recognition",
    "url": "https://aclweb.org/anthology/P94-1049",
    "year": 1994
  },
  "references": [
    "acl-J90-1003"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Degraded text recognition is a difficult task.",
        "Given a noisy text image, a word recognizer can be applied to generate several candidates for each word image.",
        "High-level knowledge sources can then be used to select a decision from the candidate set for each word image.",
        "In this paper, we propose that visual inter-word constraints can be used to facilitate candidate selection.",
        "Visual inter-word constraints provide a way to link word images inside the text page, and to interpret them systematically."
      ]
    },
    {
      "heading": "Introduction",
      "text": [
        "The objective of visual text recognition is to transform an arbitrary image of text into its symbolic equivalent correctly.",
        "Recent technical advances in the area of document recognition have made automatic text recognition a viable alternative to manual key entry.",
        "Given a high quality text page, a commercial document recognition system can recognize the words on the page at a high correct rate.",
        "However, given a degraded text page, such as a multiple-generation photocopy or facsimile, performance usually drops abruptly([1]).",
        "Given a degraded text image, word images can be extracted after layout analysis.",
        "A word image from a degraded text page may have touching characters, broken characters, distorted or blurred characters, which may make the word image difficult to recognize accurately.",
        "After character recognition and correction based on dictionary look-up, a word recognizer will provide one or more word candidates for each word image.",
        "Figure 1 lists the word candidate sets for the sentence, \"Please fill in the application form.\"",
        "Each word candidate has a confidence score, but the score may not be reliable because of noise in the image.",
        "The correct word candidate is usually in the candidate set, but may not be the candidate with the highest confidence score.",
        "Instead of simply picking up the word candidate with the highest recognition score, which may make the correct rate quite low, we need to find a method which can select a candidate for each word image so that the correct rate can be as high as possible.",
        "Contextual information and high-level knowledge can be used to select a decision word for each word image",
        "in its context.",
        "Currently, there are two approaches, the statistical approach and the structural approach, towards the problem of candidate selection.",
        "In the statistical approach, language models, such as a Hidden Markov Model and word collocation can be utilized for candidate selection ([2, 4, 5]).",
        "In the structural approach, lattice parsing techniques have been developed for candidate selection([3, 7]).",
        "The contextual constraints considered in a statistical language model, such as word collocation, are local constraints.",
        "For a word image, a candidate will be selected according to the candidate information from its neighboring word images in a fixed window size.",
        "The window size is usually set as one or two.",
        "In the lattice parsing method, a grammar is used to select a candidate for each word image inside a sentence so that the sequence of those selected candidates form a grammatical and meaningful sentence.",
        "For example, consider the sentence \"Please fill in the application form\".",
        "We assume all words except the word \"form\" have been recognized correctly and the candidate set for the word \"form\" is { farm, form, forth, foam, forth } (see the second sentence in Figure 2).",
        "The candidate \"form\" can be selected easily because the collocation between \"application\" and \"form\" is strong and the resulting sentence is grammatical.",
        "The contextual information inside a small window or inside a sentence sometimes may not be enough to select a candidate correctly.",
        "For example, consider the sentence",
        "skill; it Ls tiologically.based.",
        "Language is something we (ITO born ,r13ovong how • to 1.121_67).",
        "•Yet9ili by pc7thasis that fhi44Ire)Cniokkic – al underpinnings to human linguistic ability does not explain 'everything, .There may indeed",
        "\"This form is almost the same as that one\" (see the first sentence in Figure 2).",
        "Word image 16 has five candidates: { farm, form, forth, foam, forth }.",
        "After lattice parsing, the candidate \"forth\" will be removed because it does not fit the context.",
        "But it is difficult to select a candidate from \"farm\", \"form\" \"foam\" and \"force\" because each of them makes the sentence grammatical and meaningful.",
        "In such a case, more contextual constraints are needed to distinguish the remaining candidates and to select the correct one.",
        "Let's further assume that the sentences in Figure 2 are from the same text.",
        "By image matching, we know word images 2 and 16 are visually similar.",
        "If two word images are almost the same, they must be the same word.",
        "Therefore, same candidates must be selected for word image 2 and word image 16, After \"form\" is chosen for image 16 it can also be chosen as the decision for image 2."
      ]
    },
    {
      "heading": "Visual Inter-Word Relations",
      "text": [
        "A visual inter-word relation can be defined between two word images if they share the same pattern at the image level.",
        "There are five types of visual inter-word relations listed in the right part of Table 1.",
        "Figure 3 is a part of a scanned text image in which a small number of word relations are circled to demonstrate the abundance of inter-word relations defined above even in such a small fragment of a real text page.",
        "Word images 2 and 8 are almost the same.",
        "Word image 9 matches the left part of word image I quite well.",
        "Word image 5 matches a part of the image 6, and so on.",
        "Visual inter-word relations can be computed by applying simple image matching techniques.",
        "They can be calculated in clean text images, as well as in highly degraded text images, because the word images, due to their relatively large size, are tolerant to noise ([6]).",
        "Visual inter-word relations can be used as constraints in the process of word image interpretation, especially for candidate selection.",
        "It is not surprising that word relations at the image level are highly consistent with word relations at the symbolic level(see Table 1).",
        "If two words hold a relation at the symbolic level and they are written in the same font and size, their word images should keep the same relation at the image level.",
        "And also, if two word images hold a relation at the image level, the truth values of the word images should have the same relation at the symbolic level.",
        "In Figure 3, word images 2 and 8 must be recognized as the same word because they can match each other; the identity of word image 5 must be a sub-string of the identity of word image 6 because word image 5 can match with a part of word image 6; and so on.",
        "Visual inter-word constraints provide us a way to link word images inside a text page, and to interpret them systematically.",
        "The research discussed in this paper integrates visual inter-word constraints with a statistical language model and a lattice parser to improve the performance of candidate selection."
      ]
    },
    {
      "heading": "Current Status of Work",
      "text": [
        "A word-collocation-based relaxation algorithm and a probabilistic lattice chart parser have been designed for word candidate selection in degraded text recognition([3, 4]).",
        "The relaxation algorithm runs iteratively.",
        "In each iteration, the confidence score of each candidate is adjusted based on its current confidence and its collocation scores with the currently most preferred candidates for its neighboring word images.",
        "Relaxation ends when all candidates reach a stable state.",
        "For each word image, those candidates with a low confidence score will be removed from the candidate sets.",
        "Then, the probabilistic lattice chart parser will be applied to the reduced candidate sets to select the candidates that appear in the most preferred parse trees built by the parser.",
        "There can be different strategies to use visual inter-word constraints inside the relaxation algorithm and the lattice parser.",
        "One of the strategies we are exploiting is to re-evaluate the top candidates for the related word images after each iteration of relaxation or after lattice parsing.",
        "If they hold the same relation at the symbolic level, the confidence scores of the candidates will be increased.",
        "Otherwise, the images with a low confidence score will follow the decision of the images with a high confidence score.",
        "Five articles from the Brown Corpus were chosen randomly as testing samples.",
        "They are A06, G02,142, NO1 and R07, each with about 2,000 words.",
        "Given a word image, our word recognizer generates its top10 candidates from a dictionary with 70,000 different entries.",
        "In preliminary experiments, we exploit only the type-1 relation listed in Table 1.",
        "After clustering word images by image matching, similar images will be in the same cluster.",
        "Any two images from the same cluster hold the type-1 relation.",
        "Word collocation data were trained from the Penn Treebank and the Brown Corpus except for the five testing samples.",
        "Table 2 shows results of candidate selection with and without using visual inter-word constraints.",
        "The topl correct rate for candidate lists generated by a word recognizer is as low as 57.1%, Without using visual inter-word constraints, the correct rate of candidate selection by relaxation and lattice parsing is 83.1%.",
        "After using visual inter-word constraints, the correct rate becomes 88.2%."
      ]
    },
    {
      "heading": "Conclusions and Future Directions",
      "text": [
        "Integration of natural language processing and image processing is a new area of interest in document analysis.",
        "Word candidate selection is a problem we are faced with in degraded text recognition, as well as in handwriting recognition.",
        "Statistical language models and lattice parsers have been designed for the problem.",
        "Visual inter-word constraints in a text page can be used with linguistic knowledge sources to facilitate candidate selection.",
        "Preliminary experimental results show that the performance of candidate selection is improved significantly although only one inter-word relation was used.",
        "The next step is to fully integrate visual inter-word constraints and linguistic knowledge sources in the relaxation algorithm and the lattice parser."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "I would like to thank Jonathan J.",
        "Hull for his support and his helpful comments on drafts of this paper."
      ]
    }
  ]
}
