{
  "info": {
    "authors": [
      "Alicia Ageno",
      "Francesc Ribas Framis",
      "German Rigau",
      "Horacio Rodríquez",
      "Anna Samiotou"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-1052",
    "title": "TGE: Tlinks Generation Environment",
    "url": "https://aclweb.org/anthology/C94-1052",
    "year": 1994
  },
  "references": [
    "acl-A92-1012",
    "acl-A92-1044"
  ],
  "sections": [
    {
      "text": [
        "Departament de Llenguatges i Sistemes Informatics.",
        "Universitat Politbcnica de Catalunya.",
        "Pan Gargano 5, 08028 Barcelona.",
        "Spain.",
        "horacio@lsi.upc.es"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "This paper describes the enhancements made, within a unification framework, based on typed feature structures, in order to support linking of lexical entries to their translation equivalents.",
        "To help this task we have developed an interactive environment: TGE.",
        "Several experiments, corresponding to rather \"closed\" semantic domains, have been developed in order to generate lexical cross-relations between English and Spanish."
      ]
    },
    {
      "heading": "Keywords",
      "text": []
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Recently, several approaches have been made to extend lexical unification-based formalisms to deal with multilinguistic phenomena in order to be used in applications such as Machine Translation [7].",
        "Within Acquilex IP Project, a unification framework based on typed feature structures [4] was developed, the LKB (Lexical Knowledge Base), in order to represent conceptual units corresponding to lexical senses, lexical and phrasal rules, multilingual relationships, etc.",
        "This paper describes the enhancements made, to the LKB system [6], in order to support linking of lexical entries to their translation equivalents.",
        "The organisation of the paper is as follows: Section 2 presents the motivations and formalisation of tlinks (for \"translation links\").",
        "Section 3 deals with TGE (Tlinks Generation Environment), the way we propose to help in constructing lexical linkages semi-automatically from LKB data and bilingual dictionaries [13], [8], loaded in the LDB (Lexical Data Base) environment [5].",
        "Section 4 shows the use of TGE,",
        "within SEISD4 [1] (Sistema de extracci6n de Información Semantica de Diccionarios).",
        "In section 5 some experimental results are presented.",
        "Finally in section 6 we present our conclusions and further lines of research."
      ]
    },
    {
      "heading": "2 Tlinks",
      "text": [
        "The initial assumption was that the basic units for defining lexical' translation equivalence should be the lexical entries in the monolingual LKBs, which should, in general, correspond to word senses in the dictionary.",
        "Although in the simplest cases we can consider the lexical entries themselves as translation equivalent, in general more complex cases occur corresponding to lexical gaps, differences in morphologic or lexical features, specificity, etc.",
        "[11].",
        "We will therefore represent the relationships between words in terms of tlinks.",
        "The tlink mechanism is general enough to allow the monolingual information to be augmented with translation specific information, in a variety of ways.",
        "We will first describe the tlink mechanism in the LKB and then outline how some of these more complex equivalences can be represented.",
        "The LKB formalism uses a typed feature structure (FS) system for representing lexical knowledge.",
        "So we can define tlinks in terms of relations between FSs.",
        "Lexical (or phrasal) transformations in both source and target languages' are a desirable capability so that we can state that a tlink is essentially a relationship between two rules (of the sort already defined in the LKB) where the rule inputs have been instantiated by the representations of the word senses to be linked.",
        "As shown in fig 1, furniture can be encoded as translation equivalent to the plural muebles by specifying that the named rule plural has to be applied to the base sense in Spanish.",
        "As any other LKB object a tlink can he represented as a feature structure, as shown in fig 2.",
        "The type system mechanism, in the LKB, allows further",
        "refinement and differentiation of tlink classes in several ways.",
        "A simple-tlink is applicable whenever two lexical entries which denote single place predicates (nouns, etc.)",
        "arestraightforwardly an equivalent translation, without any previous transformation.",
        "Thus, assuming that the LDOCE [9] sense absinth_L _0_1 is translation equivalent to the VOX [12] sense absenta_X_I_1, we will have the next tlink:",
        "A partial tlink is applicable when we want to transfer the qualia structure from one sense to another, and a phrasal tlink is necessary when we need to describe a single word equivalent translation to a phrase [10]."
      ]
    },
    {
      "heading": "3 TGE: Tlinks Generation Environment",
      "text": [
        "The establisment of tlinks can he obviously performed manually, but the multiplicity of possible cases and the existence of several Knowledge Sources (such as bilingual dictionaries, monolingual fns, or a multilingual I.K13) allows and motivates the (partial) automatization of the process.",
        "To help in performing such a task we have developed an interactive environment: TG E. TGE has been implemented using a Production Rules approach.",
        "This approach was already used within the SEISD environment and was mainly motivated by the need of providing a flexible and open way of defining tlink formation mechanisms.",
        "The core of TGE is PRE (production rules environment), a rule-oriented general purpose interpreter [2].",
        "PRE follows the philosophy of roost Production Rules Systems [3] but is deeply adapted to Natural Language applications.",
        "PRE offers a powerful (according to both expressiveness and performance) rule application mechanism and provides the possibilities of defining higher level mechanisms, such as rulesets (allowing inheritance capabilities) and of choice among control strategies, either user-defined or provided by the system.",
        "Consider the following example:",
        "In this rule the pattern-condition is the occurrence of an object named translation-in in the Working Memory.",
        "This object must in turn contain a ^trans-records attribute whose value will he matched against the pattern (?translation *rest).",
        "If the matching succeeds Men",
        "translation will be unified with the first element of the list and rest with the remainder elements.",
        "The action part of the rule consists of two actions.",
        "The former is the modification of translation-in, popping its first element, and the latter performs the creation of another object, named translation.",
        "Rule-1-all all rule is applied until all the objects named \"translation-in\" have emptied the list contained in their slot Atrans-records.",
        "4 Using TGE for generating Tlinks The TGE may be considered a toolbox and thus, it doesn't impose a fixed methodological strategy.",
        "Whatever methodology we follow, several decisions must be taken: the kind of control we need, the rulesets to he designed, 'the rules belonging to each ruleset, the relative priority assigned to each rule and so on.",
        "As regards the control strategy, one of the following !bur alternatives may be chosen for each source entry (see [2] or [1O] for futher details):",
        "• All, which executes all the rulesets.",
        "From the proposed tlinks, finally the user chooses the correct ones.",
        "• Collect, which executes the rulesets one at a time and provides the results to the user (for selection of the correct ones) every time a ruleset succeeds.",
        "• One-by-one, which orderly executes the rulesets and stops as soon as one of them succeeds.",
        "• Select, which only executes the rulesets that the user chooses.",
        "An initial set of modules was designed according to the typology of tlinks presented so far.",
        "It included lour sorts of tlinks that showed distinct conceptual correspondences between both languages.",
        "A more in-depth study of English-Spanish mismatcfies [II] might lead to an enrichment of the typology, and consequently to a need For extending the extant modules.",
        "Up to now seven modules, each one implemented as a ruleset,.",
        "have been developed.",
        "Each of them generates one out of the three kinds of tlinks stated above.",
        "Each module follows a different strategy to guess a possible tlink, taking account of the three accessible knowledge sources.",
        "• Simple Tlink Module, this is the case when there exists a direct translation of the source entry in the bilingual dictionary.",
        "Example:",
        "• Orthographic Tlink Module, this case occurs when in both languages the same word with exactly the same spelling is used.",
        "Therefore, no bilingual dictionary is needed.",
        "• Compound Tlink Module, this is the case when the corresponding entry in the target lexicon is a compound one, being the target lexical entry made up of the concatenation of the two English words that appear in the bilingual entry.",
        "• Phrasal Noun Tlink Module, this case takes place whenever the translation is the concatenation of two other nouns; for example, the Spanish nouns for trees often correspond_ to two nouns in English, (like limonero lemon tree, melocotonero - peach tree, etc.).",
        "More complex cases can be recovered by using different grammar rules (also implemented within the LKB formalism).",
        "• Parent Tlink Module, this is the case of those very specific terms in the source lexicon which are not treated in the bilingual dictionary, but whose hyperonyms in the taxonomy have a clear translation that can generate a partial tlink.",
        "• Grandparent Tlink Module, this is a very similar case to the previous one, in which the source word's grandparent is used to produce the partial tlink.",
        "• General Tlink Module, this is the case when the translation appearing in the bilingual dictionary is composed of more than one word.",
        "Normally these explanations are made up as definitions in the form of a genus, plus some modifiers.",
        "A tlink connecting the source entry and the genus appearing in the definition must be mated.",
        "We will illustrate the tlink generation process with an example of an entry for which a number of different tlinks have been generated, namely batitio_X_LS.",
        "In figure 3 where batido_XJ_5 appears with the tlink options, we had selected the option all and subsequently, all the possible tlinks have been suggested by the system.",
        "lowever the TGF.",
        "allows for other selection criteria.",
        "As we can see in figure 3, five tlinks are suggested by the system for this particular example: 1) The first option is not a correct one.",
        "Among the various translations given for the source LKB entry batido_X 1_5 the adjective shot appears.",
        "Because another syntactic realisation of shot is that of a noun denoting a drinkable thing therefore it is included in the target subset.",
        "2) The second is a simple-tlink type linking batido_X_L5 with the target 1.K11 entry milks,shakeJ_00.",
        "In this case we have an example of the application of the compound-Wilk-lath:set.",
        "3) The third is a phrasal-tlink type, linking batido_X I 5 with the target LKI3 entries ntilk_1._1_1 and shake_1„2_3 composed by the + sign.",
        "This is an example of the application of the phrasal-noun-[link-ruleset.",
        "4) Both the fourth and firth are partial-tlink-types, linking batido_X_L5 with the target I,KB entries shakei,_2_3 and milk_L_LI respectively.",
        "This is an example of the application of the generalalink-ruleset."
      ]
    },
    {
      "heading": "5 Results",
      "text": [
        "Several experiments corresponding to rather \"closed\" and narrow semantic domains have been performed.",
        "We discuss next those corresponding to \"drinks\" [10].",
        "The Spanish taxonomy of drink-nouns, extracted from VOX dictionary, consists of 235 noun senses and has 5 levels.",
        "The English taxonomy of drink-nouns, extracted from LDOCE, consists of 192 noun senses.",
        "Some of the obtained results are the following:",
        "• While translating from Spanish to English, 223 out of",
        "235 drink-nouns have been linked by means of different and often more than one Oinks (95 To).",
        "However, only 52 English nouns have been linked with Spanish nouns (27%).",
        "Out of these 223 drink-nouns mentioned above, 210 have been linked by using (mainly) the bilingual dictionary as a translation resource while the rest, 13 of them, have been linked by means of the orthographic-think ruleset and consequently, the gap of the bilingual dictionary has finally been bridged, for in both languages the same word with exactly the same spelling is used.",
        "For example, chartrense_XJJ and chartreuseJ,JA, sherry_X_LI and sherty_1._0_0 , etc.",
        "• 74 out of 235 source LKII entries for drink-nouns are also bilingual entries (31,5%).",
        "Consequently, 161 source 1,10 entries have no corresponding bilingual entries (65,5%).",
        "This big gap in the bilingual dictionary is due to the fact that the one used, VOX/Iliump-s, is a very basic one, and as such it only contains 32,463 senses.",
        "In contrast the VOX monolingual Spanish dictionary covers a total of 143,700 senses.",
        "• 30 out of the translations of the 74 source LKB entries which were found in the bilingual dictionary are also target 1.,K11 entries.",
        "Consequently, the translations of 44 bilingual entries have no corresponding target LKB entries.",
        "• 13 out of 161 source LKII entries are also target LKB",
        "entries (8 %).",
        "• For most entries, more than one Clink type has been extracted.",
        "The total number of tlinks which have been generated and selected for the taxonomy of behida _X_I_3 (drink) with the explained software is 372 Oinks.",
        "Next we show the different tlinks generated by each ruleset and the amount of lexical entries of each language involved."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "In this paper we have presented TGE, an environment designed and built in order to help in the recovery of cross-linguistic relations.",
        "We have reported and described results of an experiment for automatically extracting the relations of equivalence for Spanish and English drink-nouns by using the TGE software.",
        "The resulting process is semi-automatic, whilst the (link generation is performed automatically, the selection of the desired Oinks is done manually.",
        "All the tlink-rulesets have worked satisfactorily, therefore resulting in a considerable part of the subsets being linked (95% of the source lexicon).",
        "However these PRE tlink-rulesets have only been tested over limited subsets of specific semantic fields.",
        "Its actual potential will be proven in a later stage, once its application to larger and less restricted sets of word senses takes place, including also categories which arc not considered to be nouns."
      ]
    },
    {
      "heading": "7. References",
      "text": []
    }
  ]
}
