{
  "info": {
    "authors": [
      "Zelal Gungordu",
      "Kemal Oflazer"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-1081",
    "title": "Parsing Turkish Using the Lexical Functional Grammar Formalism",
    "url": "https://aclweb.org/anthology/C94-1081",
    "year": 1994
  },
  "references": [
    "acl-E93-1066",
    "acl-J87-1004"
  ],
  "sections": [
    {
      "text": [
        "Abstract This paper describes our work on parsing 'Turkish using the lexical functional grammar formalism.",
        "This work represents the first effort for parsing Turkish.",
        "Our implementation is based on Tomita's parser developed at Carnegie-Mellon University Center for Machine Translation.",
        "The grammar covers a substantial subset of Turkish including simple and complex sentences, and deals with a reasonable amount of word order freeness.",
        "The complex agglutinative morphology of Turkish lexical structures is handled using a separate two-level morphological analyzer.",
        "After a discussion of key relevant issues regarding Turkish grammar, we discuss aspects of our system and present results from our implementation.",
        "Our initial results suggest that our system can parse about 82% of the sentences directly and almost all the remaining with very minor pre-editing."
      ]
    },
    {
      "heading": "1 INTRODUCTION",
      "text": [
        "As part of our ongoing work on the development of computational resources for natural language processing in Turkish we have undertaken the development of a parser for Turkish using the lexical-functional grammar formalism, for use in a number of applications.",
        "This work represents the first approach to the computational analysis of Turkish, though there have been a number of studies of Turkish syntax from a linguistic perspective (e.g., [Meskill 1970]).",
        "Our implementation is based on Tomita's parser developed at Carnegie-Mellon University Center for Machine Translation [Mushy et.al.",
        "1988, Tomita 1987].",
        "Our grammar covers a substantial subset of Turkish including simple and complex sentences, and deals with a reasonable amount of word order freeness.",
        "Turkish has two characteristics that have to be taken into account: agglutinative morphology, and rather free word order with explicit case marking.",
        "We handle the rather complex agglutinative morphology of the Turkish lexical structures using a separate morphological processor based on the two-level paradigm [Evans 1990, Mazer 1993] that we have integrated with the lexical-functional grammar parser.",
        "Word order freeness is dealt with by relaxing the order of phrases in the phrase structure parts of lexical-functional grammar rule by means of generalized phrases."
      ]
    },
    {
      "heading": "2 LEXICAL-FUNCTIONAL GRAMMAR",
      "text": [
        "Lexical-functional grammar (LFG) is a linguistic theory which fits nicely into computational approaches that use unification [ Shieber 1986].",
        "A lexical-functional grammar assigns two levels of syntactic description to every sentence of a language: a constituent structure and a functional structure.",
        "Constituent structures (c-structures) characterize the phrase structure configurations as a conventional phrase structure tree, while surface grammatical functions such as subject, object, and adjuncts are represented in functional structure (f-structure).",
        "Because of space limitations we will not go into the details of the theory.",
        "One can refer to Kaplan and Bresnan [Kaplan and Bresnan 1982] for a thorough discussion of the LFG formalism."
      ]
    },
    {
      "heading": "3 TURKISH SYNTAX",
      "text": [
        "In this section, we would like to highlight two of the relevant key issues in Turkish grammar, namely highly inflected agglutinative morphology and free word order, and give a description of the structural classification of Turkish sentences that we deal with."
      ]
    },
    {
      "heading": "3.1 Morphology",
      "text": [
        "Turkish is an agglutinative language with word structures formed by productive affixations of derivational and inflectional suffixes to root words [Mazer 1993].",
        "This extensive use of suffixes causes morphological parsing of words to be rather complicated, and results in ambiguous lexical interpretations in many cases.",
        "For example:",
        "(1) cocuklart a. child+PLU+3SG-POSS his children b. child+3PL-POSS their child c. child+PLU+3PL-POSS their children d. child+PLU+ACC children (ace.)",
        "Such ambiguity can sometimes be resolved at phrase and sentence levels by the help of agreement requirements though this is not always possible:",
        "• the agreement requirement between the modifier and the modified parts in a possessive compound noun eliminates (1a).2 • the facts that gel (come) does not subcategorize for an accusative marked direct object, and that in Turkish the subject of a sentence must be nominative eliminate (Id).",
        "• the agreement requirement between the subject and the verb of a sentence eliminates ( b).`1",
        "In (2b), both (la) and (lc) are possible (his children, and their children, respectively) because the modifier of the possessive compound noun is a covert one: it may be either anon (his) or onlarm (their).",
        "The other two interpretations arc eliminated due to the same reasons as in (2a)."
      ]
    },
    {
      "heading": "3.2 Word Order",
      "text": [
        "If we concern ourselves with the typical outer of constituents., Turkish can be characterized as being a subject--object – verb (SOV) language, though the data in Table I from Erguvanh [Erguvanh 1979), shows that other orders for constituents are also common (especially in discourse).",
        "In Turkish it is not the position, but the case of a limn phrase that determines its grammatical function in the sentence.",
        "Consequently typical order of the constituents may change rather freely without affecting the grammaticality of a sentence.",
        "Due to various syntactic and pragmatic constraints, sentences with the non-typical orders are not",
        "stylistic variants of the typical versions which can be used interchangeably in any context 11irguvanIt 19791.",
        "For example, a constituent that is to be emphasized is generally placed immediately before the verb.",
        "'Ibis affects the places of all the constituents in a sentence except that of the verb:",
        "(3a) Ben coeuga kitabi verdim.",
        "1 child+DAT hook+ACC give+PAST + I SG (1 gave the book to the child.)",
        "(3b) Coenga kitabt hen verdim.",
        "(It was the cltild to whom I gave the book.)",
        "(3a) is an example of the typical word order whereas in (3b) the subject, ben, is emphasized.",
        "Similarly, in (3c) the indirect object, coeuga, is emphasized.",
        "In addition to these possible changes, the verb itself nlay move away from its typical place, i.e., the end of the sentence.",
        "Such sentences are called inverted sentences and are typically used in informal prose and discourse.",
        "However, this looseness of ordering constraints at sentence level does not extend into all syntactic levels.",
        "There are even constraints at sentence level:",
        "• A nominative direct object should be placed immediately before the verb.5 fence, (50) is ungrammatical:6 (5a) Ben cocuga kitap verdim.",
        "I child+DAT book give+PAST+ SG (I gave a book to the child.)",
        "(5b) *Coeuga kitap ben verdim.",
        "child+DAT hook I give+PAST+1SG • Some adverbial complements of quality (those that are actually qualitative adjectives) always precede the verb or, if it exists, the indefinite direct object: (6a) Yetnei:ti iyi",
        "meal-I-ACC good cook+PAST+2SG (You cooked the meal well.)",
        "(6h) iyi yeine'gi good meal-i-A( cook+PAST+2SG (You cooked the good meal.)",
        "(6e) iyi yemek good meal cook+PAST+2SG (You cooked a good meallYou cooked a meal well.)",
        "Note that although (60) is grammatical iyi is no more an adverbial complement, but is an adjective that modifies yemegi.",
        "Note also that (6c) is ambiguous: iyi can be interpreted either as an adjective modifying yemek or as an Turkish, a transitive verb that subcategorizes for a direct object, can take either an accusative marked or a nominative marked (unmarked on the surface) noun phrase for that object.",
        "The function of accusative case marking is to indicate that the object refers to a particular definite entity, though there ale very rare cases where this is not the case.",
        "'Note that (31),c) are grammatical since the direct object, Hulk is marked accusative.",
        "adverb modifying p4irdin.7"
      ]
    },
    {
      "heading": "3.3 Structural Classification of Sentences",
      "text": [
        "The following summarizes the major classes of sentences in Turkish.",
        "(It wouldn't have been right for me to think that I wouldn't be able to find drinkable water here.)",
        "The subject of (7) (burada icilebilecek su bulamay-acaktmt zannetmek - to think that I wouldn't be able to find drinkable water here) is a nominal dependent clause whose definite object (burada icilebilecek su bulamayacagmn that I wouldn't be able to find drinkable water here) is an adjectival dependent clause which acts as a nominal one.",
        "The indefinite object of this definite object (icilebilecek su – drinkable water) is a compound noun whose modifier part is another adjectival dependent clause (icilebilecek drinkable), and modified part is a noun (su – water).",
        "It should be noted that there are other types of sentences in the classification according to structure.",
        "However, we will not be concerned with them here because of space limitations.",
        "(See itit,ek [Simsek 1957], and Glingiirdti [Gtingizirdii 1993] for details.)"
      ]
    },
    {
      "heading": "4 SYSTEM ARCHITECTURE AND IMPLEMENTATION",
      "text": [
        "We have implemented our parser in the grammar development environment of the Generalized LR Parser/Compiler developed at Carnegie Mellon University Center for Machine Translation.",
        "No attempt has been made to include",
        "morphological rules as the parser lets us incorporate our own morphological analyzer for which we use a lull scale two-level specification of Turkish morphology based on a lexicon of about 24,000 root words[Ofiazer 1993].",
        "This lexicon is mainly used for morphological analysis and has limited additional syntactic and semantic information, and is augmented with an argument structure databases Figure 1 shows the architecture of our system.",
        "When a sentence is given as input to the program, the program first calls the morphological analyzer for each word in the sentence, and keeps the results of these calls in a list to be used later by the parser.` If the morphological analyzer fails to return a structure for a word for any reason (e.g., the lexicon may lack the word or the word may be misspelled), the program returns with an error message.",
        "After the morphological analysis is completed, the parser is in-yoked to check whether the sentence is grammatical.",
        "The parser performs bottom-up parsing.",
        "During this analysis, whenever it consumes a new word front the sentence, it picks up the morphological structure of this word front the list.",
        "if the word is a finite verb or an infinitival, the parser is also provided with the subcategori ration frame of the word.",
        "At the end of the analysis, if the sentence is grammatical, its f-structure is output by the parser."
      ]
    },
    {
      "heading": "5 THE GRAMMAR",
      "text": [
        "In this section, we present an overview of the LPG specification that we have developed for Turkish syntax.",
        "Our grammar includes rules for sentences, dependent clauses, noun phrases, adjectival phrases, postpositional phrases, adverbial constructs, verb phrases, and a number of lexical look up rules.\") Table 2 presents the number of rules for each category in the grammar.",
        "There are also some intermediary rules, not shown here.",
        "Recall that the typical order of constituents in a sentence may change clue to a number of reasons.",
        "Since the order of phrases is fixed in the phrase structure component of an LFG rule, this rather free nature of word order in sentence level constitutes a major problem.",
        "In order to keep from using a number of redundant rules we adopt the following strategy in our rules: We use the same place holder, <XP>, for all the syntactic categories in the phrase structure component of a sentence or a dependent clause rule, and check the categories of these phrases in the equations part of the rule.",
        "In Figure 2, we give a grammar rule for the sentence with two constituents, with an informal description of the equation part.",
        "t' Recall also that an indefinite object should be placed immediately before the verb, and some adverbial complements of quality (those that are actually qualitative adjectives) always precede the verb or, if it exists, the indefinite direct object.",
        "In our grammar, we treat such objects and adverbial complements as parts of the verb phrase.",
        "So, we do not check these constraints at the sentence or dependent clause level."
      ]
    },
    {
      "heading": "6 PERFORMANCE EVALUATION",
      "text": [
        "In this section, we present some results about the performance of our system on test runs with four different texts on different topics.",
        "All of the texts are articles taken from magazines.",
        "We used the CMU Common Lisp system running 15Recall that no morphological rules are included.",
        "The lexical look up rules are used just to call the morphological analyzer.",
        "I 5 Note that x0, xl, and x2 refer to the functional structures of the sentence, the first constituent and the second constituent in the phrase structure, respectively.",
        "assign xl to the functional structure of the verb of the sentence if x2's category is VP then assign x2 to the functional structure of the verb of the sentence 2) for 1 = 1 to 2 do if xi has already been assigned to the verb then do nothing if xi's category is ADVP then add xi to the adverbial complements of the sentence if xi's category i.s NP and xi's case is nominative then assign xi to the functional structure of the subject of the sentence if xi's category is NP then if the verb of the sentence can take an object with this case (consider also the voice of the verb) add xi to the objects of the verb 3) check if the verb has taken all the objects that it has to take 4) make sure that the verb has not taken more than one object with the same thematic role 5) check if the subject and the verb agree in number and person: if the subject i.s defined (overt) then if the agreement feature of the subject is third person plural then the agreement feature of the verb may be either third person singular or third person plural else the agreement features of the subject and the verb must be the same",
        "In all of the texts there were some sentences outside our scope.",
        "These were:",
        "• sentences that contain finite sentences as their constituents or modifiers of their constituents, • conditional sentences, • finite sentences that are connected by coordinators (and/or), and • sentences with discontinuous constituents.'",
        "We pre-edited the texts so that the sentences were in our scope (e.g., separated finite sentences connected by coordinators and parsed them as independent sentences, and ignored the conditional sentences).",
        "Table 3 presents some statistical information about the test runs.",
        "The first, second and third columns show the document number, the total number of sentences and the number of sentences that we could parse without pre-editing, respectively.",
        "The other columns show the number of sentences that we totally ignored, the number of sentences in the pre-edited versions of the documents, average number of parses per sentence generated and average CPU time for each of the sentences in the texts, respectively.",
        "It can be seen that our grammar can successfully deal with about 82% of the sentences that we have experimented with, with almost all remaining sentences becoming parsable after a minor pre-editing.",
        "This indicates that our grammar coverage is reasonably satisfactory.",
        "Below, we present the output for a sentence which shows very nicely where the structural ambiguity comes out in Turkish.14 The output for (8a) indicates that there are four 12We should however note that the times reported are exclusive of the time taken by the morphological processor, which with a 24,000 word root lexicon is rather slow and can process about 2-3 lexical forms per second.",
        "We have, however, ported our morphological analyzer to the XEROX TWOL system developed by Karttunen and Beesley [Karttunen and Beesley 1992] and this system can process about 500 forms a second.",
        "We intend to integrate this to our system soon.",
        "°Word order freeness in Turkish allows various kinds of discontinuous constituents, e.g., an adverbial adjunct cutting in the middle of a compound noun.",
        "\"This example is not in any of the texts mentioned above.",
        "It is taken from the first author's thesis [GiingLirdti 19931. ambiguous interpretations for this sentence as indicated in (8b-e):IS (ga) Kiiciik kirmutt top gittikce Inzlandt.",
        "little red ball go+GER speed up red paint+ gradually +PAST 3SG–POSS +3SG (8b) The little red ball gradually sped up.",
        "(gc) The little red (one) sped up as the ball went.",
        "(8d) The little (one) sped up as the red ball went.",
        "(8e) It sped up Os the little red ball went.",
        "The output of the parser for the first interpretation is given in Figure 3.",
        "This output indicates that the subject of the sentence is a noun phrase whose modifier part is OW, mid modified part is another noun phrase whose modifier part is kirmizi and modified part is top.",
        "The agreement of the subject is third person singular, case is nominative, etc.",
        "ihz.lanth is the verb of the sentence, and its voice is active, tense is past, agreement is third person singular, etc.",
        "Cittikce is a temporal adverbial complement.",
        "Figures 4 through 7 illustrate the c-structures of the four ambiguous interpretations (8b-e), respectively:16",
        "• In (8b), the adjective larmizt modifies the noun top, and this noun phrase is then modified by the adjective hiciik.",
        "The entire noun phrase functions as the subject of the main verb Inzlandt, and the gerund gittikce functions as an adverbial adjunct of the main verb.",
        "• In (8c), the adjective ktrourt is used as a noun, and is modified by the adjective kiiciik.\" This noun phrase functions as the subject of the main verb.",
        "The noun top functions Os the subject of the gerund gittikce, and this non-finite clause functions as an adverbial adjunct of the main verb.",
        "• In (8(1), the adjective kayak is used as a noun, and functions as the subject of the main verb.",
        "The noun phrase ktrmtzt top functions as the subject of the gerund gittikr, arid this non-finite clause functions as an adverbial adjunct of the main verb.",
        "• In (8e), the noun phrase kiiclik Jamul top functions as the subject Of the gerund gittikce (cf. (fib) where it functions as the subject of the main verb), and this non-finite clause functions as an adverbial adjunct of the main verb.",
        "Note that the subject of the main verb in this interpretation (i.e., it) is a covert one.",
        "Hence, it does not appear in the c-structure shown in Figure 7."
      ]
    },
    {
      "heading": "7 CONCLUSIONS AND SUGGESTIONS",
      "text": [
        "We have presented a summary and highlights of our current work on providing an LFG specification for Turkish syntax.",
        "To the best of our knowledge this is the first such effort for constructing a computational grammar for Turkish.",
        "Our domain includes structurally simple and complex Turkish sentences.",
        "The rather complex morphological analyses of agglutinative words structures of Turkish are handled by a full-scale two-level morphological specification implemented in PC-KIMMO.",
        "We have number of directions for improving our grammar and parser: • Turkish is very rich in terms of adverbial constructs.",
        "We handle a great deal of these constructs by using a large number of rules.",
        "We are now in the process of developing a tagger with a multi-word construct recognizer to preprocess the text so that many multi-word and idiomatic constructs can be handled outside the grammar.",
        "In this way, multi-word constructs such as yapar yapmaz (do+AOR+3SG do+NEG+AOR+3SG) (as soon as (one) does (that)) where both lexical categories are verbal but the compound construct is an adverb, can be handled, so can idiomatic constructs like yam stra (side+3SG–POSS row) (besides) where the function and semantics of the multi-word construct has nothing to do with the function and semantics of the constituent lexical forms.",
        "• We are currently working on extending the subset of sentences dealt with in respect of structure.",
        "• We are currently working on augmenting our lexicon",
        "with substantial lexical information and selectional restriction information to be used with an integrated ontological database."
      ]
    },
    {
      "heading": "8 ACKNOWLEDGEMENTS",
      "text": [
        "We would like to thank Carnegie-Mellon University, Center for Machine Translation for making available to us their LEG parsing system.",
        "We would also like to thank Elisabet Engdahl and Matt Crocker of the Centre for Cognitive Science, University of Edinburgh, for providing valuable comments and suggestions.",
        "This work was done as a part of a large scale NLP project (TU-LANGUAGE) which is funded by a NATO Grant under the Science for Stability Program."
      ]
    }
  ]
}
