{
  "info": {
    "authors": [
      "Takehito Utsuro",
      "Hiroshi Ikeda",
      "Masaya Yamane",
      "Yuji Matsumoto",
      "Makoto Nagao"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2175",
    "title": "Bilingual Text, Matching Using Bilingual Dictionary and Statistics",
    "url": "https://aclweb.org/anthology/C94-2175",
    "year": 1994
  },
  "references": [
    "acl-C90-3031",
    "acl-C90-3101",
    "acl-C92-2088",
    "acl-C92-2101",
    "acl-H91-1026",
    "acl-J90-2002",
    "acl-J93-1004",
    "acl-J93-2003",
    "acl-P91-1017",
    "acl-P91-1022",
    "acl-P93-1001",
    "acl-P93-1002",
    "acl-P93-1003",
    "acl-P93-1004"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes a unified framework for bilingual text matching by combining existing handwritten bilingual dictionaries and statistical techniques.",
        "The process of bilingual text matching consists of two major steps: sentence alignment and structural matching of bilingual sentences.",
        "Statistical techniques are applied to estimate word correspondences not included in bilingual dictionaries.",
        "Estimated word correspondences are useful for improving both sentence alignment and structural matching."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Bilingual (or parallel) texts are useful as resources of linguistic knowledge as well as in applications such as machine translation.",
        "One of the major approaches to analyzing bilingual texts is the statistical approach.",
        "The statistical approach involves the following: alignment of bilingual texts at the sentence level using statistical techniques (e.g. Brown, Lai and Mercer (1991), Gale and Church (1993), Chen (1993), and Kay and Riischeisen (1993)), statistical machine translation models (e.g. Brown, Cocke, Pietra, Pietra et al.",
        "(1990)), finding character-level / word-level / phrase-level correspondences from bilingual texts (e.g. Gale and Church (1991), Church (1993), and Kupiec (1993)), and word sense disambiguation for MT (e.g. Eagan, Itai and Schwan (1991)).",
        "In general, the statistical approach does not use existing handwritten bilingual dictionaries, and depends solely upon statistics.",
        "For example, sentence alignment of bilingual texts are performed just by measuring sentence lengths in words or in characters (Brown et al., 1991; Gale and Church, 1993), or by statistically estimating word level correspondences (Chen, 1993; Kay and Ithscheisen, 1993).",
        "The statistical approach analyzes unstructured sentences in bilingual texts, and it is claimed that the results are useful enough in real applications such as machine translation and word sense disambiguation.",
        "However, structured bilingual sentences are undoubtedly more informative and important for future natural language researches.",
        "Structured bilingual or multilingual corpora serve as richer sources for extracting linguistic knowledge (Klavans and Tzoukermann, 1990; Sadler and Vendelmans, 1990; Raji, Kida and Moritnoto, 1992; Utsuro, Matsumoto and Nagao, 1992; Matsumoto, Ishimoto and Utsuro, 1993; 1J t-suro, Matsumoto and Nagao, 1993).",
        "Compared with the statistical approach, those works are quite different in that they use word correspondence information available in handwritten bilingual dictionaries and try to extract structured linguistic knowledge such as structured translation patterns and case frames of verbs.",
        "For example, in Matsumoto et al.",
        "(1993), we proposed a method for finding structural matching of parallel sentences, making use of word level similarities calculated from a bilingual dictionary and a thesaurus.",
        "Then, those structurally matched parallel sentences are used as a source for acquiring lexical knowledge such as verbal case frames (Utsuro et al., 1992; Utsuro et al., 1993).",
        "With the aim of acquiring those structured linguistic knowledge, this paper describes a unified framework for bilingual text matching by combining existing handwritten bilingual dictionaries and statistical techniques.",
        "The process of bilingual text matching consists of two major steps: sentence alignment and structural matching of bilingual sentences.",
        "In those two steps, we use word correspondence information, which is available in handwritten bilingual dictionaries, or not included in bilingual dictionaries but estimated with statistical techniques.",
        "The reasons why we take the approach of combining bilingual dictionaries and statistics are as follows: Statistical techniques are limited since 1) they require bilingual texts to be long enough for extracting useful statistics, while we need to acquire structured linguistic knowledge even from bilingual texts of about 100 sentences, 2) even with bilingual texts long enough for statistical techniques, useful statistics can not be extracted for low frequency words.",
        "For the reasons 1) and 2), the use of bilingual dictionaries is inevitable in our application.",
        "On the other hand, existing handwritten bilingual dictionaries are limited in that available dictionaries are only for daily words and usually domain specific on-line bilingual dictionaries are not available.",
        "Thus, statistical techniques are also inevitable for extracting domain specific word correspondence information not included in existing bilingual dictionaries.",
        "At present, we are at the starting point of combining existing bilingual dictionaries and statistical techniques.",
        "Therefore, as statistical techniques for estimating word correspondences not included in bilingual dictionaries, we decided to adopt techniques as simple as possible, rather than techniques based-on complex probabilistic translation models such as in",
        "- estimation – • Grammar - Dictionary",
        "Brown et al.",
        "(1990), Brown, Pietra, Pietra and Mercer (1993), and Chen (1993).",
        "What we adopt are simple co-occurrence-frequency-based techniques in Gale and Church (1991) and Kay and Riischeisen (1993).",
        "As techniques for sentence alignment, we adopt also quite a simple method based-on the number of word correspondences, without any probabilistic translation models.",
        "In the following sections, we illustrate the specifications of our bilingual text matching framework."
      ]
    },
    {
      "heading": "2 The Framework of Bilingual",
      "text": []
    },
    {
      "heading": "Text Matching",
      "text": [
        "The overall .framework of bilingual text matching is depicted in Fig. 1.",
        "Although our framework is implemented for Japanese and English, it is language independent.",
        "First, bilingual texts are aligned at sentence level using word correspondence information which is available in bilingual dictionaries or estimated by statistical techniques.",
        "\"Statistical estimation\" at text level indicates that length-based statistical techniques are applied if necessary.",
        "(At present, they are not implemented.)",
        "\"Statistical estimation\" at sentence level indicates that word-to-word correspondences are estimated by statistical techniques.",
        "Then, each monolingual sentence is parsed into a disjunctive dependency structure and structurally matched using word correspondence information.",
        "In the course of structural matching, lexical and syntactic ambiguities of monolingual sentences are resolved.",
        "Finally, from the matching results, monolingual lexical knowledge and translation patterns are acquired.",
        "So far, we have implemented the following: sentence alignment based-on word correspondence information, word correspondence estimation by co-occurrence-frequency-based methods in Gale and Church (1991) and Kay and Rbscheisen (1993), structural matching of parallel sentences (Matsumoto et al., 1993), and case frame acquisition of Japanese verbs (Utsuro et al., 1993).",
        "In the remainder of this paper, we describe the specifications of sentence alignment and word correspondence estimation in sections 3 and 4, then report the results of small experiments and evaluate our framework in section 5."
      ]
    },
    {
      "heading": "3 Sentence Alignment",
      "text": []
    },
    {
      "heading": "3.1 Bilingual Sentence Alignment Problem",
      "text": [
        "In this section, we formally define the problem of bilingual sentence alignment.]",
        "Let S be a text of n sentences of a language, and T be a text of m sentences of another language and suppose that S and 7' are translation of each other:",
        "Let p be a pair of minimal corresponding segments in texts S and T. Suppose that p consists of x sentences ... sail, .",
        ", sa in S and y sentences tb_ri4, • • • , tb in T and is denoted by the following: p = (a, x; b, y) Note that x and y could be 0.",
        "In this paper, we call the pair of minimal corresponding segments in bilingual texts a sentence bead.",
        "Then, sentences in bilingual texts of S and T are aligned into a sequence P of sentence beads:",
        "We put some restriction on possibilities of sentence alignment.",
        "We assume that each sentence belongs to only one sentence bead and order constraints must be preserved in sentence alignment.",
        "Supposing pi = (ai, bi,yi), those constraints are expressed in the following: ao = 0 , bo = 0 + xi , bi = yi (1 < i < k) Suppose that a scoring function h can be defined for estimating the validity of each sentence bead pi.",
        "Then, bilingual sentence alignment problem can be defined as an optimization problem that finds a sequence P of sentence beads which optimizes the total score H of the sequence P:"
      ]
    },
    {
      "heading": "3.2 Bilingual Sentence Alignment using Word Correspondence Infor",
      "text": [
        "mation In this section, we describe the specification of our sentence alignment method based-on word correspondence information.3 lIn this paper, we do not describe paragraph alignment process.",
        "For the moment, our paragraph alignment program is not reliable enough and the results of sentence alignment are better without paragraph alignment than with paragraph alignment.",
        "Since bilingual texts in our bilingual corpus are not so long, the computational cost of sentence alignment is not serious problem even without paragraph alignment.",
        "'The term bead is taken from Brown et al.",
        "(1991).",
        "'We basically use dictionary-based bilingual sentence alignment method originally reported in Murao (1991).",
        "The work in Murao (1991) was done under the supervision of Prof. M. Nagao and Prof. S. Sato (JAIST, East)."
      ]
    },
    {
      "heading": "3.2.1 Score of Sentence Bead",
      "text": [
        "Before aligning sentences in bilingual texts, content words are extracted from each sentence (after each sentence is morphologically analyzed if necessary), and word correspondences are found using both bilingual dictionaries and statistical information source for word correspondence.",
        "Then, using those word correspondence information, the score h of a sentence head p is calculated as follows.",
        "First, supposing p= (a, x; b, y), and let ns(a, x) and nt(b, y) be the numbers of content words in the sequences of sentences s.-xl.1, • • .",
        ", sa and tit 1 i • • , tb respectively, and n.,t(p) be the number of corresponding word pairs in p. Then, the score h of p is defined as the ratio of nst(p) to the sum of ns (a, x) and nt (b, y):",
        "Let Pi be the sequence of sentence beads from the beginning of the bilingual text up to the bead pi:",
        "Then, we assume that the score H (Pi) of Pi follows the recursion equation below:",
        "Let Ha(ai, bi) be the maximum score of aligning a part of S (from the beginning up to the ai(=ai_id--xi) th sentence) and a part of T (from the beginning up to bi(= +yi ) - th sentence).",
        "Then, Equation 1 is transformed into: (ai, = max{ H„,(a - xi,bi – yi) h((ai, i; bi, yi))} where the initial condition is:",
        "We limit the pair (xi, yi) of the numbers of sentences in a sentence bead to some probable ones.",
        "For the moment, we allow only 1-1, 1-2, 1-3, 1-4, 2-2 as pairs of the numbers of sentences:",
        "This optimization problem is solvable as a standard problem in dynamic programming.",
        "Dynamic programming is applied to bilingual sentence alignment in most of previous works (Brown et al., 1991; Gale and Church, 1993; Chen, 1993)."
      ]
    },
    {
      "heading": "4 Word Correspondence Estimation",
      "text": [
        "In this section, first we describe estimation functions based-on co-occurrence frequencies.",
        "Then, we show how to incorporate word correspondence information available in bilingual dictionaries and to estimate word correspondences not included in bilingual dictionaries.",
        "Finally, we describe the threshold function for extracting corresponding word pairs."
      ]
    },
    {
      "heading": "4.1 Estimation Function",
      "text": [
        "In the following, we assume that sentences in the bilingual text are already aligned.",
        "Let w, and w, be words in the texts S and T respectively, we define the following frequencies:",
        "Then, estimation functions of Gale's (Gale and Church, 1991) and Kay's (Kay and Riischeisen, 1993) are given as below.",
        "Let a d be as follows:",
        "= freq(ws) freq(ws,wt) = freq(wt)-- freq(w,wt) d Then, the validity of word correspondence w, and wt is estimated by the following value:",
        "The validity of word correspondence w, and wt is estimated by the following value:"
      ]
    },
    {
      "heading": "4.2 Incorporating Bilingual Dictionary",
      "text": [
        "By incorporating word correspondence information available in bilingual dictionaries, it becomes easier to estimate word correspondences not included in bilingual dictionaries.",
        "Let w,, be a word in the text S and wt, wt be words in the text T. Suppose that the correspondence of fu„ and wt is included in bilingual dictionaries, while the correspondence of w, and w; is not included.",
        "Then the problem is to estimate the validity of word correspondence of los and a4.",
        "Let freq(ws,wt), freq(w„,w;), freq(w,), freq(wt), and freq(w;) be the same as above, and freq(w,,wt, wt) be time frequency of w5, let, and /14's co-occurring in a sentence bead.",
        "Then, we solve the problem above by defining freq' (ws,w;), freq' (w,), freq'(v4), and N' which become the inputs to Gale's method or Kay's method.",
        "We describe two different ways of defining those values."
      ]
    },
    {
      "heading": "Estimation I",
      "text": [
        "One is to estimate all the word correspondences equally except that the co-occurrence of w, and wt is preferred to that of ws and w;.",
        "freq1(ws,w;), freq1(w,), freql(w;), and N' are given below:4",
        "When ws,wt, and u4 are co-occurring in a sentence bead, the co-occurrence of w, and wt is preferred and that of w„ and w; is ignored.",
        "Thus, freq1(w,,w;) is obtained by subtracting the frequency of all those cases from the real co-occurrence frequency of w, and w;.",
        "But, freq' (w,) and freq1(114) are the same as the real frequencies and the estimated word correspondences reflect the real co-occurrence frequencies in the input text.",
        "(Compare with Estimation II.)",
        "Word correspondences both included and not included in bilingual dictionaries are equally estimated their validities."
      ]
    },
    {
      "heading": "Estimation II",
      "text": [
        "The other is to remove from the input text all the co-occurrences of word pairs included in bilingual dictionaries.",
        "f r eq'(ww;), freq1(w5), freq' (w;), and N' are given below:"
      ]
    },
    {
      "heading": "5 Experiment and Evaluation",
      "text": [
        "With this option, after all the co-occurrences of word pairs included in bilingual dictionaries are removed from the input text, word correspondences not included in bilingual dictionaries are estimated their validities.",
        "In the following sections, we temporarily adopt Estimation I for estimating word correspondences not included in bilingual dictionaries.",
        "It is necessary to further investigate and compare the two estimation methods with large-scale experiments."
      ]
    },
    {
      "heading": "4.3 Threshold Function",
      "text": [
        "As a threshold function for extracting appropriate corresponding word pairs, we use a hyperbolic function of word frequency and estimated value for word correspondence.",
        "At first, we define the following variables and constants:5 (co-occurrence frequency) y = (estimated value for word correspondence) a (constant for eliminating low frequency words) ( 1.0 for both h9and hk b (constant for eliminating words) with low estimated value) ( 0.1 for It, and 0.3 for ht ) (lower bound of word frequency) ( 2.5 for both h, and Then, the threshold function g(x, y) is defined as below:",
        "And the condition for extracting corresponding word pairs is given below: g(x,y) > 1 , x > c When using extracted word correspondences in sentence alignment and structural matching, at present we ignore the estimated values and use estimated word correspondences and word correspondences in bilingual dictionaries equally.",
        "\"Note that values for constants are determined temporarily and need further investigation with large-scale experiments.",
        "Especially, constants related to word frequency have to be tuned to the length of texts.",
        "In this section, we report the results of a small experiment on aligning sentences in bilingual texts and statistically estimating word correspondences.",
        "The sentence alignment program and the word correspondence estimation program are named AlignCO.",
        "The processing steps of AlignCO are as follows:",
        "1.",
        "Given a bilingual text, content words are extracted from each sentence.",
        "2.",
        "A Japanese-English dictionary of about 50,000 entries is consulted and word correspondence information is extracted for content words of each sentence.",
        "3.",
        "The sentence alignment program named AlignCO/A aligns sentences in the input text by the method stated in section 3.2.",
        "4.",
        "Given the aligned sentences in the bilingual text, the word correspondence estimation program named AlignCO/C estimates word correspondences which are not included in the Japanese-English dictionary with option Estimation I in section 4.2.",
        "5.",
        "Combining word correspondence information available in the Japanese-English dictionary and estimated by AliynCO/C, sentences in the input text are realigned.",
        "As input Japanese-English bilingual texts, we use two short texts of different length -- 1) \"The Dilemma of National Development and Democracy\" (305 Japanese sentences and 300 English sentences, henceforth \"dilemma\"), 2) \"Pacific Asia in the Post-Cold-War World\" (134 .Japanese sentences and 123 English sentences, henceforth \"cold-war\").",
        "Since the results of Gale's method arid Kay's method did not differ so much, we show the result of Gale's method only."
      ]
    },
    {
      "heading": "5.1 Sentence Alignment",
      "text": [
        "The followings are five best results of sentence alignment before and after estimating word correspondences not included in the Japanese-English dictionary.",
        "The results are improved after estimating word correspondences not included in the bilingual dictionary."
      ]
    },
    {
      "heading": "5.2 Word Correspondence Estimation",
      "text": [
        "We classify the estimated word correspondences into three categories, \"correct\", \"part of phrase\", and \"wrong\".",
        "\"part of phrase\" means that the estimated word correspondence can be considered as part of corresponding phrases.",
        "\"error rate\" is the ratio of the number of \"wrong\" word correspondences to the total number.",
        "The result of \"dilemma\" is better that that of \"coldwar\".",
        "This is becai se the former is longer than the latter.",
        "The followings are example word correspondences of each category where f,, ft, and fst are freq(ws), f reg(w t), and f req(w „, 1) respectively.",
        "The paren",
        "names like \" – sultan\", or those which have different parts of speech, like \" 1'1111 (noun) liberal (adjective)\" and \" (noun) --- economic (adjec- tive)\", or those which can be considered as translation equivalents but not included in the Japanese-English dictionary, like \" (news) - press\".",
        "The examples of \"part of phrase\" form a phrase correspondence \" )(:IAA-iii civilian supremacy\".",
        "The former \"wrong\" correspondence \" (meaning) -- does\" comes from the correspondence of long distance dependent phrases \" -1.7a -- does – mean\".",
        "The latter \"wrong\" correspondence \" A..14a (pacific ocean) – and\" is extracted by Gale's method because both freq(M'In) and freq(and) are high and close to the total number of sentence heads.",
        "This correspondence is not extracted by Kay's method.",
        "Then, in Fig. 2, we illustrate the relation between the estimated value 11,5(w,,w1) of Gale's method and the co-occurrence frequency f reg(w , wt) for the text \"dilemma\".",
        "The threshold function seems optimized so that it extracts as many word correspondences of the category \"correct\" and \"part of phrase\" as possible, and extracts as few word correspondences of the category \"wrong\" as possible."
      ]
    },
    {
      "heading": "6 Concluding Remarks",
      "text": [
        "This paper described a unified framework for bilingual text matching by combining existing handwritten bilingual dictionaries and statistical techniques.",
        "Especially, we described a method for aligning sentences using word correspondence information, and a method for estimating word correspondences not included in bilingual dictionaries.",
        "Estimated word correspondence information will improve the results of structural matching of bilingual sentences.",
        "It will be reported in the future.",
        "With the same techniques as those for estimating word correspondences, it is quite easy to estimate correspondences of phrases such as noun phrases and idiomatic expressions.",
        "Then, the results of structural matching will he much more improved.",
        "In order to improve the accuracy of sentence alignment, we need to combine our word-correspondence-based method with those length-based methods in Brown et al.",
        "(1991) and Gale and Church (1993).",
        "In the case of Japanese-English texts, the word-based method in Brown et al.",
        "(1991) might be better than the character-based method in Gale and Church (1993)."
      ]
    }
  ]
}
