{
  "info": {
    "authors": [
      "Leo Wanner"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-1060",
    "title": "On Lexically Biased Discourse Organization in Text Generation",
    "url": "https://aclweb.org/anthology/C94-1060",
    "year": 1994
  },
  "references": [
    "acl-C92-2096",
    "acl-C92-2114",
    "acl-C92-3138",
    "acl-J86-3001",
    "acl-W94-0316"
  ],
  "sections": [
    {
      "heading": "Summary",
      "text": [
        "In this paper, we show that Reiteration and Collocation relations as introduced by Halliday and Masan may function as lexically biased discourse structure relations and that these relations are well represented by sequences of Mel'iluk's Lexical Panctions (LA's).",
        "We propose to use LE sequences for the final determination and realization of discourse organization during lexical choice in text generation."
      ]
    },
    {
      "heading": "1 LEXICAL PHENOMENA IN DISCOURSE",
      "text": []
    },
    {
      "heading": "1.1 The Problem",
      "text": [
        "In text generation, the task of content selection and discourse organization, i.e. text planning, has often been opposed to the task of linguistic realization of the information selected and organized by the text planning process (cf., e.g., McKeown and Swartout, 1987).",
        "However, discourse organization is not possible without taking into account linguistic means that are available to express a particular meaning (cf., e.g., Metter, 1992; Itubinoff, 1992).",
        "Especially the failure to integrate lexical choice into the planning process may lead to monotonous, awkward, or even ungrammatical text (note that when used separately, tire clauses in (la) and (2a) are fully acceptable):1",
        "lit.",
        "'Hans made a discovery; this discovery was a discovery in the real sense of the word'.",
        "These examples show that lexical constraints are of a special relevance to discourse organization if related discourse segments communicate information on the same or related object, event, process, etc.",
        "While in the past, considerable work has been done on the realization of anaphoric links between related entities via referring expressions (cf., e.g., 'rutin and Kittredge, 1992; Dale, 1989; Reiter, 1991), only a few proposals emphasize the relevance of lexical means for the realization of discourse structure relations such as CONTRAST in ( b) and MLA BORATION in (2b) and (3b).2 It is important to note that the actual realization of a discourse relation may vary with the semantics of the lexemes involved.",
        "For example, in (4), the second clause is an INTERPRETATfON or CONSEQUENCE of the first; despite the analogous syntactic construction in (0), the second clause is a PISTIFICATION or an EXPLANATION of the first rather than an INTTRPRRTATION or CONSEQUENCE.",
        "(1) Alle betvahrten !tulle; nue Hans kon-ute keine Bulte/(siet nicht) bervahren lit.",
        "'All kept calmness; only lairs could not keep calmness / it'.",
        "vs. b. Ails bewahrten Butte; Styr Hans karmic nicht ruhig ()kitten lit.",
        "'All kept calmness; only I fans could not keep calm'.",
        "(2) a.",
        "?Der langgeplante Ansfing farad ant Sountag statt; win unternaltmen ihn fait der ganzen Tallith)?",
        "lit.",
        "\"File long-planned trip took place on Sunday; we undertook it with the entire family'.",
        "vs."
      ]
    },
    {
      "heading": "1.2 The Proposal",
      "text": [
        "Such relations as those between Ruhe bewahren keep calmness' and ruhig bleiben qto] keep calm' (in 1); between Ansflug findet stall 'trip takes place' and am Ansflug leilnehmen qto] take part in the trip' (in 2); and between eine En-idea•ono 'discovery' and im wahrsten Shirr() des !fortes 'in the real sense of the word' (in 3) have been introduced by (Halliday and Hasan, 1976) as Reiteration and Collocation relations.' 2111 this paper, we use the names of discourse structure relations as they are known from the Rhetorical S C hire Theory (Mann and 'llompson, 1987).",
        "'Although preferably used so far to describe discourse links between information segments realized by nouns, Reiteration.",
        "and Collocation relations may well hold between segments which are realized by other parts of speech and even by multiple word expressions.",
        "(4) He travels a lot --- he is a 'profe3sionaV traveller.",
        "(5) He flies a lot -- he is a profegsional flier.",
        "Reiteration stands for a strict repetition of a lexical expression in related discourse segments; for a substitution of a lexical expression by a synonym, or for a substitution by a superordinate.",
        "Consider the following examples, which illustrate the three different reiteration relations (strict repetition in (7a), synonymy in (7b), and superordination in (7c)):",
        "(6) Last summer, Monica flew to Italy, (7) a. while Daniela flew to Norway.",
        "b. while Daniela took the plane to Norway.",
        "c. while Daniela travelled to Norway.",
        "Collocation stands for 'any recognizable lexicose-mantic relation' between lexical expressions in related discourse segments.",
        "Examples of collocation relations",
        "As our examples show, reiteration and collocation relations help to ensure not only cohesion, but also coherence in texts.",
        "Therefore, a text generator has to provide an organization of lexical resources that tailors discourse structure relations to reiteration and collocation relations.",
        "This presupposes, on the one hand, a precise picture of which reiteration and collocation relations are available in language and how they are realizable; and, on the other hand, a fine-grained discourse model that contains these relations.",
        "To make allowance for the global discourse organization, which is performed independently from lexical resources, we suggest a two level text planning task implementation, with the first level realized by a Rhetorical Structure Theory Ova) (Maim and Thompson, 1987) style text planner and the second level by a separate lexical choice module.",
        "Then, the discourse organization of a text is done in two steps: in the first step, the text planner predetermines the discourse structure relations; in the second step, the lexical choice module provides, in accordance with linguistic constraints, the final determination and the realization of these discourse structure relations.",
        "The present paper reports an attempt to define lexically biased discourse structure relations used in a partially implemented lexical choice module.",
        "Due to the lack of space, we do not discuss the module itself; it is described in detail in (Wanner, 1992, 1994).",
        "Here, we demonstrate how discourse organization for text generation can be refined by lexically biased discourse structure relations and how these relations are related to global discourse relations specified in the output of an RST style text planner.",
        "In contrast to the most discourse models (cf., e.g., McKeown, 1985; Grosz and Sidner, 1986; Mann and Thompson, 1987), which take the clause as the minimal discourse segment, we consider as discourse segments \"perspectives\" (cf. McCoy, 1989) – specific views taken on a semantic entity (an object, an event, etc.).",
        "A perspective is a wording which is tailored to the lexical repertoire of an entity; it is realizable as a clause, a phrase, or as a single lexeme.",
        "Each of Lhe clauses in the examples above can be considered as a realization of a single perspective; and the reiteration and collocation relations that hold between the clauses – as well-defined perspective pairs.",
        "In our model, a single perspective is represented as a composition of MePenk's Lexical Functions (hereafter Les) (Merenk and Polguere, 1987); perspective pairs are represented as Le sequences.",
        "The following distinctive features characterize our model:",
        "• it makes sure that all relations defined are expressible in language, • it allows for a realization of lexical relations as subclansal relations between discourse segments, • it is sensitive to lexical and syntactic variations for the realization of discourse structure relations."
      ]
    },
    {
      "heading": "2 LEXICAL FUNCTIONS IN DISCOURSE",
      "text": []
    },
    {
      "heading": "2.1 The Basics",
      "text": [
        "Formally speaking, an Lr f is a standard semantico-lexical relation which holds between a lexeme Li (the keyword of f ) and a set of lexemes f(L) (the value of f).",
        "Examples of aes are:",
        "= [to] let out (a cry) bleep: 'beginning' Incep(to sleep) = [to] fall asleep Fin: 'end' Fin(to sleep) = [to] wake up Cans: 'causation' Cans( to sleep) = [to] put to sleep Man& 'manifestation' Mnnif(happy) = [to] beam with joy Meretik distinguishes about sixty simple txs of the above kind.",
        "Siinple Les can further be combined with",
        "each other; the meaning of such complex Lt's is, as a rule, a combination of the meanings of the participating LL's. Thus, AntiMagn means 'slightly' (e.g., AntiMagn(injury) = minor); and IncepOperi 'start performing' (e.g., IncepOperi(dcbate) = [to] start (a debate)) .4 In text generation, the benefits front 1,/,'s are threefold: (i) they provide subclausal collocational constraints between the keywords and the values (cf. lordanskaja el al., 1991) as, e.g., between narrow and majority (with AntiMagn(inajorily) = narrow) in lion-dini won with a narrow majority; (ii) they provide in-terclausal cooccurrence links (cf. 'rutin and Kittredge, 1992) between the keywords and the values as, e.g., between spaghetti and pasta (with Geuer(spaghelli) pasta) in Let's lake spaghetti; pasta is not bad here; and (iii) they allow for explicit statements on the cooccur-rence between values of various IA's in related discourse segments, as, e.g., between the values of V0(sleep) = [to] sleep and Incep(s/ccp) = [to] sink into sleep in Hardly in bed, 'Tony sank into sleep and slept ail the night till the morning.",
        "In our work, we use (i) for single perspective realizations (cf. Wanner and Bateman, 1990); (ii) and (iii) serve for the representation of perspective sequences, i.e. reiteration and collocation relations in discourse.",
        "One such relation is given by all pairs Lit A 1,1.'2 ('/A' sequences') which show the same cooccurrence behavior (e.g., the sequences Opera A Open and Vo A V() show the same cooccurrence behavior; both stand for strict repetition).",
        "Consider Table I. LP sequences are directed, i.e. LP's A 1,F2 L1 3 A ^if several (simple or complex) 1,8s compose a phrase or a clause (as, e.g., AntiMagn and So compose minor injury), we separate these bus by a 'o' sight.",
        "For the theoretical background Mid further details of how bus Call be composed with each other, see the literature on Meaning nxt Theory; e.g., (Mel'Cuk and Polguere, 1987).",
        "Lit.",
        "Moreover, the existence of Lit A LI22 in a language does not mean that i,P2 A is also available.",
        "Therefore, in 1.1)' sequences, one argument is the 'hub' - - the point of departure (or the expanded LP') and the other argument is the `hub expander'.",
        "How a specific LP can be expanded, i.e. which LP sequences are possible, depends individually on this Lt.', and on which Lis are further available for the entity the Lis are applied to.",
        "Compare, e.g., the LP sequences that instantiate the negated antonymy reiteration for Vo(forgelling) ;1/1(1 the two, which instantiate the satin) relation for Vo(lie): Forgetting (the Vo clause is in all examples realized as / forgot; to abbreviate, we write instead):",
        "Apart, from the reiteration or collocation relation it stands for, an 1,F sequence is further characterized by its possible syntactic realizations and its functional content.",
        "2.2 Syntactic Realizations of IX Sequences As a rule, an LP' sequence is realizable by several different syntactic constructions.",
        "How these constructions can look like is predetermined by each ix sequence individually (and by the information to be communicated).",
        "For example, Open) A °per) (more precisely, strict repetition) is in general realizable only as a paratactic coniplex clause; cf. !rave a look al it; please have a look.",
        "lit contrast, for example, Open A Magn o So is realizable • - • when applied to, e.g., decision --- by all syntactic constructions possible, cf.: John made a decision; this decision teas important to him (paratactic complex clause); John made a decision, which was important to him (hypotactic complex clause); The decision, which Joint made, was important to hint (embedded clause); John made an important decision (simple clause); John's recently math; importanl decision (phrase).",
        "The relevance of syntactic variations for the realization of discourse structure relations is well known, cf., e.g., (Ifovy, 1993)."
      ]
    },
    {
      "heading": "2.3 Functional Content of LF Sequences",
      "text": [
        "Semantics, lexis, and syntax of Lr sequences do not provide sufficient criteria for the choice of one sequence over all other comparable ones.",
        "These criteria must be provided by the functional content we associate with each sequence (or reiteration and collocation relation, respectively).",
        "The functional content of the reiteration and collocation relations listed in Table 1 is presented in Table 2.5"
      ]
    },
    {
      "heading": "3 TOWARDS LEXICALLY BIASED DISCOURSE RELATIONS",
      "text": [
        "Due to their functional content, LE sequences serve as instantiations of individual discourse structure relations.",
        "In our work, we suggest that these individual discourse structure relations can be organized coherently in terms of the functions and semantic distinctions they represent.",
        "In accordance with the claim that the availability of specific 1,P sequences is dependent on the entities the LEa are applied to, we further suggest that this organization must be done individually for each predicative entity (cf. Wanner, 1994).",
        "Based on this, we define taxonomies (one for each predicative entity) which have been inspired by Ilalliday's proposal for grouping interclausal logico-semantic relations (cf. Halliday, 1985).",
        "How such an organization can be realized efficiently using inheritance techniques is described in (Wanner, 1992).",
        "Although our model is not restricted to interclausal relations, two features of Halliday's proposal are valuable to us: (i) that a logico-semantic relation 'expands' one wording by an another one rather than connecting two given wordings and (ii) that a logico-semantic relation can be further decomposed with respect to its: L. semantics, 2. syntactic realization, 3. communicative structure, and 4. with respect to the speaker's intention, which motivates the selection of this relation during the text production process.",
        "In what follows, we discuss first the general taxonomy of our 'expanding' discourse structure relations for processes and then the decomposition of the relations along these four dimensions.",
        "Following the conventions in RST, we call the expanded part 'nucleus' and the expanding one 'satellite'."
      ]
    },
    {
      "heading": "3.1 Taxonomy of Lexical Discourse Relations",
      "text": [
        "A taxonomy of lexical discourse structure relations is to be understood as a hierarchy of alternative choices of increasingly delicate relations.",
        "The most delicate relations are 1.r sequences represented by their functional content.",
        "The Lop level of the taxonomy represents, thus, the most global types of expansion.",
        "In accordance with (11alliday, 1985), these are ELABORATION, EXTENSION, and ENHANCEMENT.",
        "ELABORATION subsumes all those expansions which ensure a deeper understanding of the meaning communicated by the nucleus wording.",
        "A deeper understanding of the nucleus wording is ensured by restating, refining, or clarifying it (the next level of ELABORATION in the taxonomy).",
        "For example, all reiteration relations are of the ELABORATION type.",
        "The EXTENSION expansions extend the meaning communicated by the nucleus wording.",
        "This can be done by introducing a new constituent that is related to what has been said in the nucleus, by adding a new action of the known constituents, etc.",
        "Beginning extension is, e.g., an EXTENSION.",
        "The ENII A N CEMENT expansions qualify the Meaning communicated by the nucleus wording by adding a reference of causation, time, location, manner, mode, etc.",
        "AB example of ENHANCEMENT is causal enhancement.",
        "Figure 1 shows in more detail the ELABORATION fragment of the taxonomy in network form.",
        "According to this figure, RESTATEMENT can be realized as a contrastive, a generalized, or as a repeating restatement, respectively.",
        "As shown in Table 2, CONTRASTIVE RES'T'ATEMENT corresponds to the reiteration negated antonymy, GENERALIZING RESTATEMENT to superordination, respectively.",
        "REPEATING RESTATEMENT is further insisting, clarifying, illustrative, pictoresque, etc.",
        "(see again Table 2 for corresponding reiteration relations)."
      ]
    },
    {
      "heading": "3.2 Decomposition of Lexical Discourse Structure Relations",
      "text": [
        "As presented in Figure 1, the relations are still too global to be useful for lexical choice.",
        "Consider, e.g. ATTRIBUTION - – a subtype of the REFINEMENT relation; it allows for various decompositions with respect to all four dimensions mentioned above:",
        "• Semantics; thus, ATTRIBUTION can mean AT-TRinuTioN, e.g., of a process, of one of the participants of this process, or of one of the circumstances of this process; if ATTRIBUTION of a participant (let's say the ACTOR) is meant, it is still undetermined what kind of attribution this is (e.g., a one which enables the actor to engage in the process, a one which prevents him front engaging in this process, etc.).",
        "• Syntactic realization; how the various ATTILI-BUTIONs can be realized syntactically depends on the semantic and lexical properties of the information to he communicated, For example, Monica flew to Italy; it was a very pleasant journey is also realizable as a subordinated clause (Monica flew to Italy, which was very pleasant); as a sitn-pie clause (Monica had a very pleasant journey to Italy); and as a phrase (Monica 's pleasant journey to Italy).",
        "• Communicative structure; the cormnunicative structure of ATTRIBUTION varies depending on the order in which nucleus and satellite are realized.",
        "Cf., e.g.: Monica flew to Italy; it was a very pleasant journey vs.",
        "It was very pleasant, Monica's journey to Italy.",
        "• Speaker's intention; selecting the ATTRIBUTION relation the speaker is assunied to intend,",
        "e.g., a justification of what has been communicated in the nucleus as in John failed the exam; it was very difficult; a consequence of it.",
        "John has been shot ---- lie ist dead, etc.",
        "The increasingly delicate specifications achieved by decomposition are also represented hierarchically in network fortn; one network for each dimension."
      ]
    },
    {
      "heading": "4 GETTING THE RELATIONS AC-CROSS",
      "text": [
        "The lexical choice process, which makes use of the discussed discourse structure relation taxonomies, and the representation of lexical resources arc described in detail in (Wanner, 1992, 1994).",
        "Here we focus on the interface between the first level text planning and Lhe lexical choice module; and on the output as produced by the lexical choice module.",
        "The computational framework in which our model has partially been implemented, is the systemic text, generator komrr (Bateman el al., 1991).",
        "One source of constraints for the first.",
        "level text organization comes ill komrr from an asT-based planner.' The output of this planner is a collection of case frames with asT relations holding between them as shown in Figure 2.",
        "Starting from 11 a text plan of this kind, the lexical choice module traverses a multilayered collection of networks (one of these layers is given by a taxonomy of lexical discourse structure relations discussed).",
        "During the traversal, the text plan is transformed into a"
      ]
    },
    {
      "heading": "lexicalized Partial Grammatical Structure (Pas);7",
      "text": [
        "is called 'partial' because it contains precisely that amount of grammatical information which is necessary",
        "for lexical choice.",
        "The PGS is passed to the grammar (a systemic grammar of German; cf. Teich, 1992) for final syntactic realization.",
        "Figure 3 shows a sample PGS encoded as a Typed Features Structure (cf. Bateman el al., 1992).",
        "The first and the most important task in tailoring the text plan to linguistic resources is to find a lexically biased discourse structure relation for the ftsT relation specified in the text plan.",
        "The search is done in accordance with the functional content, the intention of the speaker, and the contents of the arguments of the ItsT relation.",
        "If the RST relation connects unrelated case frames8 (as, e.g., EVIDENCE in In winter, the days are short.",
        "It is getting light late and early dark.)",
        "these case frames are realized independently without being connected by a lexical discourse structure relation.",
        "If the case frames are related, the following three variations are possible:",
        "(i) An RST relation instantiation coincides with a lexical discourse structure relation; as, e.g., the instantiation of RESTATEMENT in the following rudimentary text plan coincides with our RESTATEMENT:",
        "If so, the subclassifictafointuoatiffnexical discourse structure relation determines its final realization.",
        "For example, the above text plan could be realized as a GENERALIZED RESTATEMENT: Sveta flii.sterte; sic sagte etwas ganz leise lit.",
        "`Sveta whispered; she said something very quietly'; an INTENSIFYING RESTATE-mENT: Sveta sagte etwas sehr leise; sie hauchte es kaum horbar Inn lit.",
        "`Sveta said something very quietly; she breathed it hardly audible', etc.",
        "(ii) An RST relation instantiation subsumes several dis8 Case frames are considered to be unrelated if between them or one of their roles no identity, is-a, causer, location, etc.",
        "relation holds.",
        "tinct classes of lexical discourse structure relations; as, e.g., the instantiation of the itsT relation CONTRAST in (this plan is also highly simplified):",
        "In this case, the taxonomy of lexical discourse structure relations is entered at a relatively general level (in the worst case at 'roe).",
        "(iii) An RST relation is not captured by our taxonomy (as, e.g., CONCESSION).",
        "Then, the corresponding case frames are treated as unrelated (see above)."
      ]
    },
    {
      "heading": "5 RELATED WORK",
      "text": [
        "Our proposal for the description of lexically biased discourse structure relations resembles Danlos' work (Danlos, 1987), who presented acceptable clause pattern sequences explicitly in a Discourse Grammar.",
        "The basic difference between Danlos' work and ours is that in the Discourse Grammar, clause pattern sequences arc represented as concrete valency schemata while in our model they are represented as functional distinctions that encode sequences of TF.s.",
        "Asa result, we do not face the problem of being restricted to a concrete small domain as Danlos does.",
        "Meteor's text planner (Meteer, 1992) is another proposal for the realization of lexically biased discourse structure relations.",
        "But while we argue that, lexically biased discourse structure relations are to be realized by a functionally motivated lexical choice model, Meteor sugggests a single structurally motivated model for text, planning, which also subsumes lexical choice.",
        "This is different from, e.g., (Rubi-nolt, 1992), who ensures the expressibility of discourse structure relations provided by a conventional text planner by annotating linguistic structures.",
        "Elhadad's proposal (Elhadad, 1992) to use Topoi (inference rules that encode relations between propositions incorporating lexical material) as discourse structure relations is aimed at exploiting lexical phenomena for discourse organization.",
        "Elhadad focuses, however, on the 'argumentative potential' of lexical items rather than on lexically biased discourse structure relations."
      ]
    },
    {
      "heading": "6 CONCLUSIONS AND FUTURE WORK",
      "text": [
        "In this paper, we argued that it, is useful to distinguish between two levels of discourse organization: a. global discourse organization, which is not affected by linguistic means; and a finer discourse organization, which is built up in accordance with the linguistic material that is available for the meaning communicated.",
        "We have shown that reiteration and collocation relations may function as discourse structure relations and that these relations are well represented by Lexical Function sequences.",
        "We presented a taxonomy of lexically biased discourse structure relations, which is related to Halliday's proposal for grouping interclausal logico-semantic relations and suggested to use this taxonomy in a lexical choice module.",
        "One of the open problems we face is how sufficiently detailed contextual constraints can be acquired in order to guide the choice of one discourse structure relation over others.",
        "This will certainly he one of the topics we will have to address in the future."
      ]
    },
    {
      "heading": "ACKNOWLEDGEMENTS",
      "text": [
        "',Phis work has been carried out while the author was affiliated with the Integrated Publication and Information Systems institute of the GRAD, Darmstadt..",
        "Many thanks are due to John Bateman, Lidija fordanskaja, and Igor Mel''C'uk for valuable comments on an earlier draft of this paper."
      ]
    },
    {
      "heading": "References",
      "text": []
    },
    {
      "heading": "Parsing",
      "text": []
    }
  ]
}
