{
  "info": {
    "authors": [
      "Ilussein Allmuallim",
      "Yasuhiro Akiba",
      "Takefumi Yamazaki",
      "Akio Yokoo",
      "Shigeo Kaneda"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-1006",
    "title": "Two Methods for Learning ALT-J/E Translation Rules from Examples and a Semantic Hierarchy",
    "url": "https://aclweb.org/anthology/C94-1006",
    "year": 1994
  },
  "references": [
    "acl-C92-2088"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper presents our work towards the automatic acquisition of translation rules from Japanese-English translation examples for NTT's ALT-J/E machine translation system.",
        "We apply two machine learning algorithms: Haussler's algorithm for learning internal disjunctive concept and Quinlan's ID3 algorithm.",
        "Experimental results show that our approach yields rules that are highly accurate compared to the manually created rules."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "A critical issue in AI research is to overcome the knowledge acquisition bottleneck in knowledge-based systems.",
        "As a knowledge base is expanded, adding more knowledge and fixing previous erroneous knowledge become increasingly costly.",
        "Moreover, maintaining the integrity of large knowledge bases has proven to be a very challenging task.",
        "A widely proposed approach to deal with the knowledge acquisition bottleneck is to employ some learning mechanism to extract the desired knowledge automatically or semi-automatically front actual cases or examples [Buchanan & Wilkins 1993].",
        "The validity of this approach is becoming mow evident as various machine-learning-based knowledge acquisition tools for real-world domains are being reported [Kim MoIdovan 1993, Porter et al. 1990, Sato 1991a, Sato 1991b, Utsuro et al. 1992, Wilkins 1990].",
        "ALT-J/E, which is an experimental Japanese-English translation system developed at Nippon Telegraph and Telephone Corporation (NIT), is one example of a large knowledge-based system in which solutions to the knowledge acquisition bottleneck are definitely needed.",
        "One major component of this system is its huge collection of trans/Wiwi rules.",
        "Each of these rules associates a Japanese sentence pattern with an appropriate English pattern.",
        "To translate a Japanese sentence into English, ALT-J/E looks for the rule whose .1 apanese pattern matches the sentence hest, and then uses the English pattern of that rule for translation.",
        "So far, A1.1.",
        "'-.1/E translation rules have been composed manually by extensively trained Imman experts.",
        "To qualify for this job, an expert must not only master both English and Japanese, but also be very familiar with various components of the system.",
        "Each time the rules are expanded or altered, the new set of rules must then be \"debugged\" using a collection of test cases.",
        "Usually, several iterations are needed to arrive at translation rules of acceptable quality.",
        "Creating new translatioit rules as well as refining existing ones have proven to be extremely difficult and time-consuming because these tasks require considering a huge space of possible combinations (rules in ALT-J/E are expressed in terms of as much as 3000 \"semantic categories\").",
        "The high costs involved make the mtunod creation of A U.r-J /E's translation rules impractical.",
        "Indeed, in spite of the vast amount of resources spent on building the current, rules of AIL'-.f/l':, faults in these rules are still detected front time to time, making system maintenance a continuous requirement,.",
        "The nuu of this work is to make A LT-J/E's translation rules less costly and more reliable through the use of inductive machine learning techniques.",
        "Careful examination of the manual process which has been followed so far by A ;1'-.1 / Ens experts for building translation rules reveals that most, of the effort is spent on figuring out the condition part of the rules (that is, the .Japanese patterns).",
        "Therefore, we propose the use of inductive machine learning algorithms to learn these conditions from examples of Japanese sentences and their English translations.",
        "Under this machine learning approach, the user is relieved from exploring the huge space of alternatives she/he has to consider when constructing translation rules manually from scratch a job which only extensively trained experts can performi>.",
        "The task is now turned into a search for sonic reasonable rules that explain the given training examples, whin:e the search is haudled automatically by a learning algorithm.",
        "This not only",
        "saves the user's time, but also makes it unnecessary for the user to be an expert of the ALT-JOE system.",
        "Moreover, this approach significantly reduces the \"subjectivity\" of the rules since the intervention of human experts is minimized.",
        "This is particularly important because the immense number of translation rules (currently over 10,000) requires employing a team of experts over an extended period of time.",
        "Two learning methods are investigated in this paper.",
        "Experiments show that the rules learned by these methods are very close to the rules manually composed by human experts.",
        "In most cases, given a reasonable number of training examples, the employed methods are able to find rules that are more than 90% accurate when compared to the manually composed rides.",
        "The rest of this document is organized as follows.",
        "We begin in Section 2 by a brief overview of the ALT-J/E Japanese-English translation system.",
        "In Section 3, we discuss some of the problems that arise when the translation rules of ALT-JOE are composed manually by human experts.",
        "Then, we propose in Section 4 an alternative approach based on machine learning techniques.",
        "In Section 5, we describe the inductive learning methods used, followed by an experimental evaluation of these methods in Section 6.",
        "Finally, conclusion remarks are stated in Section 7."
      ]
    },
    {
      "heading": "2 ALT-J/E: A Brief Overview",
      "text": [
        "ALT-J/E, the Automatic Language Translator: Japanese to English, is one of the most advanced and well-recognized systems for translating Japanese to English.",
        "It is the largest such system in terms of the amount of knowledge it comprises.",
        "In this work, we are concerned with the following components of the ALT-J/E system:",
        "1.",
        "The Semantic Hierarchy, 2.",
        "The Semantic Dictionary, and 3.",
        "The 'Translation Rules.",
        "We briefly describe each of these components below.",
        "For more details about the AIX-J/11; system, we refer the reader to [Ikehara et al. 1989, Ikehara et al. 1990, Ikehara et al. 1991].",
        "As shown in Figure 1, the Semantic Hierarchy is a sort of concept thesaurus represented as a tree structure in which each node is called a semantic category, or a category for simplicity.",
        "Edges in this structure represent \"is-a\" relations among the categories.",
        "For example, \"Agents\" and \"Pe<iple\" (see Figure 1) are both categories.",
        "The edge between these two categories indicates that any instance of \"Peoide\" is also an instance of \"Agents\".",
        "Tflie current version of ALT-J/E's Semantic Hierarchy is 12 levels deep and has about 3000 nodes.",
        "The Semantic Dictionary maps each Japanese noun to its appropriate semantic categories.",
        "For example, the Semantic Dictionary states that Hie 11011I1 l a(niwatori), which mealis \"chicken\" or \"lien\" in English, is mul instance of the categories \"Meat\" and \"Birds\".",
        "The 'Translation Rules in ACT-.1/E associate Japanese pat terns with English patterns.",
        "Currently, ALT-J/E uses roughly 10,000 of these rules.'",
        "As Figure 2 shows, each translation rule has it Japanese pattern as its left-hand side and all English pattern as its right-hand side.",
        "For example, the first rule in this figure basically says that if the Japanese verb in a sentence is < (yaku), its subject is an instance of \"People\", and its object is an instance of \"Bread\" or \"Cake\", then the following English pattern is to be used:"
      ]
    },
    {
      "heading": "Subject \"bake\" Object.",
      "text": [
        "Note that in this case the Japanese verb IA < (yaku) is translated into the English verb \"bake\".",
        "This same Japanese verb (70.11 also be translated into the English verbs \"roast\", \"broil\", \"cremate\" or \"burn\", depending oil the context.",
        "These cases are handled by the four other rules given in Figure 2.",
        "Translation rules are meant only to handle basic sentences that contain just a single Japanese verb.",
        "Such sentences are called \"simple sentences\" 2 translate a complex sentence, ACT-.1/E does various kinds of pre and post-processing.",
        "Roughly speaking, the given complex sentence is first broken into a collection of simple sentences in the preprocessing phase.",
        "Then, the English translations of these are combined together in the post-processing phase to give the final translation of the complex sentence.",
        "To translate a simple sentence, ALT-.1/E looks for the most appropriate translation rule to use.",
        "Based on the verb of the sentence, the system considers as candidates all those translation rules that have this verb on their left-hand side.",
        "The English pattern of the rule whose Japanese pattern matches the sentence best is then used to generate the desired English translation.",
        "As shown in Figure 2, the Japanese patterns are expressed using the variables N1 , N2, • • • , etc., which represent various components of a Japanese sentence, such as the subject, the object, etc.",
        "The \"degree of matching\" between iL .ligcanese pattern and iL sentence is based on how well the values of these variables for the given sentence match those categories required by the Japanese pattern.",
        "The Semantic Dictionary",
        "is used during the matching process to determine whether or not a given noun is an instance of a certain category."
      ]
    },
    {
      "heading": "3 Shortcomings of the Manual Approach",
      "text": [
        "Translation rules in the ALT-.1/E system have so far been composed manually by human experts.",
        "However, due to the high cost-per-rule, uunl because of the huge number of translation rules needed for ALT-J/E, to carry out a reasonable translation job, the manual approach has been concluded by the developers of ALT-J/E to be unpractical.",
        "In particular, the following problems have been reported:",
        "• Building and maintaining the translation rules require a great deal of expertise.",
        "To qualify for this task, skillful experts are required not only to master both Japanese and English, but also to be fully familiar with AluT-J/E's large SelaalliiC Hierarchy and to understand the overall process of the system.",
        "Such qualifications are costly and involve extensive training.",
        "• In spite of tire vast amount of resources spent on building the current rules of ALT-J/E by human experts, faults are still detected from time to time, making the maintenance of the system a contiimmts requirement.",
        "• Tire translation rules are not quite coneretc and vary depending on the expert.",
        "Rules constructed by one expert are not easy for another expert to understand and modify.",
        "'['iris makes the maintenance process more difficult and makes it hard to substitute an expert by another.",
        "• An important objective is to build specialized versions of ALT-JAL to be used in specific application domains.",
        "The manual approach is obviously unrealistic since it involves more training of the 1/11Man experts with respect to the target application dmain, and Item/Ise this process has to be repeated for every new domain.",
        "• One of the problems facing tire designers of ALT.1/E is the refinement of the Semantic Hierarchy.",
        "Whenever this structure is altered, the translation rules must also be revised to reflect the change.",
        "Such revision is extremely troublesome and error-prone if it is done manually."
      ]
    },
    {
      "heading": "4 A. Machine Learning Approach",
      "text": [
        "The problems we have just listed regarding the manual construction of ALT-J/E's translation rules are largely solved if the process can be autAntuttctd.",
        "An attractive approach to this problem is ,to resort to inductive machine learning techniques to extract the desired translation rules from examples of Japanese sentences and their English translations.",
        "At the current stage, however, learning translation miles fully automatically from examples alone seems to be too challenging.",
        "A more realistic goal is to minimize• rather than to totally eliminate -- the intervention of human experts in the rule aquisition process.",
        "Thus, our current objective is to concentrate on automating tire most difficult and time-consuming parts of the inamud procedure.",
        "The goal of the present work is to learn what we call \"partial translation rules\".",
        "A partial translation ride consists of the left-hand side along with the English verb of the right-hand side of a translation rule.",
        "In other words, the only difference between a translation rule and a partial translation rule is that the latter has only an English verb rather than a full English pattern as its right-hand side.",
        "Constructing a partial translation rule is the most difficult part of constructing a translation ride.",
        "Indeed, turning a partial rule into a complete one is a relatively easy task that can be done by a human operator with moderate knowledge of English and Japanese."
      ]
    },
    {
      "heading": "5 Learning Task and Methods",
      "text": [
        "In this work, we investigate two different inductive learning algorithms.",
        "Before talking about these algorithms, we will first make tire learning task more precise and sired some light on tire difficulties that distinguish it from other previously studied learning tasks."
      ]
    },
    {
      "heading": "5.1 The Learning Task",
      "text": [
        "The job of a learning algorithm in our setting is to construct partial translation rules.",
        "For a given Japalletie verb .1-verb and a possible English translation E-verb; of that verb, the algorithm has to find the appropriate condition(s) that should hold in tire context in order to map 1-verb to E-verb;.",
        "As an example, consider the Japanese verb (ml!')",
        "(ltsukan).",
        "This verb corresponds to the English verbs \"use\", \"spend\" anal \"employ\".",
        "The choice among these English verbs depends mostly on the oltject of the sentence.",
        "For example, if the object is an hi-StaTICC of \"Asset\" or \"Time\", then \"spend\" is appropriate.",
        "Thus, a rough rule for mapping ftt (tsukau) to \"spend\" may look like and LOBJECI i704(171Ce Of 'I i1/1,- or Asset I THEN I•:-VEIta spend.",
        "\\Ve seek to learn this kind of rules from examples of .1 apalletie sentences and their English translations, such as the following pair:",
        "( The princess spends money ).",
        "After parsing (which is carried out by AlX-.1/E's parser), the above example gives the following /min",
        "By looking up the Semantic Dictionary of AUE.I/E, the possible semantic categories for oujyo are \"Noble Person\", \"Daughter\" and \"Ventale\", and those for kane are \"Asset\", \"Metal\", \"Day\" and \"Nledal\".",
        "Thus, this example is finally given to the leat•ning algorithm in the following form:",
        "where N E S indicates that the sentence component N is an instance of each category s L S. The general format of the training examples is as follows:",
        "where each Ai; represents a component of the sentence (subject, object, etc.",
        "), and each and c, is a semantic category.",
        "From the viewpoint of machine learning research, the above learning task is interesting/challenging from two perspectives:",
        "• Huge amount of background knowledge: To' be appropriate for our learning task, the learning algorithm must effectively utilize ALT-j/E's large Semantic Hierarchy.",
        "'This requirement of being capable of exploiting such a huge amount of background knowledge disqualifies most of the known inductive learning algorithms from directly being, used in our domain.",
        "• Ambiguity of the training examples: Unlike most known learning domains, the training examples in ow.",
        "setting (as given in Eq.",
        "(l)) are ambiguous in the sense that each of the variables (Sull.fttur, Ott.n.tur, etc.)",
        "is assigned multiple values rather than a single value.",
        "Focusing on the relevant values (that is, the values that contributed to the choice of the English verb) is an extra challenge to the learner in our domain.",
        "To deal with the above learifing problem, we investigated two approaches.",
        "One is based on a theoretical algorithm introduced by 1 laussler for learning internal disjunctive concepts, and the other MI the well-known 11)3 algorithm of Quinlan.",
        "5.2 Haussler's algorithm for learning internal disjunctive expressions hi our first approach, we represent the conditions of the learned partial translation rules as 'atter/Jul (Lis-junctivc cnircssions, and employ an algorithin given by Ilaussler for learning concepts exprksed in this syntax.",
        "I laussler's alp.tritlun enjoys many advantages.",
        "First, it has been analytically proven to be quite efficient both in terms of time and the number of examples needed for learning.",
        "Second, the algorithm is capable of explicitly utilizing the background knowledge represented by the Semantic Hierarchy.",
        "Moreover, the language used by human experts to construct AIT-.1/E's rules is quite similar to internal disjunctive expressions, suggesting the appropriateness of this algoeithin's bias.",
        "I laussler's algorithm, on the other hand, suffers the important.",
        "shortcoming (within our setting) that.",
        "it is not, capable of learning from ambiguous examples.",
        "In order to be able to use the algorithm for our task, the ambiguity has to he explicitly removed from ;d1 the training examples.",
        "Of course, this approach is not desirable because it, requires 501110 intervention by a human expert ;Ind because there are no guarantees that disambiguation is done in a perfect manner."
      ]
    },
    {
      "heading": "5.3 Quinlan's ID3",
      "text": [
        "Our second approach is based on the 11)3 algorithm) introduced by Quinlan in [Quinlan 1986].",
        "As it is, 11)3 is not, able to utilize the background knowledge of our domain, nor is it capable of dealing with tunbigu-ous training examples of the form given by Eq.",
        "(1).",
        "It is clearly inappropriate to treat NI, N2 • • • as multivalued variables, which is the most COT/41MM way of using [1)3.",
        "This is because of the huge munber of values these variables can take, and al50 because we need to exploit the background knowledge represented by the Semantichierarchy.",
        "To be able to use 11)3 in our domain, we transform the training examples into a new representation that cut be handled by 11)3.",
        "The transformation we propose is (lone in a way such that the relevant, information from the the Semantic 1 lierarchy are included in the newly represented examples, and, at the same time, these newly represented examples still reflect, the anibiguily present in the original examples.",
        "Our transformation method is described as follows: Let.",
        ".1 he die set, of all the categories that, appeared in the training examples, and their ancestors.",
        "1.",
        "'or every we define a binary feature tut; a test of the form Is /V, an instance of c?",
        "Vor a training example Si, • • • A'• • • N,, S„], Vol)), we let, the outcome of the above test be truc if and only if there exists some s e Si such that a is an ancestor of c in the ..3einanti• Hierarchy, or c itself.",
        "Using these features, we convert each of the training examples into a new pair (V, P Vcrb ) where V is a vector of hits each representing the outcome of the corresponding feature for the given training example.",
        "Given the above definition of the binary features, the new pairs (V, E-Verb ) include all the necessary background knowledge obtained form the Semantic Hierarchy, and also reflect the ambiguity of the original training examples.",
        "In other words, the above transformation can be seen as \"compiling\" the information of the original ambiguous training examples along with the necessary parts of the Semantic Hierarchy into a format that is ready to be processed by ID3 (or in fact, by many other feature-based learning algorithms).",
        "Note that if we create a feature for every semantic category e and every sentence component then the total number of features will become infeasibly large (many thousands).",
        "However, what we need is only to consider those categories that appeared in the training data, and their ancestors (the set A above).",
        "In our experiments, this results in a reasonable number of features (one to two hundred).",
        "This is because the number of examples is limited and also because of the rather \"tilted\" distribution of what categories can naturally appear as a certain component of a sentence for a given verb.",
        "(Eg.",
        "the object of the verb j( ts (nous), which roughly means to \"drink\", can not be just anything!)",
        "The roost important advantage of the above approach is that it can be applied to ambiguous training examples as they are, without the need to remove the ambiguity explicitly as we did with Hatissler's algorithm.",
        "Another advantage of using 1D3 is that we do not need to break our learning task into binary class learning problems since 1113 is capable of learning multi-class learning concepts."
      ]
    },
    {
      "heading": "6 Experimental Work",
      "text": [
        "The goal of the experiments reported here is to evaluate the quality of the partial translation rules learned by the two learning methods we have just described.",
        "The comparison includes the following three settings:",
        "1.",
        "Using Ilaussler's algorithm to learn from training examples after removing the ambiguity.",
        "2.",
        "Using ID3 to learn from training examples after removing the ambiguity and performing the transformation given in the Subsection 5.3.",
        "3.",
        "Using ID3 to learn from training examples after performing the transformation given in the Subsection 5.3, but Nvithout removing the ambiguity.",
        "In a sense, the first setting represents the best we can do in the absence of the ambiguity since Haussler's algorithm does a good job in exploiting the background knowledge from the Semantic Hierarchy.",
        "Comparing Setting 2 with Setting 1 tells us how successful our transformation of the training examples is in letting 11)3 snake use of the available background knowledge.",
        "Finally, comparing Setting 3 with Setting 2 tells us how successful our transformation is in letting 11)3 learn directly from ambiguous training examples.",
        "The experiments were done for six different Japanese verbs.",
        "Table 1 shows a list of these verbs, along with the number of training examples used, and the accuracy levels obtained by each method.",
        "In the table, \"1 laussler\", \"ID3--NA\" and \"11)3 A\" denote Setting 1, Setting 2 and Setting 3, respectively.",
        "The accuracy was estimated using the leave-one-out cross-validation method'', and assuming that the rules composed manually by human experts are perfect (that is, we are measuring how close the learned rules are to those composed manually).",
        "The performance levels of both llaussler's algorithm and 11)3 when learning from unambiguous examples are quite similar in spite of the fact that each algorithm implements a different bias and has a completely different way of exploiting the background knowledge.",
        "Comparing the performance of I113 in the two cases of learning from ambiguous and umun-biguous examples, ambiguity is not harmful to 11)3's performance in most cases.",
        "In fact, for some of the verbs, the performance is even better when ambiguity is present.",
        "This suggests that the approach we have chosen to deal with ambiguity is effective for our task, and that explicit removal of ambiguity is not an attractive strategy since it is not easy to do, and since it does riot greatly improve the accuracy anyway.",
        "The inmost important point here is that the observed accuracy of both the 1113 algorithm and Ilaussler's algorithm is satisfactorily high overall in spite of the limited mimber of the training examples used.",
        "Such a high level of accuracy strongly indicates that the use of these algoritInns will provide significant aid in the construction of ALT-J/E's translation rules."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "This paper reported our work towards the acquisition of Japanese-English translation rules through the use of inductive machine learning techniques.",
        "Two approaches were investigated.",
        "Time first approach is based on a theoretically-founded algorithm given by Il:nissler for learning internal disjunctive concepts.",
        "This algorithm has the advantage that it is tailored to utilize background knowledge of the kind available in our domain.",
        "We found, however, no obvious way to make this algorithm learn directly from ambiguous training examples, and thus, ambiguity was explicitly removed from tire training examples in order to use this algorithm.",
        "()in' second approach is based on the 11)3 algorithm.",
        "As it is, I1)3 is not able to utilize the background knowledge of our domain, nor is it capable of dealing with ambiguous training exam",
        "plan.",
        "We gave, however, ail easy way to \"c:0111pile\" the relevant background knowledge along with the ambiguous training examples into a modified set of training examples on wind we were able to directly run 11)3.",
        "Experiments comparing these approaches showed that the rules learned using the sect aid ap-p•oach with the ambiguity present it, the training examples are almost as accurate as those obtained frcan ambiguity-free examples using llaussler's algorithm.",
        "Overall, our experiments showed that using machine learning techniques yields rules that are highly accurate compared to the manually created rules.",
        "These results suggest that exploiting the reported inductive learning techniques will significantly accelerate the construction process of ALT-1/E's translati(o, rules.",
        "Currently, the reported learning approaches are being included in a semi-automatic knowledge acquisition tool to be used in the actual development of the ALT-J/E system.",
        "Acknowledgement: We wish to thank Dr. S. Ikehara for his continuous enconragement.",
        "This work was dome while the first author was spending a postdoctoral year at NTT.",
        "lie also thanks King Valid Un-versity of Petroleum and Minerals, Saudi Arabia, for their support."
      ]
    }
  ]
}
