{
  "info": {
    "authors": [
      "Steven Bird"
    ],
    "book": "Computational Linguistics",
    "id": "acl-J94-3000",
    "title": "Introduction to the Special Issue on Computational Phonology",
    "url": "https://aclweb.org/anthology/J94-3000",
    "year": 1994
  },
  "references": [
    "acl-C88-1023",
    "acl-C90-3003",
    "acl-C90-3014",
    "acl-C90-3050",
    "acl-C92-3128",
    "acl-E87-1002",
    "acl-E91-1016",
    "acl-E91-1023",
    "acl-J92-1003",
    "acl-J94-1003",
    "acl-P84-1038",
    "acl-P84-1070",
    "acl-P90-1030",
    "acl-W94-0201"
  ],
  "sections": [
    {
      "heading": "CL",
      "text": [
        "Published Quarterly by the MIT Press for the Association for Computational Linguistics",
        "Copyright ©1994 by the Association for Computational Linguistics.",
        "Permission to photocopy articles for internal or personal use, or the internal or personal use of specific clients, is granted by the copyright owner for users registered with the Copyright Clearance Center (CCC) Transactional Reporting Service, provided that the fee of $3.00 per article-copy is paid directly to CCC, 222 Rosewood Drive, Danvers, MA 01923.",
        "The fee code for users of the Transactional Reporting Service is 0891-2017/94 $3.00.",
        "For those organizations that have been granted a photocopy license with CCC, a separate system of payment has been arranged.",
        "Such permission requests and other permission inquiries should be addressed to the Managing Editor at the address given on the inside front cover of this issue.",
        "Volume 14 and subsequent volumes of Computational Linguistics are available on microfilm through University Microfilms International, 300 North Zeeb Road, Ann Arbor, MI 48106, USA.",
        "Send advertising and mailing list inquiries to Marketing Manager, MIT Press Journals, 55 Hayward Street, Cambridge, MA 02142; (617) 253-2866; e-mail: journals-info@mit.edu.",
        "Individual Subscriptions to Computational Linguistics are available only with membership in the Association for Computational Linguistics (ACL).",
        "Annual Membership Dues are as follows: regular, $40.00; student – taking a full-time program of courses and not earning a regular income, $25.00; retired, $25.00; joint – for couples receiving one subscription, $50.00.",
        "A membership application together with an order form for back issues and conference proceedings is included at the end of this issue.",
        "Send membership applications and address changes to Betty Walker (ACL), Bellcore, 445 South Street, MRE 2A379, Morristown, NJ 07960, USA; acl@bellcore.com.",
        "However, note that it is also possible to pay by credit card (both by email and by postal mail) and through banks in Switzerland and Japan.",
        "Institutional Subscriptions are $84.00.",
        "Outside the U.S. add $14.00 postage handling.",
        "Canadian subscribers also add 7% GST.",
        "Single copies of current and back issues are $22.00.",
        "Outside U.S. add $5.00 per issue for postage and handling.",
        "Canadians add additional 7% GST.",
        "Send institutional subscription orders and address changes to MIT Press Journals, 55 Hayward Street, Cambridge, MA 02142; (617) 253-2889; e-mail: journals-orders@mit.edu.",
        "To be honored free of charge, claims for missing copies must be made immediately upon receipt of the next published issue.",
        "Prices subject to change without notice.",
        "Institutions should order back issues before 1988 and all proceedings from the ACL at the address above."
      ]
    },
    {
      "heading": "Introduction to Computational Phonology",
      "text": []
    },
    {
      "heading": "1. Overview",
      "text": [
        "Despite being the oldest discipline in linguistics, phonology remains largely unexplored from a computational standpoint.",
        "While phonology gave us such innovations as the 'distinctive feature,' now heavily used in computational linguistics, phonology itself has yet to reap the benefits of the formal and technological developments it gave rise to.",
        "Recently, however, computational phonology has been rapidly gaining recognition as an independent area of inquiry within computational linguistics.",
        "The ACL Special Interest Group in Computational Phonology (SIGPHON) was formed in 1991 and has served as a focus for ongoing work in the area.",
        "In June of that year I proposed that there be a special issue of Computational Linguistics dedicated to computational phonology, since there were many good-quality papers in circulation that had no obvious venue for publication.",
        "The resulting collection, which you have before you, is a representative sample of this work; some submissions not ready in time for this volume will appear in subsequent regular issues.",
        "Other work in this area is to be found in the Proceedings of the First Meeting of the ACL Special Interest Group in Computational Phonology, published by the ACL in 1994, and in two edited collections (Bird 1991; Ellison and Scobbie 1993).",
        "The purpose of this short piece is to introduce computational phonology and the special issue.",
        "I shall begin by presenting some background to the field, followed by a survey of the research themes currently under investigation.",
        "Next, an overview of the papers in this collection is given, concluding with an explanation of the one-page commentaries that follow each paper.",
        "So, what is phonology, and why should computational linguists care about it?"
      ]
    },
    {
      "heading": "2. Background",
      "text": [
        "Phonology is the study of the systems of sounds that are manifested by natural languages, the significant contrasts between sounds that are relevant to meaning.",
        "As such, phonology stands at the interface between grammar, broadly construed, and speech.",
        "Much of the richness and complexity of phonology derives from the place it occupies between categorical symbolic systems and parametric physical behavior.",
        "Several excellent textbooks are available for readers who wish to learn more about phonology.",
        "Now, why should computational linguists care about phonology?",
        "First, phonology is an equally valid area of study for a computational linguist as syntax or semantics.",
        "Solutions in one area may generalize to other areas, as we see, for example, where strings of segments are parsed using the same machinery that is used for syntactic",
        "parsing (e.g. chart parsing [Church 1987]), or where a formal system developed for semantic representations of tense is applied to the temporal structure of phonology (Bird and Klein 1990), or where complex arrangements of phonological features are represented in the familiar notation of attribute-value matrices (Wiese 1990).",
        "Thus, phonology provides a fresh source of applications for the techniques and technologies of computational linguistics.",
        "However, this only demonstrates a flow of information from computational linguistics to phonology.",
        "Can we hope for payoffs in the other direction resulting from a wholesale integration of phonology into computational linguistics?",
        "It is instructive to consider The Sound Pattern of English (Chomsky and Halle 1968) in this regard.",
        "Although it was intended as a contribution to phonological theory, SPE was also directly implementable on computer (e.g. Bobrow and Fraser's 'phonological rule tester,' [1968]), and it was an important foundation for work in speech technology (e.g. Allen, Hunni-cutt, and Klatt 1987).",
        "Via the work of Johnson (1972), Koskenniemi (1984), and Kaplan and Kay – the latter in circulation since the early eighties but appearing in published form for the first time in the present collection – one could reasonably argue that SPE gave rise to finite-state morphology (Antworth 1990; Ritchie et al.",
        "1992; Sproat 1992).",
        "The formal framework of SPE was a good deal more explicit and rigorous than most of what came after, and so the prospects for a repeat performance coming from phonology have never been particularly bright.",
        "However, I feel it is now time for computational linguists to take another look at phonology.",
        "A quarter of a century has gone by since SPE, and there is much of interest to be found in the pages of Phonology and similar publications.",
        "A good place to start is the literature on computational phonology itself, since it interprets the theoretical proposals of phonology in a way that is more accessible to computational linguists.",
        "The stakes are high, since it would not be surprising if phonology is still to play an important role in bridging natural language technology and speech technology.",
        "For even though there is a methodological and sociological divide, there remains an imperative to develop fully integrated language and speech systems and an enduring need for fresh sources of creative ideas to relate the discrete to the continuous.",
        "Undoubtedly, there will always remain sceptics who think that natural language systems that deal just with the written word can afford to ignore phonology.",
        "In a limited sense they are correct.",
        "However, in the longer term, I am convinced that the interest in multilingual and multimodal systems will require a more enlightened view of phonology.",
        "Many languages have genuinely phonological phenomena evident in the orthography, such as Finnish (Koskenniemi 1984).",
        "Even in English we find cases where a spelling rule needs to be sensitive to phonological information.",
        "For example, the orthographic rule that selects a vs. an breaks down when a following word begins with a written vowel but a spoken consonant or vice versa, as in a uranium compound and an ytterbium compound.",
        "Although it largely works for English and a handful of other languages, the assumption that phonology can be ignored by natural language systems will collapse for many of the world's languages (e.g. Finnish, Turkish, and Arabic).",
        "One reason why computational phonology has not had a high profile is that work in this area has often been dealt with under the heading of computational morphology.",
        "However, much of what passes as finite-state morphology is actually morphophonol-ogy – the phonological factors that influence the appearance of morphemes – or even phonology proper.",
        "Moreover, the central computational device in finite-state morphology, the finite-state transducer, is not used for specifying the distribution of morphemes (i.e. morphotactics), the other main task of morphology.",
        "Therefore, that part of finite-state morphology that is expressed in terms of finite-state transducers, namely moriv Steven Bird Introduction to Computational Phonology phophonology and phonology, is largely coextensive with the domain of SPE.",
        "Perhaps the appearance of Kaplan and Kay's paper in this collection is symbolic of the recognition that there is a close interplay between computational morphology and phonology.",
        "A second reason that attention to phonology is warranted is that much of phonology is actually not subsumed by computational morphology and speech technology.",
        "In general, work in these two fields has focused on SPE-style phonology alone and has not, by and large, connected with current phonological theory or addressed purely phonological concerns.",
        "Again, computational phonology should provide usable implementations of more recent models so that they can be incorporated into computational work on morphology and speech.",
        "Finally, one might reasonably ask why a phonologist ought to be interested in computational phonology.",
        "At the most obvious level, computational phonology should provide support for developing theories and testing them against data, removing some of the hackwork involved in achieving formal and empirical adequacy.",
        "Additionally, computational phonology may be able to provide formal devices that are useful in phonology proper, as in the case of the information-theoretic evaluation metric (Ellison 1993) that is intended to replace the naïve symbol-counting version.",
        "One can also observe that phonology has its own divide between theoreticians who work on abstract models supported by small collections of data drawn from a wide variety of languages, and investigators working on large scale analyses of individual languages (such as the work of the Summer Institute of Linguistics on the orthographies of approximately 1,100 languages [D. Crozier, personal communication]).",
        "To this observer, it seems like there could be more communication of new data from the field phonologist to the theoretical phonologist and, in the reverse direction, communication of new hypotheses and useful theoretical devices that would play an active part in the search for interesting new data.",
        "It seems plausible that computational systems that let phonologists experiment with large amounts of data and a variety of theoretical models have an important part to play in bridging the gap between the 'theory people' and the 'data people.'"
      ]
    },
    {
      "heading": "3. Research Themes",
      "text": [
        "I have attempted to identify four strands of work and cite a representative sample of work within each.",
        "Unfortunately, much valuable, relevant work has had to be omitted from the citation lists below for reasons of space.",
        "Formal reconstruction and language-theoretic results.",
        "Work in this area seeks to provide coherent and well-understood formal frameworks in which phonological theories can be expressed.",
        "Some work takes an existing theory as its starting point and seeks to refine it and express it in increasing levels of formality, while other work begins from an existing formalism and tries to adapt its expressive capabilities to the needs of phonology.",
        "Since most work contains a mixture of both, I shall not attempt a classification.",
        "Rather, I shall loosely classify a selection of the work based on the formal method used: unification (Carson 1988; Chung 1990; Coleman 1991; Scobbie 1991; Broe 1993; Walther 1993), predicate logic (Bird 1990; Bouma 1991; Russell 1993), modal logic (Bird and Blackburn 1991; Calder and Bird 1991), type theory (Klein 1991; Mastroianni 1993), categorial grammar/logic (Wheeler 1981; Dogil 1984; van der Linden 1991; Oehrle 1991; Steedman 1991; Moortgat and Morrill to appear), finite-state devices (Kay 1987; Kornai 1991; Wiebe 1992; Bird and Ellison 1994), electrical circuitry (Gilbers 1992), and formal language theory (Ristad 1990; Kornai 1991; Ritchie 1992; Wiebe 1992).",
        " This work addresses phonological theories such as autosegmental, metrical, underspecification, and government phonology.",
        "The paper by Kaplan and Kay in this collection is another example of work in this general vein.",
        "Implementations.",
        "Work in this area is directed at producing computer programs that can be used by phonologists to develop and test theories.",
        "A variety of SPE implementations exist (independently of the finite-state transducer model) starting from Bobrow and Fraser (1968) and including models for applying rules in reverse (Bear 1990; Maxwell 1991).",
        "Other theoretical frameworks that have been implemented to a greater or lesser extent include lexical phonology (Williams 1991), autosegmental phonology (Bird 1990; Albro 1994; Bird and Ellison 1994), diachronic phonology (Hewson 1974; Eastlack 1977; Lowe and Mazaudon 1989), inheritance-based models (Daelemans 1987; Reinhard and Gibbon 1991) and connectionist models (see the next paragraph on learning).",
        "The paper by Lowe and Mazaudon in this collection is an example of other work under the heading of implementations.",
        "Automatic learning.",
        "This work aims to provide models to (i) simulate human behavior and test of theories of human language acquisition, and (ii) provide the working phonologist with useful generalizations about a certain body of data under study.",
        "Examples of the first type are (Lathroum 1989; Touretzky and Wheeler 1993; Gupta and Touretzky 1992; Hare 1990; Gasser and Lee 1990; Gasser 1992; Shillcock et al.",
        "1992; Goldsmith 1993; Larson 1992), and these all use connectionist models.",
        "Examples of the second type are all symbolic (Johnson 1984; Dresher and Kaye 1990; Ellison 1993; Bird 1994).",
        "Daelemans, Gillis, and Durieux have contributed a paper to the present collection that fits into this category of automatic learning.",
        "Interfacing to grammar and speech.",
        "The final grouping contains work that is intended to integrate computational models of phonology with computational models of grammar and of speech.",
        "Concerning the phonology-grammar interface, all this work is covered under the paragraph on formal reconstruction above.",
        "The assumption is that if phonological models are formalized and if they employ the same computational model as is used for computational syntax and semantics, then interfacing to grammar ought to be relatively straightforward.",
        "Another instance of this work is the contribution to the present collection by Bird and Klein.",
        "Recent work on integrating phonology with speech synthesis includes Hertz (1990), Coleman (1992), and Dirksen (1992), and there is also a large literature on the phonology of intonation as it relates to synthesis (e.g. Anderson, Pierrehumbert, and Liberman 1984; Ladd 1987).",
        "This concludes the discussion of the various current research themes in computational phonology.",
        "As chance would have it, each of these themes is manifested by one of the papers in the present collection.",
        "We now go on to survey these papers briefly.",
        "The reader is referred to the commentaries for more detailed overviews of the contributions."
      ]
    },
    {
      "heading": "4. Brief Survey of Contributions",
      "text": [
        "These papers are given in the same order as the categories of the previous section and in the order in which they appear in the collection itself.",
        "Kaplan and Kay: Regular Models of Phonological Rule Systems.",
        "Kaplan and Kay have finally provided the \"widely cited but notoriously unpublished work\" (Ritchie et al.",
        "1992:20) that establishes the mathematical foundation for finite-state computational phonology and morphology.",
        "This is without question the flagship paper of this collection.",
        "Comparative Method.",
        "This paper presents an implementation of a technique from vi Steven Bird Introduction to Computational Phonology diachronic linguistics, known as the comparative method, for comparing word forms taken from cognate languages in order to reconstruct aspects of the ancestor language from which the languages are derived.",
        "The system is applied to data from a group of Tibeto-Burman languages spoken in Nepal.",
        "Daelemans, Gillis, and Durieux: The Acquisition of Stress: A Data-Oriented Approach.",
        "This paper consists of a rather striking demonstration that an empiricist learning model actually performs better than the nativist 'Principles and Parameters' approach, concerning the task of assigning primary stress to a corpus of around 5,000 Dutch words.",
        "Bird and Klein: Phonological Analysis in Typed Feature Systems.",
        "This contribution shows how a model of phonology incorporating complex multi-tiered structures can be integrated with a constraint-based grammar of the HPSG variety.",
        "Applications to nonconcatenative morphology in Sierra Miwok and deletion in French are given."
      ]
    },
    {
      "heading": "5. Commentaries",
      "text": [
        "The commentaries were conceived as a way of involving more people in the special issue, and of identifying, for each paper, the noteworthy achievements and remaining areas of contention.",
        "I felt that this would add interest and perspective to the collection and would enable outsiders to gain a deeper insight into the workings of the field.",
        "Two commentators were selected for each paper who have an established reputation for work in the same area of specialization as the paper in question, and who, in some cases, hold contrary views to those being advanced by the authors."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "I am deeply indebted to Julia Hirschberg who gave me her full support as I undertook the editorial tasks involved in preparing this collection.",
        "She also took sole editorial responsibility for my contribution with Ewan Klein.",
        "I am also thankful to the members of SIGPHON, the CL Editorial Board, and many others for the painstaking reviewing they willingly undertook, and to the authors and commentators for their enthusiastic participation in this project and for their comments on this introduction."
      ]
    }
  ]
}
