{
  "info": {
    "authors": [
      "Gertjan van Noord",
      "Gosse Bouma"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-1039",
    "title": "Adjuncts and the Processing of Lexical Rules",
    "url": "https://aclweb.org/anthology/C94-1039",
    "year": 1994
  },
  "references": [
    "acl-J91-3003"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The standard IIPSG analysis of Germanic verb clusters can not explain the observed narrow-scope readings of adjuncts in such verb clusters.",
        "We present an extension of the IIPSG analysis that accounts for the systematic ambiguity of the scope of adjuncts in verb cluster constructions, by treating adjuncts as members of the subcat list.",
        "The extension uses powerful recursive lexical rules, implemented as complex constraints.",
        "We show how 'delayed evaluation' techniques from constraint-logic programming can be used to process such lexical rules."
      ]
    },
    {
      "heading": "1 Problem Description",
      "text": []
    },
    {
      "heading": "1.1 Dutch Verb Clusters",
      "text": [
        "Consider the following Dutch subordinate sentences.",
        "(1) dat Arie wil sl.apen that Arie wants to-sleep (2) dat Arie Bob wil slaan that Arie Bob wants to-hit that Arie wants to hit Bob (3) * dat Arie Bob wil slapen that Arie Bob wants to-sleep that Arie wants to sleep Bob (4) * dat Arie wil Bob slaan (5) dat Arie Bob cadeautjes wil geven that Arie Bob presents want to-give that Arie wants to give presents to Bob (6) * dat Arie Bob wil cadeautjes geven dat Ark wil Bob cadeautjes geven (7) dat Arie Bob zou moeten kunnen willen kussen that Arie Bob should must can want to-kiss that Arie should be able to want to kiss Bob",
        "The examples 1-3 indicate that in Dutch the arguments of a main verb can be realized to the left of an intervening auxiliary verb, such as a modal verb.",
        "Furthermore the sentences in 4-6 indicate that in such constructions the arguments must be realized to the left of the auxiliary verbs.",
        "In 7 it is illustrated that there can be any number of auxiliaries."
      ]
    },
    {
      "heading": "1.2 The IIPSG analysis of verb-clusters",
      "text": [
        "The now standard analysis within IIPSG of such verb-clusters is based on ideas from Cat-egorial Grammar (cf. for example Moortgat (1988)) and defined within the IIPSG framework by Hinrichs and Nakazawa (1.989).",
        "In this analysis auxiliary verbs subcategorize for an unsaturated verb-phrase and for the complements that are not yet realized by this verb-phrase.",
        "In other words, the arguments of the embedded verb-phrase are inherited by the auxiliary.",
        "For example, the auxiliary `wil' might be defined as in figure 1.",
        "If we assume an application rule that produces flat vp-structures, then we obtain the derivation in figure 2 for the infinite verb-phrase",
        "(8) ...Arie boeken wil kunnen geven",
        "case of adjuncts.",
        "For example, the following Dutch subordinate sentences are all systematically ambiguous between a wide-scope reading (adjunct modifies the event introduced by the auxiliary) or a narrow-scope reading (adjunct modifes the event introduced by the main verb).",
        "dat Arie vandaag Bob wil slaan that Arie today Bob want to-hit that Arie wants to hit Bob today dat Arie het artikel op tijd probeerde op to sturen",
        "that Arie the article on time tried to send that Arie tried to send the article in time (11) (tat Arie Bob de vrouwen met een verrekijker zag bekijken that Arie Bob the women with the telescope saw look-at that Arie saw Bob looking at the women with the telescope",
        "Firstly note that the treatment of adjuncts as presented in Pollard and Sag (in press), cannot be maintained as it simply fails to derive any of these sentences because the introduction of adjuncts is only possible as sisters of saturated elements.",
        "The fact that arguments and adjuncts can come interspersed (at least in languages such as Dutch and German) is not accounted for.",
        "A straightforward solution to this problem is presented in Kasper (in preparation).",
        "Here adjuncts and arguments are all sisters to a head.",
        "The arguments should satisfy the subcat requirements of this head – the adjuncts modify the semantics of the head (via a recursively defined adjuncts principle).",
        "The main problem for this treatment of adjuncts is that it cannot explain the narrow-scope readings observed above.",
        "If adjuncts modify the head of the phrase they are part of then we will only obtain the wide-scope readings.",
        "If we assume, on the other hand, that adjuncts arc on the subcat list, then we will obtain both readings straightforwardly.",
        "In the narrow-scope case the adjunct is on the subcat list of the embedded verb, and then inherited by the matrix verb.",
        "In the wide-scope case the adjunct simply is on the subcat list of the matrix verb.",
        "In the next section we present a treatment of adjuncts in which each adjunct is subcategorized for.",
        "By means of lexical rules we are able to obtain the effect that there can be any number of adjuncts.",
        "We also sketch how the semantics of modification might be deli ned."
      ]
    },
    {
      "heading": "2 Adjuncts as Arguments",
      "text": []
    },
    {
      "heading": "2.1 Adding adjuncts",
      "text": [
        "The previous section presented an argument that VP modifiers are selected for by the verb.",
        "Note that this is in line with earlier analyses of adjuncts in IIPSG (Pollard and Sag, 1987) which where abandoned as it was unclear how the semantic contribution of adjuncts could be defined.",
        "Here we propose a solution in which adjuncts are members of the subcat list, just like ordinary arguments.",
        "The difference between arguments and adjuncts is that adjuncts are `added' to a subcat list by a lexical rule that operates recursively) Such a lexical rule might for example be stated as in figure 3.",
        "Note that in this rule the construction of the semantics of a modified verb-phrase is still taken care of by a mod feature on the adjunct, containing a val and arg attribute.",
        "The arg attribute is unified with the 'incoming' semantics of the verb-phrase without the adjunct.",
        "The val attribute is the resulting semantics of the verb-phrase including the adjunct.",
        "This allows the following treatment of the semantics of modification 2, cf. figure 4.",
        "We are now in a position to explain the observed ambiguity of adjuncts in verb-cluster constructions.",
        "Cf.:",
        "(12) dat Arie Bob vanclaag wil kussen that Aria Bob today wants to-kiss",
        "In the narrow-scope reading the adjunct is first added to the subcat list of 'kussen' and then passed on to the subcat list of the auxiliary verb.",
        "In the wide-scope reading the adjunct is added to the subcat list of the auxiliary verb.",
        "The final instantiations of the auxiliary `wit' for both readings are given in figure 5."
      ]
    },
    {
      "heading": "2.2 Discussion",
      "text": [
        "A further problem concerning the syntax of adjuncts is posed by the fact that adjuncts can take part in unbounded dependency constructions.",
        "Lexical treatments of the kind presented in Pollard and Sag (in press), chapter 9 assume that a lexical rule is responsible for 'moving' 'cf.",
        "Miller (1992) for a similar suggestions concerning French.",
        "2inspired by Kasper (in preparation) an element from the subcat list to the slash list.",
        "Such an account predicts that adjuncts can not take part in such unbounded dependency constructions.",
        "In Pollard and Sag (in press), chapter 9 a special rule is introduced to account for those cases where adjuncts do take part in UDCs.",
        "The treatment that we propose for adjuncts obviates the need for such an 'ad-hoc' rule.",
        "Clearly many details concerning the syntax of adjuncts are left untouched here, such as the quite subtle restrictions in word-order possibilities of certain adjuncts with respect to arguments and with respect to other adjuncts.",
        "In the current framework linguistic insights concerning these issues could be expressed as constraints on the resulting subcategorization list (e.g. by means of LP-constraints).",
        "It should also be stressed that treating adjuncts and arguments on a par on the level of subcategorization does not imply that observed differences in the behavior of adjuncts and arguments could not be handled in the proposed framework.",
        "For example the difference of adjuncts and arguments in the case of left dislocation in Dutch (exemplified in 13-16) can be treated by a lexical rule that operates on the subcat list before adjuncts arc added.",
        "(13) De voorstelling duurt een The show takes an hour (14) Eon tint, chat (hurt de voorstelling (15) Arie en Bob wandelen een uu• Arie and Bob walk an hour ( 16) * Eon uttr, dat wandelen Arie en Bob"
      ]
    },
    {
      "heading": "3 Processing Lexical Rules",
      "text": []
    },
    {
      "heading": "3.1 Lexical Rules as Constraints on Lexical Categories",
      "text": [
        "Rather than formalizing the 'add-adjuncts' rule as a lexical rule we propose to use recursive constraints on lexical categories.",
        "Such lexical constraints are then processed using delayed evaluation techniques.",
        "3 Such an approach is more promising than an off-line approach that precomputes the effect 3Refer to Carpenter (1991) for a proof of Turing equivalence of simple categorial grammar with recursive lexical rules.",
        "and time adverbials) will generally be encoded as presented, where R11 is a metavariable that is instantiated by the restriction introduced by the adjunct.",
        "Operator adverbials (such as causatives) on the other hand introduce their own quantified state of affairs.",
        "Such adverbials generally are encoded as in the following example of the adverbial `toevallig' (accidentally).",
        "Adverbials of the first type add a restriction to the semantics of the verb; adverbials of the second type introduce a new scope of modification.",
        "of lexical rules by compilation of the lexicon, as it is unclear how recursive lexical rules can be treated in such an architecture (especially since some recursive rules can easily lead to an infinite number of lexical entries, e.g. the adjuncts rule).",
        "Another alternative is to consider lexical rules as 'ordinary' unary rules.",
        "If this technique is applied for the lexical rules we have envisaged here, then (unary) derivations with unbounded length have to be considered.",
        "If we formalize lexical rules as (complex) constraints on lexical categories then we are able to use delayed evaluation techniques for such constraints.",
        "Assume that the 'underlying' feature structure of a verb is given by a definition of 'stem' (e.g. as the example of `will above, or as the example of a simple transitive verb such as `kussen' (to-kiss) in figure 6).",
        "Such a feature-structure is not the actual category of the verb • rather this category is defined with complex constraints with respect to this base form.",
        "here the constraint that adds adjuncts to the subcat list has our",
        "special attention, but there is also a constraint that adds a subject to the subcat list (as part of the inflection constraint for finite verbs) and a constraint that pushes an element from the subcat list to slash (to treat unbounded dependencies along the lines of chapter 0 of Pollard and Sag (in press)), etc.",
        "Thus a lexical entry might be defined as in figure 7.",
        "Lexical rules are regarded as (complex) constraints in this framework because it allows an implementation using delayed evaluation techniques from logic programming.",
        "The idea is",
        "spect to a base form using complex constraints.",
        "Subject addition is a constraint associated with finite inflection.",
        "that a certain constraint is only (partially) evaluated if 'enough' information is available to do so successfully.",
        "As a relatively simple example we consider the constraint that is responsible for adding a subject as the last element on a subcat list of finite verbs.",
        "As a lexical rule we might define:",
        "If we use constraints the definition can be given as in figure 7, as part of the constraint associated with finite morphology.",
        "Note that the two approaches are not equivalent.",
        "If we use lexical rules then we have to make sure that the add-subject rule should be applied only once, and only for finite verbs.",
        "A.s a constraint we simply call the constraint once at the appropriate position.",
        "The concatenation constraint (associated with the 'dot' notation) is defined as usual:",
        "If this constraint applies on a category of which the subcat list is not yet fully specified (for example because we do not yet know how many adjuncts have been added to this list) then we cannot yet compute the resulting subcat list.",
        "The constraint can be successfully applied if either one of the subcat lists is instantiated: then we obtain a finite number of possible solutions to the constraint.",
        "The relation add_adj recursively descends through a subcategorization list and at each position either adds or does not add an adjunct (of the appropriate type).",
        "Its definition is given in figure 8.",
        "Note that it is assumed in this definition that the scope of (operator-type) adverbials is given by the order in which they are put in in the subcategorization list, i.e. in the obliqueness order.",
        "'Cf.",
        "Kasper (in preparation) for discussion of this point, also in relation with adjuncts that introduce quantifiers.",
        "Note that in our approach different possibilities can be defined.",
        "we declare the conditions under which the constraint can be evaluated.",
        "For the add_adj constraint we define:"
      ]
    },
    {
      "heading": "3.2 Delayed evaluation",
      "text": [
        "For our current purposes, the co-routining cilities offered by Sicstus Prolog are powerful enough to implement a delayed evaluation strategy for the cases discussed above.",
        "For each constraint we declare the conditions for evaluating a constraint of that type by means of a block declaration.",
        "For example the concat constraint is associated with a declaration: :- block concal( – ,?, – ).",
        "This declaration says that evaluation of a call to concat should be delayed if both the first and third arguments are currently variable (uninstantiated, of type TOP).",
        "It is clear from the definition of concat that if these arguments are instantiated then we can evaluate the constraint in a top-down manner without risking non-termination.",
        "E.g. the goal concat((A, B), C, D) succeeds by instantiating D as the list (A, 131C).",
        "Note that block declarations apply recursively.",
        "If the third argument to a call to concat is instantiated as a list with a variable tail, then the evaluation of the recursive application of that goal might be blocked; e.g. evaluation of the goal concat(A, (Sj), C)) succeeds either with both A and C instantiated as the empty list and by unifying Sj and 13, or with A instantiated as the list (1111)) for which the constraint concat(D, (Sj), C) has to be satisfied.",
        "Similarly, for each of the other constraints One may wonder whether in such an architecture enough information will ever become available to allow the evaluation of any of the constraints.",
        "In general such a problem may surface: the parser then finishes a derivation with a large collection of constraints that it is not allowed to evaluate -- and hence it is not clear whether the sentence associated with that derivation is in fact grammatical (as there may be no solutions to these constraints).",
        "The strategy we have used successfully so-far is to use the structure hypothesized by the parser as a 'generator' of information.",
        "For example, given that the parser hypothesizes the application of rules, and hence of certain instantiations of the subcat list of the (lexical) head of such rules, this provides information on the subcat-list of lexical categories.",
        "Keeping in mind the definition of a lexical entry as in figure 7 we then are able to evaluate each of the constraints on the value of the subcat list in turn, starting with the push_slash constraint, up through the inflection and add_adj constraints.",
        "Thus rather than using the constraints as 'builders' of subcat-lists the constraints are evaluated by checking whether a subcat-list hypothesized by the parser can be related to a subcat-list provided by a verb-stem.",
        "In other words, the flow of information in the definition of lexical_entry is not as the order of constraints might suggest (from top to bottom) hut rather the other way around (from bottom to top)."
      ]
    },
    {
      "heading": "4 Final remarks",
      "text": [
        "We illustrated that recursive lexical constraints might he useful from a linguistic perspective.",
        "If lexical rules are formalized as complex constraints on lexical categories then methods from logic programming can.",
        "be used to implement such constraints.",
        "Note that complex constraints and delayed evaluation techniques are also useful in other areas of linguistic desciption.",
        "For example we used the same methods to define and pro",
        "cess IIPSG's FOOT FEATURE PRINCIPLE.",
        "The method may also be applied to implement IIPSG's binding theory.",
        "As a testcase we improved upon the IIPSG analysis of (Germanic) verb clusters and adjuncts by treating adjuncts as categories that are on the subcat list by virtue of a complex constraint.",
        "The fragment that has been implemented with the methods described is much larger than the discussion in the previous sections suggest, but includes treatments of extra-position, ipp, modal inversion, participium inversion, the third construction, partial-vp top-icalisation, particle verbs, verb-second, subject raising, subject control, raising-to-object, object control and clitic climbing in Dutch."
      ]
    }
  ]
}
