{
  "info": {
    "authors": [
      "Leo Wanner"
    ],
    "book": "International Workshop on Natural Language Generation",
    "id": "acl-W94-0316",
    "title": "Building Another Bridge Over the Generation Gap",
    "url": "https://aclweb.org/anthology/W94-0316",
    "year": 1994
  },
  "references": [
    "acl-C92-2096",
    "acl-C94-1060",
    "acl-J87-3006"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper, we address one of the central problems in text generation: the missing link (\"the generation gap\" in Meteer's terms) between the global discourse organization as often provided by text planning modules and the linguistic realization of this organization.",
        "We argue that the link should be established by the lexical choice process using resources derived from Mel'euk's Lexical Functions (us).",
        "In particular, we demonstrate that sequences of us may well serve as lexical discourse structure relations which link up to global discourse relations in the output of a Rhetorical Structure Theory style text planner."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": []
    },
    {
      "heading": "1.1 Identifying the Generation Gap",
      "text": [
        "In text generation, content selection and discourse organization (i.e. the text planning tasks) have often been dealt with independently from the linguistic realization of the text plan – the information selected and structured by the text planning process (cf., e.g., [McKeown and Swartout, 1987]).",
        "However, a text planning process which does not take into account linguistic resources that are available to express a particular meaning suffers from two major shortcomings: (i) it is not sensitive to variant discourse organizations at the sentence level; and (ii) it cannot guarantee that its text plan is always verbalizable by the linguistic module.",
        "With other words, there is a discrepancy (a \"generation gap\" in Meteer's terms) between a text plan that is not tailored to linguistic resources and the input as required by the linguistic realization module.",
        "For extensive examples that illustrate this, see, especially Meteer's work [Meteer, 1991] and [Meteer, 1992], but also, e.g., [Rubinoff, 1992, Vander Linden et al., 1992].",
        "In our work, we have found that especially lexical phenomena (such as lexical cooccurrence and lexical semantics) play an important role in discourse organization at the level of sentence planning, which is still one of the unsolved problems in text planning, cf. [Hovy, 19911 Consider the following example:",
        "nun tot ist lit.",
        "'Grandpa shot at the burglar who is now dead'.",
        "The interpretation of (la) does not necessarily suggest that burglar's death is in consequence of grandpa's shooting.",
        "To communicate this relation, (lb) is more appropriate:",
        "(1) b. Opa schoil auf den Einbrecher und",
        "lit.",
        "'Grandpa shot at the burglar and killed him/ wounded him deadly'.",
        "However, despite an analogous syntactic construction, (2) suggests the interpretation that grandpa's being well is in consequence of doctor's curing:",
        "(2) Der Arzt heilte Opa, der nun ganz gesund",
        "ist lit.",
        "'The doctor cured grandpa, who is now completely well'.",
        "That is, the consideration of lexical phenomena helps to resolve the discrepancy between discourse structure relations (as, e.g., given by Rhetorical Structure Theory (RsT) [Mann and Thompson, 1987]) and their linguistic realization.",
        "Therefore, a text generator has to provide an organization of lexical resources which makes explicit the rhetorical potential of lexical phenomena and which allows for the purposeful choice of these phenomena.",
        "In principle, three ways seem to be feasible for how to proceed: (i) to broaden the task of text planning by lexical choice (cf., e.g., [Meteer, 1992]), (ii) to realize an interaction link between the linguistic realization module and text planning (cf., e.g., [Rubinoff, 19921), or (iii) to broaden the task of linguistic realization in order to deal with a final, lexically guided determination of a discourse organization that has been predetermined by text planning.",
        "In our work, we follow (iii).",
        "This is, in order to keep a separate level of discourse organization that is realized independently from linguistic resources and to make use of the potential of linguistic resources to guide the discourse organization at a more detailed level than conventional text planning is able to do.",
        "In contrast to, e.g., [Fawcett et al., 1992] and [Elhadad and Robin, 1992], who deal with lexically biased sentence organization within the grammar, we take a radically lexicalist position (similar to that of [McDonald, 19911) in that we assume that lexicalization has to take place before grammatical realization; and that it is the words chosen, which dictate the possible syntactic realizations of a content to be communicated.",
        "More precisely, we propose a two level discourse organization where the first level is provided by an RST style text planner and the second level by a separate lexical choice module.",
        "Then, the discourse organization of a text is done in two steps: in the first step, the text planner predetermines the discourse structure relations and selects the content; in the second step, the lexical choice module provides, in accordance with linguistic constraints, a finer specification and the realization of these relations and tailors their content to linguistic realization."
      ]
    },
    {
      "heading": "1.2 The Framework",
      "text": [
        "The computational framework in which our lexical choice model has partially been implemented is the systemic text generator KOMET [Bateman et al., 1991].",
        "One source of constraints for the first level text organization comes in KOMET from an RsT-based planner.' The output of this planner is a collection of case frames with RST relations holding between them as shown in Figure 1.",
        "Starting from such a text plan, the lexical choice 'Recent developments of this planner are described in Ellovy et al., 1992].",
        "module has to construct an input to the grammar (in KOMET – a systemic grammar of German [Te-ich, 1992]).",
        "This input contains the lexicalization of the text plan content and constraints for its syntactic realization.",
        "Figure 2 shows such an input (called Partied Grammatical Structure (6s))2 encoded in terms of Typed Feature Structures (TFss) [Emele, 19891.",
        "This input has been derived from the text plan in Figure 1.3 In what follows, we present an ongoing attempt to define a general model of lexical resources which would provide the missing link between the global discourse organization as given by discourse structure relations in the text plan and its linguistic realization.",
        "In particular, we show how Mel'Zuk's Lexical Functions (us) (cf., e.g., [Mel'6uk and Polguere, 1987]) can be used to compile such a general model.",
        "After the introduction of the general principles that underly our organization of lexical resources, we focus on LF sequences.",
        "We demonstrate that they may well function as lexically biased discourse structure relations at the in-trasentential level; and, thus, be interpreted as a finer specification of global discourse structure relations."
      ]
    },
    {
      "heading": "7th International Generation Workshop • Kennebunkport, Maine • June 21-24, 1994",
      "text": [
        "2 Overview of the Lexical Resources Organization While designing a lexical choice model, it is important to note that (a) lexical phenomena and, therefore, also lexical choices that are available to communicate a specific meaning are dependent on this meaning; and (b) lexical phenomena are involved at different stages of the utterance construction process.",
        "Thus, the process of SHOOTING has another lexicalization potential than that of CURING; and the choice of fierce in The terrorists put up fierce resistance is done at another stage than the choice of put up.",
        "This calls for:",
        "• a (fairly) excaustive coverage of the lexical potential of each semantic entity (such as process, event, etc.",
        "); • clustering of lexical resources locally to semantic units of a certain size; • a multilayerecl organization of lexical resources (and therefore also a multilayered lexical choice process).",
        "In our model, the resources are provided mainly by Lexical Functions as introduced in the Meaning Text Theory (mTT).",
        "They are clustered locally to situations and organized into four layers."
      ]
    },
    {
      "heading": "2.1 Using Lexical Functions as the Source of Lexical Resources",
      "text": [
        "Most excaustively, lexical phenomena have been described in MTT by Lexical Functions.",
        "Roughly speaking, an LF f is a standard semantico-lexical relation which holds between a lexeme L1 (the keyword of f) and a set of lexemes f(L) (the value of f).",
        "Consider the following examples:",
        "MerZuk distinguishes about sixty simple us of the above kind.",
        "Simple us can further be composed with each other; the meaning of such complex us is, as a rule, a composition of the meanings of the participating us.",
        "Thus, AntiMagn means 'slightly' (e.g., An-tiMagn(injury) = minor); and IncepOperi 'start performing' (e.g., lucepOperi(shooting) = [to] start (shooting)).",
        "If several (simple or complex) us compose a phrase or a clause (as, e.g., AntiMagn and So compose minor injury), we separate these us by a sign.",
        "In addition to complex us, we introduce LF sequences – pairs of us (denoted LP].",
        "A LF2), whose values cooccur at the syntagmatic axis.",
        "For example, Prepar(shooting) A Vo(shooting) with Prepar(shooting) = [to] charge (the gun) and V o(shooting) = [to] shoot in He charged the gun and shot.",
        "LF sequences are directed, i.e. ix).",
        "A LF2 LF2 A LFj.",
        "Consider, e.g., Prepar A Vo, which is an instantiation of a TEMPORAL SEQUENCE relation with the first LF expression preceding the second on the temporal axis, and Vo A Prepar as in He shot after charging the gun, where the first LF expression succeeds the second.",
        "Moreover, the existence of LF1 A LF2 for an entity in a language does not mean that LF2 A LF1 is also available (consider, e.g., the following instantiation of A0 A Magn o So: She is beautiful – a real beauty and Magn o So A Ao: *She is a real beauty – beautiful.",
        "Therefore, in LF sequences, one argument is the 'hub' – the point of departure (or the expanded LF) and the other argument is the 'hub expander'.",
        "LFs and LF sequences (henceforth, both are referred to as 'us') have well-defined syntactic realizations.",
        "For example, Operi is defined as taking the ACTOR as grammatical subject and the keyword of the situation as direct object.",
        "The LF sequence Operi A Magn o So – when applied to SHOOTING – can be realized as a paratactic complex clause (cf. Grandpa took a shot at the burglar; it was a good shot!)",
        "or as a simple clause (cf. Grandpa took a good shot at the burglar), but not, e.g., as a hypotactic complex clause (cf. *Grandpa took a shot at the burglar, which was a good shot/ one).",
        "And so on."
      ]
    },
    {
      "heading": "2.2 Compiling Lexical Resources Locally to Situations",
      "text": [
        "In accordance with [Apresjan, 1974], a situation is comprehensively defined by: 1. a predicate; 2. the constituents (i.e. potential participants and circumstantials) of this predicate; 3. the relations between different constituents as well as between constituents and the predicate (these relations are usually given in terms of actions, states, etc.",
        "); 4. the features of the predicate, constituents, and the above actions and relations.",
        "The lexical resources of a situation (the Lexicaliza"
      ]
    },
    {
      "heading": "7th International Generation Workshop • Kennebunkport, Maine • June 21-24, 1994",
      "text": [
        "lion Cluster in terms of [McDonald, 19911) are then given by all possible wordings of the entities this situation is defined by.",
        "For example, SHOOTING is a situation with the predicate named shooting, shot, etc.",
        "; with the participants ACTOR (named gunman, marksman, etc.)",
        "and ACTEE (named target, victim, ..",
        ".",
        "); with the obligatory circumstantials INSTRUMENT (rifle, gun, etc.)",
        "and MEANS (bullet), and optional circumstantials LOCATION, TIME, etc., which do not have a situation-specific lexicalization.",
        "Among the Acroft's actions are shoot, fire, kill, wound, etc.",
        "The lexicaliza-tions of the relations between ACTOR and the predicate include, e.g., the performance of the situation (fire (a shot), take (a shot), etc.",
        "); those between ACTOR and ACTEE – aim (at), hit, etc.",
        "The features of ACTOR include skilled, good, lousy, .... And so on.",
        "The various us – with the label of a situation as keyword – supply us with all lexical expressions that communicate the entities this situation is defined by; see the list above for examples with respect to"
      ]
    },
    {
      "heading": "SHOOTING .4",
      "text": []
    },
    {
      "heading": "2.3 Organization of Lexical Resources as a Multilayered Model",
      "text": [
        "As stated above, we organize situation-specific lexical resources that are provided by the LF information into four layers.",
        "The layers are called Intersituational Layer, Intrasituational Layer, Constituent Layer, and Lexeme Layer, respectively.",
        "The first three layers are motivated by the semantic constituency of expressions as provided by us: 1. two predicate structures (as given by LF sequences) are dealt with at the intersitu-ational layer; 2. predicate structures (as given, e.g., by the Open % function) – at the intrasituational layer; and 3. predicate constituent structures (as given, e.g., by the Si function) – at the constituent layer.",
        "At the lexeme layer, the LFS are unified with concrete lexemes.5 us correspond to knowledge at varying levels of abstraction (see the discussion in [Wanner and Bateman, 19901); therefore, we organize them coherently at each of the first three layers in network form in terms of the functional, semantic, and syntactic features that they represent (cf. also [Wanner, 1992]).",
        "For example, the Open i function is decomposed as {actor-realization, situation-oriented, actor-salience, ...}.",
        "Within this organization, the most general structures provide the representation of lexical semantics and the most deli-4Evidently, semantically related situations have intersecting lexicalization clusters.",
        "In order to achieve an efficient organization of the overall lexical resources, we use inheritance techniques, cf. [Wanner, 1992].",
        "60bviously, our layers are in analogy to the \"ranks\" in systemic functional grammars, cf. [Halliday, 1985].",
        "cate ones – lexicalization.",
        "A PGS is then built up by the lexical choice process by a successive traversal of the layers starting from the intersituational layer.",
        "How this is done is described in detail in [Wanner, 1992].",
        "Here we focus on the organization of the layers and on the interface between the output of the text planning module and lexical resources.",
        "In what follows, each layer is described briefly (starting with the lexeme layer).",
        "Note that this description is necessarily extremely oversimplified; it largely abstracts from the actual representation in a systemic functional framework.",
        "Lexeme Layer.",
        "The lexeme layer contains LF - LF value pairs.",
        "Consider selected entries for Operi and Si in the lexicalization cluster of SHOOTING:",
        "Constituent Layer.",
        "The constituent layer contains feature specifications for the realization of predicate constituents and their attributes.6 For example, to name the ACTOR in SHOOTING, his/her proper name; a situation non-specific realization, e.g., his/her function in relation to other entities in the knowledge base (e.g., grandfather); the situation-specific and contextually neutral lexeme marksman; or a negatively loaded situation-related expression such as murderer, killer, etc.",
        "can be chosen.",
        "Consider a sample fragment for the realization of the ACTOR in SHOOTING in network form:",
        "The labels in Times Roman are network features in the corresponding fragment; those in italics are pointers to \"external features\" that provide a more detailed specification of the feature they are associated with.",
        "\"External\" means 'at other layers of the same clus-ter' or 'in clusters of other situations'.",
        "Clusters of other situations are identified by labels in small capitals (preceded by an uparrow).",
        "The labels in bold denote roles which are introduced into the PGS when"
      ]
    },
    {
      "heading": "7th International Generation Workshop • Kennebunkport, Maine • June 21-24, 1994",
      "text": [
        "the corresponding feature is chosen during the network traversal.",
        "The fragment shows that there are pointers to features in.",
        "other lexicalization clusters and to features at lower layers of the same lexicalization cluster (cf. the pointer to S1 at the lexeme layer).",
        "Intrasituational Layer.",
        "The intrasituational layer contains feature specifications for the realization of predicates and their attributes.",
        "For example, to express ACTOR's performance of SHOOTING, e.g., Vo ( [to] shoot), Open i ([to] take a shot, [to] fire a shot), etc.",
        "are available; but not, e.g., Oper2 (*[to] get a shot as in *The burglar got a shot from grandpa).",
        "In our functional interpretation, the difference between [to] shoot and the other options is that it is 'actionoriented', while the others are 'situation-oriented'.",
        "If [to] get a shot were grammatical, it would emphasize 'actee-salience' (as [to] be shot does), while the other options mentioned emphasize 'actor-salience'.",
        "In network form, this looks as follows (see [Wanner and Bateman, 1990] for a detailed discussion): axis: the 'causation' and the 'initial' phases precede the 'continuing' and the 'final' phases; the 'continuing' phase precedes the 'final' phase, etc.",
        "Further, the phases 'initial' and 'final' are related to SHOOTING itself.",
        "As global, for example, the different PREPARATION actions (PREPARATION' (verbalized, e.g., by [to] charge the gun) and PREPARATION\" (verbalized, e.g., by [to] cock the trigger) precede SHOOTING; ACTOR'S and ACTEE's actions that follow SHOOTING as well as the 'resulting state' of ACTEE succeed it.",
        "In the following fragment, only the 'global' organization is partially illustrated:",
        "Note the difference between PGS (i.e. grammatical) roles and situation roles: the feature set { .",
        ".. actor's performance, situation-oriented, actor-salience) triggers the realization of the label of the situation (S0) in the grammar as ACTEE; and the situational role"
      ]
    },
    {
      "heading": "ACTEE – as GOAL.",
      "text": [
        "Intersituational Layer.",
        "The intersituational layer contains feature specifications for the realization of relations between predicates.",
        "For example, of the CAUSATION relation between ACTOR'S performance of the situation SHOOTING (verbalized, e.g., by [to] shoot or by [to] take a shot) and the state of ACTEE after the situation ([to] be dead); of the CONDITION relation between ACTOR'S preparing the INSTRUMENT for functioning and ACTOR'S performing of the situation (as, e.g., instantiated by [to] charge and [to] shoot; etc.",
        "In the following fragment, we present the specification of the TEMPORAL SEQUENCE relation taking SHOOTING as reference time.",
        "We represent the 'internal' temporal and the 'global' temporal organization of SHOOTING.",
        "As 'internal', we present its phases at the temporal"
      ]
    },
    {
      "heading": "3 Using Lexical Resources for Discourse Organization",
      "text": [
        "To tailor RST relations in the text plan to lexical resources, the lexical choice process must know (i) how, e.g., RST relations are specified in more detail by lexical resources and (ii) what the possible linguistic realizations of these finer specifications are.",
        "Since LE's have well-defined semantic, lexical and syntactic realizations, (ii) is provided by our representation.",
        "In this section, we address (i); and more precisely:",
        "• how discourse structure relations are defined in lexical resources, • how these relations are linked up with the relations specified in the text plan."
      ]
    },
    {
      "heading": "3.1 Towards Lexical Discourse Structure Relations",
      "text": [
        "For the definition of discourse structure relations in lexical resources (henceforth lexical discourse structure relations), we use LF sequences.",
        "As stated above, LF sequences (and us in general) are organized in terms of their semantic, functional, and syntactic features.",
        "The expression of the same content via different syntactic patterns is an important task in sentence planning (cf., e.g., [Meteer, 1992, Vander Linden et",
        "al., 1992, Scott and de Souza, 199117 But it is the functional content we associate with each LF sequence, which links the lexical resources up to global discourse structure relations.",
        "Table 1 shows the functional content we associate with some LF sequences.° For a detailed discussion of how the functional content of LF sequences is used to define and to structure lexical discourse relations following Halliday's organization of intrasentential logico-semantic relations (cf. [Halliday, 1985]), see [Wanner, 1994]."
      ]
    },
    {
      "heading": "3.2 Establishing the Initial Link",
      "text": [
        "The first and the most important task in tailoring the text plan to linguistic resources is to find lexical discourse structure relations that correspond to RST relations specified in the text plan.",
        "To illustrate this task, let us consider the RST relation VOLITIONAL CAUSE as it holds between the situation's causation and the situation itself.",
        "The corresponding function in our model is causal enhancement.",
        "Apart from the LF sequence Caus A Vo given in the table above (in the cluster of RESPECT, instantiated, e.g., by An old tradition requires children to show respect for their parents), at least the following three also function as causal enhancement:9 7Closely related to this topic is the task of 'compacting' the information to be communicated' (sometimes called 'aggregation' [llovy, 1993]).",
        "1.",
        "Caus2Operi A (Magu o) SynVo (as in She commands respect – I (really) think highly of her); 2.",
        "Vo A because of o SUBJECT (as in I respect her because of her work); 3.",
        "Caus3Operi (as in Her work makes me respect her).",
        "The functional content of these realizations is more detailed than that of VOLITIONAL CAUSE.",
        "For example: 1. communicates an active role of the CAUSER; 2.",
        " – the active role of the ACTOR, and 3.",
        " – the active role of the SUBJECT.",
        "Therefore, they not only realize VOLITIONAL CAUSE, but also specify it in more detail.",
        "To summarize, the search for a lexical discourse structure relation is done in accordance with the functional content, the communicative intention of the speaker, and the contents of the arguments of the RST relation considered.",
        "If the RST relation connects unrelated case framesl° (as, e.g., EVIDENCE in In winter, the days are short.",
        "It is getting light late and early dark) these case frames are realized independently without being connected by a lexical discourse structure relation.",
        "If the case frames are related, the following three variations are possible: (i) An RST relation coincides, in general, with the functional content of a lexical discourse structure relation; as, e.g., VOLITIONAL CAUSE in the following rudimentary text plan for the 'RESPECT' examples given above does:"
      ]
    },
    {
      "heading": "(R2/V0LITIONAL CAUSE",
      "text": []
    },
    {
      "heading": ":cause (WORK/ SITUATION",
      "text": [
        ":actor (PERSON"
      ]
    },
    {
      "heading": ":sex female :name #unknown#) :obligatory-roles (:actor)) :action (RESPECT/ SITUATION",
      "text": [
        ": senser (PERSON"
      ]
    },
    {
      "heading": ":speaker +) :phenomenon (PERSON :sex female :name Itunknown#) :obligatory-roles (:senser, :phenomenon, :situation)))",
      "text": [
        "If so, the subclassification of the lexical relation determines its final realization.",
        "(ii) An RST relation instantiation subsumes several distinct classes of lexical discourse structure relations; as, e.g., the instantiation of the RST relation CONTRAST in the text plan below (this plan is also highly simplified):",
        "This text plan may be realized either as contrastive clarification: Gaul is entirely occupied by the Romans; well, not entirely .",
        ".. one small village still holds out.",
        "; or as contrastive enhancement: Gaul is almost entirely occupied by the Romans; but one small village still holds out.",
        "In this case, a sufficiently general lexical discourse structure relation which subsumes both contrastive clarification and contrastive enhancement is chosen.",
        "(iii) An RST relation is not captured by our taxonomy (as, e.g., CONCESSION).",
        "Then, the corresponding case frames are treated as unrelated (see above)."
      ]
    },
    {
      "heading": "4 Related Work",
      "text": [
        "One of the first proposals for how to take linguistic resources into account during the process of text planning was Danlos' Discourse Grammar [Danlos, 1987], where acceptable clause pattern sequences were presented explicitly.",
        "The basic difference between Dan-los' work and ours is that in the Discourse Grammar, clause pattern sequences are represented as concrete valency schemata while in our model, they are represented as functional distinctions that encode sequences of us.",
        "As a result, we do not face the problem of being restricted to a concrete small domain as Daubs does.",
        "Meteer's text planner [Meteer, 1992] is another proposal for the organization of lexical resources that incorporate lexically biased discourse relations.",
        "But while we argue that lexically biased discourse relations are to be realized by a functionally motivated lexical choice model, Meteer sugggests a single structurally motivated model for text planning, which also subsumes lexical choice.",
        "Further, for example, [Rubinoff, 1992] ensures the expressability of discourse relations provided by a conventional text planner by annotating linguistic structures.",
        "DobeSe and Novak [Dobeg and Novak, 1992] use RST structure relations and the Text Structure representation proposed by Meteer in parallel: via RST relations, the content selection and discourse organization is done; the representation of the arguments of the RST relations chosen in terms of Text Structures ensures the linguistic realization and provides constraints for the guidance of the process of content selection and discourse organization.",
        "[Vander Linden et aL, 1992] suggest subclausal RST relations for sentence organization.",
        "Neither Dobe:s\" and Novak nor Vander Linden et aL address lexical phenomena explicitly, however.",
        "Elhadad's proposal [Elhadad, 1992] to use Topoi (i.e. inference rules that encode relations between propositions incorporating lexical material) as discourse structure relations is aimed at exploiting lexical phenomena for discourse organization.",
        "Elhadad focuses, however, on the 'argumentative potential' of lexical items rather than on a comprehensive model of lexical resources."
      ]
    },
    {
      "heading": "5 Concluding Remarks",
      "text": [
        "In this paper, we argued that in order to build up the link between discourse structure relations in the text plan and linguistic resources, it is useful to distinguish between two levels of discourse organization: a global discourse organization, which is not affected by linguistic means; and a finer discourse organization, which is done in accordance with the linguistic material that is available for the meaning communicated.",
        "We reported on an ongoing attempt to define a situation-specific, multilayered model of lexical resources that is based on MerZuk's Lexical Functions.",
        "We have shown that the lexical phenomena represented at the most global layer of this model are suitable to serve as lexically biased discourse relations, and that these relations can be tailored to relations as specified in the output of an RST style text planner.",
        "The following distinctive features characterize the model proposed:",
        "• it makes sure that all relations defined are ex-pressable in language, • it allows for a realization of lexical relations as in-traclausal relations between discourse segments, • it is sensitive to lexical and syntactic variations during the realization of discourse relations.",
        "Although we decompose the LF information and represent it in a systemic framework, we think that we have shown that us as introduced in MTT can be used as constraints not only at the level of words (as argued in [Meteer, 1991, p. 302]).",
        "However, it should also be noted that the proposal we suggest works only if the arguments of a discourse relation communicate information on the same situation or on related situations."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "Many thanks are due to John Bateman for reading the various versions of this paper and for the long (phone)"
      ]
    },
    {
      "heading": "7th International Generation Workshop • Kennebunkport, Maine • June 21-24, 1994",
      "text": [
        "discussions about lexical phenomena in discourse.",
        "I am also very grateful to Elisabeth Maier and Owen Rambow for valuable comments on an earlier draft."
      ]
    }
  ]
}
