{
  "info": {
    "authors": [
      "Hisahiro Adachi",
      "Kazuo Kamata"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2155",
    "title": "A Classification Method for Japanese Signs Using Manual Motion Descriptions",
    "url": "https://aclweb.org/anthology/C94-2155",
    "year": 1994
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Ishii-maclii, Utsunomiya, 321, JAPAN arlachi(COgurn.inftirattsumnitiya-uatc..ip SUMMARY In this paper, we propose a classification method for signs in .fitprintsc ,Vign Latigurtyc (.1Sb).",
        "method is based on the similarity between meinnal naolzure dcscriptiow (NI NI Ds) of signs.",
        "MNLDs are the verbal descriptions of signs.",
        "The measure of similarity between MM Ds is derived from their longest CO111111011 (1,07;) of MN/ Ds.",
        "Ity computing Mature vectors of a properties from a finite set of NIM Ds and plotting them in the it-dimensional Euclidean space, t he similarity between signs can he regarded as an internal angle between the vectors.",
        "'rile result of 011r experiment is that the significant sign families can be obtained."
      ]
    },
    {
      "heading": "1. INTRODUCTION",
      "text": [
        "Stokoe (1960) is the first linguist, to deal with the structure of signs in the sanie way as that of oral words.",
        "Ile noted that there were three kinds of parameters in describing the sign in /I merican Language (t1S1,) as follows: (I) the location of Dm signs relative to the hotly, (2) the hand-shape of hands involved in articulating the sign and, (3) the movement of hands.",
        "Other linguists (Friedman 1977, Ilattison 1978) have claimed that a fourth parameter is obligatory, that is, the spatial orientation of the hands relative to the body.",
        "In ../apantsc ,5ign Language (..1S1.",
        "), a, few linguists (Tanokami 1979, [Crutch.",
        "1982) took the similar approaches.",
        "'I lots, WC need to specify the location, hand-shop(, moccmcni and orientation of the hands to describe the sign.",
        "Furthermore, it is interesting to note that a change in only one of the significant elements in hand-shape, location, orientation and /novel-tient often results in changing the meaning (ex., antonym, synonym).",
        "'Hie notation systems proposed by linguists can provide a very detailed and broader representation to describe signs.",
        "It is, however, not easy to transform the sign into the notation.",
        "For this reason, it is too cost to tol-lect, a large amount of sign data.",
        "Consider, for example, a minimal pair in the move-ulit as shown in Fig.i.",
        "It is clear that the minimal pair { (a.m.),",
        "(p.m.)} means the antonym semantically and represents the symmetry visually.",
        "'typical sign dictionary consists of illustrations or photographs and the verbal descriptions, we called the descriptions .manual motion tieseription8(MM Ps) represented as text, written in 11 at-u ral language.",
        "It, can be considered that a. MMD represents information extracted from a series of the manual motions of the, sign.",
        "II, is not difficult to find the symmetry of signs by the contrast between two MMDs.",
        "For example, the contrast of words (right) and (left) can be obtained Frain comparing MMDs of' Ilk (a.m.) with !lc ff.",
        ":I: (p.m.) as follows.",
        "444--0).A,-;■:-4;0-.: +to:.",
        "iffi (7)1M.",
        ":, - - t 4-191 We describe a. classification method for signs using mathematical techniques ['lased on the similarity between M M )s."
      ]
    },
    {
      "heading": "2. DATA STRUCTURES FOR MMDS",
      "text": [
        "This section describes the remarkable characteristics of MM1.)",
        "and a transformation method derived front them.",
        "The method means that MM Ds can he transformed into the a-dimensional feature vectors."
      ]
    },
    {
      "heading": "2.1 The Remarkable Characteristics of MMDs",
      "text": [
        "MMDs mean a kind of the verbal descriptions of the sign, which are written in Japanese language and has remarkable characteristics a.ti follows:",
        "• MM Ds have snore constraints on syntactic patterns and words than general Japanese sentences.",
        "In other words, there are some kind of syntactic patterns in MMDs.",
        "• In Japanese, synonyms are often marked with the common kaaji-characters.",
        "For example, each set of words .71 = CT, AT, 1,11 = { UM,",
        "A•.",
        ":P\"irA, 11-1•1t3, /1,M has a (70111111On posthx kanji-character or fifi and smite kinds of semantic groups are constructed by them such as",
        "'Chits, the combination of kotakcharacters means semantic concatenation.",
        "Sato (1992) has also pointed out them in his paper."
      ]
    },
    {
      "heading": "2.2 Transformation into Feature Vectors",
      "text": [
        "rib represent the distribution of words mathematically, it is convenient to considered as points in the n, dimensional Euclidean space.",
        "'Hie coordinates of points can be given as the n-dimensional feature vectors.",
        "Then, an internal angle between the vectors can be considered as the similarity between the words.",
        "In this case, properties of the feature vectors need to many points of view.",
        "(i.e., word frequency, part of speech, co-occurrence relation, and so on).",
        "In pattern recognitions, the same approaches have made use of recognizing pictures ;aid letters.",
        "Therefore, we also select.",
        "this approach which is signs are plotted in the ca-dimensional Euclidean space.",
        "feature vectors can be obtained by constructing a finite state automaton accepting MM Ds as follows.",
        "It is well mown that.",
        "finite state automata recognize finite state languages (see Aho,A.V., et, al.",
        "1971).",
        "If a class of patterns cmt be described in a finite state language, a finite state automaton can he constructed to recognize MMDs described this class of patterns.",
        "Let A=.(1.1.",
        ":0)0,[ri la, Li= bbl'' / and C1=11111T-V)I.M'k OW lie MM Ds.",
        "The finite state transition diagram of a automaton accepting the set, of MMD is shown in fig. 2.2.",
        "Each kanji- 07' kola character of I. he above regular expression can he considered as properties on the l'eatilre vectors for the sign.",
        "The feature vectors for the sign derived from MM Ds are shown in Table 1.",
        "Li hi Of 1' N 1s f# MI a 7,",
        "Thus, the signs can he represented as /4-dimensional feature vectors, which can he defined as Iva vectors [0,1].",
        "Furthermore, we can find a kind of syntactic pattern 0)- , where - means variables (noun,verb,.,.",
        "), and 0) (no) and (s o) mean case markers."
      ]
    },
    {
      "heading": "3. SIMILARITY BETWEEN SIGNS",
      "text": [
        "This sect ion describes how a similarity between signs is commuted.",
        "'Co compute similarity, we introduced loagc.s1-«)inalon-sab.sr ant au function (1,('S)."
      ]
    },
    {
      "heading": "3.1 Similarity betwecu MMDs",
      "text": [
        "The result of the previous discussions can be summarized as follows: 1.",
        "Siniilarily between two signs can he considered as similarity between two MMDs.",
        "2.",
        "When describing signs mathematically, it.",
        "is convenient comveuient to regard LIwitt as points or feature vectors in the n-ciiiiieirsional FAiclidean space.",
        "The similarity measure 1)etween two signs is considered as an angle of two vectors.",
        "3.",
        "If a finite state automata accepting N,IM1)s can he constructed, properties of feature vectors can be placed all characters constructing Mkt Ds.",
        "Let /1 = (0J,a2,...,a„) and H (b1,b2,...,b„) n-dimensional feature vectors of signs.",
        "Then, the similarity measure between signs, denoted by S(.4, can be defined as follows: it.y het weeu Feat lire Vectors",
        "where (A, 13) is Mc inacr ',radar/ or vectors A Fuld 13, and can be computed as follows:",
        "HAM' is 111.1, squared Pnclidcan norm of vector A and can be computed as follows: HAV (\\/(.1,,A)) - Namely, 1lAp can he computed as the sum of a; -= I in vector A.",
        "(A, 13) can be computed as the sum of ii A h, = 1 in feature vectors A and B. the feature vectors of Table 1 in the last, section.",
        "11,A112 can lie defined as a length of AIM]) related to vector A.",
        "In the same way, (A, H) call be defined as a length of a lonj«,.s1 COM7/10n subscquen cc of MMI)s related to vectors A and 13.",
        "We shall discuss it in detail."
      ]
    },
    {
      "heading": "3.2 Longest Common Sitbsequonco",
      "text": [
        "A subsequence of a given string is any string obtained by deleting zero or more symbols from the given string.",
        "A longest common subs(ptcnce (LCS) of two strings is a subsequence of both that is as long as any other common subsequence.",
        "An LCS means that the number of matching characters considering the character order constraint.",
        "For example, if X abcbdab arid Y bdcaba, then an LCS of X and Y is bcba, and has length 9 as shown in Fig.",
        ":i.",
        "The other 1,CS of X and Y are blab and hcab, and also have length 4.",
        "Let, A = aja2...a,„.",
        "and 11 = be sequences.",
        "For a given sequence X = rt.r2,...3:1, we define the ith prefix of X , for 0, I, ...,1, rr.",
        "For example, if X abrdc, then A.",
        "(.1bc and X0 is the empty sequence.",
        "'141111, an ICS of A and denote(' by 1,(,!S(.4, II), can be computed efficiently as the following recursive formula using Dynamic Programming (for further details of LCS, see Thomas II, et al. 1991).",
        "where c(1, j) is the length of an IPS of the sequences Ai and H,.",
        "If and/or j 0, then c(i, j) 0.",
        "The result of computing LCS is shown as follows.",
        "Formally, let, A = 1110.2 – am and B = b2...b„ be MMDs.",
        "Then, S(A, B) mentioned previously call be defined as follows:",
        "Thus, we need not to construct a finite slate an-tomation accepting a. set.",
        "of 1\\111414s and to transform front MMDs to feature vectors.",
        "Therefore, the similarity computation based on the LCS is simpler and easier than the computation between the vectors.",
        "13atagelj (1989) described that 5(A, /3) have to satisfy the following two conditions.",
        "1.",
        "S(A, 13) = 5(13 , A) 2.",
        "S(A, Ii) < S(A, A) or S(A,11) > 5(A, A)",
        "Obviously, the above similarity measure satisfies them."
      ]
    },
    {
      "heading": "3.3 An Experiment",
      "text": [
        "We now show results of an expel:in-amt and verify the similarity measure between signs.",
        "We used data in The IllusDaied Sign Dictionary (Marnyama.",
        "198,1) for the following reasons.",
        "We made use the simple description data (1,527 entries), which were rendered machine readable data.",
        "fly merging the same MMDs, in advance, 1,514 entries were obtained 1.",
        "For example, riff (name) and ) (badge) in Table 3 means SO`'lllfl i.e., used pattern matrhi 15 cnnunatnIs ark and sed on 3!N IX The results of an experiment say that the similarities of 36 pairs are greater than 0.8 and 570 pail's are greater than 0.5.",
        "Consider, for example, parts of the approximate similar pairs as shown in Table :1.",
        "A pair { 1,11',1((laughle:r), (son)) means the antonym and the other pair { ke' (sod), < (cry)} means the synonym.",
        "'Thus, these results means that, the members of a similar pair have the common semantic component.",
        "fit other words, by computing the similarity of' MIVID, minimal pairs of signs can la' obtained.",
        "The similarity of manual motions results in the similarity of meaning, which is a kind of sign formative units.",
        "That, is, a minimal pair and XJ: bare a common semantic component children of parents such as a motion a hand is moved the forward related to the body , and an individual semantic component the female or male sex such as using a little or thumb finger.",
        "are,, however, a few exceptions in the above ride.",
        "For example, each of a pair { 43V1(1!",
        ": (Yokohama), (smooth)} have different, meaning, but both oh them are derived from the same iconic motion of the object \"razors\".",
        "From the language pragmatics points of view, the important thing is that a meaning of signs changes in various context just as a meaning of a word \"spring\" changes in various context, The point we wish to emphasize is that compni"
      ]
    },
    {
      "heading": "4. A CLASSIFICATION METHOD",
      "text": []
    },
    {
      "heading": "4.1 Mathematical Notion",
      "text": [
        "Vor a finite set , a. hinary relation 14 X „V ) that is 9-cfle:em syninu Inc and fran,sili 17( is called alt equivalence raatio».",
        "For each element ,r iii X, we define a set /1„, which contains all the elements of ,V that are related to .r by the equivalence relation.",
        "Formally, = {yka,, c /1,.",
        "is clearly a subset.",
        "of X.",
        "The element .r is itself contained in A„ due to the reflexivity of It; because It is transitive and symmetric, each member of A„ is related to all the other members of A,.",
        "This set A,, is referred to as an equivalence class of /e( X, X) wilt' respect to The family of all such equivalence classes defined by the relation, which is usually denoted by X//e, forms a. partition on X."
      ]
    },
    {
      "heading": "4.2 A Classification Method",
      "text": [
        "We describe how clustering a given finite set of signs using the similarity measure proposed in Section 3.",
        "The similarity relation S(A, Ii) satisfies the following two conditions.",
        "• reflexive: S( .1, A) I • symmetric: ,H'(A, H) S( I if)",
        "5(.1, however, doesn't satisfy the transitive condition.",
        "Then, we introduce the followinginequality.",
        "The similarity relation , X) can be represented as the following similarity matrix S.",
        "T can he transformed into the other matrix by a matrix sorting operation which rearrange the attributes according to their correlation coefficients.",
        "Thus, a set, of the sign can he classified using the partition induced by the equivalence relation 7',, with the appropriate threshold o ( o 0 ).",
        "(lonsequently, for every monotonically decreasing finite sequences of thresholds ( I > eel > a2 > > ak > 0 ), the t.-level hierarchy clusters in the form of a den-drograin can be obtained as shown in rig 5.",
        "However, to construct the dendrogram is not.",
        "our present purpose.",
        "The reason is that the similarity measure S(A, 13) has a feature of the curve cost 0.",
        "That is, as the similarities",
        "are close the maximum ( 13) = 1 ), gains of noise factor (i.e., inflection ) can be ignored.",
        "Therefore, The low-level clusters ( < 0.5 ) are not, necessary for our purpose.",
        "We want to find the significant sign families than to obtain hierarchy structures.",
        "Fig 5: '.1.1e k-level hierarchy clusters: tic ndrograni"
      ]
    },
    {
      "heading": "4.3 An Experiment",
      "text": [
        "To rnake discussions simpler, we used the sample data, of MMI)s (129 entries) including two keywords (characters) of [11 (month) 71 entries and J7.1• (lips) 58 entries; because, a. word can be identified with a word id in Japanese language.",
        "We wanted to obtain the results from extracting sign families rather than to obtain the hierarchy structure or the form of a dendrogram.",
        "The purpose of classifications is to focus on the minimal pairs of signs.",
        "By merging the identical data that means B) 1, 129 entries are merged into 101 entries.",
        "The total amount of sign pairs satisfying S(A, 13) > 0.6 are 25 pairs, and a 31 x 31 similarity matrix is obtained.",
        "Then, the similarity matrix is transformed into a transitive matrix, and the equivalence classes can he obtained as shown in Table 6.",
        "We classified given signs (129 entries) into 11 clusters and found that the largest amount of sign family is A: (ItE1))-family as follows: 23 entries : eb (red), 11 (strawberry), (heredity), fl11 H (Sunday), 'Mil (fire), AA (express), I) (apple), 11`11A (blood), and so on.",
        "This sign family has an essential comnion NINID \" -4f T-0.-).A.A4li\"k <\" and motion in Fig.7, and has semantic component \"red\".",
        "That is, .411./: (heredity) derived from \"blood\", I hl (Sunday) derived from the red numeric in the calendar, and AA (express) derived from the red-stamp on the letter, and so on.",
        "Consider, for example, a. family of signs { ,117 ,V(;)':- } means {sally, Worcester – sauce ,peper, red – paper, astri?tgent).",
        "The family has an essential common semantic component, which means \"not sweet\" represented as crooking all of fingers.",
        "The difference of a pair( (salty), .61-1' (astringent,) ) is whether to be rotated or up ;mil down.",
        "or the sign family can be retrieved by computing the similarity among a given MID and M NiDs of signs in Shall."
      ]
    },
    {
      "heading": "ACKNOWLEDGMENTS",
      "text": [
        "We would like to thank to Dr.'l'akeslii Kumagai for reading the manuscript awl making a number of helpful suggestions.",
        "We special thanks are due to ti publisher lil(-Dainanaikku Sera2J: for permission to reproduce illustrations in ///mstrated Sign Dictionary [10]."
      ]
    },
    {
      "heading": "REFERENCE",
      "text": []
    },
    {
      "heading": "5. CONCLUDING REMARKS",
      "text": [
        "We have proposed a new classification method for signs ill .ISL.",
        "The method is based on tile similarity between the verbal descriptions of signs, called Manual Alotion Description (NI MI)).",
        "The similarity of signs can be considered as au internal angle between feature vectors represented as points in the rt.-dimensional Euclidean space.",
        "By computing feature vectors of Tt properties from NINIDs and plotting them in the ?I-dimensional Euclidean space, an between two vectors call be considered as the, similarity between the two signs.",
        "As a classification method, we have introduced a finite set of signs divided into equivalence classes on the equivalence relation with the k level.",
        "As further research directions, we will apply this similarity measure to the retrieval of the similar signs in Sign.",
        "Electronic Dictionary (SEI)).",
        "When we look at an unknown sign, if the sign motion image can be represented using tile form of NIN11.",
        ")s, the hest matched sign"
      ]
    },
    {
      "heading": "Speech & Phonology",
      "text": []
    }
  ]
}
