{
  "info": {
    "authors": [
      "Evelyne Tzoukermann"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2157",
    "title": "Issues in Text-To-Speech for French",
    "url": "https://aclweb.org/anthology/C94-2157",
    "year": 1994
  },
  "references": [
    "acl-C90-3049"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper reports the progress of the French text-to-speech system being developed at AT&T Bell Laboratories as part of a larger project for multilingual text-to-speech systems, including languages such as Spanish, Italian, German, Russian, and Chinese.",
        "These systems, based on diphone and triphone concatenation, follow the general framework of the Bell Laboratories English TTS system [?",
        "], [?].",
        "This paper provides a description of the approach, the current status of the French text-to-speech project, and some problems particular to French."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In this paper, the new French text-to-speech system being developed at AT&T is presented; several steps have been already achieved while others are still in progress.",
        "First we present a brief description of the phonetic inventory of French, with a discussion of the approach used to select and segment phonetic units for the system.",
        "Methods for automatic segmentation, and for the choice of diphone and triphone units are presented.",
        "Some comments on durational and prosodic issues follow.",
        "We conclude with some discussions on directions for future improvement, including morphological analysis, part-of-speech tagging, and partial phrasal analysis for the purpose of phrasal grouping."
      ]
    },
    {
      "heading": "2 Phonetic Description of French",
      "text": [
        "The French phonetic system consists of 36 phonemes, including 17 consonants, 16 vowels, and 3 semi-vowels.",
        "Table 1 shows the different phonemes; the IPA column contains the phonemes in the standard International Phonetic Alphabet; the second column ASCII shows the ascii correspondence of these characters for the text-to-speech system, and the third column shows an example of the phoneme in a French word.",
        "Consonants Vowels IPA ASCII WORD IPA ASCII WORD P p paix i i vive t t tout e e the k k case E wise b b bas a a table d d dos a a \"Arne g g gai 3 > hornme m m mais o 0 tot n Il non u U hone ,p N gagner y y MID' 1 1 Lyre 0 u eux f f faux ee U_ seul s s si a & peser f S chanter 1 I balm v v vive S A. bane z z zero 1 0 bon li Z jupe lee I brun r r rare a A samedi",
        "For the French text-to-speech synthesis system we use 35 phonemes, consisting of 17 consonants, 15 vowels (and not 16 like in the IPA column), and 3 semi-vowels.",
        "As shown in Table 1, the fourth nasal /6e/ has been removed, /di and /el being represented by the single phoneme /1/.",
        "The reasons for this change are that (1) /dr.'\" tends to be assimilated to the phoneme /1/, and (2) this nasal vowel occurs in very few words in French.",
        "Thus,",
        "it could be said that functionally the distinction between /dri/ and /e/ is minimal.",
        "French also contains two phonemes for the character \"a\", /a/ and /o/ , the first one being a front unrounded vowel and the second one a back rounded vowel.",
        "A small 1111nd/el' or French speakers make this production and perceptual distinction; in addition, today's tendency shows a disappearance of this phonemic disctinction.",
        "Therefore, only /a/, the most common phoneme of the two, was retained for synthesis.",
        "Notice that two different \"schwas\" (or mute e), marked as I kJ and /A/ were retained for synthesis; since schwa in spoken French can be, in some cases, present or not, depending on the level of formality of language - it is useful t,o have two different signs to account, for this option.",
        "In addition, the grapheme-to-phoneme system used in the French 'ITS system and described in Section ?",
        "?, is equipped with the capability of including or not, the schwa depending on the level of language.",
        "For example, the sentence \";e m'en vais samedi\", I am leaving on saturday, can be said either /3o rna ye samodi/ or, more colloquially, /3mi'ilt VE samdi/ , depending on whether the schwa is reduced or not.",
        "In our system, the sentence will be transcribed /3A non va samAdi/, A accounting for the trace of the schwa.",
        "An additional character \"*\" , was used to represent silences at, the beginning and end of words.",
        "french phonemes can also he viewed according to their spectral variability in the context, of other phonemes.",
        "It is known that French vowels show spectral stability and low contextual variability [7], [7].",
        "The voiceless fricatives show somewhat, less spectral stability, then the plosives.",
        "The nasals and voiced fricatives present even less stability.",
        "Liquids (/1/ and/r/) and semi-vowels (/j/, /w/, /5/) are the phonemes showing high variability and this poses problems in diphone based synthesis [7].",
        "Liquids are very sensitive to their context; formant structures show substantial el leas of coarticulation.",
        "As for the seine vowels, is difficult to capture the zone of spectral stability.",
        "For these reasons, some researchers, e.g.",
        "[?",
        "], organize phonemic classification using the criteria of the stable vs unstable phoneme rather than place of articulation.",
        "Similar to the approach in the English system, synthesis for French is done using prestored units.",
        "Within this framework, there are various strategies for the collection of units, units that will then constitute the dictionary of polyphones.",
        "Due t,o the continual aspect of the speech signal and the fact that the nature of phonemes is greatly modified in the context, of other phonemes, synthesizing separate phonemes cannot capture articulatory aspects of the language.",
        "Additionally, transitions are harder to model than steady states.",
        "Thus, diphones are the standard minimal units in segmental synthesis.",
        "From an acoustic standpoint, a diphone can be seen as a signal passing from the central part of a phoneme to the central part of the subsequent Phoneme; in other words, it is a unit, composed of two half phonemes.",
        "At a segmental level, one can think of a di phone as a stored length of speech that, goes from near the target of one phoneme and extends to near the target, of the following one, in other word the transition [7].",
        "The earliest diphone system was described by Peterson et, id [7]; other diphone approaches have been reported by [7], [7], [7], and [7].",
        "Although there are only about 40 phonemes in English about, 1600 diphones suffice for synthesis.",
        "Nevertheless, becatise of numerous allophones and the fact that sonic diphones are not really context-free, researchers like Peterson suggest, that about, 8000 diohorws are needed for high quality diphone synthesis.",
        "Moreover, the vowel dipht.ongs in English could be treated as peudo-diphones.",
        "Early French synthesis systems [7] relied also on synthesis by diphones except, for the diphone [qi] that, is integrated in a triplionic group.",
        "This phonemic pair was stored differently because of its high frequency in French in occurrences such as \"hut\" him/her.",
        "In more recent work, systems contain diphones and larger units, such as triphones, quadriphones, and even quintophones [7] [7], in order to capture coarticulatiory phenomena of a longer domain that.",
        "would not be adequately modeled in a strictly di-phonic system.",
        "In the current system, the diphone inventory for French was built by taking 352 phonemic pairs, that is 1225 units.",
        "Added to that was the silence symbol in initial and final position, which adds another 70 phonemic pairs.",
        "From this initial set, the pairs of semi-vowels were removed.",
        "All the other combinations were kept.",
        "Even though all of them do not occur in French lexical structure, they can still appear in the inter-word boundaries.",
        "For example, the sequence /Ir/ is not permitted word internally, but must, be handled since it, appears in the interword assimilation in /vat de/ \"valent Tien\" cost nothing.",
        "This is particularly important in French since inter-word liaison is common as in /el z 5/ \"elks out\" they have vs /el s5/ \"elles soot,\" they arc, where the final consonant /s/ either undergoes haison with the vowel /5/ resulting in /z/, or undergoes linking with the consonant /s/",
        "resulting in the devoiced sibilant,"
      ]
    },
    {
      "heading": "2.1 Diphone Structure and Selection of Carrier Word 2.1.1 Structure of Diphones",
      "text": [
        "This section discusses the nature of the diphone set and the manner in which diphones were collected.",
        "Diphones are structured as follows: *V, *C, V*, C*, CV, VC, CC, VV where * is a silence, C a consonant, and V a vowel.",
        "Semi-vowels were treated in the same fashion as consonants.",
        "Diphones were recorded following two different strategies: the first one consisted of picking existing words from a dictionary list, The second consisted of deciding on a neutral phonetic context in using logatomes or non-existing words.",
        "Logatomes are phonotactiically well-formed strings, which do not exist as words in the current French language,"
      ]
    },
    {
      "heading": "2.1.2 Selection of existing words from machine-readable dictionary",
      "text": [
        "A word list was extracted from a subset of the Robert French dictionary [7] and the pronunciation fields were extracted.",
        "The dictionary contains almost 89,000 entries, of which 85,796 entries con-Lain a headword, a phonemic transcription, and a part of speech.",
        "The remaining entries are prefixes and suffixes.",
        "The first task consisted of converting and mapping the dictionary phonemic symbols to the ones adopted in our system (shown in table 1).",
        "This was riot straightforward since there was not always a one-to-one mapping between the two sets.",
        "For handling symbol mapping, a program was written that converts any set of characters to any other set of characters 1.",
        "The program is developed so that characters coded in octal or d.ecimal code not only can be translated in either code, but also can be input in ascii format for being converted 2.",
        "Quite often, there was more than one pronunciation in the phonetic field and the pattern matching program chose the pronunciation corresponding to the one required.",
        "Moreover, dictionary pro-I am very grateful to Mike Tanenblatt who wrote this program and made a succession of changes until complete flexibility of character conversion was obtained.",
        "2 This tool allowed the conversion of databases originally written on Macintosh, PC, or Unix, Additionally, we used it to convert all the French textual databases into latinl 8 bit encoding format.",
        "nounciation fields are often not phonetically fine-grained enough for acceptable speech output (see [7] for a discussion on machine-readable dictionaries in text-to-speech systems).",
        "Finally, due to the lack of explicit inflectional information for nouns and adjectives, only the non-inflected forms of the entries were extracted during dictionary lookup.",
        "Similarly for verbs, only the infinitival forms were used since the dictionary does not list the inflected forms as headwords.",
        "A program was written to search through the dictionary pronunciation field and select the longest word where the phoneme pairs would be in mid-syllable position in order to avoid the extraction of phonemes occuring at the beginning or end of words.",
        "In this way, the influence of lexical stress was reduced.",
        "The orthography/pronunciation pair [headword_orth, head-word_phon] was extracted and headword_orth was placed in a carrier sentence for recording.",
        "Out of 1225 original phonemic pairs, 874 words were found with at least one occurence of the pair.",
        "Because 1225 is the number of all phonemic pairs in French whether they are allowed or not, it is interesting to notice that only 874 pairs occur within real words in the Robert dictionary."
      ]
    },
    {
      "heading": "2.1.3 Selection of logatomes",
      "text": [
        "For the logatoutes, two plionein /a/ and /t/ were used to encompass the selected diphone, since they appear to be fairly stable from a phonetic-acoustic standpoint.",
        "In order to balance the alternation of vowel and consonant, the words were constructed as follows:",
        "All strings were generated in this way, even if they were riot phonotactically well-formed for isolated words in the language.",
        "Nonetheless, these forms were generated and used since they were necessary for interword phenomena.",
        "Approximately 1225 words were constructed following the above model.",
        "Researchers disagree as to whether to use logatomes or real words for synthesis.",
        "The argument for using logatomes is that it is better to collect non-real words so that the diplione is recorded as neutrally as possible and does not int, dergo any real word stress.",
        "Those against argue that the diplione is over-articulated in a logatome environment and that it reduces the naturalness of the synthesized speech.",
        "The choice is more complex in the sense that it greatly depends on the speaker, the articulation, and the comfort in reading the two different sets.",
        "Given the controversy, in the present system, we decided to record the phonemic pairs in both environments, so that we could choose the best ones."
      ]
    },
    {
      "heading": "2.2 The other polyphonic units",
      "text": [
        "Due to the variability of liquids and semi-vowels, synthesis based only err diphones will not give good results.",
        "Indeed, such systems have proven to be insufficient.",
        "Researchers [7] argue that diphone concatenation alone is not adequate or sufficient, particularly for complex transitions.",
        "[7] claims that \"ideal diphones with perfect concatenation would give imperfect results\".",
        "Complex polyphones are not equivalent to concatenated diphones.",
        "Therefore, longer concatenative units are necessary.",
        "Polyphones are defined by ['?]",
        "as being a segmental unit where the initial and final phoneme are not subject to variability, thus, excluding liquids and semi-vowels.",
        "The strategy chosen in the French systetn relies on some phonetic generalities to build a set of triphones.",
        "It was decided 3 to form a class of triphones, based on the following transition: PVC, , where P is a phoneme, V a vowel, and a consonant representative of are articulatory locations, i.e. one velar, one dental, and one nasal.",
        "The set consisted then of 35 phones x 14 vowels x 3 consonants = 1470 triphones.",
        "The same methodology used for building the set of diphones was used for the triphones.",
        "These were included in a carrier word for the logatomes and extracted from the dictionary for the real words.",
        "Researchers disagree on which criteria are best.",
        "for the selection of triphones; should the selection rely on phonectic-acoustic evidence, or on statistical evidence related to the frequency of occurrence of triphones in the language?",
        "Then, once the criteria is defined, which triplicities should be selected?",
        "Can candidates of a class (say the phoneme /p/ 'personal communication with Joe Olive representing all the stops, the phoneme /v/ representing all the fricatives) he picked to represent a class or should all the phonemes belonging to the class be selected?",
        "Research is underway in this area using a phoneme clustering approach [?",
        "], [?]",
        "that allows the selection of segmental units from a database of phonemes containing several instances of the same phoneme.",
        "The extraction is made at a spectral point COMI-11011 to the phonemes.",
        "Finally, because tile number of selected units affects results, the choice of polyphones must be made with care.",
        "Taking into account the size limitation, one has to balance out the choice of the polyphones considering its frequency in the language.",
        "This brings in the additional complexity of corpus selection (its language properties, dialects, sociolinguistic type of language, topic., and size), [?]",
        "applies a series of rules on phoneme combination to exclude inter-word concatenation that would not occur in French.",
        "For example, one cannot find a glide in French that is not in the left or right context of a vowel; therefore, the combination consonant-glide-consonant is excluded.",
        "An optimal set of polyphone combinations is computed that reaches a number of 7725 units.",
        "Calculated from texts, statistics are then run on these units to determine the most frequent occurences in French, and the number of units is lowered to 3000.",
        "It remains to be seen whether this approach is successfull in a working system."
      ]
    },
    {
      "heading": "2.3 Construction of the corpus",
      "text": [
        "A carrier sentence \"C'est ARRIMR_WORD que je dis\" was selected to fulfill the following requirements:",
        "• short sentence to record, • ability to surround are carrier word to avoid sentential accent and effects, • phonetically neutral environment."
      ]
    },
    {
      "heading": "2.4 Choice of a Speaker",
      "text": [
        "Five male native speakers of Continental French were interviewed for selecting the voice of' the French synthesizer.",
        "A sample of text representing highly occuring graphemic trigrains was prepared to be used in this task.",
        "The corpus was run through a greedy algorithm 4 that returned the most frequent words within their sentences 'Thanks to Jan Van Santen for developing and running his greedy algorithm.",
        "along with a measure corresponding to the coverage of the graphemic triphone.",
        "Once the sample was recorded by the 5 speakers, the natural voices were run through LPG' analysis and resynthesized in order to judge the resistance of the voice to synthesis.",
        "Five subjects were asked to give their judgement on the following criteria:",
        "1. clear articulation: the voice was carefully listened to evaluate the articulation of the speaker.",
        "Subjective perceptual judgements were made.",
        "2. neutral French accent: the candidate was",
        "asked about the areas of France where he grew up.",
        "The central area of France \"l'Ile de France\" is known for its neutral accent and is regarded as being a well-received accent.",
        "Additionally, for French native speakers residing in the USA, particular attention was paid to the influence of English in the pronunciation of French, especially for English borrowings, such as for example, the company name AT&T to be pronounced /a to te/ (the French way) and not /ei t n t/ as in English.",
        "3. regularity: special attention was given to ensure that the speaker would have a reasonable degree of regularity in uttering French phonemes.",
        "4. pleasantness of the voice: the subjects doing the evaluation were asked to give their opinion on the pleasantness of the voice, in particular the timber, the level of nasality, and the intonation.",
        "Of course, this is a highly subjective matter but a critical one for success."
      ]
    },
    {
      "heading": "2.5 Recording Conditions",
      "text": [
        "The recording was done on four non-consecutive days under the following conditions.",
        "The sentences were recorded directly onto the computer through a DAT (Digital audio Tape) tape recorder, using interactive software allowing easy reading and repetition of the sentences to be recorded.",
        "Additional time was devoted to the recording of triphones as well as the rerecording of sentences that were improperly uttered.",
        "The same carrier sentence and a regular prosodic context was carefully maintained so that there was minimal suprasegmental variation.",
        "Once the recording was done, the 48 kHz digitized acoustic signal was downsized to 12 kHz."
      ]
    },
    {
      "heading": "2.6 Transcription of recording material",
      "text": [
        "For the recording, all sentences were transcribed from the phonetic alphabet to an orthographic format.",
        "This was done to allow the speaker to utter sentences with more naturalness.",
        "Once the recording was done, the sentences were semi-automatically re-transcribed into phonetic form.",
        "For sonic utterances, the phonetic transcription was manually adjusted to the idiosyncrasies of the speaker.",
        "For example, it often happened that confusion arises between open and closed vowels, such in the itord \"zoologique\" zoological that can he pronounced either /zoolo3ik/ or /zazlo3ik/.",
        "In case the output was /zoolo3ik/ instead of the expected /z.",
        ")91o3ik/, the transcription was readjusted."
      ]
    },
    {
      "heading": "2.7 Segmentation",
      "text": [
        "Segmentation is presently in progress; efforts are being pursued to adapt an automatic segmentor for English to French and other languages.",
        "En the meantime, manual segmentation is being done as a pilot experiment in order to check the accuracy of automatic segmentation.",
        "Beyond the scope of this paper are many complex issues raised in segmenting French, such as the segmentation of semivowels (/j/, /w/, and /4/) and liquids (/1/ and /r/), each of these phonemes being quite unstable from a phonetic-acoustic standpoint.",
        "These issues will be addressed in future work."
      ]
    },
    {
      "heading": "2.8 Integration of an orthographic transcriber",
      "text": [
        "A grapheme-to-phoneme transcriber [?]",
        "was acquired to convert French orthography to a phonemic representation.",
        "The software performs some syntactic and partial semantic analysis of the sentence in order to disambiguate the input string.",
        "Once performed, spellings are converted in a series of steps into a phonemic representation."
      ]
    },
    {
      "heading": "3 Issues in Text Analysis",
      "text": [
        "We have pursued work in the text analysis of French in order to obtain linguistic data for intonation and prosody; additionally, the output of the work will be used in the translation project.",
        "This aspect of the work has entailed several points:",
        "• acquisition of a large French dictionary: Robert Encyclopedic dictionary (containing",
        "over 85k entries, 80k articles, 160k citations, analogical terms (synonyms, ho-momyins, etc), and conjugation tables for most French verbs).",
        "• collection of French corpora: French news from LE MONDE [7]",
        "- French news daily compiled by the French embassy in Washington DC (24657K bytes are now encoded, and a monthly update is being done).",
        "The data are in ascii and accents were restored using one of the features of the grapheme-to-phoneme software.",
        "Another program was written to automatically clean and nortualize these email format data.",
        "extraction of some of the Hobert dictionary databases: the 160,000 citations from literary French authors are being extracted so that they can constitute some relevant corpus data.",
        "A framework is being worked out, so that citation author can be retrieved on an optional basis.",
        "• encoding of French data using the already existing scheme developed by [7] and enhanced by [7].",
        "This scheme allows the use of the concordance program.",
        "As English data are en",
        "coded in 7 bit characters, an 8 bit encoding format was worked out to allow the retrieval of French text with accents 5.",
        "For example, the unaccented word \"cote\" in French can be several words: \"cote\" with no accent meaning quotation, rating, \"cote\" meaning roast, and \"cote\" meaning side all these translations being also valid in tile figurative sense.",
        "Thus, a latinl compatible window would display French corpora with accents; in the following example, the program returns all in-tames of the word \"cote\" (quotation, rating) in the database \"Le Monde\".",
        "The query to the system will retrieve all the French sentences where the exact match to the characters \"cote\" will occur, and neither of the other spelling: The query producing table 77 returned information of \"Le Monde\" only, as requested.",
        "In specifying \"FREN\" for French, the following query in 'fable 7?",
        "returns all instances of",
        "the database \"Le Monde\" the word \"cote\" in the three French corpora.",
        "Moreover, the \"-i\" option allows the retrieval of all instances of a word with or without accent, therefore the three trench words \"cote\", \"ceite\", and \"cote\" .",
        "For more information on the use of the concordance tools, refer to [7].",
        "• development of a Morphological analyzer and generator for French, using finite-state transducer: the system is built with an approach similar to the one for Spanish [7]; it is mainly based on the headwords of the Robert dictionary.",
        "• accent filters: conversion tables are still being produced at each time a new database arrives that is riot in a compatible form."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "The French '1\"1:S system is part of a large project of multilingual text-to-speech synthesis in progress at ATWIl Hell Laboratories.",
        "Speech synthesis for French brings a variety of challenges, some of which are specific to French, such as nasalization, liaison, schwa realization, etc.",
        "and some of which are more general issues, such as vowel lengthening, prosodic contouring, and intonation.",
        "Several systems are in experimental stages for other languages, such as Spanish (Castilian as well as South American), Italian, Chinese, Navajo, German, and Russian.",
        "Once Continental FFrench is completed,",
        "we also intend to build a TTS system for Canadian French."
      ]
    }
  ]
}
