{
  "info": {
    "authors": [
      "Sergei Nirenburg",
      "Robert E. Frederking"
    ],
    "book": "Human Language Technology Conference",
    "id": "acl-H94-1026",
    "title": "Toward Multi-Engine Machine Translation",
    "url": "https://aclweb.org/anthology/H94-1026",
    "year": 1994
  },
  "references": [
    "acl-E93-1062",
    "acl-H93-1038"
  ],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "Current MT systems, whatever translation method they at present employ, do not reach an optimum output on free text.",
        "Our hypothesis for the experiment reported in this paper is that if an MT environment can use the best results from a variety of MT systems working simultaneously on the same text, the overall quality will improve.",
        "Using this novel approach to MT in the latest version of the Pangloss MT project, we submit an input text to a battery of machine translation systems (engines), collect their (possibly, incomplete) results in a joint chart-like data structure and select the overall best translation using a set of simple heuristics.",
        "This paper describes the simple mechanism we use for combining the findings of the various translation engines."
      ]
    },
    {
      "heading": "1. INTRODUCTION",
      "text": [
        "A number of proposals have come up in recent years for hybridization of MT.",
        "Current MT projects – both \"pure\" and hybrid, both predominantly technology-oriented and research-oriented are single-engine projects, capable of one particular type of source text analysis, one particular method of finding target language correspondences for source language elements and one prescribed method of generating the target language text.",
        "It is common knowledge that MT systems, whatever translation method they at present employ, do not reach an optimum output on free text.",
        "In part, this is due to the inherent problems of a particular method – for instance, the inability of statistics-based MT to take into account long-distance dependencies or the reliance of most transfer-oriented MT systems on similarities in syntactic structures of the source and the target languages.",
        "Another crucial source of deficiencies is the size and quality of the static knowledge sources underlying the various MT systems – particular grammars, lexicons and world models.",
        "Thus, in knowledge-based MT the size of the underlying world model is typically smaller than necessary for secure coverage of free text.",
        "Our hypothesis for the experiment reported in this paper is that if an MT environment can use the best results from a variety of MT systems working simultaneously on the same text, the overall quality will improve.",
        "Using this novel approach to MT in the latest version of the Pangloss MT project, we submit an input text to a battery of machine translation systems (engines), collect their (possibly, incomplete) results in a joint chart-like data structure and select the overall best translation using a set of simple heuristics."
      ]
    },
    {
      "heading": "2. INTEGRATING MULTI-ENGINE OUTPUT",
      "text": [
        "The MT configuration in our experiment used three MT engines:",
        "• a knowledge-based MT (KBMT) system, the mainline Pangloss engine[1]; • an example-based MT (EBMT) system (see [2, 3]; the original idea is due to Nagao[4J); and • a lexical transfer system, fortified with morphological analysis and synthesis modules and relying on a number of databases – a machine-readable dictionary (the Collins Spanish/English), the lexicons used by the KBMT modules, a large set of user-generated bilingual glossaries as well as a gazetteer and a list of proper and organization names.",
        "The results (target language words and phrases) were recorded in a chart whose initial edges corresponded to words in the source language input.",
        "As a result of the operation of each of the MT engines, new edges were added to the chart, each labeled with the translation of a segment of the input string and indexed by this segment's beginning and end positions.",
        "The KBMT and EBMT engines also carried a quality score for each output element.",
        "Figure 1 presents a general view of the operation of our multi-engine MT",
        "In what follows we illustrate the behavior of the system using the example Spanish sentence: Al momento de su yenta a Iberia, VIASA contaba con ocho aviones, que tertian en promedio 13 wios de vuelo which can be translated into English as At the moment of its sale to Iberia, VIASA had eight airplanes, which had on average thirteen years of flight (time).",
        "This is a sentence from one of the 1993 ARPA MT evaluation texts.",
        "The initial collection of candidate partial translations placed in the chart for this sentence by each individual engine are shown in Figures 2, 3, 4, 5, and 6.",
        "The chart manager selects the overall best cover from this collection of candidate partial translations by providing each edge with a normalized positive quality score (larger being better), and then selecting the best combination of edges with the help of the chart-walk algorithm."
      ]
    },
    {
      "heading": "2.1. Scoring the outputs of MT engines",
      "text": [
        "The scores in the chart are normalized to reflect the empirically derived expectation of the relative quality of output produced by a particular engine.",
        "In the case of KBMT and EBMT, the preexisting scores are modified, while edges from other engines receive scores determined by a constant for each engine.",
        "These modifications can include any calculation which can be made with information available from the edge.",
        "For example, currently the KBMT scores are reduced by a constant, except for known erroneous output, which has its score set to zero.",
        "The EBMT scores initially range from 0 being perfect to 10,000 being totally bad; but the quality is nonlinear.",
        "So a region selected by two cutoff constants is converted by a simple linear equation into scores ranging from zero In every case, the base score produced by the scoring functions is multiplied by the length of the candidate in words, on the assumption that longer items are better.",
        "This may be producing too large an effect on the chart-walk.",
        "We intend to test functions other than multiplication in order to find the right level of influence for length.",
        "The scoring functions represent all of the chart manager's knowledge about relative quality of edges.",
        "Once the edges are scored, the cover is produced using a simple dynamic programming algorithm, described below."
      ]
    },
    {
      "heading": "2.2. The chart-walk algorithm",
      "text": [
        "Figure 7 presents the chart-walk algorithm used to produce a single, best, non-overlapping, contiguous combination of the available component translations.",
        "The algorithm uses dynamic programming to find the optimal cover (a cover with the best cumulative score), assuming correct component quality scores.",
        "The code is organized as a recursive divide-and-conquer procedure: for each position within a segment, the sentence is split into two parts, the best possible cover for each part is recursively found, and the two scores are combined to give a score for the chart-walk containing the two best subwalks.",
        "This primitive step is repeated for each possible top-level split of the input sentence, compared with each other and with any simple edges (from the chart) spanning the segment, and the overall best result is used.",
        "Without dynamic programming, this would have a combinatorial time complexity.",
        "Dynamic programming utilizes a large array to store partial results, so that the best cover of any given subsequence is only computed once; the second time that a recursive call would compute the same result, it is retrieved from the array instead.",
        "This reduces the time complexity to polynomial, and in practice it uses an",
        "Position Input Output Left Right (Spanish) (English) 0 0 Al \"To the\" \"To it\" \"To him\" \"To you\" 1 1 momento moment instant time \"just a moment!\" \"in due time\" \"in due course\" \"when the time is right\" momentum consequence importance 2 2 de of from about for by 3 3 suits his her one's your their 4 4 yenta sale selling marketing country inn small shop stall booth",
        "21 21 vuelo flight \"to dash off\" \"to clear off\" \"to leave the parental nest\" \"spread one's wings\" \"to overhear sth in passing\" \"to catch on immediately\" \"get it at once\" \"to be pretty smart\" 'flight feathers\"",
        "insignificant part of total processing time.",
        "The combined score for a sequence of edges is the weighted average of their individual scores.",
        "Weighting by length is necessary so that the same edges, when combined in a different order, produce the same combined scores.",
        "In other words, whether edges a, b, and c are combined as ((a b) c) or (a (b c)), the combined edge must have the same score, or the algorithm can produce inconsistent results.",
        "The chart-walk algorithm can also be visualized as a task of filling a two-dimensional array.",
        "The array for our example sentence is shown in Figure 8.",
        "Element (ij) of the array is the best score for any set of edges covering the input from word i to word j.",
        "(The associated list of edges is not shown, for readability.)",
        "For any position, the score is To find best walk on a segment: if there is a stored result for this segment then return it else begin get all primitive edges for this segment for each position p within this segment begin split segment into two parts at p find best walk for first part find best walk for second part combine into an edge end find maximum score over all primitive and combined edges store and return it",
        "calculated as a weighted average of the scores in the row to its left, in the column below it and the previous contents of the array cell for its position.",
        "So to calculate element (1,4), we compare the combined scores of the best walks over (1,1) and (2,4), (1,2) and (3,4), and (1,3) and (4,4) with the scores of any chart edges going from 1 to 4, and take the maximum.",
        "When the score in the top-right corner is produced, the algorithm is finished, and the associated set of edges is the final chart-walk result.",
        "It may seem that the scores should increase towards the top-right corner.",
        "In our experiment, however, this has not generally been the case.",
        "Indeed, the system suggested a number of high-scoring short edges, but many low-scoring edges had to be included to span the entire input.",
        "Since the score is a weighted average, these low-scoring edges pull it down.",
        "A clear example can be seen at position (18,18), which has a score of 15.",
        "The scores above and to its right each average this 15 with a 5, for total values of 10.0, and the score continues to decrease with distance from this point as one moves towards the final score, which does include (18,18) in the cover."
      ]
    },
    {
      "heading": "2.3. Reordering components",
      "text": [
        "The chart-oriented integration of MT engines does not easily support deviations from the linear order of the source text elements, as when discontinuous constituents translate contiguous strings or in the case of cross-segmental substring order differences.",
        "Following a venerable tradition in MT, we used a target language-dependent set of postprocessing rules to alleviate this problem (e.g., by switching the order of adjectives and nouns in a noun phrase if it was produced by the word-for-word engine)."
      ]
    },
    {
      "heading": "3. TRANSLATION DELIVERY SYSTEM",
      "text": [
        "Results of multi-engine MT were fed in our experiment into a translator's workstation (TWS)[5], through which a translator either approved the system's output or modified it.",
        "The main option for human interaction in TWS currently is the Component Machine-Aided Translation (CMAT) editor[6].",
        "A view of this editor is presented in Figure 9.",
        "(The user can see the original source language text in another editor window.)",
        "The user can use menus, function keys and mouse clicks to change the system's initially chosen candidate trans",
        "lation string, as well as perform both regular and enhanced editing actions.",
        "The phrases marked by double angle brackets are \"components\", each of which is the first translation from a candidate chosen by the chart-walk.",
        "In the typical editing action shown, the user has clicked on a component to get the main CMAT menu.",
        "This menu shows the corresponding source text, and provides several functions (such as moving or deleting the whole constituent) and alternate translations, followed by the original source text as an option.",
        "If the user selects an alternate translation, it instantly replaces the component in the editor window, which becomes the first alternative in this menu if it is used again.",
        "The alternate translations are the other translations from the chosen edger .",
        "Figure 10 presents the sets of candidates in the best chart-walk that are presented as choices to the human user through the CMAT editor in our example.",
        "It also shows their individual engine-level quality scores."
      ]
    },
    {
      "heading": "4. TESTING AND EVALUATING MULTI-ENGINE PERFORMANCE",
      "text": [
        "As a development tool, it is useful to have an automatic testing procedure that would assess the utility of the multi-engine system relative to the engines taken separately.",
        "The best method we could come up with was counting the number of keystrokes, in an advanced text processor, such as the TWS, necessary to convert the outputs of individual engines and the multi-engine configuration to a \"canonical\" human translation.",
        "A sample test on a passage of 2060 characters from the June 1993 evaluation of Pangloss is shown in figure 11.",
        "The difference in keystrokes was calculated as follows: one keystroke for deleting a character, two keystrokes for inserting a character, three keystrokes for deleting a word (in an editor with",
        "mouse action); three keystrokes plus the number of characters in the word being inserted for inserting a word.",
        "It is clear from the above table that the multi-engine configuration works better than any of our available individual engines, though it still does not reach the quality of a Level 2 translator.",
        "It is clear that using keystrokes as a measure is not completely satisfactory under the given conditions.",
        "It would be much better to make the comparison not against a single",
        "\"canonical\" translation but against a set of equivalent paraphrastic translations, the reason being that, as all translators know, there are many \"correct\" ways of translating a given input, so that a more appropriate test would be counting the number of keystrokes of difference between the system output and the closest member of the set of correct translation paraphrases.",
        "However, this is predicated on the availability of a \"paraphraser\" system, developing which is not a trivial task."
      ]
    },
    {
      "heading": "5. FUTURE WORK",
      "text": [
        "Ultimately, a multi-engine system depends on the basic quality of each particular engine.",
        "We expect the performance of some of the individual engines (especially, KBMT and EBMT) to grow.",
        "Consequently, the multi-engine environment will improve, as larger static knowledge sources are added and the scoring mechanism is further adjusted.",
        "We expect to gain insight into how to improve the scoring mechanism: we plan a battery of tests to help adjust the coefficients on the function which combines the individual scores in the final score.",
        "We plan to use a standard regression mechanism to modify these scores based on feedback from having humans select the best covers for test texts.",
        "We expect such calibration further to optimize the system to produce the best possible output from the set of available candidate translations produced by the multiple engines.",
        "We also intend to develop a method of how to empirically assess the expected output quality of each translation engine based on its available resources, such as dictionaries, glossaries, grammars, parallel corpora, etc."
      ]
    }
  ]
}
