{
  "info": {
    "authors": [
      "Tadashi Nomoto",
      "Yoshihiko Nitta"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2187",
    "title": "A Grammatico-Statistical Approach to Discourse Partitioning",
    "url": "https://aclweb.org/anthology/C94-2187",
    "year": 1994
  },
  "references": [
    "acl-E93-1037",
    "acl-J86-3001",
    "acl-P93-1020",
    "acl-P93-1041",
    "acl-W90-0117"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The paper presents a new approach to text segmentation which concerns dividing a text into coherent discourse units.",
        "The approach builds on the theory of discourse segment (Nomoto and Nitta, 1993), incorporating ideas from the research on information retrieval (Salton, 1988).",
        "A discourse segment has to do with a structure of Japanese discourse; it could be thought of as a linguistic unit demarcated by wa, a Japanese topic particle, which may extend over several sentences.",
        "The segmentation works with discourse segments and makes use of coherence measure based on ifig, a standard information retrieval measurement (Salton, 1988; Hearst, 1993).",
        "Experiments have been done with a Japanese newspaper corpus.",
        "It has been found that the present approach is quite successful in recovering articles from the unstructured corpus."
      ]
    },
    {
      "heading": "Introduction",
      "text": [
        "In this paper, we describe a method for discovering coherent texts from the unstructured corpus.",
        "The method is both linguistically and statistically motivated.",
        "It derives a linguistic motivation from the view that discourse consists of what we call discourse segments, minimal coherent units of discourse (Nomoto and Nitta, 1993), while statistically it is guided by ideas from information retrieval (Salton, 1988).",
        "Previous quantitative approaches to text segmentation (Hearst, 1993; Kozima, 1993; Youmans, 1991) have paid little attention to a statistically important structure that a discourse might have and defined it away as a lump of words or sentences.",
        ":Part of our concern here is with explicating possible effects of a discourse segment on the quantitative structuring of discourse.",
        "In what follows, we will describe some important features about discourse segment and see how it can be incorporated into a statistical analysis of discourse.",
        "Also some comparison is made with other approaches such as (Youmans, 1991), followed by discussion on the results of the present method."
      ]
    },
    {
      "heading": "Theory of Discourse Segment",
      "text": [
        "The theory of discourse segment (Nomoto and Nitta, *2520 Hatoyama Saitanut 350-03 Japan tel.",
        "+81-492-96-6111 fax.",
        "+81-492-96-6006 1993) carries with it a set of empirical hypotheses about structure of Japanese discourse.",
        "Among them is the claim that Japanese discourse is constructed from a series of linguistics units called discourse segment.",
        "The discourse segment is thought of as a topic-comment structure, where a topic corresponds to the subject matter and a comment a discussion about it.",
        "In particular, Japanese has a special way of marking the topic: by suffixing it with a postpositional particle wa.",
        "Thus in Japanese, a topic-comment structure takes the form:",
        "• • • wa •"
      ]
    },
    {
      "heading": "topic comment",
      "text": [
        "where \"•\" represents a word.",
        "The comment part could become quite long, extending over quite a few sentences (Mikan* 1960).",
        "Now Japanese provides for a variety of ways to mark off a topic-comment structure; the wa-marking is one such and a typographical device such as a line or a page-break is another.",
        "For the present discussion, we take a discourse segment to be a block of sentences bounded by a text break and/or a wa-marked element.",
        ", St S2 \" Sn I T2 Sn+1 Sn+2 ' \" Sn+m",
        "where \"T\" denotes a boundary marker, \"S\" a sentence, and \"1\" a segment gap.",
        "For the semantics of a discourse segment, Nomoto and Nitta (1993) observes an interesting tendency that zero (elliptical) anaphora occurring within the segment do not refer across the segment boundary; that is, their references tend to be resolved internallyl.",
        "Now we take a very simple view about the global structure of discourse: syntactically, discourse is just 'Here and throughout we use 01 for a subject(NOMinative) zero; 02 for a object(ACCusative) zero; TOP for a topic case; DAT for a dative(indirect object) case; PASS for a passive inor-plieme.",
        "Taro<> -wa 01<> rojin<J> -ni seki TOP old man DAT seat -wo yuzutte -ageta node, 01<i> 02<> ACC give help because",
        "a chronological juxtaposition of contiguous, disjoint blocks of sentences, each of which corresponds to a discourse segment; semantically, discourse is a set of anaphoric islands set side by side.",
        "Thus a discourse should look like Figure 1, where G denotes a discourse segment.",
        "Furthermore, we do not intend the dis",
        "course structure to be anything close to the ones that rhetorical theories of discourse (Hovy, 1990; Mann and Thompson, 1987; Hobbs, 1979) claim it to be, or intentional structure (Grosz and Sidner, 1986) ; indeed we do not assume any functional relation, i.e. causation, elaboration, extension, etc., among the segments that constitute a discourse structure.",
        "The present theory is not so much about the rhetoric or the function of discourse as about the way anaphora are interpreted.",
        "It is quite possible that a set of discourse segments are not aggregated into a single discourse but may have diverse discourse groupings (Nomoto and Nitta, 1993).",
        "This happens when discourses are interleaved or embedded into some other.",
        "An interleaving or an embedding of discourse is often invoked by changes in narrative mode such as direct/indirect speech, quoting, or interruption; which will cue the reader/hearer to suspend a current discourse flow, start another, or resume the interrupted discourse."
      ]
    },
    {
      "heading": "A Quantitative Structuring of Discourse",
      "text": []
    },
    {
      "heading": "Vector Space Model",
      "text": [
        "Formally, a discourse segment is represented as a term vector of the form:",
        "where a g/ represents a nominal occurrence in the information retrieval terms, what happens here is that a discourse segment Ci is indexed with a set of terms 9/1 through !hi; namely, we characterize G/ with a set of indices gel, , gee.",
        "A term vector can either be binary, where each term in the vector takes 0 or 1, i.e., absence or presence, or weighted, where a term is assigned to a certain importance value.",
        "In general, the weighted indexing is preferable to the binary indexing, as the latter policy is known to have problems with precision (Salton, 1988)2.",
        "The weighting policy that we will adopt is known as if Ulf.",
        "It is an indicator of term importance toil defined by:",
        "2 Precision measures the proportion of correct items retrieved against the total number of retrieved items.",
        "where tf (term frequency) is the number of occurrences of a term Ti in a document Di; df (document frequency) is the number of documents in a collection of N documents in which 'Pi occurs; and the importance, wit is given as the product of if and the inverse df factor ,or idf, log N/dfi.",
        "With the if idf policy, high-frequency terms that are scattered evenly over the entire documents collection are considered to be less important than those that are frequent but whose occurrences are concentrated in particular documents3.",
        "Thus the (f idf indexing favors rare words, which distinguish the documents more effectively than common words.",
        "With the indexing method in place, it is now possible to define the coherence between two term vectors.",
        "For term vectors X (x1, x2, , xi) and Y (yi, 92, , ye), let the coherence be defined by: where w(xi) represents a if idf weight assigned to the term xi.",
        "The measure is known as Dice coefficiene.",
        "Experiments Earlier quantitative approaches to text partitioning (Youmans, 1991; Kozima, 1993; Hearst, 1993) work with an arbitrary block of words or sentences to determine a structure of discourse.",
        "In contrast, we work with a block of discourse segments.",
        "It is straightforward to apply the if idf to the analysis of discourse; one may just treat a block of discourse segments as a document unit by itself and then define the term frequency (if), the document frequency (df), and the size of documents collection (N), accordingly.",
        "Coherence would then be determined by the number of terms segment blocks share and t•idf weights the terms carry.",
        "Thus one pair of blocks will become more cohesive than another if the pair share more of the terms that are locally frequent.",
        "The partitioning proceeds in two steps.",
        "We start with the following:",
        "1.",
        "Collect all the nominal occurrences found in a corpus'' 2.",
        "Divide the collection into disjoint discourse segments.",
        "3.",
        "Compare all pairs of adjacent blocks of discourse segments.",
        "4.",
        "Assign a coherence/similarity value to each pair.",
        "Next, we examine the coherence curve for hills and valleys and partition it manually.",
        "Valleys (viz, low coherence values) are likely to signal a potential break in a discourse flow, whereas hills (viz, high coherence values) would signal local coherency.",
        "Figure 2 shows how a coherence curve might appear.",
        "Coherence is measured at every segment with a paired comparison window moving along the sequence of segments.",
        "Or more precisely, given a segment dj and a block size n, what we do is to compare a block spanning d1_„4.1 through di and one spanning clj+1 through di +n_i.",
        "The measurement is plotted at the jth position on the x-axis.",
        "If either of the comparison",
        "the Dice coefficient.",
        "It was found that the block size of 10 segments yields good results.",
        "Figure 4 shows a coherence graph covering about a week's amount of the corpus.",
        "The graph is smoothed with the width of 5.",
        "We see that article boundaries (vertical lines) coincide fairly well with major minima on the graph: with only one miss at 65, which falls on a paragraph boundary.",
        "Experiments with various block sizes suggest that the choice of block size relates in some way to the structure of discourse; an increasing block size would extract a more global or general structure of discourse.",
        "Youmans (1991) has suggested a information measurement based on word frequency.",
        "It is intended to measure the ebb and flow of 'new information' in discourse.",
        "'the idea is simply to count the number of new words introduced over a moving interval and produce what he calls a vocabulary management profile (VW), or measurements at intervals.",
        "Now given a discourse I) = {w1, , w0 } , the k-th interval of the size A is defined by I.",
        "{Wk • • • ivr } where:",
        "n otherwise windows is underfilled, no measurement will be made.",
        "The graph that the procedure gives out is smoothed (with an appropriate width) to bring out its global trends.",
        "The length of a single segment, i.e., noun counts, varies front text to text, genre to genre, ranging from a few words (a junior high science book) to somewhere around 60 words (a newspaper editorial).",
        "We performed experiments on a four-week collection of editorials from Nihon Keizai Shimbun, a Japanese economics newspaper, which contains the total of 1111 sentences with some 10,000 nouns, and 556 discourse segments.",
        "The corpus was divided into segmental sets of nouns semi-automatically' Coherence was measured for each adjacent pair of segments, using",
        "Measurements are made at intervals If through"
      ]
    },
    {
      "heading": "WORDS (TOKENS)",
      "text": [
        "ours.",
        "Figure 5 shows the results of a VMP analysis for the same nominal collection as above.",
        "The interval is set to 300 words, or the average length of a paired window in the previous analysis.",
        "The y-axis corresponds to the number of new words (TYPl) and the x-axis to an interval position (ToKE,N).",
        "As it turns out, the VMP fails to detect any significant pattern in the corpus.",
        "One of the problems with the analysis has to do with its generality (Kozima, 1993); a text with many repetitions and/or limited vocabulary would yield a flattened VMP, which, of course, does not tell us much about its inner structurings.",
        "Indeed, this could be the case with Figure 5.",
        "We suspect that the VMP scheme fares better with a short-term coherency than with a long-term or global coherency.",
        "Evaluation Figure 6 demonstrates the results of the Dice analysis on the nikkei collection of editorial articles.",
        "What we see here is a close correspondence between the Dice curve and the global discourse structure.",
        "Evaluation here simply consists of finding major minima on the graph and locating them on the list of those discourse segments which comprise the corpus.",
        "The procedure is performed by hand.",
        "Correspondences evaluation has been problematical, since it requires human judgments on how discourse is structured, whose reliability is yet to be demonstrated.",
        "It was decided here to use copious boundary indicators such as an article or paragraph break for evaluating matches between the Dice analysis and the discourse.",
        "For us, discourse structure reduces to just an orthographic structure.",
        "In the figure, article boundaries are marked by dashes.",
        "7 out of 27 local minima are found to be incorrect, which puts the error rate at around 25%.",
        "We obtained similar results for the Jaccard and cosine coefficient.",
        "A possible improvement would include adjusting the document frequency (df) factor for index terms; the average df factor we had for the Nikkei corpus is around 1.6, which is so low as to be negligible8.",
        "7 Yet, there is some evidence that an orthographic structure is linguistically significant (Fujisawa et al., 1993; Nimberg, 1990).",
        "'However, the average dl factor would increase in proportion Another interesting possibilty is to use an alternative weighting policy, the weighted inverse document frequency (Tokunaga and lwayama, 1994).",
        "A widf value of a term is its frequency within the document divided by its frequency throughout the entire document collection.",
        "The widf policy is reported to have a marked advantage over the idf for the text categorization task."
      ]
    },
    {
      "heading": "Recall and Precision",
      "text": [
        "As with the document analysis, the effectiveness of text segmentation appears to be dictated by recall/precision parameters where: total number of correct boundaries number of correct boundaries retrieved total number of boundaries retrieved A boundary here is meant to be a minimum on the coherence graph.",
        "Precision is strongly affected by the size of block or intervals; a large-block segmentation yields less boundaries than a small-block segmentation.",
        "(Table 1).",
        "Experiments were made on the Nikkei corpus",
        "to examine the effects of the block size parameter on text segmentation.",
        "The corpus was divided into equally sized blocks, ranging from 5 to 35 words in length.",
        "The window size was kept to 10 blocks.",
        "Shown in Figure 7 are the results given in terms of recall and precision.",
        "Also, a partitioning task with discourse segments, whose length varies widely, is measured for recall and precision, and the result is represented as G. Averaging recall and precision values for each size gives to the growth of corpus size.",
        "It is likely, therefore, that with a",
        "frequency and coherence measurements.",
        "Another problem has to do with relating the present discussion to rhetorical analyses of discourse."
      ]
    },
    {
      "heading": "References",
      "text": [
        "35 < 25 < 20 < 5 < 30 < 15 < 10 < (3 ranks highest, whose average value, 0.66, is higher than any other.",
        "'10' conies second (0.61)10.",
        "(It is an interesting coincidence that the average length of discourse segments is 13.7 words.)",
        "'the results demonstrate in quantitative terms the significance of discourse segments.",
        "It is worth pointing out that the method here is rather selective about, a level of granularity it detects, namely, that of a news article.",
        "It is possible, however, to have a much smaller granularity; as shown in Table 1, decreasing the block size would give a segmentation of a smaller granularity.",
        "Still, we chose not to work on fine-grained segmentations because they lack a reliable evaluation metrics 1."
      ]
    },
    {
      "heading": "Conclusion",
      "text": [
        "In this paper, we have described a method for partitioning an unstructured corpus into coherent textual units.",
        "We have adopted the view that discourse consists of contiguous, non-overlapping discourse segments.",
        "We have referred to a vector space model for a statistical representation of discourse segment.",
        "Coherence between segments is determined by the Dice coefficient with the If •idf term weighting.",
        "We have demonstrated in quantitative terms that the method here is quite successful in discovering articles from the corpus.",
        "An interesting question yet to be answered is how the corpus size affects the document larger corpus, we might get better results.",
        "Block s here are intended to mean minimal textual units into which a discourse is divided and for which coherence is measured.",
        "tom general, recall is inversely proportionate to precision; a high precision implies a low recall and vice versa.",
        "iiPassonneau and Litman (1993) reports a psychological study on the human reliability of discourse segmentation."
      ]
    }
  ]
}
