{
  "info": {
    "authors": [
      "Cheng-Ming Guo",
      "Changning Huang",
      "Junping Gong",
      "Jin Li"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2200",
    "title": "The Evolution of Machine-Tractable Dictionaries",
    "url": "https://aclweb.org/anthology/C94-2200",
    "year": 1994
  },
  "references": [
    "acl-C92-2070",
    "acl-W93-0312"
  ],
  "sections": [
    {
      "heading": "Intnxbiction",
      "text": [
        "The usefulness of Machine-Tractable Dictionaries (MTDs) in automatic sense tagging ol running text is clearly demonstrated in Tong, et al., (1993).",
        "While previous work (Yarowsky, 1992; Gale, et al., 1992, 1993) relics heavily on the role of statistics, Tong's system makes use of one MTD as well as two Machine-Readable Dictionaries (MR1)s) in an example-based reasoning process in tagging sense numbers to novel words, compounds words, and phrases in the input text.",
        "The hit rate of correct sense tagging runs as high as 90%.",
        "The lowest hit rale ever recorded was 70%.",
        "The system is considered a necessary mechanism fur the construction of annotated Chinese Monitor Corpora (Sinclare, 1991) Iron running Chinese text.",
        "Earlier work (Wilks, et al., 1990) identified a distinction between MRDs and MT11)s. This paper recognizes a I miller distinction between two types of MTDs, i.e., Type I and Type 11 MTDs.",
        "Type 1 MTDs arc built on the definition primitives of one particular MRD whereas Type II MTDs are built (m the semantic primitives of one particular natural language.",
        "l'he M I'D functioning in Tong's system belongs to the Type I category.",
        "The evolution from Type I to Type II MTDs represents an evolution ol the primitives the MTDs are constructed on.",
        "The authors believe that, although it is Feasible to derive a natural set of definition primitives from one particular MRD, a descriptive set of semantic primitives (Wilks, 1977) of one particular natural language is preferably derived from more bran one natural source such as a dictionary.",
        "This posiiimmn represents a backoff from the previous one that claims the derivation ol a natural set ol semantic primitives from one particular MRD, particularly the Longman Dictionary of Contemporary English (1 DO(11:,) (Gut), 1989)_ Three Type 1 MTDs completed al Tsinghtio University will be presented.",
        "'these include MINI-LDOCE constructed for Longman Dictioanries, the MTD version of Modern Chinese Dictionary of General Chinese Characters (MTD-X I A NTONG) (1M, 1987), and the MTD version of The MultiPin•tionat Dictionary of Modern Chinese Words (MTD-DUOGONGNENG) (I:eng & Zhou, 1959).",
        "EA lolls to derive natural sets of semantic primitives from Tymxt I MTDs arc then described These include work on detecting circular del intions within one particular MTD, work on computing the compatibility of word senses between two monolingual dictionaries, and the most recent step at deriving a natural set ol Chinese semantic primitives from Type I MTDs Chinese.",
        "The work was done on Sun .4 workstations with the Ccomputer language."
      ]
    },
    {
      "heading": "2. Design and Construction of Type I Milts",
      "text": [
        "The design and construction or MTDs in general arc discussed in detail by various authors in Ono (1094).",
        "Described in this paper are three Type I MTDs in two languages.",
        "The first one is the 1;mglish MINI-LDOCE designed and constructed by Cheng-ming Guo for Longmans, the second the MTD-XIANTONG constructed by machine by Xiang Tong (Tong, et al., 1993), and the third the WM-DUOGONGNENG by Jun-ping Gong (Gong & 1-Luang, 19911 by hand."
      ]
    },
    {
      "heading": "2.1. MINI-LDOCE",
      "text": [
        "The discussion presented below represents a general description of the most essential points in the design and construction of MINELDOCL.",
        "For a detailed aceount of the pitOct the /cadet is iet.ened to the MINI-I.DOCE system documentation upon ,onymans' publication.",
        "As is well known, Longman Dictionary of (1ontemporary English (LDOCE) has a Controlled Vocabulary (CV) of about 2,000 )v ()ids.",
        "These 2,000 CV words are used in every word sense definition of the entire LDOC1',.",
        "It was found that a subset of about 4,0(X) CV word senses are used to define the 2,000 CV words themselves (Goo, 1989).",
        "MINI-LDOCE is a dictionary of these 4,000 definition primitives of I.DOCE.",
        "In other words, MI NI-LDOCE.",
        "has about 4,000 entries of word Senses_ each entry of a word sense being a definition primitive of I ,D0C1'.. MINLIDOtt.11E differs from 1,00('E in the form of the definition text.",
        "Whereas LDOCE word senses are defined by words; MINI-(,D000 definitions are giVell iii word senses, i.e., each word in the definitnin text is already disambiguated, and has a sense number attatehed at the cod.",
        "The set of the CV 1N.01 d senses used in the definition text of MINI-1_1)0C13 falls within the set of total MINI-1_1)0CE sense entries.",
        "When non-CV words, or phrases formed either of CV \\voids, non-CV words, in a combination of CV and non-CV words are found in MI NI-LDOCH sense definitions, art effort is made to disambiguate the non-CV word or phrase, and reduce its definition as found in LDOCE to the definition primitives of 1,DOCk.",
        "Tins results to embedded definition, which sometimes runs down three or !bur levels.",
        "In most cases, the embedded definition bottoms out to definition primitives within three levels of embedded dein-id-ions.",
        "One important motive behind the design and construction of MINE-I.DOCUtt is its expected mole as an important, although apparently meagre, source of lexical and knowledge data in a process called bootstrapping, re., to convert, in steps, the rest of I .DOCI into a Type I MTD of the MINI-1,D0C10 kind.",
        "MINI-LDOCE has been completed, and is novv available to both academic and commercial users.",
        "Besides its possible use as the nucleus in' English lexicon, its (must] action constitutes a necessary first step in generating a natural set of semantic primitives tor the English language.",
        "As mentioned above, the semantic primitives form the basic units for the construction of Type II MTDs in the same way definition primitives loon the basic units fin that of 'Type I 1V11111Ds.",
        "2.2.",
        "MTD-X1ANTONG MTD-XIANTONG is the MTD version of Ike Modern Chinese Dictionary of General Chinese Characters (Fu, 1987).",
        "XIANTONG is the shortened name for the original Chinese dictionary.",
        "It contains about 10,000 monosyllabic Chinese words in the form of characters with more than 50,000 multisyllabic Chinese words and phrases as examples.",
        "The meanings of every monosyllabic Chinese word arc defined in the sense definitions given under the entry word in question.",
        "However, the multisyllabic words and phrases given as examples following each word sense definition do not have accompanying definitions.",
        "Each word sense definition is separated from its examples by a colon.",
        "An example is given below:",
        "The construction of MID-XIANTONG proceeds in two steps.",
        "At Step 1, more than 50,000 multisyllabic example words and phrases are automatically sense tagged.",
        "At Step 2 the definition text of every word sense of all head words arc disambiguated, attaching a sense number to every word in the sense definitions.",
        "Note that the MTD version of XIANTONG contains entries of words in frequent use only.",
        "Monosyllabic Chinese words that are not in frequent use (2,193 of them) stay out of MTD-XIANTONG.",
        "Word sense entries in MTD-XIANTONG total around 15,000 with about 50,000 examples of compound words and phrases.",
        "All words in the definition texts and all examples are tagged with word sense numbers.",
        "The algorithm used in automatically sense tagging the multisyllabic words in XIANTONG is fairly simple.",
        "It takes advantage of one important fact concerning the making of the original Chinese dictionary, i.e., repeated appearance of the same example word and phrase under different head words, or more exactly, under different sense definitions of different head words.",
        "In fact, all head words in XIANTONG are single Chinese characters.",
        "For example a bisyllabic Chinese word made up of two Chinese characters may appear twice as an example under the two composite characters, each time as an example of a particular word sense of one of the two characters being defined.",
        "For example, tl)s:: word rgi (recover) appears under both and g. ,Ak appears under M as an example in Sense I (p.275), and under as an example in Sense 1 (p.151), too.",
        "Hence M_A01 k_A01.",
        "By checking through all example words and phrases in the way they are cross-referred, all words that are cross-referred as examples in the dictionary are automatically tagged with appropriate sense numbers.",
        "This process produced the bulk of MTD entries which form the core of the reasoning system in the automatic sense tagging of running Chinese text (Tong, et al., 1993).",
        "At Step 2 the automatic tagging of sense numbers to each word in the definition text proceeds in the same way as described in Tong, et al.",
        "(1993).",
        "Efforts are now being made to blend in human judgement to the making of a more accurate version of"
      ]
    },
    {
      "heading": "MTD-XI A NTONG.",
      "text": []
    },
    {
      "heading": "2.3. MTD-DUOGONGNENG",
      "text": [
        "MTD-DUOGONC1NENG is the MIT) version of The Multifunctional Dictionary of Modern Chinese Words (leng & Zhou, 1989).",
        "DUOGONGNENG is the shortened name for the original Chinese dictionary.",
        "It contains about 7,000 most frequently used words in everyday Chinese.",
        "MTD-DUOCIONGNIING is produced by manually tagging word sense numbers to each word in the definition text of every sense entry under every head word of the entire dictionary.",
        "Unlike MTD-XIANTONG which uses its own definition primitives, MTD-DUOGONGNENG uses the definition primitive of another Typel MTD, i.e., MTD-XIANTONG.",
        "Hence the tagged sense numbers in MTD-DUOGONGNENG agree with the system of sense numbers of MTD-XIANTONG.",
        "This paves the way for the generation of a set of descriptive semantic primitives from more than one MTDs.",
        "In die corpus of the definition texts of mm-DUOGONGNENG, 10,003 word types appear with 5,873 definnion primitives.",
        "The 5,873 definition primitives are the word senses of 2,574 monosyllabic Chinese words in the form of Chinese characters from MTD-XIANTONG.",
        "The total number of word senses given in MTD-XIANTONG of these 2,574 Chinese characters amounts to 9,363."
      ]
    },
    {
      "heading": "3. Evolution from Type 1 to Type II MTDs",
      "text": [
        "The absolute advantage of Type II MTDs over Type I MTDs is an empirical question.",
        "However, the advantage of a descriptive set of semantic primitives Met a set of definition primitives derived from one single data source should be obvious since the former covers all possible source data of one natural language.",
        "Using a Type II MTD on parallel machines; especially when a descriptive set of semantic primitives are used as microleinures of an Artificial Neural Network (ANN) system constitutes an interesting research to both ANN and MTDs.",
        "Further still, Type II MTDs may help revive the dated notion of turning symbolic processing of natural languages into mathematical computation by using a function that turns Type II MTD definitions based on semantic primitives into mathematical representations."
      ]
    },
    {
      "heading": "3.1. From Conceptual Equivalents to Circular Definitions",
      "text": [
        "Circular definitions may exist within definitions primitives derived from a dictionary.",
        "For instance, both bottom!",
        "and base/ may Inn into a set of definition primitives derived From LDOCE.",
        "However, they are locked in a definition circle: honoin : the base on which something stands; the lowest part, inside or outside base I: the bottom of something Desirably, a descriptive set of semantic primitives is free of such circular definitions between members of the set.",
        "Karen Sparek-Jones(1967) conducted an in-depth study on circular definitions in English dictionaries.",
        "Similar study on Chinese dictionaries did not come true until recently when Chinese MRDs are available.",
        "Below are some results from a similar study on MTD-XIANTONG.",
        "The basic idea is for Circular Definiiions to emerge out of sets of Conceptual Equivalents.",
        "The so-called Concerfnual Lquivalenrc refer to a set of related conceptual entities derived from the sense definitions of a MTD.",
        "The so-called Circular Definitions refer to",
        "delinition circles found in a set of Conceptual Equivalents.. A study which takes monosyllabic-word concepts as search units reveals that M'I'D-XIANTONG has 389 sets of conceptual equivalents among 15,273 sense definitions.",
        "The 389 sets of conceptual equivalents contain 1,716 sense definitions which amount to 11.23% of the total.",
        "28 strict circular del initions are spotted among the 389 sets of conceptual equivalents.",
        "See the following for an example:"
      ]
    },
    {
      "heading": "3.2. Sense Compatibility Between Monolingual Chinese Dictionaries",
      "text": [
        "Sense compatibility computation was studies in Byrd, et al.",
        "(1987) as a mapping problem between dictionaries.",
        "The mapping was seen as a .tvtinefric binary relation between two different dictionaries.",
        "In the present study on the derivation of a descriptive set of semantic primitives, sense compatibility computation is seen as an Important element in merging data from multiple dictionary sources.",
        "Two dictionaries XIANTONG and New Modern Chinese Dictionary (henceforth X IA N N) (Wan, ct al., 1985) are used as data.",
        "Two sense definitions under the same head word in the two dictionaries arc compatible if:",
        "a. the two definition tests are identical; b. one definition text is included as part of the other; c. all segments of one definition text separated by punctuations appear in the other definition text;",
        "d. more than half of the example words and phrases given alter one del intion test appear as examples alter the other; tx both have long definition te‘ts.",
        "and the First ten words are identical.",
        "Results show a total of 58,8% of all definition tests are compatible with detailed split as follows: a.23% b.",
        "12.5%.",
        "e. 10.5% d. 6.8% e. (04 On the basis of such findings, XI A NTONG and XIANI IAN are merged mu) one dictionary with 75,572 word sense del mi lions."
      ]
    },
    {
      "heading": "3.3. From Definition Primitives to Semantic primitives",
      "text": [
        "The set of definition primitives of a Type I MTD close on the MED.",
        "A descriptive set of semantic primitives close on all data of one natural language.",
        "The dishnetion between descriptive semantic primitives and prescriptive semantic primitives is given in Wilks (1977).",
        "Essentially, unlike prescriptive semantic primitives winch me prescribed, so to speak, by man, descriptive semantic primitives are derived from natural sources such as a dictionary.",
        "This paper represents a backoff from (iuo (1989) where it was claimed that a natural set of semantic primitives had been derived from I ,1)0(Th,.",
        "It is now believed that although it is feasible to derive a set of definition primitives from one particular MRD or MTI), a descriptive set of semantic primitives true of one natural language is preferably derived from inure than one natural source such as a dictionary.",
        "What is presented below iepresents a First step to the generation 01 a set of Chinese semantic primitives Iron) a set of del inition primitives derived Iron) one particular Chinese dictionary, i.e., MTD-1)110GONGNENG.",
        "A hunch set of semantic primitives, which is a subset or the del imtion primitives derived from MTD-DUOCONGNENG, is applied to the sense del im lions of M'I'D-X1ANTON(I in an effort to find out how many word sense entries can be accounted for, i.e., defined, within live defining cycles.",
        "As given above the definition primitives found in MT1)--INJOGONGNEING total 5,873.",
        "5,796 of them are senses of words that are known as most frequently used Chinese words.",
        "4,417 out of these 5,796 definition primitives appear more than once in MTI).",
        "DIJOGONGNENG sense definitions.",
        "These 4,417 del Hutton primitives arc chosen as the initial hunch set of semantic primitives.",
        "On the other hand, MTD-X1ANTONG was chosen as the first other dietionmy to try out these 4,417 defining primitives from MTD-DEOGONGNENG.",
        "A subset of 15,273 sense definitions 01 MTD-XIANTONG participate in the generation processs.",
        "This subset, 7,617 strong, belong to the most Irequently-used words in contemporary Chinese.",
        "At the first defining cycle, 3,804 word senses are defined by the 4,417 hunch set of semantic primtives.",
        "Note that every tune a word sense is defined, it joins the hunch set immediately to define more word senses in the next defining cycle.",
        "At the second defining cycle, an additional 556 word senses are defined.",
        "At the third defining cycle, another 144 word senses are defined.",
        "At the fourth defining cycle.",
        "27 more rd senses are defined.",
        "At the last defining cycle 4 additional word senses are defined.",
        "At the end of the filth defining cycle, 3,256 word senses remain undefined.",
        "A complexity of reasons contribute to the I ad ure.",
        "One major one among them is due to incorrect and incomplete data.",
        "As discussed above, MTD-XI ANTONG was produced by machine.",
        "Words tagged with 000 or MIS indicate that the system was unable to tag the correct sense number either because the word sense is not found in the dictionary or because the system cannot come up with the correct sense nubmer during the reasoning, process.",
        "Efforts arc being made to verily.' the data exhaustively by human judgement."
      ]
    }
  ]
}
