{
  "info": {
    "authors": [
      "Shingo Takada",
      "Norihisa Doi"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2188",
    "title": "Centering in Japanese: A Step Towards Better Interpretation of Pronouns and Zero-Pronouns",
    "url": "https://aclweb.org/anthology/C94-2188",
    "year": 1994
  },
  "references": [
    "acl-C88-2159",
    "acl-E93-1037",
    "acl-J86-3001",
    "acl-P86-1031"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "An extension of the notion of \"centering\" is described for interpreting zero-pronouns and overt pronouns in naturally occurring Japanese text.",
        "in previous work, one zero-pronoun encodes the backward-looking center, with pronouns and other zero-pronouns handled as if they were overtly expressed.",
        "An investigation is made, and from it pronouns and zero-pronouns are concluded to be more salient, titan other overt, noun phrases.",
        "This (91- ables better interpretation of pronouns and zero-pronouns."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In order to avoid unnaturalness caused by redundant use of full noun phrases, pronominal expressions are used.",
        "In Japanese, there are basically two types of pronominal expressions: the zero pronoun and the (overt) pronoun.",
        "Zero-pronouns can be defined as follows [Yoshirnoto 86]: A zero-pronoun is a noun phrase which is of an obligatory case and winch is not expressed but can be understood through discourse and context.",
        "There has been much work on handling zero-pronouns, such as [Kameyama, 85], [Yoshimoto 86], [Walker 92], and [Nornoto 93].",
        "Among then', M. Kameyama showed in [Karneyama.",
        "85] that zero.",
        "pronouns in Japanese sentences could be interpreted using a concept called \"centering\" [Joshi 81].",
        "In the centering model, there is one entity that.",
        "an utterance most.",
        "centrally concerns.",
        "'Phis entity is referred to as the backward-looking center (Cb).",
        "Any other entity appearing in an utterance is a forward-looking center (co which may become a Cb later on in the",
        "Kinneyinna showed that the zero-pronoun corresponds to the Cb in Japanese.",
        "But, in her account, if there is more titan one zero-pronoun in an utterance, only one of then is the Cb, and all other zero-pronouns were handled just as if they had been overtly stated.",
        "Furthermore, pronouns were also treated as if the entities had been stated as 'ordinary' noun phrases.",
        "But, overt pronouns are used to avoid mmaturalness, just.",
        "as zero-pronouns are, and their antecedents should be found.",
        "In this paper, overt pronouns, as well as zero-pronouns, are interpreted by extending the notion of centering.",
        "Basically, entities corresponding to the zero-pronouns and overt pronouns are all treated as being given more attention than other entities in a sentence.",
        "Only those pronouns and zero-pronouns that are of an intersentential nature are handled.",
        "So, those whose antecedent appears in the same sentence as the pronominal element, i.e. intrasentential anaphora, and those whose antecedent appears after the pronominal element, i.e. cataphora, are outside the scope of this paper.",
        "In section 2, the extended notion of centering the Center List Model is explained.",
        "In section 3, a system implementing the Center List Model is described awl evaluated.",
        "Concluding remarks are made in section 4."
      ]
    },
    {
      "heading": "2 The Center List Model",
      "text": [
        "lit this section, centering is extended to handle multiple zero-pronouns, and then further extended to handle overt pronouns.",
        "Finally, the ordering of entities for showing the degree of salience is described."
      ]
    },
    {
      "heading": "2.1 Zero-Pronouns",
      "text": [
        "In Kameyama's account, only one zero-pronoun encodes the Cb, and any other zero-pronouns become Cfs, just as if they had been overtly expressed in the sentence.",
        "In other words, when there are multiple zero-pronouns, only one of the zero-pronouns has any significance, and any other zero-pronoun might as well have been overtly expressed.",
        "But, because entities become zero-pronouns in order to avoid unnaturalness due to redundancy, zero-pronouns can be said to be salient enough to be understood without being overt.",
        "In effect, this means that a greater amount of attention is placed on them than entities that were overtly expressed.",
        "This is shown through an example.",
        "Taking her approach, some simple extensions are made to see how well the ordering of entities in centering would work for multiple zero-pronouns.",
        "First, the antecedent for the Cb-encoding zero-pronoun is chosen ,as shown in [Kameyama 85].",
        "Basically, this consists of choosing the entity with the highest degree of salience in the previous sentence.",
        "Then, the next most salient zero-pronoun according to the ordering of degrees of salience given in the previous section is considered.",
        "The antecedent for this zero-pronoun is the most salient entity from the previous sentence which will not contradict any possible constraints.",
        "At this point, we only consider semantic constraints for excluding such sentences as \"The desk ate fish\" and contra-index constraints for excluding such sentences as \"Jack ate jack.\" Any other zero-pronouns are handled in the same manner.",
        "For example, the following discourse is examined':",
        "Example 1: (1) Taro wa Jiro to shokuji chuu de attn.",
        "Taro Top/Sub Jiro with meal during was Taro was having a meal with.",
        "Jiro.",
        "Cb: – , Cf: Taro > Jim (2) (I) Saburo wo mikaketa.",
        "Sub Saburo Obj saw (Taro) saw Saburo.",
        "Ch: Taro, Cf: Saburo (3) (I) 0 Jiro ni shoukaishita.",
        "Sub Obj Jiro Obj2 introduced (Taro) introduced (Saburo) to Jiro, (4) 0 'F Shokuji ni sasotta.",
        "Sub Obj meal Obj2 invited (Taro) invited (Saburo) to the meal.",
        "In sentence (1), the Cfs are ordered as Taro> Jiro, since Topic is the most salient entity.",
        "In sentence (2), the entity with the highest degree of salience from the previous sentence (Taro) is chosen as the zero-pronoun's antecedent, and becomes the Cb, with Saburo becoming a Cf.",
        "In the third sentence, after Taro is chosen as the subject of the sentence, since there is only Saburo left, Saburo becomes the antecedent of the object zero-pronoun, assuming that there is some sort of knowledge preventing Taro from becoming the object.",
        "After sentence (3), the ordering of noun phrases would be as follows: Taro (Cb) > Jiro (Cf - Obj2) Saburo (Cf Obj) This means that sentence (4) is ambiguous, having the following possible interpretations:",
        "(a) Taro invited Jiro to the meal.",
        "(b) Taro invited Saburo to the meal.",
        "But, the preferred meaning is (b).",
        "So, this would mean that the ordering should be as follows:",
        "This example shows that when trying to interpret more than one zero-pronoun, the ordering of noun phrases according to Kameyama's account may not be optimal.",
        "Of course, this can be rectified by changing the ordering of the degree of salience so that Object is higher than Object2, and as noted later in the paper this will actually take place.",
        "But, suppose sentence (3) in Example 2 is replaced with the following sentence: (3') 0 0 Jiro wo shoukaishita.",
        "Sub Obj2 Jiro Obj introduced (Taw) introduced Jiro (to Saburo).",
        "Even in this case, the interpretation of sentence (4) would not change2.",
        "So, the ordering of zero-pronoun not being optimal, i.e. that zero-pronouns are more likely to become zero-pronouns again than overt noun phrases, would seem to be the more logical choice.",
        "So, we propose that \"entities that have become zero-pronouns arc more centered in the discourse than those that have been overtly expressed.\" Therefore, the centering model has been extended to the following two lists to handle entities (noun phrases) that appear in a sentence:",
        "(1) Center List • • • Entities in a sentence that have become zero-pronouns.",
        "(2) Possible Center List • • • Entities in a sentence that were overtly expressed."
      ]
    },
    {
      "heading": "2.2 Pronouns",
      "text": [
        "In Japanese, both overt and elided pronominal forms exist.",
        "The elided pronominal form (zero-pronoun) was discussed in the previous subsection.",
        "In this subsection, we will show bow pronouns are handled within the proposed model.",
        "In Kameyama's account, pronouns do not encode Cbs and can only become Cfs.",
        "If overt pronouns are treated as entities that were overtly expressed (i.e. put in the Possible Center List), the following example will not be interpreted correctly'.",
        "If this example is interpreted with the antecedent of kanojo (her) in sentence (3) in the Possible Center List, then the interpretation would be 'Taro likes Jiro.' In order to obtain the preferred interpretation, the ordering of noun phrases should be as follows:",
        "'Phis example shows that pronomis are not necessarily at the same level as with other overt noun phrases.",
        "In other words, pronouns are at a level of attention higher than 'ordinary' noun phrases.",
        "This is especially true when considering the fact, that.",
        "pronouns are used to prevent unnaturalness clue to redundancy, just as zero-pronouns are used.",
        "So, we propose that pronouns be interpreted at the same level as zero-pronouns as follows: Center List Model The entities in a sentence belong to one of the following two lists:",
        "(1) Center List • • • Entities that have become zero-pronouns or overt pronouns.",
        "(2) Possible Center List • • • Entities that were overtly expressed but are not in the Center List.",
        "Entities in the Center List are more salient than those in the Possible Center List, with the exception of Topic.",
        "The exception will be touched upon in the next subsection."
      ]
    },
    {
      "heading": "2.3 Ordering by Salience",
      "text": [
        "Next comes the problem of ordering within the Center List :Ind the Possible Center List.",
        "In other words, the difference in salience between pronouns (zero and overt) and 'ordinary' noun phrases is shown by the Center List and the Possible Center List.",
        "Entities in the Center List are more salient than those in the Possible Center List.",
        "But, what about the difference in salience within each list?",
        "In our model, the ordering is as follows:",
        "'Ile first line shows the ordering of grammatical functions of the main verb.",
        "'fins line is basically the same as Kameyama's ordering, except that Object is deemed to be more salient than Object2.",
        "This was because, after making some preliminary evaluations of our model, Object was found to have a slightly higher degree of salience than Object2.",
        "The following two lines are for any entities that appear in subordinate clauses.",
        "There doesn't seem to be a clear cut difference between the Subject, Ob-it:et, and Object2 of subordinate clauses, so they are handled at the same level.",
        "The difference between the tnain clause and any subordinate clauses captures the intuition that entities in the main clause are more salient than those in subordinate ones.",
        "There is one exception to the Center List Model.",
        "It is the salience of the Topic in the Possible Center",
        "List.",
        "As can be surmised from the term itself, the Topic is special in that the sentence contains information about the entity corresponding to the Topic.",
        "In other words, the sentence is usually about the Topicalized entity.",
        "So, it was placed at the same level as the Object in the Center List."
      ]
    },
    {
      "heading": "3 Experiment and Discussion",
      "text": [
        "An experiment was done to show the effectiveness of the Center List Model in interpreting pronouns and zero-pronouns.",
        "A total of 160 sentences from the following four discourses were used:",
        "• \"Ushikata To Yamanba\" [Tsubota 75] (Japanese folklore – 70 sentences) • \"Madogiwa No 'lotto-char\" [Kuroyanagi 81] (Story -- 51 sentences) • \"Yasei Doubutsu To Tomoni\" (Newspaper column) – \"liaison\" [Obara 91] (15 sentences) – \"hie Wani\" [Ohara 92] (24 sentences)",
        "This section will first describe the simple implementation used in the experiment.",
        "Then, it is evaluated (Table 1), followed by a. comparison (Table 2) with Kameyama's method."
      ]
    },
    {
      "heading": "3.1 Implementation",
      "text": [
        "The implementation is kept simple to demonstrate the effect of the Center List.",
        "Semantic constraints on the type of entity that a (zero) pronoun may refer to -- for example, the Subject of 'eat' must be animate ---, and contra-index constraints for restricting combi- nations of coreferring entities within a sentence -- for example, the Subject and Object of 'eat' cannot be the same entity -- are used.",
        "In addition, a. constraint concerning the subject and identification' of Cbs in adjacent sentences is used [Kameyama 86], except it applies to each entity in the Center List of adjacent sentences as follows: Two zero-pronouns that appear in the Center List of adjacent sentences should share one of the following properties (in descending order of preference): (1) identification and subject, (2) identification only, (3) subject only, (4) non-identification and non-subject.",
        "4 Katneyama's terminology for Empathy [Kuno 75}.",
        "It shows the perspective from which an event is described.",
        "Of course, the Center List and the Possible Center List by themselves will not be able to handle antecedents that are not in the previous sentence.",
        "In order to solve this problern, an ad hoc approach was taken by adding the following two lists:",
        "• Past Center List • • • Entities that have previously been a zero-pronoun or an overt pronoun, but do not appear in the current sentence.",
        "• Noun List • Entities that have never been a zero-pronoun or an overt pronoun.",
        "In order to avoid combinatorial explosion, the entities that are held in these two lists are limited to those which appear in the previous three sentences.",
        "Each entity in the four lists is assigned a score to show its degree of salience.",
        "In other words, the score shows the possibility of becoming a zero (or overt) pronoun in the next sentence.",
        "After morphological and syntactic analysis, the interpretation process is basically carried out as follows: (I) Using the semantic constraints, possible antecedents for pronouns and zero-pronouns are found from the Center List, Possible Center List, Past Center List, and Noun List.",
        "(2) Combinations of possible antecedents are made.",
        "(3) Contra-index constraints are applied.",
        "(4) Each combination is given a score as follows: (4.1) Compute the sum of the scores that each possible antecedent was given.",
        "(4.2) Give bonus scores according to the subject and identification constraint.",
        "(5) The combination with the highest score is chosen as the combination with the most probable antecedents.",
        "(6) The Center List, Possible Center List, etc.",
        "are updated."
      ]
    },
    {
      "heading": "3.2 Evaluation",
      "text": [
        "Table 1 shows our results.",
        "Considering the fact that the Center List Model itself handles only pronouns and zero-pronouns whose antecedents are found one sentence back, it shows promise since a very simple framework is enough to achieve 76% accuracy.",
        "Also, though the number of pronouns was small, the percentage of correct interpretations was",
        "Just under 90%.",
        "'flit remainder of this subsection will make some analysis of the results.",
        "First, since the interpretation of a (zero) pronoun uses the result, of the previous sentence, \"errorchaining\" must be checked for.",
        "Error-chaining occurs when a wrong interpretation causes a subsequent wrong interpretation.",
        "Of the 49 incorrect interpretations, 11 (22%) were due to this factor either completely (8) or partially (3).",
        "In the case of [Ohara 92], live out of the ten errors were due to this.",
        "Along with error-chaining, there is also the possibility of getting the correct interpretation for the wrong reason, i.e. an error in the previous sentence may cause au interpretation to he correct.",
        "Since there were 49 incorrect interpretations, all 49 have this potential.",
        "However, there was only one case of a false positive.",
        "The simplicity of our implementation was also a factor in the wrong interpretations.",
        "When a sentence is a complex sentence, the subject may differ between different predicates.",
        "Example :I: (1)1 Omotta toorini, (1).2.",
        "Taro wo mitsuketa.",
        "Sub think as Sub Taro Obj found.",
        "As (1)1 Thoughi, (1)2 found Tam.",
        "(1)1 and 4) in Example :1 Linty or nary not be the same.",
        "person.",
        "In our simple implementation, unless one of the constraints deem otherwise, such cases are handled as the same.",
        "But, this led to 14 incorrect interpretations.",
        "A few more heuristic rules, such as preferences for parallel interpretations, would also have raised the percentage of correct interpretations.",
        "As can he seen from the low percentage of correct interpretations for (zero) pronouns, the biggest cause of wrong interpretations is the lack of a global discourse mechanism.",
        "was the case for 13 wrong interpretations.",
        "Furthermore, of the 13, seven occurred when the discourse was interrupted by a single sentence that.",
        "gave background information.",
        "Another cause for wrong interpretations was due to our model being based on scoring combinations of possible antecedents.",
        "There is always the possibility of multiple combinations having the best possible score.",
        "Eight such cases occurred in our examination.",
        "Among those eight cases, there were five cases where the correct interpretation was among the top combinations.",
        "Aniong those five cases, there were two cases where the incorrect, interpretation was chosen.",
        "Finally, there was only one case where a zero-pronoun did not have greater salience than an entity that appeared overtly.",
        "This occurred when an elided Oblique of a subordinate clause was ordered as lia.ving greater salience than an overt Oblique of a main clause."
      ]
    },
    {
      "heading": "3.3 Comparison",
      "text": [
        "A comparison is made in Table 2 between our approach (Center List) and Kameyama's approach (Center).",
        "Since Kaineyama's approach does not include overt pronouns, they were excluded from the results.",
        "Also, only the results of Subject, Object, and Object2 are used.",
        "For example, the Oblique",
        "There was one case where her approach was able to make a correct interpretation but ours could not.",
        "This, however, was a false positive.",
        "While all other differences between the two approaches were cases where our approach was able to handle the interpretation but hers could not, three of the cases were not clue to a legitimate superiority of our approach.",
        "In one case, an error occurred due to error-chaining.",
        "In another, the cause was the exclusion of the interpretation of the Oblique-Object in passive sentences from the evaluation of Kameyama's approach.",
        "The third case was the single false-positive that occurred in the result of our approach.",
        "However, all other (seven) cases were due to the salience ordering difference between the Center List Model and Centering.",
        "The evaluation model was limited to a very simple one so that the effect of the Center List, i.e. the difference in ordering, would be apparent.",
        "From the comparison, the Center List Model can be said to order the possible antecedents more effectively than Kameyama's method."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "In this paper, centering was extended to better interpret pronouns and zero-pronouns.",
        "It extended the centering model to have two lists.",
        "The Center List holds entities that, 'appeared' in the sentence as either an overt pronoun or a zero-pronoun.",
        "The Possible Center List holds entities that overtly appeared in the sentence, excluding overt pronouns.",
        "A very simple implementation showed that 76% of pronouns and zero-pronouns could be interpreted.",
        "The percentage goes up to 81% when considering only those whose antecedents are one sentence back.",
        "But, as the figures indicate, a more global framework, such as one described in [Grosz 86], is needed."
      ]
    },
    {
      "heading": "Acknowledgement",
      "text": [
        "The authors would like to thank CSK Corp. for providing the morphological and syntactic analyzer used in the implementation."
      ]
    }
  ]
}
