{
  "info": {
    "authors": [
      "David Milward"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2151",
    "title": "Non-Constituent Coordination: Theory and Practice",
    "url": "https://aclweb.org/anthology/C94-2151",
    "year": 1994
  },
  "references": [
    "acl-C92-4171",
    "acl-C94-2120",
    "acl-J83-2002"
  ],
  "sections": [
    {
      "text": [
        "Despite the large amount of theoretical work clone on non-constituent coordination during the last two decades, many computational systems still treat coordination using adapted parsing strategies, in a similar fashion to the SYSCONJ system developed for Al.'Ns.",
        "This paper reviews the theoretical literature, and shows why many of the theoretical accounts ac-It tally have worse coverage than accounts based on processing, Finally, it shows how processing accounts can he described formally and declaratively in terms of Dynamic Grammars."
      ]
    },
    {
      "heading": "INTRODUCTION",
      "text": [
        "'this paper is concerned with symmetrical coordination, where the order of the conjuncts (the items being coordinated by a conjunction such as and or or) can be altered without affecting acceptability.",
        "Coordination of this kind is traditionally split into constituent coOr-dination, where each conjunct forms a constituent according to 'standard' phrase structure grammars, and non-constituent coordination.",
        "Constituent and non-constituent coordination have been treated as entirely separate phenomena, (see van Oirsouw, 1987 !Or discussion), and different mechanisms have been proposed for each.",
        "I lowever, by considering grammaticality judgements alone, there seems little justification for such a division.",
        "`1.b illustrate this, consider the sentence: I.)",
        "John gave Mary some books Each of the final proper suhstrings of the sentence (i.e. SOTIU; books, Mary ,sonte books etc.)",
        "can be used as a conjunct e.g.",
        "2) a :John gave Mary [some books] and [seine papers] b .11ohlt gave [Mary some books] and [Peter some papers] John [gave Mary some books] and [lent Peter sortie papers] Similarly, each of the initial substrings can be used as a, conjunct e.g. 3) a [John gave] and [Peter lent] Mary sonic books",
        "c John gave [Mary some] and [Peter ninny] books Only examples (2a) and (2c) are constituent coordinations.",
        "Example (3c) seems slightly unnatural, but it is much improved if We replace books by a heavier string such as books about, gantening.",
        "Thus, for this example, any substring of the sentence' can form a viable conjunct."
      ]
    },
    {
      "heading": "DELETION ACCOUNTS",
      "text": [
        "In the last twenty to thirty years there have been a series of accounts of coordination involving various deletion mechanisms (frorn e.g. Glen:man, 1.965 to van Oirsouw, 1987).",
        "For example, from the following 'antecedent' sentence, 5) Sue gave .lored a book by Cltomsky and Sue gave Peter a paper by Chomsky van Oirsouw allows deletion of words to the left, and to the right of the conjunction, Sue gave Fred a book /SY Pfib'fiNglff and ?fg9fPeter a paper by Chornsky resulting in the sentence: 6) Sue gave Fred a book and Peter a paper by (thorn-sky Most deletion accounts assume that deletion is performed under identity of words, bat, don't analyse what it means for two words to be identical (an exception is van Oirsouw who discusses phonological, morphological and referential identity).",
        "Consider the following example of deletion.",
        "Here the two cases of drive are phonologically identical, but have different syntactic categories.",
        "Now consider:",
        "These are cases of 'zeugma' and are unacceptable except as jokes.",
        "It therefore seems that the deleted words must have the same major syntactic category, and the same lexical meaning.",
        "However, even if we fix both syntactic category and lexical meaning, we still get some weird coordinations.",
        "For example, consider:",
        "9) a * Sue sawi the manj [through the telescope]i and [with the troublesome kid]i b '11: saw [a friend of] and [the manufacturer of] Mary's handbag",
        "In example (a) the two prepositions are attached differently, one to the verb saw, the other to the noun, man.",
        "In example (b), attributed to Paul Dekker, the two conjuncts require Mary's handbag to have a different syntactic structure: the bracketing appropriate for the first conjunct is [(a friend of Mares handbag].",
        "The unacceptability of these examples suggests that word by word identity is insufficient, and that deleted material must have identical syntactic structure, as well as identical lexical meanings.",
        "Some of the most compelling arguments against deletion have been semantic.",
        "For example, Lakoff and Peters (1969) argued that deletion accounts are inappropriate for certain constituent coordinations such as:",
        "10) John and Mary are alike",
        "since the 'antecedent' sentence John are alike and Mary are alike, is nonsensical (it is also ungrammatical if we consider number agreement).",
        "However, semantically inappropriate or nonsensical 'antecedents' are also possible when we consider non-constituent coordination.",
        "For example, consider `antecedents' for the following:",
        "11) a [The man who buys] and [the woman who sells] rattlesnakes met outside b Many former [soldiers living in England] and [resistance members living in France] have similar memories c John sold different dealers [a vase using his intensive sales technique] and [a bookcase using his market-stall technique] (1 lb) is non-constituent coordination under the primary reading where the scope of former does not contain living in England i.e. where the semantic bracketing is: 12) [[former soldiers] living in England] Examples (a) and (b) could be expanded out at the NP but not at Hie S level.",
        "However (c) cannot be expanded out at any constituent level, whilst, retaining all appropriate semantics.",
        "For example, expansion at the VP level gives: 13) John sold different dealers a vase using his intensive sales technique and different dealers a bookcase using his market-stall technique",
        "Thus, although Lakoff and Peters' arguments count against standard deletion analyses, they do not count as general arguments against a unified treatment.",
        "of constituent and non-constituent coordination.",
        "SHARED STRUCTURE Consider the sentence:",
        "14) John gave Mary a book and Peter a paper by Cliomsky",
        "Instead of thinking of John gave and by Chomsky as deleted, we cart also think of them as shared by the two conjuncts.",
        "'Phis structure can be represented as follows:"
      ]
    },
    {
      "heading": "Mary a hook",
      "text": [
        "John gave and by Cliomsky Peter 0 paper Prom the result of the previous section, each conjunct must share not just the phonological material, but also the syntactic structure and the lexical meanings.",
        "There are three main methods by which this sharing of structure can be achieved: phrasal coordination, 3 1) coordination, and processing strategies.",
        "PHRASAL COORDINATION At first sight, analysing non-constituent coordination lining phrasal (i.e. constituent) coordination seems nonsensical.",
        "This is not the case.",
        "(foordinations are classified as non-constituent coordination if the conjuncts fail to be constituents in a 'standard' phrase structure grammar.",
        "However, they may well be constituents in other grammars.",
        "For example, it has been argued that the weaker notion of constituency provided by Categorial Grammars is exactly what is required to allow all conjuncts to be treated as constituents (S teed man 1985) .",
        "Phrasal coordination is exemplified by the schema",
        "'Mere have been various arguments (stemming from Ross 1967) for the adoption of a variant of this schema, in which the coordinating conjunctions is associated solely with the last conjunct.",
        "The schema is revised as follows:",
        "The shared material is necessarily treated identically for eaeli ccaljunct, since there is only a single copy: the, conjunction.",
        "is embedded in a single syntax tree.",
        "'flue phrasal coordination schema requires each con-Patel, to be given a single type, and for the conjuncts and the conjunction as a whole to be of the same type.",
        "Problems with the latter requirement, were pointed out, by Sag et al., (if 985), who gave the followitig court-t ere xam pies: 15) a We walked slowly and with great care I) Pat is a Republican and proud of it, C I aTil hoping to gel, an invitation and optimistic about my chances Sag et id.",
        "deal with these examples by treating, categories as feature bundles, and allowing coordination in cases wItere there are features in common, For ex-ample, the two conjuncts iii (15a) share the feature +MANN('R:i.",
        "As it stands, the account, does not deal with examples such as the following, 1(i) TNT deliver efficiently and on Sundays here the adverbial phrase would presumably be 1 MANNER.",
        "and the prepositional phrase, -I-M111'.",
        "Further examples which are problematic for Sag et, al.",
        "are given by Jorgensen and Ala:did, (1992).",
        "An alternative, suggested by Morrill (1990) and to Jorgensen and A bei116, (1992), is to use the following coordination schema: AVY - X Conj \"3/ clots not, impose any condition that the two categories X and Y share anything in common.",
        "However, the new category XV Y is used to ensure that both categories are appropriate in the context.",
        "For example, (I 5b) is acceptable since the coordination type is NPVAP, and is subcategorises for both NI's and A Ps.",
        "A rather more difficult problem is that of providing types for all possible conjuncts.",
        "Consider the following: 17) a Sue gave Fred Ii book and Peter a paper b Mary admires and Sue thinks she likes Peter (a) is a conjunction or two pairs 41101111 I)) is a case or 'unbounded Right-Node Raising' where the noun phrase PcIer ie embedded at different depths in the two conjuncts.",
        "There have been two main approaches to dealing with examples such as (a) using, phrasal coordination.",
        "'the first is to introduce an explicit product operator (e.g. Wood 1988), allowing types of' the form Nl'i(NP.",
        "The second is to use a calculus in which types can undergo 'type-raising' (e.g. i)owty 1988), or Call he formed by abstraction (as in the Lambek ('alcolus, Lantbek .1958).",
        "The effect is to treat Fred a book as a verb phrase missing its verb.",
        "''Sag et al.",
        "also suggest, an ilivc e treatment using an apparently otherwise, unmotivated grammar rule Adv.",
        "!' --)• ilhe advantage of adopting a general abstraction mechanism, as in the Lainbek (MIculus, is that this also provides a treatment of eXaMples such as (b).",
        "I1n-1(atunately, the ability to perform abstraction of categories with functional types (which is required For (a)) also allows shared material to get different syntactic analyses, resulting in acceptance of all the sentences predicted by deletion accounts where identity of lexical categories and lexical semantics is respected, but not identity of syntactic structure, Reconsider: 18) *I saw [a friend of] and [the manufacturer of] Mary's handbag We can obtain identical syntactic types for a friend of and the manufacturer of by subtracting the lexical types of I, saw, Mary, 's, and handbag from the sentence type Since the types are identical, coordination can then take place.",
        "Thus the ability to `subtract' one type from another allows the Larnbek Calculus to replicate a deletion account, and it, thereby suffers from the same problems.",
        "There have been some proposals to restrict, the Laura* Calculus in order to prevent such overgeneration.",
        "13arry and Pickering (1993) propose a calculus in which (17a) is dealt with using a product operation, and abstraction is limited to categories which do not act as a function M. the derivation.",
        "This account, makes reasonably good empirical predictions, though it does fail for 1.1m, following examples:",
        "19) a You can call me directly or after :11)01 through my secretary b Sue put a lamp on the table, and on the ledge it large antique punchbowl",
        "In (a), each conjunct contains different numbers of modifiers of different types (an adverbial phrase with two prepositional phrases).",
        "In (b) the subcategorisation order is swapped in the two conjuncts.",
        "Successful treatment, of non-constituent coordination using phrasal coordination seems to require elaborate (mewling in the conjunct type of a simple generalisation: conjuncts can coordinate provided they are acceptable within the same syntactic context.",
        "The 3-D approaches and processing strategies use syntactic context more directly, and it is to these methods which we now turn."
      ]
    },
    {
      "heading": "3-D Coordination",
      "text": [
        "Let, us briefly reconsider our explanation of deletion.",
        "Fixample (Ii) was explained by saying that, the two strings by Chontsky and ,Slue gave are deleted under some notion of identity.",
        "Ilowever, we could equally well have described this as a process whereby the first instance of by Chontsky is merged with the so!owl.",
        "(under some notion of identity), iial the second instance of Stte gave is merged with the first.",
        "'The type given to both conjuncts, using reasonably standard type assignments amen `Lainbek' notation, would be: MNP \\((NI'Vri)/NP\\S))/N1')/(NIANII/N1))/ N1'",
        "Merging word strings instead of deleting them does not help with the problems of deletion accounts which we outlined earlier.",
        "In particular, it does not help to exclude examples (9a) and (9b) which suggest shared material must have identical syntactic structure.",
        "However, once we have started to think in terms of merging, there is an obvious next step, which is to move from merging of word strings to merging of syntax trees.",
        "This is the move made by Goodall (1987), who advocates treating coordination as a union of phrase markers: \"a 'pasting together' one on top of the other of two trees, with any identical nodes merging to-gether\" (Goodall, 1987, p.20).",
        "We can visualise the result in terms of a three-dimensional tree structure, where the merged material is on one plane, and the syntax trees for each conjunct are on two other planes.",
        "For example, consider the 3-1) tree for example (17a) given in Fig. 1.",
        "The merged part of the tree includes all the nodes which dominate the shared material Sue gave.",
        "The conjuncts retain separate planes (denoted here by using dotted and dashed lines respectively).",
        "(loodall's account does not deal with examples such as (17b), which he argues to be examples of a different phenomenon.",
        "however these can be incorporated into a 3-1) account (e.g. Moltmann, 1992).",
        "There are various technical difficulties with Goo-(tars account (see e.g. van Oirsouw, 1987, and Moltmann, 1992).",
        "There is also a fundamental problem concerning semantic interpretation of coordinated structures (see Moltmann, 1992 which provides a revised and more complex 3-1) account based on iMinidz, 1991).",
        "For coordination of unlike categories, as in the examples in (15), Goodall proposes a treatment somewhat similar to Sag et al.",
        "(1985).",
        "However there is still a problem in dealing with examples where there are different numbers of modifiers, such as (19a) or the following: 20) a We can meet at the office or in London outside the theatre b TNT deliver efficiently and after 5pm in Edin-biirgli Consider example (b).",
        "The syntactic structure appropriate for TNT deliver efficiently has one S node and two VP nodes.",
        "However, the structure for TNT deli-cep after 5pm in .Edinbuigh requires one S node and three VP nodes (or three S nodes and one VP node).",
        "The two structures therefore fail to merge since the structure dominating the shared material TNT deliver must be identical.",
        "The use of ordered phrase structure trees also excludes examples such as (19b).",
        "In summary, the 3-1) approaches correctly enforce identity of syntactic structure for shared material.",
        "However, the way of characterising syntactic structure using (parts of) standard phrase structure trees results in an overly strict requirement of parallelism between the conjuncts.",
        "We will now consider processing strategies, where syntactic structure of shared material is characterised more indirectly by the state of the parser."
      ]
    },
    {
      "heading": "PROCESSING STRATEGIES",
      "text": [
        "There have been several attempts to treat coordination by adapting preexisting parsing strategies.",
        "For example, ATNs were adapted by Woods (1973), DCGs by Dahl and McCord (1983), and chart parsers by Haugeneder (1992).",
        "Woods and :Dahl 8 McCord's system are similar.",
        "Haugeneder's system has very limited coverage.",
        "In Wood's SYSCONJ system, the parser can back up to various points in the history of the parse, and parse the second conjunct according to the configuration found.",
        "For example, in parsing,",
        "21) John gave some books to Peter and some papers to George",
        "at the point after encountering and, the parser can reaccess the configuration after parsing John gave i.e. a stack consisting of a sentence and a verb-phrase, and an arc traversal by the verb.",
        "The second conjunct is then parsed according to this configuration.",
        "SYSCONJ does not immediately merge the two stack configurations after completing the second conjunct, but, instead, separately parses both conjuncts in parallel until a constituent is completed.",
        "For example, on parsing the sentence,",
        "22) John gave Mary a book and Peter a paper about subjacency acency the SYSCONJ system separately parses Peter a paper about subjacency and Mary a book about subjacency before conjoining at the level of some enclosing constituent (for example the verb phase).",
        "The result is therefore similar to starting with the sentence: 23) John gave Mary a book about subjacency and gave Peter a paper about subjacency",
        "As noted by Dahl and McCord, this mechanism means that SYSCONJ inherits the problems of nonsensical semantics which plague the deletion accounts, since John and Mary are alike is treated the same as John are alike and Mary are alike.",
        "The mechanism also causes problems for dealing with nested coordination.",
        "Consider the sentence: 21) John wanted to study medicine when lie was de-yen, law when he was twelve, and to study nothing at all when he was eighteen The smallest constituent containing to study medicine when he was eleven is the verb phase wanted to study medicine when he was eleven.",
        "flowever, if coordination of the first two conjuncts occurs at this level, it is difficult to see how to deal with the final conjunct.",
        "Both Woods and Dahl McCord use stack based configurations rather than a full parsing history.",
        "Thus once something is popped off the stack its internal structure cannot be accessed by the coordination routine.",
        "This rules out examples such as the following, 25) John gave some books to Mary and papers to George where the NP, some books is coinpleted prior to the conjunction being reached.",
        "Although processing accounts can provide reasonable coverage of the coordination data, the exact predictions often require detailed examination of the code.",
        "'Phis suggests a need for the more abstract level of description which dynamic grammars provide.",
        "DYNAMIC GRAMMARS Dynamics is just the study of states and transitions between states.",
        "It can be used to specify the states of a left to right parser and the possible mappings between states.",
        "For example, Milward (1992b) provides a dynamic description of a shift reduce parser, and a dynamic description of a fully incremental parser based on dependency grammar.",
        "Suitable languages for dynamics are both formal and declarative, and are therefore also appropriate to express linguistic generalisations.",
        "In a Dynamic Grammar (Milward 1992b), each word is regarded as an action which performs some change in the syntactic and semantic context.",
        "For example, a parse of the sentence John likes Mary be comesa mapping between an initial state, through some intermediate states, c„, c1, to a final state cf i.e.",
        "If we use a. dynamic grammar to describe a shift reduce parser, states encode the current, stack configuration, and are related by rules which correspond to shifting and 'reducing '1.",
        "Since there are arbitrarily large numbers of different stack configurations (the stack can be of arbitrary size), the dynamics for shift reduce parsing involves the use of an infinite number of states.",
        "It thus differs from, say Al.'Ns (Woods 'Shift corresponds to: L 1-4 <X> •1, on input ,f1 a word, W, where L is a variable standing for a list of categories, 'ID' is list concatenation, and X is the category for W. Reduce corresponds to <C0 > •L <C0 > •1., on empty input, where Co -} C0 is a phrase structure rule of the grammar.",
        "1973), which have a finite number of states, augmented by an explicit recursion mechanism.",
        "Dynamic grammars can be presented as rewrite grammars by using transition types instead of the more usual S or NP.",
        "For example, to get the parse above we need the lexical entries:' John:cioc„ M ary:cbi – )-cf and a single combination rule schema which states that, For any C1, C2, C3, C11--+C3 C2F-4C2 A string of words is a sentence if it has the type, ci}cf where ci and cf are appropriate initial and final states for a parse.",
        "In a dynamic grammar, any substring of a sentence call be assigned a type.",
        "For example, likes and /Wary can be combined to get the type c51 – bet.",
        "Thus we have an appropriate level to perform substring coordination.",
        "Dynamic grammars may be extended using the following combination rule (and and 07' are both given the special transition type CONJ): For any Cl, C2,",
        "Similar to SYSCONj, this allows coordination when two conjuncts map between the same pairs of states.",
        "Processing is also similar, with the encountering of a conjunction causing backup to an earlier stage in the parsing history.",
        "However, since there is no popping of a stack, the full parsing history is available'.",
        "For example, lien gave some books to Sue has the transitions: lien gave some books to Sue cy – } Ck el – 1' Cut--} Co – } Cf we can then parse papers to ,The using the transitions: paper s to J0t,"
      ]
    },
    {
      "heading": "Co Cf",
      "text": [
        "Since the final state cf matches the state immediately before the conjunction, the two strings can combine.",
        "The resulting transition diagrain is as follows:",
        "Iterated coordination (e.g. for examples such as Mary, Peter and Sue) can be treated in the same way as iterated constituent coordination is treated in phrase structure grammars.",
        "For example, each transition type can be augmented with a feature (-IV-) denoting whether or not, that transition has been iterated.",
        "'the coordination rule becomes: For tiny ('1, C2, CONJ CL-->–C2 Iterated types are formed as follows: En: any Ct., C2,",
        "'the precise grammaticality predictions made by the dynamic approach depend upon the characterisation of the states, and hence depend on the particular parsing strategy which is specified by the dynamics.",
        "flowever there are some general predictions which can be made.",
        "Firstly, consider conjuncts which correspond one to one in the categories of the corresponding words.",
        "Here the conjuncts anist provide the same transitions, and hence must be able to coordinate (this is a reflection of the fact that processing can back up to any point in the parsing history).",
        "predicts that any substring of a sentence can coordinate with itself, and hence that any substring; of a, sentence can act as a conjunct.",
        "loor convenience we will call this the substring hypothesis.",
        "Tins hypothesis has been broadly adopted in (lie work of van Oirsouw 1987, Barry and Pickering 1993, and by work on the Lairibek Calculus (e.g. Moortgat 1988).",
        "Apparent counterexamples are as follows: 26) a, * 'the woman spoke to George and man to Peter b John told [Mary Bill] and [1fred Sue] was corning (Barry and Pickering 1993) However it is difficult to exclude these using syntactic constraints, without also excluding the more acceptable: 27).",
        "a Every woman spoke to George and man spoke to Peter b John told the mothers that their daughters and the fathers that their sons were all at the party' More natural examples where conjuncts are formed by fragments from different constituents arc the following: 28) a 'Idle police found sonic [cars inside] and [lorries outside] the warehouse b :Everyone who 1 [admire most came] and [admire least stayed away] c Mary showed many [friends the weird books] and [colleagues the more respectable papers] written by her mother The relative unacceptability of the examples in (26) is perhaps best explained as clue to violations of into",
        "national requirements, rather than syntactic requirements (cf. Steedman, 1989).",
        "One case where the dynamic grammars correctly violate the substring hypothesis is when a string already involves a coordination.",
        "Here, the internal states are not accessible, so we can't get interleaving of two coordinations, as in: 29) * The girl and the or the boy and the adult came 'l.'here may be an argument for similarly blocking coordination in cases which would involve the breaking apart of idioms or other structures which are not standard cases of lexical subcategorisation.",
        "An example (clue to Mark Steedrnan), which may be such a. case, is the following, 30) One man in [ten spoke against and twenty actually protested] As noted above, the precise grammaticality predictions depend on the kind of parsing model which is encoded in the states.",
        "In Milward (I 992a), the dynamics specifies a word-by-word incremental parser for a lexi-calised version of dependency grammar.",
        "Each state is a recursively defined category, similar to a category in (;ategorial Grammar.",
        "For example, after parsing You can call me one possible state is a sentence missing a sentence modifierl°.",
        "'this state is appropriate as the initial state for a. parse of both directly, or of after 9pin through nty secretary, resulting in a final state of category sentence.",
        "Thus examples such as (19a) are dealt with, since the syntactic context after You can call me does not distinguish between one or more than one subsequent modifier.",
        "'Phis lack of distinction as to whether one or more modifier is expected is actually a necessary prerequisite for performing decidable fully word-by-word incremental interpretation (see Milward and Cooper, 1994, in these proceedings).",
        "Seine of the problems with categories grammar accounts of coordination do reoccur with a dyna,mic account based on the parser used in Milward (1992a).",
        "Vol: example,"
      ]
    },
    {
      "heading": "3 I ) [John] and [Mary thought that Peter] slept",
      "text": [
        "is predicted to be acceptable, as are the following, 32) a [Today John] and [Mary thought that Peter] slept b 1 heard [that] and [that no-one else knew that] Fred won the scholarship This second batcli of examples is particularly difficult to exclude without making changes to the characterisation of the states.",
        "A feature plus or minus tensed verb on each conjunct does block thorn, but is difficult to motivate.",
        "Dynamic grammars can be regarded purely as formal systems, as direct representations of processing, or as something iubetween (for example, in the packed Inl)epencleticy grammar (toes not have VP modifiers",
        "parallel parser described in Milward (1992b), the actual parsing states arC packed versions of 11-1c states in the grammar).",
        "If we consider the dynamics to be a di-reel, representation of processing, then a dependence of linguistic data upon parsing states would only seem plausible if the parsing process corresponds, at least: to some extent, with actual human language processing.",
        "This brings up the intriguing possibility that, we can predict coma-filiation facts from known proi:essing data, and vice versa.",
        "['or example, consider the well known extunple of garden parking: 33) The horse raced past, the barn fell The choice between the use of raced ;AS the main verb, or as part of the reduced relative is usually assumed to be within the fragrlient the horse raced, suggesting that there arc two distinguished parsing states ;titer raced.",
        "Thus this correctly predicts the unacceptability of the following: 371) '\"Flt horse raced [past the barn fell] and [beside Ilse !ledge]"
      ]
    },
    {
      "heading": "CONCLUSION",
      "text": [
        "This paper has sketched various problems with soine of the linguistic accounts of coordination.",
        "It suggested that this was primarily due to difficulty in encoding a proper notion of syntactic context.",
        "'I'he paper [hen considered various processing ;Accounts, where the syntactic context is encoded Within the state of the parser.",
        "Finally it showed how dynamics call he used as a formal description of processing ;accounts which use ;t full parsing history, 111(1 how the characterisations of parsing stales can he chosen to enforce the requisite degree of parallelism between conjuncts."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
