{
  "info": {
    "authors": [
      "Ralf Steinberger"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-1008",
    "title": "Treating 'Free Word Order' In Machine Translation",
    "url": "https://aclweb.org/anthology/C94-1008",
    "year": 1994
  },
  "references": [
    "acl-C92-4190",
    "acl-E93-1022",
    "acl-P92-1026"
  ],
  "sections": [
    {
      "heading": "0 Abstract",
      "text": [
        "In free word order languages, every sentence is embedded in its specific context.",
        "The order of constituents is determined by the categories theme, rheme and contrastive focus.",
        "This paper shows how to recognise and to translate these categories autor.natically on a sentential basis, so that sentence embedding can he achieved without, having to refer to the context.",
        "Traditionally neglected modifier classes are fully covered by the proposed method."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Most languages known as free word order languages are in fact languages with partially free word order (Engelicamp et al.",
        "1992), or rather free phrase order (Schaufele 1991).",
        "A difficulty linked to the formal description of these languages is that instead of a complete lack of ordering rules many subtle restrictions apply.",
        "A large amount of word order variations are grammatical in isolated sentences, but context restricts the number of sequences which are possible and natural.",
        "In this sense, sentences are embedded in their context.",
        "A specific context calls for a certain word order, and the word order of a given sentence reflects its context.",
        "in this paper, we present recent suggestions on how to treat free phrase order in Natural Language Processing (NLP), and present an alternative solution to the problem.",
        "'the idea is to use a thematically-tagged, or flexible, canonical form (CF) for generation, and an' algorithm to recognise the, relevant categories theme, Theme and contrastive focus during analysis.",
        "'this method has been implemented successfully in the unification and constraint-based Machine Translation system CAT2 (Sharp 1989, Steinberger 1992a).",
        "It includes the ordering of modifiers, which are traditionally left out in word order description (Cordon/Evens 1992).",
        "All statements in this paper concern written language, as spoken language is more liberal with respect to ordering."
      ]
    },
    {
      "heading": "2 The Data",
      "text": [
        "We shall start by presenting some data which illustrates the problems related to word order treatment; in NbP.",
        "Many ordering variations are possible (la - le, 2a, 2b), Init some of them are less natural (le), and others are even ungrammatical (2c, 2d).",
        "le is only acceptable if the personal pronoun ich is heavily stressed, indicated here in capitals.'",
        "Depending on the context, different word orders are either required or, at the very least, they are more natural than others.",
        "Although in 3 and 4 the context is represented by questions, it is not normally limited to these.",
        "3a, which is the most natural answer to 3, is very unnatural, if not ungrammatical, in 4.",
        "Although not all contexts restrict the order of constituents as drastically as 3 and 4, it is a general rule for German and similar languages that sentences are more natural if they are properly embedded in their contexts:",
        "The woman waited-for her husband with the rolling pin lb ??",
        "Die Frau erwartete wit dem Nudelholz ihren Mann.",
        "The woman waited-for with the rolling pin her husband It is generally acknowledged that the combination of several factors determines the order of constituents in German and similar languages.",
        "In :Steinberger (1994), eleven principles acting on the pragmatic, semantic and syntactic levels are listed, each of which can be reformulated as one or several linear precedence (LP) rules.",
        "The factors comprise of the tendencies to order elements according to the theme-rheme structure and/or td the functional sentence perspective.",
        "Furthermore, they concern verb bonding, anirnacy, heaviness, the importance of semantic roles for phrase ordering, and others.",
        "A distinct feature of the ordering regularities is that none of the factors can be formulated as an absolute LP rule, which makes word order description difficult to deal with in NLP.",
        "In recent years several propositions were made to deal with this phenomenon in either analysis or generation, or both."
      ]
    },
    {
      "heading": "3 Recent Suggestions on Treating Free Phrase Order",
      "text": [
        "Uszkoreit (1987) suggests overcoming the lack of absolute rules by using disjunctions of LP rules.",
        "The idea is that if at least one LP rule sanctions a sequence of constituents, the sentence is grammatical.",
        "The model thus expresses competence, rather than performance, as it either accepts or rejects a sentence, without making a judgement on acceptability differences as in 1.",
        "Another idea put forward by Erbach (1993) accounts for grades of acceptability.",
        "Fr-bach assumes that the order of verb complements ideally is according to an obliqueness hierarchy, and that each deviation from this order decreases the acceptability of the sentence by a factor of 0.8.",
        "Two divergences result in an acceptability score of 0.64 (0.8 * 0.8), etc.",
        "Problems we see linked to this approach are the use of the obliqueness hierarchy, which limits the preference mechanism to complements, and the fact that every diversion decreases the score invariably, without considering the varying effect of different variations.",
        "A proposal which takes into account the different importance, or weight, of preference rules, is presented in .Jacobs (1988).",
        "Jacobs assigns each of his preference rules a specific numerical weight.",
        "If a rule applies in a given sentence, its value is added to the acceptability score of the sentence, if it is violated, its value is subtracted.",
        "l'he higher the final score, the more natural, or the`batter' the sentence is.",
        "Ideally, all competing preference rules are satisfied.",
        "The complication we see with this approach is that some strictly ordered sequences interfere with the calculation of acceptability.",
        "Some of them concern the ordering of toners (Abtiinungspartikeln; Thurmair 1989) and other modifier subgroups (Steinberger 1994).",
        "Some of the criticism could be overcome by changing the different propositions slightly.",
        "For instance, Erbach's (1993) suggestion to add preference to feature-based formalisms could be combined with Uszkoreit's preference rules.",
        "An idea to solve the problems linked to Jacobs' weighing mechanism would be to combine it with absolute 1,1' rules, in order to avoid ungrammatical sequences.",
        "I however, we want to suggest another method, based on our findings concerning natural, marked and ungrammatical word order, and making use of the categories theme, theme and contrastive focus (henceforth simply called focus)."
      ]
    },
    {
      "heading": "4 The New Model",
      "text": [
        "In our approach (cf. Steinberger 1994), we have different ways of dealing with free phrase order in analysis and generation.",
        "In analysis (cf. section 6), grammars have to allow most orderings, as barely any phrase order can be completely excluded.",
        "Once a structure is assigned to an input sentence, we suggest that thematic, Thematic and contrastively focussed elements be identified by using our insights concerning the recognition of these categories.",
        "This information concerning functional Sentence perspective can and should be conveyed in the target language of the translation.",
        "With respect to generation (cr.",
        "section 5), acceptable orderings are defined by a single comprehensive linear precedence (LP) rule which not only assigns strict priorities to symbols tagged for syntactic category (e.g. N for nominative NP, SIT for situative complement, M for modifier), but also for the thematic categories theme, rhemc and contrastive focus.",
        "It is crucial that the relative ordering of syntactic symbols can be varied by varying their respective thematic markings.",
        "The LP rule also assigns priorities to syntactic categories which are not thematically marked.",
        "Thus,, a syntactic element is assigned a default position if no thematic information is available, but is moved out of this default position if thematic information is present.",
        "In this way, a single rule represents a fixed canonical form for unmarked elements and at the same time permits widely varying (though riot truly free) orderings for thematically marked cases.",
        "Generation and analysis according to this method will be presented in more detail now."
      ]
    },
    {
      "heading": "5 Generation.",
      "text": [
        "We argue in Steinberger (I 994) that the use of a comprehensive LP rule, as presented in the previous section, is an efficient way of generating sentences which not only are correct I II some contexts but which comply with their contextual restrictions.",
        "This flexible output is achieved by using the three titematic categories theme, rhc-mc and contmstive focus, which can capture complements as well as Inodifiers re.",
        "raised by all phrasal categories.",
        "Table 1 shows such a CI' for (tentian.",
        "The table is to be read from left to right and from top to bottom.",
        "The letters N, A, I), G represent the four cases nominative, accusative, dative, and genitive.",
        "PO stands for prepositional object, and SIT, DlR and EXP for Si T11 Ai ye, directional and expansive ccom-plements.",
        "Nom and Adj are nominal and adjectival complements, M represents the diverse groups of tnodi tiers.",
        "The feature +/-d refers to definiteness, -I/-a to animacy, SVC to support, verb constructions, and the index numbers to M indicate the relative order of modifiers (M1 precedes M2, and so on).",
        "The index numbers are based on lIoberg's classification (1981).",
        "If elements cannot cooccur, they are separated by a slash (/), as opposed to by an arrow (<).",
        "The CI' imposes linear order on an unordered set of arguments and modifiers.",
        "‘Vhen the analysis of the source language fails to recognise tlierne, rheme and focus, a default order is generated.",
        "Although no C sequence can produce good sentences in all contexts (cr.",
        "3 and 4), the default order is suitable in a large amount of contexts.",
        "Before showing some example sentences generated by this CT, we have to mention one particularity of German, which is that the verb is in second position in declarative matrix clauses (verb-second, or V2 position), and in final position in subordinate clauses (verb-final, or VF position).",
        "Nearly any element can take the one position preceding the verb in V2, called the Vorfeld (\"pre-(verbal) field\").",
        "Normally a thematic element is placed into the Vorfeld.",
        "According to Hoberg's (1.981) analysis of the Mannheimer 17uden Korpus, in 63% of all V2 sentences the nominative complement (subject) takes this place.",
        "A convenient way of seeing it is that all elements follow the verb in V2 position according to the CT, and that one (thematic) element is moved into the Vorfeld position.",
        "We suggest that if the analysis of the source language fails to recognise the thenie of the sentence, the subject takes this place.",
        "In our model, most elements can either be thematic, rhematic, or neutral (i.e. unmarked with respect to theme and rheme).",
        "Sentence variations as different as shown in the examples 5a to 5d can be generated using the canonical form presented above, depending on the parameterisation of the features theme, rherne and focus for the different constituents.",
        "The order of elements in 5a corresponds to the default order.",
        "However, the same order would be generated if the personal pronoun was marked as being thematic, and/or if the adverb gestern was rhematic.",
        "We put the information -1-theme in 5a to 5c in brackets to indicate that this feature is not a requirement to generate the respective word orders.",
        "The relative order of the adverb and the accusative NP in 51) differs from the one in 5a, because the object den Mann is thematic.",
        "1-n 5c and 5d, g es tern and den Mann axe thematic, respectively.",
        "In addition to this, the personal pronoun in 5d is marked as being stressed contrastively.",
        "We used capital letters to express the obligatory focus.",
        "11 is easy to think of more phrase order combinations caused by further pararneterisa-tions.",
        "'Me man have yesterday I seen.",
        "Modifiers should be classified according to Itoberg's (1981) 44 modifier position classes, which partly coincide with the common semantic classifications, and partly not.",
        "Boberg's modifier indexes are the result of the statistical verification of Engel's intuitive classes (1970).",
        "As modifiers do not always follow in the same order, Moberg chose a classification which lead to least deviations between her classification",
        "and the order in the corpus used (Mannheirner Duden Korpus).",
        "The following sentences exemplify the order of the CF for modifiers:",
        "Due to the procedure described in this section, ungrammatical sentences such as 2c and 2d can be avoided successfully."
      ]
    },
    {
      "heading": "6 Analysis",
      "text": [
        "The generation of contextually embedded sentences is based on the successful analysis of theme and theme constituents.",
        "The recognition of contrastive stress is even more important.",
        "A basic fact that can be used for the automatic recognition of these categories is that not only the context determines the ordering of constituents in an embedded sentence, but also a given sentence carries information on the context to which it belongs.",
        "When German native speakers sec the sentence 3a/4b, for instance, they have a strong feeling about the context in which it occurs.",
        "It is very likely that the NP threw Mann is stressed.",
        "It is either rhematic, or it carries contrastive focus.",
        "Ile is even more restricted.",
        "f.l.'he personal pronoun ich roust be contrastively stressed (I myself ant the person who visits him).",
        "In every context requiring another stress, 1.e is ungrammatical, It is thus possible to extract information on the context of a given sentence without having access to the preceding sentences.",
        "Analysis grammars must allow most constituent order variations, as the number of phrase orders that can be excluded is very limited.",
        "The difference with generation grammars is that it is sufficient to generate one 'good' phrase order for each context, whereas in analysis all possible variations have to he allowed.",
        "For this reason, the CF is of no user for analysis.",
        "Instead, analysis grammars should allow all grammatical orders and identify thematic, thematic and focussed phrases.",
        "In our algorithm, the number of possible themes and rhernes is limited to one constituent each, as this is sufficient to generate the variations in 5 to 7.",
        "Firstly, focus should be identified, and after this theme and theme.",
        "Some permutations are only possible if one constituent is stressed contrastively.",
        "These constructions include the Volfeld position of some typically rhernatic elements (8, 9), the right movement of constituents which have a strong tendency to the left (cf. le and 5d above), and others (Steinberger 1994).",
        "In the next step, the theme category is identified.",
        "Every element at the beginning of the clause is marked as a theme if it has not been identified as a focus in the preceding step (10,11):",
        "Similar to flajiZ\":ova, et al.'s (1993) suggestion for English, and to Matsubara et, al.'s (1993) for Japanese, the last constituent of the sentence will be recognised as rhernatic, as Themes tend to occur sentence-finally (cf. 5a and fib).",
        "Our approach differs from et al.'s, however, in that we prohibit some elements from being thematic.",
        "In German, these inherently non-rhernatic elements include personal pronouns, as well as a limited set of modifiers such as ?void in 12.",
        "Although some modifier groups tend to be potential Themes, and others do not, most modifiers must be coded individually in the dictionary (Steinberger, 11994).",
        "Note that if inherently non-rhernatic elements occur sentence-finally, it is",
        "likely that; either the verb in V2 position, or the Vorfeld element carry heavy stress (12a vs. 12b).",
        "HajiZ:owi, et al.",
        "(1993) suggest that verbs are generally marked as rhemes, except if they have very general lexical meaning (such as be, have, happen, carry 01Li, become).",
        "As our main concern is word order, arid German verb placement is restricted by rules which do not allow variation, our algorithm does not allow the recognition of verbs as 'themes.",
        "In 12, no constituent would be recognised as being thematic.",
        "Not all languages express theme, theme and focus as distinctly by word order variation as German does.",
        "Either they rely on the context to find out which constituents (have to) carry stress, or they use other means such as clefting, pseudo-clefting, topicalisa-tion, dislocation, voice, impersonal constructions, particles, and morphological as well as lexical means (Foley/Van Valhi 1985).",
        "However, even in English, which is often referred to as a fixed word order language, i n formation on theme and rheme can be extracted automatically (Haji(xvii, et.",
        "al.",
        "1993; Steinberger 1992a).",
        "To which degree this information is conveyed in other languages, and by which means, must be subject to a language pair-specific investigation.",
        "The extraction of information on theme, rheme and focus is more important when translating from one free phrase order language into another, than when translating into a fixed-word order language.",
        "However, there are independent reasons for recognising the sentence focus, namely the correlation between stress on the one hand, and scope of negation (Payne 1985) and of degree modifiers (Steinberger 1992b) on the other."
      ]
    },
    {
      "heading": "7 Ambiguity Resolution",
      "text": [
        "Findings on natural, less natural and ungrammatical word order variations can also be used to improve sentence analysis with respect to some cases of ambiguity resolution.",
        "In the case of 13, cher can be recognised as denoting earlier (eher26), as the homonymous adverb (eher,„ \"rather\") must not be negated.",
        "Furthermore, some cases of unlikely PP attachment can be nearly excluded.",
        "In the PP expressing location (vor der Bank) is unlikely to be a sentence modifier, as this would result in contrastive focussing of the personal pronoun ihn.",
        "This can be seen in 15, where the PP cannot be an adjunct to the preceding NP, because the NP is realised as a pronoun.",
        "The PP in 14 is thus more likely to be an adjunct to the nominative NP der Mann (1.4a) than a sentence modifier (14b).",
        "The general principle is that focussing constructions are relatively unlikely to occur in written text, and therefore one should avoid the analysis involving focus when another analysis is possible.",
        "This is the case when the analysis of the PP as an adjunct results in a sentence without contrastive stress.",
        "Therefore has the reran in-front-of the bank him seen (Therefore the Mall in front of the bank has seen him) Ida Deshalb hat der Mann vor der Bank ihn gesehen.",
        "HI) ?",
        "Deshalb hal, der Mann vor der Bank IIIN ig-noriert.",
        "15 ??",
        "Deshalb hat er vor der Hank IIIN gesehen.",
        "Therefore has he in-front-of the bank him seen"
      ]
    },
    {
      "heading": "8 Conclusion",
      "text": [
        "'Ile order of constituents in free phrase order languages is determined by a set of factors which constitute tendencies rather than clear-cut rules.",
        "The fact that most, but not all, constituent; orders are possible, and that sonic",
        "orders are more natural than others poses a considerable problem for 1\\1,P.",
        "In this paper, we presented a method to deal with these problems from the analysis and the generation point of view.",
        "Concerning analysis, the main idea is that single sentences reflect the therne-rheme structure imposed by the context, so that thematic, rhematic and (contrastively) focussed constituents can often he recognised.",
        "In generation, we can convey this knowledge by differing word order depending on the context.",
        "This is achieved by using a canonical form which includes the flexible categories theme, Theme and contrastive focus.",
        "A major advantage over methods suggested in the past is that acceptability differences between sentences cart be dealt with, and that even modifier sequences, which are traditionally left out in word order description, can be handled.",
        "Wrong constituent orders are avoided, because the order of the major part of the sentence is fixed, and only single constituents move to the theme and rInnne positions.",
        "The difficulty arising from the unclear borderline between free and fixed phrase order, which is typical of most free phrase order languages, is dealt with successfully."
      ]
    },
    {
      "heading": "9 Bibliography",
      "text": []
    }
  ]
}
