{
  "info": {
    "authors": [
      "Shin-ichiro Kamei",
      "Kazunori Muraki"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2124",
    "title": "A Discrete Model of Degree Concept in Natural Language",
    "url": "https://aclweb.org/anthology/C94-2124",
    "year": 1994
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Degree words in natural language, such as 'often' and 'sometimes,' do not have denotations in the real world.",
        "This causes some interesting characteristics for degree words.",
        "For example, the correspondence between the English word 'often' and the intuitively corresponding Japanese word is not obvious.",
        "This paper proposes a conceptual representation to describe a wide range of linguistic phenomena which are related to degree concepts in natural language."
      ]
    },
    {
      "heading": "1 introduction",
      "text": [
        "Degree words in natural language, which are exemplified by the following, exist across parts of speech and across specific languages.",
        "(1) a. quantifiers: all, many, sonic, few, no b. adverbs: always, often, sometimes, seldom, never c. adjectives: tall, short",
        "Degree words have some interesting characteristics.",
        "First, quantities in the real world which can be represented by degree words vary pragmatically, depending on speakers, situations, etc.",
        "(Fauconnier, 1975).",
        "This means that degree words do not have denotations in the real world.",
        "However, many degree expressions are used in daily life and it is not felt that they are particularly incomprehensible.",
        "The authors do not think that to understand the meanings of degree words is to understand the real quantities in the real world.",
        "Second, it is difficult to compare degree words in different languages.",
        "In the case of the English non-degree word 'dog,' we may think that the word semantically corresponds to the Japanese word 'inn' because these two words refer to the same object 'dog' in the real world.",
        "However, this correspondence is not true of degree words.",
        "The English word 'often' intuitively corresponds to the Japanese word `shibashiba,' but this correspondence is not obvious.",
        "That is because these words do not have denotations in the real world.",
        "These characteristics are related to the base of Machine Translation and its dictionaries.",
        "Even when the real quantity, which is referred to by a degree word in a text, is not clearly understood, it is usually believed that it is possible to translate the word into another language.",
        "When building bilingual dictionaries, it is necessary to consider the correspondence between degree words in each language.",
        "A new reference framework is needed by which to investigate to what extent the two words correspond to each other.",
        "These issues are also related to conceptual descriptions in large scale knowledge base projects, which have started recently.",
        "Third, degree words have some characteristics which are independent from parts of speech.",
        "One of the phenomena, degree words have in common is modification restrictions between degree words and degree intensifiers.",
        "Each degree word has its own modification restriction (Bolinger, 1972; Quirk, 1985; Kamei, 1988, 1990).",
        "For example, 'all' and 'no' can be modified by 'almost,' but `tall,\"short,\"many,' and 'few' cannot usually be so handled.",
        "On the other hand, 'tall,' `short,' `many,' and 'few' can be modified by 'very,' but `all' and `no' cannot.",
        "'Some' and 'sometimes' cannot be modified by either 'very' or 'almost.' Previous researchers pointed out a lot of important linguistic phenomena which are related to degree words but the issues described above were left uninvestigated.",
        "Barwise and Cooper (1981) investigate relations between determiners in English and generalized quantifiers in logic.",
        "However, they (lid not focus so much on degree words, such as adjectives and adverbs in general.",
        "It is still undetermined how to fully comprehend such words as 'many' and 'a few.' Gazdar (1979) and Hirschberg (1985) introduced ideas of a linear ordering of degree words and treated a wide range of phenomena related to degree words.",
        "However, they directly handled real words and treated 'positive words' such as 'all' and 'many,' and 'negative words' such as 'few' and `no' separately.",
        "Relations between the positive and negative words were not clear.",
        "In order to comprehend these unsolved linguistic phenomena, the authors propose a semantic model of degree concepts."
      ]
    },
    {
      "heading": "2 Discrete Degree Primitives",
      "text": []
    },
    {
      "heading": "and a List Expression",
      "text": [
        "This section introduces discrete degree primitives and a list expression to represent meanings of degree concepts.",
        "From the perspective of quantities in the real world, 'many' and 'some' are similar.",
        "However, The modification restriction between degree words and degree intensifier shows that each word is normally modified by intensifiers selectively.",
        "This suggests the existence of DISCRETE degree concept primitives, which are independent from parts of speech.",
        "The authors introduce five basic semantic primitives (`A,\"M,\"S `F,' and 'N') indicating degree that are abstracted from the meanings of `all,\"many,\"some,\"few,' and `no.' A list of degree primitives is used to describe meanings of degree words in terms of relative positions in the list expression.",
        "(2) M, S, F, N} The list expression above is a basic list of the discrete model.",
        "The authors divide meanings of degree words into two parts.",
        "For example, 'tall' and 'short' can be divided into the semantic axis regarding 'tallness' and the degree concepts 'many (much)' and 'few (little).' Tables 2 and 3 represent the latter part of meanings of degree words.",
        "In these lists, means that the value in that particular position is lacking.",
        "not real words and that they consistently describe relationships that are independent from parts of speech.",
        "These are important differences between this model and previous research reports."
      ]
    },
    {
      "heading": "3 A Dual List Expression of Degree Concept",
      "text": [
        "It is pointed out that degree words convey non-literal `conversational' meanings when they are used.",
        "The difference between a literal meaning and a conversational meaning is called 'Conversational Implicature' (Grice, 1967).",
        "This section explains how this model treats this aspect of degree concepts."
      ]
    },
    {
      "heading": "3.1 Question and Answer",
      "text": [
        "To exemplify Conversational Implicature, let us consider the following sentence, which includes a number.",
        "not tall and not short {-, S, -} short 1-, -, F} The authors think that degree words are identified by their relative positions in the list expression.",
        "It is true that quantities in the real world, which are expressed by degree words, are continuous.",
        "However, the authors think that language treats degree concepts in a discrete way.",
        "Table 3 shows modification restrictions on degree intensifiers using the primitives.",
        "In this table, '+' shows that the intensifiers can modify the degree primitives, and 4–' shows the intensifiers cannot modify the primitives.",
        "Note that these primitives are A natural interpretation of this sentence is \"I solved just three of the problems, not all or four or two or one or none of them.\" However, in a logical way, this statement is true, when \"1 solved FOUR of them.\" For example, if the border line between success and failure of a test is three, this sentence is naturally spoken, even when, in fact, the person solved four of the problems (Chomsky, 1972; Ota, 1980; Ikeuchi, 1985).",
        "The following is a Yes/No question corresponding to sentence (3) and its answers.",
        "Interestingly, both of the answers below are possible in this case.",
        "(4) A: Did you solve three of the problems ?",
        "B: – Yes, in fact I solved four.",
        "– No, I solved four.",
        "In order to handle these phenomena, more complex states than just 'three' for the meaning of the number three are needed.",
        "The authors think that five states are actually needed for clarity: (1) All problems are solved.",
        "(2) The number of solved problems exceeds the number which appears in the sentence (=three in this case).",
        "(3) The number of solved problems is exactly the number which appears.",
        "(4) The number of",
        "solved problems does not total the number which appears.",
        "(5) No problems are solved.",
        "The authors introduce time five primitives, `A,\">u,\"=n,\"<n,' and 'N,' corresponding to these live states, respectively.",
        "A list expression is introduced as follows.",
        "Therefore the answer is `Yes.' This intersection operation is a simple and natural way to calculate possible answers to a question which includes a number.",
        "express the Conversational Implicature, the authors represent the meaning of the number part in sentence (3) with a dual list.",
        "The upper row (the direct meaning; row) in this representation shows the state wherein the number of solved problems is the number that appears in sentence (3).",
        "The lower row (the possible interpretation row) expresses the possible numbers of solved problems, when sentence (3) is spoken.",
        "For example, this statement is false, when \"I: solved TWO of them.\" Logically, however, this statement is TRUE, when \"I solved FOUR of them.\" dual list represents the first phenomenon.",
        "The difference between the two rows, 'A' and '>11' in this case, expresses the possibilities of Conversational lnplicature.",
        "When this sentence is spoken, the degree part of this sentence conveys the meanings which correspond to :130111 of the rows in the dual list.",
        "'['hat is, it not only is indicated by the upper 'direct' row, but also by the lower 'possible' row.",
        "In an affirmative sentence, the upper 'direct' meaning may be dominant.",
        "However, in the case of an interrogative sentence, the lower 'possible' meaning plays a more important role.",
        "This model explains the two possible answers in utterance (4) in a simple way.",
        "In Fig. 1, the meaning of the question is expressed with a dual list.",
        "The meaning of the real situation (the meaning of 'four' in this case) is expressed with a single list (in the middle), because it is not an interpretation, but is a situation.",
        "\\A/hen comparing the upper row of the question and the row expressing the situation 'four,' there is no common value.",
        "There is no intersection between them.",
        "This case corresponds to the answer with `No.' When comparing the lower 'possible' row and the situation, there is an intersection, that is, the value `>11.'"
      ]
    },
    {
      "heading": "3.2 Negation Operations",
      "text": [
        "This section introduces Negation Operations, which are defiled 00 the dual list representation.",
        "Sentence (7) is a negative sentence which corresponds to sentence (3).",
        "A negative sentence like this has several interpretations which previous research has pointed out nit has not been able to treat satisfactorily.",
        "This model calculates all the possible interpretations of a negative sentence from the representation of the original affirmative sentence.",
        "(7) I didn't solve three of the problems.",
        "One possible interpretation of sentence (7) is that there are three problems that \"I did not solve\" (Interpretation A).",
        "In this interpretation, the number 'three' is not under the influence of the negation; the number is out of the scope of negation.",
        "To obtain this interpretation, it is not necessary to change the dual list for the original affirmative sentence (6).",
        "It is necessary to change the meaning of the values from the number of the solved problems to the number of unsolved problems in the representation of the original affirmative sentence (Fig.",
        "2).",
        "The lower row expresses the possibility that the number of the unsolved problems exceeds three.",
        "Where the number (=three in this case) is within the scope of negation, the negative sentence requires other interpretations.",
        "Response B might mean that some of the problems were solved, but that the number did not reach three.",
        "This interpretation can be obtained from the model shown in Fig. 3, and the negation operation is shown in Table 5.",
        "1.",
        "Reverse each affirmative row.",
        "2.",
        "Select the COMMON part of the two rows.",
        "The result is a new possible interpretation row.",
        "3.",
        "Omit the edge values (A and N).",
        "The result is a new direct meaning row.",
        "Step 1 in Table 5 realizes a primitive negation operation on each row.",
        "This interpretation of the negative sentence is consistent with the negations of both the direct meaning and the possible implication.",
        "Step 2 realizes this condition.",
        "This interpretation usually implies that there are some solved problems.",
        "This means the negation usually does not deny the existence of the solved problems.",
        "However, in a logical way, no problem being solved is a possible situation.",
        "Step 3 realizes this condition.",
        "(9) A: Did you solve three of the problems?",
        "C: No, I didn't solve THREE of the problems: I solved ALL of them."
      ]
    },
    {
      "heading": "Interpretation (C)",
      "text": [
        "The above is a possible utterance, which requires another interpretation.",
        "Table 6 shows the way to calculate this interpretation (Interpretation (C)).",
        "1.",
        "Reverse each affirmative row, 2.",
        "Select the DIFFERENT part of the two rows.",
        "The result is a new possible interpretation row.",
        "3.",
        "Omit the edge values (A and N).",
        "The result is a new direct meaning row.",
        "This interpretation differs from interpretation B, only at Step 2, that is, 'to select the DIFFERENT part of the two rows.' This means that the interpretation is consistent with only the negation of the direct meaning, and does not satisfy the negation of the possible implication.",
        "Step 2 realizes this condition.",
        "This exemplifies that the Conversational Implicature can be canceled.",
        "In speech, stress is put on THREE and ALL in this interpretation, and this linguistic phenomenon is accounted for in Step 2."
      ]
    },
    {
      "heading": "4 Negation of Degree Expres",
      "text": []
    },
    {
      "heading": "sions in Natural Language",
      "text": [
        "In this section, the dual list representation and the operations introduced in the previous section are applied to degree words other than numbers."
      ]
    },
    {
      "heading": "4.1 `All,\"no,\"some,' and 'not all'",
      "text": [
        "Here, we will apply the same model to the relations between `all,\"some,\"no,' and 'not all' in natural language.",
        "Sentence (10-1) logically entails sentence (10- 2).",
        "Sentence (10-2) usually implies sentence (10-3).",
        "However, sentence (10-3) contradicts the original sentence (10-1).",
        "A careless mixture of logical implication and usual implication in language makes the inference of (10-3) from (10-1) unreasonable (Horn, 1972; Ota, 1980; McCawley 1981).",
        "(10-1) All students are intelligent.",
        "(10-2) Some students are intelligent.",
        "(10-3) Some students are NOT intelligent.",
        "The discrete model is a useful tool for describing these relations.",
        "List (11) is used to express relations between `all,\"some,\"no,' and 'not all (=-- some not).' In this case, only three primitives are used.",
        "(n) {A, S, N}",
        "In this list, the value `S' corresponds to the state wherein there are SOME students who are intelligent and SOME other students who are NOT intelligent.",
        "The meanings of these words are also expressed with a dual list.",
        "Figure 7 graphically represents this.",
        "In Fig. 4, the second 'possible' rows of 'all' and `some' have aim intersection at the value `A.' `No' and `not all' have a similar intersection.",
        "This realizes entailment between the two concepts.",
        "Figure 4 also expresses the difference between 'contrary' and 'contradictory.' If 'all' is true,'no' is false.",
        "If `no' is true, `all' is false.",
        "Both expressions cannot be true at the same time.",
        "However, these two CAN BE FALSE at the same time, because it is possible that some students are intelligent and some students are not.",
        "The term 'contrary' expresses this relation.",
        "On the other hand, 'all' and 'not all' have a different relationship.",
        "These two cannot be true at the same time, and cannot be false at the same time.",
        "`No' and `some' have the same constraint.",
        "The term 'contradictory' in Fig. 4 expresses ads relation.",
        "An important point here is that the Sallie operation of negation, Table 5, used for numbers will also obtain the representation of 'not all' front that of 'all' in Fig. 4.",
        "The other negation operation, Table 6, produces nothing in this case (Fig.",
        "5).",
        "The negation operations are basic and general.",
        "Note that '5' in list (11) in this section mentions only the existence of intelligent students and non-intelligent students.",
        "In Section 2, the smile symbol 'S' was used for the meaning of 'some' which is relatively defined in the {A, M, 5, F, N } (list (2)).",
        "In that case, the value 'S' represents a quantitative aspect of 'seine.' A relation between '5' in list (11) and ' = '5' in list (2) is described as follows: (12) S kr, 81- However, the authors used the same value '5' in both lists, because the difference between these two `S's is represented by the set of values in list expressions.",
        "These two 'S's correspond to ambiguities which the word 'some' in natural language has."
      ]
    },
    {
      "heading": "4.2 'Not many' and 'not a few'",
      "text": [
        "This section represents meanings `many,' `a few,' and `few', and applies the negation operations on these concepts.",
        "Figure 6 shows dual list representations for these three concepts.",
        "This figure shows that the difference between 'few' and 'a few' is in the lower possible meaning row.",
        "It is the first time that the difference between the two is explicitly shown.",
        "and 'not a few,' which are calculated from the meaning of 'many' and 'a few' using the negation operations introduced in the previous section.",
        "The negation operations produce two possible interpretations for 'not many.' However, the direct meaning row for one interpretation is lacking.",
        "This shows that this interpretation is logically possible, but unusual (this interpretation is `all').",
        "The other is a usual interpretation of 'not many.' The dual list of the usual interpretation shows that 'not many' does not claim 'few,' but it means less than just 'some not.' The same negation operations also produce meanings of 'not a few.' The dual list of its usual interpretation shows that 'not a few' does not claim `many,' but it means more than just 'some.' Note that the dual list representation and the negation operations on it explain vagueness of 'not many' and `not a few', as well as ambiguities of their interpretations.",
        "This paper introduced eight basic degree primitives for degree concept, that is, `A,\"M,\"S,\"F,\"N,\">n,' `=n,' and '<n.' However, the authors do not claim that these eight primitives are sufficient to indicate all degree concepts.",
        "Instead, the authors claim that people comprehend degree concepts in a discrete way, and that degree concepts are identified by their relative positions in the framework of understanding.",
        "Consider the following examples concerning another degree concept 'several,' which differs from these eight degree concepts.",
        "(13) They legally have several wives.",
        "Quantities, which are referred to by `several' and 'a few,' seem to be close.",
        "It is often said that quantities referred to by 'several' include five or six, and more than the quantities referred to by `a few.' However, sentence (13) shows that 'several' means more than one in this case.",
        "Previous researchers have not been successful in describing the difference between 'several' and 'a few.' The authors think that 'several' should be in a list including 'several' and 'one,' while 'a few' should be in a list which contains 'a few' and 'many.' `Several' implies 'not one,' while 'a few' implies 'not many.' An important point is that the difference between 'several' and 'a few' is not the exact quantity involved, but a framework of understanding, that is, the set of values in the lists and their relative positions."
      ]
    },
    {
      "heading": "4.3 'OR' in Natural Language and Negation",
      "text": [
        "It has been shown that the logical operator 'OR' has characteristics similar to degree concepts (Gazdar, 1979).",
        "This is because 'or' in natural language generally has two interpretations, the `inclusive or' and the `exclusive or.' This section applies the same model for degree concepts to a logical operator 'OR' and `or' in natural language.",
        "It is difficult to conceptualize the negation of 'or' in natural language, in a usual sense, although negation of 'and' is easy.",
        "Logically, however, the negation of the logical operation 'OR' (that is, 'Inclusive or') is `NOR.' However, in a sense in natural language, 'AND' instead of 'NOR' can also be a negation of 'OR.'",
        "Figure 9 shows the relationship between the inclusive and exclusive 'or' and their negations.",
        "The authors use three states: (++), (+ / +), and (--).",
        "'Exclusive or' is a direct meaning of 'or' and 'inclusive or' is a possible interpretation of 'or' in this framework.",
        "The same negation operations will produce the two negations",
        "of 'or,' that is, both NOR and AND.",
        "The direct meaning rows in the two interpretations of negations of `or' have no values.",
        "This corresponds to the fact that it is difficult to consider the negation of 'or' in natural language.",
        "Note that the dual list for 'or' and the dual list for 'some' in Fig. 4 have an identical structure.",
        "It is equally explained that the negation of 'sonic' is difficult to consider in natural language, while the negation of 'all' is easy."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "This paper has presented a new model for degree concepts in natural language.",
        "The characteristics for the model arc: (1) The discrete degree primitives.",
        "(2) The list representation of degree concepts.",
        "(3) The dual list representation for possibilities of Conversational Implicature.",
        "(4) The intersection operation on the list for realizing entailment of two concepts.",
        "(5) The negation operations on the dual list to calculate all the possible interpretations of negation of degree concepts.",
        "Time model describes, calculates, and explains a wide range of linguistic phenomena related to degree concepts, such as (1) Modification Restrictions between degree intensifiers and degree words across parts of speech.",
        "(2) All the possible answers to a. question which contains a quantitative word.",
        "(3) All the possible interpretations of negation of quantitative words.",
        "(4) The difference between 'few' and 'a few.' (5) The vagueness or euphemism of negations of degree words, such as 'not many' and 'not a few.' (6) The difficulty of applying negation for some quantitative words, such as 'some' and 'or.' People use a lot of degree words and communicate with ea.ch other in daily life, even when quantities which are expressed by them may not be precisely understood.",
        "The authors therefore think that natural language in itself has a DISCRETE framework of degree concept, and that both the speaker and the hearer must have a common frame of understanding, before holding a specific conversation.",
        "To understand degree concepts is to understand their relative positions in a discrete frame of understanding.",
        "This is the authors' viewpoint on degree concept communication.",
        "The correspondence between the English word 'often' and the ;Japanese word `shibashiba' has been established and is generally conceded as being appropriate.",
        "However, that is not just because these two words refer to the same real quantity.",
        "What is common between the two is relative position in the multi-window device.",
        "That establishes the correspondence for the meanings of the two.",
        "Tlds model also describes phenomena related to `OR' in logic and 'or' in natural language.",
        "This suggests that the model represents substantial structures in natural language and is a suitable tool for natural language understanding.",
        "The authors hope that this model will be one of the possible extensions of the first-order Logic."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "'Pic authors wish to express appreciation to the late Stephen Cudhea, NEC Corporation, whose classification of English adverbs made this research possible.",
        "The numerous research data were obtained during one of the authors' stay at Computing Research Laboratory (CRL), New Mexico State University.",
        "The authors thank Yorick Wilks, who was Director of CU, Takahiro Wakao, David Farwell, John Barnden, and Stephen Helmreich at CRL 'for their suggestions."
      ]
    }
  ]
}
