{
  "info": {
    "authors": [
      "Kazunori Muraki",
      "Susumu Akamine",
      "Kenji Satoh",
      "Shinichi Ando"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C94-2136",
    "title": "TWP: How to Assist English Production on Japanese Word Processor",
    "url": "https://aclweb.org/anthology/C94-2136",
    "year": 1994
  },
  "references": [],
  "sections": [
    {
      "text": [
        "4.",
        "No irritation waiting for response: very quick response to every key or mouse strokes, 5.",
        "No eyesorefull data on a screen, because capacity of human eyes is very much limited, 6.",
        "Necessary information should be on a screen before user mentions it, 7.",
        "Easy recovery to the preceding screen from any unexpected result on a screen with no anxiety, 8.",
        "System controllability based on system transparency.",
        "The point 1. of simple and fast translation capability affords to the point 4. and the point 8. transparency.",
        "The points 2. and 3. very simple and fast executable retrieving function support the point 4. the point 7. and very much the point 8.",
        "The points 4. through 8. are explicated here from now on.",
        "Whenever TWP 'finds Japanese word end, phrase end or clause end, the translation equivalent is displayed on a screen line for inputting Japanese.",
        "J/E conversion needs scope determination of phrases and clauses.",
        "The TWP iterates scope determination and conversion very explicitly on a screen for realising traceability and transparency of translation.",
        "Two issues are left necessary to explain further.",
        "1.",
        "How to determine a scope of conversion ?",
        "2.",
        "How to find an appropriate type of conversion ?",
        "The figure 2 of intuitive image of J/E conversion depicts the two issues more clearly."
      ]
    },
    {
      "heading": "4.2 How to align a sequence of conversion step ?",
      "text": [
        "The scope determination for conversion is one of key issues to specify comfortable user interface.",
        "The conversion should be carried out successfully at any case.",
        "Otherwise, users cannot rely on the conversion support and have anxiety of operation.",
        "The sequence of conversion steps should also be traceable within a limited human's eye capacity, that is to say, which conversion scope selected by TWP should be able to guess, and what sequence af conversions also should be foreseeable.",
        "User can catch up with every process very easily if user could expect every kind of change on a screen.",
        "TWP's idea to resolve user's anxiety comes from the above observation, to afford to the items 4. and 8. above greatly.",
        "There are two reasonable scope interpretations for J/E conversion on the screenl where a cursor stays just after a Japanese string 444Irdi, te which is composed of two Japanese phrases (bunsetsujs),[fL:11, Subject-rnarker,\"I is the head of this noun phrase \"bunsetsu],[4154:: paper, %k:Object-marker,\"paper is the head of this noun phrase\" hunsetsu].",
        "One of the",
        "alternative scopes is \"V, WA-3c: C(cursor)\", and the other is \"gia: C\".",
        "TWP adopts such a simple strategy as a scope for conversion is the biggest logical unit of words, phrases, and clauses just adjacent to C(cursor) on the left part of input line.",
        "This strategy comes from Japanese intrinsic linguistic structure called head final.",
        "Whenever an input is done, it is transferred to morphological processing to find logical units like word, phrase, and clause.",
        "A logical unit is handed to J/E conversion function to produce English equivalent.",
        "Japanese logical unit has a head word in the right most part of it usually so that every end of Japanese unit is guessed much easier than that of English.",
        "Fortunately popular and robust algorithm of detecting end of unit is widely known and it looks ahead one word or one phrase to decide whether string on the left of cursor is on the end or not.",
        "In practice, TWP may recognize the end of unit more easily by hearing unit end signals from Kana-kanji conversion stroke as well.",
        "TWP can guess scope of logical unit with high precision accordingly.",
        "The screenl and screen2 in the figure 3 shows a selected conversion scope is the left smallest phrase(bunsetsu) which is usually signaled by kanakanji conversion key stroke."
      ]
    },
    {
      "heading": "4.3 Simulated Mode of Automatic J /E Conversion",
      "text": [
        "The \"look ahead\" algorithm detecting conversion scope by finding logical unit described above is also usable in another way.",
        "An already guessed logical unit",
        "A new type translation support is available.",
        "We propose the third type Of translation support system in tills paper, which enables users to eMoy simultaneously both large man-hour reduction provided by the conventional automatic machine translation system, and contentment with the functions l'qought by the dictionary reference and grammatical consultation.",
        "Our new system possesses the following features[4, 5, 6]..",
        "1.. it automatically generates the corresponding English expressions, simultaneously with the execution of inputting each Japanese word, phrase or sentence.",
        "2.",
        "It assists word to word, or phrase to phrase translation, which allows users to control translation process.",
        "3.",
        "It minimizes the number of key strokes for English translation with an aid of fully automatic phrase and simple sentence translation capability.",
        "4. it guarantees that users can be content with an interface by which they can monitor 1.ricl cancel each process of recognition and conversion of every input words, phrases, and sentences.",
        "5.",
        "It greatly assists Japanese native speakers in Preparing English document.",
        "Let us call it \"'Translation Word Processor(' I' hereafter), realizing a very comfortable working platfOrm equipped with a simultaneous automatic Japanese-English conversion facility that contributes to a drastic reduction of key stroke and mouse clicks.",
        "The first type of translation support system or machine translation (automatic translation) system analyzes and generate sentences one by one.",
        "Even now when more ilian ten sorts of machine translation systems are available in the market, all we aro forced to do while waiting for the to to be outputted is to pray that the result may not be like the pieces of wreckageill.",
        "Even if it is not wrecked, we need to recognize damage and spend extra cost fixing it.",
        "The second type is till) bilingual dictionary consultation facility.",
        "This type of assistance systems are already in use on various kinds of word processors[10j, but does not achieve satisfactory efficiency in translation job.",
        "It demands users to set up the dictionary consultation -function, to choose suitable expression out of the displayed words, phrases, and sample sentences, and to arrange thern by key and mouse operations to Produce English sentences.",
        "Even if dictionary reference is quickly and cheaply assisted, most part of English composition work is loft in user's hands.",
        "The third type ,TWE, is designed to visualize the automatic japanese-English conversion(J/E conversion hereafter) process in parallel to inputting Japanese text, :aid to consequencely achieve the best cost efficient perfianiance in a frame work of man and computer interaction.",
        "In the TWP, various supporting functions are provided according to user's English writing capability:",
        "1..conversion of words, phrases and simple sell-fences, 2. pattern based j/E conversion of complex sentences, 3. japanese-English translation DK retrieval, 4. learning function of word and phrase conversion knowledge, and complex pattern conversion knowledge, which helps user to compose lhiglish greatly, 5. automati0 ambiguity resolution in conversion and retrieval designed to reduce the number of Opera Lions necessary for utilizing those assistance funct10118.",
        "ll'or the purpose to achieve user's contentment in Twp operation, 6. flexible \"cancel, \"undo and \"option selection interface are employed.",
        "The accuracy of ambiguity resolution, 7. rises up greatly by continual use of the learning function 4.",
        "A Japanese structural editor with functionsrd stated above, can recognize a logical unit of a word, a phrase and a sentence in sequences of Japanese symbols.",
        "The Japanese English conversion can start automatically at every moment a ja.panese word, a phrase or a simple sentence (called logical units) is recognized.",
        "When more than two simple sentences(clauses) are extracted,",
        "adjacent to a string on a cursor is finally recognized as a logical unit automatically if the string On the cursor could be guessed as a logical unit.",
        "This is called a \"delayed\" type of look ahead algorithm to finding logical bunsetsu units ,which frees users from inputting logical unit end signals when input is displayed from left to right on a screen lino.",
        "This algorithm permits an automatic detection of logical units for conversion.",
        "The figure three depicts clearly an implementation of automatic iterative J/E conversion of TWP.",
        "The ,Iapa.nese input facility is built ill TWP automatically fixes the preceding bunsetsu( smallest phrase) just at the same time as a string adjacent to C(cursor) may be guessed a bunsetsu.",
        "The Screeni bunsetsu candidate \"011 \" with a cursor just after a bunsetsu end marker candidate If is not transferred to J/E conversion here.",
        "The \"tli If \" bunsetsu candidate is determined as a bunsetsu for conversion unit and is transferred to .1/E conversion at the same tone as a bunsetsu candidate \" is guessed on the screen2 011 its right.",
        "The second bunsetsu candidate \" is fixed and transferred to J/E conversion when the next verbal bunsetsu candidated \" is guesses on the screen3.",
        "The Japanese period \".",
        "signals an end of verbal bunsetsu \" ancl triggers j/E conversion of it On screen 4.",
        "Here are three bunsetsns(smallest phrases).",
        "['WP recognizes easily a sentence, all of phrase head words of which have been converted into English, and tra.nsfers three phrases to J/E conversion altogether to produce the English expression on screen5.",
        "The product is well ordered and well translated with the help of simple translation function.",
        "A Japanese and Alphabet mixed display format of intermediate conversion is a convention for user's tracing intermediate steps of j/E conversion easily on a screen.",
        "Japanese symbols in a mixed display convention express Japanese functional words like surface case-marker, conjunct particles, and auxiliary verbs.",
        "They are key information to determine grammatical meaning of head word in a sentence, and to execute structural J/E conversion, which should be transferred to translation component.",
        "That is to say, functional words expressed by Japanese symbols help Japanese users to keep grammatical structure of source Japanese sentence through English Composition on TWP.",
        "'Phose like case markers determine English simple sentence structure with case structure mapping scheme in a J/E bilingual dictionary corresponding to a head verb of a. clause."
      ]
    },
    {
      "heading": "4.4 Screenplay examples of TWP",
      "text": [
        "The :figure 4(a) through the figure 4(c) demonstrate TWP 's .1/ IT translation support primitives.",
        "The first explicates traceablity and transparency of TWP j/E conversion.",
        "The second ex-Amplifies an easy and cheap cancel protocol to achieve user's contentment.",
        "The last shows an examples of dictionary consultation pro-Screenl",
        "cedure on TAArP.",
        "The figure 4(a) traces steps of real responses to Japanese input \"C7.",
        "0.",
        ")5A 471 I// fos, -)- 6A 1 1 \" , where \"/\" marks bunsetsu ends.",
        "This figure is composed of the five top lines of 5 screen copies from 1) down to 5).",
        "The forth line has three converted bunsetsus \"this system,\" \"paper\", and \"make\" and one not converted bunsetsu The bunsetsu \"'L4'4' 7e A \" is converted into the mixed format of \"make f A T \" when and after inputting the forth bunsetsu is completed.",
        "The figure 4(b) shows a cancel and undo protocol of Twp by listing five top lines of consecutive five screens from 1) to 5).",
        "TWP backspace key brings a status 1) to a status 2).",
        "After moving a cursor to \"Iga \" in status 3), an user can edit to have \"'kilt \" instead of \"A3C \" in a status 4).She can get an j/E converted expression of a sentence with \"Aa \":English ill IL position of \"Nildt.",
        ": \":essay only moving a cursor to a sentence end position.",
        "The figure 4(c) is composed of two screens.",
        "The screen 2) with three small windows open depicts what is displayed when dictionary consultation facilities are invoked.",
        "Under a mode of dictionary consultation, moving a cursor to any word either Japanese or English triggers dictionary look up with the word as a",
        "dictionaries and so on.4 TWP operation and process"
      ]
    },
    {
      "heading": "4.1 What meets casual user's requirement?",
      "text": [
        "The figure 1 depicts the configuration of TWP prototype on a structural ed1tor-1 , with the PIVOT translation system as a back iind conversion processor.",
        "The conversion of 'Japanese into English expression starts here with determination of scope to convert into English.",
        "The sequences of key strokes are transferred to morphological processing function for detecting logical units like words, phrases, clauses, etc.",
        "Any j/E conversion of each unit is caned out easily with MT subset of PIVOT I /E translation system as a back end translator.",
        "The structure editor (ideat') on a robust Japanese morphological processing function detects Japanese logical units ;Lnd keeps every strokes aml every processes, during editing , conversion (translation), dictionary look up etc., in order for user to back to any point from unexpected result in English production by cancelling each preceding strokes and processes.",
        "The cancelling protocol between man and computer plays a great role of providing users with the most comfortable operation ability, which is backed up by the high transparency of system process.",
        "The transparency introduced here is composed of two aspects; I) hiding primitive mechanical steps from a screen and showing every and only logical unit level steps of edit and conversion on a screen, 2) letting even phrase, clause .1/E conversion to look like Kana-Kanji conversion to casual lisers.",
        "The similarity of user interface protocol of the one we propose here and the widely acknowledged Kana-Kauji conversion interface lets users to believe in controllability of j/E conversion.",
        "The controllability of J /Ili conversion On I apanese word processors is easily obtainable through the experiences of Kana-Kauji conversion built in 'Japanese word processors.",
        "'The structure editor called \"Ideal)\" [71 can maintains the logical units like words, phrases, clauses and permits users to edit those units so ea,dy while ord ilia.'",
        "apadtese word processors cannot liatidle those logical intik other than characters.",
        "There is a big difference between J/E conversion and Kana-Kariji conversion.",
        "The former requires structural transformation like word order transformation, structural reduction or expansion, and so on, while the latter only handles a Kana sequence to produce a kanji sequence without any modification of the word order in a sentence.",
        "The fully automatic machine translation system can produce English translations of input Japanese sentences, by making word to word translation, phrase to phrase structural translation, clause to clause structural translation, etc.",
        "at once within a second.",
        "User has no chance to see what happens in a translation system, so she gets lost at a glance of the meaningless sequences of word fragments and gets embarrassed in front of pairs of sound Japanese sentence and miserable English output in case of failure in particular.",
        "She, for example, a student in a college, even if she would like to have a sort of help for English composition, never try to use a MT as a tool again, after she incidentally has had an experience to sit beside those kinds of unconceiva.ble screen outputs.",
        "A person like her usually has a fundamental grammatical and lexical knowledge for reading a textbook of English composition.",
        "She needs to be able to imagine how computer works and what it produces, before she starts to learn the operations.",
        "TWP does have a very limited and robust capability of automatic translation with a variety of accessories including it reliable text book function, an useful dictionary function, an easily accessible wording examples database, etc.",
        "as well.",
        "It has been designed for a help for ,Japanese who has basic skill of writing English.",
        "Some of those persons(Group A) who compose English need a very slight help like English dictionary lookup facility, some others(Group B) need a help like various consulting supports of bilingual dictionary, word sense definitions, translation examples, English grammar text books etc., the others(Group C) need a perfect help.",
        "TWP helps Group A and Group B mainly who work on Japanese word processor and English word processor for English production.",
        "They need very cheap, timely, comfortable support, and do not want perfect, expensive support necessarily.",
        "A comfortable support in English composition on word processors includes the followings at least.",
        "1. limited but sound translation facility if available, 2. a variety of word, bilingual, idiom , and wording dictionary lookup facilities, 3. a variety of translation example consultation supports,",
        "There are many resources like the above available in the market and appears the following keen interests of users whenever they use them.",
        "key.",
        "The pull-down window wl is opened to hold conversion dictionary contents of \"essay under a cursor.",
        "The window w2 is opened with \"essay\" as a key in the pull-down window wl for further information of the word \"essay\".",
        "The window w3 has been opened with \"paper as a key in wl.",
        "Lexical information on w2 and w3 comes from conventional bilingual dictionaries.",
        "Any word in w2 or w3 can be selected for a key of dictionary lookup."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "TWP brings about both users' contentment with functions that machine translation has failed to realize, and large cost reduction for sentence generation in target language that simple dictionary consultation facility has not fulfilled.",
        "No other system has ever been presented to satisfy two of them at the same time.",
        "TWP users reserve the means of cancelling and resolving the errors that the TWP or users created.",
        "TWP makes users feel content with processes on a screen by confirming every step of translation with their eyes.",
        "These help them to use it so easy with no anxiety."
      ]
    },
    {
      "heading": "References",
      "text": [
        "[1] Akamine, et.al.,\"English Composition Support Tool\", Proc.",
        "of 43rd conference of -WSJ, 1)1).205-206, 1991 [2] Aizawa, et.al.,\"Foreign Language Word Processor using 13i-directional Translation System\",:Proc.",
        "of 44th conference of IPSJ, pp.147-148, 1991. l3l A kamine, et.al.,\"Inter face Protocol for interactive English Production on Japanese Word Processor\", Proc.",
        "of 44th conference of IPSJ, pp.261-262, 1092.",
        "[4] Akamine, et.al.,\" Form Kana-Kanji Conversion to Kama-English Conversion\", Proc.",
        "of 46th conference of IPSJ, pp.119-120, 1993.",
        "[5] Satoh, et.al.,\"User Controllable Translation based on Complex Sentence Translation Pattern\",Proc.",
        "of 46th conference of IPSJ, pp.121-122, 1993.",
        "[6] Ando, et.al.,\"Translation with Lexical Learning Capability \",Proc.",
        "of 46th conference of IPSJ, 1)1).123-124, 1993.",
        "[7] Nomura, et.al.,\"Japanese Word Processor with Word, Phrase and Sentence Handling Capability\",NI,P-SEG report of IPSJ, 1991.",
        "[8] Eamei, et.al.,\"Lexical Discourse Grammar\", NLCSIG report of Society of Electronics, Information and Communication of Japan, 1986.",
        "[9] Doi, et.al.,\"Lexical Discourse Grammar applied to inter-clausal Parsing (11)\", NLC-SIG report of Society of Electronics, Information and Communication of Japan, 1991.",
        "[10] Tsutsumi, et.al.,\"Editor for MT with Simple Leaning Mechanism\",Proc.",
        "of 33rd conference of IPSJ, pp.1771-1772, 1986.",
        "r, is possible to make English by this system.1 igure 4( b).",
        "Easy and Cheap Cancel Protocol (5) RI=Tidrii4A-1rwl[f,AitOlP#411!Aiiro.oi.",
        "It is possible to kiikotoper by this system.r tt`tAktiOLI) [ri 160, nAlb *betel In.nsel It to inwsible to tinI:e a bssay by his system.-xs ,1[.111,141 i^^ tk.ife talk, octik4.1.1iiAl tios.",
        "ktinto (sIn t'.",
        "'1(7.",
        "(S;11Y1W411.itiL,;.T-.^11Trs--,';:` '\"\"' \"\"\" \"'\"' \" ,frrOAP3A:Ilv4JAllekTeh.71',.,Ts1 ti 3",
        "they are transferred to complex sentence conversion based on user definable complex sentence J/E translation patterns.",
        "TWP can make user reach a target English by their monitoring and controlling Japanese-English conversion process, so that they can feel content with each step of every interactive assistances or automatic processes.",
        "It can also save key strokes for arranging word order as it generates English expressions in a correct word order by conversion capability of a phrase, a simple sentence and a complex sentence, besides word level dictionary consultation facility.",
        "TWP also has proposed a protocol to eliminate redundant user key strokes for selecting menu or commanding process by default reasoning to guess user's next stroke.",
        "This means that no other key strokes are sometimes necessary than those for inputting Japanese sentences, as translation is over at the same time of that a period of a Japanese sentence is keyed-in on a screen.",
        "Whenever any error of conversion is found while inputting Japanese, any step during the conversion can be cancelled and corrected by adopting the second alternative automatically based on key stroke history learning mechanism.",
        "A cheap cancel and undo protocol is the key issue to make the best use of each default reasoning of TWP system, because strokes to select correct one after cancels and undos are the sources for tuning up default reasoning by learning mechanism.",
        "2 What is considered of for comfortable usability?",
        "TWP brings about both users' contentment with functions that machine translation has failed to realize, and large cost reduction for sentence generation in target language that simple dictionary consultation facility has not fulfilled.",
        "No other system has ever been presented to satisfy two of them at the same time.",
        "Machine translation system takes no human cost if complete translation is acquired.",
        "If any errors occur, however, manual re-translation or post-editing charges vast amount of expense.",
        "Post-editors have reported so many time high stress by repetitious or utterly unexpected errors machine translation caused.",
        "Moreover, even when they use Japanese-English automatic translation system, they are required to comprehend both languages in reality.",
        "Experience of using dictionary consultation facilities and grammar checkers tells us that such assistance as bilingual dictionary reference, sample sentence reference and grammatical check does not contribute so much to efficiency of translation and that the key operation cost taken to call those functions, e.g. key strokes, is essentially no less than that in case of consulting paper dictionaries.",
        "TWP performs automatic recognition of a word, a phrase, and a simple sentence, and immediately after that, successive conversion based on bilingual word dictionary , and simple phrase and simple sentence translation function is executed.",
        "These recognition and conversion processes are supervised by the user in the course of inputting Japanese text.",
        "TWP users reserve the means of cancelling and resolving the errors that the recognition or conversion created.",
        "TWP makes users feel content with processes on a screen by confirming every step of translation with their eyes.",
        "TWP supports so much easy use of dictionary consultation facility in such a manner that either English and Japanese word on a cursor position is interpreted as a key word for looking up word and bilingual dictionaries, and is transferred any time automatically to consultation facility to retrieve and display the dictionary data on a pull-down window.",
        "Users need not to take a special dictionary look up procedure.",
        "It assists longer sentence generation in English word order by J/E conversion using complex sentence translation patterns defined by users[5], as well as using a phrase and a simple sentence translation facility.",
        "In the following chapter, we explain the overview of TWP; English producing support system at first then talk about Japanese-to-English interactive conversion framework for comfortable English composition in particular."
      ]
    },
    {
      "heading": "3 Which Resources support English Composition ?",
      "text": [
        "TWP for English composition support is constructed from well understood and transparent resources and mechanisms under an extended, what is called, KanaKanji conversion user interface.",
        "The noble feature of the TWP introduced hereafter, is of great transparency in every process of support mechanism.",
        "The traceability of process and the controllability of the TWP based on default reasoning mechanism in recognition and conversion of logical units in Japanese input, and cheap cancella.bility of wrong steps selected by TWP or a user are a noble part of invention which supports a great cost reduction of English production on Japanese word processors with full of contentment.",
        "The characteristics of TWP is summarized as follows.",
        "1.",
        "Japanese to English conversion interface simulating Kana-Kanji Conversion helps an user to learn so easily[1, 3, 4].",
        "2.",
        "User controllable complex sentence translation pattern based conversion achieves translation transparency even in long sentence J/E conversion[5, 8, 9].",
        "3.",
        "Automatic learning feature based on user key stroke history covers learnings for translation disambiguations of words, verb phrases, complex sentential conversion patterns, etc[6].",
        "4.",
        "It is fully equipped with consultation facilities of translation examples, word dictionaries, bilingual"
      ]
    }
  ]
}
