{
  "info": {
    "authors": [
      "Liesbeth Degand"
    ],
    "book": "International Workshop on Natural Language Generation",
    "id": "acl-W94-0313",
    "title": "Towards an Account of Causation in a Multilingual Text Generation System",
    "url": "https://aclweb.org/anthology/W94-0313",
    "year": 1994
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Abstract: Causation is a very pervasive phenomenom in natural language which can be expressed by numerous linguistic alternatives.",
        "Any language user or natural language generation system is thus confronted with the problem of choosing one alternative over another.",
        "In this paper, I analyze the semantic constraints determining the selection of analytic causatives in Dutch and how this can be accounted for in a systemic fimctional generation system."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Causationl has been a topic of linguistic investigation for many years.",
        "I believe two main reasons underly this interest of linguists in the phenomenon: (i) causative constructions build a good proving ground for many questions of theoretical interest (Herschensohn 1981), and (ii) causation can be expressed in natural language by numerous linguistic alternatives.",
        "Altenberg (1984) has in fact identified nearly one hundred possible explicit links for encoding a causal relation between two propositions.",
        "Any language user is thus confronted with the problem of choosing one alternative over another.",
        "But, how is this choice constrained?",
        "Why does a language user choose one link over another?",
        "This same question arises in natural language * Research assistant at the National Fund for Scientific Research, Belgium.",
        "1 In this paper, we will distinguish the linguistic term \"causation\" from the scientific notion of \"causality\" in the physical world.",
        "\"For the latter, the totality of phenomena constitutes a causal continuum of which any conceptually delimited portion, an \"event\", is understood as relating causally outside itself and containing causal relations within\" (Talmy 1976:47).",
        "In contrast, causation designates a relation that is interpreted by the speaker as being a relation between a cause and an effect, cf. definition below.",
        "generation, where it is crucial that the rules to select a specific linguistic structure be made explicit.",
        "Text generation is a process in which meaning - represented as non-linguistic knowledge at a higher level of abstraction than wordings - is organised and re-expressed over a number of steps so that it can be presented as worded units.",
        "So, in order to use and generate the different possible causative constructions properly, we have to know what their underlying meaning is.",
        "In accordance with the 'one meaning, one form' principle advocated by linguists working in a semiotic approach (e.g. Bolinger 1968; Wierzbicka 1988; Halliday 1978), I assume that all these different causative constructions have their specific meanings and functions - different semantics being encoded in different lexicograrnmatical structures.",
        "This view on language pervades in the Systemic Functional approach where it is posited that the relation between semantics and lexicogrammar is a 'natural', non-arbitrary one (cf. Halliday 1985:xiii-xxxv), in other words, semantics and lexicogrammar are dependent on one another.",
        "Language is interpreted as a resource for making meanings, which is organised functionally, textually, and communicatively.",
        "This makes it also suitable as a theoretical foundation for (monolingual and multilingual) text generation (see also, Matthiessen and Bateman 1991; Bateman.",
        "Matthiessen and Zeng in prep.).",
        "In this paper, I will discuss some aspects of the generation of Dutch analytic causative constructions in a systemic multilingual grammar for generation (Bateman, Matthiessen, Zeng in preperation), currently under development at Sydney University and in the project KOMET at GMEVIPSI, Darmstadt.",
        "It is based on Nigel (Mann 1985), a systemic computational grammar of English for generation developed in the Penman Project at ISUUSC.",
        "Languages worked on currently include English (Matthiessen 1990), German (Teich 1992), Dutch (Degand 1993a), Chinese, Japanese, and French.",
        "The multilingual grammar follows the assumption of Systemic Functional Linguistics (SFL) that commonality across languages is functional in the first instance, not structural or realizational: functionality has to be preserved across languages, but structural realizations may very well differ (Bateman, Matthiessen, Nanri, Zeng 1991).",
        "This means that within a functional framework different languages can be treated in a similar way.",
        "The common functionality is realized stratum by stratum in the linguistic system (composed of the three strata: semantics, lexicogrammar, and phonology).",
        "Within a particular stratum, it is expressed by the paradigmatic, systemic organization of that stratum in the first instance, and only secondarily by the syntagmatic organization (structural realization).",
        "With this kind of organization of (multilingual) linguistic resources, it is ensured that the multilingual system is more than a loosely coordinated set of separate generation",
        "systems and that new language components can be added to the system without revising the overall organization (see also, Degand 1993b).",
        "After a brief sketch of the lexicogrammatical potential for expressing causation in Dutch, I will concentrate on the so-called analytic (or periphrastic) causative construction and show how this particular type of causative construction can be realized in a systemic multilingual grammar for generation, taking into account the theoretical elaborations developed in Degand (to appear).",
        "The importance of this theoretical basis for the computational account will be amply illustrated."
      ]
    },
    {
      "heading": "2. The lexicogrammatical potential for expressing causation",
      "text": [
        "The expression of causation is ubiquitous in all forms of communication and in natural language in particular.",
        "The examples given below illustrate this multitude of different types of causal expressions in Dutch.",
        "Note that these examples have been grouped according to their structural realization, since it was my aim to illustrate the wide lexicogranunatical variation in this area.",
        "This does not mean that the subexamples can always be used as alternatives for each other, neither does it mean that the English translations could be used in a same context (see Section 3.1.",
        ").",
        "1. i. Hij blijft thuis, want hij is ziek.",
        "He stays at home, for he is ill. lk ben te laat, omdat ik mijn trein gemist heb.",
        "I am too late, because I missed my train.",
        "2. i. Ze heeft een ongeluk veroorzaakt.",
        "She has caused an accident.",
        "Hij bewoog zijn hand op en neer.",
        "He moved his hand up and down.",
        "iii.Piet liet Marie een auto kopen.",
        "Piet had Marie buy a car.",
        "3.",
        "Jij bent de oorzaak van al onze problemen.",
        "You are the cause of all our problems.",
        "4. i.",
        "Door de gladde wegen is bijna niemand op tijd kunnen zijn.",
        "Because of the slippery roads hardly anybody could make it on time.",
        "ii.",
        "Ten gevolge van het ongeluk ontstond een lange file.",
        "As a result of the accident there was a traffic jam.",
        "In traditional descriptive grammars, these different constructions are classified according to the grammatical category of the causal element, i.e. the linguistic element which endows the clause with a causal meaning.",
        "Thus, in example (1) the causal element is realized by a coordinating or subordinating conjunction; example (2) displays different types of verbs with a causal meaning: causative verbs, intransitive verbs that are used transitively, causal auxiliaries.",
        "In example (3), the causal element is expressed in a nominal phrase and in example (4) in a prepositional phrase.",
        "All of these structures have a common underlying meaning (at least partially) which needs to be captured, namely causation, but which is not accounted for in these types of grammars, since semantics is described independently of the grammar."
      ]
    },
    {
      "heading": "3. The semantics of causation",
      "text": [
        "The semantics underlying the different alternative constructions for expressing causation (be it in one language or cross-linguistically) have usually been described in general terms such as 'direct vs. indirect causation', 'strong coercion vs. weak coercion', 'factitive vs. permissive causation', 'manipulative vs. directive causation' etc.",
        "(see e.g. Comrie 1974, 1985; GivOn 1975; Talmy 1976; Shibatani 1976).",
        "In a perspective of multilingual generation, it is difficult to rely on these different \"ready-made\" labels to distinguish the different causative alternatives, because, as pointed out by Wierzbicka (1988), they do in fact not apply cross-linguistically to individual languages.",
        "What is called 'direct causation' or 'strongly coercive' in one language is very often different from what is called 'direct causation' or 'strongly coercive' in another.",
        "This does not mean that there are no similarities across languages in the area of causation.",
        "Wierzbicka shows that causative constructions can be described as unique combinations of semantic components and that it is therefore necessary to decompose the meaning of causative constructions into its semantic components.",
        "Not only is this necessary in order to distinguish the meaning of different causative constructions within one language, such as for example the following pair of English examples (Wierzbicka 1988:240):",
        "5. i. Hilary made Robin type the letter.",
        "ii.",
        "Hilary had Robin type the letter.",
        "But it is also necessary in order to predict, for example, the difference in use of the English 'indirect' make causative and the French 'indirect' faire causative, as is shown in example (6) (Wierzbicka 1988:244):",
        "6. i.",
        "Le colonel a fait fondre (*a fondu) trois sucres dans son café.",
        "The colonel made dissolve ( dissolved) three lumps of sugar in his coffee.",
        "The colonel dissolved three lumps of sugar in his coffee."
      ]
    },
    {
      "heading": "7th International Generation Workshop • Kennebunkport, Maine • June 21-24, 1994",
      "text": [
        "ii.",
        "Le metallurgiste a fait fondre/a fondu le metal.",
        "The metallurgist made dissolve/melted the metal.",
        "The metallurgist melted the metal.",
        "This example illustrates that the analytic and lexical causative constructions do in fact not apply in the same context in English and French.",
        "Thus in order to use and generate these constructions correctly, i.e. to select the correct construction for a given context, \"we have to identify the unique meaning of each construction, rather than try to rely on language-independent global labels such as 'direct' and 'indirecr.",
        "(Wierzbicka 1988:244-245).",
        "In Section 4, I will try to provide such a fine description for the analytic causative constructions both in Dutch and in French.",
        "This detailed description should enable us to represent these constructions with enough delicacy in the system networks on the lexicogrammatical level of the grammar such as to account for the functional and structural convergences and divergences between both languages.",
        "But before elaborating on that point, we first have to determine to what extent all these constructions have a common underlying meaning."
      ]
    },
    {
      "heading": "3.1. The causative situation",
      "text": [
        "In Section 2, we have seen that the phenomenon of causation can be expressed in natural language by a wide variety of linguistic constructions.",
        "Following the non-arbitrary relation between semantics and lexicograrrunar, I assume that each of these constructions has its own specific linguistic meaning, and that their use in language is determined by this meaning.",
        "But this does not mean that all these expressions are totally unrelated - on the contrary, they all express different aspects of a same (extralinguistic) situation: the causative situation.",
        "Talmy (1976:52) defines a \"basic causative situation\" which \"consists of a simple event (that is, one that would otherwise be considered autonomous), that which immediately causes the event, and the causal relation between the two.\"",
        "Shibatani (1976) also considers the causative situation to be a relation between two events: the causing event and the caused event.",
        "In addition, he characterizes this relation in terms of the speaker's belief that the caused event would not have taken place (at that particular time) if the causing event had not taken place.",
        "This reference to the speaker's belief is, I think, very important, since it emphasizes that in talking about causation we are not referring to some notion of causality in the physical world, but rather to the human conceptualization of causation as it is, for instance, expressed in natural language (see also, Talmy 1976; Wierzbicka 1980; Kemmer and Verhagen, forthcoming).",
        "Building on these descriptions, I can now characterize a causative situation as a relation between two events that are viewed by the speaker as causally dependent on each other.",
        "This basic causative situation underlies all linguistic expressions of the phenomenon.",
        "In systemic terms, this basic causative situation is part of the (non-linguistic) context of situation, i.e. the general background composed of those features which are relevant to the speech that is taking place.",
        "Traditionally, SFL identifies three different aspects of context: field, tenor, and mode.",
        "Together they build \"a conceptual framework for representing the social context as the semiotic environment in which people exchange meanings\" (Halliday 1978:110).",
        "These three different aspects of context are interpreted linguistically on the semantic level and realized in a non-arbitrary way by the three metafunctions of the lexicogranunar: the ideational, interpersonal, and textual metaffinctions (Halliday 1978:142-143; Matthiessen and Bateman 1991:68-69).",
        "Halliday sets the following correspondences between context and language: field tends to determine ideational meanings, tenor interpersonal ones, and mode textual ones.",
        "There is thus functional differentiation both in context and in the linguistic system.",
        "In the following we will see how these resources come into play in the linguistic realization of the causative situation, how this linguistic encoding has been accounted for in the Nigel grammar for generation so far, and how this treatment could be extended for multilingual generation."
      ]
    },
    {
      "heading": "4. Realizing the causative situation",
      "text": [
        "Given our characterization of a causative situation as a causal relation (established by the speaker) between two (otherwise autonomous) events, it can be considered as belonging to the field component of the context.",
        "According to Halliday's proportionalities set out above, the most \"congruent\" (Halliday 1985:xix) or \"solidary\" (Martin 1991:116) linguistic encoding of this situation would thus lie in the ideational metafiniction for the realization of both events with the resources for transitivity (process + participants + circumstances), and in the textual metafunction for the realization of the causal relation as a conjunction.",
        "These resources are for instance at play in: She didn't come because she was too tired.",
        "This is indeed how causation has been treated so far in the Nigel grammar.",
        "On clause complex level within the ideational metafimction, the grammar relies on the Upper Model2 concept CAUSAL-RELATION indicating that the two events expressed in the clause complex are to be encoded as causally dependent on each other, which is than expressed in the 2 The Upper Model (Bateman, Kasper, Moore, Whitney 1990) is a general conceptual inheritance hierarchy developed within the PENMAN text generation project for organizing domain knowledge appropriately for linguistic realization.",
        "lexicogrammar by means of a series of conjunctions in paradigmatic relation (see Figure 1).",
        "On clause rank, more specifically in the region transitivity, the Nigel Grammar also describes both the transitive and ergative pattern of processes, which account for the causative element in the structure of the English clause (Halliday, 1985:263).",
        "In Nigel, however, the link with causation is not made, neither are analytic causatives, or prepositional causative realizations covered.",
        "There is thus a gap in the grammar that needs to be filled along the paradigmatic (functional relation between the different realization alternatives) as well as along the syntagmatic (different structural realizations) axis.",
        "In the following sections, I will try to describe how this gap could be filled along both axes for the analytic causative construction in Dutch.",
        "From a theoretical point of view this involves that this particular realization alternative of the causative situation be investigated in detail so as to determine the semantic elements that constrain the lexicogrammatical encoding.",
        "Thus, we have to establish what it means for a speaker to use this alternative over another: From a computational point of view, we should first be able to represent this structure on the lexicogranunatical level and make sure that the resources for generating this construction are available in the system.",
        "And second, if we want the generation process to be under semantic control, we also have to establish how the semantic features triggering the different lexicogrammatical realizations can be represented.",
        "In addition, all these representations should be theoretically motivated."
      ]
    },
    {
      "heading": "4.1. Analytic causatives: A case of grammatical metaphor",
      "text": [
        "The basic causative situation was characterized in Section 3 as a relation established by the speaker between two events in which one event, called the caused event, is causally dependent on the other event, called the causing event.",
        "If not all of these aspects need to be expressed, the most congruent lexicogrammatical realization, i.e. a clause complex in which causing event and caused event are both realized by a simple clause and linked by one of the possible causal conjunctions (note that paradigmatic variation in the choice of the conjunction is still possible here), does not make sense.",
        "The lexicograrrunar offers then other possibilities to express this underlying situation.",
        "In Systemic Functional Grammar (SFG), this expansion of the \"meaning making potential of content form\" (Martin 1991:116) is accounted for in the theory of grammatical metaphor, which states that \"for any given semantic configuration there is (at least) one congruent realization in the lexicograirunar.",
        "There may then be others that are in some respect transferred, or METAPHORICAL\".",
        "(Halliday 1985:321).",
        "In my view, one of these metaphorical expressions of causation is the analytic causative construction in which the two underlying events are condensed into one simple clause.",
        "An analytic causative can indeed be described as \"a two-verb structure that expresses a predicate of causation and a predicate of effect\" (Kemmer and Verhagen forthcoming), the causal predicate being termed in many languages 'auxiliary' or 'particle', indicating that it has no full verbal status.",
        "Thus, English expressions like I made him leave; She had him type the letter; She let him eat some brownies.",
        "This construction is used when a speaker views the underlying causing event as causally dependent on some action of the agent of the causing event, no matter what this action is.",
        "The causing event itself is thus not overtly specified, all that remains is the pure notion of cause expressed by a causal predicate (realized in most languages by a causal auxiliary or a causal morpheme).",
        "In the following, I will treat the analytic causative construction as an interpersonal interpretation of the causative situation that should thus be accounted for in the interpersonal metafunction of the lexicogranunar (see Section 4.2.).",
        "The implementation of the notion of grammatical metaphor presupposes that we be able to represent the (extra-linguistic) context of situation, the (intra-linguistic) lexicogranunatical potential of a given language (composed of the three metafunctions and the different structural ranks), and the (intra-linguistic) semantic interface between these two components.",
        "The context of situation can be viewed as a cluster of situation types that are categorized along the three contextual components of field, tenor, and mode.",
        "The influence that context may have on lexicogrammar and semantics is a topic of ongoing research (situation-specific semantics, see e.g. Cross 1992, Caffarel 1992).",
        "The lexicogrammatical potential of a language comprises the three metafunctions and the different structural ranks.",
        "So far, the main linguistic resources are covered for English (Matthiessen 1990), German (Teich 1992), and Dutch (Degand 1993a) (Dutch being developed contrastively with English within the multilingual grammar (Degand 1993b)).",
        "The semantic interface between context and lexicograrrunar provides us with the semantic constraints on the lexicogranunatical"
      ]
    },
    {
      "heading": "7th International Generation Workshop • Kennebunkport, Maine • June 21-24, 1994",
      "text": [
        "encoding.",
        "Following Matthiessen and Bateman (1991), I will assume that this semantic level is also (meta)functionally differentiated being composed of the ideation base, interaction base, and text base.",
        "Together they build the environment of the generation system.",
        "They represent a view on the context of situation from the lexicogrammar (see Matthiessen and Bateman 1991:200-230 for a more detailed account).",
        "In the following sections, I will try to determine what are the constraints set by this environment on the realization of analytic causatives in Dutch and how this can be represented in a multilingual system."
      ]
    },
    {
      "heading": "4.2. Analytic causatives: an interpersonal",
      "text": [
        "interpretation Different authors have studied the semantics of analytic causatives in languages as diverse as English, Japanese, Korean, Bantu, Hungarian, Telugu, and many others (cf., e.g., GivOn 1975, 1976; Shibatani 1976; Hetzron 1976; Rao and Bashir 1985; Wierzbicica 1988).",
        "From all of these analyses it appears that the agent of the underlying causing event, which we will label Causer (see below), is given a special status in the overall causative situation: that of (a certain degree of) control of the situation, and especially over the agent of the underlying caused event, labeled the Causee (see below).",
        "In other words, a speaker will use this type of construction only if he/she believes that the Causee is under control of the Causer.",
        "If he/she does not believe this is so, a construction that is neutral to this respect (in the given language) will be selected.",
        "In SFG, the (social) status of the participants involved in a situation is traditionally accounted for in the interpersonal metafunction.",
        "This status seems to play a role in the selection of the analytic causative.",
        "This constitutes a first reason why I have chosen to represent this type of construction as an interpersonal metaphorical expression of the causative situation.",
        "A second reason concerns the conceptually dependent status of the causal predicate which accounts for the fact that it is conceptually empty, i.e. it is not (ideationally) classifiable as expressing one of the process types, and it has thus no proper participants.",
        "Or as Kemmer and Verhagen (forthcoming) state it: \"In They made me leave, MAKE does not have any highly specific semantic content that could determine semantic roles (...) in relation to itself.",
        "In contrast, in the causing event in two-clause structures like They insulted me, so I left, the verb has its usual constellation of specific semantic roles (...), which occur independently of its use in an expression of cause-and-effect.\"",
        "However, this does not mean that there are no participants involved in the causative event itself, i.e. the expression of the causative situation.",
        "In accordance with the terms used in the linguistic literature, I will label these core participants: Causer, Causee, and (if present) Affectee.",
        "The Causer is the participant viewed as bringing about the entire event; the Causee is the participant carrying out the activity designated by the effected predicate; and the Affectee, when expressed, is the participant \"that is the endpoint of the energy (literal or metaphorical) expended in the entire causative event\" (Kemmer and Verhagen, forthcoming).",
        "The causal predicate has thus no full Process status and it is not realized as that either.",
        "In Dutch, French, and English it is realized as an auxiliary that expands the meaning of the Process it occurs with, like the modal auxiliary expands the Process it occurs with too.",
        "Since the type of auxiliary selected is again highly dependent on interpersonal matters (see below), I believe this choice belongs to the interpersonal metafunction too.",
        "In other languages, e.g. Japanese, Hindi, Turkish, the causal predicate in these types of constructions is realized by a morpheme and not by an auxiliary.",
        "If the selection is in those cases also interpersonally relevant, the interpersonal metafunction would again be most appropriate to account for this realization.",
        "Diverging syntagmatic structures are then treated similarly from a functional point of view.",
        "But let us now look at the Dutch analytic causative constructions and see whether their meaning can be characterized along the same lines."
      ]
    },
    {
      "heading": "4.3. Analytic causatives in Dutch",
      "text": [
        "In Dutch the analytic causative construction can occur with two possible causal auxiliaries doen (cognate with 'to do') and laten (cognate with 'to let'), both taking an infinitival complement.",
        "According to our definition of analytic causatives given above the causal auxiliary corresponds to the causal predicate and the infinitival complement to the effected predicate.",
        "This is illustrated in examples 8 and 9.",
        "8.",
        "De wind doet de was drogen.",
        "The wind does the laundry dry.",
        "The wind dries the laundry.",
        "9.",
        "Marie laat de was drogen.",
        "Mary lets the laundry dry.",
        "Mary lets the laundry thy.",
        "In these clauses the notion of causation lies exclusively in the causal predicate expressed by the causal auxiliaries doen and laten.",
        "The caused event is each time entirely expressed by the effected predicate (process + participants), while the causing event has been reduced to its sole Agent, realized as the Subject of the overall clause.",
        "The basic structure of the clause is that of simple clauses, and not of reduced (or derived) complex clauses (see Kemmer and Verhagen, forthcoming for cognitive evidence and Dik 1980 for grammatical evidence on this point).",
        "From a semantic point of view, the caused event is seen as",
        "(causally) dependent on some action of the Subject of the clause (which always represents the Agent of the underlying causing event).",
        "Since two causal auxiliaries appear to be possible in this type of construction, the question to ask is \"why would a speaker use one construction rather than the other, i.e. what is the difference in meaning?\".",
        "The semantic distinction between both causal auxiliaries has been investigated from a cognitive point of view by Verhagen and Kenuner (1992).",
        "The core of their proposal is that \"doen categorizes an event as involving direct causation, while laten categorizes the causal relation as indirect, i.e. as complex in the sense that some other force than the agent's is more immediately involved in bringing the effect about\".",
        "(Verhagen and Kenuner 1992:1).",
        "There is thus a systematic difference between both causal auxiliaries and they are not interchangeable as is sometimes suggested in Dutch grammars.",
        "I will not elaborate on the theoretical aspects here, but I will suffice with the conclusions that can be drawn from this proposal and how they can be exploited for text generation (for an elaboration of these aspects see, Degand to appear)."
      ]
    },
    {
      "heading": "5. Generating analytic causatives in Dutch",
      "text": [
        "Building on the theoretical points given 11 3 above, we can now represent these elements in system networks (Figures 2 and 3).",
        "The traversal of these systems, i.e. the selection of features, is guided by information from the environment obtained through the choosers and inquiries interface (see e.g. Matthiessen 1988).",
        "The three bases each contribute to the elaboration of local plans for realizing complex clauses, simplex clauses, nominal groups, etc.",
        "Applying this to the realization of the causative situation, a local plan for a clause complex would result in the selection of the feature congruent-realization in the causation network (Figure 2) , while metaphorical-causation corresponds to a local plan for a simplex clause.",
        "For analytic causatives the (simplex) clause plan would among other things also contain the following information.",
        "The ideation base provides us with information about participants (Causer and Causee), process, and circumstances: the interaction base specifies that there is a kind of 'power' relation (a relation of control) between the participants involved in the situation; and the text base indicates that there is a causal relation between two events (causing event and caused event) of which only the caused event is informatively important.",
        "Given this information from the environment, the feature interpersonal-causation in the system METAPHORICAL-CAUSATION-TYPE (Figure 3), is selected, and the feature causativization from the DIATHESIS network is preselected.",
        "Diathesis refers"
      ]
    },
    {
      "heading": "7th International Generation Workshop • Kennebunkport, Maine • June 21-24, 1994",
      "text": [
        "to the way a language encodes the same situation in different perspectives (Figure 4).",
        "Structurally, there is conflation of the Agent of the underlying causing event with the function Causer (which in a clause with active voice will be conflated on its turn with the Function Subject), while the Agent of the underlying caused event is conflated with the function Causee (very often realized as a Direct Object in active clauses).",
        "The network traversal proceeds then with the choice between direct-causation and indirect-causation.",
        "'Indirect' causation means here that the action of the Causer is indeed viewed as the cause of the event expressed in the effected predicate, but that it is nevertheless a complex, i.e. indirect relation in the sense that another force is viewed as being more directly involved in the accomplishment of the effect than the action of the Causer himself.",
        "It is this indirect character of the causation that motivates the use of the causal awdliary \"laten\" (cf. realization statement lexify causal-aux laten).",
        "The precise nature of this other force need not be specified.",
        "In example (9) Mary relies on some other force, the wind or the heat of a laundry drier, to have the laundry dried.",
        "All cases of (verbal) interaction between people are for the same reasons typically realized with laten.",
        "'Direct' causation means in this context that the Causer is viewed as the immediate cause of the described effect.",
        "In other words, there is no intermediary force of which the presence or absence could prevent the occuring of the caused event.",
        "\"Given the action of the agent, the result is inevitable, necessary.",
        "The causal relation is simple and direct.\"",
        "(Verhagen and Kemmer 1992:6).",
        "This is encoded in the grammar with the causal auxiliary \"doen\" (cf. realization statement lexify causal-aux doen).",
        "This direct causation is in the first place motivated in pure physical causal relations, as in example (8) given above.",
        "When indirect-causation has been selected from the system CAUSATION-DIRECTNESS and if the Process of the caused event is effective, i.e. transitive, a further, in systemic terms more delicate, system is entered: CAUSEE-MARKING.",
        "In this system the case marking of the Causee is decided.",
        "In Dutch, there are three possible realizations as illustrated in examples 10-12.",
        "10.",
        "Hij liet de brief aan iedereen lezen.",
        "He let the letter to everybody read He let/had everybody read the letter.",
        "11.",
        "Hij liet de brief door iemand lezen.",
        "He let the letter by somebody read He had the letter read by somebody.",
        "12.",
        "Hij liet haar de brief lezen.",
        "He let her the letter read He let/had/made her read the letter.",
        "With aan (example (10)) the Causee is categorized as a Recipient who is fairly autonomous and is involved in the causative event because he wants to.",
        "The reading is rather permissive: 'He allowed everybody (who wanted it) to read the letter (for its content)'.",
        "With door (example (11)) the Causee is viewed as a sort of instrument; the reading is more causative: 'He asked somebody to read the letter not for its content (the Causee is not the recipient of the message) but e.g. to check the spelling, or to read it loud for an audience.' In example (12) the Causee appears as a bare nominal phrase without any case marking.",
        "Here the Causee is viewed as an object of the action of the Causer with few autonomy: (12) could for instance mean: 'The reader was not inclined to read the letter (for its content) and the Causer had to insist or even had to force her a little bit'.",
        "In causative constructions with doen the Causee is never marked with a prepositional case.",
        "This can be explained straightforwardly in the sense that direct causation does not leave any autonomous role on behalf of the Causee in realizing the causative event.",
        "All these different features can now be represented in the interpersonal system network of the lexicogranunar where they function as grammatical output features of the selection systems.",
        "This is partially depicted in Figure 4."
      ]
    },
    {
      "heading": "6. Conclusions",
      "text": [
        "The starting point of my investigation has been the observation that all natural languages offer a multitude of alternatives to express causation.",
        "Any language user or natural language generation system is thus confronted with a crucial problem of choice.",
        "In this article I have adopted a semiotic approach to causation assuming that all the possible causative constructions have their specific meaning and that the selection of one alternative over another is thus not arbitrary.",
        "More specifically, I have concentrated on the semantics and the functional (paradigmatic) treatment of analytic causatives in Dutch.",
        "It was shown that a specific semantic feature of analytic causatives seems to be in many languages the notion of interaction (manipulation, control) between the Causer and the Causee.",
        "This aspect can be accounted for in systemic functional grammar in the interpersonal metafunction where these constructions are then handled as metaphoric realizations of the basic causative situation.",
        "Future work in this area includes the investigation of the specific meanings of all other Dutch linguistic expressions of causation in order to establish explicitly in how far these different linguistic realizations of a common causative situation differ semantically from each other, and how these semantic features can constrain the selection of the most appropriate expression in the given context\".",
        "This orients us towards a more situation-based approach of generation."
      ]
    }
  ]
}
