{
  "info": {
    "authors": [
      "Stefan Kaufmann"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P99-1077",
    "title": "Cohesion and Collocation: Using Context Vectors in Text Segmentation",
    "url": "https://aclweb.org/anthology/P99-1077",
    "year": 1999
  },
  "references": [
    "acl-J86-3001",
    "acl-J91-1002",
    "acl-J97-1003",
    "acl-J98-1004",
    "acl-P95-1015",
    "acl-W97-0305"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Collocational word similarity is considered a source of text cohesion that is hard to measure and quantify.",
        "The work presented here explores the use of information from a training corpus in measuring word similarity and evaluates the method in the text segmentation task.",
        "An implementation, the VecTile system, produces similarity curves over texts using pre-compiled vector representations of the contextual behavior of words.",
        "The performance of this system is shown to improve over that of the purely string-based TextTiling algorithm (Hearst, 1997)."
      ]
    },
    {
      "heading": "1 Background",
      "text": [
        "The notion of text cohesion rests on the intuition that a text is \"held together\" by a variety of internal forces.",
        "Much of the relevant linguistic literature is indebted to Halliday and Hasan (1976), where cohesion is defined as a network of relationships between locations in the text, arising from (i) grammatical factors (co-reference, use of pro-forms, ellipsis and sentential connectives), and (ii) lexical factors (reiteration and collocation).",
        "Subsequent work has further developed this taxonomy (Hoey, 1991) and explored its implications in such areas as paragraphing (Longacre, 1979; Bond and Hayes, 1984; Stark, 1988), relevance (Sperber and Wilson, 1995) and discourse structure (Grosz and Sidner, 1986).",
        "The lexical variety of cohesion is semantically defined, invoking a measure of word similarity.",
        "But this is hard to measure objectively, especially in the case of collocational relationships, which hold between words primarily because they \"regularly co-occur.\"",
        "Halliday and Hasan refrained from a deeper analysis, but hinted at a notion of \"degrees of proximity in the lexical system, a function of the probability with which one tends to co-occur with an-other.\"",
        "(p. 290) The VecTile system presented here is designed to utilize precisely this kind of lexical relationship, relying on observations on a large training corpus to derive a measure of similarity between words and text passages."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Previous approaches to calculating cohesion differ in the kind of lexical relationship they quantify and in the amount of semantic knowledge they rely on.",
        "Topic parsing (Hahn, 1990) utilizes both grammatical cues and semantic inference based on precoded domain-specific knowledge.",
        "More general approaches assess word similarity based on thesauri (Morris and Hirst, 1991) or dictionary definitions (Kozima, 1994).",
        "Methods that solely use observations of patterns in vocabulary use include vocabulary management (Youmans, 1991) and the blocks algorithm plemented in the TextTiling system (Hearst, 1997).",
        "The latter is compared below with the system introduced here.",
        "A good recent overview of previous approaches can be found in Chapters 4 and 5 of (Reynar, 1998)."
      ]
    },
    {
      "heading": "3 The Method",
      "text": []
    },
    {
      "heading": "3.1 Context Vectors",
      "text": [
        "The VecTile system is based on the WordSpace model of (Schiitze, 1997; Schiitze, 1998).",
        "The idea is to represent words by encoding the environments in which they typically occur in texts.",
        "Such a representation can be obtained automatically and often provides sufficient information to make deep linguistic analysis unnecessary.",
        "This has led to promising results in information retrieval and related areas (Flournoy et al., 1998a; Flournoy et al., 1998b).",
        "Given a dictionary W and a relatively small set C of meaningful \"content\" words, for each pair in W x C, the number of times is recorded that the two co-occur within some measure of distance in a training corpus.",
        "This yields a ICI-dimensional vector for each w E W. The direction that the vector has in the resulting 1C1-dimensional space then represents the collocational behavior of w in the training corpus.",
        "In the present implementation, 1W1 = 20,500 and ICI = 1000.",
        "For computational efficiency and to avoid the high number of zero values in the resulting matrix, the matrix is reduced to 100 dimensions using Singular-Value Decomposition (Golub and van Loan, 1989).",
        "As a measure of similarity in collocational behavior between two words, the cosine between their vectors is computed: Given two n-dimensional vectors t7,"
      ]
    },
    {
      "heading": "3.2 Comparing Window Vectors •",
      "text": [
        "In order to represent pieces of text larger than single words, the vectors of the constituent words are added up.",
        "This yields new vectors in the same space, which can again be compared against each other and word vectors.",
        "If the word vectors in two adjacent portions of text are added up, then the cosine between the two resulting vectors is a measure of the lexical similarity between the two portions of text.",
        "The VecTile system uses word vectors based on co-occurrence counts on a corpus of New York Times articles.",
        "Two adjacent windows (200 words each in this experiment) move over the input text, and at predetermined intervals (every 10 words), the vectors associated with the words in each window are added up, and the cosine between the resulting window vectors is assigned to the gap between the windows in the text.",
        "High values indicate lexical closeness.",
        "Troughs in the resulting similarity curve mark spots with low cohesion."
      ]
    },
    {
      "heading": "3.3 Text Segmentation",
      "text": [
        "To evaluate the performance of the system and facilitate comparison with other approaches, it was used in text segmentation.",
        "The motivating assumption behind this test is that cohesion reinforces the topical unity of subparts of text and lack of it correlates with their boundaries, hence if a system correctly predicts segment boundaries, it is indeed measuring cohesion.",
        "For want of a way of observing cohesion directly, this indirect relationship is commonly used for purposes of evaluation."
      ]
    },
    {
      "heading": "4 Implementation",
      "text": [
        "The implementation of the text segmenter resembles that of the TextTiling system (Hearst, 1997), The words from the input are stemmed and associated with their context vectors.",
        "The similarity curve over the text, obtained as described above, is smoothed out by a simple low-pass filter, and low points are assigned depth scores according to the difference between their values and those of the surrounding peaks.",
        "The mean and standard deviation of those depth scores are used to calculate a cutoff below which a trough is judged to be near a section break.",
        "The nearest paragraph boundary is then marked as a section break in the output.",
        "An example of a text similarity curve is given in Figure 1.",
        "Paragraph numbers are inside the plot at the bottom.",
        "Speaker judgments by five subjects are inserted in five rows in the upper half.",
        "The crucial difference between this and the TextTiling system is that the latter builds window vectors solely by counting the occurrences of strings in the windows.",
        "Repetition is rewarded by the present approach, too, as identical .",
        "words contribute most to the similarity between the block vectors.",
        "However, similarity scores can be high even in the absence of pure string repetition, as long as the adjacent windows contain words that co-occur frequently in the training corpus.",
        "Thus what a direct comparison between the systems will show is whether the addition of collocational information gleaned from the training corpus sharpens or blunts the judgment.",
        "For comparison, the TextTiling algorithm was implemented and run with the same window size (200) and gap interval (10)."
      ]
    },
    {
      "heading": "5 Evaluation",
      "text": []
    },
    {
      "heading": "5.1 The Task",
      "text": [
        "In a pilot study, five subjects were presented with five texts from a popular-science magazine, all between 2,000 and 3,400 words, or between 20 and 35 paragraphs, in length.",
        "Section headings and any other clues were removed from the layout.",
        "Paragraph breaks were left in place.",
        "Thus the task was not to find paragraph breaks, but breaks between multi-paragraph passages that according to the the subject's judgment marked topic shifts.",
        "All subjects were native speakers of English.1 1 The instructions read: \"You will be given five magazine articles of roughly equal length with section breaks removed.",
        "Please mark the places where the topic seems to change (draw a line between paragraphs).",
        "Read at normal speed, do not take much longer than you normally would.",
        "But do feel free to go back and reconsider your decisions (even change your markings) as you go along.",
        "Also, for each section, suggest a headline of a few words that captures its main content.",
        "If you find it hard to decide between two places, mark both, giving preference to one and indicating that the other was a close rival.\""
      ]
    },
    {
      "heading": "5.2 Results",
      "text": [
        "To obtain an \"expert opinion\" against which to compare the algorithms, those paragraph boundaries were marked as \"correct\" section breaks which at least three out of the five subjects had marked.",
        "(Three out of seven (Litman and Passonneau, 1995; Hearst, 1997) or 30% (Kozima, 1994) are also sometimes deemed sufficient.)",
        "For the two systems as well as the subjects, precision and recall with respect to the set of \"correct\" section breaks were calculated.",
        "The results are listed in Table 1.",
        "The context vectors clearly led to an improved performance over the counting of pure string repetitions.",
        "The simple assignment of section breaks to the nearest paragraph boundary may have led to noise in some cases; moreover, it is not really part of the task of measuring cohesion.",
        "Therefore the texts were processed again, this time moving the windows over whole paragraphs at a time, calculating gap-values at the paragraph gaps.",
        "For each paragraph break, the number of subjects who had marked it as a section break was taken as an indicator of the \"strength\" of the boundary.",
        "There was a significant negative correlation between the values calculated by both systems and that measure of strength, with r = – .338(p = .0002) for the VecTile system and r = – .220(p = .0172) for TextTiling.",
        "In othei words, deep gaps in the similarity measure are associated with strong agreement between subjects that the spot marks a section boundary.",
        "Although r2 is low both cases, the VecTile system yields more significant results.",
        "5.3 Discussion and Further Work The results discussed above need further support with a larger subject pool, as the level of agre6-: ment among the judges was at the low end of what can be considered significant.",
        "This is shown by the Kappa coefficients, measured against the expert opinion and listed in Table 2.",
        "The overall average was .594.",
        "Despite this caveat, the results clearly show that adding collocational information from the training",
        "corpus improves the prediction of section breaks, hence, under common assumptions, the measurement of lexical cohesion.",
        "It is likely that these encouraging results can be further improved.",
        "Following are a few suggestions of ways to do so.",
        "Some factors work against the context vector method.",
        "For instance, the system currently has no mechanism to handle words that it has no context vectors for.",
        "Often it is precisely the co-occurrence of uncommon words not in the training corpus (personal names, rare terminology etc.)",
        "that ties text together.",
        "Such cases pose no challenge to the string-based system, but the VecTile system cannot utilize them.",
        "The best solution might be a hybrid system with a backup procedure for unknown words.",
        "Another point to note is how well the much simpler TextTile system compares.",
        "Indeed, a close look at the figures in Table 1 reveals that the better results of the VecTile system are due in large part to one of the texts, viz. #2.",
        "Considering the additional effort and resources involved in using context vectors, the modest boost in performance might often not be worth the effort in practice.",
        "This suggests that pure string repetition is a particularly strong indicator of similarity, and the vector-based system might benefit from a mechanism to give those vectors a higher weight than co-occurrences of merely similar words.",
        "Another potentially important parameter is the nature of the training corpus.",
        "In this case, it consisted mainly of news texts, while the texts in the experiment were scientific expository texts.",
        "A more homogeneous setting might have further improved the results.",
        "Finally, the evaluation of results in this task is complicated by the fact that \"near-hits\" (cases in which a section break is off by one paragraph) do not have any positive effect on the score: This problem has been dealt with in the Topic Detection and Tracking (TDT) project by a more flexible score that becomes gradually worse as the distance between hypothesized and \"real\" boundaries increases (TDT, 1997a; TDT, 1997b)."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "Thanks to Stanley Peters, Yasuhiro Takayama, Hin-rich Schiitze, David Beaver, Edward Flemming and three anonymous reviewers for helpful discussion and comments, to Stanley Peters for office space and computational infrastructure, and to Raymond Flournoy for assistance with the vector space."
      ]
    }
  ]
}
