{
  "info": {
    "authors": [
      "Seonho Kim",
      "Zooil Yang",
      "Mansuk Song",
      "Jung-Ho Ahn"
    ],
    "book": "Joint SIGDAT Conference on Empirical Methods in Natural Language Processing and Very Large Corpora",
    "id": "acl-W99-0610",
    "title": "Retrieving Collocations from Korean Text",
    "url": "https://aclweb.org/anthology/W99-0610",
    "year": 1999
  },
  "references": [
    "acl-C94-1101",
    "acl-C96-1089",
    "acl-C96-1097",
    "acl-J93-1007",
    "acl-J96-1001",
    "acl-P89-1010",
    "acl-P97-1061",
    "acl-W93-0309"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes a statistical methodology for automatically retrieving collocations from POS tagged Korean text using interrupted bi-grams.",
        "The free order of Korean makes it hard to identify collocations.",
        "We devised four statistics, 'frequency', 'randomness', 'condensation', and 'correlation' to account for the more flexible word order properties of Korean collocations.",
        "We extracted meaningful bigrams using an evaluation function and extended the bigrams to n-gram collocations by generating equivalence sets, a-covers.",
        "We view a modeling problem for n-gram collocations as that for clustering of cohesive words."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "There have been many theoretical and applied works related to collocations.",
        "A rapidly growing availability of copora has attracted interests in statistical methods for automatically extracting collocations from textual corpora.",
        "However, it is not easy to ;identify the central tendencies of collocation distribution and the borderlines of criteria are often fuzzy because the expressions can be of arbitrary lengths in a large variety of forms.",
        "Getting reliable collocation patterns is particularly difficult in Korean which allows arguments to scamble so freely.",
        "This paper presents a statistical method using 'interrupted bigrains' for automatically retrieving collocations and idiomatic expressions from Korean text.",
        "We suggest several statistics to account for the mOre flexible word order.",
        "If the distribution of a random sample is unknown, we often try to make inferences about its properties described by suitably defined measures.",
        "For the properties of arbitrary collocation distribution, four measure statistics: 'high fre-quency', 'condensation', 'randomness', and 'correlation' were devised.",
        "Given a morpheme, our system begins by retrieving the frequency distributions of all bigrams within window and then meaningful bigrams are extracted.",
        "We produce a-covers to extend them into n-gram collocations 1.",
        "According to the definition of Kjellmer and Cowie, a fossilized phrase is a sequence, where the occurrence of one word almost predicts the rest of the phrase and one word predicts a very limited number of words in a semi-fossilized phrase (Kjellmer, 1995) (Cowie, 1981).",
        "However, in both fossilized and semi-fossilized types there is a high degree of cohesion among the members of the phrases (Kjellmer, 1995).",
        "We consider the cohesions as a-covers that are obtained by applying a fuzzy compatibility relation, which satisfies symmetry and reflexivity, to meaningful bigrams Namely, n-gram collocations could be interpreted as equivalent sets of the meaningful bigrams through partitioning.",
        "Here, a-covers mean the clustered sets of the meaningful bigrams."
      ]
    },
    {
      "heading": "2 Related Works",
      "text": [
        "In determining properties of collocations, most of corpus-based approaches accepted that the words of a collocation have a particular statistical distribution(Cruse, 1986).",
        "Although previous approaches have shown good results in retrieving collocations and many properties have been identified, they depend heavily on the frequency factor.",
        "(Choueka et al., 1983) proposed an algorithm for retrieving only uninterrupted collocations, 2 IBigrams and n-grams can be either adjacent morphemes or separated morphems by an arbitrary number of other words.",
        "21n the case of an interrupted collocation, words can be separated by an arbitrary number of words, whereas",
        "since they assumed that a collocation is a sequence of adjacent words that frequently ap1ear together.",
        "(Church and Hanks, 1989) defined a collocation as a pair of correlated words anti used mutual information to evaluate such lexical correlations of word pairs of length two.",
        "They retrieved interrupted word pairs, as well as uninterrupted word pairs.",
        "(Haruno et al., 1996) ,:onstructed collocations by combining adjacent n-grams with high value of mutual information.",
        "(Breidt, 1993)'s study was motivated by the fact that mutual information could not give realistic figures to low frequencies and used t-score for a significance test for V-N combinations.",
        "Martin noted that a span of 5 words on left and right sides captures 95% of significant collocations in English (Martin, 1983).",
        "Based on this assumption, (Smadja, 1993) stored all bigrams of words along with their relative position, p (-5 <p < 5).",
        "He evaluated the lexical strength of a word pair using 'Z-score' and the variance of its Position distribution using 'spread'.",
        "He defined a collocation as an arbitary, domain dependent, recurrent, and cohesive lexical cluster.",
        "(Nagao and Mori, 1994) developed an algorithm for calculating adjacent n-grams to an arbitrary large number of n. However, it was hard to find an efficient n and a lot of fragments were obtained.",
        "In Korean, statistics based on adjacent n-grams is not sufficient to capture various types of collocations.",
        "(Shimohata et al., 1997) employed entropy value to filter out fragments of the adjacent n-gram model.",
        "They evaluated disorderness with the distribution of adjacent words preceding and following a string.",
        "The strings with a high value of entropy were accepted as collocations.",
        "This disorderness is efficient to eliminate fragments but can not handle interrupted collocations.",
        "In general, previous studies on collocations have dealt with restricted types and depend on filtering measures in a, lexically point of view."
      ]
    },
    {
      "heading": "3 Input Format",
      "text": [
        "in this section, we discuss an input form relevant to Korean language structure and linguistic contents which would work well on an effiuninterrupted collocation is a sequence of words.",
        "To avoid confusion of terms, we call a sequence of two words as a a djacen t bigram' and a sequence of n words as a adjacent n-gram'.",
        "cient statistics.",
        "Korean is one of agglutinative languages as well as a propositional language.",
        "An elementary node being called as eojeol: is generally composed of a content word and function words.",
        "Namely, a word in English corresponds to a couple of morphemes in Korean.",
        "A key feature of Korean is that function words, such as propositions, endings, copula, auxiliary verbs, and particles, are highly developed as independent morphemes, while they are represented as word order or inflections in English.",
        "Functional morphemes determine grammatical relations, tense, modal, and aspect.",
        "In Korean, there are lots of multiple function words in a rigid forms.",
        "They can be viewed as collocations.",
        "For this reason, our system is designed at the morphological level.",
        "A set of twelve part of speech tags, { N, J, V, P, D, E, T, 0, C, A, S, X } 3 was considered.",
        "Another feature is a free word order.",
        "Since the words of a collocation appear in text with the flexible ways, sufficient samples are required to compute accurate probabilities.",
        "We allow positional information to vary by using an interrupted bigram model.",
        "The basic input can be represented in (1).",
        "An object k means a pair of morphemes (mi,mk) and mk corresponds to one of all possible morphemes, being able to co-occur with mi.",
        "A variable j indicates the j-th position.",
        "Xii denotes the frequency of mk that occurs at the j-th position before mi.",
        "x12 x22 Given a predicate morpheme as a base morpheme, the range of window is from 1 to -10.",
        "This distance constraint is for the characteristic of SOV language.",
        "If a bigram includes an adverb morpheme, a larger window, from -20 to 10 is used because the components often appear widely separated from each other on text.",
        "In other cases, we considered the range from 5 to +5.",
        "This distant constraints are for an efficient statistics.",
        "An input data is transformed to a property matrix, T(X) as (2) that is a two dimensional",
        "array of k object, k = 1,2,...,n, on four variables, VFrequency, VCondensation, V Ranclornness)",
        "To continue explanations, we begin by mentioning the `Xtract' tool by Smadja (Smadja, 1993).",
        "Our input form was designed in a similar manner with `Xtract'.",
        "Smadja assumed that the components of a collocation should appear together in a relatively rigid way because of syntactic constraint., Namely, a bigram pair (mi, 'ink), where mk Occurs at one(or several) specific position around mi, would be a meaningful bigrams for collocations.",
        "The rigid word order is related with the variance of frequency distribution of (mi, mg).",
        "`Xtract' extracted the pairs whose variances are over a threshold and pulled out the interesting positions of them by standardization of the frequency distributions.",
        "Unfortunately, the approach for English has several limitations to work 4 on Korean structure for the following reasons: 1.",
        "For free order languages such as Korean, words are widely distributed in text, so that positional variance affects the over-filtering of Useful bigrams.",
        "Figure 1 shows that there iS no pair which contains randomly distributed morphems such as function words or nouns.",
        "This indicates that very few pairs were produced when `Xtract' is applied to Korean.",
        "2.",
        "Suppose that a meaning bigram, (mi, mk) prefers a position p3.",
        "Then, the number of concordances for condition probability P(mi, mk jp3) would be small, specially in a free order language.",
        "As shown in Table 1, the model produced a lot of long meaningless n-grams when compiling into n-grams.",
        "The precision value of Korean version of Xtract was estimated to be 40.4%.",
        "3.",
        "The eliminated bigrams by the previous stage can appear again in n-gram collocations.",
        "When compiling, the model only keeps the words occupying the position with a probability greater than a given threshold from the concordances of (mi, mk, p7).",
        "As one might imagine, the first stage could be useless.",
        "As stated above, in Korean, the effect of position on collocations needs to be treated in some complex ways.",
        "Korean collocations can be divided into four types: 'idiom' 5, 'semantic collocation' 6, 'syntactic collocation' 7, and 'morphological collocation' 8• Idioms and morphological collocations appear on text in a rigid way and word order but others do in the flexible ways.",
        "From a consideration of these more flexible collocations, we adopt an interrupted bigram model and suggest several statistics that consist with characteristics of Korean."
      ]
    },
    {
      "heading": "4 Algorithm",
      "text": [
        "This section describes how properties are represented as numerical values and how meaningful objects are retrieved.",
        "In the first stage, we extract meaningful interrupted bigrams based on four properties.",
        "Next, the meaningful bigrams are extended into n-gram collocations using a a-compatibility relation.",
        "It empirically showed that a Weibull distribution (3) provides a close approximation of frequency distribution of bigrams.",
        "• .",
        ".",
        "4(0 (also) (baeklim(location)) IA-(at) ((iill°J))(everyday) HI-7-(tears) --(object case) 3 X 0;u1-A1))(dink) aj c,~1(was -,ing) 71 oll(because) .",
        ".",
        ".",
        "• .",
        "LW) 0171(here) -.J(specially) slit(dawn) 011(at) ((%))(fresh) --(modifying ending) *(water) 5.",
        "(also) 4 ((ul-AI))(drink) .",
        ".",
        "7,-1(that) 1-i-L1Ettl-(be unsuitable) .",
        "711-(rnost) .",
        "A-I(says) -,`:---(exercise) 6 .",
        "Verb .",
        ".",
        "Noun *(object case) ((i:11;-))(too) 401(much) ((ol-A)))(drink) 4-(modifying ending) 2 7 •.",
        "Noun Noun .",
        ".",
        ".",
        "Noun4-,--011.4-1(in) ((ii°1))(boil) 01 ((uFAI))(drink) Noun 2 8 -1ft-115_ (even though).",
        "((1-))(not) ((31-A1))(drink) 3.L(and) Noun Noun .",
        "Verb Ending Verb .",
        ".",
        "-1",
        "Thus, there are a lot of pairs with low frequency which interrupt to get reliable statistic.",
        "We eliminated such pairs using median m that is a value such that P{X > ml > 1/2 to a frequency distribution F. If median is less than 3, we took the value 3 as a median.",
        "Any quantity that depends on not any unknown parameters of population distribution but only the sample is called a statistic.",
        "We regarded four statistics relating to properties of collocations as variables.",
        "Before the further explanation, consider Srni , a sample space of mi as Table 2 whose cardinalityiSmil is n. Let one ob-jec• be (rni, mk) and its frequency distribution be fik2, • • • , Jam and fik+ be fikp• Suppose that POS(mi) is ',I' and POS(mk) is To,"
      ]
    },
    {
      "heading": "4.1 Properties",
      "text": [
        "The properties which we considered are primarily concerned with the frequency and positional informations of word pairs.",
        "As we have emphasized, the correlation between position and collocation is very complicated in Korean.",
        "According to Breidt, MI or T-score thresholds work satisfactory as a filter for extraction of collocations, but filtered out at least half of the actual collocations (Breidt, 1993).",
        "Generally, assumed properties could not fully account for collocations.",
        "Therefore, in order to reduce a loss of information, the combination of observed variables would be better than filtering.",
        "We defined four variables for properties of collocations as follows.",
        "1.",
        "Vf: According to Benson's definition, a collocation is a recurrent word combination (Benson et al., 1986).",
        "We agree with this view that a word pair of high frequency would be served as a collocation.",
        "Vf statistic of an object (mi, mk), is represented as (4).",
        "Here, standardization demands attention.",
        "The mean and standard deviation are calculated in the `JP' set which the object belongs to.",
        "Intuitively, two words that prefer specific positions must be related with each other.",
        "We seeked to recapture the idea with the flexibility of word order.",
        "For this, the concept of convergence on each position was employed.",
        "In a free order language, a meaningful pair can occur in text either with two distance or three distance.",
        "Let's consider two input vectors x, (0,1,0,0,0,1,0,0,1,0) and y, (0,0,0,1,1,1,0,0,0,0).",
        "They have the same variance but y would be more meaningful than x, because y can be interpreted as (0,0,0,0,3,0,0,0,0,0) within the free order framework.",
        "Therefore, a spatial mask"
      ]
    },
    {
      "heading": "4. V,:",
      "text": [
        "(1/2,142) was devised for convergence on each position.",
        "The calculation of condensation value mikp at p-th position is:",
        "The mil is computed by neighborhoods that are located in the border of the p-th position: The maxis likely",
        "to represent the condensation of (mi, ink) but it still deficient.",
        "Intuitively, (0,1,1,1,0,3,2,0,0,0) would be less condensed than (0,0,3,0,0,3,2,0,0,0).",
        "Therefore, n' was designed for a penalty factor.",
        "it' is the number of m, such that fikm.",
        "0 0 for U < m < 10, and it is a reverse proportion to the condensation.",
        "Square root was used for preventing the excessive influence of 711 .",
        "3.",
        "We were motivated by the idea that if a pair is randomly distributed in terms of position.",
        "then it would not be meaningful.",
        "Especially in the case of function words, they are likely to be randomly distributed over a given morpheme but distributions of meaningful pairs are not random, as shown in Figure 3.",
        "A typical method for the check of randomness is to measure how far the given distribution is away from a uniform distribution.",
        "In (6), fik means the expected number of (mi, mk) at each position on the assumption that the pair randomly occurs",
        "as an error rate at each position p based on the assumption.",
        "The big difference between the expected number and the actual observed frequency means that the distribution is not random.",
        "One might think that this concept is the same with one of variance.",
        "However, note the denominator.",
        "This calculation is somewhat better than variance which depends on frequency.",
        "To become a meaningful bigram, a pair should be syntactically valid.",
        "We viewed that if the frequency distribution of a pair keeps the overall frequency distribution of the POS relation set which the pair belongs to, then the pair would be syntactically valid.",
        "To verify this idea, we depict the overall frequency distributions in some POS relations in Figure 2.",
        "It shows the frequency distributions of pairs which are composed of postposition and predicate morpheme.",
        "It is quite interesting that all objects have the similar form of frequency distribution.",
        "They have sharp peaks at the first and third position.",
        "Clearly, this illustrates that a postposition has a high probability of appearing at the first and third position before a predicate.",
        "We can conclude from this that pairs keeping the overall frequency structure would be syntactically valid.",
        "We used correlation coefficient for the structural similarity.",
        "In the case of a pair mik, the correlation value between ( f ik , fik2, fikio) and",
        "and y be two vectors whose components are mean corrected, xi – for x, yi – y for y.",
        "The correlation between two variables is straightforward, if x and y is standardized through dividing each of their elements by the standard deviations, ax and ay, respectively.",
        "Let x* be x/a-,, and y* be y/a-y, then the correlation between x and y, V„ can be represented as follows.",
        "The ranks of bigrams by four measures is summarized in Figure 3.",
        "It tells that each of the measures comes up with our expectation."
      ]
    },
    {
      "heading": "4.2 Evaluation Function",
      "text": [
        "in this section, we analyze the correlations of four measures we defined and explain how to make an evaluation function for extracting meaningful bigrams.",
        "Table 3 shows the values of correlations which exist in the given measures: Vf, V V r, V c, Cr • This explains that the defined measures have redundant parts.",
        "We can say that if a measure has the high values of",
        "correlations between others, then it has a redundant part to be eliminated.",
        "Since we don't know what factors are effective in determining useful bigram, the concept of weights is more reliable than filtering.",
        "We constructed an evaluation function, which reflects the correlations between the measures.",
        "First of all, we standardized four measures.",
        "Standardization gives an effect on adjustment of value range according to its variability.",
        "The degree of relationship between measurel and measure2 can be obtained by Crneasurel,measure2 which is {corr(measurel,measure2)}± , where x+ = x if x> 0, x+ = 0 otherwise.",
        "The evaluation function is concerned with the degrees of relationships of measures.",
        "where a = 2 – ",
        "Here, the constant 0.845) is for a compensation coefficient.",
        "The minimum value of Or, 0, and O„ is 1/3 respectively, where Cvf,v, = CV,,, = Cvf,v„ -= 0 and all correlations of V7., V, and V„ = 1.",
        "On the contray, the maximum value of Or , q5e, and O„ is 1 respectively, where Cvf,vr= Cvf,vc= Cvf,v„ = 0 and all correlations of Vr, Vc, V„ = 0.",
        "In other words, as the coefficients (pr, 0,, and O„ get closer to 1, the correlations between measures reduce.",
        "As shown in (8) and (9), we agree that V1 is a primaryl factor of collocations.",
        "Each coefficient O indicates how much the property is reflected in evaluation.",
        "For example, in the case of Or, ac'-=Fc:- is a portion which is related with the property of condensation within randomness.",
        "Therefore,, 1 a corresponds to the remainder, when subtracting this portion from randomness.",
        "The threshold for evaluation was set by testing.",
        "When the value for threshold was 0.5, good results were obtained but in noun morphems, a high value over 0.9 was required.",
        "The pairs are selected as meaningful bigrams whose values of the evaluation function are greater than the threshold."
      ]
    },
    {
      "heading": "4.3 Extending to n-grams",
      "text": [
        "The selected meaningful bigrams from the previous step are extended into n-gram collocations.",
        "At the final step, the longest ones among all (v.-covers are obtained as n-gram collocations by eliminating Substrings.",
        "Here, n-gram collocations mean interrupted collocations as well as n-character strings.",
        "We regarded Cohesive clusters of the meaningful bigrams as n-gram collocations on the assumption that Members in a collocation have a high degree of cohesion (Kjellmer, 1995).",
        "To find cohesive clusters, a fuzzy compatibility relation R is applied.",
        "R on X x X, where X is the set of all meaningful bigrams which contain a base morpheme rn, means a cohesive relation and partitions of set X obtained by R correspond to n-gram collocations.",
        "To say shortly, our problem has shifted to clustering of a set X.",
        "A reason to employ the concept of fuzzy is that equivalence sets defined by the relation may be more desirable.",
        "A fuzzy compatability relation R(X,X) is represented as a matrix by a membership function.",
        "The membership function of a fuzzy set A E X is denoted by iLA : X – > [0, 1] and maps elements of a given set X into real numbers in [0,1].",
        "These two membership functions itA were used to define the cohesive relation as follows.",
        "Let Ix and 1Y I be the frequency of concordances which contains the bigram pairs x and y, respectively.",
        "jxnyj means how often two pairs x and y co-occur in the same concordances under the distance constraint.",
        "(10) is relative entropy measure and (11) is dice coefficient.",
        "This measures are concerned with a lexical relation for cohesive degrees.",
        "To get equivalence sets, it is very important to identify properties of the relation R we defined.",
        "A relation which is reflexive, symmetric and transitive is called as an equivalence relation or similarity relation.",
        "In our case, the fuzzy cohesive relation, R is certainly reflexive and symmetric.",
        "If R(x, z) > m,aXye y min[R(x,y),R(y, z)] is satisfied for all (x, z) E X2, then R is transitive.",
        "Generally, transitive closure is used for checking transitivity.",
        "The transitive closure of a relation is defined as the smallest fuzzy relation which is transitive and has the fewest possible members with containing the relation itself.",
        "Given a relation S(X,X), its max-min transitive closure ST(X, X) can be calculated by the following algorithm consisted of three steps:",
        "1.",
        "= S U (S o S) , o is a max-min composition operator.",
        "2.",
        "If S' S, make S = S' and go to Step 1.",
        "3.",
        "Stop: S' = ST •",
        "If above algorithm terminates after the first iteration when applied to R, R satisfies transitivity.",
        "To verify its transitivity, above alogrithm were employed.",
        "As a result, R did not satisfy transitivity.",
        "It means that an element of X could be",
        "long to multiple classes by R. This proves that the relation R is valid to explain collocations.",
        "A fuzzy binary relation R(X,X) which is reflexive and symmetric is called as a fuzzy compatibility relation and is usually referred to as masi-equivalence relation.",
        "When R is a fuzzy compatibility relation, compatibility classes are defined in terms of a specified membership degree a.",
        "An a-compatibility class is a subset A of X. such that R(x, y) > a for all x, y E A and the 'family consisting of the compatibility classes is called as an a-cover of X to R in terms of a specific membership degree a.",
        "An a-cover forms partitions of X and an element of X could belong to multiple a-compatibility classes.",
        "Here, we accepted a-covers at 0.20 a-level in dice and 0.30 in relative entropy.",
        "One might argue why we did not directly apply all bigrams to this stage with skipping the previous stage.",
        "We hope to deal with the corn-parision in a later paper."
      ]
    },
    {
      "heading": "5 Evaluation",
      "text": [
        "We performed experiments for evaluation on 328, 859 sentences(8.5 million-morphemes) from Yonsei balanced copora.",
        "250 morphemes were selected for a test, such that frequency > 150.",
        "The morphemes have 8,064 pairs and 773 were extracted as meaningful bigrams.",
        "In the second stage, 3,490 disjoint a-compatibility classes corresponding to lexically cohesive clusters were generated.",
        "698 longest n-gram collocations out of the a-compatibility classes were extracted by eliminating the fragments that can be subsumed in longer classes.",
        "The precision of extracted meaningful bigram was 86.3% and 92% in the case of n-gram collocations.",
        "We could take either a-covers and the longest n-grams as n-gram collocations according to applications.",
        "Since unfortunately, there is no existing database of collocations for evaluation, it is not easy to compute precision values and recall values as well.",
        "We computed the precision values by hand.",
        "As a different approach to Korean collocations, (Lee et al., 1996) extracted interrupted bigrams using several filtering conditions and at least the 90% of the results were adjacent bigrams of length 1.",
        "By this comparison, we may conclude that our approach is more flexible to deal with Korean word order.",
        "Figure 3 9 displays the changes of rank according to measures we considered.",
        "It shows that in contrast to other models, the properties have been effective in retrieving collocations which contain pairs of morphemes with relatively low frequency.",
        "Since the ranks of bigrams in four measures came up with our expectation, if we could make more adequate evaluation function, the precision would be improved.",
        "Table 4 shows some obtained meaningful bigrams of `01-1-1 (not)'.",
        "There are a great deal of expressions relating negative sentences in Korean.",
        "The components of them occurs separated in various ways.",
        "When evaluating meaningful bigrams, the coefficients for the evaluation function are as follows: Or 0.432, 0, 0.490, Ocr \":z-i 0.371 in the case of `0]-1--1(not)'.",
        "This means that the influence of three other measures is 1.284 times more than that of frequency measure in 'JP' POS relation.",
        "We will illustrate all steps with a word, ',0'(wear).",
        "The results of the first stage, meaningful bigrams of `-.0'(wear) 1° are shown in Figure 4.",
        "In the second stage, we calculated membership grades of inputs using dice measure and relative entropy measure.",
        "As Figure 4 shows, dice measure looks unsatisfactory in such cases as the pair '(-g--(object case), taoi (much))'.",
        "Although the common frequency, 3 is a relatively high in the aspect of the word with lower frequency, `1401'(much), the value of dice is low.",
        "Thus, we also tested relative entropy based on the probability of low frequency.",
        "Two measures produce similar results if all values in the level set of R is considered instead of a specific value of a, but entropy measure produces more good results.",
        "Figure 4 and 5 show all a-compatibility classes and the longest n-gram collocations of '(wear).",
        "Through our method, various kind of collocations were extracted.",
        "In Figure 4, the order of components of a a is by concordances."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "In this paper, we implemented measures which reflect the four properties of collocation respec",
        "tively and the evaluation function which appropriately combines the measures.",
        "Our approach was primarily focused on the subtle relationships between word positions and collocations in a free order language.",
        "We extracted meaningful bigrams using an evaluation function and extended them into n-grams by producing a-compatibility classes.",
        "The usefulness of our algorithm were illustrated by examples and tables.",
        "This method covered various range of collocations, which the extracted collocation patterns were case frames, multiple functional words, selectional restrictions, semantic phrases, com",
        "pound nouns, and idioms and it could be applicable to other free order languages.",
        "With the development of recognition of phrases, the input format and related distance between morphemes, the algorithm can be used effectively.",
        "Also linguistic contents for statistical constraints should be reflected in the system.",
        "We have plans to check how this algorithm will work in English and to align bilingual collocations for machine translation."
      ]
    }
  ]
}
