{
  "info": {
    "authors": [
      "Kiyotaka Uchimoto",
      "Satoshi Sekine",
      "Hitoshi Isahara"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E99-1026",
    "title": "Japanese Dependency Structure Analysis Based on Maximum Entropy Models",
    "url": "https://aclweb.org/anthology/E99-1026",
    "year": 1999
  },
  "references": [
    "acl-J96-1002",
    "acl-P96-1025",
    "acl-P98-1083",
    "acl-W97-0301"
  ],
  "sections": [
    {
      "text": [
        "[uchimot o isahara] @crl .go .",
        "jp"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "This paper describes a dependency structure analysis of Japanese sentences based on the maximum entropy models.",
        "Our model is created by learning the weights of some features from a training corpus to predict the dependency between bunsetsus or phrasal units.",
        "The dependency accuracy of our system is 87.2% using the Kyoto University corpus.",
        "We discuss the contribution of each feature set and the relationship between the number of training data and the accuracy."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Dependency structure analysis is one of the basic techniques in Japanese sentence analysis.",
        "The Japanese dependency structure is usually represented by the relationship between phrasal units called `bunsetsu.' The analysis has two conceptual steps.",
        "In the first step, a dependency matrix is prepared.",
        "Each element of the matrix represents how likely one bunsetsu is to depend on the other.",
        "In the second step, an optimal set of dependencies for the entire sentence is found.",
        "In this paper, we will mainly discuss the first step, a model for estimating dependency likelihood.",
        "So far there have been two different approaches to estimating the dependency likelihood.",
        "One is the rule-based approach, in which the rules are created by experts and likelihoods are calculated by some means, including semiautomatic corpus-based methods but also by manual assignment of scores for rules.",
        "However, hand-crafted rules have the following problems.",
        "• They have a problem with their coverage.",
        "Because there are many features to find correct dependencies, it is difficult to find them manually.",
        "• They also have a problem with their consis",
        "tency, since many of the features compete with each other and humans cannot create consistent rules or assign consistent scores.",
        "• As syntactic characteristics differ across different domains, the rules have to be changed when the target domain changes.",
        "It is costly to create a new handmade rule for each domain.",
        "Another approach is a fully automatic corpus-based approach.",
        "This approach has the potential to overcome the problems of the rule-based approach.",
        "It automatically learns the likelihoods of dependencies from a tagged corpus and calculates the best dependencies for an input sentence.",
        "We take this approach.",
        "This approach is taken by some other systems (Collins, 1996; Fujio and Matsumoto, 1998; Haruno et al., 1998).",
        "The parser proposed by Ratnaparkhi (Ratnaparkhi, 1997) is considered to be one of the most accurate parsers in English.",
        "Its probability estimation is based on the maximum entropy models.",
        "We also use the maximum entropy model.",
        "This model learns the weights of given features from a training corpus.",
        "The weights are calculated based on the frequencies of the features in the training data.",
        "The set of features is defined by a human.",
        "In our model, we use features of bunsetsu, such as character strings, parts of speech, and inflection types of bunsetsu, as well as information between bunsetsus, such as the existence of punctuation, and the distance between bunsetsus.",
        "The probabilities of dependencies are estimated from the model by using those features in input sentences.",
        "We assume that the overall dependencies in a whole sentence can be determined as the product of the probabilities of all the dependencies in the sentence.",
        "Proceedings of EACL '99 Now, we briefly describe the algorithm of dependency analysis.",
        "It is said that Japanese dependencies have the following characteristics.",
        "(1) Dependencies are directed from left to right (2) Dependencies do not cross (3) A bunsetsu, except for the rightmost one, depends on only one bunsetsu (4) In many cases, the left context is not necessary to determine a dependency)",
        "The analysis method proposed in this paper is designed to utilize these features.",
        "Based on these properties, we detect the dependencies in a sentence by analyzing it backwards (from right to left).",
        "In the past, such a backward algorithm has been used with rule-based parsers (e.g., (Fujita, 1988)).",
        "We applied it to our statistically based approach.",
        "Because of the statistical property, we can incorporate a beam search, an effective way of limiting the search space in a backward analysis."
      ]
    },
    {
      "heading": "2 The Probability Model",
      "text": [
        "Given a tokenization of a test corpus, the problem of dependency structure analysis in Japanese can be reduced to the problem of assigning one of two tags to each relationship which consists of two bunsetsus.",
        "A relationship could be tagged as \"0\" or \"1\" to indicate whether or not there is a dependency between the bunsetsus, respectively.",
        "The two tags form the space of \"futures\" for a maximum entropy formulation of our dependency problem between bunsetsus.",
        "A maximum entropy solution to this, or any other similar problem allows the computation of P(fih) for any f from the space of possible futures, F, for every h from the space of possible histories, H. A \"history\" in maximum entropy is all of the conditioning data which enables you to make a decision among the space of futures.",
        "In the dependency problem, we could reformulate this in terms of finding the probability of f associated with the relationship at index t in the test corpus as:",
        "from the test corpus related to relationship 1) The computation of P(flh) in M.E.",
        "is dependent on a set of \"features\" which, hopefully, are helpful in making a prediction about the future.",
        "Like most current M.E.",
        "modeling efforts in computational linguistics, we restrict ourselves to features which are binary functions of the history and )Assumption (4) has not been discussed very much, but our investigation with humans showed that it is true in more than 90% of cases.",
        "future.",
        "For instance, one of our features is if has(h, x) = ture,",
        "Here \"has(h,x)\" is a binary function which returns true if the history h has an attribute x.",
        "We focus on attributes on a bunsetsu itself and those between bunsetsus.",
        "Section 3 will mention these attributes.",
        "Given a set of features and some training data, the maximum entropy estimation process produces a model in which every feature gi has associated with it a parameter ai.",
        "This allows us to compute the conditional probability as follows (Berger et al., 1996):",
        "The maximum entropy estimation technique guarantees that for every feature gi, the expected value of gi according to the M.E.",
        "model will equal the empirical expectation of gi in the training corpus.",
        "In other words:",
        "Here P is an empirical probability and PmE is the probability assigned by the M.E.",
        "model.",
        "We assume that dependencies in a sentence are independent of each other and the overall dependencies in a sentence can be determined based on the product of probability of all dependencies in the sentence."
      ]
    },
    {
      "heading": "3 Experiments and Discussion",
      "text": [
        "In our experiment, we used the Kyoto University text corpus (version 2) (Kurohashi and Nagao, 1997), a tagged corpus of the Mainichi newspaper.",
        "For training we used 7,958 sentences from newspaper articles appearing from January 1st to January 8th, and for testing we used 1,246 sentences from articles appearing on January 9th.",
        "The input sentences were morphologically analyzed and their bunsetsus were identified.",
        "We assumed that this preprocessing was done correctly before parsing input sentences.",
        "If we used automatic morphological analysis and bunsetsu identification, the parsing accuracy would not decrease so much because the rightmost element in a bunsetsu is usually a case marker, a verb ending, or a adjective ending, and each of these is easily recognized.",
        "The automatic preprocessing by using public domain",
        "Proceedings of EACL '99 tools, for example, can achieve 97% for morphological analysis (Kitauchi et al., 1998) and 99% for bunsetsu identification (Murata et al., 1998).",
        "We employed the Maximum Entropy tool made by Ristad (Ristad, 1998), which requires one to specify the number of iterations for learning.",
        "We set this number to 400 in all our experiments.",
        "In the following sections, we show the features used in our experiments and the results.",
        "Then we describe some interesting statistics that we found in our experiments.",
        "Finally, we compare our work with some related systems."
      ]
    },
    {
      "heading": "3.1 Results of Experiments",
      "text": [
        "The features used in our experiments are listed in Tables 1 and 2.",
        "Each row in Table 1 contains a feature type, feature values, and an experimental result that will be explained later.",
        "Each feature consists of a type and a value.",
        "The features are basically some attributes of a bunsetsu itself or those between bunsetsus.",
        "We call them 'basic fea-tures.' The list is expanded from Haruno's list (Haruno et al., 1998).",
        "The features in the list are classified into five categories that are related to the \"Head\" part of the anterior bunsetsu (category \"a\"), the \"Type\" part of the anterior bunsetsu (category \"b\"), the \"Head\" part of the posterior bunsetsu (category \"c\"), the \"Type\" part of the posterior bunsetsu (category \"d\"), and the features between bunsetsus (category \"e\") respectively.",
        "The term \"Head\" basically means a rightmost content word in a bunsetsu, and the term \"Type\" basically means a function word following a \"Head\" word or an inflection type of a \"Head\" word.",
        "The terms are defined in the following paragraph.",
        "The features in Table 2 are combinations of basic features (`combined features').",
        "They are represented by the corresponding category name of basic features, and each feature set is represented by the feature numbers of the corresponding basic features.",
        "They are classified into nine categories we constructed manually.",
        "For example, twin features are combinations of the features related to the categories \"b\" and \"c.\" Triplet, quadruplet and quintuplet features basically consist of the twin features plus the features of the remainder categories \"a,\" \"d\" and \"e.\" The total number of features is about 600,000.",
        "Among them, 40,893 were observed in the training corpus, and we used them in our experiment.",
        "The terms used in the table are the following: Anterior: left bunsetsu of the dependency Posterior: right bunsetsu of the dependency Head: the rightmost word in a bunsetsu other than those whose major part-of-speech2 category is \"4* (special marks),\" \"MN (post-positional particles),\" or \"4f1 n (suffix)\" Part-of-speech categories follow those of JU-MAN(Kurohashi and Nagao, 1998).",
        "Head-Lex: the fundamental form (uninflected form) of the head word.",
        "Only words with a frequency of three or more are used.",
        "Head-Inf: the inflection type of a head Type: the rightmost word other than those whose major part-of-speech category is \"4 * (special marks).\" If the major category of the word is neither \"MN (post-positional par-ticles)\" nor \"tows (suffix),\" and the word is inflectable3, then the type is represented by the inflection type.",
        "JOSHI1: the rightmost post-positional particle in the bunsetsu JOSHI2: the second rightmost post-positional particle in the bunsetsu if there are two or more post-positional particles in the bunsetsu TOUTEN, WA: TOUTEN means if a comma (Touten) exists in the bunsetsu.",
        "WA means if the word WA (a topic marker) exists in the bunsetsu BW: BW means \"between bunsetsus\" BW-Distance: the distance between the bunsetsus BW-TOUTEN: if TOUTEN exists between bunsetsus BW-IDto-Anterior-Type: BW-IDto-Anterior-Type means if there is a bunsetsu whose type is identical to that of the anterior bunsetsu between bunsetsus BW-IDto-Anterior-Type-Head-POS: the part-of-speech category of the head word of the bunsetsu of \"BW-IDto-Anterior-Type\" BW-IDto-Posterior-Head: if there is between bunsetsus a bunsetsu whose head is identical to that of the posterior bunsetsu BW-IDto-Posterior-Head-Type(String): the lexical information of the bunsetsu \"BWIDto-Posterior-Head\" The results of our experiment are listed in Table 3.",
        "The dependency accuracy means the percentage of correct dependencies out of all dependencies.",
        "The sentence accuracy means the percentage of sentences in which all dependencies were analyzed correctly.",
        "We used input sentences that had already been morphologically analyzed and for which bunsetsus had been identified.",
        "The first line in Table 3 (deterministic) shows the accuracy achieved when the test sentences were analyzed deterministically (beam width k = 1).",
        "The second line in Table 3 (best beam search) shows the best accuracy among the experiments when changing the beam breadth k from 1 to 20.",
        "The best accuracy was achieved when k = 11, although the variation in accuracy was very small.",
        "This result supports assumption (4) in Chapter 1 because 'The inflection types follow those of JUMAN.",
        "Combined features (9 categories, 134 types) Combination type Combinations Accuracy without Category Feature set the feature Twin features: (b, c) b = {6, 7, 8}, c = {16, 17, 18) 86.99% (-0.15%) related to the \"Type\" part of the anterior bunsetsu and the \"Head\" part of the posterior bunsetsu.",
        "Triplet features: (b1, b2, c) (b1, b2) = {(9, 11), (10, 12)), c = {17, 18} 86.47% (-0.67%) basically consist of the twin (b, c, e) b = {6, 7, 8), c = {17, 18}, features plus the features e = {31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43} between bunsetsus.",
        "(d1 , d2, e) (d1, d1 , e) = (29, 30, 34) Quadruplet features: (b1, b2, c, d) ID/ = {6, 7, 8}, c = {17, 18), (b2, d) = (13, 28) 85.65% (-1.49%) basically consist of the twin (b, c, el, e2) b = {6, 7, 8}, c = {17, 18}, (el, e2) = (35, 40) features plus the features (a, b, c, d) (a, c) = {(1, 16), (2, 17), (3, 18)), related to the \"Head\" part of (b, d) = {(6, 21), (7, 22), (8, 23)} the anterior bunsetsu, and the \"Type\" part of the posterior bunsetsu.",
        "Quintuplet features: (a, b1, b2, c, d) (a, c) = {(2, 17), (3, 18)), 86.96% (-0.18%) basically consist of the (b1, b2) = {(9, 11), (10, 12)}, d = {21,22,23} quadruplet features plus the (a, b, c, d, e) (a, c) = {(1, 16), (2, 17), (3, 18)}, features between bunsetsus.",
        "(b, d) = {(6, 21), (7, 22), (8, 23}, e = 31",
        "it shows that the previous context has almost no effect on the accuracy.",
        "The last line in Table 3 represents the accuracy when we assumed that every bunsetsu depended on the next one (baseline).",
        "Figure 1 shows the relationship between the sentence length (the number of bunsetsus) and the dependency accuracy.",
        "The data for sentences longer than 28 segments are not shown, because there was at most one sentence of each, length.",
        "Figure 1 shows that the accuracy degradation due to increasing sentence length is not significant.",
        "For the entire test corpus the average running time on a SUN Sparc Station 20 was 0.08 seconds per sentence."
      ]
    },
    {
      "heading": "3.2 Features and Accuracy",
      "text": [
        "This section describes how much each feature set contributes to improve the accuracy.",
        "The rightmost column in Tables 1 and 2 shows the performance of the analysis without each feature set.",
        "In parenthesis, the percentage of improvement or degradation to the formal experiment is shown.",
        "In the experiments, when a basic feature was deleted, the combined features that included the basic feature were also deleted.",
        "We also conducted some experiments in which several types of features were deleted together.",
        "The results are shown in Table 4.",
        "All of the results in the experiments were carried out deterministically (beam width k = 1).",
        "The results shown in Table 1 were very close to our expectation.",
        "The most useful features are the type of the anterior bunsetsu and the part-of-speech tag of the head word on the posterior bunsetsu.",
        "Next important features are the distance between bunsetsus, the existence of punctuation in the bunsetsu, and the existence of brackets.",
        "These results indicate preferential rules with respect to the features.",
        "The accuracy obtained with the lexical features of the head word was better than that without them.",
        "In the experiment with the features, we found many idiomatic expressions, for example, \"Z L\" (oujite, according to) – 1A.N5 6 (kimeru, decide)\" and \"3V-C. (katachi_de, in the form of) – HMI 6 (okonawareru, be held).\" We would expect to collect more of such expressions if we use more training data.",
        "The experiments without some combined features are reported in Tables 2 and 4.",
        "As can be seen from the results, the combined features are very useful to improve the accuracy.",
        "We used these combined features in addition to the basic features because we thought that the basic features were actually related to each other.",
        "Without the combined features, the features are independent of each other in the maximum entropy framework.",
        "We manually selected combined features, which are shown in Table 2.",
        "If we had used all combi",
        "nations, the number of combined features would have been very large, and the training would not have been completed on the available machine.",
        "Furthermore, we found that the accuracy decreased when several new features were added in our preliminary experiments.",
        "So, we should not use all combinations of the basic features.",
        "We selected the combined features based on our intuition.",
        "In our future work, we believe some methods for automatic feature selection should be studied.",
        "One of the simplest ways of selecting features is to select features according to their frequencies in the training corpus.",
        "But using this method in our current experiments, the accuracy decreased in all of the experiments.",
        "Other methods that have been proposed are one based on using the gain (Berger et al., 1996) and an approximate method for selecting informative features (Shirai et al., 1998a), and several criteria for feature selection were proposed and compared with other criteria (Berger and Printz, 1998).",
        "We would like to try these methods.",
        "Investigating the sentences which could not be analyzed correctly, we found that many of those sentences included coordinate structures.",
        "We believe that coordinate structures can be detected to a certain extent by considering new features which take a wide range of information into account."
      ]
    },
    {
      "heading": "3.3 Number of Training Data and Accuracy",
      "text": [
        "Figure 2 shows the relationship between the number of training data (the number of sentences) and the accuracy.",
        "This figure shows dependency accuracies for the training corpus and the test corpus.",
        "Accuracy of 81.84% was achieved even with a very small training set (250 sentences).",
        "We believe that this is due to the strong characteristic of the maximum entropy framework to the data sparseness problem.",
        "From the learning curve, we can expect a certain amount of improvement if we have more training data."
      ]
    },
    {
      "heading": "3.4 Comparison with Related Works",
      "text": [
        "This section compares our work with related statistical dependency structure analyses in Japanese."
      ]
    },
    {
      "heading": "Comparison with",
      "text": [
        "Shirai's work (Shirai et al., 1998b) Shirai proposed a framework of statistical language modeling using several corpora: the EDR corpus, RWC corpus, and Kyoto University corpus.",
        "He combines a parser based on a handmade CFG and a probabilistic dependency model.",
        "He also used the maximum entropy model to estimate the dependency probabilities between two or three post-positional particles and a verb.",
        "Accuracy of 84.34% was achieved using 500 test sentences of length 7 to 9 bunsetsus.",
        "In both his and our experiments, the input sentences were morphologically analyzed and their bunsetsus were identified.",
        "The comparison of the results cannot strictly be done because the conditions were different.",
        "However, it should be noted that the accuracy achieved by our model using sentences of the same length was about 3% higher than that of Shirai's model, although we used a much smaller set of training data.",
        "We believe that it is because his approach is based on a handmade CFG.",
        "Comparison with Ehara's work (Ehara, 1998) Ehara also used the Maximum Entropy model, and a set of similar kinds of features to ours.",
        "However, there is a big difference in the number of features between Ehara's model and ours.",
        "Besides the difference in the number of basic features, Ehara uses only the combination of two features, but we also use triplet, quadruplet, and quintuplet features.",
        "As shown in Section 3.2, the accuracy increased more than 5% using triplet or larger combinations.",
        "We believe that the difference in the combination features between Ehara's model and ours may have led to the difference in the accuracy.",
        "The accuracy of his system was about 10% lower than ours.",
        "Note that Ehara used TV news articles for training and testing, which are different from our corpus.",
        "The average sentence length in those articles was 17.8, much longer than that (average: 10.0) in the Kyoto University text corpus.",
        "Comparison with Fujio's work (Fujio and Matsumoto, 1998) and Haruno's work (Haruno et al., 1998) Fujio used the Maximum Likelihood model with similar features to our model in his parser.",
        "Haruno proposed a parser that uses decision tree",
        "models and a boosting method.",
        "It is difficult to directly compare these models with ours because they use a different corpus, the EDR corpus which is ten times as large as our corpus, for training and testing, and the way of collecting test data is also different.",
        "But they reported an accuracy of around 85%, which is slightly worse than our model.",
        "We carried out two experiments using almost the same attributes as those used in their experiments.",
        "The results are shown in Table 5, where the lines \"Feature set(1)\" and \"Feature set(2)\" show the accuracies achieved by using Fujio's attributes and Haruno's attributes respectively.",
        "Considering that both results are around 85% to 86%, which is about the same as ours.",
        "From these experiments, we believe that the important factor in the statistical approaches is not the model, i.e.",
        "Maximum Entropy, Maximum Likelihood, or Decision Tree, but the feature selection.",
        "However, it may be interesting to compare these models in terms of the number of training data, as we can imagine that some models are better at coping with the data sparseness problem than others.",
        "This is our future work."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "This paper described a Japanese dependency structure analysis based on the maximum entropy model.",
        "Our model is created by learning the weights of some features from a training corpus to predict the dependency between bunsetsus or phrasal units.",
        "The probabilities of dependencies between bunsetsus are estimated by this model.",
        "The dependency accuracy of our system was 87.2% using the Kyoto University corpus.",
        "In our experiments without the feature sets shown in Tables 1 and 2, we found that some basic and combined features strongly contribute to improve the accuracy.",
        "Investigating the relationship between the number of training data and the accuracy, we found that good accuracy can be achieved even with a very small set of training data.",
        "We believe that the maximum entropy framework has suitable characteristics for overcoming the data sparseness problem.",
        "There are several future directions.",
        "In particular, we are interested in how to deal with coordinate structures, since that seems to be the largest problem at the moment."
      ]
    }
  ]
}
