{
  "info": {
    "authors": [
      "Frank Schilder"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E99-1049",
    "title": "Pointing to Events",
    "url": "https://aclweb.org/anthology/E99-1049",
    "year": 1999
  },
  "references": [
    "acl-J95-2003"
  ],
  "sections": [
    {
      "heading": "1 Introduction",
      "text": [
        "Although there is an extensive body of research concerned with anaphora resolution (e.g. (Fox, 1987; Grosz et al., 1995)), event anaphora has been widely neglected.",
        "This paper describes the results of an empirical study regarding event reference.",
        "The experiment investigated event anaphora in narrative discourse via a sentence completion task.",
        "The results of the experiment suggest that the discourse structure established by an explanation or elaboration relation has an influence on whether the last mentioned event, previously mentioned events or a complex event is preferably referred to.",
        "First, a short introduction is given to the observation that reference by the demonstrative pronoun this can only be done to antecedents mentioned in segments at the right frontier of the discourse structure tree (Webber, 1991).",
        "Second, although the right frontier restriction is generally agreed on by researchers, it is still unclear what kind of information is actually stored on higher levels of the discourse tree.",
        "Segmented Discourse Structure Theory (SDRT) is introduced (Asher, 1993) and the predictions of this theory are discussed regarding event anaphora for two example discourses.",
        "These predictions are also compared with the predictions according to Webber (1991).",
        "Neither theory adequately explains the results of the current experiment.",
        "Thus the presentation concludes with an outline of a proposed computational theory."
      ]
    },
    {
      "heading": "2 Background",
      "text": [
        "Generally speaking, events are referred to by pronominal expressions such as that or this:1",
        "(1) (a) John hated snakes.",
        "(b) His neighbour had kept snakes, (c) and he had been bit",
        "'The sequence is a slightly altered example taken from Webber (1991).",
        "ten by a snake once.",
        "(d) This was unfortunate.",
        "The pronoun this in (1d) may refer to the entire situation described by (la) through (lc).",
        "But there are other conceivable antecedents for this.",
        "The situation described by (lc) may be referred to by this as well, if we consider an alternation of (1d) as in the following: (1') d'.",
        "This was quite dangerous.",
        "The example discourse illustrates that the discourse in (la-c) is organised hierarchically and consists of different discourse segments (e.g. (lac) and (lb-c)).",
        "Webber (1991) points out that events are only available for anaphoric reference when they are mentioned by the last utterance (e.g. (1c)) or by the situation that is constructed by the preceding discourse segment (e.g. (la-c)).",
        "The right frontier hypothesis reflects this observation as shown by bold typeset in figure 1.",
        "The dis",
        "course structure also influences how we conceptualise situations described in a text.",
        "In particular, a segment in (la-c) establishes a complex event that can be referred to."
      ]
    },
    {
      "heading": "3 Predictions",
      "text": [
        "Unfortunately, there is much disagreement between theoretical approaches to discourse processing on what exactly is available on the right frontier.",
        "The tree structure proposed by Webber, for example, contains the semantic content grouped together for the entire segment.",
        "Asher (1993), on the other hand, defines open attachment sites of the discourse structure by the term openness via rhetorical relations.",
        "Only elaboration and explanation allow reference to antecedents mentioned in sentences other than the current one.",
        "An explanation relation holds, for example, between (2b) and (2c) (and elaboration between (3b) and (3c) see below):",
        "(2) (a) Peter was sitting in his chair at home.",
        "(b) All of a sudden, he stood up.",
        "(c) The doorbell had rung.",
        "This was...",
        "Following Webber's account, this can only refer to the situation described by the last utterance (2c) or the situations described by the sentences (2b-c) or (2a-c), but not to (2a) and (2c).",
        "In contrast, SDRT predicts that the situations described by sentence (2b) or (2c) are available, but not by (2a) nor any combined situation.",
        "Consequently, the empirical investigation focuses especially on the question of which described events are available for further attachments and event anaphora depending on the chosen rhetorical relation (i.e. explanation or elaboration)."
      ]
    },
    {
      "heading": "4 Experimental data",
      "text": [
        "Six ambiguous sequences such as (2) or (3) were presented to 115 participants.",
        "They were asked first to continue the sentences and then to specify explicitly what this referred to.",
        "(3) Saturday was Jerry's birthday.",
        "Several students organized a dinner for Jerry.",
        "Some students had written fancy invitation cards.",
        "This was...",
        "Note that the results as shown by table 1 cannot be explained by either theoretical approach.",
        "The results for the explanation relation is best explained by Webber, since either the last mentioned situation or a combined situation of the segments (2b-c) were most often chosen by the participants.",
        "On the other hand, results for the elaboration relation contradict the predictions made.",
        "The situation described by (3b) should not be available according to Webber's account, instead an ambiguity between (3b) and (3c) can be observed for this sequence.",
        "This would be predicted by SDRT.",
        "But SDRT cannot explain the combination of two situations that was chosen by subjects 18% of the time for an explanation relation.2 Results suggest that the type of rhetorical relation has a crucial influence.",
        "An explanation relation linking (2b) and (2c) focuses on the sentence describing the cause (i.e. the last utterance), whereas an elaboration relation as in (3) establishes an ambiguous sequence between the last two described situations.",
        "In addition, note that a significant proportion of the participants referred to a combined event regardless of the rhetorical relation."
      ]
    },
    {
      "heading": "5 A computational model",
      "text": [
        "A computational model could benefit from the results presented in this paper.",
        "First, the choice of rhetorical relation should affect the way possible antecedents are represented for anaphora resolution.",
        "Second, the current data as well as data from reading experiments, for instance, could be used to determine the likelihood of possible attachment sites in the discourse structure.",
        "However, another question remains: what should the representation of a complex event look like?",
        "The tree structure proposed by Webber contains the semantic content grouped together for the entire segment.",
        "It seems more plausible that at a higher level of a discourse some form of abstraction takes place.",
        "Future research must focus on the information that is available from preceding text and what is obtainable for anaphoric expressions such as demonstrative pronouns and definite descriptions."
      ]
    }
  ]
}
