{
  "info": {
    "authors": [
      "Zhiyi Chi"
    ],
    "book": "Computational Linguistics",
    "id": "acl-J99-1004",
    "title": "Statistical Properties of Probabilistic Context-Free Grammars",
    "url": "https://aclweb.org/anthology/J99-1004",
    "year": 1999
  },
  "references": [
    "acl-H92-1028",
    "acl-J96-1002",
    "acl-J97-4005",
    "acl-J98-2005",
    "acl-J98-4004"
  ],
  "sections": [
    {
      "text": [
        "We prove a number of useful results about probabilistic context-free grammars (PCFGs) and their Gibbs representations.",
        "We present a method, called the relative weighted frequency method, to assign production probabilities that impose proper PCFG distributions on finite parses.",
        "We demonstrate that these distributions have finite entropies.",
        "In addition, under the distributions, sizes of parses have finite moment of any order.",
        "We show that Gibbs distributions on CFG parses, which generalize PCFG distributions and are more powerful, become PCFG distributions if their features only include frequencies of production rules in parses.",
        "Under these circumstances, we prove the equivalence of the maximum-likelihood (ML) estimation procedures for these two types of probability distributions on parses.",
        "We introduce the renormalization of improper PCFGs to proper ones.",
        "We also study PCFGs from the perspective of stochastic branching processes.",
        "We prove that with their production probabilities assigned by the relative weighted frequency method, PCFGs are subcritical, i.e., their branching rates are less than one.",
        "We also show that by renormalization, connected supercritical PCFGs become subcritical ones.",
        "Finally, some minor issues, including identifiability and approximation of production probabilities of PCFGs, are discussed."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "This article proves a number of useful properties of probabilistic context-free grammars (PCFGs).",
        "In this section, we give an introduction to the results and related topics."
      ]
    },
    {
      "heading": "1.1 Assignment of Proper PCFG Distributions",
      "text": [
        "Finite parse trees, or parses, generated by a context-free grammar (CFG) can be equipped with a variety of probability distributions.",
        "The simplest way to do this is by production probabilities.",
        "First, for each nonterminal symbol in the CFG, a probability distribution is placed on the set of all productions from that symbol.",
        "Then each finite parse tree is allocated a probability equal to the product of the probabilities of all productions in the tree.",
        "More specifically, denote a finite parse tree by T. For any production rule A a of the CFG, let f (A a; r) be the number of times it occurs in T. Let R be the set of all production rules.",
        "Then",
        "A CFG with a probability distribution on its parses assigned in this way is called a probabilistic context-free grammar (PCFG) (Booth and Thompson 1973; Grenander",
        "1976)1 and the probability distribution is called a PCFG distribution.",
        "A PCFG may be improper, i.e., the total probability of parses may be less than one.",
        "For instance, consider the CFG in Chomsky normal form:",
        "where S is the only nonterminal symbol, and a is the only terminal symbol.",
        "If p(S SS) = p, then p(S – > a) =1 – p. Let xh be the total probability of all parses with height no larger than h. Clearly, xh is increasing.",
        "It is not hard to see that xh±i = 1 – p + Therefore, the limit of xh, which is the total probability of all parses, is a solution for the equation x = 1 – p + px2.",
        "The equation has two solutions: 1 and 1/p – 1.",
        "It can be shown that x is the smaller of the two: x = min(1, 1/p – 1).",
        "Therefore, if p > 1/2, x < 1 – an improper probability.",
        "How to assign proper production probabilities is quite a subtle problem.",
        "A sufficient condition for proper assignment is established by Chi and Geman (1998), who prove that production probabilities estimated by the maximum-likelihood (ML) estimation procedure (or relative frequency estimation procedure, as it is called in computational linguistics) always impose proper PCFG distributions.",
        "Without much difficulty, this result can be generalized to a simple procedure, called \"the relative weighted frequency\" method, which assigns proper production probabilities of PCFGs.",
        "We will give more details of the generalization in Section 3 and summarize the method in Proposition 1."
      ]
    },
    {
      "heading": "1.2 Entropy and Moments of Parse Tree Sizes",
      "text": [
        "As a probabilistic model for languages, the PCFG model has several important statistical properties, among which is the entropy of PCFG distribution on parses.",
        "Entropy is a measure of the uncertainty of a probability distribution.",
        "The larger its entropy, the less one can learn about parses randomly sampled from the distribution.",
        "As an example, suppose we have a set S of N parses – or any objects-71, ,TN, where N is very large.",
        "We may ask how much one can learn from the sentence \"T is a random sample from S.\" At one extreme, let the distribution on S be p(Ti) = 1, and p(r1) = 0, for i 1.",
        "Then, because with probability one, T = there is no uncertainty about the sample.",
        "In other words, we can get full information from the above sentence.",
        "At the other extreme, suppose the distribution is p(n) = = p(TN) = 1/N.",
        "In this case, all the elements of S are statistically equivalent.",
        "No specific information is given about T that would make it possible to know it from S. Greater effort is required – for example, enumerating all the elements in S – to find what T is.",
        "Since S is big, the uncertainty about the sample is then much greater.",
        "Correspondingly, for the two cases, the entropy is 0 and N log N 0, respectively.",
        "Entropy plays a central role in the theory of information.",
        "For an excellent exposition of this theory, we refer the reader to Cover and Thomas (1991).",
        "The theory has been applied in probabilistic language modeling (Mark, Miller, and Grenander 1996; Mark et al.",
        "1996; Johnson 1998), natural language processing (Berger, Della Pietra, and Della Pietra 1996; Della Pietra, Della Pietra, and Lafferty 1997), as well as computational vision (Zhu, Wu, and Mumford 1997).",
        "In addition, all the models proposed in these",
        "Briefly, the maximum entropy principle says that among all the distributions that satisfy the same given conditions, the one that achieves the largest entropy should be the model of choice.",
        "For a distribution p on parses, its entropy is",
        "In order that the maximum entropy principle makes sense, all the candidate distributions should have finite entropies, and this is usually implicitly assumed.",
        "Take Mark, Miller, and Grenander's (1996) model, for example.",
        "First, a PCFG distribution p is selected to serve as a \"reference\" distribution on parses.",
        "Then, by invoking the minimum relative entropy principle, which is a variant of the maximum entropy principle, the distribution that minimizes",
        "subject to a set of constraints incorporating context-sensitive features is chosen to be the distribution of the model.",
        "It is then easy to see that the assumption that H(q) is finite is necessary.",
        "Conceptually, having finite entropy is a basic requirement for a \"good\" probabilistic model because a probability distribution with infinite entropy has too much uncertainty to be informative.",
        "Problems regarding entropies of PCFGs are relatively easy to tackle because they can be studied analytically.",
        "Several authors have reported results on this subject, including Miller and O'Sullivan (1992), who gave analytical results on the rates of entropies of improper PCFGs.",
        "It is worthwhile to add a few more results on entropies of proper PCFGs.",
        "In this paper, we show that the entropies of PCFG distributions imposed by production probabilities assigned by the relative weighted frequency method are finite (Section 4, Corollary 2).",
        "In addition to entropy, we will also study the moment of sizes of parses.",
        "The moment is of statistical interest because it gives information on how sizes of parses are distributed.",
        "For PCFG distributions, the first moment of sizes of parses, i.e., the mean size of parses, is directly linked with the entropy: the mean size of parses is finite if and only if the entropy is.",
        "The second moment of sizes is another familiar quantity.",
        "The difference between the second moment and the mean squared is the variance of sizes, which tells us how \"scattered\" sizes of parses are distributed around the mean.",
        "Proposition 2 shows that, under distributions imposed by production probabilities assigned by the relative weighted frequency method, sizes of parses have finite moment of any order."
      ]
    },
    {
      "heading": "1.3 Gibbs Distributions on Parses and Renormalization of Improper PCFGs",
      "text": [
        "Besides PCFG distributions, a CFG can be equipped with many other types of probability distributions.",
        "Among the most widely studied is the Gibbs distribution (Mark, Miller, and Grenander 1996; Mark et al.",
        "1996; Mark 1997; Abney 1997).",
        "Gibbs distributions arise naturally by invoking the maximum entropy principle.",
        "They are considered to be more powerful than PCFG distributions because they incorporate more features, especially context-sensitive features, of natural languages, whereas PCFG distributions only consider frequencies of production rules.",
        "On the other hand, Gibbs distributions are not always superior to PCFG distributions.",
        "A Gibbs distribution, with only frequencies of production rules in parse as its features, turns into a PCFG.",
        "More specifically, we will show in Proposition 4 in Section 5, that a CFG equipped with a Gibbs",
        "distribution of the form",
        "is actually a PCFG, and we can get the production probabilities of the PCFG explicitly from the Gibbs form.",
        "The fact that a Gibbs distribution of the form in (2) is imposed by production probabilities has a useful consequence.",
        "Suppose p is an improper PCFG distribution.",
        "If we write the sum of p over all parses as Z, and assign to each parse tree a new probability equal to p(r)/Z, then we renormalize p to a Gibbs distribution1.5 on parses.",
        "What (2) implies is that /3 is also a PCFG distribution (Corollary 3).",
        "Moreover, in Section 6 we will show that, under certain conditions, 13 is subcritical.",
        "There is another issue about the relations between PCFG distributions and Gibbs distributions of the form in (2), from a statistical point of view.",
        "Although PCFG distributions are special cases of Gibbs distributions in the sense that the former can be written in the form of the latter, PCFG distributions cannot be put in the framework of Gibbs distributions if they have different parameter estimation procedures.",
        "We will compare the maximum-likelihood (ML) estimation procedures for these two distributions.",
        "As will be seen in Section 5, numerically these two estimation procedures are different.",
        "However, Corollary 4 shows that they are equivalent in the sense that estimates by the two procedures impose the same distributions on parses.",
        "For this reason, a Gibbs distribution may be considered a generalization of PCFG, not only in form, but also in a certain statistical sense."
      ]
    },
    {
      "heading": "1.4 Branching Rates of PCFGs",
      "text": [
        "Because of their context-free nature, PCFG distributions can also be studied from the perspective of stochastic processes.",
        "A PCFG can be described by a random branching process (Harris 1963), and its asymptotic behavior can be characterized by its branching rate.",
        "A branching process, or its corresponding PCFG, is called subcritical (critical, supercritical), if its branching rate < 1 (= 1,> 1).",
        "A subcritical PCFG is always proper, whereas a supercritical PCFG is always improper.",
        "Many asymptotic properties of supercritical branching processes are established by Miller and O'Sullivan (1992).",
        "Chi and Geman (1998) proved the properness of PCFG distributions imposed by estimated production probabilities, and around the same time Sanchez and Benedi (1997) established the subcriticality of the corresponding branching processes, hence their properness.",
        "In this paper we will explore properties of branching rate further.",
        "First, in Proposition 5, we will show that if a PCFG distribution is imposed by production probabilities assigned by the relative weighted frequency method, then the PCFG is subcritical.",
        "The result generalizes that of Sanchez and Benedi (1997), and has a less involved proof.",
        "Then in Proposition 7, we will demonstrate that a connected and improper PCFG, after being renormalized, becomes a subcritical PCFG."
      ]
    },
    {
      "heading": "1.5 Identifiability and Approximation of Production Probabilities",
      "text": [
        "Returning to the statistical aspect of PCFGs, we will discuss the identifiability of production probabilities of PCFGs as well as parameters of Gibbs distributions.",
        "Briefly speaking, production probabilities of PCFGs are identifiable, which means that different production probabilities always impose different distributions on parses (Proposition 8).",
        "In contrast, for the Gibbs distribution given by (2), the A parameters are not identifiable; in fact, there are infinitely many different A that impose the same Gibbs distribution."
      ]
    },
    {
      "heading": "Chi Probabilistic Context-Free Grammars",
      "text": [
        "Finally, in Proposition 9, we propose a method to approximate production probabilities.",
        "Perhaps the most interesting part about the result lies in its proof, which is largely information theoretic.",
        "We apply the Kullback-Leibler divergence, which is the information distance between two probability distributions, to prove the convergence of the approximation.",
        "In information theory literature, the Kullback-Leibler divergence is also called the relative entropy.",
        "We also use Lagrange multipliers to solve the constrained minimization problem involved.",
        "Both Kullback-Leibler divergence and Lagrange multipliers method are becoming increasingly useful in statistical modeling, e.g., modeling based on the maximum entropy principle."
      ]
    },
    {
      "heading": "1.6 Summary",
      "text": [
        "As a simple probabilistic model, the PCFG model is applied to problems in linguistics and pattern recognition that do not involve much context sensitivity.",
        "To design sensible PCFG distributions for such problems, it is necessary to understand some of the statistical properties of the distributions.",
        "On the other hand, the PCFG model serves as a basis for more expressive linguistic models.",
        "For example, many Gibbs distributions are built upon PCFG distributions by defining",
        "where p is a PCFG distribution.",
        "Therefore, in order for the Gibbs distribution P to have certain desired statistical properties, it is necessary for p to have those properties first.",
        "This paper concerns some of the fundamental properties of PCFGs.",
        "However, the methods used in the proofs are also useful for the study of statistical issues on other probabilistic models.",
        "This paper proceeds as follows: In Section 2, we gather the notations for PCFGs that will be used in the remaining part of the paper.",
        "Section 3 establishes the relative weighted frequency method.",
        "Section 4 proves the finiteness of the entropies of PCFG distributions when production probabilities are assigned using the relative weighted frequency method.",
        "In addition, finiteness of the moment of sizes of parses are proved.",
        "Section 5 discusses the connections between PCFG distributions and Gibbs distributions on parses.",
        "Renormalization of improper PCFGs is also discussed here.",
        "In Section 6, PCFGs are studied from the random branching process point of view.",
        "Finally, in Section 7, identifiability of production probabilities and their approximation are addressed."
      ]
    },
    {
      "heading": "2. Notations and Definitions",
      "text": [
        "In this section, we collect the notations and definitions we will use for the remaining part of the paper."
      ]
    },
    {
      "heading": "Definition 1",
      "text": [
        "A context-free grammar (CFG) G is a quadruple (N,T,R,S), where N is the set of variables, T the set of terminals, R the set of production rules, and S E N is the start symbol.2 Elements of N are also called nontermirtal symbols.",
        "N, T, and R are always",
        "assumed to be finite.",
        "Let Q denote the set of finite parse trees of G, an element of which is always denoted as T. For each 7 E Q and each production rule (A – > a) E R, define f(A -+ a; 7) to be the number of occurrences, or frequency, of the rule in T, and f (A; 7) to be the number of occurrences of A in T. f (A; 7) and f (A 4 a; 7) are related by",
        "Define h(r) as the height of T, which is the number of nonterminal nodes on the longest route from T's root to its terminal nodes.",
        "Define 17-1 as the size of 7, which is the total number of nonterminal nodes in T. For any A E N and any sentential form E (N U T)*, define n(A; 7) as the number of instances of A in 7.",
        "Define 171 as the length of the sentential form."
      ]
    },
    {
      "heading": "Definition 2",
      "text": [
        "Let A E r denote that the symbol A occurs in the parse T. If A E r, let TA be the leftmost maximum subtree of T rooted in A, which is the subtree of T rooted in A satisfying the condition that if T1 0 TA is also a subtree of 7 rooted in A, then TI is either a subtree of TA, or a right sibling of TA, or a subtree of a right sibling of TA.",
        "Let AT be the root of TA, which is the leftmost \"shallowest\" instance of A in T."
      ]
    },
    {
      "heading": "Definition 3",
      "text": [
        "For any two symbols A E N and B E NU T, not necessarily different, B is said to be reachable from A in G, if there is a sequence of symbols Ao, A1,.",
        ", An with Ao = A and An = B, and a sequence of sentential forms a0,...,an_i, such that each A, a, is a production in R and each a, contains the next symbol A,+1.",
        "G is called connected if all elements in N U T can be reached from all nonterminal symbols.",
        "We now define the probabilistic version of reachability in CFG.",
        "Suppose p is a distribution on Q.",
        "For any two symbols A E N and B E NUT, not necessarily different, B is said to be reachable from A in G under p, if there is aTEQ with p(r) > 0 and there is a subtree Tf of T, such that Tf is rooted in A and B E TI G is called connected under p if all symbols in NU T can be reached from all nonterminal symbols under p."
      ]
    },
    {
      "heading": "Definition 4",
      "text": [
        "A system of production probabilities of G is a function p : R – > [0,1] such that for any A E N ,",
        "We will also use p to represent the PCFG probability distribution on parses imposed by p, via the formula"
      ]
    },
    {
      "heading": "Chi Probabilistic Context-Free Grammars",
      "text": [
        "Similarly, for any estimated system of production probabilities P, we will also use p to represent the probability distribution on parses imposed by P. We will write p(ft) as the total probability of all finite parse trees in a"
      ]
    },
    {
      "heading": "Definition 5",
      "text": [
        "Now we introduce a notation in statistics.",
        "Let p be an arbitrary distribution on C2 and g(r) a function of T E a The expected value of g under the distribution p, denoted Epg(r), is defined as",
        "All the parse trees we have so far seen are rooted in S. It is often useful to investigate subtrees of parses, therefore it is necessary to consider trees rooted in symbols other than S. We call a tree rooted in A ENa parse (tree) rooted in A if it is generated from A by the production rules in R. Let fill be the set of all finite parse trees with root A.",
        "Define PA as the probability distribution on 12,4 imposed by a system of production probabilities p, via (4).",
        "Also extend the notions of height and size of parses to trees A.",
        "When we write PA (r), we always assume that T is a parse tree rooted in A.",
        "When p = PA, Epg(T) equals Epg(r) = OA pAer)g(r).",
        "We will use p(QA) instead of pA(S-2/1) to denote the total probability of finite parse trees in A.",
        "With no subscripts, C2 and p are assumed to be Sts and ps, respectively.",
        "For convenience, we also extend the notion of trees to terminals.",
        "For each terminal t c T, define 12t as the set of the single \"tree\" {t}.",
        "Define pt(t) = 1, It = 0 and h(t) = 0.",
        "For this paper we make the following assumptions:",
        "1.",
        "For each symbol A S, there is at least one parse T with root S such that A E T. This will guarantee that each A S can be reached from S; 2.",
        "When a system of production probabilities p is not explicitly assigned,",
        "each production rule (A – > a) e R is assumed to have positive probability, i.e., p(A – > a) > 0.",
        "This guarantees that there are no useless productions in the PCFG."
      ]
    },
    {
      "heading": "3. Relative Weighted Frequency",
      "text": [
        "The relative weighted frequency method is motivated by the maximum-likelihood (ML) estimation of production probabilities.",
        "We shall first give a brief review of ML estimation.",
        "We consider two cases of ML estimation.",
        "In the first case, we assume the data are fully observed, which means that all the samples are fully observed finite parses trees.",
        "Let be the samples.",
        "Then the ML estimate of p(A --> a) is the ratio between the total number of occurrences of the production A – > a in the samples and",
        "the total number of occurrences of the symbol A in the samples,",
        "Because of the form of the estimator in (5), ML estimation in the full observation case is also called relative frequency estimation in computational linguistics.",
        "This simple estimator, as shown by Chi and Geman (1998), assigns proper production probabilities for PCFGs.",
        "In the second case, the parse trees are unobserved.",
        "Instead, the yields Y1 = Y(T), which are the left-to-right sequences of terminals of the unknown parses rl I • • • Tn, form the data.",
        "It can be proved that the ML estimate is given by",
        "where C21( is the set of all parses with yield Y, i.e., Sly = E C2 : Y(T) = Y}.",
        "Equation (6) cannot be solved in closed form.",
        "Usually, the solution is computed by the EM algorithm with the following iteration (Baum 1972; Baker 1979; Dempster, Laird, and Rubin 1977):",
        "Like in (5), Pk for k> 0 impose proper probability distributions on C2 (Chi and Geman 1998).",
        "To unify (6) and (7), expand Efrk [ f (A – 4 a; T) T e fly,], by the definition of expectation, into",
        "Then we observe that, for any production rule A – > a,",
        "The ML estimator in (6) can also be written in the above form, as can be readily checked by letting A be the set {71, ,r,,} and W(7), for each T E A, be the number of occurrences of T in the data.",
        "In addition, in both full observation cases and partial observation cases, we can divide the weights of W(7) by a constant so that their sum is 1.",
        "The above discussion leads us to define a procedure to assign production probabilities as follows.",
        "First, pick an arbitrary finite subset A of Q, with every production rule appearing in the trees in A.",
        "Second, assign to each 7 EAa positive weight W(7) such that ETEA w(T) = 1.",
        "Finally, define a system of production probabilities p by",
        "Because of the similarity between (5) and (8), we call the procedure to assign production probabilities by (8) the \"relative weighted frequency\" method."
      ]
    },
    {
      "heading": "Proposition 1",
      "text": [
        "Suppose all the symbols of N occur in the parses of A, and all the parses have positive weight.",
        "Then the production probabilities given by (8) impose proper distributions on parses."
      ]
    },
    {
      "heading": "Proof",
      "text": [
        "The proof is almost identical to the one given by Chi and Geman (1998).",
        "Let q A = p (derivation tree rooted in A fails to terminate).",
        "We will show that qs = 0 (i.e., derivation trees rooted in S always terminate).",
        "For each A E V. let f (A; 7) be the number of non-root instances of A in T. Given a E (V U T)*, let a, be the ith symbol of the sentential form a.",
        "For any A E V",
        "- p U U{derivation begins A a, and a, fails to terminate}",
        "Clearly, for every T E A, f(A; r) = f(A;r) whenever A S and -PS; T) = f(S;r) – 1.",
        "Hence qs = 0, completing the proof.",
        "0 Corollary 1 Under the same assumption of Proposition 1, for each symbol A E N, p(C2A) = 1.",
        "Proof For any A E N, there is a T E A such that A E T. Since p(r) > 0, this implies A is reachable from S under p. Using the notation given in Definition 2, we have qs > p({A E T and TA fails to terminate}) = p({TA fails to terminate} IA E r)p(A c r) p({rA fails to terminate} IA E T) = 0, since qs = 0 and p(A E T) > 0.",
        "By the nature of PCFGs, the form of TA is distributed according to PA, independent of its location in T or of the choice of subtrees elsewhere in T. Therefore the conditional probability of TA failing to terminate, given that A occurs in T, equals qA, proving that qA = 0.",
        "0 4., Entropy and Moments of Parse Tree Sizes In this section, we will first show that if production probabilities are assigned by the relative weighted frequency method, then they impose PCFG distributions under which parse tree sizes have finite moment of any order.",
        "Based on this result, we will then demonstrate that such PCFG distributions have finite entropy and give the explicit form of the entropy.",
        "The mth moment of sizes of parses is given by"
      ]
    },
    {
      "heading": "Chi Probabilistic Context-Free Grammars",
      "text": [
        "and the entropy of a P6FG distribution p is given by",
        "for any A e N; that is, F(A – > a) is the weighted sum of the number of occurrences of the production rule A – 4 a in A and F (A) is the weighted sum of the number of occurrences of A in A.",
        "The relative weighted frequency method given by (8) can be written as",
        "We have the following simple lemma: Lemma 1",
        "is the number of nonroot instances of A in T. When A 0 S, the number of nonroot instances of A in T is equal to f (A; 7).",
        "Substitute this into (12) to prove (11) for the case A 0 S. The case A = S is similarly proved.",
        "0"
      ]
    },
    {
      "heading": "Proposition 2",
      "text": [
        "Suppose all the symbols in N occur in the parses of A, and all parses have positive weights.",
        "If the production probabilities p are assigned by the relative weighted frequency method in (8), then for each mENU {0}, Ep <00."
      ]
    },
    {
      "heading": "Proof",
      "text": [
        "We shall show that for any A E N, if p = PA, then EpIrl.",
        "< 00.",
        "When m = 0, this is clearly true.",
        "Now suppose the claim is true for 0, m – 1.",
        "For each A E N and k E N, define",
        "where for ease of typing, we write L for la l. For fixed a, write",
        "There are less than Lm = la rn terms in F(17-11,• • • ,1711)• Hence EPari 1, ..., ITLI)po a)Paieri) larded .",
        "Because the set of production rules is finite, the length of a sentential form that occurs on the right-hand side of a production rule is upper bounded, i.e., sup{ jal : for some A E N, (A – > a) E RI < Therefore we can bound (la' + 1)7nClal by a constant, say, K. Then we get",
        "Replace p(A – > a) by F(A a)/F(A), then multiply both sides of (15) by F(A) and sum over all A E N with F(A) > 0.",
        "By (10) and (11), we then get",
        "Letting k ---+ 00, by Mks I EirIm, we get E5IrIm< K ET EA IT IW (T) <00.",
        "To complete the induction, we shall show for every A E NUT other than S, EP, 'Tim oo.",
        "By conditional expectation, there is (see Definition 2 for the notations A E 7 and",
        "As in the proof of Corollary 1, TA is independent of its location and other part of T , and is distributed by PA.",
        "Therefore PS(TA A E 7) = PA(TA), which leads to EpA 'Tim = Eps(ITAim IA E n) < 00.",
        "0 From Proposition 2 it follows that the mean size of parses is finite under p. Since f (A a; T) < II for each production A – > a, it follows that the mean frequency of f (A a; T) is finite.",
        "The next proposition gives the explicit form of the mean frequency in terms of the production probabilities assigned by the relative weighted frequency method.",
        "Proposition 3 Under the same conditions of Proposition 2, the mean frequency of the production rule (A – > a) E R is the weighted sum of the numbers of its occurrences in parses of A, with weights W(r), i.e.,",
        "linear relations between E(C).",
        "To this end, for each T E C2c, let C --+ be the production rule applied to '7' S root.",
        "Suppose y is composed of m symbols, .",
        ",rym, and Ti,.",
        ".",
        ".",
        ",Tm are the daughter subtrees of T rooted in 71, • • • ,77n, respectively.",
        "Then",
        "where",
        "Multiply both sides by p(r) and sum over all T E C2c which have C – > y as the production rule applied at the root.",
        "By the definition of PCFG, p(r) = p(C – >",
        "where 12c-1, stands for the set of trees in which C 7 is the rule applied at the root.",
        "Similarly, for each k,",
        "completing the proof of (17).",
        "0 Now we can calculate the entropy of p in terms of production probabilities.",
        "The calculation goes as follows,"
      ]
    },
    {
      "heading": "5. Gibbs Distributions on Parses and Renormalization of Improper PCFGs",
      "text": [
        "A Gibbs distribution on parses has the form",
        "where ZA = E eA-u(T), and A = {Ai} and 11(r) -= {LIi(r)} are constants and functions on 12, respectively, both indexed by elements in a finite set I.",
        "The inner product A • U = E AiU, is called the potential function of the Gibbs distribution and ZA is called the partition number for the exponential eA.U.",
        "The functions 11, are usually considered features of parses and the constants Ai are weights of these features.",
        "The index set I and the functions U(r) can take various forms.",
        "Among the simplest choices for I is R, the set of production rules, and",
        "which is a Gibbs form.",
        "A Gibbs distribution usually is not a PCFG distribution, because its potential function in general includes features other than frequencies of production rules.",
        "What if its potential function only has frequencies as features?",
        "More specifically, is the Gibbs distribution in (19) a PCFG distribution?",
        "The next proposition gives a positive answer to this question.",
        "Proposition 4 The Gibbs distribution PA given by (19) is a PCFG distribution.",
        "That is, there are production probabilities p, such that for every T E",
        "The Gibbs distributions we have seen so far are only defined for parses rooted in S. By obvious generalization, we can define for each nonterminal symbols A the partition number",
        "and the Gibbs distribution P(r) on parses rooted in A.",
        "For simplicity, also define ZA (t) = 1 and Pt(t) =- 1 for each t E T. We first show ZA (A) < no for all A.",
        "Suppose (S a) E R with la I = n. The sum of eA f (T) over all T E C2s with S a being applied at the root is equal to eAs – ZA(ai) ZA (an), while less than the sum of eAf(7) over all T E Qs, which is ZA(S).",
        "Therefore,",
        "Since Zoo and ZA (A) > 0, for all A, it follows that Z A (ai) is finite.",
        "For any variable A, there are variables Ao = S, Ai, ,A = A E N and sentential forms aM, , a(n-1) E",
        "where ai(:) is the kth element in a(t).",
        "By induction, ZA (A) <o0.",
        "Now for (A – > a) E R, with I al = n, define",
        "where rk is the daughter subtree of T rooted in /3k.",
        "Each rk has height < h. Hence, by induction assumption,",
        "Proposition 4 has a useful application to the renormalization of improper PCFGs.",
        "Suppose a PCFG distribution p on Q = Qs is improper.",
        "We define a new, proper distribution /5 on Q, by",
        "We call /5 the renormalized distribution of p on Q.",
        "We can also define the renormalized distribution of PA on A. for each A E N, by",
        "Comparing p with (19), we see that p is a Gibbs distribution with frequencies of production rules as features.",
        "Therefore, by Proposition 4, p is a PCFG distribution, and from the proof of Proposition 4, we get Corollary 3.",
        "Corollary 3 Suppose the production probabilities of the improper distribution p are positive for all the production rules.",
        "Then the renormalized distributions P are induced by the production probabilities",
        "Therefore, p on Q is a PCFG distribution.",
        "Proof The only thing we have not mentioned is that AA_,(2, = log p(A 4 a) are all bounded, since p are all positive.",
        "We have seen that PCFG distributions can be expressed in the form of Gibbs distributions.",
        "However, from the statistical point of view, this is not enough for regarding PCFG distributions as special cases of Gibbs distributions.",
        "An important statistical issue about a distribution is the estimation of its parameters.",
        "To equate PCFG distributions with special cases of Gibbs distribiltions, we need to show that estimators for production probabilities of PCFGs and parameters of Gibbs distributions produce the same results.",
        "Among many estimation procedures, the maximum-likelihood (ML) estimation procedure is commonly used.",
        "In the full observation case, if the data is composed of , 7,2, then the estimator for the system of production probabilities is",
        "for any A E N and the estimator for parameters of Gibbs distributions with A of the form in (19) is",
        "In addition, the ML estimate p in (23) can be analytically solved and the solution is given by Equation (5).",
        "In the partial observation case, if Y1,.. .",
        ", Yn are the observed yields, then the estimators for the two distributions are",
        "respectively.",
        "We want to compare the ML estimators for the two distributions and see if they produce the same results in some sense.",
        "Since the parameters p serve as base numbers in PCFG distributions, whereas A are exponents in Gibbs distributions, to make the comparison sensible, we take the logarithms of 13 and ask whether or not log p and A are the same.",
        "Since the ML estimation procedure for PCFGs involves constrained optimization, whereas the estimation procedure for Gibbs distributions only involves unconstrained optimization, it is reasonable to suspect log p A.",
        "Indeed, numerically log fr and A are different.",
        "For example, the estimator (23) only gives one estimate of the system of production probabilities, whereas the estimator (24) may yield infinitely many solutions.",
        "Such uniqueness and nonuniqueness of estimates is related to the identifiability of parameters.",
        "We will discuss this in more detail in Section 7.",
        "Despite their numerical differences, the ML estimators for PCFG distributions and Gibbs distributions with the form (19) are equivalent, in the sense that the estimates produced by the estimators impose the same distributions on parses.",
        "Because of this, in the context of ML estimation of parameters, we can regard PCFG distributions as special cases of Gibbs distributions.",
        "Corollary 4 If is the solution of (23), then log p is a solution of ML estimation (24).",
        "Similarly, if p is a solution of (25), then log p is a solution of ML estimation (26).",
        "Hence, the estimates of production probabilities of PCFG distributions and parameters of Gibbs distributions with the form (19) impose the same distributions on parses."
      ]
    },
    {
      "heading": "Proof",
      "text": [
        "Suppose A is a solution for (24).",
        "By Proposition 4, the Gibbs distribution Ps, is imposed by a system of production probabilities /3.",
        "Then /9 is the solution of (23).",
        "Let A = log 13, i.e., A(A a) = log (A – > a).",
        "Then A impose the same distribution on parses as A.",
        "Therefore A are also a solution to (24).",
        "This proves the first half of the result.",
        "The second half is similarly proved."
      ]
    },
    {
      "heading": "6. Branching Rates of PCFGs",
      "text": [
        "In this section, we study PCFGs from the perspective of stochastic branching processes.",
        "Adopting the set-up given by Miller and O'Sullivan (1992), we define the mean matrix M of p as a INI x IN1 square matrix, with its (A, B)th entry being the expected number of variables B resulting from rewriting A:",
        "We say B E N can be reached from A E N, if for some n > 0, M(n) (A, B) > 0, where M(') (A, B) is the (A, B)th element of Mn.",
        "M is irreducible if for any pair A,'B E N, B can be reached from A.",
        "The corresponding branching process is called connected if M is irreducible (Walters 1982).",
        "It is easy to check that these definitions are equivalent to Definition 3.",
        "We need the result below for the study of branching processes."
      ]
    },
    {
      "heading": "Theorem 1: (Perron-Frobenius)",
      "text": [
        "Let M [mg] be a nonnegative k x k matrix.",
        "1.",
        "There is a nonnegative eigenvalue p such that no eigenvalue of A has absolute value greater than p. 2.",
        "Corresponding to the eigenvalue p there is a nonnegative left (row)",
        "is 1), and the corresponding eigenvectors are strictly positive (i.e. ui > 0, v, > 0 all i).",
        "The eigenvalue p is called the branching rate of the process.",
        "A branching process is called subcritical (critical, supercritical), if p < 1 (p -= 1, p > 1).",
        "We also say a PCFG is subcritical (critical, supercritical), if its corresponding branching process is.",
        "When a PCFG is subcritical, it is proper.",
        "When a PCFG is supercritical, it is improper.",
        "The next result demonstrates that production probabilities assigned by the relative weighted frequency method impose subcritical PCFG distributions."
      ]
    },
    {
      "heading": "Proposition 5",
      "text": [
        "For p assigned by the relative weighted frequency method (8) and M by (27),",
        "AEN AEN We need to show that ,u(S) > 0.",
        "Assume p(S) = 0.",
        "Then for any n > 0, since Mnp = pt, we have",
        "This proves p < 1.",
        "0 We will apply the above result to give another proof of Proposition 2.",
        "Before doing this, we need to introduce a spectral theorem, which is well-known in matrix analysis.",
        "Theorem 2 Suppose M is an n x n real matrix.",
        "Let a(M) be the largest absolute value of M's eigenvalues.",
        "Then"
      ]
    },
    {
      "heading": "CM Probabilistic Context-Free Grammars",
      "text": [
        "where M is the norm of M defined by iiMii = sup 161=1 Now we can prove the following result.",
        "We repeat the proof of Proposition 2 from Section 4 up to (15).",
        "Then, instead of summing over A, we observe that (15) can be written as",
        "where 1 is defined as {1, ...,1}, and for two-column vectors Ft and II, Z < i; means each component of p, is < the corresponding component of v .",
        "Since the components in K1, M and Mk are positive, the above relation implies",
        "By Theorem 2, for any p < p' < 1, IMII = o(p'n)• Then (31) implies that Al is bounded.",
        "Since klic are positive and increasing, it follows that 11-4\"k converge.",
        "Next we investigate how branching rates of improper PCFGs change after renormalization.",
        "First, let us look at a simple example.",
        "Consider the CFG given by (1).",
        "Assign probability p to the first production (S SS), and 1 – p to the second one (S a).",
        "It was proved that the total probability of parses is min(1, 1/p – 1).",
        "If p> 1/2,",
        "More generally, we have the following result, which says a connected, improper PCFG, after being renormalized, becomes a subcritical PCFG.",
        "We have 0 < p(s) < 1, and we shall first show, based on the fact that the PCFG is connected, that all 0 < p(12A) < 1.",
        "Recall the proof of Corollary 1.",
        "There we got the relation qs > qAps (A E T), where qA is the probability that trees rooted in A fail to terminate.",
        "Because the PCFG is connected, S is reachable from A, too.",
        "By the same argument, we also have qA > qspA(S E T).",
        "Since both qs and pA(S E T) > 0, qA > 0, then p(2A) = 1 - qA <1.",
        "Similarly, we can prove p(QA) > P(Ils)PA(s E T) > 0.",
        "where s {sA}AEN.",
        "Write g = fgAlAEN and define g(n) fg.ln.)}",
        "recursively as",
        "Therefore, r is a nonnegative solution of g(s) = s. It is also the smallest among such solutions.",
        "That is, if there is another nonnegative solution r' r, then r < r'.",
        "This is because 0 < r' implies g@')(0) < g(n)(r') = r' for all n > 0, and by letting n oo, r < r'.",
        "Clearly, 1 is also a solution of g(s) = s. We now renormalize p to get p by (22).",
        "Define generating functions f = {fA} of and f() in the same way as (32) and (33).",
        "Then",
        "Because r is the smallest nonnegative solution of g(s) = s, by the above equation, 1 is the only solution of f(s) = s in the unit cube.",
        "Since g(s) = s also has a solution 1, f(s) = s has a solution 1/r, which is strictly larger than 1.",
        "We want to know how f changes on the line segment connecting 1 and 1/r.",
        "Let u = 1/r -1.",
        "Then u is strictly positive.",
        "Elements on the line segment between 1 and 1/r can be represented by 1 + tu, with t e [0, 1].",
        "Define h(t) = f (1 + tu) 1 u.",
        "Then",
        "Differentiate h at t 0.",
        "Then h'(0) = Mu-u, where M is the mean matrix corresponding to P. Every hA(t) is a convex function.",
        "Then, because hA (0) = hA(1) = 0, WA(0) < 0, which leads to Mu < u.",
        "We now show that for at least one A, (Mu)A <u4.",
        "First of all, note that WA (0) = 0 only if hA (t) is linear.",
        "Assume Mu = u, which leads to h/(0) = 0 and the linearity of h(t).",
        "Together with h(0) = 0, this implies h(t) 0.",
        "Choose t < 0 such that 1 + tuA > 0 for all A.",
        "Then f (1+ tu) 1 tu = h(t) = 0.",
        "Therefore 1 + tu is a nonnegative solution of f(s) = s and is strictly less than 1.",
        "This contradicts the fact that 1 is the smallest nonnegative solution of f (s) = s. Now we have Mu < u, and 3A, s.t.",
        "(Mu)A < uA.",
        "Because p is connected, M is irreducible.",
        "By item (3) of Theorem 1, u is strictly positive, and there is a strictly positive left eigenvector v such that vM = pv.",
        "Therefore vMu < vu, or pvu < vu.",
        "Hence p < 1.",
        "This completes the proof.",
        "0"
      ]
    },
    {
      "heading": "7. Identifiability and Approximation of Production Probabilities of PCFGs",
      "text": [
        "Identifiability of parameters is related to the consistency of estimates, both being important statistical issues.",
        "Proving the consistency of the ML estimate of a system of production probabilities given in (5) is relatively straightforward.",
        "Consistency in this case means that, if p imposes a proper distribution, then as the size of the data composed of independent and identically distributed (i.i.d.)",
        "samples goes to infinity, with probability one, the estimate converges to p. To see this, think of the sample parses as taken independently from a branching process governed by p. By the context-free nature of the branching process, for A E N, each instance of A selects a production A -> a by probability p (A -> a) independently of the other instances of A.",
        "As the size of the data set goes to infinity, the number of occurrences of A goes to infinity.",
        "Therefore, by the law of large numbers, the ratio between the number of occurrences of A 4 a and the number of occurrences of A, which is p(A -> a), converges to p(A -> a), with probability one.",
        "By the consistency of the ML estimate of a system of production probabilities, we can prove that production probabilities are identifiable parameters of PCFGs.",
        "In other words, different systems of production probabilities impose different PCFG distributions."
      ]
    },
    {
      "heading": "Proposition 8",
      "text": [
        "If pi, p2 impose distributions P1.",
        "P2, respectively, and pi 0 192, then P1 P2."
      ]
    },
    {
      "heading": "Proof",
      "text": [
        "Assume P1 = P2.",
        "Then draw n i.i.d.",
        "samples from P1.",
        "Because the ML estimator is consistent, as n oo, p pi, with probability 1.",
        "Because the n i.i.d.",
        "samples can also be regarded as drawn from P2, with the same argument, p2, with probability 1.",
        "Hence pi = p2, a contradiction.",
        "0 We mentioned in Section 5 that the ML estimators (24) and (26) may produce infinitely many estimates if the Gibbs distributions on parses have the form (19).",
        "This phenomenon of multiple solutions results from the nonidentifiability of parameters of the Gibbs distributions (19), which means that different parameters may yield the same distributions.",
        "To see why parameters of Gibbs distribution (19) are nonidentifiable, we note that the frequencies of production rules are linearly dependent,",
        "Therefore, there exists Ao 0 0, such that for any T , Ao • f (T) = 0.",
        "If A is a solution for (24), then for any number t,",
        "Thus for any t, A + tA0 is also a solution for (24).",
        "This shows that the parameters of Gibbs distribution (19) are nonidentifiable.",
        "Finally, we consider how to approximate production probabilities by mean frequencies of productions.",
        "Given i.i.d.",
        "samples of parses • • • , r from the distribution imposed by p, by the consistency of the ML estimate of p given by (5),",
        "with probability 1, as n – > oo.",
        "If the entropy of the distribution p is finite, then for every production rule (A 0) e R,",
        "If the entropy is infinite, the above argument does not work, because both the numerator and the denominator of the fraction are infinity.",
        "Can we change the fraction a little bit so that it still makes sense, and at the same time yields good approximation to p(A – > a)?",
        "One way to do this is to pick a large finite subset ST of 12 and replace the fraction by",
        "where Ep(f (A – > a;7-)17- E 119 is the conditional expectation of PA 4 a; r) given IT, which is defined as",
        "Because C•2' is finite, the top of the fraction on the right-hand side is finite.",
        "Also the bottom of the fraction is positive.",
        "Therefore the conditional expectation off is finite.",
        "The conditional expectation Ep(f (A; T)IT E S2') is similarly defined.",
        "The following result shows that as C2' expands, the approximation gets better.",
        "Proposition 9 Suppose a system of production probabilities p imposes a proper distribution.",
        "Then for any increasing sequence of finite subsets of SI with S•27, I 12, i.e., C21 C .",
        ".",
        ".",
        "C finite and UCin =",
        "To prove the proposition, we introduce the Kullback-Leibler divergence.",
        "For any two probability distributions p and q on C2, the Kullback-Leibler divergence between p and q is defined as",
        "TEQ gerr where 0 log q(?",
        "is defined as 0 for any q(r) > 0.",
        "D(pliq) is nonnegative and equal to 0 if and only if p = q.",
        "One thing to note is that q need not be proper in order",
        "to make D(pllq) nonnegative.",
        "Even when E q(T) < 1, it is still true that D(pliq) > 0.",
        "For more about the Kullback-Leibler divergence, we refer the readers to Cover and Thomas (1991).",
        "The Kullback-Leibler divergence has the simple property described below, which will be used in the proof of Proposition 9.",
        "Consider the Kullback-Leibler divergence between the conditional distributions per IQ') and q(TIC•21), which equals",
        "Given n, for production probabilities q, let Kn(q) be the Kullback-Leibler divergence between the conditional distribution p(r) and the distribution imposed by q,",
        "We want to find q that minimizes Kn(q).",
        "This can be achieved by applying the Lagrange multiplier method.",
        "The condition that q is subject to is,",
        "for every A E N. There are WI such constraints.",
        "To incorporate them into the minimization, we consider the function",
        "where the unknown coefficients {AA}AEN are called Lagrange multipliers.",
        "The q that minimizes Kn(q) subject to (37) satisfies",
        "Any boundary point of the region has a component equal to zero, hence for some T E On, q(T) = 0, implying K(q) = oo.",
        "Because K(q) is a continuous function, Kn must attain its minimum inside the above region, and this minimizer, as has been shown, is Pt,.",
        "We need to show Pn p. Let Cr = 1ln and apply Lemma 2 to p(I) and pn(r).",
        "Since p(QnI1ln) = 1, we get 0 < – logN(On) < Kn(Pn).",
        "On the other hand, because Pn is the minimizer of Kn, Kn(N) K(p) = – log p(12n).",
        "Because lin – > St and p is proper, p(I) – > 1.",
        "Therefore 0 < – 100n(1n) < – logp(12n) 0.",
        "Hence Pn(f2n) --> 1.",
        "Choose an arbitrary T E O.",
        "For all n large enough, T E Apply Lemma 2 to {r} and get",
        "n-->oo n – ,c>o n – >oo",
        " This nearly completes the proof.",
        "By the Pn should converge to p. To make the argum every subsequence of Pn has a limit point.",
        "pn,.",
        "For any T, since Pn,(T) p(r), p'(r) = probabilities, p' = p. Therefore p is the only identifiability of production probabilities, ent more rigorous, by compactness of fin, Let p' be a limit point of a subsequence p(r).",
        "By the identifiability of production limit point of Pn.",
        "This proves Pn – > p."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "I am indebted to Stuart Geman and Mark Johnson for encouraging me to look at problems in this paper in the first place, and for various discussions and suggestions along the way.",
        "I am also grateful to the referees' careful reading of the original manuscript."
      ]
    }
  ]
}
