{
  "info": {
    "authors": [
      "Jose Maria Gomez-Hidalgo",
      "Manuel De Buenaga Rodriguez"
    ],
    "book": "Workshop on Automatic Information Extraction and Building of Lexical Semantic Resources for NLP Applications",
    "id": "acl-W97-0806",
    "title": "Integrating a Lexical Database and a Training Collection for Text Categorization",
    "url": "https://aclweb.org/anthology/W97-0806",
    "year": 1997
  },
  "references": [
    "acl-C94-2174",
    "acl-C96-1005"
  ],
  "sections": [
    {
      "text": [
        "Integrating a Lexical Database and a Training Collection for Text Categorization Iosd Maria GOmez-Hidalgo, Manuel de Buenaga Rodriguez {imgomez,mbuenaga}@dia.ucm.es Departamento de Informitica y Automitica Universidad Complutense de Madrid Avda.",
        "Complutense s/n, 28040 Madrid (Spain)"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "Automatic text categorization is a complex and useful task for manynatural language processing applications.",
        "Recent approaches to textcategorization focus more on algorithms than on resources involved in thisoperation.",
        "In contrast to this trend, we present an approach based on the integration of widely available resources aslexical databases and training collections to overcome current lirnitationsof the task.",
        "Our approach' makes use of Word-Net synonymy information toincrease evidence for bad trained categories.",
        "When testing a direct categorization, a WordNet basedone, a training algorithm, and our integrated approach, the latter exhibitsa better perfomance than any of the others.",
        "Incidentally, WordNet based approach perfomance is comparable with the trainingapproach one."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Text categorization (TC) is the classification ofdocu-ments with respect to a set of one or more preexisting categories.",
        "TCis a hard and very useful operation frequently applied to the assignment of subject categories to documents, toroute and filter texts, or as a part of natural language processingsysterns.",
        "In this paper we present an automatic TC approach based on theuse of several linguistic resources.",
        "Nowadays, many resources like trainingcollections and lexical databases have been successfully employed for text classificationtasks [Boguraev and Pustejovsky, 1996], but always in an isolated way.",
        "Thecurrent trend in the TC field is to pay more attention to algorithms thanto resources.",
        "We believe that the key idea for the improvement of text categorization is increasing theamount of information a system makes use of, through the integration ofseveral resources.",
        "We have chosen the Information Retrieval vector space model for ourapproach.",
        "Term weight vectors are computed for documents and categoriesemploying the lexical database WordNet and the training subset of the testcollection Reuters-22173.",
        "We calculate the weight vectors for: I This research is supported by the Spanish Commitee of Science andTeehnology (CICYT TIC94-0187),",
        "Later, we compare document-category similarity by means of a cosine-basedfunction.",
        "We have driven a series of experiments on the test subset ofReuters22173, which yields two conclusions.",
        "First, the integrated approach performs better than any of the other ones, confirming thehypothesis that the more informed a text classification system is, thebetter it performs.",
        "Secondly, the lexical database oriented technique can rival with the training approach, avoiding the necessity ofcost-expensive building o' training collections for any domain andclassification task."
      ]
    },
    {
      "heading": "2 Task Description",
      "text": [
        "Given a set of documents and a set of categories, the goal of acategorization system is to decide whether any document belongs to anycategory or not.",
        "The system makes use of the information contained in adocument to compute a degree of pertainance of the document to each category.",
        "Categories are usually subject labels likeart or military, but other categories like text genres are also interesting[Karlgren and Cutting, 1994].",
        "Documents can be news stories, e-mailmessages, reports, and so forth.",
        "The most widely used resource for TC is the training collection.",
        "Atraining collection is a set of manually classified documents that allowsthe system to guess clues on how to classify new unseen documents.",
        "Thereare currently several TC test collections, from which a training subset and a test subset can be obtained.",
        "Forinstance, the huge TREC collection [Harman, 1996], OHSUMED [Hersh eta!, 1994] and Reuters-22173 [Lewis, 1992] have been collected for thistask.",
        "We have selected Reuters because it has been used in other work,facilitating the comparison of results.",
        "Lexical databases have been rarely employed in TC, but severalapproaches have demonstrated their usefulness for term classification operations like word sense disambiguation[Resnik, 1995; Agirre and Rigau, 1996].",
        "A lexical database is a referencesystem that accumulates information on the lexical items of one o",
        "several languages In this view,machine readable dictionaries can also be regarded as primitive lexicaldatabases.",
        "Current lexical databases include WordNet [Miller, 1995], EDR[Yokoi, 1995] and Roget's Thesaurus.",
        "WordNet 's large coverage and frequent utilization has led us touse it for our experiments.",
        "We organize our work depending on the kind and number ofresources involved.",
        "First, a direct approach in which only the categoriesthemselves are the terms used in representation has been tested.",
        "Secondly, WordNet by itself has been usedfor increasing the number of terms and so, the amount of predictingin-formation.",
        "Thirdly, we have made use of the training subset of Reuters toobtain the categories representatives.",
        "Finally, we have employed both WordNet and Reuters to get a betterrepresentation of undertramed categories"
      ]
    },
    {
      "heading": "3 Integrating Resources in the Vector SpaceModel",
      "text": [
        "The Vector Space Model (VSM) [Salton and McGill, 1983] is a very suitableenvironment for expressing our approaches to TC: it is supported by many experiences in textretrieval [Lewis, 1992; Salton, 1989]; it allows the seamless integrationof multiple knowledge sources for text classification, and it makes it easyto identify the role of every knowledge source involved in the classification operation In the nextsections we present a straightforward adaptation of the VSM for TC, and theway we use the chosen resources for calculating several model elements."
      ]
    },
    {
      "heading": "3.1 Vector SpaceModel for Text Categorization",
      "text": [
        "The bulk of the VSM for Information Retrieval (IR) is representing naturallanguage expressions as term weight vectors.",
        "Each weight measures theimportance of a term in a natural language expression, which can be adocument or a query.",
        "Semantic closeness between documents and queries is computed by the cosine of the anglebetween document and query vectors.",
        "Exploiting an obvious analogy between queries and categories,the tatters can be represented by term weight vectors Then, a category canbe assigned to a document when the cosine similarity between them exceeds acertain threshold, or when the category is highly ranked.",
        "In a closer look,and given three sets of N terms, M documents and Lcategories, the weight vector for document / is (wdtpwd2j,...,wdNi) and the weight vector for category k is (wcflowc2k, • The similarity between document/ and category k is obtained with the formula: Term weights for document vectors can be computed making use of wellknown formulae based on term frequency.",
        "We use the following one from[Salton, 19891:",
        "Where tfy is the frequency of term 1 in document', and dfi is the number of documents in which term z occurs Now, only weights for category vectors are to be obtained.",
        "Next we will show how to do it depending on the resource used."
      ]
    },
    {
      "heading": "3.2 Direct Approach",
      "text": [
        "This approach to TC makes no use of any resource apart to the documents tobe classified It tests the intuition that the name of content-basedcategories is a good predictor for the occurrence of these categories.",
        "For instance, the occurrence of the word \"barley\" in adocument suggests that this one should be classified in the barley' category.",
        "All the following examples are taken from the Reuters categoryset and involve words that actually occur in the documents.",
        "category.",
        "Wehave taken exactly the categories names, although classification in moregeneral categories like strategic-metal should rather relay on the occurrence of more specificwords like \"gold\" or \"zinc.\"",
        "In this approach, the terms used for the representation are tustthe categories themselves.",
        "The weight of term in the vector forcategory is 1 if i j and 0 in other cases.",
        "MuItiword categories imply the use of multiwordterms.",
        "For example, the expression \"balance of payments\" is considered as one term.",
        "When categories consist of several synonyms(like iron-steel), all of them are used in the representation.",
        "Since the number ofcategories in Reuters is 135, and two of them are composite, these approachproduces 137-component vectors."
      ]
    },
    {
      "heading": "3.3 WordNet based Approach",
      "text": [
        "Lexical databases contain many kinds of information (concepts; synonymy andother lexical relations; hy-ponymy and other conceptual relations; etc.",
        ").For instance, WordNet represents concepts as synonyms sets, or synsets.",
        "We haveselected this synonymy information, performing a \" categoryexpansion\" similar to query expansion in IR.",
        "For any category,the synset it belongs to is selected, and any other term belonging to it is added to therepresentation.",
        "This technique increases the amount of evidence used topredict category occurrence.",
        "Unfortunately, the disambiguation of categories with respect toWordNet concepts is required.",
        "We have performed this task manually, becausethe small number of categories in the test collection made it affordable.",
        "We are currently designing algorithms for automating this operation.",
        "After locating categories in WordNet, a term set containing allthe category's synonyms has been built.",
        "For the 135 categories used in thisstudy, we have produced 368 terms.",
        "Although some meaningless terms",
        "occur and could bedeleted, we have developed no automatic criteria for this at the moment.",
        "Let us take a look to one example.",
        "The fuel category hasdriven us to the addition of the terms \"combustible\" and \"combustible material,\" since they belong to the same synset in WordNet.",
        "In general, the termweight vector for category k is 1 for every synonym of the category an0 for any other term."
      ]
    },
    {
      "heading": "3.4 Training Collection Approach",
      "text": [
        "The key asumption when using a training collection is that a term often occurring within a category and rarely within others is a good predictorfor that category.",
        "A set of predictors is typically computed from term tocategory co-ocurrence statistics, as a training step.",
        "The computation depends on the approach and algorithmselected.",
        "As Lewis [1992] has done before, we have replicated in the VSMearly Bayesian experiments that had reported good results.",
        "Terms are selected according to the number of times they occur withincategories.",
        "Those terms which co-occur at least with the 1% and at mostwith the 10% of the categories are taken.",
        "Among them, those 286 with-highest document frequency are selected.",
        "We work the weights out in the same way as in documents vectors:",
        "Where tfik is the number of times that term 'occurs within documents assigned to category k, and cflis the number of categories within term i occurs.",
        "For example, after selecting and weighting categories, the high-frequency term\" export\" shows its largest weight for category trade, but it also shows large weights for grain or wheat, andsmall weights for belgtan-franc and wool.",
        "A less frequent term typically provides evidence for asmaller number of categories.",
        "For example, \"private\" has a large weight only for acq (acquisition), and medium for earn (earnings) and trade."
      ]
    },
    {
      "heading": "3.5 Integrating WordNet and a Train-ingCollection",
      "text": [
        "Several ways of integrating WordNet and Reuters have occurred to us.",
        "Asensible one is to use concepts instead of terms as representatives.However, and although promising, Voorhees [1993] reported no improvements with this idea.On the other side, we have realized that the shortcomings in training canbe corrected using WordNet to provide better forecast of low frequencycategories.",
        "In general, we have linked WordNet weight vectors to training weigth vectors, First we have removed those WordNet terms not ocurring in thetraining collection.",
        "Then we have normalized both WordNet vectors andtraining vectors to separately add up across each category.",
        "This way we have smoothed training weights (much larger than WordNetones), giving equal influence to each kind of term weight.",
        "This tech-niqueresults in 461 term weights vectors, 185 coming from WordNet, and 286 fromtraining.",
        "Weights for terms ocurring in both sets have been summed.Examples of terms coming from training are \"import\" or\" government,\" with high weights for highly frequent categories, like acq.",
        "Examplesof terms coming from WordNet are \"petroleum\" or\" peanut,\" with weights only for the correspondingcategories crude and groundnut respectively.",
        "We can clearly identify the role of each resource in this TCapproach.",
        "WordNet supplies information on the semantic relatedness of termsand categories when training data is no longer available or reliable It directly contributes with part of the terms used in the vector representation.",
        "On the other side, the training collection supplies terms for those categories that are better trained The problem of unavailabilityof training data is then overcome through the use of an extern resource."
      ]
    },
    {
      "heading": "4 Evaluation",
      "text": [
        "Evaluation of TC and other text classification operations exhibits greatheterogeneity.",
        "Several metrics and test collections have been used fordifferent approaches or works.",
        "This results in a lack of comparability among the approaches,forcing to replicate experiments from other researchers.",
        "Trying to minimize this problem, we havechosen a set of very extended metrics and a frequently used free testcollection for our work.",
        "The metrics are recall and precision, and the testcollection is, as introduced before, Reuters-22173.",
        "Before stepping into the actual results, we provide acloser look to these elements,"
      ]
    },
    {
      "heading": "4.1 Evaluation metrics",
      "text": [
        "The VSM promotes recall and precision based evaluation, but there are several ways of calculating or even defining them.",
        "Wefocus on recall, being the discussion analogous for precision.",
        "First,definition can be given regarding categories or documents [Larkey andCroft, 1996].",
        "Second, computation can be done macro-averaging or micro-averaging [Lewis, 1992]."
      ]
    },
    {
      "heading": "Recall can be defined as the number of correctly as",
      "text": [
        "_ signed documents to a category over the number of documents to becorrectly assigned to the category.",
        "But a document-oriented definition is also possible the number of correctly assigned categories to adocument over the number of correct categories to be assigned to thedocument.",
        "This later definition is more coherent with the task, but thefortner allows to identify the most problematic categories.",
        "Macro-averaging consists of computing recall and precision for every item (document or category) in one of both previous ways, and averaging after it.",
        "Micro-averaging is adding up all numbers of correctly assigned items, items assigned, and items to be assigned, and calculate only one value of recall and precision.",
        "When micro-averaging, no distinction about document or category orientation can be made.",
        "Macro-averaging assigns equal weight to every category, while micro-averaging is influenced by most frequent categories.",
        "Evaluation depends finally on the category assignment strategy: probability thresholding, k-per-doc assignment, etc.",
        "Strategies define the way to produce recall/precision tables.",
        "For instance, if similarities are normalized to the [0,1J interval, eleven levels of prob",
        "The May deficit compares with a surplus of 1,555 billion lire in the corresponding month of 1986.",
        "For the first five months of 1987, the overall balance of payments showed a surplus of 299 billion lire against a deficit of 2,854 billion in the corresponding 1986 period.",
        "REUTER ability threshold can be set to0.0, 0.1, and so, When the system performs k-per-doc assignment, the value of k is ranged from I to a reasonable maximum.",
        "We must assign an unknown number of categories to each document in Reuters.",
        "So, the probability thresholding approach seems the most sensible one.",
        "We have then computed recall and precision for eleven levels of threshold, both macro and micro-averaging.",
        "When macro-averaging, we have used the category-oriented definition of recall and precision.",
        "After that, we have calculated averages of those eleven values in order to get single figures for comparison."
      ]
    },
    {
      "heading": "4.2 The Test Collection",
      "text": [
        "The Reuters-22173 collection consists of 22,173 newswire articles from Reuters collected during 1987.",
        "Documents in Reuters deal with financial topics, and were classified in several sets of financial categories by personnel from Reuters Ltd. and Carnegie Group Inc.",
        "Documents vary in length and number of categories assigned, from 1 line to more than 50, and from none categories to more than 8.",
        "There are five sets of categories: TOPICS, ORGANIZATIONS, EXCHANGES, PLACES, and PEOPLE.",
        "As others before, we have selected the 135TOPICS for our experiments.",
        "An example of news article classified in bop (balance of payments) and trade is shown in Figure 1.",
        "Some spurious formatting has been removed from it.",
        "When a test collection is provided, it is customary to divide it into a training subset and a test subset.",
        "Several partitions have been suggested for Reuters [Lewis, 1992], among which ones we have opted for the most general and difficult one.",
        "First 21,450news stories are used for training, and last 723 are kept for testing.",
        "We summarize significant differences between test and training sets in Table 2.",
        "These differences can bring noise into categorization, because training relies on similarity between training and test documents.",
        "Nevertheless, this 21,450/723 partition has been used before [Lewis, 1992; Hayes and Weinstein, 1990] and involves the general case of documents with no categories assigned.",
        "We have worked with raw data provided in the Reuters distribution.",
        "Control characters, numbers and several separators like\" I\" have been removed, and categories different from the TOPICS set have been ignored.",
        "For disambiguating categories with respect to WordNet senses, we first had to acquire their meaning, not always self-evident.",
        "This task has been performed by direct examination of training documents."
      ]
    },
    {
      "heading": "4.3 Results and Interpretation",
      "text": [
        "The results of our first series of experiments are summarized in Table 3.This table shows recall and precision averages calculated both macro and micro-averaging for a threshold-based assignment strategy.",
        "Values for the integrated approach show some general advantage over WardNet and training approaches, but results are not decisive.",
        "Training results are comparable with those from Lewis [1992], and the WordNet approach is roughly equivalent to the training one.",
        "On one hand, the integrated approach shows a better performance than the WordNet one in general, although a problem of precision is detected when macro-averaging.",
        "The influence of low precision training has produced this effect.",
        "We are planning to strengthen",
        "WordNet influence to overcome this problem.",
        "On the other hand, the integrated approach reports better general performance than the training approach.",
        "As expected, WordNet and training both beat the direct approach.",
        "When comparing WordNet and training approaches, we observe that the former produces better results with categories of low frequency, while the latter performs better in highly frequent categories.",
        "However, both exhibit the same overall behaviour.",
        "Differences in categories are noticed by the fact that micro-averaging is influenced by highly frequent elements, while macro-averaging depends on the results of many elements of low frequency."
      ]
    },
    {
      "heading": "5 Related Work",
      "text": [
        "Text categorization has emerged as a very active field of research in the recent years.",
        "Many studies have been conducted to test the accuracy of training methods, although much less work has been developed in lexical database methods.",
        "However, lexical databases and especially WordNet have been often used for other text classification tasks, like word sense disambiguation.",
        "Many different algorithms making use of a training collection have been used for TC, including k-nearest-neighbor algorithms [Masand et al., 1992], Bayesian classifiers [Lewis, 1992], learning algorithms based in relevance feedback [Lewis et al., 1996] or in decision trees [Apte et al., 1994], or neural networks [Wiener or al., 1995].",
        "Apart from Lewis [1992], the closest approach to ours is the one from Larkey and Croft [1996], who combine k-nearest-neighbor, Bayesian independent and relevance feedback classifiers, showing improvements over the separated approaches.",
        "Although they do not make use of several resources, their approach tends to increase the information available to the system, in the spirit of our hypothesis.",
        "To our knowledge, lexical databases have been used only once in TC.",
        "Hearst [1994] adapted a disambiguation algorithm by Yarowsky using WordNet to recognize category occurrences.",
        "Categories are made of WordNet terms, which is not the general case of standard or user-defined categories.",
        "It is a hard task to adapt WordNet subsets to preexisting categories, especially when they are domain dependent.",
        "Hearst's approach shows promising results confirmed by the fact that our WordNet based approach performs at Least equally to a simple training approach.",
        "Lexical databases have been employed recently in word sense disambiguation.",
        "For example, Agirre and Rigau [1996] make use of a semantic distance that takes into account structural factors in WordNet for achieving good results for this task.",
        "Additionally, Resnik [1995] combines the use of WordNet and a text collection for a definition of a distance for disambiguating noun groupings.",
        "Although the text collection is not a training collection (in the sense of a collection of manually labeled texts for a predefined text processing task), his approach can be regarded as the most similar to ours in the disambiguation task.",
        "Finally, Ng and Lee [1996] make use of several sources of information inside a training collection (neighborhood, part of speech, morphological form, etc.)",
        "to get good results in disambiguating unrestricted text.",
        "We can see, then, that combining resources in TC is a new and promising approach supported by previous research in this and other text classification operations.",
        "With more information extracted from WordNet and better training algorithms, automatic TC integrating several resources could compete with manual indexing in quality, and beat it in cost and efficiency."
      ]
    },
    {
      "heading": "6 Conclusions and Future Work",
      "text": [
        "In this paper, we have presented a multiple resource approach for TC.",
        "This approach integrates the use of a lexical database and a training collection in a vector space model for TC.",
        "The technique is based on improving the language of representation construction through the use of the lexical database, which overcomes training deficiencies.",
        "We have tested our approach against training algorithms and lexical database algorithms, reporting better results than both of these techniques.",
        "We have also acknowledged that a lexical database algorithm can rival training algorithms in real world situations.",
        "Two main work lines are open: first, we have to conduct new series of experiments to check the lexical database and the combined approaches with other more sophisticated training approaches; second, we will extend the multiple resource technique to other text classification tasks, like text routing or relevance feedback in text retrieval."
      ]
    }
  ]
}
