{
  "info": {
    "authors": [
      "Maria Wolters"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P97-1073",
    "title": "Compositional Semantics of German Prefix Verbs",
    "url": "https://aclweb.org/anthology/P97-1073",
    "year": 1997
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "A compositional account of the semantics of German prefix verbs in HPSG is outlined.",
        "We consider only those verbs that are formed by productive synchronic rules.",
        "Rules are fully productive if they apply to all base verbs which satisfy a common description.",
        "Prefixes can be polysemous and have separate, highly underspecified lexical entries.",
        "Adequate bases are determined via selection restrictions."
      ]
    },
    {
      "heading": "1 The Problem",
      "text": [
        "Determining the semantics of unknown words which can be derived from lexicon entries is highly desirable for natural language understanding (Light, 1996).",
        "In this paper.",
        "I sketch a compositional account of the semantics of German prefix verbs derived from a verbal base, concentrating on those verbs that can be generated by a productive word formation rule.",
        "Like (Witte, 1997), I assume that the meaning of most of these verbs can be derived compositionally by unifying the semantic representations of its constituents.",
        "Example:",
        "(1) durch laufen ('through to run')",
        "durchlaufen (jto run through') This is an instance of a common rule which can be summarized informally as",
        "(2) 'durch' VERBHmotion,-Fagentivej VERB through a space",
        "When a prefix verb is lexicalized, its meaning frequently shifts due to language change and metaphorical usage (Mayo et al., 1995).",
        "For example, 'durchlaufen' is mostly associated with the meaning \"passing through all stages of a process\":",
        "(3) Er durchlauft die Schulung.",
        "He passes through the training."
      ]
    },
    {
      "heading": "2 The Semantics of Prefix Verbs",
      "text": [
        "Frequently, the prefix modifies features of the base verb such as valency or aspect'.",
        "For example, while 'eilen' ('to haste.)",
        "is an activity, 'etw.",
        "durcheilen' ('to haste through sth.') is an accomplishment.",
        "I assume that the prefix entry provides a highly underspecified blueprint of the structure of the prefix verb; therefore.",
        "I regard the prefix as the head of the prefix verb (but see (Bauer, 1990)).",
        "The values for all features of the prefix verb are obtained from the base verb via structure sharing, except for basic morphological information and the information to be modified.",
        "In other words, the values of all unmodified features of the prefix verb are token identical with the corresponding values of the base verb.",
        "Most prefixes appear in distinct but semantically related rules, resulting in polysemous prefixes.",
        "For example, combined with some sta.tive verbs, 'durch' signifies \"VERB during a certain period of time\", as in (4) durch leben (through' + 'live') durchleben (live through!)",
        "Specifying the set of adequate bases implicitly by selection restrictions allows to elegantly capture generalizations.",
        "For example, we can specify at the feature structure for verbs of motion that they can only combine with the instance of !durch' denoting \"VERB through a space\".",
        "The productivity of a word formation rule is a complex notion (Kastovsk3r, 1986: Bauer, 1988; Mayo et al., 1995).",
        "For our purposes, a rule is productive if it applies to all bases which satisfy a common description such as \"state\" or \"transitive verb\".",
        "A rule only provides patterns for analogical forma-'Here.",
        "aspect denotes certain general verb classes (Binnick.",
        "1992; Comrie.",
        "1992) such as state, activity, accomplishment, and achievement (Vendler, 1957).",
        "tions: the frequency of application and acceptability of results also indicate its degree of productivity."
      ]
    },
    {
      "heading": "3 Prefix Semantics in HPSG",
      "text": [
        "The main advantage of HPSG (Head Driven Phrase Structure Grammar, (Pollard and Sag, 1994), for German see e.g.(Kathol, 1995)) is that it is both a formalism with strong ties to logic and knowledge representation and a linguistic theory.",
        "Much research in HPSG focuses on the structure of the lexicon.",
        "e.g. (Davis, 1997).",
        "However, work on semantics and morphology in HPSG is relatively scarce."
      ]
    },
    {
      "heading": "3.1 Previous Work",
      "text": [
        "Most HPSG work on German affixation focuses on the suffix -bar, which can combine with verbs, most of them transitive, to form an adjective.",
        "(Krieger and Nerbonne, 1992) (KN) assign separate lexical entries to affixes and express selection restrictions by typing and subcategorization frames.",
        "In their model, bar is of sort bar-stiff and subcate-gorizes for verbs of sort bar-verb to form adjectives of sort bar-comp-adj.",
        "Complex words have a headed binary structure, with the affix as head.",
        "In keeping with the HPSG Semantics Principle, the semantics of the complex word is structure shared with the semantics of the head.",
        "(Riehemann, 1993) found that subcategorization frames were incompatible with her data.",
        "Instead of a word syntactic approach with separate lexical entries for affixes, she describes the formation of bar-adjectives via a lexical inheritance hierarchy of sorts.",
        "Different sorts correspond to different types of verbal bases (transitive, dative, etc.).",
        "New adjectives are formed in analogy to existing ones.",
        "Although Riehemann's approach is very elegant, it is not adequate for verb prefixes.",
        "Most prefixes can be separated from the verb depending on their phonological leve1.2 Example: (5) Ich mache die Tiir zu.",
        "('I close the door': zumachen = 'to close') Therefore, a word syntactic approach and separate lexical entries for verb prefixes may well be adequate.",
        "(Witte, 1997) also advocates a word syntactic approach.",
        "His semantic representation relies on (Davis, 1997).",
        "(Light, 1996) bases his semantic representations on first order logic, but he does not use HPSG."
      ]
    },
    {
      "heading": "3.2 Verb Prefixes",
      "text": [
        "Fig.",
        "1 presents the prefix-related part of the sort hierarchy.",
        "The sort verb-prefix specifies typical lea2 Lexical Phonology (Mohanan, 1987) assumes several levels of rules.",
        "tures of verb prefixes.",
        "Each prefix p is assigned a sort p with subsorts p1 ,p, for each potential meaning.",
        "Relevant verb classes, such as semantic fields or Vendler classes, are also specified using sorts.",
        "Following KN.",
        "I assume that the prefix is the head of complex affix words, but like Riehemann, I do not assume a binary structure.",
        "The internal structure of a complex derived word is given in Fig. 2.",
        "Morphological information is given at the feature MOB P11.",
        "MOR.PHILEVEL specifies separability (1 – 'inseparable, 2 – separable).",
        "MORPHIDTRS the internal structure, and MORPHIBASE the base form.",
        "Each verb has a complex feature PREFIX located at SYNSENIILOCICAT.",
        "For each prefix p, the value of the subfeature PREFIXIp points to the adequate prefix meaning.",
        "For example, if the instance of 'durch' corresponding to (2) is labelled durch,_1, we get PR.EFIXIDURCH: 1 in the lexical entry for 'eilen'.",
        "A verb can only combine with prefixes for which an instance is specified at PREFIX.",
        "Regarding semantics.",
        "we focus on aspectual classes.",
        "The semantic framework chosen here is Lexical Conceptual Structure, which has been applied successfully to the interface between morphology and lexical semantics by e.g. (Rappaport Hovav and Levin, in press).",
        "The representation of Vendler classes is adapted from (Van Valin, 1990).",
        "Class is specified at SYNSEMILOCICONTENTICLASS.",
        "Prefix entries are heavily underspecified.",
        "For example, the entry for 'durch' can be derived from Fig. 2 by deleting all information specific to the comPlement 'ellen'.",
        "except for the value of PREFIXIDURCH.",
        "The semantics of the complex word is composed at the head and then structure shared with the whole word, in accordance with the Semantics Principle.",
        "A prefix can only be combined with verbs with an adequate feature value at PREFIX."
      ]
    },
    {
      "heading": "4 Conclusion and Further Work",
      "text": [
        "The representation of the relevant semantics will formalized more rigorously.",
        "Hypotheses will be checked with the data, using a more refined, statistically motivated notion of productivity.",
        "The theory will also be implemented in an adequate lexical knowledge",
        "representation language."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "Thanks to Bernhard SchrOder and three anonymous reviewers for their valuable comments.",
        "This research was partially supported by the Studienstiftung des deutschen Volkes and ERASMUS."
      ]
    }
  ]
}
