{
  "info": {
    "authors": [
      "Kumiko Tanaka-Ishii"
    ],
    "book": "Workshop on Very Large Corpora",
    "id": "acl-W97-0111",
    "title": "Clustering Co-Occurrence Graph Based on Transitivity",
    "url": "https://aclweb.org/anthology/W97-0111",
    "year": 1997
  },
  "references": [
    "acl-C94-2122",
    "acl-C96-1003",
    "acl-J90-1003",
    "acl-J92-4003",
    "acl-P90-1034",
    "acl-P93-1024"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Word co-occurrences form a graph, regarding words as nodes and co-occurrence relations as branches.",
        "Thus, a co-occurrence graph can be constructed by co-occurrence relations in a corpus.",
        "This paper discusses a clustering method of the co-occurrence graph, the decomposition of the graph, from a graph-theoretical viewpoint.",
        "Since one of the applications for the clustering results is the ambiguity resolution, each output cluster is expected to have no ambiguity and be specialized in a single topic.",
        "We observed that a graph has no ambiguity if its branches representing co-occurrence relations are transitive.",
        "An algorithm to extract such graphs are proposed and its uniqueness of the output is discussed.",
        "The effectiveness of our method is examined by an experiment using co-occurrence graph obtained from a 30M bytes corpus."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Clustering is the operation to group words by some criterion.",
        "Thesauri and synonym dictionaries are some of its manual examples.",
        "Automatic outputs can be used not only to revise them, but also to aid ambiguity resolution, an essential problem.",
        "in natural language processing.",
        "For instance, the meaning of an ambiguous word can be decided by examining the cluster it belongs to.",
        "Furthermore, clusters grouped according to topics have many application areas such as automatic document classification.",
        "The input in this paper is the word co-occurrence graph obtained from corpus.",
        "The output is its subgraphs with the condition that each sub-graph is specialized in a topic.",
        "Many automatic clustering methods have been already proposed.",
        "Most of them are based on the statistical similarity between two words.",
        "Our approach is different; it is graph theoretical.",
        "We tried to fmd out the special structure in linguistic graph.",
        "• Having a huge co-occurrence graph obtained from a corpus, we first tried to decompose it to analyze its graph structure using graph theoretical tools, such as maximum strongly connected components, or biconnecteol components.",
        "Although both tools decompose a graph into tightly connected subgraphs, these trials resulted in vain.",
        "The question arose; what must be taken into account to decompose the co-occurrence graph?",
        "The answer is the ambiguity.",
        "Furthermore, we reached to the conclusion that the ambiguity can be explained in terms of intransitivity.",
        "This feature is developed into an algorithm for clustering.",
        "This paper is organized as follows.",
        "The following chapter describes the relationship between the transitivity in the graph and the ambiguity resolution.",
        "Chapter 3 shows the relationships between clustering and transitivity.",
        "Chapter 4 proposes and discusses an algorithm for clustering.",
        "Related work is resumed in Chapter 5.",
        "Our method is examined in Chapter 6 by some experiments."
      ]
    },
    {
      "heading": "2 Word Ambiguity and Transitivity",
      "text": [
        "Two words are said to co-occur when they frequently appear close to each other within texts.",
        "Regarding words as nodes and co-occurring re",
        "lations as branches, a graph can be constructed from a given corpus.",
        "We define such a graph as co-occurrence graph.",
        "When a portion of a corpus specializes in a topic, we can still extract a co-occurrence graph from the portion.",
        "A general corpus, such as newspaper corpus, contains many corpus portions, each specializing in one topic.",
        "Therefore, the whole co-occurrence graph obtained from a general corpus contains subgraphs, each specializing in one topic.",
        "Our question is to extract such subgraphs of topics from a co-occurrence graph.",
        "We denote V as the set of nodes (words), E as the set of branches (co-occurrence relations), G=< V,E > as an input graph and WI as the number of nodes.",
        "English words referred as examples will be written in this font."
      ]
    },
    {
      "heading": "2.1 Transitivity in Co-occurrence Relation",
      "text": [
        "The most basic mathematical laws discussed about relations between elements in a set are reflective, symmetric and transitive laws.",
        "Having a, b,c E V and R as a relation, they can be described as follows:",
        "Let V be word set and R be co-occurrence relation.",
        "When each property holds for R, words a, b and c can be explained as follows from the linguistic viewpoint:"
      ]
    },
    {
      "heading": "Reflective Word a co-occurs with itself. Symmetric Co-occurrence relation does not",
      "text": [
        "depend on the occurrence order.",
        "Transitive Word b does not have two-sided meanings (ambiguity).",
        "For instance, doctor, which has both medical and academic meanings, co-occurs with nurse within a medical topic, and co-occurs with professor within an academic topic.",
        "However, nurse and professor do not co-occur, so the transitivity between nurse, doctor and professor does not hold.",
        "Our request is to extract subgra.phs each of which focuses on one topic with no ambiguity.",
        "Therefore, we perform clustering by extracting subgraphs whose branches form transitive co-occurrence relations."
      ]
    },
    {
      "heading": "3 Transitivity and Clustering",
      "text": []
    },
    {
      "heading": "3.1 Decomposition and Duplication",
      "text": [
        "The simplest case is a graph of three nodes.",
        "Figure 1-(1) is a graph in which the transitivity does not hold.",
        "For example, when b is doctor, a is nurse and c is professor, nurse and professor do not co-occur due to the node b's two-sided meanings.",
        "Therefore, as in Figure I (2) , we \"duplicate\" b so that each duplicated node corresponds only to a single meaning.",
        "Then the ambiguity within b is resolved and the entire graph is divided into two subgraphs, the academic one and the medical one.",
        "To sum up, when the transitivity does not hold, a graph can be decomposed by duplicating the ambiguous node.",
        "On the other hand, when the transitivity holds among three nodes (Figure 1-(3)), the",
        "graph cannot be decomposed by duplication of b (Figure 144)).",
        "This can be explained that the graph does not have the ambiguity.",
        "We extend the above into the case of four nodes(Figure 1-(5)).",
        "Here, transitivity does not hold in a-b-d because there is no branch between ad.",
        "When b-c is duplicated, the graph can be decomposed into two subgraphs (Figure 1-(6)) in which the transitivity holds.",
        "On the contrary, Figure 1 (7) cannot be decomposed by duplicating b-c due to the branch ad (Figure 1-(8)); this shows that b-c is not ambiguous.",
        "Note that Figure 1-(7) is a complete graph of 4 nodes.",
        "We define duplicate branch as a branch to be duplicated for graph decomposition (such as b-c) and anchor branch as a branch which inhibit graph decomposition by duplication (such as a-d).",
        "In general, when a graph could not be separated by duplicating its subgraph, then the subgraph is regarded not to have ambiguity.",
        "Therefore, ideal clustering is to decompose graphs into subgraphs which cannot be decomposed further by duplication.",
        "Unfortunately, this constraint is too strict because such a graph is restricted to a complete graph.",
        "In addition, extracting complete graphs within a given graph is NP-complete.",
        "Therefore we discuss in the following how to loosen the constraint."
      ]
    },
    {
      "heading": "3.2 Transitive Graph",
      "text": [
        "There are two methods to loosen the constraint.",
        "The first is to decrease the number of anchor branches.",
        "In the complete graph of more than 5 nodes, several anchor branches exist for each duplicate branch (Figure 2-(1)).",
        "However, only one anchor branch is sufficient to inhibit the decomposition.",
        "The less the number of anchor branch is, the looser the constraint is.",
        "This intuitively corresponds to loosen the sharpness of the focus of the topic in the resulting cluster.",
        "For instance, two words pneumonia and cancer do not always co-occur, but they do co-occur with words as doctor, nurse and hospital forming the core of medical topics.",
        "anchor distance 2 anchor distance n",
        "Pneumonia will be included into a cluster if it is connected with these three words even if it is not connected with cancer.",
        "If cancer is also connected with these three words, both cancer and pneumonia, the different subtopical words within a medical topic are included in a cluster.",
        "The second is to loosen the transitivity itself.",
        "It was defined in Section 2.1 within three nodes.",
        "We may prepare a loose transitivity as follows:",
        "We define anchor distance as the maximum distance of the minimum distances of a-b-d and a-c-d. For example, when minimum distance of a-b-d is 4 and that of a-c-d is 6 then the anchor distance is 6.",
        "The tightest constraint is when anchor distance is 2 as in Figure 2 (3).",
        "This also blurs the topic focus of a cluster.",
        "In.",
        "the example of pneumonia, the word will be included if it is connected directly with at least one of the words among doctor, hospital, nurse, and cancer, and connected indirectly with the others.",
        "For m, n < IV!",
        "- 1, G is called (m, n)-transitive graph when for all e E E, there are in anchor branches e' E E of anchor distance < n. n)-transitive graphs can be extracted as the subgrapIts of the input graph.",
        "Figure 3 shows a map of (m, n)-transitive graphs.",
        "The axis of ordinates describes the number of anchor branches (m).",
        "The axis of abscissas de",
        "scribes the anchor distance (n).",
        "The constraint is loose when m is small and n is large.",
        "For the same input, (ml, n)-transitive graphs are included in (m2, n)-transitive graphs when mr < m2, and (m, ni)-transitive graphs are included in (m, n2)-transitive graphs when n2 < nj.",
        "GS2 in Figure 3 is the clusters obtained under the loosest constraint: m is the maximum and n is the minimum.",
        "In GS2, all ambiguity of a branch and nodes at its ends are resolved.",
        "GS0 are the transitive graphs of the tightest constraint.",
        "All transitive graphs on the horizontal line including GS0 are complete."
      ]
    },
    {
      "heading": "4 Extraction of Transitive Graphs",
      "text": [
        "So far, we did not explain how to detect the duplicate and anchor branches, given a graph.",
        "An algorithm for clustering can be top-down or bottom-up.",
        "The former gives clusters by decomposing the input graph by detecting duplicate branches.",
        "Although we have explained our clustering method top-down up to now, we propose our clustering method as bottom-up.",
        "We obtain clusters by accumulating adjacent nodes so that every branch has anchor branches and the resulting clusters include no duplicate branch.",
        "Thus, in the bottom-up method, we need not detect duplicate branches.",
        "This is convenient, because the condition for anchor and duplicate branches is denoted by local relationships among nodes.",
        "The branches in the input graph are assumed to be all symmetric.",
        "In this section, we use terms clusters as our output and subgraphs as their candidates."
      ]
    },
    {
      "heading": "4.1 Definition of Clusters",
      "text": [
        "We extract GS1, the (1, 2)-transitive graph.",
        "A subgraph A including a branch e in the input graph can be extracted as follows: Step 1.",
        "Put a triangle graph including e into A.",
        "Step 2.",
        "Take a branch e' in A and a node v which makes a triangle with e' (Figure 4).",
        "If the following condition is satisfied, put v into A.",
        "There exists a node v' E G (input graph) whose distance from e' is 1, and it is connected to v with a branch.",
        "Here, the branch v'-v is the anchor branch so that e' is hindered to be the duplicate branch in the resulting duster.",
        "Additionally, put every branch between v\" E G and v into A.",
        "Step 3.",
        "Repeat Step 2 until A cannot be extended.",
        "Performing the above procedure starting from every branch in the input graph, we obtain many subgraphs.",
        "Considering the inclusion relation between subgraphs, they constitute a partial order (Figure 5).",
        "We define clusters as maximal subgraphs in this partial order chain.",
        "They are subgraphs not included in any other subgraphs.",
        "The uniqueness of the clusters for an input is self-evident."
      ]
    },
    {
      "heading": "4.2 Algorithm for Clustering",
      "text": [
        "In the previous section, the procedure to obtain subgraphs should begin from every branch in the input.",
        "However, it is sufficient to calculate as follows.",
        "Step 0. i = 0",
        "Step 1.",
        "Choose a branch e E G not included in Go, • • • , If no e is found, go to Step 5.",
        "Gi = < 0,0 >.",
        "Put a triangle graph including e into G. Step 2 and 3.",
        "Extend Gi using Step 2 and 3 of the previous section.",
        "Step 4.",
        "Set i = i +1 and goto Step 1.",
        "Step 5.",
        "Examine every pair of subgraphs (A, B), and if A includes B, then drop B.",
        "The remaining subgraphs are defined as clusters.",
        "A maximal subgraph cannot be missed.",
        "Its starting branch is encountered without fail in the above algorithm.",
        "If it is encountered as the starting branch in Step 1, the maximal subgraph is obtained.",
        "If it is captured into a subgraph and becomes e' in Step 2, the subgraph extends to the size of maximal subgraph; if it gets larger, the subgraph contradicts being maximal as the result of the last section.",
        "The algorithm halts since the input graph is finite, and the output is unique for an input."
      ]
    },
    {
      "heading": "5 Related Work",
      "text": [
        "[Li and Abe, 1996] compared clustering methods proposed so far [Hindle, 1990] [Brown et al., 1992] [Pereira et al., 1993] [Tokunaga et al., 1995][Li and Abe, 1996].",
        "Most of them are so-called hard clustering: each word is included only in one cluster.",
        "We do not follow the trend, from the sense that our objective is the extraction of clusters of topics.",
        "It is natural that an ambiguous word should be included in different clusters.",
        "[Pereira et at., 1993] adopts soft clustering.",
        "They measured co-occurrence between nouns and verbs, and clustered nouns of the same distribution of verbs.",
        "[Fukumoto and Tsujii, 1994]'s work has common motivation with us: the ambiguity should be resolved for clustering.",
        "They clustered verbs using the gravity of multivariate analysis.",
        "[Sugihara, 19951's approach has a common point in that it focuses on graph structure for clustering and tries to structurize the input graph, a bipartite graph of words and concepts (such as food, fruit etc.).",
        "His clustering method is so called Dulraage-Mende]sohn decomposition in graph theory.",
        "The output naturally gives a partial order of clusters which can be compared with conventional thesauri.",
        "Our input is not bipartite.",
        "In the beginning, we tried to decompose input graph into maximum strongly connected components to obtain graphs of topics from the observation that nodes in a cycles are strongly relatedl.",
        "However, subgraphs about different topics is merged into the same cluster by two ambiguous words which bridge these two subgraphs(Figure 6).",
        "Next, we observed that articulation nodes are ambiguous, so we performed decomposition into biconnected components.",
        "In this case when several biconnected components are connected in a ring, articulation nodes could not be detected (Figure 7).",
        "The observation that there are no co-occurrence relationship between [Tokunaga and Tanaka, 1990] discusses on extraction of cycles formed by translation relations from bilingual dictionary.",
        "two biconnected graph across the articulation node was the start point of this paper."
      ]
    },
    {
      "heading": "6 Experiments",
      "text": []
    },
    {
      "heading": "6.1 Procedure of Clustering",
      "text": [
        "First, we make the input graph from a 30M bytes of Wall Street Journal.",
        "Co-occurrences of nouns and verbs are extracted by a morphological analyzer.",
        "We defined that a word co-occurs with 5 words ahead of the word within a sentence.",
        "Co-occurrence degree is measured by mutual information[Church and Hanks, 19901.",
        "We set a certain threshold to the values to extract the input graph.",
        "The number of resulting clusters depends on the input graph as follows:",
        "not interesting, because 1 is a graph including all topics, and 3 generates graphs of too small topics to check the global trend of topics in the input.",
        "Therefore, we varied threshold from 1.0 up to 7.0 by 0.5 steps to make the input graph, applied our algorithm to each input in order to detect the best threshold.",
        "The result is shown in Figure 8.",
        "The number of clusters whose sizes are more than 7 is plotted against the threshold value.",
        "When the threshold is 3.5, such clusters were most numerous.",
        "In 39 clusters, there were 727 different words out of 15347 in the input graph."
      ]
    },
    {
      "heading": "6.2 Evaluation of Clusters",
      "text": [
        "In Appendix, 39 clusters are shown their contents sorted by size.",
        "Words judged inappropriate in each cluster are attached \"t\".",
        "Words undecida.ble being suitable in their clusters are put \"t\".",
        "All 39 clusters are attached four items as follows:",
        "• Subjectively judged topic • Cluster size (CS): number of words in a cluster • Error rate (ER): rate of inappropriate words (attached \"t\") • Uncertainty rate (UR): rate of uncertain words (attached \"t\" and '1\")",
        "The average of the above items were CS=20,",
        "ER=10.3%, UR= 14.7%; hence, the ambiguity was removed from clusters up to 85% on average.",
        "The number of the cluster whose topic was inestimable is only 1.",
        "The estimation of topic becomes difficult with two factors, CS and UR.",
        "When CS is too small, even when UR is 0.0, the duster itself lacks in information.",
        "When UR is high, it is natural that the topic becomes inestimable."
      ]
    },
    {
      "heading": "6.3 Evaluation of Words Contained in More than Two Clusters",
      "text": [
        "The number of words belonging to more than two clusters amounts to 57.",
        "They are classified as follows (numbers in parenthesis are cluster number in Appendix):",
        "3.",
        "A word with the same meaning in the same context (7 words).",
        "4.",
        "Others (One of the words is uncertain, or its cluster's context is not estimated.",
        "6 words)",
        "Words of class 1 is the ambiguous words.",
        "Cell in Cluster 1 means cells of tissue, whereas that in Cluster 15 means battery.",
        "Ice in Cluster 3 means ice for cooling beverage, whereas that in Cluster 8 means ice to skate on.",
        "According to our objectives to obtain subgraphs of topics, words in class 2 is quite important to be duplicated.",
        "For instance, star in Cluster 9 is a sport player star, that in Cluster 12 is a singer star and that in Cluster 14 is a movie star.",
        "If star were not duplicated, the three different topics would be merged into a single subgraph.",
        "The same situation is observed for children: it would merge topics of childbirth and education into a graph if it was not duplicated.",
        "We are apt to pay attention only to the words of class 1, but that of class 2 plays an important role in clustering.",
        "Words in class 3 is not ambiguous: they should connect two subgraphs into one (see Section?",
        ")."
      ]
    },
    {
      "heading": "6.4 Cluster Hierarchy",
      "text": [
        "An output subgraph of higher threshold is included as that of lower threshold.",
        "With this inclusion relation, the clusters form a. hierax-chy(Figure 9).",
        "A part of the hierarchy is shown below:"
      ]
    },
    {
      "heading": "Threshold 3.5 Cluster 6,24 in Appendix. Threshold 3.25",
      "text": [
        "G admission applicant baby birth boy campus century child children classroom college couple daughter education endowment enroll enrollment establishment faculty father gift girl god grade homework husband infant ivy kid live love man marriage marry math mother oxford parent professor psychologist scholar scholarship school son student study sugar taught teach teacher teaching toy tuition tutor university voucher wed wedlock woman At threshold 3.75, the origins of education (Cluster 6) and childbirth(Cluster 24) clusters are already formed.",
        "Among education, there are subtopics on scholarship school and school entrance.",
        "They are merged into Cluster 6 when the threshold is lowered to 3.5.",
        "Cluster 24 is also formed from Clusters D,E,F of threshold 3.75.",
        "Then Cluster 6 and 24 are merged into Cluster G when the threshold is",
        "Trial topic: Several clusters exist on trial in Appendix.",
        "They should form a duster with relatively lower threshold.",
        "Consequently, one of the most important future work is to integrate two stages, the first stage of malting input graph with the static threshold, and the second stage of clustering, into a single stage with dynamic threshold.",
        "lowered again to 3.25.",
        "The clusters' hierarchical relationships are shown in Figure 9.",
        "We may see that the topic is more specialized when the threshold is high.",
        "Clusters which are merged between threshold 3.75 and 3.5 were those within a topic (A,B,C or D,E,F), but topics of different clusters are merged at 3.25 (Clusters 6 and 24).",
        "Thus, the lower the threshold is, the more the cluster contains ambiguity.",
        "The reason is that the two words in different topics do not co-occur."
      ]
    },
    {
      "heading": "7 Discussion",
      "text": [
        "The best threshold differs in topics.",
        "Some examples are: Economic topic: Although Wall Street Journal articles have economic tendency, clusters of economic topic cannot be found in the clusters with more than 7 words of threshold 3.5.",
        "They appear in clusters at threshold 3.0 as follows:",
        "• accountant audit bracket deduction filer income offset tax taxpayer • convert conversion debenture debt",
        "holder outstand prefer redeem redemption repay tidewater The threshold should be lower for this topic.",
        "Medical topic: Cluster 1 have too many words.",
        "Despite of a medical cluster, potato appears in the cluster.",
        "At the threshold 3.0, Cluster 3 is completely merged with Cluster 1.",
        "The appearance of potato shows the sign that the merge of two different topic has already begun.",
        "Therefore, a higher threshold is preferred."
      ]
    },
    {
      "heading": "8 Conclusion",
      "text": [
        "We have discussed a method to cluster a co-occurrence graph obtained from a corpus, from a graph-theoretical viewpoint.",
        "A graph has no ambiguity if its branches, co-occurrence relations are transitive.",
        "This graph theoretical approach using graph is characteristic and it differs from the conventional clustering method.",
        "We proposed an algorithm to extract subgrapbs whose branches are transitive co-occurrence relations and discussed its features.",
        "The effectiveness of our method was examined using the 30M corpus."
      ]
    },
    {
      "heading": "References",
      "text": []
    },
    {
      "heading": "Appendix",
      "text": [
        "The triples are (CS, ER, UR) (See Section 6.2).",
        "Cluster 1: medicine (105, 4.8%, 5.7%) afflict cancer disease gene researcher cell hepatitis lung patient bacterium protein repair scientist therapy mice tissue virus fibrositis implant mouse vaccine antigen nicotine treat infect receptor switch' blood enzyme inject insulin molecule pill aid heart infection transplant prostate stroke symptom transmit treatment cure depression diagnose kidney trial' bone chemotherapy dose marrow ulcer cause stomach doctor breast disorder prescribe blocked clot eradicate medication sample brain nerve potato' donate plasma patch arthritis drug lithium placebo versionf test laboratory protease prevention syndrome panel schizophrenia substance tumor psychotherapy sclerosis suffer die pain physician lab urine rat radiation animal cholesterol pharmacist pharmacy collagen internist hospital prescription medicine care referralfnonprescription Cluster 2: transportation (101, 12.6%,14.6%) air surveillance missilet plane fighterf radar aircraft patriotftransport airline jet tank boat pilot serb\" trainer airliner crash engine flight fly aviation passenger bus carrier bump airport hub saudi airplane delivery surface: machinist attendant wing airway shuttle nonstop route delta fare hanoi\" walkout mechanic transportation haul denver railroad courier rail freight mile truck shipment diesel pickup minivan gasoline fuel sportf built\" midsizef assembly heat inventory detroit vehicle model oil petroleum car auto styling' emission brake cylinder sedan equip antilock omega airbag luxury bag driver jaguar dodget accident pump motor rover wheel neonf ford cherokeef rear front dealershiptexplorer plant build shreveport",
        "acre flood corn farmer grain harvest agriculture hog soybean wheat bushel crop depress' exporter feed livestock cotton rain africaf cattle farm meat brazil: july rice shipment forecastl bale frost season flakes sugar Cluster 5: Near East Asia (32, 0.0%, 0.0%) arab qatar saudi egypt kuwait israel king peace arabia bahrain gaze emirate oil jew jordan lebanon occupy fighter jerusalem Syria palestine barrel settler massacre territory kill strip cabinet liberation Jericho Cluster 6: education (31, 3.2%, 12.9%) admission scholarship school college applicant student university education professor taught teach tuition classroom faculty girl\" teacher enroll enrollment grade homework math parent campus psychologist: scholar ivy voucher: children tutor sugar' endowment Cluster 7: politics (25, 24.0, 40.0%) bidden' senate senator democrat nomination bipartisan vermont: chafe' dole inmanf maine committee subcommittee confirmation rhode\" bobt columnists judiciaryS ranking chairmen pane/ chairman hearing oversight' oregon: Cluster 8: winter sports (24, 4.2%, 12.5%) alpine race ski cup norway winter medal skate skier boat: cross kilometer sport silver snow tommyf men: athlete skater boot ice meter speed track Cluster 9: ball games (24, 16.7%, 16.7%) baseball sports basketball fan football league libertyf team pro soccer televise coach stadium star foxf cowboyf bowl conferencet franchise game hockey"
      ]
    }
  ]
}
