{
  "info": {
    "authors": [
      "Philip G. Edmonds"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P97-1067",
    "title": "Choosing the Word Most Typical in Context Using a Lexical Co-Occurrence Network",
    "url": "https://aclweb.org/anthology/P97-1067",
    "year": 1997
  },
  "references": [
    "acl-C92-2070",
    "acl-P96-1006",
    "acl-P96-1010",
    "acl-W96-0104"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper presents a partial solution to a component of the problem of lexical choice: choosing the synonym most typical, or expected, in context.",
        "We apply a new statistical approach to representing the context of a word through lexical co-occurrence networks.",
        "The implementation was trained and evaluated on a large corpus, and results show that the inclusion of second-order co-occurrence relations improves the performance of our implemented lexical choice program."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Recent work views lexical choice as the process of mapping from a set of concepts (in some representation of knowledge) to a word or phrase (Elhadad, 1992; Stede, 1996).",
        "When the same concept admits more than one le:cicalization, it is often difficult to choose which of these 'synonyms' is the most appropriate for achieving the desired pragmatic goals; but this is necessary for high-quality machine translation and natural language generation.",
        "Knowledge-based approaches to representing the potentially subtle differences between synonyms have suffered from a serious lexical acquisition bottleneck (DiMarco, Hirst, and Stede, 1993; Hirst, 1995).",
        "Statistical approaches, which have sought to explicitly represent differences between pairs of synonyms with respect to their occurrence with other specific words (Church et al., 1994), are inefficient in time and space.",
        "This paper presents a new statistical approach to modeling context that provides a preliminary solution to an important sub-problem, that of determining the near-synonym that is most typical, or expected, if any, in a given context.",
        "Although weaker than full lexical choice, because it doesn't choose the 'best' word, we believe that it is a necessary first step, because it would allow one to determine the effects of choosing a non-typical word in place of the typical word.",
        "The approach relies on a generalization of lexical co-occurrence that allows for an implicit representation of the differences between two (or more) words with respect to any actual context.",
        "For example, our implemented lexical choice program selects mistake as most typical for the 'gap' in sentence (1), and error in (2).",
        "(1) However, such a move also would run the risk of cutting deeply into U.S. economic growth, which is why some economists think it would be a big error I mistake I oversight).",
        "(2) The ( error I mistake I oversight) was magnified when the Army failed to charge the standard percentage rate for packing and handling."
      ]
    },
    {
      "heading": "2 Generalizing Lexical Co-occurrence",
      "text": []
    },
    {
      "heading": "2.1 Evidence-based Models of Context",
      "text": [
        "Evidence-based models represent context as a set of features, say words, that are observed to co-occur with, and thereby predict, a word (Yarowslcy, 1992; Golding and Schabes, 1996; Karow and Edelman, 1996; Ng and Lee, 1996).",
        "But, if we use just the context surrounding a word, we might not be able to build up a representation satisfactory to uncover the subtle differences between synonyms, because of the massive volume of text that would be required.",
        "Now, observe that even though a word might not co-occur significantly with another given word, it might nevertheless predict the use of that word if the two words are mutually related to a third word.",
        "That is, we can treat lexical co-occurrence as though it were moderately transitive.",
        "For example, in (3), learn provides evidence for task because it co-occurs (in other contexts) with difficult, which in turn co-occurs with task (in other contexts), even though learn is not seen to co-occur significantly with task.",
        "(3) The team's most urgent task was to learn whether Chernobyl would suggest any safety flaws at KWU-designed plants.",
        "So, by augmenting the contextual representation of a word with such second-order (and higher) co-occurrence relations, we stand to have greater predictive power, assuming that we assign less weight to them in accordance with their lower information content.",
        "And as our results will show, this generalization of co-occurrence is necessary.",
        "Synonyms (with training corpus frequency) difficult (352), hard (348), tough (230) error (64), mistake (61), oversight (37) job (418), task (123), duty (48) responsibility (142), commitment (122), obligation (96), burden (81) material (177), stuff (79), substance (45) give (624), provide (501), offer (302) settle (126), resolve (79)",
        "We can represent these relations in a lexical co-occurrence network, as in figure 1, that connects lexical items by just their first-order co-occurrence relations.",
        "Second-order and higher relations are then implied by transitivity."
      ]
    },
    {
      "heading": "2.2 Building Co-occurrence Networks",
      "text": [
        "We build a lexical co-occurrence network as follows: Given a root word, connect it to all the words that significantly co-occur with it in the training corpus;' then, recursively connect these words to their significant co-occurring words up to some specified depth.",
        "We use the intersection of two well-known measures of significance, mutual information scores and t-scores (Church et al., 1994), to determine if a (first-order) co-occurrence relation should be included in the network; however, we use just the t-scores in computing significance scores for all the relations.",
        "Given two words, wo and wd, in a co-occurrence relation of order d, and a shortest path P(wo5wd) = (wo5 • • 5wd) between them, the significance score is",
        "This formula ensures that significance is inversely proportional to the order of the relation.",
        "For example, in the network of figure 1, sig(task, learn) = [t(task, difficult) + it(difficult,learn)118 = 0.41.",
        "A single network can be quite large.",
        "For instance, the complete network for task (see figure 1) up to the third-order has 8998 nodes and 37,548 edges."
      ]
    },
    {
      "heading": "2.3 Choosing the Most Typical Word",
      "text": [
        "The amount of evidence that a given sentence provides for choosing a candidate word is the sum of the significance scores of each co-occurrence of the candidate with a word 'Our training corpus was the part-of-speech-tagged 1989 Wall Street Journal, which consists of N = 2,709,659 tokens.",
        "No lemmatization or sense disambiguation was done.",
        "Stop words were numbers, symbols, proper nouns, and any token with a raw frequency greater than F = 800. in the sentence.",
        "So, given a gap in a sentence S, we find the candidate c for the gap that maximizes",
        "For example, given S as sentence (3), above, and the network of figure 1, M(task,S) = 4.40.",
        "However, job (using its own network) matches best with a score of 5.52; duty places third with a score of 2.21."
      ]
    },
    {
      "heading": "3 Results and Evaluation",
      "text": [
        "To evaluate the lexical choice program, we selected several sets of near-synonyms, shown in table 1, that have low polysemy in the corpus, and that occur with similar frequencies.",
        "This is to reduce the confounding effects of lexical ambiguity.",
        "For each set, we collected all sentences from the yet-unseen 1987 Wall Street Journal (part-of-speech-tagged) that contained any of the members of the set, ignoring word sense.",
        "We replaced each occurrence by a 'gap' that the program then had to fill.",
        "We compared the 'correctness' of the choices made by our program to the baseline of always choosing the most frequent synonym according to the training corpus.",
        "But what are the 'correct' responses?",
        "Ideally, they should be chosen by a credible human informant.",
        "But regrettably, we are not in a position to undertake a study of how humans judge typical usage, so we will turn instead to a less ideal source: the authors of the Wall Street Journal.",
        "The problem is, of course, that authors aren't always typical.",
        "A particular word might occur in a 'pattern' in which another synonym was seen more often, making it the typical choice.",
        "Thus, we cannot expect perfect accuracy in this evaluation.",
        "Table 2 shows the results for all seven sets of synonyms under different versions of the program.",
        "We varied two parameters: (1) the window size used during the construction of the network: either narrow (±4 words), medium (± 10 words), or wide (± 50 words); (2) the maximum order of co-occurrence relation allowed: 1, 2, or 3.",
        "The results show that at least second-order co-occurrences are necessary to achieve better than baseline accuracy in this task; regular co-occurrence relations are insufficient.",
        "This justifies our assumption that we need",
        "more than the surrounding context to build adequate contextual representations.",
        "Also, the narrow window gives consistently higher accuracy than the other sizes.",
        "This can be explained, perhaps, by the fact that differences between near-synonyms often involve differences in short-distance collocations with neighboring words, e.g., face the task.",
        "There are two reasons why the approach doesn't do as well as an automatic approach ought to.",
        "First, as mentioned above, our method of evaluation is not ideal; it may make our results just seem poor.",
        "Perhaps our results actually show the level of 'typical usage' in the newspaper.",
        "Second, lexical ambiguity is a major problem, affecting both evaluation and the construction of the co-occurrence network.",
        "For example, in sentence (3), above, it turns out that the program uses safety as evidence for choosing job (because job safety is a frequent collocation), but this is the wrong sense of job.",
        "Syntactic and collocational red herrings can add noise too."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "We introduced the problem of choosing the most typical synonym in context, and gave a solution that relies on a generalization of lexical co-occurrence.",
        "The results show that a narrow window of training context (±4 words) works best for this task, and that at least second-order co-occurrence relations are necessary.",
        "We are planning to extend the model to account for more structure in the narrow window of context."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "For comments and advice, I thank Graeme Hirst, Eduard Hovy, and Stephen Green.",
        "This work is financially supported by the Natural Sciences and Engineering Council of Canada."
      ]
    }
  ]
}
