{
  "info": {
    "authors": [
      "Andrew Kehler",
      "Stuart M. Shieber"
    ],
    "book": "Computational Linguistics",
    "id": "acl-J97-3005",
    "title": "Anaphoric Dependencies in Ellipsis",
    "url": "https://aclweb.org/anthology/J97-3005",
    "year": 1997
  },
  "references": [
    "acl-C92-1048",
    "acl-E93-1025",
    "acl-E95-1032"
  ],
  "sections": [
    {
      "heading": "1. Introduction",
      "text": [
        "It has long been known that anaphoric relationships in the implicit meaning of an elided verb phrase depend on corresponding anaphoric relationships in the source of the ellipsis.",
        "This squib concerns what the underlying cause of this dependency is.",
        "Does it arise directly through some uniform relation between the two clauses, or does it follow indirectly from independently motivated discourse principles governing pronominal reference?",
        "Verb phrase ellipsis is exemplified by sentence (1):",
        "(1) Ivan loves his mother, and James does too.",
        "The stranded auxiliary in the second clause (henceforth, the target clause) marks a vestigial verb phrase (VP), a meaning for which is to be recovered from another clause (henceforth, the source clause), in this case, the first clause.",
        "The core phenomenon that we address concerns the space of possible readings of the target clause corresponding to the antecedent of the pronoun his in the source clause, which exhibits the following dependency.",
        "If his refers extrasententially to some third person, say Kris – that is, if the source clause is taken to mean that Ivan loves Kris's mother – then the target clause must mean that James also loves Kris's mother.",
        "That is, example (2a) only has the reading reflected by the indices shown in sentence (2b):",
        "(2) a. Ivan, loves hisk mother, and James) does too.",
        "b. Ivan, loves hisk mother, and James] loves hisk mother too.",
        "On the other hand, if the pronoun refers intrasententially to Ivan, so that the source clause is taken to mean that Ivan loves his own mother (as in example (3a)), then the target clause is ambiguous between two readings.",
        "It might mean that James loves Ivan's mother (the so-called strict reading shown in (3b)) or that James loves his own mother (the sloppy reading shown in (3c)).",
        "(3) a. Ivan1 loves his, mother, and James, does too.",
        "b. Ivan, loves his, mother, and James] loves his, mother too.",
        "c. Ivan, loves his, mother, and James) loves his] mother too.",
        "Notice that the two sets of readings are disjoint and depend crucially on the antecedent of the pronoun in the source clause.'",
        "Past approaches to recovering these readings fall into two categories, source-determined analyses and discourse-determined analyses.",
        "We describe these in the sections that follow."
      ]
    },
    {
      "heading": "2. Source-Determined Analyses",
      "text": [
        "The conventional approaches to recovering the elided property in VP ellipsis have been source-determined (Sag 1976; Williams 1977; Gawron and Peters 1990; Prtist, Scha, and van den Berg 1991; Dalrymple, Shieber, and Pereira 1991; Kehler 1993; Crouch 1995).",
        "Common to these approaches is the idea that at some level of representation (surface syntactic, deep syntactic, or semantic) the anaphoric relationships for the source are marked, and that the target is interpreted as if it were constructed with relationships determined in some uniform manner by those of the source clause at that level of representation.",
        "In this paper, we will use the equational analysis of Dalrymple, Shieber, and Pereira (1991, henceforth DsP) as the exemplar of these approaches.",
        "In this account, the uniformity is specified by the solving of a certain equation in which, roughly speaking, the meaning of the source sentence as a whole is equated with the meaning of the target VP as applied to the meanings of the elements in the source that are parallel to overt elements in the target.",
        "For sentence (2a), this identity is captured by equation (4a), which under suitable assumptions has one solution for the meaning P of the elided VP, namely that in (4b).",
        "For sentence (3a), this identity is captured by equation (4c), which under suitable assumptions has two solutions for the meaning P of the elided VP, namely those in (4d) and (4e).",
        "In the equational account, the dependency between anaphoric relationships in source and target follows immediately from the mechanism used for constructing and solving the equations.",
        "More generally for source-determined analyses, the dependency follows from the method for determining anaphoric or coreference relationships in the target uniformly from those in the source.",
        "As noted by DSP, the equational analysis applies not only to VP ellipsis but also to the recovery of predicates for interpreting other forms such as do it and do so anaphora, gapping, stripping, and related constructions.",
        "These constructions form a natural class of expressions whose use is licensed by a predicate being available, or given, in context.'",
        "One can think of the equational analysis, then, as a source-determined method for computing the given predicates made available by a clause in a discourse."
      ]
    },
    {
      "heading": "3. Discourse-Determined Analyses",
      "text": [
        "Recently, an alternative type of approach to ellipsis resolution has been posited.",
        "In these discourse-determined analyses (Kitagawa 1991; Hardt 1991a, 1991b, 1992b, 1992a, 1993), the anaphoric relationships in the target are not derived directly from those in the source, but rather, are determined independently.",
        "They are, however, determined exactly as those in the source are determined, by appeal to discourse principles and pragmatics governing ordinary pronominal reference.",
        "Typically, material from the source sentence (syntactic in Kitagawa's analysis and semantic in Hardt's analysis), including representations for any pronouns in the source, is copied to the target sentence devoid of information about the reference or antecedents of the pronouns.",
        "Antecedents for the copied pronouns are then derived independently based on the operative discourse context.",
        "The dependency between the source and target ostensibly follows from the similarity of discourse state typically (but contingently) in force for the interpretation of source and target clauses, in light of the effects that the an-tecedency relationships in the source have on the discourse state under which the target is interpreted.",
        "In these discourse-determined accounts, much remains unsaid about the particulars of the discourse theory assumed.",
        "Nonetheless, an explicit theory of discourse is not necessarily required to test the predictions of a discourse-determined analysis.",
        "We can merely make use of our native intuitions concerning the felicity of discourses not containing ellipsis.",
        "Such intuitions, we may assume, should follow from an optimal theory of discourse processing, and we may use them as a proxy for that theory.'",
        "For instance, consider again sentence (1), embedded in a context to favor Kris as the antecedent of his in the source clause:",
        "(5) Kris has a wonderful family.",
        "Ivan loves his mother, and James does too.",
        "Whatever factors contribute to Kris being interpreted as the antecedent of the overt his, together with the effect this reference itself may have on the discourse state, would affect the interpretation of the variable in the elided property as well.",
        "This can be seen by examining the unelided counterpart of this sentence pair:",
        "(6) Kris has a wonderful family.",
        "Ivan loves his mother, and James loves his",
        "mother too.",
        "Assuming that the middle clause in example (6) is taken to mean that Ivan loves Kris's mother, it is infelicitous to interpret the final clause as meaning either that James loves Ivan's mother or that James loves James's mother.",
        "We may presume a full theory of discourse would predict this fact, and whatever theory that is could then be used to predict the lack of the similar reading for the elliptical version (5).",
        "Likewise, the correct predictions for the strict and sloppy interpretations of example (3a) seemingly result from a discourse-determined analysis.",
        "Assuming that his in the source is coreferential with Ivan, the unelided counterpart of example (3a) apparently displays an identical ambiguity:",
        "(7) Ivan, loves his mother, and James loves his mother too.",
        "Both Ivan and James are salient enough that the referent of his in the target is ambiguous in exactly the manner required to yield both the strict and sloppy interpretations.",
        "To summarize thus far, a purely discourse-determined analysis predicts that a sentence with ellipsis should display the same readings in a given context that the unelided form would in the same context.",
        "Examples such as those above appear to demonstrate that a discourse-determined theory may account for at least some cases of dependencies between anaphoric relationships in source and target clauses."
      ]
    },
    {
      "heading": "4. Analysis of Discourse-Determined Analyses",
      "text": [
        "In order to counterexemplify a discourse-determined analysis, it would suffice to provide an elliptical sentence whose pronominal reference possibilities are different for its corresponding unelided form.",
        "Some care must be taken in clearly defining what is meant by \"corresponding unelided form,\" in particular, with respect to whether or not any of the deleted elements in the elided form can receive accent in the unelided form.",
        "Though the issue should not be prejudged, it would be reasonable to disallow such accent, as an elided VP by its very nature has no possibility for exhibiting accent.",
        "By examining pairs of elided and unelided forms, we will show that, at a minimum, discourse-determined analyses must make this accent restriction; otherwise, sentence pairs that counterexemplify them can be constructed.",
        "We are forced to a view that discourse-determined analyses must reduce the issue of VP ellipsis meaning to deaccented VP meaning.",
        "We will then argue that this is not so much a discovery, as a restatement of the problem."
      ]
    },
    {
      "heading": "4.1 Accent and Sloppiness",
      "text": [
        "In general, discourse principles for normal pronominal reference are more flexible than is consistent with the reference behavior exhibited by elliptical reconstructions because, for instance, overt pronouns allow for accent and accompanying deictic gestures.",
        "Consider example (8), but with exaggerated accent on the second pronoun and simultaneous pointing to, say, Kris.",
        "(8) Ivan, loves his, mother, and James] loves HISk mother.",
        "Such extra accent and deictic gesturing are capable of forcing a reading in which the second pronoun refers to Kris, not Ivan or James.",
        "However, as discussed in Section 1, its elliptical counterpart has no such reading.",
        "We would then have to require, as Hardt's account in fact does, that the discourse principles be applied as if no strong accent or deictic gestures were applied.",
        "Furthermore, allowing even light accent in the unelided form is enough to falsify a discourse-determined analysis.",
        "For example, consider the nonelliptical example (9a).",
        "This sequence of sentences is felicitous under the anaphoric relationships indicated, when the target clause pronoun is given even light accent.",
        "Its elliptical counterpart (9b), however, cannot be taken as having the meaning of (9a).4",
        "(9) a. Mike Tyson will always be considered one of the greats of pro",
        "fessional boxing.",
        "After one round with Spinks,, Tyson, beat him,.",
        "Now people think that no one can beat himj.",
        "Kehler and Shieber Anaphoric Dependencies in Ellipsis b.",
        "# Mike Tyson will always be considered one of the greats of professional boxing.",
        "After one round with Spinks,, Tysonj beat him,.",
        "Now people think that no one can.",
        "Example (9) demonstrates that pronouns within copied VPs are not as free to seek extrasentential referents as their unelided VP counterparts.",
        "Example (10), a variant of an example that Hardt (1992a) provides to argue against source-determined analyses (see Section 5.1), shows that this is also the case for intrasentential referents.",
        "The reading where Mary asked out Bob at Bob's party, while readily available with light accent on the pronoun in example (10a), is not available in its elided counterpart (10b).",
        "(10) a.",
        "Every boy, was hoping that Mary would ask him, out, but the waiting is over.",
        "Last night at Bob'sj party, she asked himj out.",
        "b.",
        "# Every boy, was hoping that Mary would ask him, out, but the waiting is over.",
        "Last night at Bob'sj party, she did.",
        "Rooth (1993) gives a similar example, shown in (11a-b).",
        "(11) a. John,'s coach thinks he, has a chance, and Jamesj thinks hej has a chance too.",
        "b.",
        "# John,'s coach thinks he, has a chance, and Jamesj does too.",
        "Rooth claims that whereas the unelided form in example (11a), even without accent, gives rise to a sloppy reading, the elided form in example (11b) does not.",
        "However, like the cases discussed above, some speakers find the target clause pronoun in example (11a) to require light accent under this interpretation.",
        "These examples serve to further restrict the assumptions needed to support a discourse-determined approach – elided VPs exhibit the discourse behavior of deac-cented VPs.",
        "Making this (quite reasonable) assumption, discourse-determined analyses are to be seen as reducing VP ellipsis not to general discourse principles for pronominal reference (as they generally have been presented), but to a more specific construction."
      ]
    },
    {
      "heading": "4.2 Deaccented VP Behavior",
      "text": [
        "Recall from Section 2 that VP ellipsis, do it, do that, do so, and related constructions form a natural class of expressions.",
        "Although these forms differ with respect to their syntactic and some of their referential properties, all have one property in common: their meaning depends on information that is given in, and therefore recoverable from, the existing discourse state.",
        "Consequently, all exhibit the same range of strict and sloppy readings.",
        "Deaccenting is also a well-established indicator that material is given information in the discourse (Terken and Nooteboom 1987, inter alia), and therefore it falls in this same class.",
        "As with the various forms of event reference, a VP thus requires an \"antecedent\" to license deaccenting that either exists in the discourse or is inferrable from it.'",
        "In essence, to be tenable, discourse-determined analyses must reduce the problem of recovery of given predicates licensing VP ellipsis to the very same problem, namely, recovery of given predicates licensing the corresponding deaccented VPs.",
        "The theory that discourse-determined analyses rely on (but do not themselves provide) is one that provides the possible binders for reconstructed pronouns in VPs that specify predicates that are given in the discourse.",
        "This is just the theory that source-determined analyses can be seen as providing.6"
      ]
    },
    {
      "heading": "5. Arguments against Source-Determined Analyses",
      "text": [
        "In large part, the reason that researchers have proposed moving to a discourse-determined analysis of VP ellipsis is to attempt to account for examples that may appear problematic for source-determined analyses.",
        "Although we have seen that discourse-determined analyses by themselves cannot account for any examples at all – they beg the very question they seek to answer – it is still worthwhile to look at those examples that may be problematic for source-determined analyses.",
        "In this section, we present four classes of examples.",
        "The first three have been previously put forward as problematic for source-determined analyses by Hardt (two classes) and by Kitagawa.",
        "The last is novel to this work.",
        "We will show that of these, only the latter two in fact incriminate source-determined analyses as such."
      ]
    },
    {
      "heading": "5.1 Arguments on the Basis of Switching Reference",
      "text": [
        "Hardt presents two related arguments to \"[indicate] that no syntactic or logical form theory can account for the facts of VP ellipsis.\" (Hardt, 1991a,25) First, he points out examples in which pronouns \"switch reference from antecedent to target\"; in our terminology, the standard dependency between anaphoric relationships in source and target does not hold.",
        "This switching of reference is a capability that Hardt claims discourse-determined analyses permit but source-determined analyses do not.7 unelided version to obtain a sloppy reading, then Rooth's original characterization of the two constructions as equivalent may be maintained, and the example would provide evidence, as we have allowed, for requiring discourse-determined analyses to reduce VP ellipsis to the deaccented VP construction.",
        "Similar arguments hold for the earlier examples.",
        "Tancredi (1992) states that \"identical restrictions [on strict and sloppy readings in VP ellipsis] appear in contexts in which a VP has been deaccented but not deleted\" (p. 3), and presents a source-determined account of deaccenting in which VP ellipsis is handled as a subcase.",
        "However, he claims erroneously that the DSP account cannot be applied more generally to cases of deaccenting, because these cases are \"lacking an empty VP to assign some interpretation to\" (p. 26).",
        "Though many source-determined analyses generate meanings for elliptical clauses by assigning meanings to an elided VP, the DSP analysis does not.",
        "The misconception is a common one; another example is discussed in footnote 9.",
        "As noted earlier, the phenomena that DSP address include do so and do it anaphora, and, like deaccented VPs, these forms lack an empty VP.",
        "Tancredi misses the generalization in which the DSP analysis is viewed as a mechanism for computing the predicates that a clause makes given in the discourse, rather than simply as a method for resolving VP ellipsis.",
        "While deaccented VPs are in fact more flexible than these other forms in the extent to which their antecedents can be inferred from existing given predicates, all of the forms in question have similar requirements for the resulting antecedent that licenses their use.",
        "6 One result that we would expect a theory of determining given predicates to provide is a mechanism for deciding when a pronoun in an overt VP needs to receive accent.",
        "Note that source-determined analyses provide such a mechanism, whereas discourse-determined analyses do not.",
        "7 He does note, however, the source-determined analysis of Prtist, Scha, and van den Berg (1991), who had previously presented and accounted for examples like these, such as (i), their (21).",
        "(i) Everyone told a man that Mary likes him, and everyone told a boy that Suzy does.",
        "Sentence (12a) is adapted from a central example that Hardt gives (example (2) in Hardt [1992a1), which has a preferred reading that can be paraphrased as (12b).8",
        "(12) a. John hoped Mary would ask him out, but Bill actually knew that",
        "she would.",
        "b. John, hoped Maryk would ask him, out, but Bill1 actually knew that shek would ask him, out.",
        "Note that relative to the anaphoric relationships in the portion of the source clause \"Mary would ask him, out\", the relationships in the corresponding target clause \"shek would ask him] out\" involve \"switching reference\" of him from i to j. Hardt claims that (what we are calling) a source-determined account cannot model this switching of reference, because the sloppy reading cannot be generated assuming that only Mary and she are parallel elements.",
        "Of course, this particular choice of parallelism between the two clauses is not the only one, nor is it the most natural one.",
        "While the elements John and Bill are not within the minimal clauses, they are parallel within the main clauses.",
        "By recognizing the full parallelism, as manifested in the equation askout(mary, john) = P(john,mary), the equational analysis straightforwardly generates the sloppy reading.'",
        "Viewed in light of the parallelism between the main clause subjects, the sentence does not involve \"switching of reference\" any more than any other sloppy reading of an elliptical clause does.",
        "Thus, while examples such as (12) were not directly addressed in work on the equational method, their analysis within the framework is straightforward."
      ]
    },
    {
      "heading": "5.2 Arguments on the Basis of Switching Reference with Structural Nonidentity",
      "text": [
        "Hardt presents further examples, such as (13), of \"switching reference\" in which the source and target are structurally different.",
        "(13) Every boy in Mrs. Smith's class hoped she would pass him.",
        "In John's",
        "case, I think she will.",
        "Hardt argues, again, that an approach predicated on determining parallelism between source and target would be unable to account for the natural reading of this sentence.",
        "Of course, the approach of DSP does not require syntactic parallelism in setting up the equation for resolving ellipsis; many examples of nonsyntactic parallelisms are provided in that work.",
        "(See especially their Section 5.1.1.)",
        "Thus, the parallelism argument, per se, does not distinguish a source-determined analysis such as the equational analysis from a discourse-determined analysis.",
        "Nonetheless, it is our sense that something quite different is happening in this particular case.",
        "The preposed phrase in John's case serves a special function here, in a 8 To simplify the discussion, the quantifiers in Hardt's original example have been replaced by proper nouns.",
        "The arguments apply to this example just as well.",
        "9 Hardt may be alluding to this when he says that \"an extended notion of parallelism might solve the problem\" (Hardt, 1992a, p. 307).",
        "In later work (Hardt 1993), he notes that the absence of this reading \"assumes that the parallel elements are the subject of the antecedent VP and the elliptical VP, although this is not required in the equational approach\" (p. 67).",
        "However, he states that allowing other parallel elements \"would represent a radical departure for the equational approach, since the solution to the equation would no longer represent merely the elided material\" (p. 67).",
        "As it has never been possible to construe the solutions of ellipsis equations as representing merely the elided material (see, for instance, the solution to example (30b) given by nsP), it is not clear why this would constitute a \"departure,\" much less a radical one.",
        "way that the prepositional phrase at Bob's party in sentence (10b) does not.",
        "Specifically, like phrases such as regarding John, as for John, and with respect to John, the phrase in John's case crucially depends on context for its interpretation.",
        "It refers to a previously evoked state or event, meant to exemplify or contrast John with respect to some other parallel object or group of objects (in this case, every other boy in Mrs. Smith's class).",
        "Therefore, before the ellipsis is resolved, the meaning of in John's case must be resolved.",
        "This resolution results in a (non-asserted) representation for John] hoped she would pass him], which serves as the source for the subsequent ellipsis, on analogy with cases of cascaded ellipsis discussed by DSP, Section 3.3.",
        "The meaning of the target of sentence",
        "(13) is then simply the strict reading, derivable by source-determined algorithms.",
        "The example is thus not a counterexample for source-determined approaches.",
        "We should note that while the parallel elements for the ellipsis resolution are determinable from semantic role parallelism, the process of identifying the parallel elements in resolving an expression like in John's case is clearly a pragmatic one."
      ]
    },
    {
      "heading": "5.3 Arguments on the Basis of Multiple Parallel Elements",
      "text": [
        "There are other cases that do appear to be problematic for source-determined analyses proposed to date.",
        "Example (14) is adapted from one cited by Kitagawa (1991).",
        "(14) John told Mary to hand in his paper before Bill does.",
        "Some (although not all) speakers find the sloppy reading, in which Bill hands in his own paper, to be acceptable.",
        "As we would expect, the unelided version shown in (15) also appears to allow this reading without requiring any accent on the target pronoun.",
        "(15) John told Mary to hand in his paper before Bill hands in his paper.",
        "Assuming example (14) has this reading, it appears that the source clause makes available the necessary relation to license either the deaccenting or the eliding of the VP in the target.",
        "This would be problematic for most source-determined analyses because recovering this relation necessitates that Bill be parallel to both John and Mary, a possible but unattractive prospect."
      ]
    },
    {
      "heading": "5.4 Arguments on the Basis of Parallelism in Coordinate Structures",
      "text": [
        "Finally, we note an additional problematic case that to our knowledge has gone unnoticed in the literature.",
        "The case involves coordination, in which the coordinated constituents each contain a pronoun, as in example (16).",
        "(16) Ivan likes his1 mother and his, father, and Jamesj does too.",
        "Sentence (16) has the two readings corresponding to whether James likes Ivan's mother and father or his own mother and father.",
        "However, current source-determined analyses predict four readings, also including the two in which James likes one of Ivan's parents and one of his own parents.",
        "That is, the readings in which the pronouns in the two coordinated constituents refer to different entities are derivable, but do not exist for example (16).",
        "As expected, only the first two of these readings are available for the unelided version of sentence (16), shown in example (17), again assuming that the VP is deaccented.",
        "his father too.",
        "How such examples are to be handled within source-determined analyses is a subject for future study."
      ]
    },
    {
      "heading": "6. Summary",
      "text": [
        "Although problematic examples for a source-determined analysis of VP ellipsis can be found, these do not provide an argument for moving to a discourse-determined analysis.",
        "Indeed, it is the thesis of this paper that discourse-determined analyses are not alternatives to source-determined analyses, but rather, are dependent on them.",
        "As such, they do not contribute to our understanding of the possible range of meanings of elliptical verb phrases.",
        "What these examples do show is the need to refine source-determined analyses in deriving the predicates that clauses make available in the discourse."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": []
    }
  ]
}
