{
  "info": {
    "authors": [
      "Emer Gilmartin",
      "Francesca Bonin",
      "Carl Vogel",
      "Nick Campbell"
    ],
    "book": "SIGDIAL",
    "id": "acl-W13-4045",
    "title": "Laugher and Topic Transition in Multiparty Conversation",
    "url": "https://aclweb.org/anthology/W13-4045",
    "year": 2013
  },
  "references": [
    "acl-J97-1005"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This study explores laughter distribution around topic changes in multiparty conversations.",
        "The distribution of shared and solo laughter around topic changes was examined in corpora containing two types of spoken interaction; meetings and informal conversation.",
        "Shared laughter was significantly more frequent in the 15 seconds leading up to topic change in the informal conversations.",
        "A sample of informal conversations was then analysed by hand to gain further insight into links between laughter and topic change."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Human spoken interaction comprises a bundle of signals and cues, together and separately providing information relevant to the topic or task at hand, and serving to build or maintain social bonds.",
        "Dialogue is multifunctional, serving social as well as information transfer goals.",
        "Laughter is predominantly social rather than a solo activity, is universally present in humans, part of the ?universal human vocabulary?, innate, instinctual, and inherited from primate ancestors (Provine, 2004; Glenn, 2003).",
        "In conversation, it predominantly punctuates rather than interrupts speech.",
        "Accounts of laughter's role range from response to humour to a social cohesion or bonding mechanism used since our primate days.",
        "It has been suggested that laughter is often a cooperative mechanism which can provide clues to dialogue structure (Holt, 2011).",
        "Herein, we investigate the relevance of laughter to topic change by analysing two corpora of conversational speech in terms of temporal distribution of laughter, first through statistical analysis of laughter and topic change distribution, then by manual study of an hour of spontaneous conversation."
      ]
    },
    {
      "heading": "2 Laughter and Topic Change",
      "text": [
        "Conversation analysis has highlighted connections between laughter and topic change; many conversations in the Holt corpus of mostly two person telephone dialogues include laughter at topic closings (Holt, 2010).",
        "Laughter has been linked to topic closure in situations where one participant produces jokes or laughs, thus inviting others to join in, with this invitation open to refusal if interlocutors continue speaking on the topic at hand (Jefferson, 1979).",
        "Holt (2010) suggests that laughter may arise at topic changes because turns consisting only of laughter are backwards looking, not adding to the last topic, and thus constituting a signal that the current topic has been exhausted and that the conversation is at a topic change relevant point.",
        "We hypothesise that these laughter turns form a ?buffer?",
        "allowing participants a reassuring moment of social bonding.",
        "In a meeting, there is a set agenda, a chairperson, and protocols for moving from topic to topic.",
        "In social dialogue, the goal is to pass time together, and topics are not lined up ready for use.",
        "Aversion to potentially embarrassing silence may be more pertinent in informal conversation; thus laughter preceding topic change may be more likely in informal dialogue.",
        "Although there is much mention of laughter in conversation analysis, it is difficult to find quantitative data on its distribution in spoken interaction.",
        "Previous work (Bonin et al., 2012b) established that laughter, particularly shared laughter, is less likely to occur in the first quarter of a topic than in the final quarter, and that this distinction is greater in so",
        "cial conversation.",
        "In this work we test the hypothesis that laughter should be frequently found before rather than simply around topic changes.",
        "We examine the frequency of laughter within a range of distances from either side of a topic change, to investigate if there is a period of higher laughter frequency independent of topic length.",
        "We are also interested in exploring whether the turns leading to topic change follow the observations on topic change sequences and laughter distribution in two party conversations in the literature.",
        "If there are identifiable sequences involving laughter leading to topic change, knowledge of their architecture will aid in creating algorithms for discourse recognition and segmentation in multiparty conversation.",
        "The notion of topic in discourse has been studied extensively but a concise definition is difficult to find.",
        "Topic has been described at sentence level (Lambrecht, 1996), at discourse level (Van Dijk, 1981); as a manifestation of speakers intentions (Passonneau and Litman, 1997), and as coherent segments of discourse about the same thing (Van Dijk, 1996).",
        "Here, we consider topic at discourse level as a chunk of coherent content."
      ]
    },
    {
      "heading": "3 Corpora",
      "text": [
        "We analysed two datasets to cover free natural interaction and more structured meetings."
      ]
    },
    {
      "heading": "3.1 Topic annotation in TableTalk and AMI",
      "text": [
        "Both TableTalk and AMI have topic annotations freely available.",
        "TableTalk topics were annotated manually by two labellers at a single level; AMI annotations include top-level or core topics whose content reflects the main meeting structure, and subtopics for small digressions inside the core topics.",
        "Here we use the core topic segmentation which is more in line with the TableTalk annotation."
      ]
    },
    {
      "heading": "3.2 TableTalk",
      "text": [
        "The TableTalk corpus contains multimodal recordings of free flowing natural conversations among five participants, recorded at the Advanced Telecommunication Research Labs in Japan (Campbell, 2009).",
        "In order to collect as natural data as possible, neither topics of discussion nor activities were restricted in advance.",
        "Three sessions were recorded over three consecutive days in an informal setting over coffee, by three female (Australian, Finnish, and Japanese) and two male (Belgian and British) participants (Jokinen, 2009).",
        "The conversations are fully transcribed and segmented for topic, and also annotated for affective state of participants and for gesture and postural communicative functions using MUMIN (Allwood et al., 2007).",
        "Table-talk has been analyzed in terms of engagement and laughter (Bonin et al., 2012a) and lexical accommodation (Vogel and Behan, 2012).",
        "Our analyses used transcripts of the entire corpus: about 3h 30, 31523 tokens and 5980 turns.",
        "Laughter was transcribed in intervals on the speech transcription tier as @w, (unless inserted as part of a longer utterance).",
        "The total number of laughs is 713.",
        "Shared laughter was automatically annotated as described in ?4."
      ]
    },
    {
      "heading": "3.3 AMI",
      "text": [
        "The AMI (Augmented Multi-party Interaction) Meeting Corpus is a multimodal data set of 100 hours of meeting recordings (McCowan et al., 2005).",
        "The corpus contains real and scenario-driven meetings.",
        "We base our analysis on the scenario based meetings, with a total of 717,239 tokens.",
        "Each meeting has four participants, and the same subjects meet over four different sessions to discuss a design project.",
        "The sessions correspond to four different project steps (Project kick-off meeting, Functional Design, Conceptual Design and Detailed Design).",
        "Each participant is given a role to play (project manager, marketing expert, industrial designer and user interface designer) and keeps this role until the end of the scenario.",
        "Conversations are all in English, with 91 native speakers and 96 non-native speakers participating.",
        "There are 11,277 instances of laughter, annotated in the transcripts as vocal-sounds/laugh.",
        "About 25% of these laughs are annotated with start time only."
      ]
    },
    {
      "heading": "4 Analytical methodologies",
      "text": []
    },
    {
      "heading": "4.1 Automated and manual analyses",
      "text": [
        "Both corpora were also analysed automatically, and a one-hour sample of the TableTalk corpus was analysed on a case-by-case basis to investigate if laughter around topic change did indeed follow the patterns proposed in the literature.",
        "For the initial stages of ongoing manual analysis",
        "to gain more insight into the mechanisms underlying laughter and topic change, a one-hour stretch of conversation from the second day of the TableTalk was selected for study.",
        "The mechanism outlined by Holt, based on Jefferson's work on laughter and Schegloff's topic final sequences (Schegloff, 2007), hinges on whether a laughter invitation is taken up an interlocutor in two party dialogue.",
        "If it is, then one or more laughter turns ensue and the likelihood of topic change is high.",
        "The opposite occurs when the interlocutor does not take up the invitation but rather continues with further talk on the topic, averting topic change.",
        "We were interested in observing if this phenomenon occurred in multiparty conversation, and if subsequent topic change was dependent on how many of the group took up the invitation to laugh.",
        "As analysis of the two corpora showed higher likelihood of laughter before topic change in more informal conversation, we chose to examine a sample of TableTalk for preliminary study.",
        "This sample contained 1834 utterances, 36 T-event or topic change instants, and 329 laughs among the five participants, of which 76 were solo while the remainder contributed to a total of 68 shared laugh events, all of which were manually annotated on separate laughter tiers.",
        "For each instance of laughter, we also annotated the number of participants who laughed and the distance from the laughter to the next topic commencement."
      ]
    },
    {
      "heading": "4.2 Temporal definitions and measurement",
      "text": [
        "We use an algorithm resulting from earlier work to annotate shared and solo laughter.",
        "The algorithm was motivated by the observation that in both corpora laughter was sometimes annotated with start time only, and also that laughter in response to the same stimulus should be considered shared laughter.",
        "These two factors taken together allow us to recover shared laughter that may be missed if we simply count overlapping laughs of distinct speakers.",
        "The algorithm defines shared laughter as: (a) overlapping laughs of distinct speakers; or (b) consecutive laughs of distinct speakers within distance ?.",
        "We calculate ?",
        "using the probability distribution that successive laughs with observation of start time only are part of a shared laugh event, trained on a subset of overlapping laughs from the corpora.",
        "Topic changes (T-events) are the annotated time points where topic shifts in conversation.",
        "We counted the frequency of laughter, shared laughter, and solo laughter into 5-second bins at T-event minus multiples of 5 seconds (T-5, T-10, T-15, T-20) in order to look at the laughter trend near topic termination.",
        "A meaningful threshold emerges (T-15 seconds) where a change in the laughter trend is visible.",
        "Hence we counted the frequency of laughter between T-15 and T, and T and T+15."
      ]
    },
    {
      "heading": "5 Results",
      "text": []
    },
    {
      "heading": "5.1 Automated processing",
      "text": [
        "We counted the frequency of laughter, shared laughter, and solo laughter in 5-second bins at T-event time T minus multiples of 5 seconds (T-5, T-10, T-15, T-20).",
        "Fig.",
        "1 shows the mean frequency of laughs per bin in TableTalk.",
        "While in AMI the distribution over the bins does not show significant trends, in TableTalk, we noticed a significant change at T15.1 Hence we take T-15 as a rational threshold marking some change in the laughter distribution before a topic boundary in informal chat.",
        "Then we analyzed the frequency of laughter between T-15 and T (we call this segment wt) and T+15 (wb).",
        "As shown in Fig. 2, we notice a significant difference in the amount of both shared and solo laughter between topic terminations (wt) and topic beginnings (wb).",
        "In particular topic terminations show a higher frequency of laughter than topic beginnings.",
        "The result holds in AMI and in TableTalk."
      ]
    },
    {
      "heading": "5.2 Manual processing",
      "text": [
        "The first observation from the manual analysis is that the shared/solo laugh ratio is heavily skewed towards shared laughter (253 laughs were shared vs 79 solo).",
        "Laughs were combined into laugh events according to the number of participants involved.",
        "The length of laugh events was significantly shorter for",
        "15 are significantly greater than random samples of 5 sec.",
        "conversation slices (Wilcox directed test, p < 0.002); the counts for T-20 are not significantly greater than random slices.",
        "Further, the counts for T-20 are significantly less than those in each of T-15 (p < 0.02), T-10 (p < 0.02) and T-5 (p < 0.005), while the pairwise differences among T-15, T-10 and T-5 are not sign-ficant.",
        "We conclude that T-15 contains an inflection point."
      ]
    },
    {
      "heading": "TableTalk",
      "text": [
        "laughers in a laugh event, seen in Fig. 4, showed significant negative correlation (p < 0.05)."
      ]
    },
    {
      "heading": "6 Discussion and Conclusion",
      "text": [
        "Our results indicate a likelihood of shared laugher appearing in the final 15 seconds before a new topic commences.",
        "This is in line with the literature which reports laughter at topic transition relevant places, and thus before a topic change.",
        "We have also seen that the number of people sharing laughter is related to reducing distance from the laughter to the next topic change, and that laugh events are longer",
        "as more participants join in.",
        "Models of a complexity adequate to predict human behaviour require exhaustively detailed analysis of stretches of conversation in addition to broad statistical analysis.",
        "Our combination of approaches has proven fruitful.",
        "Several observations from the preliminary close examination of the TableTalk data provide fruit for further research.",
        "Many of the short solo laughs may be seen as responses to one's own or another participant's content, while stronger solo laughs may tend to invite longer and stronger laughter from others, leading to topic change possibilities.",
        "An acoustic analysis of the laughter will investigate this.",
        "We also observed that shared laughter among several participants which did not result in topic change were frequently interpretable as attempts to draw an ongoing topic to a close.",
        "This merits investigation to see whether these laugh events can be considered topic transition relevant places.",
        "Analysis of speaker changes and turn retrieval in and around these laughter events is underway to model these events."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work is supported by the Innovation Bursary of Trinity College Dublin, the Speech Communication Lab at TCD, and by the SFI FastNet project 09/IN.1/1263.",
        "We are grateful to the anonymous reviewers for helpful feedback."
      ]
    }
  ]
}
