{
  "info": {
    "authors": [
      "Bridget McInnes",
      "Ted Pedersen",
      "Serguei Pakhomov",
      "Ying Liu",
      "Genevieve Melton-Meaux"
    ],
    "book": "NAACL",
    "id": "acl-N13-3007",
    "title": "UMLS::Similarity: Measuring the Relatedness and Similarity of Biomedical Concepts",
    "url": "https://aclweb.org/anthology/N13-3007",
    "year": 2013
  },
  "references": [
    "acl-N04-3012",
    "acl-P94-1019",
    "acl-W06-2501"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the NAACL HLT 2013 Demonstration Session, pages 28?31, Atlanta, Georgia, 10-12 June 2013. c?2013 Association for Computational Linguistics UMLS::Similarity: Measuring the Relatedness and Similarity of Biomedical Concepts Bridget T. McInnes?",
        "& Ying Liu"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "UMLS::Similarity is freely available open source software that allows a user to measure the semantic similarity or relatedness of biomedical terms found in the Unified Medical Language System (UMLS).",
        "It is written in Perl and can be used via a command line interface, an API, or a Web interface."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "UMLS::Similarity1 implements a number of semantic similarity and relatedness measures that are based on the structure and content of the Unified Medical Language System.",
        "The UMLS is a data warehouse that provides a unified view of many medical terminologies, ontologies and other lexical resources, and is also freely available from the National Library of"
      ]
    },
    {
      "heading": "Medicine.2",
      "text": [
        "Measures of semantic similarity quantify the degree to which two terms are similar based on their proximity in an is-a hierarchy.",
        "These measures are often based on the distance between the two concepts and their common ancestor.",
        "For example, lung disease and Goodpasture's Syndrome share the concept disease as a common ancestor.",
        "Or in general English, scalpel and switchblade would be considered very similar since both are nearby descendents of the concept knife.",
        "However, concepts that are not technically similar can still be very closely related.",
        "For example, Good-pasture's Syndrome and Doxycycline are not similar",
        "since they do not have a nearby common ancestor, but they are very closely related since Doxycycline is a possible treatment for Goodpasture's Syndrome.",
        "A more general example might be elbow and arm, while they are not similar, an elbow is a part-of an arm and is therefore very closely related.",
        "Measures of relatedness quantify these types of relationships by using information beyond that which is found in an is-a hierarchy, which the UMLS contains in abundance."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Measures of semantic similarity and relatedness have been used in a number of different biomedical and clinical applications.",
        "Early work relied on the Gene Ontology (GO)3, which is a hierarchy of terms used to describe genomic information.",
        "For example, (Lord et al., 2003) measured the similarity of gene sequence data and used this in an application for conducting semantic searches of textual resources.",
        "(Guo et al., 2006) used semantic similarity measures to identify direct and indirect protein interactions within human regulatory pathways.",
        "(Ne?ve?ol et al., 2006) used semantic similarity measures based on MeSH (Medical Subject Headings)4 to evaluate automatic indexing of biomedical articles by measuring the similarity between their recommended terms and the gold standard index terms.",
        "UMLS::Similarity was first released in 2009, and since that time has been used in various different applications.",
        "(Sahay and Ram, 2010) used it in a",
        "health information search and recommendation system.",
        "(Zhang et al., 2011) used the measures to identify redundancy within clinical records, while (Mathur and Dinakarpandian, 2011) used them to help identify similar diseases.",
        "UMLS::Similarity has also enabled the development and evaluation of new measures by allowing them to be compared to existing methods, e.g., (Pivovarov and Elhadad, 2012).",
        "Finally, UMLS::Similarity can serve as a building block in other NLP systems, for example UMLS::SenseRelate (McInnes et al., 2011) is a word sense disambiguation system for medical text based on semantic similarity and relatedness."
      ]
    },
    {
      "heading": "3 UMLS::Similarity",
      "text": [
        "UMLS::Similarity is a descendent of Word-Net::Similarity (Pedersen et al., 2004), which implements various measures of similarity and relatedness for WordNet.5 However, the structure, nature, and size of the UMLS is quite different from WordNet, and the adaptations from WordNet were not always straightforward.",
        "One very significant difference, for example, is that the UMLS is stored in a MySQL database while WordNet has its own customized storage format.",
        "As a result, the core of UMLS::Similarity is different and offers a great deal of functionality specific to the UMLS.",
        "Table 1 lists the measures currently provided in UMLS::Similarity (as of version 1.27).",
        "The Web interface provides a subset of the functionality offered by the API and command line interface, and allows a user to utilize UMLS::Similarity without requiring the installation of the UMLS (which is an admittedly time?consuming process)."
      ]
    },
    {
      "heading": "4 Unified Medical Language System",
      "text": [
        "The UMLS is a data warehouse that includes over 100 different biomedical and clinical data resources.",
        "One of the largest individual sources is the Systematized Nomenclature of Medicine?Clinical Terms (SNOMED CT), a comprehensive terminology created for the electronic exchange of clinical health information.",
        "Perhaps the most fine?grained source is the Foundational Model of Anatomy (FMA), an ontology created for biomedical and clinical research.",
        "One of the most popular sources is MeSH (MSH), a",
        "terminology that is used for indexing medical journal articles in PubMed.",
        "These many different resources are semi-automatically combined into the Metathesaurus, which provides a unified view of nearly 3,000,000 different concepts.",
        "This is very important since the same concept can exist in multiple different sources.",
        "For example, the concept Autonomic nerve exists in both SNOMED CT and FMA.",
        "The Metathesaurus assigns synonymous concepts from multiple sources a single Concept Unique Identifier (CUI).",
        "Thus both Autonomic nerve concepts in SNOMED CT and FMA are assigned the same CUI (C0206250).",
        "These shared CUIs essentially merge multiple sources into a single resource in the Metathesaurus.",
        "Some sources in the Metathesaurus contain additional information about the concept such as synonyms, definitions,6 and related concepts.",
        "Parent/child (PAR/CHD) and broader/narrower (RB/RN) are the main types of hierarchical relations between concepts in the Metathesaurus.",
        "Parent/child relations are already defined in the sources before they are integrated into the UMLS, whereas broader/-narrower relations are added by the UMLS editors.",
        "For example, Splanchnic nerve has an is-a relation with Autonomic nerve in FMA.",
        "This relation is carried forward in the Metathesaurus by creating a parent/child relation between the CUIs C0037991 [Splanchnic nerve] and C0206250 [Autonomic nerve].",
        "6However, not all concepts in the UMLS have a definition."
      ]
    },
    {
      "heading": "5 Demonstration System",
      "text": [
        "The UMLS::Similarity Web interface7 allows a user to enter two terms or UMLS CUIs as input in term boxes.",
        "The user can choose to calculate similarity or relatedness by clicking on the Calculate Similarity or Calculate Relatedness button.",
        "The user can also choose which UMLS sources and relations should be used in the calculation.",
        "For example, if the terms finger and arm are entered and the Compute Similarity button is pressed, the following is output:",
        "The Results show the terms and their assigned CUIs.",
        "If a term has multiple possible CUIs associated with it, UMLS::Similarity returns the CUI pair that obtained the highest similarity score.",
        "In this case, finger was assigned CUI C0016129 and arm assigned CUI C0449516 and the resulting similarity score for the path measure using the MeSH hierarchy was 0.25.",
        "Additionally, the paths between the concepts and their definitions are shown.",
        "The View Definitions and View Shortest Path buttons show the definition and shortest path between the concepts in a separate window.",
        "In the example above, the shortest path between finger (C0016129) and arm (C0446516) is",
        "C0446516 (Upper arm), and one of the definitions shown for arm (C0446516) is The superior part of the upper extremity between the shoulder and the elbow.",
        "SAB :: include and REL :: include are configuration parameters that define the sources and relations used to find the paths between the two CUIs when measuring similarity.",
        "In the example above, similarity was calculated using PAR/CHD relations in the MeSH hierarchy.",
        "All similarity measures default to the use of MeSH as the source (SAB) with PAR/CHD relations.",
        "While these are reasonable defaults, for many use cases these should be changed.",
        "Table 2 shows the similarity scores returned for each measure using different sources.",
        "It also shows the number of CUIs connected via PAR/CHD relations per source.",
        "A similar view is displayed when pressing the"
      ]
    },
    {
      "heading": "CUI /PAR/CHD/RB/RN",
      "text": [
        "Relatedness measures differ from similarity in their use of the SABDEF and RELDEF parameters.",
        "SABDEF :: include andRELDEF :: include define the source(s) and relation(s) used to extract definitions for the relatedness measures.",
        "In this example, the definitions come from any source in the UMLS and include not only the definition of the concept but",
        "also the definition of its PAR/CHD and RB/RN relations.",
        "Table 3 shows the relatedness scores returned for each of the relatedness measures using just the concept's definition (CUI) from all of the sources in the UMLS (UMLS ALL) and when the definitions are extended to include the definitions of the con"
      ]
    },
    {
      "heading": "cept's PAR/CHD and RB/RN relations. 6 Acknowledgments",
      "text": [
        "This work was supported by the National Institute of Health, National Library of Medicine Grant #R01LM009623-01.",
        "It was carried out in part using computing resources at the University of Minnesota Supercomputing Institute.",
        "The results reported here are based on the 2012AA version of the UMLS and were computed using version 1.23 of UMLS::Similarity and version 1.27 of UMLS::Interface."
      ]
    }
  ]
}
