{
  "info": {
    "authors": [
      "Elke Teich",
      "Stefania Degaetano-Ortlieb",
      "Hannah Kermes",
      "Ekaterina Lapshinova-Koltunski"
    ],
    "book": "BUCC",
    "id": "acl-W13-2508",
    "title": "Scientific registers and disciplinary diversification: a comparable corpus approach",
    "url": "https://aclweb.org/anthology/W13-2508",
    "year": 2013
  },
  "references": [
    "acl-C00-1069",
    "acl-C02-2020"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the 6th Workshop on Building and Using Comparable Corpora, pages 59?68, Sofia, Bulgaria, August 8, 2013. c?2013 Association for Computational Linguistics Scientific registers and disciplinary diversification: a comparable corpus approach"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "We present a study on linguistic contrast and commonality in English scientific discourse on the basis of a mono-lingually comparable corpus.",
        "The focus is on selected scientific disciplines at the boundaries to computer science (computational linguistics, bioinformatics, digital construction, microelectronics).",
        "The data basis is the English Scientific Text Corpus (SCITEX) which covers a time range of roughly thirty years (1970/80s to early 2000s).",
        "In particular, we investigate the disciplinary diversification/relatedness of scientific research articles in terms of register.",
        "Our results are relevant for research on multilingually comparable corpora as used in machine translation and related research, since they shed new light on the notion of ?comparablity?."
      ]
    },
    {
      "heading": "1 Introduction: Motivation and Goals",
      "text": [
        "In the context of statistical machine translation, comparable corpora are typically bilingual, thematically similar corpora being utilized to extract translation equivalents to enrich translation models.",
        "These have proved to be useful, especially for technically specialized texts or for low resource languages where parallel corpora are rare (Chiao and Zweigenbaum (2002); Babych et al. (2007)).",
        "The overarching goal of the paper is to provide evidence that the notion of comparability commonly used in that context is rather coarse and misses important aspects of linguistic variation.",
        "We report on a set of experiments in which a monolingually comparable corpus is studied.",
        "The corpus contains specialized, technical texts from nine scientific disciplines, related to each other by ?interdisciplines?",
        "(such as computer science - linguistics - computational linguistics) (cf.",
        "Section 2 for details).",
        "Our study establishes the linguistic differences and commonalities between the disciplines considered on the basis of the concept of register, i.e., language variation according to situational context.",
        "Situational context is conventionally described in terms of field, tenor and mode of discourse (Quirk et al., 1985).",
        "It has been shown in numerous corpus-linguistic studies that particular situational settings have specific linguistic correlates at the level of lexico-grammar in the sense of clusters of lexico-grammatical features that occur non-randomly (see notably the work by Biber and colleagues, e.g., Biber (1988, 1993); Biber et al. (1999); Biber (2006, 2012)).",
        "Collectively, the linguistic features associated with field, tenor and mode then give rise to registers.",
        "More specifically, field of discourse relates to the topic of a discourse and is realized lexico-grammatically in functional verb classes (e.g., activity, communication, etc.)",
        "with corresponding arguments (e.g., Actor, Goal, Medium, etc.)",
        "and adjunct types (e.g., Time, Place, Manner, etc.).",
        "Tenor of discourse relates to the roles and attitudes of the participants in a discourse and is realized lexico-grammatically in mood, modality as well as stance expressions.",
        "Mode of discourse relates to the presentational function of language and is realized in Theme-Rheme and Given-New constellations.",
        "A register is then characterized by particular distributions of lexico-grammatical features according to a given contextual configuration.",
        "Apart from exhibiting differences in field, tenor and mode, scientific texts are associated with particular discourse ?styles?",
        "such as technicality, abstractness or informational density, which may again be linguistically realized in different ways and to different degrees across disciplines.",
        "Furthermore, in a highly dynamic social domain, such as the scientific one, both registers and discourse styles are relatively versatile and subject to change (cf. Ure (1971, 1982)).",
        "This may, for instance,",
        "affect conventional phraseology.",
        "Finally, register and stylistic features may be distributed unevenly across document parts, thus giving rise to variation according to document structure.",
        "In order to arrive at a comprehensive picture of the linguistic construal of disciplinarity, we thus need to consider the linguistic encodings according to register and the linguistic realization of discursive styles as well as take into account the inherently dynamic nature of scientific discourse.",
        "Relating this back to the notion of comparability, the concept of register may thus provide the basis for a fine-grained description of comparability, as it acknowledges the multidimensional nature of linguistic variation.",
        "Our methodology is informed by three sources: corpus linguistics, linguistic theory and data mining.",
        "Standard corpus methods are employed for the quantification of instances of linguistic features that are considered to be relevant indicators of variation across scientific disciplines and may be expected to significantly contribute to differences in language use across disciplines.",
        "The theoretical basis is provided by Systemic Functional Linguistics (SFL; Halliday (2004)).",
        "The reason for choosing SFL to inform analysis is its model of association of contextual variables with lexico-grammatical domains (cf. above on the notion of register).",
        "In contrast to other corpus-based studies on register, our goal is not to uncover dimensions of variation or to discover text classes (as e.g. in Biber et al's work).",
        "The texts in our corpus are taken from 38 journals from nine disciplines (for details see Section 2) and the text classes are thus extrinsically defined.",
        "We can then think of analysis as a task of text classification, where we test whether the extrinsically defined classes have distinctive linguistic correlates and if so, how well the classes are distinguished linguistically and which features contribute most to their distinction.",
        "To this end, we employ data mining techniques, in particular automatic text classification (see Section 3 for details).",
        "A similar approach to the one developed here, also working on linguistic variation in the scientific domain, has been proposed earlier by Argamon et al. (2008).",
        "There is related work in translation studies by Baroni and Bernardini (2006) and Volansky et al. (2011), which uses automatic text classification to describe the specific properties of translations (?translationese?).",
        "The earliest work, to our knowledge, combining SFL with text classification is Whitelaw and Patrick's work on spam detection (Whitelaw and Patrick, 2004)."
      ]
    },
    {
      "heading": "2 Corpus",
      "text": []
    },
    {
      "heading": "2.1 Corpus Design and Pre-processing",
      "text": [
        "We have built a corpus composed of English scientific research articles ?",
        "the English Scientific Text Corpus (SCITEX; cf. Teich and Fankhauser (2010) and Degaetano-Ortlieb et al. (forthcoming)) ?",
        "that covers nine scientific domains and amounts to approx.",
        "34 million tokens, drawn from 38 sources.",
        "SCITEX contains full journal articles from two time periods, the 1970s/early 1980s (SASCITEX) and the early 2000s (DASCITEX).",
        "We",
        "pus lected scientific domains at the boundaries to computer science and some other discipline, SCITEX has a three-way partition: (1) A-subcorpus: computer science, (2) B-subcorpus: computational linguistics, bioinformatics, digital construction and microelectronics, and (3) C-subcorpus: linguistics, biology, mechanical engineering and electrical engineering, as shown in Figure 1.",
        "In the present paper, we are mainly interested in the linguistic evolution of the inter-/transdisciplinary domains represented by the B-subcorpus, as these are the ones that have emerged in the given time frame (1970s/80s to present).",
        "We term these domains contact disciplines, since they have come about through contact between two existing dis",
        "ciplines (here: computer science and another established discipline represented in the A and C subcorpora, which we term seed disciplines).",
        "The main question we are interested in is whether the seed and contact disciplines have clearly distinguishable linguistic correlates in terms of register.",
        "The text sources for SCITEX are full academic articles in the form of PDF files.",
        "These files were converted to plain text using an existing commercial software including optical character recognition (OCR).",
        "In further processing we follow the common practices in corpus linguistics by (a) accounting for relevant metadata (e.g., author, title, journal, year of publications) and document structure (e.g., abstract, conclusion), and (b) using standard tools for preprocessing (e.g., tokenization, tagging, lemmatization, etc.).",
        "For corpus query, we employ the Corpus Query Processor (CQP) (CWB; Evert, 2004) which works on the basis of regular expressions.",
        "Utilities of CQP allow for the extraction of distributional information according to the annotated metadata and document structure."
      ]
    },
    {
      "heading": "3 Methods of Analysis",
      "text": [
        "We carry out a diachronic analysis comparing the two time slices (1970s/80s vs. 2000s) represented in the SCITEX corpus, aiming to provide answers to the following questions:",
        "1.",
        "How well are the individual disciplines distinguished?",
        "2.",
        "How distinct are the contact disciplines from",
        "their seed disciplines?",
        "Thus, analysis involves comparisons along the temporal and the disciplinary dimensions.",
        "The hypothesis we have about the outcomes of our analysis is that disciplines will be better distinguished from one another over time, including the contact disciplines, reflecting a process of diversification within scientific writing over time."
      ]
    },
    {
      "heading": "3.1 Feature Selection",
      "text": [
        "In the first step of analysis we need to determine which features to investigate.",
        "These should be features that bring out relevant and significant contrasts along the dimensions considered (time, discipline).",
        "For the choice of features potentially distinguishing individual (scientific) registers, we draw on SFL's model of register variation in which the contextual parameters of field, tenor and mode are associated with particular lexico-grammatical domains.",
        "Since we want to cover all three contextual parameters, we choose at least one feature for each.",
        "For field, we analyze functional verb classes as well as PoS-patterns that are potentially terminology-forming (e.g. noun-noun structures); for tenor, we analyze modal verbs and for mode we analyze theme type as well as conjunctive cohesive relations.",
        "As another feature, we analyze n-grams on the basis of PoS combinations (rather than words), since we have seen in a previous study that they may be involved in processes of conventionalization (Kermes and Teich, 2012).",
        "Additionally, on an abstract level, scientific writing is a highly informational production that is characterized by technicality, information density and abstractness (cf. Halliday and Martin (1993)).",
        "Among the linguistic features realizing these properties are a relatively low type-token ratio (technicality), a relatively high lexical density and low grammatical intricacy (information density) and the frequent use of nominal categories (nouns, adjectives) (abstractness).",
        "Table 1 displays the features considered in the analysis together with their associated contextual variables and/or abstract discourse properties they instantiate.",
        "Features are extracted from the corpus with CQP.",
        "For example, simple queries combine part-of-speech and concrete lemmas (e.g., [pos=?MD?",
        "& lemma=?must|should?",
        "]; for modal verbs).",
        "More complex queries work with positional attributes, linguistic annotations and lists (e.g., < s>[conj & lemma!=$modal-adverbs]... as part of the extraction of textual Theme, which is realized in English as the first constituent in the clause)."
      ]
    },
    {
      "heading": "3.2 Feature Evaluation",
      "text": [
        "We employ statistical and machine learning methods to measure (a) how much individual features contribute to a possible distinction and (b) how well corpora are distinguished by these features.",
        "We employ classification techniques by using feature ranking (Information Gain) to determine the relative discriminatory force of features, and supervised machine learning (decision trees and support vector machines) to distinguish between the scientific registers in SCITEX.",
        "For these steps we use the WEKA data mining platform (Witten and Eibe, 2005)."
      ]
    },
    {
      "heading": "INFORMATION DENSITY",
      "text": [
        "lexical density lexical items per clause/sentence grammatical intricacy clauses per sentence wh-words per sentence sentence length"
      ]
    },
    {
      "heading": "ABSTRACTNESS PoS distribution no. of nominal vs. verbal categories CONVENTIONALIZATION",
      "text": []
    },
    {
      "heading": "4 Results and Interpretation",
      "text": [
        "Our analysis addresses the question of how distinctive the subcorpora in SCITEX are comparing the productions of the 1970/80s with those of the early 2000s.",
        "Considering the diachronic perspective, we expect to encounter a clearer separation of individual disciplines overall reflecting a process of diversification within scientific writing.",
        "The analysis has two parts: First, we calculate Information Gain of the top twenty features, to see which features are the most discriminatory ones across disciplines.",
        "Second, we apply automatic classification, to see how well the subcorpora are distinguished on the basis of these features.",
        "Table 2 shows the twenty most discriminatory features for the 70/80s across all subcorpora.",
        "The five highest ranking features are associated with field (NN: IGain 0.39, LEX: IGain 0.36, communication verbs: IGain 0.31) and mode (WL: IGain 0.33, LEX/C: IGain 0.32).",
        "In the mid range, we find some tenor features and in the lower range some other field features as well as document structure features.",
        "When we compare these results with the ones for the early 2000s (see Table 3), three main observations can be made.",
        "First, features become much more pronounced, the IGain values rising substantially for the top 20 features (1970s/80s are in the range of 0.23 to 0.39, 2000s are in the range of 0.31 to 3.1).",
        "This includes the nine features that are identical across SASCITEX and DASCITEX: existence and communication verbs as well as adj-n term pattern for field, obligation modals for tenor, word and sentence length as well as lexical words per clause for mode, bi-grams for conventionalization, and length of main part for document structure, all become more pronounced in DASCITEX (higher IGains) and thus contribute more to the distinction between disciplines.",
        "The second observation is that while in SASCITEX only bi-grams ranges among the top 20 features, in DASCITEX we encounter an increase in the contribution of gram-based features to the DASCITEX-internal distinction.1 This may point to the greater role of conventionalized language in the distinction between disciplines over time.",
        "Terminological studies based on n-grams might indicate a thematic comparability of disciplines.",
        "Consider one of the key concepts in computer science, ?algorithm?.",
        "The distribution (per million) across the nine disciplines in DASCITEX varies greatly: 1Note again that in our analysis, n-grams are based on parts-of-speech, not words.",
        "computer science (3427), microelectronics (1965), bioinformatics (1913), digital construction (1735), computational linguistics (1124), electrical engineering (955), mechanical engineering (129), biology (59) and linguistics (51).",
        "When we look at the top frequent token n-grams in which algorithm participates, we find, for example, ?approximation algorithm?",
        "which is mostly shared between computer science, the contact discipines and electrical engineering, ?learning algorithms?",
        "appears practically everywhere, and ?alignment algorithm?",
        "is almost only mentioned in computational linguistics and bioinformatics (with a few occurrences in computer science and one in biology).",
        "The stylistics across the disciplines is also noteworthy: pure stylistic tri-grams, such as the highly frequent ?in order to?, ?the number of?, ?based on the?, ?as shown in?, etc., are also good discriminators between different disciplines (cf. Kermes and Teich (2012)).",
        "Finally, at the levels of contextual and discourse properties, it can be noted that features associated with information density become better discriminators between disciplines in the 2000s having high IGain values, while tenor features step back decreasing in number, tending towards greater uniformity (only one tenor feature (obligation modals) in the top 20 features in the 2000s compared to four in the 70s/80s).",
        "To see how these data are reflected according to disciplines, we perfom classification for both cor",
        "pora (SASCITEX and DASCITEX), first, with decision trees, as they are based on Information Gain, and second, with support vector machines (SVMs), as they are used for text categorization tasks with many relevant features achieving very good results (cf. Joachims (1998)).",
        "Classification is performed on all features with 10 fold cross-validation.",
        "Table 4 shows the confusion matrix for all subcorpora for the 70/80s and classification accuracy for each subcorpus achieved by decision tree.",
        "The overall accuracy is 44.79% only, the correctly classified texts lying on the main diagonal of the matrix.",
        "The confusion matrix produced by SVM is shown in Table 5, with an overall accuracy of 65.07%.",
        "Apart from computational linguistics (B1), accuracy goes up by about 10% for digital contruction (B3) and linguistics (C1) and about 25-30% for the other subcorpora compared to decision tree.",
        "Accuracy with SVM for the contact disciplines (B1-B4) ranges from 20-60% and is much lower than the accuracy achieved for the seed disciplines (A and C1-C4) with around 54- 86%.",
        "Thus, the contact disciplines are not clearly separated from the seed disciplines.",
        "Considering, for instance the triple A-B1-C1, we can see that more texts belonging to computational linguistics (B1) are classified into linguistics (C1) than into computational linguistics (27 texts in C1 vs. 26 in B1), i.e., texts in B1 seem to be quite similar to"
      ]
    },
    {
      "heading": "disciplines",
      "text": [
        "texts in C1 in terms of the features investigated.",
        "In order to check the separation of disciplines over time, we need to compare classification results across SASCITEX and DASCITEX.",
        "We again apply SVM, which returns an overall accuracy of",
        "subcorpora across SASCITEX and DASCITEX, we can observe that accuracies are now much higher for all subcorpora.",
        "Considering the contact disciplines, they have clearly gained distinctiveness in the 2000s in comparison to the 1970/80s, as texts in B1-B4 are classified correctly 69% to 84% of achieving an accuracy of 57.24% only.",
        "the time (instead of 20-60% in the 1970/80s).",
        "In summary, the classification results match the results obtained by feature ranking, which have shown that the top 20 features increased discriminatory force over time.",
        "This is reflected by a higher classification accuracy overall and for the subcorpora.",
        "The discriminatory force of features in the 1970s/80s instead, was not strong enough to clearly separate disciplines.",
        "To see whether there are any particular features involved in the differentiation of the contact disciplines in particular vis a` vis computer science on the one hand and the other seed disciplines on the other hand, we inspect the confusion matrix as well as the IGains of each B vs. A and each B vs. the respective C, both for SASCITEX and DASCITEX.",
        "In the comparison to computer science (A), we can see that the confusion ma-trixes produced with SVM (cf. Table 5 and 6) show few texts that are misclassified from the contact disciplines (Bs) into computer science (A) for both time slices.",
        "Thus, the features employed distinguish Bs from A quite well.",
        "Considering the IGain values (see Table 7 and 8 for the top 10 features), besides computational linguistics (B1; relatively low classification accuracy of 20% in the 70/80s), the contact disciplines have the following features in common: word length (WL), STTR, causal verbs in the top 10 as well as four-grams, lexical words (LEX) and temporal conjunctions in the top 20 features.",
        "Except lexical words (LEX), all features have a higher IGain in the 2000s.",
        "In the comparison to the other seed discipines (Cs), the confusion matrixes show more misclassifica-tions of Bs into Cs.",
        "Considering the IGain values there are no tendencies uniformly applying to the contact disciplines (Bs).",
        "They rather show individual tendencies for each pair (B1 vs. C1, B2 vs. C2, B3 vs. C3, B4 vs. C4).",
        "Features that contribute to a better classification diachroni-cally lie in the following parameters: (a) field (occurrence, term-patterns, ADV) for computational linguistics (B1), (b) document structure (abstract, main, intro), information density (SL) and conventionalization (n-grams abstract) for bioinformatics (B2), (c) information density (WL) and technicality (VV) for digital construction (B3) and microelectronics (B4).",
        "3There are only two exceptions: C1 (linguistics) goes slightly down (around 2.5%), C4 (electrical engineering) goes down by over 20% to 50.67% accuracy, i.e., it is not really distinguishable any more."
      ]
    },
    {
      "heading": "5 Summary and Conclusions",
      "text": [
        "We have looked at disciplinary linguistic diversification in English scientific writing in terms of register, discourse styles and document structure.",
        "The results of our analysis provide evidence of major motifs of development in scientific writing over time, showing dynamicity over a time span of only thirty years.",
        "Diversification over time is clearly borne out for the contact disciplines but is also true for most of the other disciplines.",
        "Considering the contact disciplines we have seen that (1) they can be distinguished quite well from computer science with the same features being involved in better classification results, (2) they show individual feature constellations in their distinction from their seed disciplines.",
        "Moreover, n-grams have gained discriminatory force over time and are ranked relatively high among our features in the 2000s subcorpus.",
        "As they are also relevant in terms of terminology, they give an insight in the relatedness of disciplines.",
        "In terms of methods, we have combined state-of-the-art corpus processing with techniques of data analysis as developed in data mining.",
        "As such techniques become more accessible to linguistic, literary and cultural analysis, the repertoire of methods for such analysis will be greatly enhanced in that sounder empirical evidence can be sought in text-based sociocultural and historical studies at large (cf. Jockers (2013)).",
        "The crucial factor in employing such methods is the motivation of the features to be used in analysis.",
        "Here, we have deliberately not relied on word-based features but instead mainly employed lexico-grammatical patterns.",
        "While bags-of-words are strong discriminators between texts/text classes, they can only tell us something about lexical variation (e.g., as an indicator of text topic).",
        "However, when register or style rather than topicality are in the focus (such as e.g. the linguistic construal of technical, dense or abstract discourse or the expression of field, tenor or mode relations), it will not be sufficient to study lexical word distributions (cf. Cohen et al. (2010); Teich and Fankhauser (2010) for some other studies).",
        "Instead, one needs to identify lexico-grammatical patterns that are potential indicators of the more abstract discoursive and contextual properties that are in focus.",
        "The insight to be gained from our study for multilingually comparable corpora is that more elaborate definitions of ?comparability?",
        "might be re",
        "quired.",
        "Our approach offers such a definition of comparability by being firmly based on an established model of linguistic variation, which has also been widely applied in multilingual contexts, such as for example, automatic text generation (see e.g., Matthiessen and Bateman (1991); Bateman (1997); Kruijff et al. (2000)).",
        "The parameters of variation we employ (register: field, tenor, mode; discourse styles; time) provide a fine-grained grid of features involved in linguistic variation, which can be applied to other languages as well.",
        "For example, we can extract and analyze field features, such as term patterns (as produced for German by Weller et al. (2011)), tenor features, such as modal verbs, as well as the other features investigated using the same tools applied here (part-of-speech tagger, CQP, R-scripts and WEKA modules) with only little adaptations (e.g., tag sets, query formulation).",
        "Overall, we would expect that applying the concept of register to the problem of comparability will enable finer-tuned comparable corpora and thus contribute to their fuller potential for multilingual language technology."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We wish to thank the anonymous reviewers for their helpful comments.",
        "We are especially grateful to Peter Fankhauser for critically assessing our data and to Noam Ordan for valuable suggestions regarding the structure of the paper."
      ]
    }
  ]
}
