{
  "info": {
    "authors": [
      "Itisree Jena",
      "Riyaz Ahmad Bhat",
      "Sambhav Jain",
      "Dipti Misra Sharma"
    ],
    "book": "Linguistic Annotation Workshop",
    "id": "acl-W13-2320",
    "title": "Animacy Annotation in the Hindi Treebank",
    "url": "https://aclweb.org/anthology/W13-2320",
    "year": 2013
  },
  "references": [
    "acl-E06-3008",
    "acl-E09-1072",
    "acl-I08-2099",
    "acl-J01-3003",
    "acl-W04-0216",
    "acl-W05-0509",
    "acl-W09-3036",
    "acl-W10-1411"
  ],
  "sections": [
    {
      "heading": "4.3 Inter-Annotator Agreement",
      "text": [
        "We measured the inter-annotator agreement on a set of 358 nominals (?50 sentences) using Cohen's kappa.",
        "We had three annotators annotating the same data set separately.",
        "The nominals were annotated in context i.e., the annotation was carried considering the role and reference of a nominal in a particular sentence.",
        "The kappa statistics, as presented in Table 6, show a significant understanding of annotators of the property of animacy.",
        "In Table 7, we report the confusion between the annotators on the three animacy categories.",
        "The confusion is high for ?Inanimate?",
        "class.",
        "Annotators don't agree on this category because of its fuzziness.",
        "As discussed earlier, although ?Inanimate?",
        "class enlists biologically inanimate entities, some entities may behave like animates in some contexts.",
        "They may be sentient and have high linguistic control in some contexts.",
        "The difficulty in deciphering the exact nature of the reference of these nominals, as observed, is the reason behind the confusion.",
        "The confusion is observed for nouns like organization names, lower animates and vehicles.",
        "Apart from the linguistically and contextually defined animacy, there was no confusion, as expected, in the understanding of biological animacy."
      ]
    },
    {
      "heading": "5 Conclusion and Future Work",
      "text": [
        "In this work, we have presented our efforts to enrich the nominals in the Hindi Treebank with animacy information.",
        "The annotation was followed by the inter-annotator agreement study for evaluating the confusion over the categories chosen for annotation.",
        "The annotators have a significant understanding of the property of animacy as shown by the higher values of Kappa (?).",
        "In future, we plan to continue the animacy annotation for the whole Hindi Treebank.",
        "We also plan to utilize the annotated data to build a data driven automatic animacy classifier (?vrelid, 2006).",
        "From a linguistic perspective, an annotation of the type, as discussed in this paper, will also be of great interest for studying information dynamics and see how semantics interacts with syntax in Hindi."
      ]
    },
    {
      "heading": "6 Acknowledgments",
      "text": [
        "The work reported in this paper is supported by the NSF grant (Award Number: CNS 0751202; CFDA Number: 47.070).",
        "2"
      ]
    }
  ]
}
