{
  "info": {
    "authors": [
      "Stefan L. Frank",
      "Leun J. Otten",
      "Giulia Galli",
      "Gabriella Vigliocco"
    ],
    "book": "ACL",
    "id": "acl-P13-2152",
    "title": "Word surprisal predicts N400 amplitude during reading",
    "url": "https://aclweb.org/anthology/P13-2152",
    "year": 2013
  },
  "references": [
    "acl-D11-1028",
    "acl-E12-1041",
    "acl-J01-2004",
    "acl-N01-1021",
    "acl-P03-1054",
    "acl-P10-1021"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We investigated the effect of word surprisal on the EEG signal during sentence reading.",
        "On each word of 205 experimental sentences, surprisal was estimated by three types of language model: Markov models, probabilistic phrase-structure grammars, and recurrent neural networks.",
        "Four event-related potential components were extracted from the EEG of 24 readers of the same sentences.",
        "Surprisal estimates under each model type formed a significant predictor of the amplitude of the N400 component only, with more surprising words resulting in more negative N400s.",
        "This effect was mostly due to content words.",
        "These findings provide support for surprisal as a generally applicable measure of processing difficulty during language comprehension."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Many studies of human language comprehension measure the brain's electrical activity during reading.",
        "Such electroencephalography (EEG) experiments have revealed that the EEG signal displays systematic variation in response to the appearance of each word.",
        "The different components that can be observed in this signal are known as event-related potentials (ERPs).",
        "Probably the most reliably observed (and most studied) of these components is a negative-going deflection at centroparietal electrodes that peaks at around 400 ms after word onset and is therefore referred to as the N400 component.",
        "It is well known that the N400 increases in amplitude (i.e., becomes more negative) when the word leads to comprehension difficulty.",
        "To study the general relation between word predictability and the N400, Dambacher et al. (2006) obtained subjective word-probability estimates (so-called cloze probabilities) by asking participants to predict the upcoming word at each point in a large number of sentences.",
        "A different group of subjects read these same sentences while their EEG signal was recorded.",
        "Results showed a correlation between N400 amplitude and cloze probability: Less predictable words yielded stronger N400s.",
        "We investigated whether similar results can be obtained using more objective, model-based word probabilities.",
        "For each word in a collection of English sentences, estimates of its surprisal (i.e., its negative log-transformed conditional probability: ?",
        "logP (wt|w1, .",
        ".",
        ".",
        ", wt?1)) were generated by three types of language model: Markov (i.e., n-gram) models, phrase-structure grammars (PSGs), and recurrent neural networks (RNNs).",
        "Next, EEG signals of participants reading the same sentences were recorded.",
        "A comparison of word surprisal to different ERP components revealed that, indeed, N400 amplitude was predicted by surprisal values: More surprising words resulted in more negative N400s, at least for content words."
      ]
    },
    {
      "heading": "2 Language models",
      "text": [
        "A range of models of each type was trained, allowing to investigate whether models that capture the language statistics more accurately also yield better predictions of ERP size.",
        "Such a relation is generally found in studies that use word-reading time as the dependent variable (Fernandez Mon-salve et al., 2012; Frank and Bod, 2011; Frank and Thompson, 2012), providing additional support that these psychological data are indeed explained by the surprisal values and not by some confounding variable."
      ]
    },
    {
      "heading": "2.1 Corpus data",
      "text": [
        "All models were trained on sentences from the written texts in the British National Corpus (BNC).",
        "First, the 10,000 word types with highest",
        "frequency were selected from the BNC.",
        "Next, all sentences were extracted that contained only those words.",
        "This resulted in a training corpus of 1.06 million sentences (12.6 million word tokens).",
        "Each trained model estimated a surprisal value for each word of the 205 sentences (1931 word tokens) for which eye-tracking data are available in the UCL corpus of reading times (Frank et al., in press).",
        "These sentences, which were selected from three unpublished novels, only contained words from the 10,000 high-frequency word list."
      ]
    },
    {
      "heading": "2.2 Markov models",
      "text": [
        "Markov models were trained with modified Kneser-Ney smoothing (Chen and Goodman, 1999) as implemented in SRILM (Stolcke, 2002).",
        "Model order was varied: n = 2, 3, 4.",
        "No unigram model was computed because word frequency was factored out during data analysis (see Section 4.2)."
      ]
    },
    {
      "heading": "2.3 Recurrent neural networks",
      "text": [
        "The RNN model architecture has been thoroughly described elsewhere (Fernandez Monsalve et al., 2012; Frank, in press) so it is not discussed here.",
        "The only difference with previous versions was that the current RNN was trained on a substantially larger data set with more word types.",
        "A range of RNN models was obtained by training on nine increasingly large subsets of the BNC data, comprising 2K, 5K, 10K, 20K, 50K, 100K, 200K, 400K, and all 1.06M sentences.",
        "In addition, the network was trained on the full set twice, making a total of ten instantiations of the RNN model."
      ]
    },
    {
      "heading": "2.4 Phrase-structure grammars",
      "text": [
        "To prepare data for PSG training, the selected BNC sentences were parsed by the Stanford parser (Klein and Manning, 2003).",
        "The resulting treebank was divided into nine increasingly large subsets, equal to those used for RNN training.1 Grammars were induced from these subsets using the algorithm by Roark (2001) with its standard settings.",
        "Next, surprisal values on the experimental sentences were generated by Roark's incremental parser.",
        "Since increasing the parser's beam width has been shown to improve both word-probability estimates and the fit to word-reading times (Frank, 2009), the parser's ?base beam threshold?",
        "parameter was reduced to 10?20.",
        "1Because not all experimental sentences could be parsed when the treebank comprised only 2K sentences, 1K sentences were added to the smallest subset."
      ]
    },
    {
      "heading": "3 EEG data collection",
      "text": [
        "Twenty-four healthy, adult volunteers from the UCL Psychology subject pool took part in the reading study.",
        "Their EEG was recorded continuously from 32 channels during the presentation of 5 practice sentences and the 205 experimental items.",
        "Participants were asked to minimise blinks, eye movements, and head movements during sentence presentation.",
        "Each sentence was preceded by a centrally presented fixation cross.",
        "As soon as the participant pressed a key, the cross was replaced by the sentence's first word, which was then automatically replaced by each subsequent word.",
        "Word presentation duration (in milliseconds) equalled 190 + 20k, where k is the number of characters in the word (including any attached punctuation).",
        "After the word disappeared, there was a 390 ms interval before the next word appeared.",
        "The sentences were presented in random order, one word at a time, always centrally located on the monitor.",
        "One-hundred and ten of the experimental sentences were followed by a yes/nocomprehension question, to ensure that participants tried to understand the sentences.",
        "All participants answered at least 80% of the comprehension questions correctly."
      ]
    },
    {
      "heading": "4 Data analysis",
      "text": []
    },
    {
      "heading": "4.1 ERP components",
      "text": [
        "Four ERP components of interest were identified from the literature on EEG and sentence reading: Early Left Anterior Negativity (ELAN), P200, N400, and a post-N400 positivity (PNP).",
        "Table 1 lists the corresponding time windows and approximate electrode sites.2 For each component, the average electrode potential over the corresponding time window and electrodes was computed.",
        "These average ERP amplitudes served as the four dependent variables for data analysis.",
        "The ELAN component is generally thought of as indicative of difficulty with constructing syntactic phrase structure (Friederici et al., 1999; Gunter et al., 1999; Neville et al., 1991).",
        "Hence, if any of the model types predicts ELAN size, we would expect this to be the PSG.",
        "Dambacher et al. (2006) found effects of word frequency or length (which are strongly correlated",
        "was not included because the shortest interval between consecutive word onsets was only 600 ms.",
        "windows, and approximate scalp locations.",
        "and therefore difficult to tease apart) on the P200 amplitude.",
        "Since we factor out these two lexical factors in the analysis, we expect no additional effect of surprisal on P200.",
        "If any of the components is sensitive to word surprisal, this is most likely to be the N400 as many studies have already shown that N400 amplitude depends on subjective word predictability (Dambacher et al., 2006; Kutas and Hillyard, 1984; Moreno et al., 2002).",
        "Whether an effect will appear on the PNP is more doubtful.",
        "Van Petten and Luka (2012) argue that word expectations that are confirmed result in reduced N400 size, whereas expectations that are disconfirmed increase the PNP.",
        "However, in a probabilistic setting, expectations are not all-or-nothing so there is no strict distinction between confirmation and disconfirmation.",
        "Nevertheless, surprisal effects on PNP may occur.",
        "Since the PNP has received relatively little attention, the component may not be such a reliable index of comprehension difficulty as the N400 has proven to be."
      ]
    },
    {
      "heading": "4.2 Regression analysis",
      "text": [
        "Data were discarded on words attached to a comma, clitics, sentence-initial, and sentence-final words.",
        "Moreover, artifacts in the EEG data (mostly due to eye blinks) were identified and removed, leaving 32,010 analysed data points per investigated ERP component.",
        "For each data point and ERP component, a baseline potential was determined by averaging over the component's electrodes in the 100 ms leading up to word onset.",
        "In order to quantify the fit of surprisal to ERP size, a linear mixed-effects regression model was fitted to each of the four ERPs, using the predictors: baseline potential, log-transformed word frequency, word length (number of characters), word position in the sentence, and sentence position in the experiment.3 Also, all significant 3For word and sentence position, both linear and squared factors were included in order to capture possible non-linear two-way interactions were included (main effects were removed if they were not significant and did not appear in any interaction).",
        "In addition, there were by-subject and by-item random intervals, as well as significant by-subject and by-item random slopes.",
        "Parameters for the correlation between random intercept and slope where also estimated, if they significantly contributed to model fit.",
        "When the surprisal estimates by a particular language model are included in the analysis, the regression model's deviance decreases.",
        "The size of this decrease is the ?2-statistic of a likelihood-ratio test for significance of the surprisal effect, and was taken as the measure of the surprisal values?",
        "fit to the ERP data.4 Negative values will be used to indicate effects in the negative direction, that is, when higher surprisal results in more negative (or less positive) going ERP deflections."
      ]
    },
    {
      "heading": "5 Results",
      "text": []
    },
    {
      "heading": "5.1 Surprisal effects",
      "text": [
        "Figure 1 plots the fit of each model's surprisal estimates to ERP amplitude as a function of the average natural logP (wt|w1, .",
        ".",
        ".",
        ", wt?1), which quantifies to what extent the model has acquired accurate language statistics.5 For the ELAN, P200 and PNP components, there were no significant effects after correcting for multiple comparisons.",
        "In contrast, effects on the N400 were highly significant."
      ]
    },
    {
      "heading": "5.2 Model comparison",
      "text": [
        "Table 2 shows results of pairwise comparisons between the best models of each type (i.e., those whose surprisal estimates fit the N400 data best).",
        "Clearly, RNN-based surprisal explains variance over and above each of the other two models whereas neither the n-gram nor the PSG model outperforms the RNN.",
        "Moreover, the RNN's sur-prisals explain a marginally significant (?2 = 3.47; p < .07) amount of variance over and above the combined PSG and n-gram surprisals.",
        "changes over the course of the sentence or experiment.",
        "tic accuracy?, equals the negative logarithm of the model's perplexity.",
        "Increasing the amount of training data (or the value of n) resulted in higher linguistic accuracy, except for the three PSG models trained on the smallest amounts of data.",
        "This shows that the models did not suffer from overfitting.",
        "of average logP (wt|w1, .",
        ".",
        ".",
        ", wt?1).",
        "Each plotted point corresponds to predictions by one of the trained models.",
        "Dotted lines indicate ?2 = ?3.84, beyond which effects are statistically significant (p < .05) if no correction for multiple comparisons is applied.",
        "The dashed line indicates the level below which effects are significant after applying the correction proposed by Benjamini and Hochberg (1995), on each ERP component separately because of our prior expectation that effects would occur mostly (if not exclusively) on the N400 component.",
        "estimates by the best models of each type.",
        "Shown are the results of likelihood-ratio tests for the effect of one set of surprisal estimates (rows) over and above the other (columns)."
      ]
    },
    {
      "heading": "5.3 Comparing word classes",
      "text": [
        "N400 effects are nearly exclusively investigated on content (i.e., open-class) words.",
        "Dambacher et al.",
        "(2006), too, investigated the relation between ERP amplitudes and cloze probabilities on content words only.",
        "When running separate analyses on content and function words (constituting 53.2% and 46.8% of the data, respectively), we found that the N400 effect of Figure 1 is nearly fully driven by content words (see Figure 2).",
        "None of the models?",
        "surprisal estimates formed a significant predictor of N400 amplitude on function words, after correction for multiple comparisons."
      ]
    },
    {
      "heading": "6 Discussion",
      "text": [
        "We demonstrated a clear effect of word surprisal, as estimated by different language models, on the EEG signal: The larger a (content) word's surprisal value, the more negative the resulting N400.",
        "content words (left) and function words (right).",
        "Dotted lines indicate ?2 = ?3.84, beyond which effects are statistically significant (p < .05) without correcting for multiple comparisons.",
        "Dashed lines indicates the levels beyond which effects are significant after multiple-comparison correction (Benjamini and Hochberg, 1995).",
        "The N400 component is generally viewed as indicative of lexical rather than syntactic processing (Kaan, 2007), which may explain why surprisal under the PSG model did not have any significant explanatory value over and above RNN-based surprisal.",
        "The relatively weak performance of our Markov models is most likely due to their strict (and cognitively unrealistic) limit on the size of the prior context upon which word-probability estimates are conditioned.",
        "Unlike the ELAN, P200, and PNP components, the N400 is known to be sensitive to the cloze probability of content words.",
        "The fact that surprisal effects were found on the N400 only, therefore suggests that subjective predictability scores and model-based surprisal estimates form opera",
        "tionalisations of one and the same underlying cognitive factor.",
        "Needless to say, our statistical models fail to capture many information sources, such as semantics and discourse, that do affect cloze probabilities.",
        "However, it is possible in principle to integrate these into probabilistic language models (Dubey et al., 2011; Mitchell et al., 2010).",
        "To the best of our knowledge, only one other published study relates language model predictions to the N400: Parviz et al. (2011) found that surprisal estimates (corrected for word frequency) from an n = 4 Markov model predicted N400 size as measured by magnetoencephalography (rather than EEG).",
        "Although their PSG-based surprisals did not correlate with N400 size, a related measure derived from the PSG ?lexical entropy?",
        "did.",
        "However, Parviz et al. (2011) only looked at effects on the sentence-final content word of items constructed for a speech perception experiment (Kalikow et al., 1977), rather than investigating surprisal's general predictive value across words of naturally occurring sentences, as we did here.",
        "Our experimental design was parametric rather than factorial, which allowed us to study the effect of surprisal over a sample of English sentences rather than carefully manipulating surprisal while holding other factors constant.",
        "This has the advantage that our findings are likely to generalise to other sentence stimuli, but it can also raise a possible concern: The N400 effect may not be due to surprisal itself, but to an unknown confounding variable that was not included in the regression analysis.",
        "However, this seems unlikely because of two additional findings that only follow naturally if surprisal is indeed the relevant predictor: Significant results only appeared where they were most expected a priori (i.e., on N400 but not on other components) and there was a nearly monotonic relation between the models?",
        "word-prediction accuracy and their ability to account for N400 size."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "Although word surprisal has often been shown to be predictive of word-reading time (Fernandez Monsalve et al., 2012; Frank and Thompson, 2012; Smith and Levy, in press), a general effect on the EEG signal has not before been demonstrated.",
        "Hence, these results provide additional evidence in support of surprisal as a reliable measure of cognitive processing difficulty during sentence comprehension (Hale, 2001; Levy, 2008)."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The research presented here was funded by the European Union Seventh Framework Programme (FP7/2007-2013) under grant number 253803.",
        "The authors acknowledge the use of the UCL Legion High Performance Computing Facility, and associated support services, in the completion of this work."
      ]
    }
  ]
}
