{
  "info": {
    "authors": [
      "Philip Resnik",
      "Anderson Garron",
      "Rebecca Resnik"
    ],
    "book": "EMNLP",
    "id": "acl-D13-1133",
    "title": "Using Topic Modeling to Improve Prediction of Neuroticism and Depression in College Students",
    "url": "https://aclweb.org/anthology/D13-1133",
    "year": 2013
  },
  "references": [
    "acl-N12-1012",
    "acl-N13-1021",
    "acl-W11-0610"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We investigate the value-add of topic model-ing in text analysis for depression, and for neuroticism as a strongly associated personality measure.",
        "Using Pennebaker's Linguistic Inquiry and Word Count (LIWC) lexicon to provide baseline features, we show that straightforward topic modeling using Latent Dirichlet Allocation (LDA) yields interpretable, psychologically relevant ?themes?",
        "that add value in prediction of clinical assessments."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In the United States, where 25 million adults per year suffer a major depressive episode (NAMI, 2013), identifying people with mental health problems is a key challenge.",
        "For clinical psychologists, language plays a central role in diagnosis: many clinical instruments fundamentally rely on what is, in effect, manual coding of patient language.",
        "Automating language assessment in this domain potentially has enormous impact, for two reasons.",
        "First, conventional clinical assessments for affective disorders (e.g.",
        "The Minnesota Multiphasic Personality Inventory, MMPI) are based on norm-referenced self-report, and therefore depend on patients?",
        "willingness and ability to report symptoms.",
        "However, some individuals are motivated to underreport symptoms to avoid negative consequences (e.g. active duty soldiers, parents undergoing child custody evaluations), and others lack the self awareness to report accurately.1 Second, many people ?",
        "e.g. those with-1As evidenced by the fact that assessments such as the MMPI-2RF include validity scales to detect, e.g., defensiveness, atypout adequate insurance or in rural areas ?",
        "cannot access a clinician qualified to perform a psychological evaluation (Sibelius, 2013; APA, 2013).",
        "There is enormous value in inexpensive screening measures that could be administered in primary care and by social workers and other providers.",
        "We take as a starting point the well known lexicon-driven methods of Pennebaker and colleagues (LIWC, Pennebaker and King (1999)), which relate language use to psychological variables, and improve on them straightforwardly using topic modeling (LDA, Blei et al. (2003)).",
        "First, we show that taking automatically derived topics into account improves prediction of neuroticism (emotional instability, John and Srivastava (1999)), as measured by correlation with widely used clinical instruments, when compared with lexically-based prediction alone.",
        "Neuroticism is of particular interest as a personality measure because higher scores on neuroticism scales are consistent with increased distress and more difficulty coping; individuals with high levels of neuroticism may also be at higher risk of psychiatric problems categorized as Axis I in the DSM-IV (Association, 2000), including the internalizing disorders (depression, anxiety).2 Second, we show a similar correlation improvement result for prediction of depression, adding improvement ical responses, and overly positive self-portrayals (Tellegen et al., 2003).",
        "as the standard for diagnosis from 1994 until the release of the (quite controversial) DSM-5 in May, 2013.",
        "Axis I in the DSM-IV includes all the major diagnostic categories, excluding mental retardation and personality disorders.",
        "on precision (with no decrease in recall), as well as comparison with human performance by clinical psychologists.",
        "Third, we show that LDA has identified meaningful, population-specific themes that go beyond the predefined LIWC categories and are psychologically relevant."
      ]
    },
    {
      "heading": "2 Predicting neuroticism 2.1 Experimental framework",
      "text": [
        "Data.",
        "We utilize a collection of 6,459 stream-of-consciousness essays collected from college students by Pennebaker and King (1999) between 1997 and 2008, averaging approximately 780 words each.",
        "Students were asked to think about their thoughts, sensations, and feelings in the moment and ?write your thoughts as they come to you?.",
        "Each essay is accompanied by metadata for its author, which includes scores for the Big-5 personality traits (John and Srivastava, 1999): agreeableness, conscientiousness, extraversion, neuroticism, and openness.",
        "Because Big-5 assessment can be done using a variety of different survey instruments (John et al., 2008), and different instruments were used from year to year, we treat the data from each year as an independent dataset.",
        "Any author missing any Big-5 attribute was excluded.",
        "Essays were tokenized using NLTK (Bird et al., 2009) and lowercased, eliminating those that failed tokenization because of encoding issues.",
        "This resulted in a dataset containing 4,777 essays with associated Big-5 metadata.",
        "LIWC features.",
        "For each document, we calculate the number of observed words in each of Pennebaker and King's 64 LIWC categories.",
        "These include, among others, syntactic categories (e.g. pronouns, verbs), affect categories (e.g. negative emotion words, anger words), semantic categories (e.g. causation words, cognitive words), and topical categories (e.g. health, religion).",
        "For instance, the anger category contains 190 word patterns specifying, for example, words descriptive of contexts involving anger (e.g. brutal, hostile, shoot) and words that would be used by someone when angry (e.g. bullshit, hate, moron).",
        "We also explored including essays?",
        "average sentence length and total word-count, as an initial proxy for language complexity, which often figures into psychological assessments.",
        "However, results adding these features to LIWC did not differ significantly from LIWC alone, and for brevity we do not report them.3 LDA features.",
        "We use vanilla LDA as implemented in the Mallet toolkit (McCallum, 2002), developing a k-topic model on just training documents, and using the posterior topic distribution for each training and test document as a set of k features.",
        "Mallet's stoplist and default parameters were used for burn-in, lag, number of iterations, priors, etc.",
        "Details on train/test splits and number k of topics appear below.",
        "LIWC+LDA features.",
        "The union of the LIWC features (one feature per category) and LDA features (one feature per topic).",
        "Prediction.",
        "We utilize linear regression in the WEKA toolkit (Hall et al., 2009), estimated on training documents, to predict the neuroticism score associated with the author of each test document.4"
      ]
    },
    {
      "heading": "2.2 Results",
      "text": [
        "Table 1 shows the quality of prediction via linear regression, averaged over the eleven datasets, 1997 through 2008, using Pearson correlation (r) as the evaluation metric.",
        "For each year, we used 10-fold cross-validation to ensure proper separation of training and test data.",
        "We experimented with LDA using 20, 30, 40, and 50 topics.5 A first thing to observe is that the multiple regressions using all LIWC categories produce much stronger correlations with neuroticism than the individual category correlations reported by Pennebaker and King.",
        "There the strongest individual correlations with neuroticism for any LIWC categories are .16 (negative emotion words) and -.13 (positive emotion words), though it should be noted that their goal was to validate their categories as a meaningful",
        "lected between 1993 and 1998, and we also eliminated some files during preprocessing.",
        "way to explore personality differences, not prediction.",
        "As noted in Table 1, paired t-tests (df=10, ?",
        "= .05) establish that, in comparing the cross-year averages, augmenting LIWC with topic features improves average correlation significantly over using LIWC features alone for 30, 40, and 50 topics.",
        "LDA features alone do not improve significantly over LIWC."
      ]
    },
    {
      "heading": "3 Predicting Depression",
      "text": []
    },
    {
      "heading": "3.1 Experimental framework",
      "text": [
        "Data.",
        "We use essays collected by Rude et al. (2004) similarly to ?2.1; in this case, students were asked to ?describe your deepest thoughts and feelings about being in college?.",
        "Each essay is accompanied by the author's Beck Depression Inventory score (BDI).",
        "BDI (Beck et al., 1961) is a widely used 21-question instrument that correlates strongly with ratings of depression by psychiatrists.",
        "Following Rude et al., we treat BDI ?",
        "14 as the threshold for a positive instance of depression.7 Text preprocessing was done as in ?2.1, with 124 documents in total averaging around 390 words each.",
        "Training/test split.",
        "Because only 12 of 124 authors met the BDI ?",
        "14 threshold, we did not split randomly, lest the test sample include too few positive instances to be useful.",
        "Instead we included a random 6 of the 12 above-threshold cases, plus 24 more items sampled at random, to create a 30-item test set.",
        "To form the training set from the complementary items, we added two more copies of each positive instance to help address class imbalance (Batista et al., 2004) and, following Rude et al., we excluded items with with BDI of 0 or 1 as potentially invalid.",
        "Human comparison.",
        "We created a set of expert human results for comparison by asking three prac-ticing clinical psychologists to review the test documents and rate whether or not the author is suffer-7Each question contributes a score value from 0 to 3, so BDI scores range from 0 to 63. ing depression.",
        "They were asked to ?decide how at-risk this person might be for depression?, assigning 0 (no significant concerns), 1 (mild concerns, but does not require futher evaluation), or 2 (requires attention, refer for further evaluation).",
        "Following recommended practice for cases where different labels are not equally distinct from each other (Artstein and Poesio, 2008), we evaluate inter-coder agreement using Krippendorff's ?",
        "; our ?, computed for ordinal data, is 0.722.",
        "Features.",
        "We ran 50-topic LDA on the 4,777 essays from ?2.1 plus the BDI training items, using the posterior topic distributions as features as in ?2.1.",
        "As in ?2.1, the LIWC features comprised one count per LIWC category, and LIWC+LDA features were the union of the two."
      ]
    },
    {
      "heading": "3.2 Results",
      "text": [
        "Regression on LIWC features alone achieved r = .288, and adding topic features improved this substantially to r = .416.",
        "Treating BDI ?",
        "14 as the threshold for positive instances (i.e. that an author is depressed), Table 2 shows that adding topic features improves precision without harming recall.",
        "Automatic prediction is more conservative than human ratings, trading recall for precision to achieve comparable F-measure on this test set.9 8These psychologists all have doctoral degrees, are licensed, and spend significant time primarily in assessment and diagnosis of psychological disorders.",
        "None were familiar with the specifics of this study.",
        "9A reviewer observes, correctly, that in a scenario where a system is providing preliminary screenings to aid psychologists, the precision/recall tradeoff demonstrated here would potentially be undesirable, since a presumed goal would be to not miss any cases, even at the risk of some false positives.",
        "We note, however, that the real world is unfortunately replete with situations where there is significant cost or social/professional stigma associated with interventions or follow-up testing; in such situations it might be high precision that is desirable.",
        "These are challenging questions, and the ability to trade off precision versus recall more flexibly is a topic we are interested in investigating in future work."
      ]
    },
    {
      "heading": "4 Qualitative themes",
      "text": [
        "In order to explore the relevance of the themes uncovered by LDA, the third author, a practicing clinical psychologist, reviewed the 50 LDA categories created in ?3.1.",
        "Each category, represented by its 20 highest-probability words, was given a readable description.",
        "Then, for each category, she was asked: ?If you were conducting a clinical interview, would observing these themes in a patient's responses make you more (less) likely to feel that the patient merited further evaluation for depression??",
        "Table 3 shows the seven topics selected as particularly indicative of further evaluation.10 These capture population-specific properties in ways that LIWC cannot ?",
        "for example, although LIWC does have a body category, it does not have a category that corresponds to somatic complaints, which often co-occur with depression.",
        "Similarly, some words related to energy level, e.g. tired, would be captured in LIWC's body, bio, and/or health category, but the LDA theme corresponding to low energy or lack of sleep, another potential depression cue, contains words that make sense there only in context (e.g. tomorrow, late).",
        "Other themes, such as the one labeled HOMESICKNESS, are clearly relevant (potentially indicative of an adjustment disorder), but even more specific to the population and context."
      ]
    },
    {
      "heading": "5 Related Work",
      "text": [
        "The application of NLP to psychological variables has seen a recent uptick in community activity.",
        "One recent shared task brings together research on the Big-5 personality traits (Celli et al., 2013; Kosin-ski et al., 2013), and another involved research on identification of emotion in suicide notes (Pestian et al., 2012).",
        "Other examples include NLP research on 10All 50 can be found in the supplemental materials at http://umiacs.umd.edu/?resnik/papers/ emnlp2013-supplemental/.",
        "autistic spectrum disorders (Van Santen et al., 2010; Prudhommeaux et al., 2011; Lehr et al., 2013) and dementia (Pakhomov et al., 2011; Lehr et al., 2012; Roark et al., 2011).",
        "With regard to depression, Neuman et al. (2012) develop a corpus-based ?depression lexicon?",
        "and produce promising screening results, and De Choud-hury et al. (2013) predict social network behavior changes related to post-partum depression.",
        "Neither, however, evaluates using formal instruments for clinical assessment.",
        "Related investigations involving LDA include Zhai et al. (2012), who use LIWC to provide priors for corpus-specific emotion categories; Stark et al.",
        "(2012), who combine LIWC and LDA-based features in classification of social relationships; and Schwartz et al. (2013), who use lexical and topic-based features in Twitter to predict life satisfaction."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "In this paper, we have aimed for a small, focused contribution, investigating the value-add of topic modeling in text analysis for depression, and for neuroticism as a strongly associated personality measure.",
        "Our contribution here is not technical: corpus-specific topics/themes are anticipated by Zhai et al. (2012), and Stark et al. (2012) employ topic-based features for prediction in a supervised setting.",
        "Rather, our contribution here has been to show that topic models can get us beyond the LIWC categories to relevant, population-specific themes related to neuroticism and depression, and to support that claim using evaluation against formal clinical assessments.",
        "More data (e.g. Kosinski et al. (2013)) and more sophisticated models (e.g. supervised LDA, Blei and McAuliffe (2008), and extensions such as Nguyen et al. (2013)) will be the key to further progress."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We are grateful to Jamie Pennebaker for the LIWC lexicon and for allowing us to use data from Pennebaker and King (1999) and Rude et al. (2004), to the three psychologists who kindly took the time to provide human ratings, and to our reviewers for helpful comments.",
        "This work has been supported in part by NSF grant IIS-1211153."
      ]
    }
  ]
}
