{
  "info": {
    "authors": [
      "Chenhui Chu",
      "Toshiaki Nakazawa",
      "Sadao Kurohashi"
    ],
    "book": "BUCC",
    "id": "acl-W13-2505",
    "title": "Chinese–Japanese Parallel Sentence Extraction from Quasi–Comparable Corpora",
    "url": "https://aclweb.org/anthology/W13-2505",
    "year": 2013
  },
  "references": [
    "acl-C04-1151",
    "acl-I05-1023",
    "acl-I05-1059",
    "acl-J05-4003",
    "acl-J93-2003",
    "acl-N03-2016",
    "acl-N10-1063",
    "acl-P03-1010",
    "acl-P06-1011",
    "acl-P07-2045",
    "acl-P09-2057",
    "acl-W06-2810"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the 6th Workshop on Building and Using Comparable Corpora, pages 34?42, Sofia, Bulgaria, August 8, 2013. c?2013 Association for Computational Linguistics"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "Parallel sentences are crucial for statistical machine translation (SMT).",
        "However, they are quite scarce for most language pairs, such as Chinese?Japanese.",
        "Many studies have been conducted on extracting parallel sentences from noisy parallel or comparable corpora.",
        "We extract Chinese?Japanese parallel sentences from quasi?comparable corpora, which are available in far larger quantities.",
        "The task is significantly more difficult than the extraction from noisy parallel or comparable corpora.",
        "We extend a previous study that treats parallel sentence identification as a binary classification problem.",
        "Previous method of classifier training by the Cartesian product is not practical, because it differs from the real process of parallel sentence extraction.",
        "We propose a novel classifier training method that simulates the real sentence extraction process.",
        "Furthermore, we use linguistic knowledge of Chinese character features.",
        "Experimental results on quasi?",
        "comparable corpora indicate that our proposed approach performs significantly better than the previous study."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In statistical machine translation (SMT) (Brown et al., 1993; Koehn et al., 2007), the quality and quantity of the parallel sentences are crucial, because translation knowledge is acquired from a sentence?level aligned parallel corpus.",
        "However, except for a few language pairs, such as English?French, English?Arabic and English?",
        "Chinese, parallel corpora remain a scarce resource.",
        "The cost of manual construction for parallel corpora is high.",
        "As non?parallel corpora are far more available, constructing parallel corpora from non?parallel corpora is an attractive research field.",
        "Non?parallel corpora include various levels of comparability: noisy parallel, comparable and quasi?comparable.",
        "Noisy parallel corpora contain non?aligned sentences that are nevertheless mostly bilingual translations of the same document, comparable corpora contain non?sentence?",
        "aligned, non'translated bilingual documents that are topic?aligned, while quasi?comparable corpora contain far more disparate very?non?parallel bilingual documents that could either be on the same topic (in'topic) or not (out?topic) (Fung and Cheung, 2004).",
        "Most studies focus on extracting parallel sentences from noisy parallel corpora or comparable corpora, such as bilingual news articles (Zhao and Vogel, 2002; Utiyama and Isahara, 2003; Munteanu andMarcu, 2005; Tillmann, 2009; Abdul-Rauf and Schwenk, 2011), patent data (Utiyama and Isahara, 2007; Lu et al., 2010) and Wikipedia (Adafre and de Rijke, 2006; Smith et al., 2010).",
        "Few studies have been conducted on quasi?comparable corpora.",
        "Quasi?comparable corpora are available in far larger quantities than noisy parallel or comparable corpora, while the parallel sentence extraction task is significantly more difficult.",
        "While most studies are interested in language pairs between English and other languages, we focus on Chinese?Japanese, where parallel corpora are very scarce.",
        "This study extracts Chinese?Japanese parallel sentences from quasi?",
        "comparable corpora.",
        "We adopt a system proposed by Munteanu and Marcu (2005), which is for parallel sentence extraction from comparable corpora.",
        "We extend the system in several aspects to make it even suitable for quasi?comparable corpora.",
        "The core component of the system is a classifier which can identify parallel sentences from non?parallel sentences.",
        "Previous method of classifier training by the Cartesian product is not practical, because it differs from the real process of parallel sentence extraction.",
        "We propose a novel",
        "method of classifier training and testing that simulates the real sentence extraction process, which guarantees the quality of the extracted sentences.",
        "Since Chinese characters are used both in Chinese and Japanese, they can be powerful linguistic clues to identify parallel sentences.",
        "Therefore, we use Chinese character features, which significantly improve the accuracy of the classifier.",
        "We conduct parallel sentence extraction experiments on quasi?comparable corpora, and evaluate the quality of the extracted sentences from the perspective of MT performance.",
        "Experimental results show that our proposed system performs significantly better than the previous study."
      ]
    },
    {
      "heading": "2 Parallel Sentence Extraction System",
      "text": [
        "The overview of our parallel sentence extraction system is presented in Figure 1.",
        "Source sentences are translated to target language using a SMT system (1).",
        "We retrieve the top N documents from target language corpora with a information retrieval (IR) framework, using the translated sentences as queries (2).",
        "For each source sentence, we treat all target sentences in the retrieved documents as candidates.",
        "Then, we pass the candidate sentence pairs through a sentence ratio filter and a word?",
        "overlap?based filter based on a probabilistic dictionary, to reduce the candidates keeping more reliable sentences (3).",
        "Finally, a classifier trained on a small number of parallel sentences, is used to identify the parallel sentences from the candidates (4).",
        "A parallel corpus is needed to train the SMT system, generate the probabilistic dictionary and train the classifier.",
        "Our system is inspired by Munteanu and Marcu (2005), however, there are several differences.",
        "The first difference is query generation.",
        "Munteanu and Marcu (2005) generate queries by taking the top N translations of each source word according to the probabilistic dictionary.",
        "This method is imprecise due to the noise in the dictionary.",
        "Instead, we adopt a method proposed by Abdul?",
        "Rauf and Schwenk (2011).",
        "We translate the source sentences to target language with a SMT system trained on the parallel corpus.",
        "Then use the translated sentences as queries.",
        "This method can generate more precise queries, because phrase?based MT is better than word?based translation.",
        "Another difference is that we do not conduct document matching.",
        "The reason is that documents on the same topic may not exist in quasi?",
        "comparable corpora.",
        "Instead, we retrieve the top N documents for each source sentence.",
        "In comparable corpora, it is reasonable to only use the best target sentence in the retrieved documents as candidates (Abdul-Rauf and Schwenk, 2011).",
        "In quasi?comparable corpora, it is important to further guarantee the recall.",
        "Therefore, we keep all target sentences in the retrieved documents as candidates.",
        "Our system also differs by the way of classifier training and testing, which is described in Section 3 in detail."
      ]
    },
    {
      "heading": "3 Binary Classification of Parallel",
      "text": []
    },
    {
      "heading": "Sentence Identification",
      "text": [
        "Parallel sentence identification from non?parallel sentences can be seen as a binary classification problem (Munteanu and Marcu, 2005; Tillmann, 2009; Smith et al., 2010; S?tefa?nescu et al., 2012).",
        "Since the quality of the extracted sentences is determined by the accuracy of the classifier, the classifier becomes the core component of the extraction system.",
        "In this section, we first describe the training and testing process, then introduce the features we use for the classifier."
      ]
    },
    {
      "heading": "3.1 Training and Testing",
      "text": [
        "Munteanu and Marcu (2005) propose a method of creating training and test instances for the classifier.",
        "They use a small number of parallel sentences as positive instances, and generate non?parallel sentences from the parallel sentences as negative instances.",
        "They generate all the sentence pairs except the original parallel sentence pairs in the Cartesian product, and discard the pairs that do not fulfill the condition of a sentence ratio filter and a word?overlap?based filter.",
        "Furthermore, they randomly discard some of the non?parallel sentences when necessary, to guarantee the ratio of negative to positive instances smaller than five for the performance of the classifier.",
        "Creating instances by using the Cartesian product is not practical, because it differs from the real process of parallel sentence extraction.",
        "Here, we propose a novel method of classifier training and testing that simulates the real parallel sentence extraction process.",
        "For training, we first select 5k parallel sentences from a parallel corpus.",
        "Then translate the source side of the selected sentences to target language with a SMT system trained on the parallel corpus excluding the selected parallel sentences.",
        "We retrieve the top N documents from the target language side of the parallel corpus, using the translated sentences as queries.",
        "For each source sentence, we consider all target sentences in the retrieved documents as candidates.",
        "Finally, we pass the candidate sentence pairs through a sentence ratio filter and a word?overlap?based filter, and get the training instances.",
        "We treat the sentence pairs that exist in the original 5k parallel sentences as positive instances, while the remainder as negative instances.",
        "Note that positive instances may be less than 5k, because some of the parallel sentences do not pass the IR framework and the filters.",
        "For the negative instances, we also randomly discard some of them when necessary, to guarantee the ratio of negative to positive instances smaller than five.",
        "Test instances are generated by another 5k parallel sentences from the parallel corpus using the same method.",
        "There are several merits of the proposed method.",
        "It can guarantee the quality of the extracted sentences, because of the similarity between the real sentence extraction process.",
        "Also, features from the IR results can be used to further improve the accuracy of the classifier.",
        "The proposed method can be evaluated not only on the test sentences that passed the IR framework and the filters, but also on all the test sentences, which is similar to the evaluation for the real extraction process.",
        "However, there is a limitation of our method that a both sentence?level and document?",
        "level aligned parallel corpus is needed."
      ]
    },
    {
      "heading": "3.2 Features",
      "text": [
        "The following features are the basic features we use for the classifier, which are proposed by Munteanu and Marcu (2005):",
        "?",
        "Sentence length, length difference and length ratio.",
        "?",
        "Percentage of words on each side that have a translation on the other side (according to the probabilistic dictionary).",
        "?",
        "Alignment features: ?",
        "Percentage and number of words that have no connection.",
        "?",
        "The top three largest fertilities.",
        "?",
        "Length of the longest contiguous connected span.",
        "?",
        "Length of the longest unconnected sub",
        "string.",
        "Alignment features are extracted from the alignment results of the parallel and non?parallel sentences used as instances for the classifier.",
        "Note that alignment features may be unreliable when the quantity of non?parallel sentences is significantly larger than parallel sentences.",
        "Different from other language pairs, Chinese and Japanese share Chinese characters.",
        "In Chinese the Chinese characters are called Hanzi, while in Japanese they are called Kanji.",
        "Hanzi can be divided into two groups, Simplified Chinese (used in mainland China and Singapore) and Traditional Chinese (used in Taiwan, Hong Kong and Macau).",
        "The number of strokes needed to write characters",
        "(TC denotes Traditional Chinese and SC denotes Simplified Chinese).",
        "has been largely reduced in Simplified Chinese, and the shapes may be different from those in Traditional Chinese.",
        "Because Kanji characters originated from ancient China, many common Chinese characters exist between Hanzi and Kanji.",
        "Table 1 gives some examples of common Chinese characters in Traditional Chinese, Simplified Chinese and Japanese with their Unicode.",
        "Since Chinese characters contain significant semantic information, and common Chinese characters share the same meaning, they can be valuable linguistic clues for many Chinese?Japanese NLP tasks.",
        "Many studies have exploited common Chinese characters.",
        "Tan et al. (1995) used the occurrence of identical common Chinese characters in Chinese and Japanese (e.g. ?snow?",
        "in Table 1) in automatic sentence alignment task for document?",
        "level aligned text.",
        "Goh et al. (2005) detected common Chinese characters where Kanji are identical to Traditional Chinese, but different from Simplified Chinese (e.g. ?love?",
        "in Table 1).",
        "Using a Chinese encoding converter1 that can convert Traditional Chinese into Simplified Chinese, they built a Japanese?Simplified Chinese dictionary partly using direct conversion of Japanese into Chinese for Japanese Kanji words.",
        "Chu et al. (2011) made use of the Unihan database2 to detect common Chinese characters which are visual variants of each other (e.g. ?begin?",
        "in Table 1), and proved the effectiveness of common Chinese characters in Chinese?Japanese phrase alignment.",
        "Chu et al.",
        "(2012a) exploited common Chinese characters in Chinese word segmentation optimization, which improved the translation performance.",
        "In this study, we exploit common Chinese char",
        "acters in parallel sentence extraction.",
        "Chu et al.",
        "(2011) investigated the coverage of common Chinese characters on a scientific paper abstract parallel corpus, and showed that over 45% Chinese Hanzi and 75% Japanese Kanji are common Chinese characters.",
        "Therefore, common Chinese characters can be powerful linguistic clues to identify parallel sentences.",
        "We make use of the Chinese character mapping table created by Chu et al. (2012b) to detect common Chinese characters.",
        "Following features are used.",
        "We use an example of Chinese?",
        "Japanese parallel sentence presented in Figure 2 to explain the features in detail, where common Chinese characters are in bold and linked with dotted lines.",
        "?",
        "Number of Chinese characters on each side (Zh: 18, Ja: 14).",
        "?",
        "Percentage of Chinese characters out of all characters on each side (Zh: 18/20=90%, Ja: 14/32=43%).",
        "?",
        "Ratio of Chinese character numbers on both sides (18/14=128%).",
        "?",
        "Number of n?gram common Chinese characters (1?gram: 12, 2?gram: 6, 3?gram: 2, 4?",
        "gram: 1).",
        "?",
        "Percentage of n?gram common Chinese characters out of all n?gram Chinese characters on each side (Zh: 1?gram: 12/18=66%, 2?",
        "gram: 6/16=37%, 3?gram: 2/14=14%, 4?",
        "gram: 1/12=8%; Ja: 1?gram: 12/14=85%, 2?gram: 6/9=66%, 3?gram=: 2/5=40%, 4?",
        "gram: 1/3=33%).",
        "Note that Chinese character features are only applicable to Chinese?Japanese.",
        "However, since Chinese and Japanese character information is a kind of cognates (words or languages which have the same origin), the similar idea can be applied to other language pairs by using cognates.",
        "Cognates among European languages have been shown effective in word alignments (Kondrak et al., 2003).",
        "We also can use cognates for parallel sentence extraction."
      ]
    },
    {
      "heading": "3.3 Rank Feature",
      "text": [
        "One merit of our classifier training and testing method is that features from the IR results can be used.",
        "Here, we use the ranks of the retrieved documents returned by the IR framework as feature."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": [
        "We conducted classification and translation experiments to evaluate the effectiveness of our proposed parallel sentence extraction system."
      ]
    },
    {
      "heading": "4.1 Data",
      "text": [
        "The parallel corpus we used is a scientific paper abstract corpus provided by JST3 and NICT4.",
        "This corpus was created by the Japanese project ?Development and Research of Chinese?",
        "Japanese Natural Language Processing Technology?, containing various domains such as chemistry, physics, biology and agriculture etc.",
        "This corpus is aligned in both sentence?level and document?level, containing 680k sentences and 100k articles.",
        "The quasi?comparable corpora we used are scientific paper abstracts collected from academic websites.",
        "The Chinese corpora were collected from CNKI5, containing 420k sentences and 90k articles.",
        "The Japanese corpora were collected from CiNii6 web portal, containing 5M sentences and 880k articles.",
        "Note that since the paper abstracts in these two websites were written by Chinese and Japanese researchers respectively through different periods, documents on the same topic may not exist in the collected corpora.",
        "We investigated the domains of the Chinese and Japanese corpora in detail.",
        "We found that most documents in the Chinese corpora belong to the domain of chemistry.",
        "While the Japanese corpora contain various domains such as chemistry, physics, biology and computer science etc.",
        "However, the domain information is unannotated in both corpora."
      ]
    },
    {
      "heading": "4.2 Classification Experiments",
      "text": [
        "We conducted experiments to evaluate the accuracy of the proposed method of classification, us",
        "ing different 5k parallel sentences from the parallel corpus as training and test data.",
        "?",
        "Probabilistic dictionary: We took the top 5 translations with translation probability larger than 0.1 created from the parallel corpus.",
        "?",
        "IR tool: Indri7 with the top 10 results.",
        "?",
        "Segmenter: For Chinese, we used a segmenter optimized for Chinese?Japanese SMT (Chu et al., 2012a).",
        "For Japanese, we used JUMAN (Kurohashi et al., 1994).",
        "?",
        "Alignment: GIZA++8.",
        "?",
        "SMT: We used the state?of?the?art phrase?",
        "based SMT toolkit Moses (Koehn et al., 2007) with default options, except for the distortion limit (6?20).",
        "?",
        "Classifier: LIBSVM9 with 5?fold cross?",
        "validation and radial basis function (RBF) kernel.",
        "?",
        "Sentence ratio filter threshold: 2. ?",
        "Word?overlap?based filter threshold: 0.25. ?",
        "Classifier probability threshold: 0.5.",
        "We evaluate the performance of classification by computing precision, recall and F?value, defined as: precision = 100?",
        "classified well classified parallel",
        "Where classified well is the number of pairs that the classifier correctly identified as parallel, classified parallel is the number of pairs that the classifier identified as parallel, true parallel is the number of real parallel pairs in the test set.",
        "Note that we only use the top 1 result identified as parallel by the classifier for evaluation.",
        "We conducted classification experiments, comparing the following three experimental settings:",
        "?",
        "Munteanu+ 2005: Only using the features proposed by Munteanu and Marcu (2005).",
        "?",
        "+Chinese character: Add the Chinese character features.",
        "?",
        "+Rank: Further add the rank feature.",
        "Results evaluated for the test sentences that passed the IR framework and the filters, and all the test sentences are shown in Table 2.",
        "We can see that the Chinese character features can significantly improve the accuracy.",
        "The accuracy can be further improved by the rank feature."
      ]
    },
    {
      "heading": "4.3 Translation Experiments",
      "text": [
        "We extracted parallel sentences from the quasi?",
        "comparable corpora, and evaluated Chinese?to?",
        "Japanese MT performance by appending the extracted sentences to two baseline settings.",
        "?",
        "Baseline: Using all the 680k parallel sentences in the parallel corpus as training data (containing 11k sentences of chemistry domain).",
        "?",
        "Tuning: Using another 368 sentences of chemistry domain.",
        "?",
        "Test: Using another 367 sentences of chemistry domain.",
        "?",
        "Language model: 5?gram LM trained on the Japanese side of the parallel corpus (680k sentences) using SRILM toolkit10.",
        "?",
        "Classifier probability threshold: 0.6.",
        "The reason we evaluate on chemistry domain is the one we described in Section 4.1.2 that most documents in the Chinese corpora belong to the domain of chemistry.",
        "We keep all the sentence pairs rather than the top 1 result (used in the classification evaluation) identified as parallel by the classifier.",
        "The other settings are the same as the ones used in the classification experiments."
      ]
    },
    {
      "heading": "4.3.2 Results",
      "text": [
        "Numbers of extracted sentences using different classifiers are shown in Table 3, where ?",
        "Munteanu+ 2005 (Cartesian): Classifier trained using the Cartesian product, and only using the features proposed by Munteanu and Marcu (2005).",
        "?",
        "Munteanu+ 2005 (Proposed): Classifier trained using the proposed method, and only using the features proposed by Munteanu and Marcu (2005).",
        "?",
        "+Chinese character (Proposed): Add the Chinese character features.",
        "?",
        "+Rank (Proposed): Further add the rank feature.",
        "We can see that the extracted number is significantly decreased by the proposed method compared to the Cartesian product, which may indicate the quality improvement of the extracted sentences.",
        "Adding more features further decreases the number.",
        "We conducted Chinese?to?Japanese translation experiments by appending the extracted sentences to the baseline.",
        "BLEU?4 scores for experiments are shown in Table 4.",
        "We can see that our proposed method of classifier training performs better than the Cartesian product.",
        "Adding the Chinese character features and rank feature further improves the translation performance significantly.",
        "result is better than ?Munteanu+ 2005 (Cartesian)?",
        "significantly at p < 0.05 and p < 0.01 respectively, ?*?",
        "denotes the result is better than ?Baseline?",
        "significantly at p < 0.01)."
      ]
    },
    {
      "heading": "4.3.3 Discussion",
      "text": [
        "The translation results indicate that compared to the previous study, our proposed method can extract sentences with better qualities.",
        "However, when we investigated the extracted sentences, we found that most of the extracted sentences are not sentence?level parallel.",
        "Instead, they contain many parallel subsentential fragments.",
        "Figure 3 presents two examples of sentence pairs extracted by ?+Rank (Proposed)?, where parallel subsentential fragments are in bold.",
        "We investigated the alignment results of the extracted sentences.",
        "We found that most of the parallel subsentential fragments were correctly aligned with the help of the parallel sentences in the baseline system.",
        "Therefore, translation performance was improved by appending the extracted sentences.",
        "However, it also led to many wrong alignments among the non?",
        "parallel fragments which are harmful to translation.",
        "In the future, we plan to further extract these parallel subsentential fragments, which can be more effective for SMT (Munteanu and Marcu, 2006)."
      ]
    },
    {
      "heading": "5 Related Work",
      "text": [
        "As parallel sentences trend to appear in similar document pairs, many studies first conduct document matching, then identify the parallel sentences from the matched document pairs (Utiyama and Isahara, 2003; Fung and Cheung, 2004; Munteanu and Marcu, 2005).",
        "Approaches without document matching also have been proposed (Tillmann, 2009; Abdul-Rauf and Schwenk, 2011; S?tefa?nescu et al., 2012).",
        "These studies directly retrieve candidate sentence pairs, and select the parallel sentences using some filtering methods.",
        "We adopt a moderate strategy, which retrieves candidate documents for sentences.",
        "The way of parallel sentence identification can be specified with two different approaches: binary classification (Munteanu and Marcu, 2005; Tillmann, 2009; Smith et al., 2010; S?tefa?nescu et al., 2012) and translation similarity measures (Utiyama and Isahara, 2003; Fung and Cheung, 2004; Abdul-Rauf and Schwenk, 2011).",
        "We adopt the binary classification approach with a novel classifier training and testing method and Chinese character features.",
        "Few studies have been conducted for extracting parallel sentences from quasi?comparable corpora.",
        "We are aware of only two previous efforts.",
        "Fung and Cheung (2004) proposed a multilevel bootstrapping approach.",
        "Wu and Fung (2005) exploited generic bracketing Inversion Transduction Grammars (ITG) for this task.",
        "Our approach differs from the previous studies that we extend the approach for comparable corpora in several aspects to make it work well for quasi?comparable corpora."
      ]
    },
    {
      "heading": "6 Conclusion and Future Work",
      "text": [
        "In this paper, we proposed a novel method of classifier training and testing that simulates the real parallel sentence extraction process.",
        "Furthermore, we used linguistic knowledge of Chinese character features.",
        "Experimental results of parallel sentence extraction from quasi?comparable corpora indicated that our proposed system performs significantly better than the previous study.",
        "Our approach can be improved in several aspects.",
        "One is bootstrapping, which has been proven effective in some related works (Fung and Cheung, 2004; Munteanu and Marcu, 2005).",
        "In our system, bootstrapping can be done not only for extension of the probabilistic dictionary, but also for improvement of the SMT system used to translate the source language to target language for query generation.",
        "Moreover, as parallel sentences rarely exist in quasi?comparable corpora, we plan to extend our system to parallel subsentential fragment extraction.",
        "Our study showed that Chinese character features are helpful for Chinese?",
        "Japanese parallel sentence extraction.",
        "We plan to apply the similar idea to other language pairs by using cognates."
      ]
    }
  ]
}
