{
  "info": {
    "authors": [
      "Kai-Wei Chang",
      "Rajhans Samdani",
      "Dan Roth"
    ],
    "book": "EMNLP",
    "id": "acl-D13-1057",
    "title": "A Constrained Latent Variable Model for Coreference Resolution",
    "url": "https://aclweb.org/anthology/D13-1057",
    "year": 2013
  },
  "references": [
    "acl-D08-1031",
    "acl-D08-1069",
    "acl-D10-1048",
    "acl-D10-1125",
    "acl-D12-1113",
    "acl-H05-1004",
    "acl-J01-4004",
    "acl-M95-1005",
    "acl-N07-1011",
    "acl-N07-1030",
    "acl-N10-1061",
    "acl-N10-1112",
    "acl-N12-1087",
    "acl-P02-1014",
    "acl-P06-2019",
    "acl-P09-1074",
    "acl-P11-1082",
    "acl-P11-1115",
    "acl-P11-1138",
    "acl-P12-1041",
    "acl-P13-1012",
    "acl-W04-2401",
    "acl-W11-1901",
    "acl-W11-1902",
    "acl-W11-1904",
    "acl-W12-4501",
    "acl-W12-4502",
    "acl-W12-4504",
    "acl-W12-4511",
    "acl-W12-4513"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Coreference resolution is a well known clustering task in Natural Language Processing.",
        "In this paper, we describe the Latent Left Linking model (L3M), a novel, principled, and linguistically motivated latent structured prediction approach to coreference resolution.",
        "We show that L3M admits efficient inference and can be augmented with knowledge-based constraints; we also present a fast stochastic gradient based learning.",
        "Experiments on ACE and Ontonotes data show that L3M and its constrained version, CL3M, are more accurate than several state-of-the-art approaches as well as some structured prediction models proposed in the literature."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Coreference resolution is a challenging task, that involves identification and clustering of noun phrases mentions that refer to the same real-world entity.",
        "Most machine learning approaches to coreference resolution learn a scoring function to estimate the compatibility between two mentions or two sets of previously clustered mentions.",
        "Then, a decoding algorithm is designed to aggregate these scores and find an optimal clustering assignment.",
        "The most popular of these frameworks is the pairwise mention model (Soon et al., 2001; Ng and Cardie, 2002; Bengtson and Roth, 2008), which learns a compatibility score of mention-pairs and uses these pairwise scores to obtain a global clustering.",
        "Recently, efforts have been made (Haghighi and Klein, 2010; Rahman and Ng, 2011b; Rahman and Ng, 2011c) to consider models that capture higher order interactions, in particular, between mentions and previously identified entities (that is, between mentions and clusters).",
        "While such models are potentially more expressive, they are largely based on heuristics to achieve computational tractability.",
        "This paper focuses on a novel and principled machine learning framework that pushes the state-of-the-art while operating at a mention-pair granularity.",
        "We present two models ?",
        "the Latent Left-Linking Model (L3M), and a version of that is augmented with domain knowledge-based constraints, the Constrained Latent Left-Linking Model (CL3M).",
        "L3M admits efficient inference, linking each mention to a previously occurring mention to its left, much like the existing best-left-link inference models (Ng and Cardie, 2002; Bengtson and Roth, 2008).",
        "However, unlike previous best-link techniques, learning in our case is performed jointly with decoding ?",
        "we present a novel latent structural SVM approach, optimized using a fast stochastic gradient-based technique.",
        "Furthermore, we present a probabilistic generalization of L3M that is more expressive in that it is capable of considering mention-entity interactions using scores at the mention-pair granularity.",
        "We augment this model with a temperature-like parameter (Samdani et al., 2012) to provide additional flexibility.",
        "CL3M augments L3M with knowledge-based constraints following (Roth and Yih, 2004; Denis and Baldridge, 2007).",
        "This capability is very desirable as shown by the success of the rule-based deterministic approach of Raghunathan et al. (2010) in the CoNLL shared task 2011 (Pradhan et al., 2011).",
        "In L3M, domain-specific constraints are incorporated into learning and inference in a straightforward way.",
        "CL3M scores a mention's contribution to its cluster by combining the corresponding score",
        "of the underlying L3M model with that from a set of constraints.",
        "Most importantly, in our experiments on benchmark coreference datasets, we show that CL3M, with just five constraints, compares favorably with other, more complicated, state-of-the-art algorithms on a variety of evaluation metrics.",
        "Overall, the main contribution of this paper is a principled machine learning model operating at mention-pair granularity, using easy to implement constraint-augmented inference and learning, that yields competitive results on coreference resolution on Ontonotes-5.0 (Pradhan et al., 2012) and ACE 2004 (NIST, 2004)."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "The idea of Latent Left-linking Model (L3M) is inspired by a popular inference approach to coreference which we call the Best-Left-Link approach (Ng and Cardie, 2002; Bengtson and Roth, 2008).",
        "In the best-left-link strategy, each mention i is connected to the best antecedent mention j with j < i (i.e. a mention occurring to the left of i, assuming a left-to-right reading order), thereby creating a left-link.",
        "The ?best?",
        "antecedent mention is the one with the highest pairwise score, wij ; furthermore, if wij is below some threshold, say 0, then i is not connected to any antecedent mention.",
        "The final clustering is a transitive closure of these ?best?",
        "links.",
        "The intuition behind best-left-link strategy is based on how humans read and decipher coreference links ?",
        "they mostly rely on information to the left of the mention when deciding whether to add it to a previously constructed cluster or not.",
        "This strategy has been successful and commonly used in coreference resolution (Ng and Cardie, 2002; Bengtson and Roth, 2008; Stoyanov et al., 2009).",
        "However, most works have developed ad-hoc approaches to implement this idea.",
        "For instance, Bengtson and Roth (2008) train a model w on binary training data generated by taking for each mention, the closest antecedent coreferent mention as a positive example, and all the other mentions as negative examples.",
        "Similar approaches to training and, additionally, decoupling the training stage from the clustering stage were used by other systems.",
        "In this paper, we formalize the learning problem of the best-left-link model as a structured prediction problem and analyze our system with detailed experiments.",
        "Furthermore, we generalize this approach by considering multiple pairwise left-links instead of just the best link, efficiently capturing the notion of a mention-to-cluster link.",
        "Many techniques in the coreference literature break away from the mention pair-based, best-left-link paradigm.",
        "Denis and Baldridge (2008) and Ng (2005) learn a local ranker to rank the mention pairs based on their compatibility.",
        "While these approaches achieve decent empirical performance, it is unclear why these are the right ways to train the model.",
        "Some techniques consider a more expressive model by using features defined over mention-cluster or cluster-cluster (Rahman and Ng, 2011c; Stoyanov and Eisner, 2012; Haghighi and Klein, 2010).",
        "For these models, the inference and learning algorithms are usually complicated.",
        "Very recently, Durrett et al. (2013) propose a probabilistic model which enforces structural agreement constraints between specified properties of mention cluster when using a mention-pair model.",
        "This approach is very related to the probabilistic extension of our method as both models attempt to leverage entity-level information from mention-pair features.",
        "However, our approach is simpler because it directly considers the probabilities of multiple links.",
        "Furthermore, while their model performs only slightly better than the Stanford rule-based system (Lee et al., 2011), we significantly outperform this system.",
        "Most importantly, our model obtains state-of-the-art performance on OntoNotes-5.0 while still operating at the mention-pair granularity.",
        "We believe that this is due to our novel and principled structured prediction framework which results in accurate (and efficient) training.",
        "Several structured prediction techniques have been applied to coreference resolution in the machine learning literature.",
        "For example, McCallum and Wellner (2003) and Finley and Joachims (2005) model coreference as a correlational clustering problem (Bansal et al., 2002) on a complete graph over the mentions with edge weights given by the pairwise classifier.",
        "However, correlational clustering is known to be NP Hard (Bansal et al., 2002); nonetheless, an ILP solver or an approximate inference algorithm can be used to solve this problem.",
        "Another approach proposed by Yu and Joachims (2009) formu",
        "lates coreference with latent spanning trees.",
        "However, their approach has no directionality between mentions, whereas our latent structure captures the natural left-to-right ordering of mentions.",
        "In our experiments (Sec.",
        "5), we show that our technique vastly outperforms both the spanning tree and the correlational clustering techniques.",
        "We also compare with (Fernandes et al., 2012) and the publicly available Stanford coreference system (Raghunathan et al., 2010; Lee et al., 2011), a state-of-the-art rule-based system.",
        "Finally, some research (Ratinov and Roth, 2012; Bansal and Klein, 2012; Rahman and Ng, 2011a) has tried to integrate world knowledge from web-based statistics or knowledge bases into a coreference system.",
        "World knowledge is potentially useful for resolving coreference and can be injected into our system in a straightforward way via the constraints framework.",
        "We will show an example of incorporating our system with name-entity and WordNet-based similarity metric (Q.",
        "Do, 2009) in Sec. 5.",
        "Including massive amount of information from knowledge resources is not the focus of this paper and may distort the comparison with other relevant models but our results indicate that this is doable in our model, and may provide significant improvements."
      ]
    },
    {
      "heading": "3 Latent Left-Linking Model with Constraints",
      "text": [
        "In this section, we describe our Constrained Latent Left-Linking Model (CL3M).",
        "CL3M is inspired by a few ideas from the literature: (a) the popular Best-Left-Link inference approach to coreference (Ng and Cardie, 2002; Bengtson and Roth, 2008), and (b) the injection of domain knowledge-based constraints for structured prediction (Roth and Yih, 2004; Clarke and Lapata, 2006; Chang et al., 2012b; Ganchev et al., 2010; Koo et al., 2010; Pascal and Baldridge, 2009).",
        "We first introduce the notion of a pairwise mention-scorer, then introduce our Left-Linking Model (L3M), and finally describe how to inject constraints into our model.",
        "Let d be a document with md mentions.",
        "Mentions are denoted solely using their indices, ranging from 1 to md.",
        "A coreference clustering C for document d is a collection of disjoint sets partitioning the set {1, .",
        ".",
        ".",
        ", md}.",
        "We represent C as a binary function with C(i, j) = 1 if mentions i and j are coreferent, otherwise C(i, j) = 0.",
        "Let s(C;w, d) be the score of a given clustering C for a given document and a given pairwise weight vector w. Then, during inference, a clustering C is predicted by maximizing the scoring function s(C;w, d), over all valid (i.e. satisfying symmetry and transitivity) clustering binary functions C : {1, .",
        ".",
        ".",
        ", md}?",
        "{1, .",
        ".",
        ".",
        ", md} ?",
        "{0, 1}."
      ]
    },
    {
      "heading": "3.1 Mention Pair Scorer",
      "text": [
        "We model the task of coreference resolution using a pairwise scorer which indicates the compatibility of a pair of mentions.",
        "The inference routine then predicts the final clustering ?",
        "a structured prediction problem ?",
        "using these pairwise scores.",
        "Specifically, for any two mentions i and j (w.l.o.g.",
        "j < i), we produce a pairwise compatibility score wji using extracted features ?",
        "(j, i) as",
        "where w is a weight parameter that is learned."
      ]
    },
    {
      "heading": "3.2 Latent Left-Linking Model",
      "text": [
        "Our inference algorithm is inspired by the best-left-link approach.",
        "In particular, the score s(C; d,w) is defined so that each mention links to the antecedent mention (to its left) with the highest score (as long as the score is above some threshold, say, 0).",
        "Specifically:",
        "In order to simplify the notation, we introduce a dummy mention with index 0, which is to the left (i.e. appears before) of all other mentions and has w0i = 0 for all actual mentions i > 0.",
        "For a given clustering C, if a mention i is not co-clustered with any previous actual mention j, 0 < j < i, then we assume that i links to 0 and C(i, 0) = 1.",
        "In other words, C(i, 0) = 1 iff i is the first actual item of a cluster in C. However, such an item i is not considered to be co-clustered with 0 and for any valid clustering, item 0 is always in a singleton dummy cluster, which is eventually discarded.",
        "The important property of the score s is that it is exactly maximized",
        "by the best-left-link inference, as it maximizes individual left link scores and the creation of one left-link does not affect the creation of other left-links."
      ]
    },
    {
      "heading": "3.3 Learning",
      "text": [
        "We use a max-margin approach to learn w. We are given a training set D of documents where for each document d ?",
        "D, Cd refers to the annotated ground truth clustering.",
        "Then we learn w by minimizing",
        "where ?",
        "(C, Cd) is a loss function used in coreference.",
        "In order to achieve tractable loss-augmented minimization ?",
        "something not possible with standard loss functions used in coreference (e.g. B3 (Bagga and Baldwin, 1998)) ?",
        "we use a decomposable loss function that just counts the number of mention pairs on which C and Cd disagree:",
        "a binary indicator function.",
        "This loss function is equivalent to the numerator of the Rand index loss (Rand, 1971).",
        "With this form of loss function and using the scoring function in Eq.",
        "(2), we can",
        "where ?",
        "(Cd, i, j) = 1 ?",
        "Cd(i, j) is the loss-based margin that is 1 if i and j are not coreferent in Cd, and is 0 otherwise.",
        "In the above objective function, the left-links remain latent while we get to observe the clustering.",
        "This objective function is related to latent structural SVMs (Yu and Joachims, 2009).",
        "However Yu and Joachims (2009) use a spanning tree based latent structure which does not have the left-to-right directionality we exploit.",
        "We can minimize the above function using Concave Convex Procedure (Yuille and Rangarajan, 2003), which is guaranteed to reach the local minima.",
        "However, such a procedure is costly as it requires doing inference on all the documents to compute a single gradient update.",
        "Consequently, we choose a faster stochastic sub-gradient descent (SGD) approach.",
        "Since L(w) in Eq.",
        "(3) decomposes not only over training documents, but also over individual mentions in each document, we can perform SGD on a per-mention basis.",
        "The stochastic sub-gradient w.r.t.",
        "mention i in document d is given by",
        "While SGD has no theoretically convergence guarantee, it works excellently in our experiments.",
        "Specifically, we observe that SGD achieves similar training performance to CCCP with a speed-up of around 10,000."
      ]
    },
    {
      "heading": "3.4 Incorporating Constraints",
      "text": [
        "Next, we show how to incorporate domain knowledge-based constraints into L3M and generalize it to CL3M.",
        "In CL3M, we obtain a clustering by maximizing a constraint-augmented scoring function f given by",
        "where the second term on the R.H.S.",
        "is the score contributed by domain specific constraints ?1, .",
        ".",
        ".",
        ", ?nc with their respective scores ?1, .",
        ".",
        ".",
        ", ?nc .",
        "In particular, ?p(d, C) measures the extent to which a given clustering C satisfies the pth constraint.",
        "Note that this framework is general and can be applied to inject mention-to-cluster or cluster-to-cluster level constraints too.",
        "However, for simplicity, we consider here only constraints between mention pairs.",
        "This allows us derive fast greedy algorithm to solve the inference problem.",
        "The details of our constraints are presented in Sec. 5.",
        "All of our constraints can be categorized into two groups: ?must-link?",
        "and ?cannot-link?.?Must-link?",
        "constraints encourage a pair of mentions to connect, while ?cannot-link?",
        "constraints discourage mention pairs from being linked.",
        "Consequently, the coefficients ?p associated with ?must-link?",
        "constraints are positive while ?p for ?cannot-link?",
        "constraints are negative.",
        "In the following, we briefly discuss how to",
        "solve the inference problem with these two types of constraints.",
        "We slightly abuse notations and use ?p(j, i) to indicate the pth constraint on a pair of mentions (i, j).",
        "?p(j, i) is a binary function that is 1 iff two mentions i and j satisfy the conditions specified in constraint p. Chang et al. (2011) shows that best-left-link inference can be formulated as an ILP problem.",
        "When we add constraints, the ILP becomes: arg max",
        "where Cij ?",
        "C(i, j) is a binary variable indicating whether i and j are in the same cluster or not and Bji is an auxiliary variable indicating the best-left-link for mention i.",
        "The first set of inequality constraints in (5) enforces the transitive closure of the clustering.",
        "The constraints Bji < Cji,?i, j enforce the consistency between these two sets of variables.",
        "One can use an off-the-shelf solver to solve Eq.",
        "(5).",
        "However, when the absolute values of the constraint scores (|?p|) are high (the hard constraint case), then the following greedy algorithm approximately solves the inference efficiently.",
        "We scan the document from left-to-right (or in any other arbitrary order).",
        "When processing mention i, we find",
        "where C?",
        "is the current clustering obtained from the previous inference steps.",
        "Then, we add a link between mention i and j?.",
        "The rest of the inference process is the same as in the original best-left-link inference.",
        "Specifically, this inference procedure combines the classifier score for mention pair i, j, with the constraints score of all mentions currently co-clustered with j.",
        "We discuss this further in Section 5."
      ]
    },
    {
      "heading": "4 Probabilistic Latent Left-Linking Model",
      "text": [
        "In this section, we extend and generalize our left-linking model approach to a probabilistic model,",
        "that allows us to naturally consider mention-to-entity (or mention-to-cluster) links.",
        "While in L3M, we assumed that each mention links deterministically to the max-scoring mention on its left, in PL3M, we assume that mention i links to mention j, j ?",
        "i, with probability given by",
        "izing constant and ?",
        "?",
        "(0, 1] is a constant temperature parameter that is tuned on a development set (Samdani et al., 2012).",
        "We assume that the event that mention i links to a mention j is independent of the event that mention i?",
        "links to j?",
        "for i 6= i?.",
        "Inference with PL3M: Given the probability of a link as in Eq.",
        "(7), the probability that mention i joins an existing cluster c, Pr[c ?",
        "i; d,w], is simply the sum of the probabilities of i linking to the mentions",
        "Based on Eq.",
        "(8) and making use of the independence assumption of left-links, we follow a simple greedy clustering (or inference) algorithm: sequentially add each mention i to a previously formed cluster c?, where c?",
        "= arg maxc Pr[c ?",
        "i; d,w].",
        "If the arg max cluster is the singleton cluster with the dummy mention 0 (i.e. the score of all other clusters is below the threshold of 0), then i starts a new cluster and is not included in the dummy cluster.",
        "Note that we link a mention to a cluster taking into account all the mentions inside that cluster, mimicking the notion of a mention-to-cluster link.",
        "This provides more expressiveness than the Best-Left-Link inference, where a mention connects to a cluster solely based on a single pairwise link to some antecedent mention (the best-link mention) in that cluster.",
        "The case of ?",
        "= 0: As ?",
        "approaches zero, it is easy to show that the probability P [j ?",
        "i; d, w]",
        "in Eq.",
        "(7) approaches a Kronecker delta function that puts probability 1 on the max-scoring mention j = arg max0?k<i w??",
        "(i, j) (assuming no ties), and 0 everywhere else (Pletscher et al., 2010; Samdani et al., 2012).",
        "Consequently, as ?",
        "?",
        "0, Pr[c ?",
        "i; d,w] in Eq.",
        "8 approaches a Kronecker delta function cen-tered on the cluster containing the max-scoring mention, thus reducing to the best-link case of L3M.",
        "Thus, PL3M, when tuning the value of ?, is a strictly more general model than L3M.",
        "Learning with PL3M We use a likelihood-based approach to learning with PL3M, and first compute the probability Pr[C; d,w] of generating a clustering C, given w. We then learn w by minimizing the regularized negative log-likelihood of the data, augmenting the partition function with a loss-based margin (Gimpel and Smith, 2010).",
        "We omit the details of likelihood computation due to lack of space.",
        "With PL3M, we again follow a stochastic gradient descent technique instead of CCCP for the same reasons mentioned in Sec. 3.3.",
        "The stochastic gradient (subgradient when ?",
        "= 0) w.r.t.",
        "mention i in document d is given by",
        "where pj and p?j , j = 0, .",
        ".",
        ".",
        ", i ?",
        "1, are non-negative weights that sum to one and are given by",
        "Interestingly, the above update rule generalizes the one for L3M, as we are incorporating a weighted sum of all previous mentions in the update rule.",
        "With ?",
        "?",
        "0, the SGD in Eq.",
        "(4) converges to the SGD update in L3M (Eq.",
        "(4)).",
        "Finally, in the presence of constraints, we can fold them inside the pairwise link probabilities as in Eq.",
        "(6)."
      ]
    },
    {
      "heading": "5 Experiments and Results",
      "text": [
        "In this section, we present our experiments on the two commonly used benchmarks for coreference ?",
        "Ontonotes-5.0 (Pradhan et al., 2012) and ACE 2004 (NIST, 2004).",
        "Table 1 exhibits our bottom line results: CL3M achieves the best result reported on Ontonotes-5.0 development set and essentially ties with (Fernandes et al., 2012) on the test set.",
        "As shown in Table 3, CL3M is also the best algorithm on ACE and when evaluated on the gold mentions of Ontonotes.",
        "We show that CL3M performs particularly well on clusters containing named entity mentions, which are more important for many information extraction applications.",
        "In the rest of this section, after describing our experimental setting, we provide careful analysis of our algorithms and compare them to competitive coreference approaches in the literature."
      ]
    },
    {
      "heading": "5.1 Experimental Setup",
      "text": [
        "Datasets: ACE 2004 contains 443 documents ?",
        "we used a standard split of these documents into 268 training, 68 development, and 106 testing documents used by Culotta et al. (2007) and Bengtson and Roth (2008).",
        "OntoNotes-5.0 dataset, released for the CoNLL 2012 Shared Task (Pradhan et al., 2012), is by far the largest annotated corpus on coreference.",
        "It contains 3,145 annotated documents drawn from a wide variety of sources ?",
        "newswire, bible, broadcast transcripts, magazine articles, and web blogs.",
        "We report results on both development set and test set.",
        "To test on the development set, we further split the training data into training and development sets.",
        "Classifier details: For each of the pairwise approaches, we assume the pairwise score is given by w??",
        "(?, ?",
        ")+t where ?",
        "are the features, w is the weight vector learned by the approach, and t is a threshold which we set to 0 during learning (as in Eq.",
        "(1)), but use a tuned value (tuned on a development set) during testing.",
        "For learning with L3M, we do stochastic gradient descent with 5 passes over the data.",
        "Empirically, we observe that this is enough to generate a stable model.",
        "For PL3M (Sec.",
        "4), we tune the value of ?",
        "using the development set picking the best ?",
        "from {0.0, 0.2, .",
        ".",
        ".",
        ", 1.0}.",
        "Recall that when ?",
        "= 0, PL3M is the same as L3M.",
        "We refer to L3M and PL3M with incorporating constraints during inference as CL3M and CPL3M (Sec.",
        "3.4), respectively.",
        "Metrics: We compare the systems using three popular metrics for coreference ?",
        "MUC (Vilain et al., 1995), BCUB (Bagga and Baldwin, 1998), and",
        "Entity-based CEAF (CEAFe) (Luo, 2005).",
        "Following, the CoNLL shared tasks (Pradhan et al., 2012), we use the average F1 scores of these three metrics as the main metric of comparison.",
        "Features: We build our system on the publicly available Illinois-Coref system1 primarily because it contains a rich set of features presented in Bengtson and Roth (2008) and Chang et al. (2012a) (the latter adds features for pronominal anaphora resolution).",
        "We also compare with the Best-Left-Link approach described by Bengtson and Roth (2008).",
        "Constraints: We consider the following constraints in CL3M and CPL3M.",
        "?",
        "SameSpan: two mentions must be linked to each other if they share the same surface text span and the number of words in the text span is larger than a threshold (set as 5 in our implementation).",
        "?",
        "SameDetNom: two mentions must be linked to each other if both mentions start with a determiner and the [0,1] wordnet-based similarity score between the mention head words is above a threshold (set to 0.8).",
        "?",
        "SameProperName: two mentions must be linked if they are both proper names and the similarity score measured by a named entity-based similarity metric, Illinois NESim2, are higher than a threshold (set to 0.8).",
        "For a person entity we add additional rules to extract the first name, last name and professional title as properties.",
        "?",
        "ModifierMismatch: the constraint prevents two mentions to be linked if the head modifiers conflict.",
        "For example, the constraint prevents ?northern Taiwan?",
        "from linking to ?southern Taiwan?.",
        "We gather a list of mutual exclusive modifiers from the training data.",
        "?",
        "PropertyMismatch: the constraint prevents two mentions to be linked if their properties conflict.",
        "For example, it prevents male pronouns to link to female pronouns and ?Mr.",
        "Clinton?",
        "to link to ?Mrs.",
        "Clinton?",
        "by checking the gender property.",
        "The properties we consider are gender, number, professional title and the na",
        "mentions.",
        "We report the F1 scores (%) on various coreference metrics (MUC, BCUB, CEAF).",
        "The column AVG shows the average scores of the three.",
        "We observe that PL3M and CPL3M (see Sec. 4) yields the same performance as L3M and CL3M, respectively as the tuned ?",
        "for all the datasets turned out to be 0. tionality.",
        "While the ?must-link?",
        "constraints described in the paper can be treated as features, due to their high precision, treating them as hard constraints (set ?",
        "to a high value) is a safe and direct way to inject human knowledge into the learning model.",
        "Moreover, our framework allows a constraint to use information from previous decisions (such as ?cannot-link?",
        "constraints).",
        "Treating such constraints as features will complicate the learning model."
      ]
    },
    {
      "heading": "5.2 Performance of the End-to-End System",
      "text": [
        "We compare our system with the top systems reported in the CoNLL shared task 2012 as well as with the Stanford's publicly released rule-based system (Lee et al., 2013; Lee et al., 2011), which won the CoNLL 2011 Shared Task (Pradhan et al., 2011).",
        "Note that all the systems use the same annotations (e.g., gender prediction, part-of-speech tags, name entity tags) provided by the shared task organizers.",
        "However, each system implements its own mention detector and pipelines the identified mentions into the coreference clustering component.",
        "Moreover, different systems use a different set of features.",
        "In order to partially control for errors on mention detection and better evaluate the clustering component in our coreference system, we will also present results on correct (gold) mentions in the next section.",
        "Table 1 shows the end-to-end results.",
        "On the development set, only the best performing system of Fernandes et al. (2012) is better than L3M, but this difference disappears when we use our system with constraints, CL3M.",
        "Although our system is much simple, it achieves the best B3 score on the test set and is competitive with the best system participated in the CoNLL shared task 2012.",
        "Performance on named entities: The coreference annotation in Ontonotes 5.0 includes various types of mentions.",
        "However, not all mention types are equally interesting.",
        "In particular, clusters which contain at least one proper name or a named entity mention are more important for information extraction tasks like Wikification (Mihalcea and Csomai, 2007; Ratinov et al., 2011), cross-document coreference resolution (Bagga and Baldwin, 1998), and entity linking and knowledge based population (Ji and Grishman, 2011).",
        "Inspired by this, we compare our system to the best systems in the CoNLL shared task of 2011 (Stanford (Lee et al., 2011)) and 2012 (Fernandes (Fernandes et al., 2012)) on the following specific tasks on Ontonotes-5.0.",
        "?",
        "ENT-C: Evaluate the system on clusters that contain at least one proper name mention.",
        "We generate the gold annotation and system outputs by using the gold and predicted name entity tag annotations provided by the CoNLL shard task 2012.",
        "That is, if a cluster does not include any name entity mention, then it will be removed from the final clustering.",
        "?",
        "PER-C: As in the construction of ENT-C, but here we only consider clusters which contain at least one ?Person (PER)?",
        "entity.",
        "?",
        "ORG-C: As in the construction of Entity-C, but here we only consider clusters which contain at least one ?Organization (ORG)?",
        "entity.",
        "Typically, the clusters that get ignored in the above definitions contain only first and second person",
        "5.0 data.",
        "We compare our system to Fernandes (Fernandes et al., 2012) and Stanford (Lee et al., 2013) systems.",
        "pronouns (which often happens in transcribed discourse.)",
        "Also note that all the systems are trained with the same name entity tags, provided by the shared task organizers, and we use the same name entity tags to construct the specific clustering.",
        "Also, in order to further ensure fairness, we do not tune our system to favor the evaluation of these specific types of clusters.",
        "We chose to do so because we only have access to the system output of Fernandes et al. (2012).",
        "Table 2 shows the results.",
        "The performance of all systems degrades when considering only clusters that contain name entities, indicating that ENT-C is actually a harder task than the original coreference resolution problem.",
        "In particular, resolving ORG coreferent clusters is hard, because names of organizations are sometimes confused with person names, and they can be referred to using a range of pronouns (including ?we?",
        "and ?it?).",
        "Overall, CL3M outperforms all the competing systems on the clusters that contain at least one specific type of entity by a margin larger than that for the overall coreference."
      ]
    },
    {
      "heading": "5.3 Analysis on Gold Mentions",
      "text": [
        "To better understand the contribution of our joint learning and clustering model, we present experiments assuming that gold mentions are given.",
        "The definitions of gold mentions in ACE and Ontonotes are different because Ontonotes-5.0 excludes singleton clusters in the annotation.",
        "In addition, Ontonotes includes longer mentions; for example, it includes NP and appositives in the same mention.",
        "We compare with the publicly available Stanford (Lee et al., 2011) and IllinoisCoref (Chang et al., 2012a) systems; the system of Fernandes et al. (2012) is not publicly available.",
        "In addition, we also compare with the following two structured prediction baselines that use the same set of features as L3M and PL3M.",
        "All-Link-Red.",
        "is based on correlational clustering; Spanning is based on latent spanning forest based clustering (see Sec. 2).",
        "Our proposed approach is L3M (Sec.",
        "3) and PL3M (sec.",
        "4).",
        "CL3M and CPL3M are the version with incorporating constraints.",
        "1.",
        "All-Link-Red: a reduced and faster alternative to the correlational clustering based approach (Finley and Joachims, 2005).",
        "We implemented this algorithm as an ILP and droped one of the three transitivity constraints for each triplet of mention variables.",
        "Following Pascal and Baldridge (2009) and Chang et al. (2011) we observe that this slightly improves the accuracy over a pure correlation clustering approach, in addition to speeding up inference.",
        "2.",
        "Spanning: the latent spanning forest based approach presented by Yu and Joachims (2009).",
        "We use the publicly available implementation provided by the authors3 for the ACE data; since their CCCP implementation is slow, we implemented our own stochastic gradient descent version to scale it to the much larger",
        "Table 3 lists the results.",
        "Although L3M is simple and use only the features defined on pairwise mentions, it compares favorably with all recently published results.",
        "Moreover, the probabilistic generalization of L3M, PL3M, achieves even better performance.",
        "For example, L3M with ?",
        "= 0.2 improves L3M with ?",
        "= 0 by 0.7 points in ACE 2004.",
        "In particular, This shows that considering more than a one left-links is helpful.",
        "This is in contrast with the predicted mentions where ?",
        "= 0 performed best.",
        "We suspect that this is because noisy mentions can hurt the performance of PL3M that takes into account not just the best scoring links, but also weaker links which are likely to be less reliable (more false positives).",
        "Also, as opposed to what is reported by Yu and Joachims (2009), the correlation clustering approach performs better than the spanning forest approach.",
        "We think that this is because we compare the systems on different metrics than they did and also because we use exact ILP inference for correlational clustering whereas Yu and Joachims (2009) used approximate greedy inference.",
        "Both L3M and PL3M can be benefit from using constraints.",
        "However, The constraints improve only marginally on the ACE 2004 data because ACE uses shorter phrases as mentions.",
        "Consequently, constraints designed for leveraging information from long mention spans are less effective.",
        "Overall, the experiments show that L3M and PL3M perform well on modeling coreference clustering."
      ]
    },
    {
      "heading": "5.4 Ablation Study of Constrains",
      "text": [
        "Finally, we study the value of individual constraints by adding one constraint at a time to the coreference system starting with the simple L3M model.",
        "The system with all the constraints added is the CL3M model introduced in Table 1.",
        "We then remove individual constraints from CL3M to assess its contribution.",
        "Table 4 shows the results on the Ontonotes dataset with predicted mentions.",
        "Overall, it is shown that each one of the constraints has a contribution, and that using all the constraints improves the performance of the system by 1.29% in the AVG F1 score.",
        "In particular, most of this improvement (1.19%) is due to the must-link constraints (the first four constraints in the table).",
        "The must-link constraints are more useful for L3M as L3M achieves higher precision than recall (e.g., the precision and",
        "cumulative performance on OntoNotes-5.0 data with predicted mentions as constraints are added one at a time into the coreference system.",
        "Then we demonstrate the value of individual constraints by leaving out one constraint at each time.",
        "recall of L3M are 78.38% and 67.96%, respectively in B3).",
        "As a result, the must-link constraints, which aim at improving the recall, do better when optimizing F1."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "We presented a principled yet simple framework for coreference resolution.",
        "Furthermore, we showed that our model can be augmented in a straightforward way with knowledge based constraints, to improve performance.",
        "We also presented a probabilistic generalization of this model that can take into account entity-mention links by considering multiple possible coreference links.",
        "We proposed a fast stochastic gradient-based learning technique for our model.",
        "Our model, while operating at mention pair granularity, obtains state-of-the-art results on OntoNotes-5.0, and performs especially well on mention clusters containing named entities.",
        "We provided a detailed analysis of our experimental results.",
        "Acknowledgments Supported by the Intelligence Advanced Research Projects Activity (IARPA) via Department of Interior National Business Center contract number D11PC20155.",
        "The U.S. Government is authorized to reproduce and distribute reprints for Governmental purposes notwithstanding any copyright annotation thereon.",
        "Disclaimer: The views and conclusions contained herein are those of the authors and should not be interpreted as necessarily representing the official policies or endorsements, either expressed or implied, of IARPA, DoI/NBC, or the U.S. Government."
      ]
    }
  ]
}
