{
  "info": {
    "authors": [
      "Ziqi Zhang",
      "Anna Lisa Gentile",
      "Isabelle Augenstein",
      "Eva Blomqvist",
      "Fabio Ciravegna"
    ],
    "book": "ACL",
    "id": "acl-P13-2052",
    "title": "Mining Equivalent Relations from Linked Data",
    "url": "https://aclweb.org/anthology/P13-2052",
    "year": 2013
  },
  "references": [
    "acl-P12-1085",
    "acl-W09-1604"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Linking heterogeneous resources is a major research challenge in the Semantic Web.",
        "This paper studies the task of mining equivalent relations from Linked Data, which was insufficiently addressed before.",
        "We introduce an unsupervised method to measure equivalency of relation pairs and cluster equivalent relations.",
        "Early experiments have shown encouraging results with an average of 0.75~0.87 precision in predicting relation pair equivalency and 0.78~0.98 precision in relation clustering."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Linked Data defines best practices for exposing, sharing, and connecting data on the Semantic Web using uniform means such as URIs and RDF.",
        "It constitutes the conjunction between the Web and the Semantic Web, balancing the richness of semantics offered by Semantic Web with the easiness of data publishing.",
        "For the last few years Linked Open Data has grown to a gigantic knowledge base, which, as of 2013, comprised 31 billion triples in 295 datasets1.",
        "A major research question concerning Linked Data is linking heterogeneous resources, the fact that publishers may describe analogous information using different vocabulary, or may assign different identifiers to the same referents.",
        "Among such work, many study mappings between ontology concepts and data instances (e.g., Isaac et al. 2007; Mi et al., 2009; Le et al., 2010; Duan et al., 2012).",
        "An insufficiently addressed problem is linking heterogeneous relations, which is also widely found in data and can cause problems in information retrieval (Fu et al., 2012).",
        "Existing work in linking relations typically employ string similarity metrics or semantic similarity mea",
        "sures that require a-priori domain knowledge and are limited in different ways (Zhong et al., 2002; Volz et al., 2009; Han et al., 2011; Zhao and Ichise, 2011; Zhao and Ichise, 2012).",
        "This paper introduces a novel method to discover equivalent groups of relations for Linked Data concepts.",
        "It consists of two components: 1) a measure of equivalency between pairs of relations of a concept and 2) a clustering process to group equivalent relations.",
        "The method is unsupervised; completely data-driven requiring no a-priori domain knowledge; and also language independent.",
        "Two types of experiments have been carried out using two major Linked Data sets: 1) evaluating the precision of predicting equivalency of relation pairs and 2) evaluating the precision of clustering equivalent relations.",
        "Preliminary results have shown encouraging results as the method achieves between 0.75~0.85 precision in the first set of experiments while 0.78~0.98 in the latter."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Research on linking heterogeneous ontological resources mostly addresses mapping classes (or concepts) and instances (Isaac et al. 2007; Mi et al., 2009; Le et al., 2010; Duan et al., 2012; Schopman et al., 2012), typically based on the notions of similarity.",
        "This is often evaluated by string similarity (e.g. string edit distance), semantic similarity (Budanitsky and Hirst, 2006), and distributional similarity based on the overlap in data usage (Duan et al., 2012; Schopman et al., 2012).",
        "There have been insufficient studies on mapping relations (or properties) across ontologies.",
        "Typical methods make use of a combination of string similarity and semantic similarity metrics (Zhong et al., 2002; Volz et al., 2009; Han et al., 2011; Zhao and Ichise, 2012).",
        "While string similarity fails to identify equivalent relations if their lexicalizations are distinct, semantic similarity often depends on taxonomic structures",
        "in existing ontologies (Budanitsky and Hirst, 2006).",
        "Unfortunately many Linked Data instances use relations that are invented arbitrarily or originate in rudimentary ontologies (Parundekar et al., 2012).",
        "Distributional similarity has also been used to discover equivalent or similar relations.",
        "Mauge et al. (2012) extract product properties from an e-commerce website and align equivalent properties using a supervised maximum entropy classification method.",
        "We study linking relations on Linked Data and propose an unsupervised method.",
        "Fu et al. (2012) identify similar relations using the overlap of the subjects of two relations and the overlap of their objects.",
        "On the contrary, we aim at identifying strictly equivalent relations rather than similarity in general.",
        "Additionally, the techniques introduced our work is also related to work on aligning multilingual Wikipedia resources (Adar et al., 2009; Bouma et al., 2009) and semantic relatedness (Budanitsky and Hirst, 2006)."
      ]
    },
    {
      "heading": "3 Method",
      "text": [
        "Let t denote a 3-tuple (triple) consisting of a subject (ts), predicate (tp) and object (to).",
        "Linked Data resources are typed and its type is called class.",
        "We write type (ts) = c meaning that ts is of class c. p denotes a relation and rp is a set of triples whose tp=p, i.e., rp={t |tp = p}.",
        "Given a specific class c, and its pairs of relations (p, p?)",
        "such that rp={t|tp=p, type(ts)=c} and rp?={t|tp=p?, type (ts)=c}, we measure the equivalency of p and p?",
        "and then cluster equivalent relations.",
        "The equivalency is calculated locally (within same class c) rather than globally (across all classes) because two relations can have identical meaning in specific class context but not necessarily so in general.",
        "For example, for the class Book, the relations dbpp:title and foaf:name are used with the same meaning, however for Actor, dbpp:title is used interchangeably with awards dbpp:awards (e.g., Oscar best actor).",
        "In practice, given a class c, our method starts with retrieving all t from a Linked Data set where type(ts)=c, using the universal query language SPARQL with any SPARQL data endpoint.",
        "This data is then used to measure equivalency for each pair of relations (Section 3.1).",
        "The equivalence scores are then used to group relations in equivalent clusters (Section 3.2)."
      ]
    },
    {
      "heading": "3.1 Measure of equivalence",
      "text": [
        "The equivalence for each distinct pair of relations depends on three components.",
        "Triple overlap evaluates the degree of overlap2 in terms of the usage of relations in triples.",
        "Let SO(p) be the collection of subject-object pairs from rp and SOint the intersection",
        "Intuitively, if two relations p and p?",
        "have a large overlap of subject-object pairs in their data instances, they are likely to have identical meaning.",
        "The MAX function allows addressing infrequently used, but still equivalent relations (i.e., where the overlap covers most triples of an infrequently used relation but only a very small proportion of a much more frequently used).",
        "Subject agreement While triple overlap looks at the data in general, subject agreement looks at the overlap of subjects of two relations, and the degree to which these subjects have overlapping objects.",
        "Let S(p) return the set of subjects of relation p, and O(p|s) returns the set of objects of relation p whose subjects are s, i.e.:",
        "Equation [5] counts the number of overlapping subjects whose objects have at least one overlap.",
        "The higher the value of ?, the more the two relations ?agree?",
        "in terms of their shared subjects.",
        "For each shared subject of p and p?",
        "we count 1 if they have at least 1 overlapping object and 0 otherwise.",
        "This is because both p and p?",
        "can be 1:many relations and a low overlap value could mean that one is densely populated while the other is not, which does not necessarily mean they do not ?agree?.",
        "Equation [6] evaluates the degree to which two relations share the same set of subjects.",
        "The agreement AG(p, p?)",
        "balances the two factors by taking the product.",
        "As a result,",
        "relations that have high level of agreement will have more subjects in common, and higher proportion of shared subjects with shared objects.",
        "Cardinality ratio is a ratio between cardinality of the two relations.",
        "Cardinality of a relation CD(p) is calculated based on data:",
        "The final equivalency measure integrates all the three components to return a value in [0, 2]:",
        "The measure will favor two relations that have similar cardinality."
      ]
    },
    {
      "heading": "3.2 Clustering",
      "text": [
        "We apply the measure to every pair of relations of a concept, and keep those with a non-zero equivalence score.",
        "The goal of clustering is to create groups of equivalent relations based on the pairwise equivalence scores.",
        "We use a simple rule-based agglomerative clustering algorithm for this purpose.",
        "First, we rank all relation pairs by their equivalence score, then we keep a pair if (i) its score and (ii) the number of triples covered by each relation are above a certain threshold, TminEqvl and TminTP respectively.",
        "Each pair forms an initial cluster.",
        "To merge clusters, given an existing cluster c and a new pair (p, p?)",
        "where either p?c or p?",
        "?c, the pair is added to c if E(p, p?)",
        "is close (as a fractional number above the threshold TminEqvlRel) to the average scores of all connected pairs in c. This preserves the strong connectivity in a cluster.",
        "This is repeated until no merge action is taken.",
        "Adjusting these thresholds allows balancing between precision and recall."
      ]
    },
    {
      "heading": "4 Experiment Design",
      "text": [
        "To our knowledge, there is no publically available gold standard for relation equivalency using Linked Data.",
        "We randomly selected 21 concepts (Figure 1) from the DBpedia ontology (v3.8):",
        "We apply our method to each concept to discover clusters of equivalent relations, using as SPARQL endpoint both DBpedia3 and Sindice4 and report results separately.",
        "This is to study how the method performs in different conditions: on one hand on a smaller and cleaner dataset (DBpedia); on the other hand on a larger and multilingual dataset (Sindice) to also test cross-lingual capability of our method.",
        "We chose relatively low thresholds, i.e. TminEqvl=0.1, TminTP= 0.01% and TminEqvlRel=0.6, in order to ensure high recall without sacrificing much precision.",
        "Four human annotators manually annotated the output for each concept.",
        "For this preliminary evaluation, we have limited the amount of annotations to a maximum of 100 top scoring pairs of relations per concept, resulting in 16~100 pairs per concept (avg.",
        "40) for DBpedia experiment and 29~100 pairs for Sindice (avg.",
        "91).",
        "The annotators were asked to rate each edge in each cluster with 1 (wrong), 1 (correct) or 0 (cannot decide).",
        "Pairs with 0 are ignored in the evaluation (about 12% for DBpedia; and 17% for Sindice mainly due to unreadable encoded URLs for certain languages).",
        "To evaluate cross-lingual pairs, we asked annotators to use translation tools.",
        "Inter-Annotator-Agreement (observed IAA) is shown in Table 1.",
        "Also using this data, we derived a gold standard for clustering based on edge connectivity and we evaluate (i) the precision of top n% (p@n%) ranked equivalent relation pairs and (ii) the precision of clustering for each concept.",
        "So far the output of 13 concepts has been annotated.",
        "This dataset 5 contains ?1800 relation pairs and is larger than the one by Fu et al. (2012).",
        "Annotation process shows that over 75% of relation pairs in the Sindice experiment contain non-English relations and mostly are cross-lingual.",
        "We used this data to report performance, although the method has been applied to all the 21 concepts, and the complete results can be visualized at our demo website link.",
        "Some examples are shown in Figure 2.",
        "As it is shown in Figure 2, Linked Data relations are often heterogeneous.",
        "Therefore, finding equivalent relations to improve coverage is important.",
        "Results in Figure 3 show that in most cases the method identifies equivalent relations with high precision.",
        "It is effective for both single-and cross-language relation pairs.",
        "The worst performing case for DBpedia is Aircraft (for all n%), mostly due to duplicating numeric valued objects of different relations (e.g., weight, length, capacity).",
        "The decreasing precision with respect to n% suggests the measure effectively ranks correct pairs to the top.",
        "This is a useful feature from IR point of view.",
        "Figure 4 shows that the method effectively clusters equivalent relations with very high precision: 0.8~0.98 in most cases.",
        "6 Per-concept results are available on our website.",
        "Overall we believe the results of this early proof-of-concept are encouraging.",
        "As a concrete example to compare against Fu et al. (2012), for BasketballPlayer, our method creates separate clusters for relations meaning ?draft team?",
        "and ?former team?",
        "because although they are ?similar?",
        "they are not ?equivalent?.",
        "We noticed that annotating equivalent relations is a non-trivial task.",
        "Sometimes relations and their corresponding schemata (if any) are poorly documented and it is impossible to understand the meaning of relations (e.g., due to acronyms) and even very difficult to reason based on data.",
        "Analyses of the evaluation output show that errors are typically found between highly similar relations, or whose object values are numeric types.",
        "In both cases, there is a very high probability of having a high overlap of subject-object pairs between relations.",
        "For example, for Aircraft, the relations dbpp:heightIn and dbpp: weight are predicted to be equivalent because many instances have the same numeric value for the properties.",
        "Another example are the Airport properties dbpp:runwaySurface, dbpp:r1Surface, dbpp:r2Surface etc., which according to the data seem to describe the construction material (e.g., concrete, asphalt) of airport runways.",
        "The relations are semantically highly similar and the object values have a high overlap.",
        "A potential solution to such issues is incorporating ontological knowledge if available.",
        "For example, if an ontology defines the two distinct properties of Airport without explicitly defining an ?equivalence?",
        "relation between them, they are unlikely to be equivalent even if the data suggests the opposite."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "This paper introduced a data-driven, unsupervised and domain and language independent method to learn equivalent relations for Linked Data concepts.",
        "Preliminary experiments show encouraging results as it effectively discovers equivalent relations in both single-and multilingual settings.",
        "In future, we will revise the equivalence measure and also experiment with clustering algorithms such as (Beeferman et al., 2000).",
        "We will also study the contribution of individual components of the measure in such task.",
        "Large scale comparative evaluations (incl.",
        "recall) are planned and this work will be extended to address other tasks such as ontology mapping and ontology pattern mining (Nuzzolese et al., 2011)."
      ]
    },
    {
      "heading": "Acknowledgement",
      "text": [
        "Part of this research has been sponsored by the EPSRC funded project LODIE: Linked Open Data for Information Extraction, EP/J019488/1.",
        "Additionally, we also thank the reviewers for their valuable comments given for this work."
      ]
    }
  ]
}
