{
  "info": {
    "authors": [
      "Prateek Jindal",
      "Dan Roth"
    ],
    "book": "EMNLP",
    "id": "acl-D13-1186",
    "title": "Using Soft Constraints in Joint Inference for Clinical Concept Recognition",
    "url": "https://aclweb.org/anthology/D13-1186",
    "year": 2013
  },
  "references": [
    "acl-C04-1197",
    "acl-D07-1001",
    "acl-J08-2005",
    "acl-N06-1046",
    "acl-N07-1030",
    "acl-P07-1036",
    "acl-P08-1099",
    "acl-W04-2401",
    "acl-W04-3250",
    "acl-W05-0618",
    "acl-W06-1616",
    "acl-W06-1623",
    "acl-W11-1904"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper introduces IQPs (Integer Quadratic Programs) as a way to model joint inference for the task of concept recognition in clinical domain.",
        "IQPs make it possible to easily incorporate soft constraints in the optimization framework and still support exact global inference.",
        "We show that soft constraints give statistically significant performance improvements when compared to hard constraints."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In this paper, we study the problem of concept recognition in the clinical domain.",
        "State-of-the-art approaches (de Bruijn et al., 2011; Patrick et al., 2011; Torii et al., 2011; Minard et al., 2011; Jiang et al., 2011; Xu et al., 2012; Roberts and Harabagiu, 2011; Jindal and Roth, 2013) for concept recognition in clinical domain (Uzuner et al., 2011) use sequence-prediction models like CRF (Lafferty et al., 2001), MEMM (McCallum et al., 2000) etc.",
        "These approaches are limited by the fact that they can model only local dependencies (most often, first-order models like linear chain CRFs are used to allow tractable inference).",
        "Clinical narratives, unlike newswire data, provide a domain with significant knowledge that can be exploited systematically to improve the accuracy of the prediction task.",
        "Knowledge in this domain can be thought of as belonging to two categories: (1) Background Knowledge captured in medical ontologies like UMLS (Url1, 2013), MeSH and SNOMED CT and (2) Discourse Knowledge driven by the fact that the narratives adhere to a specific writing style.",
        "While the former can be used by generating more expressive knowledge-rich features, the latter is more interesting from our current perspective, since it provides global constraints on what output structures are likely and what are not.",
        "We exploit this structural knowledge in our global inference formulation.",
        "Integer Linear Programming (ILP) based approaches have been used for global inference in many works (Roth and Yih, 2004; Punyakanok et al., 2004; Punyakanok et al., 2008; Marciniak and Strube, 2005; Bramsen et al., 2006; Barzilay and Lapata, 2006; Riedel and Clarke, 2006; Clarke and Lapata, 2007; Clarke and Lapata, 2008; Denis et al., 2007; Chang et al., 2011).",
        "However, in most of these works, researchers have focussed only on hard constraints while formulating the inference problem.",
        "Formulating all the constraints as hard constraints is not always desirable because the constraints are not perfect in many cases.",
        "In this paper, we propose Integer Quadratic Programs (IQPs) as a way of formulating the inference problem.",
        "IQPs is a richer family of models than ILPs and it enables us to easily incorporate soft constraints into the inference procedure.",
        "Our experimental results show that soft constraints indeed give much better performance than hard constraints."
      ]
    },
    {
      "heading": "2 Identifying Medical Concepts",
      "text": [
        "Task Description Our input consists of clinical reports in free-text (unstructured) format.",
        "The task is: (1) to identify the boundaries of medical concepts and (2) to assign types to such concepts.",
        "Each concept can have 3 possible types: (1) Test, (2) Treatment, and (3) Problem.",
        "We would refer to these three types by TEST, TRE and PROB in the following discussion.",
        "Our Approach In the first step, we identify the concept boundaries using a CRF (with BIO encod",
        "[Chest x-ray] gave positive evidence for [atelectasis] and [sarcoidosis].Test Problem Problem",
        "ing).",
        "Features used by the CRF include the constituents given by MetaMap (Aronson and Lang, 2010; Url2, 2013), shallow parse constituents, surface form and part-of-speech (Url3, 2013) of words in a window of size 3.",
        "We also use conjunctions of the features.",
        "After finding concept boundaries, we determine the probability distribution for each concept over 4 possible types (TEST, TRE, PROB or NULL).",
        "These probability distributions are found using a multi-class SVM classifier (Chang and Lin, 2011).",
        "Features used for training this classifier include concept tokens, full text of concept, bi-grams, headword, suffixes of headword, capitalization pattern, shallow parse constituent, Metamap type of concept, MetaMap type of headword, occurrence of concept in MeSH (Url4, 2013) and SNOMED CT (Url5, 2013), MeSH and SNOMED CT descriptors.",
        "Inference Procedure: The final assignment of types to concepts is determined by an inference procedure.",
        "The basic principle behind our inference procedure is: ?Types of concepts which appear close to one another are often closely related.",
        "For some concepts, type can be determined with more confidence.",
        "And relations between concepts?",
        "types guide the inference procedure to determine the types of other concepts.?",
        "We will now explain it in more detail with the help of examples.",
        "Figure 1 shows two sentences in which the concepts are shown in brackets and correct (gold) types of concepts are shown above them.",
        "First, consider first and second concepts in Figure 1a.",
        "These concepts follow the pattern: [Concept1] gave positive evidence for [Concept2].",
        "In clinical narratives, such a pattern strongly suggests that Concept1 is of type TEST and Concept2 is of type PROB.",
        "Table 1 shows additional such patterns.",
        "Next, consider different concepts in Figure 1b.",
        "All",
        "these concepts are separated by commas and hence, form a list.",
        "It is highly likely that such concepts should have the same type."
      ]
    },
    {
      "heading": "3 Modeling Global Inference",
      "text": [
        "Inference is done at the level of sentences.",
        "Suppose there are m concepts in a sentence.",
        "Each of the m concepts has to be assigned one of the following types: TEST, TRE, PROB or NULL.",
        "To represent this as an inference problem, we define the indicator variables xi,j where i takes values from 1 to m (corresponding to concepts) and j takes values from 1 to 4 (corresponding to 4 possible types).",
        "pi,j refers to the probability that the ith concept has type j.",
        "We can now write the following optimization problem to find the optimal concept types:",
        "The objective function in Equation (1) expresses the fact that we want to maximize the expected number of correct predictions in each sentence.",
        "Equation (2) enforces the constraint that each concept has",
        "a unique type.",
        "We would refer to these as Type-1 constraints."
      ]
    },
    {
      "heading": "3.1 Constraints Used",
      "text": [
        "In this subsection, we will describe two additional types of constraints (Type-2 and Type-3) that were added to the optimization procedure described above.",
        "Whereas Type-1 constraints described above were formulated as hard constraints, Type-2 and Type-3 constraints are formulated as soft constraints.",
        "Certain constructs like comma, conjunction, etc.",
        "suggest that the 2 concepts appearing in them should have the same type.",
        "Figure 1b shows an example of such a constraint.",
        "Suppose that there are n2 such constraints.",
        "Also, assume that the lth constraint says that the concepts Rl and Sl should have the same type.",
        "To model this, we define a variable wl as follows:",
        "Now, if the concepts Rl and Sl have the same type, then wl would be equal to 0; otherwise, wl would be equal to 2.",
        "So, the lth constraint can be enforced by subtracting (?2 ?",
        "wl 2 ) from the objective function given by Equation (1).",
        "Thus, a penalty of ?2 would be enforced iff this constraint is violated.",
        "Some short patterns suggest possible types for the concepts which appear in them.",
        "Each such pattern, thus, enforces a constraint on the types of corresponding concepts.",
        "Figure 1a shows an example of such a constraint.",
        "Suppose that there are n3 such constraints.",
        "Also, assume that the kth constraint says that the concept A1,k should have the type B1,k and that the concept A2,k should have the type B2,k.",
        "Equivalently, the kth constraint can be written as follows in boolean algebra notation:",
        "straint, we introduce one more variable zk ?",
        "{0, 1} which satisfies the following condition:",
        "Using boolean algebra, it is easy to show that Equation (5) can be reduced to a set of linear inequalities.",
        "Thus, we can incorporate the kth con",
        "straint in the optimization problem by adding to it the constraint given by Equation (5) and by subtracting (?3(1 ?",
        "zk)) from the objective function given by Equation (1).",
        "Thus, a penalty of ?3 is imposed iff kth constraint is not satisfied (zk = 0)."
      ]
    },
    {
      "heading": "3.2 Final Optimization Problem - An IQP",
      "text": [
        "After incorporating all the constraints mentioned above, the final optimization problem (an IQP) is shown in Figure 2.",
        "We used Gurobi toolkit (Url6, 2013) to solve such IQPs.",
        "In our case, it solves 76 IQPs per second on a quad-core server with Intel Xeon X5650 @ 2.67 GHz processors and 50 GB RAM."
      ]
    },
    {
      "heading": "4 Experiments and Results",
      "text": []
    },
    {
      "heading": "4.1 Datasets and Evaluation Metrics",
      "text": [
        "For our experiments, we used the datasets provided by i2b2/VA team as part of 2010 i2b2/VA shared task (Uzuner et al., 2011).",
        "The datasets used for this shared task contained de-identied clinical reports from three medical institutions: Partners Healthcare (PH), Beth-Israel Deaconess Medical Center (BIDMC) and the University of Pittsburgh Medical Center (UPMC).",
        "UPMC data was divided into 2 sections, namely discharge (UPMCD) and progress notes (UPMCP).",
        "A total of 349 training reports and 477 test reports were made available to the participants.",
        "However, data which came from UPMC (more than 50% data) was not made available for public use.",
        "As a result, we had only 170 clinical reports for training and 256 clinical reports for testing.",
        "Table 3 shows the number of clinical reports made available by different institutions.",
        "The",
        "strikethrough text in this table indicates that the data was not made available for public use and hence, we couldn't use it.",
        "We used about 20% of the training data as a development set.",
        "For evaluation, we report precision, recall and F1 scores."
      ]
    },
    {
      "heading": "4.2 Results",
      "text": [
        "In this section, we would refer to following 4 systems: (1) Baseline (B), (2) Baseline + Knowledge (BK), (3) Baseline + Constraints (BC) and",
        "(4) Baseline + Knowledge + Constraints (BKC).",
        "Please note that the difference between B and BK is that B does not use the features derived from domain-specific knowledge sources (namely",
        "MetaMap, UMLS, MeSH and SNOMED CT) for training the classifiers.",
        "Both B and BK do not use the inference procedure.",
        "BKC uses all the features and also the inference procedure.",
        "In addition to these 4 systems, we would refer to another system, namely, BKC-HARD.",
        "This is similar to BKC system.",
        "However, it sets ?2 = ?3 = 1 which effectively turns Type-2 and Type-3 constraints into hard constraints by imposing very high penalty.",
        "Figures 3a and 3b show the effect of varying the penalties (?2 and ?3) for Type-2 and Type-3 constraints respectively.",
        "These figures show the F1-score of BKC on the development set.",
        "Penalty of 0 means that the constraint is not active.",
        "As we increase the penalty, the constraint becomes stronger.",
        "As the penalty becomes 1, the constraint becomes hard in the sense that final assignments must respect",
        "much better than hard constraints (BKC-HARD).",
        "the constraint.",
        "We observe from Figures 3a and 3b that for Type-2 and Type-3 constraints, global maxima is attained at ?2 = 0.6 and ?3 = 0.3 respectively.",
        "Hard vs Soft Constraints Table 4 compares the performance of BKC-HARD with that of BKC.",
        "First 3 rows in this table show the performance of both systems for the individual categories (TEST,",
        "TRE and PROB).",
        "The fourth row shows the overall score of both systems.",
        "BKC outperformed BKC-HARD on all the categories by statistically significant differences at p = 0.05 according to Bootstrap Resampling Test (Koehn, 2004).",
        "For the OVERALL category, BKC improved over BKC-HARD by 1.0 F1 points.",
        "In the 2010 i2b2/VA shared task, majority of top systems were CRF-based models, motivating the use of CRF as our baseline.",
        "Table 2 compares the performance of 4 systems: B, BK, BC and BKC.",
        "As pointed out before, our BK system uses CRF for boundary detection, employs all the knowledge-based features and is very similar to the top-performing systems in i2b2 challenge.",
        "We see from Table 2 that BKC consistently performed the best for individual as well as overall categories1.",
        "This result is statistically significant at p = 0.05 according to Bootstrap Resampling Test (Koehn, 2004).",
        "It should also be noted that BC performed significantly better than B for all the categories.",
        "Thus, the constraints are helpful even in the absence of knowledge-based features.",
        "Since we report results on publicly available datasets, future works would be able to compare their results with ours.",
        "In Figure 4, we report the overall F1-score on a part of the development set as we vary the size of the training data from 40 documents to 130 documents.",
        "We notice that the performance increases steadily as more and more training data is provided.",
        "This suggests that if we could train on full training data as was made available in the challenge, the final scores could be much higher.",
        "We also notice from the figure that BKC consistently outperforms the state-of-the-art BK system as we vary the size of the training data, indicating the robustness of the joint inference procedure.",
        "1Please note that the results reported in Table 2 can not be directly compared with those reported in the challenge because we only had a fraction of the original training and testing data."
      ]
    },
    {
      "heading": "5 Discussion and Related Work",
      "text": [
        "In this paper, we chose to train a rather simple sequential model (using CRF), and focused on incorporating global constraints only at inference time2.",
        "While it is possible to jointly train the model with the global constraints (as illustrated by Chang et al. (2007), Mann and McCallum (2007), Mann and McCallum (2008), Ganchev et al. (2010) etc.",
        "), this process will be a lot less efficient, and prior work (Roth and Yih, 2005) has shown that it may not be beneficial.",
        "Roth and Yih (2004, 2007) suggested the use of integer programs to model joint inference in a fully supervised setting.",
        "Our paper follows their conceptual approach.",
        "However, they used only hard constraints in their inference formulation.",
        "Chang et al.",
        "(2012) extended the ILP formulation and used soft constraints within the Constrained Conditional Model formulation (Chang, 2011).",
        "However, their implementation performed only approximate inference.",
        "In this paper, we extended the integer linear programming to a quadratic formulation, arguing that it simplifies the modeling step3, and showed that it is possible to do exact inference efficiently.",
        "Conclusion This paper presented a global inference strategy (using IQP) for concept recognition which allows us to model structural knowledge of the clinical domain as soft constraints in the optimization framework.",
        "Our results showed that soft constraints are more effective than hard constraints."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This research was supported by Grant HHS 90TR0003/01 and by IARPA FUSE program via DoI/NBC contract #D11PC2015.",
        "Its contents are solely the responsibility of the authors and do not necessarily represent the official views, either expressed or implied, of the HHS, IARPA, DoI/NBC or the US government.",
        "The US Government is authorized to reproduce and distribute reprints for Governmental purposes notwithstanding any copyright annotation thereon."
      ]
    }
  ]
}
