{
  "info": {
    "authors": [
      "Yu Sawai",
      "Mamoru Komachi",
      "Yuji Matsumoto"
    ],
    "book": "ACL",
    "id": "acl-P13-2124",
    "title": "A Learner Corpus-based Approach to Verb Suggestion for ESL",
    "url": "https://aclweb.org/anthology/P13-2124",
    "year": 2013
  },
  "references": [
    "acl-C10-1133",
    "acl-D10-1104",
    "acl-J92-4003",
    "acl-P05-1074",
    "acl-P07-1033",
    "acl-P10-2021",
    "acl-P11-1093",
    "acl-P12-2076"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We propose a verb suggestion method which uses candidate sets and domain adaptation to incorporate error patterns produced by ESL learners.",
        "The candidate sets are constructed from a large scale learner corpus to cover various error patterns made by learners.",
        "Furthermore, the model is trained using both a native corpus and the learner corpus via a domain adaptation technique.",
        "Experiments on two learner corpora show that the candidate sets increase the coverage of error patterns and domain adaptation improves the performance for verb suggestion."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In this study, we address verb selection errors in the writing of English learners.",
        "Selecting the right verb based on the context of a sentence is difficult for the learners of English as a Second Language (ESL).",
        "This error type is one of the most common errors in various learner corpora ranging from elementary to proficient levels1.",
        "They ?connect/communicate with other businessmen and do their jobs with the help of computers.2 This sentence is grammatically acceptable with either verb.",
        "However, native speakers of English would less likely use ?connect?, which means ?forming a relationship (with other businessmen)?, whereas ?communicate?",
        "means ?exchanging information or ideas?, which is what the sentence is trying to convey.",
        "error of verbs is the third most common out of 75 error types.",
        "In the KJ corpus, lexical choice of verb is the sixth most common out of 47 error types.",
        "2This sentence is taken from the CLC-FCE dataset.",
        "Previous work on verb selection usually treats the task as a multi-class classification problem (Wu et al., 2010; Wang and Hirst, 2010; Liu et al., 2010; Liu et al., 2011).",
        "In this formalization, it is important to restrict verbs by a candidate set because verb vocabulary is more numerous than other classes, such as determiners.",
        "Candidate sets for verb selection are often extracted from thesauri and/or round-trip translations.",
        "However, these resources may not cover certain error patterns found in actual learner corpora, and suffer from low-coverage.",
        "Furthermore, all the existing classifier models are trained only using a native corpus, which may not be adequate for correcting learner errors.",
        "In this paper, we propose to use error patterns in ESL writing for verb suggestion task by using candidate sets and a domain adaptation technique.",
        "First, to increase the coverage, candidate sets are extracted from a large scale learner corpus derived from a language learning website.",
        "Second, a domain adaptation technique is applied to the model to fill the gap between two domains: native corpus and ESL corpus.",
        "Experiments are carried out on publicly available learner corpora, the Cambridge Learner Corpus First Certificate of English dataset (CLC-FCE) and the Konan JIEM corpus (KJ).",
        "The results show that the proposed candidate sets improve the coverage, compared to the baseline candidate sets derived from the WordNet and a round-trip translation table.",
        "Domain adaptation also boosts the suggestion performance.",
        "To our knowledge, this is the first work for verb suggestion that uses (1) a learner corpus as a source of candidate sets and (2) the domain adaptation technique to take learner errors into account."
      ]
    },
    {
      "heading": "2 Verb Suggestion Considering Error",
      "text": []
    },
    {
      "heading": "Patterns",
      "text": [
        "The proposed verb suggestion system follows the standard approach in related tasks (Rozovskaya and Roth, 2011; Wu et al., 2010), where the candidate selection is formalized as a multi-class classification problem with predefined candidate sets."
      ]
    },
    {
      "heading": "2.1 Candidate Sets",
      "text": [
        "For reflecting tendency of learner errors to the candidate sets, we use a large scale corpus obtained from learners?",
        "writing on an SNS (Social Networking Service), Lang-83.",
        "An advantage of using the learner corpus from such website is the size of annotated portion (Mizumoto et al., 2011).",
        "This SNS has over 1 million manually annotated English sentences written by ESL learners.",
        "We have collected the learner writings on the site, and released the dataset for research purpose4.",
        "First, we performed POS tagging for the dataset using the treebank POS tagger in the NLTK toolkit 2.10.",
        "Second, we extracted the correction pairs which have ?VB*?",
        "tag.",
        "The set of correction pairs given an incorrect verb is considered as a candidate set for the verb.",
        "We then performed the following preprocessing for the dataset because we focus on lexical selection of verbs: ?",
        "Lemmatize verbs to reduce data sparseness.",
        "?",
        "Remove non-English verbs using WordNet.",
        "?",
        "Remove incorrect verbs which occur only once in the dataset.",
        "The target verbs are limited to the 500 most common verbs in the CLC-FCE corpus5.",
        "Therefore, verbs that do not appear in the target list are not included in the candidate sets.",
        "The topmost 500 verbs cover almost 90 percent of the vocabulary of verbs in the CLC-FCE corpus6.",
        "The average number of candidates in a set is 20.37.",
        "Note that the number of candidates varies across each target verb8."
      ]
    },
    {
      "heading": "2.2 Suggestion Model",
      "text": [
        "The verb suggestion model consists of multi-class classifiers for each target verb; and based on the classifiers?",
        "output, it suggests alternative verbs.",
        "Instances are in a fill-in-the-blank format, where the labels are verbs.",
        "Features in this format are extracted from the surrounding context of a verb.",
        "When testing on the learner corpus, the model suggests a ranking of the possible verbs for the blank corresponding to a given context.",
        "Note that unlike the fill-in-the-blank task, the candidate sets and domain adaptation can be applied to this task to take the original word into account.",
        "The model is trained on a huge native corpus, namely the ukWaC corpus, because the data-size of learner corpora is limited compared to native corpora.",
        "It is then adapted to the target domain, i.e., learner writing.",
        "In our experiment, the Lang8 corpus is used as the target domain corpus, since we assume that it shares the same characteristics with the CLC-FCE and the KJ corpora used for testing."
      ]
    },
    {
      "heading": "2.3 Domain Adaptation",
      "text": [
        "To adapt the models to the learner corpus, we employ a domain adaptation technique to emphasize the importance of learner domain information.",
        "Although there are many studies on domain adaptation, we chose to use Feature Augmentation technique introduced by (Daume?",
        "III, 2007) for its simplicity.",
        "Recently, (Imamura et al., 2012) proposed to apply this method to grammatical error correction for writings of Japanese learners and confirmed that this is more effective for correcting learner errors than simply adding the target domain instances.",
        "In this study, the source domain is the native writing, and the target domain is the ESL writing.",
        "Our motivation is to use the ESL corpus together with the huge native corpus to employ both an advantage of the size of training data and the ESL writing specific features.",
        "In this method, adapting a model to another model is achieved by extending the feature space.",
        "Given a feature vector of F dimensions as x ?",
        "RF(F > 0), using simple mapping, the augmented feature vectors for source and target domains are obtained as follows,",
        "where 0 denotes a zero-vector of F dimensions.",
        "The three partitions mean a common, a source-specific, and a target-specific feature space.",
        "When testing on the ESL corpora, the target-specific features are emphasized."
      ]
    },
    {
      "heading": "2.4 Features",
      "text": [
        "In previous work, various features were used: lexical and POS n-grams, dependencies, and arguments in the verb context.",
        "(Liu et al., 2011) has shown that shallow parse features, such as lexical n-grams and chunks, work well in realistic settings, in which the input sentence may not be correctly parsed.",
        "Considering this, we use shallow parse features as context features for robustness.",
        "The features include lexical and POS n-grams, and lexical head words of the nearest NPs, and clustering features of these head words.",
        "An example of extracted features is shown in Table 2.4.",
        "Note that those features are also used when extracting examples from the target domain dataset (the learner domain corpus).",
        "As shown in Table 2.4, the n-gram features are 3-gram and extracted from ?2 context window.",
        "The nearest NP's head features are divided into two (Left, Right).",
        "The additional clustering features are used for reducing sparseness, because the NP's head words are usually proper nouns.",
        "To create the word clusters, we employ Brown clustering, a hierarchical clustering algorithm proposed by (Brown et al., 1992).",
        "The structure of clusters is a complete binary tree, in which each node is represented as a bit-string.",
        "By varying the length of the prefix of bit-string, it is possible to change the granularity of cluster representation.",
        "As illustrated in Table 2.4, we use the clustering features with three levels of granularity: 256, 128, and 64 dimensions.",
        "We used Percy Liang's implementation9 to create 256 dimensional model from the ukWaC corpus, which is used as the native corpus."
      ]
    },
    {
      "heading": "3 Experiments",
      "text": [
        "Performance of verb suggestion is evaluated on two error-tagged learner corpora: CLC-FCE and KJ.",
        "In the experiments, we assume that the target verb and its context for suggestion are already given.",
        "For the experiment on the CLC-FCE dataset, the targets are all words tagged with ?RV?",
        "(re",
        "NP head cluster L 01110001, L 0111000, L 011100 (Left, Right) R 11011001, R 1101100, R 110110 (e.g., They (communicate) with other businessmen and do their jobs with the help of computers.)",
        "?<S>?",
        "denotes the beginning of the sentence, ?*V*?",
        "denotes the blanked out verb.",
        "in-the-blank form.",
        "placement error of verbs).",
        "We assume that all the verb selection errors are covered with this error tag.",
        "All error tagged parts with nested correction or multi-word expressions are excluded.",
        "The resulting number of ?true?",
        "targets is 1,083, which amounts to 4% of all verbs.",
        "Therefore the dataset is highly skewed to correct usages, though this setting expresses well the reality of ESL writing, as shown in (Chodorow et al., 2012).",
        "We carried out experiments with a variety of resources used for creating candidate sets.",
        "?",
        "WordNet Candidates are retrieved from the synsets and verbs sharing the same hypernyms in the",
        "setting.",
        "tion via feature augmentation.",
        "Table 3 shows a comparison of the average number of candidates in each setting.",
        "In all configurations above, the parameters of the models underlying the system are identical.",
        "We used a L2-regularized generalized linear model with log-loss function via Scikit-learn ver.",
        "0.13."
      ]
    },
    {
      "heading": "Inter-corpus Evaluation",
      "text": [
        "We also evaluate the suggestion performance on the KJ corpus.",
        "The corpus contains diary-style writing by Japanese university students.",
        "The proficiency of the learners ranges from elementary to intermediate, so it is lower than that of the CLC-FCE learners.",
        "The targets are all verbs tagged with ?v lxc?",
        "(lexical selection error of verbs).",
        "To see the effect of L1 on the verb suggestion task, we added an alternative setting for the Roundtrip using only the English-Japanese and Japanese-English round-trip translation tables (En-Ja-En).",
        "For the experiment on this test-corpus, the LearnerSmall is not included."
      ]
    },
    {
      "heading": "Datasets",
      "text": [
        "The ukWaC web-corpus (Ferraresi et al., 2008) is used as a native corpus for training the suggestion model.",
        "Although this corpus consists of over 40 million sentences, 20,000 randomly selected sentences are used for each verb11.",
        "The Lang-8 learner corpus is used for domain adaptation of the model in the Lang-8+DA configuration.",
        "The portion of data is the same as that used for constructing candidate sets."
      ]
    },
    {
      "heading": "Metrics",
      "text": [
        "Mean Reciprocal Rank (MRR) is used for evaluating the performance of alternative suggestions.",
        "The mean reciprocal rank is calculated by taking 11e.g., a classifier with a candidate set containing 50 verbs is trained with 1 million sentences in total.",
        "the average of the reciprocal ranks for each instance.",
        "Given r goldi as the position of the gold correction candidate in the suggestion list Si for i-th checkpoint, the reciprocal rank RRi is defined as,"
      ]
    },
    {
      "heading": "4 Results",
      "text": [
        "Tables 5 and 5 show the results of suggestion performance on the CLC-FCE dataset and the KJ corpus, respectively.",
        "In both cases, the Lang-8 and its domain adaptation variant outperformed the others.",
        "The coverage of error patterns in the tables is the percentage of the cases where the suggestion list includes the gold correction.",
        "Generally, the suggestion performance and the coverage improve as the size of the candidate sets increases."
      ]
    },
    {
      "heading": "5 Discussions",
      "text": [
        "Although the expert-annotated learner corpora contain candidates which are more reliable than a web-crawled Lang-8 corpus, the Lang-8 setting performed better as shown in Table 5.",
        "This can be explained by the broader coverage by the Lang-8 candidate sets than that of the LearnerSmall.",
        "Similarly, the WordNet performed the worst because it contains only synonym-like candidates.",
        "We can conclude that, for the verb suggestion task, the coverage (recall) of candidate sets is more important than the quality (precision).",
        "We see little influence of learners?",
        "L1 in the results of Table 5, since the Roundtrip performed better than the Roundtrip (En-Ja-En).",
        "As already mentioned, the number of error patterns contained in the candidate sets seems to have more importance than the quality.",
        "As shown in Tables 5 and 5, a positive effect of domain adaptation technique appeared in both test-corpora.",
        "In the case of the CLC-FCE, 280 out of 624 suggestions were improved compared to the setting without domain adaptation.",
        "For instance, confusions between synonyms such as ?",
        "?live/stay?, ?",
        "?say/tell?, and ??solve/resolve?",
        "are improved, because sentences containing these confusions appear more frequently in the Lang8 corpus.",
        "Although the number of test-cases for the KJ corpus is smaller than the CLC-FCE, we can see the improvements for 33 out of 66 sug",
        "The value marked with the asterisk indicates statistically significant improvement over the baselines, where p < 0.05 bootstrap test.",
        "The value marked with the asterisk indicates statistically significant improvement over the baselines, except ?Roundtrip?, where p < 0.05 bootstrap test.",
        "pus.",
        "gestions.",
        "The improvements appeared for frequent confusions of Japanese ESL learners such as ??see/watch?",
        "and ??tell/teach?.",
        "Comparing the results of the Lang-8+DA on both test-corpora, the domain adaptation technique worked more effectively on the KJ corpus than on the CLC-FCE.",
        "This can be explained by the fact that the style of writing of the additional data, i.e., the Lang-8 corpus, is closer to KJ than it is to CLC-FCE.",
        "More precisely, unlike the examination-type writing style of CLC-FCE, the KJ corpus consists of diary writing similar in style to the Lang-8 corpus, and it expresses more closely the proficiency of the learners.",
        "We think that the next step is to refine the suggestion models, since we currently take a simple fill-in-the-blank approach.",
        "As future work, we plan to extend the models as follows: (1) use both incorrect and correct sentences in learner corpora for training, and (2) employ ESL writing specific features such as learners?",
        "L1 for domain adaptation."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We thank YangYang Xi of Lang-8, Inc. for kindly allowing us to use the Lang-8 learner corpus.",
        "We also thank the anonymous reviewers for their insightful comments.",
        "This work was partially supported by Microsoft Research CORE Project."
      ]
    }
  ]
}
