{
  "info": {
    "authors": [
      "Romain Deveaud",
      "Eric SanJuan",
      "Patrice Bellot"
    ],
    "book": "ACL",
    "id": "acl-P13-2027",
    "title": "Are Semantically Coherent Topic Models Useful for Ad Hoc Information Retrieval?",
    "url": "https://aclweb.org/anthology/P13-2027",
    "year": 2013
  },
  "references": [
    "acl-D11-1024",
    "acl-D12-1087",
    "acl-N07-1017",
    "acl-N10-1012"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The current topic modeling approaches for Information Retrieval do not allow to explicitly model query-oriented latent topics.",
        "More, the semantic coherence of the topics has never been considered in this field.",
        "We propose a model-based feedback approach that learns Latent Dirichlet Allocation topic models on the top-ranked pseudo-relevant feedback, and we measure the semantic coherence of those topics.",
        "We perform a first experimental evaluation using two major TREC test collections.",
        "Results show that retrieval performances tend to be better when using topics with higher semantic coherence."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Representing documents as mixtures of ?topics?",
        "has always been a challenge and an objective for researchers working in text-related fields.",
        "Based on the words used within a document, topic models learn topic level relations by assuming that the document covers a small set of concepts.",
        "Learning the topics from a document collection can help to extract high level semantic information, and help humans to understand the meaning of documents.",
        "Latent Semantic Indexing (Deerwester et al., 1990) (LSI), probabilistic Latent Semantic Analysis (Hofmann, 2001) (pLSA) and Latent Dirichlet Allocation (Blei et al., 2003) (LDA) are the most famous approaches that tried to tackle this problem throughout the years.",
        "Topics produced by these methods are generally fancy and appealing, and often correlate well with human concepts.",
        "This is one of the reasons of the intensive use of topic models (and especially LDA) in current research in Natural Language Processing (NLP) related areas.",
        "One main problem in ad hoc Information Retrieval (IR) is the difficulty for users to translate a complex information need into a keyword query.",
        "The most popular and effective approach to overcome this problem is to improve the representation of the query by adding query-related ?concepts?.",
        "This approach mostly relies on pseudo-relevance feedback, where these so-called ?concepts?",
        "are the most frequent words occurring in the top-ranked documents retrieved by the retrieval system (Lavrenko and Croft, 2001).",
        "From that perspective, topic models seem attractive in the sense that they can provide a descriptive and intuitive representation of concepts.",
        "But how can we quantify the usefulness of these topics with respect to an IR system?",
        "Recently, researchers developed measures which evaluate the semantic coherence of topic models (Newman et al., 2010; Mimno et al., 2011; Stevens et al., 2012).",
        "We adopt their view of semantic coherence and apply one of these measures to query-oriented topics.",
        "Several studies concentrated on improving the quality of document ranking using topic models, especially probabilistic ones.",
        "The approach by Wei and Croft (2006) was the first to leverage LDA topics to improve the estimate of document language models and achieved good empirical results.",
        "Following this pioneering work, several studies explored the use of pLSA and LDA under different experimental settings (Park and Ra-mamohanarao, 2009; Yi and Allan, 2009; Andrzejewski and Buttler, 2011; Lu et al., 2011).",
        "The reported results suggest that the words and the probability distributions learned by probabilistic topic models are effective for query expansion.",
        "The main drawback of these approaches is that topics are learned on the whole target document collection prior to retrieval, thus leading to a static topical representation of the collection.",
        "Depending on the query and on its specificity, topics may either be too coarse or too fine to accurately represent the latent concepts of the query.",
        "Recently, Ye et al. (2011) proposed a method which uses",
        "LDA and learns topics directly on a limited set of documents.",
        "While this approach is a first step towards modeling query-oriented topics, it lacks some theoretic principles and only aims to heuristically construct a ?best?",
        "topic (from all learned topics) before expanding the query with its most probable words.",
        "More, none of the aforementioned works studied the semantic coherence of those generated topics.",
        "We tackle these issues by making the following contributions: ?",
        "we introduce Topic-Driven Relevance Models, a model-based feedback approach (Zhai and Lafferty, 2001) for integrating topic models into relevance models by learning topics on pseudo-relevant feedback documents (as opposed to the entire document collection), ?",
        "we explore the coherence of those generated topics using the queries of two major and well-established TREC test collections, ?",
        "we evaluate the effects coherent topics have on ad hoc IR using the same test collections."
      ]
    },
    {
      "heading": "2 Topic-Driven Relevance Models 2.1 Relevance Models",
      "text": [
        "The goal of relevance models is to improve the representation of a query Q by selecting terms from a set of initially retrieved documents (Lavrenko and Croft, 2001).",
        "As the concentration of relevant documents is usually higher in the top ranks of the ranking list, this is constituted by a number N of top-ranked documents.",
        "Relevance models usually perform better when combined with the original query model (or maximum likelihood estimate).",
        "Let ?",
        "?Q be this maximum likelihood query estimate and ?",
        "?Q a relevance model, the updated new query model is given by:",
        "where ?",
        "?",
        "[0, 1] is a parameter that controls the tradeoff between the original query model and the relevance model.",
        "One of the most robust variants of the relevance models is computed as follows:",
        "(2) where ?",
        "is a set of pseudo-relevant feedback documents and ?D is the language model of document D. This notion of estimating a query model is often referred to as model-based feedback (Zhai and Lafferty, 2001).",
        "We assume P (?D) to be uniform, resulting in an estimated relevance model based on a sum of document models weighted by the query likelihood score.",
        "The final, interpolated, estimate expressed in equation (1) is often referred in the literature as RM3.",
        "We tackle the null probabilities problem by smoothing the document language model using the well-known Dirichlet smoothing (Zhai and Lafferty, 2004)."
      ]
    },
    {
      "heading": "2.2 LDA-based Feedback Model",
      "text": [
        "The estimation of the feedback model ?",
        "?Q constitutes the first contribution of this work.",
        "We propose to explicitly model the latent topics (or concepts) that exist behind an information need, and to use them to improve the query representation.",
        "We consider ?",
        "as the set of pseudo-relevant feedback documents from which the latent concepts would be extracted.",
        "The retrieval algorithm used to obtain these documents can be of any kind, the important point is that ?",
        "is a reduced collection that contains the top documents ranked by an automatic and state-of-the-art retrieval process.",
        "Instead of viewing ?",
        "as a set of document language models that are likely to contain topical information about the query, we take a probabilistic topic modeling approach.",
        "We specifically focus on Latent Dirichlet Allocation (LDA), since it is currently one of the most representative.",
        "In LDA, each topic multinomial distribution ?k is generated by a conjugate Dirichlet prior with parameter ?, while each document multinomial distribution ?d is generated by a conjugate Dirichlet prior with parameter ?.",
        "In other words, ?d,k is the probability of topic k occurring in document D (i.e. P (k|D)).",
        "Respectively, ?k,w is the probability of wordw belonging to topic k (i.e. P (w|k)).",
        "We use variational inference implemented in the LDA-C software1 to overcome intractability issues (Blei et al., 2003; Griffiths and Steyvers, 2004).",
        "Under this setting, we compute the topic-driven estimation of the query model using the following equation:",
        "where PTM (w|D) is the probability of word w occurring in document D using the previously",
        "N of feedback documents.",
        "learned multinomial distributions.",
        "Let T?",
        "be a topic model learned on the ?",
        "set of feedback documents, this probability is given by:",
        "High probabilities are thus given to words that are important in topic k, when k is an important topic in document D. In the remainder of this paper, we refer to this general approach as TDRM for Topic-Driven Relevance Models."
      ]
    },
    {
      "heading": "2.3 Measuring the coherence of",
      "text": [
        "query-oriented topics TDRM relies on two important parameters: the number of topics K that we want to learn, and the number of feedback documents N from which LDA learns the topics.",
        "Varying these two parameters can help to capture more information and to model finer topics, but how about their global semantic coherence?",
        "Term similarities measured in restricted domains was the first step for evaluating semantic coherence (Gliozzo et al., 2007), and was a first basis for the development of several topic coherence evaluation measures (Newman et al., 2010).",
        "Computing the Pointwise Mutual Information (PMI) of all word pairs over Wikipedia was found to be an effective metric using news and books corpora.",
        "Recently, Stevens et al. (2012) used (among others) an aggregate version of this metric to evaluate large amounts of topic models.",
        "We use this method to evaluate the coherence of query-oriented topics.",
        "Specifically, the coherence of a topic model T K?",
        "composed of K topics is:",
        "where probabilities of word occurrences and co-occurrences are estimated using an external reference corpus.",
        "Following Newman et al. (2010), we use Wikipedia to compute PMI and set = 1 as in (Stevens et al., 2012)."
      ]
    },
    {
      "heading": "3 Evaluation",
      "text": []
    },
    {
      "heading": "3.1 Experimental setup",
      "text": [
        "We performed our evaluation using two main TREC2 collections: Robust04 and WT10g.",
        "Robust04 is composed 528,155 of news articles coming from three newspapers and the FBIS.",
        "It supported the TREC 2004 Robust track, from which we used the 250 query topics (numbers: 301-450, 601-700).",
        "The WT10g collection is composed of 1,692,096 web pages, and supported the TREC Web track for four years (2001-2004).",
        "We focus on the 2000 and 2001 ad-hoc query topics (numbers: 451-550).",
        "We used the open-source indexing and retrieval system Indri3 to run our experiments.",
        "We indexed the two collections with the exact same parameters: tokens were stemmed with the well-known light Krovetz stemmer and stop-words were removed using the standard English stoplist embedded with Indri (417 words)."
      ]
    },
    {
      "heading": "3.2 Semantic coherence evaluation",
      "text": [
        "Most coherent topics are composed of rare words that do not often occur in the reference corpus, but",
        "Each line represent a different number of topics K, and the performance are reported in function the number N of feedback documents.",
        "The black, plain line represents the RM3 baseline.",
        "co-occur at lot together.",
        "We see on Figure 1 that very coherent topics are identified in the top 5 and 10 feedback documents for the WT10g collection, suggesting that closely related documents are retrieved in the top ranks.",
        "Results are quite different on the Robust04 collection, where topic models with 20 topics on 5 documents are the least coherent.",
        "However, when looking at the Robust04 documents, we see that they are on average almost twice smaller than the WT10g web pages.",
        "We hypothesize that the heterogeneous nature of the web allows to model very different topics covering several aspects of the query, while news articles are contributions focused on a single subject.",
        "Overall, the more coherent topic models contain a reasonable amount of topics (10-15), thus allowing to fit with variable amounts of documents.",
        "The attentive reader will notice that the topic coherence scores are very high compared to those previously reported in the literature (Stevens et al., 2012).",
        "The TDRM approach captures topics that are centered around a specific information need, often with a limited vocabulary, which favors word co-occurrence.",
        "On the other hand, topics learned on entire collections are coarser than ours, which leads to lower coherence scores."
      ]
    },
    {
      "heading": "3.3 Document retrieval results",
      "text": [
        "Since TDRM is based on Relevance Models (Lavrenko and Croft, 2001), we take the RM3 approach presented in Section 2.1 as baseline.",
        "The ?",
        "parameter is common between RM3 and TDRM and is determined for each query using leave-one-query-out cross-validation (that is: learn the best parameter setting for all queries but one, and evaluate the held-out query using the previously learned parameter).",
        "We report ad hoc document retrieval performances in Figure 2.",
        "We noticed in the previous section that the most coherent topic models were modeled using 5 feedback documents and 20 topics for the WT10g collection, and this parameter combination also achieves the best retrieval results.",
        "Overall, using 10, 15 or 20 topics allow it to achieve high and similar performance from 5 to 20 documents.",
        "We observe than using 20 topics for the Robust04 collection consistently achieves the highest results, with the topic model coherence growing as the number of feedback documents increases.",
        "Although topics coming from news articles may be limited, they benefit from the rich vocabulary of professional writers who are trained to avoid repetition.",
        "Their use of synonyms allows TDRM to model deep topics, with a comprehensive description of query aspects.",
        "Since synonyms are less likely to co-occur in encyclopedic articles like Wikipedia, we think that, in our case, the semantic coherence measure could be more accurate using other textual resources.",
        "This measure seems however to be effective when dealing with heterogeneously structured documents."
      ]
    },
    {
      "heading": "4 Conclusions & Future Work",
      "text": [
        "Overall, modeling query-oriented topic models and estimating the feedback query model using these topics greatly improves ad hoc Information Retrieval, compared to state-of-the-art relevance models.",
        "While semantically coherent topic mod",
        "els do not seem to be effective in the context of a news articles search task, they are a good indicator of effectiveness in the context of web search.",
        "Measuring the semantic coherence of query topics could help predict query effectiveness or even choose the best query-representative topic model."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": []
    }
  ]
}
