{
  "info": {
    "authors": [
      "Svetlana Stoyanchev",
      "Alex Liu",
      "Julia Hirschberg"
    ],
    "book": "SIGDIAL",
    "id": "acl-W13-4021",
    "title": "Modelling Human Clarification Strategies",
    "url": "https://aclweb.org/anthology/W13-4021",
    "year": 2013
  },
  "references": [
    "acl-N03-1033",
    "acl-P06-2085",
    "acl-P11-4015",
    "acl-W09-3915"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We model human responses to speech recognition errors from a corpus of human clarification strategies.",
        "We employ learning techniques to study 1) the decision to either stop and ask a clarification question or to continue the dialogue without clarification, and 2) the decision to ask a targeted clarification question or a more generic question.",
        "Targeted clarification questions focus specifically on the part of an utterance that is misrecognized, in contrast with generic requests to ?please repeat?",
        "or ?please rephrase?.",
        "Our goal is to generate targeted clarification strategies for handling errors in spoken dialogue systems, when appropriate.",
        "Our experiments show that linguistic features, in particular the inferred part-of-speech of a misrecognized word are predictive of human clarification decisions.",
        "A combination of linguistic features predicts a user's decision to continue or stop a dialogue with accuracy of 72.8% over a majority baseline accuracy of 59.1%.",
        "The same set of features predict the decision to ask a targeted question with accuracy of 74.6% compared with the majority baseline of 71.8%.1"
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Clarification questions are common in human-human dialogue.",
        "They help dialogue participants maintain dialogue flow and resolve misunderstandings.",
        "Purver (2004) finds that in human-human dialogue speakers most frequently use reprise clarification questions to resolve recognition errors.",
        "Reprise clarification questions use portions of the misunderstood utterance which are thought to be correctly recognized to target the part of an utterance that was misheard or misunderstood.",
        "In the following example from (Purver, 2004), Speaker B has failed to hear the word toast and so constructs a clarification question using a portion of the correctly understood utterance ?",
        "the word some ?",
        "to query the portion of the utterance B has failed to understand:",
        "tional.",
        "A: Can I have some toast please?",
        "B: Some?",
        "A: Toast.",
        "Unlike human conversational partners, most dialogue systems today employ generic ?please repeat/rephrase?",
        "questions asking a speaker to repeat or rephrase an entire utterance.",
        "Our goal is to introduce reprise, or targeted, clarifications into an automatic spoken system.",
        "Targeted clarifications can be especially useful for systems accepting unrestricted speech, such as tutoring systems, intelligent agents, and speech translation systems.",
        "Using a reprise question, a user can correct an error by repeating only a portion of an utterance.",
        "Targeted questions also provide natural grounding and implicit confirmation by signalling to the conversation partner which parts of an utterance have been recognized.",
        "In order to handle a misrecognition, the system must first identify misrecognized words (Stoyanchev et al., 2012), determine the type of question to ask, and construct the question.",
        "In this work, we address two points necessary for determining the type of question to ask: ?",
        "Is it appropriate for a system to ask a clarification question when a misrecognized word is detected?",
        "?",
        "Is it possible to ask a targeted clarification question for a given sentence and an error segment?",
        "To answer these questions, we analyze a corpus of human responses to transcribed utterances with missing information which we collected using Amazon Mechanical Turk (2012).",
        "Although the data collection was text-based, we asked annotators to respond as they would in a dialogue.",
        "In Section 2, we describe related work on error recovery strategies in dialogue systems.",
        "In Section 3, we describe the corpus used in this experiment.",
        "In Section 4, we describe our experiments on human clarification strategy modelling.",
        "We conclude in Section 5 with our plan for applying our models in spoken systems."
      ]
    },
    {
      "heading": "2 Related work",
      "text": [
        "To handle errors in speech recognition, slot-filling dialogue systems typically use simple rejection (?I'm sorry.",
        "I didn't understand you.?)",
        "when they have low confidence in a recognition hypothesis and explicit or implicit confirmation when confidence scores",
        "are higher.",
        "Machine learning approaches have been successfully employed to determine dialogue strategies (Bohus and Rudnicky, 2005; Bohus et al., 2006; Rieser and Lemon, 2006), such as when to provide help, repeat a previous prompt, or move on to the next prompt.",
        "Reiser and Lemon (2006) use machine learning to determine an optimal clarification strategy in multimodal dialogue.",
        "Komatani et al. (2006) propose a method to generate a help message based on perceived user expertise.",
        "Corpus studies on human clarifications in dialogue indicate that users ask task-related questions and provide feedback confirming their hypothesis instead of giving direct indication of their misunderstanding (Skantze, 2005; Williams and Young, 2004; Koulouri and Lauria, 2009).",
        "In our work, we model human strategies with the goal of building a dialogue system which can generate targeted clarification questions for recognition errors that require additional user input but which can also recover from other errors automatically, as humans do."
      ]
    },
    {
      "heading": "3 Data",
      "text": [
        "In our experiments, we use a dataset of human responses to missing information, which we collected with Amazon Mechanical Turk (AMT).",
        "Each AMT annotator was given a set of Automatic Speech Recognition (ASR) transcriptions of an English utterance with a single misrecognized segment.",
        "925 such utterances were taken from acted dialogues between English and Arabic speakers conversing through SRI's IraqComm speech-to-speech translation system (Akba-cak et al., 2009).",
        "Misrecognized segments were replaced by ?XXX?",
        "to indicate the missing information, simulating a dialogue system's automatic detection of misrecognized words (Stoyanchev et al., 2012).",
        "For each sentence, AMT workers were asked to 1) indicate whether other information in the sentence made its meaning clear despite the error, 2) guess the missing word if possible, 3) guess the missing word's part-of-speech (POS) if possible, and 4) create a targeted clarification question if possible.",
        "Three annotators annotated each sentence.",
        "Table 1 summarizes the results.",
        "In 668 (72%) of the sentences an error segment corresponds to a single word while in 276 (28%) of them, an error segment corresponds to multiple words.",
        "For multiple word error segments, subjects had the option of guessing multiple words and POS tags.",
        "We scored their guess correct if any of their guesses matched the syntactic head word of an error segment determined from an automatically assigned dependency parse structure.",
        "We manually corrected annotators?",
        "POS tags if the hypothesized word was itself correct.",
        "After this post-processing, we see that AMT workers hypothesized POS correctly in 57.7% of single-word and 60.2% of multi-word error cases.",
        "They guessed words correctly in 34.9% and 19.3% of single-and multi-word error cases.",
        "They choose to ask a clarification question in 38.3% /47.9% of cases and 76.1%/62.3% of these questions were targeted clarification questions.",
        "These re",
        "multi-word error cases.",
        "Absolute annotator agreement is shown for single-word error cases.",
        "sults indicate that people are often able to guess a POS tag and sometimes an actual word.",
        "We observe that 1) in a single-word error segment, subjects are better at guessing an actual word than they are in a multi-word error segment; and 2) in a multi-word error segment, subjects are more likely to ask a clarification question and less likely to ask a targeted question.",
        "All three annotators agree on POS tags in 62% of cases and on hypothesized words in 25%.",
        "Annotators?",
        "agreement on response type is low ?",
        "not surprising since there is more than one appropriate and natural way to respond in dialogue.",
        "In 39% of cases, all three annotators agree on the decision to stop/continue and in only 25% of cases all three annotators agree on asking a targeted clarification question.",
        "Figure 1 shows the annotator",
        "continue dialogue without a question.",
        "distribution for asking a clarification question vs. continuing the dialogue based on hypothesized POS tag.",
        "It indicates that annotators are more likely to ask a question than continue without a question when they hypothesize a missing word to be a content word (noun or adjective) or when they are unsure of the POS of the missing word.",
        "They are more likely to continue when they believe a missing word is a function word.",
        "However, when they believe a missing word is a verb, they are more likely to continue, and they are also likely to identify the missing verb correctly.",
        "Figure 2 shows a distribution of annotator decisions as to the type of question they would ask.",
        "The proportion of targeted question types varies with hypothesized POS.",
        "It is more prevalent than confirm and generic questions combined for all POS tags except preposition and question word, indicating that annotators are generally able to construct a targeted clarification question based on their analysis of the error segment."
      ]
    },
    {
      "heading": "4 Experiment",
      "text": [
        "We use our AMT annotations to build classifiers for 1) choice of action: stop and engage in clarification vs. continue dialogue; and 2) type of clarification question (targeted vs. non-targeted) to ask.",
        "For the continue/stop experiment, we aim to determine whether a system should stop and ask a clarification question.",
        "For the targeted vs. non-targeted experiment, we aim to determine whether it is possible to ask a targeted clarification question.2 Using the Weka (Witten and Eibe, 2005) machine learning framework, we build classifiers to predict AMT decisions.",
        "We automatically assign POS tags to transcripts using the Stanford tagger (Toutanova and others, 2003).",
        "We compare models built with an automatically tagged POS for an error word (POS-auto) with one built with POS guessed by a user (POS-guess).",
        "Although a dialogue manager may not have access to a correct POS, it may simulate this by predicting POS of the error.",
        "We assign dependency tags using the AMU dependency parser (Nasr et al., 2011) which has been optimized on the Transtac dataset.",
        "We hypothesize that a user's dialogue move depends on the syntactic structure of a sentence as well as on syntactic and semantic information about the error word and its syntactic parent.",
        "To capture sentence structure, we use features associated with the whole sentence: POS ngram, all pairs of parent-child dependency tags in a sentence (Dep-pair), and all semantic roles (Sem-presence) in a sentence.",
        "To capture the syntactic and semantic role of a misrecognized word, we use features associated with this word: POS tag, dependency tag (Dep-tag), POS of the parent word (Parent-POS), and semantic role of an error word (Sem-role).",
        "We first model individual annotators?",
        "decisions for each of the three annotation instances.",
        "We measure the value that each feature adds to a model, using annotators?",
        "POS guess (POS-guess).",
        "Next, we model a joint annotators?",
        "decision using the automatically assigned POS-auto feature.",
        "This model simulates a system behaviour in a dialogue with a user where a system chooses a single dialogue move for each situation.",
        "We run 10-fold cross validation using the Weka J48 Deci-2If any annotators asked a targeted question, we assign a positive label to this instance, and negative otherwise.",
        "sion Tree algorithm."
      ]
    },
    {
      "heading": "4.1 Stop/Continue Experiment",
      "text": [
        "In this experiment, we classify each instance in the dataset into a binary continue or stop decision.",
        "Since each instance is annotated by three annotators, we first predict individual annotators?",
        "decisions.",
        "The absolute agreement on continue/stop is 39% which means that 61% of sentences are classified into both classes.",
        "We explore the role of each feature in predicting these decisions.",
        "All features used in this experiment, except for the POS-guess feature, are extracted from the sentences automatically.",
        "Variation in the POS-guess feature may explain some of the difference between annotator decisions.",
        "ual annotator's decision with POS-guess.",
        "Accuracy, F-measure and Difference of f-measure from All feature.",
        "?indicates statistically significant difference from the majority baseline (p<.01) Table 3 shows the results of continue/stop classification.",
        "A majority baseline method predicts the most frequent class continue and has 59.1% accuracy.",
        "In comparison, our classifier, built with all features, achieves 72.8% accuracy.",
        "Next, we evaluate the utility of each feature by removing it from the feature set and comparing the model built without it with a model built on all features.",
        "POS is the most useful feature, as we expected: when it is removed from the feature set, the f-measure decreases by 6.7%.",
        "A model trained on the POS-guess feature alone outperforms a model trained on all other features.",
        "Word position in the sentence is the next most salient feature, contributing 2% to the f-measure.",
        "The syntactic dependency features Syn-Dep, Dep-pair, and Parent POS together contribute 1.9%.3 Next, we predict a majority decision for each sentence.",
        "Table 4 shows the accuracy of this prediction.",
        "A majority baseline has an accuracy of 59.9%.",
        "When we use a model trained on the POS-auto feature alone, accuracy rises to 66.1%, while a combination of all features further increases it to 69.2%.",
        "decision, using POS-auto.",
        "?indicates statistically significant difference from the majority baseline (p<.01)."
      ]
    },
    {
      "heading": "4.2 Targeted Clarification Experiment",
      "text": [
        "In this experiment, we classify each instance into targeted or not targeted categories.",
        "The targeted category comprises the cases in which an annotator chooses to stop and ask a targeted question.",
        "We are interested in identifying these cases in order to determine whether a system should try to ask a targeted clarification question.",
        "Table 5 shows the results of this experiment.",
        "The majority baseline predicts not targeted and has a 71.8% accuracy because in most cases, no question is asked.",
        "A model trained on all features increases accuracy to 74.6%.",
        "POS is the most salient feature, contributing 3.8% to the f-measure.",
        "All models that use POS feature are significantly different from the baseline.",
        "The next most salient features are POS ngram and a combination of syntactic dependency features contributing 1% and .5% to the f-measure respectively.",
        "Table 6 shows system performance in predicting a joint annotators?",
        "decision of whether a targeted question can be asked.",
        "A joint decision in this experiment is considered not targeted when none of the annotators chooses to ask a targeted question.",
        "We aim at identifying the cases where position of an error word makes it difficult to ask a clarification question, such as for a sentence XXX somebody steal these supplies.",
        "Using the automatically assigned POS (POS-auto) feature alone achieves an accuracy of 62.2%, which is almost 10% above the baseline.",
        "A combination of all features, surprisingly, lowers the accuracy to 59.4%.",
        "Interestingly, a combination of all features less POS increases accuracy 3All trained models are significantly different from the baseline.",
        "None of the trained models are significantly different from each other.",
        "ual annotator's decision with POS-guess.",
        "Accuracy, F-measure and Difference of f-measure from All feature.",
        "?indicates statistically significant difference from the majority baseline (p<.05) above the baseline by 7.6% points to 60.1% accuracy.",
        "decision, using POS tag feature POS-auto.",
        "?indicates statistically significant difference from the majority baseline."
      ]
    },
    {
      "heading": "5 Conclusions and Future Work",
      "text": [
        "In this paper we have described experiments modelling human strategies in response to ASR errors.",
        "We have used machine learning techniques on a corpus annotated by AMT workers asked to respond to missing information in an utterance.",
        "Although annotation agreement in this task is low, we aim to learn natural strategies for a dialogue system by combining the judgements of several annotators.",
        "In a dialogue, as in other natural language tasks, there is more than one appropriate response in each situation.",
        "A user does not judge the system (or another speaker) by a single response.",
        "Over a dialogue session, appropriateness, or lack of it in system actions, becomes evident.",
        "We have shown that by using linguistic features we can predict the decision to either ask a clarification question or continue dialogue with an accuracy of 72.8% in comparison with the 59.1% baseline.",
        "The same linguistic features predict a targeted clarification question with an accuracy of 74.6% compared to the baseline of 71.8%.",
        "In future work, we will apply modelling of a clarification choice strategy in a speech-to-speech translation task.",
        "In our related work, we have addressed the problem of automatic correction of some ASR errors for cases when humans believe a dialogue can continue without clarification In other work, we have addressed the creation of targeted clarification questions for handling the cases when such questions are appropriate.",
        "Combining these research directions, we are developing a clarification component for a speech-to-speech translation system that responds naturally to speech recognition errors."
      ]
    }
  ]
}
