{
  "info": {
    "authors": [
      "Zornitsa Kozareva"
    ],
    "book": "ACL",
    "id": "acl-P13-1067",
    "title": "Multilingual Affect Polarity and Valence Prediction in Metaphor-Rich Texts",
    "url": "https://aclweb.org/anthology/P13-1067",
    "year": 2013
  },
  "references": [
    "acl-C04-1200",
    "acl-C10-1113",
    "acl-C88-1081",
    "acl-D09-1062",
    "acl-D11-1016",
    "acl-H05-1044",
    "acl-N10-1147",
    "acl-P02-1053",
    "acl-P07-2010",
    "acl-P10-1071",
    "acl-P11-1032",
    "acl-P11-2102",
    "acl-P12-2015",
    "acl-P12-3002",
    "acl-W07-2013",
    "acl-W13-0904"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Metaphor is an important way of conveying the affect of people, hence understanding how people use metaphors to convey affect is important for the communication between individuals and increases cohesion if the perceived affect of the concrete example is the same for the two individuals.",
        "Therefore, building computational models that can automatically identify the affect in metaphor-rich texts like ?The team captain is a rock.",
        "?, ?Time is money.",
        "?, ?My lawyer is a shark.?",
        "is an important challenging problem, which has been of great interest to the research community.",
        "To solve this task, we have collected and manually annotated the affect of metaphor-rich texts for four languages.",
        "We present novel algorithms that integrate triggers for cognitive, affective, perceptual and social processes with stylistic and lexical information.",
        "By running evaluations on datasets in English, Spanish, Russian and Farsi, we show that the developed affect polarity and valence prediction technology of metaphor-rich texts is portable and works equally well for different languages."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Metaphor is a figure of speech in which a word or phrase that ordinarily designates one thing is used to designate another, thus making an implicit comparison (Lakoff and Johnson, 1980; Martin, 1988; Wilks, 2007).",
        "For instance, in ?My lawyer is a shark?",
        "the speaker may want to communicate that his/her lawyer is strong and aggressive, and that he will attack in court and persist until the goals are achieved.",
        "By using the metaphor, the speaker actually conveys positive affect because having an aggressive lawyer is good if one is being sued.",
        "There has been a substantial body of work on metaphor identification and interpretation (Wilks, 2007; Shutova et al., 2010).",
        "However, in this paper we focus on an equally interesting, challenging and important problem, which concerns the automatic identification of affect carried by metaphors.",
        "Building such computational models is important to understand how people use metaphors to convey affect and how affect is expressed using metaphors.",
        "The existence of such models can be also used to improve the communication between individuals and to make sure that the speakers perceived the affect of the concrete metaphor example in the same way.",
        "The questions we address in this paper are: ?How can we build computational models that can identify the polarity and valence associated with metaphor-rich texts??",
        "and ?Is it possible to build such automatic models for multiple languages??.",
        "Our main contributions are: ?",
        "We have developed multilingual metaphor-rich datasets in English, Spanish, Russian and Farsi that contain annotations of the Positive and Negative polarity and the valence (from ?3 to +3 scale) corresponding to the intensity of the affect conveyed in the metaphor.",
        "?",
        "We have proposed and developed automated methods for solving the polarity and valence tasks for all four languages.",
        "We model the polarity task as a classification problem, while the valence task as a regression problem.",
        "?",
        "We have studied the influence of different information sources like the metaphor itself, the context in which it resides, the source and",
        "target domains of the metaphor, in addition to contextual features and trigger word lists developed by psychologists (Tausczik and Pen-nebaker, 2010).",
        "?",
        "We have conducted in depth experimental evaluation and showed that the developed methods significantly outperform baseline methods.",
        "The rest of the paper is organized as follows.",
        "Section 2 describes related work, Section 3 briefly talks about metaphors.",
        "Sections 4 and 5 describe the polarity classification and valence prediction tasks for affect of metaphor-rich texts.",
        "Both sections have information on the collected data for English, Spanish, Russian and Farsi, the conducted experiments and obtained results.",
        "Finally, we conclude in Section 6."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "A substantial body of work has been done on determining the affect (sentiment analysis) of texts (Kim and Hovy, 2004; Strapparava and Mihalcea, 2007; Wiebe and Cardie, 2005; Yessenalina and Cardie, 2011; Breck et al., 2007).",
        "Various tasks have been solved among which polarity and valence identification are the most common.",
        "While polarity identification aims at finding the Positive and Negative affect, valence is more challenging as it has to map the affect on a [?3,+3] scale depending on its intensity (Polanyi and Zaenen, 2004; Strapparava and Mihalcea, 2007).",
        "Over the years researchers have developed various approaches to identify polarity of words (Esuli and Sebastiani, 2006), phrases (Turney, 2002; Wilson et al., 2005), sentences (Choi and Cardie, 2009) even documents (Pang and Lee, 2008).",
        "Multiple techniques have been employed, from various machine learning classifiers, to clustering and topic models.",
        "Various domains and textual sources have been analyzed such as Twitter, Blogs, Web documents, movie and product reviews (Turney, 2002; Kennedy and Inkpen, 2005; Niu et al., 2005; Pang and Lee, 2008), but yet what is missing is affect analyzer for metaphor-rich texts.",
        "While the affect of metaphors is well studied from its linguistic and psychological aspects (Blanchette et al., 2001; Tomlinson and Love, 2006; Crawdord, 2009), to our knowledge the building of computational models for polarity and valence identification in metaphor-rich texts is still a novel task (Smith et al., 2007; Veale, 2012; Veale and Li, 2012; Reyes and Rosso, 2012; Reyes et al., 2013).",
        "Little (almost no) effort has been put into multilingual computational affect models of metaphor-rich texts.",
        "Our research specifically targets the resolution of these problems and shows that it is possible to build such computational models.",
        "The experimental result provide valuable contributions and fundings, which could be used by the research community to build upon."
      ]
    },
    {
      "heading": "3 Metaphors",
      "text": [
        "Although there are different views on metaphor in linguistics and philosophy (Black, 1962; Lakoff and Johnson, 1980; Gentner, 1983; Wilks, 2007), the common among all approaches is the idea of an interconceptual mapping that underlies the production of metaphorical expressions.",
        "There are two concepts or conceptual domains: the target (also called topic in the linguistics literature) and the source (or vehicle), and the existence of a link between them gives rise to metaphors.",
        "The texts ?Your claims are indefensible.?",
        "and ?He attacked every weak point in my argument.?",
        "do not directly talk about argument as a war, however the winning or losing of arguments, the attack or defense of positions are structured by the concept of war.",
        "There is no physical battle, but there is a verbal battle and the structure of an argument (attack, defense) reflects this (Lakoff and Johnson, 1980).",
        "As we mentioned before, there has been a lot of work on the automatic identification of metaphors (Wilks, 2007; Shutova et al., 2010) and their mapping into conceptual space (Shutova, 2010a; Shutova, 2010b), however these are beyond the scope of this paper.",
        "Instead we focus on an equally interesting, challenging and important problem, which concerns the automatic identification of affect carried by metaphors.",
        "To conduct our study, we use human annotators to collect metaphor-rich texts (Shutova and Teufel, 2010) and tag each metaphor with its corresponding polarity (Positive/Negative) and valence [?3,+3] scores.",
        "The next sections describe the affect polarity and valence tasks we have defined, the collected and annotated metaphor-rich data for each one of the English, Spanish, Russian and Farsi languages, the conducted experiments and obtained results."
      ]
    },
    {
      "heading": "4 Task A: Polarity Classification",
      "text": []
    },
    {
      "heading": "4.1 Problem Formulation",
      "text": [
        "Task Definition: Given metaphor-rich texts annotated with Positive and Negative polarity labels, the goal is to build an automated computational affect model, which can assign to previously unseen metaphors one of the two polarity classes.",
        "a tough pill to swallow values that gave our nation birth Clinton also came into office hoping to bridge Washington's partisan divide.",
        "Thirty percent of our mortgages are underwater.",
        "The administration, in fact, could go further with the budget knife by eliminating the V-22 Osprey aircraft the 'things' are going to make sure their ox doesn't get gored",
        "metaphors were classified into Positive or Negative.",
        "For instance, the metaphor ?tough pill to swallow?",
        "has Negative polarity as it stands for something being hard to digest or comprehend, while the metaphor ?values that gave our nation birth?",
        "has a Positive polarity as giving birth is like starting a new beginning."
      ]
    },
    {
      "heading": "4.2 Classification Algorithms",
      "text": [
        "We model the metaphor polarity task as a classification problem in which, for a given collection of N training examples, where mi is a metaphor and ci is the polarity of mi, the objective is to learn a classification function f : mi ?",
        "ci in which 1 stands for positive polarity and 0 stands for negative polarity.",
        "We tested five different machine learning algorithms such as Nave Bayes, SVM with polynomial kernel, SVM with RBF kernel, AdaBoost and Stacking, out of which AdaBoost performed the best.",
        "In our experimental study, we use the freely available implementations in Weka (Witten and Frank, 2005).",
        "Evaluation Measures: To evaluate the goodness of the polarity classification algorithms, we calculate the f-score and accuracy on 10-fold cross validation."
      ]
    },
    {
      "heading": "4.3 Data Annotation",
      "text": [
        "To conduct our experimental study, we have used annotated data provided by the Language Computer Corporation (LCC)1, which developed anno",
        "tation toolkit specifically for the task of metaphor detection, interpretation and affect assignment.",
        "They hired annotators to collect and annotate data for the English, Spanish, Russian and Farsi languages.",
        "The domain for which the metaphors were collected was Governance.",
        "It encompasses electoral politics, the setting of economic policy, the creation, application and enforcement of rules and laws.",
        "The metaphors were collected from political speeches, political websites, online newspapers among others (Mohler et al., 2013).",
        "The annotation toolkit allowed annotators to provide for each metaphor the following information: the metaphor, the context in which the metaphor was found, the meaning of the metaphor in the source and target domains from the perspective of a native speaker.",
        "For example, in the Context: And to all nations, we will speak for the values that gave our nation birth.",
        "; the annotators tagged the Metaphor: values that gave our nation birth; and listed as Source: mother gave birth to baby; and Target: values of freedom and equality motivated the creation of America.",
        "The same annotators also provided the affect associated with the metaphor.",
        "The agreements of the annotators as measured by LCC are: .83, .87, .80 and .61 for the English, Spanish, Russian and Farsi languages.",
        "In our study, the maximum length of a metaphor is a sentence, but typically it has the span of a phrase.",
        "The maximum length of a context is three sentences before and after the metaphor, but typically it has the span of one sentence before and after.",
        "In our study, the source and target domains are provided by the human annotators who agree on these definitions, however the source and target can be also automatically generated by an interpretation system or a concept mapper.",
        "The generation of source and target information is beyond the scope of this paper, but studying their impact on affect is important.",
        "At the same time, we want to show that if the technology for source/target detection and interpretation is not yet available, then how far can one reach by using the metaphor itself and the context around it.",
        "Later depending on the availability of the information sources and toolkits one can decide whether to integrate such information or to ignore it.",
        "In the experimental sections, we show how the individual information sources and their combination affects the resolution of the metaphor polarity and valence prediction tasks.",
        "Table 1 shows the positive and negative class",
        "distribution for each one of the four languages.",
        "guages The majority of the the annotated examples are for English.",
        "However, given the difficulty of finding bilingual speakers, we still managed to collect around 600 examples for Spanish and Farsi, and 886 examples for Russian."
      ]
    },
    {
      "heading": "4.4 N-gram Evaluation and Results",
      "text": [
        "N-gram features are widely used in a variety of classification tasks, therefore we also use them in our polarity classification task.",
        "We studied the influence of unigrams, bigrams and a combination of the two, and saw that the best performing feature set consists of the combination of unigrams and bigrams.",
        "In this paper, we will refer from now on to n-grams as the combination of unigrams and bigrams.",
        "Figure 2 shows a study of the influence of the different information sources and their combination with n-gram features for English."
      ]
    },
    {
      "heading": "Metaphor Polarity Classification of English Texts",
      "text": [
        "For each information source (metaphor, context, source, target and their combinations), we built a separate n-gram feature set and model, which was evaluated on 10-fold cross validation.",
        "The results from this study show that for English, the more information sources one combines, the higher the classification accuracy becomes.",
        "Table 2 shows the influence of the information sources for Spanish, Russian and Farsi with the n-gram features.",
        "The best f-scores for each language are shown in bold.",
        "For Farsi and Russian high performances are obtained both with the context and with the combination of the context, source and target information.",
        "While for Spanish they reach similar performance."
      ]
    },
    {
      "heading": "4.5 LIWC as a Proxy for Metaphor Polarity",
      "text": [
        "LIWC Repository: In addition to the n-gram features, we also used the Linguistic Inquiry and Word Count (LIWC) repository (Tausczik and Pennebaker, 2010), which has 64 word categories corresponding to different classes like emotional states, psychological processes, personal concerns among other.",
        "Each category contains a list of words characterizing it.",
        "For instance, the LIWC category discrepancy contains words like should, could among others, while the LIWC category inhibition contains words like block, stop, constrain.",
        "Previously LIWC was successfully used to ana-lyze the emotional state of bloggers and tweeters (Quercia et al., 2011) and to identify deception and sarcasm in texts (Ott et al., 2011; Gonza?lez-Iba?n?ez et al., 2011).",
        "When LIWC analyzes texts it generates statistics like number of words found in category Ci divided by the total number of words in the text.",
        "For our metaphor polarity task, we use LIWC's statistics of all 64 categories and feed this information as features for the machine learning classifiers.",
        "LIWC repository contains conceptual categories (dictionaries) both for the English and Spanish languages.",
        "LIWC Evaluation and Results: In our experiments LIWC is applied to English and Spanish metaphor-rich texts since the LIWC category dictionaries are available for both languages.",
        "Table 3 shows the obtained accuracy and f-score results in English and Spanish for each one of the information sources.",
        "on 10-fold validation for English and Spanish The best performances are reached with individual information sources like metaphor, context, source or target instead of their combinations.",
        "The classifiers obtain similar performance for both languages.",
        "LIWC Category Relevance to Metaphor Polarity: We also study the importance and relevance of the LIWC categories for the metaphor polarity task.",
        "We use information gain (IG) to measure the amount of information in bits about the polarity class prediction, if the only information available is the presence of a given LIWC category (feature) and the corresponding polarity class distribution.",
        "IG measures the expected reduction in entropy (uncertainty associated with a random feature) (Mitchell, 1997).",
        "Figure 3 illustrates how certain categories occur more with the positive (in red color) vs negative (in green color) class.",
        "With the positive metaphors we observe the LIWC categories for present tense, social, affect and family, while for the negative metaphors we see LIWC categories for past tense, inhibition and anger.",
        "In addition, we show in Figure 4 examples of the top LIWC categories according to IG ranking for each one of the information sources."
      ]
    },
    {
      "heading": "Words",
      "text": [
        "For metaphor texts, these categories are I, con-juntion, anger, discrepancy, swear words among others; for contexts the categories are pronouns like I, you, past tense, friends, affect and so on.",
        "Our study shows that some of the LIWC categories are important across all information sources, but overall different triggers activate depending on the information source and the length of the text used."
      ]
    },
    {
      "heading": "4.6 Comparative study",
      "text": [
        "Figure 5 shows a comparison of the accuracy of our best performing approach for each language.",
        "For English and Spanish these are the LIWC models, while for Russian and Farsi these are the n-gram models.",
        "We compare the performance of the algorithms with a majority baseline, which assigns the majority class to each example.",
        "For instance, in English there are 3529 annotated examples, of which 2086 are positive and 1443 are negative.",
        "Since the positive class is the predominant one for this language and dataset, a majority classifier would have .59 accuracy in returning the positive class as an answer.",
        "Similarly, we compute the majority baseline for the rest of the languages.",
        "!\"\"#$%\"&' (%)*$+,&'-%./0+1/' 2+3/$/1\"/'''4150+.6' 7898:' ;79<<' =>79?7'@A%1+.6' 7B97:' ?8988' =C79:C'D#..+%1' BB9::' ;C98C' =CE9<8'F%$.+' BC9C:' ?",
        ":9>:' =<<97:'"
      ]
    },
    {
      "heading": "Classification",
      "text": [
        "As we can see from Figure 5 that all classifiers significantly outperform the majority base",
        "line.",
        "For Farsi the increment is +11.90, while for English the increment is +39.69.",
        "This means that the built classifiers perform much better than a random classifier."
      ]
    },
    {
      "heading": "4.7 Lessons Learned",
      "text": [
        "To summarize, in this section we have defined the task of polarity classification and we have presented a machine learning solution.",
        "We have used different feature sets and information sources to solve the task.",
        "We have conducted exhaustive evaluations for four different languages namely English, Spanish, Russian and Farsi.",
        "The learned lessons from this study are: (1) for n-gram usage, the larger the context of the metaphor, the better the classification accuracy becomes; (2) if present source and target information can further boost the performance of the classifiers; (3) LIWC is a useful resource for polarity identification in metaphor-rich texts; (4) analyzing the usages of tense like past vs. present and pronouns are important triggers for positive and negative polarity of metaphors; (5) some categories like family, social presence indicate positive polarity, while others like inhibition, anger and swear words are indicative of negative affect; (6) the built models significantly outperform majority baselines."
      ]
    },
    {
      "heading": "5 Task B: Valence Prediction",
      "text": []
    },
    {
      "heading": "5.1 Problem Formulation",
      "text": [
        "Task Definition: Given metaphor-rich texts annotated with valence score (from ?3 to +3), where ?3 indicates strong negativity, +3 indicates strong positivity, 0 indicates neural, the goal is to build a model that can predict without human supervision the valence scores of new previously unseen metaphors.",
        "The administration, in fact, could go further with the budget knife by eliminating the V-22 Osprey aircraft Clinton also came into office hoping to bridge Washington's partisan divide.",
        "values that gave our nation birth !\"#",
        "a tough pill to swallow &\"# the 'things' are going to make sure their ox doesn't get gored &$# Thirty percent of our mortgages are underwater.",
        "&%#",
        "diction task in which the metaphor-rich texts must be arranged by the intensity of the emotional state provoked by the texts.",
        "For instance, ?3 corresponds to very strong negativity, ?2 strong negativity, ?1 weak negativity (similarly for the positive classes).",
        "In this task we also consider metaphors with neutral affect.",
        "They are annotated with the 0 label and the prediction model should be able to predict such intensity as well.",
        "For instance, the metaphor ?values that gave our nation birth?, is considered by American people that giving birth sets new beginning and has a positive score +1, but ?budget knife?",
        "is more positive +3 since tax cut is more important.",
        "As any sentiment analysis task, affect assignment of metaphors is also a subjective task and the produced annotations express the values, believes and understanding of the annotators."
      ]
    },
    {
      "heading": "5.2 Regression Model",
      "text": [
        "We model the valence task a regression problem, in which for a given metaphor m, we seek to predict the valence v of m. We do this via a parametrized function f :v?",
        "= f(m;w), where w ?",
        "Rd are the weights.",
        "The objective is to learn w from a collection of N training examples {< mi, vi >}Ni=1, where mi are the metaphor examples and vi ?",
        "R is the valence score of mi.Support vector regression (Drucker et al., 1996)is a well-known method for training a regressionmodel by solving the following optimization prob-lem:",
        "-insensitive loss function where C is a regularization constant and controls the training error.",
        "The training algorithm finds weights w that define a function f minimizing the empirical risk.",
        "Let h be a function from seeds into some vector-space representation ?",
        "Rd, then the function f takes the form: f(m;w) = h(m)Tw =?N i=1 ?iK(m,mi), where f is re-parameterized in terms of a polynomial kernel function K with dual weights ?i.",
        "K measures the similarity between two metaphoric texts.",
        "Full details of the regression model and its implementation are beyond the scope of this paper; for more details see (Scho?lkopf and Smola, 2001; Smola et al., 2003).",
        "In our experimental study, we use the freely available implementation of SVM in Weka (Witten and Frank, 2005).",
        "Evaluation Measures: To evaluate the quality of the valence prediction model, we compare the actual valence score of the metaphor given by human annotators denoted with y against those valence scores predicted by the regression model denoted with x.",
        "We estimate the goodness of the regression model calculating both the correlation coef",
        "and the mean squared error msex,y = ?n i=i(x?x?)",
        "n .The two evaluation measures should be interpreted in the following manner.",
        "Intuitively the higher the correlation score is, the better the correlation between the actual and the predicted valence scores will be.",
        "Similarly the smaller the mean squared error rate, the better the regression model fits the valence predictions to the actual score."
      ]
    },
    {
      "heading": "5.3 Data Annotation",
      "text": [
        "To conduct our valence prediction study, we used the same human annotators from the polarity classification task for each one of the English, Spanish, Russian and Farsi languages.",
        "We asked the annotators to map each metaphor on a [?3,+3] scale depending on the intensity of the affect associated with the metaphor.",
        "Table 4 shows the distribution (number of examples) for each valence class and for each language."
      ]
    },
    {
      "heading": "5.4 Empirical Evaluation and Results",
      "text": [
        "For each language and information source we built separate valence prediction regression models.",
        "We used the same features for the regression task as we have used in the classification task.",
        "Those include n-grams (unigrams, bigrams and combination of the two), LIWC scores.",
        "Table 5 shows the obtained correlation coefficient (CC) and mean squared error (MSE) results for each one of the four languages (English, Spanish, Russian and Farsi) using the dataset described in Table 4.",
        "The Farsi and Russian regression models are based only on n-gram features, while the English and Spanish regression models have both n-gram and LIWC features.",
        "Overall, the CC for English and Spanish is higher when LIWC features are used.",
        "This means that the LIWC based valence regression model approximates the predicted values better to those of the human annotators.",
        "The better valence prediction happens when the metaphor itself is used by LIWC.",
        "The MSE for English and Spanish is the lowest, meaning that the prediction is the closest to those of the human annotators.",
        "In Russian and Farsi the lowest MSE is when the combined metaphor, source and target information sources are used.",
        "For English and Spanish the smallest MSE or so called prediction error is 1.52 and 1.30 respectively, while for Russian and Farsi is 1.62 and 2.13 respectively."
      ]
    },
    {
      "heading": "5.5 Lessons Learned",
      "text": [
        "To summarize, in this section we have defined the task of valence prediction of metaphor-rich texts and we have described a regression model for its solution.",
        "We have studied different feature sets and information sources to solve the task.",
        "We have conducted exhaustive evaluations in all four languages namely English, Spanish, Russian and Farsi.",
        "The learned lessons from this study are: (1) valence prediction is a much harder task than polarity classification both for human annotation and for the machine learning algorithms; (2) the obtained results showed that despite its difficulty this is still a plausible problem; (3) similarly to the polarity classification task, valence prediction with LIWC is improved when shorter contexts (the metaphor/source/target information source) are considered."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "People use metaphor-rich language to express affect and often affect is expressed through the usage of metaphors.",
        "Therefore, understanding that the metaphor ?I was boiling inside when I saw him.?",
        "has Negative polarity as it conveys feeling of anger is very important for interpersonal or multicultural communications.",
        "In this paper, we have introduced a novel corpus of metaphor-rich texts for the English, Spanish, Russian and Farsi languages, which was manually annotated with the polarity and valence scores of the affect conveyed by the metaphors.",
        "We have studied the impact of different information sources such as the metaphor in isolation, the context in which the metaphor was used, the source and target domain meanings of the metaphor and",
        "their combination in order to understand how such information helps and impacts the interpretation of the affect associated with the metaphor.",
        "We have conducted exhaustive evaluation with multiple machine learning classifiers and different features sets spanning from lexical information to psychological categories developed by (Tausczik and Pennebaker, 2010).",
        "Through experiments carried out on the developed datasets, we showed that the proposed polarity classification and valence regression models significantly improve baselines (from 11.90% to 39.69% depending on the language) and work well for all four languages.",
        "From the two tasks, the valence prediction problem was more challenging both for the human annotators and the automated system.",
        "The mean squared error in valence prediction in the range [?3,+3], where ?3 indicates strong negative and +3 indicates strong positive affect for English, Spanish and Russian was around 1.5, while for Farsi was around 2.",
        "The current findings and learned lessons reflect the properties of the collected data and its annotations.",
        "In the future we are interested in studying the affect of metaphors for domains different than Governance.",
        "We want to conduct studies with the help of social sciences who would research whether the tagging of affect in metaphors depends on the political affiliation, age, gender or culture of the annotators.",
        "Not on a last place, we would like to improve the built valence prediction models and to collect more data for Spanish, Russian and Farsi."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The author would like to thank the reviewers for their helpful comments as well as the LCC annotators who have prepared the data and made this work possible.",
        "This research is supported by the Intelligence Advanced Research Projects Activity (IARPA) via Department of Defense US Army Research Laboratory contract number W911NF12-C-0025.",
        "The U.S. Government is authorized to reproduce and distribute reprints for Governmental purposes notwithstanding any copyright annotation thereon.",
        "Disclaimer: The views and conclusions contained herein are those of the authors and should not be interpreted as necessarily representing the official policies or endorsements, either expressed or implied, of IARPA, DoD/ARL, or the U.S. Government."
      ]
    }
  ]
}
