{
  "info": {
    "authors": [
      "William Blacoe",
      "Elham Kashefi",
      "Mirella Lapata"
    ],
    "book": "NAACL",
    "id": "acl-N13-1105",
    "title": "A Quantum-Theoretic Approach to Distributional Semantics",
    "url": "https://aclweb.org/anthology/N13-1105",
    "year": 2013
  },
  "references": [
    "acl-D12-1050",
    "acl-D12-1130",
    "acl-J10-4006",
    "acl-J98-1004",
    "acl-P12-1092",
    "acl-P98-2127",
    "acl-W08-1301",
    "acl-W11-0114"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper we explore the potential of quantum theory as a formal framework for capturing lexical meaning.",
        "We present a novel semantic space model that is syntactically aware, takes word order into account, and features key quantum aspects such as superposition and entanglement.",
        "We define a dependency-based Hilbert space and show how to represent the meaning of words by density matrices that encode dependency neigh-borhoods.",
        "Experiments on word similarity and association reveal that our model achieves results competitive with a variety of classical models."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The fields of cognitive science and natural language processing have recently produced an ensemble of semantic models which have an impressive track record of replicating human behavior and enabling real-world applications.",
        "Examples include simulations of word association (Denhie`re and Lemaire, 2004; Griffiths et al., 2007), semantic priming (Lund and Burgess, 1996; Landauer and Dumais, 1997; Griffiths et al., 2007), categorization (Laham, 2000), numerous studies of lexicon acquisition (Grefen-stette, 1994; Lin, 1998), word sense discrimination (Schu?tze, 1998), and paraphrase recognition (Socher et al., 2011).",
        "The term ?semantic?",
        "derives from the intuition that words seen in the context of a given word contribute to its meaning (Firth, 1957).",
        "Although the specific details of the individual models differ, they all process a corpus of text as input and represent words (or concepts) in a (reduced) high-dimensional space.",
        "In this paper, we explore the potential of quantum theory as a formal framework for capturing lexical meaning and modeling semantic processes such as word similarity and association (see Section 6 for an overview of related research in this area).",
        "We use the term quantum theory to refer to the abstract mathematical foundation of quantum mechanics which is not specifically tied to physics (Hughes, 1989; Isham, 1989).",
        "Quantum theory is in principle applicable in any discipline where there is a need to formalize uncertainty.",
        "Indeed, researchers have been pursuing applications in areas as diverse as economics (Baaquie, 2004), information theory (Nielsen and Chuang, 2010), psychology (Khren-nikov, 2010; Pothos and Busemeyer, 2012), and cognitive science (Busemeyer and Bruza, 2012; Aerts, 2009; Bruza et al., 2008).",
        "But what are the features of quantum theory which make it a promising framework for modeling meaning?",
        "Superposition, entanglement, incompatibility, and interference are all related aspects of quantum theory, which endow it with a unique character.1 Superposition is a way of modeling uncertainty, more so than in classical probability theory.",
        "It contains information about the potentialities of a system's state.",
        "An electron whose location in an atom is uncertain can be modeled as being in a superposition of locations.",
        "Analogously, words in natural language can have multiple meanings.",
        "In isolation, the word pen may refer to a writing implement, an enclosure for confining livestock, a playpen, a penitentiary or a female swan.",
        "However, when observed in the context of the word ink the ambiguity resolves into the sense of the word dealing with writing.",
        "The meanings of words in a semantic space are superposed in a way which is intuitively similar to the atom's electron.",
        "Entanglement concerns the relationship between 1It is outside the scope of the current paper to give a detailed introduction on the history of quantum mechanics.",
        "We refer the interested reader to Vedral (2006) and Kleppner and Jackiw (2000) for comprehensive overviews.",
        "systems for which it is impossible to specify a joint probability distribution from the probability distributions of their constituent parts.",
        "With regard to word meanings, entanglement encodes (hidden) relationships between concepts.",
        "The different senses of a word ?exist in parallel?",
        "until it is observed in some context.",
        "This reduction of ambiguity has effects on other concepts connected via entanglement.",
        "The notion of incompatibility is fundamental to quantum systems.",
        "In classical systems, it is assumed by default that measurements are compatible, that is, independent, and as a result the order in which these take place does not matter.",
        "By contrast in quantum theory, measurements may share (hidden) order-sensitive interdependencies and the outcome of the first measurement can change the outcome of the second measurement.",
        "Interference is a feature of quantum probability that can cause classical assumptions such as the law of total probability to be violated.",
        "When concepts interact their joint representation can exhibit non-classical behavior, e.g., with regard to conjunction and disjunction (Aerts, 2009).",
        "An often cited example is the ?guppy effect?.",
        "Although guppy is an example of a pet-fish it is neither a very typical pet nor fish (Osherson and Smith, 1981).",
        "In the following we use the rich mathematical framework of quantum theory to model semantic information.",
        "Specifically, we show how word meanings can be expressed as quantum states.",
        "A word brings with it its own subspace which is spanned by vectors representing its potential usages.",
        "We present a specific implementation of a semantic space that is syntactically aware, takes word order into account, and features key aspects of quantum theory.",
        "We empirically evaluate our model on word similarity and association and show that it achieves results competitive with a variety of classical models.",
        "We begin by introducing some of the mathematical background needed for describing our approach (Section 2).",
        "Next, we present our semantic space model (Section 3) and our evaluation experiments (Sections 4 and 5).",
        "We conclude by discussing related work (Section 6)."
      ]
    },
    {
      "heading": "2 Preliminaries",
      "text": [
        "Let c = r ei?",
        "be a complex number, expressed in polar form, with absolute value r = |c |and phase ?.",
        "Its complex conjugate c?",
        "= r e?i?",
        "has the inverse phase.",
        "Thus, their product cc?",
        "= (r ei?",
        ")(r e?i?)",
        "= r2 is real."
      ]
    },
    {
      "heading": "2.1 Vectors",
      "text": [
        "We are interested in finite-dimensional, complex-valued vector spaces Cn with an inner product, otherwise known as Hilbert space.",
        "A column vector ???",
        "?",
        "Cn can be written as an ordered vertical array of its n complex-valued components, or alternatively as a weighted sum of base vectors:",
        "bn}, any other set of n orthonormal vectors serves just as well as a base for the same space.",
        "Dirac (1939) introduced the so-called bra-ket notation which is equally expressive but notationally more convenient.",
        "A column vector becomes a ket: ???",
        "?",
        "|?",
        "?= ?1|b1?+?2|b2?+ .",
        ".",
        ".+?n|bn?",
        "(2) and a row vector becomes a bra ??|.",
        "Transposing a complex-valued vector or matrix (via the superscript ???)",
        "involves complex-conjugating all components:",
        "The Dirac notation for the inner product ??|??",
        "illustrates the origin of the terminology ?bra-ket?.",
        "Since Bstd's elements are normalised and pairwise orthogonal their inner product is:",
        "The inner product is also applicable to pairs of non-base kets:",
        "Reversing the order of an inner product complex"
      ]
    },
    {
      "heading": "2.2 Matrices",
      "text": [
        "Matrices are sums of outer products |????|.",
        "For example, the matrix (Mi, j)i, j can be thought of as the weighted sum of ?base-matrices?",
        "Bi, j ?",
        "|bi?",
        "?b j|, whose components are all 0 except for a 1 in the i-throw and j-th column.",
        "The outer product extends linearly to non-base kets in the following manor:",
        "This is analogous to the conventional multiplication:",
        "We will also make use of the tensor product.",
        "Its application to kets, bras and outer products is linear:",
        "For convenience we omit ???",
        "where no confusion arises, e.g., |a?",
        "?",
        "|b?",
        "= |a?|b?.",
        "When applied to Hilbert spaces, the tensor product creates the composed Hilbert space H = H1?",
        "...?Hn whose base kets are simply induced by the tensor product of its subspaces?",
        "base kets:",
        "Whereas the order of composed kets |a?|b?|c?",
        "usually suffices to identify which subket lives in which subspace, we make this explicit by giving subkets the same subscript as the corresponding subspace.",
        "Thus, the order no longer matters, as in the following inner product of composed kets:",
        "The term ?density matrix?",
        "is synonymous with ?density operator?.",
        "Any density matrix ?",
        "can be decomposed arbitrarily as ?",
        "= ?i pi|si?",
        "?si|, the weighted sum of sub-matrices |si?",
        "?si |with pi ?",
        "R>0 and ?si|si?= 1.",
        "The pi need not sum to 1.",
        "In fact the decomposition where the pi sum to 1 and the |si?",
        "are mutually orthogonal is unique and is called the eigen decomposition.",
        "Consequently Beig = {|si?",
        "}i constitutes an orthonormal base, ?",
        "'s so-called eigen base.",
        "Density operators are used in quantum theory to describe the state of some system.",
        "If the system's state ?",
        "is certain we call it a pure state and write ?= |s?",
        "?s| for some unit ket |s?.",
        "Systems whose state is uncertain are described by a mixed state ?",
        "= ?i pi|si?",
        "?si| which represents an ensemble of substates or pure states {(pi,si)}i where the system is in substate si with probability pi.",
        "Hence, the term ?density?",
        "as in probability density.",
        "It is possible to normalize a density matrix without committing to any particular decomposition.",
        "Only the trace function is required, because norm(?)",
        "= ?/Tr(?).",
        "Definition 2 mentions what the trace function does.",
        "However, notice that the same result is produced for any orthonormal base B , including ?",
        "'s eigen base Beig = {|ei?}i.",
        "Even though we do not know the content of Beig, we know that it",
        "exists.",
        "So we use it to show that dividing ?",
        "by:",
        "normalizes its probability distribution over eigen kets:"
      ]
    },
    {
      "heading": "3 Semantic Space Model",
      "text": [
        "We represent the meaning of words by density matrices.",
        "Specifically, a lexical item w is modeled as an ensemble Uw = {(pi,ui)}i of usages ui and the corresponding probabilities pi that w gets used ?in the i-th manor?.",
        "A word's usage is comprised of distributional information about its syntactic and semantic preferences, in the form of a ket |ui?.",
        "The density matrix ?w = ?i pi|ui?",
        "?ui |represents the ensemble Uw.",
        "This section explains our method of extracting lexical density matrices from a dependency-parsed corpus.",
        "Once density matrices have been learned, we can predict the expected usage similarity of two words as a simple function of their density matrices.",
        "Our explication will be formally precise, but at the same time illustrate each principle through a toy example."
      ]
    },
    {
      "heading": "3.1 Dependency Hilbert Space",
      "text": [
        "Our model learns the meaning of words from a dependency-parsed corpus.",
        "Our experiments have used the Stanford parser (de Marneffe and Manning, 2008), however any other dependency parser with broadly similar output could be used instead.",
        "A word's usage is learned from the type of dependency relations it has with its immediate neighbors in dependency graphs.",
        "Its semantic content is thus approximated by its ?neighborhood?, i.e., its co-occurrence frequency with neighboring words.",
        "Neighborhoods are defined by a vocabulary V = {w1, ...,wnV } of the nV most frequent (non-stop) words in the corpus.",
        "Let",
        "ted arcs are ignored because they are either not connected to the target words jaguar and elephant or because their relation is not taken into account in constructing the semantic space.",
        "Words are shown as lemmas.",
        "a subset of all dependency relations provided by the parser and their inverses.",
        "The choice of Rel is a model parameter.",
        "We considered only the most frequently occuring relations above a certain threshold, which turned out to be about half of the full inventory.",
        "Relation symbols with the superscript ??1?",
        "indicate the inversion of the dependency direction (dependent to head).",
        "All other relation symbols have the conventional direction (head to dependent).",
        "Hence, w xyz ?",
        "v is equivalent to v xyz?1 ?",
        "w. We then partition Rel into disjoint clusters of syntactically similar relations Part = {RC1, ...,RCnPart}.",
        "For example, we consider syntactically similar relations which connect target words with neighbors with the same part of speech.",
        "Each relation cluster RCk is assigned a Hilbert space Hk whose base kets {|w(k)j ?}",
        "j correspond to the words in V = {w j} j.",
        "Figure 1 shows the dependency parses for a toy corpus consisting of two documents and five sentences.",
        "To create a density matrix for the target words jaguar and elephant, let us assume that we",
        "will consider the following relation clusters:",
        "appos,num,poss, ...}."
      ]
    },
    {
      "heading": "3.2 Mapping from Dependency Graphs to Kets",
      "text": [
        "Next, we create kets which encode syntactic and semantic relations as follows.",
        "For each occurrence of the target word w in a dependency graph, we only consider the subtree made up of w and the immediate neighbors connected to it via a relation in Rel.",
        "In Figure 1, arcs from the dependency parse that we ignore are shown as dotted.",
        "Let the subtree of interest best = {(RC1,v1), ...,(RCnPart ,vnPart )}, that is, w is connected to vk via some relation in RCk, for k ?",
        "{1, ...,nPart}.",
        "For any relation cluster RCk that does not feature in the subtree, let RCk be paired with the abstract symbol w /0 in st.",
        "This symbol represents uncertainty about a potential RCk-neighbor.",
        "We convert all subtrees st in the corpus for the target word w into kets |?st?",
        "?",
        "H1?",
        "...?HnPart .",
        "These in turn make up the word's density matrix ?w.",
        "Before we do so, we assign each relation cluster RCk a complex value ?k = ei?k .",
        "The idea behind these values is to control for how much each subtree contributes to the overall density matrix.",
        "This becomes more apparent after we formulate our method of inducing usage kets and density matrices.",
        "where ?st = ?",
        "(RCk,v)?st,v 6=w /0 ?k.",
        "Every RCk paired with some neighbor v ?",
        "V induces a basic subket |v?k ?",
        "base(Hk), i.e., a base ket of the k-th subspace or subsystem.",
        "All other subkets |w /0?k =",
        "?",
        "12 |v?k are in a uniformly weighted superposition of all base kets.",
        "The factor |V |?"
      ]
    },
    {
      "heading": "2 ensures",
      "text": [
        "that ?w /0|w /0?",
        "= 1.",
        "The composed ket for the subtree st is again weighted by the complex-valued ?st .",
        "?st is the sum of complex values ?k = ei?k , each with absolute value 1.",
        "Therefore, its own absolute value depends highly on the relative orientation ?k among its summands: equal phases reinforce absolute value, but the more phases are opposed (i.e., their difference approaches pi), the more they cancel out the sum's absolute value.",
        "Only those ?k contribute to this sum whose relation cluster is not paired with w /0.",
        "The choice of the parameters ?k allows us to put more weight on some combinations",
        "the dependency subtrees st1,st2,st3.",
        "Element mi, j in row i and column j is mi, j|?sti??",
        "?st j |in Dirac notation.",
        "(a) All three subtrees are in the same document.",
        "Thus their kets contribute to diagonal and off-diagonal matrix elements.",
        "(b) Each subtree is in a separate document.",
        "Therefore their kets do not group, affecting only diagonal matrix elements.",
        "of dependency relations than others.",
        "relevant for elephant.",
        "The subscripts outside of the subkets correspond to those of the relation clusters RC1,RC2,RC3 chosen in Section 3.1.",
        "In sentence 2a, jaguar has two neighbors under RC2.",
        "Therefore the subket from H2 is a superposition of the base kets |nice?2 and |new?2.",
        "This is a more intuitive formulation of the equivalent approach which first splits the subtree for buy nice new jaguar into two similar subtrees for buy nice jaguar and for buy new jaguar, and then processes them as seperate subtrees within the same document."
      ]
    },
    {
      "heading": "3.3 Creating Lexical Density Matrices",
      "text": [
        "We assume that a word's usage is uniform throughout the same document.",
        "In our toy corpus in Figure 1, jaguar is always the direct object of the main verb.",
        "However, in Document 1 it is used in the animal sense, whereas in Document 2 it is used in the car sense.",
        "Even though the usage of jaguar in sentence (2b) is ambiguous, we group it with that of sentence (2a).",
        "These considerations can all be comfortably en",
        "coded in a density matrix.",
        "This is simply generated via the outer product of our subtree kets |?st?.",
        "For example, ?D1, jaguar = |?st1a??",
        "?st1a |represents the contribution that document D1 makes to ?",
        "jaguar.",
        "Document D2, however, has more than one ket relevant to ?",
        "jaguar.",
        "Due to our assumption of document-internal uniformity of word usage, we group D2's subtree-kets additively: ?D2, jaguar = (|?st2a?+ |?st2b?)(?",
        "?st2a |+?",
        "?st2b |).",
        "The target word's density matrix ?w is the normalized sum of all density matrices ?D,w obtained from each D:",
        "where STD,w is the set of all subtrees for target word w in document D. To illustrate the difference that this grouping makes, consider the density matrices in Figure 2.",
        "Whereas in (a) the subtrees st1,st2,st3 share a document, in (b) they are from distinct documents.",
        "This grouping causes them to not only contribute to diagonal matrix elements, e.g., |?st2??",
        "?st2 |, as in (b), but also to off diagonal ones, e.g., |?st2??",
        "?st1 |, as in (a).",
        "Over the course of many documents the summation of all contributions, no matter how small or large the groups are, causes ?clusters of weight?",
        "to form, which hopefully coincide with word usages.",
        "As mentioned in Section 3.2, adding complex-valued matrix elements increases or decreases the sum's absolute value depending on relative phase orientation.",
        "This makes it possible for interference to occur.",
        "Since the same word appears in varying contexts, the corresponding complex-valued outer products interact upon summation.",
        "Finally, the density matrix gets normalized, i.e., divided by its trace.",
        "This leaves the distributional information intact and merely normalizes the probabilities.",
        "Figure 3 illus"
      ]
    },
    {
      "heading": "3.4 Usage Similarity",
      "text": [
        "Decomposing the density matrix of the target word w, ?w =?i pi|ui?",
        "?ui |recovers the usage ensemble Uw = {(pi,ui)}i.",
        "However, in general there are infinitely many possible ensembles which ?w might represent.",
        "This subsection explains our metric for estimating the usage similarity of two words.",
        "The math involved shows that we can avoid the question of how to best decompose ?w.",
        "We compute the usage similarity of two words w and v by comparing each usage of w with each usage of v and weighting these similarity values with the corresponding usage probabilities.",
        "Let ?w =",
        "similarity of some usage kets |u(w)i ?",
        "and |u (v) j ?",
        "is obtained, as is common in the literature, by their inner product ?u(w)i |u (v) j ?.",
        "However, as this is a complex value, we multiply it with its complex conjugate, rendering the real value ?u(v)j |u",
        "2.",
        "Therefore, in total the expected similarity of w and v is:",
        "We see that the similarity function simply reduces to multiplying ?w with ?v and applying the trace function.",
        "The so-called cyclic property of the trace function (i.e., Tr(M1M2)= Tr(M2M1) for any two matrices M1,M2) gives us the corollary that this particular similarity function is symmetric.",
        "Figure 3 (bottom) shows how to calculate the similarity of jaguar and elephant.",
        "Only the coefficient of the first outer product survives the tracing process because its ket and bra are equal modulo transpose conjugate.",
        "As for the second outer product, 0.05eipi/4?b|?st1a??",
        "?st1c |b?",
        "is 0 for all base kets |b?."
      ]
    },
    {
      "heading": "3.5 What Does This Achieve?",
      "text": [
        "We represent word meanings as described above for several reasons.",
        "The density matrix decomposes into usages each of which are a superposition of combinations of dependents.",
        "Internally, these usages are established automatically by way of ?clustering?.",
        "Our model is parameterized with regard to the phases of subsystems (i.e., clusters of syntactic relations) which allows us to make optimal use of interference, as this plays a large role in the overall quality of representation.",
        "It is possible for a combination of (groups of) dependents to get entangled if they repeatedly appear together under the same word, and only in that combination.",
        "If the co-occurence of (groups of) dependents is uncorrelated, though, they remain unentangled.",
        "Quantum entanglement gives our semantic structures the potential for long-distance effects, once quantum measurement becomes involved.",
        "This is in analogy to the nonlocal correlation between properties of subatomic particles, such as the magnetic spin of electrons or the polarization of photons.",
        "Such an extension to our implementation will also uncover which sets of measurements are order-sensitive, i.e., incompatible.",
        "Our similarity metric allows two words to ?select?",
        "each other's usages via their pairwise inner products.",
        "Usage pairs with a high distributional similarity roughly ?align?",
        "and then get weighted by the probabilities of those usages.",
        "Two words are similar if they are substitutable, that is, if they can be used in the same syntactic environment and have the same meaning.",
        "Hopefully, this leads to more accurate estimation of distributional similarity and can be used to compute word meaning in context."
      ]
    },
    {
      "heading": "4 Experimental Setup",
      "text": [
        "Data All our experiments used a dependency parsed and lemmatized version of the British National Corpus (BNC).",
        "As mentioned in Section 3, we obtained dependencies from the output of the Stanford parser (de Marneffe and Manning, 2008).",
        "The BNC comprises 4,049 texts totalling approximately 100 million words.",
        "Evaluation Tasks We evaluated our model on word similarity and association.",
        "Both tasks are employed routinely to assess how well semantic models predict human judgments of word relatedness.",
        "We used the WordSim353 test collection (Finkelstein et al., 2002) which consists of similarity judgments for word pairs.",
        "Participants gave each pair a similarity rating using a 0 to 10 scale (e.g., tiger?cat are very similar, whereas delay?racism are not).",
        "The average rating for each pair represents an estimate of the perceived similarity of the two words.",
        "The collection contains ratings for 437 unique words (353 pairs) all of which appeared in our corpus.",
        "Word association is a slightly different task: Participants are given a cue word (e.g., rice) and asked to name an associate in response (e.g., Chinese, wedding, food, white).",
        "We used the norms collected by Nelson et al.",
        "(1998).",
        "We estimated the strength of association between a cue and its associate, as the relative frequency with which it was named.",
        "The norms contain 9,968 unique words (70,739 pairs) out of which 9,862 were found in our corpus, excluding multi-word expressions.",
        "For both tasks, we used correlation analysis to examine the degree of linear relationship between human ratings and model similarity values.",
        "We report correlation coefficients using Spearman's rank correlation coefficient.",
        "Quantum Model Parameters The quantum framework presented in Section 3 is quite flexible.",
        "Depending on the choice of dependency relations Rel, dependency clusters RC j, and complex",
        "values ?",
        "j = ei?",
        "j , different classes of models can be derived.",
        "To explore these parameters, we partitioned the WordSim353 dataset and Nelson et al's (1998) norms into a development and test set following a 70?30 split.",
        "We tested 9 different intuitively chosen relation partitions {RC1, ...,RCnPart}, creating models that considered only neighboring heads, models that considered only neighboring dependents, and models that considered both.",
        "For the latter two we experimented with partitions of one, two or three clusters.",
        "In addition to these more coarse grained clusters, for models that included both heads and dependents we explored a partition with twelve clusters broadly corresponding to objects, subjects, modifiers, auxiliaries, determiners and so on.",
        "In all cases stopwords were not taken into account in the construction of the semantic space.",
        "For each model variant we performed a grid search over the possible phases ?",
        "j = kpi with range k = 04 ,"
      ]
    },
    {
      "heading": "4 for the complex-valued ? j assigned",
      "text": [
        "to the respective relation cluster RC j (see Section 3.2 for details).",
        "In general, we observed that the choice of dependency relations and their clustering as well as the phases assigned to each cluster greatly influenced the semantic space.",
        "On both tasks, the best performing model had the relation partition described in Section 3.1.",
        "Section 5 reports our results on the test set using this model.",
        "Comparison Models We compared our quantum space against three classical distributional models.",
        "These include a simple semantic space, where a word's meaning is a vector of co-occurrences with neighboring words (Mitchell and Lapata, 2010), a syntax-aware space based on weighted distributional triples that encode typed co-occurrence relations among words (Baroni and Lenci, 2010) and word embeddings computed with a neural language model (Bengio, 2001; Collobert and Weston, 2008) For all three models we used parameters that have been reported in the literature as optimal.",
        "Specifically, for the simple co-occurrence-based space we follow the settings of Mitchell and Lapata (2010): a context window of five words on either side of the target word and 2,000 vector dimensions (i.e., the 2000 most common context words in the BNC).",
        "Vector components were set to the ratio of the probability of the context word given the target word to the probability of the context word overall.",
        "For the neural language model, we adopted the best",
        "Sim353 dataset and Nelson et al's (1998) norms (test set).",
        "Correlation coefficients are all statistically significant (p < 0.01).",
        "performing parameters from our earlier comparison of different vector sources for distributional semantics (Blacoe and Lapata, 2012) where we also used the BNC for training.",
        "There we obtained best results with 50 dimensions, a context window of size 4, and an embedding learning rate of 10?9.",
        "Our third comparison model uses Baroni and Lenci's (2010) third-order tensor2 which they obtained from a very large dependency-parsed corpus containing approximately 2.3 billion words.",
        "Their tensor assigns a mutual information score to instances of word pairs w,v and a linking word l. We obtained vectors ?",
        "?w from the tensor following the methodology proposed in Blacoe and Lapata (2012) using 100 (l,v) contexts as dimensions."
      ]
    },
    {
      "heading": "5 Results",
      "text": [
        "Our results are summarized in Table 1.",
        "As can be seen, the quantum model (QM) obtains performance superior to other better-known models such as Mitchell and Lapata's (2010) simple semantic space (SDS), Baroni and Lenci's (2010) distributional memory tensor (DM), and Collobert and Weston's (2008) neural language model (NLM).",
        "Our results on the association norms are comparable to the state of the art (Silberer and Lapata, 2012; Griffiths et al., 2007).",
        "With regard to WordSim353, Huang et al. (2012) report correlations in the range of 0.713?0.769, however they use Wikipedia as a training corpus and a more sophisticated version of the NLM presented here, that takes into account global context and performs word sense discrimination.",
        "In the future, we also plan to evaluate our model on larger Wikipedia-scale corpora.",
        "We would also like to model semantic composition as our approach can do this easily by taking advantage of the notion of quantum measurement.",
        "Specifically, we",
        "Models bar order SDS pub, snack, restaurant, grill, coctail form, direct, procedure, plan, request DM counter, rack, strip, pipe, code court, demand, form, law, list NLM room, pole, drink, rail, coctail direct, command, plan, court, demand QM prison, liquor, beer, club, graph organization, food, law, structure, regulation HS drink, beer, stool, alcohol, grill food, form, law, heat, court Table 2: Associates for bar and order ranked according to similarity.",
        "Underlined associates overlap with the human responses (HS).",
        "can work out the meaning of a dependency tree by measuring the meaning of its heads in the context of their dependents.",
        "Table 2 shows the five most similar associates (ordered from high to low) for the cues bar and order for the quantum model and the comparison models.",
        "We also show the human responses (HS) according to Nelson et al's (1998) norms.",
        "The associates generated by the quantum model correspond to several different meanings correlated with the target.",
        "For example, prison refers to the ?behind bars?",
        "sense of bar, liquor and beer refer to what is consumed or served in bars, club refers to the entertainment function of bars, whereas graph refers to how data is displayed in a chart."
      ]
    },
    {
      "heading": "6 Related Work",
      "text": [
        "Within cognitive science the formal apparatus of quantum theory has been used to formulate models of cognition that are superior to those based on traditional probability theory.",
        "For example, conjunction fallacies3 (Tversky and Kahneman, 1983) have been explained by making reference to quantum theory's context dependence of the probability assessment.",
        "Violations of the sure-thing principle4 (Tversky and Shafir, 1992) have been modeled in terms of a quantum interference effect.",
        "And the asymmetry of similarity relations has been explained by postulating that different concepts correspond to subspaces of different dimensionality (Pothos and Busemeyer, 2012).",
        "Several approaches have drawn on",
        "to conform to the law of total probability quantum theory in order to model semantic phenomena such as concept combination (Bruza and Cole, 2005), the emergence of new concepts (Aerts and Gabora, 2005), and the human mental lexicon (Bruza et al., 2009).",
        "Chen (2002) captures syllogisms in a quantum theoretic framework; the model takes statements like All whales are mammals and all mammals are animals as input and outputs conclusions like All whales are animals.",
        "The first attempts to connect the mathematical basis of semantic space models with quantum theory are due to Aerts and Czachor (2004) and Bruza and Cole (2005).",
        "They respectively demonstrate that Latent Semantic Analysis (Landauer and Dumais, 1997) and the Hyperspace Analog to Language model (Lund and Burgess, 1996) are essentially Hilbert space formalisms, without, however, providing concrete ways of building these models beyond a few hand-picked examples.",
        "Interestingly, Bruza and Cole (2005) show how lexical operators may be contrived from corpus co-occurrence counts, albeit admitting to the fact that their operators do not provide sensical eigenkets, most likely because of the simplified method of populating the matrix from corpus statistics.",
        "Grefenstette et al. (2011) present a model for capturing semantic composition in a quantum theoretical context, although it appears to be reducible to the classical probabilistic paradigm.",
        "It does not make use of the unique aspects of quantum theory (e.g., entanglement, interference, or quantum collapse).",
        "Our own work follows Aerts and Czachor (2004) and Bruza and Cole (2005) in formulating a model that exhibits important aspects of quantum theory.",
        "Contrary to them, we present a fully-fledged semantic space rather than a proof-of-concept.",
        "We obtain quantum states (i.e., lexical representations) for each word by taking its syntactic context into account.",
        "Quantum states are expressed as density operators rather than kets.",
        "While a ket can only capture one pure state of a system, a density operator contains an ensemble of pure states which we argue is advantageous from a modeling perspective.",
        "Within this framework, not only can we compute the meaning of individual words but also phrases or sentences, without postulating any additional operations.",
        "Compositional meaning reduces to quantum measurement at each inner node of the (dependency) parse of the structure in question."
      ]
    }
  ]
}
