{
  "info": {
    "authors": [
      "Roberto Navigli"
    ],
    "book": "Conference of the European Association for Computational Linguistics – Demonstrations",
    "id": "acl-E06-2006",
    "title": "Online Word Sense Disambiguation With Structural Semantic Interconnections",
    "url": "https://aclweb.org/anthology/E06-2006",
    "year": 2006
  },
  "references": [
    "acl-E06-1017",
    "acl-J04-2002",
    "acl-J91-1002",
    "acl-W04-0811",
    "acl-W04-0827",
    "acl-W04-0838",
    "acl-W04-0861"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper we present an online implementation of a knowledge-based Word Sense Disambiguation algorithm called Structural Semantic Interconnections (SSI).",
        "We describe the system implementation and the user interface, and discuss the strengths and weaknesses of our approach."
      ]
    },
    {
      "heading": "1 Introduction Word Sense Disambiguation (WSD) is the task of formalizing the intended meaning of a word in context by selecting an appropriate sense from a computational lexicon in an automatic manner.",
      "text": [
        "The availability on the web of WSD algorithms can certainly contribute to tasks like the semantic indexing of online summaries, short news, web page titles, as well as other online applications.",
        "Unfortunately, most of the WSD algorithms are not available online, or they are only available for download, requiring some training before the user can employ them.",
        "An important effort in this direction has been carried out with the release of the WordNet::Similarity package (Pedersen et al., 2004), which is also available online through a web interface.",
        "The package provides a variety of relatedness measures to determine the similarity between word pairs.",
        "Based on it, Patwardhan et al.",
        "(2005) provide a Word Sense Disambiguation package, called SenseRelate.",
        "The package is not available through a graphical interface, but the authors plan to develop it.",
        "Among the state-of-the-art WSD disambiguation systems, i.e. the best performing algorithms at the Senseval-3 disambiguation competition, Gambl (Decadt et al., 2004), a memorybased algorithm, is available online , while Sense-Learner (Mihalcea and Faruque, 2004), the second best-performing system, can be downloaded and run offline.",
        "However, due to their trained nature, the application of these systems to open-domain sentences is not guaranteed to have the same performances as those obtained during the Senseval disambiguation exercises.",
        "In this paper, we present the online implementation of Structural Semantic Interconnections (SSI), a state-of-the-art, knowledge-based WSD algorithm.",
        "Thanks to its untrained nature, SSI obviates the problems affecting the best-performing supervised systems.",
        "First, we introduce the algorithm (Section 2).",
        "Then, we describe its architecture and implementation details (Section 3), as well as its user interface (Section 4).",
        "Finally, we discuss the performances of SSI (Section 5), and conclude (Section 6)."
      ]
    },
    {
      "heading": "2 Structural Semantic Interconnections",
      "text": [
        "The Structural Semantic Interconnections algorithm (SSI) is a WSD algorithm based on structural pattern recognition (Navigli and Velardi, 2004; Navigli and Velardi, 2005).",
        "Given a word context a = w\\, W2, ■ ■ ■, wnand a lexical knowledge base, obtained by integrating WordNet (Fellbaum, 1998) with other resources, SSI selects that configuration of senses swi, sW2, • • •, sWn that maximizes the degree of mutual interconnection according to a measure of connectivity, that is, for each w £ a:",
        "(part-of-speech jump) 5*1 y ^kind – of ^ll^part – of Sl\\ekind – of Impart – of (hyperonymy/meronymy) (hypernymy/relatedness) S3 y 6 similarity S3 \\ G-antonymySz \\& similarity \\&antonyrny (adjectives) For example, given the word context [ bottle-n, champagne-n ], the senses chosen by SSI with respect to WordNet are: [ bottle-n#l, champagne-n#l ], supported - among the others - by the sparkling wine-n#l has – kind > champagne-n#l.",
        "The outcome of the SSI algorithm is therefore not only a set of sense choices, but also a semantic graph encoding the interconnections that structurally justify those choices.",
        "An excerpt of the manually written context-free grammar encoding valid semantic interconnection patterns for the WordNet lexicon is reported in Table l. For further details the reader can refer to the literature (Navigli and Velardi, 2005)."
      ]
    },
    {
      "heading": "3 Implementation of Online SSI",
      "text": [
        "Two basic features made it possible to put online a fully-engineered version of the SSI algorithm: the construction of a large, optimized lexical knowledge base, and the implementation of the connectivity measure / in terms of the outcome of HITS (Kleinberg, 1998), a well-known page ranking algorithm.",
        "First, we enriched the WordNet lexicon with a number of relatedness relations, connecting pairs of related word senses.",
        "The enrichment is based on the acquisition of collocations from existing resources (like the Oxford Collocations, the Longman Language Activator, collocation web sites, etc.).",
        "Each collocation is mapped to the Word-Net sense inventory in a semi-automatic manner (Navigli, 2005) and transformed into a relatedness edge.",
        "For each word sense s in the WordNet inventory, semantic interconnection patterns are exhaustively retrieved by exploring the lexicon, according to the predefined context-free grammar of valid patterns mentioned in Section 2.",
        "The resulting lexical knowledge base, stored as an optimized database, associates with each pair of word senses (s, s') the set of valid interconnection patterns between s and s'.",
        "Each pattern is assigned a weight based on its length (i.e. the contribution of a single interconnection s iength(s^>-*s')^' Given a configuration of n word senses, the associated semantic graph is therefore obtained in terms of queries, one for each possible pair combination.",
        "Each query takes 0(log(n)) time, assuming the database is implemented as a B-tree.",
        "Previous implementations of the SSI algorithm (exhaustive and iterative) were not sufficiently fast to be accessible through a web interface, so we decided to reimplement the connectivity function / in terms of the HITS algorithm.",
        "HITS (Kleinberg, 1998) is a page ranking algorithm that calculates for each graph node v the degree of connectivity conveyed towards v (authority degree) and from v to the other nodes in the graph (hub degree).",
        "at least one semantic interconnection between the senses s and s'.",
        "A weighted adjacency matrix L is associated with G such that LSySi is the sum of the weights of the interconnection patterns between s and s'.",
        "HITS is then applied to L to obtain the authority vector a.",
        "This vector provides a degree of relevance for each node in V, that we call \"confidence factor\".",
        "For each word w G a, SSI selects arg max as as the most appropriate sense of w sESenses(w) in context a, that is the sense s of w with the highest degree of confidence.",
        "If the confidence factor is below a fixed threshold, SSI does not choose any sense for w."
      ]
    },
    {
      "heading": "4 The SSI Interface",
      "text": [
        "The system interface consists of three pages: Query page: In the first page, the user can type either a bag of words or a full sentence and apply the SSI algorithm by clicking on the Disambiguate button.",
        "Part-of-speech specification: If there are words in the original query belonging to more than one part of speech, the user is asked to specify the appropriate part of speech for those words.",
        "Automated part-of-speech tagging is not performed in that the user is free to type a bag of words, rather than a fully grammatical sentence.",
        "Result page: The outcome of the SSI algorithm is visualized.",
        "For each word w, this page shows the sense number possibly assigned to w, its Word-Net definition and the degree of confidence for that sense choice.",
        "The page also shows a semantic graph encoding the semantic interconnections providing a justification of the sense choices.",
        "The three steps are summarized in Figure 2.",
        "As interesting feature of the algorithm, compared with the other systems, is the visualization of the semantic graph encoding the interconnection patterns between the chosen senses.",
        "The user can click on a word sense and highlight the patterns connecting that sense to the other senses selected by the algorithm.",
        "In case the graph is too large, an automated, iterative pruning is applied until the overall number of vertices and patterns does not fall below a certain threshold.",
        "A screenshot of the result page is shown in Figure 3."
      ]
    },
    {
      "heading": "5 Evaluation",
      "text": [
        "The SSI algorithm has been extensively evaluated in several tasks, including open-text Word Sense Disambiguation, gloss disambiguation, ontology learning, relation learning, etc.",
        "Here we do not aim at reporting all these results (the interested reader can refer to Navigli and Velardi (2005)), instead we focus on the English all-words Word Sense Disambiguation tasks at Senseval-3 (Snyder and Palmer, 2004).",
        "The performances are reported in Table 2.",
        "SSI performs better than the best unsupervised system, developed at IRST (Villarejo et al., 2004), and is some points below the two best-ranked supervised systems (Gambl and SenseLearner).",
        "The untrained nature of SSI is indeed one of its major strengths, allowing it to be applied to any word context irrespective of its specificity, unlike most of the state-of-the-art trained algorithms.",
        "The implementation of SSI in terms of a page ranking algorithm (SSI-HITS in the Table) only slightly affects the performances compared to our",
        "previous experiments with exhaustive and iterative implementations (Navigli and Velardi, 2005).",
        "On the other side, the speed up is impressive (from several minutes to one or two seconds per context).",
        "Thanks to its knowledge-based nature, SSI produces a semantic graph as a justification for the sense choices assigned to a word context.",
        "An interesting application of this feature is in the validation of sense annotations, where validators need evidences for adjudicating a sense choice when annotators disagree (Navigli, 2006).",
        "A weakness of our approach is in its dependency on the availability of general-purpose knowledge.",
        "If the SSI lexical knowledge base encodes poor knowledge for certain words, the algorithm is not able to find interconnections enabling the selection of the appropriate word senses.",
        "Moreover, as SSI treats a sentence as a bag of word, the complexity of a sentence affects the performance of the algorithm.",
        "In fact, a large, complex sentence is likely to perform worse than the average, due to the fact that many interconnections can be found between syntactically unrelated words."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "We have presented the online implementation of SSI, a knowledge-based Word Sense Disambiguation algorithm.",
        "We described two important features that allow the algorithm to be available online: its large, optimized lexical knowledge base and its fast implementation with the HITS ranking algorithm.",
        "We reported the performances of the SSI algorithm on the Senseval-3 all-words task and discussed the major strengths and weaknesses of our approach.",
        "In the near future, we plan to take syntax into account in order to overcome the bag-of-words effect on open-text disambiguation."
      ]
    }
  ]
}
