{
  "info": {
    "authors": [
      "Joshua K. Hartshorne",
      "Claire Bonial",
      "Martha Palmer"
    ],
    "book": "EMNLP",
    "id": "acl-D13-1149",
    "title": "The VerbCorner Project: Toward an Empirically-Based Semantic Decomposition of Verbs",
    "url": "https://aclweb.org/anthology/D13-1149",
    "year": 2013
  },
  "references": [
    "acl-D09-1001",
    "acl-L08-1037",
    "acl-W04-3205",
    "acl-W04-3213",
    "acl-W13-2323"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This research describes efforts to use crowd-sourcing to improve the validity of the semantic predicates in VerbNet, a lexicon of about 6300 English verbs.",
        "The current semantic predicates can be thought of semantic primitives, into which the concepts denoted by a verb can be decomposed.",
        "For example, the verb spray (of the Spray class), involves the predicates MOTION, NOT, and LOCATION, where the event can be decomposed into an AGENT causing a THEME that was originally not in a particular location to now be in that location.",
        "Although VerbNet's predicates are theoretically well-motivated, systematic empirical data is scarce.",
        "This paper describes a recently-launched attempt to address this issue with a series of human judgment tasks, posed to subjects in the form of games."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "One key application of Natural Language Processing (NLP) is meaning extraction.",
        "Of particular importance is propositional meaning: To understand ?Jessica sprayed paint on the wall,?",
        "it is not enough to know who Jessica is, what paint is, and where the wall is, but that, by the end of the event, some quantity of paint that was not previously on the wall now is.",
        "One must extract not only meanings for individual words but also the relations between them.",
        "One option is to learn these relations in a largely bottom-up, data-driven fashion (Chklovski and Pan-tel, 2004; Poon and Domingos, 2009).",
        "For instance, Poon and Domingos (2009) first extracts dependency trees, converts those into quasi-logical form, recursively induces lambda expressions from them, and uses clustering to derive progressively abstract knowledge.",
        "An alternative is to take a human-inspired approach, mapping the linguistic input onto the kinds of representations that linguistic and psychological research suggests are the representations employed by humans.",
        "While the exact characterization of meaning (and by extension, thought) remains an area of active research in the cognitive sciences (Margolis and Laurence, 1999), decades of research in linguistics and psychology suggests that much of the meaning of a sentence ?",
        "as well as its syntactic structure ?",
        "can be accounted for by invoking a small number of highly abstract semantic features (usually represented as predicates), such as causation, agency, basic topological relations, and directed motion (Ambridge et al., 2013; Croft, 2012; Jackendoff, 1990; Levin and Rappaport Hovav, 2005; Pesetsky, 1995; Pinker, 1989).",
        "For instance, a given verb can appear in some syntactic frames (Sally broke the vase.",
        "Sally broke the vase with the hammer.",
        "The vase broke.)",
        "and not others (*Sally broke the vase to the floor.",
        "*Sally broke John the vase.).",
        "When verbs are classified according to the syntactic frames they can appear in, most if not all the verbs in a class involve the same set of abstract semantic features.1 Interestingly, roughly these same features (causation, etc.)",
        "have been singled out by developmental psychologists as part of ?core knowledge?",
        "?",
        "a set of early-learned or perhaps innate concepts upon which",
        "the rest of cognition is built (Spelke and Kinzler, 2007).",
        "Thus these semantic features/predicates may be not only crucial to describing linguistic meaning but may be central organizing principles for a human's (reasonably successful) thinking about and conceptualization of the world.",
        "As such, they provide a potentially rewarding target for NLP."
      ]
    },
    {
      "heading": "2 VerbNet",
      "text": []
    },
    {
      "heading": "2.1 Overview and Structure",
      "text": [
        "Perhaps the most comprehensive implementation of this approach appears in VerbNet (Kipper et al., 2008; based on Levin, 1993).",
        "VerbNet classifies verbs based on the syntactic frames they can appear in, providing a semantic description of each frame for each class.",
        "An example entry is shown below:"
      ]
    },
    {
      "heading": "CAUSE(AGENT, E)",
      "text": [
        "The ?Syntactic Frame?",
        "provides a flat syntactic parse.",
        "?Syntax?",
        "provides semantic role labels for each of the NPs and PPs, which are invoked in ?Semantics?.",
        "VerbNet decomposes the semantics of this sentence into four separate predicates: 1) the THEME (the paint) moves doing the event E; 2) at the start of the event E, the THEME (the paint) is not at the DESTINATION (on the wall), whereas 3) at the end of the event E, the THEME (the paint) is at the DESTINATION (on the wall), and; 4) the event is caused by the AGENT (Sally).",
        "Note that this captures only the core aspects of semantics shared by all verbs in the class; differences between verbs in the same class (e.g., spray vs. splash) are omitted.",
        "Importantly, the semantics of the sentence is dependent on both the matrix verb (paint) and the syntactic frame.",
        "Famously, when inserted in the slightly different frame NP V NP.DESTINATION PP.THEME ?",
        "?Sally sprayed the wall with paint?",
        "?",
        "?spray?",
        "entails that destination (the wall) is now fully painted, an entailment that does not follow in the example above (Pinker, 1989)."
      ]
    },
    {
      "heading": "2.2 Uses and Limitations",
      "text": [
        "VerbNet has been used in a variety of NLP applications, such as semantic role labeling (Swier and Stevenson, 2004), inferencing (Zaenen et al., 2008), verb classification (Joanis et al., 2008), and information extraction (Maynard, Funk, and Peters, 2009).",
        "While such applications have been successful thus far, an important constraint on how well VerbNet-based NLP applications can be expected to perform is the accuracy of the semantics encoded in VerbNet.",
        "Here, several issues arise.",
        "Leaving aside miscategorized verbs and other inaccuracies, as noted above VerbNet assumes that all verbs in the same class share the same core predicates, which may or may not be empirically justified.",
        "Given the number of semantic predicates (146),2 verb entries (6580), and unique verb lemmas (6284) it is not feasible for a single research team to check, particularly since after a certain number of verbs, intuitions become less clear.",
        "In any case, it may not be ideal to rely solely on the intuitions of invested researchers, whose intuitions about subtle judgments may be clouded by theoretical commitments (Gibson and Federenko, 2013); the only way to ensure this is not the case is through independent validation.",
        "Unfortunately, of the 280 verb classes in VerbNet, this has been done for only a few (cf Ambridge et al., 2013)."
      ]
    },
    {
      "heading": "3 VerbCorner",
      "text": [
        "The VerbCorner project was designed to address these issues by crowd-sourcing the semantic judg-ments online (gameswithwords.org/VerbCorner/).",
        "Several previous projects have successfully crowd-sourced linguistic annotations, such as Phrase Detectives, where volunteers have contributed 2.5 million judgments on anaphoric relations (Poesio et al., 2012).",
        "Below, we outline the VerbCorner project and describe one specific annotation task in detail."
      ]
    },
    {
      "heading": "3.1 Developing Semantic Annotation Tasks",
      "text": [
        "Collecting accurate judgments on subtle questions from naive participants with limited metalinguistic 2Note that these vary in applicability from those specific to a small number of verbs (CHARACTERIZE, CONSPIRE) to those frequently invoked (BEGIN, EXIST).",
        "skills is difficult.",
        "Rare is the non-linguist who can immediately answer the question, ?Does the verb ?throw,?",
        "when used transitively, entail a change of location on the part of its THEME??",
        "Thus, we began by developing tasks that isolate semantic features in a way accessible to untrained annotators.",
        "We converted the metalinguistic judgments (?Does this verb entail this abstract predicate??)",
        "into real-world problems, which previous research suggests should be easier (Cosmides and Tooby, 1992).",
        "Each judgment tasks involved a fanciful backstory.",
        "For instance, in ?Simon Says Freeze?, a task designed to elicit judgments about movement, the Galactic Overlord (Simon) decrees ?Galactic Stay Where You Are Day,?",
        "during which nobody is allowed to move from their current location.",
        "Participants read descriptions of events and decide whether anyone violated the rule.",
        "In ?Explode on Contact?, designed to elicit judgments about physical contact, objects and people explode when they touch one another.",
        "The participant reads descriptions of events and decides whether anything has exploded.3 Each task was piloted until inter-coder reliability was acceptably high and the modal response nearly always corresponded with researcher intuitions.",
        "As such, these tasks cannot be used to establish whether researcher intuitions for the pilot stimuli are correct (this would be circular); however, there is no guarantee that agreement with the researcher will generalize to new items (the pilot stimuli cover a trivial proportion of all verbs in VerbNet)."
      ]
    },
    {
      "heading": "3.2 Crowd-sourcing Semantic Judgments",
      "text": [
        "The pilot experiments showed that it is possible to elicit reliable semantic judgments corresponding to VerbNet predicates from naive participants (see section 3.3).",
        "At the project website, volunteers choose one of the tasks from a list and begin tagging sentences.",
        "The sentences are sampled smartly, avoiding sentences already tagged by that volunteer and biased in favor of of the sentences with the fewest 3Note that each task is designed to elicit judgments about entailments ?",
        "things that must be true rather than are merely likely to be true.",
        "If John greeted Bill, they might have come into contact (e.g., by shaking hands), but perhaps they did not.",
        "Previous work suggests that it is entailments that matter, particularly for explaining the syntactic behavior of verbs (Levin and Rappaport Hovav, 2005) judgments so far.",
        "Rather than assessing annotator quality through gold standard trials with known answers (which wastes data ?",
        "the answers to these trials are known), approximately 150 sentences were chosen to be ?over-sampled.?",
        "As the volunteer tags sentences, approximately one out of every five are from this oversampled set until that volunteer has tagged all of them.",
        "This guarantees that any given volunteer will have tried some sentences targeted by many other volunteers, allowing inter-annotator agreement to be used to assess annotator quality.",
        "Following the example of Zooniverse (zooni-verse.org), a popular ?Citizen Science?",
        "platform, volunteers are encouraged but required to register (requiring registration prior to seeing the tasks was found to be a significant barrier to entry).",
        "Registration allows collecting linguistic and educational background from the volunteer, and also makes it possible to track the same volunteer across sessions.",
        "Multiple gamification elements were incorporated into VerbCorner in order to recruit and motivate volunteers.",
        "Each task has a leaderboard, where the volunteer can see his/her rank out of all volunteers in terms of number of contributions made.",
        "In addition, there is a general leaderboard, which sums across tasks.",
        "Volunteers can earn badges, displayed on their homepage, for answering certain numbers of questions in each task.",
        "Finally, at random intervals bonus points are awarded, with the explanation for the bonus points tailored to the task's backstory.",
        "VerbCorner was launched on May 21, 2013.",
        "After six weeks, 555 volunteers had provided at least one annotation, for a total of 39,274 annotations, demonstrating the feasibility of collecting large numbers of annotations through this method."
      ]
    },
    {
      "heading": "3.3 Case Study: Equilibrium",
      "text": [
        "?Equilibrium?",
        "was designed to elicit judgments about application of force, frequently argued to be a core semantic feature in the sense discussed above (Pinker, 1989).",
        "The backstory involves the ?Zen Dimension,?",
        "in which nobody is allowed to exert force on anything else.",
        "The participant reads descriptions of events (Sally sprayed paint onto the wall) and decides whether they would be allowable in the Zen Dimension ?",
        "and, in particular, which participants in the event are illegally applying force.",
        "In order to minimize unwanted effects of world",
        "knowledge, the verb's arguments are replaced with nonsense words or randomly chosen proper names (Sally sprayed the dax onto the blicket).",
        "In the context of the story, this is explained as necessary anonymization: You are a government official determining whether certain activities are allowable, and ensuring anonymity is an important safeguard against favoritism and corruption.",
        "An alternative wouod be to use multiple different content words, randomly chosen for each annotator.",
        "However, this greatly increases the number of annotators needed and quickly becomes infeasible.",
        "The task was piloted on 138 sentences, which comprised all possible syntactic frames for three verbs from each of five verb classes in VerbNet.",
        "After two rounds of piloting (between the first and second, wording in the backstory was adjusted for clarity based on pilot subject feedback and results), Kripp's alpha reached .76 for 8 annotators, which represents a reasonably high level of inter-annotator agreement.",
        "Importantly, the modal response matched the intuitions of the researchers in 137 of 138 cases.4"
      ]
    },
    {
      "heading": "3.3.2 Preliminary VerbCorner Results",
      "text": [
        "?Equillibrium?",
        "was one of the first tasks posted on VerbCorner, with data currently being collected on 12 of the 280 VerbNet classes, for a total of 5,171 sentences.",
        "As of writing, 414 users have submitted 14,294 judgments.",
        "Individual annotators annotated anywhere from 1 to 195 sentences (mean=8, median=4).",
        "While most sentences have relatively few judgments, each of the 194 oversampled sentences has between 15 and 20 judgments.5 Comparing the modal response with the researchers?",
        "intuitions resulted in a match for 184 of 194 sentences.",
        "In general, where the modal response 4The remaining case was ?The crose smashed sondily.?",
        "for which four pilot subjects thought involved the crose applying force ?",
        "matching researcher intuition ?",
        "and four thought did not involve any application of force, perhaps interpreting the sentence was a passive.",
        "5These are the same 15 verbs used in the piloting.",
        "The number of sentences is larger in order to test a wider range of possible arguments.",
        "In particular, wherever appropriate, separate sentences were constructed using animate and inanimate arguments.",
        "Compare Sally sprayed the dax onto Mary and Sally sprayed the dax onto the blicket.",
        "did not match researcher intuitions, the modal response was itself not popular, comprising an average of 53% of responses, compared with an average of 77% where the modal response matched researcher intuitions.",
        "Thus, these appear to be cases of disagreement, either because the correct intuition requires more work to obtain or because of differences across idiolects (at the moment, there is no obvious pattern as to which sentences caused difficulty, but the sample size is small).",
        "Thus, follow-up investigation of sentences with little inter-coder agreement may be warranted."
      ]
    },
    {
      "heading": "4 Conclusion and Future Work",
      "text": [
        "Data-collection is ongoing.",
        "VerbNet identifies approximately 150 different semantic predicates.",
        "Annotating every verb in each of its syntactic frames for each semantic predicate would take many millions of judgments.",
        "However, most of the semantic predicates employed in VerbNet are very narrow in scope and only apply to a few classes.",
        "Thus, we have begun with broad predicates that are thought to apply to many verbs and are adding progressively narrower predicates as work progresses.",
        "At the current rate, we should complete annotation for the half-dozen most frequent semantic predicates in the space of a year.",
        "Future work will explore using an individual annotator's history across trials to weight that user's contributions, something that VerbCorner was specifically designed to allow (see above).",
        "How to assess annotator quality without gold standard data is an active area of research (Passonneau and Carpenter, 2013; Rzhetsky, Shatkay and Wilbur, 2009; Whitehill et al., 2009).",
        "For instance, Whitehill and colleagues (2009) provide an algorithm for jointly estimating both annotator quality and annotation difficulty (including the latter is important because some annotators will have low agreement with others due to their poor luck in being assigned difficult-to-annotate sentences).",
        "This algorithm is shown to outperform using the modal response.",
        "Note that this necessarily biases against annotators with few responses.",
        "In our case study above, excluding annotators who contributed small numbers of annotations led to progressively worse match to researcher intuition, suggesting that the loss in data",
        "caused by excluding these annotations may not be worth the increased confidence in annotation quality.",
        "Future research will be needed to assess this trade-off.",
        "The above work shows the feasibility of crowd-sourcing VerbNet semantic entailments, as has been shown for a handful of other linguistic judgments (Artignan, Hascoet and Lafourcade, 2009; Poesio et al., 2012; Venhuizen et al., 2013).",
        "There are many domains in which gold standard human judgments are scarce; crowd-sourcing has considerable potential at addressing this need."
      ]
    }
  ]
}
