{
  "info": {
    "authors": [
      "Jin-Dong Kim",
      "Yue Wang",
      "Yamamoto Yasunori"
    ],
    "book": "BioNLP",
    "id": "acl-W13-2002",
    "title": "The Genia Event Extraction Shared Task, 2013 Edition - Overview",
    "url": "https://aclweb.org/anthology/W13-2002",
    "year": 2013
  },
  "references": [
    "acl-P11-1163",
    "acl-W09-1401",
    "acl-W11-0204",
    "acl-W11-1801",
    "acl-W11-1802",
    "acl-W11-1803",
    "acl-W11-1828"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The Genia Event Extraction task is organized for the third time, in BioNLP Shared Task 2013.",
        "Toward knowledge based construction, the task is modified in a number of points.",
        "As the final results, it received 12 submissions, among which 2 were withdrawn from the final report.",
        "This paper presents the task setting, data sets, and the final results with discussion for possible future directions."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Among various resources of life science, literature is regarded as one of the most important types of knowledge base.",
        "Nevertheless, lack of explicit structure in natural language texts prevents computer systems from accessing fine-grained information written in literature.",
        "BioNLP Shared Task (ST) series (Kim et al., 2009; Kim et al., 2011a) is one of the community-wide efforts to address the problem.",
        "Since its initial organization in 2009, BioNLP-ST series has published a number of fine-grained information extraction (IE) tasks motivated for bioinformatics projects.",
        "Having solicited wide participation from the community of natural language processing, machine learning, and bioin-formatics, it has contributed to the production of rich resources for fine-grained BioIE, e.g., TEES1 (Bjo?rne and Salakoski, 2011), SBEP2 (McClosky et al., 2011) and EVEX3 (Van Landeghem et al., 2011).",
        "The Genia Event Extraction (GE) task is a seminal task of BioNLP-ST.",
        "It was first organized as the sole task of the initial 2009 edition of BioNLP-ST.",
        "The task was originally designed and implemented based on the Genia event corpus (Kim et",
        "al., 2008b) which represented domain knowledge around NF?B proteins.",
        "There were also some efforts to explore the possibility of literature mining for pathway construction (Kim et al., 2008a; Oda et al., 2008).",
        "The GE task was designed to make such an effort a community-driven one by sharing available resources, e.g., benchmark data sets, and evaluation tools, with the community.",
        "In its second edition (Kim et al., 2011b) organized in BioNLP-ST 2011 (Kim et al., 2011a), the data sets were extended to include full text articles.",
        "The data sets consisted of two collections.",
        "The abstract collection, that had come from the first edition, was used again to measure the progress of the community between 2009 and 2011 editions, and the full text collection, that was newly created, was used to measure the generalization of the technology to full text papers.",
        "In its third edition this year, while succeeding the fundamental characteristics from its previous editions, the GE task tries to evolve with the goal to make it a more ?real?",
        "task toward knowledge base construction.",
        "The first design choice to address the goal is to construct the data sets fully with recent full papers, so that the extracted pieces of information can represent up-to-date knowledge of the domain.",
        "The abstract collection, that had been already used twice (in 2009 and 2011), is removed from official evaluation this time4.",
        "Second, GE task subsumes the coreference task which has long been considered critical for improvement of event extraction performance.",
        "It is implemented by providing coreference annotation in integration with event annotation in the data sets.",
        "The paper explains the task setting and data sets, presents the final results of participating systems, and discusses notable observations with conclusions.",
        "4However, if necessary, the online evaluation for the previous editions of GE task may be used, which is available at http://bionlp-st.dbcls.jp/GE/.",
        "is specified in parenthesis.",
        "Arguments that may be filled more than once per event are marked with ?+?, and optional arguments are with ??",
        "?."
      ]
    },
    {
      "heading": "2 Task setting",
      "text": [
        "This section explains the task setting of the 2013 edition of the GE task with a focus on changes to previous editions.",
        "For comprehensive explanation, readers are referred to Kim et al. (2009).",
        "The changes made to the task setting are three-folds, among which two are about event types to be extracted.",
        "Table 1 shows the event types and their arguments targeted in the 2013 edition.",
        "First, four new event types are added to the target of extraction; the Protein modification type and its three sub-types, Ubiquitination, Acetylation, Deacetylation.",
        "Second, The Protein modification types are modified to be directly linked to causal entities, which was only possible through Regulation events in previous editions.",
        "The modifications were made based on analysis on preliminary annotation during preparation of the data sets: in recent papers on NF?B, discussions on protein modification were observed with non-trivial frequency.",
        "However, in the end, it turned out that the influence of the above modifications was trivial in terms of the number of annotated instances in the final data sets, as shown in section 3, after filtering out events on non-individual proteins, e.g., protein families, protein complexes.",
        "Third change made to the task setting is addition of coreference and part-of annotations to the data sets.",
        "It is to address the observation from 2009 edition that coreference structures and entity relations often hide the syntactic paths between event triggers and their arguments, restricting the performance of event extraction.",
        "In 2011, the Protein coreference task and Entity Relation were organized as sub-tasks, to explicitly address the problem, but this time, coreference and part-of annotations are integrated in the GE task, to encourage an integrative use of them for event extraction.",
        "Figure 1 shows an example of annotation with coreference and part-of annotations5.",
        "Note that the event representation in the figure is relation centric6, which is different from the event centric representation of the default BioNLP-ST format.",
        "The two representations are interchangeable, and the GE task provides data sets in both formats, together with an automatic converter between them.",
        "Below is the corresponding annotation in the BioNLP-ST format:",
        "In the example, the event trigger, binding, denotes four binding events, in which the four proteins, TRAF1, TRAF2, TRAF3, and TRAF6, bind to the protein, CD40, respectively, through the site, cytoplasmic tail.",
        "The links between the four",
        "proteins and the event trigger are however very hard to find, without being bridged by the demonstrative noun phrase (NP), These proteins.",
        "In the case, if the link between the demonstrative NP, These proteins and its four antecedents, TRAF1, TRAF2, TRAF3, and TRAF6, can be somehow detected, the remaining link, between the demonstrative NP and the trigger, may be detected by their syntactic connection.",
        "A key point here is the different characteristics of the two step links: detecting the former is rather semantic or discoursal while the latter may be a more syntactic problem.",
        "Then, solving them using different processes would make a sense.",
        "To encourage an exploration into the hypothesis, the coreference annotation is provided in the training and development data sets.",
        "Based on the definition of event types, the entire task is divided into three subtasks addressing event extraction at different levels of specificity: Task 1.",
        "Core event extraction addresses the extraction of typed events together with their primary arguments.",
        "Task 2.",
        "Event enrichment addresses the extraction of secondary arguments that further specify the events extracted in Task 1.",
        "Task 3.",
        "Negation/Speculation detection addresses the detection of negations and speculations over the extracted events.",
        "For more detail of the subtasks, readers are referred to Kim et al. (2011b)."
      ]
    },
    {
      "heading": "3 Data Preparation",
      "text": [
        "As discussed in section 1, for the 2013 edition, the data sets are constructed fully with full text papers.",
        "Table 2 shows statistics of three data sets for training, development and test.",
        "The data sets consist of 34 full text papers from the Open Access subset of PubMed Central.",
        "The papers were retrieved using lexical variants of the term, ?NF?B?",
        "as primary keyword, and ?pathway?",
        "and ?regulation?",
        "as secondary keywords.",
        "The retrieved papers were given to the annotators with higher priority",
        "collection (1210 titles and abstracts), and the following columns are of full paper collection (14 full papers).",
        "TIAB = title and abstract, Intro.",
        "= introduction and background, R/D/C = results, discussions, and conclusions, Methods = methods, materials, and experimental procedures.",
        "Some minor sections, supporting information, supplementary material, and synopsis, are ignored.",
        "Density = relative density of",
        "to newer ones.",
        "Note that among 34 papers, 14 were from the full text collection of 2011 edition data sets, and 20 were newly collected this time.",
        "The annotation to the all 34 papers were produced by the same annotators who also produced annotations for the previous editions of GE task.",
        "The annotated papers are divided into the training, development, and test data sets; 10, 10, and 14, respectively.",
        "Note that the size of the training data set is much smaller than previous editions, in terms of number of words and events, while the size of the development and test data sets are comparable to previous editions.",
        "It is the consequence of a design choice of the organizers with the notion that (1) relevant resources are substantially accumulated through last two editions, and that (2) therefore the importance of training data set may be reduced while the importance of development and test data sets needs to be kept.",
        "Instead, participants may utilize, for example, the abstract collection of the 2011 edition, of which the annotation was produced by the same annotators with almost same principles.",
        "As another example, the data sets of the EPI task (Ohta et al., 2011) also may be utilized for the newly added protein modification events.",
        "Table 3 shows the statistics of annotated event types in different sections of the full papers in the data sets.",
        "For the analysis, the sections are classified to five groups as follows: ?",
        "The TIAB group includes the titles and abstracts.",
        "In the GE-2011 data sets, the corresponding files match the pattern, PMC-*TIAB*.txt.",
        "?",
        "The Intro group includes sections for introduction, and background.",
        "The corresponding files match the pattern, PMC-*@(-|._)@(I|Back)*.txt.",
        "show the predecessors in 2009 and 2011 editions.",
        "In Expertise column, C=Computer Scientist, BI=Bioinformatician, B=Biologist, L=Linguist ?",
        "The R/D/C group includes sections on results, discussions, and conclusions.",
        "The files match the pattern, PMC-*@(-|._)@(R|D|Conc)*.txt ?",
        "The Methods group includes sections on methods, materials, and experimental procedures.",
        "The files match the pattern, PMC-*@(-|._)@(Met|Mat|MAT|E)*.txt ?",
        "The Caption group includes the captions of tables and figures.",
        "The corresponding files math the pattern, PMC-*aption*.txt.",
        "Figure 2 illustrates the different distribution of annotated event types in the five section groups.",
        "It shows that the Methods group has significantly different distribution of annotated events, confirming a similar observation reported in Kim et al. (2011b)."
      ]
    },
    {
      "heading": "4 Participation",
      "text": [
        "The GE task received final submissions from 12 teams, among which 2 were withdrawn from final report.",
        "Table 4 summarizes the teams.",
        "Unfortunately, the subtasks 2 and 3 did not met a large participation.",
        "Table 5 profiles the participating systems.",
        "The systems are roughly grouped into SVM-based pipeline (EVEX, TEES-2.1, and DlutNLP), rule-based pipeline (BioSEM and UZH), mixed pipeline (USheff and HCMUS), joint pattern matching (NCBI and NICTANLM), and joint SVM (HDS4NLP) systems.",
        "In terms of use of external resources, 5 teams (EVEX, TEES-2.1, NCBI, DlutNLP, and USheff) utilized data sets from 2011 edition, and two teams (HDS4NLP and NICTANLM) utilized independent resources, e.g., UniProt (Bairoch et al., 2005), IntAct (Kerrien et al., 2012), and CRAFT (Verspoor et al., 2012)."
      ]
    },
    {
      "heading": "5 Results and Discussions",
      "text": [
        "Table 6 shows the final results of subtask 1.",
        "Overall EVEX, TEES-2.1, and BioSEM show the best performance only with marginal difference between them.",
        "In detail, the performance of BioSEM is significantly different from EVEX and TEES-2.1: (1) while BioSEM show the best performance with Binding and Protein modification events, EVEX and TEES-2.1 show the best performance with Regulation events which takes the largest portion of annotation in data sets; and (2) while the performance of EVEX and TEES-2.1 is balanced over recall and precision, BioSEM is biased for precision, which is a typical feature of rule-based systems.",
        "It is also notable that BioSEM has achieved a near best performance using only shallow parsing.",
        "Although it is not shown in the table, NCBI is the only system which produced Ubiquitination events, which is interpreted as a result of utilizing 2011-EPI data sets (Ohta et al., 2011) for the system development.",
        "Table 7 shows subtask 1 final results only within TIAB sections.",
        "It shows that the systems developed utilizing previous resources, e.g., 2011 data sets, and EVEX, perform better for titles and abstracts, which makes sense because those resources are title and abstract-centric.",
        "Tables 8 and 9 show evaluation results within Methods and Captions section groups, respectively.",
        "All the systems show their worst performance in the two section groups.",
        "Especially the drop of performance with regulation events is huge.",
        "Note the two section groups also show significantly different event distribution compared to other section groups (see section 3).",
        "It suggests that language expression in the two section groups may be quite different from other sections, and an extensive examination is required to get a reasonable performance in the sections.",
        "Table 10 and 11 show final results of Task 2 (Event enrichment) and 3 (Negation/Speculation detection), respectively, which unfortunately did not meet a large participation."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "In its third edition, the GE task is fully changed to a full text paper centric task, while the online evaluation service on the abstract-centric data sets",
        "in bold.",
        "is kept maintained.",
        "Unfortunately, the coreference annotation, which has been integrated in the event annotation in the data sets, was not exploited by the participants, during the official shared task period.",
        "An analysis shows that the performance of systems significantly drops in the Methods and Captions sections, suggesting for an extensive examination in the sections.",
        "As usual, after the official shared task period, the GE task is maintaining an online evaluation that can be freely accessed by anyone but with a time limitation; once in 24 hours per a person.",
        "With a few new features that are introduced in 2013 editions but are not fully exploited by the participants, the organizers solicit participants to continuously explore the task using the online evaluation.",
        "The organizers are also planning to provide more resources to the participants, based on the understanding that interactive communication between organizers and participants is important for progress of the participating systems and also the task itself."
      ]
    }
  ]
}
