{
  "info": {
    "authors": [
      "Jose G. Moreno",
      "Gaël Dias",
      "Guillaume Cleuziou"
    ],
    "book": "ACL",
    "id": "acl-P13-2028",
    "title": "Post-Retrieval Clustering Using Third-Order Similarity Measures",
    "url": "https://aclweb.org/anthology/P13-2028",
    "year": 2013
  },
  "references": [
    "acl-D10-1012",
    "acl-J13-3008",
    "acl-J90-1003",
    "acl-P06-2084"
  ],
  "sections": [
    {
      "heading": "LIFO",
      "text": []
    },
    {
      "heading": "Abstract",
      "text": [
        "Post-retrieval clustering is the task of clustering Web search results.",
        "Within this context, we propose a new methodology that adapts the classical K-means algorithm to a third-order similarity measure initially developed for NLP tasks.",
        "Results obtained with the definition of a new stopping criterion over the ODP-239 and the MORESQUE gold standard datasets evidence that our proposal outperforms all reported text-based approaches."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Post-retrieval clustering (PRC), also known as search results clustering or ephemeral clustering, is the task of clustering Web search results.",
        "For a given query, the retrieved Web snippets are automatically clustered and presented to the user with meaningful labels in order to minimize the information search process.",
        "This technique can be particularly useful for polysemous queries but it is hard to implement efficiently and effectively (Carpineto et al., 2009).",
        "Indeed, as opposed to classical text clustering, PRC must deal with small collections of short text fragments (Web snippets) and be processed in run-time.",
        "As a consequence, most of the successful methodologies follow a monothetic approach (Za-mir and Etzioni, 1998; Ferragina and Gulli, 2008; Carpineto and Romano, 2010; Navigli and Crisa-fulli, 2010; Scaiella et al., 2012).",
        "The underlying idea is to discover the most discriminant topical words in the collection and group together Web snippets containing these relevant terms.",
        "On the other hand, the polythetic approach which main idea is to represent Web snippets as word feature vectors has received less attention, the only relevant work being (Osinski and Weiss, 2005).",
        "The main reasons for this situation are that (1) word feature vectors are hard to define in small collections of short text fragments (Timonen, 2013), (2) existing second-order similarity measures such as the cosine are unadapted to capture the semantic similarity between small texts, (3) Latent Semantic Analysis has evidenced inconclusive results (Osinski and Weiss, 2005) and (4) the la-beling process is a surprisingly hard extra task (Carpineto et al., 2009).",
        "This paper is motivated by the fact that the polythetic approach should lead to improved results if correctly applied to small collections of short text fragments.",
        "For that purpose, we propose a new methodology that adapts the classical K-means algorithm to a third-order similarity measure initially developed for Topic Segmentation (Dias et al., 2007).",
        "Moreover, the adapted K-means algorithm allows to label each cluster directly from its centroids thus avoiding the abovementioned extra task.",
        "Finally, the evolution of the objective function of the adapted K-means is modeled to automatically define the ?best?",
        "number of clusters.",
        "Finally, we propose different experiments over the ODP-239 (Carpineto and Romano, 2010) and MORESQUE (Navigli and Crisafulli, 2010) datasets against the most competitive text-based PRC algorithms: STC (Zamir and Etzioni, 1998), LINGO (Osinski and Weiss, 2005), OPTIMSRC (Carpineto and Romano, 2010) and the classical bisecting incremental K-means (which may be seen as a baseline for the polythetic paradigm)1.",
        "A new evaluation measure called the b-cubed F - measure (Fb3) and defined in (Amigo?",
        "et al, 2009) is then calculated to evaluate both cluster homogeneity and completeness.",
        "Results evidence that our proposal outperforms all state-of-the-art approaches with a maximum Fb3 = 0.452 for ODP",
        "al., 2012) is a knowledge-driven methodology based on Wikipedia."
      ]
    },
    {
      "heading": "2 Polythetic Post-Retrieval Clustering",
      "text": [
        "The K-means is a geometric clustering algorithm (Lloyd, 1982).",
        "Given a set of n data points, the algorithm uses a local search approach to partition the points into K clusters.",
        "A set of K initial cluster centers is chosen.",
        "Each point is then assigned to the center closest to it and the centers are recomputed as centers of mass of their assigned points.",
        "The process is repeated until convergence.",
        "To assure convergence, an objective function Q is defined which decreases at each processing step.",
        "The classical objective function is defined in Equation (1) where pik is a cluster labeled k, xi ?",
        "pik is an object in the cluster, mpik is the centroid of the cluster pik and E(., .)",
        "is the Euclidean distance.",
        "Within the context of PRC, the K-means algorithm needs to be adapted to integrate third-order similarity measures (Mihalcea et al., 2006; Dias et al., 2007).",
        "Third-order similarity measures, also called weighted second-order similarity measures, do not rely on exact matches of word features as classical second-order similarity measures (e.g. the cosine metric), but rather evaluate similarity based on related matches.",
        "In this paper, we propose to use the third-order similarity measure called InfoSimba introduced in (Dias et al., 2007) for Topic Segmentation and implement its simplified version S3s in Equation 2.",
        "Given two Web snippets Xi and Xj , their similarity is evaluated by the similarity of its constituents based on any symmetric similarity measure S(., .)",
        "where Wik (resp.",
        "Wjl) corresponds to the word at the kth (resp.",
        "lth) position in the vector Xi (resp.",
        "Xj) and Xik (resp.",
        "Xjl) is the weight of word Wik (resp.",
        "Wjl) in the set of retrieved Web snippets.",
        "A direct consequence of the change in similarity measure is the definition of a new objective function QS3s to ensure convergence.",
        "Thisfunction is defined in Equation (3) and must be",
        "A cluster centroid mpik is defined by a vector of p words (wpik1 , .",
        ".",
        ".",
        ", wpikp ).",
        "As a consequence, each cluster centroid must be instantiated in such a way that QS3s increases at each step of the clusteringprocess.",
        "The choice of the best p words representing each cluster is a way of assuring convergence.",
        "For that purpose, we define a procedure which consists in selecting the best p words from the global vocabulary V in such a way that QS3sincreases.",
        "The global vocabulary is the set of all words which appear in any context vector.",
        "So, for each word w ?",
        "V and any symmetric similarity measure S(., .",
        "), its interestingness ?k(w) is computed as regards to cluster pik.",
        "This operation is defined in Equation (4) where si ?",
        "pik is any Web snippet from cluster pik.",
        "Finally, the p words with higher ?k(w) are selected to construct the cluster centroid.",
        "In such a way, we can easily prove that QS3s is maximized.",
        "Note that a wordwhich is not part of cluster pik may be part of the",
        "S(wiq, w).",
        "(4) Finally, we propose to rely on a modified version of the K-means algorithm called Global K-means (Likasa et al., 2003), which has proved to lead to improved results.",
        "To solve a clustering problem with M clusters, all intermediate problems with 1, 2, ...,M ?",
        "1 clusters are sequentially solved.",
        "The underlying idea is that an optimal solution for a clustering problem with M clusters can be obtained using a series of local searches using the K-means algorithm.",
        "At each local search, the M ?",
        "1 cluster centers are always initially placed at their optimal positions corresponding to the clustering problem with M ?",
        "1 clusters.",
        "The remaining M th cluster center is initially placed at several positions within the data space.",
        "In addition to effectiveness, the method is deterministic and does not depend on any initial conditions or empirically adjustable parameters.",
        "Moreover, its adaptation to PRC is straightforward."
      ]
    },
    {
      "heading": "3 Stopping Criterion",
      "text": [
        "Once clustering has been processed, selecting the best number of clusters still remains to be decided.",
        "For that purpose, numerous procedures have been proposed (Milligan and Cooper, 1985).",
        "However, none of the listed methods were effective or adaptable to our specific problem.",
        "So, we proposed a procedure based on the definition of a rational function which models the quality criterion QS3s .",
        "To better understand the behaviour of QS3sat each step of the adapted GK-means algorithm, we present its values for K = 10 in Figure 1.",
        "QS3s can be modelled as in Equation (5) whichconverges to a limit ?",
        "whenK increases and starts from Q1S3s (i.e. QS3s at K = 1).",
        "The underlyingidea is that the best number of clusters is given by the ?",
        "value which maximizes the difference with the average ?mean.",
        "So, ?, ?",
        "and ?",
        "need to be expressed independently of unknown variables.",
        "?K, f(K) = ??",
        "?K?",
        ".",
        "(5) As ?",
        "can theoretically or operationally be defined and it can easily be proved that ?",
        "= ?",
        "?Q1S3s ,?",
        "needs to be defined based on ?",
        "or ?.",
        "This can also be easily proved and the given result is expressed in Equation (6).",
        "Now, the value of ?",
        "which best approximates the limit of the rational function must be defined.",
        "For that purpose, we computed its maximum theoretical and experimental values as well as its approximated maximum experimental value based on the ?2-Aitken (Aitken, 1926) procedure to accelerate convergence as explained in (Kuroda et al., 2008).",
        "Best results were obtained with the maximum experimental value which is defined as building the cluster centroid mpik for each Web snippet individually.",
        "Finally, the best number of clusters is defined as in Algorithm (1) and each one receives its label based on the p words with greater interestingness of its centroid mpik .",
        "Algorithm 1 The best K selection procedure.",
        "1.",
        "Calculate ?K for each K 2.",
        "Evaluate the mean of all ?K i.e. ?mean 3.",
        "Select ?K which maximizes ?K ?",
        "?mean 4.",
        "Return K as the best number of partitions",
        "This situation is illustrated in Figure (1) where the red line corresponds to the rational functional for ?mean and the blue line models the best ?",
        "value (i.e. the one which maximizes the difference with ?mean).",
        "In this case, the best number would correspond to ?6 and as a consequence, the best number of clusters would be 6.",
        "In order to illustrate the soundness of the procedure, we present the different values for ?",
        "at each K iteration and the differences between consecutive values of ?",
        "at each iteration in Figure 2.",
        "We clearly see that the highest inclination of the curve is between cluster 5 and 6 which also corresponds to the highest difference between two consecutive values of ?."
      ]
    },
    {
      "heading": "4 Evaluation",
      "text": [
        "Evaluating PRC systems is a difficult task as stated in (Carpineto et al., 2009).",
        "Indeed, a successful PRC system must evidence high quality level clustering.",
        "Ideally, each query subtopic should be represented by a unique cluster containing all the relevant Web pages inside.",
        "However, this task is far from being achievable.",
        "As such, this constraint is reformulated as follows: the task of PRC systems is to provide complete topical cluster coverage of a given query, while avoiding excessive",
        "redundancy of the subtopics in the result list of clusters.",
        "So, in order to evaluate our methodology, we propose two different evaluations.",
        "First, we want to evidence the quality of the stopping criterion when compared to an exhaustive search over all tunable parameters.",
        "Second, we propose a comparative evaluation with existing state-of-the-art algorithms over gold standard datasets and recent clustering evaluation metrics."
      ]
    },
    {
      "heading": "4.1 Text Processing",
      "text": [
        "Before the clustering process takes place, Web snippets are represented as word feature vectors.",
        "In order to define the set of word features, the Web service proposed in (Machado et al., 2009) is used3.",
        "In particular, it assigns a relevance score to any token present in the set of retrieved Web snippets based on the analysis of left and right token contexts.",
        "A specific threshold is then applied to withdraw irrelevant tokens and the remaining ones form the vocabulary V .",
        "Then, each Web snippet is represented by the set of its p most relevant tokens in the sense of the W (.)",
        "value proposed in (Machado et al., 2009).",
        "Note that within the proposed Web service, multiword units are also identified.",
        "They are exclusively composed of relevant individual tokens and their weight is given by the arithmetic mean of their constituents scores."
      ]
    },
    {
      "heading": "4.2 Intrinsic Evaluation",
      "text": [
        "The first set of experiments focuses on understanding the behaviour of our methodology within a greedy search strategy for different tunable parameters defined as a tuple < p,K, S(Wik,Wjl) >.",
        "In particular, p is the size of the word feature vectors representing both Web snippets and centroids (p = 2..5), K is the number of clusters to be found (K = 2..10) and S(Wik,Wjl) is the collocation measure integrated in the InfoSimba similarity measure.",
        "In these experiments, two association measures which are known to have different behaviours (Pecina and Schlesinger, 2006) are tested.",
        "We implement the Symmetric Conditional Probability (Silva et al., 1999) in Equation (7) which tends to give more credits to frequent associations and the Pointwise Mutual Information (Church and Hanks, 1990) in Equation (8) which overestimates infrequent associations.",
        "Then, best < p,K, S(Wik,Wjl) > configurations are compared to our stopping criterion.",
        "In order to perform this task, we evaluate performance based on the Fb3 measure defined in (Amigo?",
        "et al, 2009) over the ODP-239 gold standard dataset proposed in (Carpineto and Romano,",
        "2010).",
        "In particular, (Amigo?",
        "et al, 2009) indicate that common metrics such as the F?-measure are good to assign higher scores to clusters with high homogeneity, but fail to evaluate cluster completeness.",
        "First results are provided in Table 1 and evidence that the best configurations for different < p,K, S(Wik,Wjl) > tuples are obtained for high values of p, K ranging from 4 to 6 clusters and PMI steadily improving over SCP .",
        "However, such a fuzzy configuration is not satisfactory.",
        "As such, we proposed a new stopping criterion which evidences coherent results as it (1) does not depend on the used association measure (FSCPb3 = 0.452 and FPMIb3 = 0.450), (2) discovers similar numbers of clusters independently of the length of the p-context vector and (3) increases performance with high values of p."
      ]
    },
    {
      "heading": "4.3 Comparative Evaluation",
      "text": [
        "The second evaluation aims to compare our methodology to current state-of-the-art text-based PRC algorithms.",
        "We propose comparative experiments over two gold standard datasets (ODP-239 (Carpineto and Romano, 2010) and MORESQUE (Di Marco and Navigli, 2013)) for STC (Zamir and Etzioni, 1998), LINGO (Osinski and Weiss, 2005), OPTIMSRC (Carpineto and Romano, 2010) and the Bisecting Incremental K-means (BIK) which may be seen as a baseline for the polythetic paradigm.",
        "A brief description of each PRC algorithm is given as follows.",
        "STC: (Zamir and Etzioni, 1998) defined the Suffix Tree Clustering algorithm which is still a difficult standard to beat in the field.",
        "In particular, they propose a monothetic clustering technique which merges base clusters with high string overlap.",
        "Indeed, instead of using the classical Vector Space Model (VSM) representation, they propose to represent Web snippets as compact tries.",
        "LINGO: (Osinski and Weiss, 2005) proposed a polythetic solution called LINGO which takes into account the string representation proposed by (Zamir and Etzioni, 1998).",
        "They first extract frequent phrases based on suffix-arrays.",
        "Then, they reduce the term-document matrix (defined as a VSM) using Single Value Decomposition to discover latent structures.",
        "Finally, they match group descriptions with the extracted topics and assign relevant documents to them.",
        "OPTIMSRC: (Carpineto and Romano, 2010) showed that the characteristics of the outputs returned by PRC algorithms suggest the adoption of a meta clustering approach.",
        "As such, they introduce a novel criterion to measure the concordance of two partitions of objects into different clusters based on the information content associated to the series of decisions made by the partitions on single pairs of objects.",
        "Then, the meta clustering phase is casted to an optimization problem of the concordance between the clustering combination and the given set of clusterings.",
        "With respect to implementation, we used the Carrot2 APIs4 which are freely available for STC, LINGO and the classical BIK.",
        "It is worth noticing that all implementations in Carrot2 are tuned to extract exactly 10 clusters.",
        "For OPTIMSRC, we reproduced the results presented in the paper of (Carpineto and Romano, 2010) as no implementation is freely available.",
        "The results are illustrated in Table 2 including both F?-measure and Fb3 .",
        "They evidence clear improvements of our methodology when compared to state-of-the-art text-based PRC algorithms, over both datasets and all evaluation metrics.",
        "But more important, even when the p-context vector is small (p = 3), the adapted GK-means outperforms all other existing text-based PRC which is particularly important as they need to perform in real-time."
      ]
    },
    {
      "heading": "5 Conclusions",
      "text": [
        "In this paper, we proposed a new PRC approach which (1) is based on the adaptation of the K-means algorithm to third-order similarity measures and (2) proposes a coherent stopping criterion.",
        "Results evidenced clear improvements over the evaluated state-of-the-art text-based approaches for two gold standard datasets.",
        "Moreover, our best F1-measure over ODP-239 (0.390) approximates the highest ever-reached F1-measure (0.413) by the TOPICAL knowledge-driven algorithm proposed in (Scaiella et al., 2012)5.",
        "These results are promising and in future works, we propose to define new knowledge-based third-order similarity measures based on studies in entity-linking (Ferragina and Scaiella, 2010).",
        "though different results can be obtained for different F?-measures and Fb3 as evidenced in Table 2."
      ]
    }
  ]
}
