{
  "info": {
    "authors": [
      "Ching-Sheng Lin",
      "Samira Shaikh",
      "Jennifer Stromer-Galley",
      "Jennifer Crowley",
      "Tomek Strzalkowski",
      "Veena Ravishankar"
    ],
    "book": "LASM",
    "id": "acl-W13-1105",
    "title": "Topical Positioning: A New Method for Predicting Opinion Changes in Conversation",
    "url": "https://aclweb.org/anthology/W13-1105",
    "year": 2013
  },
  "references": [
    "acl-C10-1117",
    "acl-P03-1054",
    "acl-P09-1026"
  ],
  "sections": [
    {
      "text": [
        "participants based on all meso-topics in discourse.",
        "Comparing different snapshots of the TPN over time, we can observe how the group's dynamic changes, i.e., how some participants move closer to one another while others drift apart in the discus-sion.",
        "In particular, we suggest that TPN changes can track and predict participants?",
        "changes of opinion about the overall topic of conversation.",
        "The remainder of this paper is organized as follows.",
        "In Section 2, we review related work.",
        "In Section 3, we describe the components of the proposed technique and the way they are used to implement the system.",
        "In Section 4, we discuss initial empirical studies, including data collection and evaluation.",
        "In final section, we present conclusions and some future work.",
        "2 Related Work While systematic research on opinion tracking and influence in dialogues is a relatively new area of computational linguistics, related research includes automatic opinion mining and sentiments extraction from text (Wiebe et al., 2005; Strapparava and Mihalcea, 2008), speech (Vogt et al., 2008) and social networking sites (Martineau and Finin, 2009).",
        "Much of the recent work was focused on automatic analysis of product reviews (books, movies, etc.)",
        "and extracting customers?",
        "opinions from them (Hu and Liu, 2004; David and Pinch, 2006; Zhuang et al., 2006).",
        "A typical approach is to count the number of ?opinion?",
        "words within a text window around the product names, possibly augmented with syntactic parsing to get dependencies right.",
        "An opinion mining application can extract either full opinion sentences (Philip et al., 2003) or may generate a more structured representation (Hu and Liu, 2004).",
        "Another recent application of sentiment analysis is ECO system (Effective Communication Online) (Small et al., 2010) that constructs a model of a community-wide sentiment towards certain common issues discussed in social media, particularly forums and open blogs.",
        "This model is then used to assess whether a new post would fit into the targeted community by comparing the sentiment polarities about the concepts in the message and in the model.",
        "Potential posters are then guided in ways to shape their communication so that it minimizes the number of conflicting concept sentiments, while still preserving the intended message.",
        "Another related research domain is about modeling the social phenomena in discourse.",
        "(Strzalkowski et al., 2010, Broadwell et al., 2012) proposed a two-tier approach that relies on extracting observable linguistic features of conversational text to detect mid-level social behaviors such as Topic Control, Disagreement and Involvement.",
        "These social behaviors are then used to infer high-er-level social roles such as Leader and Influencer, which may have impact on how other participants?",
        "opinions form and change.",
        "3 System Modules In this section, we describe a series of modules in our system, which include meso-topic extraction, topical positioning and topical positioning map, and explain how we capture opinion shifts.",
        "3.1 Meso-Topic Extraction Participants mention many ideas and subjects in dialogue.",
        "We call these Local Topics, which are any noun phrases introduced that are subsequently mentioned via repetition, synonym, or pronoun (Strzalkowski et al., 2010) by the same participant or different participants.",
        "Some local topics persist for only a couple of turns, others for much longer; some are closely relevant to the overall discussion, while others may appear to be digressions.",
        "We identify local topics, their first mentions and subsequent mentions, and track participants who make these mentions.",
        "Once local topics have been introduced into the dialogue we track their persistence as topic chains, through repetitions of the noun phrase as well as references via pronouns and the use of synonyms.",
        "Topic chains do not have to be continuous, they may contain gaps.",
        "The lengths of these gaps are also important to measures for some behaviors.",
        "Meso-topics are the most persistent local topics, topics that are widely cited through long stretches of discourse.",
        "A selection of meso-topics is closely associated with the task in which the discourse participants are engaged.",
        "Short ?gaps?",
        "in the chain are permitted (up to 10 turns, to accommodate digressions, obscure references, noise, etc.).",
        "Meso-topics can be distinguished from the local topics because the participants often make polarized statements about them.",
        "We use the Stanford part-of-speech tagger (Klein and Manning, 2003) to automatically detect nouns and noun phrases in dialogue and select those with subsequent men",
        "tions as local topics using a fairly simple pronoun resolution method based primarily on presence of specific lexical features as well as temporal distance between utterances.",
        "Princeton Wordnet (Fellbaum et al., 2006) is consulted to identify synonyms and other related words commonly used in co-references.",
        "The local topics that form sufficiently long co-reference chains are designated as meso-topics.",
        "3.2 Topical Positioning Topical Positioning is defined as the attitude a speaker has towards the meso-topics of discussion.",
        "Speakers in a dialogue, when discussing issues, especially ones with some controversy, will establish their attitude on each topic, classified as for, against, or neutral/undecided.",
        "In so doing, they establish their positions on the issue or topic, which shapes the agenda of the discussion and also shapes the outcomes or conclusions of the discus-sion.",
        "Characterizing topical positioning allows us to see the speakers who are for, who are against, and who are neutral/undecided on a given topic or issue.",
        "To establish topical positioning, we first identify meso-topics that are present in a discourse.",
        "For each utterance made by a speaker on a meso-topic we then establish its polarity, i.e., if this utterance is ?for?",
        "(positive) or ?against?",
        "(negative), or neutral on the topic.",
        "We distinguish three forms of meso-topic valuation that may be present: (a) express advocacy/disadvocacy, when the valuation is applied directly to the topic (e.g., ?I'm for Carla?",
        "); (b) supporting/dissenting information, when the valuation is made indirectly by offering additional information about the topic (e.g., ?He's got experience with youngsters.?",
        "); and (c) express agree-ment/disagreement with a polarized statement made by another speaker.",
        "The following measures of Topical Positioning are defined: Topic Polarity Index, which establishes the polarity of a speaker's attitude towards the topic, and Polarity Strength Index, which measures the magnitude of this attitude.",
        "[Topic Polarity Index (TPX)] In order to detect the polarity of Topical Positioning on meso-topic T, we count for each speaker: - All utterances on T using statements with polarity P applied directly to T using appropriate adverb or adjective phrases, or when T is a direct object of a verb.",
        "Polarities of adjectives and adverbs are taken from the expanded ANEW lexicon (Bradley and Lang, 1999).",
        "- All utterances that offer information with polarity P about topic T. - All responses to other speakers?",
        "statements with polarity P applied to T. In the Twitter environment (and the like), for now we include a re-tweet in this category.",
        "Given these counts we can calculate TPX for each speaker as a proportion of positive, negative and neutral polarity utterances made by this speaker about topic T. A speaker whose utterances are overwhelmingly positive (80% or more) has a pro-topic position (TPX = +1); a speaker whose utterances are overwhelmingly negative takes an against-topic position (TPX = ?1); a speaker whose utterances are largely neutral or whose utterances vary in polarity, has a neutral/undecided position on the topic (TPX = 0).",
        "[Polarity Strength Index (PSX)] In addition to the valence of the Topical Positioning, we also wish to calculate its strength.",
        "To do so, we calculate the proportion of utterances on the topic made by each speaker to all utterances made about this topic by all speakers in the discourse.",
        "Speakers, who make most utterances on the topic relative to other speakers, take a stronger position on this topic.",
        "PSX is measured on a 5-point scale corresponding to the quintiles in normal distribution.",
        "Topical Positioning Measure (TPM) In order to establish the value of Topical Positioning for a given topic we combine the values of TPX*PSX.",
        "Topical Positioning takes values between +5 (strongest pro) to 0 (neutral/undecided) to ?5 (strongest against).",
        "For example, a speaker who makes 25% of all utterances on the topic ?Carla?",
        "(group mean is 12%) and whose most statements are positive, has the strongest pro Topical Positioning on Carla: +5 (for fifth quintile on the positive side).",
        "3.3 Topical Positioning Map (TPN) Given the combined values of TPM for each participant in a group, we can calculate distances between the speakers on each meso-topic as well as on all meso-topics in a conversation.",
        "For meso",
        "topics (t1, ?",
        "tN), the distance is calculated using a cosine between speakers?",
        "?vectors?",
        "(TPMt1(A) ?",
        "TPMtN(A)) and (TPMt1(B) ?",
        "TPMtN(B)).",
        "Specifi-cally, we use (1-Cosine(V1, V2)) to represent distance between node V1 and V2 in the network, where the range becomes 0 to 2.",
        "With the aid of TPN, we can detect the opinion shifts and model the impact of speakers with specific social roles in the group, which in our case is the influencer.",
        "An influencer is a group participant who has credibility in the group and introduces ideas that others pick up on or support.",
        "An influencer model is generated from mid-level sociolinguistic behaviors, including Topic Control, Disagreement and Involvement (Shaikh et al., 2012).",
        "In order to calculate effect of the influencer on a group, we track changes in the TPN distances between speakers, and particularly between the influencer and other speakers.",
        "We want to know if the other speakers in the group moved closer to or further away from the influencer, who may be promoting a particular position on the overall subject of discussion.",
        "Our hypothesis is that other participants will move closer (as a group, though not necessarily individually) to an influential speaker.",
        "We may also note that some speakers move closer while others move away, indicating a polarizing effect of an influential speaker.",
        "If there is more than one influencer in the group these effects may be still more complex.",
        "4 Data Collection and Experiment Our initial focus has been on Twitter discussions which enable users to create messages, i.e., ?tweets?.",
        "There are plenty of tweet messages generated all the time and it is reported that Twitter has surpassed 400 million tweets per day.",
        "With the Twitter API, it is easy to collect those tweets for research, as the communications are considered public.",
        "However, most of data obtained publicly is of limited value due to its complexity, lack of fo-cus, and inability to control for many independent variables.",
        "In order to derive reliable models of conversational behavior that fulfill our interests in opinion change, we needed a controlled environment with participants whose initial opinions were known and with conversation reasonably focused on a topic of interest.",
        "To do so, we recruited participants for a two-week Twitter debates on a variety of issues, one of the topics was ?Should the minimum legal drinking age be lowered to 18??",
        "We captured participants?",
        "initial positions through surveys before each debate, and their exit positions through surveys after the debate was completed two weeks later.",
        "The surveys were designed to collect both the participants?",
        "opinions about the overall topic of conversation as well as about the roles they played in it.",
        "These data were then compared to the automatically computed TPN changes.",
        "4.1 Data Collection To obtain a suitable dataset, we conducted two groups of controlled and secured experiments with Twitter users.",
        "The experiment was specially designed to ensure that participants stay on topic of discussion and that there was a minority opinion represented in the group.",
        "We assigned the same overall topic for both groups: ?lowering the drinking age from 21 to 18?.",
        "Before the discussion, the participants completed an 11-question survey to determine their pre-discussion attitudes toward overall topic.",
        "One participant with the minority opinion was then asked to act as an influencer in the discussion, i.e., to try to convince as many people as possible to adopt his or her position.",
        "Af-ter the discussion, the participants were asked the same 11 questions to determine if their positions have changed.",
        "All 11 questions probed various aspects of the overall topic, thus providing a reliable measure of participant's opinion.",
        "All responses were on a 7-point scale from ?strongly agree?",
        "to ?strongly disagree?.",
        "The orientation of individual questions vs. the overall topic was varied to make sure that the participants did not mechanically fill their responses.",
        "Some of the questions were: (1) Lowering the drinking age to 18 would make alcohol less of a taboo, making alcohol consumption a more normalized activity to be done in mod-eration.",
        "+3 strongly agree ----- 3 strongly disagree (2) 18 year olds are more susceptible to binge drinking and other risky/irresponsible behaviors than people who are 21 and older.",
        "-3 strongly agree ----- +3 strongly disagree (note reversed polarity) The basic statistical information about the two experimental groups is given in Table 1 and the tweet distribution of each participant in Group-1 is shown in Figure 1.",
        "Participants are denoted by a"
      ]
    },
    {
      "heading": "4.2 Experiment After detailed analysis of participants? opinion before and after the discussion, two twitter discussions are run through our system to extract the required information in order to compute topical positioning as explained in section 3. In Group-1, ten meso-topics were generated by our system (in-cluding, e.g., ?drinking age?, ?teens? and ?alco-hol?). Each participant's polarity associated with these meso-topics was computed by our system to form ten-dimensional topical positioning vectors for Group-1. In our experiment, we used the first quarter of discussion to compute initial topical positioning of the group and last-three quarters to compute the final topical positioning. Once the pre-and post-topical positioning were determined, the topical positioning map between participants was calculated accordingly, i.e., pre-and post-TPN. We used the first quarter of discussion for the initial TPN because we required a sufficient amount of data to compute a stable measure; how-ever, we expected it would not fully represent par-ticipants? initial positions. Nonetheless, we should still see the change when compared with post-TPN, which was computed on the last three-quarters of the discussion. In order to detect the opinion shifts and also to measure the effect of the influencer on a group, we tracked the changes in the TPN with respect to the influencer. As shown in Figure 4(a), the pre-TPN between WS and EK is 1.33 (third bar) and post-TPN is 0.72 (fourth bar). Hence, the system determines that their opinions are moving closer which conforms to the survey results. Figure 4(b) is another example of WS and BC that system result shows the same tendency as the survey result. The pre-discussion distance between WS and BC is 1.87 (first bar) and the post-discussion distance is 1.42 (second bar), which implies their positions on the overall topic moved closer after discussion. In system detection, the pre-TPN between is 1.56 (third bar) and post-TPN is 1.02 (fourth bar), which also concludes their attitudes are closer. Another examples showing that speaker moved away from influencer are in Figure 5(a) and 5(b). According to the survey, the pre-discussion attitude distance between WS and CC is 0.62 (first bar) and post-discussion attitude distance is 1.35 (second bar), which implies their positions diverged after the discussion. Our system determined pre-TPN between WS and CC is 1.0 (third bar) and post",
      "text": [
        "first ?",
        "vs. last ?, first ?",
        "vs. last ?, etc.",
        "Experiment results show that using the first quarter of discussion as initial topical positioning and last quarter as final topical positioning (?",
        "vs.",
        "?)",
        "produces the most accurate prediction of opinion changes for all group participants: 87.5% in Group-1 and 76% in Group-2.",
        "We should also note here that there is no specific correlation between the meso-topics and the overall topic other than the meso-topics arise spontaneously in the conversation.",
        "The set of me-so-topics in the second discussion on the same topic was different than the in the first discussion.",
        "In particular, meso-topics are not necessarily correlated with the aspects of the overall topic that are addressed in the surveys.",
        "Nonetheless, the TPN changes appear to predict the changes in surveys in both discussions.",
        "At this time the results is indicative only.",
        "Further experiments need to be run on additional data (currently being collected) to confirm this finding.",
        "5 Conclusion In this paper, we described an automated approach to detect participant's Topical Positioning and capture the opinion shifts by Topical Position Maps.",
        "This work is still in progress and we intend to process more genres of data, including Twitter and on-line chat, to confirm effects seen in the data we currently have.",
        "The future work should be able to account for the relationship between meso-topic and overall topic (i.e., supporting meso-topic means for or against overall topic).",
        "A potential solution could be determined by aligning with TPN of influencers who are known strongly pro-or against-overall topic.",
        "Another avenue of future work is to apply proposed model on virtual chat-room agent to guide the discussion and change par-ticipants?",
        "attitudes.",
        "References Bradley, M. M., & Lang, P. J.",
        "1999.",
        "Affective norms for English words (ANEW): Instruction manual and affective ratings(Tech.",
        "Rep. No.",
        "C-1).",
        "Gainesville, FL: University of Florida, The Center for Research in Psychophysiology.",
        "Broadwell, George, Jennifer Stromer-Galley, Tomek Strzalkowski, Samira Shaikh, Sarah Taylor, Umit Boz, Alana Elia, Laura Jiao, Ting Liu, and Nick Webb.",
        "\"Modeling Socio-Cultural Phenomena in Dis"
      ]
    }
  ]
}
