{
  "info": {
    "authors": [
      "Jeff Kubina",
      "John Conroy",
      "Judith Schlesinger"
    ],
    "book": "MultiLing",
    "id": "acl-W13-3104",
    "title": "ACL 2013 MultiLing Pilot Overview",
    "url": "https://aclweb.org/anthology/W13-3104",
    "year": 2013
  },
  "references": [
    "acl-W04-1013"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The 2013 Association for Computational Linguistics MultiLing Pilot posed a task to measure the performance of multilingual, single-document, summarization systems using a dataset derived from many Wikipedias.",
        "The objective of the pilot was to assess automatic summarization of multilingual text documents outside the news domain and the potential of using Wikipedia articles for such research.",
        "This report describes the pilot task, the dataset, the methods used to evaluate the submitted summaries, and the overall performance of each participant's system."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Document summarization is an active subject of research and development.",
        "The ACM Digital Library has about 806 reports on the subject published since 1993, with over half of them appearing in the last five years.",
        "While the impetus for much of this research is the annual Text Analysis Conference (TAC) workshop on document summarization, there is a growing demand in the consumer market for news summarization applications being met by tablet and smart-phone applications such as Clipped1, Summoner2, TLDR3, and Yahoo News.",
        "Yahoo and Google even acquired two companies developing such applications, Summly (Stelter, 2013) and Wavii (Tsotsis, 2013) respectively, earlier this year.",
        "While summarization technology for news sources is coming to fruition, the performance of such technology on non-English documents outside the news domain has not been throughly assessed and may need further research.",
        "Since the datasets used by",
        "http://goo.gl/qEgCs the TAC summarization workshops have predominately been English news articles, with some exceptions (Giannakopoulos et al., 2011), the objective of the 2013 ACL MultiLing Pilot was to assess the performance of automatic multilingual single-document summarization systems on non-English text outside the news domain and to determine the potential of using Wikipedia articles for such research.",
        "This report starts with a description of the task and dataset, the methods used to evaluate the submitted summaries, the performance of each participating system, and concludes with an assessment of the pilot and potential future work."
      ]
    },
    {
      "heading": "2 Task and Dataset Description",
      "text": [
        "The objective of each participant system of the pilot was simple: compute a summary for each document in at least two of the datasets languages.",
        "No restrictions were placed on the languages that could be chosen nor was any target summary size specified.",
        "The dataset was derived from a corpus created in 2010 to measure the performance of the CLASSY (Conroy et al., 2009) summarization algorithm on non-English documents outside the news domain.",
        "At the time such a corpus did not exist so one was created from the Wikipedias.",
        "To date there are Wikipedias in 285 languages comprising over 75 million pages.",
        "Some of the Wikipedias maintain a list of Feature Articles, which are articles reviewed and voted upon by editors as the best that fulfill Wikipedia's requirements in accuracy, neutrality, completeness, and style.",
        "One such requirement is that the article have a lead section that should .",
        ".",
        ".",
        "be able to stand alone as a concise overview.",
        "It should .",
        ".",
        ".",
        "summarize the most important points .",
        ".",
        ".",
        "[and] material in the lead should roughly reflect its im",
        "portance to the topic .",
        ".",
        ".",
        "4 So the lead section of a featured article is an excellent summary of it, hence, the featured articles were used to create the corpus.",
        "In 2010 there were 41 Wikipedias with more than nine featured articles.",
        "The Perl module Text::Corpus::Summaries::Wikipedia 5 was developed to automatically create the corpus from the featured articles of those Wikipedias.",
        "The corpus is publicly available (Kubina, 2010) and the Perl module can be used to create an updated corpus.",
        "The dataset for the pilot was created from a subset of the 2010 corpus.",
        "This was done to ensure that each language had 30 articles and that the size of each article's body text was sufficiently large.",
        "First, for each article the summary and body were compressed to approximate their information content size.",
        "For example, given a Chinese and English article with the same character length the Chinese article will usually contain more information than an English article and their compressed sizes will approximation their true information content.",
        "Next, if the compressed body size of an article was less than five times its compressed summary size, then the article was discarded.",
        "The factor of five was simply chosen to ensure the body of each article was sufficiently large relative to the summary size.",
        "For each language the median of the ratio of compressed body size to compressed summary size was computed and only the 30 articles closest to the median were included in the dataset.",
        "This filtering reduced the corpus from 12, 819 articles in 41 languages to the dataset containing 1, 200 articles in 40 languages.",
        "For each language in the dataset Table 1 contains the mean size of the articles, their bodies, and their summaries, in characters."
      ]
    },
    {
      "heading": "3 Evaluation Methods and Results",
      "text": [
        "Four teams submitted the results of six summarization systems.",
        "The teams are denoted by AIS, LAN, MD, and MUS; the MD team submitted three systems.",
        "Throughout this report the systems are denoted by AIS, LAN, MD1, MD2, MD3, and MUS.",
        "Table 2 contains the list of languages submitted for each system and the mean size, in characters, of the summaries submitted.",
        "For the evaluation a baseline summary was extracted from the each article in the dataset that is the prefix substring of the article's body text with the same length as the text in the lead section of the article.",
        "For the remainder of this report the lead section of an article is called the human summary.",
        "An oracle summary was also computed for each article by heuristically extracting sentences from its body text to maximize its ROUGE-2 score against the human summary until its size exceeded the human summary, upon which it was truncated.",
        "Submitted summaries were automatically evaluated against the human summary of each article using ROUGE-1, ROUGE-2 (Lin, 2004) and MeMoG (Giannakopoulos et al., 2008).",
        "For ROUGE, the languages Chinese, Japanese, Korean, and Thai were tokenized into individual characters.",
        "For MeMoG the character n-gram size used for each language is listed in Table 3, which is the n-gram size that maximized the standard deviation divided by the mean of the n-gram frequency distribution of the language in the dataset.",
        "So the selected n-gram size maximizes the variability of the distribution values relative to their mean.",
        "A shorter n-gram size would inflate the MeMoG scores because of their inherent frequent co-occurrence and conversely a longer size would penalize MeMoG scores due to their infrequent co-occurrence.",
        "Each scoring method was performed twice, first by truncating, if necessary, each system summary to the size of the human summary, which is called HSS-scoring.",
        "The second set of scores were computed by truncating all the summaries of an article, including the human summary, to the size of the shortest summary amongst the system and human summaries for the article, which is called SSS-scoring.",
        "For HSS-scoring the system summaries shorter that the human summary are penalized since ROUGE is recall oriented.",
        "Alternately, SSS-scoring gives preference to shorter system summaries that have their best content (extracted sentences) first.",
        "The performance for HSS-scoring of the systems on the seven languages that at least two teams submitted summaries for are given in Figures 1, 2, and 3.",
        "Table 4 gives an overview of how often significant differences in each of the three automatic metrics was observed.",
        "In particular, the last row gives the fraction of times that an non-parametric analysis of variance (ANOVA) indicated that the",
        "each the language, the second column the name of the language, and the remaining columns containing the mean size, in characters, and standard deviation, in parentheses, of the entire article, their bodies, and their summaries.",
        "For example, for English the mean size of the human summaries is 1,712 characters.",
        "the mean of the human summaries in the last column named SUM.",
        "each system significantly outperform the baseline.",
        "The last line gives the number of times an ANOVA rejected the null hypothesis, indicating significance.",
        "medians of the system scores were not the same, using a rejection threshold of 0.05.",
        "Also, the fraction of time that each system significantly outperformed the lead baseline is also recorded.",
        "A paired Wilcoxon test was invoked whenever the ANOVA indicated a significant difference was present, with a threshold of 0.05.",
        "Lastly, each systems performance for SSS-scoring is provided in Figures 4, 5, and 6.",
        "Surprisingly, the results change little.",
        "Lastly Table 5 contains the number of times that each system beat the baseline summary with a 95% confidence measured as a result of the non-parametric ANOVA and the Wilcoxon paired sign rank test.",
        "The results show that the number of significant differences go down for ROUGE scores and up for MeMoG."
      ]
    },
    {
      "heading": "4 Summary",
      "text": [
        "Overall, the authors believe the pilot was successful in that it exposed researchers to the potential for using Wikipedia articles for summarization research and demonstrated that generating summaries for the genre of Wikipedia articles is a more challenging task than newswire documents.",
        "Notably, no system outperformed the baseline for English!",
        "In hindsight this is not too surprising since news articles have a prose style6 significantly different from Wikipedia articles7.",
        "Wikipedia articles are written as expositions having a topical flow that can vary significantly between sections but news articles are written in a style8 that addresses the most important information first?the",
        "guages that each system significantly outperform the baseline on.",
        "The last line contains the number of times an ANOVA rejected the null hypothesis, indicating significance.",
        "who, what, when, where and why?with the subsequent text providing more details.",
        "Hence news articles have a more even topical flow.",
        "The authors hope these results stimulate research and development of summarization algorithms outside the news domain.",
        "As for the metrics, ROUGE-1 observed the most significant differences among the systems and MeMoG observed the least as measured by a non-parametric ANOVA.",
        "However, a human evaluation of the summaries generated would be needed to detemine which of the automatic metrics is best at predicting significant differences among systems for such data."
      ]
    }
  ]
}
