{
  "info": {
    "authors": [
      "Tony Veale",
      "Guofu Li"
    ],
    "book": "ACL",
    "id": "acl-P13-1065",
    "title": "Creating Similarity: Lateral Thinking for Vertical Similarity Judgments",
    "url": "https://aclweb.org/anthology/P13-1065",
    "year": 2013
  },
  "references": [
    "acl-E09-1095",
    "acl-J06-1003",
    "acl-N04-3012",
    "acl-N09-1003",
    "acl-P08-1119",
    "acl-P11-1029",
    "acl-P94-1019",
    "acl-W04-3221"
  ],
  "sections": [
    {
      "text": [
        "(e.g. see Pederson et al. 2004, Budanitsky & Hirst, 2006; Seco et al. 2006).",
        "These measures reduce the similarity of two lexical concepts to a single number, by viewing similarity as an objective estimate of the overlap in their salient quali-ties.",
        "This convenient perspective is poorly suited to creative or insightful comparisons, but it is sufficient for the many mundane comparisons we often perform in daily life, such as when we organize books or look for items in a supermarket.",
        "So if we do not know in which aisle to locate a given item (such as oatmeal), we may tacitly know how to locate a similar product (such as cornflakes) and orient ourselves accordingly.",
        "Yet there are occasions when the recognition of similarities spurs the creation of similarities, when the act of comparison spurs us to invent new ways of looking at an idea.",
        "By placing pop tarts in the breakfast aisle, food manufacturers encourage us to view them as a breakfast food that is not dissimilar to oatmeal or cornflakes.",
        "When ex-PM Tony Blair published his memoirs, a mischievous activist encouraged others to move his book from Biography to Fiction in bookshops, in the hope that buyers would see it in a new light.",
        "Whenever we use a novel metaphor to convey a non-obvious viewpoint on a topic, such as ?cigarettes are time bombs?, the comparison may spur us to insight, to see aspects of the topic that make it more similar to the vehicle (see Ortony, 1979; Veale & Hao, 2007).",
        "In formal terms, assume agent A has an insight about concept X, and uses the metaphor X is a Y to also provoke this insight in agent B.",
        "To arrive at this insight for itself, B must intuit what X and Y have in common.",
        "But this commonality is surely more than a standard categorization of X, or else it would not count as an insight about X.",
        "To understand the metaphor, B must place X",
        "in a new category, so that X can be seen as more similar to Y. Metaphors shape the way we perceive the world by reshaping the way we make similarity judgments.",
        "So if we want to imbue computers with the ability to make and to understand creative metaphors, we must first give them the ability to look beyond the narrow viewpoints of conventional resources.",
        "Any measure that models similarity as an objective function of a conventional worldview employs a convergent thought process.",
        "Using WordNet, for instance, a similarity measure can vertically converge on a common superordinate category of both inputs, and generate a single numeric result based on their distance to, and the information content of, this common generaliza-tion.",
        "So to find the most conventional ways of seeing a lexical concept, one simply ascends a narrowing concept hierarchy, using a process de Bono (1970) calls vertical thinking.",
        "To find nov-el, non-obvious and useful ways of looking at a lexical concept, one must use what Guilford (1967) calls divergent thinking and what de Bono calls lateral thinking.",
        "These processes cut across familiar category boundaries, to simultaneously place a concept in many different categories so that we can see it in many different ways.",
        "de Bono argues that vertical thinking is selective while lateral thinking is generative.",
        "Whereas vertical thinking concerns itself with the ?right?",
        "way or a single ?best?",
        "way of looking at things, lateral thinking focuses on producing alternatives to the status quo.",
        "To be as useful for creative tasks as they are for conventional tasks, we need to re-imagine our computational similarity measures as generative rather than selective, expansive rather than reductive, divergent as well as convergent and lateral as well as vertical.",
        "Though WordNet is ideally structured to support vertical, convergent reasoning, its comprehensive nature means it can also be used as a solid foundation for building a more lateral and divergent model of similarity.",
        "Here we will use the web as a source of diverse perspectives on familiar ide-as, to complement the conventional and often narrow views codified by WordNet.",
        "Section 2 provides a brief overview of past work in the area of similarity measurement, before section 3 describes a simple bootstrapping loop for acquiring richly diverse perspectives from the web for a wide variety of familiar ideas.",
        "These perspectives are used to enhance a Word-Net-based measure of lexico-semantic similarity in section 4, by broadening the range of informative viewpoints the measure can select from.",
        "Similarity is thus modeled as a process that is both generative and selective.",
        "This lateral-and-vertical approach is evaluated in section 5, on the Miller & Charles (1991) data-set.",
        "A web app for the lateral exploration of diverse viewpoints, named Thesaurus Rex, is also presented, before closing remarks are offered in section 6.",
        "2 Related Work and Ideas WordNet's taxonomic organization of noun-senses and verb-senses ?",
        "in which very general categories are successively divided into increasingly informative subcategories or instance-level ideas ?",
        "allows us to gauge the overlap in information content, and thus of meaning, of two lexical concepts.",
        "We need only identify the deepest point in the taxonomy at which this content starts to diverge.",
        "This point of divergence is often called the LCS, or least common subsumer, of two concepts (Pederson et al., 2004).",
        "Since subcategories add new properties to those they inherit from their parents ?",
        "Aristotle called these properties the differentia that stop a category system from trivially collapsing into itself ?",
        "the depth of a lexical concept in a taxonomy is an intuitive proxy for its information content.",
        "Wu & Palmer (1994) use the depth of a lexical concept in the WordNet hierarchy as such a proxy, and thereby estimate the similarity of two lexical concepts as twice the depth of their LCS divided by the sum of their individual depths.",
        "Leacock and Chodorow (1998) instead use the length of the shortest path between two concepts as a proxy for the conceptual distance between them.",
        "To connect any two ideas in a hierarchical system, one must vertically ascend the hierarchy from one concept, change direction at a potential LCS, and then descend the hierarchy to reach the second concept.",
        "(Aristotle was also first to suggest this approach in his Poetics).",
        "Leacock and Chodorow normalize the length of this path by dividing its size (in nodes) by twice the depth of the deepest concept in the hierarchy; the latter is an upper bound on the distance between any two concepts in the hierarchy.",
        "Negat-ing the log of this normalized length yields a corresponding similarity score.",
        "While the role of an LCS is merely implied in Leacock and Cho-dorow's use of a shortest path, the LCS is pivotal nonetheless, and like that of Wu & Palmer, the approach uses an essentially vertical reasoning process to identify a single ?best?",
        "generalization.",
        "Depth is a convenient proxy for information content, but more nuanced proxies can yield",
        "more rounded similarity measures.",
        "Resnick (1995) draws on information theory to define the information content of a lexical concept as the negative log likelihood of its occurrence in a corpus, either explicitly (via a direct mention) or by presupposition (via a mention of any of its subcategories or instances).",
        "Since the likelihood of a general category occurring in a corpus is higher than that of any of its subcategories or instances, such categories are more predictable, and less informative, than rarer categories whose occurrences are less predictable and thus more informative.",
        "The negative log likelihood of the most informative LCS of two lexical concepts offers a reliable estimate of the amount of information shared by those concepts, and thus a good estimate of their similarity.",
        "Lin (1998) combines the intuitions behind Resnick's metric and that of Wu and Palmer to estimate the similarity of two lexical concepts as an information ratio: twice the information content of their LCS divided by the sum of their individual information contents.",
        "Jiang and Conrath (1997) consider the converse notion of dissimilarity, noting that two lexical concepts are dissimilar to the extent that each contains information that is not shared by the other.",
        "So if the information content of their most informative LCS is a good measure of what they do share, then the sum of their individual information contents, minus twice the content of their most informative LCS, is a reliable estimate of their dissimilarity.",
        "Seco et al. (2006) presents a minor innova-tion, showing how Resnick's notion of information content can be calculated without the use of an external corpus.",
        "Rather, when using Res-nick's metric (or that of Lin, or Jiang and Con-rath) for measuring the similarity of lexical concepts in WordNet, one can use the category structure of WordNet itself to estimate information content.",
        "Typically, the more general a concept, the more descendants it will possess.",
        "Seco et al. thus estimate the information content of a lexical concept as the log of the sum of all its unique descendants (both direct and indirect), divided by the log of the total number of concepts in the entire hierarchy.",
        "Not only is this intrinsic view of information content convenient to use, without recourse to an external corpus, Seco et al. show that it offers a better estimate of information content than its extrinsic, corpus-based alternatives, as measured relative to average human similarity ratings for the 30 word-pairs in the Miller & Charles (1991) test set.",
        "A similarity measure can draw on other sources of information besides WordNet's category structures.",
        "One might eke out additional information from WordNet's textual glosses, as in Lesk (1986), or use category structures other than those offered by WordNet.",
        "Looking beyond WordNet, entries in the online encyclopedia Wikipedia are not only connected by a dense topology of lateral links, they are also organized by a rich hierarchy of overlapping categories.",
        "Strube and Ponzetto (2006) show how Wikipedia can support a measure of similarity (and related-ness) that better approximates human judgments than many WordNet-based measures.",
        "Nonethe-less, WordNet can be a valuable component of a hybrid measure, and Agirre et al. (2009) use an SVM (support vector machine) to combine information from WordNet with information harvested from the web.",
        "Their best similarity measure achieves a remarkable 0.93 correlation with human judgments on the Miller & Charles word-pair set.",
        "Similarity is not always applied to pairs of concepts; it is sometimes analogically applied to pairs of pairs of concepts, as in proportional analogies of the form A is to B as C is to D (e.g., hacks are to writers as mercenaries are to sol-diers, or chisels are to sculptors as scalpels are to surgeons).",
        "In such analogies, one is really assessing the similarity of the unstated relationship between each pair of concepts: thus, mercenaries are soldiers whose allegiance is paid for, much as hacks are writers with income-driven loyalties; sculptors use chisels to carve stone, while surgeons use scalpels to cut or carve flesh.",
        "Veale (2004) used WordNet to assess the similarity of A:B to C:D as a function of the combined similarity of A to C and of B to D. In contrast, Tur-ney (2005) used the web to pursue a more divergent course, to represent the tacit relationships of A to B and of C to D as points in a high-dimensional space.",
        "The dimensions of this space initially correspond to linking phrases on the web, before these dimensions are significantly reduced using singular value decomposition.",
        "In the infamous SAT test, an analogy A:B::C:D has four other pairs of concepts that serve as likely distractors (e.g. singer:songwriter for hack:writer) and the goal is to choose the most appropriate C:D pair for a given A:B pair-ing.",
        "Using variants of Wu and Palmer (1994) on the 374 SAT analogies of Turney (2005), Veale (2004) reports a success rate of 38?44% using only WordNet-based similarity.",
        "In contrast, Tur-ney (2005) reports up to 55% success on the same analogies, partly because his approach aims",
        "to match implicit relations rather than explicit concepts, and in part because it uses a divergent process to gather from the web as rich a perspective as it can on these latent relationships.",
        "2.1 Clever Comparisons Create Similarity Each of these approaches to similarity is a user of information, rather than a creator, and each fails to capture how a creative comparison (such as a metaphor) can spur a listener to view a topic from an atypical perspective.",
        "Camac & Glucks-berg (1984) provide experimental evidence for the claim that ?metaphors do not use preexisting associations to achieve their effects [?]",
        "people use metaphors to create new relations between concepts.?",
        "They also offer a salutary reminder of an often overlooked fact: every comparison exploits information, but each is also a source of new information in its own right.",
        "Thus, ?this cola is acid?",
        "reveals a different perspective on cola (e.g. as a corrosive substance or an irritating food) than ?this acid is cola?",
        "highlights for acid (such as e.g., a familiar substance) Veale & Keane (1994) model the role of similarity in realizing the long-term perlocutionary effect of an informative comparison.",
        "For exam-ple, to compare surgeons to butchers is to encourage one to see all surgeons as more bloody, crude or careless.",
        "The reverse comparison, of butchers to surgeons, encourages one to see butchers as more skilled and precise.",
        "Veale & Keane present a network model of memory, called Sapper, in which activation can spread between related concepts, thus allowing one concept to prime the properties of a neighbor.",
        "To interpret an analogy, Sapper lays down new acti-vation-carrying bridges in memory between analogical counterparts, such as between surgeon & butcher, flesh & meat, and scalpel & cleaver.",
        "Comparisons can thus have lasting effects on how Sapper sees the world, changing the pattern of activation that arises when it primes a concept.",
        "Veale (2003) adopts a similarly dynamic view of similarity in WordNet, showing how an analogical comparison can result in the automatic addition of new categories and relations to WordNet itself.",
        "Veale considers the problem of finding an analogical mapping between different parts of WordNet's noun-sense hierarchy, such as between instances of Greek god and Norse god, or between the letters of different alphabets, such as of Greek and Hebrew.",
        "But no structural similarity measure for WordNet exhibits enough discernment to e.g. assign a higher similarity to Zeus & Odin (each is the supreme deity of its pantheon) than to a pairing of Zeus and any other Norse god, just as no structural measure will assign a higher similarity to Alpha & Aleph or to Beta & Beth than to any random letter pairing.",
        "A fine-grained category hierarchy permits fine-grained similarity judgments, and though WordNet is useful, its sense hierarchies are not especially fine-grained.",
        "However, we can automatically make WordNet subtler and more dis-cerning, by adding new fine-grained categories to unite lexical concepts whose similarity is not reflected by any existing categories.",
        "Veale (2003) shows how a property that is found in the glosses of two lexical concepts, of the same depth, can be combined with their LCS to yield a new fine-grained parent category, so e.g. ?su-preme?",
        "+ deity = Supreme-deity (for Odin, Zeus, Jupiter, etc.)",
        "and ?1st?",
        "+ letter = 1st-letter (for Alpha, Aleph, etc.)",
        "Selected aspects of the textual similarity of two WordNet glosses ?",
        "the key to similarity in Lesk (1986) ?",
        "can thus be reified into an explicitly categorical WordNet form.",
        "3 Divergent (Re)Categorization To tap into a richer source of concept properties than WordNet's glosses, we can use web n-grams.",
        "Consider these descriptions of a cowboy from the Google n-grams (Brants & Franz, 2006).",
        "The numbers to the right are Google frequency counts.",
        "a lonesome cowboy 432 a mounted cowboy 122 a grizzled cowboy 74 a swaggering cowboy 68 To find the stable properties that can underpin a meaningful fine-grained category for cowboy, we must seek out the properties that are so often presupposed to be salient of all cowboys that one can use them to anchor a simile, such as \"swag-gering like a cowboy?",
        "or ?as grizzled as a cow-boy?.",
        "So for each property P suggested by Google n-grams for a lexical concept C, we generate a like-simile for verbal behaviors such as swaggering and an as-as-simile for adjectives such as lonesome.",
        "Each is then dispatched to Google as a phrasal query.",
        "We value quality over size, as these similes will later be used to find diverse viewpoints on the web via bootstrapping.",
        "We thus manually filter each web simile, to weed out any that are ill-formed, and those intended to be seen as ironic by their authors.",
        "This gives us a body of 12,000+ valid web similes.",
        "Veale (2011, 2012, 2013) notes that web uses of the pattern ?as P as C?",
        "are rife with irony.",
        "In contrast, web instances of ?P S such as C?",
        "?",
        "where S denotes a superordinate of C ?",
        "are rarely ironic.",
        "Hao & Veale (2010) exploit this fact to filter ironic comparisons from web similes, by re-expressing each ?as P as C?",
        "simile as ?P * such as C?",
        "(using a wildcard * to match any values for S) and looking for attested uses of this new form on the web.",
        "Since each hit will also yield a value for S via the wildcard *, and a fine-grained category PS for C, we use this approach here to harvest fine-grained categories from the web from most of our similes.",
        "Once C is seen to be an exemplary member of the category P-S, such as cola in fizzy-drink, a targeted web search is used to find other members of P-S, via the anchored query ?P S such as * and C?.",
        "For example, ?fizzy drinks such as * and cola?",
        "will retrieve web texts in which * is matched to soda or lemonade.",
        "Each new member can then be used to instantiate a further query, as in ?fizzy drinks such as * and soda?, to retrieve other members of P-S, such as champagne and root beer.",
        "This bootstrapping process runs in successive cycles, using doubly-anchored patterns that ?",
        "following Kozareva et al. (2008) and Veale et al. (2009) ?",
        "explicitly mention both the category to be populated (P-S) and a recently acquired member of this category (C).",
        "As cautioned by Kozareva et al., it is reckless to bootstrap from members to categories to members again if each enfilade of queries is likely to return noisy results.",
        "A reliable filter must be applied at each stage, to ensure that any member C that is placed in a category PS is a sensible member of the category S. Only by filtering in this way can we stop the rapid accumulation of noise.",
        "For instance, a WordNet-based filter discards any categorization ?P S such as X and C?",
        "where X does not denote a WordNet entry for which S does not denote a valid hypernym.",
        "Such a filter offers no creative latitude, however, since it forces every pairing of C and PS to precisely obey WordNet's category hierarchy.",
        "We thus use instead the near-miss filter described in Veale et al. (2009), in which X must denote a descendant of some direct hypernym of some sense of S. The filter does not (and cannot) determine whether P is salient for X.",
        "It merely assumes that if P is salient for C, it is salient for X.",
        "Five successive cycles of bootstrapping are performed, using the 12,000+ web similes as a starting point.",
        "Consider cola: after 1 cycle, we acquire 14 new categories, such as effervescent-beverage and sweet-beverage.",
        "After 2 cycles we acquire 43 categories; after 3 cycles, 72; after 4 cycles, 93; and after 5 cycles, we acquire 102 fine-grained perspectives on cola, such as stimu-lating-drink and corrosive-substance.",
        "not organized as an explanatory system of hierarchical categories as it is in Thesaurus Rex.",
        "Rex-wn does no better than Seco et al. (2006) on the M&C dataset, suggesting that Rex's vectors of IC-weighted hypernyms are no more discerning than a single informative LCS.",
        "However, such vectors also permit Rex to incorporate addi-tional, fine-grained perspectives from Thesaurus Rex, allowing Rex-lat in turn to achieve a comparable correlation to that of Li et al. (2003) ?",
        ".89.",
        "Yet the formulation in (2) favors unusual or idiosyncratic perspectives that are unlikely to generalize across independent judges.",
        "The mean ratings of M&C are the stuff of consensus, not individual creativity, and outside the realm of creative metaphor it often makes sense to safely align our judgments with those of others.",
        "By limiting its use of Thesaurus Rex to the perspectives that other judges are most likely to use, Rex-pop obtains a correlation of .93 with mean human ratings on all 30 M&C pairs.",
        "This result is comparable to that reported by Agirre et al. (2009), who use SVM-based supervised learning to combine the judgments of two met-rics, one based on WordNet and another on the analysis of web contexts of both input terms.",
        "However, Rex has the greater capacity for in-sight, since it augments the structured category system of WordNet with structured categories of its own.",
        "At each level of the WordNet hierarchy, Rex finds the fine-grained category that can best inform its judgments.",
        "Because Rex makes highly selective use of the diverse products of lateral thinking, this selectivity also produces concise explanations for its judgments.",
        "5.1 Generative Uses of Similarity A similarity metric offers a numerical measure of how closely one idea can cluster with another.",
        "It can also indicate how well one object may serve as a substitute for another, as when a letter opener is used as a knife, or tofu is used instead of meat.",
        "This need for substitution can be grist for creativity, yet most similarity metrics can only assess a suggested substitution, rather than suggest one for themselves.",
        "If they are to actively shape a creative decision, our similarity metrics must be made more generative.",
        "A similarity metric can learn to be generative, by observing how people typically cluster words and ideas that are made similar by their contexts of use.",
        "The Google 3-grams contain many instances of the clustering pattern ?X+s and Y+s?, as in ?cowboys and pirates?",
        "or ?doctors and law-yers?, and so a comprehensive trawl yields many insights into the pairings of ideas that we implicitly see as comparable.",
        "We harvest all such Google 3-grams, to build a symmetric comparability graph in which any two comparable terms are adjacent nodes.",
        "For any node, we can generate a diverse set of comparable ideas just by reading off its adjacent nodes.",
        "Thesaurus Rex can be used to find an embracing category for many such pairs of nodes, while Rex estimates the similarity of any two adjacent nodes.",
        "A comparability graph of 28,000 nodes is produced from the Google 3-grams, with a sparse adjacency matrix of just 1,264,827 (0.16%) non-zero entries.",
        "Is this dense enough for a task requiring generative similarity?",
        "Almuhareb & Poesio (2004) describe one such task: they sample 214 words from across 13 WordNet categories, and ask if these 214 words can be partitioned into 13 clusters that mirror the WordNet categories from which they were drawn.",
        "They then collect tens of thousands of web contexts for these 214 words, to extract a feature representation of each.",
        "We instead use Rex to generate, as features, a diverse set of comparable terms for each word.",
        "(We also assume that each word is a feature of itself).",
        "The Rex comparability graph suggests a pool of 8,300 features for all 214 words.",
        "The clustering toolkit CLUTO is used to partition the original 214 words into 13 clusters guided only by these comparability features.",
        "The resulting 13 clusters have an average purity of 93.4% relative to WordNet, suggesting that categorization tasks which require implicit comparability judgments are well served by a generative approach to similarity.",
        "5.2 Learning From Similarity Judgments Rex augments the narrow worldview of WordNet with the more diverse viewpoints it gleans from the web, not by viewing them as separate knowledge sources, but by actually updating WordNet itself.",
        "The relative performance of Rex-pop > Rex-lat > Rex-wn on the M&C dataset shows that selective use of a divergent perspective permits WordNet to better serve its popular role as a judge of similarity.",
        "It is worth asking then whether these passing additions to WordNet should not be made permanent.",
        "Rex estimates a similarity score for each of the 1,264,827 pairings of comparable terms it finds in the Google 3-grams.",
        "These scores are then cached to support generative similarity, and to permit fast lookup of scores for common com-parisons.",
        "This lookup table is a lightweight means of using Rex in a range of creative substitution or generation tasks.",
        "Though the table is"
      ]
    }
  ]
}
