{
  "info": {
    "authors": [
      "Seniz Demir",
      "Ilknur Durgar El-Kahlout",
      "Erdem Unal"
    ],
    "book": "ENLG",
    "id": "acl-W13-2126",
    "title": "A Case Study Towards Turkish Paraphrase Alignment",
    "url": "https://aclweb.org/anthology/W13-2126",
    "year": 2013
  },
  "references": [
    "acl-C10-1149",
    "acl-D12-1066",
    "acl-I05-5010",
    "acl-N06-1003",
    "acl-P02-1040",
    "acl-W03-1601",
    "acl-W06-1603",
    "acl-W07-0734",
    "acl-W10-4223"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Paraphrasing is expressing the same semantic content using different linguistic means.",
        "Although previous work has addressed linguistic variations at different levels of language, paraphrasing in Turkish has not been yet thoroughly studied.",
        "This paper presents the first study towards Turkish paraphrase alignment.",
        "We perform an analysis of different types of paraphrases on a modest Turkish paraphrase corpus and present preliminary results on that analysis from different standpoints.",
        "We also explore the impact of human interpretation of paraphrasing on the alignment of paraphrase sentence pairs."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Paraphrases are alternative linguistic expressions that convey the same content.",
        "Natural languages allow linguistic variations at different levels (e.g., lexical and phrasal) and a change at a level of language may trigger other changes at different levels.",
        "Paraphrasing has attracted a growing interest from the research community in a broad range of tasks such as language generation (Power and Scott, 2005), machine translation (Callison-Burch et al., 2006), and question answering (France et al., 2003).",
        "Moreover, research on acquisition (Max et al., 2012), generation (Zhao et al., 2010), and recognition (Qiu et al., 2006) of paraphrases has been on the rise for the last decade.",
        "Paraphrasing is also an increasingly studied problem by the generation community.",
        "One particular text-to-text generation problem being addressed is the generation of sentence-level paraphrases by converting a sentence into a new one with approximately the same meaning (Wubben et al., 2010).",
        "One aspect of paraphrasing is the specification of paraphrase types via a typology.",
        "Building paraphrase typologies from different perspectives (e.g., linguistics analysis and discourse analysis) has been an active research area for a number of years now (Vila et al., 2011).",
        "In particular, linguistic grounds govern the typologies built by language processing systems (Kozlowski et al., 2003) which are often very generic or system specific.",
        "Research on paraphrase alignment focuses on identifying links between semantically related word strings.",
        "Such monolingual alignments can be later used as training data for several natural language processing approaches (e.g., textual entailment and multidocument summarization) (Thadani et al., 2012).",
        "Although a wealth amount of research has studied various problems related to Turkish, we here focus on a problem which has not been studied earlier.",
        "We present our initial explorations on Turkish paraphrase alignment by considering how alignment is affected by human interpretation of paraphrasing.",
        "We conducted a study on a modest corpus from four different sources to investigate answers to the following questions: i) What are the types of paraphrases that can be observed at different levels of Turkish?",
        "ii) Do humans agree on the existence of paraphrasing between Turkish paraphrase sentences?",
        "iii) How does human interpretation of paraphrasing affect the alignment of paraphrase sentences?",
        "Our study is unique in that it presents a generic typology of paraphrase types found in our Turkish paraphrase corpus and discusses the agreement of human annotators on the identification and classification of observed correspondences between paraphrases.",
        "This study also presents our aggregated observations on the relation between interpretation and alignment of paraphrase casts."
      ]
    },
    {
      "heading": "2 Paraphrase Corpora",
      "text": [
        "The Turkish paraphrase corpus (Demir et al., 2012) comprises 1270 paraphrase pairs from four different sources: i) translations of a literary text, ii) multiple reference translations of English tourism-related sentences, iii) news articles, and iv) subtitles of a movie.",
        "We measured sentence similarities of all paraphrase pairs from each domain via three measures typically used in statistical machine translation evaluations: TER (Matthew Snover, 2006), BLEU (Papineni et al., 2002), and METEOR (Lavie and Agar-wal, 2007).",
        "As shown in Figure 1, the ordering of domains with respect to all metrics are the same where the pairs from the news domain and those from the parallel corpus are the most and the least similar pairs respectively.",
        "Since there are divergences across different domains, we randomly drew from each domain an equal number of sentences (i.e., 100 paraphrase pairs1).",
        "Some characteristic features of the paraphrase pairs selected for this study are shown in Table 1."
      ]
    },
    {
      "heading": "3 Paraphrase Typology",
      "text": [
        "To our best knowledge, a Turkish paraphrase typology that we can apply to this study does not yet exist in the literature.",
        "On the other hand, building a comprehensive typology is not one of our objectives.",
        "There are a number of available typologies built for English (Dras, 1999; Vila et al., 2011).",
        "Since our focus in this work is on characterizing paraphrasing at different levels of language, we greatly drew from the linguistically-motivated typology by Vila et al. (2011) while building our generic typology.",
        "We examined the selected 400 paraphrase pairs and constructed a typology that covers all paraphrases occurring within these pairs.",
        "Our typology covers three levels of language and consists of four classes.",
        "1The number of paraphrase pairs in the subtitle domain limits the study to 100 pairs from each domain.",
        "The lexical class covers all changes that arise from exchanging words within a phrase with other words and includes four subclasses (i.e., substitution, substitution with opposite polarity,",
        "deletion, and pronominalization)2 : (1) ?Su bize takip edebileceg?imiz hic?bir1 iz1 b?rakm?yor1.?",
        "(Water leaves1 no1 trace1 that we can follow.)",
        "(2) ?Su olay?n takip edilebilecek bu?tu?n1 izlerini1 yok1 ediyor1.?",
        "(The water destroys1 all1 traces1",
        "of the event that can be followed.)",
        "The morphological class covers inflectional and derivational changes within words and includes two subclasses (i.e., inflectional changes and derivational changes):",
        "(1) ?Bo?yle bir ilac?",
        "almaktansa hasta1 kalmak1 iyidir.?",
        "(Staying1 sick1 is better than taking such a drug.)",
        "(2) ?Hasta1 kal?r?m1 da yine de bu ilac?",
        "ic?mem.?",
        "(I1 stay1 sick1 still I don't take this drug.)",
        "The phrasal class includes changes that arise from exchanging fragments with same meaning: 1) ?Bunlar?",
        "biliyorum fakat emri ben1 vermedim1.?",
        "(I know all that, but I1 did1 not1 give1 the order.)",
        "(2) ?Bunlar?",
        "biliyorum ama, emri veren1 ben1 deg?ilim1.?",
        "(I know all that, but I?m1 not1 the1 one1 who1 gave1 the order.)",
        "The other class is for all other changes that imply different lexicalizations for the same contextual meaning: (1) ?Savas?",
        "c?",
        "?k?nca pek c?ok c?ingene eskilerdeki gibi ko?tu?1 kis?iler1 oldular1.?",
        "(When war broke out, many gypsies became1 just1 as bad1 people1 as those of the past.)",
        "(2) ?Savas?ta birc?ok c?ingene eskiden oldug?u gibi",
        "Although these classes are language independent, they include several Turkish specific aspects such as morphophonemic processes.",
        "For instance, Turkish word changes due to vowel harmony, vowel drops, and consonant drops/changes are all covered by the morphological class."
      ]
    },
    {
      "heading": "4 Paraphrase Alignment",
      "text": [
        "While manually aligning the paraphrase sentence pairs, our goal was to jointly identify the paraphrase casts (i.e., the substitutable word strings) and specify the types correspondences between them.",
        "We asked three native speakers to align the selected paraphrase sentences by aligning word strings3 as much as possible and marking the strength of observed correspondences as either ?certain?",
        "(the correspondences that hold in any context) or ?possible?",
        "(the correspondences that are context-specific).",
        "The annotators were also told to assign each identified correspondence between paraphrase casts to one of the classes in our typology.",
        "In cases where the same word strings were aligned, the correspondence was not classified with a class from the typology.",
        "Before aligning the corpus, the annotators were trained on a different set of paraphrases using an annotation guideline.",
        "Table 2 reports some statistics of the alignment process.",
        "The column labelled as ?Common?",
        "represents the alignments common to all annotators.",
        "The rows labelled as ?C?, ?P?, and ?U?",
        "represent the number of certain and possible alignments, and the number of unaligned words respectively4.",
        "It is noteworthy that the percentage of common certain alignments is significantly higher than the percentage of common possible alignments in all domains."
      ]
    },
    {
      "heading": "5 Corpus Study Findings",
      "text": [
        "In this study, we aim to explore whether humans agree on the existence (i.e., identifying two word strings as paraphrases) and type of paraphrasing between Turkish paraphrase sentences.",
        "We are also interested in how the alignment of paraphrase casts is affected from human interpretation of paraphrasing between Turkish para",
        "phrase sentences.",
        "Please note that the alignment of paraphrase casts consequently affects the sentence alignment of paraphrase sentence pairs.",
        "Our analysis started with examining how often our annotators agreed on identifying paraphrasing between two word strings.",
        "The agreement scores in Table 3 show that the annotators (pairwise) had a reasonable level of agreement in all domains.",
        "In majority of these cases, the annotators also agreed on the strength of the correspondence (i.e., both annotators either classified the correspondence as",
        "The agreement scores in Table 3 show the agreement of annotators on the fact that two word strings are paraphrases and thus should be aligned.",
        "But it does not mean that the reason behind similar identifications is the same.",
        "We thus explored whether the annotators similarly classified the word strings that they identified as paraphrases.",
        "In all domains, the agreement scores between the annotators (given in Table 4) are dramatically lower than the scores in Table 3.",
        "It is particularly noteworthy that the smallest drop is observed in the parallel corpus domain (the domain that contains the least similar sentences).",
        "In cases where the annotators (pairwise) classified the same word strings with the same paraphrase class, they had a high agreement (between 78% and 91%) on the strength of the correspondence in all domains.",
        "We also computed the inter-annotator agreement via Kappa (Cohen, 1960).",
        "Kappa scores (shown bold in Table 4) represent fair to good agreement be",
        "Figure 2 presents the distribution of paraphrase classes identified by each annotator across different domains.",
        "Notably, the identified paraphrase classes between word strings appear to diverge in several respects.",
        "We are currently exploring the reason behind this poor annotator agreement on paraphrase classes.",
        "One possible reason might be different understanding of the typology.",
        "As a second step, we explored the impact of different interpretations of paraphrasing between sentence pairs on the alignment of these sentences.",
        "We analyzed the alignment differences of sentences and classified them into four classes: - Different Classification: Although both annotators identify the same correspondence between two word strings, they classify that correspondence differently.",
        "- Missing Alignment: One annotator identifies an alignment between two word strings but the other annotator does not identify a correspondence between these word strings.",
        "- Missing Word: The annotators identify a correspondence of the same paraphrase class between two word strings which differ only in one word.",
        "- Different Grouping: Two word strings are identified as having a single correspondence by one annotator whereas a number of disjoint correspondences between these word strings are identified by the other annotator.",
        "All these differences except those classified as ?different classification?",
        "result in different alignments between word strings.",
        "Such different alignments of paraphrase casts then change the alignment of paraphrase sentences."
      ]
    },
    {
      "heading": "6 Conclusion and Future Work",
      "text": [
        "In this paper, we present our initial explorations on Turkish paraphrase alignment by exploiting a modest corpus.",
        "We built a generic and linguistically grounded Turkish paraphrase typology that covers the types of paraphrases observed in the corpus.",
        "In the study, the paraphrases identified by human annotators were aligned and annotated with paraphrase classes from the typology.",
        "The agreement of the annotators with respect to the existence and alignment of paraphrases as well as the associated paraphrase classes were reported.",
        "The study showed that the way how humans interpret paraphrasing between Turkish paraphrase sentences has an impact on how they align these sentences.",
        "We have two main directions for future research: i) conducting a larger corpus study for drawing generalizations about Turkish paraphrasing and enhancing the typology if necessary, and ii) building Turkish paraphrase applications (e.g., automatic paraphrase acquisition) in correlation with the collected insights.",
        "We believe that the current findings for Turkish paraphrase alignment and our corpus enriched with paraphrase types enable future research on paraphrase phenomena in different fields such as language generation, textual entailment, summarization, and machine translation to be empirically assessed."
      ]
    }
  ]
}
