{
  "info": {
    "authors": [
      "Adam Vogel",
      "Max Bodoia",
      "Christopher Potts",
      "Daniel Jurafsky"
    ],
    "book": "NAACL",
    "id": "acl-N13-1127",
    "title": "Emergence of Gricean Maxims from Multi-Agent Decision Theory",
    "url": "https://aclweb.org/anthology/N13-1127",
    "year": 2013
  },
  "references": [
    "acl-D10-1040",
    "acl-J12-1006",
    "acl-J80-3003",
    "acl-J86-3001",
    "acl-P05-3001"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Grice characterized communication in terms of the cooperative principle, which enjoins speakers to make only contributions that serve the evolving conversational goals.",
        "We show that the cooperative principle and the associated maxims of relevance, quality, and quantity emerge from multi-agent decision theory.",
        "We utilize the Decentralized Partially Observable Markov Decision Process (Dec-POMDP) model of multi-agent decision making which relies only on basic definitions of rationality and the ability of agents to reason about each other's beliefs in maximizing joint utility.",
        "Our model uses cognitively-inspired heuristics to simplify the otherwise intractable task of reasoning jointly about actions, the environment, and the nested beliefs of other actors.",
        "Our experiments on a cooperative language task show that reasoning about others?",
        "belief states, and the resulting emergent Gricean communicative behavior, leads to significantly improved task performance."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Grice (1975) famously characterized communication among rational agents in terms of an overarching cooperative principle and a set of more specific maxims, which enjoin speakers to make contributions that are truthful, informative, relevant, clear, and concise.",
        "Since then, there have been many attempts to derive the maxims (or perhaps just their effects) from more basic cognitive principles concerning how people make decisions, formulate plans, and collaborate to achieve goals.",
        "This research traces to early work by Lewis (1969) on signaling systems.",
        "It has recently been the subject of extensive theoretical discussion (Clark, 1996; Merin, 1997; Blutner, 1998; Parikh, 2001; Beaver, 2002; van Rooy, 2003; Benz et al., 2005; Franke, 2009) and has been tested experimentally using one-step games in which the speaker produces a message and the hearer ventures a guess as to its intended referent (Rosenberg and Cohen, 1964; Dale and Reiter, 1995; Golland et al., 2010; Stiller et al., 2011; Frank and Goodman, 2012; Krahmer and van Deemter, 2012; Degen and Franke, 2012; Rohde et al., 2012).",
        "To date, however, these theoretical models and experiments have not been extended to multi-step interactions extending over time and involving both language and action together, which leaves this work relatively disconnected from research on planning and goal-orientation in artificial agents (Perrault and Allen, 1980; Allen, 1991; Grosz and Sidner, 1986; Bratman, 1987; Hobbs et al., 1993; Allen et al., 2007; DeVault et al., 2005; Stone et al., 2007; DeVault, 2008).",
        "We attribute this in large part to the complexity of Gricean reasoning itself, which requires agents to model each other's belief states.",
        "Tracking these as they evolve over time in response to experiences is extremely demanding.",
        "Our approach complements slot-filling dialog systems, where the focus is on managing speech recognition uncertainty (Young et al., 2010; Thomson and Young, 2010).",
        "However, recent years have seen significant advances in multi-agent decision-theoretic models and their efficient implementation.",
        "With the current paper, we seek to show that the Decentralized Par",
        "tially Observable Markov Decision Process (Dec-POMDP) provides a robust, flexible foundation for implementing agents that communicate in a Gricean manner.",
        "Dec-POMDPs are multi-agent, partially-observable models in which agents maintain belief distributions over the underlying, hidden world state, including the beliefs of the other players, and speech actions change those beliefs.",
        "In this setting, informative, relevant communication emerges as the best way to maximize joint utility.",
        "The complexity of pragmatic reasoning is still forbidding, though.",
        "Correspondingly, optimal decision making in Dec-POMDPs is NEXP complete (Bernstein et al., 2002).",
        "To manage this issue, we introduce several cognitively-plausible approximations which allow us to simplify the Dec-POMDP to a single-agent POMDP, for which relatively efficient solvers exist (Spaan and Vlassis, 2005).",
        "We demonstrate our algorithms on a variation of the Cards task, a partially-observable collaborative search problem (Potts, 2012).",
        "Spatial language comprises the bulk of communication in the Cards task, and we discuss a model of spatial semantics in Section 3.",
        "Using this task and a model of the meaning of spatial language, we next discuss two agents that play the game: ListenerBot (Section 4) makes decisions using a single-agent POMDP that does not take into account the beliefs or actions of its partner, whereas DialogBot (Section 5) maintains a model of its partner's beliefs.",
        "As a result of the cooperative structure of the underlying model and the effects of communication within it, DialogBot's contributions are relevant, truthful, and informative, which leads to significantly improved task performance."
      ]
    },
    {
      "heading": "2 The Cards Task and Corpus",
      "text": [
        "The Cards corpus consists of 1,266 transcripts1 from an online, two-person collaborative game in which two players explore a maze-like environment, communicating with each other via a text chat window (Figure 1).",
        "A deck of playing cards has been distributed randomly around the environment, and the players?",
        "task is to find six consecutive cards of the same suit.",
        "Our implemented agents solve a simplified version of this task in which the two agents",
        "window are at the top.",
        "This board, the one we use throughout, consists of 231 open grid squares.",
        "must both end up co-located with a single card, the Ace of Spades (AS).",
        "This is much simpler than the six-card version from the human?human corpus, but it involves the same kind of collaborative goal and forces our agents to deal with the same kind of partial knowledge about the world as the humans did.",
        "Each agent knows its own location, but not his partner?s, and a player can see the AS only when co-located with it.",
        "The agents use (simplified) English to communicate with each other."
      ]
    },
    {
      "heading": "3 Spatial Semantics",
      "text": [
        "Much of the communication in the Cards task involves referring to spatial locations on the board.",
        "Accordingly, we focus on spatial language for our artificial agents.",
        "In this section, we present a model of spatial semantics, which we create by leveraging the human?human Cards transcripts.",
        "We discuss the spatial semantic representation, how we classify the semantics of new locative expressions, and our use of spatial semantics to form a high-level state space for decision making."
      ]
    },
    {
      "heading": "3.1 Semantic Representation",
      "text": [
        "Potts (2012) released annotations, derived from the Cards corpus, which reduce 599 of the players?",
        "statements about their locations to formulae of the form ?",
        "(?1 ?",
        "??",
        "?",
        "?",
        "?k), where ?",
        "is a domain and ?1, .",
        ".",
        ".",
        ",?k are semantic literals.",
        "For example, the utterance ?",
        "(I?m) at the top right of the board?",
        "is annotated as BOARD(top?",
        "right), and ?",
        "(I?m) in bottom",
        "of the C room?",
        "is annotated as C room(bottom).",
        "Table 1 lists the full set of semantic primitives that appear as domain expressions and literals.",
        "Because the Cards transcripts are so highly structured, we can interpret these expressions in terms of the Cards world itself.",
        "For a given formula ?",
        "= ?",
        "(?1 ?",
        "??",
        "?",
        "?",
        "?k), we compute the number of times that a player identified its location with (an utterance translated as) ?",
        "while standing on grid square (x,y).",
        "These counts are smoothed using a simple 2D-smoothing scheme, detailed in (Potts, 2012), and normalized in the usual manner to form a distribution over board squares Pr((x,y)|?).",
        "These grounded interpretations are the basis for communication between the artificial agents we define in Section 4.",
        "BOARD, SQUARE, right, middle, top, left, bottom, corner, approx, precise, entrance, C room, hall, room, sideways C, loop, reverse C, U room, T room, deadend, wall, sideways F"
      ]
    },
    {
      "heading": "3.2 Semantics Classifier",
      "text": [
        "Using the corpus examples of utterances paired with their spatial semantic representations, we learn a set of classifiers to predict a spatial utterance's semantic representation.",
        "We train a binary classifier for each semantic primitive ?i using a log-linear model with simple bag of words features.",
        "The words are not normalized or stemmed and we use whitespace tok-enization.",
        "We additionally train a multi-class classifier for all possible domains ?",
        ".",
        "At test time, we use the domain classifier and each primitive binary classifier to produce a semantic representation."
      ]
    },
    {
      "heading": "3.3 Semantic State Space",
      "text": [
        "The decision making algorithms that we discuss in Section 4 are highly sensitive to the size of the state space.",
        "The full representation of the game board consists of 231 squares.",
        "Representing the location of both players and the location of the card requires 3233 = 12,326,391 states, well beyond the capabilities of current decision-making algorithms.",
        "To ameliorate this difficulty, we cluster squares together using the spatial referring expression cor",
        "pus.",
        "This approach follows from research that shows that humans?",
        "mental spatial representations are influenced by their language (Hayward and Tarr, 1995).",
        "Our intuition is that human players do not consider all possible locations of the card and players, but instead lump them into semantically coherent states, such as ?the card is in the top right corner.?",
        "Following this intuition, we cluster states together which have similar referring expressions, allowing our agents to use language as a cognitive technology and not just a tool for communication.",
        "For each board square (x,y) we form a vector ?",
        "(x,y) with ?i(x,y) = Pr((x,y)|?i), where ?i is the ith distinct semantic representation in the corpus.",
        "This forms a 136-dimensional vector for each board square.",
        "We then use k-means clustering with a Euclidean distance metric in this semantic space to cluster states which are referred to similarly.",
        "Figure 2 shows a clustering for k = 16 which we utilize for the remainder of the paper.",
        "Denoting the board regions by {1, .",
        ".",
        ".",
        ",Nregions}, we compute the probability of an expression ?",
        "referring to a region r by averaging over the squares in the region:"
      ]
    },
    {
      "heading": "4 ListenerBot",
      "text": [
        "We first introduce ListenerBot, an agent that does not take into account the actions or beliefs of its partner.",
        "ListenerBot decides what actions to take using a Partially Observable Markov Decision Process (POMDP).",
        "This allows ListenerBot to track its beliefs about the location of the card and to incorporate linguistic advice.",
        "However, ListenerBot does not produce utterances.",
        "A POMDP is defined by a tuple (S,A,T,O,?,R,b0,?).",
        "We explicate each component with examples from our task.",
        "Figure 3(a) provides the POMDP influence diagram.",
        "States S is the finite state space of the world.",
        "The state space S of ListenerBot consists of the location of the player p and the location of the card c. As discussed above in Section 3.3, we cluster squares of the board into Nregions semantically coherent regions, denoted by {1, .",
        ".",
        ".",
        ",Nregions}.",
        "The state space over these regions is defined as",
        "Two regions r1 and r2 are called adjacent, written adj(r1,r2), if any of their constituent squares touch.",
        "Actions A is the set of actions available to the agent.",
        "ListenerBot can only take physical actions and has no communicative ability.",
        "Physical actions in our region-based state space are composed of two types: traveling to a region and searching a region.",
        "?",
        "travel(r): travel to region r ?",
        "search: player exhaustively searches the current region Transition Distributions The transition distribution T (s?|a,s) models the dynamics of the world.",
        "This represents the ramifications of physical actions such as moving around the map.",
        "For a state s = (p,c) and action a = travel(r), the player moves to region r if it is adjacent to p, and otherwise stays in the same place:",
        "Search actions are only concerned with observations and do not change the state of the world:2",
        "The travel and search high-level actions are translated into low-level (up, down, left, right) actions using a simple A?",
        "path planner.",
        "Observations Agents receive observations from a set O according to an observation distribution",
        "1[Q] is the indicator function, which is 1 if proposition Q is true and 0 otherwise.",
        "?(o|s?,a).",
        "Observations include properties of the physical world, such as the location of the card, and also natural language utterances, which serve to indirectly change agents?",
        "beliefs about the world and the beliefs of their interlocutors.",
        "Search actions generate two possible observations: ohere and o?here, which denote the presence or absence of the card from the current region.",
        "Travel actions do not generate meaningful observations: ?",
        "(o?here|(p ?,c?",
        "), travel) = 1 Linguistic Advice We model linguistic advice as another form of observation.",
        "Agents receive messages from a finite set ?, and each message ?",
        "?",
        "?",
        "has a semantics, or distribution over the state space Pr(s|?).",
        "In the Cards task, we use the semantic distributions defined in Section 3.",
        "To combine the semantics of language with the standard POMDP observation model, we apply Bayes?",
        "rule:",
        "The prior, Pr(?",
        "), can be derived from corpus data.",
        "By treating language as just another form of observation, we are able to leverage existing POMDP solution algorithms.",
        "This approach contrasts with previous work on communication in Dec-POMDPs, where agents directly share their perceptual observations (Pynadath and Tambe, 2002; Spaan et al., 2008), an assumption which does not fit natural language.",
        "Reward The reward function R(s,a) : S?",
        "R represents the goals of the agent, who chooses actions to maximize reward.",
        "The goal of the Cards task is for both players to be on top of the card, so any action that leads to this state receives a high reward R+.",
        "All other actions receive a small negative reward R?, which gives agents an incentive to finish the task as quickly as possible.",
        "Lastly, ?",
        "?",
        "[0,1) is the discount factor, specifying the trade-off between immediate and future rewards.",
        "full Dec-POMDP (b), both agents receive individual observations and choose actions independently.",
        "Optimal decision making requires tracking all possible histories of beliefs of the other agent.",
        "In diagram (c), DialogBot approximates the full Dec-POMDP as single-agent POMDP.",
        "At each time step, DialogBot marginalizes out the possible observations o?",
        "that ListenerBot received, yielding an expected belief state b?.",
        "Initial Belief State The initial belief state, b0 ?",
        "?",
        "(S), is a distribution over the state space S. ListenerBot begins each game with a known initial location p0 but a uniform distribution over the location of the card c:",
        "Belief Update and Decision Making The key decision making problem in POMDPs is the construction of a policy pi : ?(S)?",
        "A, a function from beliefs to actions which dictates how the agent acts.",
        "Decision making in POMDPs proceeds as follows.",
        "The world starts in a hidden state s0 ?",
        "b0.",
        "The agent executes action a0 = pi(b0).",
        "The underlying hidden world state transitions to s1 ?",
        "T (s?|a0,s0), the world generates observation o0 ?",
        "?",
        "(o|s1,a0), and the agent receives reward R(s0,a0).",
        "Using the observation o0, the agent constructs a new belief b1 ??",
        "(S) using Bayes?",
        "rule:",
        "This process is referred to as belief update and is analogous to the forward algorithm in HMMs.",
        "To incorporate communication into the standard POMDP model, we consider observations (o,?)",
        "?",
        "O ?",
        "?",
        "which are a combination of a perceptual observation o and a received message ?",
        ".",
        "The semantics of the message ?",
        "is included in the belief update equation using Pr(s|?",
        "), derived in Equation 1:",
        "Using this new belief state b1, the agent selects an action a1 = pi(b1), and the process continues.",
        "An initial belief state b0 and a policy pi together define a Markov chain over pairs of states and actions.",
        "For a given policy pi , we define a value function V pi : ?(S)?",
        "R which represents the expected discounted reward with respect to that",
        "The goal of the agent is find a policy pi?",
        "which maximizes the value of the initial belief state:",
        "Exact computation of pi?",
        "is PSPACE-complete (Pa-padimitriou and Tsitsiklis, 1987), making approximation algorithms necessary for all but the simplest problems.",
        "We use Perseus (Spaan and Vlassis, 2005), an anytime approximate point-based value it",
        "eration algorithm."
      ]
    },
    {
      "heading": "5 DialogBot",
      "text": [
        "We now introduce DialogBot, a Cards agent which is capable of producing linguistic advice.",
        "To decide when and how to speak, DialogBot maintains a distribution over its partner's beliefs and reasons about the effects his utterances will have on those beliefs.",
        "To handle these complexities, DialogBot models the world as a Decentralized Partially Observable"
      ]
    },
    {
      "heading": "Markov Decision Process (Dec-POMDP) (Bernstein",
      "text": [
        "et al, 2002).",
        "See Figure 3(b) for the influence diagram.",
        "The definition of Dec-POMDPs mirrors that of the POMDP, with the following changes.",
        "There is a finite set I of agents, which we restrict to two.",
        "Each agent takes an action ai at each time step, forming a joint action ~a = (a1,a2).",
        "Each agent receives its own observation oi according to ?(o1,o2|a1,a2,s?).",
        "The transition distributions T (s?|a1,a2,s) and the reward R(s,a1,a2) both depend on both agents?",
        "actions.",
        "Optimal decision making in Dec-POMDPs requires maintaining a probability distribution over all possible sequences of actions and observations (a?1, o?1, .",
        ".",
        ".",
        ", a?t , o?t) that the other player might have received.",
        "As t increases, we have an exponential increase in the belief states an agent must consider.",
        "Confirming this informal intuition, decision making in Dec-POMDPs is NEXP-complete, a complexity class above P-SPACE (Bernstein et al., 2002).",
        "This computational complexity limits the application of Dec-POMDPs to very small problems.",
        "To address this difficulty we make several simplifying assumptions, allowing us to construct a single-agent POMDP which approximates the full Dec-POMDP.",
        "Firstly, we assume that other agents do not take into account our own beliefs, i.e., the other agent acts like a ListenerBot.",
        "This bypasses the infinitely nested belief problem by assuming that other agents track one less level of nested beliefs, a common approach (Goodman and Stuhlmu?ller, 2012; Gmy-trasiewicz and Doshi, 2005).",
        "Secondly, instead of tracking the full tree of possible observation histories, we maintain a point estimate b?",
        "of the other agent's beliefs, which we term the expected belief state.",
        "Rather than tracking each possible observation/action history of the other agent, at each time step we marginalize out the observations they could have received.",
        "Figure 4 compares this approach with exact belief update.",
        "Thirdly, we assume that the other agent acts according to a variant of the QMDP approximation (Littman et al., 1995).",
        "Under this approximation, the other agent solves a fully-observable MDP version of the ListenerBot POMDP, yielding an MDP policy p?i : S?",
        "A.",
        "This critically allows us to approximate the other agent's belief update using a specially formed POMDP, which we detail next.",
        "State Space To construct the approximate single-agent POMDP from the full Dec-POMDP problem, we formulate the state space as S?",
        "S. (See Figure 3(c) for the influence diagram.)",
        "We write a state (s, s?)",
        "?",
        "S?",
        "S, where s is DialogBot's beliefs about the true state of the world, and s?",
        "is DialogBot's estimate of the other agent's beliefs.",
        "Transition Distribution The main difficulty in constructing the approximate single-agent POMDP is specifying the transition distribution T ((s?, s??",
        ")|a,(s, s?)).",
        "To address this, we break this distribution into two components: T ((s?, s??",
        ")|a,(s, s?))",
        "= T?",
        "(s?",
        "?|s?,a,(s, s?",
        "))T (s?|a,s, s?).",
        "The first term dictates how DialogBot updates its beliefs about the other agent's beliefs:",
        "?(o?|s?",
        "?,a, p?i(s?",
        "))T (s?",
        "?|a, p?i(s?",
        "), s?)",
        "?s????(o?|s??",
        "?,a, p?i(s?",
        "))T (s??",
        "?|a, p?i(s?",
        "), s?)",
        "??",
        "(o?|s?,a, p?i(s?))",
        ") We sum over all observations o?",
        "the other agent could have received, updating our probability of s??",
        "as ListenerBot would have, multiplied by the probability that ListenerBot would have received that observation, ?",
        "(o?|s?, p?i(s?)).",
        "The QMDP approximation allows us to simulate ListenerBot's belief update in T?",
        "(s?",
        "?|s?,a,(s, s?)).",
        "Exact belief update would require access to b?",
        ": by using p?i(s?)",
        "we can estimate the action that ListenerBot would have taken.",
        "In cases where s?",
        "contradicts s such that for all o?",
        "either ?",
        "(o?|s?, p?i(s?))",
        "= 0 or ?(o?|s?",
        "?, p?i(s?))",
        "= 0, we redistribute the belief mass uniformly: T?",
        "(s?",
        "?|s?,a,(s, s?",
        "))?",
        "a belief state.",
        "In exact tracking (a), the agent tracks every possible history of observations that its partner could have received, which grows exponentially in time.",
        "In approximate update (b), the agent considers each possible observation and then averages the resulting belief states, weighted by the probability the other agent received that observation, resulting in a single summary belief state b?t+1.",
        "Under the QMDP approximation, the agent considers what action the other agent would have taken if it completely believed the world was in a certain state.",
        "Thus, there are four belief states resulting from b?t , as opposed to two in the exact case.",
        "1 ?s??",
        "6= s?.",
        "This approach to managing contradiction is analogous to logical belief revision (Alchourrono?n et al., 1985; Ga?rdenfors, 1988; Ferme?",
        "and Hansson, 2011).",
        "Speech Actions Speech actions are modeled by how they change the beliefs of the other agent.",
        "The effects of a speech actions are modeled in T?",
        "(s?",
        "?|s?,a,(s, s?",
        ")), our model of how ListenerBot's beliefs change.",
        "For a speech action a = say(?)",
        "with",
        "?(o?|s?",
        "?,a, p?i(s?))Pr(?",
        "|s??",
        ")T (s?",
        "?|a, p?i(s?",
        "), s?)",
        "?s????(o?|s??",
        "?,a, p?i(s?))Pr(?",
        "|s???",
        ")T (s??",
        "?|a, p?i(s?",
        "), s?)",
        "??",
        "(o?|s?,a, p?i(s?))",
        ") DialogBot is equipped with the five most frequent speech actions: BOARD(middle), BOARD(top), BOARD(bottom), BOARD(left), and BOARD(right).",
        "It produces concrete utterances by selecting a sentence from the training corpus with the desired semantics.",
        "Reward DialogBot receives a large reward when both it and its partner are located on the card, and a negative cost when moving or speaking:",
        "R?",
        "p 6= c?",
        "p?",
        "6= c DialogBot's reward is not dependent on the beliefs of the other player, only the true underlying state of the world."
      ]
    },
    {
      "heading": "6 Experimental Results",
      "text": [
        "We now experimentally evaluate our semantic classifiers and the agents?",
        "task performance."
      ]
    },
    {
      "heading": "6.1 Spatial Semantics Classifiers",
      "text": [
        "We report the performance of our spatial semantics classifiers, although their accuracy is not the focus of this paper.",
        "We use 10-fold cross validation on a corpus of 577 annotated utterances.",
        "We used simple bag-of-words features, so overfitting the data with cross validation is not a pressing concern.",
        "Of the 577 utterances, our classifiers perfectly labeled 325 (56.3% accuracy).",
        "The classifiers correctly predicted the domain ?",
        "of 515 (89.3%) utterances.",
        "The",
        "precision of our binary semantic primitive classifiers was 9691126 = .861 and recall",
        "1242 = .780, yielding F1 measure .818."
      ]
    },
    {
      "heading": "6.2 Cards Task Evaluation",
      "text": [
        "We evaluated our ListenerBot and DialogBot agents in the Cards task.",
        "Using 500 randomly generated initial player and card locations, we tested each combination of ListenerBot and DialogBot partners.",
        "Agents succeeded at a given initial position if they both reached the card within 50 moves.",
        "Table 2 shows how many trials each dyad won and how many high-level actions they took to do so.",
        "agents.",
        "LB = ListenerBot; DB = DialogBot.",
        "Collaborating DialogBots performed the best, completing more trials and using fewer moves than the ListenerBots.",
        "The DialogBots initially explore the space in a similar manner to the ListenerBots, but then share card location information.",
        "This leads to shorter interactions, as once the DialogBot finds the card, the other player can find it more quickly.",
        "In the combination of ListenerBot and DialogBot, we see about half of the improvement over two ListenerBots.",
        "Roughly 50% of the time, the ListenerBot finds the card first, which doesn't help the DialogBot find the card any faster."
      ]
    },
    {
      "heading": "7 Emergent Pragmatics",
      "text": [
        "Grice's original model of pragmatics (Grice, 1975) involves the cooperative principle and four maxims: quality (?say only what you know to be true?",
        "), relation (?be relevant?",
        "), quantity (?be as informative as is required; do not say more than is required?",
        "), and manner (roughly, be clear and concise).",
        "In most interactions, DialogBot searches for the card and then reports its location to the other agent.",
        "These reports obey quality in that they are made only when based on actual observations.",
        "The behavior is not hard-coded, but rather emerges, because only accurate information serves the agents?",
        "goals.",
        "In contrast, suboptimal policies generated early in the POMDP solving process sometimes lie about card locations.",
        "Since this behavior confuses the other agent and thus has a lower utility, it gets replaced by truthful communication as the policies improve.",
        "We also capture the effects of relation and the first clause of quantity, because the nature of the reward function and the nested belief structures ensure that DialogBot offers only relevant, informative information.",
        "For instance, when DialogBot finds the card in the lower left corner, it alternates saying ?left?",
        "and ?bottom?, effectively overcoming its limited generation capabilities.",
        "Again, early suboptimal policies sometimes do not report the location of the card at all, thereby failing to fulfill these maxims.",
        "We expect these models to produce behavior consistent with manner and the second clause of quantity, but evaluating this claim will require a richer experimental paradigm.",
        "For example, if DialogBot had a larger and more structured vocabulary, it would have to choose between levels of specificity as well as more or less economical forms."
      ]
    },
    {
      "heading": "8 Conclusion",
      "text": [
        "We have shown that cooperative pragmatic behavior can arise from multi-agent decision-theoretic models in which the agents share a joint utility function and reason about each other's belief states.",
        "Decision-making in these models is intractable, which has been a major obstacle to achieving experimental results in this area.",
        "We introduced a series of approximations to manage this intractability: (i) combining low-level states into semantically coherent high-level ones; (ii) tracking only an averaged summary of the other agent's potential beliefs; (iii) limiting belief state nesting to one level, and (iv) simplifying each agent's model of the other's beliefs so as to reduce uncertainty.",
        "These approximations bring the problems under sufficient control that they can be solved with current POMDP approximation algorithms.",
        "Our experimental results highlight the rich pragmatic behavior this gives rise to and quantify the communicative value of such behavior.",
        "While there remain insights from earlier theoretical proposals and logic-based methods that we have not fully captured, our current results support",
        "the notion that probabilistic decision-making methods can yield robust, widely applicable models that address the real-world difficulties of partial observability and uncertainty."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This research was supported in part by ONR grants N00014-10-1-0109 and N00014-13-1-0287 and ARO grant W911NF-07-1-0216."
      ]
    }
  ]
}
