{
  "info": {
    "authors": [
      "Mark Johnson"
    ],
    "book": "MoL",
    "id": "acl-W13-3011",
    "title": "Grammars and Topic Models",
    "url": "https://aclweb.org/anthology/W13-3011",
    "year": 2013
  },
  "references": [
    "acl-C10-1060",
    "acl-D10-1028",
    "acl-P08-1046",
    "acl-P12-1093"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the 13th Meeting on the Mathematics of Language (MoL 13), pages 102?103, Sofia, Bulgaria, August 9, 2013. c?2013 Association for Computational Linguistics Grammars and Topic ModelsMark Johnson Centre for Language Sciences and Dept.",
        "of Computing",
        "Context-free grammars have been a cornerstone of theoretical computer science and computational linguistics since their inception over half a century ago.",
        "Topic models are a newer development in machine learning that play an important role in document analysis and information retrieval.",
        "It turns out there is a surprising connection between the two that suggests novel ways of extending both grammars and topic models.",
        "After explaining this connection, I go on to describe extensions which identify topical multiword collocations and automatically learn the internal structure of named-entity phrases.",
        "The adaptor grammar framework is a non-parametric extension of probabilistic context-free grammars (Johnson et al., 2007), which was initially intended to allow fast prototyping of models of unsupervised language acquisition (Johnson, 2008), but it has been shown to have applications in text data mining and information retrieval as well (Johnson and Demuth, 2010; Hardisty et al., 2010).",
        "We?ll see how learning the referents of words (Johnson et al., 2010) and learning the roles of social cues in language acquisition (Johnson et al., 2012) can be viewed as a kind of topic modelling problem that can be reduced to a grammatical inference problem using the techniques described in this talk.2 About the Speaker Mark Johnson is a Professor of Language Science",
        "(CORE) in the Department of Computing at Macquarie University in Sydney, Australia.",
        "He was awarded a BSc (Hons) in 1979 from the University of Sydney, an MA in 1984 from the University of California, San Diego and a PhD in 1987 from Stanford University.",
        "He held a postdoc-toral fellowship at MIT from 1987 until 1988, and has been a visiting researcher at the University of Stuttgart, the Xerox Research Centre in Grenoble, CSAIL at MIT and the Natural Language group at Microsoft Research.",
        "He has worked on a wide",
        "range of topics in computational linguistics, but his main research areas are computational models of language acquisition, and parsing and its applications to text and speech processing.",
        "He was President of the Association for Computational Linguistics in 2003 and is Vice-President elect of EMNLP, and was a professor from 1989 until 2009 in the Departments of Cognitive and Linguistic"
      ]
    },
    {
      "heading": "Sciences and Computer Science at Brown Univer-sity.References",
      "text": []
    }
  ]
}
