{
  "info": {
    "authors": [
      "Yufan Guo",
      "Roi Reichart",
      "Anna Korhonen"
    ],
    "book": "NAACL",
    "id": "acl-N13-1113",
    "title": "Improved Information Structure Analysis of Scientific Documents Through Discourse and Lexical Constraints",
    "url": "https://aclweb.org/anthology/N13-1113",
    "year": 2013
  },
  "references": [
    "acl-D09-1067",
    "acl-D09-1155",
    "acl-D11-1025",
    "acl-I08-1050",
    "acl-J02-4002",
    "acl-J96-1002",
    "acl-P06-1027",
    "acl-P07-1036",
    "acl-P07-2009",
    "acl-P08-1099",
    "acl-P12-1084",
    "acl-W04-1205",
    "acl-W06-3309",
    "acl-W09-3603",
    "acl-W10-1913"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Inferring the information structure of scientific documents is useful for many downstream applications.",
        "Existing feature-based machine learning approaches to this task require substantial training data and suffer from limited performance.",
        "Our idea is to guide feature-based models with declarative domain knowledge encoded as posterior distribution constraints.",
        "We explore a rich set of discourse and lexical constraints which we incorporate through the Generalized Expectation (GE) criterion.",
        "Our constrained model improves the performance of existing fully and lightly supervised models.",
        "Even a fully unsupervised version of this model outperforms lightly supervised feature-based models, showing that our approach can be useful even when no la-beled data is available."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Techniques that enable automatic analysis of the information structure of scientific articles can help scientists identify information of interest in the growing volume of scientific literature.",
        "For example, classification of sentences according to argumentative zones (AZ) ?",
        "an information structure scheme that is applicable across scientific domains (Teufel et al., 2009) ?",
        "can support information retrieval, information extraction and summarization (Teufel and Moens, 2002; Tbahriti et al., 2006; Ruch et al., 2007; Liakata et al., 2012; Contractor et al., 2012).",
        "Previous work on sentence-based classification of scientific literature according to categories of information structure has mostly used feature-based machine learning, such as Support Vector Machines (SVM) and Conditional Random Fields (CRF) (e.g. (Teufel and Moens, 2002; Lin et al., 2006; Hiro-hata et al., 2008; Shatkay et al., 2008; Guo et al., 2010; Liakata et al., 2012)).",
        "Unfortunately, the performance of these methods is rather limited, as indicated e.g. by the relatively low numbers reported by Liakata et al. (2012) in biochemistry and chemistry with per-class F-scores ranging from .18 to .76.",
        "We propose a novel approach to this task in which traditional feature-based models are augmented with explicit declarative expert and domain knowledge, and apply it to sentence-based AZ.",
        "We explore two sources of declarative knowledge for our task - discourse and lexical.",
        "One way to utilize discourse knowledge is to guide the model predictions by encoding a desired predicted class (i.e. information category) distribution in a given position in the document.",
        "Consider, for example, sentence (1) from the first paragraph of the Discussion section in a paper: (1) In time, this will prove to be most suitable for detailed analysis of the role of these hormones in mammary cancer development.",
        "Although the future tense and cue phrases such as ?in time?",
        "can indicate that authors are discussing future work (i.e. the ?Future work?",
        "class in the AZ scheme), in this case they refer to their own contribution (i.e. the ?Conclusion?",
        "class in AZ).",
        "As most authors discuss their own contribution in the beginning of the Discussion section and future directions in the end, encoding the desired class distribution as a function of the position in this section can guide the model to the right decision.",
        "Likewise, lexical knowledge can guide the model",
        "through predicted class distributions for sentences that contain specific vocabulary.",
        "Consider, for example, sentence (2): (2) The values calculated for lungs include the presumed DNA adduct of BA and might thus be slightly overestimated.",
        "The verb ?calculated?",
        "usually indicates the ?Method?",
        "class, but, when accompanied by the modal verb ?might?, it is more likely to imply that authors are interpreting their own results (i.e. the ?Conclusion?",
        "class in AZ).",
        "This can be explicitly encoded in the model through a target distribution for sentences containing certain modal verbs.",
        "Recent work has shown that explicit declaration of domain and expert knowledge can be highly useful for structured NLP tasks such as parsing, POS tagging and information extraction (Chang et al., 2007; Mann and McCallum, 2008; Ganchev et al., 2010).",
        "These works have encoded expert knowledge through constraints, with different frameworks differing in the type of constraints and the inference and learning algorithms used.",
        "We build on the Generalized Expectation (GE) framework (Mann and McCallum, 2007) which encodes expert knowledge through a preference (i.e. soft) constraints for parameter settings for which the predicted label distribution matches a target distribution.",
        "In order to integrate domain knowledge with a features-based model, we develop a simple taxonomy of constraints (i.e. desired class distributions) and employ a top-down classification algorithm on top of a Maximum Entropy Model augmented with GE constraints.",
        "This algorithm enables us to break the multi-class prediction into a pipeline of consecutive, simpler predictions which can be better assisted by the encoded knowledge.",
        "We experiment in the biological domain with the eight-category AZ scheme (Table 1) adapted from (Mizuta et al., 2006) and described in (Contractor et al., 2012).",
        "The results show that our constrained model substantially outperforms a baseline unconstrained Maximum Entropy Model.",
        "While this type of constrained models have previously improved the feature-based model performance mostly in the weakly supervised and domain adaptation scenarios (e.g. (Mann and McCallum, 2007; Mann and McCallum, 2008; Ganchev et al., 2010)), we demonstrate substantial gains both when the Maximum En",
        "Future work (FUT) the potential future direction of the research tropy Model is fully trained and when its training data is sparse.",
        "This demonstrates the importance of expert knowledge for our task and supports our mod-eling decision that combines feature-based methods with domain knowledge encoded via constraints."
      ]
    },
    {
      "heading": "2 Previous work",
      "text": [
        "Information structure analysis The information structure of scientific documents (e.g. journal articles, abstracts, essays) can be analyzed in terms of patterns of topics, functions or relations observed in multi-sentence scientific text.",
        "Computational approaches have mainly focused on analysis based on argumentative zones (Teufel and Moens, 2002; Mizuta et al., 2006; Hachey and Grover, 2006; Teufel et al., 2009), discourse structure (Burstein et al., 2003; Webber et al., 2011), qualitative dimensions (Shatkay et al., 2008), scientific claims (Blake, 2009), scientific concepts (Liakata et al., 2010) and information status (Markert et al., 2012).",
        "Most existing methods for analyzing scientific text according to information structure use full supervision in the form of thousands of manually annotated sentences (Teufel and Moens, 2002; Burstein et al., 2003; Mizuta et al., 2006; Shatkay et al., 2008; Guo et al., 2010; Liakata et al., 2012; Markert et al., 2012).",
        "Because manual annotation is prohibitively expensive, approaches based on light supervision are now emerging for the task, including those based on active learning and self-training (Guo et al., 2011) and unsupervised methods (Varga et al., 2012; Reichart and Korhonen, 2012).",
        "Unfortunately, these approaches do not reach the performance level of fully supervised models, let alne exceed it.",
        "Our novel method addresses this problem.",
        "Declarative knowledge and constraints Previous work has shown that incorporating declarative constraints into feature-based machine learning",
        "models works well in many NLP tasks (Chang et al., 2007; Mann and McCallum, 2008; Druck et al., 2008; Bellare et al., 2009; Ganchev et al., 2010).",
        "Such constraints can be used in a semi-supervised or unsupervised fashion.",
        "For example, (Mann and McCallum, 2008) shows that using CRF in conjunction with auxiliary constraints on unlabeled data significantly outperforms traditional CRF in information extraction, and (Druck et al., 2008) shows that using declarative constraints alone for unsupervised learning achieves good results in text classification.",
        "We show that declarative constraints can be highly useful for the identification of information structure of scientific documents.",
        "In contrast with most previous works, we show that such constraints can improve the performance of a fully supervised model.",
        "The constraints are particularly helpful for identifying low-frequency information categories, but still yield high performance on high-frequency categories."
      ]
    },
    {
      "heading": "3 Maximum-Entropy Estimation and Generalized Expectation (GE)",
      "text": [
        "In this section we describe the Generalized Expectation method for declarative knowledge encoding.",
        "Maximum Entropy (ME) The idea of Generalized Expectation (Dud?",
        "?k, 2007; Mann and McCallum, 2008; Druck et al., 2008) stems from the principle of maximum entropy (Jaynes, 1957; Pietra and Pietra, 1993) which raises the following constrained optimization problem:",
        "where p?(?)",
        "is the empirical distribution, p(?)",
        "is a probability distribution in the model and H(?)",
        "is the corresponding information entropy, f(?)",
        "is a collection of feature functions, and Ep[f(?)]",
        "and Ep?[f(?)]",
        "are the expectations of f with respect to p(?)",
        "and p?(?).",
        "An example of p(?)",
        "could be a conditional probability distribution p(y|x), and H(?)",
        "could be a conditional entropy H(y|x).",
        "The optimal p(y|x) will take on an exponential form:",
        "exp(?",
        "?",
        "f(x, y)), (2) where ?",
        "is the Lagrange multipliers in the corresponding unconstrained objective function, and Z?",
        "is the partition function.",
        "The dual problem becomes maximizing the conditional log-likelihood of labeled data L (Berger et al., 1996):",
        "which is usually known as a Log-linear or Maximum Entropy Model (MaxEnt).",
        "ME with Generalized Expectation The objective function and the constraints on expectations in",
        "where D(p?||p0) is the divergence from p?",
        "to a base distribution p0, and g(?)",
        "is a constraint/penalty function that takes empirical evidence Ep?",
        "(x,y)[f(x, y)] as a reference point (Pietra and Pietra, 1993; Chen et al., 2000; Dud?",
        "?k, 2007).",
        "Note that a special case of this is MaxEnt where p0 is set to be a uniform distribution, D(?)",
        "to be the KL divergence, and g(?)",
        "to be an equality constraint.",
        "The constraint g(?)",
        "can be set in a relaxed manner:",
        "which is the logarithm of a Gaussian distribution centered at the reference values with a diagonal covariance matrix (Pietra and Pietra, 1993), and the dual problem will become a regularized MaxEnt with a Gaussian prior (?k = 0, ?2k =",
        "Such a model can be further extended to include expert knowledge or auxiliary constraints on unlabeled data U (Mann and McCallum, 2008; Druck et al., 2008; Bellare et al., 2009):",
        "where f?(?)",
        "is a collection of auxiliary feature functions on U , g?(?)",
        "is a constraint function that takes expert/declarative knowledge Ep?",
        "(y|x)[f ?",
        "(x, y)] as a reference point, and ?",
        "is the weight of the auxiliary GE term.",
        "The auxiliary constraint g?(?)",
        "can take on many forms and the one we used in this work is an L2 penalty function (Dud?",
        "?k, 2007).",
        "We trained the model with L-BFGS (Nocedal, 1980) in supervised, semi-supervised and unsupervised fashions on labeled and/or unlabeled data, using the Mallet software (McCallum, 2002)."
      ]
    },
    {
      "heading": "4 Incorporating Expert Knowledge into GE constraints",
      "text": [
        "We defined the auxiliary feature functions ?",
        "the expert knowledge on unlabeled data as1:",
        "where 1(xk,yk)(x, y) is an indicator function, and p?",
        "(yk|xk) is a conditional probability specified in the form of p?",
        "(yk|xk) ?",
        "[ak, bk] (8) by experts.",
        "In particular, we took",
        "as the reference point when calculating g?(?).",
        "We defined two types of constraints: those based on discourse properties such as the location of a sentence in a particular section or paragraph, and those based on lexical properties such as citations, references to tables and figures, word lists, tenses, and so on.",
        "Note that the word lists actually contain both lexical and semantic information.",
        "To make an efficient use of the declarative knowledge we build a taxonomy of information structure categories centered around the distinction between categories that describe the authors?",
        "OWN work and those that describe OTHER work (see Section 5).",
        "In practice, our model labels every sentence with an AZ category augmented by one of the two categories, OWN or OTHER.",
        "In evaluation we consider only the standard AZ categories which are part of the annotation scheme of (Contractor et al., 2012).",
        "1Accordingly, Ep?",
        "(y|x)[fk(x, y)] = p?",
        "(yk|xk)",
        "mation categories at different levels of the information structure taxonomy.",
        "(a) OWN / OTHER OWN Discourse (1) Target(last part of paragraph) = 1 (2) Target(last part of section) = 1 Lexical (3) Target(tables/figures) ?",
        "1 (4) ?x ?",
        "{w|w?we} Target(x) = 1 ?",
        "?y ?",
        "{w|w?previous} Target(y) = 0 (5) ?x ?",
        "{w|w?thus} Target(x) = 1 OTHER Lexical (6) Target(cite) = 1 (7) Target(cite) > 1 (8) Backward(cite) = 1 ?",
        "?x ?",
        "{w|w?in addition} Target(x) = 1 (b) PROB / METH / RES / CON / FUT PROB Discourse (1) Target(last part in section) = 1 Lexical (2) ?x ?",
        "{w|w?aim} Target(x) = 1 (3) ?x ?",
        "{w|w?question} Target(x) = 1 (4) ?x ?",
        "{w|w?investigate} Target(x) = 1 METH Lexical (5) ?x ?",
        "{w|w?",
        "{use,method}} Target(x) = 1 RES Lexical (6) Target(tables/figures) ?",
        "1 (7) ?x ?",
        "{w|w?observe} Target(x) = 1 CON Lexical (8) Target(cite) ?",
        "1 (9) ?x ?",
        "{w|w?conclude} Target(x) = 1 (10) ?x ?",
        "{w|w?",
        "{suggest, thus, because, likely}} Target(x) = 1 FUT Discourse (11) Target(first part in section) = 1 (12) Target(last part in section) = 1 ?",
        "?x ?",
        "{w|w?",
        "{will,need,future}} Target(x) = 1 Lexical (13) ?x {w|w?will,future} Target(x) = 1 (14) Target(present continuous tense) = 1 (c) BKG / CN / DIFF BKG Discourse (1) Target(first part in paragraph) = 1 (2) Target(first part in section) = 1 Lexical (3) ?x ?",
        "{w|w?we} Target(x) = 1 ?",
        "?y ?",
        "{w|w?previous} Target(y) = 0 (4) Forward(cite) = 1 ?",
        "?x ?",
        "{w|w?",
        "{consistent,inconsistent,than}} (Target(x) = 0 ?",
        "Forward(x) = 0) CN Lexical (5) ?x ?",
        "{w|w?consistent} Target(x) = 1 (6) ?x ?",
        "{w|w?consistent} Forward(x) = 1 DIFF Lexical (7) ?x ?",
        "{w|w?inconsistent} Target(x) = 1 (8) ?x ?",
        "{w|w?inconsistent} Forward(x) = 1 (9) ?x ?",
        "{w|w?",
        "{inconsistent,than,however}}"
      ]
    },
    {
      "heading": "Cue Synonyms",
      "text": [
        "we our, present study previous previously, recent, recently thus therefore aim objective, goal, purpose question hypothesis, ?",
        "investigate explore, study, test, examine, evaluate, assess, determine, characterize, analyze, report, present use employ method algorithm, assay observe see, find, show conclude conclusion, summarize, summary suggest illustrate, demonstrate, imply, indicate, confirm, reflect, support, prove, reveal because result from, attribute to likely probable, probably, possible, possibly, may, could need remain future further consistent match, agree, support, in line, in agreement, similar, same, analogous inconsistent conflicting, conflict, contrast, contrary, differ, different, difference than compare however other hand, although, though, but The constraints in Table 2(a) refer to the top level of this taxonomy: distinction between the authors?",
        "own work and the work of others, and the constraints in Tables 2(b)-(c) refer to the bottom level of the taxonomy: distinction between AZ categories related to the authors?",
        "own work (Table 2(b)) and other's work (Table 2(c)).",
        "The first and second columns in each table refer to the y and x variables in Equation (8), respectively.",
        "The functions Target(?",
        "), Forward(?)",
        "and Backward(?)",
        "refer to the property value for the target, next and preceding sentence, respectively.",
        "If their value is 1 then the property holds for the respective sentence, if it is 0, the property does not hold.",
        "In some cases the value of such functions can be greater than 1, meaning that the property appears multiple times in the sentence.",
        "Terms of the form {w|w?",
        "{wi}} refer to any word/bi-grams that have the same sense aswi, where the actual word set we use with every example word in Table 2 is described in Table 3.",
        "For example, take constraints (1) and (4) in Table 2(a).",
        "The former is a standard discourse constraint that refers to the probability that the target sentence describes the authors?",
        "own work given that it appears in the last of the ten parts in the paragraph.",
        "The latter is a standard lexical constraint that refers to the probability that a sentence presents other people's work given that it contains any words in {we, our,"
      ]
    },
    {
      "heading": "BKG CN DIFF",
      "text": [
        "in {previous, previously, recent, recently}.",
        "Our constraint set further includes constraints that combine both types of information.",
        "For example, constraint (12) in Table 2(b) refers to the probability that a sentence discusses future work given that it appears in the last of the ten parts of the section (discourse) and that it contains at least one word in {will, future, further, need, remain} (lexical)."
      ]
    },
    {
      "heading": "5 Top-Down Model",
      "text": [
        "An interesting property of our task and domain is that the available expert knowledge does not directly support the distinctions between AZ categories, but it does provide valuable indirect guidance.",
        "For example, the number of citations in a sentence is only useful for separating the authors?",
        "work from other people's work, but not for further fine grained distinctions between zone categories.",
        "Moreover, those constraints that are useful for making fine grained distinctions between AZ categories are usually useful only for a particular subset of the categories only.",
        "For example, all the constraints in Table 2(b) are conditioned on the assumption that the sentence describes the authors?",
        "own work.",
        "To make the best use of the domain knowledge, we developed a simple constraint taxonomy, and apply a top-down classification approach which utilizes it.",
        "The taxonomy is presented in Figure 1.",
        "For classification we trained three MaxEnt models augmented with GE constraints: one for distinguishing between OWN and OTHER2, one for distinguishing between the AZ categories under the OWN auxiliary category and one for distinguishing between the AZ categories under the OTHER auxiliary category.",
        "At test time we first apply the first classifier and based on its prediction we apply either the classifier that distinguishes between OWN categories or the one that distinguishes between OTHER categories."
      ]
    },
    {
      "heading": "6 Experiments",
      "text": [
        "Data We used the full paper corpus used by Contractor et al. (2012) which contains 8171 sentences from 50 biomedical journal articles.",
        "The corpus is annotated according to the AZ scheme described in Table",
        "1.",
        "AZ describes the logical structure, scientific argumentation and intellectual attribution of a scientific paper.",
        "It was originally introduced by Teufel and",
        "Moens (2002) and applied to computational linguistics papers, and later adapted to other domains such as biology (Mizuta et al., 2006) ?",
        "which we used in this work ?",
        "and chemistry (Teufel et al., 2009).",
        "Table 4 shows the AZ class distribution in full articles as well as in individual sections.",
        "Since section names vary across scientific articles, we grouped similar sections before calculating the statistics (e.g.",
        "under Discussion).",
        "We can see that although there is a major category in each section (e.g. CON in Discussion), up to 36.5% of the sentences in each section still belong to other categories.",
        "Features We extracted the following features from each sentence and used them in the feature-based classifiers: (1) Discourse features: location in the article/section/paragraph.",
        "For this feature each text batch was divided to ten equal size parts and the corresponding feature value identifies the relevant part; (2) Lexical features: number of citations and references to tables and figures (0, 1, or more), word, bi-gram, verb, and verb class (obtained by spectral clustering (Sun and Korhonen, 2009)); (3) Syntactic features: tense and voice (POS tags of main and auxiliary verbs), grammatical relation, subject and object.",
        "The lexical and the syntactic features were extracted for the represented sentence as well as for its surrounding sentences.",
        "We used the C&C POS tagger and parser (Curran et al., 2007) for extracting the lexical and the syntactic features.",
        "Note that all the information encoded into our constraints is also encoded in the features and is thus available to the feature-based model.",
        "This enables us to properly evaluate the impact of our modeling decision which augments a feature-based model with constraints.",
        "Baselines We compared our model against four baselines, two with full supervision: Support Vector Machines (SVM) and Maximum Entropy Models (MaxEnt), and two with light supervision: Trans",
        "Ent based on Entropy Regularization (ER) (Vapnik, 1998; Jiao et al., 2006).",
        "SVM and MaxEnt have proved successful in information structure analysis (e.g. (Merity et al., 2009; Guo et al., 2011)) but, to the best of our knowledge, their semi-supervised versions have not been used for AZ of full articles.",
        "Parameter tuning The boundaries of the reference probabilities (ak and bk in Equation (8)) were defined and optimized on the development data which consists of one third of the corpus.",
        "We considered six types of boundaries: Fairly High for 1, High for [0.9,1), Medium High for [0.5,0.9), Medium Low for [0.1,0.5), Low for [0,0.1), and Fairly Low for 0.",
        "Evaluation We evaluated the precision, recall and F-score for each category, using a standard tenfold cross-validation scheme.",
        "The models were tested on each of the ten folds and trained on the rest of them, and the results were averaged across the ten folds."
      ]
    },
    {
      "heading": "7 Results",
      "text": [
        "We report results at two levels of granularity.",
        "We first provide detailed results for the Discussion section which should be, as is clearly evident from Table 4, the most difficult section for AZ prediction as only 63.5% of its sentences take its most dominant class (CON).",
        "As we show below, this is also where our constrained model is most effective.",
        "We then show the advantages of our model for other sections.",
        "Results for the Discussion section To get a bet",
        "trained with 150 labeled sentences.",
        "Unsupervised GE outperforms the standard MaxEnt model for all categories except for CON ?",
        "the major c tegory of the section.",
        "The result pattern for the other sections are very similar.",
        "ter understanding of the nature of the challenge we face, Table 5 shows the F-scores of fully-and semi-supervised SVM and MaxEnt on the Discussion section.",
        "The dominant zone category CON, which accounts for 63.5% of the section sentences, has the highest F-scores for all methods and scenarios.",
        "Most of the methods also identify the second and the third most frequent zones BKG and CN, but with relatively lower F-scores.",
        "Other low-frequency categories can hardly be identified by any of the methods regardless of the amount of labeled data available for training.",
        "Note that the compared models perform quite similarly.",
        "We therefore use the MaxEnt model, which",
        "for the lightly supervised and the fully supervised cases.",
        "Results are presented for the Discussion section.",
        "Using only the lexical constraints is generally preferable in the fully supervised case.",
        "Combining the different constraint types is preferable for the lightly supervised case.",
        "is most naturally augmented with GE constraints, as the baseline unconstrained model.",
        "When adding the GE constraints we observe a substantial performance gain, in both the fully and the lightly supervised cases, especially for the low-frequency categories.",
        "Table 6 presents the F-scores of MaxEnt with and without GE constraints (?Max-Ent+GE (Top-down)?",
        "and ?MaxEnt?)",
        "in the light and full supervision scenarios.",
        "Incorporating GE into MaxEnt results in a substantial F-score improvement for all AZ categories except for the major category CON for which the performance is kept very similar.",
        "In total, MaxEnt+GE (Top-down) is",
        "better in 44 out of the 48 cases presented in the table.",
        "Importantly, the constrained model provides substantial improvements for both the relatively high-frequency classes (BKG and CN which together label 30.2% of the sentences) and for the low-frequency classes (which together label 6.4% of the sentences).",
        "The table also clearly demonstrates the impact of our tree-based top-down classification scheme, by comparing the Top-down version of MaxEnt+GE to the standard ?Flat?",
        "version.",
        "In 39 out of 48 cases, the Top-down model performs better.",
        "In some cases, especially for high-frequency categories and when the amount of training data increases, unconstrained MaxEnt even outperforms the flat Max-Ent+GE model.",
        "The results presented in the rest of the paper for the MaxEnt+GE model therefore refer to its Top-down version.",
        "All sections We next turn to the performance of our model on the three other sections.",
        "Our experiments show that augmenting the MaxEnt model with domain knowledge constraints improves performance for all the categories (either low or high frequency), except the major section category, and keep the performance for the latter on the same level.",
        "Figure 2 demonstrates this pattern for the lightly supervised case with 150 training sentences but the same pattern applies to all other amounts of training data, including the fully supervised case.",
        "Naturally, we cannot demonstrate all these cases due to space limitations.",
        "The result patterns are very similar to those presented above for the Discussion section.",
        "Unsupervised GE We next explore the quality of the domain knowledge constraints when used in isolation from a feature-based model.",
        "The objective function of this model is identical to Equation (6) except that the first (likelihood) term is omitted.",
        "Our experiments reveal that this unsupervised GE model outperforms standard MaxEnt for all the categories except the major category of the section, when up to 150 training sentences are used.",
        "Table 7 demonstrates this for the Discussion section.",
        "This pattern holds for the other scientific article sections.",
        "Even when more than 150 labeled sentences are used, the unsupervised model better detects the low frequency categories (i.e. those that label less than 10% of the sentences) for all sections.",
        "These results provide strong evidence for the usefulness of our constraints even when they are used with no labeled data.",
        "Model component analysis We finally analyze the impact of the different types of constraints on the performance of our model.",
        "Table 8 presents the Discussion section performance of the constrained model with only one or the full set of constraints.",
        "Interestingly, when the feature-based model is fully trained the application of the lexical constraints alone results in a very similar performance to the application of the full set of lexical and discourse constraints.",
        "It is only in the lightly supervised case where the full set of constraints is required and results in the best performing model."
      ]
    },
    {
      "heading": "8 Conclusions and Future Work",
      "text": [
        "We have explored the application of posterior discourse and lexical constraints for the analysis of the information structure of scientific documents.",
        "Our results are strong.",
        "Our constrained model outperforms standard feature-based models by a large margin in both the fully and the lightly supervised cases.",
        "Even an unsupervised model based on these constraints provides substantial gains over feature-based models for most AZ categories.",
        "We provide a detailed analysis of the results which reveals a number of interesting properties of our model which may be useful for future research.",
        "First, the constrained model significantly outperforms its unconstrained counterpart for low-medium frequency categories while keeping the performance on the major section category very similar to that of the baseline model.",
        "Improved modeling of the major category is one direction for future research.",
        "Second, our full constraint set is most beneficial in the lightly supervised case while the lexical constraints alone yield equally good performance in the fully supervised case.",
        "This calls for better understanding of the role of discourse constraints for our task as well as for the design of additional constraints that can enhance the model performance either in combination with the existing constraints or when separately applied to the task.",
        "Finally, we demonstrated that our top-down tree classification scheme provides a substantial portion of our model's impact.",
        "A clear direction for future research is the design of more fine-grained constraint taxonomies which can enable efficient usage of other constraint types and can result in further improvements in performance."
      ]
    }
  ]
}
