{
  "info": {
    "authors": [
      "Alex Lamb",
      "Michael J. Paul",
      "Mark Dredze"
    ],
    "book": "NAACL",
    "id": "acl-N13-1097",
    "title": "Separating Fact from Fear: Tracking Flu Infections on Twitter",
    "url": "https://aclweb.org/anthology/N13-1097",
    "year": 2013
  },
  "references": [
    "acl-D10-1124",
    "acl-D11-1145",
    "acl-N12-1033",
    "acl-N12-1057",
    "acl-P11-2008",
    "acl-W09-3012",
    "acl-W10-0701",
    "acl-W12-3807"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Twitter has been shown to be a fast and reliable method for disease surveillance of common illnesses like influenza.",
        "However, previous work has relied on simple content analysis, which conflates flu tweets that report infection with those that express concerned awareness of the flu.",
        "By discriminating these categories, as well as tweets about the authors versus about others, we demonstrate significant improvements on influenza surveillance using Twitter."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Twitter is a fantastic data resource for many tasks: measuring political (O?Connor et al., 2010; Tumas-jan et al., 2010), and general sentiment (Bollen et al., 2011), studying linguistic variation (Eisenstein et al., 2010) and detecting earthquakes (Sakaki et al., 2010).",
        "Similarly, Twitter has proven useful for public health applications (Dredze, 2012), primarily disease surveillance (Collier, 2012; Signorini et al., 2011), whereby public health officials track infection rates of common diseases.",
        "Standard government data sources take weeks while Twitter provides an immediate population measure.",
        "Strategies for Twitter influenza surveillance include supervised classification (Culotta, 2010b; Cu-lotta, 2010a; Eiji Aramaki and Morita, 2011), unsupervised models for disease discovery (Paul and Dredze, 2011), keyword counting1, tracking geographic illness propagation (Sadilek et al., 2012b), and combining tweet contents with the social network (Sadilek et al., 2012a) and location informa",
        "tion (Asta and Shalizi, 2012).",
        "All of these methods rely on a relatively simple NLP approach to analyz-ing the tweet content, i.e. n-gram models for classifying related or not related to the flu.",
        "Yet examining flu tweets yields a more complex picture: ?",
        "going over to a friends house to check on her son.",
        "he has the flu and i am worried about him ?",
        "Starting to get worried about swine flu...",
        "Both are related to the flu and express worry, but tell a different story.",
        "The first reports an infection of another person, while the second expresses the author's concerned awareness.",
        "While infection tweets indicate a rise in infection rate, awareness tweets may not.",
        "Automatically making these distinctions may improve influenza surveillance, yet requires more than keywords.",
        "We present an approach for differentiating between flu infection and concerned awareness tweets, as well as self vs other, by relying on a deeper analysis of the tweet.",
        "We present our features and demonstrate improvements in influenza surveillance."
      ]
    },
    {
      "heading": "1.1 Related Work",
      "text": [
        "Much of the early work on web-based influenza surveillance relied on query logs and click-through data from search engines (Eysenbach, 2006), most famously Google's Flu Trends service (Ginsberg et al., 2008; Cook et al., 2011).",
        "Other sources of information include articles from the news media and online mailing lists (Brownstein et al., 2010)."
      ]
    },
    {
      "heading": "2 Capturing Nuanced Trends",
      "text": [
        "Previous work has classified messages as being related or not related to influenza, with promising surveillance results, but has ignored nuanced differences between flu tweets.",
        "Tweets that are related to",
        "flu but do not report an infection can corrupt infection tracking.",
        "Concerned Awareness vs.",
        "Infection (A/I) Many flu tweets express a concerned awareness as opposed to infection, including fear of getting the flu, an awareness of increased infections, beliefs related to flu infection, and preventative flu measures (e.g. flu shots.)",
        "Critically, these people do not seem to have the flu, whereas infection tweets report having the flu.",
        "This distinction is similar to modality (Prab-hakaran et al., 2012a).",
        "Conflating these tweets can hurt surveillance, as around half of our annotated flu messages were awareness.",
        "Identifying awareness tweets may be of use in-and-of itself, such as for characterizing fear of illness (Epstein et al., 2008; Epstein, 2009), public perception, and discerning sentiment (e.g. flu is negative, flu shots may be positive.)",
        "We focus on surveillance improvements.2 Self vs. Other (S/O) Tweets for both awareness and infection can describe the author (self) or others.",
        "It may be that self infection reporting is more informative.",
        "We test this hypothesis by classifying tweets as self vs. other.",
        "Finding Flu Related Tweets (R/U) We must first identify messages that are flu related.",
        "We construct a classifier for flu related vs. unrelated."
      ]
    },
    {
      "heading": "3 Features",
      "text": [
        "Token sequences (n-grams) are an insufficient feature set, since our classes share common vocabular",
        "ies.",
        "Consider, ?",
        "A little worried about the swine flu epidemic!",
        "?",
        "Robbie might have swine flu.",
        "I'm worried.",
        "Both tweets mention flu and worried, which distinguish them as flu related but not specifically awareness or infection, nor self or other.",
        "Motivated by Bergsma et al. (2012), we complement 3-grams with additional features that capture longer spans of text and generalize using part of speech tags.",
        "We begin by processing each tweet using the ARK POS tag-ger (Gimpel et al., 2011) and find phrase segmentations using punctuation tags.3 Most phrases were two (31.2%) or three (26.6%) tokens long.",
        "2While tweets can both show awareness and report an infection, we formulate a binary task for simplicity since only a small percentage of tweets were so labeled.",
        "3We used whitespace for tokenization, which did about the same as Jerboa (Van Durme, 2012).",
        "Class Name Words in Class Infection getting, got, recovered, have, having, had, has, catching, catch, cured, infected Possession bird, the flu, flu, sick, epidemic Concern afraid, worried, scared, fear, worry, nervous, dread, dreaded, terrified Vaccination vaccine, vaccines, shot, shots, mist, tamiflu, jab, nasal spray Past Tense was, did, had, got, were, or verb with the suffix ?ed?",
        "Present Tense is, am, are, have, has, or verb with the suffix ?ing?",
        "Self I, I?ve, I?d, I?m, im, my Others your, everyone, you, it, its, u, her, he, she, he?s, she?s, she, they, you?re, she?ll, he?ll, husband, wife, brother, sister, your, people, kid, kids, children, son, daughter",
        "behave similarly with regard to the label.",
        "We create word lists for possessive words, flu related words, fear related words, ?self?",
        "words, ?other?",
        "words, and fear words (Table 1).",
        "A word's presence triggers a count-based feature corresponding to each list.",
        "Stylometry We include Twitter-specific style features.",
        "A feature is included for retweet, hashtags, and mentions of other users.",
        "We include a feature for emoticons (based on the emoticon part-of-speech tag).",
        "We include a more specific feature for positive emoticons (:) :D :)).",
        "We also include a feature for negative emoticons (:( :/).",
        "Additionally, we include a feature for links to URLs.",
        "Part of Speech Templates We include features based on a number of templates matching specific sequences of words, word classes, and part of speech tags.",
        "Where any word included in the template matches a word in one of the word classes, an additional feature is included indicating that the word class was included in that template.",
        "?",
        "Tuples of (subject,verb,object) and pairs of (subject, verb), (subject, object), and (verb, object).",
        "We use a simple rule to construct these tuples: the first noun or pronoun is taken as the subject, and the first verb appearing after the subject is taken as the verb.",
        "The object is taken as any noun or pronoun that appears before a verb or at the end of a phrase.",
        "?",
        "A pairing of the first pronoun with last noun.",
        "These are useful for S/O, e.g.",
        "I am worried that my son has the flu to recognize the difference between the author (I) and someone else.",
        "?",
        "Phrases that begin with a verb (pro-drop).",
        "This is helpful for S/O, e.g. getting the flu!",
        "which can indicate self even without a self-related pronoun.",
        "An additional feature is included if this verb is past-tense.",
        "?",
        "Numeric references.",
        "These often indicate awareness (number of people with the flu) and are generally not detected by an n-gram model.",
        "We add a separate feature if the word following has the root ?died?, e.g.",
        "So many people dying from the flu, I'm scared!",
        "?",
        "Pair of first pronoun/noun with last verb in a phrase.",
        "Many phrases have multiple verbs, but the last verb is critical, e.g.",
        "I had feared the flu.",
        "Additional features are added if the noun/pronoun is in the ?self?",
        "or ?other?",
        "word class, and if the verb is in the ?possessive?",
        "word class.",
        "?",
        "Flu appears as a noun before first verb in a phrase.",
        "This indicates when flu is a subject, which is more likely to be about awareness.",
        "?",
        "Pair of verb and following noun.",
        "This indicates the verbs object, which can change the focus of A/I, e.g., I am getting a serious case of the flu vs.",
        "I am getting a flu shot.",
        "Additional features are added if the verb is past tense (based on word list and suffix ?-ed?.)",
        "?",
        "Whether a flu related word appears as a noun or an adjective.",
        "When flu is used as an adjective, it may indicate a more general discussion of the flu, as opposed to an actual infection I hate this flu vs.",
        "I hate this flu hype.",
        "?",
        "If a proper noun is followed by a possessive verb.",
        "This may indicate others for the S/O task Looks like Denmark has the flu.",
        "An additional feature fires for any verb that follows a proper noun and any past tense verb that follows a proper noun.",
        "?",
        "Pair each noun with ???.",
        "While infection tweets are often statements and awareness questions, the subject matters, e.g. Do you think that swine flu is coming to America?",
        "as awareness.",
        "An equivalent feature is included for phrases ending with ?!?.",
        "While many of our features can be extracted using a syntactic parser (Foster et al., 2011), tweets are very short, so our simple rules and over-generating features captures the desired effects without parsing.",
        "fection tweets are more likely to be about the author (self) than those expressing awareness."
      ]
    },
    {
      "heading": "3.1 Learning",
      "text": [
        "We used a log-linear model from Mallet (McCal-lum, 2002) with L2 regularization.",
        "For each task, we first labeled tweets as related/not-related and then classified the related tweets as awareness/infection and self/others.",
        "We found this two phase approach worked better than multi-class."
      ]
    },
    {
      "heading": "4 Data Collection",
      "text": [
        "We used two Twitter data sets: a collection of 2 billion tweets from May 2009 and October 2010 (O?Connor et al., 2010)4 and 1.8 billion tweets collected from August 2011 to November 2012.",
        "To obtain labeled data, we first filtered the data sets for messages containing words related to concern and influenza,5 and used Amazon Mechanical Turk (Callison-Burch and Dredze, 2010) to label tweets as concerned awareness, infection, media and unrelated.",
        "We allowed multiple categories per tweet.",
        "Annotators also labeled awareness/infection tweets as self, other or both.",
        "We included tweets we annotated to measure Turker quality and obtained three annotations per tweet.",
        "More details can be found in Lamb et al. (2012).",
        "To construct a labeled data set we removed low quality annotators (below 80% accuracy on gold tweets.)",
        "This seemed like a difficult task for annotators as a fifth of the data had no annotations after this step.",
        "We used the majority label as truth and ties were broken using the remaining low quality annotators.",
        "We then hand-corrected all tweets, changing 13.5% of the labels.",
        "The resulting data set contained 11,990 tweets (Table 2), 5,990 from 2011-2012 for training and the remaining from 2009-2010 as test.6"
      ]
    },
    {
      "heading": "5 Experiments",
      "text": [
        "We begin by evaluating the accuracy on the binary classification tasks and then measure the results from the classifiers for influenza surveillance.",
        "We created precision recall curves on the test data (Figure 1), and measured the highest F1, for the three binary classifiers.",
        "For A/I and S/O, our additional features improved over the n-gram baselines.",
        "We performed feature ablation experiments (Table 3) and found that for A/I, the word class features helped the most by a large margin, while for S/O the stylometry and pro-drop features were the most important after n-grams.",
        "Interestingly, S/O does equally well removing just n-gram features, suggesting that the S/O task depends on a few words captured by our features.",
        "Since live data will have classifiers run in stages ?",
        "to filter out not-related tweets ?",
        "we evaluated the performance of two-staged classification.",
        "F1 dropped to 0.7250 for A/I and S/O dropped to 0.8028."
      ]
    },
    {
      "heading": "5.1 Influenza surveillance using Twitter",
      "text": [
        "We demonstrate how our classifiers can improve influenza surveillance using Twitter.",
        "Our hypothesis is that by isolating infection tweets we can improve correlations against government influenza data.",
        "We include several baseline methods: Google Flu Trends: Trends from search queries.7 Keywords: Tweets that contained keywords from the DHHS Twitter surveillance competition.",
        "ATAM: We obtained 1.6 million tweets that were automatically labeled as influenza/other by ATAM",
        "Aug 2010, Dec 2011 to Aug 2012.",
        "(Paul and Dredze, 2011).",
        "We trained a binary classifier with n-grams and marked tweets as flu infection.",
        "We evaluated three trends using our three binary classifiers trained with a reduced feature set close to the n-gram features:8 All Flu: Tweets marked as flu by Keywords or ATAM were then classified as related/unrelated.9 This trend used all flu-related tweets.",
        "Infection: Related tweets were classified as either awareness or infection.",
        "This used infection tweets.",
        "Infection+Self: Infection were then labeled as self or other.",
        "This trend used self tweets.",
        "All five of these trends were correlated against data from the Centers for Disease Control and Prevention (CDC) weekly estimates of influenza-like illness (ILI) in the U.S., with Pearson correlations computed separately for 2009 and 2011 (Table 4).10 Previous work has shown high correlations for 2009 data, but since swine flu had so dominated social media, we expect weaker correlations for 2011.",
        "Results are show in Table 4 and Figure 2 shows two classifiers against the CDC ILI data.",
        "We see that in 2009 the Infection curve fits the CDC curve very closely, while the All Flu curve appears to substantially overestimate the flu rate at the peak.",
        "While 2009 is clearly easier, and all trends have similar correlations, our Infection classifier beats the other Twitter methods.",
        "All trends do much worse in",
        "tweets that appeared to mention the flu, we first filtered out obvious non-flu tweets by running ATAM and Keywords.",
        "10While the 2009 data is a 10% sample of Twitter, we used a different approach for 2011.",
        "To increase the amount of data, we collected Tweets mentioning health keywords and then normalized by the public stream counts.",
        "For our analysis, we excluded days that were missing data.",
        "Additionally, we used a geolocator based on user provided locations to exclude non-US messages.",
        "See (Dredze et al., 2013) for details and code for the geolocator.",
        "between the two years due to differences in data collection, but we note that the 2011-12 season was much milder.",
        "the 2011 season, which was much milder and thus harder to detect.",
        "Of the Twitter methods, those using our system were dramatically higher, with the Infection curve doing the best by a significant margin.",
        "Separating out infection from awareness (A/I) led to significant improvements, while the S/O classifier did not, for unknown reasons.",
        "The best result using Twitter reported to date has been by Doan et al. (2012), whose best system had a correlation of 0.9846 during the weeks beginning 8/30/09?05/02/10.",
        "Our Infection system had a correlation of 0.9887 during the same period.",
        "While Google does better than any of the Twitter systems, we note that Google has access to much more (proprietary) data, and their system is trained to predict CDC trends, whereas our Twitter system is intrinsically trained only on the tweets themselves.",
        "Finally, we are also interested in daily trends in addition to weekly, but there is no available evaluation data on this scale.",
        "Instead, we computed the stability of each curve, by measuring the day-to-day changes.",
        "In the 2009 season, the relative increase or decrease from the previous day had a variance of 3.0% under the Infection curve, compared to 4.1% under ATAM and 6.7% under Keywords."
      ]
    },
    {
      "heading": "6 Discussion",
      "text": [
        "Previous papers have implicitly assumed that flu-related tweets mimick the infection rate.",
        "While this was plausible on 2009 data that focused on the swine flu epidemic, it is clearly false for more typical flu seasons.",
        "Our results show that by differentiating between types of flu tweets to isolate reports of infection, we can recover reasonable surveillance.",
        "This result delivers a promising message for the NLP community: deeper content analysis of tweets matters.",
        "We believe this conclusion is applicable to numerous Twitter trend tasks, and we encourage others to investigate richer content analyses for these tasks.",
        "In particular, the community interested in modeling author beliefs and influence (Diab et al., 2009; Prab-hakaran et al., 2012b; Biran and Rambow, 2011) may find our task and data of interest.",
        "Finally, beyond surveillance, our methods can be used to study disease awareness and sentiment, which has implications for how public health officials respond to outbreaks.",
        "We conclude with an example of this distinction.",
        "On June 11th, 2009, the World Health Organization declared that the swine flu had become a global flu pandemic.",
        "On that day, flu awareness increased 282%, while infections increased only 53%."
      ]
    }
  ]
}
