{
  "info": {
    "authors": [
      "Jette Viethen",
      "Margaret Mitchell",
      "Emiel Krahmer"
    ],
    "book": "ENLG",
    "id": "acl-W13-2108",
    "title": "Graphs and Spatial Relations in the Generation of Referring Expressions",
    "url": "https://aclweb.org/anthology/W13-2108",
    "year": 2013
  },
  "references": [
    "acl-E91-1028",
    "acl-J03-1003",
    "acl-J12-1006",
    "acl-L08-1090",
    "acl-P06-1131",
    "acl-P11-2041",
    "acl-P11-2116",
    "acl-P89-1009",
    "acl-W06-1410",
    "acl-W08-1108",
    "acl-W08-1109",
    "acl-W08-1131",
    "acl-W08-1132",
    "acl-W08-1133",
    "acl-W09-0629",
    "acl-W09-0631",
    "acl-W12-1503"
  ],
  "sections": [
    {
      "text": [
        "To get an idea of how successful the new LongestFirst approach is at replicating the use of relations on the clustered data, we take a closer look at the output of the best-performing systems",
        "on the two clusters.",
        "On CL0, the cluster of participants who produce longer descriptions containing more spatial relations, the best match to the human data comes from LongestFirst-max-av/FNPROP.",
        "147 of the 160 descriptions in this cluster contain a relation, and the system includes the correct relation for all 147.",
        "It falsely also includes a relation for the remaining 13 descriptions.",
        "This shows that with the appropriate parameter settings the LongestFirst algorithm is able to replicate human relational reference behaviour, but personal speaker preferences are the main driving factor for the human use of relations.",
        "CL1, the cluster with shorter descriptions, contains only 85 (18%) relational descriptions.",
        "The best performing system on this cluster (LongestFirst/FN-ATT) does not produce any relations.",
        "This is not surprising as the cost functions and POs for this cluster are necessarily dominated by the non-relational attributes used more regularly.",
        "The cases in which relations are used stem from participants who do not show a clear preference for or against relations and would therefore be hard to model in any system.",
        "With more data it might be possible to group these participants into a third cluster and find suitable parameter settings for them.",
        "This would only be possible if their use of relations is influenced by other factors available to the algorithm, such as the spatial configuration of the scene.",
        "Viethen and Dale's (2008) analysis of the GRE3D3 Corpus suggests that this is the case at least to some extent.7 Conclusions and Future Work We have evaluated the Graph-Based Algorithm for REG (Krahmer et al., 2003) as well as a novel search algorithm, LongestFirst, that functions on the same graph-based representation, to assess their ability to generate referring expressions that contain spatial relations.",
        "We coupled the search algorithms with a number of different approaches to setting the cost functions and preference orders that guide the search.",
        "In Experiment 1, we found that ignoring the cost function (our 0-cost approaches) is not helpful; but the LongestFirst algorithm, which produces longer descriptions, leads to more human-like output for the visuospatial domain we evaluate on than the original Graph-Based Algorithm or the Incremental Algorithm (Dale and Reiter, 1995).",
        "However, in order for spatial relations to be included in a human-like way, it was necessary to take into account speaker preferences.",
        "We modeled these in Experiment 2 by clustering the participants who had contributed to the evaluation corpus based on their referential behaviour.",
        "By training separate cost functions and preference orders for the different clusters, we enabled the LongestFirst algorithm to correctly reproduce 100% of relations used by people who regularly mentioned relations.",
        "Our findings suggest that the graph-based representation proposed by Krahmer et al. (2003) can be used to successfully generate relational descriptions, however their original search algorithm needs to be amended to allow more overspecifica-tion.",
        "Furthermore, we have shown that variation in the referential behaviour of individual speakers has to be taken into account in order to successfully model the use of relations in referring expressions.",
        "We have proposed a clustering approach to advance this goal based directly on the referring behaviour of speakers rather than speaker identity.",
        "We have found that the best models use fine-grained property-based parameters for speakers who tend to use spatial relations, and coarser attribute-based parameters for speakers who tend to use shorter descriptions.",
        "In future work, we hope to expand to more complex domains, beyond the simple properties available in the GRE3D3 Corpus.",
        "We also aim to explore further graph-based representations and search strategies, modeling non-spatial properties as separate vertices, similar to the approach by Croitoru and van Deemter (2007).8 Acknowledgements Viethen and Krahmer received financial support from The Netherlands Organization for Scientific Research, (NWO, Vici grant 277-70-007), and Mitchell received financial support from the Scottish Informatics and Computer Science Alliance (SICSA), which is gratefully acknowledged.References"
      ]
    }
  ]
}
