{
  "info": {
    "authors": [
      "Hsin-Hsi Chen",
      "Ming-Shun Lin",
      "Yu-Chuan Wei"
    ],
    "book": "International Conference on Computational Linguistics and Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P06-1127",
    "title": "Novel Association Measures Using Web Search With Double Checking",
    "url": "https://aclweb.org/anthology/P06-1127",
    "year": 2006
  },
  "references": [
    "acl-J03-3002",
    "acl-J03-3005",
    "acl-P98-1012"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "A web search with double checking model is proposed to explore the web as a live corpus.",
        "Five association measures including variants of Dice, Overlap Ratio, Jaccard, and Cosine, as well as Co-Occurrence Double Check (CODC), are presented.",
        "In the experiments on Ruben-stein-Goodenough’s benchmark data set, the CODC measure achieves correlation coefficient 0.8492, which competes with the performance (0.8914) of the model using WordNet.",
        "The experiments on link detection of named entities using the strategies of direct association, association matrix and scalar association matrix verify that the double-check frequencies are reliable.",
        "Further study on named entity clustering shows that the five measures are quite useful.",
        "In particular, CODC measure is very stable on word-word and name-name experiments.",
        "The application of CODC measure to expand community chains for personal name disambiguation achieves 9.65% and 14.22% increase compared to the system without community expansion.",
        "All the experiments illustrate that the novel model of web search with double checking is feasible for mining associations from the web."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In statistical natural language processing, resources used to compute the statistics are indispensable.",
        "Different kinds of corpora have made available and many language models have been experimented.",
        "One major issue behind the corpus-based approaches is: if corpora adopted can reflect the up-to-date usage.",
        "As we know, languages are live.",
        "New terms and phrases are used in daily life.",
        "How to capture the new usages is an important research topic.",
        "The Web is a heterogeneous document collection.",
        "Huge-scale and dynamic nature are characteristics of the Web.",
        "Regarding the Web as a live corpus becomes an active research topic recently.",
        "How to utilize the huge volume of web data to measure association of information is an important issue.",
        "Resnik and Smith (2003) employ the Web as parallel corpora to provide bilingual sentences for translation models.",
        "Keller and Lapata (2003) show that bigram statistics for English language is correlated between corpus and web counts.",
        "Besides, how to get the word counts and the word association counts from the web pages without scanning over the whole collections is indispensable.",
        "Directly managing the web pages is not an easy task when the Web grows very fast.",
        "Search engine provides some way to return useful information.",
        "Page counts for a query denote how many web pages containing a specific word or a word pair roughly.",
        "Page count is different from word frequency, which denotes how many occurrences a word appear.",
        "Lin and Chen (2004) explore the use of the page counts provided by different search engines to compute the statistics for Chinese segmentation.",
        "In addition to the page counts, snippets returned by web search, are another web data for training.",
        "A snippet consists of a title, a short summary of a web page and a hyperlink to the web page.",
        "Because of the cost to retrieve the full web pages, short summaries are always adopted (Lin, Chen, and Chen, 2005).",
        "Various measures have been proposed to compute the association of objects of different granularity like terms and documents.",
        "Rodríguez and Egenhofer (2003) compute the semantic",
        "Proceedings of the 21st International Conference on Computational Linguistics and 44th Annual Meeting of the ACL, pages 1009–1016, Sydney, July 2006. c©2006 Association for Computational Linguistics similarity from WordNet and SDTS ontology by word matching, feature matching and semantic neighborhood matching.",
        "Li et al.",
        "(2003) investigate how information sources could be used effectively, and propose a new similarity measure combining the shortest path length, depth and local density using WordNet.",
        "Matsuo et al.",
        "(2004) exploit the Jaccard coefficient to build “Web of Trust” on an academic community.",
        "This paper measures the association of terms using snippets returned by web search.",
        "A web search with double checking model is proposed to get the statistics for various association measures in Section 2.",
        "Common words and personal names are used for the experiments in Sections 3 and 4, respectively.",
        "Section 5 demonstrates how to derive communities from the Web using association measures, and employ them to disambiguate personal names.",
        "Finally, Section 6 concludes the remarks."
      ]
    },
    {
      "heading": "2 A Web Search with Double Checking Model",
      "text": [
        "Instead of simple web page counts and complex web page collection, we propose a novel model, a Web Search with Double Checking (WSDC), to analyze snippets.",
        "In WSDC model, two objects X and Y are postulated to have an association if we can find Y from X (a forward process) and find X from Y (a backward process) by web search.",
        "The forward process counts the total occurrences of Y in the top N snippets of query X, denoted as f(Y@X).",
        "Similarly, the backward process counts the total occurrences of X in the top N snippets of query Y, denoted as f(X@Y).",
        "The forward and the backward processes form a double check operation.",
        "Under WSDC model, the association scores between X and Y are defined by various formulas as follows.",
        "Where f(X) is the total occurrences of X in the top N snippets of query X, and, similarly, f(Y) is the total occurrences of Y in the top N snippets of query Y. Formulas (1)-(4) are variants of the Dice, Cosine, Jaccard, and Overlap Ratio association measure.",
        "Formula (5) is a function",
        "CODC (Co-Occurrence Double-Check), which measures the association in an interval [0,1].",
        "In the extreme cases, when f(Y@X)=0 or f(X@Y)=0, CODC(X,Y)=0; and when f(Y@X) =f(X) and f(X@Y) =f(Y), CODC(X,Y)=1.",
        "In the first case, X and Y are of no association.",
        "In the second case, X and Y are of the strongest association."
      ]
    },
    {
      "heading": "3 Association of Common Words",
      "text": [
        "We employ Rubenstein-Goodenough’s (1965) benchmark data set to compare the performance of various association measures.",
        "The data set consists of 65 word pairs.",
        "The similarities between words, called Rubenstein and Goodenough rating (RG rating), were rated on a scale of 0.0 to 4.0 for “semantically unrelated” to “highly synonymous” by 51 human subjects.",
        "The Pearson product-moment correlation coefficient, rxy, between the RG ratings X and the association scores Y computed by a model shown as follows measures the performance of the model.",
        "Where x and y are the sample means of xi and yi, and sx and sy are sample standard deviations of xi and yi and n is total samples.",
        "Most approaches (Resink, 1995; Lin, 1998; Li et al., 2003) used 28 word pairs only.",
        "Resnik (1995) obtained information content from WordNet and achieved correlation coefficient 0.745.",
        "Lin (1998) proposed an information-theoretic similarity measure and achieved a correlation coefficient of 0.8224.",
        "Li et al.",
        "(2003) combined semantic density, path length and depth effect from WordNet and achieved the correlation coefficient 0.8914.",
        "In our experiments on the benchmark data set, we used information from the Web rather than WordNet.",
        "Table 1 summarizes the correlation coefficients between the RG rating and the association scores computed by our WSDC model.",
        "We consider the number of snippets from 100 to 900.",
        "The results show that CODC > VariantCosine > VariantJaccard > VariantOverlap > VariantDice.",
        "CODC measure achieves the best performance 0.8492 when α=0.15 and total snippets to be analyzed are 600.",
        "Matsuo et al.",
        "(2004) used Jaccard coefficient to calculate similarity between personal names using the Web.",
        "The coefficient is defined as follows.",
        "Where f(X∩Y) is the number of pages including X’s and Y’s homepages when query “X and Y” is submitted to a search engine; f(X∪Y) is the number of pages including X’s or Y’s homepages when query “X or Y” is submitted to a search engine.",
        "We revised this formula as follows and evaluated it with Rubenstein-Goodenough’s benchmark.",
        "Where fs(X∩Y) is the number of snippets in which X and Y co-occur in the top N snippets of query “X and Y”; fs(X∪Y) is the number of snippets containing X or Y in the top N snippets of query “X or Y”.",
        "We test the formula on the same benchmark.",
        "The last row of Table 1 shows that Jaccard Coeff* is worse than other models when the number of snippets is larger than 100.",
        "Table 2 lists the results of previous researches (Resink, 1995; Lin, 1998; Li et al., 2003) and our WSDC models using VariantCosine and CODC measures.",
        "The 28 word pairs used in the experiments are shown.",
        "CODC measure can compete with Li et al.",
        "(2003).",
        "The word pair “car-journey” whose similarity value is 0 in the papers (Resink, 1995; Lin, 1998; Li et al., 2003) is captured by our model.",
        "In contrast, our model cannot deal with the two word pairs “crane-implement” and “bird-crane”."
      ]
    },
    {
      "heading": "4 Association of Named Entities",
      "text": [
        "Although the correlation coefficient of WSDC model built on the web is a little worse than that of the model built on WordNet, the Web provides live vocabulary, in particular, named entities.",
        "We will demonstrate how to extend our WSDC method to mine the association of personal names.",
        "That will be difficult to resolve with previous approaches.",
        "We design two experiments – say, link detection test and named entity clustering, to evaluate the association of named entities.",
        "Given a named-entity set L, we define a link detection test to check if any two named entities NEi and NEj (i≠j) in L have a relationship R using the following three strategies.",
        "• Direct Association: If the double check frequency of NEi and NEj is larger than 0,",
        "i.e., f(NEj@NEi)>0 and f(NEi@NEj)>0, then the link detection test says “yes”, i.e., NEi and NEj have direct association.",
        "Otherwise, the test says “no”.",
        "Figure 1(a) shows the direct association.",
        "• Association Matrix: Compose an n×n binary matrix M=(mij), where mij= 1 if",
        "f(NEj@NEi)> 0 and f(NEi@NEj)> 0; mij=0 if f(NEj@NEi)=0 or f(NEi@NEj)=0; and n is total number of named entities in L. Let Mt be a transpose matrix of M. The matrix A=M×Mt is an association matrix.",
        "Here the element aij in A means that total aij common named entities are associated with both NEi and NEj directly.",
        "Figure 1(b) shows a one-layer indirect association.",
        "Here, aij=3.",
        "We can define NEi and NEj have an indirect association if aij is larger than a threshold λ.",
        "That is, NEi and NEj should associate with at least λ common named entities directly.",
        "The strategy of association matrix specifies: if aij≥λ, then the link detection test says “yes”, otherwise it says “no”.",
        "In the example shown in Figure 1(b), NEi and NEj are indirectly associated when 0<λ≤3.",
        "• Scalar Association Matrix: Compose a binary association matrix B from the association matrix A as: bij=1 if aij>0 and bij=0 if aij=0.",
        "The matrix S= B×Bt is a scalar as",
        "sociation matrix.",
        "NEi and NEj may indirectly associate with a common named entity NEk.",
        "Figure 1(c) shows a two-layer indirect association.",
        "The s# = f ° 1 bik × bkj denotes how many such an NEk there are.",
        "In the example of Figure 1(c), two named entities indirectly associate NEi and NEj at the same time.",
        "We can define NEi and NEj have an indirect association if sij is larger than a threshold δ.",
        "In other words, if sij >δ, then the link detection test says “yes”, otherwise it says “no”.",
        "To evaluate the performance of the above three strategies, we prepare a test set extracted from domz web site (http://dmoz.org), the most comprehensive human-edited directory of the Web.",
        "The test data consists of three communities: actor, tennis player, and golfer, shown in Table 3.",
        "Total 220 named entities are considered.",
        "The golden standard of link detection test is: we compose 24,090 (=220×219/2) named entity pairs, and assign “yes” to those pairs belonging to the same community.",
        "When collecting the related values for computing the double check frequencies for any named entity pair (NEi and NEj), i.e., f(NEj@NEi), f(NEi@NEj), f(NEi), and f(NEj), we consider naming styles of persons.",
        "For example, “Alba, Jessica” have four possible writing: “Alba, Jessica”, “Jessica Alba”, “J.",
        "Alba” and “Alba, J.” We will get top N snippets for each naming style, and filter out duplicate snippets as well as snippets of ULRs including dmoz.org and google.com.",
        "Table 4 lists the experimental results of link detection on the test set.",
        "The precisions of two baselines are: guessing all “yes” (46.45%) and guessing all “no” (53.55%).",
        "All the three strategies are better than the two baselines and the performance becomes better when the numbers of snippets increase.",
        "The strategy of direct association shows that using double checks to measure the association of named entities also gets good effects as the association of common words.",
        "For the strategy of association matrix, the best performance 90.14% occurs in the case of 900 snippets and λ=6.",
        "When larger number of snippets is used, a larger threshold is necessary to achieve a better performance.",
        "Figure 2(a) illustrates the relationship between precision and threshold (λ).",
        "The performance decreases when λ>6.",
        "The performance of the strategy of scalar association matrix is better than that of the strategy of association matrix in some λ and δ.",
        "Figure 2(b) shows the relationship between precision and threshold δ for some number of snippets and λ.",
        "In link detection test, we only consider the binary operation of double checks, i.e., f(NEj@NEi) > 0 and f(NEi@NEj) > 0, rather than utilizing the magnitudes of f(NEj@NEi) and f(NEi@NEj).",
        "Next we employ the five formulas proposed in Section 2 to cluster named entities.",
        "The same data set as link detection test is adopted.",
        "An agglomerative average-link clustering algorithm is used to partition the given 220 named entities based on Formulas (1)-(5).",
        "Fourfold cross-validation is employed and B-CUBED metric (Bagga and Baldwin, 1998) is adopted to evaluate the clustering results.",
        "Table 5 summarizes the experimental results.",
        "CODC (Formula 5), which behaves the best in computing association of common words, still achieves the better performance on different numbers of snippets in named entity clustering.",
        "The F-scores of the other formulas are larger than 95% when more snippets are considered to compute the double check frequencies."
      ]
    },
    {
      "heading": "5 Disambiguation Using Association of Named Entities",
      "text": [
        "This section demonstrates how to employ association mined from the Web to resolve the ambiguities of named entities.",
        "Assume there are n named entities, NE1, NE2, ..., and NEn, to be disambiguated.",
        "A named entity NEj has m accompanying names, called cue names later, CNj1, CNj2, ..., CNjm.",
        "We have two alternatives to use the cue names.",
        "One is using them directly, i.e., NEj is represented as a community of cue names Community(NEj)={CNj1, CNj2, ..., CNjm}.",
        "The other is to expand the cue names CNj1, CNj2, ..., CNjm for NEj using the web data as follows.",
        "Let CNj1 be an initial seed.",
        "Figure 3 sketches the concept of community expansion.",
        "(1) Collection: We submit a seed to Google, and select the top N returned snippets.",
        "Then, we use suffix trees to extract possible patterns (Lin and Chen, 2006).",
        "(2) Validation: We calculate CODC score",
        "of each extracted pattern (denoted Bi) with the seed A.",
        "If CODC(A,Bi) is strong enough, i.e., larger than a",
        "threshold θ, we employ Bi as a new seed and repeat steps (1) and (2).",
        "This procedure stops either expected number of nodes is collected or maximum number of layers is reached.",
        "(3) Union: The community initiated by the seed CNji is denoted by Commu",
        "is a new seed.",
        "The Cscore score, community score, of Bjik is the CODC score of Bjik with its parent divided by the layer it is located.",
        "We repeat Collection and Validation steps until all the cue names CNji (1≤i≤m) of NEj are processed.",
        "Finally, we have",
        "In a cascaded personal name disambiguation system (Wei, 2006), association of named entities is used with other cues such as titles, common terms, and so on.",
        "Assume k clusters, c1 c2 ... ck, have been formed using title cue, and we try to place NE1, NE2, ..., and NEl into a suitable cluster.",
        "The cluster c is selected by the similarity measure defined below.",
        "Where pn1, pn2, ..., pns are names which appear in both Community(NEj) and Community(cq); count(pni) is total occurrences of pni in Commu-nity(cq); r is total occurrences of names in Community(NEj); Cscore(pni) is community score of pni.",
        "If score(NEj, c ) is larger than a threshold, then NEj is placed into cluster -c. In other words, NEj denotes the same person as those in c .",
        "We let the new Community(c) be the old Commu-nity(c)∪{CNj1, CNj2, ..., CNjm}.",
        "Otherwise, NEj is left undecided.",
        "To evaluate the personal name disambiguation, we prepare three corpora for an ambiguous name “ 王 I# 'I \" (Chien-Ming Wang) from United Daily News Knowledge Base (UDN), Google Taiwan (TW), and Google China (CN).",
        "Table 6 summarizes the statistics of the test data sets.",
        "In UDN news data set, 37 different persons are mentioned.",
        "Of these, 13 different persons occur more than once.",
        "The most famous person is a pitcher of New York Yankees, which occupies 94.29% of 2,205 documents.",
        "In TW and CN web data sets, there are 24 and 107 different persons.",
        "The majority in TW data set is still the New York Yankees’s “Chien-Ming Wang”.",
        "He appears in 331 web pages, and occupies 88.03%.",
        "Comparatively, the majority in CN data set is a research fellow of Chinese Academy of Social Sciences, and he only occupies 18.29% of 421 web pages.",
        "Total 36 different “Chien-Ming Wang”s occur more than once.",
        "Thus, CN is an unbiased corpus.",
        "Table 7 shows the performance of a personal name disambiguation system without (M1)/with (M2) community expansion.",
        "In the news data set (i.e., UDN), M1 is a little better than M2.",
        "Compared to M1, M2 decreases 0.98% of F-score.",
        "In contrast, in the two web data sets (i.e., TW and CN), M2 is much better than M1.",
        "M2 has 9.65% and 14.22% increases compared to M1.",
        "It shows that mining association of named entities from the Web is very useful to disambiguate ambiguous names.",
        "The application also confirms the effectiveness of the proposed association measures indirectly."
      ]
    },
    {
      "heading": "6 Concluding Remarks",
      "text": [
        "This paper introduces five novel association measures based on web search with double checking (WSDC) model.",
        "In the experiments on association of common words, Co-Occurrence Double Check (CODC) measure competes with the model trained from WordNet.",
        "In the experiments on the association of named entities, which is hard to deal with using WordNet, WSDC model demonstrates its usefulness.",
        "The strategies of direct association, association matrix, and scalar association matrix detect the link between two named entities.",
        "The experiments verify that the double-check frequencies are reliable.",
        "Further study on named entity clustering shows that the five measures – say, VariantDice, VariantOverlap, ariantJaccard, VariantCosine and CODC, are quite useful.",
        "In particular, CODC is very stable on word-word and name-name experiments.",
        "Finally, WSDC model is used to expand community chains for a specific personal name, and CODC measures the association of community member and the personal name.",
        "The application on personal name disambiguation shows that 9.65% and 14.22% increase compared to the system without community expansion."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "Research of this paper was partially supported by National Science Council, Taiwan, under the contracts 94-2752-E-001-001-PAE and 95-2752E-001-001-PAE."
      ]
    }
  ]
}
