{
  "info": {
    "authors": [
      "Marta Tatu",
      "Dan Moldovan"
    ],
    "book": "International Conference on Computational Linguistics and Annual Meeting of the Association for Computational Linguistics – Poster Sessions",
    "id": "acl-P06-2105",
    "title": "A Logic-Based Semantic Approach to Recognizing Textual Entailment",
    "url": "https://aclweb.org/anthology/P06-2105",
    "year": 2006
  },
  "references": [
    "acl-C02-1167",
    "acl-H05-1047",
    "acl-H05-1079",
    "acl-N03-1022",
    "acl-P01-1052",
    "acl-P97-1003"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper proposes a knowledge representation model and a logic proving setting with axioms on demand successfully used for recognizing textual entailments.",
        "It also details a lexical inference system which boosts the performance of the deep semantic oriented approach on the RTE data.",
        "The linear combination of two slightly different logical systems with the third lexical inference system achieves 73.75% accuracy on the RTE 2006 data."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "While communicating, humans use different expressions to convey the same meaning.",
        "One of the central challenges for natural language understanding systems is to determine whether different text fragments have the same meaning or, more generally, if the meaning of one text can be derived from the meaning of another.",
        "A module that recognizes the semantic entailment between two text snippets can be employed by many NLP applications.",
        "For example, Question Answering systems have to identify texts that entail expected answers.",
        "In Multi-document Summarization, the redundant information should be recognized and omitted from the summary.",
        "Trying to boost research in textual inferences, the PASCAL Network proposed the Recognizing Textual Entailment (RTE) challenges (Dagan et al., 2005; Bar-Haim et al., 2006).",
        "For a pair of two text fragments, the task is to determine if the meaning of one text (the entailed hypothesis denoted by ) can be inferred from the meaning of the other text (the entailing text or ).",
        "In this paper, we propose a model to represent the knowledge encoded in text and a logical setting suitable to a recognizing semantic entailment system.",
        "We cast the textual inference problem as a logic implication between meanings.",
        "Text semantically entails if its meaning logically implies the meaning of .",
        "Thus, we, first, transform both text fragments into logic form, capture their meaning by detecting the semantic relations that hold between their constituents and load these rich logic representations into a natural language logic prover to decide if the entailment holds or not.",
        "Figure 1 illustrates our approach to RTE.",
        "The following sections of the paper shall detail the logic proving methodology, our logical representation of text and the various types of axioms that the prover uses.",
        "To our knowledge, there are few logical approaches to RTE.",
        "(Bos and Markert, 2005) represents and into a first-order logic translation of the DRS language used in Discourse Representation Theory (Kamp and Reyle, 1993) and uses a theorem prover and a model builder with some generic, lexical and geographical background knowledge to prove the entailment between the two texts.",
        "(de Salvo Braz et al., 2005) proposes a Description Logic-based knowledge representation language used to induce the representations of and and uses an extended sub-sumption algorithm to check if any of ’s representations obtained through equivalent transformations entails ."
      ]
    },
    {
      "heading": "2 Cogex - A Logic Prover for NLP",
      "text": [
        "Our system uses COGEx (Moldovan et al., 2003), a natural language prover originating from OTTER (McCune, 1994).",
        "Once its set of support is loaded with and the negated hypothesis ( ) and its usable list with the axioms needed to gener",
        "ate inferences, COGEX begins to search for proofs.",
        "To every inference, an appropriate weight is assigned depending on the axiom used for its derivation.",
        "If a refutation is found, the proof is complete; if a refutation cannot be found, then predicate arguments are relaxed.",
        "When argument relaxation fails to produce a refutation, entire predicates are dropped from the negated hypothesis until a refutation is found."
      ]
    },
    {
      "heading": "2.1 Proof scoring algorithm",
      "text": [
        "Once a proof by contradiction is found, its score is computed by starting with an initial perfect score and deducting points for each axiom utilized in the proof, every relaxed argument, and dropped predicate.",
        "The computed score is a measure of the kinds of axioms used in the proof and the significance of the dropped arguments and predicates.",
        "If we assume that both text fragments are existential, then if and only if ’s entities are a subset of ’s entities (Some smart people read Some people read) and penalizing a pair whose contains predicates that cannot be inferred is a correct way to ensure entailment (Some people read Some smart people read).",
        "But, if both and are universally quantified, then the groups mentioned in must be a subset of the ones from (All people read All smart people read and All smart people read All people read).",
        "Thus, the scoring module adds back the points for the modifiers dropped from and subtracts points for ’s modifiers not present in .",
        "The remaining two cases are summarized in Table 1.",
        "Because pairs with longer sentences can potentially drop more predicates and receive a lower score, COGEX normalizes the proof scores by dividing the assessed penalty by the maximum assessable penalty (all the predicates from are dropped).",
        "If this final proof score is above a threshold learned on the development data, then the pair is labeled as positive entailment."
      ]
    },
    {
      "heading": "3 Knowledge Representation",
      "text": [
        "For the textual entailment task, our logic prover uses a two-layered logical representation which captures the syntactic and semantic propositions encoded in a text fragment."
      ]
    },
    {
      "heading": "3.1 Logic Form Transformation",
      "text": [
        "In the first stage of our representation process, COGEX converts and into logic forms (Moldovan and Rus, 2001).",
        "More specifically, a predicate is created for each noun, verb, adjective and adverb.",
        "The nouns that form a noun compound are gathered under a nn NNC predicate.",
        "Each named entity class of a noun has a corresponding predicate which shares its argument with the noun predicate it modifies.",
        "Predicates for",
        "prepositions and conjunctions are also added to link the text’s constituents.",
        "This syntactic layer of the logic representation is, automatically, derived from a full parse tree and acknowledges syntax-based relationships such as: syntactic subjects, syntactic objects, prepositional attachments, complex nominals, and adjectival/adverbial adjuncts.",
        "In order to objectively evaluate our representation, we derived it from two different sources: constituency parse trees (generated with our implementation of (Collins, 1997)) and dependency parse trees (created using Minipar (Lin, 1998))1.",
        "The two logic forms are slightly different.",
        "The dependency representation captures more accurately the syntactic dependencies between the concepts, but lacks the semantic information that our semantic parser extracts from the constituency parse trees.",
        "For instance, the sentence Gilda Flores was kidnapped on the 13th of January 19902 is “constituency” represented as Gilda NN (x1) & Flores NN (x2) & nn NNC (x3, x1, x2) & human NE (x3) & kidnap VB (e1, x9, x3) & on IN (e1, x8) & 13th NN(x4) & of NN(x5) &"
      ]
    },
    {
      "heading": "3.1.1 Negation",
      "text": [
        "The exceptions to the one-predicate-per-open-class-word rule include the adverbs not and never.",
        "In cases similar to further details were not released, the system removes 1 The experimental results described in this paper were performed using two systems: the logic prover when it receives as input the constituency logic representation (COGEx ) and the dependency representation (COGEx ).",
        "2All examples shown in this paper are from the entailment corpus released as part of the Second RTE challenge (www.pascal-network.org/Challenges/RTE2).",
        "The RTE datasets will be described in Section 7. not RB (x3, e1) and negates the verb’s predicate (-release VB (e1, x1, x2) ).",
        "Similarly, for nouns whose determiner is no, for example, No case of indigenously acquired rabies infection has been confirmed, the verb’s predicate is negated (case NN (x 1) & confirm VB (e2, x15, x1))."
      ]
    },
    {
      "heading": "3.2 Semantic Relations",
      "text": [
        "The second layer of our logic representation adds the semantic relations, the underlying relationships between concepts.",
        "They provide the semantic background for the text, which allows for a denser connectivity between the concepts expressed in text.",
        "Our semantic parser takes free English text or parsed sentences and extracts a rich set of semantic relations3 between words or concepts in each sentence.",
        "It focuses not only on the verb and its arguments, but also on semantic relations encoded in syntactic patterns such as complex nominals, genitives, adjectival phrases, and adjectival clauses.",
        "Our representation module maps each semantic relation identified by the parser to a predicate whose arguments are the events and entities that participate in the relation and it adds these semantic predicates to the logic form.",
        "For example, the previous logic form is augmented with the THEME SR (x3, e 1) & TIME S R (x 8 , e 1) relations4 (Gilda Flores is the theme of the kidnap event and 13th ofJanuary 1990 shows the time of the kidnapping)."
      ]
    },
    {
      "heading": "3.3 Temporal Representation",
      "text": [
        "In addition to the semantic predicates, we represent every date/time into a normalized form time TMP (BeginFn (event), year, month, date, hour, minute, second) & time TMP (EndFn (event) , year, month, date, hour, minute, second).",
        "Furthermore, temporal reasoning",
        "predicates are derived from both the detected semantic relations as well as from a module which utilizes a learning algorithm to detect temporally ordered events ( , where is the temporal signal linking two events and ) (Moldovan et al., 2005).",
        "From each triple, temporally related SUMO predicates are generated based on hand-coded rules for the signal classes ( sequence, earlier TMP (e1,e2), contain, during TMP (e1, e2) , etc.).",
        "In the above example, 13th of January 1990 is normalized to the interval time TMP (BeginFn (e2), 1990, 1, 13, 0, 0, 0) & time TMP (EndFn (e2) , 1990, 1, 13, 23, 59, 59) and during TMP (e1, e2) is added to the logical representation to show when the kidnapping occurred."
      ]
    },
    {
      "heading": "4 Axioms on Demand",
      "text": [
        "COGEx’s usable list consists of all the axioms generated either automatically or by hand.",
        "The system generates axioms on demand for a given pair whenever the semantic connectivity between two concepts needs to be established in a proof.",
        "The axioms on demand are lexical chains and world knowledge axioms.",
        "We are keen on the idea of axioms on demand since it is not possible to derive apriori all axioms needed in an arbitrary proof.",
        "This brings a considerable level of robustness to our entailment system."
      ]
    },
    {
      "heading": "4.1 eXtended WordNet lexical chains",
      "text": [
        "For the semantic entailment task, the ability to recognize two semantically-related words is an important requirement.",
        "Therefore, we automatically construct lexical chains of WordNet relations from ’s constituents to ’s (Moldovan and Novischi, 2002).",
        "In order to avoid errors introduced by a Word Sense Disambiguation system, we used the first senses for each word5 unless the source and the target of the chain are synonyms.",
        "If a chain exists6, the system generates, on demand, an axiom with the predicates of the source (from ) and the target (from ).",
        "For example, given the ISA relation between murder#1 and kill#1, the system generates, when needed, the axiom murder VB (e1, x1, x2) kill VB (e1, x 1, x2).",
        "The remaining of this section details some of the requirements for creating accurate lexical chains.",
        "Because our extended version of WordNet has attached named entities to each noun synset, the lexical chain axioms append the entity name of the target concept, whenever it exists.",
        "For example, the logic prover uses the axiom Nicaraguan JJ (x1, x2) Nicaragua NN (x1) & country NE (x1) when it tries to infer electoral campaign is held in Nicaragua from Nicaraguan electoral campaign.",
        "We ensured the relevance of the lexical chains by limiting the path length to three relations and the set of WordNet relations used to create the chains by discarding the paths that contain certain relations in a particular order.",
        "For example, the automatic axiom generation module does not consider chains with an IS-A relation followed by a HYPONYMY link ( ).",
        "Similarly, the system rejected chains with more than one HYPONYMY relations.",
        "Although these relations link semantically related concepts, the type of semantic similarity they introduce is not suited for inferences.",
        "Another restriction imposed on the lexical chains generated for entailment is not to start from or include too general concepts7.",
        "Therefore, we assigned to each noun and verb synset from WordNet a generality weight based on its relative position within its hierarchy and on its frequency in a large corpus.",
        "If is the depth of concept , is the maximum depth in ’s hierarchy and is the information content of measured on the British National Corpus, then In our experiments, we discarded the chains with concepts whose generality weight exceeded 0.8 such as object NN#1, act VB#1, be VB#1, etc.",
        "Another important change that we introduced in our extension of WordNet is the refinement of the DERIVATION relation which links verbs with their corresponding nominalized nouns.",
        "Because the relation is ambiguous regarding the role of the noun, we split",
        "this relation in three: ACT-DERIVATION, AGENT-DERIVATION and THEME-DERIVATION.",
        "The role of the nominalization determines the argument given to the noun predicate.",
        "For instance, the axioms act V B (e1, x 1, x2) acting NN (e1) (ACT), act VB (e1, x1, x2) actor NN (x 1) (AGENT) reflect different types of derivation."
      ]
    },
    {
      "heading": "4.2 NLP Axioms",
      "text": [
        "Our NLP axioms are linguistic rewriting rules that help break down complex logic structures and express syntactic equivalence.",
        "After analyzing the logic form and the parse trees of each text fragment, the system, automatically, generates axioms to break down complex nominals and coordinating conjunctions into their constituents so that other axioms can be applied, individually, to the components.",
        "These axioms are made available only to the pair that generated them.",
        "For example, the axiom nn NNC (x3, x 1, x2) & francisco NN (x1) & merino NN (x2) merino NN (x3) breaks down the noun compound Francisco Merino into Francisco and Merino and helps COGEX infer Merino’s home from Francisco Merino’s home."
      ]
    },
    {
      "heading": "4.3 World Knowledge Axioms",
      "text": [
        "Because, sometimes, the lexical or the syntactic knowledge cannot solve an entailment pair, we exploit the WordNet glosses, an abundant source of world knowledge.",
        "We used the logic forms of the glosses provided by eXtended WordNet8 to, automatically, create our world knowledge axioms.",
        "For example, the first sense of noun Pope and its definition the head of the Roman Catholic Church introduces the axiom Pope NN (x1) head NN(x1) & of IN(x1,x2) & Roman Catholic Church NN (x2) which is used by prover to show the entailment between : A place of sorrow, after Pope John Paul II died, became a place of celebration, as Roman Catholic faithful gathered in downtown Chicago to mark the installation of new Pope Benedict XVI.",
        "and : Pope Benedict XVI is the new leader of the Roman Catholic Church.",
        "We also incorporate in our system a small common-sense knowledge base of 383 hand-coded world knowledge axioms, where 153 have been manually designed based on the entire de",
        "velopment set data, and 230 originate from previous projects.",
        "These axioms express knowledge that could not be derived from WordNet regarding employment9, family relations, awards, etc."
      ]
    },
    {
      "heading": "5 Semantic Calculus",
      "text": [
        "The Semantic Calculus axioms combine two semantic relations identified within a text fragment and increase the semantic connectivity of the text (Tatu and Moldovan, 2005).",
        "A semantic axiom which combines two relations, and , is devised by observing the semantic connection between the and words for which there exists at least one other word, , such that ( ) and ( ) hold true.",
        "We note that not any two semantic relations can be combined: and have to be compatible with respect to the part-of-speech of the common argument.",
        "Depending on their properties, there are up to 8 combinations between any two semantic relations and their inverses, not counting the combinations between a semantic relation and itself10.",
        "Many combinations are not semantically significant, for example, KINSHIP SR (x1, x2) & TEMPORAL SR (x2, e 1) is unlikely to be found in text.",
        "Trying to solve the semantic combinations one comes upon in text corpora, we analyzed the RTE development corpora and devised rules for some of the combinations encountered.",
        "We validated these axioms by checking all the pairs from the LA Times text collection such that holds.",
        "We have identified 82 semantic axioms that show how semantic relations can be combined.",
        "These axioms enable inference of unstated meaning from the semantics detected in text.",
        "For example, if states explicitly the KINSHIP (KIN) relations between Nicholas Cage and Alice Kim Cage and between Alice Kim Cage and Kal-el Coppola Cage, the logic prover uses the KIN SR (x1, x2) & KIN SR (x2, x3) KIN SR (x 1, x3) semantic axiom (the transitivity of the blood relation) and the symmetry of this relationship (KIN SR (x 1, x2)",
        "KIN SR (x2, x1) ) to infer ’s statement (KIN(Kal-el Coppola Cage, Nicholas Cage)).",
        "Another frequent axiom is LOCATION SR (x1, x2) & PARTWHOLE SR(x2,x3) LOCATION SR (x1, x3) .",
        "Given the text John lives in Dallas, Texas and using the axiom, the system infers that John lives in Texas.",
        "The system applies the 82 axioms independent of the concepts involved in the semantic composition.",
        "There are rules that can be applied only if the concepts that participate satisfy a certain condition or if the relations are of a certain type.",
        "For example, LOCATION SR (x1, x2) & LOCATION SR (x2, x3) LOCATION SR (x1, x3) only if the LOCATION relation shows inclusion (John is in the car in the garage LOCATION SR (John, garage) .",
        "John is near the car behind the garage"
      ]
    },
    {
      "heading": "LOCATION SR (John, garage)). 6 Temporal Axioms",
      "text": [
        "One of the types of temporal axioms that we load in our logic prover links specific dates to more general time intervals.",
        "For example, October 2000 entails the year 2000.",
        "These axioms are automatically generated before the search for a proof starts.",
        "Additionally, the prover uses a SUMO knowledge base of temporal reasoning axioms that consists of axioms for a representation of time points and time intervals, Allen (Allen, 1991) primitives, and temporal functions.",
        "For example, during is a transitive Allen primitive: during TM P (e1, e2) & during TMP(e2,e3) during TMP (e1, e3) ."
      ]
    },
    {
      "heading": "7 Experiments and Results",
      "text": [
        "The benchmark corpus for the RTE 2005 task consists of seven subsets with a 50%-50% split between the positive entailment examples and the negative ones.",
        "Each subgroup corresponds to a different NLP application: Information Retrival (IR), Comparable Documents (CD), Reading Comprehension (RC), Question Answering (QA), Information Extraction (IE), Machine Translation (MT), and Paraphrase Acquisition (PP).",
        "The RTE data set includes 1367 English pairs from the news domain (political, economical, etc.).",
        "The RTE 2006 data covered only four NLP tasks (IE, IR, QA and Multi-document Summarization (SUM)) with an identical split between positive and negative examples.",
        "Table 2 presents the data statistics."
      ]
    },
    {
      "heading": "7.1 COGEX’s Results",
      "text": [
        "Tables 3 and 4 summarize COGEX’s performance on the RTE datasets, when it received as input the different-source logic forms11.",
        "On the RTE 2005 data, the overall performance on the test set is similar for both logic proving runs, COGEX and COGEX .",
        "On the development set, the semantically enhanced logic forms helped the prover distinguish better the positive entailments (COGEX has an overall higher precision than COGEX ).",
        "If we analyze the performance on the test data, then COGEX performs slightly better on MT, CD and PP and worse on the RC, IR and QA tasks.",
        "The major differences between the two logic forms are the semantic content (incomplete for the dependency-derived logic forms) and, because the text’s tokenization is different, the number of predicates in ’s logic forms is different which leads to completely different proof scores.",
        "On the RTE 2006 test data, the system which uses the dependency logic forms outperforms COGEX .",
        "COGEX performs better on almost all tasks (except SUM) and brings a significant improvement over COGEX on the IR task.",
        "Some of the positive examples that the systems did not label correctly require world knowledge that we do not have encoded in our axiom set.",
        "One example for which both systems returned the wrong answer is pair 353 (test 2006) where, from China’s decade-long practice of keeping its currency valued at around 8.28 yuan to the dollar, the system should recognize the relation between the yuan and China’s currency and infer that the currency used in China is the yuan because a country’s currency currency used in the country.",
        "Some of the pairs that the prover, currently, cannot handle involve numeric calculus and human-oriented estimations.",
        "Consider, for example, pair 359 (dev set, RTE 2006) labeled as positive, for which the logic prover could not determine that 15 safety violations numerous safety violations.",
        "The deeper analysis of the systems’ output",
        "showed that while WordNet lexical chains and NLP axioms are the most frequently used axioms throughout the proofs, the semantic and temporal axioms bring the highest improvement in accuracy, for the RTE data."
      ]
    },
    {
      "heading": "7.2 Lexical Alignment",
      "text": [
        "Inspired by the positive examples whose is in a high degree lexically subsumed by , we developed a shallow system which measures their overlap by computing an edit distance between the text and the hypothesis.",
        "The cost of deleting a word from is equal to 0, the cost of replacing a word from with another from , where and and are not synonyms in WordNet equal to (we do not allow replace operations) and the cost of inserting a word from varies with the part-of-speech of the inserted word (higher values for WordNet nouns, adjectives or adverbs, lower for verbs and a minimum value for everything else).",
        "Table 5 shows a minimum cost alignment.",
        "The performance of this lexical method (LEXALIGN) is shown in Tables 3 and 4.",
        "The alignment technique performs significantly better on the pairs in the CD (RTE 2005) and SUM (RTE 2006) tasks.",
        "For these tasks, all three systems performed the best because the text of false pairs is not entailing the hypothesis even at the lexical level.",
        "For pair 682 (test set, RTE 2006), and have very few words overlapping and there are no axioms that can be used to derive knowledge that supports the hypothesis.",
        "Contrarily, for the IE task, the systems were fooled by the high word overlap between and .",
        "For example, pair 678’s text (test set, RTE 2006) contains the entire hypothesis in its if clause.",
        "For this task, we had the highest number of false positives, around double when compared to the other applications.",
        "LEXALIGN works surprisingly well on the RTE data.",
        "It outperforms the semantic systems on the 2005 QA test data, but it has its limitations.",
        "The logic representations are generated from parse trees which are not always accurate ( 86% accuracy).",
        "Once syntactic and semantic parsers are perfected, the logical semantic approach shall prove its potential."
      ]
    },
    {
      "heading": "7.3 Merging three systems",
      "text": [
        "Because the two logical representations and the lexical method are very different and perform better on different sets of tasks, we combined the scores returned by each system 12 to see if a mixed approach performs better than each individual method.",
        "For each NLP task, we built a classifier based on the linear combination of the three scores.",
        "Each task’s classifier labels pair as positive if 12 Each system returns a score between 0 and 1, a number close to 0 indicating a probable negative example and a number close to 1 indicating a probable positive example.",
        "Each",
        ", where the optimum values of the classifier’s real-valued parameters ( ) were determined using a grid search on each development set.",
        "Given the different nature of each application, the parameters vary with each task.",
        "For example, the final score given to each IE 2006 pair is highly dependent on the score given by COGEX when it received as input the logic forms created from the constituency parse trees with a small correction from the dependency parse trees logic form system13.",
        "For the IE task, the lexical alignment performs the worst among the three systems.",
        "On the other hand, for the IR task, the score given by LEXALIGN is taken into account14.",
        "Tables 3 and 4 summarize the performance of the three system combination.",
        "This hybrid approach performs better than all other systems for all measures on all tasks.",
        "It displays the same behavior as its depen-dents: high accuracy on the CD and SUM tasks and many false positives for the IE task."
      ]
    },
    {
      "heading": "8 Conclusion",
      "text": [
        "In this paper, we present a logic form representation of knowledge which captures syntactic dependencies as well as semantic relations between concepts and includes special temporal predicates.",
        "We implemented several changes to our WordNet lexical chains module which lead to fewer unsound axioms and incorporated in our logic prover semantic and temporal axioms which decrease its dependence on world knowledge.",
        "We plan to improve our logic prover to detect false entailments even when the two texts have a high word overlap and expand our axiom set."
      ]
    }
  ]
}
