{
  "info": {
    "authors": [
      "Johan Bos",
      "Alexander Koller"
    ],
    "book": "Proceedings of the Fifth International Workshop on Inference in Computational Semantics",
    "id": "acl-W06-3900",
    "title": "Proceedings of the Fifth International Workshop on Inference in Computational Semantics",
    "url": "https://aclweb.org/anthology/W06-3900",
    "year": 2006
  },
  "references": [],
  "sections": [
    {
      "text": [
        "inference is one of its most pressing tasks.",
        "On the theoretical side, it is clear that inference plays a key role in such areas as semantic construction and the management of discourse and dialogue.",
        "On the practical side, the use of sophisticated inference methods is expected to play a crucial role in such application areas as natural language generation, automatic question answering, and spoken dialogue systems.",
        "At the same time, inference tools and resources have matured to the point that they can become useful for actual applications.",
        "Automated theorem provers and other inference tools are becoming increasingly robust and efficient.",
        "And the world knowledge bottleneck is being addressed from different angles, by the manual development of knowledge resources, the merging of existing such resources, and the automated extraction of world knowledge from corpora.",
        "The Inference in Computational Semantics (ICoS) workshops are intended to bring together researchers from areas such as Computational Linguistics, Artificial Intelligence, Computer Science, Formal Semantics, and Logic, to discuss approaches to, and applications of, inference in natural language semantics.",
        "ICoS-1 took place in Amsterdam, the Netherlands, on August 15, 1999.",
        "ICoS-2 was organised in Dagstuhl Castle, Germany, on July 29?30, 2000.",
        "ICoS-3 was co-located with the International Joint Conference on Automated Reasoning (IJCAR 2001), which took place on June 18?23, 2001 at Siena, Italy.",
        "ICoS-4 took place in Nancy, France, on September 25?26, 2003.",
        "Welcome to ICoS-5 ICoS-5 is organised as a two-day event at the University of Derby College, Buxton, England, taking place on April 20?21.",
        "The programme features three invited presentations (by Christian Ebert, Patrick Pantel, and Stephen Pulman).",
        "In addition, we have selected twelve regular papers from 24 submissions, which span topics ranging from the use of inference techniques for formal and computational semantics, over new methods for knowledge extraction from corpora, to NLP applications that use inference tools.",
        "We have accepted six of the remaining submissions as ?short papers?.",
        "These papers will be presented as posters and demos at the workshop, and we believe that this new format will be a worthwhile experience both for authors and for participants.",
        "We would like to thank the members of the programme committee, who produced highly informative reviews and made it possible to set up the broad and strong program for ICoS5.",
        "Finally, we are very grateful to the local organisers, Ian Pratt-Hartmann and Allan Ramsay, who did a flawless job of preparing what promises to be a wonderful workshop location for us.",
        "My talk will be about two requirements on Underspecified Representation Formalisms in the context of underspecification of scope.",
        "The requirement on partial disambiguation, stating that partially disambiguated ambiguities need to be represented, does not carry much content unless it has become clear, exactly what those ambiguities are.",
        "In line with Ko?nig and Reyle [1999], I will argue that all theoretically possible patterns of ambiguity, i.e. subsets of readings, can occur in natural language, in particular when underspecified representations are assumed to represent patterns of ambiguity that arise through disambiguation by discourse or even by world knowledge.",
        "Therefore an underspecified representation formalism can only be regarded as expressively complete, if it provides representations for all potential subsets of readings.",
        "Taking a closer look at recent prominent approaches to scope underspecification, namely Hole Semantics [Bos, 2002], Minimal Recursion Semantics [Copestake et al., 1999], and Normal Dominance Constraints [Koller, 2004], it turns out that none of these formalisms is expressively complete.",
        "Furthermore, these incompleteness results allow for a straightforward comparison of the discussed approaches with respect to expressive power.",
        "The second requirement is the avoidance of combinatorial explosion.",
        "I will argue that the decisive process that determines the efficiency of an underspecification approach is the construction phase of the representations and not so much the check for satisfiability or enumeration of readings.",
        "Thus the desired avoidance of combinatorial explosion comes down to a requirement on a feasible construction procedure and hence to a requirement on the maximal ?size?",
        "of the representations, which can only be fulfilled if the involved representations are in some sense more compact than the mere listing of the available readings.",
        "Unfortunately it turns out that due to the rapid growth of the number of potential patterns of ambiguity, the two requirements of compactness and expressive completeness cannot be fulfilled at the same time.",
        "In other words, I will show that any underspecified representation formalism must necessarily miss out on some of the potential patterns of ambiguity or run into the combinatorial explosion problem [Ebert, 2005]."
      ]
    }
  ]
}
