{
  "info": {
    "authors": [
      "JunWon Kwak",
      "UngMo Kim"
    ],
    "book": "Proceedings of OntoLex 2005 – Ontologies and Lexical Resources",
    "id": "acl-I05-7006",
    "title": "Interaction of Context Descriptor and Ontology for Semantic Service Discovery in Ubiquitous environment",
    "url": "https://aclweb.org/anthology/I05-7006",
    "year": 2005
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The ubiquitous computing vision is to make knowledge and service easily available in our everyday environment.",
        "A wide range of devices, applications and services can be interconnected to provide intelligent and automatic systems that make our lives and more enjoyable and our workplaces more efficient.",
        "Before services can be used, they first have to be found.",
        "Service discovery is a mechanism for finding services.",
        "Current mechanisms are syntactic methods (i.e. they match service requests and descriptions of service offerings based on keywords) which often lead to a poor quality result.",
        "This our work focuses on how the quality of the service discovery result can be improved.",
        "Service discovery quality denotes the extent to which a returned match is relevant for the user.",
        "Interaction of Ontology and context descriptor is to improve quality of result for service discovery interoperability of a between user and service provider."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In the Ubiquitous Computing [8] (ubicomp) vision of the future, workplaces, homes and public environments will contain a wide range of networked devices intended to make workplaces more efficient, to increase quality of life, and empower users by providing information and services in an effortless way.",
        "Current networked environments are populated with a diverse set of devices, services and computational entities.",
        "Enabling these components to work together harmoniously and allowing users and applications to interact with them without considerable administrative and configuration overhead poses a number of logistical and technical challenges.",
        "As a result, there has recently been considerable research into service location and device interaction technologies, including Jini technology [5,10], SLP [4, 14],UPnP [1].",
        "The key function of such service location and device interaction technologies is to allow users and applications to deploy, discover and interact with the services provided by devices and software components on the network.",
        "This interaction is required to occur without the users, the applications, or the service providers needing detailed knowledge of the local network configuration.",
        "While these technologies were originally developed for zero configuration networks (e.g. those aimed at installation in the home en* This work was supported in part by Ubiquitous computing Technology Research Institute(UTRI) funded by the Korean Ministry of Information vironment) researchers have recently begun to investigate how they can be used to support aspects of mobile and ubiquitous computing (e.g. enabling a user in an unfamiliar network to discover nearby printers from their laptop).",
        "We believe that these future service environments will be characterised by a heterogeneous mix of services and technologies.",
        "Moreover, contextual information plays a crucial role in the service discovery process.",
        "In particular, devices, applications and users will need to interact with multiple, potentially specialised, service location and device interaction technologies.",
        "Based on an analysis of existing approaches to service discovery and interaction, we have identified a number of shortcomings that we believe will seriously impact on the scalability, efficiency, utility and usability of current techniques in emerging service environments.",
        "In this paper we present a design for a new semantic service discovery that combines the strengths of service discovery and interaction of context descriptor and ontology.",
        "Semantic service discovery is new mechanism to reduce semantic gap of a between user and provider.",
        "After a short introduction to service discovery technique (Section 2), Section 3 describe semantic service discovery propose in this paper.",
        "Section 4 describe difference for performance of a between proposed system and current existing service discovery.",
        "Finally, we present our summary and conclusions, in Section 5."
      ]
    },
    {
      "heading": "2 Service Discovery Technique",
      "text": [
        "Jini technology [5, 10] is designed to help people build systems that deal gracefully with a fundamental characteristic of any distributed system: change.",
        "This appendix presents a quick introduction to Jini technology, and shows how Jini technology helps manage change within an operational distributed system.",
        "Jini technology is used to build systems that exhibit a service-oriented architecture.",
        "Functionality on the network is divided into, and provided by, discrete services.",
        "In Jini technology, each service is represented by an object called a Jini service proxy.",
        "If a client wants to use a service, the client obtains a proxy for the service.",
        "The client then invokes methods (or functions) on the service proxy, and the proxy takes care of fulfilling the promised service, including possibly talking across the network to a server or other entity.",
        "A fundamental kind of change in a distributed system happens whenever new participants join the system or others move around the network.",
        "If a client wants to use a service that just arrived or was recently relocated on the network, how does that client find the service?",
        "Jini technology addresses these issues by providing a lookup service where clients can find services they want to use.",
        "In addition, Jini technology provides a set of discovery protocols that enable Jini clients to find lookup services with no prior knowledge of their location.",
        "If a client desires to use a service for the first time, the client can find that service's proxy in the Jini lookup service.",
        "If that service later moves, the client can still find the service via the Jini lookup service.",
        "If the lookup service moves, the client can locate that lookup service via the discovery protocols.",
        "Once a client has obtained a proxy to a desired service via a Jini lookup service, the client uses the proxy to interact with the service directly, without further involvement from the lookup service.",
        "The Service Location Protocol (SLP) is a product of the Service Location Protocol Working Group (SVRLOC) of the Internet Engineering Task Force (IETF) [4, 14].",
        "It is a protocol for automatic resource discovery on Internet Protocol based networks.",
        "SLP is a language independent protocol.",
        "Thus the protocol specification can be implemented in any language.",
        "It bases its discovery mechanism on service attributes, which are essentially different ways of describing a service.",
        "It can cater to both hardware and software forms of services.",
        "The SLP infrastructure consists of three types of agents:",
        "1.",
        "User Agents 2.",
        "Service Agents 3.",
        "Directory Agents UAs discover locations and settings needed by the potential user of the service; SAs advertise the availability of services; and DAs act as brokers, caching information about services.",
        "The system can operate in two modes – with or without DAs.",
        "When operating without DAs, the UA will send a multicast request for services, and will receive unicast replies.",
        "When there are DAs present, SAs will attempt to register with a DA, and UAs will send all discovery requests to these brokers.",
        "Service descriptions in SLP are very basic 'Service URLs' that categorize service types.",
        "SLP offers the following services: 1.",
        "Obtaining service handles for User Agents.",
        "2.",
        "Maintaining the directory of advertised services.",
        "3.",
        "Discovering available service attributes.",
        "4.",
        "Discovering available Directory Agents.",
        "5.",
        "Discovering the available types of Service Agents.",
        "( Service!",
        "A service is described by configuration values of the attributes possible for that service.",
        "For instance, a service that allows users to download audio or video content can be described as a service that is a pay-per-use real-time service or a free-of-charge service.",
        "The SLP also supports a simple service registration leasing mechanism that handles the cases where service hardware is broken but the services continue to be advertised.",
        "Universal Plug and Play (UPnP), pushed primarily by Microsoft, is an evolving architecture designed to extend the original Microsoft Plug and Play peripheral model to a highly dynamic world of many network devices supplied by many vendors [1].",
        "UPnP works primarily at lower layer network protocols suites (i.e. TCP/IP), implementing standards at this level.",
        "UPnP attempts to ensure that all device manufacturers can quickly adhere to the proposed standard without major hassles.",
        "By providing a set of defined network protocols UPnP allows devices to build their own Application Programming Interfaces that implement these protocols - in whatever language or platform they choose.",
        "UPnP uses the Simple Service Discovery Protocol (SSDP) to discover services on Internet Protocol based networks.",
        "SSDP can be operated with or without a lookup or directory service in the network.",
        "SSDP operates on the top of the existing open standard protocols, using the Hypertext Transfer Protocol over both unicast User Datagram Protocol and multicast User Datagram Protocol.",
        "The registration process sends and receives data in hypertext format, but has some special semantics.",
        "The Open Service Gateway Initiative (OSGi) [7, 12] Alliance is an open forum in which major companies participate (e.g. Samsung, Siemens).",
        "Their mission is to specify, create, advance, and promote an open Service Platform for the delivery and management of multiple applications and services to all types of networked devices in home, vehicle, mobile and other environments.",
        "The alliance was founded in 1999 and at this moment version three of the specification is released.",
        "The mission of the OSGi alliance is to create an open specification for the network delivery of managed services to local networks and devices.",
        "The efforts of the alliance resulted in the OSGi platform specification.",
        "This specification describes a framework for an open and common architecture for service providers, developers, software vendors, gateway operators and equipment vendors to develop, deploy and manage services in a coordinated fashion The OSGi specification describes much more than service discovery alone.",
        "The complete platform specification is too extensive to describe completely in this section.",
        "Furthermore, parts of the framework are out of the scope of this research.",
        "Therefore, we will focus solely on the service discovery mechanisms of the OSGi platform in this section.",
        "The OSGi platform defines a java platform for service provisioning.",
        "The functionality of services is implemented by bundles.",
        "Bundles are a collection of java classes that can provide functionality to end users or other services.",
        "Services are described by their java service interfaces.",
        "The interface and the implementation classes together are used as a service reference.",
        "Furthermore, pairs of key/value can be used to specify some property of the service.",
        "The service is registered by the service provider in a central service registry, meaning that a centralized service discovery model is applied (see Figure.2).",
        "After the services are registered in the service registry a service requestor can discovery the services by requesting service references (can be used to invoke the service).",
        "The request can be based on the name of the interface (syntactical matchmaking) or based on the defined properties using filters.",
        "By using retrieval methods on the service reference, properties of the service can be read and the requestor can determine which service it wants to use.",
        "Historically, ontology is a part of metaphysics.",
        "Metaphysics is the branch of philosophy concerned with the nature of ultimate reality.",
        "It is customarily divided into ontology, which deals with the question of which fundamentally distinct sorts of entities compose the universe, and metaphysics proper, which is concerned with describing the most general traits of reality.",
        "The word 'ontology' originated in the Greek language, meaning \"the study of being\".",
        "Currently, ontologies have also been used in computer science.",
        "In the beginning, they where developed in Artificial Intelligence to facilitate knowledge sharing and reuse.",
        "More recently, they have also been used in information retrieval, electronic commerce and knowledge management.",
        "They have been developed to provide ma-chine-processable semantics of information sources that can be communicated between entities.",
        "Ontologies can be defined as: \"a formal, explicit definition of a shared conceptualization\" [3].",
        "A 'conceptualization' refers to an abstract model of some phenomenon in the world that identifies the relevant concepts of that phenomenon.",
        "'Explicit' means that the used concepts and their constraints should be explicitly described and 'formal' means that the ontology should be machine-readable."
      ]
    },
    {
      "heading": "3 Semantic Service Discovery",
      "text": [
        "As an example, we have included a part of the description of an MP3 Server.",
        "This entity maintains a set of songs in MP3 format in its database.",
        "It allows other entities to search this set of songs using various parameters like name of artist, type of song, etc.",
        "It can also be sent commands for playing songs - other entities can either request a particular song to be played or a random song to be played.",
        "In addition, there is a human-understandable description about the entity.",
        "This is specifically meant for the average user who wants to know more about the entity in a simple language.",
        "A key feature of applications in pervasive computing environments is that they are context-aware, i.e. they are able to obtain the current context and adapt their behavior to different situations.",
        "For example, a music player application in a smart room may automatically play a different song depending on who is in the room, in addition, it may decide on the song volume, depending on the time of day.",
        "Context descriptor [15] has rules that describe what actions should be taken in different contexts.",
        "An example of a rule is : IF location (Alice, Entering, Room 3231) AND Time (morning) THEN play a classic song.",
        "A rule consists of a condition, which if satisfied, leads to a certain action being performed.",
        "The condition is a Boolean expression consisting of predicates based on context information.",
        "The system architecture of a semantic service discovery is equal to the Figure 4._ 1.",
        "The interpreter module extracts and aggregates data from sensors.",
        "The reasoning engine produces new situation information based on the aggregated data.",
        "This section evaluates our system approach by calculating precision and recall rates.",
        "Consider a set of relevant services (R) within a big set of advertised services (A) (R £ A).",
        "We define: Recall: The number of relevant items retrieved, divided by the total number of relevant items in the collection.",
        "The highest value of recall is achieved when all relevant items are retrieved.",
        "Precision: The number of relevant items retrieved, divided by the total number of items retrieved.",
        "The highest value of precision is achieved when only relevant items are retrieved.",
        "With the result, we calculated the recall and precision rates.",
        "We compared these calculations with queries using current syntactic mechanisms (i.e. keyword and table based approaches).",
        "Query 1: \"Discover all services that sell Music\" This means that in our system all service types are selected and that \"Music\" is selected as output."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "We have proposed a semantic service discovery approach, improving the quality of the service discovery result.",
        "Efforts towards this approach included (i) the identification of limiting factors for the quality of service discovery in current approaches (ii) the identification of types of service discovery matches and the definition of the degree of matching these (iii) the development of a novel service discovery approach, improving the service discovery result and finally (iv) the evaluation of the novel approach.",
        "Some challenging future research areas must be addressed.",
        "Scalability and performance must be considered.",
        "Continuous researches regarding ontology maintenance and ontology relations for enhanced semantic reasoning are also required."
      ]
    }
  ]
}
