{
  "info": {
    "authors": [
      "Adam Kilgarriff",
      "Marco Baroni"
    ],
    "book": "International Workshop on Web As Corpus",
    "id": "acl-W06-1700",
    "title": "Preface to Workshop on the Web As a Corpus",
    "url": "https://aclweb.org/anthology/W06-1700",
    "year": 2006
  },
  "references": [
    "acl-E06-2001",
    "acl-H01-1052"
  ],
  "sections": [
    {
      "text": [
        "http://www.thalesgroup.com EACL-2006 is supported by Trentino S.p.a. and Metalsistem Group © April 2006, Association for Computational Linguistics Order copies of ACL proceedings from:",
        "What is the role of a workshop series on web as corpus?",
        "We argue, first, that attention to the web is critical to the health of non-corporate NLP, since the academic community runs the risk of being sidelined by corporate NLP if it does not address the issues involved in using very-large-scale web resources; second, that text type comes to the fore when we study the web, and the workshops provide a venue for nurturing this under-explored dimension of language; and thirdly that the WWW community is an important academic neighbour for CL, and the workshops will contribute to contact between CL and WWW.",
        "High-performance NLP needs web-scale resources The most talked-about presentation of the ACL 2005 was Franz-Josef Och’s, in which he presented statistical MT results based on a 200 billion word English corpus.",
        "His results led the field.",
        "He was in a privileged position to have access to a corpus of that size.",
        "He works at Google.",
        "With enormous data, you get better results.",
        "(See e.g. Banko and Brill 2001.)",
        "It seems to us there are two possible responses for the academic NLP community.",
        "The first is to accept defeat: “we will never have resources on the scale Google has, so we should accept that our systems will not really compete, that they will be proofs-of-concept or deal with niche problems, but will be out of the mainstream of high-performance HLT system development.” The second is to say: we too need to make resources on this scale available, and they should be available to researchers in universities as well as behind corporate firewalls: and we can do it, because resources of the right scale are available, for free, on the web.",
        "We shall of course have to acquire new expertise along the way – at, inter alia, WAC workshops.",
        "Text type The most interesting question that the use of web corpora raises is text type.",
        "(We use ‘text type’ as a coverall term to include domain, genre, style etc.)",
        "The first question about web corpora from an outsider is usually “how do you know that your web corpus is representative?” to which the fitting response is “how do you know whether any corpus is representative (of what?)”.",
        "These questions will only receive satisfactory answers when we have a fuller account of how to identify and distinguish different kinds of text.",
        "While text type is not centre-stage in this volume, we suspect it will be prominent in discussions at the workshop and will be the focus of papers in future workshops.",
        "The WWW community: links, web-as-graph, and linguistics One of CL’s academic neighbours is the WWW community (as represented by, eg, the WWW conference series).",
        "Many of their key questions concern the nature of the web, viewing it as a large set of domains, or as a graph, or as a bag of bags of words.",
        "The web is substantially a linguistic object, and there is potential for these views of the web contributing to our linguistic understanding.",
        "For example, the graph structure of the web has been used to identify highly connected areas which are “web communities”.",
        "How does that graph-theoretical connectedness relate to the linguistic properties one would associate with a discourse community?",
        "To date the links between the communities have been not been strong.",
        "(Few WWW papers are referenced in CL papers, and vice versa.)",
        "The workshops will provide a venue where WWW and CL interests intersect.",
        "Recent work by co-chairs and colleagues At risk of abusing chairs’ privilege, we briefly mention two pieces of our own work.",
        "In the first we have created web corpora of over 1 billion words for German and Italian.",
        "The text has been de-duplicated, passed through a range of filters, part-of-speech tagged, lemmatized, and loaded into a web-accessible corpus query tool supporting a wide range of linguists’ queries.",
        "It offers one model of how to use the web as a corpus.",
        "The corpora will be demonstrated in the main EACL conference (Baroni and Kilgarriff 2006).",
        "In the second, WebBootCaT (work with Jan Pomikalek and Pavel Rychly of Masaryk University, Brno), we have prepared a version of the BootCaT tools (Baroni and Bernardini 2004) as a web service.",
        "Users fill in a web form with the target language and some “seed terms” to specify the domain of the target corpus, and press the “Build Corpus” button.",
        "A corpus is built.",
        "Thus, people without any programming or software-installation skills can create corpora to their own specification.",
        "The system will be demonstrated in the “demos” session of the workshop.",
        "The workshop series to date This is the second international workshop, the first being held in July 2005 in Birmingham, UK (in association with Corpus Linguistics 2005).",
        "There was an earlier Italian event in Forl“, in January 2005.",
        "All three have attracted high levels of interest.",
        "The papers in this volume were selected following a highly competitive review process, and we would like to thank all those who submitted, all those on the programme committee who contributed to the review process, and the additional reviewers who helped us to get through the large number of submissions.",
        "Special thanks to Stefan Evert for help with assembling the proceedings.",
        "(Cafarella and Etzioni have an abstract rather than a full paper to avoid duplicate publication: we felt their presentation would make an important contribution to the workshop, which was a distinct issue to them not having a new text available.)",
        "We are confident that there will be much of interest for anyone engaged with NLP and the web."
      ]
    }
  ]
}
