{
  "info": {
    "authors": [
      "Ariel S. Schwartz",
      "Marti A. Hearst"
    ],
    "book": "BioNLP Workshop on Linking Natural Language and Biology",
    "id": "acl-W06-3326",
    "title": "Summarizing Key Concepts Using Citation Sentences",
    "url": "https://aclweb.org/anthology/W06-3326",
    "year": 2006
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Citations have great potential to be a valuable resource in mining the bioscience literature (Nakov et al., 2004).",
        "The text around citations (or citances) tends to state biological facts with reference to the original papers that discovered them.",
        "The cited facts are typically stated in a more concise way in the citing papers than in the original.",
        "We hypothesize that in many cases, as time goes by, the citation sentences can more accurately indicate the most important contributions of a paper than its original abstract.",
        "One can use various NLP tools to identify and normalize the important entities in (a) the abstract of the original article, (b) the body of the original article, and (c) the citances to the article.",
        "We hypothesize that grouping entities by their occurrence in the citances represents a better summary of the original paper than using only the first two sources of information.",
        "To help determine the utility of the approach, we are applying it to the problem of identifying articles that discuss critical residue functionality, for use in PhyloFacts a phylogenomic database (Sjolander, 2004).",
        "Consider the article shown in Figure 1.",
        "This paper is a prominent one, published in 1992, with nearly 500 papers citing it.",
        "For about 200 of these papers, we downloaded the sentences that surround the citation within the full text.",
        "Some examples are shown in Figure 2.",
        "We are developing a statistical model that will group these entities into potentially overlapping groups, where each group represents a central idea in the original paper.",
        "In the example shown, some of the citances emphasize what the paper reports about the structural elements of the SH2 domain, whereas other emphasize its findings on interactions and others focus on the critical residues.",
        "Often several articles are cited in the same citance, so it is important to untangle which entities belong to which citation; by pursuing overlapping sets, our model should be able to eliminate most spurious references.",
        "The same entity is often described in many different ways.",
        "Prior work has shown how to use redundant information across citations to help normalize entities (Wellner et al., 2004; Pasula et al., 2003); similar techniques may work with entities mentioned in citances.",
        "This can be combined with prior work on normalizing entity names in bioscience text, e.g, (Morgan et al., 2004).",
        "For a detailed review of related work see (Nakov et al., 2004).",
        "By emphasizing entities the model potentially misses important relationships between the entities.",
        "It remains to be determined whether or not relationships must be modeled explicitly in order to create a useful summary."
      ]
    }
  ]
}
