{
  "info": {
    "authors": [
      "Anders Søgaard"
    ],
    "book": "Workshop on Scalable Natural Language Understanding",
    "id": "acl-W06-3509",
    "title": "Embodied Construction Grammar As Layered Modal Languages",
    "url": "https://aclweb.org/anthology/W06-3509",
    "year": 2006
  },
  "references": [
    "acl-W04-2805",
    "acl-W04-2806"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "One can think of scalability in terms of complexity or granularity, but in both cases, modal languages seem to be of interest: Modal languages are robustly decidable, and they encode in a natural way the idea of refinement by layering, which implies scalability in terms of granularity.",
        "The contribution of this paper is to introduce the general technique of translating problems of scalable natural language understanding into layered modal languages; for illustration, a translation is sketched for Embodied Construction Grammar (ECG).",
        "On the basis of this translation, an upper bound on the complexity of ECG is established: the universal recognition problem of ECG is solvable in EXPTIME (if some dynamic resetting is assumed).",
        "If the use of the evokes-operator is polynomially bound, the recognition problem turns NP-complete."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The purpose of this paper is to demonstrate that problems of scalable natural understanding translate into layered modal languages.",
        "Since the properties of such languages arc wcllstudied, such a translation is an important achievement.",
        "In this paper, this is illustrated by providing a translation from ECG into a layered extension of modal logic with nominals from which complexity results can be derived.",
        "On the general note, ECG is a step in the direction of a formal specification and interpretation of various theories proposed in the cognitive linguistics community.",
        "Many questions pop up with the introduction of such a theory, for instance: Does ECG faithfully reflect the intuitions of the original proposals, e.g. mental space theory (sec below)?",
        "Can it be implemented on existing grammar engirn~ering platforms?",
        "What is its computational complexity?",
        "Etc.",
        "Some of these questions are answered in this paper, some are not; in particular, we do not examine the \"faithfullness\" of ECG to the original sources.",
        "Our purpose here is to investigate its computational properties.",
        "This purpose is, however, in the author's view, secondary to the introduction of layered modal languages as a method for scalable natural language understanding.",
        "Let us first begin with some technicalities, a simple example of a layered modal language: Example 1.1.",
        "Consider a propositional modal logic(£) of two domains IDl and lE and IDl n lE = ©.",
        "IDl and lE arc nodes in a Kripkc model (W, R, V) (worlds, relations, valuation), s.t.",
        "W ~ IDl U IE.. Let 6 and E be propositions.",
        "Say 6 in the model denotes a subset of JDl, i.e. [ 0] ~ JDl, and E denotes a subset of IE.",
        "Consider the axioms SVE, --i(SAE), and (T)¢--+ o /\\ (T)(E ;\\¢),formulated in£.",
        "The first two axioms ensure that lDl and IE arc disjoint and exhaustive, and the last axiom ensures that R,-E R is a transition relation from IDl to IE.",
        "Call this language £~,R.",
        "c-ii,lli: is a language with a complex ontology, i.e. it distinguishes between two disjoint domains.",
        "66 On the logical side, the paper is about layered modal languages with rich ontologies.",
        "A language is introduced that extends£ in a number of respects: e.g. it is both hybrid and dynamic.",
        "If the reader has no idea about the nature of such a language in advance, please have patience.",
        "The language is formally defined below.",
        "It is used to encode ECG, a complex theory of natural language understanding that comprises 8everal domains.",
        "In fact, the ontology of ECG is further extended here with an inference component.",
        "This is the second advantage of our translation, besides from the complexity results: Since layering is fully scalable, it is easy to integrate ECG with a database of real-world knowledge and inference components.",
        "The inference component really refers to a structured set of subdomains, incl.",
        "a referential, spatial and a temporal subdomain.",
        "On the historical note, the layering techniques, as they are employed here, were introduced, in a systematic way, in the logic community by Blackburn and <le Rijke (1997), but see references therein for earlier applications of the techniques.",
        "It is of course also possible to layer fundamentally different logics.",
        "The structure of the paper is simple: The second section introduces our modal language and its expressivity.",
        "The language is, on arbitrary frames, decidable in deterministic exponential time (Areces ct al., 1999, Theorem 3.5), and equivalent to propositional dynamic logic with converse, enriched with nominals and global modalities.",
        "The next section is a brief presentation of ECG and its translation into our layered modal language.",
        "In the fourth section, the complexity results are established.",
        "The re:mlts are conjectured to transfer to related linguistic formalisms.",
        "Our results also indicate that ECG can be implemented on common grammar engineering platforms, and an implementation is sketched for the Lexical Knowledge Base ( Copestake, 2001).",
        "Finally, a modal language of greater expressivity (and higher complexity) is considered.",
        "2 Logic Our language is, as mentioned, a dynamic and hybrid extension of modal logic, but not only that.",
        "It extends £ with nominals (propositiorn; that denote singleton subsets), satisfaction operators, global modalities, non-deterministic operators and the converse operator.",
        "Call the language Seu.",
        "Definition 2.1.",
        "In SeU: formulas are built over a set of propositions lF'JR:.<OllF', denoted by {p, q, .. . }",
        "or type names such as word or phrase, and a set of nominals N<OlM, denoted by {i, j, ... }, 8.t.",
        "¢ := Plil--,¢1¢ v v1i(a)</>l©\\</>l(a-1 )</>l(a*)¢IA¢ are wellformed.",
        "The satisfaction definition is as follows, wrt.",
        "Kripkc models (W, R, V), where W is a set of worlds, R a set of binary relations, and V is the valuation function, i.e. a mapping from lF'JR:.<OllF' and N<OlM to the power set of W: 1\\;[, w F p iff w E V(p) l\\1.,w Fi iff V(i) = {111} M, w F ·¢ iff M, w [;i:: </> M, w F </> V ¢ iff 2\\,f, w F </> or M, w F 1/-' M,w F (a)¢ iff :Jw'(R.a(w,w')&M,w' F ¢) AI, w F (gt¢ iff M, w' F ¢&V(i) = {w'} M,w F (0:- 1)¢ iff :Jw1 (R~ 1 (w,w1 )&M,w1 p¢) M, w F (a*)¢ iff -::3w1 (wR;,w1 & lvl, w' F ¢) M,w f= A¢ iff Vw' M,w' F ¢ where R~ means Un(Ra)n, and n is nondeterministically chosen, and where n;;1 is the converse of Ra.",
        "For abbreviatory use, ; , U are defined s.t.",
        ",.",
        "(a)(fJ)¢ ++ (a; fJ)¢ U: (a)</> V (/3)(/> ++ (a U (3)(/> (The next paragraphs motivate the various operator-:; of ScU and chacter·izes ds expressivity, in part.",
        "If the reader is unaccustomed to the literature on modal languages, the paragraphs may be somewhat dense, and she is invited to skip the rest of this section.)",
        "Our extem;ions of£ by nominals, satisfaction operators, global modalitie8, non-determini8tic operator8 and the converse operator arc meaningful, as evidenced by an investigation of the invariance properties of SeU.",
        "If a logic is invariant under some operation, you may recall, it means that it preserves 67 validities under this operation, and that properties that are affected by it, cannot be defined.",
        "£ is characterized in part by its invariance under disjoint unions, bounded morphisms and bisimulation.",
        "Briefly put, if a logic is invariant under disjoint unions, it means that any validities that hold for some model M, also hold in the disjoint union M l±J M' for any model M'.",
        "A bounded morphism h ensures that for every w E W, w and h(w) satisfy the same proposition letters, h is a homomorphism wrt.",
        "the relations in R (the forth condition), and for every R E R, if R'h(w)w', then there exists w11 s.t.",
        "Rww\" and h(w\") = w' (the back condition) (Dlackburn et al. , 2001 , 59).",
        "A bisimulation between (unimodal) models M = (W, R, V) and M' = (W', R', V') is a non-empty binary relation Z between their points s.t.",
        "whenever wZw' we have that: (i) w and w1 satisfy the same proposition symbols, (ii) if RmJJ, then there exhits a point 11' E M' s.t.",
        "vZv' and R'w'v', and (iii) if R'v'w', then there exists a point v E M s.t.",
        "vZv' and Rwv.",
        "This generalizes straightforwardly to the polymodal case.",
        "SeU is not invariant under any of thei;e operations.",
        "Invariance under disjoint unions is lost, once you add global modalities.",
        "This is obvious, since global modalities allow you to say, for instance, \"there is no state in <fa\".",
        "This may hold true for M, but not for M', and thus not for M l±J M' either.",
        "ScU clearly encodes hybrid logic (H) , which is defined as the extension of £ with nominals and satisfaction operators.",
        "Since 1l is non-invariant under bounded morphisms (ten Cate, 2005), the non-invariance of SeU followi;.",
        "The notion of bii;imulation, finally, does not take nominals into account.",
        "The operation can he modified a bit, however.",
        "The bisimulation operation for 1-l, call it 1-l-bisimulation, adds a fourth clause to its definition, namely that (iv) all points named by nominals are related by Z.",
        "In addition, clause (i) takes NOMI U lP'][{iQlJP' as its domain, rather than just lP'~<OllP'.",
        "Unfortunately, this is not enough.",
        "The global modalities force us to add a fifth requirement, namely that the operation is total, i.e. s.t.",
        "V1,1i E W 31,17 E W' 1,1iZ1,1j, and vice versa.",
        "The obvious reason is that global modalities are sensitive to information in non-local (disconnected) substructures.",
        "Call this total bisimulation for H(E)-bisimnlation (ten Cate, 2005, 47).",
        "Lemma 2.2.",
        "SeU is invariant under 1-l(E)b ·isirrmlat·ion.",
        "Proof.",
        "This follows from the invariance of 1-l extended with global modalities (H(E)) under 1-l(E)-bisimulation (ten Cate, 2005), and that * and -1 are safe for H(E)-bisimulation.",
        "Van Benthem (1998) proved that * is safe for bisimulation.",
        "Consequently, if Z is a bisimulation from M = (W, R, V) to M' = (W', R', V') , it is also a bisimulation between M = (W, R*, V) and M' = (W1 , (R1 )*, V').",
        "If Z is a 1-l(E)bi:::; imulation it al:m satisfies the fourth clause of the definition above, i.e. all points named by nominals are related by Z, and it must have a full domain and range (be total).",
        "These properties are not dependent on the transition relations, however, sinr,e they only depend on the domains and valuations of the models.",
        "* is thus safe for 1-l(E)-bisimulation too.",
        "The safety of the converse operator -1 follows from the equivalence ofH(E)-bisimulation and so-called power bii;imulation, introduced recently by van Benthem for a logic of games.",
        "Since this logic included -1 and was invariant under power bisimulation, it follows that -1 is also safe for 1-l{E)bisimulation.",
        "D It can be inferred from the non-invariance of 1-l under bounded morphism that the extension of £ by nominals and satisfaction operators is meaningful, while the non-invariance under disjoint union tells us that global modalities also add expressive power to our language.",
        "The extension of £ by non-deterministic operators is meaningful too, evidenced by the loss of compactness (Illackburn et al., 2001, 240).",
        "(Since £ hai; a trani;lation into first order logic, it is 68 compact.)",
        "Converse, finally, is also meaningful.",
        "Consider, for instance, the model {R-1 (w, w')}, which cannot be singled out by any£ or propositional dynamic formula.",
        "Note that Seu, unlike £, does not have the tree model property, i.e. it is not the case that ¢ is satisfiable iff it is satisfiable in a treelike Kripkc model.",
        "This is important, since the grammar formalisms considered here all employ reentrancie:::;, a property that violates the tree model property.",
        "In other words, if SeU had the tree model property, it would not be able to encode or reconstruct the formalisms this paper concerns.",
        "3 Grammar The fundamental concept in ECG is that of feature structures.",
        "The reader is invited to think of m1ch feature structures as Kripke structures.",
        "On this view, with some mild abuse of notation, it holds that, for instance, [ FUNCT [ NUM w]l ARG [ NUM IIJ] F (FUN CT) (NUM)i /\\ (ARG) (NUM)i The tags are used to \"co-index\" two values.",
        "Consequently, they denote reentrancies.",
        "In SeU, tags translate into nominals, since they denote singleton sets of states.",
        "The standard ECG notation look different from standard attributevalue matrice8, but to a large extent the 8chema8 of ECG can be viewed as notational variants of Kripke RtructureR.",
        "For instance, schema Trajector-Landrnark subcase of Image-Schema roles trajector: a landmark: b is equivalent to [trnjecto[r~~::;~:~R all ROLES LANDMARK b /\\ trajector _landmark ;;;] image_schema The last formula says that trajector _landmar·k is a subtype of imagc_schcma.",
        "The root node is thus in the denotation of both propositions.",
        "The trajector _landmark type is a schema.",
        "Schemas and constructions constitute two different domains in ECG.",
        "Schemas, in general, encode conceptual structure and constrain information about conceptual roles and the relations among them.",
        "Constructiom; are linguistic of nature and pair up form and meaning (two subdomains identified by separate attributes).",
        "The third domain is that of Rpaces.",
        "The ontology, summarized here, is presented in more detail in Chang et al. (2002).",
        "Let schema denote the domain of schemas, constr denote the domain of constructions, while ms denotes the domain of (mental) spaces.",
        "The domain structure is defined in the same way as in Example 1.1.",
        "A map modality is also introduced; this is used to encode the mapoperator, also introduced in Chang et al. (2002), which is said to identify :'correspondences across a pair of conceptual domains (e.g. between two schemas, or between two spaces).\"",
        "(1) schema V constr V ms (2) --,(schema/\\ constr V schema/\\ ms V constr /\\ms (3) (map)¢--+ (schema I\\ (map)(scherna I\\ ¢)) V (ms I\\ (rnap)(ms I\\¢)) Reentrancies are denoted by H. In other words, corresponds to [ A ITJ] B ITJ Feature strnctnrns, more generally, are governed by a number of axioms; sec for instance Wedekind (1997).",
        "Feature structures have (mostly) deterministic attributes) and they arc acyclic, connected and rooted.",
        "This can be encoded in Seu in this way, if root is a nominal: (4) (a)i--+ [a]i (functionality) (5) i --+ --i(cq U · · · U O'n)+i (acyclicity) (6) E( root/\\ -i(a-1 ) T) /\\A( (0:1 U · · · U an)* root) (connectedness and rootedness) 69 R0 is, as in the above, any relation in R, R = { ~1 ... an}; and axioms are multiplied in the set of nominals.",
        "Up to this point, ECG looks exactly like other unification-based formalisms (the feature geometry and its linguistic use aside).",
        "ECG employs two novel operators, however; most significantly, the so-called evokes operator, which triggers a new schema and allows reference to it.",
        "In ScU, this corresponds to existential quantification and naming, e.g. schemas schema t evokes t as i roles k +-+ i.l roles 1 : a f= s /\\ (k)j /\\ E(i /\\ (l)(a /\\ j)) The other complication is the \"::\" constraints.",
        "Since this constraint involves quantification over times, it is discussed in the section on inference just below, where a temporal domain is introduced.",
        "ECG usually employs rather flat constructions, and linearization can be constrained in two ways: either by weak or immediate precedence (Ilryant, 2004).",
        "We use standard terminology and let -< denote weak precedence and « denote immediate precedence.",
        "It is an option to augment the ECG feature geometry with a domain of substructures for phonological strings (distinguished by a feature PHON, for instance).",
        "The standard encoding of lists as trees can be employed, and ScU used to constrain the tree structures.",
        "One can, alternatively, represent strings by linear relations.",
        "This is the solution adopted here.",
        "This is possible if the input to the parsing procedure is the lexical entries rather than the strings themselves.",
        "It is of course trivial to do this sub::;titution (lexical ambiguity just blows up the number of inputs).",
        "-< and « are then interpreted directly over substructures (or type propositions, really), i.e. « is a deterministic version of the -< modality s.t.",
        "Mental space theory, originally due to Gilles Fauconnier, is used as a semantic representation language in an extension of ECG proposed by Mok et al. (2004).",
        "The implementation suggested there does not increase the formal complexity of ECG.",
        "It only extends the feature geometry.",
        "A separate domain for spaces was already introduced.",
        "We are now in a position to show how ECG analysis works, and more importantly, a parsing procedure is identified.",
        "Contrary to the parsing procedure hinted at in (Bryant, 2004), this algorithm is entirely model-theoretic.",
        "The toy implementation presented below is comparable to Bryant's proposal, in that the Lexical Knowledge Base employs generative rules in a bottornup fashion.",
        "The basics of our parsing procedure lS: 1.",
        "The string is encoded in Seu and conjoined with the axioms of ECG.",
        "2.",
        "If this conjoined formula is satisfiable, the string is accepted.",
        "It is easy to represent strings in our language, as already indicated.",
        "The job is to identify the proper axioms.",
        "Some were already defined, i.e. ( 1-7).",
        "It is now necessary to define the type hierarchy, which includes the various types of schemas, constructions, and spaces.",
        "It is also necessary to define some start or root type, which is existentially quantified over.",
        "Why is that?",
        "This is to ensure that all the relevant information is derived in the parse.",
        "The definition of the type hierarchy, and total well-typing in particular (Carpenter, 1992), is half the way, but it is necessary to ensure, somehow, that the model which satisfies the string is forced to contain a full lingui::;tic analysis (and not just the empty model or some arbitrary connection of the constituent substructures derived from the lexicon).",
        "This is easily obtained by existential quantification over the root and connectivity.",
        "If there is a root and a set of constituent substructures, and the feature structure has to be connected, the additional structure falls out by implications.",
        "It is necessary, however, since this is a typed system, to ensure that the \"universal\" phrase, i.e. the supertype phrase, cannot apply.",
        "In generative or rule-based systems, such as the 70 Lexical Knowledge I3ase, this is ensured by stipulating directly which types count as rules.",
        "On a model-theoretic set-up, it is necessary to add some implication that every phrase is a particular type of phrase.1 3.1 Inference To this we add an inference component.",
        "The inferem: e component has a complex structure and comprises multiple subdomains.",
        "Only three domains are included here, for simplicity.",
        "The domains include a referential (R), a spatial (S), and a temporal one (T).",
        "The transitions are called Rr2s, from the referential to the spatial domain, and Rs2t, from the spatial to the temporal domain.",
        "The domains are denoted by propositiorni ref, space and time.",
        "Example 3.1.",
        "Our layering is illustrated by this simple example: (8) The new teacher enters the room in a minute.",
        "Think of the room as a spatial region that the teacher at some point (in time) is part of.",
        "to is the time of the utterance.",
        "E( time /\\ i1 /\\ @t0 ( 60s )t1) /\\ E(space /\\ii\\:::; room/\\ C9\\(s2t)t1) /\\ E(1-ef /\\(new)( teacher/\\ (r·2s)i)) The model that satisfies the formula will look like this: R - - - • v1 new • v2: teacher ~___) S -+v;~: i < .. v~: room ~-\\ T •v5: to 60s • 116: t1 Here R is the referential domain, S is the spatial domain, and T is the temporal one.",
        "The curved lines arc the projections from one domain to another, i.e. Rr·2s and Rs2t· The R domain says that there is a teacher who is new.",
        "The S domain says that his spatial instantiation is part of the spatial region that is occupied by 1This is roughly the role of the immediate dominance principle in head-driven phrase structure grammar.",
        "the room at time t1 • The T domain tells us that ti is 60 seconds from now.",
        "Remark 3.2.",
        "A remark on the :: constraints of ECG was promised you.",
        "In Chang et al. (2002, Figure 2), two such constraints arc used to say that in the schema \"Translational-Motion\", the mover's location changes from that of the source to that of the goal at the time of the motion, i.e. because of the motion.",
        "Call this temporal state tm.",
        "The constraints before :: mover.location ft source after :: mover.location ft goal thus translate into A((<)tm -t (s2t- 1)source) and A((> )tm -t (s2t-1) goal) 4 Computational issues ScU is decidable in deterministic exponential time (Areces et al., 1999, Theorem 3.5).",
        "It follows from the parsing procedure and the completeness of our translation that so is ECG.",
        "If the inference component is ignored, the evokesfree fragment of ECG is apparently more efficient, since an NP-completeness result can be established for it.",
        "Obtaining the result is not too complicated.",
        "The domain minimal Kripke model that satisfies an input formula in these theories is bound by a size lemma.",
        "ECG contains no unary constructions (as it is shown below, evokes does the job of unary projections), but such can be freely added, provided that unary rules only apply once to the same unary extension.",
        "If a unary extension is always the result of a single application of a unary rule, u = 1.",
        "Lemma 4.1.",
        "A ScU .form'Ula that encodes a recognition problem for the evokes-free fragment of ECG for some sfring O\" is, if satisfiable, satisfied by a structure M of at most (21al - l)(u + 1) x paths cardinality, where 2lal 1 is the maximum number of nodes in a binary tree: u. is the mtmber of unary rules, and paths is the number of paths licensed by the non-recursive part of the .feature geometry of ECG.",
        "In particular, paths = 1{7r E Lbls* I no label occurs twice in 7r} I· 71 Since any ScU formula ¢ that represents an evokes-free ECG recognition problem for a string of c length, can be evaluated in a model of size polynomial to c, a suitable model can be non-deterministically chosen, and¢ is evaluated in polynomial time, since model checking in ScU and similar language8 is decidable in polynomial time (Franccschct and de Rijkc, 2006).",
        "It follows that Theorem 4.2.",
        "The ·universal recognition problem of evokes-free ECG is decidable in nondetenninistic polynomial time.",
        "Remark 4.3.",
        "The result in Theorem 4.2 tran8fern to unification catcgorial grammar and construction grammar where 11. is bound in the Rame way.",
        "4.1 Implementation In this subsection, it is sketched how ECG, at least in part, can he implemented in the Lexical Knowledge Base (Copcstakc, 2001).",
        "This has already been hinted at in different places.",
        "The reader familiar with both the computational platform and the literature on ECG may envisage how to implement the evokes-free fragment.",
        "Consequently, we focus only on how to translate the evokes operator by unary rules.",
        "Lexical rules could also have been used, but lexical rules arc rather heavy and unruly machineries, and they are best avoided if possible.",
        "We consider the example from above.",
        "It holds that schemas evokes t as i roles k H i.l s schema t roles is equivalent to 1 : a ROLES [I] EVOKES [t [ J] ROLES L [I] I [ ~OLF.S ill a] The evokes operator is thus replaced by a recursive attribute which embeds the new strm;ture.",
        "Since the EVOKES attribute is defined for this sole purpose, it is really no different from the disconnected substructure intended in the ECG-style notation.",
        "The other complication, the :: operator, deserves a brief remark too.",
        "If the relational constraints of the schemas are augmented with events, that is, each proposition is defined relative to some event (as in Davidsonian semantics), the ::-style constraints can be translated into ordinary relations.",
        "This extends the feature geometry a bit, of course, hut enable8 us to implement ECG in the Lexical Knowledge Base.",
        "4.2 Using a richer logic There is one qualification to our formalization that has not been mentioned yet (except for in the abstract), namely that certain undesired reentrancies may appear in the context of the evoke operator (and schemas and constructions, more generally), if the nominals used in the reduction are not Romehow dynamically reset.",
        "The intuition is this: If a schema runs an evoke operation, it existentially asserts a substructure and names some of its nodes by nominals.",
        "However, the next time this schema applies, the substru<.",
        ":ture in the scope of the operator, receives the same names, unless they are somehow changed (dynamically).",
        "It is possible to avoid this complication, if one \"steps up\" our logic a bit, i.e. if we add quantification over nominals.",
        "We are then able to quantify over both nominals and states.",
        "Call the relevant quantifier :J.",
        "Its satisfaction definition is M, g, w F :J.r, ifJ iff :Jg' g ,g, &M, g', w F ifJ Note that assignments have now been added to the satisfaction definitions, for obvious reasons.",
        "The standard translation into first order logic illustrates its intended meaning: Our logic now, with this new extension, embeds hybrid logic extended with the -l,l- operator,2 and since this logic has been shown to be undecidable (Blackburn and Seligman, 1995), our logic is thus undecidable itself.",
        "However: NPcompletcness can still be established for a useful 2This follows from the fact that -1).",
        "x ¢~ix A(qi).",
        "72 fragment.",
        "The intuition behind the fragment References is, as we saw in our computational implementation, that evokes operations are much like unary projections.",
        "Constraint-based grammars are often (only) undecidable in the abscence of off-line parsability constraints, and in fact an \"off-line parsability\" restriction can be placed on the use of the evokes operator.",
        "Simply label all the evokes operators employed in the schemas.",
        "Say that any schema that evokes a schema or space that evokes another one, etc., can never evoke itself in this chain of evocations.",
        "Call our new language Seu+ and let evocators be the number of evokes operators employed by the grammar.",
        "Call the restriction on the use of evokes the \"acyclic evocation restriction.\"",
        "The following size lemma now holds:3 Lemma 4.4.",
        "A Seu+ formula that encodes an ECG recognition problem for some string er under the acyclic evocation restriction is, if satisfiable, satisfied by a strncfare M of at most (2lcrl - l)evocators x paths cardinality, where evocators and paths are defined as in the above.",
        "It follows as a corrollary that Theorem 4.5.",
        "The universal recognition problem of ECG under the acyclic evocation r·estriction is decidable in non-deterministic polynomial time.",
        "Carlos Areces, Patrick Blackburn, and Maarten Marx.",
        "1999.",
        "A roadmap on complexity for hybrid logics.",
        "In Proceedings of the Anrmal Conference of the European Association for Computer Science Logi:c, volume 1683 of Lecture Notes in Compnter Science, pages 307 321, Berlin.",
        "Springer.",
        "Patrick Blackburn and Maartcn de Rijkc.",
        "1997.",
        "Zooming in, zooming out.",
        "Journal of Logic, Language and Informat'ion, 6:5-31.",
        "Patrick Blackburn and Jerry Seligman.",
        "1995.",
        "Hybrid languages.",
        "Journal of Logic, Language and Information, 4:251-272.",
        "Patrick Blackburn, :VIaarten de Rijke, and Y de Venema.",
        "2001.",
        "Modal logic.",
        "Cambridge University Press, Cambridge, England.",
        ".John Ilryant.",
        "2004.",
        "Scalable construction-based parsing and semantic analysis.",
        "Presented at Scalable Natural Language Understanding 2004.",
        "Bob Carpenter.",
        "1992.",
        "The logic of typed feature structures, volume 32 of Cambridge Tracts in Theoretical Computer Science.",
        "Cambridge University Press, Cambridge, England.",
        ":\"'fancy Chang, Jerome Feldman, Robert Porzel, and Keith Sanders.",
        "2002.",
        "Scaling cognitive linguistiscs: formalisms for language understanding.",
        "Presented at Scalable Natural Language Understanding 2002.",
        "Ann Copestake.",
        "2001.",
        "Implementing typed feature structure grammars.",
        "CSLI, Stanford, California.",
        ":VIassimo Franceschet and l\\faarten de Rijke.",
        "2006.",
        "Proof.",
        "Similar to the proof of Theorem 4.2.",
        "D Model checking for hybrid logics.",
        "Journal of Applied Logic.",
        "In press.",
        "5 Conclusions The technique of using layered modal language for scalable natural language understanding was introduced and applied to ECG.",
        "Certain interesting results were derived.",
        "ECG is decidable in exponential time (under dynamic resetting), its evokes-free fragment is NP-complete, and so is ECG under the acyclic evocation restriction, i.e. if we put a bound on the length of evocations w hic.",
        ":h is polynomial in the length of the input.",
        "It was also shown to be likely that ECG can be implemented in the Lexical Knowledge Base.",
        "3It.",
        "is, for simplification, assumed that each schema or space contains at most one evokes operator.",
        "Eva :VIok, John Bryant, and Jerome Feldman.",
        "2004.",
        "Scaling understanding up to mental spaces.",
        "Presented at Scalable Natural Language Understanding 2004.",
        "Balder ten Cate.",
        "2005.",
        "Model theory for extended modal languages.",
        "Ph.D. thesis, University of Amsterdam, Amsterdam, the 1\\ etherla.nds.",
        "ILLC Dissertation Series DS-2005-01.",
        "Johan van Benthem.",
        "1998.",
        "Program constructions that are safe for bisimulation.",
        "Studia logica, 60:311-330.",
        "Jurgen ·Wedekind.",
        "1997.",
        "Approaches to unification in gra.rnrna.r.",
        "In Patrick Blackburn a.rid Maarten de Rijke, editors, Specifying syntactic .stmctnre, pages 245-280.",
        "CSLI Publications, Stanford, California."
      ]
    }
  ]
}
