{
  "info": {
    "authors": [
      "Ryo Nishimura",
      "Yasuhiko Watanabe",
      "Yoshihiro Okada"
    ],
    "book": "Second International Joint Conference on Natural Language Processing: Companion Volume including Posters/Demos and tutorial abstracts",
    "id": "acl-I05-2006",
    "title": "A Question Answer System Based on Confirmed Knowledge Developed by Using Mails Posted to a Mailing List",
    "url": "https://aclweb.org/anthology/I05-2006",
    "year": 2005
  },
  "references": [
    "acl-C02-1084",
    "acl-J94-4001",
    "acl-W00-1016"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper, we report a QA system which can answer how type questions based on the confirmed knowledge base which was developed by using mails posted to a mailing list.",
        "We first discuss a problem of developing a knowledge base by using natural language documents: wrong information in natural language documents.",
        "Then, we describe a method of detecting wrong information in mails posted to a mailing list and developing a knowledge base by using these mails.",
        "Finally, we show that question and answer mails posted to a mailing list can be used as a knowledge base for a QA system."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Because of the improvement of NLP, research activities which utilize natural language documents as a knowledge base become popular, such as QA track on TREC (TREC) and NTCIR (NTCIR).",
        "However, there are a few QA systems which assumed the user model where the user asks how type question, in other words, how to do something and how to cope with some problem (Kuro 00) (Kiyota 02) (Mihara 05).",
        "This is because we have several difficulties in developing a QA system which answers how type questions.",
        "We focus attention to two problems below.",
        "First problem is the difficulty of extracting evidential sentences.",
        "It is difficult to extract evidential sentences for answering how type questions only by using linguistic clues, such as, common content words and phrases.",
        "To solve this problem, (Kuro 00) and (Kiyota 02) proposed methods of collecting knowledge for answering questions from FAQ documents and technical manuals by using the document structure, such as, a dictionary-like structure and if-then format description.",
        "However, these kinds of documents requires the considerable cost of developing and maintenance.",
        "As a result, it is important to investigate a method of extracting evidential sentences for answering how type questions from natural language documents at low cost.",
        "To solve this problem, (Watanabe 04) proposed a method of developing a knowledge base by using mails posted to a mailing list (ML).",
        "We have the following advantages when we develop knowledge base by using mails posted to a mailing list.",
        "• it is easy to collect question and answer mails in a specific domain, and • there is some expectation that information is updated by participants",
        "Next problem is wrong information.",
        "It is almost inevitable that natural language documents, especially web documents, contain wrong information.",
        "For example, (DA1–1) is opposed by (QR1–1–1).",
        "(Q 1) How I set up my wheel mouse for the netscape navigator?",
        "(DA1–1) You can find a setup guide in the Dec. issue of SD magazine.",
        "(QR1–1–1) I can not use it although I modified /usr/lib/netscape/ja/Netscape according to the guide.",
        "Wrong information is a central problem of developing a knowledge base by using natural language",
        "documents.",
        "As a result, it is important to investigate a method of detecting and correcting wrong information in natural language documents.",
        "(Watanabe 05) reported a method of detecting wrong information in question and answer mails posted to a mailing list.",
        "In (Watanabe 05), wrong information in the mails can be detected by using mails which ML participants submitted for correcting wrong information in the previous mails.",
        "Then, the system gives one of the following confirmation labels to each set of question and their answer mails: positive label shows the information described in a set of a question and its answer mail is confirmed by the following mails, negative label shows the information is opposed by the following mails, and other label shows the information is not yet confirmed.",
        "Our knowledge base, on which our QA system bases, is composed of these labeled sets of a question and its answer mail.",
        "Finally, we describe a QA system: It finds question mails which are similar to user’s question and shows the results to the user.",
        "The similarity between user’s question and a question mail is calculated by matching of user’s question and the significant sentence extracted from the question mail.",
        "A user can easily choose and access information for solving problems by using the significant sentences and these confirmation labels.",
        "2 Confirmed knowledge base developed by using mails posted to a mailing list There are mailing lists to which question and answer mails are posted frequently.",
        "For example, in Vine Users ML, several kinds of question and answer mails are posted by participants who are interested in Vine Linux 1.",
        "We reported that mails posted to these kinds of mailing lists have the following features.",
        "1.",
        "Answer mails can be classified into three types: (1) direct answer (DA) mail, (2) questioner’s reply (QR) mail, and (3) the others.",
        "Direct answer mails are direct answers to the original question.",
        "Questioner’s reply mails",
        "are questioner’s answers to the direct answer mails.",
        "2.",
        "Question and answer mails do not have a firm structure because questions and their answers are described in various ways.",
        "Because of no firm structure, it is difficult to extract precise information from mails posted to a mailing list in the same way as (Kuro 00) and (Kiyota 02) did.",
        "3.",
        "A mail posted to ML generally has a significant sentence.",
        "For example, a significant sentence of a question mail has the following features: (a) it often includes nouns and unregistered words which are used in the mail subject.",
        "(b) it is often quoted in the answer mails.",
        "(c) it often includes the typical expressions, such as,",
        "(d) it often occurs near the beginning.",
        "Taking account of these features, (Watanabe 05) proposed a method of extracting significant sentences from question mails, their DA mails, and QR mails by using surface clues.",
        "Furthermore, (Watanabe 05) proposed a method of detecting wrong information in a set of a question mail and its DA mail by using the QR mail.",
        "For evaluating our method, (Watanabe 05) selected 100 examples of question mails in Vine Users ML.",
        "They have 121 DA mails.",
        "Each set of the question and their DA mails has one QR mail.",
        "First, we examined whether the results of determining the confirmation labels were good or not.",
        "The results are shown in Table 1.",
        "Table 2 shows the type and number of incorrect confirmation.",
        "The reasons of the failures were as follows:",
        "• there were many significant sentences which did not include the clue expressions.",
        "• there were many sentences which were not significant sentences but included the clue expressions.",
        "labeling result positive negative other total correct 29 8 27 64 failure 4 4 15 23",
        "• some question mails were submitted not for asking questions, but for giving some news, notices, and reports to the participants.",
        "In these cases, there were no answer in the DA mail and no sentence in the QR mail for confirming the previous mails.",
        "(Q2) vedit ha, sonzai shinai file wo hirakou to suru to core wo haki masuka.",
        "(Does vedit terminate when we open a new file?)",
        "• wrong significant sentences extracted from question mails, and",
        "incorrect type and number of correct answers confirmation positive negative other",
        "• questioner’s answer was described in several sentences and one of them was extracted, and • wrong significant sentences extracted from DA mails.",
        "• misspelling.",
        "Next, we examined whether these significant sentences and the confirmation labels were helpful in choosing and accessing information for solving problems.",
        "In other words, we examined whether",
        "• there was good connection between the significant sentences or not, and • the confirmation label was proper or not.",
        "For example, (Q2) and (DA2–1) in Figure 1 have the same topic, however, (DA2–2) has a different topic.",
        "In this case, (DA2–1) is a good answer to question (Q2).",
        "A user can access the document from which (DA2–1) was extracted and obtain more detailed information.",
        "As a result, the set of (Q2) and (DA2–1) was determined as correct.",
        "On the contrary, the set of (Q2) and (DA2–1) was a failure.",
        "In this experiment, 87 sets of a question and its DA mail were determined as correct and 34 sets were failures.",
        "The reasons of the failures were as follows: Failures which were caused by wrong significant sentences extracted from question mails were not serious.",
        "This is because there is not much likelihood of matching user’s question and wrong significant sentence extracted from question mails.",
        "On the other hand, failures which were caused by wrong significant sentences extracted from DA mails were serious.",
        "In these cases, significant sentences in the question mails were successfully extracted and there is likelihood of matching user’s question and the significant sentence extracted from question mails.",
        "Therefore, the precision of the significant sentence extraction was emphasized in this task.",
        "Next, we examined whether proper confirmation labels were given to these 87 good sets of a question and its DA mail or not, and then, we found that proper confirmation labels were given to 64 sets in them.",
        "The result was shown in Table 3.",
        "We discuss some example sets of significant sentences in detail.",
        "Question (Q3) in Figure 1 has two answers, (DA3–1) and (DA3–2).",
        "(DA3–1) is",
        "a suggestion to the questioner of (Q3) and (DA3– 2) explains answerer’s experience.",
        "The point to be noticed is (QR3–1–1).",
        "(QR3–1–1) contains a clue expression, “umaku ikimashita (did well)“, which gives a positive label to the set of (Q3) and (DA3– 1).",
        "It guarantees the information quality of (DA3– 1) and let the user choose and access the answer mail from which (DA3–1) was extracted.",
        "(DA4–1) in Figure 1 which was extracted from a DA mail has wrong information.",
        "Then, the questioner of (Q4) confirmed whether the given information was helpful or not, and then, posted (QR4– 1–1) in order to point out and correct the wrong information in (DA4–1).",
        "In this experiment, we found 16 cases where the questioners posted reply mails in order to correct the wrong information, and the system found 10 cases in them and gave negative labels to the sets of the question and its DA mail."
      ]
    },
    {
      "heading": "3 QA system using mails posted to a mailing list",
      "text": []
    },
    {
      "heading": "3.1 Outline of the QA system",
      "text": [
        "Figure 2 shows the overview of our system.",
        "A user can ask a question to the system in a natural language.",
        "Then, the system retrieves similar questions from mails posted to a mailing list, and shows the user the significant sentences which were extracted the similar question and their answer mails.",
        "According to the confirmation labels, the sets of the similar question and their answer mails were classified into three groups, positive, negative, and other, and shown in three tabs (Figure 3).",
        "A user can easily choose and access information for solving problems by using the significant sentences and the con",
        "firmation labels.",
        "The system consists of the following modules: Knowledge Base It consists of",
        "• question and answer mails (50846 mails), • significant sentences (26334 sentences: 8964, 13094, and 4276 sentences were extracted from question, DA, and QR mails, respectively), • confirmation labels (4276 labels were given to 3613 sets of a question and its DA mail), and • synonym dictionary (519 words).",
        "QA processor It consists of input analyzer and similarity calculator.",
        "Input analyzer transforms user’s question into a dependency structure by using JUMAN(Kuro 98) and KNP(Kuro 94).",
        "Similarity calculator calculates the similarity between user’s question and a significant sentence in a question mail posted to a mailing list by comparing their common content words and dependency trees in the next way: The weight of a common content word t which occurs in user’s question and significant sentence S in the mails M (i = 1 N) is: wWORD(t M) = t (t S) d (t) where t (t S) denotes the number of times content word t occurs in significant sentence S, N denotes the number of significant sentences, and d (t) denotes the number of significant sentences in which content word t occurs.",
        "Next, the weight of a common modifier-head relation in user’s question and significant sentence S in question mail M is:",
        "where diier(l) and head(l) denote a modifier and a head of modifier-head relation l, respectively.",
        "Therefore, the similarity score between user’s question and significant sentence S of question mail M, SCO E( M), is set to the total weight of common content words and modifier-head relations which occur user’s question and significant sentence S of question mail M , that is,",
        "where the elements of set T and set L are common content words and modifier-head relations in user’s question and significant sentence S in question mail M, respectively.",
        "When the number of common content words which occur in user’s question and significant sentence S in question mail M is more than one, the similarity calculator calculates the similarity score and sends it to the user interface.",
        "User Interface Users can access to the system via a WWW browser by using CGI based HTML forms.",
        "User interface put the answers in order of the similarity scores."
      ]
    },
    {
      "heading": "3.2 Evaluation",
      "text": [
        "For evaluating our method, we gave 32 questions in Figure 4 to the system.",
        "These questions were based on question mails posted to Linux Users ML.",
        "The result of our method was compared with the result of full text retrieval Test 1 by examined first answer Test 2 by examined first three answers Test 3 by examined first five answers Table 4 (a) shows the number of questions which were given the proper answer.",
        "Table 4 (b) shows the number of proper answers.",
        "Table 4 (c) shows the number and type of confirmation labels which were given to proper answers.",
        "In Test 1, our system answered question 2, 6, 7, 8, 13, 14, 15, 19, and 24.",
        "In contrast, the full text retrieval system answered question 2, 5, 7, 19, and 32.",
        "Both system answered question 2, 7 and 19, however, the answers were different.",
        "This is because several solutions of a problem are often sent to a mailing list and the systems found different but proper answers.",
        "In all the tests, the results of our method were better than those of full text retrieval.",
        "Our system answered more questions and found more proper answers than the full text retrieval system did.",
        "Furthermore, it is much easier to choose and access information for solving problems by using the answers of our QA system than N",
        "(1) I cannot get IP address again from DHCP server.",
        "(2) I cannot make a sound on Linux.",
        "(3) I have a problem when I start up X Window System.",
        "(4) Tell me how to restore HDD partition to its normal condition.",
        "(5) Where is the configuration file for giving SSI permission to Apache ?",
        "(6) I cannot login into proftpd.",
        "(7) I cannot input kanji characters.",
        "(8) Please tell me how to build a Linux router with two NIC cards.",
        "(9) CGI cannot be executed on Apache 1.39.",
        "(10) The timer gets out of order after the restart.",
        "(11) Please tell me how to show error messages in English.",
        "(12) NFS server does not go.",
        "(13) Please tell me how to use MO drive.",
        "(14) Do you know how to monitor traffic load on networks.",
        "(15) Please tell me how to specify kanji code on Emacs.",
        "(16) I cannot input \\ on X Window System.",
        "(17) Please tell me how to extract characters from PDF files.",
        "(18) It takes me a lot of time to login.",
        "tem for the evaluation by using the answers of the full text retrieval system.",
        "Both systems could not answer question 4, “Tell me how to restore HDD partition to its normal condition”.",
        "However, the systems found an answer in which the way of saving files on a broken HDD partition was mentioned.",
        "Interestingly, this answer may satisfy a questioner because, in such cases, our desire is to save files on the broken HDD partition.",
        "In this way, it often happens that there are gaps between what a questioner wants to know and the answer, in several aspects, such as concreteness, expression and assumption.",
        "To overcome the gaps, it is important to investigate a dialogue system which Table 4: Results of finding a similar question by matching of user’s question and a significant sentence Test 1 Test 2 Test 3 our method 9 15 17 full text retrieval 5 5 8 (a) the number of questions which is given the proper answer Test 1 Test 2 Test 3 our method 9 25 42 full text retrieval 5 9 15 (b) the number of proper answers positive negative other positive & negative Test 1 2 2 5 0 Test 2 9 4 12 0 Test 3 10 5 25 2 (c) the number and type of labels given to proper answers can communicate with the questioner."
      ]
    }
  ]
}
