{
  "info": {
    "authors": [
      "Philipp Cimiano"
    ],
    "book": "Proceedings of the Fifth International Workshop on Inference in Computational Semantics",
    "id": "acl-W06-3915",
    "title": "Ingredients of a first-order account of bridging",
    "url": "https://aclweb.org/anthology/W06-3915",
    "year": 2006
  },
  "references": [
    "acl-J88-2003"
  ],
  "sections": [
    {
      "text": [
        "Institute AIFB, University of Karlsruhe",
        "1 Introduction",
        "The resolution of bridging references is certainly highly interrelated with the computation of discourse relations as well as with the integration of world knowledge into the interpretation of a discourse.",
        "In what follows we present examples which clearly corroborate this fact; the following example is taken from [4]:"
      ]
    },
    {
      "heading": null,
      "text": [
        "Example 1.1 John entered the room.",
        "He saw the chandelier sparkling brightly.",
        "In this example, the resolution of the bridging reference the chandelier depends on the discourse relation by which the second sentence is attached to the first.",
        "In fact, assuming that we can not see objects in a room if we are not in it, the chandelier can only be linked to the room in the first sentence if the seeing event follows the entering event, i.e. only if the temporal order imposed by the corresponding discourse relation preserves the surface order.",
        "In particular, inferring Narration or Result (cf. [9]) would be consistent with the resolution, while Explanation would not.",
        "Now let's consider the following example:",
        "Example 1.2 John entered the room.",
        "He saw the chandelier through the window.",
        "Provided that the window is resolved as being part of the room and assuming that we can only see objects through a window which are not in the same room, the definite description the chandelier can only be resolved as belonging to the room if the seeing event precedes the entering of the room the chandelier belongs to.",
        "In this case thus Explanation would be a valid discourse relation, while Narration and Result would not.",
        "The above examples clearly show how the computation of discourse relations, world knowledge and bridging reference resolution constrain each other.",
        "The following example consisting in a minimal pair also involves temporal aspects and has been discussed in [2] and later in [6]:",
        "a, John arrived at the oasis.",
        "The camels are standing under the palms, b, John arrived at the oasis.",
        "The camels were standing under the palms.",
        "The point here is that the camels in the second discourse can not be resolved as being the means of transport by which John arrived as the use of the imperfect shows a preference for interpreting the state in the second sentence as temporally overlapping with the arrival (compare [8] and [6]), which would yield an inconsistency as the camels would not be at the oasis as well as be at the oasis at overlapping states.",
        "The resolution of the camel as being the means of transport by which John arrived should thus be prohibited by any account of bridging reference resolution.",
        "In general we have to conclude that the resolution of a bridging reference has to be consistent with world knowledge as well as with the consequences introduced by certain discourse relations as well as by tense information.",
        "In order to model the information flow between bridging reference resolution, world knowledge, tense information and the computation of discourse relations, in this paper we present a declarative first-order account in which bridging reference resolution is a byproduct of building a minimal model of a discourse as in [5], which thus is also consistent with world knowledge as well as the implications of a certain (inferred) discourse relation.",
        "Our approach is in line with the approaches of Gardent and Konrad [5] as well as Hobbs et al.",
        "[7] in that minimality is the driving principle of discourse interpretation.",
        "In contrast to [2], we rely on FOL in our approach.",
        "In our view, there is in fact no obvious reason why discourse interpretation should actually be decidable.",
        "For further motivation about why minimal models are interesting as well as for a more detailed overview of related work, the interested reader is referred to [3]."
      ]
    },
    {
      "heading": "2. Ingredients of the logical theory",
      "text": [
        "The logical theory for which we want to find a minimal model consists of the following parts: i) a description of the input discourse, ii) discourse principles, iii) axioms on discourse relations, iv) tense and temporal axioms, and v) world knowledge.",
        "We describe each of these components in the following sections.",
        "The input discourse constitutes the variable part of the theory as it varies for each discourse we want to analyze.",
        "The input description of the discourse in particular states the surface order of the involved events.",
        "Let's for example consider example (1), for which the input description looks as follows, where -< denotes the surface order of events:",
        "3e,e',j,r,c enter(e) A agent(e,j) Apatient(e,r) A event(e) Apast(e) A perfect(e) A room(r) A see(e') A agent(e',j) A patient(e', c) A state(e') Apast(e') Aperfect(e') A chandelier(c) A e -< e'",
        "It has been argued especially by Asher et al.",
        "[2] and furthermore become the main point in SDRT, that discourse segments need to be connected to previous discourse segments by some rhetorical relation.",
        "We axiomatize this in our theory as follows:",
        "Definition 2.1 (Discourse Connectedness)",
        "That means, each event has to be discourse connected to some previously mentioned event (according to the surface order of events).",
        "This is in line with the approaches of [7] and [9].",
        "Now we only have to define what dconnected means:",
        "Definition 2.2 (Discourse Relations)",
        "where r\\...rn are constants representing the discourse relations described in [2] such as Narration, Parallel, Result, Explanation, Elaboration, Background, etc.",
        "So, in contrast to the work in [2] we are treating discourse relations as first-order constants instead of relations.",
        "Further, we need to define axioms specifying the spatio-temporal consequences of a given discourse relation.",
        "For the purposes of this paper, we will need temporal consequences on narration, result and explanation (compare [9]) as well as the spatial consequences on narration in [2]."
      ]
    },
    {
      "heading": "2. .4 Tense and Temporal Axioms",
      "text": [
        "Kamp has argued in [8] that the simple past - Passe Simple, as he discusses it for French - is typically used to report the successive elements of the main course of action of a story, while the imperfect serves to present the setting in which the action is taking place.",
        "In particular, Kamp presents a procedure ([8], p405) describing how a sentence in the perfect or in the imperfect relate to the preceding discourse.",
        "The procedure basically states the following: an event reported in the imperfect overlaps with all preceding events in imperfect until the first event reported in the perfect is encountered.",
        "The former ones are thus interpreted as describing the circumstances under which the punctual event (reported in the perfect) occurred.",
        "This is not the case, for the perfect, for which Kamp claims that a succession of sentences in the perfect convey a similar temporal order of the reported events.",
        "The second principle is probably to strong to be axiomatized (as temporal order does not always correspond to the surface order).",
        "Thus, we only ax-iomatize the first principle on the imperfect.",
        "Before, however, we need to introduce the notion of overlap © between eventualities.",
        "In fact, we will introduce a function denoting the intersection between two eventualities.",
        "Further, we will have a special sign ± denoting the empty intersection.",
        "The corresponding predicate ©p is then defined in terms of O f as follows:",
        "Ve e (Bp e{Reflexivity)",
        "Ve, e' e (Bp e y e (Bp e{Symmetry) Definition 2.4 (Imperfect)",
        "Ve eventuality(e) Apast(e) Aprog(e) – > (Ve'(eventuality(e') Apast(e') A",
        "Further, we will have a homogeneity axiom similar to the one proposed in [1] stating that if a condition P holds at the eventuality e, then it also holds for any part of e. The way in which we express this is by saying that for any overlapping eventuality é the conditions of e hold in particular at the intersection of e and ë.",
        "The following axiom is actually an axiom schema which needs to be instantiated for all different conditions which can hold at a given eventuality:",
        "Definition 2.5 (Homogeneity)",
        "Further, for events in general we assume the existence of an event nucleus structure as in [10] consisting of a preparatory and a consequent phase.",
        "Definition 2.6 (Nucleus)",
        "Ve, e' e' E prep(e) – > e' E nucleus(e) A e' DC e(Preparation) Ve, e' e' E conseq(e) – > e' E nucleus(e) A e DC e'(Consequent) Ve, e', e\" e\" ©p e A e' E nucleus(e) – > e\" ©p e'(NucleusOverlap)",
        "The last ingredient in our logical theory are axioms encoding world knowledge.",
        "Besides having axioms encoding a concept hierarchy with the corresponding disjointness axioms, most importantly we will have axioms describing preconditions and effects of events.",
        "The axioms needed for the purposes of this paper are shown in Figure 1.",
        "It is important to note that most of the above axioms should actually be formulated in a non-monotonic fashion, i.e. it is only normally the case that if we see something through a window, the object in question is in another room.",
        "However, a non-monotonic knowledge representation and reasoning scheme is out of the scope of this paper.",
        "We refer the interested reader to [9]."
      ]
    },
    {
      "heading": "3. Application to Examples",
      "text": [
        "Let's start the discussion of example 1.1.",
        "We will assume the input description 1 and get the following inferences:"
      ]
    },
    {
      "heading": "1.. dconnected(e,e') (Event Connectedness)",
      "text": [
        "2. drel(e,e', narration) V ... V drel(e,e', result) (Discourse Relations)"
      ]
    },
    {
      "heading": "6.. l=c (minimality)",
      "text": [
        "Now interesting is how the computation of discourse relations is affected by the bridging reference resolution: Assume that e and e' are connected by Narration; then we get by Temporal Consequences on Narration as well as",
        "Definition 2.7 (Rooms have lamps; chandeliers are some sort of lamps) Definition 2.8 (Entering a room) Definition 2.10 (Seeing through a windows implies a different location)",
        "An arrival always implies a preparatory traveling event as well as a means of transport spatio-temporally correlated with the traveler:",
        "Definition 2.11 (Arriving implies travelling)",
        "Ve,p, I arrive-at(e,p, I) A event(e) A person(p) A location(l) – y 3e' A tra,vel-to(e ,p, l) A e' e prep(e) Definition 2.12 (Travelling implies a mode of transport) Ve,p, i travel-to(e,p,l) A event(e) A person(p) A location(l) – ► 3m modeOfTransport(m) A3l'(loc(e,p,l') Aloc(e,m,l')) Definition 2.14 (Location)",
        "Fig.",
        "1.",
        "World Knowledge Axioms Spatial Consequences on Narration: e < é and 3?",
        "loc(s',j, l)Aloc(e',j, I).",
        "Assume that e and e' are connected by Result; then we get with Consequences on Result: e DC e' A cause(e,e') and thus s' ©p e' (Left Abut), i.e. John's being in the room overlaps with the seeing.",
        "Assume that e and e' are connected by Explanation; then we get with Consequences on Explanation: é DC e A cause(e', e) and thus s ©p é (Left Abut), the latter leading to a contradiction as s and ë have contradictory conditions.",
        "In fact, it holds that ~^loc(s®f e',j, r) (from 4 above and Homogeneity) as well as loc(s®f e', j, r) (from 3, 5 and 6 above, loc is functional and Homogeneity), which clearly results in a contradiction due to the fact that loc is functional.",
        "Thus, assuming that the chandelier is interpreted as belonging to the room, Explanation can not be inferred as discourse relation while Result and Narration are consistent with the assumption that the chandelier belongs to the room mentioned in the first sentence.",
        "Given these explanations, example 1.2 is easy to explain.",
        "In example 1.2, world knowledge implies that neither Result nor Narration can be inferred because in both cases a state s in which the condition loc(s,j,r) holds would yield a contradiction with seeing through a window implies different locations.",
        "In fact, the discourse relations Result or Narration can only be predicted in example 1.2 if the chandelier is accommodated with the result that the model would not be minimal anymore.",
        "For example 1.3 b, we assume the following input:",
        "event(e) A past(e) A perfect(e) A oasis(o) A camels(c) A",
        "Assuming that the palms are resolved as belonging to the oasis, we yield the following inferences:"
      ]
    },
    {
      "heading": "2.. dconnected(e,e ! ) (Event Connectedness)",
      "text": [
        "3. drel(e,e', narration) V ... V drel(e,e', result) (Discourse Relations) 4.",
        "Be\" travel Jo(e\",j,o) A e\" G prep(e) A e\" DC e (Arriving implies traveling & Prep) 6.",
        "3m modeOfTransport(m) A loc(e\",j, I) A loc(e\", m, I) (Mode of Transport)",
        "Thus we get an inconsistency in every model which identifies the camels c with the mode of transport m. This inconsistency is due to the fact that John is spatio-temporally correlated with the mode of transport during (e\" ©/ s) ©/ e', i.e loc((e\"®fs)®fe',j,l)Aloc((e\"®fs)®fe',c,l) (5,6 above, Homogeneity, Left Abut, Left & Overlap), which yields yield a contradiction with -i/oc((e\" ©/ s) © e', j, o) and loc((e\" ©/ s) © e', c, o) due to 1,7 above, Homogeneity, Left Abut, Left Abut & Overlap and Loc is functional."
      ]
    },
    {
      "heading": "4. Conclusion",
      "text": [
        "We have presented an approach to bridging reference resolution taking into account the information flow between a certain resolution, the computation of discourse relations as well as linguistic and world knowledge.",
        "In our approach this information flow is declarative and emerges as a byproduct of building a minimal model for a logical theory as in [5].",
        "Our contribution lies in spelling out the ingredients of such a logical theory."
      ]
    }
  ]
}
