{
  "info": {
    "authors": [
      "Baohua Gu"
    ],
    "book": "BioNLP Workshop on Linking Natural Language and Biology",
    "id": "acl-W06-3318",
    "title": "Recognizing Nested Named Entities in GENIA Corpus",
    "url": "https://aclweb.org/anthology/W06-3318",
    "year": 2006
  },
  "references": [
    "acl-W03-1305",
    "acl-W04-1213",
    "acl-W04-1221"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Nested Named Entities (nested NEs), one containing another, are commonly seen in biomedical text, e.g., accounting for 16.7% of all named entities in GENIA corpus.",
        "While many works have been done in recognizing non-nested NEs, nested NEs have been largely neglected.",
        "In this work, we treat the task as a binary classification problem and solve it using Support Vector Machines.",
        "For each token in nested NEs, we use two schemes to set its class label: labeling as the outmost entity or the inner entity.",
        "Our preliminary results show that while the outmost labeling tends to work better in recognizing the outmost entities, the inner labeling recognizes the inner NEs better.",
        "This result should be useful for recognition of nested NEs."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Named Entity Recognition (NER) is a key task in biomedical text mining, as biomedical named entities usually represent biomedical concepts of research interest (e.g., protein/gene/virus, etc).",
        "Nested NEs (also called embedded NEs, or cascade NEs) exhibit an interesting phenomenon in biomedical literature.",
        "For example, “human immuneodeficiency virus type 2 enhancer” is a DNA domain, while “human immunodeficiency virus type 2” represents a virus.",
        "For simplicity, we call the former the outmost entity (if it is not inside another entity), while the later the inner entity (it may have another one inside).",
        "Nested NEs account for 16.7% of all entities in GENIA corpus (Kim, 2003).",
        "Moreover, they often represent important relations between entities (Nedadic, 2004), as in the above example.",
        "However, there are few results on recognizing them.",
        "Many studies only consider the outmost entities, as in BioNLP/NLPBA 2004 Shared Task (Kim, 2004).",
        "In this work, we use a machine learning method to recognize nested NEs in GENIA corpus.",
        "We view the task as a classification problem for each token in a given sentence, and train a SVM model.",
        "We note that nested NEs make it hard to be considered as a multi-class problem, because a token in nested entities has more than one class label.",
        "We therefore treat it as a binary-class problem, using one-vs-rest scheme."
      ]
    },
    {
      "heading": "1.1 Related Work",
      "text": [
        "Overall, our work is an application of machine learning methods to biomedical NER.",
        "While most of earlier approaches rely on handcrafted rules or dictionaries, many recent works adopt machine learning approaches, e.g, SVM (Lee, 2003), HMM (Zhou, 2004), Maximum Entropy (Lin, 2004) and CRF (Settles,2004), especially with the availability of annotated corpora such as GENIA, achieving state-of-the-art performance.",
        "We know only one work (Zhou,2004) that deals with nested NEs to improve the overall NER performance.",
        "However, their approach is basically rule-based and they did not report how well the nested NEs are recognized."
      ]
    },
    {
      "heading": "2 Methodology",
      "text": [
        "We use SVM-light (http://svmlight.joachims.org/) to train a binary classifier on the GENIA corpus."
      ]
    },
    {
      "heading": "2.1 Data Set",
      "text": [
        "The GENIA corpus (version 3.02) contains 97876 named entities (35947 distinct) of 36 types, and 490941 tokens (19883 distinct).",
        "There are 16672",
        "nested entities, containing others or nested in others (the maximum embedded levels is four).",
        "Among all the outmost entities, 2342 are protein and 1849 are DNA, while there are 9298 proteins and 1452 DNAs embedded in other entities."
      ]
    },
    {
      "heading": "2.2 Features and Class Label",
      "text": [
        "For each token, we generate four types of features, reflecting its characteristics on orthography, part-of-speech, morphology, and special nouns.",
        "We also use a window of (-2, +2) as its context.",
        "For each token, we use two schemes to set the class label: outmost labeling and inner labeling.",
        "In the outmost labeling, a token is labeled +1 if the outmost entity containing it is the target entity, while in the inner labeling, a token is labeled +1 if any entity containing it is the target entity.",
        "Otherwise, the token is labeled -1."
      ]
    },
    {
      "heading": "3 Experiment And Discussion",
      "text": [
        "We report our preliminary experimental results on recognizing protein and DNA nested entities.",
        "For each target entity type (e.g., protein) and each labeling scheme, we obtain a data set containing 490941 instances.",
        "We run 5-fold cross-validation, and measure performance (P/R/F) of exact match, left/right boundary match w.r.t.",
        "outmost and inner entities respectively.",
        "The results are shown in Table 1 and Table 2.",
        "From the tables, we can see that while the outmost labeling works (slightly) better for the outmost entities, the inner labeling works better for the inner entities.",
        "This result seems reasonable in that each labeling scheme tends to introduces more entities of its type in the training set.",
        "It is interesting to see that the inner labeling works much better in identifying inner proteins than in inner DNAs.",
        "The reason could be due to the fact that there are about three times more inner proteins than the outmost ones, while the numbers of inner DNAs and outmost DNAs are roughly the same (see Section 2.1).",
        "Another observation is that the inner labeling gains significantly (over the outmost labeling) in the inner entities, comparing to its loss in the outmost entities.",
        "We are not sure whether this is the general trend for other types of entities, and if so, what causes it.",
        "We will address this issue in our following work.",
        "We hope these results can help in recognizing nested NEs, and also attract more attention to the nested NE problem.",
        "We are going to further our study by looking into more related issues."
      ]
    }
  ]
}
