{
  "info": {
    "authors": [
      "Ayman Farahat",
      "Francine R. Chen"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E06-1014",
    "title": "Improving Probabilistic Latent Semantic Analysis With Principal Component Analysis",
    "url": "https://aclweb.org/anthology/E06-1014",
    "year": 2006
  },
  "references": [
    "acl-J97-1003",
    "acl-W00-1305"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Probabilistic Latent Semantic Analysis (PLSA) models have been shown to provide a better model for capturing polysemy and synonymy than Latent Semantic Analysis (LSA).",
        "However, the parameters of a PLSA model are trained using the Expectation Maximization (EM) algorithm, and as a result, the trained model is dependent on the initialization values so that performance can be highly variable.",
        "In this paper we present a method for using LSA analysis to initialize a PLSA model.",
        "We also investigated the performance of our method for the tasks of text segmentation and retrieval on personal-size corpora, and present results demonstrating the efficacy of our proposed approach."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In modeling a collection of documents for information access applications, the documents are often represented as a “bag of words”, i.e., as term vectors composed of the terms and corresponding counts for each document.",
        "The term vectors for a document collection can be organized into a term by document co-occurrence matrix.",
        "When directly using these representations, synonyms and polysemous terms, that is, terms with multiple senses or meanings, are not handled well.",
        "Methods for smoothing the term distributions through the use of latent classes have been shown to improve the performance of a number of information access tasks, including retrieval over smaller collections (Deerwester et al., 1990), text segmentation (Brants et al., 2002), and text classification (Wu and Gunopulos, 2002).",
        "The Probabilistic Latent Semantic Analysis model (PLSA) (Hofmann, 1999) provides a probabilistic framework that attempts to capture polysemy and synonymy in text for applications such as retrieval and segmentation.",
        "It uses a mixture decomposition to model the co-occurrence data, and the probabilities of words and documents are obtained by a convex combination of the aspects.",
        "The mixture approximation has a well defined probability distribution and the factors have a clear probabilistic meaning in terms of the mixture component distributions.",
        "The PLSA model computes the relevant probability distributions by selecting the model parameter values that maximize the probability of the observed data, i.e., the likelihood function.",
        "The standard method for maximum likelihood estimation is the Expectation Maximization (EM) algorithm.",
        "For a given initialization, the likelihood function increases with EM iterations until a local maximum is reached, rather than a global maximum, so that the quality of the solution depends on the initialization of the model.",
        "Additionally, the likelihood values across different initializations are not comparable, as we will show.",
        "Thus, the likelihood function computed over the training data cannot be used as a predictor of model performance across different models.",
        "Rather than trying to predict the best performing model from a set of models, in this paper we focus on finding a good way to initialize the PLSA model.",
        "We will present a framework for using Latent Semantic Analysis (LSA) (Deerwester et al., 1990) to better initialize the parameters of a corresponding PLSA model.",
        "The EM algorithm is then used to further refine the initial estimate.",
        "This combination of LSA and PLSA leverages the advantages of both.",
        "This paper is organized as follows: in section 2, we review related work in the area.",
        "In section 3, we summarize related work on LSA and its probabilistic interpretation.",
        "In section 4 we review the PLSA model and in section 5 we present our method for initializing a PLSA model using LSA model parameters.",
        "In section 6, we evaluate the performance of our framework on a text segmentation task and several smaller information retrieval tasks.",
        "And in section 7, we summarize our results and give directions for future work."
      ]
    },
    {
      "heading": "2 Background",
      "text": [
        "A number of different methods have been proposed for handling the non-globally optimal solution when using EM.",
        "These include the use of Tempered EM (Hofmann, 1999), combining models from different initializations in postprocessing (Hofmann, 1999; Brants et al., 2002), and trying to find good initial values.",
        "For their segmentation task, Brants et al.",
        "(2002) found overfitting, which Tempered EM helps address, was not a problem and that early stopping of EM provided good performance and faster learning.",
        "Computing and combining different models is computationally expensive, so a method that reduces this cost is desirable.",
        "Different methods for initializing EM include the use of random initialization e.g., (Hofmann, 1999), k-means clustering, and an initial cluster refinement algorithm (Fayyad et al., 1998).",
        "K-means clustering is not a good fit to the PLSA model in several ways: it is sensitive to outliers, it is a hard clustering, and the relation of the identified clusters to the PLSA parameters is not well defined.",
        "In contrast to these other initialization methods, we know that the LSA reduces noise in the data and handles synonymy, and so should be a good initialization.",
        "The trick is in trying to relate the LSA parameters to the PLSA parameters.",
        "LSA is based on singular value decomposition (SVD) of a term by document matrix and retaining the top K singular values, mapping documents and terms to a new representation in a latent semantic space.",
        "It has been successfully applied in different domains including automatic indexing.",
        "Text similarity is better estimated in this low dimension space because synonyms are mapped to nearby locations and noise is reduced, although handling of polysemy is weak.",
        "In contrast, the PLSA model distributes the probability mass of a term over the different latent classes corresponding to different senses of a word, and thus better handles polysemy (Hofmann, 1999).",
        "The LSA model has two additional desirable features.",
        "First, the word document co-occurrence matrix can be weighted by any weight function that reflects the relative importance of individual words (e.g., tf-idf).",
        "The weighting can therefore incorporate external knowledge into the model.",
        "Second, the SVD algorithm is guaranteed to produce the matrix of rank k that minimizes the distance to the original word document co-occurrence matrix.",
        "As noted in Hofmann (1999), an important difference between PLSA and LSA is the type of objective function utilized.",
        "In LSA, this is the L2 or Frobenius norm on the word document counts.",
        "In contrast, PLSA relies on maximizing the likelihood function, which is equivalent to minimizing the cross-entropy or Kullback-Leibler divergence between the empirical distribution and the predicted model distribution of terms in documents.",
        "A number of methods for deriving probabilities from LSA have been suggested.",
        "For example, Coccaro and Jurafsky (1998) proposed a method based on the cosine distance, and Tipping and Bishop (1999) give a probabilistic interpretation of principal component analysis that is formulated within a maximum-likelihood framework based on a specific form of Gaussian latent variable model.",
        "In contrast, we relate the LSA parameters to the PLSA model using a probabilistic interpretation of dimensionality reduction proposed by Ding (1999) that uses an exponential distribution to model the term and document distribution conditioned on the latent class."
      ]
    },
    {
      "heading": "3 LSA",
      "text": [
        "We briefly review the LSA model, as presented in Deerwester et al.",
        "(1990), and then outline the LSA-based probability model presented in Ding (1999).",
        "The term to document association is presented as a term-document matrix",
        "containing the frequency of the ✥ index terms occurring in ✦ documents.",
        "The frequency counts can also be weighted to reflect the relative importance of individual terms (e.g., Guo et al., (2003)).",
        "✔✧ is an ✥ dimensional column vector representing ✍ ✎ ✑",
        "document i and t✁ is an n dimensional row vector representing term ✄.",
        "LSA represents terms and documents in a new vector space with smaller dimensions that minimize the distance between the projected terms and the original terms.",
        "This is done through the truncated (to rank k) singular",
        "Among all m ✚ n matrices of rank k, X✆ is the one that minimizes the Frobenius norm ✜ ✜X ✣ X✆✜ ✜✦✧✘"
      ]
    },
    {
      "heading": "3.1 LSA-based Probability Model",
      "text": [
        "The LSA model based on SVD is a dimensionality reduction algorithm and as such does not have a probabilistic interpretation.",
        "However, under certain assumptions on the distribution of the input data, the SVD can be used to define a probability model.",
        "In this section, we summarize the results presented in Ding (1999) of a dual probability representation of LSA.",
        "Assuming the probability distribution of a document xi is governed by k characteristic (normalized) document vectors, ★i • • • ★✆, and that the ★i • • • ★✆ are statistically independent factors, Ding (1999) shows that using maximum likelihood estimation, the optimal solution for",
        "where ❁(✓i • • • ✓✆) is a normalization constant.",
        "The dual formulation for the probability of term t in terms of the tight eigenvectors (i.e., the docu",
        "where ❁(✗i • • • ✗✆) is a normalization constant.",
        "Ding also shows that ✓✁ is related to ✗✁ by:",
        "We will use Equations 3-5 in relating LSA to PLSA in section 5."
      ]
    },
    {
      "heading": "4 PLSA",
      "text": [
        "The PLSA model (Hofmann, 1999) is a generative statistical latent class model: (1) select a document ● with probability ✬(●) (2) pick a latent class ❍ with probability ✬(❍✜ ●) and (3) generate a word ❏ with probability ✬(❏✜ ❍), where",
        "and using Bayes’ rule can be written as:"
      ]
    },
    {
      "heading": "4.1 Model Initialization and Performance",
      "text": [
        "An important consideration in PLSA modeling is that the performance of the model is strongly affected by the initialization of the model prior to training.",
        "Thus a method for identifying a good initialization, or alternatively a good trained model, is needed.",
        "If the final likelihood value obtained after training was well correlated with accuracy, then one could train several PLSA models, each with a different initialization, and select the model with the largest likelihood as the best model.",
        "Although, for a given initialization, the likelihood",
        "increases to a locally optimal value with each iteration of EM, the final likelihoods obtained from different initializations after training do not correlate well with the accuracy of the corresponding models.",
        "This is shown in Table 1, which presents correlation coefficients between likelihood values and either average or breakeven precision for several datasets with 64 or 256 latent classes, i.e., factors.",
        "Twenty random initializations were used per evaluation.",
        "Fifty iterations of EM per initialization were run, which empirically is more than enough to approach the optimal likelihood.",
        "The coefficients range from -0.64 to 0.25.",
        "The poor correlation indicates the need for a method to handle the variation in performance due to the influence of different initialization values, for example through better initialization methods.",
        "Hofmann (1999) and Brants (2002) averaged results from five and four random initializations, respectively, and empirically found this to improve performance.",
        "The combination of models enables redundancies in the models to minimize the expression of errors.",
        "We extend this approach by replacing one random initialization with one reasonably good initialization in the averaged models.",
        "We will empirically show that having at least one reasonably good initialization improves the performance over simply using a number of different initializations."
      ]
    },
    {
      "heading": "5 LSA-based Initialization of PLSA",
      "text": [
        "The EM algorithm for estimating the parameters of the PLSA model is initialized with estimates of the model parameters p(z), p(wI z), p(dI z).",
        "Hofmann (1999) relates the parameters of the PLSA model to an LSA model as follows:",
        "Comparing with Equation 2, the k LSA factors, ui and vj correspond to the factors p(wIz) and p(dI z) of the PLSA model and the mixing proportions of the latent classes in PLSA, p(z), correspond to the singular values of the SVD in LSA.",
        "Note that we can not directly identify the matrix"
      ]
    },
    {
      "heading": "Uk with Upisa and Vk with Vpisa since both Uk",
      "text": [
        "and Vk contain negative values and are not probability distributions.",
        "However, using equations 3 and 4, we can attach a probabilistic interpretation to LSA, and then relate Uplsa and Vplsa with the corresponding LSA matrices.",
        "We now outline this relation.",
        "Equation 4 represents the probability of occurrence of term tj in the different documents conditioned on the SVD right eigenvectors.",
        "The j, kth element in equation 15 represent the probability of term wj conditioned on the latent class zk.",
        "As in the analysis above, we assume that the latent classes in the LSA model correspond to the latent classes of the PLSA model.",
        "Making the simplifying assumption that the latent classes of the LSA model are conditionally independent on term tj,",
        "Thus, other than a constant that is based on p(tj) and Z(v), we can relate each p(tjIvP) to a corresponding e(ti'VJ)2.",
        "We make the simplifying assumption that p(tj) is constant across terms and normalize the exponential term to a probability: e(t,.V])2",
        "to the LSA right eigenvector vj, we then estimate",
        "Similarly, relating the document dj in the PLSA model to the distribution of LSA document over terms, xj, and using Equation 5 to show that vj is related to uj we get:",
        "The singular values, o✑ in Equation 2, are by definition positive.",
        "Relating these values to the mixing proportions, p(z✑), we generalize the relation using a function ✁ O, where ✁ O is any nonnegative function over the range of all or✑, and normalize so that the estimated p(z✑) is a probability:",
        "We have experimented with different forms of ✁ ( ) including the identity function and the logarithmic function.",
        "For our experiments, we used ✁ (or) log(or).",
        "In our LSA-initialized PLSA model, we initialize the PLSA model parameters using Equations 19-21.",
        "The EM algorithm is then used beginning with the E-step as outlined in Equations 9-12."
      ]
    },
    {
      "heading": "6 Results",
      "text": [
        "In this section we evaluate the performance of LSA-initialized PLSA (LSA-PLSA).",
        "We compare the performance of LSA-PLSA to LSA only and PLSA only, and also compare its use in combination with other models.",
        "We give results for a smaller information retrieval application and a text segmentation application, tasks where the reduced dimensional representation has been successfully used to improve performance over simpler word count models such as tf-idf."
      ]
    },
    {
      "heading": "6.1 System Description",
      "text": [
        "To test our approach for PLSA initialization we developed an LSA implementation based on the SVDLIBC package (http://tedlab.mit.edu/✂dr/SVDLIBC/) for computing the singular values of sparse matrices.",
        "The PLSA implementation was based on an earlier implementation by Brants et al.",
        "(2002).",
        "For each of the corpora, we tokenized the documents and used the LinguistX morphological analyzer to stem the terms.",
        "We used entropy weights (Guo et al., 2003) to weight the terms in the document matrix."
      ]
    },
    {
      "heading": "6.2 Information Retrieval",
      "text": [
        "We compared the performance of the LSA-PLSA model against randomly-initialized PLSA and against LSA for four different retrieval tasks.",
        "In these tasks, the retrieval is over a smaller corpus, on the order of a personal document collection.",
        "We used the following four standard document collections: (i) MED (1033 document abstracts from the National Library of Medicine), (ii) CRAN (1400 documents from the Cranfield Institute of Technology), (iii) CISI (1460 abstracts in library science from the Institute for Scientific Information) and (iv) CACM (3204 documents from the association for computing machinery).",
        "For each of these document collections, we computed the LSA, PLSA, and LSA-PLSA representations of both the document collection and the queries for a range of latent classes, or factors.",
        "For each data set, we used the computed representations to estimate the similarity of each query to all the documents in the original collection.",
        "For the LSA model, we estimated the similarity using the cosine distance between the reduced dimensional representations of the query and the candidate document.",
        "For the PLSA and LSA-PLSA models, we first computed the probability of each",
        "using Equation 7 and assuming that p(d) is uniform.",
        "This gives us a PLSA-smoothed term representation of each document.",
        "We then computed the Hellinger similarity (Basu et al., 1997) between the term distributions of the candidate document, p(w1d), and query, p(wj✄).",
        "In all of the evaluations, the results for the PLSA model were averaged over four different runs to account for the dependence on the initial conditions."
      ]
    },
    {
      "heading": "6.2.1 Single Models",
      "text": [
        "In addition to LSA-based initialization of the PLSA model, we also investigated initializing the PLSA model by first running the “k-means” algorithm to cluster the documents into k classes, where k is the number of latent classes and then initializing p(wjz) based on the statistics of word occurrences in each cluster.",
        "We iterated over the",
        "number of latent classes starting from 10 classes up to 540 classes in increments of 10 classes.",
        "We evaluated the retrieval results (at the 11 standard recall levels as well as the average precision and break-even precision) using manually tagged relevance.",
        "Figure 1 shows the average precision as a function of the number of latent classes for the CACM collection, the largest of the datasets.",
        "The LSA-PLSA model performance was better than both the LSA performance and the PLSA performance at all class sizes.",
        "This same general trend was observed for the CISI dataset.",
        "For the two smallest datasets, the LSA-PLSA model performed better than the randomly-initialized PLSA model at all class sizes; it performed better than the LSA model at the larger classes sizes where the best performance is obtained.",
        "Table 2: Retrieval Evaluation with Single Models.",
        "Best performing model for each dataset/metric is in bold.",
        "In Table 2 the performance for each model using the optimal number of latent classes is shown.",
        "The results show that LSA-PLSA outperforms LSA on 7 out of 8 evaluations.",
        "LSA-PLSA outperforms both random and k-means initialization of PLSA in all evaluations.",
        "In addition, performance using random initialization was never worse than kmeans initialization, which itself is sensitive to initialization values.",
        "Thus in the rest of our experiments we initialized PLSA models using the simpler random-initialization instead of k-means initialization."
      ]
    },
    {
      "heading": "6.2.2 Multiple Models",
      "text": [
        "We explored the use of an LSA-PLSA model when averaging the similarity scores from multiple models for ranking in retrieval.",
        "We compared a baseline of 4 randomly-initialized PLSA models against 2 averaged models that contain an LSA-PLSA model: 1) 1 LSA, 1 PLSA, and 1 LSA-PLSA model and 2) 1 LSA-PLSA with 3 PLSA models.",
        "We also compared these models against the performance of an averaged model without an LSA-PLSA model: 1 LSA and 1 PLSA model.",
        "In each case, the PLSA models were randomly initialized.",
        "Figure 2 shows the average precision as a function of the number of latent classes for the CISI collection using multiple models.",
        "In all class sizes, a combined model that included the LSA-initialized PLSA model had performance that was at least as good as using 4 PLSA models.",
        "This was also true for the CRAN dataset.",
        "For the other two datasets, the performance of the combined model was always better than the performance of 4 PLSA models when the number of factors was no more than 200-300, the region where the best performance was observed.",
        "Table 3 summarizes the results and gives the best performing model for each task.",
        "Comparing",
        "Tables 2 and 3, note that the use of multiple models improved retrieval results.",
        "Table 3 also indicates that combining 1 LSA, 1 PLSA and 1 LSA-PLSA models outperformed the combination of 4 PLSA models in 7 out of 8 evaluations.",
        "For our data, the time to compute the LSA model is approximately 60% of the time to compute a PLSA model.",
        "The running time of the “LSA PLSA LSA-PLSA” model requires computing 1 LSA and 2 PLSA models, in contrast to 4 models for the 4PLSA model, therefore requiring less than 75% of the running time of the 4PLSA model."
      ]
    },
    {
      "heading": "6.3 Text Segmentation",
      "text": [
        "A number of researchers, (e.g., Li and Yamanishi (2000); Hearst (1997)), have developed text segmentation systems.",
        "Brants et.",
        "al.",
        "(2002) developed a system for text segmentation based on a PLSA model of similarity.",
        "The text is divided into overlapping blocks of sentences and the PLSA representation of the terms in each block, p(wIb), is computed.",
        "The similarity between pairs of adjacent blocks b✄, b✁ is computed using p(wIb✄) and p (w I b✁) and the Hellinger similarity measure.",
        "The positions of the largest local minima, or dips, in the sequence of block pair similarity values are emitted as segmentation points.",
        "We compared the use of different initializations on 500 documents created from Reuters-21578, in a manner similar to Li and Yamanishi (2000).",
        "The performance is measured using error probability at the word and sentence level (Beeferman et al., 1997), ✎k and ✎k, respectively.",
        "This measure allows for close matches in segment boundaries.",
        "Specifically, the boundaries must be within k words/sentences, where k is set to be half the av-Table 4: Single Model Segmentation Word and Sentence Error Rates (%).",
        "PLSA error rate at the optimal number of classes in terms of ✎k is in italic.",
        "Best performing model is in bold without italic.",
        "erage segment length in the test data.",
        "In order to account for the random initial values of the PLSA models, we performed the whole set of experiments for each parameter setting four times and averaged the results."
      ]
    },
    {
      "heading": "6.3.1 Single Models for Segmentation",
      "text": [
        "We compared the segmentation performance using an LSA-PLSA model against the randomly-initialized PLSA models used by Brants et al.",
        "(2002).",
        "Table 4 presents the performance over different classes sizes for the two models.",
        "Comparing performance at the optimum class size for each model, the results in Table 4 show that the LSA-PLSA model outperforms PLSA on both word and sentence error rate.",
        "Table 5: Multiple Model Segmentation Word and Sentence Error Rates (%).",
        "Performance at the optimal number of classes in terms of ✎k is in italic.",
        "Best performing model is in bold without italic."
      ]
    },
    {
      "heading": "6.3.2 Multiple Models for Segmentation",
      "text": [
        "We explored the use of an LSA-PLSA model when averaging multiple PLSA models to reduce the effect of poor model initialization.",
        "In particular, the adjacent block similarity from multiple",
        "models was averaged and used in the dip computations.",
        "For simplicity, we fixed the class size of the individual models to be the same for a particular combined model and then computed performance over a range of class sizes.",
        "We compared a baseline of four randomly initialized PLSA models against two averaged models that contain an LSA-PLSA model: 1) one LSA-PLSA with two PLSA models and 2) one LSA-PLSA with three PLSA models.",
        "The best results were achieved using a combination of PLSA and LSA-PLSA models (see Table 5).",
        "And all multiple model combinations performed better than a single model (compare Tables 4 and 5), as expected.",
        "In terms of computational costs, it is less costly to compute one LSA-PLSA model and two PLSA models than to compute four PLSA models.",
        "In addition, the LSA-initialized models tend to perform best with a smaller number of latent variables than the number of latent variables needed for the four PLSA model, also reducing the computational cost."
      ]
    },
    {
      "heading": "7 Conclusions",
      "text": [
        "We have presented LSA-PLSA, an approach for improving the performance of PLSA by leveraging the best features of PLSA and LSA.",
        "Our approach uses LSA to initialize a PLSA model, allowing for arbitrary weighting schemes to be incorporated into a PLSA model while leveraging the optimization used to improve the estimate of the PLSA parameters.",
        "We have evaluated the proposed framework on two tasks: personal-size information retrieval and text segmentation.",
        "The LSA-PLSA model outperformed PLSA on all tasks.",
        "And in all cases, combining PLSA-based models outperformed a single model.",
        "The best performance was obtained with combined models when one of the models was the LSA-PLSA model.",
        "When combining multiple PLSA models, the use of LSA-PLSA in combination with either two PLSA models or one PLSA and one LSA model improved performance while reducing the running time over the combination of four or more PLSA models as used by others.",
        "Future areas of investigation include quantifying the expected performance of the LSA-initialized PLSA model by comparing performance to that of the empirically best performing model and examining whether tempered EM could further improve performance."
      ]
    }
  ]
}
