{
  "info": {
    "authors": [
      "Rainer Kuhlen"
    ],
    "book": "International Conference on Computational Linguistics and Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P84-1115",
    "title": "An Intonational Delphi Poll on Future Trends in \"Information Linguistics\"",
    "url": "https://aclweb.org/anthology/P84-1115",
    "year": 1984
  },
  "references": [],
  "sections": [
    {
      "heading": "AN INTERNATIONAL DELPHI POLL ON FUTURE TRENDS IN \"INFORMATION LINGUISTICS\"",
      "text": [
        "The results of an international Delphi poll on information linguistics which was carried out between 1982 and 1983 are presented.",
        "As part of conceptual work being done in information science at the University of Constance an international Delphi poll was carried out from 1982 to 1983 with the aim of establishing a midterm prognosis for the development of \"information linguistics\".",
        "The term \"information linguistics\" refers to a scientific discipline combining the fields of linguistic data processing, applied computer science, linguistics, artificial intelligence, and information science.",
        "A Delphi poll is a written poll of experts - carried out in this case in two phases.",
        "The results of the first round were incorporated into the second round, so that participants in the poll could react to the trends as they took shape."
      ]
    },
    {
      "heading": "1. Some demoscopic data 1.1 Return rate",
      "text": [
        "Based on sophisticated selection procedures 385 international experts in the field of information linguistics were determined and were sent questionnaires in the first round (April 1982).",
        "90 questionnaires were returned.",
        "In the second round 360 questionnaires were mailed out (January 1983) and 56 were returned, 48 of these from experts who had answered in the first round.",
        "The last questionnaires were accepted at the end of June 1983.",
        "Overlapping data in the two rounds first round (90) second round (56) 2 48 In the following we refer to four sets of data: Set _A 90 from round 1 Set B 48 from round 1 with answers in round 2 Set-C 56 from round 2 Set-b 48 from round 2 with answers in round 1 But we shall concentrate primarily on Set C because according to the Delphi philosophy - the data of the second round are the most relevant.",
        "There were 8 persons within Set _C who did not answer in the first round.",
        "But they also were aware of the results of the first round; therefore a Delphi effect was possible.",
        "(In the following the whole integers refer to absolute numbers; the decimal figures to relative/procentual numbers)"
      ]
    },
    {
      "heading": "1.2 Qualification according to academic degree",
      "text": [
        "The survey singled out highly competent people, as reflected in academic degree( data from A and C):"
      ]
    },
    {
      "heading": "Tab.1 Qpqlification of participants",
      "text": [
        "Set _A Set _C",
        "Since Delphi polls are concerned with future developments, it has been claimed in the past that the age and experience of people in the field influence the rating.",
        "In this paper, however, we cannot prove this hypothesis.",
        "Here are the mere statistical facts, only taken from Set _C (they do not differ significantly in the other sets)"
      ]
    },
    {
      "heading": "Tab.2 Age of participants",
      "text": [
        "-30 30-35 36-40 41-45 46-50 50- years"
      ]
    },
    {
      "heading": "3 5.6 14 25.9 14 25.9 10 18.5 5 9.3 8 14.8 1.4 Experience",
      "text": [
        "The number of years these trained specialists have been working in the general area of information linguistics were as follows",
        "These data in particular confirm our impression that very qualified and experienced people answered the questionnaire.",
        "Almost 60% have worked longer than 10 years in the general area of information linguistics."
      ]
    },
    {
      "heading": "1.5 Size of research groups",
      "text": [
        "Most of those answering the questionnaire work in a research-group.",
        "Table 4 gives an impression of the size of the groups in Set _A and Set C:"
      ]
    },
    {
      "heading": "1*.7 Research and application/development",
      "text": [
        "With respect to whether participants are mainly involved in research (defined as: basic groundwork, mainly of theoretical interest, experimental environment) or in application/development (defined as: mainly of interest from the point of view of working systems (i.e. commercial, industrial), applicable to routine tasks) the results were as follows:",
        "Most of the work in information linguistics so far has concentrated on English (generally more than 80%, with slight differences in the single sub-areas, i.e. acoustic 80.6%, indexing 82.5%, question-answering 83.3%).",
        "2.",
        "Content of the questionnaire"
      ]
    },
    {
      "heading": "2.1 Sub-areas",
      "text": [
        "The discipline \"information linguistics\" was not defined theoretically but ostensively instead by a number of sub-areas."
      ]
    },
    {
      "heading": "2.2 Single topics",
      "text": [
        "The sub-areas included a varying number of topics (from 6 to 15).",
        "These topics were chosen based on the author's experience in information linguistics, on a pretest with mostly German researchers and practitioners, on advices from members of FID/ID, and on long discussions with Don Walker, Hans Karlgren, and Udo Hahn.",
        "Altogether, there were 91 topics in the first round and 90 in the second round, as follows:.",
        "university research institute industrial research information industry indust.",
        "administ.",
        "public administration public inf.",
        "systems",
        "e.g. for ab4: \"procedures of text condensation that stress the overall, true-to-scale compression of a given text; although varying in length (according to the degree of reduction); can be used as a substitute for original texts\"."
      ]
    },
    {
      "heading": "3. Answer parameters for the sub-areas",
      "text": []
    },
    {
      "heading": "3.1 Competence (=CO)",
      "text": [
        "At the beginning of every sub-area participants were requested to rate their competence according to three parameters \"good\" (with a specialist's knowledge), \"fair\" (with a working knowledge), and \"superficial\" (with a"
      ]
    },
    {
      "heading": "3.2 Desirability (=DE)",
      "text": [
        "With respect to the application oriented subject areas the category of desirability was used in order to determine the social desirability according to the following 4-point scale: \"very desirable\"/++ (will have a positive social effect, little or no negative social effect, extremely beneficial), \"desirable\"/+ (in general positive, minor negative social effects), \"undesirable\"!",
        "(negative social effect, socially harmful), \"very undesirable\"/-- (major negative social effect, socially not justifiable).",
        "Tab.9 (data from Set C) shows that the nega, tive parameters (--, -) were never or only seldom used.",
        "Information linguistics is not judged - according to the estimation of tne experts - as a socially harmful scientific discipline.",
        "4.",
        "Answer parameters for the single topics",
        "The following parameters were used as ratings for the sub-areas and the single topics.",
        "Their definitions were given in more detail in the questionnaire.",
        "- slightly i.",
        "- doubtf.",
        "f. 2010 +/-10 -•un-i.",
        "--def.",
        "un-f. non-realistic These categories of scientific importance, feasibility, and date of realization were to be judged from two points of view: research(=R) - defined as: basic groundwork, mainly of theoretical interest application/development (=A) - defined as: mainly of interest for working systems, applicable to routine tasks",
        "As can be seen in the column FIR, sometimes the general trend is reversed (Semantic: values from \"competent\" participants are lower than from participants with \"superficial\" competence).",
        "There is also a connection between desirability and the values of importance and feasibility.",
        "Those who gave high ratings for desirability (DE++) in general gave higher values to the single topics in the respective sub-areas, both in comparison to the average values and to the values of those who gave only high desirability (DE+) to a given sub-area.",
        "The differences between DE++ and DE+ are even higher than those between C/g und C/s.",
        "Only the F/R data in the translation and retrieval areas are lower for D++ than for D+, in all other cases the D++ values are higher.",
        "Some examples:",
        "together, and the values from the single topics have been averaged.",
        "EXact year-data were calculated from the answers on the 6-point rating scale, cf. Tab.10.",
        "In order to show the Delphi effect the data in Tab.",
        "13 are taken from Set A, in Tab.14 from Set C) Tab.13 Averaged I-, F-, DR-values from Set A",
        "The average values in Tab.",
        "13 and 14 should not be over-interpreted.",
        "In particular, ranking is unjustified.",
        "One cannot simply conclude that, say, the sub-area \"Semantics\" (92.6) is more important than that of \"Abstracting\" (75.6) with respect to research because the average value is higher; or that Indexing (79.2) is more feasible from an application point of view than Abstracting (52.3).",
        "Such conclusions may be true, and this is why the values in Tab.",
        "13 and 14 are given, but the parameters should actually only be applied to the single topics in the sub-areas.",
        "Cross-group ranking is not allowed for methodological reasons.",
        "But nevertheless the data are interesting enough.",
        "It is obvious that the following relation is in general true: I/R (-values) > I/A > F/R > F/A There are some exceptions to this general rule, such as Re-I/A>I/R (both in Set A and Set C); HA-F/RWR (in Set C); (Re-F/R aha F/A)>I/R Set C); and Il-F/R>T/R(both in Set _A and Set C).",
        "There seems to be a non-trivial gap between importance and feasibility (both with respect to research and application).",
        "In other words, there are more problems than solutions.",
        "And there is an even broader gap between application and research.",
        "From a practical point of view there is some skep-sis concerning the possibility of solving important research problems.",
        "And what seems to be feasible from a research point of view looks different from an application one.",
        "The values in the second round are in general higher than in the first one.",
        "This is an argument against the oft cited Delphi hypothesis that the feedback-mechanism - i.e. that the data of the previous round are made known at the start of the following round - has an averaging effect.",
        "The increase-effect can probably be explained by the fact that the percentage of qualified and \"competent\" people was higher in the second round (perhaps these were the ones who were motivated to take on the burden of a second round) - and, as Tab.11 shows, people who rated themselves \"competent\" tend to evaluate higher.",
        "Between the two rounds the decline in the sub-areas \"Software\" and \"Hardware\" (apart from the parameter F/R) is striking.",
        "There is an overall increase for \"Morphology\" and \"Information Lan-guages\" for all parameters, and a dramatic increase for the topics in \"Indexing\" for F/R (9.7%), and a dramatic decline for the \"Translation\"- and \"Question-Answering\"-topics for the parameter F/A (9.8 and 8.4%).",
        "The dates of realization do not change dramatically.",
        "On the average there is a difference of one year (and this makes sense becAuse there was almost one year between round 1 and 2).",
        "There is a ten, dency from a research point of view for the expectation of realization to be somewhat earlier from an application standpoint.",
        "But the differences are not so dramatic as to justify the conclusion that researchers are more optimistic than developers/practitioners."
      ]
    },
    {
      "heading": "5.2 Single topics",
      "text": [
        "Tab.15 and 16 show the two highest rated topics in each sub-area in the first two columns and the two lowest rated topics in each sub-area in the last two columns.",
        "These represent average data from Set C. The four columns in the middle show the estimation of participants who work in research or application, respectively.",
        "As part of the demoscopic data it was determined whether participants work more in research or in application (cf. Tab.6).",
        "Notice that both groups answered from a research and application point of view.",
        "In a more detailed analysis (which will be published later) this - and other aspects - can be pursued.",
        "In Tab.15 and 16 the data for very high importance (++) and high importance (+) have been added together.",
        "Tab.15 Topics according to importance most important topics (++\"+) less important average research application average(--.)",
        "I/R I/A I/R I/A I/R I/A I/R I/A ad l 8.07 ad l ad l ad l ac2 an6 Bob an3 AP2 an3 ac2 ac2 ac3 an7 an5 mo8 mol mo8 mol mo8 mol mol mo9 moll mol0 moll mo3 mo9 mo2 mo7 mo4",
        "rel re3 rel re3 rel rel re4 re4 re3 re5 re3 re5 re2 re3 re5 re2-qul qul qul qul qul qu10 qa4 q114 qu2 qu10 qu2 qu10 qu5 qul qu9 qu9 A final Table shows the data for short term and long term topics, only the two closest and the two most distant topics in each sub-area are given (data from Set C).",
        "Finally I would like to thank all those who participated in the Delphi rounds.",
        "It was an extremely time-consuming task to answer the questionnaire, which was more like a book than a folder.",
        "I hope the results justify the efforts.",
        "The analysis would not have been possible without the help of my colleagues - Udo Hahn for the conceptual design, and Dr.J.Staud together with Annette Woehrle, Frank Dittmar and Gerhard Schneider for the statistical analysis.",
        "This project has been partially financed by the FID/O-committee and by the \"Bundesministerium fuer Forschung und Technologie/ Gesellschaft fuer Information und Dokumentation\", Grant PT 200.08."
      ]
    }
  ]
}
