{
  "info": {
    "authors": [
      "Sho Yoshida"
    ],
    "book": "International Conference on Computational Linguistics and Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P84-1035",
    "title": "A Consideration on the Concepts Structure and Language in Relation to Selections of Translation Equivalents of Verbs in Machine Translation System",
    "url": "https://aclweb.org/anthology/P84-1035",
    "year": 1984
  },
  "references": [],
  "sections": [
    {
      "text": [
        "To give appropriate translation equivalents for target words is one of the most fundamental problems in machine translation systrms.",
        "Especially, when the MT systems handle languages that have completely different structures like Japanese and European languages as source and target languages.",
        "In this report, we discuss about the data strucutre that enables appropriate selections of translation equivalents for verbs in the target language.",
        "This structure is based on the concepts strucutre with associated information relating source and target languages.",
        "Discussion have been made from the standpoint of realizability of the structure (e.g. from the Standpoint of easiness of data collection and arrangement, easiness of realization and compactness of the size of storage space).",
        "1.",
        "Selection of Translation Equivalent Selection of translation equivalent of a verb becomes necessary when, (1) the verb has multiple meanings, or (2) the meaning of the verb is modified under different contexts (though it cannot be thought as multiple meanigns).",
        "are selectively used as translation equivalents of an English verb 'play' according as its context.",
        "1. play tennis : 2. play in the ground : 7 3.",
        "The children were playing ball (with each other) : +AA - z: t 1, tel 4. play piano : / 3/11 < 5.",
        "Lightning palyed across the sky as the storm began : jg.t.tIftt z 01-1.01\"k",
        "In the above examples, they are not essentially due to multiple meanigns of 'play' but need to assign different translation euqivalents according as the differences of contexts in the case of 1. to 3., and due to multiple meanings in the cases of 4. or 5.",
        "A typical idea for selecting translation euqivalents so far is shown in the following example.",
        "Lets take a verb 'play'.",
        "If the object",
        "belong to a category u , we give '51g< obj as an appropriate translation equivalent of 'play'.",
        "Thus, we categories words (in the target language) that are agent, object, .0• of a given verb (in the source language) according as differences of its appropriate translation equivalents.",
        "In other words, these words are categorized according as \"such expression as a verb with its case filled with these words be afforded in the target language or not\", and are by no means categorized by their concepts (meaning) alone.",
        "For example, for tennis, baseball, E",
        "To the words belonging to CI0)tej'Y.",
        "x< {piano, violine, harp, }, the translation equivalent of 'play' is given as follows.",
        "play play 11:;12i).ne :e7;/4:37,7,11 play harp : ,--7'175111< Categories given in this way have a problem that not a small part of them do not coincide with natural categories of concepts.",
        "For example, members ' (tennid)1 and '(baseball)' of a oj category cPlaY: 1-Z belong to a natural category of concepts g(ball game), but ' V(card)' does'nt.",
        "Instead it belongs to a conceptual category Alitt(game in general).",
        "3BRAk is considered as a subcategory of Aft .",
        "Therefore, if we regard C' At@ , then 1-.,.,;(tennis), obj r (card), 7 *,--)t, (football), =rA, 7 (golf), --- can be members of it, but N(go), 4gOt(shogi) which also belong to the conceptual category ZAt, are not appropriate as members of CP0t3Y: .",
        "PP1my go : shogi : 444ttIji' are not appropriate, instead we say 'play go StaL ', 'Play shogi 44$t*A2') 1-Z Therefore' t.s.",
        "should be devided obj into two categories CP-'87:tZ and CPlaY: obj obj The problem here is that, such division of categories do not necessarily coincide with natural division of conceptual categories.",
        "For",
        "example, translation equivalent 'Mt' cannot be assigned to a verb 'play' when object word of it is 1-z A (chess), which is a game similar to gp or Moreover, if the verb differs from 'play', then the corresponding structure of categories of nouns also differs from that of play.",
        "Thus we have to prepare different structure of categories for each verb.",
        "This is by no means preferable from both considerations of space size and realizability on actual data, because we have to check all the combinations of several ten thousands nouns with each verb.",
        "2.",
        "Concepts Structure with Associated Information",
        "So we turn our standpoint and take natural categories of nouns (concepts) as a base and associate to it through case relation pairs of a verb and its translation equivalent.",
        "Let a structure of natural categories of nouns were given (independently of verbs).",
        "A part of the categories (concepts) structure and associated information (such as a verb and its translation equivalent pair through case relation etc.)",
        "is given in Fig.l.",
        "In Fig.1, verbs associated are limited to a few ones such as Do (obj =musical instrument) =4 Play (obj=muslcal instrument).",
        "Becsuse, from the definition of musical instrument :\"an object which is played to give musical sound (such as a piano, a horn, etc.",
        ")\", we can easily recall a verb 'play' as the most closely related verb in this case.",
        "It can generally be said that the more the noun's relation to human becomes closer and the more the level of abstract of the noun becomes lower the numbers of verbs that are closely related to them and therefore have to associate to them (nouns) become large.",
        "And that the numbers of associated idaoms or ideom like parases become large.",
        "Therefore, the division of categories must further be done.",
        "The process of constructing this data structure is as follows.",
        "(1) Find a pair of verb and associated translation equivalent (Do= Play : 1441-1-Z) that can be associated in common to a part of the structure of the categories as in Fig.1, and then firvi, appropriate translation equivalents in detail at the lower level categories.",
        "(2) To each verb found in the process of the association, consults ordinary dictionary of translation equivalents and word usage of verbs and obtain the set of all the translation euqivalents for the verb.",
        "(3) Then find nouns (categories) related through",
        "case relation to each translation equivalent verb thus obtained by consulting word usage dictionary.",
        "Then check all the nouns belonging to nearby categories in the given concepts structure and find a nouns group to which we associate the translation equivalent.",
        "In this manner, we can find pairs of verb and its translation equivalent for any noun belonging to a given category.",
        "To summarize the advantage of the latter method, (1) to (4) follows.",
        "(1) The only one natural conceptural categories structure should be given as the basis of this data structure.",
        "This categories structure is stable, and will not be changed basically, and is constructed independently from verbs.",
        "In other words, it is constructed indepndently from target language expression.",
        "(2) To each noun in a given conceptual category, ,numbers of associated pairs of verb and its translation equivalent are generally small and can easily be found.",
        "(3) Association of the pair of verb and its translation equivalent through case relation should be given to one category for which the association hold in common for any member of it.",
        "In",
        "created from two categories gulaAgg (keyboad musical instrument) and3\":kAii (string musical instrument) for this purpose.",
        "And then associate through case relation specific pair of verb and its translation equivalent to exceptional nouns in the category.",
        "(4) From (1) to (3), it follows that this data structure needs considerably less space and is more practical to construct than the former method.",
        "(chapter 1)"
      ]
    },
    {
      "heading": "3. Concluding Remarks",
      "text": [
        "We proposed a data structure based on concepts structure with associated pairs of verb and its translation equivalent through case relations to enable the appropriate selections of translation equivalents of verbs in MT systems.",
        "Additional information that should be associated to this data structure for the selections of translation equivalents is ideoms or ideom like phrases.",
        "The association process is similar to the association process in chapter 2.",
        "Only the selections of translation equivalents for English into Japanese MT have been discussed on the assumptionthat the translation equivalents for nouns were given.",
        "Though the selection of translation equivalents for nouns are also important, the effect of application domain dependence is so great that we strongly relied on that property at the present circumstances.",
        "There are cases that translation equivalents are determined by pairs of verbs and nouns to each other.",
        "So we need to study the problem of selection of translation equivalent also from this point of view."
      ]
    },
    {
      "heading": "Reference",
      "text": []
    }
  ]
}
