{
  "info": {
    "authors": [
      "Giovanni Guida",
      "Giancarlo Mauri"
    ],
    "book": "Computational Linguistics",
    "id": "acl-J84-1002",
    "title": "A Formal of Natural Basis for Language Performance Evaluation Understanding Systems",
    "url": "https://aclweb.org/anthology/J84-1002",
    "year": 1984
  },
  "references": [],
  "sections": [
    {
      "text": [
        "The task of evaluating the performance of a natural language understanding system, despite its largely recognized relevance, is still poorly defined.",
        "It mostly relies on intuitive reasoning and lacks a sound theoretical foundation.",
        "This paper sets a formal and quantitative proposal for this task.",
        "In particular, a measure of performance that allows the basic input-output characteristics of a system to be evaluated is introduced first at an abstract level.",
        "The definition of concrete measures is then obtained by assigning actual values to the functional parameters of the abstract definition; some particular cases are shown and discussed in detail.",
        "Finally, the task of measuring performance in practice is considered, and a model for experimental performance evaluation is presented.",
        "Comparison with related works is also briefly discussed; open problems and promising directions for future research are outlined.",
        "A limited case study experimentation with the model proposed is presented in the appendix."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Research on natural language processing has recently been featured by the design and implementation of a number of experimental systems.",
        "Recent survey reports (Waltz 1977, Kaplan 1982) mention more than one hundred items among the most successful and relevant systems in the classical application fields of data base inquiry, machine translation, question answering, and man-machine interfacing.",
        "This trend is not surprising in the context of research whose specific aim is that of providing automated tools for the understanding or translating of natural languages; but it is also evident even in natural language research with a more theoretical flavour.",
        "The successful construction of a good performing system is",
        "The task of evaluating the performance of a given system and that of comparing the behaviour of different systems appears, therefore, to be a fundamental issue.",
        "Despite its large recognized relevance (Woods 1977, Tennant 1980), measuring the performance of a system for natural language processing is still poorly defined.",
        "It mostly relies on intuitive reasoning and lacks a sound theoretical foundation.",
        "As Tennant clearly points out (1980), there is a nearly complete absence of meaningful evaluation in current natural language processing research.",
        "This leaves several crucial questions unanswered: What is the relevance and value of obtained results?",
        "How general are the proposed solutions?",
        "How do they compare with other proposals?",
        "What problems are still open?",
        "What directions have to be followed?",
        "What issues are to be faced in the progress of the research?",
        "Copyright 1984 by the Association for Computational Linguistics.",
        "Permission to copy without fee all or part of this material is granted provided that the copies are not made for direct commercial advantage and the CL reference and this copyright notice are included on the first page.",
        "To copy otherwise, or to republish, requires a fee and/or specific permission.",
        "0362-613X/84/030015--16$03.00 Computational Linguistics, Volume 10, Number 1, January-March 198415 Giovanni Guida and Giancarlo MauriA Formal Basis for Performance Evaluation of NLUS The lack of evaluation constitutes a serious obstacle to the development of a sound technology in natural language processing.",
        "The purpose of this paper is to provide a formal and quantitative model for the performance evaluation task.",
        "In particular, we give a formal definition of \"understanding power\", and we propose some techniques for measuring this feature in practice.",
        "Our proposal is based on several assumptions we discuss below.",
        "First, we assume as object of our attention only that module of a natural language system that is devoted to understanding natural language, that is, to mapping input expressions into formal internal representations.",
        "This can clearly include several kinds of processing activities, such as linguistic analysis, reasoning, inferencing, etc.",
        "; but must have as ultimate goal the construction of a correct internal representation, not the production of any type of service to the end user of the natural language system.",
        "Thus, for example, a question answering system (Tennant 1979) does not belong to the class of natural language understanding systems that concern us; instead, it is the natural language interface it contains that meets exactly our requirements.",
        "Second, we assume the following nave notion of performance: the extent to which a system is able to correctly understand natural language expressions in a given application domain.",
        "The resources needed by the system to accomplish its task are irrelevant in this case.",
        "In other words, we want to capture and measure the \"power\" of the system, in terms of how much and how well it is capable of understanding, not its \"efficiency\", that is, how much does it cost (for example, in terms of time and memory requirements) to understand what it is capable of understanding.",
        "Third, we want to define a measure of performance that allows the evaluation of the input-output characteristics of a particular system in a given domain.",
        "This kind of measure is clearly inappropriate to reveal and test features, such as the power of a model as opposed to that of a particular implementation of it, the applicability of the model to other domains, its extensibility, etc., which are more closely related to the internal structure and mode of operation of a system, rather than to its input-output behaviour.",
        "The goal of evaluating such more general properties, worked on by Tennant (1980) through the method of abstract analysis (mainly based on taxonomies of conceptual, linguistic, and implementational issues), is not considered in this work.",
        "This paper is organized in the following way.",
        "In section 2 we discuss in an intuitive, yet precise, way the basic concepts involved in the performance evaluation problem, in order to have a sufficiently clear specification of what we want to formalize.",
        "Then, in section 3, we give an abstract definition of the formal model, and in section 4 we discuss some actual cases of particular interest.",
        "Section 5 presents some techniques that could be used to measure in practice the performance of a natural language understanding system.",
        "In section 6 we discuss some concluding remarks, and present open problems and promising topics for future research.",
        "A limited case study experimentation with the model proposed is presented in the appendix."
      ]
    },
    {
      "heading": "2. Basic Definitions and Statement of the Problem",
      "text": [
        "Let us introduce some background definitions needed to clearly state the problem of performance evaluation, as discussed in this work.",
        "The model of natural language understanding we are going to define is so conceived as to include only those very few features that are relevant for the purpose of performance evaluation and is strictly tailored to this particular goal.",
        "Let an expression of a natural language be any finite sequence of legal words and punctuation marks from the given language.",
        "Let A be the set of all expressions of a natural language.",
        "Note that the above definition is very loose and does not take into account the structure of the expressions.",
        "So an expression can be a sentence, a dialogue, a meaningless sequence of words, the whole content of a book, or just a single word.",
        "Introducing a more definite notion of expression is not necessary at this point for our purpose of stating the problem of performance evaluation.",
        "Although the above definition includes expressions of arbitrarily (finite) length, so that A contains infinitely many expressions, in a more pragmatic approach the length of existing expressions of a natural language at a given moment of its history has an upper bound.",
        "Therefore, it makes sense to restrict our attention to a finite subset E of A, containing all expressions of length less than or equal to an appropriately fixed integer n. Let L be the set of all meaningful expressions of a natural language, that is, of all expressions to which humans attach a meaning.",
        "Note that L is defined on a purely semantic basis, so that expressions of L do not have to be syntactically correct with respect to any fixed syntax, and that, generally, more than one mean-16Computational Linguistics.",
        "Volume 10, Number 1, January-March 1984 Giovanni Guida and Giancarlo MauriA Formal Basis for Performance Evaluation of NLUS ing may be attached to the same expression, that is, expressions are not required to be univocal.",
        "Let S be the set of all possible meanings that can be attached to expressions of E. We do not face here the problems of what S actually contains or of how S could be represented explicitly (which mostly pertain to cognitive psychology); let us assume S merely as that basic datum, shared by all humans speaking a given language, which allows effective interpersonal communication.",
        "We call the semantics of a natural language the total function f: E-.2s (into 2S), which associates to each expression of E the set of all its possible meanings.",
        "Clearly the function f can be computed by any person who can understand perfectly the natural language to which the expressions of E belong (theoretical problems concerning subjective interpretation and disagreement between different people are not considered here).",
        "Moreover, f(e) = 0 denotes that no meaning is associated to the expression e, and hence eeL ill f(e)00.",
        "Each expression ecE such that I f(e) I <1 is called an univocal expression.",
        "Let now D be a nonempty subset of S that contains meanings all related to a unique subject (\"what we are speaking of\", \"the topic of the discourse\", \"the conceptual competence of a natural language understanding system\"); we call D a domain.",
        "Let fp be the restriction of f to D defined as: fp(e) = f(e)fl D, for any eeE.",
        "Let LD = Ef D-1(0) be the restriction of L to D. It is obvious that LDgE.",
        "Let us now try to formalize the concept of natural language understanding system.",
        "The main problem is that of giving a formal representation to the informally defined domain D. To this purpose, we take a finite set of symbols B, called alphabet, and then we construct a set R of sequences of arbitrary finite length over B (that is, R sB*), in such a way that to every element deD an element of R, r = hp(d), is associated by a bi-univocal function hp.",
        "The sequence r = hp(d) is called the representation of d, while the set R is called a representation language for D. Obviously, the map hp is a total function 1 hp :R-0.D, which associates to every sequence of R its informal meaning in D. Both hp and hknown to man, in the sense that he is able to compute them.",
        "We are now able to formalize the nave notion of natural language understanding system in the following way.",
        "Let D S be a domain and R a representation language for D. A natural language understanding system UR/D in R on D is an algorithm that computes a total function gRu/D:E-0.2U (into 2RU ID, where 1. is called the undefined symbol.",
        "gRu /D(e) = 1. denotes that U is unable to assign a meaning to the expression e, that is, that it fails in computing g/(e) (not that e has no meaning in the domain DO.",
        "Note that in the above definition we have assumed that a system UR/D should accept as input not only expression of LD but, generally, all expressions of E. The reason for this choice is that a basic feature of natural language understanding is also to recognize that some expressions are meaningless (they belong to EL) or are in no way related to a given domain D (they are in LLD).",
        "Clearly, this feature is often less important than the capability of correctly understanding expressions of LD, but this can be appropriately taken into account when defining a measure of performance.",
        "Measuring the performance of a natural language understanding system UR/D may now be defined as evaluating how well UR/D is capable of explicitly representing in R the meaning of expressions of E. To define such a notion in quantitative terms we can first extend the bi-univocal function hp:D-0.R to the function (bi-univocal if i is not considered)",
        "defined by: = U {hp(d)1, dEx for xe2D.",
        "Figure 1 illustrates the definitions of the functions hp, hp, and gR/D presented above.",
        "u Considering now the three functions f p, hp, and g R/D defined above, if we denote lip 0 fp = gp, the performance of UR/D can then be expressed as the degree of precision to which gR/D approaches ip over E. This task raises, however, some difficult problems.",
        "Two basic questions are:",
        "(i) how to define the difference,, guR/D and gp over E in such a way to match the intuitive notion of performance; (ii) how to measure such a \"difference\" in practice, that is, through an effective experimental procedure.",
        "Before tackling the core topic of this section in a formal way, let us examine from an intuitive point of view the basic requirements for a measure of performance ir to be reasonably acceptable.",
        "The primary goal is that it should allow consistent comparison among different systems, in the sense that if gr(U1) = v(U2) the behaviour of the two systems U1 and U2 should be sufficiently similar, and that if ir(U1 )>/r(U2), U1 should perform better than U2.",
        "Furthermore, this comparison should be as fine and precise as possible, in such a way to capture all the essential features of the behaviour of a system U in a given domain.",
        "Finally, comparison might be between two different systems, between two versions of the same system, between a system and a given set of issues, or between a system and an independent scale (Tennant 1980).",
        "To capture the intuitive notion of performance according to the above requirements, at least two points of view seem worth considering.",
        "First, a measure of performance should give a numerical value for the \"distance\" between the two functions gRu/D and gD, that is, the measure should allow us to formalize how near g/(e) approaches g(e) for any eeE, or, more explicitly, how well each expression eeE is understood by the system U.",
        "Second, it should weight this notion of \"distance\" in such a way as to take into account the fact that, generally, it is not equally important to understand well any expression in E; for example, it could be reasonable to suppose that correct understanding of expressions in LD is far more relevant than in ELD, or that correct understanding is more important for frequently used expressions than for unusual and rare ones.",
        "According to the above remarks, an appropriate notion of performance 7T will depend on two basic parameters: (i) the shifting ,u between giz/D(e) and g(e) for any eeE (ii) the importance p for any expression eeE to be correctly understood.",
        "Different choices of p. and p clearly provide different notions of performance, 74u,p], that fit different needs for capturing particular classes of features in a natural language understanding system.",
        "Let us now go further in defining an appropriate formal framework embedding the above ideas.",
        "In the following, we shall omit in fD, gUR/D, and iD the superscript U and the subscripts R/D and D, whenever this will not cause ambiguities.",
        "Let R be a representation language for a domain DCS a shifting function i on R is a function p.:(2R U {ID x2R->[0,1], such that: for each pair (r,r'), tt(r,r') = 0 iff r = r'; there exists a pair (r,r') such that pt.",
        "(r,r') = 1.",
        "From an intuitive point of view, A(g(e),i(e)) represents the \"difference\" between the (set of) meaning(s) of e computed by a natural language understanding system U, which is expressed by g(e), and its correct (set of) meaning(s) -g(e).",
        "Hence, the value ii(g(e),(e)) = 0 denotes perfect understanding of e, while (g(e),i(e)) = 1 denotes the worst case of misunderstanding of e. Given the set E of all expressions of a natural language of length less or equal than an appropriately fixed integer n, an importance function p on E is a function Intuitively, p(e) represents the importance that the meaning of e is correctly understood by the system U.",
        "The value p(e) = 0 denotes that it is not at all important that e be understood correctly or incorrectly; values of p(e) greater than 0 denote the greater importance for e to be understood correctly.",
        "Given a shifting function pt on R and an importance function p on E, a performance measure 77. for natural language understanding systems UR/D is the function",
        "Clearly,ranges from the value 0, in the case where all expressions of E are correctly understood, to the value 1, in the case where all expressions are completely (that is, in the worst manner) misunderstood,",
        "Computational Linguistics, Volume 10, Number 1, January-March 198419 Giovanni Guida and Giancarlo MauriA Formal Basis for Performance Evaluation of NLUS independently of the choice of p (of course, p=-7.0 is not allowed, being meaningless).",
        "rr[A,p] provides a very synthetic representation of the performance of U that can be useful in several cases of evaluation and comparison.",
        "A richer and more informed picture of the performance of a system U fully coherent with the above definitions can be obtained in the following way, for the cases where the ranges of p. and p are finite.",
        "For given shifting p and importance p, let range(p) = {81,...,80 and range(p) = Then we pose: = le 1 p(g(e),k(e)) = Siandp(e) = for iEf 1,...,n1 and j{ 1,...,n}.",
        "Clearly, UEi = E and all E1pairwise disjoint.",
        "Therefore, {E1,j1 is a partitioning of E.",
        "for iE{1,...,n} and jE {1,...,m}.",
        "(We remember that E has been assumed to be finite, and hence so is Ei,i gE).",
        "The n x m matrix [1 is called the au-p-profile of U and and provides a far more informed representation of the performance of U than the value 7[12,p].",
        "In fact, [pi,j] allows one to discover and analyse the specific features of the system, going beyond the global value ir[A,p].",
        "The relation between [p] and Tr[p,p1 is straightforward: Note that [p1 depends on t and p only through the partitioning {Ei,j1 they induce on E, but it is independent of the actual values of Si and (pi.",
        "Different choices of and p clearly provide different measures of performance that can be compared, in general, only on a qualitative and intuitive basis.",
        "Therefore, evaluating the performance of a system U requires first the definition of it and p, and then the computation of wip,p].",
        "Clearly, the most critical of these two steps is, from a conceptual point of view, the first as it completely determines the \"goodness\" of the measure and its actual matching with desired intuitive requirements.",
        "The second is only difficult from the computational point of view since E is usually very large and, hence, it is not possible to evaluate the sum in the definition of v[tt,p] in a direct, exhaustive way.",
        "In the next section we discuss in detail the problem of appropriately defining bt and p, while section 5 is devoted to the topic of actually computing 16,4"
      ]
    },
    {
      "heading": "4. Some Significant Choices of Shifting and Importance Parameters",
      "text": [
        "Having discussed in the previous section an abstract theory of performance evaluation, we now deal with some implementations of it that may be of practical interest.",
        "Clearly, an implementation is obtained by assigning actual functions as values for the (functional) parameters p. and p in the definition of IT.",
        "Different choices of p. and p will yield different models for performance evaluation and will allow one to analyse different features of the systems to be evaluated.",
        "Since ji and p are fully independent parameters, we shall deal with each separately.",
        "Let us begin with the shifting function It; in order that only the effect of j be relevant to IT, we shall suppose throughout the following discussion that p has the constant value p(e)=1 for any eEE.",
        "The simplest case is that where ji may assume only two (boolean) values 0 and 1, denoting a correct and a wrong understanding, respectively.",
        "Such a boolean shifting function is denoted by pi and formally defined by: 1 0 if r' =r\" 1 if r'Or\" for any pair (r',r\")E(2RU {1})x 2R.",
        "The intuitive meaning of pi, when used to evaluate a natural language understanding system U, is straightforward: wip1,11(U) = x denotes the percentage of expressions of E that U is unable to understand correctly (clearly, 1x is the percentage of expressions correctly understood by U).",
        "The above definition of is very crude; in fact, systems with the same Tr[p 1,1] can show a very different behaviour, and, furthermore, w[p1,1](U1) > vipi,1](U2) does not generally ensure that Ui performs better than U2.",
        "A slight improvement can be obtained by splitting the case r' Or\" into two subcases that cover, when evaluating U, the following situations:",
        "(i) U is unable to assign a meaning to an expression e (that is, it fails); hence, g(e) = r' =r\" = (e) (ii) U assigns to an expression e a meaning that is not the correct one; hence, g(e) = r' o r\" = with g(e)",
        "20Computational Linguistics, Volume 10, Number 1, January-March 1984 Giovanni Guida and Giancarlo MauriA Formal Basis for Performance Evaluation of NLUS It seems quite reasonable that generally case (i) is less serious than case (ii), so that we can propose a new definition of shifting 122: if r' =r\" if r' = 1 if r'01 and r' or\" where 8e(0,1).",
        "Clearly, the choice of 8 strongly affects the values of Tr[pc,1](U) and will depend on how much we want to distinguish between cases (i) and (ii) mentioned above.",
        "Going further to propose more fitting definitions of it, we may want to analyze in more detail the case r' 0 1 and r' or\".",
        "Recalling that r' and r\" are sets of strings in R, we can distinguish the following cases: (i)U assigns to an expression e the value 0 (that is, no meaning), while it has a well-defined mean ing; Uassigns to an expression e a proper nonempty subset of its meanings; Uassigns to an expression e all its correct meanings and, in addition, other incorrect ones; Uassigns to an expression e a proper nonempty subset of its meanings and, in addition, other incorrect ones; Uassigns to an expression e a nonempty set of meanings that is fully different from the correct one.",
        "Formally, we can define the shifting p3 that covers all such situations by:",
        "where 81e(0,1), for i = 1, 2, 3, 4, 5.",
        "It could be reasonably assumed 81 < 82 < 83 < 84 < 85, since the situations to which they are attached are generally considered as denoting increasing degrees of misunderstanding (note that it3 deals in great detail with the case of ambiguous understanding, where at least one of r' or r\" is not a singleton).",
        "Along the line of reasoning shown in the above definitions, several other improvements are possible.",
        "For example, we can further refine the above case (v), r' #0 and r'n r\" = 0, by taking into account the actu- al structure of the elements of r' and r\".",
        "R being a A2(1-1,r\") = 1 8 1 well-defined formal language, we can first define an appropriate notion of \"distance\" p between elements of R, and then extend it to nonempty disjoint elements of 2R.",
        "This kind of refinement is particularly significant when both r' and r\" are singletons, that is, understanding is not ambiguous, as is often the case.",
        "Also, it generally allows far more meaningful definitions of shifting, thus further approaching the intuitive notion of \"distance\" as \"degree of understanding\".",
        "Let us turn our attention now to the importance function p. Also for this function, a first simple proposal can be a boolean definition: no importance at all is assigned to expressions in ELD and the same (not null) importance to every expression in LD.",
        "So we can define p1 as:",
        "for each eeE.",
        "A refinement of pi can be obtained by analyzing the case eeLD and taking into account the frequency of use of expressions in LD.",
        "This will give more importance to the correct understanding of more frequently used expressions and less importance to that of rare or unusual ones.",
        "From the human point of view, it is obvious that texts with a greater frequency are used, and hence understood, by a larger number of people.",
        "Therefore, it seems meaningful to consider a system that can understand quite well the relatively small number of the most common texts and fails on the most unusual ones, to be better than a system that understands a lot of very rare texts but often fails in understanding the most common ones.",
        "Formally, we can define the frequency of expressions of e as a map z : E-,10,1], with the constraint that E z(e) = 1.",
        "Then, we can define a new imporecE tance function p2 such that:",
        "A totally different criterion that could be used to refine the definition of importance functions is structural complexity of the expressions of E (or of LD).",
        "A very crude notion of structural complexity is simply given by the length of an expression e. In this case, given a chain 0 = 0<f 1<...<f m_i of m non negative integers, we can partition E into m classes:",
        "Then, a new importance function p3 is defined by: p3(e) = coi if f eEi, where co1E[0,1], for i = 1,...,m. It is worth noting that the length of a text is not independent of its frequency of use; we feel that in several application domains (such as, for example, man machine interaction) short texts are much more frequent than long ones and that texts exceeding a given length are not used at all.",
        "A more refined notion of structural complexity of an expression may be given by taking into account its syntactic structure, defined on the basis of an appropriate set of characteristic features see, for example, the classification proposed in Tennant (1980).",
        "E can be partitioned into different and disjoint classes Ei, according to the set of syntactical features they match, and an importance function p4 can be defined as above:",
        "where w1e[0,1], for i = 1,...,m. Let us note that, contrary to the above illustrated relation between the length of a text and its frequency, it seems reasonable to consider syntactical complexity as fully independent of frequency; in fact, quite complex syntactical features (such as ellipsis, anaphora, broken text, etc.)",
        "are frequently found in several application domains.",
        "Finally, a couple of other possible choices for assigning the importance function p are worth mentioning: one based on the notions of \"information content\" or \"structural complexity\" according to Kolmogorov (1965, 1968), and the other based on the concept of \"semantic complexity\" of an expression, which could be formally defined, for example, in the represented domain R. However, some more theoretical work on these notions is necessary before we can use them for our needs; hence we will not further develop these notions here."
      ]
    },
    {
      "heading": "5. Measuring Performance in Practice",
      "text": [
        "In the preceding sections, some theoretical tools for measuring the performance of a natural language understanding system have been illustrated.",
        "At this point we have to put them to work: that is, we must discuss how the performance of a system can be actually evaluated and how the comparison between two different systems can be carried out.",
        "We distinguish two steps in the process of performance evaluation: (i) to assign the functions A and p; (ii) to compute Let us examine in detail each of the two points.",
        "The choice 'of the shifting function A depends only on the degree to which we want to refine the notion of error in understanding and on the varying importance we want to assign to each type of error.",
        "Hence it is often only a matter of subjective feeling choosing appropriate values for A in order to analyse particular features of the system to be evaluated.",
        "Also, the definition of A is strongly dependent on the representation language R for the domain D: the richer and more structured R is, the more refined and subtle are the possible definitions of A.",
        "On the contrary, however, the choice of the importance function p can generally be based on more objective arguments, once an appropriate ranking among the desired understanding capabilities of the system to be evaluated has been defined.",
        "For example, in the case where the frequency of texts is taken into account, an appropriate experimental activity can provide reliable statistical estimations for the frequency z(e) of each expression eE, thus allowing the effective computation of p(e).",
        "(Problems connected with the choice of a meaningful sample to estimate z(e) which could freely include millions of millions of expressions are not dealt with here, since they are more related to statistics than to computational linguistics.)",
        "Clearly, the choice of A and p fully determines the numerical value of I-414p] (or of the matrix [pi,j]) in correspondence to a given system U.",
        "How a change in A or p can affect Tr[p,,p] is generally impossible to pre-22Computational Linguistics.",
        "Volume 10, Number 1, January-March 1984 Giovanni Guida and Giancarlo MauriA Formal Basis for Performance Evaluation of NLUS dict, since this strongly depends on the particular features of U.",
        "Therefore, evaluating a system with different choices of A or p can indeed provide a clearer image of its performance.",
        "Although the comparison between different values of Ir obtained with different pairs (u,p) is often only a matter of intuitive reasoning, an interesting particular case that can be conveniently dealt with formally is briefly sketched below.",
        "A shifting function AI is a refinement of a shifting function p (AL' DA) iff: range(u) = 131,...,80 with St <82<...<8n ; range(') = {8'1,...,8'n,j, with 8' i< 82<...< 8' n, and n' >n ; the partitioning {E} of E induced by IL' is a refinement of the partitioning {E11 of E induced by",
        "In an analogous way we can define the refinement p' of an importance function p (p' DI)).",
        "A pair (.0 ,p') is a refinement of a pair (p,,p) (we write (.0 ,p')(p,p)) iffA and p'p.",
        "It is straightforward to prove that: For any system U and any two pairs (a,p) and (Iii,p) implies iT[ti' For example, the shifting function u3 in section 4 refines A2, which in turn refines At, that is, pt A3.",
        "For the importance function p, on the other hand, not one of the functions pp p2, p3, p4, in section 4 is a refinement of any other one.",
        "It is worth noting that, when defining appropriate pairs (u,p) to evaluate a system, there are basically two ways of reasoning for comparing different choices: the first one is to start from a first basic proposal and to proceed through successive refinements until the desired degree of precision and detail is reached; the second one consists in proposing functions corresponding to several different points of view and then integrating them together in a well-balanced synthesis.",
        "Generally, the first approach is appropriate for the definition of p, while the second one can be utilized for the choice of p. Let us turn now to the problem of computing once p. and p have been assigned.",
        "Obviously, it is unrealistic to compute the exact value of 77- by considering the behaviour of the system with respect to every expression eE.",
        "Hence, a sequence of test cases has to be considered (Gold 1967).",
        "Figure 2 shows a model for experimental performance evaluation.",
        "A GENERATOR provides at each time instant i (i=1,2,...) an expression etE.",
        "Then, the system U to be evaluated computes the meaning g(ed, which is compared by A with the correct meaning (ei) supplied by an EVALUATOR (a man supposed to be able to compute g, that is, both f and II).",
        "Finally, the value p(e1) is computed, and the current value of",
        "is determined.",
        "The major problem with the computation of IT is the design of the GENERATOR, that is, the choice of the sample of E to be used for the evaluation of the system U.",
        "The mathematically simplest case is the one where a subset B g E is randomly generated on the basis of a given probability distribution in E (for example, equiprobability); then,",
        "is a random variable such that E(gB) = IT for reasonable distributions, where E(77-B) denotes the expectation of TrB The value of E(TrB) may be estimated by means of statistical techniques such as, for example, the maximum likelihood function.",
        "Here, we will not give a detailed account of such techniques.",
        "They can be easily found in classical works of statistics and sampling theory (Kobayashi 1978; Cox, Hinkley 1977; Mood, Graybill 1980), when needed.",
        "A different technique would be that of fixing a confidence interval, and then establishing the number n of tests to be generated in order to obtain the value of 17-(,p) within the given confidence level, by means, for example, of x2 techniques.",
        "In addition to these elementary statistical methods, more sophisticated sampling techniques can be used.",
        "This requires us first to choose a partitioning of E into meaningful classes, and then to define a sample stratified according to the considered partitioning.",
        "In this",
        "possible relevance to future work); we therefore focus on the first two.",
        "From a nave point of view, habitability is used to test whether or not the system does what it was designed to do; completeness is introduced to test whether or not the system meets users' requirements.",
        "More precisely, Tennant introduces the two notions of coverage and completeness to denote, respectively, the capabilities (both conceptual and linguistic) that the designer has put within a system, and (similarly to Woods, Kaplan, Nash-Webber 1972 though differing from Woods 1977) the degree to which the capabilities expected by a set of users can actually be found in the system coverage.",
        "Furthermore, habitability denotes (quite differently from Watt 1968) the degree to which a system can actually exhibit the capabilities that it was designed to have.",
        "Our approach is based on a slightly different model and provides in some sense a refinement of the above concepts.",
        "We denote by the term competence the capabilities that a system is actually able to show, while by the term coverage we refer, according to Tennant, to the theoretical capabilities that a system should have as a consequence of its design specifications.",
        "More precisely, the conceptual coverage of a system UR/D is formalized in our model by the domain D, which represents, in fact, the range of concepts that are within the domain of discourse of a given application.",
        "The linguistic coverage clearly includes LD but, generally, is not limited to LD since understanding a language in a given domain also implies the capability of recognizing that some expressions are not meaningful in that domain.",
        "In general, for a given importance function p, we can assume that the linguistic coverage is defined by:",
        "where A(0 < A<l) is a fixed bound.",
        "The linguistic competence can then be defined as:",
        "The above concepts are summarized in Figure 3.",
        "Our definition of performance ir[jt,p] tries to give a global idea of how well the competence of a system (without distinction between conceptual and linguistic aspects) approaches its coverage.",
        "This measure is quite similar to, and provides a refinement of, the concept of habitability, involving also to some extent the notion of completeness.",
        "In fact, both the choice of D as an adequate domain and the definition of p as a suitable importance function (and, therefore, of L'D) implicitly refer to a set of users and then to completeness.",
        "It is apparent that the proposal introduced in this paper demands further work, both theoretical and experimental, in order to have fully adequate tools for performance evaluation.",
        "First of all, some of the concepts presented here have to be further discussed and expanded.",
        "For example, in the definition of IT, we have normalized it with respect to p by setting:",
        "A different choice could be:",
        "where it and p are given the same importance (in this case the value ir=1 would be reached only when all expressions of E are fully misunderstood, that is, p.-=-1, and when it is important at the highest degree that each of them is correctly understood, that is, p1).",
        "While we have preferred here the first definition, arguments could be given in favour of the second.",
        "A second critical point is the definition of the ttp-profile [p11].",
        "This could be further extended so as to provide a picture of several dimensions (features, for example: frequency, syntactic complexity, information content, etc.).",
        "Third, it is worthwhile considering and improving the notion of refinement: in fact, the present definition is not stable with respect to the choice of IA and p. That is, it could be that, given two systems U and U': Trki,p1(u) < IT[A,p](tp) and, for some refinement (',p') of (,u,p): > ithe,pq(U), so that the refinement of the evaluation criteria may give an inversion of the first evaluation.",
        "A formal development of the three points mentioned above will Computational Linguistics, Volume 10, Number 1, January-March 198425 Giovanni Guida and Giancarlo MauriA Formal Basis for Performance Evaluation of NLUS capabilities expected by the users",
        "system design level 26Computational Linguistics, Volume 10, Number 1, January-March 1984 Giovanni Guida and Giancarlo MauriA Formal Basis for Performance Evaluation of NLUS be part of a future paper.",
        "For what concerns the main directions in the development of the current research activity, we mention: experimentation with the model proposed in the evaluation of large systems; development of appropriate sampling techniques for the experimental evaluation of IT; experimentation with several different choices of and p; design of techniques for special purpose evaluation (choice of the goal, definition of s and p, sampling, etc.",
        "); analysis of the adequacy of the notion of au-p-profile for representing all interesting details of the performance of a system.",
        "Beyond these issues we also point out two more ambitious and promising problems; they will be faced in future work.",
        "The approach to performance evaluation presented in this paper has two major limitations: first, it is only concerned with input-output behaviour and does not take into account the internal model on which a system is based; second, it does not deal with the efficiency of the natural language understanding process.",
        "As far as the former topic is concerned, it is clear that, except in the case where commercial applications are considered, one is primarily interested in models rather than in particular implementations.",
        "It is far more significant that a model, a knowledge representation method, and a parsing algorithm have been designed to build natural language understanding systems rather than that a specific system has been constructed in a particular domain for a particular use.",
        "Tennant (1980) (see also Woods 1977) proposes a method, called abstract analysis, to organize in an informal but disciplined way the evaluation, through taxonomies of conceptual, linguistic, and implementational issues, of the internal behaviour of a natural language system (including analysis of failure causes, domain dependent features, knowledge base completeness and closure, algorithm deficiencies, extensibility, etc.).",
        "A very demanding research issue that could substantially contribute to the development of the research on natural language processing is the definition of more formal methods that, starting from the above proposal, allow a \"deep\" evaluation and comparison of systems on the basis of their internal structure and mode of operation, opposed to the \"surface\" measure of their input-output behaviour, as considered in the present paper.",
        "Concerning the latter topic, efficiency, two aspects seem worth considering: the experimental measure of the efficiency of a specific system in understanding natural language that could appropriately complete the concept of performance defined in the present work; and the theoretical evaluation of the complexity of the general model underlying the construction of a particular system, which could possibly complete the notion of \"deep\" evaluation mentioned above."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We are grateful to the anonymous referees for their useful criticism and suggestions.",
        "We would also like to acknowledge the appreciated support provided by CSELT Laboratories (Torino, Italy) with the experimentation of the PARNAX system."
      ]
    },
    {
      "heading": "References",
      "text": [
        "In this appendix we present a limited case study experimentation with the model proposed, which should help in concretely conveying the ideas on how an evaluation session could be carried out in practice.",
        "Wider experiments will be the subject of a future paper.",
        "For this limited experimentation we have chosen the PARNAX system (Comino et al.",
        "1983): a natural language interface for querying in Italian ADABAS data bases.",
        "The toy data base utilized concerns the employees of a company, and contains just the EMPLOYEE file with the following record structure:",
        "The PARNAX system, that is, the natural language understanding system U to be evaluated, maps natural language queries (more generally, query dialogues) into expressions of the formal query language used to access the ADABAS data base, namely the NATURAL language.",
        "Owing to the very simple data base chosen, the domain D is reasonably limited, and so are LD (the set of all possible queries in Italian to the EMPLOYEE file) and R (the set of all possible NATURAL queries).",
        "We consider two goals for this experiment: namely, evaluating some aspects of the conceptual competence and of the linguistic competence.",
        "According to these goals, two samples of queries have been collected from L'D2LD (recall that the linguistic coverage L'D ..cE should generally be larger than LD see section 6): A: A sample of casual queries to the data base.",
        "Nine hundred fifty queries have been collected from 90 people chosen from several different classes of possible users of the data base.",
        "B: A sample of linguistic variations for expressing a specific request.",
        "The sentence to be rephrased has been chosen of medium-level complexity with respect to the sample data base so as to allow meaningful linguistic variations to be formed.",
        "The query utilized is: \"Tell me the birth-date of all employees who have a master degree in mathematics\".",
        "Five hundred queries have been collected from 35 people.",
        "The sample A was then slightly preprocessed before being used for the evaluation.",
        "A new sample A' was obtained from A through the following operations: (i) eliminating all queries expressing the same request (not having the same answer!",
        "), except one; (ii) eliminating all queries differing only for the values of the attributes (for example, \"Tell me the birth-date of John\" and \"Tell me the birth-date of Robert\"), except one.",
        "Note that this preprocessing constitutes a kind of very nave stratification, consisting in the choice of only some elements as representative for a class of cases.",
        "A' contains about 800 queries.",
        "The shifting function p. has been chosen to be the boolean function:",
        "(see section 4, 1) for the analysis both of A' and B.",
        "Several different choices have been taken for the importance function p. For what concerns the sample A', two functions have been considered:",
        "(see section 4, p2).",
        "For the sample B the most natural choice for p seemed to be the frequency of queries.",
        "Unfortunately, only very few (3!)",
        "queries in sample B turned out to be repeated (one repetition for two queries, two repetitions for another query; note that this result is highly surprising even if the set from which B has been extracted is enormously large).",
        "Therefore, frequency was abandoned.",
        "Two other criteria were considered: namely length and structural features.",
        "For what concerns the former, the length (number of words) of each sentence was computed first and Table 1 obtained.",
        "The length interval [5,26] was then partitioned into three parts: = [12,16], into which about 70% of the sentences of B fall; 12 = [7,11]U[17,18], includes about 25% of the expressions of B; 13 = [5,61U[19,26], to which less than 5% of the sentences of B belong.",
        "The following importance function p3 has been defined:",
        "Here, the importance of recognizing an expression is assumed to be proportional to the \"weight\" (cardinality) of the length class to which it belongs.",
        "For what concerns the latter criterion, we first defined a taxonomy of linguistic elements suitable for analysing the structural features of the sentences of Sample B.",
        "The following attributes were considered (Tennant 1980): 28Computational Linguistics, Volume 10, Number 1, January-March 1984 Giovanni Guida and Giancarlo MauriA Formal Basis for Performance Evaluation of NLUS declarative structure interrogative structure imperative structure telegraphic sentences V cleft and discontinuous sentences, parenthetic clauses, inversions multiple sentences relative clauses interrogative clauses non-finite clauses (-ing, -ed participle) prepositional phrases quantifiers, predeterminers possessive and demonstrative clauses, personal pronouns The sentences of B were then classified according to the above taxonomy by assigning to each of them all the relevant attributes.",
        "Fifty-two classes were obtained:",
        "This result suggested restricting the analysis to a smaller number of classes to be obtained through a less refined taxonomy of linguistic elements.",
        "The following attributes, which characterize the most crude features of the sentence structure, were chosen: D, G, E, T, V, M. Ten classes have now been obtained as shown in Table 2 (each class is denoted by the string of attributes that characterizes the structure of the sentences belonging to it)."
      ]
    },
    {
      "heading": "STRUCTURENUMBER OF SENTENCES",
      "text": [
        "The importance function p4 has therefore been defined to be exactly the frequency of the class to which every expression belongs, that is: if eET if eED if eEDV if eEDM if eEG if eEGM if eEE if eEEV if eEEM if e EEVM Using the samples A' and B and the ht and p functions defined above, the performance of the PARNAX system was evaluated.",
        "The following results were obtained:",
        "A few comments on the above results can be added.",
        "A global analysis of IT shows that the linguistic capabilities of PARNAX are generally higher than the conceptual ones (71,72 >> 73,174).",
        "In particular, the value of /7-4, which relies on a fine analysis of syntactic features, seems very good.",
        "Examining further the A-p-profiles obtained (except case 1, which is not meaningful), several interesting details of the system performance may be pointed out.",
        "Cases 2 and 3 show that the system performs better in correspondence to sentences with higher importance, and, hence, it is reasonably well tailored.",
        "On the contrary, it generally lacks robustness.",
        "Finally, case 4 (especially when the analysis with 52 classes, not reported here, is considered) provides to the system designer a lot of useful suggestions for corrections and improvements.",
        "30Computational Linguistics, Volume 10, Number 1, January-March 1984"
      ]
    }
  ]
}
