{
  "info": {
    "authors": [
      "Jian-Cheng Wu",
      "Tracy Lin",
      "Jason S. Chang"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics – Interactive Poster and Demonstration Sessions",
    "id": "acl-P05-3010",
    "title": "Learning Source-Target Surface Patterns for Web-Based Terminology Translation",
    "url": "https://aclweb.org/anthology/P05-3010",
    "year": 2005
  },
  "references": [
    "acl-C02-1011",
    "acl-J98-4003",
    "acl-P03-1040",
    "acl-P91-1036",
    "acl-W01-1413"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper introduces a method for learning to fmd translation of a given source term on the Web.",
        "In the approach, the source term is used as a query and part of patterns to retrieve and extract translations in Web pages.",
        "The method involves using a bilingual term list to learn source-target surface patterns.",
        "At runtime, the given term is submitted to a search engine then the candidate translations are extracted from the returned summaries and subsequently ranked based on the surface patterns, occurrence counts, and transliteration knowledge.",
        "We present a prototype called TermMine that applies the method to translate terms.",
        "Evaluation on a set of encyclopedia terms shows that the method significantly outperforms the state-of-the-art online machine translation systems."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Translation of terms has long been recognized as the bottleneck of translation by translators.",
        "By reusing prior translations a significant time spent in translating terms can be saved.",
        "For many years now, Computer-Aided Translation (CAT) tools have been touted as very useful for productivity and quality gains for translators.",
        "CAT tools such as Trados typically require upfront investment to populate multilingual terminology and translation memory.",
        "However, such investment has proven prohibitive for many in-house translation departments and freelancer translators and the actual productivity gains realized have been insignificant except for a few, very repetitive types of content.",
        "Much more productivity gain could be achieved by providing translation service of terminology.",
        "Consider the job of translating a textbook such as \"Artificial Intelligence – A Modern Approach.\" The best practice is probably to start by translating the indexes (Figure 1).",
        "It is not uncommon for these repetitive terms to be translated once and applied consistently throughout the book.",
        "For example, A good translation F = \"",
        "and then extract the strings beginning with F and ending with E (or vice versa) to obtain recurring source-target patterns.",
        "At runtime, we can submit E as query, request specifically for target-language web-pages.",
        "With these surface patterns, we can then extract translation candidates Fs from the summaries returned by the search engine.",
        "Additional information of occurrence counts and transliteration patterns can be taken into consideration to rank Fs.",
        "Terms Google Translate TermMine academy award *T-11*-P-4 _0 zrri-1, accusative case * girt: 14.",
        "\" *11 Ackley - -10 'II acoustic model *firffq1 9?-11-ffq.1 For instance, among many candidate translations, we will pick the translations \"'t `J\" for \"acoustic model\" and \"Z Id WO\" for \"Ackley, \" because they fit certain surface-target surface patterns and appears most often in the relevant webpage summaries.",
        "Furthermore, the first morpheme \"\"ZI \" in \" Id WO\" 'is consistent with prior transliterations of \"A-\" in \"Ackley\" (See Table 1).",
        "We present a prototype system called TermMine, that automatically extracts translation on the Web (Section 3.3) based on surface patterns of target translation and source term in Web pages automatically learned on bilingual terms (Section 3.1).",
        "Furthermore, we also draw on our previous work on machine transliteration (Section 3.2) to provide additional evidence.",
        "We evaluate TermMine on a set of encyclopedia terms and compare the quality of translation of TermMine (Section 4) with a online translation system.",
        "The results seem to indicate the method produce significantly better results than previous work."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "There is a resurgent of interested in data-intensive approach to machine translation, a research area started from 1950s.",
        "Most work in the large body of research on machine translation (Hutchins and Somers, 1992), involves production of sentence-by-sentence translation for a given source text.",
        "In our work, we consider a more restricted case where the given text is a short phrase of terminology or proper names (e.g., \"acoustic model\" or \"George Bush\").",
        "A number of systems aim to translate words and phrases out of the sentence context.",
        "For example, Knight and Graehl (1998) describe and evaluate a multi-stage method for performing backwards transliteration of Japanese names and technical terms into English by the machine using a generative model.",
        "In addition, Koehn and Knight (2003) show that it is reasonable to define noun phrase translation without context as an independent MT subtask and build a noun phrase translation subsystem that improves statistical machine translation methods.",
        "Nagata, Saito, and Suzuki (2001) present a system for finding English translations for a given Japanese technical term by searching for mixed Japanese-English texts on the Web.",
        "The method involves locating English phrases near the given Japanese term and scoring them based on occurrence counts and geometric probabilistic function of byte distance between the source and target terms.",
        "Kwok also implemented a term translation system for CUR along the same line.",
        "Cao and Li (2002) propose a new method to translate base noun phrases.",
        "The method involves first using Web-based method by Nagata et al., and if no translations are found on the Web, backing off to a hybrid method based on dictionary and Web-based statistics on words and context vectors.",
        "They experimented with noun-noun NP report that 910 out of 1,000 NPs can be translated with an average precision rate of 63%.",
        "In contrast to the previous research, we present a system that automatically learns surface patterns for fmding translations of a given term on the Web without using a dictionary.",
        "We exploit the convention of including the source term with the translation in the form of recurring patterns to extract translations.",
        "Additional evident of data redundancy and transliteration patterns is utilized to validate translations found on the Web."
      ]
    },
    {
      "heading": "3 The TermMine System",
      "text": [
        "In this section we describe a strategy for searching the Web pages containing translations of a given term (e.g., \"Bill Clinton\" or \"aircraft carrier\") and extracting translations therein.",
        "The proposed method involves learning the surface pattern",
        "knowledge (Section 3.1) necessary for locating translations.",
        "A transliteration model automatically trained on a list of proper name and transliterations (Section 3.2) is also utilized to evaluate and select transliterations for proper-name terms.",
        "These knowledge sources are used in concert to search, rank, and extract translations (Section 3.3)."
      ]
    },
    {
      "heading": "3.1 Source and Target Surface patterns",
      "text": [
        "With a set of terms and translations, we can learn the co-occurring patterns of a source term E and its translation F following the procedure below:",
        "(1) Submit a conjunctive query (i.e. E AND F) for each pair (E, F) in a bilingual term list to a search engine.",
        "(2) Tokenize the retrieved summaries into three types of tokens: I.",
        "A punctuation II.",
        "A source word, designated with the letter \"w\" III.",
        "A maximal block of target words (or characters in the case of language without word delimiters such as Mandarin or Japanese).",
        "(3) Replace the tokens for E’s instances with the symbol “E” and the type-III token containing the translation F with the symbol “F”.",
        "Note the token denoted as “F” is a maximal string covering the given translation but containing no punctuations or words in the source language.",
        "(4) Calculate the distance between E and F by counting the number of tokens in between.",
        "(5) Extract the strings of tokens from E to F (or the other way around) within a maximum distance of d (d is set to 3) to produce ranked surface patterns P.",
        "For instance, with the source-target pair (\"California,\" \"̋ψ\" ) and a retrieved summary of\"...ԭψ ᔊʧ .",
        "北Northern California.",
        "...,\" the surface pattern \"FwE\" of distance 1 will be derived."
      ]
    },
    {
      "heading": "3.2 Transliteration Model",
      "text": [
        "TermMine also relies on a machine transliteration model (Lin, Wu and Chang 2004) to confirm the transliteration of proper names.",
        "We use a list of names and transliterations to estimate the transliteration probability function P(τ |ω), for any given transliteration unit (TU) ω and transliteration character (TC) τ.",
        "Based on the Expectation Maximization (EM) algorithm.",
        "A TU for an English name can be a syllable or consonants which corresponds to a character in the target transliteration.",
        "Table 2 shows some examples of sub-lexical alignment between proper names and transliterations."
      ]
    },
    {
      "heading": "3.3 Finding and locating translations",
      "text": [
        "At runtime, TermMine follows the following steps to translate a given term E:",
        "(1) Webpage retrieval.",
        "The term E is submitted to a Web search engine with the language option set to the target language to obtain a set of summaries.",
        "(2) Matching patterns against summaries.",
        "The",
        "surface patterns P learned in the training phase are applied to match E in the tokenized summaries, to extract a token that matches the F symbol in the pattern.",
        "(3) Generating candidates.",
        "We take the distinct substrings C of all matched Fs as the candidates.",
        "(4) Ranking candidates.",
        "We evaluate and select",
        "translation candidates by using both data redundancy and the transliteration model.",
        "Candidates with a count or transliteration probability lower than empirically determined thresholds are discarded."
      ]
    }
  ]
}
