{
  "info": {
    "authors": [
      "Masatsugu Tonoike",
      "Mitsuhiro Kida",
      "Toshihiro Takagi",
      "Yasuhiro Sasaki",
      "Takehito Utsuro",
      "Satoshi Sato"
    ],
    "book": "International Workshop on Web As Corpus",
    "id": "acl-W06-1703",
    "title": "A Comparative Study on Compositional Translation Estimation Using a Domain/topic-Specific Corpus Collected from the Web",
    "url": "https://aclweb.org/anthology/W06-1703",
    "year": 2006
  },
  "references": [
    "acl-C02-1011",
    "acl-H05-1061",
    "acl-I05-2012",
    "acl-I05-2020",
    "acl-J98-4003",
    "acl-P03-2020",
    "acl-P98-1069",
    "acl-P99-1067",
    "acl-W01-1413"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper studies issues related to the compilation of a bilingual lexicon for technical terms.",
        "In the task of estimating bilingual term correspondences of technical terms, it is usually rather difficult to find an existing corpus for the domain of such technical terms.",
        "In this paper, we adopt an approach of collecting a corpus for the domain of such technical terms from the Web.",
        "As a method of translation estimation for technical terms, we employ a compositional translation estimation technique.",
        "This paper focuses on quantitatively comparing variations of the components in the scoring functions of compositional translation estimation.",
        "Through experimental evaluation, we show that the domain/topic-specific corpus contributes toward improving the performance of the compositional translation estimation."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "This paper studies issues related to the compilation of a bilingual lexicon for technical terms.",
        "Thus far, several techniques of estimating bilingual term correspondences from a parallel/comparable corpus have been studied (Matsumoto and Utsuro, 2000).",
        "For example, in the case of estimation from comparable corpora, (Fung and Yee, 1998; Rapp, 1999) proposed standard techniques of estimating bilingual term correspondences from comparable corpora.",
        "In their techniques, contextual similarity between a source language term and its translation candidate is measured across the languages, and all the translation candidates are re-ranked according to their contextual similarities.",
        "However, there are limited number of parallel/comparable corpora that are available for the purpose of estimating bilingual term correspondences.",
        "Therefore, even if one wants to apply those existing techniques to the task of estimating bilingual term correspondences of technical terms, it is usually rather difficult to find an existing corpus for the domain of such technical terms.",
        "On the other hand, compositional translation estimation techniques that use a monolingual corpus (Fujii and Ishikawa, 2001; Tanaka and Baldwin, 2003) are more practical.",
        "It is because collecting a monolingual corpus is less expensive than collecting a parallel/comparable corpus.",
        "Translation candidates of a term can be compositionally generated by concatenating the translation of the constituents of the term.",
        "Here, the generated translation candidates are validated using the domain/topic-specific corpus.",
        "In order to assess the applicability of the compositional translation estimation technique, we randomly pick up 667 Japanese and English technical term translation pairs of 10 domains from existing technical term bilingual lexicons.",
        "We then manually examine their compositionality, and find out that 88% of them are actually compositional, which is a very encouraging result.",
        "But still, it is expensive to collect a domain/topic-specific corpus.",
        "Here, we adopt an approach of using the Web, since documents of various domains/topics are available on the Web.",
        "When validating translation candidates using the Web, roughly speaking, there exist the following two approaches.",
        "In the first approach, translation candidates are validated through the search engine (Cao and Li, 2002).",
        "In the second approach, a domain/topic-specific corpus is collected from the Web in advance and fixed",
        "before translation estimation, then generated translation candidates are validated against the domain/topic-specific corpus (Tonoike et al., 2005).",
        "The first approach is preferable in terms of coverage, while the second is preferable in terms of computational efficiency.",
        "This paper mainly focuses on quantitatively comparing the two approaches in terms of coverage and precision of compositional translation estimation.",
        "More specifically, in compositional translation estimation, we decompose the scoring function of a translation candidate into two components: bilingual lexicon score and corpus score.",
        "In this paper, we examine variants for those components and define 9 types of scoring functions in total.",
        "Regarding the above mentioned two approaches to validating translation candidates using the Web, the experimental result shows that the second approach outperforms the first when the correct translation does exist in the corpus.",
        "Furthermore, we examine the methods that combine two scoring functions based on their agreement.",
        "The experimental result shows that it is quite possible to achieve precision much higher than those of single scoring functions."
      ]
    },
    {
      "heading": "2 Overall framework",
      "text": [
        "The overall framework of compiling a bilingual lexicon from the Web is illustrated as in Figure 1.",
        "Suppose that we have sample terms of a specific domain/topic, then the technical terms that are to be listed as the headwords of a bilingual lexicon are collected from the Web by the related term collection method of (Sato and Sasaki, 2003).",
        "These collected technical terms can be divided into three subsets depending on the number of translation candidates present in an existing bilingual lexicon, i.e., the subset XUS of terms for which the number of translations in the existing bilingual lexicon is one, the subset XMS of terms for which the number of translations is more than one, and the subset YS of terms that are not found in the existing bilingual lexicon (henceforth, the union XUS U XMS will be denoted as XS).",
        "Here, the translation estimation task here is to estimate translations for the terms of the subsets XMS and YS.",
        "A new bilingual lexicon is compiled from the result of the translation estimation for the terms of the subsets XMS and YS as well as the translation pairs that consist of the terms of the subset XUS and their translations found in the existing bilingual lexicon.",
        "For the terms of the subset XMS , it is required that an appropriate translation is selected from among the translation candidates found in the existing bilingual lexicon.",
        "For example, as a translation of the Japanese technical term “L %)X ,” which belongs to the logic circuit domain, the term “register” should be selected but not the term “reg-ista” of the football domain.",
        "On the other hand, for the terms of YS, it is required that the translation candidates are generated and validated.",
        "In this paper, out of the above two tasks, we focus on the latter of translation candidate generation and validation using the Web.",
        "As we introduced in the previous section, here we experimentally compare the two approaches to validating translation candidates.",
        "The first approach directly uses the search engine, while the second uses the domain/topicspecific corpus, which is collected in advance from the Web.",
        "Here, in the second approach, we use the term of XUS , which has only one translation in the existing bilingual lexicon.",
        "The set of translations of the terms of the subset XUS is denoted as XUT .",
        "Then, in the second approach, the domain/topicspecific corpus is collected from the Web using the terms of the set XUT ."
      ]
    },
    {
      "heading": "3 Compositional Translation Estimation for Technical Terms",
      "text": []
    },
    {
      "heading": "3.1 Overview",
      "text": [
        "An example of compositional translation estimation for the Japanese technical term “ i MT03n #T” is illustrated in Figure 2.",
        "First, the Japanese technical term “ i MT03n#T” is decomposed into its constituents by consulting an existing bilingual lexicon and retrieving Japanese head",
        "words.1 In this case, the result of this decomposition can be given as in the cases “a” and “b” (in Figure 2).",
        "Then, each constituent is translated into the target language.",
        "A confidence score is assigned to the translation of each constituent.",
        "Finally, translation candidates are generated by concatenating the translation of those constituents according to word ordering rules considering prepositional phrase construction."
      ]
    },
    {
      "heading": "3.2 Collecting a Domain/Topic-Specific Corpus",
      "text": [
        "When collecting a domain/topic-specific corpus of the language T, for each technical term xUT in the set XUT, we collect the top 100 pages obtained from search engine queries that include the term xUT.",
        "Our search engine queries are designed such that documents that describe the technical term xUT are ranked high.",
        "For example, an online glossary is one such document.",
        "When collecting a Japanese corpus, the search engine “goo”2 is used.",
        "The specific queries that are used in this search engine are phrases with topic ..y marking postpositional particles such as “xUT ͱ td.,” “xUTͱ͍͏,” “xUT 1,” and an adnominal phrase “xUT ͷ,”and “xU” Y"
      ]
    },
    {
      "heading": "3.3 Translation Estimation 3.3.1 Compiling Bilingual Constituents Lexicons",
      "text": [
        "This section describes how to compile bilingual constituents lexicons from the translation pairs of 1Here, as an existing bilingual lexicon, we use Ei-jiro(http://www.alc.co.jp/) and bilingual constituents lexicons compiled from the translation pairs of Eijiro (details to be described in the next section).",
        "the existing bilingual lexicon Eijiro.",
        "The underlying idea of augmenting the existing bilingual lexicon with bilingual constituents lexicons is illustrated in Figure 3.",
        "Suppose that the existing bilingual lexicon does not include the translation pair “applied : ZA,” while it includes many compound translation pairs with the first English word “applied” and the first Japanese word “Z A .”3 In such a case, we align those translation pairs and estimate a bilingual constituent translation pair which is to be collected into a bilingual constituents lexicon.",
        "More specifically, from the existing bilingual lexicon, we first collect translation pairs whose English terms and Japanese terms consist of two constituents into another lexicon P2.",
        "We compile the “bilingual constituents lexicon (prefix)” from the first constituents of the translation pairs in P2 and compile the “bilingual constituents lexicon (suffix)” from their second constituents.",
        "The number of entries in each language and those of the translation pairs in these lexicons are shown in Table 1.",
        "The result of our assessment reveals that only 48% of the 667 translation pairs mentioned in Section 1 can be compositionally generated by using Eijiro, while the rate increases up to 69% using both Eijiro and “bilingual constituents lexicons.”4"
      ]
    },
    {
      "heading": "3.3.2 Score of Translation Candidates",
      "text": [
        "This section gives the definition of the scores of a translation candidate in compositional translation estimation.",
        "First, let ys be a technical term whose translation is to be estimated.",
        "We assume that ys is de",
        "where each si is a single word or a sequence of words.5 For ys, we denote a generated translation candidate as yt.",
        "The score of a generated translation candidate is defined as the product of a bilingual lexicon score and a corpus score as follows.",
        "Bilingual lexicon score measures appropriateness of correspondence of ys and yt.",
        "Corpus score measures appropriateness of the translation candidate yt based on the target language corpus.",
        "If a translation candidate is generated from more than one sequence of translation pairs, the score of the translation candidate is defined as the sum of the score of each sequence."
      ]
    },
    {
      "heading": "Bilingual Lexicon Score",
      "text": [
        "In this paper, we compare two types of bilingual lexicon scores.",
        "Both scores are defined as the product of scores of translation pairs included in the lexicons presented in the previous section as follows.",
        "• Frequency-Length",
        "The first type of bilingual lexicon scores is referred to as “Frequency-Length.” This score is based on the length of translation pairs and the frequencies of translation pairs in the bilingual constituent lexicons (prefix,suffix) BP, BS in Table 1.",
        "In this paper, we first assume that the translation pairs follow certain preference rules and that they can be ordered as below:",
        "1.",
        "Translation pairs (s, t) in the existing bilingual lexicon Eijiro, where the term s consists of two or more constituents.",
        "2.",
        "Translation pairs in the bilingual constituents lexicons whose frequencies in P2 are high.",
        "3.",
        "Translation pairs (s, t) in the existing bilingual lexicon Eijiro, where the term s consists of exactly one constituent.",
        "4.",
        "Translation pairs in the bilingual constituents lexicons whose frequencies in P2 are not high.",
        "As the definition of the confidence score q((s, t)) of a translation pair (s, t), we use the following:",
        "(6) ,where compo(s) denotes the word count of s, fp((s, t)) represents the frequency of (s, t) as the first constituent in P2, and fs ((s, t)) represents the frequency of (s, t) as the second constituent in P2.",
        "• Probability",
        "The second type of bilingual lexicon scores is referred to as “Probability.” This score is calculated as the product of the conditional probabilities P(sil ti).",
        "P(sl t) is calculated using bilingual lexicons in Table 1.",
        "fprob((s, t)) denotes the frequency of the translation pair (s, t) in the bilingual lexicons as follows:",
        "Note that the frequency of a translation pair in Eijiro is regarded as 106 and fB ((s, t)) denotes the frequency of the translation pair (s, t) in the bilingual constituent lexicon B."
      ]
    },
    {
      "heading": "Corpus Score",
      "text": [
        "We evaluate three types of corpus scores as follows.",
        "• Probability: the occurrence probability of yt estimated by the following bi-gram model",
        "• Frequency: the frequency of a translation candidate in a target language corpus",
        "• Occurrence: whether a translation candidate occurs in a target language corpus or not"
      ]
    },
    {
      "heading": "Variation of the total scoring functions",
      "text": [
        "As shown in Table 2, in this paper, we examine the 9 combinations of the bilingual lexicon scores and the corpus scores.",
        "In the table, ‘prune’ indicates that the score is used for ranking and pruning sub-sequences of generated translation candidates in the course of generating translation candidates using a dynamic programming algorithm.",
        "‘Final’ indicates that the score is used for ranking the final outputs of generating translation candidates.",
        "In the column ‘corpus’, ‘off-line’ indicates that a domain/topic-specific corpus is collected from the Web in advance and then generated translation candidates are validated against this corpus.",
        "‘On-line’ indicates that translation candidates are directly validated through the search engine.",
        "Roughly speaking, the scoring function ‘A’ corresponds to a variant of the model proposed by (Fujii and Ishikawa, 2001).",
        "The scoring function ‘D’ is a variant of the model proposed by (Tonoike et al., 2005) and ‘E’ corresponds to the bilingual lexicon score of the scoring function ‘D’.",
        "The scoring function ‘I’ is intended to evaluate the approach proposed in (Cao and Li, 2002)."
      ]
    },
    {
      "heading": "3.3.3 Combining Two Scoring Functions based on their Agreement",
      "text": [
        "In this section, we examine the method that combines two scoring functions based on their agreement.",
        "The two scoring functions are selected out of the 9 functions introduced in the previous section.",
        "In this method, first, confidence of translation candidates of a technical term are measured by the two scoring functions.",
        "Then, if the first ranked translation candidates of both scoring functions agree, this method outputs the agreed translation candidate.",
        "The purpose of introducing this method is to prefer precision to recall.",
        "Estimation for Technical Terms with/without the Domain/Topic-Specific Corpus (taken from Figure 1)"
      ]
    },
    {
      "heading": "4 Experiments and Evaluation",
      "text": []
    },
    {
      "heading": "4.1 Translation Pairs for Evaluation",
      "text": [
        "In our experimental evaluation, within the framework of compiling a bilingual lexicon for technical terms, we evaluate the translation estimation portion that is indicated by the bold line in Figure 4.",
        "In this paper, we simply omit the evaluation of the process of collecting technical terms to be listed as the headwords of a bilingual lexicon.",
        "In order to evaluate the translation estimation portion, terms are randomly selected from the 10 categories of existing Japanese-English technical term dictionaries listed in Table 3, for each of the subsets XUS and YS (here, the terms of YS that consist of only one word or morpheme are excluded).",
        "As described in Section 1, the terms of the set XUT (the set of translations for the terms of the subsetXUS) is used for collecting a domain/topic-specific corpus from the Web.",
        "As shown in Table 3, size of the collected corpora is 48MB on the average.",
        "Translation estimation evaluation is to be conducted for the subset YS.",
        "For each of the 10 categories, Table 3 shows the sizes of the subsets XUS and YS, and the rate of including correct translation within the collected domain/topic-specific corpus for YS.",
        "In the following, we show the evaluation results with the source language S as English and the target language T as Japanese."
      ]
    },
    {
      "heading": "4.2 Evaluation of single scoring functions",
      "text": [
        "This section gives the results of evaluating single scoring functions A – I listed in Table 2.",
        "Table 4 shows three types of experimental results.",
        "The column ‘the whole set YS’ shows the results against the whole set YS.",
        "The column ‘generatable’ shows the results against the translation pairs in YS that can be generated through the compositional translation estimation process.",
        "69% of the terms in ‘the whole set YS’ belongs to the set ‘generatable’.",
        "The column ‘gene.-exist’ shows the result against the source terms whose correct translations do exist in the corpus and that can be generated through the compositional translation estimation process.",
        "50% of the terms in ‘the whole set YS’ belongs to the set ‘gene.-exist’.",
        "The column ‘top 1’ shows the correct rate of the first ranked translation candidate.",
        "The column ‘top 10’ shows the rate of including the correct candidate within top 10.",
        "First, in order to evaluate the effectiveness of the approach of validating translation candidates by using a target language corpus, we compare the scoring functions ’D’ and ’E’.",
        "The difference between them is whether or not they use a corpus score.",
        "The results for the whole set YS show that using a corpus score, the precision improves from 33.9% to 43.0%.",
        "This result supports the effectiveness of the approach of validating translation candidates using a target language corpus.",
        "As can be seen from these results for the whole set YS, the correct rate of the scoring function ‘I’ that directly uses the web search engine in the calculation of its corpus score is higher than those of other scoring functions that use the collected domain/topic-specific corpus.",
        "This is because, for the whole set YS, the rate of including correct translation within the collected domain/topicspecific corpus is 72% on the average, which is not very high.",
        "On the other hand, the results of the column ‘gene.-exist’ show that if the correct translation does exist in the corpus, most of the scoring functions other than ‘I’ can achieve precisions higher than that of the scoring function ‘I’.",
        "This result supports the effectiveness of the approach of collecting a domain/topic-specific corpus from the Web in advance and then validating generated translation candidates against this corpus."
      ]
    },
    {
      "heading": "4.3 Evaluation of combining two scoring functions based on their agreement",
      "text": [
        "The result of evaluating the method that combines two scoring functions based on their agreement is shown in Table 5.",
        "This result indicates that combinations of scoring functions with ‘off-line’/‘on",
        "line’ corpus tend to achieve higher precisions than those with ‘off-line’/‘off-line’ corpus.",
        "This result also shows that it is quite possible to achieve high precisions even by combining scoring functions with ‘off-line’/‘off-line’ corpus (the pair ‘A’ and ‘H’).",
        "Here, the two scoring functions ‘A’ and ‘H’ are the one with frequency-based scoring functions and that with probability-based scoring functions, and hence, have quite different nature in the design of their scoring functions."
      ]
    },
    {
      "heading": "5 Related Works",
      "text": [
        "As a related work, (Fujii and Ishikawa, 2001) proposed a technique for compositional estimation of bilingual term correspondences for the purpose of cross-language information retrieval.",
        "One of the major differences between the technique of (Fujii and Ishikawa, 2001) and the one proposed in this paper is that in (Fujii and Ishikawa, 2001), instead of a domain/topic-specific corpus, they use a corpus containing the collection of technical papers, each of which is published by one of the 65 Japanese associations for various technical domains.",
        "Another significant difference is that in (Fujii and Ishikawa, 2001), they evaluate only the performance of the cross-language information retrieval and not that of translation estimation.",
        "(Cao and Li, 2002) also proposed a method of compositional translation estimation for compounds.",
        "In the method of (Cao and Li, 2002), the translation candidates of a term are compositionally generated by concatenating the translation of the constituents of the term and are validated directly through the search engine.",
        "In this paper, we evaluate the approach proposed in (Cao and Li, 2002) by introducing a total scoring function",
        "that is based on validating translation candidates directly through the search engine.",
        "M. Nagata et al.",
        "2001.",
        "Using the Web as a bilingual dictionary.",
        "In Proc.",
        "ACL-2001 Workshop on Data-driven Methods in Machine Translation, pages 95–102."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "This paper studied issues related to the compilation a bilingual lexicon for technical terms.",
        "In the task of estimating bilingual term correspondences of technical terms, it is usually rather difficult to find an existing corpus for the domain of such technical terms.",
        "In this paper, we adopt an approach of collecting a corpus for the domain of such technical terms from the Web.",
        "As a method of translation estimation for technical terms, we employed a compositional translation estimation technique.",
        "This paper focused on quantitatively comparing variations of the components in the scoring functions of compositional translation estimation.",
        "Through experimental evaluation, we showed that the domain/topic specific corpus contributes to improving the performance of the compositional translation estimation.",
        "Future work includes complementally integrating the proposed framework of compositional translation estimation using the Web with other translation estimation techniques.",
        "One of them is that based on collecting partially bilingual texts through the search engine (Nagata and others, 2001; Huang et al., 2005).",
        "Another technique which seems to be useful is that of transliteration of names (Knight and Graehl, 1998; Oh and Choi, 2005)."
      ]
    }
  ]
}
