{
  "info": {
    "authors": [
      "Simone Paolo Ponzetto",
      "Michael Strube"
    ],
    "book": "Conference of the European Association for Computational Linguistics – Demonstrations",
    "id": "acl-E06-2015",
    "title": "Semantic Role Labeling for Coreference Resolution",
    "url": "https://aclweb.org/anthology/E06-2015",
    "year": 2006
  },
  "references": [
    "acl-H05-1003",
    "acl-J01-4004",
    "acl-J02-3001",
    "acl-J05-1004",
    "acl-J96-1002",
    "acl-M95-1005",
    "acl-N04-1030",
    "acl-N04-1037",
    "acl-P02-1014",
    "acl-W05-0620"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Extending a machine learning based coref-erence resolution system with a feature capturing automatically generated information about semantic roles improves its performance."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The last years have seen a boost of work devoted to the development of machine learning based coreference resolution systems (Soon et al., 2001; Ng & Cardie, 2002; Kehler et al., 2004, inter alia).",
        "Similarly, many researchers have explored techniques for robust, broad coverage semantic parsing in terms of semantic role labeling (Gildea & Jurafsky, 2002; Carreras & M`arquez, 2005, SRL henceforth).",
        "This paper explores whether coreference resolution can benefit from SRL, more specifically, which phenomena are affected by such information.",
        "The motivation comes from the fact that current coreference resolution systems are mostly relying on rather shallow features, such as the distance between the coreferent expressions, string matching, and linguistic form.",
        "On the other hand, the literature emphasizes since the very beginning the relevance of world knowledge and inference (Charniak, 1973).",
        "As an example, consider a sentence from the Automatic Content Extraction (ACE) 2003 data.",
        "(1) A state commission of inquiry into the sinking of the Kursk will convene in Moscow on Wednesday, the Interfax news agency reported.",
        "It said that the diving operation will be completed by the end of next week.",
        "It seems that in this example, knowing that the Interfax news agency is the AGENT of the report predicate, and It being the AGENT of say, could trigger the (semantic parallelism based) inference required to correctly link the two expressions, in contrast to anchoring the pronoun to Moscow.",
        "SRL provides the semantic relationships that constituents have with predicates, thus allowing us to include document-level event descriptive information into the relations holding between referring expressions (REs).",
        "This layer of semantic context abstracts from the specific lexical expressions used, and therefore represents a higher level of abstraction than predicate argument statistics (Kehler et al., 2004) and Latent Semantic Analysis used as a model of world knowledge (Klebanov & Wiemer-Hastings, 2002).",
        "In this respect, the present work is closer in spirit to Ji et al.",
        "(2005), who explore the employment of the ACE 2004 relation ontology as a semantic filter."
      ]
    },
    {
      "heading": "2 Coreference Resolution Using SRL",
      "text": []
    },
    {
      "heading": "2.1 Corpora Used",
      "text": [
        "The system was initially prototyped using the MUC-6 and MUC-7 data sets (Chinchor & Sund-heim, 2003; Chinchor, 2001), using the standard partitioning of 30 texts for training and 20-30 texts for testing.",
        "Then, we developed and tested the system with the ACE 2003 Training Data corpus (Mitchell et al., 2003)1.",
        "Both the Newswire (NWIRE) and Broadcast News (BNEWS) sections where split into 60-20-20% document-based partitions for training, development, and testing, and later per-partition merged (MERGED) for system evaluation.",
        "The distribution of coreference chains and referring expressions is given in Table 1."
      ]
    },
    {
      "heading": "2.2 Learning Algorithm",
      "text": [
        "For learning coreference decisions, we used a Maximum Entropy (Berger et al., 1996) model.",
        "Coreference resolution is viewed as a binary classification task: given a pair of REs, the classifier has to decide whether they are coreferent or not.",
        "First, a set of preprocessing components includ",
        "ing a chunker and a named entity recognizer is applied to the text in order to identify the noun phrases, which are further taken as REs to be used for instance generation.",
        "Instances are created following Soon et al.",
        "(2001).",
        "During testing the classifier imposes a partitioning on the available REs by clustering each set of expressions labeled as coreferent into the same coreference chain."
      ]
    },
    {
      "heading": "2.3 Baseline System Features",
      "text": [
        "Following Ng & Cardie (2002), our baseline system reimplements the Soon et al.",
        "(2001) system.",
        "The system uses 12 features.",
        "Given a pair of candidate referring expressions REZ and RED the features are computed as follows2.",
        "JDEM T if RED starts with this, that, these, or those; else F. NUMBER T if both REZ and RED agree in number; else F. GENDER U if REZ or RED have an undefined gender.",
        "Else if they are both defined and agree T; else F. PROPERNAME T if both REZ and RED are proper names; else F. APPOSITIVE T if RED is in apposition with REZ; else F.",
        "(c) Semantic features",
        "WNCLASS U if REi or RED have an undefined WordNet semantic class.",
        "Else if they both have a defined one and it is the same T; else F.",
        "2Possible values are U(nknown), T(rue) and F(alse).",
        "Note that in contrast to Ng & Cardie (2002) we classify ALIAS as a lexical feature, as it solely relies on string comparison and acronym string matching.",
        "(d) Distance features DISTANCE how many sentences REZ and RED are apart."
      ]
    },
    {
      "heading": "2.4 Semantic Role Features",
      "text": [
        "The baseline system employs only a limited amount of semantic knowledge.",
        "In particular, semantic information is limited to WordNet semantic class matching.",
        "Unfortunately, a simple WordNet semantic class lookup exhibits problems such as coverage and sense disambiguation3, which make the WNCLASS feature very noisy.",
        "As a consequence, we propose in the following to enrich the semantic knowledge made available to the classifier by using SRL information.",
        "In our experiments we use the ASSERT parser (Pradhan et al., 2004), an SVM based semantic role tagger which uses a full syntactic analysis to automatically identify all verb predicates in a sentence together with their semantic arguments, which are output as PropBank arguments (Palmer et al., 2005).",
        "It is often the case that the semantic arguments output by the parser do not align with any of the previously identified noun phrases.",
        "In this case, we pass a semantic role label to a RE only in case the two phrases share the same head.",
        "Labels have the form “ARG1 _pred1 ... ARG,pred,,,” for n semantic roles filled by a constituent, where each semantic argument label ARGi is always defined with respect to a predicate lemma pred.",
        "Given such level of semantic information available at the RE level, we introduce two new features4.",
        "ISEMROLE the semantic role argument-predicate pairs of REZ.",
        "JSEMROLE the semantic role argument-predicate pairs of REQ.",
        "For the ACE 2003 data, 11,406 of 32,502 automatically extracted noun phrases were tagged with 2,801 different argument-predicate pairs."
      ]
    },
    {
      "heading": "3 Experiments",
      "text": []
    },
    {
      "heading": "3.1 Performance Metrics",
      "text": [
        "We report in the following tables the MUC score (Vilain et al., 1995).",
        "Scores in Table 2 are computed for all noun phrases appearing in either the key or the system response, whereas Tables 3 and 4 refer to scoring only those phrases which appear in both the key and the response.",
        "We discard therefore those responses not present in the key, as we are interested here in establishing the upper limit of the improvements given by SRL.",
        "We also report the accuracy score for all three types of ACE mentions, namely pronouns, common nouns and proper names.",
        "Accuracy is the percentage of REs of a given mention type correctly resolved divided by the total number of REs of the same type given in the key.",
        "A RE is said to be correctly resolved when both it and its direct antecedent are in the same key coreference class.",
        "In all experiments, the REs given to the classifier are noun phrases automatically extracted by a pipeline of preprocessing components (i.e. PoS tagger, NP chunker, Named Entity Recognizer)."
      ]
    },
    {
      "heading": "3.2 Results",
      "text": [
        "Table 2 compares the results between our duplicated Soon baseline and the original system.",
        "The systems show a similar performance w.r.t.",
        "F-measure.",
        "We speculate that the result improvements are due to the use of current preprocessing components and another classifier.",
        "Tables 3 and 4 show a comparison of the performance between our baseline system and the one incremented with SRL.",
        "Performance improvements are highlighted in bold.",
        "The tables show that SRL tends to improve system recall, rather than acting as a ‘semantic filter’ improving precision.",
        "Semantic roles therefore seem to trigger a",
        "response in cases where more shallow features do not seem to suffice (see example (1)).",
        "The RE types which are most positively affected by SRL are pronouns and common nouns.",
        "On the other hand, SRL information has a limited or even worsening effect on the performance on proper names, where features such as string matching and alias seem to suffice.",
        "This suggests that SRL plays a role in pronoun and common noun resolution, where surface features cannot account for complex preferences and semantic knowledge is required."
      ]
    },
    {
      "heading": "3.3 Feature Evaluation",
      "text": [
        "We investigated the contribution of the different features in the learning process.",
        "Table 5 shows the chi-square statistic (normalized in the [0, 1] interval) for each feature occurring in the training data of the MERGED dataset.",
        "SRL features show a high χ2 value, ranking immediately after string matching and alias, which indicates a high correlation of these features to the decision classes.",
        "The importance of SRL is also indicated by the analysis of the contribution of individual features to the overall performance.",
        "Table 6 shows the performance variations obtained by leaving out each feature in turn.",
        "Again, it can be seen that removing both I and JSEMROLE induces a relatively high performance degradation when compared to other features.",
        "Their removal ranks 5th out of 12, following only essential features such as string matching, alias, pronoun and number.",
        "Similarly to Table 5, the semantic role of the anaphor ranks higher than the one of the antecedent.",
        "This re",
        "lates to the improved performance on pronouns, as it indicates that SRL helps for linking anaphoric pronouns to preceding REs.",
        "Finally, it should be noted that SRL provides much more solid and noise-free semantic features when compared to the WordNet class feature, whose removal induces always a lower performance degradation."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "In this paper we have investigated the effects of using semantic role information within a machine learning based coreference resolution system.",
        "Empirical results show that coreference resolution can benefit from SRL.",
        "The analysis of the relevance of features, which had not been previously addressed, indicates that incorporating semantic information as shallow event descriptions improves the performance of the classifier.",
        "The generated model is able to learn selection preferences in cases where surface morpho-syntactic features do not suffice, i.e. pronoun resolution.",
        "We speculate that this contrasts with the disappointing findings of Kehler et al.",
        "(2004) since SRL provides a more fine grained level of information when compared to predicate argument statistics.",
        "As it models the semantic relationship that a syntactic constituent has with a predicate, it carries indirectly syntactic preference information.",
        "In addition, when used as a feature it allows the classifier to infer semantic role co-occurrence, thus inducing deep representations of the predicate argument relations for learning in coreferential contexts.",
        "Acknowledgements: This work has been funded by the Klaus Tschira Foundation, Heidelberg, Germany.",
        "The first author has been supported by a KTF grant (09.003.2004)."
      ]
    }
  ]
}
