{
  "info": {
    "authors": [
      "Tyne Liang",
      "Yu-Hsiang Lin"
    ],
    "book": "Second International Joint Conference on Natural Language Processing: Full Papers",
    "id": "acl-I05-1065",
    "title": "Anaphora Resolution for Biomedical Literature by Exploiting Multiple Resources",
    "url": "https://aclweb.org/anthology/I05-1065",
    "year": 2005
  },
  "references": [
    "acl-C90-3063",
    "acl-C96-1021",
    "acl-J95-2003",
    "acl-P02-1014",
    "acl-P04-1017",
    "acl-P98-2143",
    "acl-W03-1023",
    "acl-W04-0706",
    "acl-W04-0711",
    "acl-W04-0713",
    "acl-W97-1306"
  ],
  "sections": [
    {
      "text": [
        "Tyne Liang and Yu-Hsiang Lin",
        "Abstract.",
        "In this paper, a resolution system is presented to tackle nominal and pronominal anaphora in biomedical literature by using rich set of syntactic and semantic features.",
        "Unlike previous researches, the verification of semantic association between anaphors and their antecedents is facilitated by exploiting more outer resources, including UMLS, WordNet, GENIA Corpus 3.02p and PubMed.",
        "Moreover, the resolution is implemented with a genetic algorithm on its feature selection.",
        "Experimental results on different biomedical corpora showed that such approach could achieve promising results on resolving the two common types of anaphora."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Correct identification of antecedents for an anaphor is essential in message understanding systems as well as knowledge acquisition systems.",
        "For example, efficient anaphora resolution is needed to enhance protein interaction extraction from biomedical literature by mining more protein entity instances which are represented with pronouns or general concepts.",
        "In biomedical literature, pronominal and nominal anaphora are the two common types of anaphora.",
        "In past literature, different strategies to identify antecedents of an anaphor have been presented by using syntactic, semantic and pragmatic clues.",
        "For example, grammatical roles of noun phrases were used in [9] [10].",
        "In addition to the syntactic information, statistical information like co-occurring patterns obtained from a corpus is employed during antecedent finding in [3].",
        "However, a large corpus is needed for acquiring sufficient co-occurring patterns and for dealing with data sparseness.",
        "On the other hand, outer resources, like WordNet, are applied in [4][12][15] and proved to be helpful to improve the system like the one described in [12] where ani-macy information is exploited by analyzing the hierarchical relation of nouns and verbs in the surrounding context learned from WordNet.",
        "Nevertheless, using WordNet alone for acquiring semantic information is not sufficient for solving unknown words.",
        "To tackle this problem, a richer resource, the Web, was exploited in [16]",
        "Anaphora Resolution for Biomedical Literature by Exploiting Multiple Resources 743 where anaphoric information is mined from Google search results at the expense of less precision.",
        "The domain-specific ontologies like UMLS (Unified Medical Language System) has been employed in [2] in such a way that frequent semantic types associated to agent (subject) and patient (object) role of subject-action or action-object patterns can be extracted.",
        "The result showed such kind of patterns could gain increase in both precision (76% to 80%) and recall (67% to 71%).",
        "On the other hand, Kim and Park [11] built their BioAR to relate protein names to SWISS-Prot entries by using the centering theory presented by [7] and salience measures by [2].",
        "In this paper, a resolution system is presented for tackling both nominal anaphora and pronominal anaphora in biomedical literature by using various kinds of syntactic and semantic features.",
        "Unlike previous approaches, our verification of the semantic association between anaphors and their antecedents is facilitated with the help of both general domain and domain-specific resources.",
        "For example, the semantic type checking for resolving nominal anaphora can be done by the domain ontology UMLS and PubMed, the search engine for MEDLINE databases.",
        "Here, UMLS is used not only for tagging the semantic type for the noun phrase chunks if they are in UMLS, but also for generating the key lexicons for each type so that we can use them to tag those chunks if they are not in UMLS.",
        "If no type information can be obtained from an chunk, then its type finding will be implemented through the web mining of PubMed.",
        "On the other hand, the domain corpus, GENIA 3.02p corpus [20] is exploited while we solve the semantic type checking for pronominal anaphora.",
        "With simple weight calculation, the key SA/AO (subject-action or action-object) patterns for each type can be mined from the corpus and they turn out to be helpful in resolution.",
        "Beside the semantic type agreement, the implicit resemblance between an anaphor and its antecedents is another evidence useful for verifying the semantic association.",
        "Hence, the general domain thesaurus, WordNet, which supporting more relationship between concepts and subconcepts, is also employed to enhance the resemblance extraction.",
        "The presented resolution system is constructed on a basis of a salience grading.",
        "In order to boost the system, we implemented a simple genetic algorithm on its selection of the rich feature set.",
        "The system was developed on the small evaluation corpus MedStract.",
        "Nevertheless, we constructed a larger test corpus (denoted as '100-MEDLINE') so that more instances of anaphors can be resolved.",
        "Experimental results show that our resolution on MedStract can yield 92% and 78% F-Scores on resolving pronominal and nominal anaphora respectively.",
        "Promising results were also obtained on the larger corpus in terms of 87.43% and 80.61% F-scores on resloving pronominal and nominal anaphora respectively."
      ]
    },
    {
      "heading": "2 Anaphora Resolution",
      "text": [
        "Figure 1 is the overview of the presented architecture, including the extraction of biomedical SA/AO patterns and semantic type lexicons in background processing (indicated with dotted lines), as well as the document processing, anaphor recognition and antecedent selection in foreground processing (indicated with solid lines).",
        "Document Processing",
        "Anaphor Recognition",
        "Pronominal Anaphor",
        "Nominal Anaphor",
        "Antecedent Selection",
        "Number Agreement Check",
        "Salience Grading",
        ".....J...............",
        "Semantic Type Lexicon Extraction",
        ".......T...............",
        "Semantically-tagged SA/AO Extraction",
        "J...",
        "Semantic SA/AO Patterns"
      ]
    },
    {
      "heading": "Fig. 1. System architecture overview",
      "text": []
    },
    {
      "heading": "2.1 Syntactic Information Extraction",
      "text": [
        "Being important features for anaphora resolution, syntactic information, like POS tags and base NP chunks, is extracted from each document by using the Tagger.",
        "Meanwhile, each NP will be tagged with its grammatical role, namely, 'Oblique', 'Direct object', 'Indirect object', or 'Subject' by using the following rules which were adopted from [22] by adding rules 5 and 6.",
        "Rulel: Prep NP (Oblique)",
        "Rule2: Verb NP (Direct object)",
        "Rule3: Verb [NP]+ NP (Indirect object)",
        "Rule5: NPl Conjunction NP2 (Role is same as NPl) Conjunction]",
        "Rule6: [Conjunction] NPl ( Role is same as NP2 ) Conjunction NP2",
        "......«",
        "!",
        "Key",
        "lexicons for",
        "each type",
        "Rules 5 and 6 are presented for dealing those plural anaphors in such a way that the syntactic agreement between the first antecedent and its anaphora is used to find other antecedents.",
        "For example, without rules 5 and 6, 'anti-CD4 mAb' in Example 1 will not be found when resolving anaphora 'they'.",
        "Examplel: \"Whereas different anti-CD4 mAb or HIV-1 gp120 could all trigger activation of the they differed...\""
      ]
    },
    {
      "heading": "2.2 Semantic Information Extraction",
      "text": [
        "Beside the syntactic clues, the semantic agreement between an anaphor and its antecedents can also facilitate anaphora resolution in domain-specific literature.",
        "In this paper, the semantic information for each target noun phrase chunk can be extracted with the help of the domain ontology, UMLS, which supports the semantic type for the chunk.",
        "However, the semantic types for those chunks which are not in UMLS are needed to be predicted.",
        "Therefore we need to extract the key lexicons from UMLS for each semantic type in background processing and use them to tag unknown chunk with predicted types.",
        "On the other hand, the semantic type checking for pronominal anaphors is done through the extraction of the key verbs for each semantic type.",
        "Hence, a domain corpus GENIA 3.02p is exploited in background processing."
      ]
    },
    {
      "heading": "2.2.1 Key Lexicons for Each Semantic Type",
      "text": [
        "For each UMLS semantic type, its key lexicons are mined as the following steps in Figure 2:",
        "A.",
        "Collect all UMLS concepts and their corresponding synonyms as type lexicon candidates.",
        "B. Tokenize the candidates.",
        "For example, concept 'interleukin-2' has synonyms 'Costimulator', 'Co-Simulator', 'IL 2', and 'interleukine 2'.",
        "Then 'interleukin', 'costimulator', 'simulator', 'IL', and 'interleukine' will be treated as lexicon candidates.",
        "C. For each candidate, calculate its weight wij for each type by using Eq.",
        "(1) which takes into account its concentration and distribution.",
        "A predefined threshold is given for the final selection of the candidates.",
        "score of word i in semantic type j count of word i in semantic type j Max count of word k in semantic type j count of semantic types that word i occurs in Fig. 2.",
        "Procedure to mine key lexicons for each semantic type"
      ]
    },
    {
      "heading": "2.2.2 Semantic SA/AO Patterns",
      "text": [
        "As indicated previously in Section 2.2, the semantic type checking for pronominal anaphors can be done through the extraction of the co-occurring SA/AO patterns extracted from GENIA 3.02p.",
        "We tagged each base noun phrase chunk from the corpus with its grammatical role and tagged it with UMLS-semantic type.",
        "Then we used Eq.",
        "2 to score each pattern.",
        "At resolution, an antecedent candidate is concerned if its scores are greater than a given threshold.",
        "Table 1 is an example to show the key lexicons and verbs for two semantic types when the semantically-typed chunk is tagged with the role of subject.",
        "frequency(typei, verb, ) 1 frequency(verbj ) AO.",
        "of types(verbj )"
      ]
    },
    {
      "heading": "Table 1. Some key lexicons and verbs for two semantic types",
      "text": [
        "Semantic types key lexicons for each type key verbs for each type"
      ]
    },
    {
      "heading": "2.3 Anaphora Recognition",
      "text": [
        "Anaphor recognition is to recognize the target anaphors by filtering strategies.",
        "Pronominal anaphora recognition is done by filtering pleonastic-it instances by using the set of hand-craft rules presented in [12].",
        "On two corpora, namely, Medstract and the new 100-Medline corpus, 100% recognition accuracy was achieved.",
        "The remaining noun phrases indicated with 'it', 'its', 'itself', 'they', 'them', 'themselves' or 'their' are considered as pronominal anaphor.",
        "Others like 'which' and 'that' used in relative clauses are treated as pronominal anaphors and are resolved by the following rules.",
        "Rule 1: 'that' is treated as pleonastic-that if it is paired with pleonastic-it.",
        "Rule 2: For a relative clause with 'which' or 'that', the antecedents will be the noun phrases preceding to 'which' or 'that'.",
        "On the other hand, noun phrases shown with 'either', 'this', 'both', 'these', 'the', and 'each' are considered as nominal anaphor candidates.",
        "Nominal anaphora recognition is approached by filtering those anaphor candidates, which have no referent antecedents or which have antecedents but not in the target biomedical semantic types.",
        "Following are two rules used to filter out those non-target nominal anaphors.",
        "Rule 1: Filter out those anaphor candidates if they are not tagged with one of the",
        "target UMLS semantic types (the same types in [2]) Rule 2: Filter out 'this' or 'the' + proper nouns with capital letters or numbers.",
        "Amino Acid, Peptide, or Protein",
        "protein, product, cerevisiae, endonuclease, kinase, antigen, receptor, synthase, reductase, arabidopsis",
        "bind, function, derive, raise, attenuate, abolish, present, signal, localize, release",
        "Gene or Genome",
        "gene, oncogenes",
        "activate, compare, locate, regulate, remain, transcribe, encode, distribute, indicate, occupy",
        "Anaphora Resolution for Biomedical Literature by Exploiting Multiple Resources 747",
        "We treated all other anaphors indicated with 'this' or 'the + singular-NP' as singular anaphors which have one antecedent only.",
        "Others are treated as plural nominal anaphors and their numbers of antecedents are shown in Table 2.",
        "At antecedent selection, we can discard those candidates whose numbers differ from the corresponding anaphors."
      ]
    },
    {
      "heading": "Table 2. Number of Antecedents",
      "text": []
    },
    {
      "heading": "2.4 Antecedent Selection 2.4.1 Salience Grading",
      "text": [
        "The antecedent selection is based on the salience grading as shown in Table 3 in which seven features, including syntactic and semantic information, are concerned."
      ]
    },
    {
      "heading": "Table 3. Salience grading for candidate antecedents",
      "text": [
        "Features Score",
        "The first feature F1 is recency which measures the distance between an anaphor and candidate antecedents in number of sentences.",
        "From the statistics of the two corpora, most of antecedents and their corresponding anaphors are within in two sentence distance, so a window size for finding antecedent candidates is set to be two sentences in the proposed system.",
        "The second feature F2 concerns the grammatical roles that an anaphor plays in a sentence.",
        "Since many anaphors are subjects or objects so antecedents with such grammatical tags are preferred.",
        "Furthermore, the antecedent candidates will receive more scores if they have grammatical roles (feature F3) or number agreement (feature F4) with their anaphors.",
        "Anaphor",
        "Antecedents #",
        "Either",
        "2",
        "Both",
        "2",
        "Each",
        "Many",
        "They, Their, Them, Themselves",
        "Many",
        "The +Number+ noun",
        "Number",
        "Those +Number+ noun",
        "Number",
        "These +Number+ noun",
        "Number",
        "recency",
        "F1",
        "0, if in two sentences away from anaphor",
        "1, if in one sentence away from anaphor",
        "2, if in same sentence as anaphor",
        "0-2",
        "F2",
        "Subject and Object Preference",
        "1",
        "F3",
        "Grammatical function agreement",
        "1",
        "F4",
        "Number Agreement",
        "1",
        "F5",
        "Semantic Longest Common Subsequence",
        "0 to 3",
        "F6",
        "Semantic Type Agreement",
        "-1 to +2",
        "F7",
        "Biomedical antecedent preference",
        "-2 if not or +2",
        "On the other hand, features 5, 6, and 7 are related to semantic association.",
        "Feature 5 concerns the fact that the anaphor and its antecedents are semantical variants of each other, so antecedents will receive different scores (as shown below) on the basis of their variation:",
        "If there is total match of the semantic lexicons between an antecedent's head word and its anaphor",
        "Then salience score = salience score + 3",
        "Else If any antecedent component, other than head word, is matched with its anaphor Then salience score = salience score + 2",
        "Else If any antecedent component is matched with its anaphor's hyponym by WordNet 2.0 Then salience score = salience score + 1",
        "Following are examples to show the cases:",
        "Example 2 case 1: total match:",
        "<anaphor: each inhibitor, antecedent: PAH alkyne metabolism-based inhibitor case 2: partial match:",
        "<Anaphor: both receptor types, antecedent: the ETB receptor antagonist BQ788> case 3: component match by using WordNet 2.0:",
        "<Anaphor: this protein (hyponym: growth factor), antecedent: Cleavage and polyadenylation specificity factor>",
        "If the antecedent can be found by UMLS, Then record its semantic types;",
        "Else If the antecedent contains the mined key lexicons of the anaphor's semantic type, then record the semantic type; Else mine the semantic type by web mining in such a way that searching PubMed by issuing {anaphor Ana, antecedent Ai } pair and applying Eq.",
        "3 to grade its semantic agreement for Ai.",
        "#of pages containing(Ana, At) # of pages containing(At ) Fig. 3.",
        "Procedure to find semantic types for antecedent candidates",
        "Anaphora Resolution for Biomedical Literature by Exploiting Multiple Resources 749",
        "Feature 6 is the semantic type agreement between anaphors and antecedents.",
        "As described in figure 3, the type finding for each antecedent can implemented with the help of UMLS.",
        "When there is no type information can be obtained from an antecedent, the type finding can be implemented with the help of PubMed, and the grading on such antecedent will be as Eq.",
        "3.",
        "Feature 7 is biomedical antecedent preference.",
        "That is an antecedent which can be tagged with UMLS or the key lexicons database will receive more score."
      ]
    },
    {
      "heading": "2.4.2 Antecedent Selection Strategies",
      "text": [
        "The noun phrases which precede a recognized anaphor in the range of two sentences will be treated as candidates and will be assigned with zero at initial state by the presented salience grader.",
        "Antecedents can be selected by the following strategies.",
        "(1) Best First: select antecedents with the highest salience score that is greater than a threshold",
        "(2) Nearest First: select the nearest antecedents whose salience value is greater than a given threshold",
        "For plural anaphors, their antecedents are selected as follows:",
        "(1) If the number of the antecedents is known, then select the same number of top-score antecedents.",
        "(2) If the number of antecedents is unknown, then select those antecedent candidates whose scores are greater than a threshold and whose grammatical patterns are the same as the top-score candidate."
      ]
    },
    {
      "heading": "2.5 Experiments and Analysis",
      "text": [
        "As mentioned in previous sections, a larger corpus was used for testing the proposed system.",
        "The corpus, denoted as '100-Medline', contains 100 MEDLINE abstracts including 43 abstracts (denoted as '43-Genia' in Table 6) randomly selected from GENIA 3.02p and another 57 abstracts (denoted as '57-PubMed' in Table 6) collected from the search results of PubMed (by issuing 'these proteins' and 'these receptors' in order to acquire more anaphor instances).",
        "There is no common abstract in the public MedStract and the new corpus.",
        "Table 4 shows the statistics of pronominal and nominal anaphors for each corpus."
      ]
    },
    {
      "heading": "Table 4. Statistics of anaphor and antecedent pairs",
      "text": [
        "The proposed approach was verified with experiments in two ways.",
        "One is to investigate the impact of the features which are concerned in the resolution.",
        "Another is to compare different resolution approaches.",
        "In order to boost our system, a simple generic algorithm is implemented to yield the best set of features by choosing best parents to produce offspring.",
        "Abstracts",
        "Sentences",
        "Pronominal instances",
        "Nominal instances",
        "Total",
        "MedStract",
        "32",
        "268",
        "26",
        "47",
        "73",
        "43-GENIA",
        "43",
        "479",
        "98",
        "63",
        "161",
        "57-PubMed",
        "57",
        "565",
        "69",
        "118",
        "187",
        "In the initial state, we chose features (10 chromosomes), and chose crossover feature to produce offspring randomly.",
        "We calculated mutations for each feature in each chromosome, and evaluated chromosome with maximal F-Score.",
        "Top 10 chromosomes were chosen for next generation and the algorithm terminated if two contiguous generations did not increase the F-score.",
        "The time complexity associated with such approach is O(MN) where M is the number of candidate antecedents, N is number of anaphors."
      ]
    },
    {
      "heading": "Table 5. F-Score of Medstract and 100-Medlines",
      "text": []
    },
    {
      "heading": "Table 6. Feature impact experiments",
      "text": [
        "Table 5 shows that anaphora resolution implemented with the genetic algorithm indeed achieves higher F-scores than the one when all features are concerned.",
        "Table 5 also shows that the semantic features play more important role than the syntactic features for nominal anaphora resolution.",
        "Similar results can be also found in Table 6 where the impact of each feature is justified.",
        "Moreover, Table 6 indicates that the pronominal anaphora resolution on 43-Genia is better than that on the other two corpora.",
        "It implies that the mined SA/AO patterns from GENIA 3.02p corpus are helpful for pronominal anaphora resolution.",
        "Moreover, Table 7 proves that the key lexicons mined from UMLS for semantic type finding indeed enhance anaphora resolution, yet a slight improvement is found with the usage of PubMed search results.",
        "One of the reasons is few unknown instances in our corpora.",
        "Medstract",
        "100-Medlines",
        "Nominal",
        "Pronominal",
        "Nominal",
        "Pronominal",
        "Total Features",
        "P",
        "R",
        "F",
        "P",
        "R",
        "F",
        "P",
        "R",
        "F",
        "P",
        "R",
        "F",
        "33/56",
        "33/47",
        "23/26",
        "23/26",
        "130/184",
        "130/178",
        "145/167",
        "145/167",
        "58.93",
        "70.21",
        "64.08",
        "88.46",
        "88.46",
        "88.46",
        "70.65",
        "73.34",
        "71.33",
        "86.82",
        "86.82",
        "86.82",
        "Genetic Features",
        "F5, F6, F7",
        "All-F5",
        "F5, F6, F7",
        "All-F5",
        "P",
        "R",
        "F",
        "P",
        "R",
        "F",
        "P",
        "R",
        "F",
        "P",
        "R",
        "F",
        "37/47",
        "37/47",
        "24/26",
        "24/26",
        "156/212",
        "156/178",
        "146/167",
        "146/167",
        "78.72",
        "78.72",
        "78.72",
        "92.31",
        "92.31",
        "92.31",
        "73.58",
        "87.64",
        "80.61",
        "87.43",
        "87.43",
        "87.43",
        "Medstract",
        "43-GENIA",
        "57-PubMed",
        "Nominal",
        "Pronominal",
        "Nominal",
        "Pronominal",
        "Nominal",
        "Pronominal",
        "All",
        "64.08%",
        "88.46%",
        "67.69%",
        "93.58%",
        "73.28%",
        "76.81%",
        "All - F1",
        "61.05%",
        "73.08%",
        "60.14%",
        "83.87%",
        "75.44%",
        "75.36%",
        "All - F2",
        "65.96%",
        "88.00%",
        "70.22%",
        "93.58%",
        "78.40%",
        "76.81%",
        "All - F3",
        "72.00%",
        "80.77%",
        "69.68%",
        "84.46%",
        "73.45%",
        "76.81%",
        "All - F4",
        "64.65%",
        "81.48%",
        "68.33%",
        "91.54%",
        "73.73%",
        "76.81%",
        "All - F5",
        "48.00%",
        "92.31%",
        "52.55%",
        "93.58%",
        "56.59%",
        "78.26%",
        "All - F6",
        "44.04%",
        "88.46%",
        "46.42%",
        "81.63%",
        "57.14%",
        "78.26%",
        "All - F7",
        "38.26%",
        "59.26%",
        "47.19%",
        "71.96%",
        "60.44%",
        "50.72%",
        "On the other hand, comparisons with evaluation corpus, Medstract, were shown in Table 8 where the best-first strategy yielded higher F-score than the results by the nearest-first strategy.",
        "It also shows that the best-first strategy with the best selection by genetic approach achieves higher F-scores than the approach presented in [2].",
        "Table 7.",
        "Impacts of the mined semantic lexicons and the use of PubMed __With semantic lexicons__w/o semantic lexicons_"
      ]
    },
    {
      "heading": "Table 8. Comparisons among different strategies on Medstract",
      "text": []
    },
    {
      "heading": "3 Conclusion",
      "text": [
        "In this paper, the resolution for pronominal and nominal anaphora in biomedical literature is addressed.",
        "The resolution is constructed with a salience grading on various kinds of syntactic and semantic features.",
        "Unlike previous researches, we exploit more resources, including both domain-specific and general thesaurus and corpus, to verify the semantic association between anaphors and their antecedents.",
        "Experimental results on different corpora prove that the semantic features provided with the help of the outer resources indeed can enhance anaphora resolution.",
        "Compared to other approaches, the presented best-first strategy with the genetic-algorithm based feature selection can achieve the best resolution on the same evaluation corpus.",
        "Best-First",
        "Nearest-First",
        "Castano et al.",
        "[2]",
        "F-score",
        "Nominal",
        "Pronominal",
        "Nominal",
        "Pronominal",
        "Nominal",
        "Pronominal",
        "Total Features",
        "64.08%",
        "88.46%",
        "50.49%",
        "73.47%",
        "Genetic Features",
        "F5, F6, F7",
        "All - F5",
        "F5, F6, F7",
        "All-(F2,F5)",
        "F4, F5, F6",
        "F4, F6, F7",
        "78.72%",
        "92.31%",
        "61.18%",
        "79.17%",
        "74.40%",
        "75.23%"
      ]
    }
  ]
}
