{
  "info": {
    "authors": [
      "Irene Pimenta Rodrigues",
      "Gabriel Lopes"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-1052",
    "title": "Temporal Structure of Discourse",
    "url": "https://aclweb.org/anthology/C92-1052",
    "year": 1992
  },
  "references": [
    "acl-J86-3001",
    "acl-J88-2003",
    "acl-J88-2004",
    "acl-J88-2006",
    "acl-J89-3002",
    "acl-P88-1009",
    "acl-P88-1012",
    "acl-P88-1014",
    "acl-P88-1020",
    "acl-P91-1008"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper discourse segments are defined and a method for discourse segmentation primarily based on abduction of temporal relations between segments is proposed.",
        "This method is precise and computationally feasible and is supported by previous work in the area of temporal anaphora resolution."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "B. Webber in [22] explains how discourse segmentation contributes to the interpretation of tense.",
        "In this paper we discuss how \"tense in-terpretation\" contributes to discourse segmentation.",
        "Following Webber's operational definition of segments [21] we present the data structures necessary for representing discourse segments and an algorithm to perform discourse segmentation.",
        "In order to build a discourse segment structure some clear criteria for grouping chunks of text into segments and for grouping these segments into other segments must be available.",
        "Our criterion is based on the maintenance of temporal coherence between segments.",
        "It relies on the abduction of temporal relations between segments that necessarily have temporal properties.",
        "Abduction of temporal relations between segments is a feasible and precise method for discourse segmentation.",
        "This is the leading criterion for segmentation and does not prevent us from using other criteria such as clue words, spatial relations and recognition of state elaboration.",
        "Current discourse structure theories use criteria such as rhetorical relations [9, 15, 13], intention recognition [7], narrative discontinuities [18], etc.",
        "All of them use a temporal criterion for segmentation embedded in less manageable criteria such as \"the increasing desire of ft to perform action N\"1.",
        "Our discourse segmentation is accomplished in order to enable us to address the following discourse phenomena:",
        "• Temporal anaphora - the interpretation of tense and aspect depends on the discourse structure [22].",
        "The maintenance of a \"Temporal Focus\" is suggested by some authors [11, 22, 18, 5] for tense interpretation.",
        "Based on their work our main concern is to provide the \"temporal",
        "focus\" for tense interpretation.",
        "In our segment structure the temporal focus is the set of visible segments.",
        "A pop in the temporal focus structure will imply the closing of one or more segments.",
        "• This and that anaphora - These pronouns may refer to discourse segments [21].",
        "With our segmentation we provide discourse segments for reference.",
        "• Pronominal and definite anaphora - the interpretation of pronouns and definite nominals depends on the attentional structure (Grosz and Sidner).",
        "The attentional structure depends on the discourse segmentation.",
        "With our approach to segmentation the attentional structure can be computed from our discourse structure – our visible segments provide visible entities and se-quents for these anaphors.",
        "• event reference – our approach provides a representation for eventualities, the discourse",
        "referents and the attentional structure necessary for solving this kind of anaphora.",
        "• temporal coherence - is achieved by inferring one of the possible temporal relations between two eventualities [14].",
        "Our segmentation process mainly controlled by abduction of temporal relations between eventualities enables us to check if a text is temporally coherent.",
        "Moreover as we propagate temporal constraints through discourse structure the number of even-'This work has been supported by JNICT, INIC and Gabinete de Filosofia do Conitecimento.",
        "Definition of the rhetorical relation motivation [14",
        "tualities that must be temporally related with a new eventuality increases.",
        "• temporal reliability – is achieved by the existence of a model for the temporal relations inferred.",
        "During discourse processing we build a temporal structure where all the temporal constraints can be checked.",
        "This structure is updated when a new temporal referent or a newly abducted temporal relation is added.",
        "Thus temporal reliability is granted.",
        "• discourse coherence – is difficult to check by",
        "using only our discourse structure.",
        "It requires more processing, namely the ability to find intentions for the segments.",
        "Tense interpretation contributes to segmentation by defining the temporal relation between the segment used as reference and the segment that represents the tensed sentence to be interpreted.",
        "Thus tense interpretation allows the choice of a segment by indicating where to attach the new sentence segment and greatly restricts the possible referents for anaphora resolution.",
        "A failure in satisfying structural constraints results in the choice of another segment referent.",
        "The temporal anchoring of eventualities assumes that there is some temporal representation for the eventualities.",
        "In this paper we use a representation for eventualities close to the event calculus[12], and a graph structure for time representation.",
        "Updating the discourse structure will be equivalent to updating a temporal data base.",
        "Discourse referents are existentially quantified variables that can be further constrained by the analysis of a new discourse sentence.",
        "In the following sections the temporal relations used in this paper are defined, followed by an explanation of our notion of segments, their properties and the algorithm for discourse segmentation.",
        "A detailed example will be worked out.",
        "Finally a conclusion and a comparison of our work with related work in this area is presented."
      ]
    },
    {
      "heading": "2 Temporal relations",
      "text": [
        "The semantic representation of an eventuality includes a time interval where the eventuality must be true so that the sentence and the discourse can be true.",
        "The time interval will be represented by two time points.",
        "Temporal relations between two time intervals can be expressed by relations between the extremes of the time intervals.",
        "So instead of using the 13 relations proposed by Allen [1] we have chosen to use just 5 relations.",
        "• t., < f., < t„_ this relation is like Allen's relation before or meth.",
        "• t„ > t„ a t”, < t,,, this relation is like Allen's relation after or met-by.",
        "• t„ C t,, a t„.",
        "< < - this relation is like Allen's relation IN.",
        "• t„ 3 t\" E t„.",
        "< t,,,,t,, < 4,1 - this relation is like Allen's relation ON.",
        "• 4, OC t„ 31 : t C t,,,t C 4,- this relation is like Allen's relation !.",
        "These 5 relations are enough for translating natural language sentences as it is difficult to express the 13 relations of Allen and their 21:3 combinations in natural language.",
        "F. van Eynde [6] presents the set of relations necessary for the temporal systems he studied (for EEC languages).",
        "Our relation set, however, is smaller.",
        "As sentence aspect coerces the verb aspectual class to change [16], v. Eynde's overlap relations may be rewritten using the relations < and >.",
        "The following examples will demonstrate our use of the temporal relations.",
        "For the sake of simplicity only discourse referents introduced by eventualities and time intervals are represented.",
        "Eventualities introduced by nominals (as in example I \"his key\") are discarded.",
        "I) John picked off his key(1).",
        "He opened the door(z).",
        "The eventualities of sentences (1) and (2) are: event(ei, pick(john, time(e1,4,); event(e2, open(john, doorl)), time(e2,t.,); the temporal relation is < t„.",
        "II) John bought an umbrella(1).",
        "He had lost his umbrella(2).",
        "The eventualities of sentences (1) and (2) are: event(el, buthohn,umb.W, time(e1,41); event(e2, loose(john,vmb2)), time(e24„); the temporal relation is t„ > t,,.",
        "III) John bought an umbrella (1).",
        "It was raining(2).",
        "The eventualities of sentence (1) and (2) are: event(el, boyClohn,umblp, time(ei,t„); event(e2, rain), time(e2,t)i the temporal relation is C t,,.",
        "IV) John had a nice meal(1).",
        "He ate salmon(2).",
        "The eventualities of sentence (1) and (2) are: event(ei, have(john,meal)), time(el,t„); event(e2, eat(john,salmon)), time(e2,42); the temporal relation is t„ V) It was raining(1).",
        "There was a strong wind(,).",
        "ACTES DE COLING-92, NAN1ES, 23-28 Ada 1992 3 3 2 Pam.",
        "OF COLING-92, NANTES, Am.",
        "23-28, 1992 The eventualities of sentence (1) and (2) are: event(ei, rain), time(eht,i); event(e2, wind_strong), time(e2,t.,); the temporal relation is t,, oc t„,.",
        "VI) John sat down on a chair(1).",
        "Mary lied down on a sofa(2).",
        "The eventualities of sentence (1) and (2) are: event(ei, sit(john, chair!",
        ")), time( e ); event(e2, tie(Marg,softl)), time(e2,i.2); the temporal relation is none t as these two eventualities are independent."
      ]
    },
    {
      "heading": "3 Discourse Segments",
      "text": [
        "A discourse segment is a discourse object.",
        "It is represented by a discourse referent that can be used for later reference.",
        "In contrast to other discourse theories, segments as dynamic structures that help to define context interpretations are considered as real discourse objects.",
        "Thus in our approach we use segments as objects with properties that will be defined later.",
        "A text is represented by a segment and a segment supplies context information for the semantic interpretation during discourse processing.",
        "Next segments will be defined as well as their construction and use in the semantic interpretation."
      ]
    },
    {
      "heading": "3.1 Kind of segments",
      "text": [
        "We distinguish two kinds of segments: basic and non-basic ones.",
        "A basic segment represents an eventuality plus some features, typically syntactic ones like tense and aspect (the leaves of fig. 1).",
        "A nonbasic segment has one or more subsegments (basic or not) obeying to a set of temporal constraints and a set of features.",
        "Every nonbasic segment has a sort depending on the temporal constraints it imposes on its subsegments.",
        "Segment features are necessary for discourse reasoning.",
        "Some of them may be dropped after a closing but others have to remain until the discourse is completely processed.",
        "The features we take into account in this paper are the following:",
        "• tense - The feature tense is needed for temporal anaphora resolution.",
        "• eventuality - The semantic representation of an eventuality is important for temporal anaphora resolution, for causal reasoning and other kinds of reasoning that depend on the kind of the eventuality.",
        "• eventuality time - This is the main issue in the definition of a segment as the abducted relation between eventuality times determines the segment structure's behavior.",
        "• discourse referents - for solving discourse reference.",
        "• subsegments - an ordered list containing all its subsegments."
      ]
    },
    {
      "heading": "3.2 Sorts of segments",
      "text": [
        "Depending on the abducted temporal relation between eventualities in a discourse, the eventualities are grouped into different sorts of segments.",
        "Using the above mentioned five temporal relations seven sorts of segments2 can be defined, e.g.",
        "1. basic - the minimal segment.",
        "2. none - this segment does not impose any restriction on the temporal relation of its subsegments.",
        "The discourse of example VI will be represented by this sort of segment.",
        "3. sequence - the subsegments in the list of segments are temporally ordered, e.g. ex I (fig.",
        "1.a).",
        "4. ib - contains only two subsegments with the first one temporally situated after the second one, e.g. ex II (fig.",
        "1.b).",
        "5. bk – has two subsegments with the first one temporally contained in the second one, e.g.ex III.",
        "6. dab - has two subsegments with the first one temporally containing the second one, e.g. ex IV.",
        "7. over - every segment in the list of subsegments must temporally intersect a nonempty time interval, e.g. ex V.",
        "For each sort of segment it must be defined how to compute its features representing properties from the features of its subsegments."
      ]
    },
    {
      "heading": "3.3 Properties of Segments",
      "text": [
        "Segments that can have a list of subsegments containing an unlimited number of segments are none, sequence and over.",
        "These segments can be augmented during discourse processing.",
        "The features of these segments are the following:",
        "• none - The feature eventuality contains the set of all subsegments' eventualities, while the",
        "feature time contains the set of all subsegments' times.",
        "The tense feature refers to the tense of the last subsegment.",
        "• sequence – the feature eventuality is the composition of all the segments' eventualities obtained by the seq operator.",
        "The time feature interval is the time interval [t,,, t„., ], where t, is the initial point of the first segment time interval and t,„ j, is the final point of the last segment time interval.",
        "The tense feature is the tense of the last segment (fig.",
        "1.a).",
        "This segment can be augmented by adding a new segment to the list of segments.",
        "In this case the features of the sequence segment have to be evaluated again.",
        "• over – the feature eventuality is unknown, the feature time is the time interval of the intersection of all time segments.",
        "The tense feature is the tense of its last subsegment.",
        "The segments that have two subsegments are lb, bk, and dab.",
        "These segments can only be augmented by the replacement of its second subsegment by a new one obeying the same set of constraints.",
        "The replaced segment is the first subsegment of the new one.",
        "These segments have the same features of the first subsegment (fig.",
        "1.b for a segment of sort jb)."
      ]
    },
    {
      "heading": "3.4 Discourse Segmentation",
      "text": [
        "Discourse segmentation will be done incrementally.",
        "A sentence will be represented by a segment.",
        "The processed discourse will be represented by a segment.",
        "The steps for the discourse segmentation are:",
        "1. to obtain the first sentence segment.",
        "This segment will be the discourse segment.",
        "2. to obtain the segment representing the next discourse sentence.",
        "3. to insert the new segment in the discourse segment.",
        "This step will have the following sub-steps: (a) To compute the set of visible segments (i.e. the right subsegments of the discourse segment) from the discourse segment.",
        "This set of segments can be ordered by some discourse preference rule, e.g. we may prefer to continue the current segment or prefer to continue the first opened segment and close the other ones'.",
        "(b) to choose one segment si from the set of visible segments.",
        "(c) to add the new sentence segment 62 to segment si by: • continuing the subsegment list of al if 82 can satisfy the constraints of 81.",
        "• substituting al by a new one 63.",
        "83 contains al as first subsegment and 82 as second subsegment in its subsegment list.",
        "The sort of segment /33 is one of the 6 nonbasic ones.",
        "(d) if it is not possible to add the new segment then choose another segment from the set of the",
        "visible ones, call it si and try again going back to step 3c.",
        "4. go back to step 2 if there are more sentences to process in the discourse."
      ]
    },
    {
      "heading": "3.5 Abduction of temporal relations",
      "text": [
        "The main process in discourse segmentation is to check for temporal relations between segments because this is the only criterion used for segmentation.",
        "For deciding how to link segment s2 given segment al, do:",
        "1. find the referent for 82.",
        "• if 81 is going to be continued by 62, then the referent will be the last subsegment in the subsegment list of segment al.",
        "• if si is going to be substituted by a new segment 83 then the referent will be si.",
        "'The way segments are ordered will have consequences on the discourse segmentation.",
        "In cases where there are more then one possible segmentation preference will be given to the first one.",
        "2.",
        "After obtaining a referent, abduct the temporal relation between 83 and the referent.",
        "3.",
        "After getting the relation between 82 and the referent, do: • if si is to be continued by s2 then check if s2 satisfies the set of constraints of 81.",
        "If so, update the 81 features if needed and repeat the procedure (update features in the parent node and check constraints) until the root segment or a node segment whose features don't need to be updated is reached.",
        "If this process terminates successfully then 82 can continue 81.",
        "• if s2 is to be replaced by a new segment 83 then compute the features of segment 83 and check if the set of temporal constraints of the old parent of segment s1 is satisfied.",
        "If so, update the old parent si features if needed and repeat the procedure (update features in the parent node and check constraints) until the root or a node segment whose features don't need to be updated is reached.",
        "If this process ends successfully then 83 can replace si.",
        "Whenever a temporal entity in the form of a discourse referent is added to the discourse structure, the structure containing all temporal discourse referents as well as their temporal constraints should be updated (fig.",
        "4 for ex.",
        "of sec. 4).",
        "This way we can distinguish relations that are implied by the temporal system from those inferred using other knowledge sources.",
        "e.g. the constraints tr < 6,13 < t2 do not imply 11 < t3, but satisfy it.",
        "In order to check for temporal constraints we do not only deal with constraints over temporal intervals but use also world knowledge for abducting relations between eventualities that imply some temporal relation between them.",
        "In order to abduct a temporal relation it is not enough to block inconsistencies in the tempo.",
        "ral system.",
        "There should also be some kind of justification, like:",
        "• temporal – if the temporal system implies relation t,,@t,, there is a justification to abduct ta,@t,,, with being a temporal relation.",
        "• causal – if el can cause e2 then there is a justification to abduct t,, < t„.",
        "• contingent – Assuming an event ontology like that of Moens and Steedman [17] where eventualities have a tripartite structure with a preparatory phase, a culmination and a consequence state there are clauses stating what are the eventualities of the preparatory phase and those of the consequence state of an eventuality.",
        "– if et can be in the preparatory phase of e2 there is a justification to abduct C 1,,.",
        "– if el can be in the consequence state of e2 there is a justification to abduct t,, >1,,.",
        "• particular shared knowledge about eventualities – having a temporal knowledge base concerning eventualities, general rules for eventualities can be stated, e.g. John usually drinks a cup of coffee before he catches the bus.",
        "– if e2 usually happens @ el with being a temporal relation, then there exists justification to assume t„01,,.",
        "• Linguistic - verb tense and aspectual perspective (AP) are the linguistic features5 that contribute to the temporal anchorage of eventualities.",
        "There are rules that justify a temporal",
        "relation taking into account these features and the order of the sentences.",
        "They should be used as default rules, i.e. if it can not be found another justification for a temporal anchoring then a linguistic justification should be used.",
        "The following rules are used in the detailed example.",
        "– if tense of eland of e2 is simple past (SP) with perfective AP then there is justification for assuming t,, < t,,.",
        "– if tense of el is SP with perfective AP and tense of e2 is SP with imperfective AP there exists justification to assume 1,, C t,,.",
        "If a justification for the abduction of a particular temporal relation is not a logical consequence of the knowledge base then the justification should be added to the set of conditions.",
        "e.g. if we abduct in the discourse \"John fell from the balcony.",
        "Mary pushed him.\" that John fell because Mary had pushed him, we should add the clause \"cause(el, e3)\" in order to block the future inference that Mary was innocent in John's fall.",
        "In this example another interpretation, linguistically justified, could be 4/.11 < tapuaA a'"
      ]
    },
    {
      "heading": "4 Detailed Example",
      "text": [
        "Consider the following discourse represented by the segment in fig. 3.",
        "after processing sentence 81.",
        "The only way to incorporate the sentence 82's segment is by replacing the current discourse structure by a new one (basic segments cannot be continued).",
        "81 is the reference to anchor 82, the eventuality of 82 is a state, so the relation t,, C t„ is abducted and the new segment is of sort bk (fig.",
        "2.b).",
        "To insert sa there are two visible segments: 82 and 6k.",
        "Segment 6k is the reference for 83 because the eventuality of segment 82 is a state with an imperfective aspectual perspective and there is no general knowledge about the eventualities of 82 and 83 allowing us to abduct a temporal relation between them.",
        "The features of the bk segment are the same as those of 81, so the abducted relation between those segments is t,, < t,,, so that the discourse structure is replaced by a new segment of sort sequence (fig.",
        "2.c).",
        "To insert segment 84 there are two visible segments, namely 83 and sequence.",
        "Using 53 as reference, no temporal relation can be abducted.",
        "Thus none is abducted using some general rule saying \"eventualities to give and to offer are of to backtrack to that choice point.",
        "the same kind and if the subjects and objects are different and the recipient is the same it is not possible to abduct a temporal relation between them\".",
        "So the segment 83 is replaced by a new segment of sort none (fig.",
        "2.d) after the check to see if it is possible to abduct the relation t,„ < f,, in order to satisfy the constraints of the sequence segment.",
        "The time of segment 85 is partially anchored in the time interval \"yesterday\" but it still must be anchored to a reference.",
        "Visible segments are s4, none and sequence.",
        "Considering that the abducted relation between s4 and s5 is t,, < t„, and between 53 and 4 is t„ < t„ it is not possible to use 84 as referent because the constraints of segment none were not satisfied.",
        "So the sequence segment is the only one left and it can be continued by 85 (fig.",
        "2.e) because its constraints are satisfied, thus t„ < t„,t,, < t,, are abducted.",
        "In order to insert 88, the visible segments are 85 and sequence.",
        "Using 85 as referent, the relation t„ C I„ is abducted because stop breathing is in the preparatory phase of dying.",
        "Segment 85 is replaced by a new segment of sort elab (fig.",
        "2.f).",
        "In order to insert segment s7, segment se is replaced by a new sequence segment because the relation t,„ < t„ is abducted (becoming blue is in the consequence state of stop breathing) and t„ C t„ is abducted (becoming blue is in the preparatory phase of dying) (fig.",
        "2.g).",
        "The insertion of 88 leads to the final structure (fig.",
        "3).",
        "s8 cannot use 87 as reference because the relation C cannot be abducted.",
        "After processing the discourse, the temporal discourse referents and their relations reflect the structure of fig. 4, containing all the temporal relations that can be inferred from the text without making unjustified abductions."
      ]
    },
    {
      "heading": "5 Conclusions",
      "text": [
        "Our segmentation method using abduction of temporal relations between eventualities as a ACTES 1)5 COLING-92, Morro, 23-28 min' 1992 3 3 6 PROC.",
        "OF COLING-92, NAMES, Auo.",
        "23-28, 1992 leading criterion for segmentations has advantages over other currently used segmentation techniques.",
        "It uses a criterion whose precision and feasibility is supported by previous work in the area of temporal anaphora resolution [19, 22, 18, 16, 4].",
        "Our discourse segmentation provides the information necessary for tense interpretation (as required in [22]), and for constraining further segmentation.",
        "Although Webber's temporal focus structure depends on the linguistic discourse structure [7], she doesn't explain how tense interpretation contributes to the further development of the linguistic structure.",
        "Other work tackling the interpretation of tense and aspect [19, 18, 13, 4, 2, 16, 3] does not intend to build up a discourse structure in the Grosz and Sidner's [7] sense.",
        "In [13] rhetorical relations between some eventualities are build up, not discourse segments.",
        "Work in discourse segmentation based on plan recognition [20] does not provide the necessary information for tense interpretation either.",
        "Our structure intends to provide the context necessary for the interpretation of different kinds of anaphora.",
        "Our approach enables us to compute both, the temporal relations explicitly expressed in the discourse and those implied by the temporal structure of the discourse.",
        "The temporal coherence can be evaluated by looking at the final discourse structure, e.g. if a discourse is represented by a segment of sort none, no temporal relations between the eventualities described can be obtained and thus the discourse is not temporally coherent.",
        "Our approach does not prevent us from using complementary criteria for the further segmentation of discourse, namely from using other criteria such as clue words, spatial relations, and recognition of state elaboration."
      ]
    }
  ]
}
