{
  "info": {
    "authors": [
      "Steven Bird"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-1015",
    "title": "Finite-State Phonology in HPSG",
    "url": "https://aclweb.org/anthology/C92-1015",
    "year": 1992
  },
  "references": [
    "acl-E87-1002"
  ],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "Attention on constraint-based grammar formalisms such as Head-driven Phrase Structure Grammar (liPsG) has focussed on syntax and semantics to the exclusion of phonology.",
        "This paper investigates the incorporation of a non-procedural theory of phonology into HPSG, based on the 'one-level' model of Bird & Ellison (1992).",
        "The standard rule-representation distinction is replaced by the description-object distinction which is more germane in the context of constraint-based grammar.",
        "Prosodic domains, which limit the applicability of phonological constraints, are expressed in a prosodic type hierarchy modelled on imso's lexical type hierarchy.",
        "Interactions between phonology and morphology and between phonology and syntax are discussed and exemplified'."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The exclusion of phonology from Head-driven Phrase Structure Grammar (Pollard & Sag, 1987) and related grammar frameworks belonging to the Montague tradition (Dowty et al., 1981; Shieber, 1986) is no doubt due to the perception that much current theorising in phonology is excessively procedural in nature.",
        "While there is an element of truth in this, it is also true that the predilection of constraint-based grammarians for a string-based phonology has predisposed them towards segmental phonology, in which procedural thinking is at its peak.",
        "Other varieties of phonology – most notably non-linear phonology (Goldsmith, 1976, et seq.",
        ") – have now largely abandoned complex derivational accounts of phonological well-formedness in favour of systems of generalised constraints.",
        "A defining property of constraints is that they are not applied in any particular order.",
        "Rice (1989, 331) writes that \"a general goal",
        "in recent phonological work has been the elimination of structure-changing processes from the grammar.\" With structure-changing process gone, all that constraints do is specify what it means for surface forms to be well-formed2.",
        "A consequence of this paradigm shift in phonology is that the main barrier to the incorporation of phonology into constraint-based grammar frameworks has now disappeared.",
        "In trying to assess the consequences of this programme for phonology itself, it would be instructive to identify four major ideas or principles that have characterised work in the Montague tradition, out of which constraint-based grammar formalisms have grown.",
        "The first is THE PRINCIPLE.",
        "OF COMPOSITION-Aunt, which requires that the form and interpretation of an expression be a function of the form and interpretation of its parts.",
        "This principle motivated Bach's well-known RULE-TO-RULE HYPOTHESIS, requiring that the linguistic modules (such as syntax, semantics and phonology) be organised in parallel rather than in series, where the output of one module is the input of the next.",
        "The second principle is Partee's (1979, 276) WELL-FORMEDNESS CONSTRAINT, which states that well-formed expressions are built up out of well-formed parts.",
        "An immediate consequence of this is that there can be no phonological 'repair strategies' which operate on ill-formed structures.",
        "A third principle goes by the linked terms INTENSION-ALITY and PARTIALITY.",
        "The idea here is that there is a distinction to be drawn between linguistic descriptions and the objects they describe (such as pieces of speech).",
        "Descriptions can only ever be partial, in the sense that they pick out – or DENOTE – classes of objects rather than individual objects.",
        "For example, in a given language, [+voice] denotes a class of speech sounds, [+nasal( denotes another class, and [+voice,-i-nasal] denotes the intersection of these two",
        "classes.",
        "Refining a description results in a smaller class of denoted objects3.",
        "The final principle is THE LEXICALIST HYPOTHESIS as expounded in its strong form by Bresnan and others, which has lead to the lexicalisation of linguistic information and the corresponding simplification of phrase structure rules.",
        "From these themes conic such requirements that there be no extrinsic rule ordering, no 'feature-changing', no intermediate levels of representation, and so on; all of them principles that many phonologists have independently come to embrace.",
        "The ultimate implications of this perspective for phonology is the removal of the rule-representation distinction in favour of the description-object distinction.",
        "Grammar formalisms like IIPSG also lack the rule-representation distinction.",
        "For example, ( 1 a) is described by Pollard & Sag (1987, 149) as a rule.",
        "However, they also provide an equivalent statement of the rule in the more conventional 'rewrite' notation (lb).",
        "In this paper a constraint-based phonological framework is presented.",
        "It is shown how various interactions between phonology and the other modules of grammar can be studied within the context of [IPSO.",
        "Section 2 presents the finite-state model of phonology advanced by Bird & Ellison (1992).",
        "This is followed by a section on a phonology-morphology interaction (nasalisation in Teresna) and a section on a phonology-syntax interaction (complex NI' shift).",
        "The paper concludes with a discussion of the shortcomings and future prospects of this work."
      ]
    },
    {
      "heading": "2 Finite-State Phonology",
      "text": [
        "Over the last decade much has been written on the application of finite-state transducers (I;STs) to phonol",
        "ogy, centering on the TWO-LEVEL MODEL, of Kosken-niemi (1983).",
        "Antworth (1990) gives a comprehensive introduction to the field.",
        "The two-level formalism is an attractive computational model for 1960's generative phonology.",
        "However, as has already been noted, phonologists have since moved away from complex string rewriting systems to a range of so-called nonlinear models of phonology.",
        "The central innovation of this more recent work is the idea that phonological representations arc not strings of characters but collections of strings, synchronised like an orchestral score.",
        "There have been some notable recent attempts to rescue the PST model from its linearity in order to encompass nonlinear phonology (Kay, 1987; Komai, 1991).",
        "However, if a fundamental shift in perspective in phonology has indeed occurred, then these refinements to the EST model do not go far enough.",
        "We require a further restriction that a transducer can only add information: the set of symbols accepted on a particular cell of the 'surface' tape must be a subset of the set accepted on the corresponding cell of the 'lexical' tape.",
        "An EST so constrained is actually nothing more than a finite-state automaton (rsA).",
        "Consequently, Mks would now seem to be more appropriate than Fta's for doing phonology, so long as it is possible to come up with some way of encoding nonlinear phonology using FsAs.",
        "In fact, this has been done by Bird & Ellison (1992), who have shown how autosegmental TIERS, ASSOCIATIONS and RULES can be encompassed by fsAs.",
        "The central idea is that each tier is a partial description of a string, and tiers are put together using the intersection operation (n) defined on PSAs.",
        "Apart from being truer to current phonological theorizing, this one-level model has a second important advantage over the two-level model.",
        "Since the set of IlSA8 RIMS a boolean lattice under intersection, union and complement, we can safely conjoin ('unify'), disjoin and negate phonological descriptions.",
        "Such a framework is obviously compatible with constraint-based grammar formalisms.",
        "As it happens, the current usage of phonology in IIPSO is just a simple form of finite-state phonology of the kind elaborated here.",
        "As our first example, consider the phenomenon of homorganic nasal assimilation, whereby nasals agree in place-of-articulation with the following consonant.",
        "Thus, the sequences [nib] and Ind' arc allowed while [md] and [rib] are ruled out.",
        "1,et N= {m,n}, S = {b,d}, L {m,b} and A = {n,d}.",
        "The required constraint can be expressed as the following regular expression,",
        "where '.'",
        "stands for any character and is the Klecnc star."
      ]
    },
    {
      "heading": ".*(NS LL Li AA ).*",
      "text": [
        "This states that it is not possible to find anywhere a nasal-stop cluster (NS) which is not made up of two labials (LL) or two alveolars (AA).",
        "We can simplify the above expression as follows:",
        "Before proceeding further with this example, it is necessary to define a PROSODIC TYPE IIIERARCIIY.",
        "This is a subsumption network akin to the lexical hierarchy of HPSG (Pollard & Sag, 1987, 191ff).",
        "Figure I displays a simple prosodic hierarchy.",
        "Each of the prosodic types denotes a set of phonetic objects (1 denotes the empty set).",
        "Since our descriptions arc expressed using regular expressions, it is useful to imagine regular expressions (or automata) as inhabiting the nodes of the prosodic hierarchy.",
        "In English, nasal assimilation does not occur across phrase boundaries and so the automaton given above must only constrain those stretches of segments that are phrases.",
        "This localisation of the phonological constraint could be expressed as follows: The top element in Figure 1, namely phon-domain, denotes the space of utterances.",
        "Phonological constraints like (3) serve to restrict this space, leaving just those utterances that are acceptable in the language.",
        "The phonological specification in any sign (including a lexical sign) is a member of this hierarchy.",
        "In some languages we may require there to be a special kind of interaction between the lexical and the prosodic hierarchy.",
        "For example, Archangeli & 'The hierarchy could be enriched with more types corresponding to languages, dialects, speakers and registers.",
        "For example, certain phonological constraints apply to whole groups of languages (Calder & Bird, 1991).",
        "Pulleyblank (1989) discuss the tongue root harmony of Yoruba which is restricted to nouns.",
        "If air was the type of harmonic utterances, then we could express the necessary constraint thus\": arr.",
        "This kind of constraint is known as a morpheme structure constraint, and phonologists have frequently needed to have recourse to these (Kenstowicz & Kisscberth, 1979, 424ff).",
        "A more recent example of the interaction between prosody and morphology is the field of prosodic morphology (McCarthy & Prince, 1990).",
        "A final question remains about prosodic constituency.",
        "Suppose we wanted to state that a phrase consisted of one or more feet.",
        "We could do this using a notation we have already seen, as follows: However, in situations like this where it is easy to write a regular expression, we will simply write: The category of first person is marked by a prosody of nasalisation on both nouns and verbs, as the data in Table 1 illustrates.",
        "e'tno?u his word d'm6211 my word 'ayo his brother '46 my brother 'owoku his house '6-W6ligti my house 'piho he went 'bill° I went a' qa?a,fo he desires ii.",
        "'\"3a?afo I desire The segments of the words in the right column are all nasalised until the first obstruent (other than 7) or the end of the word.",
        "The obstruent is prenasalised and voiced, hut we can ignore the voicing as it is not contrastive in the language.",
        "Art analysis of this data in the computational framework outlined above might proceed as follows.",
        "First, suppose that there is a distinctive feature of nasality which can mark all segments.",
        "It serves to create the following distinction': > • foot phrase phrase foot+ where is the Kleene plus.",
        "Note that there is a subtle difference of interpretation between this notation and a clause of a regular grammar.",
        "If we write t qt and t •=- where t is a type and where q and ?I, are regular expressions, then both tit and f' inhabit the t node of the prosodic type hierarchy.",
        "We could have written equivalently n 0.",
        "In contrast to this, if t O and t d' are clauses of a regular grammar, t could be rewritten as either .s or s', i.e. O LI11).",
        "Now we progress to a more detailed example to illustrate the framework."
      ]
    },
    {
      "heading": "3 Phonology and Morphology",
      "text": [
        "Terena is an Arawakan language spoken in Brazil, described by Bendor-Stunuel (1970).",
        "It has the Ml-lowing segment inventory:",
        "vowels: i, c, a, o, u 'Here I assume that prosodic types are actually properties of whole signs rather than just the phonology attribute.",
        "Acres Dii COLINO-92, NAtTrits, 23-28 noirr 1992",
        "I shall employ capital letters to denote each pair (e.g. P = (p, S = {s, \"z} and so on).",
        "Suppose that N denotes the class of nasalised segments and 0 denotes the class of obstruents (except for 7).",
        "Here is the feature structure for the first person morpheme.",
        "The phonology attribute is of most interest here.",
        "It specifies that there is a (possibly empty) sequence of nasal non-obstnients, followed optionally by a nasal",
        "obstruent and a sequence of non-nasals.",
        "Notice that with this simple regular expression the notions of autosegmental SPREADING and BLOCKING are captured.",
        "This approach will therefore generalise to such phenomena as vowel harmony.",
        "Here then is part of the lexical entry for the noun house."
      ]
    },
    {
      "heading": "PHON OWOKU SEMICONTEI IINDIRESTIRELN HOUSE.",
      "text": [
        "Combining these two feature structures produces the following result: Os7vOugu HEADIMAJ Nj SUBCAT 0 VARIPF.RS 1st RESTIRELN HOUSE"
      ]
    },
    {
      "heading": "4 Phonology and Syntax",
      "text": [
        "It has frequently been observed that there is a prosodic constraint involved in the following data (based on Culicover (1976, 156)):",
        "(4) a. Mary [called [John] [an elephant]] b.",
        "*Mary [called [an elephant] [John]] c. Mary [called [the man who stepped on her foot] [an elephant]] d. Mary [called [an elephant] [the man who stepped on her foot]]",
        "In generative syntax this is called complex (or 'heavy') NP shift, since it involves the movement of a direct object NP past another complement or adjunct, and this movement is only possible if the phrase being moved is sufficiently large.",
        "Recall that Pollard and Sag's grammar for English has two linear precedence constraints.",
        "The first (LP1) states in effect that heads precede complements.",
        "The second (LP2) states that the ordering of complements respects the obliqueness hierarchy.",
        "LP2 is repeated below; the symbol <' is the obliqueness ordering carried over into phonology (Pollard & Sag, 1987, 174).",
        "Complements must precede more oblique phrasal complements.",
        "Pollard & Sag (1987, 178) analyze complex NP shift, claiming that the 'moved' constituent is focussed and that focussed constituents can violate LP2.",
        "They further claim that it is not possible to 'shift' the constituent past an NP sister.",
        "This leads to the constraint [NtAr –N] < [focus +], which must be disjoined with the original LP2 as shown in (6), a technique due to Uszkoreit (1986).",
        "(6) COMPL < COMPL[LEX – 1 V [MM – N] < [FOCUS +]",
        "This constraint conforms to more general observations that focussed material tends to appear sentence finally (Halliday, 1967).",
        "However, observe that in (4d), the 'shifted-over' constituent is in fact an NP, contrary to the [MA) –N] requirement of (6)8.",
        "The LP constraint must be revised as follows.",
        "Unfocussed complements must precede more oblique phrasal complements.",
        "Focus is clearly not the only factor involved in complex NP shift.",
        "Sentence (4b) is bad regardless of whether or not john is focussed.",
        "An interesting attempt to unravel the prosodic contribution to this phenomenon has been made by Zec & Inkelas (1990, 376-7).",
        "According to them, a prosodic constituent is said to be HEAVY just in case it branches.",
        "This is familiar in the case of syllables: a heavy syllable is one having two (or more) moras, while a light syllable only has one (Hyman, 1984).",
        "Rather then presenting the details of their analysis, I shall present a liberal adaptation of it that is more suited to the phonological framework assumed here.",
        "Suppose that an intonational phrase consists of a sequence of stress feet9, feet consist of syllables and syllables consist of segments.",
        "Using the notation described in section 2, we could write: \"Culicover (1976, 155-6) gives more examples to support this claim.",
        "Other verbs allowing movement past an NP are the 1.",
        ")1 verbs of (Quirk et al., 1972,850).",
        "Dative verbs do not permit complex NP shift.",
        "'Whether there is intervening material between the phrase and the foot is immaterial to the present discussion.",
        "syl kat step 1.1 fut U 3a LI • • To this we add some further constraints.",
        "First, heavy phrases (phraseh) must contain two or more feet.",
        "Second, feet consist of exactly one heavy syllable, while all other syllables must be light.",
        "Third, the vowel of a light syllable must be a schwa.",
        "phrase, foot foot+ foot syl, syl,, syl7",
        "Although these specifications are admittedly rather crude, they are sufficient for present purposes.",
        "The next step is to set up an abbreviation to enable heavy and light phrases to be picked nut easily.",
        "Now we can formulate an ordering principle that accounts for the observed behaviour.",
        "This is done by modifying LP2.",
        "Light complements must precede more oblique phrasal complements.",
        "Clearly, a combination of (7) and (8) is needed if Pollard and Sag's observations are to be linked with those of Zec and Inkelas.",
        "However, such a refinement would still be inadequate.",
        "The acceptability of shifting of an NP actually gets worse as the size of the material between the verb and the NP gets larger.",
        "Thus the relative weight of the complements is important.",
        "It is apparent that the spectrum of relative weights interacts with the obliqueness ordering in a gradient manner that cannot be adequately dealt with in the polarised fashion of linear precedence constraints."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "In the course of this paper I have presented a phonological framework and shown how it might be interfaced with IIPSG.",
        "The framework starts where I IPSO left off, in the sense that iII'SG's phonology attri butc-a list--can be viewed as a subclass of automata.",
        "The framework is potentially far-reaching in the sense that it encompasses non-linear phonology (Bird & Ellison, 1992).",
        "Although this work is preliminary, it is already clear how several standard phonological devices may be recast in this new framework.",
        "For example, the traditional distinction between mor-phophonology and phonology proper and the distinction between lexical and post-lexical phonology can be modelled in terms of the distinction between lexical and prosodic hierarchies.",
        "The traditional prosodic domains (phrase, foot, syllable) are recast as types, and domain-bounded processes are regular expressions tied to the required prosodic type.",
        "One area of morphophonology that has not been touched on here is the situation where the selection of an allomorph is sensitive to the phonological context.",
        "A well-known example of this is the a=an alternation in English.",
        "One solution would be to represent contextual information as part of the phonology attribute of a sign by associating prosodic types with final states.",
        "When this morpheme is concatenated with a following noun, these prosodic types must be brought to bear on the following material.",
        "Another area for further work is to investigate interactions between phonology and semantics.",
        "For example, it is often observed that there is a close correspondence between intonational phrases and a particular semantic cluster called a sense unit, whereby any stretch of material that corresponds to an intonational phrase must also qualify as a sense unit (Bird, 1991b).",
        "Previous accounts of this phenomenon have required the mediation of a syntactic module and this has lead to an extra level of complexity (e.g. Selkirk (1984, 290-296)).",
        "Now there is the exciting prospect of being able to explore phonology-semantics interactions directly.",
        "For example, given suitable definitions, we could simply write: PHRASE SENSE-UNIT.",
        "It is hoped that further work in this vein will lead to a nonlinear model of phonology that is fully integrated into constraint-based grammar formalisms.",
        "This will open the way for applications of such frameworks to a much wider range of the world's languages."
      ]
    }
  ]
}
