{
  "info": {
    "authors": [
      "Uri Zernik"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-4212",
    "title": "Closed Yesterday and Closed Minds: Asking the Right Questions of the Corpus to Distinguish Thematic from Sentential Relations",
    "url": "https://aclweb.org/anthology/C92-4212",
    "year": 1992
  },
  "references": [
    "acl-C90-1005",
    "acl-H89-2012",
    "acl-P91-1017"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Collocation-based tagging and bracketing pro-grarns have attained promising results.",
        "Yet, they have not arrived at the stage where they could be used as preprocessors for full-fledged parsing.",
        "Accuracy is still not high enough.",
        "To improve accuracy, it is necessary to investigate the points where statistical data is being misinterpreted, leading to incorrect results.",
        "In this paper we investigate inaccuracy which is injected when a preprocessor relies solely on collocations and blurs the distinction between two separate relations: thematic relations and sentential relations.",
        "Thematic relations are word pairs, not necessarily adjacent, (e.g., adjourn a meeting) that encode information at the concept level.",
        "Sentential relations, on the other hand, concern adjacent word pairs that form a noun group.",
        "E.g., preferred stock is a noun group that must be identified as such at the syntactic level.",
        "Blurring the difference between these two phenomena contributes to errors in tagging of pairs such as expressed concerns, a verb-noun construct, as opposed to preferred stocks, an adjective-noun construct.",
        "Although both relations are manifested in the corpus as high mutual-information collocations, they possess different properties and they need to be separated.",
        "In our method, we distinguish between these two cases by asking additional questions of the corpus.",
        "By definition, thematic relations take on further variations in the corpus.",
        "Expressed concerns (a thematic relation) takes concerns expressed, expressing concerns, express his concerns etc.",
        "On the other hand, preferred stock (a sentential relation) does not take any such syntactic variations.",
        "We show how this method impacts preprocessing and parsing, and we provide ernpirical results based on the analysis of an 80- million word corpus.",
        "1 2"
      ]
    },
    {
      "heading": "Pre-Processing: The Greater Picture",
      "text": [
        "Sentences in a typical newspaper story include idioms, ellipses, and ungrammatic constructs.",
        "Since authentic language defies textbook grammar, we must rethink our basic pars-This research was sponsored (in part) by the Defense Advanced Research Project Agency (DOD) and other government agencies.",
        "The views and conclusions contained in this document are those of the authors and should not be interpreted as representing the official policies, either expressed or implied, of the Defense Advanced Research Project Agency or the US Government.",
        "2We thank ACL/DCI (Data Collection Initiative), the Collins publishing company, and the Wall Street Journal, for providing invaluable on-line data.",
        "ing paradigm and tune it to the nature of the text under analysis.",
        "Hypothetically, parsing could be performed by one huge unification mechanism [Kay, 1985; Shieber, 1986; Tomita, 1986] which would process sentences at any level of complexity.",
        "Such a mechanism would recieve its tokens in the form of words, characters, or morphemes, negotiate all given constraints, and produce a full chart with all possible interpretations.",
        "However, when tested on a real corpus, (i.e., Wall Street Journal (WSJ) news stories), this mechanism fares poorly.",
        "For one thing, a typical well-behaved 34-word sentence produces hundreds of candidate interpretations.",
        "In effect the parsing burden is passed onto a post processor whose task is to select the appropriate parse tree within the entire forest.",
        "For another, ill-behaved sentences – roughly one out of three WSJ sentences is problematic – yield no consistent interpretation whatsoever due to parsing failures.",
        "To alleviate problems associated with rough edges in real text, a new strategy has emerged, involving text preprocessing.",
        "A pre-processor, capitalizing on statistical data [Church ei al., 1989; Zernik and Jacobs, 1990; Dagan et al., 1991], and customized to the corpus itself, could abstract idiosyncracies, highlight regularities, and, in general, feed digested text into the unification parser.",
        "What is Pre-Processing Up"
      ]
    },
    {
      "heading": "Against?",
      "text": []
    },
    {
      "heading": "The Linguistic Phenomenon",
      "text": [
        "Consider (Figure 1) a WSJ (August 19, 1987) paragraph processed by NLpc (NL corpus processing) [Zernik el al., 1991].",
        "Two types of linguistic constructs must be resolved by the preprocessor:"
      ]
    },
    {
      "heading": "Class A preferred/AJ stock/NN *comma*",
      "text": []
    },
    {
      "heading": "and expressed/VS concern/NN about",
      "text": [
        "How can a program determine that preferred stock is an adjective-noun, while expressed concern is a verb-noun construct?"
      ]
    },
    {
      "heading": "The Input",
      "text": [
        "The scope of the preprocessing task is best illustrated by the input to the preprocessor shown in Figure 2.",
        "This lexical analysis of the sentence is based on the Collins on-line dictionary (about 49,000 lexical entries extracted by NLpc) plus morphology.",
        "Each word is associated with candidates part of speech, and almost all words are ambiguous.",
        "The tagger's task is to resolve the ambiguity.",
        "For example, ambiguous words such as services, preferred, and expressed, should be tagged as noun (nn), adjective (aj), and verb (vb), respectively.",
        "While some pairs (e.g., annual meeting) can be resolved easily, other pairs",
        "(e.g., preferred stock and expressed concerns) are more difficult, and require statistical training.",
        "Part-Of-Speech Resolution The program can bring to bear 3 types of clues: Local context: Consider the following 2 cases where local context dominates:",
        "1. the preferred stock raised 2. he expressed concern about",
        "The words the and he dictate that preferred and expressed are adjective and verb respectively.",
        "This kind of inference, due to its local nature, is captured and propagated by the preprocessor.",
        "Global context: Global-sentence constraints are shown by the following two examples:",
        "1. and preferred stock sold yesterday 2. and expressed concern about ...*period*",
        "In case 1, a main verb is found (i.e., was), and preferred is taken as an adjective; in case 2, a main verb is not found, and therefore expressed itself is taken as the main verb.",
        "This kind of ambiguity requires full-fledged unification, and it is not handled by the preprocessor.",
        "Fortunately, only a small percent of the cases (in newspaper stories) depend on global reading.",
        "Corpus-based preference: Corpus analysis (WSJ, 80-million words) provides word-association preference [Beckwith et al., 1991] collocation total vb-nn aj-nn preferred stock 2314 100 0 expressed concern 318 1 99 The construct expressed concern, which appears 318 times in the corpus, is 99% a verb-noun construct; on the other hand, preferred stock, which appears in the corpus 2314 times, is 99% an adjective-noun construct.3"
      ]
    },
    {
      "heading": "Where Is The Evidence?",
      "text": [
        "The last item, however, is not directly available.",
        "Since the corpus is not a-priori tagged, there is no direct evidence regarding part-of-speech.",
        "All we get from the corpus are numbers that indicate the mutual information score (MIS) [Church ei al., 1901] of collocations (9.9 and 8.7, for preferred stock and expressed concern, respectively).",
        "It becomes necessary to infer the nature of the combination from indirect corpus-based statistics as shown by the rest of this paper.",
        "3 For expository purposes we chose here two extreme, clear-cut cases; other pairs (e.g., promised money) are not totally biased towards one side or another.",
        "Acres DE COL1NG-92, NAMES, 23-28 miff 1992 13 0 7 PRoc.",
        "01.",
        "COLING-92, NArrrEs, Au°.",
        "23-28, 1992"
      ]
    },
    {
      "heading": "Inferring Syntax from Collocations",
      "text": [
        "In this section we describe the method used for eliciting word-association preference from the corpus."
      ]
    },
    {
      "heading": "Initial Observation: Co-occurrence Entails Sentential Relations",
      "text": [
        "The basic intuition used invariably by all existing statistical taggers is stated as follows: Significant collocations (i.e., high MIS) predict syntactic word association.",
        "Since, for example, preferred stock is a significant collocation (mis 9.9), with all other clues assumed neutral, it will be marked as an integral noun group m the sentence.",
        "However, is high mis always a good predictor?",
        "Figure 3 provides mutual information scores for preferred, expressed, and closed right collocations.",
        "The first column (preferred) suggests mis is a perfect predictor.",
        "A count in the corpus confirms that a predictor based on collocations is always correct.",
        "A small sample of preferred collocations in context is given Figure 4.",
        "Notice that in all cases, preferred is an adjective."
      ]
    },
    {
      "heading": "Next Observation: Co-occurrence Entails Thematic Relations",
      "text": [
        "While column 1 (preferred) yields good syntactic associations, column 2 (expressed) and column 3 (closed) yield different conclusions.",
        "It turns out (see Figure 4) that expressed collocations, even collocations with high mis, produce a bias towards false-positive groupings.'",
        "If these collocation do not signify word groupings, what do they signify?",
        "An observation of expressed right collocates reveals that the words surprise, confidence, skepticism, optimism, disappointment, support, hope, doubt, 'Word associations based on corpus do not die-late the nature of word groupings; they merely provide a predictor that is accounted for with other local-context clues.",
        "worry, satisfaction, etc., are all thematic relations of express.",
        "Namely, a pair such as expressed disappointment denotes an action-object relation which could come in many variants.",
        "The last part of Figure 4 shows various combinations of express and its collocates."
      ]
    },
    {
      "heading": "Using Additional Evidence",
      "text": [
        "In light of this observation, it is necessary to test in the corpus whether collocations are fixed or variable.",
        "For a collocation wordl-word2, if wordl and word2 combine in multiple ways, then wordl-word2 is taken as a thematic relation; otherwise it is taken as a fixed noun group.",
        "This test for express-word is shown in Figure 5.",
        "Each row provides the number of times each variant is found.",
        "Variants for expressed concerns, for example, are concern expressed, express concern, expresses concern, and expressing concern.",
        "Not shown here is the count for split co-occurrence [Sinadja, 1991], i.e., express its concern, concern was expressed.",
        "The last column sums up the result as a ratio (variability ratio) against the original collocation.",
        "In conclusion, for 12 out of 15 of the checked collocations we found a reasonable degree of variability."
      ]
    },
    {
      "heading": "Making Statistics Operational",
      "text": [
        "While the analysis in Figure 5 provides the motivation for using additional evidence, we have two steps to take to make this evidence useful within an operational tagger."
      ]
    },
    {
      "heading": "Dealing with Small Numbers",
      "text": [
        "Although the table in Figure 5 is adequate for expository purposes, in practice the different collected figures are spread over too many rubrics, making the numbers susceptible to noise.",
        "To avoid this problem we short-cut the calculation above and collect all the co-occurrence of",
        "the roots of the words under analysis.",
        "Instead of asking: \"what are the individual variants?\"",
        "we ask \"what is the total co-occurrence of the root pair?\".",
        "For expressed concerns we check the incidence of express-interest (and of interest-express).",
        "As a result, we get the lump sum without summing up the individual numbers."
      ]
    },
    {
      "heading": "Incorporating Statistics in Tagging",
      "text": [
        "Co-occurence information regarding each pair of words is integrated, as described in Section 2.3, with other local-context clues.",
        "Thus, the fact that statistics provide a strong preference can always be overidden by other factors.",
        "they preferred stock ... the expressed interest by shareholders was In both these cases the final call is dictated by syntactic markers in spite of strong statistical preference."
      ]
    },
    {
      "heading": "Conclusions",
      "text": [
        "NLpc processes collocations by their category.",
        "In this paper, we investigated specifically the PastParticiple-Noun category (e.g., preferred-stock, expressed-concerns, etc.).",
        "Other categories (in particular ContinuousVerb-Noun as in driving cars vs. operating systems) are processed in a similar way, using slightly different evidence and thresholds.",
        "Out of 2031 tagging cases counted, the algorithm was called in 400 cases.",
        "1631 cases were not called since they did not involve collocations (or involved trivial collocations such as expressed sonic fears.)",
        "Out of 400 collocations the program avoided ruling in 23 cases due to insufficient data.",
        "Within the 377 tagged cases, 358 (94.9%) cases were correct, and 19 were incorrect."
      ]
    },
    {
      "heading": "90% Accuracy is Not Enough",
      "text": [
        "Existing preprocessors [Church et at., 1989; Zernik et al., 19911 which have used corpus-based collocations, have attained levels of acAcres GE for the 585,000 shares of its use payments of dividends on the ohavk but lowered ratings on its n* 3 from BAA *hyphen* 2 *comma* liar* 26.65 a share *period* The area of common for each share of",
        "O *pc* of Verity caps common and ng of up to *dollar* 250 million erns of the transaction call for sal *comma* to swap one share of i *dollar* 2 million annually in p* notes and 7,459 Lori series C a share of newly issued series A ance an adjustable *hyphen* rate",
        "id he told the house Mr. Dingell ggeeted that the U.S. Kr.",
        "Harper ne tax *period* Some legislators soybeans and feed grains *comma* bid *dash* *dash* *dash* GE unit hallenge *period* Mr. Wright has bt about their bank one also had italy sap* President Cossiga and *comma* saying warner executives secretary Robert Mosbacher have thor on the nature paper *comma* eber who *comma* he said *comma* wing gold in the street and then said that National Pizza Co. has r. nixon *comma* Chinese leaders",
        "e Bay Area sap* pastry community presidents also are expected to its predecessor *period• It also related Services Co. people who c chairman Seidman *comma* while • on a tour of asia *comma* also ponsored the senate plan *comma* the nine supreme court justices nd primerica in his eagerness to st few weeks alone *dash* *dash* iterally flipped his wig *comma* that the newspaper company said who no longer feel they have to icans writing to the hostages to en summoned to chairman Gonzalez riod* Frequently *comma* clients",
        "preferred preferred preferred preferred preferred preferred preferred preferred preferred preferred preferred preferred preferred preferred expressed expressed expressed expressed expressed expressed expressed expressed expressed expressed expressed expressed stock outstanding *period* The e stock in January *period* It sus stock and commercial paper *comic stock to ba *hyphen* 2 from BAA is convertible until 5 P.M.. EDT *r-paren* *period* Cash will be shares outstanding *period* The shares *period* Terms of the tra holders *comma* who previously a stock for 1.2 shares of common a dividends *period* Artra owns 68 shares with a carrying value of stock with a value equal to edol stock whose auction failed recen concern *comma* sources said *co confidence that he and Mr. Baum concern that a gas *hyphen* tax outrage over the case *comma* sa interest in financing offer for dismay that a foreign company co interest in Mcorp saps mvestment concern about an Italian firm su surprise at Sony saps move but d concern about the EC sap* use of disappointment that he vas not i support for the idea *period* Ca expressing surprise when thieves walk by t expressed renewed interest in acquiring th expressed no regret for the killings *coma express disbelief that Ms. Shere kept on express support for the Andean nations w expressed its commitment to a free shyphe express interest in the certificates rec expressing concerns *comma* also said the expressed a desire to visit China *period expressed some confidence that his plan v expressed varying degrees of dissatisfact express his linguistic doubts to America expressing their relief after crossing in expressing delight at having an excuse to expresses confidence in the outcome of a express their zeal on the streets *comma express their grief and support *period* expresses sympathy for Sen. Riegle *comma express interest in paintings but do not",
        "curacy as high as 90%.",
        "A simple calculation reveals that a 39-word sentence might contain some 1-2 errors on the average.",
        "This error rate is too high.",
        "Since the pre-processor's job is to eliminate from consideration possible parse trees, if the appropriate parse is eliminated by the preprocessor at the outset, it will never be recovered by the parser.",
        "As shown in this paper, it is now necessary to investigate in depth how various linguistic phenomena are reflected by statistical data."
      ]
    }
  ]
}
