{
  "info": {
    "authors": [
      "Chunfa Yuan",
      "Changning Huang",
      "Shimei Pan"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-4211",
    "title": "Knowledge Acquisition and Chinese Parsing Based on Corpus",
    "url": "https://aclweb.org/anthology/C92-4211",
    "year": 1992
  },
  "references": [],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "In Natural Language Processing (NLP), one key problem is how to design a robust and effective parsing system.",
        "In this paper, we will introduce a corpus – based Chinese parsing system.",
        "Our efforts are concetrated on: (I) knowledge acquisition and representation; and (2) the parsing scheme.",
        "The knowledge of this system is principally extracted from analyzed corpus, others are a few grammatical principles, i.e. the four axioms of the Dependency Grammar (DG).",
        "In addition, we also propose the fifth axiom of DG to support the parsing of Chinese sentences."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The traditional approaches of natural language parsing are based on rewriting rules.",
        "We know that when the number of rules have already increased to a certain level, the performance of parsing will be improved little by increasing the number of rules further.",
        "So using corpus – based approach, i.e. extracting linguistic knowledge with fine grain size from corpus directly to support natural language parsing is more Impressive.",
        "In this paper we will introduce the work on Knowledge acquisition and Chinese parsing based on corpus.",
        "Our work includeds: .",
        "Take out a total of 500 sentences from geography text book of middle school to form a small Chinese corpus.",
        ".",
        "Because Dependency Grammar (DG) directly describes the functional relations between words, and a dependency tree has not any non – terminal nodes, DG is suitable for our Corpus – Based Chinese Parser (CBCP) particularly.",
        "We marked the dependency relations of every sentence in our corpus manually.",
        ".",
        "Input the analyzed corpus into the computer and form a matrix file for every sentence in the corpus.",
        ".",
        "Extract the knowledge from the matrix file and form a knowledge base.",
        ".",
        "Implement the CBCP system for parsing input sentences and assigning dependency trees to them.",
        "2.",
        "Construction of the knowledge base (1) Thu project is supported by National Science Fundation of China under grant No.",
        "69073063",
        "At first, we marked the dependency relations of every sentences in our corpus manually.",
        "An example of analyzed sentence is as follows :",
        "(each) (river) (oi) (middle and low reaches) (mostly) (are) (flatlands) Most of the middle and low reaches of each river are flatlands.",
        "Fig 2.1 Here: DETA(DETerminative Adjunct), CDE(Complement of \"ri<j(DE)\"), ATRA(ATtRibutc Adjunct), SUBJ(SUBJect), ADVA(ADVerbial Adjunct), OBJ(OBJect).",
        "Then we run a program to input the dependency relations of every sentence to the computer and form a matrix file as bellow:",
        "In order to expound the knowledge representation, we give some definitions as below.",
        "If there are four words wl, w2, w3 and w4 with dependency relations RI, R2 and R3: RI R2 R3 wl wnw( --)w4 Fig 2.2 Then for the word \"w3\", its d–relation is 122; its g–relation is 111; and its s–relation is R3.",
        "We extract the knowledge from the matrix file to form a frame as below : word–name ::= 1.< govfrcq > , < govlist > , < linklist > , < patlist >1 The slots of the frame are: governor frequency (govfreq): It indicates that whether the given word can be a governor of a sentence and how many times it has been in our corpus.",
        "governor list (govlLst): It indicates which word can be the parent node of the given word, and what is the dependency relation between the word and its parent node.",
        "In other words, what is the word's d–relation and how many times it has occurred in the corpus.",
        "i.e. govlist r( < governor–name > < d–relation> , < frequency >j} * I dependency link list (linklist): The d–relation and g–relation of the given words can form a pair of relations described as d--relation < g relation.",
        "The information on linklist includes: how many kinds of dependency links the given word have in our corpus?",
        "And what are they?",
        "how many times it has occurred?",
        "what Ls the position of the word's parent node to the right or to the left of the word) in a sentence?",
        "i.e. linklist <d – relation> 4<g – rclation> , < position> , < frequency > * 1* j pattern list (patlist): The given word and its s – relations constitute a pattern of the word as: (s – relationl s – relation2 s – relation3 ...).",
        "This pattrcn information describes the rationality of the syntactic structure in a dependency tree.",
        "The patlist knowledge extracted from the corpus includes: how many patterns can the word act in our corpus?",
        "What is each pattern?",
        "how many times has ft occurred?",
        "What Ls the position (to the right or left of the word) of the children node in a sentence In our corpus?",
        "i.e. patlist [4pattern f< frequency > , 4 < s – relation> , < position > 11 * jI1 * I (notes: the content inside the \"{ \" can be repeated n times, where n > 1)"
      ]
    },
    {
      "heading": "3. The parser",
      "text": [
        "In our CBCP system, the knowledge base will first be searched for all the possible linklist information of each word pair, according to the words in the input sentence.",
        "We use this information to construct a Specific Matrix of the Sentence (SMS).",
        "Second, remove impossible links in the SMS, and form a network.",
        "Third, we search all the possible dependency trees in the network, using the pruning algorithm.",
        "Finally, the solutions will be selected by evaluating the dependency trees.",
        "The process of removing and pruning is based on the knowledge base and the four axioms of Dependency Grammar (Robinson, J.J.1970).",
        "The four axioms arc: I .",
        "There is only one independent clement (governor) In a sentence.",
        "II .",
        "Other elements must directly depend on one certain element in the sentence.",
        "III.",
        "There should not be any element which depends on two or more clememts.",
        "N. If the clement A directly depends on clement B, and element C is located between A and B in a sentence, element C must be either directly dependent on A or B or an element which is between A and B in the sentence.",
        "According to our Dependency Grammar practice in Chinese, we postulate the fifth axiom as follows: V .",
        "There is no direct dependent relation between two elements which one is on the left hand side and the other is on the right hand side of a governor."
      ]
    },
    {
      "heading": "3.1 Construct a specifics' matrix of a sentence",
      "text": [
        "Suppose there are k words in a sentence marked as S (wl w2 w3 wi... wk), CBCP searches the linklist information of every word in the sentence.",
        "For example, if one link of wi is ATRA <---011.1, and the link of wj is OILY< ---GOV (GOVernor) in the knowledge base, CBCP can construct the link between wi and wj as ATRA < ---OBJ.",
        "The SMS will be constructed by searching all the links of words in the input sentence."
      ]
    },
    {
      "heading": "3.2 Remove Impossible governors and links",
      "text": [
        "Since an Input sentence may form a large number of dependency trees based on the SMS, it is necessary to remove the impossible links before connecting every node to a network.",
        "Suppose in a SMS, the word A is dependent on the word B and the link between them is Ra< – Rb.",
        "If there exists a (R1 R2 ...Ra...Rk) in Ws patlist, the dependent relation of Ra< – Rb is reasonable.",
        "Otherwise, the Ra< – Rb relation is impossible, and should be removed.",
        "The CBCP system looks for the govfreq information of each word in an input sentence.",
        "If the govfreq of a word is greater than zero, the word can be a governor.",
        "The rules of removing impossible governors arc: .",
        "If a word has no parent node in SMS, the word must be the governor (based on axiom I ).",
        "Other words which can also act as a governor must be removed.",
        ".",
        "If a word A has only one link to word II with the link Ra <--GOV, and the word B can not be a governor, the word A will not depend on any word in the dependency tree.",
        "According to axiom II this is impossible, therefore word B must be the governor.",
        "Other words which also can act as a governor must be removed.",
        ".",
        "When a word A has only one link to word B with the link Ra < – Rb (Rb < > GOV), and the d – relation of the word B is not Rb, the word A will not depend on any words in the dependency tree.",
        "According to axiom 11 this is impossible.",
        "So the d – relation of the word B must not be the governor.",
        "Then this kind of link in which the word B is used as a governor must be removed.",
        "After removing all the impossible governors and links, the SMS of the sentence in Fig-2.1 is as follows: M(0 1)=DETA < – CDE M(0 5),-- ADVA < --GOV MO 2) – CDE < --ATRA M(1 3) – ATRA < – SUBJ M(1 5)= SUBJ <---GOV M(2 3) – ATRA < – SUBJ M(3 5) – SUBJ < – GOV M(4 5)= ADVA < --GOV MO 5) = OBJ < --GOV"
      ]
    },
    {
      "heading": "3.3 Search the possible Integrated tree from the specific tree",
      "text": [
        "Let the governor be the root node, connecting all the nodes in order.",
        "If a node have n (n > 1) parent nodes, we can split this node to n same nodes.",
        "Let these n same nodes depend on the n parent nodes respectirely.",
        "Thus Specific Tree (ST) will be constructed.",
        "The ST of the sentence in Fig-2.1 is as bellow: ADVA",
        "If a node appears m times in the ST, we may say the degree of freedom of this node is A – m. If there is only one word, whose A equals to m in a ST, then m dependency trees may be constructed.",
        "If the degree of freedom of the word – i equals to n , the degree of freedom of the word – i equals to m then the n * m dependency trees will be constructed.",
        "If there are many words with A greater than one, the number of dependency trees being formed will be very large.",
        "Therefore, in the process of seaching an integrated dependency tree, the pruning technology must be taken.",
        "The pruning technology derives from axiom V .",
        "After the integrated dependency trees have been produced, we use the numerical evaluation to produce the parsing result [1]."
      ]
    },
    {
      "heading": "4. Experimental result and future work",
      "text": [
        "When CBCP analyzed Chinese sentences in a closed corpus, it has an approximately 90% success rate (comparing with the result of manual parsing).",
        "If each word in a sentence can be found in our corpus and the corresponding dependence relation can also be found in our knowledge base, it is also feasible for CBCP to perform syntactic parsing in an open corpus.",
        "As our research is advancing, we will enlarge the scale of our corpus and make it work on open corpus more effectively.",
        "On the other hand, we have great interests in how to retrieve more information from different aspects.",
        "For example, we want to acquire grammatical category information and semantic features for our system or equip complex feature set for each word to support corpus – based as well as rule – based system.",
        "We want to add a few rules to our system, in order to replace the frames of the words which frequently appear in our corpus.",
        "The frame of such a word is very large, but it is easy to describe its dependency relations by rules.",
        "We plan to do further research in this field.",
        "In addition, our work can be easily expanded to set up a Chinese Collocation Dictionary.",
        "It is very difficult to make this kind of dictionary by man power, beacuase It is impossible to seek all the possible collocations of a particular word just by thinking.",
        "But it Is easy to achieve this with corpus – based approach like our work.",
        "The more refined analyzing of the texts in the corpus, the more knowledge can be acquired from the corpus."
      ]
    }
  ]
}
