{
  "info": {
    "authors": [
      "Judy L. Delin",
      "Jon Oberlander"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-1045",
    "title": "Aspect-Switching and Subordination: The Role of It-Clefts in Discourse",
    "url": "https://aclweb.org/anthology/C92-1045",
    "year": 1992
  },
  "references": [
    "acl-C88-2120",
    "acl-P87-1001"
  ],
  "sections": [
    {
      "heading": "Introduction",
      "text": [
        "In this paper, we explore a proposal, first put forward by Prince [1978], to the effect that it-clefts serve an apparently subordinating function in discourse.",
        "In addition to the cause-and-effect subordination noted by Prince, our own data reveals that clefts are also involved in temporal subordination, where the clefted material appears dissociated from the main time line.",
        "Using Scha and Polanyi's [1988] notation, we can draw a local discourse structure that illustrates the general subordination relation involved.",
        "However, this does not constitute an explanation of why subordination is effected by it-clefts.",
        "In an attempt to construct a general explanation for both sets of cases, we examine Prince's [1978] suggestion that it-clefts serve to mark a piece of information as KNOWN FACT.",
        "We propose that the AS-PECTUAL EFFECT of using a cleft both explains the Known Fact Effect observed by Prince, and accounts for the various kinds of discourse subordination associated with it-clefts.",
        "We then turn our attention to a third set of data: it-clefts that have a contrastive effect in the discourses in which they appear, and what goes wrong with those discourses when they are de-clefted.",
        "In some cases, de-clefting causes no ill-effects.",
        "In other cases, however, no contrastive relation can be retrieved upon de-clefting and the discourse becomes incoherent.",
        "In the final section of the paper, we make some speculative comments on an apparently related phenomenon: the fact that it-clefts cannot take it as the clefted constituent, which we feel is amenable to a discourse-structural explanation.",
        "The data for the study were drawn from the Survey of English Usage corpus of spoken English, the LOB corpus of written English, and casually-collected data.",
        "'The authors gratefully acknowledge the support of the Science and Engineering Research Council through a Postdoctoral Fellowship, and Project Grant GR /G 2 2077.",
        "Hone is supported by the Economic and Social Research Council.",
        "We thank three anonymous reviewers for their helpful comments.",
        "Email contact: judytcogs .81113X .ac .",
        "uk"
      ]
    },
    {
      "heading": "Clefts and Discourse Subordination Background, Cause and Effect",
      "text": [
        "To our knowledge, Prince [1978:902] was the first to observe that cleft constructions serve a SUBORDINATING function in discourse.",
        "She observed that for examples like (1) the information conveyed is 'background material ...subordinate in importance to what follows': (1) It is through the writings of Basil Bernstein that many social scientists have become aware of the scientific potential of sociolinguistics ...Yet their very popularity has often deformed Bernstein's arguments; has been made to say that lower class children are linguistically 'deprived' ...In fact, Bernstein's views are much more complex than that.",
        "First ... She notes in particular that the subordination relation involved is often (although not always) one of cause and effect, where the clefted proposition is often intended to be interpreted as the cause.",
        "She gives the following example: (48a) Here ... were the ideas which Hitler was later to use ... His originality lay in his being the only politician of the Right to apply them to the German scene after the First World War.",
        "It was then that the Nazi movement, alone among the nationalist and conservative parties, gained a great mass following and, having achieved this, won over the support of the Army, the President of the Republic, and ... big business – three 'longestablished institutions' of great power.",
        "The lessons learned in Vienna proved very useful indeed.",
        "Prince [1978:902] explains the effect of the cleft in her (48a) as follows: .If the third sentence of (48a) read Then, the Nazi movement .",
        ", it would tend to suggest a separate event, and we would lose the notion that it was all II's doing--a notion conveyed very strongly by the it-cleft's subordinating effect, and underlined (thoughtill S....",
        "DOt asserted) by the last sentence.",
        "[Prince 1978:902] Prince's suggestion, then, is that clefts can serve as suitable vehicles for delivering information that is backgrounded to the main flow of the discourse, or that is contingently related to it, by cause-and-effect.",
        "Acres DE COL1NG-92, NANTEs, 23-28 miff 1992 2 8 1 PROC.",
        "or COI:ANC-92, NAnrrEs, AUG. 23-28, 1992"
      ]
    },
    {
      "heading": "Temporal Regression",
      "text": [
        "In addition to the cause-and-effect relations noted by Prince, our own data reveals a further 'backgrounding' function: the use of clefts for temporal subordination.",
        "In (2), for example, an it-cleft is being used to introduce background information elaborating on the nature of a protagonist in the discourse (Mr. Butler).",
        "This is done by describing an eventuality that he was involved in at some previous time:",
        "(2) 1.",
        "Mr. Butler, the Home Secretary, decided to meet the challenge of the 'Han-the-Bomb' demonstrators head-on.",
        "2.",
        "Police leave was cancelled 3. and secret plans were prepared.",
        "4.",
        "It was Mr. Butler who authorised action which ended in 82 members of the Committee of 100 being imprisoned.",
        "5.",
        "The Committee's president and his wife were each jailed for a week.",
        "The effect of the cleft is to cause the 'background' information about the authorisation of action to be interpreted as as occurring prior to the events introduced in lines 1-3 – the decision, the cancellation of leave, and the preparation of secret plans.",
        "If we look at a de-clefted version of the same discourse, we can see that the temporally subordinating effect of the cleft is removed, creating a rather different effect.",
        "The result, (3), has the 'authorisation of action' described in the de-clefted sentence occurring in simple temporal progression from the 'cancellation of police leave' – in other words, after the events introduced in lines 1-3:",
        "(3) 1.",
        "Mr. Butler, the Home Secretary, decided to meet the challenge of the `Ban-the-Bomb' demonstrators head-on.",
        "2.",
        "Police leave was cancelled 3. and secret plans were prepared.",
        "4.",
        "Mr. Butler authorised action which ended in 92 members of the Committee of 100 being imprisoned.",
        "5.",
        "The Committee's president and his wife were each jailed for a week."
      ]
    },
    {
      "heading": "The Known Fact Effect",
      "text": [
        "Examples such as (1), (48a) and (2) share a property that has been characterised as the KNOWN FACT EFFECT.",
        "Prince states: Their function, or at least one of their functions, is TO MARK A PIECE OF INFORMATION AS FACT, known to some people although not yet known to the intended hearer.",
        "Thus they are frequent in historical narrative, or wherever the speaker wishes to indicate that s/he does not wish to take personal responsibility for the truth or originality of the statement being made."
      ]
    },
    {
      "heading": "[Prince 1978:899-900]",
      "text": [
        "The cleft can introduce 'new' information to the discourse, while at the same time signalling that the information is to be treated as if it had been there all along.",
        "A significant feature, then, is that the",
        "information must be regarded as not open to conversational negotiation.",
        "Delin [1991] proposed that a speaker who uses an it-cleft that conveys new information in the complement is indicating that the information they are communicating did not originate with the speaker, and that they are therefore not to be held responsible for its truth value.",
        "This Known Fact account has an intuitive appeal; yet it does not constitute a mechanisable explanation of the role of the cleft in discourse.",
        "One possible avenue to such an account would be to exploit Polanyi and Scha's [1988] Linguistic Discourse Model.",
        "By adding an appropriate rule to the grammar for discourse constituent units (DCus), we could represent the cleft as introducing a Dell to be attached as subordinate to the current node, deriving a local discourse parse tree such as that in Figure 1.",
        "Hence, we can represent the proposition conveyed by the cleft sentence as subordinate to the existing discourse structure.",
        "But mere representation does not make obvious how the syntactic or semantic features of the cleft are supposed to drive the assignment of discourse structure.",
        "Nor is it obvious that such a subordination structure supports the Known Fact Effect.",
        "There are plenty of other subordination structures in Polanyi and Scha's framework that don't indicate that a Known Fact reading should be associated with the subordinate elements."
      ]
    },
    {
      "heading": "The Aspectual Effect of the Cleft",
      "text": [
        "What we want at this point is an account which can recruit the syntactic and semantic features of the cleft, to explain the background and regress data that has been observed, feed into the discourse parse process, and explain the Known Fact Effect.",
        "The basic proposal we explore here is that it is the as-pectual effect of the cleft that provides the required explanation."
      ]
    },
    {
      "heading": "Aspectual Class",
      "text": [
        "Following Vendler [1967], much consideration has been given to the \"aspectual types\" of utterances of English sentences (cf. Hinrichs [1986]; Dowty [1986]; Moens and Steedman [1987]).",
        "An utterance denotes an eventuality of some type; the aspectual type will determine the relation to other eventualities mentioned in a discourse.",
        "Vendler's inventory includes ACTIVITIES, ACCOMPLISHMENTS, ACHEIVE-MENTS and STATES, Bach [1986] takes the space of eventualities to include STATES and NON-STATES; in turn, states consist of DYNAMIC and STATIC states, <dominant <subordinate segment> clefted segment> Acres DE COLING-92, NANIRs, 23-28 Aoin' 1992 2 8 2 Pxoc.",
        "OF COLING-92, NANTES, Am 23-28, 1992 while non-states consist of PROCESSES and EVENTS.",
        "Events are then either PROTRACTED or MOMENTA-NEOUS; momentaneous events are either HAPPENINGS or CULMINATIONS.",
        "For current purposes, the relevant distinction is that between states and non-states; in particular, between states and events.",
        "From Bach [1986:6], paradigmatic cases of verb phrases exhibiting this distinction include the following: States: sit, be drunk, own x, love x Events: build x, walk to Boston, notice, reach the top The aspectual class of an utterance is typically determined by the aspectual class of the lexical verb, by other elements within the verb phrase, by temporal adverbials with which the verb phrase co-occurs, and by the noun phrase itself.",
        "Linguistic context will also influence aspectual class assignment.",
        "For example, a verb normally taken to denote a process, such as (4), can form part of a verb phrase denoting a protracted event, as in (5); and in combination with certain noun phrases, the same verb phrase can form part of a sentence (6) denoting a habitual state:",
        "(4) ran (5) ran to the station (6) trains ran to the station",
        "We can now frame the basic proposal we wish to discuss: it-cleft sentences are stative; the presence of the copular in the cleft head ensures this.",
        "We can thus view a cleft as a function taking either non-state-expressions or state-expressions as input, and returning state-expressions as output.",
        "(7a) and (8a) denote an event and a state respectively; but both (7b) and (8b) denote states.",
        "(7) a. Victoria found the body.",
        "b.",
        "It was Victoria who found the body.",
        "(8) a. Victoria knew the killer's identity.",
        "b.",
        "It was Victoria who knew the killer's identity."
      ]
    },
    {
      "heading": "Temporal Overlap",
      "text": [
        "Consider now theories which attempt to derive the temporal structure of discourse from the syntactic structures of a sequence of input sentences.",
        "In the framework of discourse representation theory, work by Partee [1984], Kamp and Rohrer [1983] and Hinrichs [1986] has indicated that it is possible to exploit Reichenbach's [1947] notions of speech-time, event-time, and reference-time to drive a process which will add temporal constraints to a discourse representation structure (DRS).1 In particular, in past tense narrative, simple event-expressions are taken to locate an event at an event-time corresponding to the existing reference-time, and, in addition, to update the reference-time to a point 'just after' that reference-time, This new time will constitute the reference-time for the location of the next input expression.",
        "By contrast, state-expressions firstly locate the state as overlapping the 1We do not wish to maintain that a reference-time based account is the best that can be provided.",
        "It is, however, a convenient representational tool.",
        "existing reference-time; and secondly do not update that reference time.",
        "Hence, the next input expression (denoting event or state) will be evaluated with respect to the same reference time again.",
        "In this way, DRS construction can encode the relative temporal locations of the various eventualities.",
        "In general, one can say that simple event-expressions 'move a narrative along', while simple state-expressions leave it where it is.",
        "More complex expressions, containing temporal adverbials and perfective or progressive aspect, require some complication in the DRS-construction rules.",
        "Take an example like (9):",
        "(9) John met Mary in town.",
        "She had broken her leg, but looked well in spite of it.",
        "The use of the past perfect can be taken to either introduce a flashback sequence, with a set of 'secondary reference points' (as in Kamp and Rohrer [1983:260]), or else to turn an event expression into an expression denoting the consequent state of an earlier occurrence of the contained event (adapting the somewhat different analysis in Moens and Steedman [1987:4]).",
        "Assuming the DRT account of states in general, we would say here that the consequent state (of Mary having a broken leg) overlapped with the existing reference time (associated with the event of John meeting Mary); the earlier occurrence of an event (of Mary breaking her leg) being inferrable from the perfective description of the leg-breakage.",
        "The DRT notion of temporal overlap is a permissive relation; in a case like (10), we can follow a pair of event-expressions with various state-expressions, all of which DRT would say denote states which overlap the event already introduced.",
        "(10) Someone stole Victoria's car on Friday; they wrecked it.",
        "a.",
        "She was very attached to it.",
        "b.",
        "She was very annoyed.",
        "c. It was unlocked.",
        "In fact, we would want to say that Victoria was attached to the car before (and perhaps not after) it was wrecked; that she was annoyed after (and probably not before) it was wrecked; and that its being unlocked fully overlapped the stealing and wrecking.",
        "Arguably, we can view the states in (10a–c) as providing respectively some background, a result and an explanation for the events in (10).",
        "One approach to representing states is to represent them via intervals of time, bounded by (artefactual) begin-events and end-events.",
        "Such an approach is adopted, for example, in Kowalski and Sergot's [1986] Event Calculus.",
        "In discourse, of course, it is not always possible to find explicit reference to such beginnings and endings.",
        "Whilst not advocating such a reductive approach to states here, we note that in some cases, such as the resultant state in ( lob) or the perfect state in (9), the event which initiated that state may lie explicitly mentioned.",
        "In other cases, such as the background in (10a) and the explanation in (10c), the event which lead to the state may be only implicit.'",
        "\"Capturing these differences in a DRT-based theory of"
      ]
    },
    {
      "heading": "ACCES DE COLING-92, NANnis, 23-28 min. 1992 2 8 3 PROC. OF COLING-92, NANTES, AUG. 23-28, 1992",
      "text": []
    },
    {
      "heading": "Explaining the Data",
      "text": [
        "Now, consider the use of clefts as state-denoting expressions.",
        "We would suggest that, in this respect, they be treated like the others we have considered.",
        "We can say that clefts will denote states which:",
        "1.",
        "Overlap with the existing reference time 2.",
        "Do not update that reference time 3.",
        "Have been initiated by some event, which may be either explicit or implicit.",
        "Finally, Mr Butler's authorisation of various actions is presented via a cleft (example (2)).",
        "Hence, we have a state of Mr Butler – of having authorised action – and this state overlaps the reference-time established by the previous sentence.",
        "The state does not update the reference-time, and so the subsequent sentence overlaps with this state.",
        "Here, the event which brought about the state of Mr Butler is clearly his authorisation of action.",
        "It must have initiated the state, so it lies before the current reference time; but we cannot totally order it with respect to the reference-times from the previous sentences of the discourse.",
        "This explains why there is a feeling of 'temporal regression' and the associated removal from the main time-line; further world knowledge would be required to find the actual relative location of Mr Butler's action.",
        "The reason de-clefting seems to disrupt the meaning of the discourse lies in the fact that it can, as here, convert a state-expression back into an event-expression.",
        "This then gives the impression that discourse would, of course, require additional theoretical apparatus; cf. Lascarides and Asher [1991].",
        "the speaker-writer is introducing a new event into the discourse and updating it in the relevant ways; whereas in the clefted versions, any events introduced by the state itself are either implicit, or identifiable in the previous context.",
        "Safe de-clefting must therefore involve the preservation of the stative aspect of the relevant cleft sentence; replacement with a perfect de-clefted sentence should normally suffice.",
        "Note that where the de-clefted sentence is already stative, de-clefting should not disrupt the coherence of the narrative so severely."
      ]
    },
    {
      "heading": "Explaining the Known Fact Effect",
      "text": [
        "We have indicated that the discourse subordination effect of clefts can be traced to their aspectual class.",
        "This suggests that we can correlate the syntactic construction with a semantic feature, and that this feature could therefore be recruited by a discourse parsing mechanism, such as the Linguistic Discourse Model proposed by Scha and Polanyi [1988].",
        "As we noted earlier, Prince [1978] proposed that what the various clefts had in common was that they marked a piece of information as fact, known to some people, but not necessarily to the hearer.",
        "By indicating that they do not accept responsibility for the truth of the statement, the speaker at once denies that they are the 'informational origin', and makes it clear that the validity of the statement is non-negotiable.",
        "We would like to suggest that the aspectual effect of the cleft can explain the Known Fact Effect, in the following way.",
        "On one interpretation of Grice's [1975:46] Maxim of Quality, we can say that a considerate speaker's explicit commitments must be supported by adequate evidence, but that their implicit implicatures need not be, so long as the speaker does not actually believe the implicatures to be false.",
        "In the discourses we have discussed, each piece of information the speaker wishes to convey can be transmitted via either an event-expression or a state-expression.",
        "When the speaker uses an event expression, they are explicitly introducing a new referential element to the discourse: an event.",
        "Let us say that speakers are 'responsible' for explicit introductions only.",
        "Now, when a speaker uses a state expression, they do two things: they explicitly introduce a state to the discourse, and they also implicitly refer to two further events; the beginning and ending of that state.",
        "But the speaker is not responsible for those events, because they have chosen to use a construction which leaves the events merely inferrable, or locatable in the previous discourse context.",
        "Lascarides and Oberlander [1992] suggest that if there is no 'explicit' indication of where a state starts – via the mention of causes or the use of temporal adverbials – then the start of the state is assumed to be irrelevant.",
        "Here we may gloss 'irrelevant' as: unknown, unknowable or simply to be taken for granted.",
        "Thus, conversely, if the speaker deems the start of the state to be irrelevant to the discourse in this sense, then they can use a simple state-expression.",
        "This makes a cleft a natural choice for a speaker who wishes simply to assert that an eventuality is current at the reference-time, without Acres DE COLING-92, NA1.rrEs, 23-28 AOU'l 1992 2 8 4 PROC.",
        "OF COLING-92, NANTES, Ann.",
        "23-28, 1992 indicating anything further about it.",
        "So clefts can deliver information which might otherwise have been stated earlier without disrupting the flow of the discourse (cf. Polanyi's [1986:85--87] 'true starts'); and they can also deliver information without generating responsibility for an initiating event whose location may be unknown, unknowable or simply to be taken for granted.",
        "The former type might be assimilated to what Prince [1978] has termed STRESSED-FOCUS it-clefts, and the latter to her INFORMATIVE-PRESUPPOSITION clefts."
      ]
    },
    {
      "heading": "Clefts and Contrast",
      "text": [
        "The observation that the cleft initiates a subordinate discourse segment also provides us with a potential explanation for a further set of data, namely those clefts which play a contrastive role in discourse.3 Contrast (cf. Lyons [1977], Werth [1984] for a discussion) can be described as relationship of opposition or comparison between two (or more) discourse elements that operates on the basis of some predicate.\" For example, in the following case a contrast holds between the cleft head element the angel and a preceding element, Boaz, with respect to the predicate use this form of greeting: (11) To this the reply is given that from the verse dealing with Boaz there is no proof of divine approval, only that Boaz used this form of greeting.",
        "But in the second verse it is the angel that uses this form of greeting and hence there is evidence of divine approval.",
        "It is important to note that the contrastive relationship has two distinct components: the two (or more) contrastive elements themselves, and the semantic content relating those elements, thereby allowing the contrast to take place.",
        "In (11), for example, the relating semantic content is easy to find, since it is explicitly stated twice in a way that allows the commonality between the contrast-supporting predicates to be retrieved immediately (used this form of greeting ... uses this form of greeting).",
        "In other cases, however, the relating semantic content is not so simple: understanding the contrast between doubling the selling space to 700 square feet and the new fixtures and fittings in (12), for example, requires a contrastive relation to be constructed out of the non-identical content of the predicates be the greatest expense and be costly:",
        "(12) Doubling the selling space to 700 square feet was",
        "not to be the greatest expense.",
        "It was the new fixtures and fittings to fill this space that would be costly.",
        "A similar effect can be observed in (13), in which a contrast takes place between the cleft head element the lady who obliges and the antecedent a nice",
        "of coherence are supported by inferrable SCALES (cf. Hirschberg [1985], Ward [1985]) would also he a useful one for this analysis.",
        "old-fashioned housemaid in the following advice to visitors to grand homes:",
        "(13) Quite a few of you have asked about tipping, and these days problems can arise.",
        "A nice old-fashioned housemaid, labelled by cap and apron, is easy enough; when you leave you will give her your little present as a thankyou for looking after you.",
        "It is the 'lady who obliges' that can confound you; on that point, the simplest way is to quietly consult your hostess."
      ]
    },
    {
      "heading": "The contrast here operates on the basis of reader",
      "text": [
        "perceiving the relationship between the two predicates easy enough and can confound you.",
        "The inferrable predicate for the contrast is therefore something like ease of tipping, and the actual predicates that appear serve to range the two elements – the housemaid and the lady who obliges--at opposite ends of a scale of ease and difficulty: (14) Quite a few of you have asked about tipping, and these days problems can arise.",
        "A nice old-fashioned housemaid, labelled by cap and apron, is easy enough; when you leave you will give her your little present as a thankyou for looking after you.",
        "The `lady who obliges' can confound you; on that point, the simplest way is to quietly consult your hostess.",
        "We would suggest that it is in these more difficult cases, where the contrast-supporting semantic relation is less obvious, or where the contrastive antecedent is less accessible in some other way (for example, in terms of its embeddedness within the structure of the discourse) that the cleft comes into its own.",
        "Evidence for this comes from the fact that de-clefting in the simpler cases such as (15) does not cause loss of coherence: (15) To this the reply is given that from the verse dealing with Boaz there is no proof of divine approval, only that Boaz used this form of greeting.",
        "But in the second verse the angel uses this form of greeting and hence there is evidence of divine approval.",
        "In other cases, however, de-clefting has more disruptive effects.",
        "While contrast is successfully established by the cleft in (12), the de-cleft version, shown in (16), is much less acceptable:",
        "(16) ?Doubling the selling space to 700 square feet was not to be the greatest expense.",
        "7'he new fixtures and fittings to fill this space would be costly.",
        "What is happening in the de-clefted cases in order to disrupt the retrieval of the relationship along which the contrast takes place?",
        "In our discussion of subordination above, we observed that de-clefting gives the impression that the speaker-writer is introducing a new event into the discourse, while in the clefted versions, any events introduced by the state itself are either implicit, or identifiable in the previous context.",
        "In the same way, in the contrast cases, the loss of the cleft causes the content of the de-cleft to be interpreted as a new and distinct thematic development.",
        "In this way, the de-clefted information fails to identify with information already in Acres use COLING-92, NANTES, 23-28 Aoirr 1992 2 8 5 PROC.",
        "OF COLING-92, NANTES.",
        "AuG. 23-28, 1992 the previous context.",
        "Because of this, the identification of the contrastive antecedent, and the semantic information linking it to the current proposition, are not retrieved.",
        "In situations where this relationship is not made clear by means other than the cleft (and it can be effected by intonation, or through the availability of an obvious and immediately-preceding antecedent – we do not suggest that clefts are unique in their contrasting function) the reader's default will be to introduce a new eventuality into the discourse, probably (in the absence of other signals) as a coordination in the discourse structure.",
        "In this way, the information upon which the contrast depends – that the proposition is to be seen as an elaboration on existing content – is not preserved."
      ]
    },
    {
      "heading": "Comments and Conclusions",
      "text": [
        "In this paper, we have tried to show that various apparently unrelated aspects of it-cleft function – subordination, the Known Fact Effect, and the facts surrounding contrast – can be explained in terms of the fact that it-clefts perform a `stativizing' function.",
        "It is as well at this point, however, to sound a cautionary note.",
        "We have not yet examined in full those cases where de-clefting leaves a state-expression.",
        "The prediction is that these cases should not seem as bad as when de-clefting reveals an event-expression, but we have not yet tested the prediction.",
        "A related issue which ought to be amenable to a pragmatic explanation is the unacceptability of it as clefted constituent.'",
        "ft-clefts (and wh-clefts, for that matter) cannot take it as clefted constituent: (17) *It is it that John has decided he wants.",
        "The alternative forms with this and that, however, are acceptable: (18) It is this/that that John has decided he wants.",
        "The restriction on it cannot be accounted for by a simple restriction on pronouns in cleft head position, as personal pronouns can appear.'",
        "An obvious, but incorrect, explanation would be that it is the unstressed variant of that (cf. for example Declerck [1988:14], following Kuroda [19681), and so cannot appear in the cleft's 'stressed' position.",
        "However, we know that it-clefts regularly appear with no stress on the head constituent (cf. Delin [1989] for an analysis); it also appears that it is in any case stressable, as the following (attested) data shows:",
        "(19) S: Judy, is there any more soap?",
        "J: If you look in the basket there's that purple one S: I thought you were drying some out on the 'Ball (p.c.)",
        "has pointed out that it is not acceptable as complement of a copular sentence whose subject is it in any case: e.g. •it's it vs. that's it.",
        "°Ball [1991] and p.c., in her study of the development of the it-cleft from Old English to Late Modern English, finds no occurrences of it in focus position either in the modern-day it-cleft or in any of its ancestors.",
        "This is in spite of the fact that the paradigm of personal pronouns in focus position can be considered complete around the 15th century, with objective case pronouns (e.g. it was me) appearing in the 16th (Ball [1991:274]).",
        "window.",
        "What happened to IT?",
        "J: That's it S: Oh, so it is A second plausible explanation may be that it, unique among the pronouns, has no contrastive reading (cf. Werth [1984:134]).",
        "A contrastive function, however, does not appear to be obligatory for it-clefts anyway, as Declerck [1988] among others points out.",
        "it-clefts are frequently found with old, non-contrastive, anaphoric information in the clefted constituent:",
        "(20) A: Joe Wright you mean",
        "B: Yes yes A: I thought it was old Joe Wright who'd walked in at FIRST and Prince's [1978:898] written example: (21) It was also during these centuries that a vast internal migration ... from the south northwards took place, a process no less momentous than the Amhara expansion southwards during the last part of the 19th century A possible explanation for itlessness in it-clefts may be found in work by Linde [1979], who relates the alternation of it and that to the 'in focus' status of the referent in relation to the structure of the discourse.",
        "In her study of subjects' descriptions of their apartments, she notes that it is preferred for 'reference within the discourse node in focus', which Linde takes to be a continuation of a segment of discourse describing the same room in the apartment.",
        "That is used for reference within the discourse node in focus only when there is some contrast to a preceding node; most of the time, that is used for transitions between nodes.That is, when a room is being described, a second room may be described as leading off chat.",
        "That therefore tends to mark progressions from one node to the next.",
        "Can we therefore expect the it-lessness of it-clefts to relate to their position in the discourse structure?",
        "That is, do it-clefts appear only in these node-transition situations, and not in the positions of same-node reference?",
        "We would expect that an exploration of the lack of it in clefts along these lines might be fruitful."
      ]
    }
  ]
}
