{
  "info": {
    "authors": [
      "Michael White"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-1040",
    "title": "Conceptual Structures and CCC: Linking Theory and Incorporated Argument Adjuncts",
    "url": "https://aclweb.org/anthology/C92-1040",
    "year": 1992
  },
  "references": [
    "acl-J88-2003"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In Combinatory Categorial Grammar (CCG) [Ste90, Ste91], semantic function-argument structures are corn-positionally produced through the course of a derivation.",
        "These structures identify, inter atia, which entities play the same roles in different events for expressions involving a wide range of coordinate constructs.",
        "This sameness of role (i.e.",
        "Thematic) information is not identified, however, across cases of verbal diathesis.",
        "To handle these cases as well, the present paper demonstrates how to adapt the solution developed in Conceptual Semantics [Jac90, Jac91] to fit the CCG paradigm.",
        "The essence of the approach is to redefine the Linking Theory component of Conceptual Semantics in terms of CCG categories, so that derivations yield conceptual structures representing the desired thematic information; in this way no changes are required on the CCG side.",
        "While this redefinition is largely straightforward, an interesting problem arises in the case of Conceptual Semantics' Incorporated Argument Adjuncts.",
        "In examining these, the paper shows that they cannot be treated as adjuncts in the CCG sense without introducing new machinery, nor without compromising the independence of the two theories.",
        "For this reason, the paper instead adopts the more traditional approach of treating them as oblique arguments."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The present paper represents the first attempt to integrate Mark Steedman's theory of Combinatorial Categorial Grammar (CCG) [Ste90, Ste91] with Ray Jackendoff's theory of Conceptual Semantics [Jac90, Jac911.",
        "The former is known for its successful treatment of long-distance dependencies, coordination, and, more recently, matters of discourse focus relating to intonation--none of which have been treated within Conceptual Semantics.",
        "The latter is known for its development of conceptual structures, which are mental representations intended to serve as the link between language and other areas of cognition, e.g. vision, action and inference – which CCG stops short of.",
        "Since CCG is a lexically oriented theory of grammar, the two are entirely compatible, as well as complementary.",
        "The immediate motivation to attempt such an integration, and the focus of the present paper, is CCG's incomplete treatment of sameness of role (i.e. thematic) information.",
        "In CCG, semantic function-argument structures are compositionally produced through the course of a derivation.",
        "These structures identify, inter alia, which entities play the same roles in different events for expressions involving a wide range of coordinate constructs.",
        "For example, the semantic function-argument structure shown in (lb) is derived for the sentence in (la) via type-raising, composition, and coordination of the bracketed non-standard constituent, following the analysis of Dowty [Dow88]:1 (la) Jack filled [the urn with coffee] and [the thermos with milk].",
        "(lb) (fill' urn' coffee' jack') & (fill' thermos' milk' jack') Of course, such semantic function-argument structures are intended only for illustrative purposes; indeed, according to Steedman, semantic constants like urn' are \"mere placeholders for a real semantics, intended to do no more than illustrate this compositionality.\"",
        "Nevertheless, we may glean from these structures the requirement that urn' and thermos' play the same semantic role, since they are both first arguments to fill', and likewise for coffee' and milk', since they are both second arguments, In the terminology of Conceptual Se-mantles, these requirements may be restated in terms of thematic roles as follows: urn' and Thermos' share the thematic role Goal in their respective events; like"
      ]
    },
    {
      "heading": "'The semantic role of determiners and tense will be ignored in this paper.",
      "text": [
        "Acres DE COLING-92, NAMES, 23-28 Aoirr 1992 2 4 6 PROC.",
        "op COLING-92, NaraEs, Am.",
        "23-28.",
        "1992 wise, coffee' and milk' share the thematic role Theme.' Now, while CCG can thus be said to identify thematic information across a wide range of expressions not easily analyzed in other theories, it does not do so across cases of verbal diathesis (i.e, argument structure alternations).",
        "For example, consider (2), together with two possible sets of interpretations that follow:",
        "(2a) Jack filled the urn {with decal.).",
        "(2b) The urn filled {with decaf).",
        "(2c) Coffee filled the urn {* with decaf}.",
        "(3a) fill' urn' {decaf I jack' (3b) fill' {decaf'} urn' (3c) fill' urn' coffee' (4a) fill,,' urn' {decaf'} jack' (4b) filly' {{decaf'} urn' (4c) fill,' urn' coffee'",
        "Here it would not do to derive the function-argument structures shown in (3), as they incorrectly equate semantic roles in some cases.",
        "For example, the roles of jack' and coffee' are incorrectly said to he the same for Jack filled the urn and Coffee filled the urn.",
        "This problem may be avoided by introducing distinct constants filk ' (with possibly varying anities), as shown in (4).",
        "Note, however, that this approach is incomplete, insofar as it fails to equate any semantic roles across the functions filk ', at least in the absence of further conditions on these functions.",
        "To handle these cases as well, the present paper demonstrates how to adapt the solution developed in Conceptual Semantics to fit the CCG paradigm.",
        "This approach may be seen as one method of specifying, in a principled fashion, the further conditions on constants like fill' necessary to give a complete account of thematic role identities.' It should not be viewed, however, as a variant of purely syntactic approaches to verbal diathesis, such as the Unaccusative Hypothesis [Bur861 in GB, which posit movement between an underlying and a surface structure and traces to recover thematic roles.",
        "* 2 This restatement is actually a considerable strengthening, as CCG is not committed to anything stronger than the individual thematic role view (cf. [Dower)); that is, it requires no snore than jack' play the \"filler\" role, urn' and thermos' play the \"filled\" role, etc.",
        "'Another viable approach is of course to use meaning postulates.",
        "A detailed discussion of these alternatives is beyond the scope of this paper (though cf. the discussion in Pac9(11).",
        "'Again, cf. also [Jac90) for independent arguments in favor of the Conceptual Semantics approach.",
        "The essence of the present approach is to redefine the Linking Theory component of Conceptual Semantics in terms of CCG categories, so that derivations yield conceptual structures representing the desired thematic information; in this way no changes are required on the CCG side.",
        "While this redefinition is largely straightforward, an interesting problem arises in the case of Conceptual Semantics' Incorporated Argument Adjuncts.",
        "In examining these, the paper shows that they cannot be treated as adjuncts in the CCG sense without introducing new machinery, nor without compromising the independence of the two theories.",
        "For this reason, the paper instead adopts the more traditional approach of treating them as oblique arguments."
      ]
    },
    {
      "heading": "2 Preliminaries",
      "text": [
        "This section reviews the details of CCG and Conceptual Semantics needed to understand their integration."
      ]
    },
    {
      "heading": "2.1 CCG",
      "text": [
        "Example (2) suffices to review the necessary details of CCG.",
        "A CCG derivation starts with lexical lookup, which identifies the functional type and semantics of cads constituent.",
        "For example, the category of the verb fill needed for Jack filled Me urn is as shown in (5):",
        "(5) fill := (S\\NP)/NP : fill_a'",
        "In this notation, a category consists of a syntactic category paired via an infix colon with a semantic function.",
        "Syntactic categories have arguments appearing to the right of slashes, results to the left.",
        "The direction of the slash indicates the direction of the argument.",
        "Thus the syntactic category (S\\NP)/NP defines a function that takes an NP to the right and returns a function from an NP ou the left to an 5.",
        "Categories may combine via forward or backward functional application, indicated as ACTES DE COLING-92, NANTEs, 23-28 /win 1992 2 4 7 l'ltoc.",
        "or COLING-92, Na8rrEs, Auo.",
        "23-28, 1992 > and < in Figure 1.",
        "Categories may also combine by other means such as composition, often yielding multiple derivations of the same string.",
        "For present purposes this is of no significance, as all of the derivations of will produce the same compositional meaning.",
        "Derivations for the rest of the examples in (2) are quite similar, differing only in the lexically specified category for fill."
      ]
    },
    {
      "heading": "2.2 Conceptual Semantics",
      "text": [
        "Example (2) again suffices to review the necessary details of Conceptual Semantics.",
        "The version of Conceptual Semantics presented below is that of [Jac90] prior to the introduction of Linking Theory, plus a few modifications.",
        "Let us begin with the representation of an urn.",
        "Jackendoff represents an urn as the conceptual structure shown in (6):",
        "(6) [Thing URN]",
        "This represents an entity of ontological type Thing that meets the featural description URN.5 To distinguish different urns, I will follow Zwarts and Verkuyl [ZV91] in requiring all conceptual structures to have an index, as shown in (7a):",
        "(7a) [Thing URN]t (7b) Thing(j) URN(j)",
        "Note that under the Zwarts and Verkuyl formalization, (7a) is roughly equivalent to the more familiar (7b).",
        "In addition to the ontological type Thing, an entity may be of type Place, Path, Event, State, Manner or Property.",
        "The Place in the urn, for example, would be represented as in (8a):",
        "(8a) [Place INUThmg URNJA, (8b) Place(p) & IN(j,p) Thing(j) u9N(j)",
        "Here we have a conceptual function IN: Thing ti Place mapping the urn j to the location inside the urn p. Example (8b) is again an approximate notational variant.",
        "Moving on to the stative reading of example (2c), Coffee filled the urn, we introduce the conceptual function BE: Thing x Place State (note that as in this example, ontological categories and indices will often Small caps will be used to indicate features that are atomic in Conceptual Structure, serving only as links to other areas of cognition.",
        "be suppressed for typographical convenience): HEaCOFFEE1i, [IN(EURND1p) 1 FILL J.",
        "(9b) State(s) FILL(s) BE(i,p,․) Extending [Jac90], I have included the conceptual atom FILL in (9a).",
        "As is the case of other categories, this atom serves as a pointer to semantic information not captured by the decomposition.",
        "Thus the state s is to be understood as one characterized by the atom FILL and by the feature BE(i,p).",
        "Note that the variant in (9b) is reminiscent of the neo-Davidsonian approach adopted by Parsons [Par90].",
        "To get the inchoative reading of (2c), we need only add the conceptual function INCH: State Event shown in (10):",
        "The conceptual structure for example (2b), The urn filled {with decal}, would differ minimally from (10) by having [DECAF] as the Theme instead of [COFFEE], or by having the Theme left implicit.",
        "We are now in a position to construct the conceptual structure for example (2a), Jack filled the urn {with decal), by adding the External Instigator function C(AU)S(E): Thing x Event Event and the Actor-Patient function AFF(ECT): Thing x Thing",
        "Here the representation of the inchoative event serving as the second argument of CS has an implicit Theme k, which the with-PP would specify if present.",
        "Note also that the entity [JACK]; serves as both Actor and External Instigator, and likewise [URN]i serves as both Patient and Goal, by virtue of coindexation.",
        "And again, the variant in (11b) indicates the similarity of this approach to the neo-Davidsonian one.",
        "At this point we may observe that representations in (9) - (11) capture the similarities and differences in semantic roles observed in the arguments of the verb",
        "Acres DE COL1NG-92, NANTES, 23-28 Aoirr 1992 2 4 8 PROC.",
        "OF COLING-92, NANTE.s, AUG. 23-28, 1992 fill in (2).",
        "This follows straightforwardly from the inclusion of representations (9) and (10) within (11), together with the semantic coindexation.",
        "Next we turn to a brief description of how these representations are constructed in Pac901.",
        "Two representative lexical entries, that of the stative fill of (2c) and causative-inchoative fill of (2a), are shown below: fill",
        "FILL Thing d, ailing ,j, In (12), the verb fill subcategorizes an object NP indexed j, as well as an external argument indexed i by convention.",
        "Similarly, (13) subcategorizes an object NP and a with-PP.",
        "Arguments to the verb are integrated into the above conceptual structure using the Argument Fusion Rule, which links the coindexed constituents in the obvious way, as long as they are semantically compatible.",
        "entries like (12) and (13) as follows:",
        "Here the subcategorization frames have been replaced by the appropriate CCG categories, and the conceptual structures have been made into the appropriate functions corresponding to the fini ' constants.",
        "Because this information is supplied lexically, no changes need be made on the CCG side.",
        "Thus conceptual structures for sentences like those in (la) and (2) may be easily derived with the addition of just a few more lexical items like those below:6",
        "This section details how the Linking Theory component of Conceptual Semantics can be redefined in terms of CCG categories, so that derivations yield conceptual structures like (9) - (11).",
        "Before introducing Linking Theory, however, we shall first examine how the version of Conceptual Semantics presented in the last section can be adapted to fit the CCG paradigm.",
        "As was suggested in Section 1, the present approach may be seen as specifying constraints on the constants fill ' so that the desired thematic role identities are captured.",
        "This may be done by simply redefining lexical Given such lexical items, the constants appearing in (lb) and (4) may be replaced yielding functions like the first one appearing in Figure 2, which is equivalent modulo an appropriate definition of fl-reduction to the one appearing below it.",
        "Such a definition must mirror that of Argument Fusion, insofar as it must append features specified by the argument to those specified 'This particular with-PP is Dented as semanticedly vacuoua, unlike (say) the with-accompaniment modifier.",
        "by the head.",
        "A schematic version appears in (18):",
        "(18) Argument Fusion as 1-reduction Schema: (Ax.[...",
        "PCFEATS1.. [YFEATSJ,,) [... [ FE yXFEAATTSs ]y",
        "Turning now to the introduction of Linking Theory, we may observe that there is nothing in theory as presented to this point which would eliminate hypothetical verbs such as dellif below [Car88], which would have",
        "(19) meaning Jack filled the urn.",
        "(19) * The urn dellifed Jack.",
        "To capture such generalizations, Jackendoff proposes to eliminate rigid coindexation between syntactic and semantic structures, opting to introduce Linking Theory to handle this task instead.",
        "Lexical entries are therefore modified to indicate only which conceptual constituents must be specified, and not which syntactic constituents must specify them.",
        "The selected conceptual arguments are annotated with an A, or A-marked.",
        "In present terms, this means changing entries like (15) to ones like (20):7 fill, dellif",
        "CS(i, [INCH( [ FBIELL(k, [IN(j)]) I )1) AFF( A,jA) FILL Categories like the one in (15) thus become derived in-TThe with-PP is unelected for exposititory reasons only.",
        "stead of lexically specified, with Linking Theory specifying constraints on such derivations to permit Aji as the only possible argument ordering.",
        "The central idea behind such constraints is as follows: Given (independently motivated) syntactic and semantic hierarchies, do not allow inconsistent orderings.",
        "This is stated more formally in (21): (21) Linking Principle: A semantic function headed by Axj in a CCG category must not have x, si and xi >-.",
        "), xj, or vice-versa, where jsem and -4,yr, encode the semantic and syntactic hierarchies, respectively.",
        "Note that if Actor -<sem Patient and Subject -4„y„ Direct Object, then the ordering Aij (with indices as before) required for dellif is indeed ruled out by the Linking Principle,' As developed so far, the status of the Linking Principle in the present framework is that of a filter on representations.",
        "The Linking Principle may be made more constructive by eliminating syntactic specifications from lexical entries, following (say) Rappaport and Levin [RL88] or Pinker [Pin89], deriving them instead via Linking Rules which obey the Linking Principle.",
        "Jackendoff does not rule out this possibility, but chooses to develop instead an approach in which both syntactic and semantic subcategorization is retained.",
        "I shall part company with Jackendoff on this issue, as I find his arguments in favor of retaining subcategorization unconvincing.",
        "These arguments are twofold.",
        "First, verbs appear to idiosyncratically specify prepositions.",
        "Such verbs may be accommodated within the present framework by simply providing fully specified categories like (15).",
        "Second, and more interestingly, some Incorporated Argument Adjuncts are syntactically obligatory.",
        "This argument presupposes, of course,",
        "the correctness of the Incorporated Argument Adjunct analysis, to which we now turn."
      ]
    },
    {
      "heading": "4 Incorporated Argument Adjuncts",
      "text": [
        "Jackendoff observes that with-PPs may specify an optional Theme argument across a wide range of verbs.",
        "This observation leads him to hypothesize that such with-Themes should not be treated as subcategorized arguments, but rather as adjuncts.",
        "Such an analysis is particulary appealing in cases involving an incorporated Theme, such as butter, as in Jack buttered the bread with that picky stuff.9 We shall see, however, that this analysis cannot be adapted into the present framework without adding substantial new machinery,10 nor without compromising the independence of the two theories.",
        "In contrast, the traditional oblique argument analysis will be seen to surmount these difficulties in a natural way.",
        "Jackendoff's informal version of the With-Theme Adjunct Rule is repeated below:",
        "(22) With-Theme Adjunct Rule: In a sentence containing with NP in the VP, if the Theme position is not indexed in the verb's lexical entry, then the object of with can be interpreted as Theme.",
        "With (22) in mind, one might try to redefine (17) as follows: with Prep (S\\NP) \\ (S\\NP) / NP y (f x) Here with is defined as a function from an NP to a VP-°It should be noted that Jackendoff does not adequately address the issue of why the class of spreads appropriate for the verb butter is larger than the class appropriate for the saint noun.",
        "As was done in an earlier version of this paper.",
        "modifier, where the constant withmeme stands in for the function that fuses the Theme with the specified NP.",
        "A sample syntactic derivation using (23) is shown in Figure 3.",
        "There are two problems with adequately specifying the function withm.... First, one might question its introduction on theoretical grounds, as it marks a substantial departure from the simple rule (18), 1i-reduction as Argument Fusion, compromising the independence of the two theories.",
        "Second, there is an empirical problem of avoiding examples like (2c), * Coffee filled the urn with decaf.",
        "In (22), Jackendoff stipulates that the Theme position be unindexed in the verb's lexical entry.",
        "This argument indexing information is no longer available, however, at the point in the derivation in which the wahmewe constant is to perform its magic, since the function (f x) is already saturated.",
        "Again, while adequate fixes might be possible, any such approach would seem quite ad hoc.",
        "Instead of treating these with-PPs as adjuncts, we may reinterpret Jackendoff's (22) as a Linking Rule for oblique with-Theme PP arguments.",
        "This rule would then be just one of those necessary to derive the category in (15) from the lexical entry in (24) below; other rules would map Actors to Subject NPs, Patients to Direct Object NPs, etc.",
        "Note that in this entry the subcategorization of the Theme argument is indicated to be optional by the curly braces: fill",
        "Under this formulation, both of the problems mentioned above disappear: first, the Theme's specification again becomes like that of any other argument, and second, the ungrammaticality of * Coffee filled the urn with decaf again becomes a straightforward consequence of the independently motivated (Neo) 0 Criterion .",
        "At this point we may return to Jackendoff's argument in favor of retaining syntactic subcategorization.",
        "After having chosen to treat oblique arguments as Incorporated Argument Adjuncts, Jackendoff then observes that they are not always optional.",
        "Rather titan retreat, however, he suggests that these are cases of syntactic subcategorization not matching semantic subcategorization.",
        "For example, consider (25): (25) Jack rid the room {* 0 / of insects).",
        "The verb rid is like empty in taking an of-Theme PP, Acres DE COLING-92, Narrrus, 23-28 /win 1992 2 5 1 PROC.",
        "or COLING-92, Nsrans, Atm.",
        "23-28, 1992 semantically the inverse of the with-Theme PP.",
        "Unlike empty, however, the PP is obligatory for rid.",
        "This leads Jackdendoff to posit a lexical entry like (26), in which the Theme is not A-marked but the PP is obligatory.",
        "Such lexical entries are then used to argue in favor of retaining syntactic subcategorization.",
        "This rather unusual move does not seem to be necessary, however.",
        "* Consider the representation adopted in the present framework, appearing in (27).",
        "This representation adequately captures rid's idiosyncratic selection facts by simply requiring the A-marking of the Theme, forcing the appearance of the with-PP.",
        "Of course, to the extent that the existence of lexical entries like (26) is called into question, the argument following from their existence becomes likewise suspect."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "The present paper has suggested that Conceptual Semantics and Combinatory Categorial Grammar are compatible, even complementary theories.",
        "It has argued that (1) Conceptual Semantics need only be minimally modified to adapt it to the CCG paradigm, thus providing CCG with a more complete account of thematic role identities, and (2) these changes need not affect CCG at all if Conceptual Semantics' Incorporated Argument Adjuncts are treated as oblique arguments.",
        "A Prolog implementation of the framework presented herein is currently in progress.",
        "Future work shall include the incorporation of temporal Modifying Adjuncts and Superordinate Adjuncts into the present framework, as well as the aspectual-type coercions or rules of construal of [MS88, Jac91]."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "Thanks to Mark Steedman, Bob Frank, and Michael Niv.",
        "This research was supported by the following grants: DARPA no.",
        "N00014-904-1863, ARO no.",
        "DAAL 03-89-C-0031, NSF no.",
        "IRI 90-16592, and Ben Franklin no.",
        "91S.3078G1.",
        "The author is supported by an NSF Graduate Fellowship."
      ]
    }
  ]
}
