{
  "info": {
    "authors": [
      "Vladimir Batagelj",
      "Damijana Kerzic",
      "Tomaz Pisanski"
    ],
    "book": "Computational Linguistics",
    "id": "acl-J92-3004",
    "title": "Technical Correspondence: Automatic Clustering of Languages",
    "url": "https://aclweb.org/anthology/J92-3004",
    "year": 1992
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Automatic clustering of languages seems to be one possible application that arose during our study of mathematical methods for computing dissimilarities between strings.",
        "The results of this experiment are discussed."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The purpose of this paper is to show that current mathematics and computer science can offer expertise to various \"soft\" sciences, e.g., linguistics.",
        "Sixty-five languages are automatically grouped into clusters according to the analysis of sixteen common words.",
        "The authors regard the results presented in this paper merely as an example of a possible application of cluster analysis to linguistics.",
        "The results should not be regarded as conclusive but rather as suggestions to linguists that similar projects can be carried out on a much greater scale, hopefully yielding similar results and better understanding of language families.",
        "This is by no means the first application of mathematical methods to this problem; see for instance Kruskal, Dyen, and Black (1971) and Sujold2k et al.",
        "(1987)."
      ]
    },
    {
      "heading": "2. Problem and Data",
      "text": [
        "It is more or less clear that some words are similar in certain languages and dissimilar in other languages.",
        "Obviously two languages are similar if most words are similar.",
        "Therefore the most general problem is to determine for each pair of languages how similar or how dissimilar they are.",
        "Is Spanish closer to Latin than English to Danish?",
        "In general, perhaps such quantitative questions do not always make sense.",
        "But suppose we decide to make an experiment.",
        "Suppose we decide to measure dissimilarity between two languages by defining it in a strict mathematical manner.",
        "From the linguistic viewpoint this may be quite absurd.",
        "Nevertheless we have defined certain ways to measure dissimilarity between two words and used this to measure dissimilarity between two languages.",
        "There are several ways one can define such a dissimilarity.",
        "In this paper we will show some examples.",
        "The choice of the dissimilarity will of course influence the outcome.",
        "It is interesting that changing the choice of the dissimilarity does not affect the outcome too drastically.",
        "It is for the linguists to tell whether this can be interpreted by saying that the results are stable, i.e., \"almost independent\" of the choice of dissimilarity functions and make sense for the languages.",
        "1.",
        "Let u be a word in a language L1 and let v be its translation into another",
        "language L2.",
        "Let d(u, v) be a dissimilarity measure or simply dissimilarity between the two words as it is described below.",
        "Hence d(u, v) is a nonnegative integer.",
        "In order to make things simpler we assume that both languages are written in the same alphabet.",
        "Let us give some examples for dissimilarity d(u, v).",
        "(a) Assume that d1 (u, v) is the minimum number of the letters that have to be inserted or deleted in order to change u into v. For example:",
        "Obviously in order to transform u into v we have to delete the letters \"elly\" and insert the letters \"auch.\"",
        "Hence",
        "(b) The second possibility is the smallest number of substitutions, deletions, and insertions to change u into v. In our example:",
        "We have to substitute the letters \"elly\" with letters \"auch\" and this is the shortest way to change u into v. Both d1 (u, v) and d2(u , v) are called the Levenshtein distance (Kruskal 1983).",
        "(c) We can measure dissimilarity between two words also with the length of their shortest common supersequence (LSCS).",
        "Any \"word\" (string) z is a supersequence of a word u if it can be obtained from u by inserting letters into it.",
        "For example: if u = belly, v = bauch, then some possibilities for their shortest common supersequence are \"bellyauch,\" \"bealulcyh,\"",
        "There are other possibilities for defining dissimilarity d(u, v) that have been used in data analysis; see for instance Kashyap and Oommen (1983).",
        "2.",
        "In our study we have used only written languages and dialects.",
        "We used transliterations into standard Latin (English) alphabet.",
        "The data were provided from a variety of sources such as native speakers and dictionaries.",
        "However, transliterations were not checked.",
        "The translations were not given by experts; hence it is quite likely that there are several inconsistencies present both in translations and in transliterations.",
        "Obviously the choice of a particular method of transliteration and translation may influence the outcome.",
        "The letters that do not appear in the Latin alphabet were changed into similar letters of the Latin alphabet.",
        "For example: in the Slovenian alphabet there are three nonstandard letters 6, §, We have chosen to omit diacritical marks: c, s, and z.",
        "A possible alternative would be to use ch, sh, zh.",
        "Also we omit diacritical marks in other languages.",
        "For instance: a, a, a are represented as a.",
        "3.",
        "We have chosen 16 English words.",
        "Actually, we have started with data in Hartigan's Clustering Algorithms, page 243.",
        "Later we used The Concise Dictionary of 26 Languages in Simultaneous Translation to expand the data.",
        "Over 30 people all over the world have given corrections and data for lesser known languages and dialects.",
        "The resulting data are given in Appendix A.",
        "Only linguists should carefully select the words that would be used in the \"real\" project.",
        "We hope that they will contact us in order to carry out the \"big\" project.",
        "For some well-studied sets of words the reader should consult Kruskal, Dyen, and Black (1971) and Sujold2k et al.",
        "(1987).",
        "4.",
        "The computer program for computing dissimilarity measure uses the data about the languages in the large array shown in Figure 1.",
        "There are m languages and n words in each language.",
        "We have selected m = 65 languages and n = 16 words.",
        "Note that Appendix A gives essentially this array for our experiment.",
        "For instance L1 = Albanian, w12 = keq.",
        "5.",
        "Once we select a dissimilarity measure d(u, v) between two words, the next step is to define the dissimilarity D(L1, L1) between two languages.",
        "There are many possibilities.",
        "We decided to take the sum of dissimilarity measures of words.",
        "Mathematically, it is defined as:",
        "We would like to point out that this is studied by data analysis; the reader is referred to Hartigan (1971) for further discussion and background.",
        "6.",
        "The next step is to select an appropriate clustering method.",
        "There are many different methods available (Hartigan 1971).",
        "We wanted to have the results expressed in the form of a binary tree (see Aho, Hoperoft, and Ullman 1974 for the discussion of binary trees) or more precisely in the form of a dendrogram; see for instance Anderberg (1973) and Gordon (1981).",
        "We selected Ward's method, which tends to give realistic results.",
        "This method is discussed in Anderberg (1973) and Gordon (1981)."
      ]
    },
    {
      "heading": "3. Results and Comments",
      "text": [
        "The results are presented in Appendix B in the form of three dendrograms.",
        "Each of them corresponds to a specified dissimilarity measure.",
        "The three results are not identical; however, they are quite similar.",
        "If we cut the dendrogram horizontally at any height we obtain a partition of the set of the languages into a certain number of parts that we call clusters.",
        "The dendrogram tells us how many clusters are suitable for data that we analyze.",
        "The number of clusters we obtain from the cut at the largest \"jump\" of two neighboring levels of the union.",
        "Looking at our three dendrograms we can easily notice that our data form five clusters:",
        "• Slavic • Germanic • Romance • Indic • all others.",
        "We can also notice that first the Slavic branch is formed.",
        "Next the Germanic and the Romanic languages form their groups (clusters) nearly at the same point.",
        "At the end the Indic languages are branching off the others.",
        "The remaining languages do not form any other evident cluster.",
        "See Figure 2.",
        "The five clusters that are formed are very stable.",
        "Any pair of languages classified in one of our clusters in the first dendrogram are also in the same class in the other two dendrograms.",
        "Notice that in some clusters languages also form subclusters.",
        "For example look at the Germanic languages in any dendrogram where two parts are very pronounced: the Scandinavian languages and the German-related languages and dialects.",
        "It is interesting that the simplest dissimilarity measure d1 (i.e., the number of insertions and deletions) gives the best separation of languages."
      ]
    },
    {
      "heading": "SLAVIC GERMANIC ROMANCE INDIC OTHERS",
      "text": [
        "We can mention that clusters we found with cluster analysis are very close to the language families established in linguistics (Kruskal, Dyen, and Black 1971).",
        "Obviously one could ask the following questions or problems that can only be answered by a large-scale project.",
        "1.",
        "In our case all treated words have equal weight.",
        "The similarity measure between two languages can also be defined in such a way that different weights (based on linguistic theory) are given to the words and/or transformations.",
        "2.",
        "How much does the choice of words influence the final tree structure?",
        "In our analysis English belongs to the Germanic cluster, when we know that it also has a strong Romance component.",
        "3.",
        "Obviously a larger number of words would give a more accurate picture.",
        "The question is: how much and in what way do the results vary if we increase the number of words?",
        "4.",
        "How much would the results differ if we study spoken language instead of written language?",
        "We can consider for example some phonetic properties of written letters or strings of letters.",
        "5.",
        "Any choice of transliteration introduces a \"systematic error\" in the results.",
        "One way of eliminating such an error would be to test for patterns and then not to penalize patterns that occur often.",
        "For example: if we find that \"tch\" \"zh\" very often then we would not count it every time it occurs but only once.",
        "Of course for such precise analysis one needs much better knowledge of the linguistic field than we have as laypersons."
      ]
    },
    {
      "heading": "References",
      "text": [
        "Hartigan, J.",
        "A.",
        "(1971).",
        "Clustering Algorithms.",
        "John Wiley.",
        "Kashyap, R. L., and Oommen, B. J.",
        "(1983).",
        "\"A common basis for similarity measures involving two strings.\"",
        "Intern.",
        "J.",
        "Computer Math., 13: 17-40.",
        "Kruskal, Joseph B.",
        "(1983).",
        "\"An overview of sequence comparison: Time warps, string edits, and macromolecules.\"",
        "SIAM Review, 25(2): 201-237.",
        "Kruskal, Joseph B.; Dyen, Isidore; and Black, Paul.",
        "(1971).",
        "\"Some results from the vocabulary method of reconstructing languages trees.\"",
        "In Lexico-Statistics in Genetic Linguistics, Proceedings of the Yale Conference, Yale University.",
        "SujolcUiC, A.; ;imunovi; Finka B.; Bennett L. A.; Angel J. L.; Roberts D. F.; and Rudan P. (1987).",
        "\"Linguistic microdifferentation on the Island of KorCula.\"",
        "Anthropol.",
        "Ling., 28: 405-432.",
        "The Concise Dictionary of 26 Languages in Simultaneous Translation, compiled by P. M. Bergman.",
        "A Signet Book from New America Library."
      ]
    },
    {
      "heading": "1 ARABIC TUNISIAN 2 BAHASA MALAYSIA 3 CHINESE CANTONESE 4 CHINESE MANDARIN 5 CROATIAN CAKAVSKI - Dialect of Croat 6 CROATIAN KAJKAVSKI - Dialect of Croat 7 GERMAN BAVARIAN 8 GERMAN SWISS DIALECT - Bernese Oberland 9 GERMAN SWISS DIALECT - Northeastern Switzerland 10 ITALIAN NORTHERN LOMBARDY",
      "text": []
    }
  ]
}
