{
  "info": {
    "authors": [
      "Gosse Bouma"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-1018",
    "title": "A Lexicalist Account of Icelandic Case Marking",
    "url": "https://aclweb.org/anthology/C92-1018",
    "year": 1992
  },
  "references": [
    "acl-C86-1045",
    "acl-C86-1050",
    "acl-J92-2003"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Recent theoretical descriptions of the Icelandic case system distinguish between lexical and structural case.",
        "Lexical case is assigned in the lexicon, whereas structural case is assigned in syntax, under the provision that it does not override lexical case assignment.",
        "This analysis is problematic for grammatical theories such as Cate-gorial Unification Grammar (CUG) and Head-driven Phrase Structure Grammar (HPSG) as the introducion of a syntactic case component is incompatible with the lexicalist ideology underlying these frameworks.",
        "Furthermore, the default character of syntactic case introduces a procedural aspect into the grammar which goes against the declarative spirit of unification-based frameworks in general.",
        "In this paper, I propose an alternative analysis, formulated in terms of CUG, in which all case constraints are expressed lexically and in which default reasoning is restricted to nonmonotonic inheritance of lexical information only."
      ]
    },
    {
      "heading": "1 Introduction: Case Marking and Defaults",
      "text": [
        "The Icelandic case marking system' has often been taken as evidence for a distinction between structural (or regular or default) and lexical (irregular, quirky) case marking.",
        "This distinction is introduced to explain the following two facts.",
        "First, most verbs select nominative case marked subjects (1), but a number of verbs select accusative, genitive or dative subjects (2)- (4).",
        "Similarly, most transitive or ditransitive verbs select an accusative direct object (1), but some select a nominative, dative, or genitive (4)-",
        "(6) object.",
        "(1) Stdlkan(N) kyssti drengina(A)",
        "(2) Drengina(A) vantar mat(A) the-boys lacks food (3) Verkjanna(G) g2etir ekki the-pain is-noticeable not (4) Barninu(D) batna veikin(N) the-child recovered-from the-disease (5) Eg hjalpa6i honum(D) I helped him (6) Eg mun sakna hans(G) I will miss him",
        "The fact that the vast majority of subjects and objects is nominative and accusative, respectively, is accounted for by assigning default status to these cases (that is, if nothing is said about the case of a subject or object, assume it must be nominative or accusative, respectively).",
        "Second, passive sentences (7)-(8) and so-called `raising' constructions (9)-(12) exhibit a distinction between regular and irregular case marked NPs.",
        "In transformational terms, the case of regular case marked NPs corresponds with their surface position ((7), (9), and (11)), whereas the case of irregular case marked NPs corresponds to their underlying position ((8), (10), and (12)).",
        "(In these examples, tc represents a lexically case marked NP-trace and t a trace which has not been assigned case (assuming that structural case is only assigned to surface NP positions)).",
        "(7) Drengirnir(N) voru kysstir t the-boys were kissed (8) Honum(D) var hjalpai) to him was helped (9) Ilanti(N) virdist t elska liana] he seems to-love her (10) lIana(A) vir6ist to vanta peningal her seems to-lack money",
        "Preservation of irregular case is particularly striking is a sentence such as (13).",
        "Although, normally, a verb which selects an accusative object always selects a nominative subject when passivized, this is not so in (13), where a raising to object verb has been passived.",
        "The lexical case assigned by the embedded verb vanta is preserved even if raising to object and subsequent passivization takes place.",
        "The interaction of case assignment, raising, and passivization is summarized in the table below (where and I refer to the underlying and surface NP position, respectively).",
        "'The distinction between structural and lexical accusative in passives is needed to account for a sentence such as (13).",
        "Transitive verbs with nominative objects do not passivize (Yip et al., 1987, p. 225).",
        "All previous accounts of these facts' have adopted the following two assumptions:",
        "• Lexical case is assigned in the lexicon (that is, before the lexical and syntactic processes responsible for passive formation and raising have applied) and structural case is assigned in syntax (after all other syntactic processing has been completed).",
        "• Structural case assignment is a default process which can never override lexical case assignments.",
        "'Except Sag et al.",
        "(to appear), whose analysis is in many respects similar to the one developed below.",
        "Andrews' (1982, p. 185) LEG-based account, for instance, assumes two default conventions, applicable to functional structures (that is, after syntactic processing has been completed).",
        "First, if the subject is unmarked for case, (direct and indirect) objects arc accusative by default (i.e. only if they are not lexically case marked), and, second, an argument must be nominative if no other case constraint has been imposed upon it.",
        "The application of the first convention must precede that of the second.",
        "Zaenen et al.",
        "(1985, p. 466) adopt a default case marking convention which appears to be restricted to the lexicon and which assigns nominative case to the highest available grammatical function (i.e. a grammatical function which is present in the argument (or thematic) structure of a verb and which has not been assigned lexical case), and accusative to the next highest available grammatical function.",
        "Zaenen et al.",
        "concentrate primarily on passives and do not present an explicit account of raising constructions.",
        "Yip et al.",
        "(1987), inspired by ideas from autosegmental phonology, Propose a system in which a case tier [NOM Acc] is associated with verbal arguments in syntax in a left-to-right fashion, in such a way that NOM is associated with the leftmost argument that has not been assigned lexical case and ACC is associated with the next available argument.",
        "Their account of raising to object assumes that case association is a cyclic rule and that syntactic (as opposed to lexical) case assignments may be overwritten by syntactic case assignments in higher cycles.",
        "These proposals are problematic for standard unification-based formalisms of the PATR-II variety (Shieber, 1.986a).",
        "The default constraints for nominative and accusative case marking must not apply if a lexical case constraint is present already.",
        "This implies that the default constraints cannot be added to the syntactic rules or lexical entries which introduce subjects and objects, as this would make the constraints absolute.",
        "Rather, syntactic default case marking principles would have to be added as a filter on syntactic structures or as seperate default rules (much like the syntactic feature specification defaults of GPSG) whose application must be intertwined with syntactic processing'.",
        "Admitting such extensions, however, is potentially damaging to the descriptive adequacy of Note that the defaults cannot be 'compiled away' in this case, as is proposed for the feature specification defaults of (;PSG in Shieber (1980).",
        "unification-based formalisms, as the addition of syntactic filters adds a powerful and seemingly unrestricted level of description to the grammar formalism and the addition of syntactic defaults introduces a procedural aspect to syntactic descriptions which is absent in the standard formalism.",
        "The proposals of Andrews (1982) and Yip et al.",
        "(1987) are also a challenge for lexicalist theories such as IIPSG and CUG.",
        "The problem for lexicalist theories is that the default principles above must make use of information which is only available after a certain amount of syntactic processing has taken place.",
        "In raising to object constructions, for instance, the question whether the object must lie assigned accusative case or not can only be answered after it is known whether the subject of the embedded VP is assigned lexical case or not.",
        "These considerations have even been used (in Jacobson, 1990) as arguments against lexicalist accounts of case marking in general.",
        "Below, I will demonstrate that the Icelandic data can be accounted for declaratively and in a lexicalist fashion.",
        "In the next section, I introduce a fragment of CUG including raising verbs and passives.",
        "Next, the distinction between lexical and structural case is accounted for by assuming that case is encoded as a feature-complex and by introducing a system for non-monotonic inheritance of lexical information.",
        "In section r1 1 show that this decomposed case system makes it possible to analyze the case patterns found in passive and raising constructions as a reflection of a partial agreement relation.",
        "The final section compares the present proposal with recent work by Sag et al.",
        "(to appear).",
        "2 Categorial Unification Grammar In this section, I will present a brief outline of Categorial Unification Grammar (CUG), unification-based version of Categorial Grammar (see, among others, Uszkoreit (1986), Kart-tunen (1989), Bomna (1988), and Zeevat (1988), for details).",
        "In particular, the treatment of raising verbs and passives will be adressed.",
        "The categories of categorial grammar can be encoded as feature-structures using the feature CAT( P,G0 ) to represent basic categories and the features VAL (11E), A (UMENT) and DIR(ECTION A LITY ) to represent complex categories.",
        "The category N P\\S, for instance, is translated as: (11) -val [cat s] dir left arg [cat np] cat - The specification [cAT -] is needed only to make complex categories non-unifiable with basic categories.",
        "I will omit this specification in the examples below.",
        "The template system in (15) defines the basic inventory of categories that is assumed in the sequel.",
        "I assume a categorial grammar which provides (at least) the following combinatory rules:",
        "Right Application: all, X/Y /1,Y Left Application: Oa, X Y Y\\X",
        "Right Wrap: 01;30.2, X at a2, X/ Y Y These rules can be thought of as licencing certain operations on strings and feature structures.",
        "This is illustrated for leftward application in (16) below.",
        "(16) Andy dreams, [1] [cat s] val Andy, :A [cat np] dreams, dir left arg All combinatory rules unify the value of the functor daughter with the feature structure of the mother and unify the argument of the fi with the argument (laughter.",
        "Raising verbs subcategorize for a VP-complement (i.e. a category NP\\S) the subject of which is controlled by an NP-argument of the raising verb.",
        "Following Bach (1979) I assume that the controller is always the so-called next-argument-in.",
        "That is, a 'raising to subject' verb such as seem receives the category (NP\\.5)/ VP,",
        "whereas a 'raising to object' verb such as expect is categorized as ( VP.",
        "This implies that such verbs combine with their object using right wraps: (17) expects Bob to go, VP expects to go, VPI NP Bob, NP expects, ( VPINP)I VI' to go, VI' The semantic and syntactic implications of the relation between the controlling NP and the subject of the VP-complement can be implemented by making these two arguments reentrant.",
        "I will ignore this aspect of the analysis below (but see Pollard & Sag (to appear) for an analysis which makes a similar assumption).",
        "Passive auxiliaries subcategorize for a passive TVP (i.e. a category VP/ NP with passive morphology) and a subject NP (that is, I adopt a lexicalized version of the analysis in Bach (1980)).",
        "The fact that the subject is interpreted as the object of the TVP can again be implemented by making these two argument positions reentrant.",
        "Since raising to object verbs are functors which are reducible to '['VP, this analysis predicts that such verbs may be passivized: (18) was expected to go, VP was, VP/TVP expected to go, TVP"
      ]
    },
    {
      "heading": "3 Distinguishing Lexical and",
      "text": []
    },
    {
      "heading": "Structural Case",
      "text": [
        "The most important tool for expressing linguistic generalizations in unification-based formalisms is the template mechanism.",
        "In this section, I introduce the template system for case and show how nonmonotonic template inheritance can be used to account for the default character of structural case.",
        "The distinction between lexical and structural case can be made explicit if case is encoded as 'The feature structures above encode only the directionality of functors, not their mode of combination (i.e. application or wrap).",
        "It is possible to add a feature which encodes this information explicitly.",
        "a feature complex.",
        "That is, instead of using a single feature CASE, I will use three distinct features.",
        "The feature STRUM' distinguishes between structural and lexical case, and the features LEX and NOM distinguish between the various lexical cases and between nominative and accusative structural case, respectively.",
        "The data in section 1 show that genitive and dative case are always lexical (i.e. non-structural), that accusative may be lexical (if assigned to subjects) as well as structural (if assigned to objects), and that nominative is always structural.",
        "Therefore, I assume that the templates Nom, Acc, DA'1', and GEN assign the values specified in table 2 to the features mentioned above.",
        "The",
        "fact that Acc is unspecified for STRUCT is important in the account of case preservation presented below.",
        "Note that these four template definitions denote incompatible feature structures and thus can be used to define the morphological case of NPs in lexical entries:",
        "(19) Shilkan :( NP Norn ).",
        "Drengina :( NP Acc ).",
        "Intransitive and transitive verbs, are defined as follows (where +S'rRucT denotes a positive value for sTRUCT):",
        "(20) IV :( (NP Norn)\\S ).",
        "'I'V :( IV /(NP Ace +Struct) ).",
        "Note that the fact that accusative acts as a structural case for objects has been added explicitly.",
        "Both structural and lexical case assigning verbs are defined in terms of the templates in (20).",
        "For structural case assigning verbs only their category needs to be specified.",
        "The definitions of lexical case assigning verbs, on the other hand, will contain explicit case constraints.",
        "To avoid feature-clashes, I assume that these irregular verbs inherit nonmonotonically from the tem",
        "For raising to subject verbs, for instance, the case of controlling subject is always identical to the subject case constraint specified by the embedded VP (that is, I assume that infinitival verbs may specify structural, nominative, case for their subject).",
        "Thus, raising to subject verbs can be defined as in (23).",
        "The paths (val arg) and (arg arg) refer to the controlling and controlled NP, respectively.",
        "The feature structures denoted by this template and by the templates defined below are shown in figure 1.",
        "Raising to object verbs, on the other hand, do not take nominative objects and thus require that their object is [Nom -].",
        "The other case features again agree:",
        "Note that if the VP-complement assigns nominative case to its subject argument, the object is specified as [sTitucT +, NOM -].",
        "This implies that the object must be accusative, as only the case template Acc will unify with this specification.",
        "In all other cases, the lexical case assigned by the VP-complement will be preserved.",
        "In particular, a lexical accusative subject gives rise to the following derivation:",
        "In these definitions, the `!'-prefix (comparable to the overwrite operator of PATR-II) indicates that the following constraint contains non-default information which may surpress the inheritance of incompatible information from other sources (i.e. the template TV).",
        "Thus, hjalpa6i denotes the feature struture (where IV is left unexpanded):",
        "Note also that vantar assigns lexical (i.e. nonstructural) accusative case to its subject.",
        "The definitions above capture the intuitive difference between structural and lexical case.",
        "If a verb assigns structural, default case, only its category needs to be specified, the relevant case constraints follow by inheritance.",
        "If a verb assigns lexical case, however, case must be specified explicitly.",
        "Although this analysis introduces a limited form of nonmonotonicity, this does not endanger the declarative nature of the grammar.",
        "The definitions in (21) still denote feature structures, and thus, the effect of combining default and non-default information can be computed at compile time.",
        "That is, there are no formal differences between a grammar using nonmonotonic inheritance and a grammar which does not.",
        "Furthermore, in Bouma (to appear) it is demonstrated that the inheritance operation itself can be defined declaratively.",
        "What is gained by using nonmonotonic inheritance is the fact that it supports a direct and natural implementation of certain linguistic observations."
      ]
    },
    {
      "heading": "4 Case Preservation",
      "text": [
        "In this section I argue that the case preservation phenomena which can be observed in raising and passive constructions are a reflection of a (partial) case agreement relation between two NP-argument positions.",
        "[cat 5] val IV dit left dir right val cat si val arg cat np vat arg cat lip val dir left cat up struct [f] struct [2] arg lex [l] lex P.1 lex - nom [2] nom 1101D dir light dir right dir right val cat si val cat si val VP dir left dir left dir right arg arg cat np arg arg cat npl arg cat up struct [II struct [1 arg struct lex lex lex [Al nom",
        "In passives, the question whether a nominative subject will appear or not is determined by the question whether the object of the TVP-complement receives structural case or not.",
        "If the object was marked for one of the lexical cases GEN or DA'r, this case will also appear on the subject.",
        "A structural accusative object gives rise to a [Nom LEX Acc] specification for the subject, which is unifiable with the case template Nom only.",
        "A lexical accusative object (as in (25)), on the other hand, gives rise to a [Nom ACC] subject, a specification which is only unifiable with Acc.",
        "Note that this accounts for example (13), which showed that lexical accusative case must be preserved in passive constructions."
      ]
    },
    {
      "heading": "5 Concluding Remarks",
      "text": [
        "In the previous sections I have argued that, contrary to what has been assumed in previous work, the Icelandic case system does not provide compelling evidence for the introduction of a nonmonotonic syntactic case component.",
        "The same conclusion is reached by Sag et al.",
        "(to appear), who present an analysis formulated in terms of IIPSU (Pollard & Sag, 1987, to appear) which emphasizes the theoretical and methodological advantages of a declarative, hex-icalist, solution.",
        "Their analysis rests on the assumption that case is encoded using the two features CASE and ocAsE, where the latter is used to encode the default case of certain argument positions.",
        "The distinction between structural and lexical case assigning verbs is implemented as follows: Non-quirky verbs require that the DCASE and CASE values of their subjects be identified (structure-shared).",
        "Quirky verbs impose no such identity, and select a particular CASE value for their subject.",
        "It is aSRIIIIICCI that raising verbs specify that the controlling and controlled NP are reentrant.",
        "Note that this predicts that the case of a lexical (quirky) case assigning verb is always preserved.",
        "If a raising verb combines with a VP-complement which assigns structural case to its subject, the features CASE and DCASE of the controlling NI' will also be reentrant.",
        "Since objects are always (lexically) specified as [DCASE Acc], this implies that a raising to object verb which combines with a structural case assigning VP must take an accusative case marked object.",
        "Subjects are assumed to be marked as [m:AsE NOM] by the syntax rule which introduces subjects.",
        "\"Ilms, raising to subject verbs that combine with a structural case assigning VP can only take a nominative subject.",
        "The fact that the case of subjects is determined at least in part by syntax is surprising, given the lexicalist approach advocated by Sag",
        "It is essential for their analysis, however, that subjects of infinitives are not assigned nominative default case in the lexicon, as this would make it impossible for a raising to object verb to combine with its VP-complement'.",
        "In the account above, there was no need to introduce syntactic case marking principles.",
        "One might even maintain that this account, apart from being truly lexical, also has the advantage that it avoids the procedural flavor of the analysis of Sag et al., which, although formulated declaratively, makes essential use of the fact that nominative default case is imposed during syntactic processing, whereas all other case constraints are imposed beforehand (i.e. in the lexicon).",
        "Sag et al., (to appear) do not adress the case marking patterns of passives.",
        "The most obvious way in which their analysis could cover these facts would be to assume the passive lexical rule presented in Pollard & Sag (1987, p. 215).",
        "This seems to account for the facts immediately, given the additional assumption that objects are marked as IDCASE ACC] after passive has applied.",
        "Note, however, that this would imply a slightly different lexical component than is standardly assumed in HPSG, and, perhaps more disturbing, would introduce explicit ordering of lexical rules or rule types."
      ]
    }
  ]
}
