{
  "info": {
    "authors": [
      "Bonnie Jean Dorr"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-2094",
    "title": "Parameterization of the Interlingua in Machine Translation",
    "url": "https://aclweb.org/anthology/C92-2094",
    "year": 1992
  },
  "references": [
    "acl-P90-1017",
    "acl-P92-1033"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The task of designing an interlingual machine translation system is difficult, first because the designer must have a knowledge of the principles underlying cross-linguistic distinctions for the languages under consideration, and second because the designer must then be able to incorporate this knowledge effectively into the system.",
        "This paper provides a catalog of several types of distinctions among Spanish, English, and German, and describes a parametric approach that characterizes these distinctions, both at the syntactic level and at the lexical-semantic level.",
        "The approach described here is implemented in a system called UNITRAN, a machine translation system that translates English, Spanish, and German bidirectionally."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "What makes the task of designing an interlingual machine translation system difficult is the requirement that the translator process many types of language-specific phenomena while still maintaining language-independent information about the source and target languages.",
        "Given that these two types of knowledge (language-specific and language-independent) are required to fulfill the translation task, one approach to designing a machine translation system is to provide a common language-independent representation that acts as a pivot between the source and target languages, and to provide a parameterized mapping between this form and the input and output of each language.",
        "This is the approach taken in UNITRAN, a machine translation system that translates English, Spanish, 'This paper describes research done at the University of Maryland Institute for Advanced Computer Studies and at the MIT Artificial Intelligence Laboratory.",
        "Useful guidance and commentary during the research and preparation of this document were provided by Bob Berwick, Gary Coen, Bruce Dawson, Klan",
        "and German bidirectionally.",
        "The pivot form that is used in this system is a lexical conceptual structure (henceforth, LCS) (see Jackendoff (1983, 1990), Hale & Laughren (1983), Hale & Keyser (1986a, 198613), and Levin Sz Rappaport (1986)), which is a form that underlies the source and target-language sentences.",
        "The pivot approach to translation is called interlingual because it relies on an underlying form derived from universal principles that hold across all languages.",
        "Within this framework, distinctions between languages are accounted for by settings of parameters associated with the universal principles.",
        "For example, there is a universal principle that requires there to be a conceptual subject for each predicate of a sentence.",
        "Whether or not the conceptual subject is syntactically realized is determined by a parameter associated with this principle: the null subject parameter.",
        "This parameter is set to yes for Spanish (also, Italian, Hebrew, etc.)",
        "but no for English and German (also French, Warlpiri, etc.).",
        "The setting of the null subject parameter accounts for the possibility of a missing subject in Spanish and the incorrectness of a missing subject in English and German (except for the imperative form).",
        "This paper argues that, not only should the syntactic component of a machine translation system be parameterized, but other components of a machine translation system would also benefit from the parameterization approach.",
        "In particular, the lexical-semantic component must be constructed in such a way as to allow principles of the lexicon to be parameterized.",
        "Thus, UNITRAN uses two levels of processing, syntactic and lexical-semantic, both of which operate on the basis of language-independent",
        "knowledge that is parameterized to encode language-specific information (see figure 1), Within the syntactic level, the language-independent and language-specific information are supplied, respectively, by the principles and parameters of government-binding theory (henceforth, GB) (see Chomaky (1981, 1982)).",
        "Within the lexical-semantic level, the language-independent and language-specific information are supplied by a set of general LCS mappings and the associated parameters for each language, respectively.",
        "The interface between the syntactic and semantic levels allows the source-language structure to be mapped systematically to the conceptual form, and it allows the target-language structure to be realized systematically from lexical items derived from the conceptual form.",
        "This work represents a shift away from complex, language-specific syntactic translation without entirely abandoning syntax.",
        "Furthermore, the work moves toward a model that employs a well-defined lexical conceptual representation without requiring a \"deep\" semantic conceptualization.",
        "Consider the following example:",
        "(1) (i) I stabbed John (ii) Yo le di purialadas a Juan",
        "`I gave knife-wounds to John' This example illustrates a type of distinction (henceforth called divergence as presented in Dorr (1990a)) that arises in machine translation: the source-language predicate, stab, is mapped to more than one target-language word, dar purialadas a.",
        "This divergence type is lexical in that there is a word selection variation between the source language and the target language.",
        "Such divergences are accounted for by lexical-semantic parameterization, as we will see in section 3.",
        "The following section of this paper will provide a catalog of syntactic divergences between the source and target languages.",
        "The set of parameters that are used to account for these divergences will be described.",
        "In the third section, we will examine the divergences that occur at the lexical-semantic level, and we will see how the parametric approach accounts for these divergences as well.",
        "Finally, we will turn to the evaluation and coverage of the system."
      ]
    },
    {
      "heading": "2 Toward a Catalog of Syntactic Divergences",
      "text": [
        "Figure 2 shows a diagram of the UNITRAN syntactic processing component.",
        "The parser of this component provides a source-language syntactic structure to the lexical-semantic processor, and, after lexical-semantic processing is completed, the generator of this component provides a target-language syntactic structure.",
        "Both the parser and generator of this component have access to the syntactic principles of GB theory.",
        "These principles, which act as constraints (i.e., filters) on the syntactic structures pro",
        "duced by the parser and the generator, operate on the basis of parameter settings that supply certain language-specific information; this is where syntactic divergence are factored out from the lexical-semantic representation.",
        "The GB principles and parameters are organized into modules whose constraints are applied in the following order: (1) X, (2) Bounding, (3) Case, (4) 'Race, (5) Binding, and (6) O.",
        "A detailed description of these modules is provided in Dorr (1987).",
        "We will look briefly at a number of these, focusing on how syntactic divergences are accounted for by this approach.",
        "Figure 3 summarizes the syntactic divergences that are revealed by the parametric variations presented here.'"
      ]
    },
    {
      "heading": "2.1 Principles and Parameters of the X Module",
      "text": [
        "The X constraint module of the syntactic component provides the phrase-structure representation of sentences.",
        "In particular, the fundamental principle of the X module is that each phrase of a sentence has a maximal projection, X-MAX, for a head of category X (see figure 4).2 In addition to the head X, a phrasal projection potentially contains satellites al, 02, Ili, /12, 71, and 72, where al and o2 are any number of maximally adjoined adjuncts positioned according to the adjunction parameter, and ft2 are arguments (subjects and objects) ordered according to the constituent order parameter, and and 72 are any number of minimally adjoined adjuncts positioned according to the adjunction pararneter.3 'The syntactic divergences are enumerated with respect to the relevant parameters and modules of the syntactic component.",
        "The figure illustrates the effect of syntactic parameter settings on the constituent structure far each language.",
        "(In this figure, E stands for English, G for German, S for Spanish, and I for Icelandic.)",
        "2 The possibilities for the category X are: (V)erb, (N )oain, (A)djective, (P)reposition, (C)omplenientizer, and (Deflection.",
        "The Complenientizer corresponds to relative pronouns such as that in the marl that I saw.",
        "The Inflectional category corresponds to modals such as would in I would eat cake.",
        "'This is a revised version of the 5f-Theory presented in Chomsky (1981).",
        "The adjunction parameter will not be discussed here, but see Dorr (1987) for details.",
        ".446...S10.",
        "Given this general X phrase-structure representation, we can now \"fit\" this template onto the phrase structure of each language by providing the appropriate settings for the parameters of the X module.",
        "For example, the constituent order parameter characterizes the word order distinctions among English, Spanish and German.",
        "Unlike English and Spanish, German is assumed to be a subject-object-verb language that adheres to the verb-second requirement in matrix clauses (see Safir (1985)).",
        "Thus, for the sentence I have seen him, we have the following contrasting argument structures:",
        "(2) (i) I have seen him (ii) Yo he vista a el 'I have seen (to him)' (iii) Ich habe ihn gesehen 'I have him seen'",
        "The 31 module builds the phrase-structure from the general scheme of figure 4 and the parameter settings described above.",
        "The principles and pararti-eters of the remaining modules are then applied as constraints to the phrase-structure representation.",
        "We will now examine each of the remaining modules in turn."
      ]
    },
    {
      "heading": "2.2 Principles and Parameters of the Government Module",
      "text": [
        "Government Theory is a central notion to the Case and Trace modules.",
        "A familiar example of the government principle in English is that a verb governs its object.4 We will examine the effect of this module in sections 2.4 and 2.5."
      ]
    },
    {
      "heading": "2.3 Principles and Parameters of the Bounding Module",
      "text": [
        "The Bounding module is concerned with the distance between pairs of co-referring elements (e.g., trace-antecedent pairs).",
        "The fundamental principle of the bounding module is that the distance between co-referring elements is not allowed to be more than one bounding node apart, where the choice of bounding nodes is allowed to vary across languages.",
        "The bounding nodes parameter setting accounts for a syntactic divergence between Spanish and English (and German):",
        "(3) (1) * Who, did you wonder whether t went to school?' (ii) Alden, trees tti que t, fue a la escuela?",
        "The reason (3)(i) is ruled out is that the word who has moved beyond two bounding nodes.",
        "It turns out that the corresponding Spanish sentence (3)(ii) is well-formed since the choice of bounding nodes is different and only one bounding node is crossed.",
        "2.4 Principles and Parameters of the Case Module The Case module is in charge of ensuring that all noun phrases are properly assigned abstract case (e.g., nominative, objective, etc.).",
        "The Case Filter rules out any sentence that contains a non-case-marked noun phrase.",
        "The notion of government is relevant to case assignment since an element assigns case only if it is a governing case-assigner.",
        "The setting of the type of government parameter for English, Spanish, and German characterizes the following divergences:",
        "2.5 Principles and Parameters of the Trace Module After case has been assigned, the Trace module applies the empty category principle (ECP) which checks for proper government of empty elements.",
        "The ECP is parameterized by means of the null subject parameter.",
        "As discussed in section 1, the null subject parameter accounts for the null subject distinction between Spanish, on the one hand, and English and German on the other:",
        "(5) (i) Yo vi el libro Vi el libro (ii) I saw the book * Saw the book (iii) Ich sali das Buch *Sah das Buch",
        "An additional parameter that is relevant to the Trace module is the proper governors parameter.",
        "The choice of proper governor accounts for preposition-stranding distinctions in the three languages:",
        "(6) EN.i.t.xx What store]; did John go to 1,77 (ii).",
        "[N.1./AX Cuil fiends], fue Juan a ti?",
        "(iii)*(u.max Welchem Geschiftb geht Johann zu ti?",
        "2.6 Principles and Parameters of the Binding Module",
        "The Binding module is the final module applied before thematic roles are assigned.",
        "This module is concerned with the coreference relations among noun phrases, and it is dependent on the governing category parameter, which specifies that a governing category for a syntactic constituent is (roughly) the nearest dominating clause that has a subject,.",
        "This parameter happens to have the same setting for English, Spanish, and German, but see Dorr (1987) for a description of other settings of this parameter (e .",
        "g .",
        ", for Icelandic) based on work by Wexler & Manzini (1986).",
        "2.7 Principles and Parameters of the 0 Module The 0 module provides the interface between the syntactic component and the lexical-semantic component.",
        "In particular, the assignment of thematic roles (henceforth 0-roles) after parsing leads into the construction of the interlingual form.",
        "The fundamental principle of the 0 module is the 0-Criterion which states that a lexical head must °As noted in Jaeggli (1981), animate objects (e.g., Guilte) are associated with a clitic pronoun (e.g., to) only in certain dialects such as that of the River Plate area of South America.",
        "'The t, constituent is a trace that corresponds to the noun phrase that has been moved to the front of the sentence.",
        "assign 0-roles in a unique one-to-one correspondence with the argument positions specified in the lexical entry for the head.",
        "One of the parameters associated with the 0 module is the nom-drop paradigm (NDP) parameter (based on work by Safir (1985)).",
        "This parameter accounts for the distinction between English, on the one hand, and Spanish and German, on the other hand, with respect to the subject of an embedded clause:",
        "Once all 0-roles are assigned, the lexical-semantic component of the translator composes the interlingual representation for the source and target language.",
        "The next section will describe the lexical-semantic component, and it will show how this component accounts for a number of divergences outside of the realm of syntax."
      ]
    },
    {
      "heading": "3 Toward a Catalog of Lexical-Semantic Divergences",
      "text": [
        "Figure 5 shows a diagram of the UNITRAN lexical-semantic processing component.",
        "A detailed description of the lexical conceptual structure (LCS) which serves as the interlingua is not given here, but see Dorr (1990b) for further discussion.' 'In general, the LCS representation follows the format proposed by Jackendoff (1983, 1990) which views semantic representation as a subset of conceptual structure.",
        "Jackendoff's approach includes such notions as Event and State, which are specialized into primitives such as GO, STAY, BE, GO-EXT, and ORIENT.",
        "As an example of how the primitive GO is used to represent sentence semantics, consider the following sentence:",
        "(8) (i) The ball rolled toward Beth.",
        "This representation illustrates one dimension (i.e., the spatial dimension) of Jackendoff's representation.",
        "Another dimension is the causal dimension, which includes",
        "What is important to recognize about this processing component is that, just as the syntactic component relies on parameterization to account for source-to-target divergences, so does the lexical-semantic component.",
        "The parameterization of this component is specified by means of language-specific lexical override markers associated with the LCS mapping between the syntactic structure and the interlingua.",
        "We will look briefly at the principles and parameters of the lexical-semantic component, focusing on how a number of divergences are accounted for by this approach.",
        "Figure 6 summarizes the lexical-semantic divergences that are revealed by the parametric variations presented here.9 the primitives CAUSE and LET.",
        "A third dimension is introduced through the notion of field.",
        "This dimension extends the semantic coverage of spatially oriented primitives to other domains such as Possessional, Temporal, Identificational, Circumstantial, and Existential.",
        "9 The divergences are enumerated with respect to the relevant principles and parameters of the lexical-semantic component.",
        "In contrast to the summary of syntactic divergences in figure 3, which enumerates the effect of syntactic parameter settings on constituent structure, the list of divergences presented here is specified in terms of the effect of LCS parameter settings on the realization of specific lexical items.",
        "1.",
        "Syntactic specifier (Pk C Pi u 02) a Logical subject 030 2.",
        "Syntactic complements (pi Ups –Pk) 44, Logical arguments (9i U 02 – (31) 3.",
        "Syntactic adjuncts (ol U .2u y1 U 72) a Logical Muddlers (aj U ce U 71 u 4.",
        "Synactic head (X) a Logical head (X')"
      ]
    },
    {
      "heading": "3.1 Principles and Parameters of the Lexical-Semantic Component",
      "text": [
        "The algorithm for mapping between the syntactic structure and the interlingua relies on the output of 8-role assignment (in the analysis direction) and feeds into 8-role assignment (in the synthesis direction).",
        "The 0-roles represent positions in the LCS representations of lexical entries associated with the input words.",
        "Thus, the construction of the interlin-gnu is essentially a unification process that is guided by the pointers left behind by 0-role assignment.",
        "The mapping, or linking rule between the syntactic positions and the positions of the LCS representation is shown in figure 7.",
        "In terms of 8-role assignment, the phrasal head X assigns 0-roles corresponding to positions in the LCS associated with X'.",
        "For example, the syntactic subject 13k is assigned the logical subject position flik in the LCS.",
        "Once all these roles have been assigned, the interlingual representation is composed simply by recursively filling the arguments of the predicate into their assigned LCS positions.",
        "In addition to the LCS linking rule, there is another general rule associated with the lexical-semantic component: the canonical syntactic representation (CSR ) function.",
        "This function associates an LCS type (e.g., TOM) with a syntactic category (e.g., N-MAX) (see figure 8).",
        "The LCS Linking rule and the CSR function are the two fundamental principles of the lexical.",
        "semantic component.",
        "In order to account for lexical-semantic divergences, these principles must be parameterized.",
        "In general, translation divergences occur when there is an exception to one (or both) of these principles in one language, but not in the other.",
        "Thus, the lexical entries have been constructed to support parametric variation that accounts for such exceptions.",
        "The parameters are used in lexical entries as overrides for the LCS linking rule and CSR function.",
        "We will now examine examples of how each parameter is used.",
        "The 'a' parameter refers to an LCS position that is syntactically realizable in the surface sentence.",
        "This parameter accounts for structural divergence:",
        "(9) (i) John entered the house",
        "(ii) Juan entr6 en la rasa 'John entered (into) the house' Here, the Spanish sentence diverges structurally from the English sentence since the noun phrase (the house) is realized as a prepositional phrase (en la casa).",
        "In order to account for this divergence, the lexicon uses the * marker in the LCS representation associated with the lexical entries for enter and entrar.",
        "This marker specifies the phrasal level at which an argument will be projected: in the Spanish lexical entry, the marker is associated with an LCS position that is realized at a syntactically higher phrasal level than that of the English lexical entry."
      ]
    },
    {
      "heading": "3.1.2 :INT and :EXT Parameters",
      "text": [
        "The :INT and :EXT parameters allow the I,CS linking rule to be overridden by associating a logical subject with a syntactic complement and a logical argument with a syntactic subject.",
        "A possible effect of using these parameter settings is that there is a subject-object reversal during translation.",
        "Such a reversal is called a thematic divergence:",
        "(10) (i) I like Mary (ii) Me gunta Maria"
      ]
    },
    {
      "heading": "'Mary pleases Ins'",
      "text": [
        "Here, the subject of the source-language sentence, I, is translated into an object position, and the object of the source-language sentence Maria is translated into a subject position.",
        "In order to account for this divergence, the lexicon uses the :INT and :EXT markers in the LCS representation associated with the lexical entries for gusfar.",
        "The English lexical entry does not contain these markers since the LCS linking rule does not need to be overridden in this case.",
        "The :CAT marker provides a syntactic category for an LOS argument.",
        "Recall that the CS72, function maps an LCS type to a syntactic category (see figure 8).",
        "When this mapping is to be overridden by a lexical entry, the language-specific marker :CAT is used.",
        "This parameter accounts for categorial divergence:",
        "(11) (i) I am hungry (ii) kin habe Hunger I have hunger'",
        "here, not only are the predicates be and haben lexically distinct, but the arguments of these two predicates are categorially divergent: in English, the argument is an adjectival phrase, and, in German, the argument is a noun phrase.",
        "The :CAT marker is used in the German definition to force the PROP-may argument to be realized as a noun rather than an adjective.",
        "Thus, the CM?.",
        "function is overridden during realization of the word Hunger in this example."
      ]
    },
    {
      "heading": "3.1.4 :DEMOTE and :PROMOTE Parameters",
      "text": [
        "The :DEMOTE and :PROMOTE markers, like the :INT and :EXT markers, allow the LCS linking rule to be overridden by associating a logical head with a syntactic adjunct or complement.",
        "These parameters account, respectively, for denrotional divergence: (12) (i) I like to eat ich esse germ 'I eat likixtgly' and promotional divergence:",
        "(13) (i) John usually goes home (ii) Juan suele it a casa `John tends to go home'",
        "In the first case, the English main verb like corresponds to the adjunct gern in German, and the embedded verb eat corresponds to the main verb essen in German.",
        "In the second case, the English adjunct usually corresponds to the main verb soler in Spanish.",
        "These \"head switching\" divergences are acconmiodated analogously: the :DEMOTE marker is used in the lexical entry for germ and the :PROMOTE no,,cker is used in the lexical entry for solo..",
        "The sixth LOS parameter is the :CONFLATED marker.",
        "This marker is used for indicating that a particular argument need not be realized in the surface representation.",
        "This parameter accounts for conflational divergence Z1.9 in the sentence I stabbed John (see (1) from section 1).",
        "In this example, the",
        "argument that is incorporated in the English sentence is the KNIFE-WOUND argument since the verb stab does not realize this argument; by contrast, the Spanish construction dar puria/adas a explicitly realizes this argument as the word putiatadas.",
        "Thus, the :CONFLATED marker is associated with the KNIFE-WOUND argument in the case of stab, but not in the case of dar."
      ]
    },
    {
      "heading": "4 Evaluation and Coverage",
      "text": [
        "One of the main criteria used for evaluation of the parameterization framework described here is the ease with which lexical entries may be automatically acquired from on-line resources.",
        "While testing the framework against this metric, a number of results have been obtained, including the discovery of a fundamental relationship between the lexical-semantic primitives and aspectual information.",
        "This relationship is crucial for demonstrating the success of the parameterization approach with respect to lexical acquisition.",
        "Details about the lexical acquisition model and results are presented in Dorr (1992).",
        "We have already examined the syntactic and lexical-semantic coverage of the system (see figures 3 and 6 above).",
        "The linguistic coverage of the lexicon is summarized in figure 9."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "The translation model described here is built on the basis of a parametric approach; thus, it is easy to change from one language to another (by setting syntactic and lexical switches for each language) without having to write a whole new processor for each language.",
        "This is an advance over other machine translation systems that require at least one language-specific processing module for each source-language/target-language pair.",
        "The approach is interlingual: an underlying language-independent form of the source language is derived, and any of the three target languages, Spanish, English, or German, can be produced from this form.",
        "Perhaps the most important advance of UNITRAN is the mapping between the lexical-semantic level and the syntactic level.",
        "In particular, the system has been shown to select and realize the appropriate target-language words, despite the potential for syntactic and lexical divergences.",
        "The key to being able to provide a systematic mapping between languages is modularity: because the system has been partitioned into two different processing levels, there is a decoupling of the syntactic and lexical-semantic decisions that are made during the translation process.",
        "Thus, syntactic and LCS parameter settings may be specified for each language without hindering the processing that produces, and generates from, the interlingual form."
      ]
    },
    {
      "heading": "6 References",
      "text": []
    }
  ]
}
