{
  "info": {
    "authors": [
      "Hiroshi Nakagawa"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-1051",
    "title": "Zero Pronouns as Experiencer in Japanese Discourse",
    "url": "https://aclweb.org/anthology/C92-1051",
    "year": 1992
  },
  "references": [
    "acl-C90-2047",
    "acl-P86-1031",
    "acl-P87-1022"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The process of finding the antecedent of zero pronoun, that is indispensable to Japanese language understanding, is the topic of this paper.",
        "Here we mainly concern with discourses comprising two sentences that are in a subordinate relation, especially one of them describes the agent's volitional action and the other describes the reason of the action.",
        "We propose basically two new principles: (1) The agent of an action should experience a certain psychological reason, (2) Predicates reporting someone's psychological state are categorized into 1) weakly or 2) strongly bound to the expected point of view.",
        "Combination of these principles accounts for some problematic Japanese zero anaphora, which cannot be accounted for by the theories so far proposed."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Kuno said in [7] that in Japanese discourses we have to omit as many components in a sentence as possible unless we get any ambiguity.",
        "In fact more components are omitted than expected in actual discourses, because we have a rich variety of linguistic apparatuses to be used to communicate unambiguously.",
        "From the computational viewpoint identifying the antecedent of zero pronoun, which is the omitted part of sentence, is really needed.",
        "For this several theories have been developed.",
        "Among them we first review the two most important theories in analyzing zero pronoun's antecedent in Japanese proposed in 80's. The first one is Centering theory in Japanese proposed by Walker etal [8].",
        "Each utterance of a discourse has a set of discourse entities called forward looking cen-ters, Cf. Cf's for one utterance are ranked according to their discourse salience.",
        "In Japanese Cf's are ranked in the following order of preference: TOPIC>EMPATHY>SUBJ>OBJ2>OBJ Now we have the following constraints and rules to calculate the backward looking cen-ter, Cb, which is regarded as the most salient discourse entity picked up from Cf's of the previous utterance."
      ]
    },
    {
      "heading": "Constraints and Rules",
      "text": [
        "For each Ui in a discourse segment 111,...,Un,",
        "1.",
        "There is precisely one Cb.",
        "2.",
        "Every element of Cf(f/i_i) must be realized in U.",
        "Notice that if the antecedent of zero pronoun in II; is known to be one of Cf(Ui--1), then that Cf is regarded to be realized in U.",
        "3.",
        "The center, Cb(Ui), is the highest ranked element of Cf(Ui_i) that is realized in U.",
        "4.",
        "If some element of Cf(Ui_i) is realized as a pronoun in then so is Cb(l/i).",
        "5.",
        "Transition states to decide Cb(Ui) are ordered: Continuing is preferred to Retaining is preferred to Shifting-1 is preferred to Shifting.",
        "These states are characterized as follows.",
        "Here Cp(Ui) means the highest ranked Cf(Ui).",
        "Continuing: Cb(Ui_i) = Cb(Ui) Cp(Ui) Retaining: Cb(f/i_i) Cb(Ui) Cp(Ui) Shifting-1: Cb(Ui-i) Cb(UO Cp(Ui) Shifting: Cb(Ui-i) t Cb(Ui) CP(U+)",
        "Actually, the antecedent of zero pronoun is determined under satisfying all these constraints and rules.",
        "This centering mechanism can account for a very broad range of Japanese zero pronoun anaphora.",
        "Almost the same centering mechanism applies to Italian pronominal system successfully [2].",
        "Acres DE COLING-92, NANThS, 23-28 Aoirr 1992 3 2 4 PROC.",
        "OF COLING-92, NANTEs, AVG.",
        "23-28, 1992 Another important theory is Property sharing theory proposed by Kameyama [4, 5].",
        "Her theory concerns the interaction between Cb and zero pronouns.",
        "Consider adjacent utterances or a sentence including a subordinated clause.",
        "Two zero pronouns appearing distinct utterances or clauses can retain the same Cb if they share one of the following properties: 1) IDENT-SUBJECT, 2) IDENT alone, 3) SUBJECT alone, 4) both non-IDENT and non-SUBJECT, 5)non-IDENT only, 6)non-SUBJ only, where the descending order means preference, and IDENT is almost the same as, or very near, the empathy proposed by Kuno [7].",
        "Although these theories cover a fairly large part of Japanese zero anaphora resolution, there still remain the problematic cases which can be resolved by neither of them.",
        "In the following sections, we will focus on some of the problematic cases and show how to deal with them."
      ]
    },
    {
      "heading": "2 Interactions between Ita and Kureta",
      "text": [
        "We begin with the following discourse.",
        "Alice ga Betty ni Alice-SUBJ Betty-DAT Carol no koto wo Carol-GEN-NOM-ACC oshie-ta.",
        "inform-PAST Alice informed Betty about Carol.' subj Carol no koto wo (Is -SUBJ Carol-GEN-NOM-ACC sinpai si ta karada.",
        "be anxious PAST because Because (1,,„bi was anxious about Carol.' subj Alice where the last line, and henceforth, shows that the native's intuitive interpretation is that there being the only possible antecedent of the zero subject Cubj, and in this case, it is Alice.",
        "Both the centering algorithm proposed by Walker etal [1, 8] and Kameyama's property sharing constraint [4, 5] predict Alice as a strongly preferred antecedent of the zero subject, 1 subj, of (1).",
        "So, they correctly predict the native's intuition.",
        "Let's look at the case where the second sentence of (1) is replaced with the following.",
        "sinpai site -ita karada.",
        "be anxious being-PAST because `Because 0,„b; was being anxious about Carol.'",
        "where the last line of the above example, and henceforth, indicates the native's intuition of the order of preference for antecedents of 4 ) ,ubi in case we have snore than one possible antecedents.",
        "In (2) both Alice and Betty are the possible antecedent of t .subj, even though Betty is stronger.",
        "Both Belly and Alice can be derived by the theory in [8].",
        "However, since Alice is subject, their theory predicts that Alice is the primary candidate of antecedent of subj.",
        "This is explained by the well known fact that \"ita\"-suffix, which is used in the second sentence in this case, describes the event from an outsider's point of view, which, presumably, makes the antecedent of zero subject of \"ita\"-suffixed verb not be the linguistically salient expressions, in this case, the subject of the first sentence but be some other person.",
        "Therefore the zero subject cls„„ki tends not to corder with the subject of the first utterance Alice which is a linguistically salient expression.",
        "As the result ),“ba tends to corefer with Betty.",
        "Basically this explanation comes from Kaineyama's accounts in [4].",
        "Look at the discourses whose first sentences are the same as the first sentence of (1) and second sentences are the following sentences respectively, in which each of the second sentences describes not a psychological state but a physical action of meeting.",
        "(1).subj Kinoneki de iii -SUBJ yesterday station-LOC Carol to at-ta karada.",
        "Carol-0131 meet-PAST because Because (1),„bi met Carol at the station",
        "`Because 4),„bj was meeting Carol at the station yesterday.'",
        "Nevertheless the contents described in the second sentences are categorically different ones, these two series of discourses, say (1)(2) and (3)(4) respectively, show the similar preferences for (1),,,o.",
        "Therefore the tentative summarization of preference mechanism so far is the following."
      ]
    },
    {
      "heading": "3 Problematic Cases, \"ita -morat-ta\" Combination",
      "text": [
        "Let's compare the following three discourses which consist of two sentences respectively, and whose first sentences are common one shown as follows: Betty ga Alice ni Betty-SUBJ Alice-DAT Carol no koto wo Carol-GEN-NOM-ACC oshiete -morat-ta.",
        "inform -CAUS-PAST 'Bettyi let Alice inform her, about Carol.' The second sentence of the first discourse is: subj Carol no koto wo -SUBJ Carol-GEN-NOM-ACC sinpai site -ita karada.",
        "be anxious being-PAST because `Because 4.,„bi was being anxious about Carol.'",
        "The second sentence of the second discourse is: subj Carol no koto ga -SUBJ Carol-GEN-NOM-OBJ kininatte-ita karada.",
        "feel anxiety -being-PAST because `Because Cub; was feeling anxiety about Carol.'",
        "The second sentence of the third discourse is:",
        "These discourses all have the same \"moratta\" suffixed and \"ita \"-suffixed verbs followed by \"karada\" combination in the first and the second sentence respectively.",
        "In \"oshiete-morat-ta\", \"(te)-morat\" causativizes the verb, namely the agent of the action of asking some action to other one is the antecedent of the subject, and, the more important point is that \"morat-ta\"-suffixed verb describes the action from the subject's point of view.",
        "As the result, in these discourses the empathy locus of the first sentence is Betty.",
        "While they are almost identical in grammatical structures, the preferred antecedents of zero subject 4),„b; are quite different.",
        "Therefore this difference is expected to come from the contents of verb phrase of the second sentences.",
        "First we consider the preference of zero subject based on \"morat-ta\"- \"ita\" combination.",
        "Since Betty is not only the subject but also the empathy locus of the first sentence, and \"ita\"-suffixed verb describes the event from the outsider's view point, namely, from non-empathy locus, Alice should be preferred as the antecedent of zero subject of the second sentence.",
        "Although this expectation coincides with the actual preference of (8), it does not with that of (6) or (7).",
        "This discrepancy cannot be explained by any syntactic theory, Kinou eki de yesterday station-LOC atte -ita meet -being-PAST AcrEs DE COLING-92, NANTES, 23-28 Athr 1992 3 2 6 PROC.",
        "OF COLING-92, NANTES, AUG. 23-28, 1992 because (6), (7) and (8), all have the identical syntactic structure.",
        "Neither the proposed centering theories [1, 8, 4, 5] nor our tentative preference principle 1 can account for this phenomena.",
        "The reason is that (1) they use only the notions of topic, empathy, and the effect of \"ita\" and \"morat-ta\"-suffix, (2) all these discourses are the same in these notions and suffixes.",
        "To explain this discrepancy, hopefully, in more unified fashion in order to be able to apply the resulting theory to a variety of cases, is the real aim of the paper."
      ]
    },
    {
      "heading": "4 Experiencer and Agent of Action",
      "text": [
        "It is cognitively reasonable to assume that when a human agent takes a volitional action it should be the case that the agent has a certain psychological reason.",
        "This assumption is exemplified, for instance, in the following discourse.",
        "John wa sub inui ga",
        "(9) kowakat-ta node ] John-TP-SB [4) -SUBJ dog, -OBJ fear-PAST because ] oi harat-ta.",
        "4); -OBJ make-PAST away `Because John feared the dog;, he made it; away.'",
        "Clearly and intuitively the antecedent of zero subject of the subordinated clause is Jolm who is the topic subject of main clause.",
        "The subject of the main clause should have the psychological reason of his volitional action, oi harat (= make 4) away , (where 4) = the dog) ), and the subordinated clause states that John experienced a certain fear.",
        "The intuition of John being the antecedent of the zero subject supports the assumption that the agent must have the psychological reason.",
        "In other words, the agent of his/her volitional action must be an experiencer of the psychological state which should be the reason for that action.",
        "On the contrary in the following discourse the agent of the action, boku (= I), is not identical with the experiencer of fear, say, John.",
        "Its unacceptability endorses the above assumption.",
        "`Because John feared the dog;, I made it; away.' = inu(=the dog) However if John's fearing can be recognized by sonic other person through observing it, and the agent of the action coincides with this person, the discourse is acceptable as exemplified in the following example.",
        "[ John ga inm wo kowakat-ta [ John-S13 dog; -OBJ fear-PAST you-na node ] boku ga seem because ] 1-SUB (I) obj,i oi harat -ta.",
        "42; -OBJ make away PAST `Because John seemed to fear the dog„ I made it; away.' In this case \"you-na\" used in the subordinated clause makes John's fearing (\"kowakatta\") state be observed from not John but some other not yet specified person, say, X.",
        "Actually after reading the main clause, we know that the agent of the action is the male speaker, I (= boku), and can infer that the observer X coincides with I consistently because X has not yet had any particular referent.",
        "That is why (11) is acceptable.",
        "And this acceptability is accounted for by the above assumption.",
        "Through the careful examination about the actual discourses, we also confirmed that all these kind of phenomena are correctly observed even in the case that two consecutive sentences are in a subordination relation, say, one describes an action taken by the agent and the other gives the reason of that action.",
        "Now we have confirmed the assumption posed at the beginning of this section with some elaborations done in the previous lines, so we state it as the following principle.",
        "Definition 1 (Experiencer) Experiencer is defined as a person who directly experiences a certain psychological state in his/her own mind.",
        "Definition 2 (Observer) Observer is defined as a person who, from his/her point of view, recognizes some other experiencer's psychological state by observing that experiencer.",
        "Principle 2 (Agent is Exp.",
        "or Obs.)",
        "Consider a discourse in which the subordinated sentence (or clause) expresses a psychological reason of the volitional action taken by an agent which main sentence (or clause) describes.",
        "The agent who takes the volitional action should be either the experiencer or observer of the situation described in the subordinated sentence (or clause).",
        "This principle, superficially, seems to be a kind of commonsense inference rule.",
        "However, since it comes from the very nature of human behavior so deeply, it should be regarded as the control hueristics in cognition.",
        "Now we restate the effect of \"ita\"-suffix in terms of this principle.",
        "Consider the following examples.",
        "This sentence is unacceptable or at most marginal because of discrepancy of the agent of action and the experiencer.",
        "In Japanese, even if we consider an observer, he/she could not be the agent of action when the experience, for instances being hungry or being sad, is not observable from outsiders [6].",
        "However if we replace verb \"sui-ta\" with iia-suffixed one, \"suite-ita\", shown in the following, Bill's hunger is known to be observed from other person, in this case Boku(= I) who coincides with the agent of action of giving a piece of bread.",
        "So it does not violate Principle 2.",
        "Actually the following (13) is acceptable under this interpretation.",
        "[ Bill wa onaka ga suite-ita [ Bill-TP-SB be-PAST being hungry node ] Boku ga because ] I-SB hitokire no pan wo yat-ta.",
        "a piece of bread-OBJ give-PAST `Because Bill was being hungry, I gave him a piece of bread.' In conclusion, \"ita\"-suffix makes the event be described from some outsider's point of view.",
        "Therefore by identifying that outsider with the agent of action, the agent becomes to be the observer of the state which is the reason of his/her volitional action.",
        "One of the important issues about Principle 2 is the relation among this principle, Kameyama's property sharing and the centering algorithm [8].",
        "At first glance Principle 2 is exemplified linguistically by subject-empathy( `ident' in her term ) sharing [5], or by the combination of preference for Cb (Backward Looking Center ) continuing and Cf Ranking [8].",
        "Actually sometimes it is the case.",
        "However Principle 2 is based on the very nature of human behavior.",
        "Therefore it generally provides more indirect explanations than their theories do.",
        "But even in the cases their theories do not provide a correct and unique prediction, like (6), (7) and (8), Principle 2 would provide a certain guideline as will be shown in the following section."
      ]
    },
    {
      "heading": "5 Typology of Predicates",
      "text": [
        "It's time to explain the discrepancy of interpretations of (6), (7) and (8) noted in section 3.",
        "Before analyzing (6), (7) and (8), we examine the minimal pairs of these in which non \"ita\"-suffixed verbs are used in the second sentences, like the followings:",
        "In all cases, the antecedent of the zero subject is Betty who is the agent of \"letting her inform\" action described in the first sentence (5).",
        "This fact is one of the consequences derived by Principle 2.",
        "Anyway we can regard Betty as the expected point of view, henceforth called POV, in the second sentences, say, above shown (14), (15) and (16) and also in previously shown (6), (7) and (8).",
        "As the consequence Betty is expected to be the primary candidate of antecedent of zero subject 4),„b; in all these cases.",
        "Now we start to examine the original cases.",
        "First we examine (8).",
        "Verb \"au\" ( meet in English), the stem of the verb \"atte\" used in (8), could describe the meeting event from the outside of the agent who is actually meeting.",
        "In other words a meeting action is observed from the people around as well as the agent him/herself.",
        "From the first sentence (5) we know that the agent of volitional action is Betty who should have the reason of the action in the situation described by the second sentence.",
        "In this case the \"ita\"-suffix is strong enough to take the non-agent outsider's point of view, namely Alice.",
        "As a result Alice took the meeting action and Betty was to be an observer.",
        "Since it coincides with the intuitive preference, and this account relies on Principle 2, we once again confirm that principle.",
        "however the preferences of the previously shown (6) and (7) are, at first glance, the counter examples of the combination of Principle 2 and the linguistic force of \"ita\"-suffix.",
        "Therefore we have to try to find another reason to explain these phenomena.",
        "We do not have any syntactic clue to explain the difference of their preferences, because they are syntactically almost the same.",
        "The next thing we should examine is the contents of verb phrase in the second sentences.",
        "Through careful examining of number of verbs and so called \"subjective adjectives\" ' in sentences of this type of structure, we found inductively that they are categorized into at least three groups as the followings.",
        "POV Neutral Verb \"au\" used in (8) is of this type.",
        "This type of verb describes a physical action which can be described easily and naturally from the point of view of anyone around the agent of this action, of course including the agent him/herself.",
        "As the consequence, the agent of the action described by this type of verb can be interpreted fully under the control of \"ita\"-suffix's force.",
        "By combining this categorization and Principle 2 we can account for the discrepancy of preference among (6), (7) and (8) as following.",
        "The preference of (8) has been already accounted for in this section, which actually uses the nature of POV Neutral Verb, \"au\".",
        "Notice that due to the first sentence (5) the agent of volitional action \"oshie-te-morat\" (let her inform) is known to be Betty who should have the reason of the action in the situation described by the second sentence (6).",
        "By Principle 2 (6) describes Betty's experience that causes her volitional causative action \"oshie-te-morat.\" As a result the antecedent of the zero subject is primarily Betty.",
        "However since verb \"sinpai-suru\"(be anxious) of (6) is Weak POV Bound, due to the effect of \"ita\"-suffix, it is also possible that non agent, in this case Alice, is the antecedent of the zero subject.",
        "Namely, by \"ita\"-suffix Alice's state of being anxious (\"sinpai suru\") is known to be observed by the original agent Betty.",
        "Thus the intuitive preference is accounted for by the combination of Principle 2, \"sinpai-suru\" being Weak POV Bound, and the effect of \"ita\"-suffix.",
        "As described in the above case, Betty is known to be the salient agent in the second sentence (7).",
        "However since the verb of (7) \"kininaru\" is Strong POV Bound, the zero subject is exclusively the expected point of view, namely the primarily supposed agent Betty even though the verb is \"ita\"-suffixed.",
        "Thus we account for native's intuitive preference systematically.",
        "Intrasentential cases are also accounted for in the same fashion as we did in the discourse cases.",
        "However we omit those due to the space limitation."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "The centering algorithms already proposed account for much broader range of phenomena than our theory covers.",
        "However their algorithms themselves cannot account for certain types of phenomena, which we observe in reason-action type subordinated discourses, etc.",
        "These cases can be dealt with by Principle 2 and predicate categorization especially Strong and Weak POV Bound types as stated in the following principle.",
        "Principle 4 In the subordinated sentence or clause whose verb describes the experiencer's psychological state and is Weak POV Bound, as for the antecedent of zero pronoun, the non-experiencer expected by the force of \"ita\"suffixed verb and by Principle 2 can override the supposed experiencer.",
        "In cases of Strong POV Bound this overriding does not happen.",
        "Incorporating with these principles, the already proposed centering theories could cover much wider zero anaphora phenomena.",
        "Acknowledgments I would like to thank Prof. Takao Gunji, Prof. Takaqi Iida, Dr. Megumi Kameyama, Dr. Ya-suhiro Katagiri, Prof. Satoshi Kinsui, Prof. Yukinori Takubo, Prof. Syn Tutiya for their helpful comments.",
        "I also thank Prof. Livia Polanyi who showed me what an interesting field discourse is.",
        "Part of this work has been done during the author's stay at CSLI, Stanford University in 1990.",
        "This stay is financially supported by The Telecommunications Advancement Foundation in Tokyo."
      ]
    }
  ]
}
