{
  "info": {
    "authors": [
      "Junko Hosaka",
      "Toshiyuki Takezawa"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C92-2120",
    "title": "Construction of Corpus-Based Syntactic Rules for Accurate Speech Recognition",
    "url": "https://aclweb.org/anthology/C92-2120",
    "year": 1992
  },
  "references": [
    "acl-P84-1005"
  ],
  "sections": [
    {
      "heading": "CONSTRUCTION OF CORPUS-BASED SYNTACTIC RULES FOR ACCURATE SPEECH RECOGNITION",
      "text": []
    },
    {
      "heading": "Abstract",
      "text": [
        "This paper describes the syntactic rules which are applied in the Japanese speech recognition module of a speech-to-speech translation system.",
        "Japanese is considered to be a free word/phrase order language.",
        "Since syntactic rules are applied as constraints to reduce the search space in speech recognition, applying rules which take into account all possible phrase orders can have almost the same effect as using no constraints.",
        "Instead, we take into consideration the recognition weaknesses of certain syntactic categories and treat them precisely, so that a minimal number of rules can work most effectively.",
        "In this paper we first examine which syntactic categories are easily misrecognized.",
        "Second, we consult our dialogue corpus, in order to provide the rules with great generality.",
        "Based on both studies, we refine the rules.",
        "Finally, we verify the validity of the refinement through speech recognition experiments."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "We are developing the Spoken Language TRANSlation system (SL-TRANS)[1], in which both speech recognition processing and natural language processing are integrated.",
        "Currently we are studying automatic speech translation from Japanese into English in the domain of dialogues with the reception service of an international conference office.",
        "In this framework we are constructing syntactic rules for recognition of Japanese speech.",
        "In speech recognition, the most significant concern is raising the recognition accuracy.",
        "For that purpose, applying linguistic information turns out to be promising.",
        "Various approaches have been taken, such as using stochastic models[2], syntactic rules[3], semantic information[4] and discourse plans[5].",
        "Among stochastic models, the bigram and trigram succeeded in achieving a high recognition accuracy in languages that have a strong tendency toward a standard word order, such as English.",
        "On the contrary, Japanese belongs to free word order languages[6].",
        "For such a language, semantic information is more adequate as a constraint.",
        "However, building semantic constraints for a large vocabulary needs a tremendous amount of data.",
        "Currently, our data consist of dialogues between the conference registration office and prospective conference participants with approximately 199,000 words in telephone conversations and approximately 72,000 words in keyboard conversations.",
        "But our data are still not sufficient to build appropriate semantic constraints for sentences with 700 distinct words.",
        "Processing a discourse plan requires excessive calculation and the study of discourse itself must be further developed to be applicable to speech recognition.",
        "On the other hand, syntax has been studied in more detail and makes increasing the vocabulary easier.",
        "As we are working on spoken language, we try to reflect real language usage.",
        "For this purpose, a stochastic approach beyond trigrams, namely stochastic sentence parsing[7], seems most promising.",
        "Ideally, syntactic rules should be generated automatically from a large dialogue corpus and probabilities should also be automatically assigned to each node.",
        "But to do so, we need underlying rules.",
        "Moreover, coping with phoneme perplexity, which is crucial to speech recognition, with rules created from a dialogue corpus, requires additional research[8].",
        "In this paper we propose taking into account the weaknesses of the speech recogniton system in the earliest stage, namely when we construct underlying syntactic rules.",
        "First, we examined the speech recognition results to determine which syntactic categories tend to be recognized erroneously.",
        "Second, we utilized our dialogue corpus[9] to support the refinement of rules concerning those categories.",
        "As examples, we discuss formal nouns'.",
        "and conjunctive postpositions2.",
        "Finally, we carried out a speech recognition experiment with the refined rules to verify the validity of our approach."
      ]
    },
    {
      "heading": "2 Issues in HMM-LR Speech Recognition",
      "text": [
        "In the Japanese speech recognition module of our experimental system the combination of generalized LR parsing and Hidden Markov Model (IIMM) is realized as IIMM-Lit [10].",
        "The system predicts phonemes by using an III parsing table and drives IIMM phoneme verifiers to detect/verify them without any intervening structure, such as a phoneme lattice.",
        "The speech recognition unit is a Japanese bun-scion, which roughly corresponds to a phrase and is the next largest unit after the word.",
        "The ending of the bunseisn (phrase) is usually marked by a breath point.",
        "This justifies its treatment as a distinct unit.",
        "A Japanese phrase consists of one independent word (e.g. noun, adverb, verb) and zero, one or more than one dependent words (e.g. postposition, auxiliary verb).",
        "The number of words in a phrase ranges from 1 to 14, and the mean number is about 3, according to our dialogue corpus.",
        "We will clarify the weaknesses of IIMM-Llt speech recognition both in phrases and in sentences."
      ]
    },
    {
      "heading": "2.1 Phrase Recognition Errors",
      "text": [
        "We examined which syntactic categories tend to he erroneously recognized, when using IIMM-LR, phrase speech recognition.",
        "For this purpose, we applied syntactic rules containing no constraints on word sequences°.",
        "This means that any word can follow any word.",
        "Examples (1) and (2) show the results of IIMM-Lit Japanese speech recognition.",
        "The uttered phoneme strings are enclosed in I I.",
        "(1) Isochirawal (this, that) > 1: sochira-wa 2: sochira-wa-hu 3: sochira-hu-wa 4: sochira-hu--wa-hu 5: sochira-wa-hu-hu (2) Iaringatougozaimasul (thank you) 1: ari-nga-to-wa-eN-hu-su-su-su 2: ari-nga-to-wa-eN-hu-su-su 3: ari-nga-to-wa-eN-hu-su-su-u 4: ari-nga-to-wa-eN-su-su 5: ari-nga-to-wa-eN-hu-su-su-su-n",
        "In the examples, the symbols >, ng and N have special meaning:",
        "In (1), after recognizing the first word, the system selected subsequent words solely to produce a phoneme string similar to the original utterance.",
        "(2) is an example of phrase recognition which failed.",
        "Iu this example ton was erroneously recognized as to.",
        "Subsequently, no further correct words were selected.",
        "Examples (1) and (2) both show that tends to select words consisting of extremely few phonemes when it fails in word recognition.",
        "To avoid this problem, precise rules should be written for sequences of words with small numbers of phonemes.",
        "In Japanese, postpositions(e. g. ga, o, wh-pronouns(e.g. itsu, nani, dare)[11], numerals(e.g. ichi, ni, san) and certain nouns(e.g. kata, mono) particularly fit this description."
      ]
    },
    {
      "heading": "2.2 Sentence Recognition Errors",
      "text": [
        "To examine the error tendency of sentence speech recognition we applied a two-step method[12].",
        "First, we applied phrase rules to the IIMM-Lit speech recognition'.",
        "Second, we applied phrase-based sentence rules to the phrase candidates as a post-filter, in order to obtain sentence candidates, while filtering out unacceptable candidates.",
        "We experimented with the 353 phrases making up 137 sentences.",
        "The recognition rate for the top candidates was 68.3 % by exact string matching, and for the top 5 candidates 95.5 %.",
        "Based on the top 5 phrase candidates, we conducted a sentence experiment.",
        "In this experiment we applied loosely constrained sentence rules.",
        "With these rules, approximately 80 % of all the possible combinations of phrase candidates were accepted.",
        "Following are examples which did not exactly match the uttered sentences' .",
        "Notice that misrecog-Mzed words consist of a relatively small number of phonemes, as we have seen in section 2.1.",
        "(3) Ikaingi-ni moushiko-ui-tai-no-desu-ngal would like to register for the conference.)",
        "3a: kaingi-ni moushiao-mi-tai-N-desu-nga 31,: kaingi-ni moushiko-mi-tai-no-desu-ka (4) Ikochiia-wa kaingizimukyoku-desuI 'The global beam width is set for 100 and the local beam",
        "width 10.",
        "'Since the phrase candidates are obtained by the speech recognition, word boundadits art already marked by -.",
        "Acres DE COLING-92.",
        "NiorrEs, 23-28 min' 1992 8 0 7 PROC.",
        "COL1NG-92, Niorms, Ann.",
        "23-28, 1992 (This is the conference office.)",
        "4a: kata-wa kaingizimukyoku-desu",
        "(5) 'down° aringat-ou-gozaima-shi-tal (Thank you very much.)",
        "Sa: goo aringat-ou-gozaima-shi-ta Sb: go-mo aringat-ou-gozaima-shi-ta Sc: mono aringat-ou-gozaima-shi-ta (6) lgozyuusho-to onamae-o onengai-shi-masul (Can I have your name and address?)",
        "6a: gozyuusho-to onamae-o onengai-shi-masu-shi Though the phoneme string in 3a is different from the uttered phoneme string, the difference between no and N in meaning is minor, and has no effect on translation with the current technique.",
        "While (3) is affirmative, 3b is interrogative, which is indicated by the sentence final postposition ka.",
        "This cannot be treated with sentence rules.",
        "To handle tins problem, we need dialogue management.",
        "The uttered phrase kochira-wa in (4), meaning \"this,\" was recognized erroneously as kata-wa in 4a, meaning \"person.\" The word kata belongs to the formal noun group, a kind of noun which should be modified by a verbal phrase [13].",
        "Sentence 4a is acceptable, if modified by a verbal phrase, as in 4a': 4a': midori-no seihukv-o kiteiru kata-wa kaigizimukyoku-desu (The person who is wearing a green uniform is [with] the conference office.)",
        "This is also true of the phrase mono in 5c meaning \"thing,\" which was erroneously recognized instead of doumo meaning \"very much\": 5c': kouka-na mono aringat-ou-gozaima-shi-ta (Thank you for the expensive thing.)",
        "In sentence candidates 5a and 5b, the numeral go, meaning \"five,\" is used.",
        "These sentences may seem strange at first glance, but in a situation such as playing cards, these sentences are quite natural.",
        "If someone plays a 5 when you need one, you would say: \"Thanks for the five.\" Similarly, when you need a 3 and a 5, and someone plays a 3 and after that someone else plays a 5, you would say: \"Thanks for the five, too.\" In the sentence candidate 6a, the conjunctive-postposition (conj-pp) shi is used sentence finally, In principle, a conj-pp combines two sentences, functioning like a conjunction, such as \"while\" and \"though,\" and is used in the middle of a sentence.",
        "Erroneous sentence recognition such as in the case of 3a-b cannot be treated by sentence rules.",
        "Therefore, we are trying to cope with erroneous recognition, as seen in sentence candidates 4a, 5a-c and 6a, with sentence rules."
      ]
    },
    {
      "heading": "3 Dealing with Speech Recognition Errors",
      "text": [
        "We are going to deal with sentences containing the following phrases:",
        "• Phrases with formal nouns • Phrases with numerals • Phrases with conj-pps used in the sentence final position",
        "In order to decide how to cope with the above problems, we used our dialogue corpus.",
        "Currently we have 177 keyboard conversations consisting of approximately 72,000 words and 181 telephone conversations consisting of approximately 199,000 words.",
        "We regard keyboard conversations as representing written Japanese and telephone conversations as representing spoken Japanese.",
        "When retrieving the dialogue corpus, we always compare written and spoken Japanese, in order to clarify the features of the latter.",
        "We examined the actual usage of formal nouns as well as that of conj-pps."
      ]
    },
    {
      "heading": "3.1 Formal Nouns",
      "text": [
        "We examined the behavior of formal nouns, such as kale and mono.",
        "Formal nouns are considered to be a kind of noun which lacks the content usually found in common nouns such as \"sky\" or \"apple.\" They function similarly to relative pronouns and therefore are used with a verbal modifier[13], as in examples 7 and 8: 7 : kinou itta koto-wa torikeshitai.",
        "(I would like to take back what I said yesterday.)",
        "8 : nedan-ga takai mono-ga shitsu-ga ii wakede-wanai.",
        "(It is not always true that an expensive thing has good quality.)",
        "In examples 7 and 8, the formal nouns, koto and mono, are modified by kinou ilia (yesterday said) and nedan-ga lakai (price expensive), respectively.",
        "But it is also true that these nouns behave like common nouns and can be used without any verbal modifier, as in examples 9 and 10:",
        "9 : sore-wa koto desu 7 The dialogue corpus is growing constantly,.",
        "When we retrieved formal nouns, we had 113 keyboard conversations and 96 telephone conversations.",
        "Acres DE COLING-92, NANTES, 23-28 Aotfr 1992 0 8 PROC.",
        "OF COLING-92, NANTEs, Ann.",
        "23-28, 1992 (It is a grave matter.)",
        "Considering the examples 7-10, we could define two kinds of usage for formal nouns.",
        "This distinction is applicable to sentence analysis, but is meaningless from the standpoint of applying syntactic rules as constraints.",
        "In our dialogue corpus, tots, mono, hoe and kala are the most frequently used formal nouns.",
        "Table 1 shows how often the formal nouns are used with a verbal modifier.",
        "We have also retrieved formal nouns used in the sentence initial position, as in example 10.",
        "written Japanese, when we allow only formal nouns preceded by a verbal modifier in the syntactic rules.",
        "Ilowever, the coverage remains at 40 %, which is less than half, in the spoken Japanese we are dealing with.",
        "We have further examined those sentences in which formal nouns are not modified by verbals.",
        "Most of them are modified by phrases consisting of a noun and postposition no, which approximately corresponds to \"of.\" Further, some are modified by phrases consisting of a verb followed by postpositions to and no.",
        "Others are modified by words which can be used exclusively as nominal modifiers such as donna (what kind of) and sons (that).",
        "We found only one example in the keyboard conversation in which a formal noun is not modified at all: 11 : osoraku kyouju-ni koto-no shidai-o tsutaeru koto-ga ii-to omoimasu.",
        "(It might be good if you tell the professor how the thing is going.)",
        "In our dialogue corpus we found 2,491 phrases containing the formal nouns tofu, mono, hoe and kola.",
        "Out of 2,491 examples, there is only one which is not modified at all.",
        "If we define formal nouns as those which are always modified in some manner, i.e. even if we do not allow formal nouns to be used alone, the coverage still exceeds 99 %.",
        "Since the occurrence rate of formal nouns without any modifier is very low, we can treat the usage of formal nouns (as in examples 9-11) as semi-frozen expressions."
      ]
    },
    {
      "heading": "3.2 Conjunctive Postpositions",
      "text": [
        "Japanese postpositions such as go, o and which function as case markers, are usually attached to nominals.",
        "Different from this kind of postposition, conj-pps such as ga, le and ha are used after verbals.",
        "Conj-pps combine two clauses, functioning similarly to conjunctions such as \"because\" and \"while,\" and are thus often used in the middle of a sentence, as in example 12.",
        "But they can also be used in the sentence final position, as in example 13.",
        "12: mousikomi-tai-no-desu-ga, DAT monsikomiyousi-o ookurikudasai.",
        "AKK Because I would like to apply for the conference, please send me a registration form.",
        "13: mousikomi-tai-no-desu-ga. DAT I would like to apply for the conference, ...",
        "Example 13 sounds vague, if uttered in isolation.",
        "There should follow some additional words to express the complete meaning.",
        "Sentences finishing with a conj-pp leave the interpretation to the hearer.",
        "And, in general, the hearer can correctly interpret the sentence from the context.",
        "Understanding conj-pps, therefore, plays an important role in treating spoken Japanese.",
        "In the dialogue corpus the following conj-pps are used: ga (because, while), node and nde (because), ie.",
        "andde (and), aura (because, after), keredomo, keredo, kedo and tedomo (though, but), shi (and, and then), monocle (because), taro (if), to (if, when), ba (if) and nagara (while).",
        "Table 2 shows conj-pps used sentence finally.",
        "According to 'fable 2, the conj-pp ga is the one most used in keyboard conversations.",
        "While the usage of conj-pps in keyboard conversations is heavily - concentrated on ga with an occurrence rate of 85%, it is more balanced in telephone conversations.",
        "In addition toga (38%), keredomo (30%) and conj-pps which carry a similar meaning such as keredo, kedo and kedomo are frequently used.",
        "In telephone conversations, node (13%) is also frequently used.",
        "Treating only the six conj-pps in sentence final position, the coverage reaches 91% for spoken Japanese.",
        "Differentiating conj-pps which can be used in sentence final position from those which Call be used only in the middle of a sentence is also supported by the speech recognition results[141.",
        "The conj-pps ski and cha are especially subject to erroneous recognition.",
        "nde 0 0 5 1 le 8 3 23 3 de 0 0 1 0 taro 6 3 14 2 keredolno 5 2 212 30 keredo 1 0 18 3 kedo 1 0 12 2 kedoino 0 37 5 shi 2 1 10 1 monode 1 0 0 0 tare 0 0 5 1 is 0 0 2 0 be 0 0 2 0 nagara 0 0 1 0"
      ]
    },
    {
      "heading": "3.3 Syntactic Rules for Speech Recognition",
      "text": [
        "Based on the corpus retrieval we decided to deal with formal nouns and conj-pps as described below.",
        "And we decided to treat numerals only in a restricted environment, because they are significant noise factors in speech recognition':",
        "• Phrases with formal nouns must be modified.",
        "• Phrases with numerals can be used only in",
        "certain environments.",
        "Numerals are allowed in addresses, telephone numbers, dates and prices.",
        "Japanese numerals consist of an extremely small number of phonemes, e.g. ichi, ni, san (1, 2, 3) and are therefore especially easy to misrecognize.",
        "'Thus, they should be strongly constrained.",
        "The domain we have chosen is limited to dialogues between an international conference receptionist and prospective participants and we are going to deal only with the anticipated usage in the domain.",
        "Another condition, such as playing cards, will be treated when speech recognition is further improved.",
        "• We classify conj-pps into two groups: conj-pps which can be used in the sentence final position as well as in the middle of a sentence, and conj-pps which can be used only in the middle of a sen ten ce.",
        "We refined the loosely constrained syntactic rules introduced in section 2.2.",
        "In the new version of the sentence rules, formal nouns, numerals and conj-pps are more precisely treated.",
        "In the following, we explain the rules for formal nouns and conj-pps.",
        "'See Figure 2.",
        "9Numbers greater than ten are in principle the combination of basic numbers.",
        "The format for syntactic rules is as follows: (<CAT1> <--> (<CAT2> <CAT3>)) Nonterminals are surrounded by <>15.",
        "The above rule indicates that CA71 consists of CAT2 and CATS.",
        "To make the distinction between phrase categories which are terminals in phrase-based sentence rules and those which are not, we will write the former all in lower-case.",
        "In the process of sentence construction, phrases containing a formal noun np-formal are treated as follows\":",
        "The above rules say that noun phrases M-NN can, in principle, be modified by some modifier MOD–N.",
        "In the case of a common noun MN, the phrase can be modified but need not be.",
        "But in the case of a formal noun NN–FORM, the phrase must be modified.",
        "Phrases with a conj-pp which is exclusively used in the middle of a sentence vaux-s, those with a conj-pp which is used both in the middle of a sentence and in the sentence final vaux-s+f, and verb phrases without any conj-pps vaux, are treated as follows:",
        "Compared with the first version, which accepts approximately 80 % of the sentence candidates consisting of all the possible combinations of phrase candidates, the refined version only accepts approximately 30 %.",
        "Table 3 shows the size and the perplexity of the phrase rules and phrase-based sentence rules.",
        "We tested the improvement in two ways: speech recognition accuracy and the acceptance rate[12].",
        "To estimate the latter we checked how many sentence candidates were filtered out by applying phrase-based sentence rules as a post-filter.",
        "We verified the rule refinements through comparison of results gained by five different rule sets: the refined version of sentence rules which contain all three refinements (New Grammar); the refined version without conj-pp treatment (No Sentence Final Conj-pp), without formal noun treatment (No Formal Noun Treating), and without numeral treatment (No Numeral Treating); and rules which allow all combinations of phrase candidates (No Grammar).",
        "For the first four of these rule sets we determined ranks based on the probabilities of phoneme strings predicted by syntactic rules, But in the No Grammar case we determined the rank solely based on phoneme probability.",
        "We experimented with the same 353 phrases which make up 137 sentences as in section 2.2.",
        "The phrase recognition rate for the top 5 candidates was again 95.5% by exact string matching."
      ]
    },
    {
      "heading": "4.1 Speech Recognition Accuracy",
      "text": [
        "We conducted speech recognition experiments.",
        "Figure 1 shows the constraint effectiveness of the phrase-based sentence rules given the five conditions examined.",
        "These five conditions are compared in the graph, based on their abilities to correctly recognize the spoken sentences among the top-ranked 20 can-d idates.",
        "While the sentence recognition rate for the top candidates remains 37.2 % when probability is the only factor in determining the candidates, the recognition rate rises to 70.1 % when the refined syntactic rules are applied as constraints.",
        "Differentiating conj-pps is highly effective.",
        "Without this treatment, the recognition rate remains 48.2%.",
        "Formal noun and numeral treatments are not as effective.",
        "Figure 1 indicates",
        "that the effect according to each syntactic constraint is especially distinct up to rank 5, and that the recognition rates saturate when we take into account sentence candidates up to rank 10."
      ]
    },
    {
      "heading": "4.2 Acceptance Rate",
      "text": [
        "We also verified the validity of sentence rules through the acceptance rate.",
        "We crammed how many sentence candidates were filtered out.",
        "Table 4 shows the frequencies of sentences consisting of different numbers of phrases in our test corpus:",
        "Figure 2 shows the acceptance rates when applying four different syntactic rules.",
        "When applying rules which allow all combinations of phrase candidates, the acceptance rate remains 100 %.",
        "The effect of constraints is especially clear for sentences with a small number of phrases.",
        "In sentences with one phrase, the acceptance rate for the revised version is 41%, and for the version without conj-PP constraints 70%.",
        "In comparison with Figure 1, treating numerals contributes toward filtering out sentence candidates rather than raising speech recognition accuracy.",
        "Independent of the constraint strength, the more phrases there are in a sentence, the more effectively the rules work.",
        "The value for a sentence with 8 phrases is unreliable, as we have only one example."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "We have described phrase-based syntactic rules which are used as constraints in the Japanese speech recognition module of our experimental speech-to-speech translation system.",
        "For constructing rules we took into account the error tendency in speech recognition.",
        "We treated precisely those syntactic categories which tend to be recognized erroneously.",
        "To increase the efficacy of each rule, the rule construction is strongly motivated by our dialogue corpus.",
        "By applying the refined phrase-based syntactic rules, the speech recognition rate for the top candidates improved from 37.2 % to 70.1 % and for the top 5 candidates from 73.7 % to 83.9 %.",
        "The implementation of syntactic rules based on our dialogue corpus is continuing in order to increase coverage.",
        "Currently we are studying postposition deletion in nominal phrases, which is one of the features of spoken Japanese.",
        "When adding rules and enlarging vocabulary, we cannot avoid decreasing speech recognition accuracy, but our further experiments showed that careful rule construction filtered out unacceptable sentence candidates much more effectively.",
        "Though we believe that our dialogue corpus for the.",
        "current domain provides enough expressions of spoken Japanese, we are going to apply the same method to other domains to establish the generality of the rules."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The authors wish to thank Dr.A.Kurematsu, President of ATR Interpreting Telephony Research Labs for his continued support, Mr.T.Morimoto for discussion of the various stages of this work, Mr.K.Inoue for his help in database retrieval and Dr.S.Luperfoy and Dr.L.Fais for reading an earlier draft."
      ]
    }
  ]
}
