{
  "info": {
    "authors": [
      "Keith Vander Linden"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P92-1050",
    "title": "The Expression of Local Rhetorical Relations in Instructional Text",
    "url": "https://aclweb.org/anthology/P92-1050",
    "year": 1992
  },
  "references": [],
  "sections": [
    {
      "heading": "INTRODUCTION",
      "text": [
        "Given the prevalence of the use of rhetorical relations in the generation of text (Hovy, 1989; Moore and Paris, 1988; Scott and Souza, 1990), it is surprising how little work has actually been done on the grammatical realization of these relations.",
        "Most systems, based on Mann and Thompson's formulation of Rhetorical Structure Theory (Mann and Thompson, 1988), have adopted simplified solutions to their expression.",
        "If, for example, an action, X, and a purpose for that action, Y, must be expressed, a standard form such as \"Do X in order to Y\" will be generated.",
        "In reality, the purpose relation can be and is expressed in a myriad of different ways depending upon numerous functional considerations.",
        "Consider the following examples: (la) Follow the steps in the illustration below, for desk installation.",
        "(code') (lb) To install the phone on a desk, follow the steps in the illustration below.",
        "(1e) Follow the steps in the illustration below, for installing the phone on a desk.",
        "(1d) For the desk, follow the steps in the illustration below.",
        "These examples of purpose expressions illustrate two issues of choice at the rhetorical level.",
        "First, the purpose clauses/phrases can occur either before or after the actions which they motivate.",
        "Second, there are four grammatical forms to choose from (all found in our corpus).",
        "In (la), we see a \"for\" prepositional phrase with a nominalization (\"installation\") as the complement, in (lb), a \"to\" infinitive form (tnf), in (1c), a \"for\" preposition with a gerund phrase as a complement, and This work was supported in part by NSF Grant IRI-9109859.",
        "I My convention will be to add a reference to the end of all examples that have come from our corpus, indicating which manual they came from.",
        "(code) and (exc) will stand for examples from the Code-a-Phone and Excursion manuals respectively (Code-a-phone, 1989; Excursion, 1989).",
        "All other examples are contrived.",
        "in (1d), a \"for\" preposition with a simple object as the complement.",
        "Although all these forms are grammatical and communicate the same basic information, the form in (la) was used in the corpus.",
        "I am interested in the functional reasons for this choice.",
        "Another aspect of this analysis to notice is that, contrary to the way rhetorical structure theory has been used in the past, I have allowed phrases, as well as clauses, to enter into rhetorical relations.",
        "This enables me to address the use of phrases, such as those in (la), (lc), and (1d), which hold rhetorical relations with other spans of text.",
        "The proper treatment of alternations such as these is crucial in the generation of understandable text.",
        "In the following sections, I will discuss a methodology for identifying such alternations and include samples of those I have found in a corpus of instructional text.",
        "I will then discuss how to formalize and implement them."
      ]
    },
    {
      "heading": "IDENTIFYING ALTERNATIONS",
      "text": [
        "I identified alternations by studying the linguistic forms taken on by various rhetorical relations in a corpus of instructional text.",
        "The corpus, currently around 1700 words of procedural text from two cordless telephone manuals, was large enough to expose consistent patterns of instructional writing.",
        "I plan to expand the corpus, but at this point, the extent to which my observations are valid for other types of instructions is unclear.",
        "To manage this corpus, a text database system was developed which employs three interconnected tables: the clause table, which represents all the relevant information concerning each clause (tense, aspect, etc.",
        "), the argument table, which represents all the relevant information concerning each argument to each clause (subjects, objects, etc.",
        "), and the rhetorical relation table, which represents all the rhetorical relations be",
        "tween text spans using Mann and Thompson's formalism.",
        "I used this tool to retrieve all the clauses and phrases in the corpus that encode a particular local rhetorical relation.",
        "I then hypothesized functional reasons for alternations in form and tested them with the data.",
        "I considered a hypothesis successful if it correctly predicted the form of a high percentage of the examples in the corpus and was based on a functional distinction that could be derived from the generation environment2.",
        "I have analyzed a number of local rhetorical relations and have identified regularities in their expression.",
        "We will now look at some representative examples of these alternations which illustrate the various contextual factors that affect the form of expression of rhetorical relations.",
        "A full analysis of these examples and a presentation of the statistical evidence for each result can be found in Vander Linden (1992a)."
      ]
    },
    {
      "heading": "PURPOSES",
      "text": [
        "One important factor in the choice of form is the availability of the lexicogrammatical tools from which to build the various forms.",
        "The purpose relation, for example, is expressed whenever possible as a \"for\" prepositional phrase with a nominalization as the complement.",
        "This can only be done, however, if a nominalization exists for the action being expressed.",
        "Consider the following examples from the corpus:",
        "(2a) Follow the steps in the illustration below, for desk installation.",
        "(code) (2b) End the second call, and tap FLASH to return to the first call.",
        "(code) (2c) The OFF position is primarily used for charging the batteries.",
        "(code)",
        "Example (2a) is a typical purpose clause stated as a \"for\" prepositional phrase.",
        "Example (213) would have been expressed as a prepositional phrase had a nominalization for \"return\" been available.",
        "Because of this lexicogrammatical gap in English, a \"to\" infinitive form is used.",
        "There are reasons that a nominalization will not be used even if it exists, one of which is shown in (2c).",
        "Here, the action is not the only action required to accomplish the purpose, so an \"-ing\" gerund is used.",
        "This preference for the use of less prominent grammatical forms (in this case, phrases rather 'In the process of hypothesis generation, I have frequently made informal psycholinguistic tests such as judging how \"natural\" alternate forms seem in the context in which a particular form was used, and have gone so far as to document this process in more complete discussions of this work (Vander Linden et al., 1992a), but these tests do not constitute the basis of my criteria for a successful hypothesis.",
        "than clauses) marks the purposes as less important than the actions themselves and is common in instructions and elsewhere (Cumming, 1991)."
      ]
    },
    {
      "heading": "PRECONDITIONS",
      "text": [
        "Another issue that affects form is the textual context.",
        "Preconditions, for example, change form depending upon whether or not the action the precondition refers to has been previously discussed.",
        "Consider the following examples: (3a) When you hear dial tone, dial the number on the Dialpad [4].",
        "(code) (3b) When the 7010 is installed and the battery has charged for twelve hours, move the OFF/STBY/TALK [8] switch to STBY.",
        "(code) Preconditions typically are expressed as in (3a), in present tense as material actions.",
        "If, however, they are repeat mentions of actions prescribed earlier in the text, as is the case in (3b), they are expressed in present tense as conditions that exist upon completion of the action.",
        "I call this the terminating condition form.",
        "In this case, the use of this form marks the fact that the readers don't have to redo the action."
      ]
    },
    {
      "heading": "RESULTS",
      "text": [
        "Obviously, the content of process being described affects the form of expression.",
        "Consider the following examples: (4a) When the 7010 is installed and the battery has charged for twelve hours, move the OFF/STBY/TALK [8] switch to STBY.",
        "The 7010 is now ready to use.",
        "(code)",
        "(4b) 3.",
        "Place the handset in the base.",
        "The BATTERY CHARGE INDICATOR will light.",
        "(exc)",
        "Here, the agent that performs the action determines, in part, the form of the expression.",
        "In (4a), the action is being performed by the reader which leads to the use of a present tense, relational clause.",
        "In (4b), on the other hand, the action is performed by the device itself which leads to the use of a future tense, action clause.",
        "This use of future tense reflects the fact that the action is something that the reader isn't expected to perform."
      ]
    },
    {
      "heading": "CLAUSE COMBINING",
      "text": [
        "User modeling factors affect the expression of instructions, including the way clauses are combined.",
        "In the following examples we see actions being combined and ordered in different ways: (5a) Remove the handset from the base and lay it on its side.",
        "(exc)",
        "(5b) Listen for dial tone, then make your next call (code) (5c) Return the OFF/STBY/TALK switch to STBY after your call.",
        "(code)",
        "Two sequential actions are typically expressed as separate clauses conjoined with \"and\" as in (5a), or, if they could possibly be performed simultaneously, with \"then\" as in (5b).",
        "If, on the other hand, one of the actions is considered obvious to the reader, it will be rhetorically demoted as in (5c), that is stated in precondition form as a phrase following the next action.",
        "The manual writer, in this example, is emphasizing the actions peculiar to the cordless phone and paying relatively little attention to the general skills involved in using a standard telephone, of which making a call is one."
      ]
    },
    {
      "heading": "IMPLEMENTING ALTERNATIONS",
      "text": [
        "This analysis of local rhetorical relations has resulted in a set of interrelated alternations, such as those just discussed, which I have formalized in terms of system networks from systemic-functional grammar (Halliday, 1976)3.",
        "I am currently implementing these networks as an extension to the Penman text generation architecture (Mann, 1985), using the existing Penman system network tools.",
        "My system, called IMAGENE, takes a non-linguistic process structure such as that produced by a typical planner and uses the networks just discussed to determine the form of the rhetorical relations based on functional factors.",
        "It then uses the existing Penman networks for lower level clause.generation.",
        "IMAGENE starts by building a structure based on the actions in the process structure that are to be expressed and then passes over it a number of times making changes as dictated by the system networks for rhetorical structure.",
        "These changes, including various rhetorical demotions, marking nodes with their appropriate forms, ordering of clauses/phrases, and clause combining, are implemented as systemic-type realization statements for text.",
        "IMAGENE finally traverses the completed structure, calling Penman once for each group of nodes that constitute a sentence.",
        "A detailed discussion of this design can be found in Vander Linden (1992b).",
        "IMAGENE is capable, consequently, of producing instructional text that conforms to a formal, corpus-based notion of how realistic instructional text is constructed."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
