{
  "info": {
    "authors": [
      "Josef R. Novak",
      "Nobuaki Minematsu",
      "Keikichi Hirose"
    ],
    "book": "Proceedings of the 10th International Workshop on Finite State Methods and Natural Language Processing",
    "id": "acl-W12-6208",
    "title": "WFST-Based Grapheme-to-Phoneme Conversion: Open Source tools for Alignment, Model-Building and Decoding",
    "url": "https://aclweb.org/anthology/W12-6208",
    "year": 2012
  },
  "references": [
    "acl-N04-1022",
    "acl-N07-1047",
    "acl-N09-4005",
    "acl-P10-1080",
    "acl-P10-2006"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper introduces a new open source, WFST-based toolkit for Grapheme-to-Phoneme conversion.",
        "The toolkit is efficient, accurate and currently supports a range of features including EM sequence alignment and several decoding techniques novel in the context of G2P.",
        "Experimental results show that a combination RNNLM system outperforms all previous reported results on several standard G2P test sets.",
        "Preliminary experiments applying Lattice Minimum Bayes-Risk decoding to G2P conversion are also provided.",
        "The toolkit is implemented using OpenFst."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Grapheme-to-Phoneme (G2P) conversion is an important problem related to Natural Language Processing, Speech Recognition and Spoken Dialog Systems development.",
        "The primary goal of G2P conversion is to accurately predict the pronunciation of a novel input word given only the spelling.",
        "For example, we would like to be able to predict, PHOENIX ?",
        "/f i n I k s/ given only the input spelling and a G2P model or set of rules.",
        "This problem is straightforward for some languages like Spanish or Italian, where pronunciation rules are consistent.",
        "For languages like English and French however, inconsistent conventions make the problem much more challenging.",
        "In this paper we present a fully data-driven, state-of-the-art, open-source toolkit for G2P conversion, Phonetisaurus [1].",
        "It includes a novel modified Expectation-Maximization (EM)-driven G2P sequence alignment algorithm, support for joint-sequence language models, and several decoding solutions.",
        "The paper also provides preliminary investigations of the applicability of Lattice Minimum Bayes-Risk (LMBR) decoding [2; 3] and N-best rescoring with a Recurrent Neural Network Language Model (RNNLM) [4; 5] to G2P conversion.",
        "The Weighted Finite-State Transducer (WFST) framework is used throughout, and the open source implementation relies on OpenFst [6].",
        "Experimental results are provided illustrating the speed and accuracy of the proposed system.",
        "The remainder of the paper is structured as follows.",
        "Section 2 provides background, Section 3 outlines the alignment approach, Section 4 describes the joint-sequence LM.",
        "Section 5 describes decoding approaches.",
        "Section 6 discusses preliminary experiments, Section 7 provides simple usage commands and Section 8 concludes the paper.",
        "2 G2P problem outline Grapheme-to-Phoneme conversion has been a popular research topic for many years.",
        "Many different approaches have been proposed, but perhaps the most popular is the joint-sequence model [6].",
        "Most joint-sequence modeling techniques focus on producing an initial alignment between corresponding grapheme and phoneme sequences, and then modeling the aligned dictionary as a series of joint tokens.",
        "The gold standard in this area is the EM-driven joint-sequence modeling approach described in [6] that simultaneously infers both alignments and subsequence chunks.",
        "Due to space constraints the reader is referred to [6] for a detailed background of previous research.",
        "The G2P conversion problem is typically broken down into several sub-problems: (1) Sequence alignment, (2) Model training and, (3) Decoding.",
        "The goal of (1) is to align the grapheme and phoneme sequence pairs in a training dictionary.",
        "The goal of (2) is to produce a model able to generate new pronunciations for novel words, and the",
        "goal of (3) is to find the most likely pronunciation given the model."
      ]
    },
    {
      "heading": "3 Alignment",
      "text": [
        "The proposed toolkit implements a modified WFST-based version of the EM-driven multiple-to-multiple alignment algorithm proposed in [7] and elaborated in [8].",
        "This algorithm is capable of learning natural GP relationships like igh?/AY/ which were not possible with previous 1-to-1 algorithms like [9].",
        "The proposed alignment algorithm includes three modifications to [7]: (1) A constraint is imposed such that only m-to-one and one-to-m arcs are considered during training.",
        "(2) During initialization a joint alignment lattice is constructed for each input entry, and any unconnected arcs are deleted.",
        "(3) All arcs, including deletions and insertions are initialized to and constrained to maintain a non-zero weight.",
        "These minor modifications appear to result in a small but consistent improvement in terms of Word Accuracy (WA) on G2P tasks.",
        "The Expectation and Maximization steps for the EM training procedure are outlined in Algorithms 2, 3.",
        "The EM algorithm"
      ]
    },
    {
      "heading": "4 Expectation(xT , yV , mX , mY , ?) 5 Maximization(?)",
      "text": [
        "is initialized by generating an alignment FSA for each dictionary entry, which encodes all valid GP alignments, given max subsequence parameters supplied by the user.",
        "Any unconnected arcs are deleted and all remaining arcs are initialized with a non-zero weight.",
        "In Algorithm 2 lines 2-3 compute the forward and backward probabilities.",
        "Lines 4-8 compute the arc posteriors and update the current model.",
        "In Algorithm 3 lines 1-2 normalize the probability distribution.",
        "Lines 3-6 update the alignment lattice arc weights with the new model.",
        "The pronunciation model implemented by the toolkit is a straightforward joint N-gram model.",
        "The training corpus is constructed by extracting the best alignment for each entry, e.g.: a}x b}b a}@ c|k}k a}x b}b a}@ f}f t}t The training procedure is then, (1) Convert aligned sequence pairs to sequences of aligned joint label pairs, (g1:p1, g2:p2, ..., gn:pn); (2) Train an N-gram model from (1); (3) Convert the N-gram model to a WFST.",
        "Step (3) may be performed with any language modeling toolkit.",
        "In this paper mitlm [11] is utilized."
      ]
    },
    {
      "heading": "5 Decoding",
      "text": [
        "The proposed toolkit provides varying support for three different decoding schemes.",
        "The default decoder provided by the distribution simply extracts the shortest path through the phoneme lattice created via composition with the input word,",
        "whereHbest refers to the lowest cost path, Projecto refers to projecting the output labels, w refers to the input word, M refers to the G2P model, and ?",
        "indicates composition."
      ]
    },
    {
      "heading": "5.1 RNNLM N-best rescoring Recurrent Neural Network Language Models have",
      "text": [
        "recently enjoyed a resurgence in popularity in the context of ASR applications [4].",
        "In another recent publication we investigated the applicability of this approach to G2P conversion with joint sequence models by providing support for the rnnlm toolkit [5].",
        "The training corpus for the G2P LM is a corpus of joint sequences, thus it can be used without modification to train a parallel RNNLM.",
        "N-best reranking is then accomplished with the proposed toolkit by causing the decoder to output the N-best joint GP sequences, and employing rnnlm to rerank the the N-best joint sequences, HNbest =NShortestPaths(w ?M) Hbest =Projecto(Rescorernn(HNbest)).",
        "(2) In practice the rnnlm models require considerable tuning, and somewhat more time to train, but provide a consistent WA boost.",
        "For further details on algorithm as well as tuning for G2P see [4; 10]."
      ]
    },
    {
      "heading": "5.2 Lattice Minimum Bayes-Risk decoding for",
      "text": [
        "G2P In [2] the authors note that the aim of MBR decoding is to find the hypothesis that has the ?least expected loss under the model?.",
        "MBR decoding was successfully applied to Statistical Machine Translation (SMT) lattices in [2], and significantly improved in [3].",
        "Noting the similarities between G2P conversion and SMT, we have begun work implementing an integrated LMBR decoder for the proposed toolkit.",
        "Our approach closely follows that described in [3], and the algorithm implementation is summarized in Algorithm 4.",
        "The inputs are the fullphoneme lattice that results from composing the input word with the G2P model and projecting output labels, an exponential scale factor ?, and N-gram precision factors ?0?N .",
        "The ?n are computed using a linear corpus BLEU [2] N-gram precision p, and a match ratio r using the following equations,",
        "how much we trust the raw lattice weights.",
        "After applying ?, E is normalized by pushing weights to the final state and removing any final weights.",
        "In line 2 all unique N-grams up to order N are extracted from the lattice.",
        "Lines 4-10 create, for each order, a context-dependency FST (?n) and a special path-posterior counting WFST (?Rn ), which are then used to compute N-gram posteriors (Un), and finally to create a decoder WFST (?n).",
        "The full MBR decoder is then computed by first making an unweighted copy of E , applying ?0 uniformly to all arcs, and iteratively composing and input-projecting with each ?n.",
        "The MBR hypothesis is then the best path through the result P .",
        "See [2; 3] for further details."
      ]
    },
    {
      "heading": "6 Experimental results",
      "text": [
        "Experimental evaluations were conducted utilizing three standard G2P test sets.",
        "These included replications of the NetTalk, CMUdict, and OALD English language dictionary evaluations described in detail in [6].",
        "Results comparing various configuration of the proposed toolkit to the joint sequence model Sequitur [6] and an alternative discriminative training toolkit direcTL+ [8] are described in Table 1.",
        "Here m2m-P indicates the proposed toolkit using the alignment algorithm from [7], m2m-fst-P",
        "indicates the alternative FST-based alignment algorithm, and rnnlm-P indicates the use of RNNLM N-best reranking.",
        "The results show that the improved alignment algorithm contributes a small but consistent improvement to WA, while RNNLM reranking contributes a further small but significant boost to WA which produces state-of-the-art results on all three test sets.",
        "The WA gains are interesting, however a major plus point for the toolkit is speed.",
        "Table 2 compares training times for the proposed toolkit with previously reported results.",
        "The m2m-fst-P for system for",
        "CMUdict performs %0.27 worse than the state-of-the-art, but requires just a tiny fraction of the training time.",
        "This turnaround time may be very important for rapid system development.",
        "Finally, Figure.",
        "1 plots WA versus decoding time for m2m-fst-P on the largest test set, further illustrating the speed of the decoder, and the impact of using larger models.",
        "Preliminary experiments with the LMBR decoder were also carried out using the smaller NT15k dataset.",
        "The ?n values were computed using p, r, and T from [2] while ?",
        "was tuned to 0.6.",
        "Results are described in Table 3.",
        "The system matched the basic WA for N=6, and achieved a small improvement in PA over m2m-fst-P (%91.80 versus %91.82).",
        "Tuning the loss function for the G2P task should improve performance.",
        "gram orders for the CMUdict 12k/112k test/train set.",
        "Times averaged over 5 run using ctime."
      ]
    },
    {
      "heading": "7 Toolkit distribution and usage",
      "text": [
        "The preceding sections introduced various theoretical aspects of the toolkit as well as preliminary experimental results.",
        "The current section provides several introductory usage commands.",
        "The toolkit is open source and released under the liberal BSD license.",
        "It is available for download from [1], which also includes detailed compilation instructions, tutorial information and additional examples.",
        "The examples that follow utilize the NETTalk dictionary."
      ]
    },
    {
      "heading": "8 Conclusion and Future work",
      "text": [
        "This work introduced a new Open Source WFST-driven G2P conversion toolkit which is both highly accurate as well as efficient to train and test.",
        "It incorporates a novel modified alignment algorithm.",
        "To our knowledge the RNNLM N-best reranking and LMBR decoding are also novel applications in the context of G2P.",
        "Both the RNNLM N-best reranking and LMBR decoding are promising but further work is required to improve usability and performance.",
        "In particular RNNLM training requires considerable tuning, and we would like to automate this process.",
        "The provisional LMBR decoder achieved a small improvement but further work will be needed to tune the loss function.",
        "Several known optimizations are also planned to speed up the LMBR decoder.",
        "Nevertheless the current release of the toolkit provides several novel G2P solutions, achieves state-of-the-art WA on several test sets and is efficient for both training and decoding."
      ]
    }
  ]
}
