{
  "info": {
    "authors": [
      "Oscar Ferrandez",
      "Brett South",
      "Shuying Shen",
      "Stephane Meystre"
    ],
    "book": "BioNLP: Proceedings of the 2012 Workshop on Biomedical Natural Language Processing",
    "id": "acl-W12-2408",
    "title": "A Hybrid Stepwise Approach for De-identifying Person Names in Clinical Documents",
    "url": "https://aclweb.org/anthology/W12-2408",
    "year": 2012
  },
  "references": [
    "acl-C96-1079",
    "acl-P05-1045",
    "acl-W03-0419"
  ],
  "sections": [
    {
      "text": [
        "ized by fragmented and incomplete utterances, lack of punctuation marks and formatting, as well as domain specific language.",
        "These complications, in addition to the fact that some entities can appear both as PHI and non-PHI in the same document (e.g., ?Mr.",
        "Epley?",
        "vs. ?the Epley maneuver?",
        "), make clinical text de-identification a challenging task.",
        "Therefore, although person names de-identification is essentially NER, the unique characteristics of clinical texts make it more interesting and challenging than recognizing names in news articles, which also enhance the motivation for this study.",
        "Several different approaches were proposed to deal with de-identification of clinical documents, and for named entity recognition of person names.",
        "These approaches are mainly focused on either pattern matching techniques, or statistical methods (Meystre et al., 2010), as exemplified below.",
        "Beckwith et al. (2006) developed a de-identification system for pathology reports.",
        "This system implemented some patterns to detect dates, locations, and ID numbers, as well as a database of proper names and well-known markers such as ?Mr.?",
        "and ?PhD?",
        "to find person names.",
        "Friedlin and McDonald (2008) described the Medical De-identification System (MeDS).",
        "It used a combination of methods including heuristics, pattern matching, and dictionary lookups to identify PHI.",
        "Pattern matching through regular expressions was used to detect numerical identifiers, dates, addresses, ages, etc.",
        "; while for names, MeDS used lists of proper names, common usage words and predictive markers, as well as a text string nearness algorithm to deal with typographical errors.",
        "Neamatullah et al. (2008) proposed another rule-based de-identification approach focused on pattern matching via dictionary lookups, regular expressions and context checks heuristics denoting PHI.",
        "Dictionaries made up of ambiguous names and locations that could also be non-PHI, as well as dictionaries of common words were used by this system to disambiguate PHI terms.",
        "Other de-identification systems such as (Aberdeen et al., 2010; Gardner and Xiong, 2009) use machine learning algorithms to train models and predict new annotations.",
        "The key aspect of these systems is the selection of the learning algorithm and features.",
        "Both (Aberdeen et al., 2010) and (Gardner and Xiong, 2009) use an implementation of Conditional Random Fields (CRF) and a set of learning features based on the morphology of the terms and their context.",
        "One disadvantage of these systems is the need for large amounts of annotated training examples.",
        "As mentioned previously, for detecting person names, we could also use traditional newswire-trained NER systems.",
        "NER has long been studied by the research community and many different approaches have been developed (Tjong Kim Sang and De Meulder, 2003; Doddington et al., 2004).",
        "One successful and freely available named entity recognizer is the Stanford NER system (Finkel et al., 2005), which provides an implementation of linear chain CRF sequence models, coupled with well-engineered feature extractors for NER, and trained with newswire documents.",
        "3 Methods As already mentioned, we first selected and ran several existing de-identification and NER systems detecting person names in our clinical documents.",
        "Afterwards, we devised and present here a novel pipeline of processes designed to improve the PHI recognition task.",
        "3.1 Existing de-identification and NER systems Five available de-identification systems, as well as one newswire-trained named entity recognizer, were selected for an ?out-of-the-box?",
        "evaluation.",
        "The aim of this evaluation was to compare the performance of the various methods and resources when de-identifying person names in our clinical documents.",
        "We included three rule-based de-identification approaches: ?",
        "HMS Scrubber (Beckwith et al., 2006); ?",
        "MeDS (Friedlin and McDonald, 2008); and ?",
        "MIT deid system (Neamatullah et al., 2008).",
        "And two systems based on machine learning classifiers: ?",
        "The MITRE Identification Scrubber Toolkit (MIST) (Aberdeen et al., 2010); and ?",
        "The Health Information DE-identification (HIDE) system (Gardner and Xiong, 2009).",
        "Regarding NER systems, we chose the Stanford NER system (Finkel et al., 2005), which has reported successful results when detecting person names.",
        "These systems were described in Section 2, when we presented related work.",
        "3.2 Our best-of-breed approach Our names de-identification approach consists of a novel pipeline of processes designed to improve the current strategies for person names de-identification.",
        "This system is being developed as an Apache UIMA2 pipeline, with two main goals: 1) Obtain the highest recall (i.e., sensitivity), regardless of the impact on precision; and 2) Improve overall precision by filtering out the false positives produced previously.",
        "These goals correspond to the implementation of the main components of our system.",
        "When we tested existing systems (we will present results for these systems in Table 1), we observed that recall was better addressed by rule-based approaches, while precision was higher applying machine learning-based algorithms.",
        "We therefore used this knowledge for the design of our system: goal#1 is then accomplished mainly using rule-based tech-niques, and goal#2 implementing machine learn-ing-based approaches.",
        "Moreover, recall is of paramount importance in de-identification (patient PHI cannot be disclosed).",
        "And this was also a reason that motivated us to first focus on achieving high recall, and filtering out false positives afterwards as a separate proce-dure.",
        "Unlike other de-identification and NER systems that tackle the classification problem from one perspective (i.e., rule-based or machine learning-based) or from a limited combined approach (e.g., learning features extracted using regular expres-sions), the design of our system allows us to take advantage of the strong points of both techniques separately.",
        "And more importantly, our classifiers for filtering out false-positives (goal#2) are trained using correct and incorrect annotations derived from previous modules implemented in goal#1.",
        "Thus, they do not predict if every token in the document is or belongs to a PHI identifier, they instead decide if an actual annotation is a false or 2 http://uima.apache.org/ true positive.",
        "This design makes our classifiers better with less learning examples, which is a restriction we have to deal with, and it also allows us to create methods that can be only focused on maximizing recall regardless of the amount of false-positives introduced (goal#1).",
        "To the best of our knowledge, this perspective has not been exploited before, and as we will show in the evaluation sec-tion, it empirically demonstrates more robustness than previous approaches.",
        "The design of our system integrates different components described below.",
        "Figure 1 depicts an overview of our system's architecture and work-flow."
      ]
    },
    {
      "heading": "4.3 Analysis Our novel names de-identification pipeline significantly outperforms all other systems we evaluated ?out-of-the-box? or trained with our VHA notes corpus. Among the five existing systems we evaluated (Table 1), only one achieved noteworthy recall around 89%. However, none of them obtained any remarkable F2-measure. Most errors produced by the pattern matching systems (i.e., HMS Scrubber, MeDS, and MIT deid system) were due to false positive annotations of medical eponyms (e.g., ?Achilles?, ?Guyon?, etc.), as well as acronyms denoting medical facilities (e.g., ?ER? and ?HCS?). The false negatives consisted of ambiguous person names (e.g., ?Bill? and ?Chase?), some formats not covered by the patterns (e.g., ?[Last-Name], [FirstName] [Initial]?), and a few names not found in the dictionaries. Among machine learning-based systems, the two de-identification applications (i.e., MIST and HIDE) obtained good precision, but quite low recall. The size of our training corpus was somewhat limited, and these results probably indicate a need for more sophisticated learning features, as well as feature selection procedures (rather than using the ?out-of-the-box? feature specification that comes with these systems) for better performance. With improved learning features, we could mitigate the relative lack of training examples. Interestingly, the NER system, which was trained on newswire documents, performed even better than some de-identification systems, although a need for improvement is still present. We acknowledge that the comparison with Stanford NER is not completely fair due to the different source of documents used for training. However, we considered it interesting information, and although clinical notes contain characteristics not present in newswire corpora, they also have similarities regarding person names (e.g., titles ?Mr.?, ?Dr.?, ?PhD?, part-of-speech, verb tenses). There-fore, we think that only for names recognition, a newswire trained NER can provide interesting re-sults, and this was actually what we observed. Table 2 points out that the combination of our components produces successful cumulative results. Using the training corpus to create a simple component made up of rules, dictionary lookups, and few heuristics for disambiguation allowed for",
      "text": [
        "recall values of 0.96.",
        "This demonstrates the need to adapt these techniques to the target documents, instead of employing systems ?out-of-the-box?.",
        "Our experiments with fuzzy dictionary lookups did not allow for a significant increase in recall, but caused a decrease in precision (-19%).",
        "It suggests that there was no need for considering person name misspellings.",
        "The component based on CRF predictions alone achieved good performance, especially in preci-sion.",
        "It obtained the best F2-measure (0.89), clearly higher than the other ?out-of-the-box?",
        "systems based on CRF models.",
        "It proves that selecting suitable learning features mitigates to some extent the scarcity of training examples.",
        "Our next experiment combined the rules and dictionaries and CRF components.",
        "It improved the overall recall to about 0.99, which means that CRF-based predictions recognized some person names that were missed by our pattern matching components, but didn't increase the precision.",
        "We reached here our first goal of high recall or sensi-tivity.",
        "Finally, we added the false-positive filtering component to our system.",
        "This component was able to filter out 622 (84%) false positives from a total of 742, improving the precision to 0.77 (+41%); but also causing a slight decrease in recall (-1.4%).",
        "This application of our pipeline was suc-cessful, reaching an F2-mesure of 0.93, and was an effective way of training the SVM model for false-positives filtering.",
        "5 Conclusions We designed and evaluated a novel person names de-identification system with VHA clinical docu-ments.",
        "We also presented an ?out-of-the-box?",
        "evaluation of several available de-identification and NER systems; all of them were surpassed by our approach.",
        "With our proposal, we showed that it is possible to improve the recognition of person names in clinical records, even when the corpus for training machine learning classifiers is limited.",
        "Furthermore, the workflow of our pipeline allowed us to tackle the de-identification task from an intuitive but powerful perspective, i.e. facing the achievement of high recall and precision as two separate goals implementing specific techniques and components.",
        "Packaging this two-step procedure as a bootstrapping learning or adding the rules to define learning features would not allow us to use the qualities of the R&D and CRF components (i.e., obtain the highest recall by any means).",
        "Moreover, considering the small size of our manually annotated examples, these approaches would not work much better than existing systems.",
        "As future efforts, we plan to improve the precision of the rules and dictionary lookups component by adding more sophisticated person names disambiguation procedures.",
        "Such procedures should deal with the peculiar formatting of clinical records as well as integrate enriched knowledge from biomedical resources.",
        "We also plan to evaluate the portability of our approach by using other sets of clinical documents, such as the 2006 i2b2 de-identification challenge corpus (Uzuner et al., 2007).",
        "Acknowledgments Funding provided by the Department of Veterans Affairs Health Services Research & Development Services Consortium for Healthcare Informatics Research grant (HIR 08-374).",
        "References John Aberdeen, Samuel Bayer, Reyyan Yeniterzi, Ben Wellner, Cheryl Clark, David Hanauer, Bradley Ma-lin, and Lynette Hirschman.",
        "2010.",
        "The MITRE Identification Scrubber Toolkit: design, training, and assessment.",
        "International journal of medical infor-matics, 79 (12) (December): 849-59.",
        "Bruce A. Beckwith, Rajeshwarri Mahaadevan, Ulysses J. Balis, and Frank Kuo.",
        "2006.",
        "Development and evaluation of an open source software tool for deidentification of pathology reports.",
        "BMC medical informatics and decision making, 6 (1) (January): 12.",
        "Chih-Chung Chang and Chih-Jen Lin.",
        "(2001).",
        "LIBSVM: a library for support vector machines.",
        "Computer, 1-30.",
        "George Doddington, Alexis Mitchell, Mark Przybocki, Lance Ramshaw, Stephanie Strassel, and Ralph Weischedel.",
        "2004.",
        "The Automatic Content Extraction (ACE) Program - Tasks, Data, and Evaluation.",
        "Pro-ceedings of LREC 2004: 837-840.",
        "Jenny Rose Finkel, Trond Grenager, and Christopher Manning.",
        "2005.",
        "Incorporating non-local information into information extraction systems by Gibbs sampling.",
        "Proceedings of the 43rd Annual Meeting on Association for Computational Linguistics: 363-370.",
        "F. Jeff Friedlin and Clement J. McDonald.",
        "2008.",
        "A software tool for removing patient identifying information from clinical documents.",
        "Journal of the American Medical Informatics Association??",
        ": JAMIA 15 (5) (January 1): 601-10.",
        "James Gardner and Li Xiong.",
        "2009.",
        "An integrated framework for de-identifying unstructured medical data.",
        "Data & Knowledge Engineering 68 (12) (De-cember): 1441-1451.",
        "Ralph Grishman and Beth Sundheim.",
        "1996.",
        "Message understanding conference-6: A brief history.",
        "Pro-ceedings of the 16th conference on Computational linguistics - Volume 1: 466-471.",
        "Association for Computational Linguistics, Copenhagen, Denmark.",
        "Daniel Jurafsky and James H. Martin.",
        "2009.",
        "Speech and Language Processing: An Introduction to Natural Language Processing, Speech Recognition, and Computational Linguistics.",
        "2nd edition.",
        "Prentice-Hall.",
        "Upper Saddle River, NJ, USA.",
        "V.I.",
        "Levenshtein.",
        "1966.",
        "Binary Codes Capable of Correcting Deletions, Insertions and Reversals.",
        "Soviet Physics - Doklady 10: 707?710.",
        "Stephane M. Meystre, F. Jeffrey Friedlin, Brett R. South, Shuying Shen, and Matthew H. Samore.",
        "2010.",
        "Automatic de-identification of textual documents in the electronic health record: a review of recent re-search.",
        "BMC medical research methodology 10 (1) (January): 70.",
        "Ishna Neamatullah, Margaret M. Douglass, Li-wei H. Lehman, Andrew Reisner, Mauricio Villarroel, William J.",
        "Long, Peter Szolovits, George B. Moody, Roger G. Mark, and Gari D. Clifford.",
        "2008.",
        "Auto-mated de-identification of free-text medical records.",
        "BMC medical informatics and decision making 8 (1) (January): 32.",
        "Guergana K. Savova, James J. Masanz, Philip V. Ogren, Jiaping Zheng, Sunghwan Sohn, Karin C. Kipper-Schuler, and Christopher G. Chute.",
        "2010.",
        "Mayo clinical Text Analysis and Knowledge Extraction System (cTAKES): architecture, component evaluation and applications.",
        "Journal of the American Medical Informatics Association??",
        ": JAMIA 17 (5): 507-13.",
        "Erik F. Tjong Kim Sang, and Fien De Meulder.",
        "2003.",
        "Introduction to the CoNLL-2003 Shared Task: Lan-guage-Independent Named Entity Recognition.",
        "In Proceedings of the seventh conference on Natural language learning at HLT-NAACL 2003 - Volume 4: 142-147.",
        "?zlem Uzuner, Yuan Luo, and Peter Szolovits.",
        "2007.",
        "Evaluating the State-of-the-Art in Automatic De-identification.",
        "Journal of the American Medical Informatics Association??",
        ": JAMIA 14(5):550-563."
      ]
    }
  ]
}
