{
  "info": {
    "authors": [
      "Lars Borin",
      "Markus Forsberg",
      "Richard Johansson",
      "Kristiina Muhonen",
      "Tanja Purtonen",
      "Kaarlo Voionmaa"
    ],
    "book": "Proceedings of the NAACL-HLT Workshop on the Induction of Linguistic Structure",
    "id": "acl-W12-1902",
    "title": "Transferring Frames: Utilization of Linked Lexical Resources",
    "url": "https://aclweb.org/anthology/W12-1902",
    "year": 2012
  },
  "references": [
    "acl-H05-1108",
    "acl-P06-2057"
  ],
  "sections": [
    {
      "text": [
        "NAACL-HLT Workshop on the Induction of Linguistic Structure, pages 8?15, Montre?al, Canada, June 3-8, 2012. c?2012 Association for Computational Linguistics Transferring Frames: Utilization of Linked Lexical Resources"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "In our experiment, we evaluate the transferability of frames from Swedish to Finnish in parallel corpora.",
        "We evaluate both the theoretical possibility of transferring frames and the possibility of performing it using available lexical resources.",
        "We add the frame information to an extract of the Swedish side of the Kotus and JRC-Acquis corpora using an automatic frame labeler and copy it to the Finnish side.",
        "We focus on evaluating the results to get an estimation on how often the parallel sentences can be said to express the same frame.",
        "This sheds light on the questions: Are the same situations in the two languages expressed using different frames, i.e. are the frames transferable even in theory?",
        "How well can the frame information of running text be transferred from one language to another?"
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "To our knowledge, there is no ongoing effort to create a framenet for Finnish.",
        "This experiment gives information on whether it is feasible to build a preliminary framenet for Finnish by transferring the frames with their lexical units from Swedish.",
        "The building of semantically annotated language resources from scratch is a costly and time consuming effort.",
        "In this experiment, we test the feasibility of utilizing Swedish and Finnish lexical resources for building a Finnish framenet.",
        "Transferring lexical units from Swedish to Finnish is possible because of the wordnet connections of both languages: both the Swedish wordnet and the Finnish wordnet are linked to the Princeton wordnet.",
        "This connection is described in more detail in Section 2.",
        "We evaluate the transferability of the frames and their lexical units from Swedish to Finnish.",
        "In the evaluation, we use Swedish?Finnish parallel corpora to see whether the same sentence is expressed using the same frames in both languages.",
        "Using parallel corpora, we can evaluate not only the theoretically similar content of frames in two different languages, but also their use in actual texts.",
        "The idea of semantic role transfer across parallel corpora is not novel (see Section 2.3), but to our knowledge, the use of linked lexical resources proposed here is.",
        "The language pair Swedish?Finnish is also one for which this methodology has not been attempted earlier.",
        "With our experiment we can see whether transferring the frame information from Swedish to Finnish could work, given that the languages are not demonstrably related, and structurally quite different.",
        "The work presented here consequently provides a data point for the evaluation of the language-independence of this kind of methodology, which can arguably only be convincingly demonstrated by actually attempting to apply it on a range of typologically diverse languages (Bender, 2011).",
        "From a more practical point of view, there may well be as much Finnish?Swedish as Finnish?",
        "English parallel data, since Finnish and Swedish are the two official languages of Finland, and all public documents must by law be available in both languages, and for practical reasons also a large amount of other texts.",
        "In addition, despite their non-relatedness and large structural differences, the two",
        "languages have a long history of contact and bilingualism.",
        "Finnish has borrowed words and structures from Swedish on a large scale, and the lexical semantics of the two languages have converged in many domains.",
        "This means that we may expect frames to transfer well across the two languages, whereas the structural differences may make us more pessimistic about the transferability of frame elements."
      ]
    },
    {
      "heading": "2 Language Resources",
      "text": []
    },
    {
      "heading": "2.1 Wordnet Connections",
      "text": [
        "Wordnets are lexical databases that group words of a language into synonym sets ?",
        "or synsets ?",
        "each synset supposedly expressing one distinct concept in the language.",
        "Wordnets further provide general definitions of the synsets, and encode the semantic relations between the synsets.",
        "Typically they are monolingual, but efforts have been made to produce multilingual wordnets as well; see e.g. Vossen (1998).",
        "FinnWordNet (Lind?n and Carlson, 2010) is a wordnet for Finnish that complies with the format of the Princeton WordNet (PWN) (Fellbaum, 1998).",
        "It was built by translating the Princeton WordNet 3.0 synsets into Finnish by human translators.",
        "It is open source and contains 117 000 synsets.",
        "The Finnish translations were inserted into the PWN structure resulting in a bilingual lexical database.",
        "SweFN++ is an integrated open-source lexical resource for Swedish (Borin et al., 2010; Borin, 2010).",
        "It includes the Swedish framenet (SweFN) and Swesaurus, a Swedish wordnet.",
        "The wordnet has been semi-automatically assembled from freely available Swedish lexical resources (Borin and Forsberg, 2011), and part of it has been linked to the Core WordNet, a 5000-synset subset of PWN.",
        "All resources in SweFN++ are linked together on the word sense level using the persistent sense identifiers of the SweFN++ pivot resource SALDO, a large-scale lexical-semantic resource (Borin et al., 2008; Borin and Forsberg, 2009).",
        "Using these links, we can collect a set of 434 frames and 2 694 word senses that have a direct PWN ?",
        "Swedish wordnet ?",
        "SweFN ?",
        "FinnWordNet connection.",
        "Using these connections, we can transfer the frame information of the words from Swedish to Finnish.",
        "We used the Korp pipeline (Borin et al., 2012) to analyze the Swedish part of the parallel text to get hold of the SALDO sense identifiers.",
        "The analysis is not able to distinguish senses that do not differentiate themselves formally (by different word forms or morphosyntactic descriptions)."
      ]
    },
    {
      "heading": "2.2 Framenet and the Semantic Labeler",
      "text": [
        "Framenets are lexical databases that define semantic relations.",
        "The best-known framenet is Berkeley FrameNet which is based on the theory of frame semantics (Fillmore, 1976).",
        "SweFN is built using the same principles as the Berkeley Framenet (Ruppen-hofer et al., 2006) of English.",
        "The frames are mostly the same as in English.",
        "In the experiment, we use an automatic semantic role labeler for Swedish, developed by Johansson et al. (2012).",
        "The labeler is based on the Swedish framenet and it uses the same frame and frame element labels."
      ]
    },
    {
      "heading": "2.3 Related Work",
      "text": [
        "From a methodological point of view, the first question to ask should be whether the semantic frames are meaningful in both languages: for instance, if the Swedish FrameNet has defined a frame SELF_MOTION and a list of associated frame elements (SELF_MOVER, GOAL, PATH etc.",
        "), does it make sense to define an identical frame in a Finnish FrameNet?",
        "This question has been studied by Pad?",
        "(2007) for English?German and English?French, and although most frames were cross-linguistically meaningful, a number of interesting discrepancies were found.",
        "Whether the number of discrepancies is higher in a pair of more typologically different languages is an important question.",
        "As far as we are aware, there has been no previous attempt in using multilingual WordNets or similar lexicons when deriving lexical units in frames in new languages.",
        "The WordNet?FrameNet combination has seen some use in monolingual applications: for instance, Burchardt et al. (2005) and Johansson and Nugues (2007) attempted to extend the coverage of FrameNet by making use of WordNet.",
        "Pad?",
        "and Lapata (2005a) used word alignment in sentence-aligned parallel corpora to find possible lexical units in new languages.",
        "There have been several studies of the feasibility of automatically producing the role-semantic an",
        "notation in new languages, although never for languages as structurally dissimilar as Swedish and Finnish.",
        "Pad?",
        "and Lapata (2005b) projected annotation from English to German, and Johansson and Nugues (2006) implemented a complete pipeline for English?Swedish by (1) automatic annotation on the English side; (2) annotation transfer; and (3) training a Swedish semantic role labeler using the automatically produced annotation."
      ]
    },
    {
      "heading": "3 Frames from Swedish to Finnish",
      "text": []
    },
    {
      "heading": "3.1 Outline of the Experiment",
      "text": [
        "We start off by locating such Swedish word senses that are both represented in SweFN and linked to PWN in two Finnish?Swedish parallel corpora.",
        "The sentences that include such a word make up the evaluation data set.",
        "After this, the Swedish half is enriched with frame labels using the framenet-based semantic role labeler for Swedish.",
        "After running the semantic labeler on the evaluation data, we pick the 20 most commonly occurring frames from both corpora.",
        "For each of the most common frames, we pick the 6 first occurrences for closer scrutiny.",
        "Due to the differing nature of Swedish and Finnish, we make one change before selecting the 20 most frequent frames: We exclude the frame which is evoked (erroneously) only by the Swedish indefinite articles en/ett ?",
        "homony-mous with the numeral ?one??",
        "among the 6 first occurrences.",
        "We take the 21st most frequent frame instead because there are no articles in Finnish.",
        "To sum up, the frames under examination are selected based on the frequency of the frame, and the sentences including the frame are selected in the order in which they occur.",
        "After picking 120 (6 x 20) sentences from both corpora, the correctness of the semantic labeler is manually checked.",
        "A linguist marks the correctness of both the frame and the frame element label.",
        "At this stage, the linguist does not consider the transferability of the frame, but merely checks the output of the automatic role labeler, marking the frame and the frame element either correct or incorrect.",
        "E.g problematic analyses caused by polysemous words are marked incorrect.",
        "We check the output of the labeler before analyzing the transferability of the frames because if the frame information is incorrect in the Swedish text to begin with, there is no point in transferring it to Finnish.",
        "After checking the Swedish frame information, the Swedish?Finnish parallel sentences are compared.",
        "Two native Finnish speakers estimate, whether the frame and frame element label is transferable to Finnish or not.",
        "Because FrameNet is based on Frame Semantics (Fillmore, 1976), according to which the meanings of most words can best be understood by a description of a situation, the working hypothesis is that the semantic frames should be more or less language neutral.",
        "Hence, the semantic frame we assign for a certain situation in Swedish, should be transferable to Finnish.",
        "In addition to the theoretical frame transferability, we also report the practical applicability of the transfer via the wordnet connections.",
        "We check whether the Swedish word is expressed in the Finnish parallel corpus with a word that has a direct link from the Swedish wordnet to the Finnish wordnet via the Princeton Wordnet.",
        "If there is no direct Wordnet link from the Swedish word to the Finnish one, we report whether the Finnish word used in the sentence and the Finnish word linked to the Swedish word via wordnets are in the same synset.",
        "In sum, we manually evaluate whether the 20 most commonly occurring frames of the Swedish test sentences are the same in the equivalent Finnish sentences.",
        "After reporting whether the frames are equivalent in both languages, we evaluate, how many of the frame element labels can be transferred to Finnish."
      ]
    },
    {
      "heading": "3.2 The Test Corpora",
      "text": [
        "Presumably, transferability of the frames between parallel corpora depends on the translation of the corpus.",
        "Our hypothesis is that if the translator follows the original expression very carefully, the frames can be more similar than in a more freely translated text.",
        "To see whether the transferability of the frames varies according to a corpus, we used two test corpora.",
        "The test corpora consist of extracts from the JRC-Acquis Corpus (Steinberger et al., 2006) and the KOTUS Swedish?Finnish Parallel Corpus (Research Institute for the Languages of Finland, 2004).",
        "Both are Swedish?Finnish parallel corpora that are sentence aligned.",
        "In both corpora, the text type is",
        "formal: the former is a collection of legislative text and the latter consists of press releases of different Finnish companies."
      ]
    },
    {
      "heading": "4 Results",
      "text": [
        "The evaluation consists of three parts: First and foremost, we concentrate on estimating whether the frame used in Swedish can be transferred to Finnish even in theory.",
        "These results are presented in Section 4.1.",
        "If the sentence is expressed using the same frames, we also report how many of the frame elements encoded correctly in Swedish are realized in Finnish (Section 4.2).",
        "In Section 4.3, we discuss the possibility of transferring the frames via the wordnet connections.",
        "The results for the two different corpora are presented separately enabling us to see whether the text type impacts frame transferring."
      ]
    },
    {
      "heading": "4.1 Possibility of Transferring Frames",
      "text": [
        "In Tables 1 and 2, the first column lists the 20 most frequent frames of the evaluation corpora.",
        "The second column shows that for all 20 frames, we took the first six Swedish occurrences.",
        "The third column shows how many of the Swedish frame labels are correct.",
        "Finally, the rightmost column portrays how many of the correct Swedish frames can be transferred to Finnish.",
        "The result we are mostly interested in is the difference between the third and the fourth columns.",
        "As can be seen from Tables 1 and 2, most of the correct labels for Swedish are transferable to Finnish.",
        "In the JRC-Acquis corpus, the semantic labeler succeeded in 75%, and 72% of the frame labels can be transferred to Finnish.",
        "The corresponding success rates for the Kotus corpus are 80% and 72%.",
        "Many of the words that are not correctly labeled in Swedish occur in idiomatic expressions, and by chance, some idioms are so frequent in the corpus that they end up to our evaluation corpus.",
        "E.g. the idiom tr?da i kraft / astua voimaan / come into effect is expressed in the same way in both Swedish and Finnish (lit.",
        "?tread into force?).",
        "In both languages, a verb usually belonging to the frame SELF_MOTION is used in this idiom, but in the idiom, the meaning of it cannot be said to be expressing self motion.",
        "ered non-transferable already on a theoretical level are expressed in Finnish completely without the frame, as demonstrated in Example (1) and (2).",
        "However, it remained weaker than what was the original goal.",
        "In the Swedish example (1), the word mindre ?smaller?",
        "is used when expressing the decrease of economical growth.",
        "The word mindre fits the frame DIMENSION, but it is used in a figurative way.",
        "The Finnish parallel sentence could be expressed using the direct translation pienempi ?smaller?",
        "but the translation is different.",
        "Mindre in the Finnish Kotus corpus is translated as heikompi ?weaker?, which is not expressing dimension even in a metaphorical way.",
        "When focusing only on the correct Swedish labels, transferring frames seems to be beneficial, as reported in Table 3.",
        "The success rate of a theoretical possibility to use Swedish as a source language for",
        "pora.",
        "The difference (7%) between the corpora is not remarkable, so based on these test corpora, the impact of the translation type is not big.",
        "In other words, in both corpora, the correct Swedish frames can be transferred to Finnish successfully."
      ]
    },
    {
      "heading": "4.2 Success of Transferring Frame Elements",
      "text": [
        "When the sentence is expressed using the same frames in both languages, we also report, how many of the frame elements encoded correctly in Swedish are realized in Finnish.",
        "These results are presented in Tables 4 and 5.",
        "The numbers show how beneficial it is to transfer the frame element labels of the Swedish semantic labeler to Finnish.",
        "The most common frame elements of the Swedish corpora are listed in the first column.",
        "We scrutinize such elements in detail which occur in the corpora at least four times.",
        "The rest are added up and presented on the last lines of the tables.",
        "The second column shows the frequency of the frame element, while the third column gives the number of correct frame element labels in the Swedish corpora.",
        "The last column shows the number of transferable frame elements.",
        "As can be seen from Table 6 that sums up the results of the frame element transfer, frame element labels do not transfer from Swedish to Finnish as well as the frame labels.",
        "The success rate of the frame transfer is 92%, where as the frame elements can be successfully transferred in 83% of the cases.",
        "In the Kotus corpus, 75% of the frame element labels are transferable.",
        "However, there is a difference between the two corpora: In the JRC-Acquis corpus, 91% of the elements can be transferred to Finnish."
      ]
    },
    {
      "heading": "4.3 Transferring Frames via Wordnets",
      "text": [
        "Next we report how many of the Swedish frame-evoking words are expressed using such words that have the same wordnet identifier in Finnish.",
        "If the parallel sentences are not expressed using words that are equivalent in the wordnets, we examine whether the words are in equivalent synsets.",
        "This information is needed when estimating the usefulness of lexical resources and their internal links in the frame transferring.",
        "In Tables 7 and 8, the first row displays the total number of frame-evoking words.",
        "The second row shows how many of the frames are transferable to Finnish even in theory.",
        "The numbers on the third row reflect the possibility of using the WordNet connections in frame transferring; this number shows how many of the words under examination are expressed both in Swedish and in Finnish with the equivalent wordnet words.",
        "The fourth row shows how many of the words are not directly linked with each other but are located in equivalent synsets.",
        "On the fifth row, we report how many of the words are",
        "synonyms of the word in question and could therefore be located in the same synset in the wordnets.",
        "As can be seen in Tables 7 and 8, only 46% (37/85 and 41/86) of the theoretically transferable words can be transferred to Finnish directly using the wordnet links.",
        "Our hypothesis was that we could get better results when looking at all the words in a synset.",
        "This appears to be a wrong assumption: There are only 2 words that come from the same synset that are not equivalent words used in the translations.",
        "The numbers on the fifth rows are remarkably big, especially when compared to the number of realized synonyms on the fourth row.",
        "These 47 words could (or should) be located in the same synset as the words in question.",
        "If the wordnets were complete, i.e. if all words that could be in the same synset were in the same synset, the theoretically transferable LUs would be 82% (70/85) and 65% (56/86)."
      ]
    },
    {
      "heading": "5 Conclusion and Future Work",
      "text": [
        "The main point of the experiment was to see if building a preliminary Finnish framenet and labeling semantic roles for Finnish using Swedish resources is feasible at all.",
        "In particular, we wanted to see whether the same situations are expressed using the same frames in both languages and whether it is possible to transfer the frames and frame elements with their lexical units from one language to the other.",
        "In our experiment, we have evaluated how well the frames and frame elements can be transferred from a Swedish corpus to its Finnish parallel corpus.",
        "We have shown that in theory, 92% of the correct Swedish frame labels and 83% of the correct frame",
        "element labels can be transferred to Finnish.",
        "We also investigated whether linked wordnets could be used for the transfer of frame-evoking words between Swedish and Finnish.",
        "The results here are more ambiguous, however.",
        "On the one hand, only about half of the words could be linked in this way.",
        "On the other hand, it turns out that this in part is because of many synsets being incomplete in these wordnets which are still under construction.",
        "Thus we should not dismiss out of hand the usefulness of lexical-semantic resources such as wordnets for the task of cross-language frame transfer, but rather explore further how the knowledge encoded in them could be best put to use.",
        "The result of our experiment encourages us to find ways of performing frame transfer automatically.",
        "This can be accomplished using a word aligned parallel corpus for Swedish and Finnish.",
        "The automatic word alignment of Finnish is generally seen as a complicated task because of the free constituent order and rich morphology of Finnish.",
        "However, our future work is to examine the success of using automatic word alignment, e.g. Giza++, in automatically transferring the frame information from one language to another."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The research presented here was supported by the Swedish Research Council (the project Swedish Framenet++, VR dnr 2010-6013) and by the University of Gothenburg through its support of the Centre for Language Technology and its support of Spr?kbanken (the Swedish Language Bank).",
        "The work on linking the Swedish wordnet to the Princeton Core WordNet was conducted with funding by the European Commission through its support of the META-NORD project under the ICT PSP Programme, grant agreement no 270899.",
        "We would like to thank the anonymous reviewers for their constructive comments and Jyrki Niemi for his valuable help with FinnWordNet."
      ]
    }
  ]
}
