{
  "info": {
    "authors": [
      "Rada Mihalcea"
    ],
    "book": "Proceedings of the Workshop on Innovative Hybrid Approaches to the Processing of Textual Data",
    "id": "acl-W12-0506",
    "title": "Multilingual Natural Language Processing",
    "url": "https://aclweb.org/anthology/W12-0506",
    "year": 2012
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "With rapidly growing online resources, such as Wikipedia, Twitter, or Facebook, there is an increasing number of languages that have a Web presence, and correspondingly there is a growing need for effective solutions for multilingual natural language processing.",
        "In this talk, I will explore the hypothesis that a multilingual representation can enrich the feature space for natural language processing tasks, and lead to significant improvements over traditional solutions that rely exclusively on a monolingual representation.",
        "Specifically, I will describe experiments performed on three different tasks: word sense disambiguation, subjectivity analysis, and text semantic similarity, and show how the use of a multilingual representation can leverage additional information from the languages in the multilingual space, and thus improve over the use of only one language at a time.",
        "This is joint work with Samer Hassan and"
      ]
    },
    {
      "heading": "Department of Computer Science and Engineer",
      "text": [
        "ing at the University of North Texas.",
        "Her research interests are in computational linguistics, with a focus on lexical semantics, graph-based algorithms for natural language processing, and multilingual natural language processing.",
        "She serves or has served on the editorial boards of the Journals of Computational Linguistics, Language Resources and Evaluations, Natural Language Engineering, and Research in Language in Computation.",
        "She was a program co-chair for the Conference of the Association for Computational Linguistics (2011), and the Conference on Empirical Methods in Natural Language Processing (2009).",
        "She is the recipient of a National Science Foundation CAREER award (2008) and a Presidential Early Career Award for Scientists and Engineers (2009)."
      ]
    }
  ]
}
