{
  "info": {
    "authors": [
      "Christopher M. Mitchell",
      "Kristy Elizabeth Boyer",
      "James C. Lester"
    ],
    "book": "Proceedings of the 13th Annual Meeting of the Special Interest Group on Discourse and Dialogue",
    "id": "acl-W12-1612",
    "title": "From Strangers to Partners: Examining Convergence within a Longitudinal Study of Task-Oriented Dialogue",
    "url": "https://aclweb.org/anthology/W12-1612",
    "year": 2012
  },
  "references": [
    "acl-N09-2048",
    "acl-P08-2043"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the 13th Annual Meeting of the Special Interest Group on Discourse and Dialogue (SIGDIAL), pages 94?98, Seoul, South Korea, 5-6 July 2012. c?2012 Association for Computational Linguistics From Strangers to Partners: Examining Convergence within a Longitudinal Study of Task-Oriented Dialogue Christopher M. Mitchell Kristy Elizabeth Boyer James C. Lester Department of Computer Science North Carolina State University Raleigh, NC, USA {cmmitch2, keboyer, lester}@ncsu.edu Abstract Convergence is thought to be an important phenomenon in dialogue through which interlocutors adapt to each other.",
        "Yet, its mechanisms and relationship to dialogue outcomes are not fully understood.",
        "This paper explores convergence in textual task-oriented dialogue during a longitudinal study.",
        "The results suggest that over time, convergence between interlocutors increases with successive dialogues.",
        "Additionally, for the tutorial dialogue domain at hand, convergence metrics were found to be significant predictors of dialogue outcomes such as learning, mental effort, and emotional states including frustration, boredom, and confusion.",
        "The results suggest ways in which dialogue systems may leverage convergence to enhance their interactions with users.",
        "1 Introduction Convergence is a widely observed phenomenon in dialogue, in which interlocutors adapt to the patterns in each other's utterances (Brennan 1996; Pickering and Garrod 2004).",
        "These patterns can include lexical choice (Hirschberg 2008; Ward and Litman 2007), syntactic choice (Reitter et al. 2006; Stoyanchev and Stent 2009) and loudness (Coulston et al. 2002).",
        "It is believed that convergence is indicative of shared understanding (Pickering and Garrod 2004), which makes it an important consideration for task-oriented dialogue systems.",
        "In addition to facilitating shared understanding, convergence has also been associated with the success of dialogues in several domains (Steinhauser et al. 2011; Ward and Litman 2007), and can also be leveraged for lexical and syntactic priming that may improve performance of spoken dialogue systems via more accurate speech recognition (Stoyanchev and Stent 2009).",
        "While such results have established that convergence is an important dialogue phenomenon, the field does not yet fully understand how convergence is associated with dialogue success.",
        "This paper examines surface-level and lexical convergence within textual task-oriented dialogues.",
        "The analysis considers three levels of convergence: utterance-level short-term priming effects, conversation-level convergence effects, and longitudinal convergence effects, as interlocutors participate in six conversations together over the course of several weeks.",
        "Using these measures, we build multiple regression models that indicate ways in which convergence can predict both desirable and undesirable outcomes of task-oriented dialogues.",
        "This paper makes several contributions.",
        "First, by examining convergence at several granularity levels and across multiple dialogues with the same partners, we gain insight into how convergence phenomena unfold over time.",
        "Second, the findings provide confirmatory evidence that in some domains, such as the tutorial dialogue considered here, lexical priming be associated with unintended consequences.",
        "Finally, we demonstrate that dialogue convergence is also associated with affective components such as frustration, engagement, and confusion.",
        "These results contribute to an understanding of convergence that may enable us to harness this phenomenon more effectively within dialogue systems."
      ]
    },
    {
      "heading": "2 Related Work Convergence and the related concepts of alignment and priming have been extensively studied. Alignment, or the development of shared understanding, has been studied by Pickering and Garrod (2004) who propose that alignment on lower-level observable features is indicative of alignment at the level of conceptual models. The influence of shared representation in dialogue has also been explored in the context of learning; for example, Ward and Litman (2007) studied lexical convergence in human-human tutoring and found that the rate of priming, which measures student reuse of tutor words at various distances, was positively associated with learning for students with low initial test scores. Conversely, Steinhauser et al. (2011) analyzed lexical convergence in an automated dialogue-based physics tutor, and found that the level of the student mimicking the tutor was negatively correlated with learning. Thus, the relationship between dialogue convergence and learning is not fully understood, and may be highly dependent on context. In addition to a theoretical link to shared representations, convergence has practical implications, in particular for speech recognition (Stoyanchev and Stent 2009). Brennan (1996) found that users adapt their lexical choices to match those of an automated system in both text-based and speech-based interactions, even when it is apparent that the system understood the user's original lexical choice. Convergence has even been found to occur in non-lexical aspects of a dialogue, such as users adapting their loudness levels to match that of a software agent (Coulston et al. 2002). Together, these results suggest that convergence has implications beyond lexical and syntactic choice. 3 Corpus The corpus consists of text-based tutorial dialogues between two interlocutors, a tutor and a student, working together to complete tasks in the domain of introductory computer science (excerpt in Appendix A). The corpus was collected over two semesters, in which 67 first-year university students were selected from an introductory engineering course and assigned to one of seven",
      "text": [
        "dialogue as rated by the interlocutors.",
        "Summary statistics for the dialogues were computed, including time duration of the session, number of utterances, number of words, number of characters, mean word length, and lexicon size (Table 1).",
        "Stop words were not excluded from the analysis, in part due to specialized usage of common vocabulary in the computer science domain (e.g., for, if ).",
        "Although not traditionally considered a form of convergence, we were interested in the relationship between the levels of activity of the two interlocutors.",
        "To this end, we analyzed the number of utterances, words, and characters used by tutor and student, and found a significant positive correlation on these metrics (p<0.0001 for each).",
        "The first convergence phenomenon considered centers on lexical priming, the tendency for one interlocutor to reuse words previously introduced by the other.",
        "We have utilized a priming metric computed as follows: Interlocutor A's Priming Ratio (PR) is the percent of Interlocutor A's words reused by Interlocutor B at a given distance d, where distance is measured in terms of number of Interlocutor B's utterances.",
        "Negative slope of PR over distance indicates a priming effect because an interlocutor was more likely to reuse a word shortly after its use by the other interlocutor.",
        "This metric has been used to investigate tutor priming (Steinhauser et al. 2011; Ward and Litman 2007), and we generalize it to measure priming for both interlocutors.",
        "Note that student PR, which reflects the extent to which the tutor adopted the student's lexical choice, is of particular interest from the perspective of dialogue system design, in which tutor utterances are system-generated.",
        "Tutor mean (SD) Student mean (SD) Surface Features Number of utterances 83.7 (28.8) 35.6 (13.1) Number of words 580.9 (202.3) 170.1 (92.6) Number of characters 2383.4 (886.6) 667.3 (386.0) Mean word length 4.1 (0.2) 3.9 (0.3) Lexicon size 329.7 (87.3) 106.3 (47.3) Convergence Metrics Priming Ratio (1-10) .030 (.02) .047 (.02) ?Priming Ratio (1-10) -.011 (.02) -.017 (.04) Max Priming Ratio .052 (.02) .091 (.04) Matched Word Ratio .233 (.09) .386 (.08) Table 1.",
        "Statistics for each metric In addition to the Priming Ratio, we also computed a metric to reflect convergence: Interlocutor A's Matched Word Ratio (MWR) is the percent of Interlocutor A's words that had been previously used by Interlocutor B at any point in the dialogue history.",
        "Because it is backward-looking, this metric is applicable not only in a corpus study, but could also be used within a runtime system to track convergence as the dialogue unfolds.",
        "5 Models and Results Mean Matched Word Ratio for both interlocutors increased as sessions progressed, reflecting that the two dialogue partners used more of each other's words as they spent more time together.",
        "The Priming Ratio also revealed several phenomena in the corpus.",
        "Similarly to prior observations from tutorial dialogue (Ward and Litman 2007), we found that student reuse of tutor primes decreased with distance, indicating that a lexical priming effect occurred (Figure 2).",
        "This trend also occurred for tutor reuse of student primes (Figure 3).",
        "The effect was more pronounced in the tutor's PR than the student's PR; that is, there was more evidence that tutors converged to students in the short term.",
        "This finding may be associated in part with the higher number of tutor utterances: a distance in terms of number of tutor utterances represents fewer combined student and tutor utterances than the same distance in terms of student utterances.",
        "Additionally, tutor convergence may reflect a dimension of intentional pedagogical choice.",
        "The Priming Ratio is designed to reflect short-term priming.",
        "However, there is evidence of a longer-term effect as the two interlocutors engaged in dialogue across multiple sessions.",
        "Figures 2 and 3 display Tutor's PR and Student's PR, respectively, by task set, of which there were six in the corpus study.",
        "The last task set displays an overall higher level of lexical convergence than the earlier sessions, and there is a general trend of increasing convergence as the number of sessions together increases.",
        "In order to identify the features that were most predictive of dialogue outcomes, all of the convergence metrics and surface summary features were provided as input to a stepwise linear regression model.",
        "Standard greedy variable addition and removal was performed, with additional post-processing and retraining to eliminate instances of multicollinearity.",
        "The learned models (Appendix B) include a mixture of"
      ]
    }
  ]
}
