{
  "info": {
    "authors": [
      "Kotaro Funakoshi",
      "Mikio Nakano",
      "Takenobu Tokunaga",
      "Ryu Iida"
    ],
    "book": "Proceedings of the 13th Annual Meeting of the Special Interest Group on Discourse and Dialogue",
    "id": "acl-W12-1633",
    "title": "A Unified Probabilistic Approach to Referring Expressions",
    "url": "https://aclweb.org/anthology/W12-1633",
    "year": 2012
  },
  "references": [
    "acl-J03-1003",
    "acl-P02-1011",
    "acl-P07-1103",
    "acl-P10-1128",
    "acl-P10-1142",
    "acl-W10-4203"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper proposes a probabilistic approach to the resolution of referring expressions for task-oriented dialogue systems.",
        "The approach resolves descriptions, anaphora, and deixis in a unified manner.",
        "In this approach, the notion of reference domains serves an important role to handle context-dependent attributes of entities and references to sets.",
        "The evaluation with the REX-J corpus shows promising results."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Referring expressions (REs) are expressions intended by speakers to identify entities to hearers.",
        "REs can be classified into three categories: descriptions, anaphora, and deixis; and, in most cases, have been studied within each category and with a narrowly focused interest.",
        "Descriptive expressions (such as ?the blue glass on the table?)",
        "exploit attributes of entities and relations between them to distinguish an entity from the rest.",
        "They are well studied in natural language generation, e.g., (Dale and Reiter, 1995; Krahmer et al., 2003; Dale and Vi-ethen, 2009).",
        "Anaphoric expressions (such as ?it?)",
        "refer to entities or concepts introduced in the preceding discourse and are studied mostly on textual monologues, e.g., (Kamp and Reyle, 1993; Mitkov, 2002; Ng, 2010).",
        "Deictic (exophoric) expressions (such as ?this one?)",
        "refer to entities outside the preceding discourse.",
        "They are often studied focusing on pronouns accompanied with pointing gestures in physical spaces, e.g., (Gieselmann, 2004).",
        "Dialogue systems (DSs) as natural human-machine (HM) interfaces are expected to handle all the three categories of referring expressions (Salmon-Alt and Romary, 2001).",
        "In fact, the three categories are not mutually exclusive.",
        "To be concrete, a descriptive expression in conversation is either deictic or anaphoric.",
        "It is, however, not easy to tell whether a RE is deictic or anaphoric in advance of a resolution (regardless of whether the RE is descriptive or not).",
        "Therefore, we propose a general unified approach to the above three kinds of REs.",
        "We employ a Bayesian network (BN) to model a RE.",
        "Dealing with continuous information and vague situations is critical to handle real world problems.",
        "Probabilistic approaches enable this for reference resolvers.",
        "Each BN is dynamically constructed based on the structural analysis result of a RE and contextual information available at that moment.",
        "The BN is used to estimate the probability with which the corresponding RE refers to an entity.",
        "One of the two major contributions of this paper is our probabilistic formulation that handles the above three kinds of REs in a unified manner.",
        "Previously Iida et al. (2010) proposed a quantitative approach that handles anaphoric and deictic expressions in a unified manner.",
        "However it lacks handling of descriptive expressions.",
        "Our formulation subsumes and extends it to handle descriptive REs.",
        "So far, no previously proposed method for reference resolution handles all three types of REs.",
        "The other contribution is bringing reference domains into that formulation.",
        "Reference domains (Salmon-Alt and Romary, 2000) are sets of referents implicitly presupposed at each use of REs.",
        "By considering them, our approach can appropriately interpret context-dependent attributes.",
        "In addition, by treating a reference domain as a referent, REs referring to sets of entities are handled, too.",
        "As far as the authors know, this work is the first that takes a probabilistic approach to reference domains."
      ]
    },
    {
      "heading": "1.1 Reference domains",
      "text": [
        "First, we explain reference domains concretely.",
        "Reference domains (RDs) (Salmon-Alt and Romary, 2000; Salmon-Alt and Romary, 2001; Denis, 2010) are theoretical constructs, which are basically sets of entities presupposed at each use of REs.",
        "RDs in the original literature are not mere sets of entities but mental objects equipped with properties such as type, focus, or saliency and internally structured with partitions.",
        "In this paper, while we do not explicitly handle partitions, reference domains can be nested as an approximation of partitioning, that is, an entity included in a RD is either an individual entity or another RD.",
        "Each RD d has its focus and degree of saliency (a non-negative real number).",
        "Hereafter, two of them are denoted as foc(d) and sal(d) respectively.",
        "RDs are sorted in descending order according to saliency.",
        "We illustrate reference domains with figure 1.",
        "It shows a snapshot of solving a Tangram puzzle (the puzzle and corpus are explained in section 3.1).",
        "RDs are introduced into our mental spaces either linguistically (by hearing a RE) or visually (by observing a physical situation).",
        "If one says ?the two big triangles?",
        "in the situation shown in figure 1, we will recognize a RD consisting of pieces 1 and 2.",
        "If we observe one moves piece 1 and attaches it to piece 2, we will perceptually recognize a RD consisting of pieces 1, 2, and 6 due to proximity (Tho?risson, 1994).",
        "In a similar way, a RD consisting of pieces 5 and 7 also can be recognized.",
        "Hereafter, we indicate a RD with the mark @ with an index, and denote its elements by enclosing them with [ ].",
        "E.g., @1 = [1, 2], @2 = [1, 2, 6], @3 = [5, 7].",
        "The focused entity is marked by ?*?.",
        "Thus, foc([1?, 2]) = 1.",
        "The referent of a RE depends on which RD is presupposed.",
        "That is, if one presupposes @1 or @2, the referent of ?the right piece?",
        "should be piece 1.",
        "If one presupposes @3, the referent of the same RE should be piece 5.",
        "This is the context-dependency mentioned above.",
        "Previous work on RDs (Salmon-Alt and Romary, 2000; Salmon-Alt and Romary, 2001; Denis, 2010) employ not probabilistic but formal approaches."
      ]
    },
    {
      "heading": "1.2 Probabilistic approaches to REs",
      "text": [
        "Here, previous probabilistic approaches to REs are explained and differences between ours and theirs",
        "are highlighted.",
        "Bayesian networks (Pearl, 1988; Jensen and Nielsen, 2007) have been not often but occasionally applied to problems in natural language processing/computational linguistics since (Char-niak and Goldman, 1989).",
        "With regard to REs, Burger and Connolly (1992) proposed a BN specialized for anaphora resolution.",
        "Weissenbacher (2005; 2007) proposed a BN for the resolution of non-anaphoric ?it?",
        "and also a BN for the resolution of pronominal anaphora.",
        "They used predefined fixed BNs for their tasks while our approach dynamically tailors a BN for each RE.",
        "Cho and Maida (1992) and Roy (2002) adopted not exactly BNs but similar probabilistic approaches for reference resolution and generation respectively.",
        "However, their foci are only on descriptions.",
        "Lison et al. (2010) proposed an approach using Markov logic networks (MLNs) (Richardson and Domingos, 2006) to reference resolution.",
        "They dealt with only deictic and descriptive REs.",
        "Even though MLNs are also a probabilistic framework, it is difficult for DS developers to provide quantitative domain knowledge needed to resolve REs because MLNs accept domain knowledge in the form of formal logic rules with weights, which must be determined globally.",
        "In contrast, BNs are more flexible and easy in providing quantitative knowledge to DSs in the form of conditional probability tables, which can be determined locally.",
        "As just described, there are several probabilistic approaches to REs but none of them incorporates reference domains.",
        "In the next section, we introduce our REBNs (Referring Expression Bayesian Networks), a novel Bayesian network-based model-ing approach to REs that incorporates reference domains."
      ]
    },
    {
      "heading": "Referring Expressions",
      "text": [
        "Each REBN is dedicated for a RE in the context at the moment.",
        "Its structure is determined by the syntactic and semantic information in the RE and probability tables are determined by the context."
      ]
    },
    {
      "heading": "2.1 Structures",
      "text": [
        "Figure 2 shows the fundamental network structure of REBNs.",
        "We call this structure WCXD.",
        "The four nodes (random variables)W ,C,X , andD represent an observed word, the concept denoted by the word, the referent of the RE, and the presupposed RD, respectively.",
        "Here, a word means a lexical entry in the system dictionary defined by the DS developer (concept dictionary; section 3.2.1).",
        "Each REBN is constructed by modifying or multiply connecting the WCXD structure as shown in figures 3 and 4.",
        "Figure 3 shows the network for REs indicating one referent such as ?that table.?",
        "EachWi node has a corresponding word wi.",
        "Figure 4 shows the network for REs indicating two referents such as ?his table.?",
        "We call the class of the former REs s-REX (simple Referring EXpression) and the class of the latter REs c-REX (compound Referring EXpres-sion).",
        "Although REBNs have the potential to deal with c-REX, hereafter we concentrate on s-REX because the page space is limited and the corpus used for evaluation contains very few c-REX instances.",
        "Although, in section 1, we explained that (Iida et al., 2010) handles anaphoric and deictic expressions in a unified manner, it handles anaphora to instances only and does not handle that to concepts.",
        "Therefore, it cannot satisfactorily resolve such an expression ?Bring me the red box, and the blue one, too.?",
        "Here, ?one?",
        "does not refer to the physical referent of ?the red box?",
        "but refers to the concept of ?box?.",
        "TheC nodes will enable handling of such references to concepts.",
        "This is one of the important features of REBNs but will be investigated in future work."
      ]
    },
    {
      "heading": "2.2 Domains of random variables",
      "text": [
        "A REBN for an s-REX instance of N words has 2N + 2 discrete random variables: W1, .",
        ".",
        ".",
        ",WN , C1, .",
        ".",
        ".",
        ", CN , X , and D. The domain of each variable depends on the corresponding RE and the context at the moment.",
        "Here, D(V ) denotes the domain of a random variable V .",
        "D(Wi) contains the corresponding observed word wi and a special symbol ?",
        "that represents other possibilities, i.e., D(Wi) = {wi,?}.",
        "Each Wi has a corresponding node Ci.",
        "D(Ci) containsM concepts that can be expressed by wi and a special concept ?",
        "that represents other",
        "tionary (see section 3.2.1, table 2).",
        "D(D) contains L + 1 RDs recognized up to that point in time, i.e., D(D) = {@0,@1, .",
        ".",
        ".",
        ",@L}.",
        "@0 is the ground domain that contains all the individual entities to be referred to in a dialogue.",
        "At the beginning of the dialogue, D(D) = {@0}.",
        "Other L RDs are incrementally added in the course of the dialogue.",
        "D(X) contains all the possible referents, i.e., K individual entities and L + 1 RDs.",
        "Thus, D(X) = {x1, .",
        ".",
        ".",
        ", xK ,@0, .",
        ".",
        ".",
        ",@L}.",
        "Including RDs enables handling of references to sets.",
        "Then reference resolution is formalized as below:",
        "the joint probabilities that are computed with the probability tables described in the next subsection."
      ]
    },
    {
      "heading": "2.3 Probability tables",
      "text": [
        "Probability distributions are given as (conditional) probability tables since all the random variables used in a REBN are discrete.",
        "Here, four types of probability tables used by REBNs are described.",
        "a hearer observes w from c and x which the speaker intends to indicate.",
        "In most cases, Wi does not depend on X , i.e., P (Wi|Ci, X) ?",
        "P (Wi|Ci).",
        "X is, however, necessary to handle individualized terms (names).",
        "There are several conceivable ways of probability assignment.",
        "One simple way is: for each cji ,",
        "number of possible words for cji .",
        "\" is a predefined small number such as 10?8.",
        "We use this assignment in the evaluation.",
        "P (Ci = c|X = x,D = d) is the probability that concept c is chosen from D(Ci) to indicate x in d. The developers of DSs cannot provide P (Ci|X,D) in advance because D(Ci) is context-dependent.",
        "Therefore, we take an approach of composing P (Ci|X = x,D = d) from R(cji , x, d) (cji ?",
        "D(Ci)\\{?}).",
        "Here R(cji , x, d) is the relevancy of concept cji to referent x with regard to d, and 0 ?",
        "R(cji , x, d) ?",
        "1.",
        "1 means full relevancy and 0 means no relevancy.",
        "0.5 means neutral.",
        "For example, a concept BOX will have a high relevancy to a suitcase such as 0.8 but a concept BALL will have a low relevancy to the suitcase such as 0.1.",
        "If x is not in d, R(cji , x, d) is 0.",
        "Algorithm 1 in appendix A shows an algorithm to compose P (Ci|X = x,D = d) from R(cji , x, d).",
        "Concept ?",
        "will be assigned a high probability if none of cji ?",
        "D(Ci)\\{?}",
        "has a high relevancy to x.",
        "If cji is static,1 R(cji , x, d) is numerically given in advance in the form of a table.",
        "If not static, it is implemented as a function by the DS developer, that is, R(cji , x, d) = fcji (x, d, I).",
        "Here I is all the information available from the DS.",
        "1Whether a concept is static or not depends on each DS.",
        "For example, given a situation such as shown in figure 1, the relevancy function of a positional concept LEFT (suppose a RE such as ?the left piece?)",
        "can be implemented as below: fLEFT(x, d, I) = (ux ?",
        "ur)/(ul ?",
        "ur).",
        "(2) Here, ux, ul and ur are respectively the horizontal coordinates of x, the leftmost piece in d, and the rightmost piece in d, which are obtained from I .",
        "If x is a RD, the relevancy is given as the average of entities included in the RD.",
        "in RD d is referred to, which is estimated according to the contextual information at the time the corresponding RE is uttered but irrespective of attributive information in the RE.",
        "The contextual information includes the history of referring so far (discourse) and physical statuses such as the gaze of the referrer (situation).",
        "We call P (X = x|D = d) the prediction model.",
        "The prediction model can be constructed by using a machine learning-based method.",
        "We use a ranking-based method (Iida et al., 2010).",
        "The score output by the method is input into the standard sigmoid function and normalized to be a probability.",
        "If x is not in d, P (X = x|D = d) is 0.",
        "posed at the time the RE is uttered.",
        "We cannot collect data to estimate this probabilistic model because RDs are implicit.",
        "Therefore, we examine three a priori approximation functions based on the saliency of d. Saliency is proportional to recency.2 Uniformmodel This model ignores saliency.",
        "This is introduced to see the importance of saliency.",
        "Linear model This model distributes probabilities in proportion to saliency.",
        "This is an analogy of the",
        "Exponential model This model puts emphasis on recent RDs.",
        "This function is so called soft-max."
      ]
    },
    {
      "heading": "3 Experimental Evaluation",
      "text": [
        "We evaluated the potential of the proposed framework by using a situated human-human (HH) dialogue corpus."
      ]
    },
    {
      "heading": "3.1 Corpus",
      "text": [
        "We used the REX-J Japanese referring expression corpus (Spanger et al., 2010).",
        "The REX-J corpus consists of 24 HH dialogues in each of which two participants solve a Tangram puzzle of seven pieces (see figure 1).",
        "The goal of the puzzle is combining seven pieces to form a designated shape (such as a swan).",
        "One of two subjects takes the role of operator (OP) and the other takes the role of solver (SV).",
        "The OP can manipulate the virtual puzzle pieces displayed on a PC monitor by using a computer mouse but does not know the goal shape.",
        "The SV knows the goal shape but cannot manipulate the pieces.",
        "The states of the pieces and the mouse cursor operated by the OP are shared by the two subjects in real time.",
        "Thus, the two participants weave a collaborative dialogue including many REs to the pieces.",
        "In addition to REs, the positions and directions of the pieces, the position of the mouse cursor, and the manipulation by the OP were recorded with timestamps and the IDs of relevant pieces.",
        "Each RE is annotated with its referent(s) as shown in table 1.",
        "The 1st RE okkiisankaku3 big triangle ?a big triangle?",
        "in the table is ambiguous and refers to either piece 1 or 2.",
        "The 7th and 8th REs refer to the set of pieces 1 and 2.",
        "The other REs refer to an individual piece.",
        "To skip the structural analysis of REs to avoid problems due to errors in such analysis, we have additionally annotated the corpus with intermediate structures, from which REBNs are constructed.",
        "Because we focus on s-REX only in this paper, the 3Words are not separated by white spaces in Japanese.",
        "intermediate structures are straightforward:4 parenthesized lists of separated words as shown in table 1.",
        "The procedure to generate a REBN of s-REX from such an intermediate structure is also straightforward and thus it is not explained due to the page limitation."
      ]
    },
    {
      "heading": "3.2 Implementations",
      "text": [
        "We use BNJ5 for probabilistic computation.",
        "Here we describe the implementations of resources and procedures that are more or less specific to the task domain of REX-J.",
        "Table 2 shows an excerpt of the concept dictionary defined for REX-J.",
        "We manually defined 40 concepts by observing the dialogues.",
        "functions For 13 concepts out of 40, their relevancy values were manually determined by the authors.",
        "Table 3 shows an excerpt of the static relevancy table defined for the seven pieces shown in figure 1.",
        "TRI is relevant only to pieces 1 to 5, and SQR is relevant only to pieces 6 and 7 but is not totally relevant to piece 7 because it is not a square in a precise sense.",
        "FIG is equally but not very relevant to all the pieces,6 For the remaining 27 concepts, we implemented relevancy functions (see appendix B).",
        "3.2.3 Updating the list of RDs In our experiment, REs are sequentially resolved from the beginning of each dialogue in the corpus.",
        "In the course of resolution, RDs are added into a list and updated by the following procedure.",
        "RDs are sorted in descending order according to saliency.",
        "At each time of resolution, we assume that all the previous REs are correctly resolved.",
        "Therefore, after each time of resolution, if the correct referent of the last RE is a set, we add a new RD equivalent to the set into the list of RDs, unless the list contains another equivalent RD already.",
        "In either case, the saliency of the RD equivalent to the set is set to",
        "Here, ?",
        "is the largest saliency value in the list at the moment (the saliency value of the head RD).",
        "Before each time of resolution, we check whether the piece that is most recently manipulated after the previous RE constitutes a perceptual group by using the method explained in section 3.2.4 at the onset time of the target RE.",
        "If such a group is recognized, we add a new RD equivalent to the recognized group unless the list contains another equivalent RD.",
        "In either case, the saliency of the RD equivalent is set to ?+1 unless the RD is at the head of the list already, and the focus of the equivalent RD is set to the most recently manipulated piece.",
        "When a new RD@m is added to the list, a complementary RD @n and a subsuming RD @l are also inserted just after @m in the list.",
        "Here, @n = @0\\@m and @l = [@m?,@n].",
        "This operation is required to handle a concept REST, e.g., ?the remaining pieces.",
        "?",
        "There is a generally available method of simulated perceptual grouping (Tho?risson, 1994).",
        "It works well in a spread situation such as shown in figure 1 but tends to produce results that do not match our intuition when pieces are tightly packed at the end of a dialogue.",
        "Therefore, we adopt a simple method that recognizes a group when a piece is attached to another.",
        "This method is less general but works satisfactorily in the REX-J domain due to the nature of the Tangram puzzle.",
        "3.2.5 Ranking-based prediction model As mentioned in section 2.3.3, a ranking-based method (Iida et al., 2010) using SVMrank (Joachims, 2006) was adopted for constructing the prediction model P (X|D).",
        "This model ranks entities according to 16 binary features such as whether the target entity is previously referred to (a discourse feature), whether the target is under the mouse cursor (a mouse cursor feature), etc.7 When a target is a set (i.e., a RD), discourse features for it are computed as in the case of a piece; meanwhile, mouse cursor features are handled in a different manner.",
        "That is, if one of the group members meets the criterion of a mouse cursor feature, the group is judged as meeting the criterion.",
        "In (Iida et al., 2010), preparing different models for pronouns and non-pronouns achieved better performance.",
        "Therefore we trained two linear kernel SVM models for pronouns and non-pronouns with the 24 dialogues."
      ]
    },
    {
      "heading": "3.3 Experiment",
      "text": [
        "We used the 24 dialogues for evaluation.8 As mentioned in section 2.1, we focused on s-REX.",
        "These 24 dialogues contain 1,474 s-REX instances and 28 c-REX instances.",
        "In addition to c-REX, we excluded REs mentioning complicated concepts, for which it is difficult to implement relevancy functions in a short time.9 After excluding those REs,",
        "is equivalent to assuming that we have data large enough to saturate the performance of the prediction model.",
        "9Mostly, those are metaphors such as ?neck?",
        "and concepts related to operations such as ?put.?",
        "For example, although",
        "1,310 REs were available.",
        "Out of the 1,310 REs, 182 REs (13.9%) refers to sets, and 612 REs (46.7%) are demonstrative pronouns such as sore ?it.",
        "?",
        "We presupposed the following conditions.",
        "Speaker role independence: We assumed REs are independent of speaker roles, i.e., SV and OP.",
        "All REs were mixed and processed serially.",
        "Perfect preprocessing and past information: As mentioned in sections 3.1.1 and 3.2.3, we assumed that no error comes from preprocessing including speech recognition, morphological analysis, and syntactic analysis;10 and all the correct referents of past REs are known.11 No future information: In HH dialogue, sometimes information helpful for resolving a RE is provided after the RE is uttered.",
        "We, however, do not consider such future information.",
        "Numeral information: Many languages including English grammatically require indication of numeral distinctions by using such as articles, singular/plural forms of nouns and copulas, etc.",
        "Although Japanese does not have such grammatical devices,12 it would be possible to predict such distinctions by using a machine learning technique with linguistic ?putting a piece?",
        "and ?getting a piece out?",
        "are distinguished due to speakers?",
        "intentions, they are (at least superficially) homogeneous in the physical data available from the corpus and difficult for machines to distinguish each other.",
        "10In general, the speech and expressions in human-machine (HM) dialogue are less complex and less difficult to process than those in HH dialogue data.",
        "This is typcially observed as fewer disfluencies (Shriberg, 2001) and simpler sentences with fewer omissions (Itoh et al., 2002).",
        "Therefore, when we apply our framework to real DSs, we can expect clearer and simpler input and thus better performance.",
        "We supposed that the condition of perfect preprocessing in HH dialogue approximates the results to those obtained when HM dialogue data is used.",
        "11If a reference is misinterpreted (i.e., wrongly resolved) in a dialogue, usually that misinterpretation will be repaired by the interlocutors in the succeeding interaction once the misinterpretation becomes apparent.",
        "Therefore, accumulating all past errors in resolution is rather irrational as an experimental setting.",
        "12Japanese has a plurality marker -ra (e.g., sore-ra), but use of it is not mandatory (except for personal pronouns).",
        "and gestural information.",
        "Therefore we observed the effect of providing such information.",
        "In the following experiment we provide the singular/plural distinction information to REBNs by looking at the annotations of the correct referents in advance.",
        "This is achieved by adding a special evidence node C0, where D(C0) = {S,P}.",
        "P (C0 = S|X = x) = 1",
        "To our best knowledge, there is no directly comparable method.",
        "We set up two baselines.",
        "The first baseline uses the most recent as the resolved referent for each RE (Initial resolution of each dialogue always fails).",
        "This baseline is called Most-recent.",
        "As the second baseline, we prepared another P (D) model in addition to those explained in section 2.3.4, which is called Mono-domain.",
        "In Mono-domain, D(D) consists of only a single RD @?0, which contains individual pieces and the RDs recognized up to that point in time.",
        "That is, @?0 = D(X).",
        "Resolution using this model can be considered as a straightforward extension of (Iida et al., 2010), which enables handling of richer concepts in REs13 and handling of REs to sets14."
      ]
    },
    {
      "heading": "3.3.3 Results",
      "text": [
        "The performance of reference resolution is presented by category and by condition in terms of accuracy (# of correctly resolved REs/# of REs).",
        "We set up the three categories in evaluating resolution, that is, Single, Plural, and Total.",
        "Category Single is the collection of REs referring to a single piece.",
        "Plural is the collection of REs referring to a set of pieces.",
        "Total is the sum of them.",
        "Ambiguous REs such as the first one in table 1 are counted as ?Single?",
        "and the resolution of such a RE is considered correct if the resolved result is one of the",
        "?w/o S/P info.?",
        "indicates experimental results without singular/plural distinction information.",
        "?w/ S/P info.?",
        "indicates experimental results with it.",
        "Table 4 shows the results of reference resolution per P (D) modeling method.15 Obviously S/P information has a significant impact.",
        "While the best performance for category Single was achieved with the Linear model, the best performance for Plural was achieved with the Exponential model.",
        "If it is possible to know whether a RE is of Single or Plural, that is, if S/P information is available, we can choose a suitable P (D) model.",
        "Therefore, by switching models, the best performance of Total with S/P information reached 83.4%, and a gain of 2.0 points against Mono-domain was achieved (sign test, p < 0.0001).",
        "Because the corpus did not include many instances to which the notion of reference domains is effective, the impact of RDs may appear small on the whole.",
        "In fact, the impact was not small.",
        "By introducing RDs, resolution in category Plural achieved a significant advancement.",
        "The highest gain from Mono-domain was 9.3 points (sign test, p < 0.005).",
        "Moreover, more REs containing positional concepts such as LEFT and RIGHT were correctly resolved in the cases of Uniform, Linear, and Exponential.",
        "Table 5 summarizes the resolution results of four positional concepts (with S/P information).",
        "While Mono-domain resolved 65% of them, Linear correctly resolved 75% (sign test, p < 0.05).",
        "As shown in table 4, the performance of the Uniform model was worse than that of Mono-domain.",
        "This indicates that RDs introduced without an appropriate management of them would be harmful noise.",
        "Conversely, it also suggests that there might be a room for improvement by looking deeply into the management of RDs (e.g., forgetting old RDs)."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "This paper proposed a probabilistic approach to reference resolution, REBNs, which stands for Referring Expression Bayesian Networks.",
        "At each time of resolution, a dedicated BN is constructed for the 15According to the results of preliminary experiments, even in the case of the Uniform/Linear/Exponential models, we resolved the REs having demonstratives with the Mono-domain model.",
        "This is in line with the finding of separating models between pronouns and non-pronouns in (Iida et al., 2010).",
        "positional concepts.",
        "RE in question.",
        "The constructed BN deals with either descriptive, deictic or anaphoric REs in a unified manner.",
        "REBNs incorporate the notion of reference domains (RDs), which enables the resolution of REs with context-dependent attributes and handling of REs to sets.",
        "REBNs are for task-oriented dialogue systems and presuppose a certain amount of domain-dependent manual implementation by developers.",
        "Therefore, REBNs would not be suited to general text processing or non-task-oriented systems.",
        "However, REBNs have the potential to be a standard approach that can be used for any and all task-oriented applications such as personal agents in smart phones, in-car systems, service robots, etc.",
        "?",
        "The proposed approach was evaluated with the REX-J human-human dialogue corpus and promising results were obtained.",
        "The impact of incorporating RDs in the domain of the REX-J corpus was recognizable but not so large on the whole.",
        "However, in other types of task domains where grouping and comparisons of objects occur frequently, the impact would be larger.",
        "Note that REBNs are not limited to Japanese, even though the evaluation used a Japanese corpus.",
        "Evaluations with human-machine dialogue are important future work.",
        "Although this paper focused on the simple type of REs without relations, REBNs are potentially able to deal with complex REs with relations.",
        "The evaluation for complex REs is necessary to validate this potential of REBN.",
        "Currently REBN assumes REs whose referents are concrete entities.",
        "An extension for handling abstract entities (Byron, 2002; Mu?ller, 2007) is important future work.",
        "Another direction would be generating REs with REBNs.",
        "A generate-and-test approach is a naive application of REBN for generation.",
        "More efficient method is, however, necessary."
      ]
    }
  ]
}
