{
  "info": {
    "authors": [
      "Hirotoshi Taira",
      "Katsuhito Sudoh",
      "Masaaki Nagata"
    ],
    "book": "Proceedings of the Sixth Workshop on Syntax, Semantics and Structure in Statistical Translation",
    "id": "acl-W12-4213",
    "title": "Zero Pronoun Resolution can Improve the Quality of J-E Translation",
    "url": "https://aclweb.org/anthology/W12-4213",
    "year": 2012
  },
  "references": [
    "acl-C88-2159",
    "acl-P02-1018",
    "acl-P02-1040",
    "acl-P03-1021",
    "acl-P07-2045",
    "acl-W04-0709",
    "acl-W10-1736",
    "acl-W97-0114"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In Japanese, particularly, spoken Japanese, subjective, objective and possessive cases are very often omitted.",
        "Such Japanese sentences are often translated by Japanese-English statistical machine translation to the English sentence whose subjective, objective and possessive cases are omitted, and it causes to decrease the quality of translation.",
        "We performed experiments of J-E phrase based translation using Japanese sentence, whose omitted pronouns are complemented by human.",
        "We introduced ?antecedent F-measure?",
        "as a score for measuring quality of the translated English.",
        "As a result, we found that it improves the scores of antecedent F-measure while the BLEU scores were almost unchanged.",
        "Every effectiveness of the zero pronoun resolution differs depending on the type and case of each zero pronoun."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Today, statistical translation systems have been able to translate between languages at high accuracy using a lot of corpora .",
        "However, the quality of translation of Japanese to English is not high comparing with the other language pairs that have the similar syntactic structure such as the French-English pair.",
        "Particularly, the quality of translation from spoken Japanese to English is in low.",
        "There are many reasons for the low quality.",
        "One is the different syntactic structures, that is, Japanese sentence structure is SOV while English one is SVO.",
        "This problem has been partly solved by head finalization techniques (Isozaki et al., 2010).",
        "Another big problem is that subject, object and possessive cases are often eliminated in Japanese, particularly, spoken Japanese (Nariyama, 2003).",
        "In the case of Japanese to English translation, the source language has lesser information in surface than the target language, and the quality of the translation tends to be low.",
        "We show the example of the omissions in Fig 1.",
        "In this example, the Japanese subject watashi wa (?I?)",
        "and the object anata ni (?to you?)",
        "are eliminated in the sentence.",
        "These omissions are not problems for human speakers and hearers because people easily recognize who is the questioner or responder (that is, ?I?",
        "and ?you?)",
        "from the context.",
        "However, generally speaking, the recognition is difficult for statistical translation systems.",
        "Some European languages allow the elimination of subject.",
        "We show an example in Spanish in Fig 2.",
        "In this case, the subject is eliminated, and it leaves traces including the case and the sex, on the related verb.",
        "The Spanish word, tengo is the first person singular form of the verb, tener (it means ?have?).",
        "So it is easier to resolve elimination comparing with Japanese one for SMT.",
        "Otherwise, Japanese verbs usually have no inflectional form depending on the case and sex.",
        "So, we need take another way for elimination resolution.",
        "For example, if the eliminated Japanese subject is always ?I?",
        "when the sentence is declarative, and the subject is always ?you?",
        "when the sentence is a question sentence, phrase based translation systems are probably able to translate subject-eliminated Japanese sentences to correct English sentences.",
        "However, the hypothesis is not always",
        "Jpn: (watashi wa) (anata ni) shoushou ukagai tai koto ga ari masu .",
        "Eng: I have some questions to ask to you .",
        "In this paper, we show that the quality of spoken Japanese to English translation can improve using a phrase-based translation system if we can use an ideal elimination resolution system.",
        "However, we also show that a simple elimination resolution system is not effective to the improvement and it is necessary to recognize correctly the modality of the sentence."
      ]
    },
    {
      "heading": "2 Previous Work",
      "text": [
        "There are a few researches for adaptation of ellipsis resolution to statistical translation systems while there are a lot of researches for one to rule-based translation systems in Japanese (Yoshimoto, 1988; Dohsaka, 1990; Nakaiwa and Yamada, 1997; Ya-mamoto et al., 1997).",
        "As a research of SMT using elimination resolution, we have (Furuichi et al., 2011).",
        "However, the target of the research is illustrative sentences in English to Japanese dictionary.",
        "Our research aims spoken language translation and it is different from the paper."
      ]
    },
    {
      "heading": "3.1 Ellipsis Resolved Data by Human",
      "text": [
        "In this section, we describe the data used in our experiments.",
        "We used BTEC (Basic Travel Expression Corpus) corpus (Kikui et al., 2003) distributed in IWSLT07 (Fordyce, 2007).",
        "The corpus consists of tourism-related sentences similar to those that are usually found in phrasebooks for tourists going abroad.",
        "The characteristics of the dataset are shown in Table 1.",
        "We used ?train?",
        "for training, ?devset13?",
        "for tuning, and ?test?",
        "for evaluation.",
        "We did not use the ?devset4?",
        "and ?devset5?",
        "sets because of the different number of English references.",
        "We annotated zero pronouns and the antecedents to the sentences by hand.",
        "Here, zero pronoun is defined as an obligatory case noun phrase that is not expressed in the utterance but can be understood through other utterances in the discourse, context, or out-of-context knowledge (Yoshimoto, 1988).",
        "We annotated the zero pronouns based on pronouns in the translated English sentences.",
        "The BTEC corpus has multi-references in English.",
        "We first chose the most syntactically and lexically similar translation in the references and annotated zero pronouns in it.",
        "Our target pronouns are I, my, me, mine, myself, we, our, us, ours, ourselves, you, your, yourself, yourselves, he, his, him, himself, she, her, herself, it, its, itself, they, their, them, theirs and themselves in English.",
        "We show the distribution of the annotation types in the test set in Table 2."
      ]
    },
    {
      "heading": "3.2 Baseline System",
      "text": [
        "We also examined a simple baseline zero pronoun resolution system for the same data.",
        "We defined",
        "Japanese predicate as verb, adjective, and copula (da form) in the experiments.",
        "If the inputted Japanese sentence contains predicates and it does not contain ?wa?",
        "(a binding particle and a topic marker), ?mo?",
        "(a binding particle, which means ?also?",
        "and can often replace ?wa?",
        "and ?ga?",
        "), and ?ga?",
        "(a case particle and subjective marker), the system regards the sentence as a candidate sentence to solve the zero pronouns.",
        "Then, if the candidate sentence is declarative, the system inserts ?watashi wa (I)?",
        "when the predicate is a verb, and ?sore wa (it)?",
        "when the predicate is a adjective or a copula.",
        "In the same way, if the candidate sentence is a question, the system inserts ?anata wa (you)?",
        "when the predicate is a verb, and ?sore wa (it)?",
        "when the predicate is a adjective or a copula.",
        "These inserted position is the beginning of the sentence.",
        "In the case that the sentence is imperative, the system does not solve the zero pronouns (Fig.",
        "3)."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": []
    },
    {
      "heading": "4.1 Experimental Setting",
      "text": [
        "Fig.",
        "4 shows the outline of the procedure of our experiment.",
        "We used Moses (Koehn et al., 2007) for the training of the translation and language models, tuning with MERT (Och, 2003) and the decoding.",
        "First, we prepared the data for learning which consists of parallel English and Japanese sentences.",
        "We used MeCab 1 as Japanese tokenizer and the tokenizer in Moses Tool kit as English tokenizer.",
        "We used default settings for the parameters of Moses.",
        "Next, Moses learns language model and translation model from the Japanese and English sentence pairs.",
        "Then, the learned model was tuned by completed sentences with MERT.",
        "and Moses decoded the completed Japanese sentences to English sentences."
      ]
    },
    {
      "heading": "4.2 Evaluation Method",
      "text": [
        "evaluation of the performances, comparing the system outputs with the English references of test data.",
        "Using only BLEU score is not adequate for evaluation of pronoun translation (Hardmeier et al., 2010).",
        "We were inspired empty node recovery evaluation by (Johnson, 2002) and defined antecedent Precision (P), Recall (R) and F-measure (F) as follows,",
        "Here, S is the set of each pronoun in English translated by decoder, G is the set of the gold standard zero pronoun.",
        "We evaluated the effect of performance of every case among completed sentences by human, ones by the baseline system, and the original sentences."
      ]
    },
    {
      "heading": "4.3 Experimental Result",
      "text": [
        "We show the BLEU scores in Table 3. and the antecedent precision, recall and F-measure in Table 4.",
        "The BLEU scores for experiments using our baseline system and human annotation, are slightly better than for one without ellipsis resolution, 45.4% and 45.6%, respectively.",
        "However, the scores of antecedent F-measure have major difference between ?original?",
        "and ?human?.",
        "Particularly, the recall is improved.",
        "Each 1st, 2nd and 3rd person score is better than original one."
      ]
    },
    {
      "heading": "5 Discussion and Conclusion",
      "text": [
        "We performed experiments of J-E phrase based translation using Japanese sentences, whose omitted pronouns are complemented by human and a baseline system.",
        "Using ?antecedent F-measure?",
        "as a score for measuring the quality of the translated English, it improves the score of antecedent F-measure.",
        "Every effectiveness of the zero pronoun resolution",
        "differed, depending on the type and case of each zero pronoun.",
        "The F-measures for the first person pronoun were smaller than expected ones, Rather, the scores for and possessive pronouns second person were greater (Table.",
        "3).",
        "We show a better, a worse, and an unchanged cases of translation using the baseline system of the elimination resolution in Fig. 5.",
        "The left-hand is the result of the alignment between the original Japanese sentence and the decoded English sentence.",
        "The right-hand is the result of one using the Japanese the baseline system solved zero pronouns.",
        "In the ?better?",
        "case, the alignment of todokete (send) is better than one of the original sentence, and ?Can you?",
        "is compensated by the solved zero pronoun anata-wa (you-TOP).",
        "Otherwise, in the ?worse?",
        "case, our baseline system could not recognize that the sentence is imperative, and inserted watashi-wa (I-TOP) incorrectly into the sentence.",
        "It indicates that we need a highly accurate recognition of the modalities of sentences for more correct completion of the antecedent of zero pronouns.",
        "In the ?unchanged?",
        "case, the translation results are the same.",
        "However, the alignment of the right-hand is more correct than one of the left-hand."
      ]
    }
  ]
}
