{
  "info": {
    "authors": [
      "Katharina Wäschle",
      "Sascha Fendrich"
    ],
    "book": "SemEval",
    "id": "acl-S12-1064",
    "title": "HDU: Cross-lingual Textual Entailment with SMT Features",
    "url": "https://aclweb.org/anthology/S12-1064",
    "year": 2012
  },
  "references": [
    "acl-D08-1084",
    "acl-D11-1062",
    "acl-J03-1002",
    "acl-J05-4003",
    "acl-J93-2003",
    "acl-N10-1045",
    "acl-P10-4008",
    "acl-P11-1134",
    "acl-S12-1053",
    "acl-W07-1431",
    "acl-W11-2107"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We describe the Heidelberg University system for the Cross-lingual Textual Entailment task at SemEval-2012.",
        "The system relies on features extracted with statistical machine translation methods and tools, combining monolingual and cross-lingual word alignments as well as standard textual entailment distance and bag-of-words features in a statistical learning framework.",
        "We learn separate binary classifiers for each entailment direction and combine them to obtain four entailment relations.",
        "Our system yielded the best overall score for three out of four language pairs."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Cross-lingual textual entailment (CLTE) (Mehdad et al., 2010) is an extension of textual entailment (TE) (Dagan and Glickman, 2004).",
        "The task of recognizing entailment is to determine whether a hypothesis H can be semantically inferred from a text T .",
        "The CLTE task adds a cross-lingual dimension to the problem by considering sentence pairs, where T and H are in different languages.",
        "The SemEval-2012 CLTE task (Negri et al., 2012) asks participants to judge entailment pairs in four language combinations1, defining four target entailment relations, forward, backward, bidirectional and no entailment.",
        "We investigate this problem in a statistical learning framework, which allows us to combine cross-lingual word alignment features as well as common 1Spanish-English (es-en), Italian-English (it-en), French-English (fr-en) and German-English (de-en).",
        "monolingual entailment metrics, such as bag-of-words overlap, edit distance and monolingual alignments on translations of T and H , using standard statistical machine translation (SMT) tools and resources.",
        "Our goal is to address this task without deep processing components to make it easily portable across languages.",
        "We argue that the cross-lingual entailment task can benefit from direct alignments between T and H , since a large amount of bilingual parallel data is available, which naturally models synonymy and paraphrasing across languages."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "With the yearly Recognizing Textual Entailment (RTE) challenge (Dagan et al., 2006), there has been a lot of work on monolingual TE.",
        "We therefore include established monolingual features in our approach, such as alignment scores (MacCartney et al., 2008), edit distance and bag-of-words lexical overlap measures (Kouylekov and Negri, 2010).",
        "So far, the only work on CLTE that we are aware of is Mehdad et al. (2010), where the problem is reduced to monolingual entailment using machine translation, and Mehdad et al. (2011), which exploits parallel corpora for generating features based on phrase alignments as input to an SVM.",
        "Our approach combines ideas from both, mostly resembling Mehdad et al. (2011).",
        "There are, however, several differences; we use word translation probabilities instead of phrase tables and model monolingual and cross-lingual alignment separately.",
        "We also include additional similarity measures derived from the MT evaluation metric Meteor, which was used in Volokh and Neumann (2011) for the monolingual TE task.",
        "Con",
        "versely, Pado?",
        "et al (2009) showed that textual entailment features can be used for measuring MT quality, indicating a strong relatedness of the two problems.",
        "The CLTE task is also related to the problem of identifying parallel sentence pairs in a non-parallel corpus, so we adapt alignment-based features from Munteanu and Marcu (2005), where a Maximum Entropy classifier was used to judge if two sentences are sufficiently parallel.",
        "Regarding the view on entailment, MacCartney and Manning (2007) proposed the decomposition of top-level entailment, such as equivalence (which corresponds to the CLTE bidirectional class), into atomic forward and backward entailment predictions, which is mirrored in our multi-label approach with two binary classifiers."
      ]
    },
    {
      "heading": "3 SMT Features for CLTE",
      "text": [
        "The SemEval-2012 CLTE task emerges from the monolingual RTE task; however the perception of entailment differs slightly.",
        "In CLTE, the sentences T1 and T2 are of roughly the same length and the entailment is predicted in both directions.",
        "Negri et al.",
        "(2011) states that the CLTE pairs were created by paraphrasing an English sentence E and leaving out or adding information to construct a modified sentence E?, which was then translated into a different language2, yielding sentence F and thus creating a bilingual entailment pair.",
        "For this reason, we believe that our system should be less inference-oriented than some previous RTE systems and rather should capture ?",
        "paraphrases and synonymy to identify semantic equivalence, ?",
        "phrases that have no matching correspondent in the other sentence, indicating missing (respectively, additional) information.",
        "To this end, we define a number of similarity metrics based on different views on the data pairs, which we combine as features in a statistical learning framework.",
        "Our features are both cross-and monolingual.",
        "We obtain monolingual pairs by translating the English sentence E into the foreign lan2We refer to the non-English language sentence as F .",
        "guage, yielding T (E) and vice versa T (F ) from F , using Google Translate3."
      ]
    },
    {
      "heading": "3.1 Token ratio features",
      "text": [
        "A first indicator for additional or missing information are simple token ratio features, i.e. the fraction of the number of tokens in T1 and T2.",
        "We define three token ratio measures:"
      ]
    },
    {
      "heading": "3.2 Bag-of-words and distance features",
      "text": [
        "Typical similarity measures used in monolingual TE are lexical overlap metrics, computed on bag-of-words representations of both sentences.",
        "We use the following similarities, computing both sim(E, T (F )) and sim(F, T (E)).",
        "?",
        "Jaccard coefficient, sim(A,B) = |A?B||A?B| ?",
        "Overlap coefficient, sim(A,B) = |A?B|min(|A|,|B|) We also compute the lexical overlap on bigrams and trigrams.",
        "In addition, we include a simple distance measure based on string edit distance ed, summing up over all distances between every token a in A and its most similar token b in B, where we assume that the corresponding token is the one with the smallest edit distance:"
      ]
    },
    {
      "heading": "3.3 Meteor features",
      "text": [
        "The Meteor scoring tool (Denkowski and Lavie, 2011) for evaluating the output of statistical machine translation systems can be used to calculate the similarity of two sentences in the same language.",
        "Meteor uses stemming, paraphrase tables and synonym collections to align words between the two sentences and scores the resulting alignment.",
        "We include the overall weighted Meteor score both for (E, T (F ))",
        "and (F, T (E))4 as well as separate alignment precision, recall and fragmentation scores for (E, T (F ))."
      ]
    },
    {
      "heading": "3.4 Monolingual alignment features",
      "text": [
        "We use the alignments output by the Meteor-1.3 scorer for (E, T (F ))5 to calculate the following metrics: ?",
        "number of unaligned words ?",
        "percentage of aligned words ?",
        "length of the longest unaligned subsequence"
      ]
    },
    {
      "heading": "3.5 Cross-lingual alignment features",
      "text": [
        "We calculate IBM model 1 word alignments (Brown et al., 1993) with GIZA++ (Och and Ney, 2003) on a data set concatenated from Europarl-v66 (Koehn,",
        "2005) and a bilingual dictionary obtained from dict.cc7 for coverage.",
        "We then heuristically align each word e in E with the word f in F for which we find the highest word translation probability p(e|f) and vice versa.",
        "Words for which no translation is found are considered unaligned.",
        "From this alignment a, we derive the following features both for E and F (resulting in a total of eight cross-lingual alignment features): ?",
        "number of unaligned words ?",
        "percentage of aligned words ?",
        "alignment score 1|E|",
        "?",
        "length of the longest unaligned subsequence"
      ]
    },
    {
      "heading": "4 Classification",
      "text": [
        "To account for the different data ranges, we normalized all feature value distributions to the normal distribution N (0, 13), so that 99% of the feature values are in [?1, 1].",
        "We employed SVMlight (Joachims, 1999) for learning different classifiers to output the four entailment classes.",
        "We submitted a second 4Meteor-1.3 supports English, Spanish, French and German.",
        "We used the Spanish version for scoring Italian, since those languages are related.",
        "run to evaluate our recently implemented stochastic learning toolkit Sol (Fendrich, 2012), which implements binary, multi-class, and multi-label classification.",
        "For development, we split the training set in two parts, which were alternatingly used as training and test set.",
        "We first experimented with a multi-class classifier that learned all four entailment classes at once.",
        "However, although the task defines four target entailment relations, those can be broken down into two atomic relations, namely directional entailment from T1 to T2 and from T2 to T1 (table 1).",
        "We therefore learned a binary classifier for each atomic entailment relation and combined the output to obtain the final entailment class.",
        "We found this view to be a much better fit for the problem, improving the accuracy score on the development set by more than 10 percentage points (table 2).",
        "This two-classifiers approach can also be seen as a variant of multi-label learning, with the two atomic entailment relations as labels.",
        "We therefore also trained a direct implementation of multi-label classification.",
        "Although it substantially outperformed the multi-class approach, the system yielded considerably lower scores than the version using two binary classifiers."
      ]
    },
    {
      "heading": "5 Results",
      "text": [
        "The accuracy scores of our two runs on the SemEval-2012 CLTE test set are presented in table 3.",
        "Our system performed best out of ten systems for the language pairs es-en and de-en and tied in first place for fr-en.",
        "For it-en, our system came in second.",
        "Regarding the choice of the learner, our toolkit slightly outperformed SVMlight on three of the four language pairs.",
        "To determine the contribution of different feature types for each language combination, we performed ablation tests on the development set, where we switched off groups of features and measured the",
        "impact on the accuracy score (table 4).",
        "We assessed the statistical significance of differences in score with an approximate randomization test8 (Noreen, 1989), indicating a significant impact in bold font.",
        "The results show that only in two cases a single feature group significantly impacts the score, namely the Meteor score features for es-en and the cross-lingual alignment features for de-en.",
        "However, no feature group hurts the score either, since negative variations in score are not significant.",
        "To ensure that the different feature groups actually express diverse information, we also evaluated our system using only one group of features at a time.",
        "The results confirm the most significant feature type for each language pair, but even the best-scoring feature group for each pair always yielded scores 3-6 percentage points lower than the system with all feature groups combined.",
        "We therefore conclude that the combination of diverse features is one key aspect of"
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "We have shown that SMT methods can be profitably applied for the problem of CLTE and that combining different feature types improves accuracy.",
        "Key to our approach is furthermore the view of the four-class entailment problem as a bidirectional binary or multi-label problem.",
        "A possible explanation for the superior performance of the multi-label approach is that the overlap of the bidirectional entailment with forward and backward entailment might confuse the multi-class learner.",
        "Regarding future work, we think that our results can be improved by building on better alignments, i.e. using more data for estimating cross-lingual alignments and larger paraphrase tables.",
        "Furthermore, we would like to investigate more thoroughly in what way the representation of the problem in terms of machine learning impacts the system performance on the task ?",
        "in particular, why the two-classifiers approach substantially outperforms the multi-label implementation."
      ]
    }
  ]
}
