{
  "info": {
    "authors": [
      "Mathias Verbeke",
      "Vincent Van Asch",
      "Roser Morante",
      "Paolo Frasconi",
      "Walter Daelemans",
      "Luc De Raedt"
    ],
    "book": "EMNLP",
    "id": "acl-D12-1053",
    "title": "A Statistical Relational Learning Approach to Identifying Evidence Based Medicine Categories",
    "url": "https://aclweb.org/anthology/D12-1053",
    "year": 2012
  },
  "references": [
    "acl-D07-1111",
    "acl-D08-1068",
    "acl-J07-1005",
    "acl-W03-1310",
    "acl-W08-2125"
  ],
  "sections": [
    {
      "text": [
        "?",
        "Dipartimento di Sistemi e Informatica, Universita` degli Studi di Firenze, Italy"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "Evidence-based medicine is an approach whereby clinical decisions are supported by the best available findings gained from scientific research.",
        "This requires efficient access to such evidence.",
        "To this end, abstracts in evidence-based medicine can be labeled using a set of predefined medical categories, the so-called PICO criteria.",
        "This paper presents an approach to automatically annotate sentences in medical abstracts with these labels.",
        "Since both structural and sequential information are important for this classification task, we use kLog, a new language for statistical relational learning with kernels.",
        "Our results show a clear improvement with respect to state-of-the-art systems."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Evidence-based medicine (EBM) or evidence-based practice (EBP) combines clinical expertise, the preferences and values of the patient and the best available evidence to make good patient care decisions.",
        "Clinical research findings are systematically reviewed, appraised and used to improve the patient care, for which efficient access to such evidence is required.",
        "In order to facilitate the search process, medical documents are labeled using a set of predefined medical categories, the PICO criteria.",
        "PICO is an acronym for the mnemonic concepts that are used to construct queries when searching for scientific evidence in the EBM process.",
        "The need to automatize the annotation process has initiated research into automatic approaches to annotate sentences in medical documents with the PICO labels.",
        "As indicated by Kim et al2011), both the structural information of the words in the sentence, and that of the sentences in the document are important features for this task.",
        "Furthermore, sequential information can leverage the dependencies between different sentences in the text.",
        "Therefore we propose an approach using kLog (Frasconi et al2012) to tackle this problem.",
        "kLog is a new language for statistical relational learning with kernels, that is embedded in Prolog, and builds upon and links together concepts from database theory, logic programming and learning from interpretations.",
        "Learning from interpretations is a logical and relational learning setting (De Raedt et al2008) in which the examples are interpretations, that is, sets of tuples that are true in the examples.",
        "In a sense, each example can be viewed as a small relational database.",
        "kLog is able to transform relational into graph-based representations and apply kernel methods to extract an extended high-dimensional feature space.",
        "The choice for kLog was motivated by previous results (Verbeke et al2012), where we showed that a statistical relational learning approach using kLog is able to process the contextual aspects of language improving on state-of-the-art results for hedge cue detection.",
        "However, the current task adds two levels of complexity.",
        "First, next to the relations between the words in the sentence, now also the relations between the sentences in the document become important.",
        "In the proposed approach, we first generate a feature space with kLog that captures the intrasen-tential properties and relations.",
        "Hereafter, these features serve as input for a structured output support vector machine that can handle sequence tagging",
        "(Tsochantaridis et al2004), in order to take the intersentential features into account.",
        "Second, since there are more than two categories, and each sentence can have multiple labels, the problem is now a multiclass multilabel classification task.",
        "The main contribution of this paper is that we show that kLog's relational nature and its ability to declaratively specify and use background knowledge is beneficial for natural language learning problems.",
        "This is shown on the NICTA-PIBOSO corpus, for which we present results that indicate a clear improvement on the state-of-the-art.",
        "The remainder of this paper is organized as follows.",
        "In Section 2, we outline earlier work that is related to the research presented here.",
        "Section 3 describes the methodology of our method.",
        "We present a thorough evaluation of our method in Section"
      ]
    },
    {
      "heading": "4. The last section draws conclusions and presents",
      "text": [
        "some ideas for future work."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "EBM is an approach to clinical problem-solving based on ?systematically finding, appraising, and using contemporaneous research findings as the basis for clinical decisions?",
        "(Rosenberg and Donald, 1995).",
        "The evidence-based process consists of four steps: (1) Formulating a question from a patient's problem; (2) Searching the literature for relevant clinical articles; (3) Evaluating the evidence; And (4) implementing useful findings in clinical practice.",
        "Given the amounts of medical publications available in databases such as PubMed, automating step 2 is crucial to help doctors in their practice.",
        "Efforts in this direction from the NLP community have so far focused on corpus annotation (Demner-Fushman and Lin, 2007; Kim et al2011), text categorization (Davis-Desmond and Molla?, 2012), sum-marization (Molla?",
        "and Santiago-Mart?",
        "?nez, 2011), and question-anwering (Niuet al2003; Demner-Fushman and Lin, 2007).",
        "The existing corpora are usually annotated with the PICO mnemonic (Armstrong, 1999) concepts, that are used to build queries when searching for literature for EBM purposes.",
        "The PICO concepts are: primary Problem (P) or population, main Intervention (I), main intervention Comparison (C), and Outcome of intervention (O).",
        "PICO helps determining what terms are important in a query and therefore it helps building the query, which is sent to the search repositories.",
        "Once the documents are found, they need to be read by a person who eliminates irrelevant documents.",
        "The first attempt to classify PICO concepts is presented in Demner-Fushman and Lin (2007), who apply a rule-based approach to identify sentences where PICO concepts occur and a supervised approach to classify sentences that contain an Outcome.",
        "The features used by this classifier are n-grams, position, and semantic information from the parser used to process the data.",
        "The system is trained on 275 abstracts manually annotated.",
        "The accuracies reported range from 80% for Population, 86% for Problem, 80% for Intervention, and, from 64% to 95% for Outcome depending on the test set of abstracts.",
        "Kim et al2011) perform a similar classification task in two steps.",
        "First a classifier identifies the sentences that contain PICO concepts, and then another classifier assigns PICO tags to the sentences found to be relevant by the previous classifier.",
        "The system is based on a CRF algorithm and is trained on the NICTA-PIBOSO corpus.",
        "This dataset contains 1,000 medical abstracts manually annotated with an extension of the PICO tagset, for which the definitions are listed in Table 1.",
        "The annotation is performed at sentence level and one sentence may have more than one tag.",
        "An example of an annotated abstract from the corpus can be found in the supplementary material.",
        "The features used by the algorithm include features derived from the context, semantic relations, structure and sequencing of the text.",
        "The system is evaluated for 5-way and 6-way classification and results are provided apart from structured and unstructured abstracts.",
        "The F-scores for structured abstracts is 89.32% for 5-way classification and 80.88% for 6-way classification, whereas for unstructured abstracts it is 71.54% for 5-way classification and 64.66% for 6-way classification.",
        "Chung (2009) uses CRF to classify PICO concepts by combining them with general categories associated with rhetorical roles: Aim, Method, Results and Conclusion.",
        "Her system is tested on corpora of abstracts of randomized control trials.",
        "First structured abstracts with headings labeled with PICO",
        "Background Material that informs and may place the current study in perspective, e.g. work that preceded the current; information about disease prevalence; etc.",
        "Population The group of individual persons, objects or items comprising the study's sample, or from which the sample was taken for statistical measurement Intervention The act of interfering with a condition to modify it or with a process to change its course (includes prevention) Outcome The sentence(s) that best summarizes the consequences of an intervention Study Design The type of study that is described in the abstract Other Any sentence not falling into one of the other categories and presumed to provide little help with clinical decision making, i.e. non-key or irrelevant sentences",
        "concepts are used.",
        "A sentence level classification task is performed, assigning only one rhetorical role per sentence.",
        "The F-scores obtained range from 0.93 to 0.98.",
        "Then another sentence level classification task is performed to automatically assign the labels Intervention, Participant and Outcome Measures to sentences in unstructured and structured abstracts without headings.",
        "F-scores of up to 0.83 and 0.84 are obtained for Intervention and Outcome Measure sentences.",
        "Other work aimed at identifying rhetorical zones in biomedical articles.",
        "In this case areas of text are classified in terms of the rhetorical categories Introduction, Methods, Results and Discussion (IMRAD) (Agarwal and Yu, 2009) or richer categories, such as problem-setting or insight (Mizuta et al. 2006).",
        "There exists a wide range of statistical relational learning systems (Getoor and Taskar, 2007; De Raedt et al2008), and many of these systems are in principle useful for natural language processing.",
        "The most popular formalism today is Markov Logic, which has already been used for natural language processing tasks such as semantic role label-ing (Riedel and Meza-Ruiz, 2008) and coreference resolution (Poon and Domingos, 2008).",
        "With respect to Markov Logic, two distinguishing features of kLog are that 1) it employs kernel based methods grounded in statistical learning theory, and 2) it employs a Prolog like language for defining and using background knowledge.",
        "As Prolog is a programming language, this is more flexible that the formalism used by Markov Logic."
      ]
    },
    {
      "heading": "3 Methodology",
      "text": [
        "In learning from examples, or interpretations (De Raedt et al2008), the instances are sampled identically and independently from some unknown but fixed distribution.",
        "They can be represented as pairs z = (x, y), in which x represents the inputs and y the outputs.",
        "An example interpretation can be found in Figure 3, where the hasCategory relation represents y in this case, since it is the target relation we want to predict.",
        "The inputs x are formed by all other facts.",
        "The task is now to learn a function h : X ?",
        "Y that maps the inputs to the outputs.",
        "Sentences may have multiple labels.",
        "Hence this is a structured output task where the output is a sequence of sets of labels attached to the sentences in a given document.",
        "kLog is the new statistical relational language for learning with kernels that we use to tackle the PICO categories classification task.",
        "The novelty of kLog is that, based on the regular, linguistic features, it allows to define an extended high-dimensional feature space that is also able to take relational features into account in a principled manner.",
        "Furthermore, its declarative approach offers a flexible and interpretable way to construct features.",
        "The choice of kLog is motivated by our previous results (Verbeke et al2012), where we showed that the relational representation of the domain as used by kLog is able to take the contextual aspects of language into account.",
        "Whereas there we only used the relations at the sentence level, the current task adds a new level of complexity, since the identification of PICO categories in abstracts also requires to take into account various relations between the sentences of an abstract.",
        "The general workflow of our approach is depicted in Figure 1, which will be de",
        "scribed step by step in the following paragraphs.",
        "Preprocessing The sentences have been preprocessed with a named entity tagger and a dependency parser.",
        "Named entity tagging has been performed with the BiogaphTA named entity module, which matches token sequences with entries in the UMLS database1.",
        "UMLS integrates over 2 million names for some 900,000 concepts from more than 60 families of biomedical vocabularies (Bodenreider, 2004).",
        "The tagger matches sequences with a length of maximum 4 tokens.",
        "This covers 66.2% of the UMLS entries.",
        "By using UMLS, different token sequences referring to the same concept can be mapped to the same concept identifier (CID).",
        "The BiographTA named entity tagger has been evaluated on the BioInfer corpus (Pyysalo et al2007) obtaining a 72.02 F1 score.",
        "Dependency parsing has been performed with the GENIA dependency parser GDep (Sagae and Tsu-jii, 2007), which uses a best-first probabilistic shift-reduce algorithm based on the LR algorithm (Knuth, 1965) and extended by the pseudo-projective parsing technique.",
        "This parser is a version of the KSDep dependency parser trained on the GENIA Treebank for parsing biomedical text.",
        "KSDep was evaluated in the CoNLL Shared Task 2007 obtaining a La-beled Attachment Score of 89.01% for the English dataset.",
        "GDEP outputs the lemmas, chunks, Genia named entities and dependency relations of the tokens in a sentence.",
        "This information can be represented as an Entity/Relationship (E/R) diagram, a modeling paradigm that is frequently used in database theory (Garcia-Molina et al2008).",
        "The E/R-model for the 1From UMLS only the MRCONSO.RRF and MRSTY.RRF files are used.",
        "problem under consideration is shown in Figure 2, which provides an abstract representation of the examples, i.e. medical abstracts in this case.",
        "We will show later how this abstract representation can be unrolled for each example, resulting in a graph; cf. also Figure 4 for our example sentence.",
        "This relational database representation will serve as the input for kLog.",
        "The entities are the words and sentences in the abstract.",
        "They are represented by the rectangles in the E/R-model.",
        "Each entity can have a number of properties attached to it, depicted by the ovals and has a unique identifier (underlined properties).",
        "As in database theory, each entity corresponds with a tuple, or fact, in the database.",
        "Figure 3 shows a part of an example interpretation z.",
        "For example, w(w4 1,?Surgical?,?Surgical?,bnp,jj,?O?,?O?)",
        "specifies a word entity, with w4 1 as identifier and the other arguments as properties.",
        "As indicated before, as lexical information we take the token string itself, its lemma, the part-of-speech tag and the chunk tag into account.",
        "We also include some semantic information, namely two binary values indicating if the word is a (biological) named entity.",
        "sentence(s4,4) represents a sentence entity, with its index in the abstract as a property.",
        "Furthermore, the E/R-diagram also contains a number of relationships, which are represented by",
        "ing the example sentence in Figure 4. the diamonds.",
        "They are linked to the entities that participate in the relationship, or stand alone if they characterize general properties of the interpretation.",
        "An example relation is nextW(w4 2,w4 1), which indicates the sequence of the words in the sentence.",
        "dh(w4 1,w4 2,nmod) specifies that word w4 1 is a noun modifier of word w4 2, and thus serves to incorporate the dependency relationships between the words.",
        "hasCategory(s4,?background?)",
        "signifies that sentence s4 is a sentence describing background information.",
        "This relation is the target relation that we want to predict for this task and will not be taken into account as a feature, but is listed in the database and only used during the training of the model.",
        "Since the previously described entities and relationships are listed explicitly in the database, these are called extensional relations, in contrast to the in-tensional relations, as we will describe next.",
        "Declarative feature construction A strength of kLog is that it is also capable of constructing features declaratively, by using intensional relations.",
        "This enables one to encode additional background knowledge based on a small set of preprocessed features, which renders experimentation very flexible and makes the results more interpretable.",
        "It furthermore allows one to limit the required features to the core discriminative ones.",
        "These intensional features are defined through definite clauses, and is done using an extension of the declarative programming language Prolog.",
        "The following features were used.",
        "We make a distinction between the features used for structured and unstructured abstracts.",
        "For structured abstracts, four intensional relations were defined.",
        "The relation lemmaRoot(S,L) is specified as:",
        "dh(I,_,root).",
        "For each sentence, it only selects the lemmas of the root word in the dependency tree, which markedly limits the number of word features used.",
        "The following relations are related to, and try to capture the document structure imposed by the section headers present in the structured abstracts.",
        "hasHeaderWord(S,X) identifies whether a sentence is a header of a section.",
        "In order to realize this, it selects the words of a sentence that count more than four characters (to discard short names of biological entities), which all need to be uppercase.",
        "all_upper(C).",
        "Also the sentences below a certain section header need to be marked as belonging to this section, which is done by the relation hasSectionHeader(S,X).",
        "For the unstructured abstracts, also the lemmaRoot relation is used, but next to the lemma, now also the part-of-speech tag of the root word is taken into account.",
        "Since the unstructured abstracts lack section headers, other features were needed to distinguish between the different sections, for which the relation prevLemmaRoot proved to be very informative.",
        "It adds the lemma of the root word in the previous sentence as a property to the current sentence under consideration.",
        "prevLemmaRoot(S,L) ?",
        "nextS(S1,S), lemmaRoot(S1,L,_).",
        "The intensional predicates are grounded.",
        "This is a proces similar to materialization in databases, that is, the atoms implied by the background knowledge and the facts in the example are all computed using Prolog's deduction mechanism.",
        "This leads to the extensionalized database, in which both the extensional as well as the grounded intensional predicates are listed.",
        "Graphicalization and feature generation In the third step, the interpretations are graphicalized, i.e. transformed into graphs.",
        "Since the facts that form the interpretation still conform to the E/R-diagram, this can be interpreted as unfolding the E/R-diagram over the data.",
        "An example illustrating this process is given in Figure 4.",
        "Each interpretation is converted into a bipartite graph, for which there is a vertex for every ground atom of every E-relation, one for every ground atom of every R-relation, and an undirected edge {e, r} if an entity e participates in relationship r. The obtained graphs can then be used in the next step for feature generation.",
        "This is done by means of a graph kernel ?, which calculates the similarity between two graphicalized interpretations.",
        "Any graph kernel that allows fast computations on large graphs and has a flexible bias to enable heterogeneous features can in theory be applied.",
        "In the current implementation, an extension of the Neighbor",
        "to each other in order to calculate the similarity between two graphs.",
        "These subgraphs can be seen as circles in the graph, and are defined by three hyper-parameters.",
        "First of all, there is the center of the subgraph, the kernel point, which can be any entity or relation in the graph.",
        "The entities and relations to be taken into account as kernel points are marked beforehand as a subset of the intensional and extensional domain relations.",
        "The radius r determines the size of the subgraphs and defines which entities or relations around the kernel point are taken into account.",
        "Each entity or relation that is within a number of r edges away from the kernel point is considered to be part of the subgraph.",
        "The third hyperparam-eter, the distance d, determines how far apart from each other the kernel points can be.",
        "Each subgraph around a kernel point that is within a distance d or less from the current kernel point will be considered.",
        "This is captured by the relation Rr,d(Av, Bu, G) between two rooted subgraphs Av, Bu and a graph G, which selects all pairs of neighborhood graphs of radius r whose roots are at distance d in a given graph G. The kernel ?r,d(G,G?)",
        "between graphs G and G?",
        "on the relation Rr,d is then defined as:",
        "For efficiency reasons, an upper bound is imposed on the radius and distance parameters, which leads to the following kernel definition:",
        "We hereby limit the sum of the ?r,d kernels for all increasing values of the radius and distance parameter up to a maximum given value of r?, respectively d?.",
        "The result of this graphicalization and feature generation process is an extended, high-dimensional feature space, which serves as input for the statistical learner in the next step.",
        "Learning The constructed feature space contains one feature vector per sentence.",
        "This implies that the sequence information of the sentences at the document level is not taken into account yet.",
        "Since the order of the sentences in the abstract is a valuable feature for this prediction problem, a learner that reflects this in the learning process is needed, although in principle any statistical learner can be used on the feature space constructed by kLog.",
        "Therefore we opted for SVM-HMM2 (Tsochantaridis et al., 2004), which is an implementation of structural support vector machines for sequence tagging.",
        "In contrast to a conventional Hidden Markov Model, SVM-HMM is able to take these entire feature vectors as observations, and not just atomic tokens.",
        "In our case, the instances to be tagged are formed by the sentences for which feature vectors were created in the previous step.",
        "The qid is a special feature that is used in the structured SVM to restrict the generation of constraints.",
        "Since every document needs to be represented as a sequence of sentences, in SVM-HMM, the qid's are used to obtain the document structure.",
        "The order of the HMM was set to 2, which means that the two previous sentences were considered for collective classification.",
        "The cost value was set to 500, and was determined via cross-validation.",
        "For epsilon, the default value, 0.5, was kept, since this mainly only influences the running time and memory consumption during training.",
        "number of sentences per class (taken from (Kim et al. 2011))."
      ]
    },
    {
      "heading": "4 Evaluation",
      "text": [
        "We evaluate the performance of kLog against a baseline system and a memory-based tagger (Daelemans and van den Bosch, 2005).",
        "The results are also compared against those from Kim et al2011), which is the state-of-the-art system for this task."
      ]
    },
    {
      "heading": "4.1 Datasets",
      "text": [
        "We perform our experiments on the NICTA-PIBOSO dataset from Kim et al2011) (kindly provided by the authors).",
        "It contains 1,000 abstracts of which 500 were retrieved from MEDLINE by querying for diverse aspects in the traumatic brain injury and spinal cord injury domain.",
        "The dataset consists of two types of abstracts.",
        "If the abstract contains section headings (e.g. Background, Methodology, Results, etc.",
        "), it is considered to be structured.",
        "This information can be used as a feature in the model.",
        "The other abstracts are regarded unstructured.",
        "The definitions of the semantic tags used as annotations categories are a variation on the PICO tag set, with the addition of two additional categories (see Table 1 in Section 2).",
        "Each sentence can be annotated with multiple classes.",
        "This renders the task a multiclass multilabel classification problem.",
        "The statistics on this dataset can be found in Table 2.",
        "In order to apply the same evaluation setting as Kim et al2011), we used the dataset from Demner-Fushman et al2005) as external dataset.",
        "It consists of 100 sentences of which 51 are structured.",
        "Because the semantic tag set used for annotation slightly differs from the one presented in Table 1, and to make our results comparable, we will use the same mapping as used in Kim et al2011)."
      ]
    },
    {
      "heading": "4.2 Baseline and benchmarks",
      "text": [
        "We compare the kLog system to three other systems: a baseline system, a memory-based system, and the scores reported by Kim et al2011).",
        "The memory-based system that we use is based on the memory-based tagger MBT3 (Daelemans and van den Bosch, 2005).",
        "This machine learner is originally designed for part-of-speech tagging.",
        "It processes data on a sentence basis by carrying out sequential tagging, viz. the class label or other features from previously tagged tokens can be used when classifying a new token.",
        "In our setup, the sentences of an abstract are taken as the processing unit and the collection of all sentences in an abstract is taken as one sequence.",
        "The features that are used to label a sentence are the class labels of four previous sentences, the am-bitags of the following two sentences, the lemma of the dependency root of the sentence, the position of the sentence in the abstract, the lemma of the root of the previous sentence, and section information.",
        "For each root lemma, all possible class labels, as observed in the training data, are concatenated into one ambitag.",
        "These tags are stored in a list.",
        "An ambitag for a sentence is retrieved by looking up the root lemma in this list.",
        "The position of the sentence is expressed by a number.",
        "Section information is obtained by looking for a previous sentence that consists of only one token in uppercase.",
        "Finally, basic lemmatization is carried out by removing a final S. All other settings of MBT are the default settings and no feature optimization nor feature selection has been carried out to prevent overfitting.",
        "When a class label contains multiple labels, like e.g. population and study design, these labels are concatenated in an alphabetically sorted manner.",
        "This method of working reduces the multilabel problem to a problem with many different labels, i.e. the label powerset method of Tsoumakas et al2010).",
        "The baseline system is exactly the same as the memory-based system except that no machine learner is included.",
        "The most frequent class label in the training data, i.e.",
        "Outcome, is assigned to each instance.",
        "The memory-based system enables us to compare kLog against a basic machine learning approach, using few features.",
        "The majority baseline 3http://ilk.uvt.nl/mbt [16 March 2012] system enables us to compare the memory-based system and kLog against a baseline in which no information about the observations is used."
      ]
    },
    {
      "heading": "4.3 Parametrization",
      "text": [
        "From the kernel definition it might be clear that the kLog hyperparameters, namely the distance d and radius r, can have a strong influence on the results.",
        "This requires a deliberate choice during parametrization.",
        "From a linguistic perspective, the use of unigrams and bigrams is justifiable, since most phrases that reveal clues on the structure of the abstract (e.g. evaluation measures, methodolody, future work) can be expressed with single or pairs of words.",
        "This is reflected by a distance and radius both set to 1, which enables to take all possible combinations of consecutive words into account and captures the relational information attached to the word in focus, i.e. the current kernel point.",
        "This is confirmed by cross-validation on other settings for the hyperparameters.",
        "Since kLog generates a feature vector, only the sequence information at word level is taken into account by kLog.",
        "Since we use a sequence labeling approach as statistical learner, i.e. SVM-HMM, at the level of the abstract this information is however implicitly taken into account during learning.",
        "For SVM-HMM, only the cost parameter C, which regulates the trade-off between the slack and the magnitude of the weight-vector, and , that specifies the precision to which constraints are required to be satisfied by the solution, were optimized by means of cross-validation.",
        "For the other parameters, the default values were used."
      ]
    },
    {
      "heading": "4.4 Results",
      "text": [
        "Experiments are run on structured and unstructured abstracts separately.",
        "On the NICTA-PIBOSO corpus, we performed 10-fold cross-validation.",
        "Over all folds, all labels, i.e. the parts of the multilabels, are compared in a binary way between gold standard and prediction.",
        "Summing all true positives, false positives, and false negatives over all folds leads to micro-averaged F-scores.",
        "This was done for two different settings.",
        "In one setting, CV/6-way, we combined the labeling of the sentences with the identification of irrelevant information, by adding the Other",
        "label as an extra class in the classification.",
        "The results are listed in Table 3.",
        "For this setting, kLog is able to outperform both MBT and the system of Kim et al2011), for both structured and unstructured abstracts on all classes except Population.",
        "From Table 4, where the micro-average F-scores over all classes and for all settings are listed, it can be observed that kLog performs up to 3.73% better than MBT over structured abstracts, and 9.67% better over unstructured ones.",
        "Although to a lesser extent for the structured abstracts, the same pattern can be observed for the CV/5-way setting, where we tried to classify the sentences only, without considering the irrelevant ones.",
        "The per-class results for this setting are shown in Table 5.",
        "Now the scores for Population are comparable to the other systems, due to which we assume these sentences are similar in structure to the ones labeled with Other.",
        "For the external corpus, the results are listed in Table 6.",
        "Although kLog performs comparably for the individual classes Background and Intervention, its overall performance is worse on the structured abstracts.",
        "In case of the unstructured abstracts, kLog performs better on the majority of the individual classes and in overall performance for the 5-way setting, and comparable for the 4-way setting.",
        "cation over structured (S) and unstructured (U) abstracts on the external corpus.",
        "As a general observation, it is important to note that there is a high variability between the different labels.",
        "Due to kLog's ability to take the structured input into account, we assume a correlation between the sentence structure of the label and the prediction quality.",
        "We intend to perform an extensive error analysis, in order to detect patterns which may allow us to incorporate additional declarative background knowledge into our model."
      ]
    },
    {
      "heading": "5 Conclusions",
      "text": [
        "We presented a statistical relational learning approach for the automatic identification of PICO categories in medical abstracts.",
        "To this extent, we used kLog, a new framework for logical and relational learning with kernels.",
        "Due to its graphical approach, it is able to exploit the full relational representation, that is often inherent in language structure.",
        "Since contextual features are often essential and relations are prevalent, the aim of this paper was to show that statistical relational learning in general, and the graph kernel-based approach of kLog in particular, is specifically suited for problems in natural lan",
        "guage learning.",
        "In future work, we intend to explore additional ways to incorporate background knowledge in a declarative way, since it renders the language learning problem more intuitive and gives a better understanding of feature contribution.",
        "Furthermore, we also want to investigate the use of SRL approaches for high-relational domains, and make a clear comparison with related techniques."
      ]
    },
    {
      "heading": "6 Acknowledgements",
      "text": [
        "This research is funded by the Research Foundation Flanders (FWO project G.0478.10 - Statistical Re",
        "would like to thank Fabrizio Costa, Kurt De Grave and the anonymous reviewers for their valuable feedback."
      ]
    }
  ]
}
