{
  "info": {
    "authors": [
      "Matt Garley",
      "Julia Hockenmaier"
    ],
    "book": "ACL",
    "id": "acl-P12-2027",
    "title": "Beefmoves: Dissemination, Diversity, and Dynamics of English Borrowings in a German Hip Hop Forum",
    "url": "https://aclweb.org/anthology/P12-2027",
    "year": 2012
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics, pages 135?139, Jeju, Republic of Korea, 8-14 July 2012. c?2012 Association for Computational Linguistics Beefmoves: Dissemination, Diversity, and Dynamics of English Borrowings in a German Hip Hop Forum"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "We investigate how novel English-derived words (anglicisms) are used in a German-language Internet hip hop forum, and what factors contribute to their uptake."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Because English has established itself as something of a global lingua franca, many languages are currently undergoing a process of introducing new loanwords borrowed from English.",
        "However, while the motivations for borrowing are well studied, including e.g. the need to express concepts that do not have corresponding expressions in the recipient language, and the social prestige associated with the other language (Hock and Joseph, 1996), the dynamics of this process are poorly understood.",
        "While mainstream political debates often frame borrowing as evidence of cultural or linguistic decline, it is particularly pervasive in youth culture, which is often heavily influenced by North American trends.",
        "In many countries around the globe, hip hop fans form communities in which novel, creative uses of English are highly valued (Pennycook, 2007), indicative of group membership, and relatively frequent.",
        "We therefore study which factors contribute to the uptake of (hip hop-related) anglicisms in an online community of German hip hop fans over a span of 11 years."
      ]
    },
    {
      "heading": "2 The MZEE and Covo corpora",
      "text": [
        "We collected a ?12.5M word corpus (MZEE) of forum discussions from March 2000 to March 2011 on the German hip hop portal MZEE.com.",
        "A manual analysis of 10K words identified 8.2% of the tokens as anglicisms, contrasting with only 1.1% anglicisms in a major German news magazine, the Spiegel (Onysko, 2007, p.114).",
        "These anglicisms include uninflected English stems (e.g., battle, rapper, flow) as well as English stems with English inflection (e.g., battled, rappers, flows), English stems with German inflection (e.g., gebattlet, rappern, flowen ?battled, rappers, to flow?",
        "), and English stems with German derivational affixes (e.g., battlema?ssig, rapperische, flowendere ?battle-related, rapper-like, more flowing?",
        "), as well as compounds with one or more English parts (e.g., battleraporientierter, hiphopgangstaghettorapper, maschinengewehrflow ?someone oriented towards battle-rap, hip hop-gangsta-ghetto-rapper, machinegun flow?).",
        "We also collected a ?20M word corpus (Covo) of English-language hip hop discussion (May 2003 - November 2011) from forums at ProjectCovo.com."
      ]
    },
    {
      "heading": "3 Identification of novel anglicisms",
      "text": [
        "In order to identify novel anglicisms in the MZEE corpus, we have developed a classifier which can identify anglicism candidates, including those which incorporate German material (e.g., mo?chtegerngangsterstyle ?wannabe gangster style?",
        "), with very high recall.",
        "Since we are not interested in well-established anglicisms (e.g., Baby, OK), non-English words, or placenames, our goal is quite different from the standard language identification problem, including Alex (2008)'s inclusion classifier, which sought to identify ?foreign words?",
        "in general, including internationalisms, homographic",
        "10-fold CV; std.",
        "deviations ?",
        "0.02 for all cases words, and non-German placenames, but ignored hybrid/bilingual compounds and English words with German morphology during evaluation.",
        "Our final system consists of a binary classifier augmented with dictionary lookup for known words and two routines to deal with German morphology (affixation and compounding).",
        "The baseline classifier We used MALLET (Mc-Callum, 2002) to train a maximum entropy classifier, using character 1 through 6-grams (including word boundaries) as features.",
        "Since we could not manually annotate a large portion of the MZEE corpus, the training data consisted of the disjoint subsets of the English and German CELEX wordlists (Baayen et al., 1995), as well as the words used in Covo (to obtain coverage of hip hop English).",
        "We tested the classifier using 10-fold cross validation on the training data and on a manually annotated development set of 10K consecutive tokens from MZEE.",
        "All data was lowercased (this improved performance).",
        "We excluded from both data sets 4,156 words shared by the CELEX wordlists (such as Greek/Latin loanwoards common to both languages and homographs such as hat), 100 common German and 50 common English stop words, all 3 character words without vowels and 1,019 hip hop artists/label names, which reduced the development set from 10K tokens, or 3,380 distinct types, to 4,651 tokens and 2,741 types.",
        "Affix-stripping Since German is a moderately inflected language, anglicisms are often ?hidden?",
        "by German morphology: in geflowt ?flowed?, the English stem flow takes German participial affixes.",
        "We therefore included a template-based affix-stripping preprocessing step, removing common German affixes before feature extraction.",
        "Because of the possibility of multiple prefixation or suffixation (e.g. rum-ge-battle (?battling around?)",
        "or deep-er-en (?deeper?",
        ")), we stripped sequences of two prefixes and/or three suffixes.",
        "Our list of affixes was built",
        "from commonly-affixed stems in the MZEE corpus and a German grammar (Fagan, 2009).",
        "Compound-cutting Nominal and adjectival compounding is common in German, and loanword compounds are commonly found in MZEE:",
        "(1) a. chart|tauglich (?suitable for the charts?)",
        "b. flow|maschine|ma?ssig (?like a flow machine?)",
        "c. Rap|vollpfosten (?rap dumbasses?)",
        "Since these contain features that are highly indicative of German (e.g. -lich#, a?, and pf ), we devised a compound-cutting procedure for words over length l (=7): if the word is initially classified as German, it is divided several ways according to the parameters n (=3), the number of cuts in each direction from the center, and m (=2), the minimum length of each part.",
        "Both halves are classified separately, and if the maximum anglicism classifier score out of all splits exceeds a target confidence c (=0.7), the original word is labeled a candidate anglicism.",
        "Parameter values were optimized on a subset of compounds from the development set.",
        "Dictionary classification When applying the classifier to the MZEE corpus, words which occur exclusively in one of the German and English CELEX wordlists are automatically classified as such.",
        "This improved classifier results over tokens and types, as seen in Table 1 in the comparison of token and type precision for the dict/nodict conditions.",
        "Evaluation We evaluated our system by adjusting the classifier threshold to obtain a recall level of 95% or higher on anglicism tokens in the development set (see Table 1).",
        "The final classifier achieved a per-token precision of 70% (per type: 67%) at 95% recall, a gain of 7% (9%) over the baseline.",
        "Our system identified 1,415 anglicism candidate types with a corpus frequency of 100 or greater, out",
        "of which we identified 851 (57.5%) for further investigation; 441 (31.1%) were either established anglicisms, place names, artist names, and other loanwords, and 123 (8.7%) were German words."
      ]
    },
    {
      "heading": "4 Predicting the fate of anglicisms",
      "text": [
        "We examine here factors hypothesized to play a role in the establishment (or decline) of anglicisms.",
        "Frequency in the English Covo corpus We first examine whether a word's frequency in the English-speaking hip hop community influences whether it becomes more frequently used in the German hip hop community.",
        "We aligned four large (>1M words each) 12-month time windows of the Covo and MZEE corpora, spanning the period 11-2003 through 11-2007.",
        "We used the 851 most frequent anglicisms identified in our system to find 106 English stems commonly used in German anglicisms, and compute their relative frequency (aggregated over all word forms) in each Covo and MZEE time window.",
        "We then measure correlation coefficients r between the frequency of a stem in Covo at time Tt, fEt (stem), and the change in log frequency of the corresponding anglicisms in MZEE between Tt and a later time Tu,",
        "as well as the corresponding p-values, and coefficients of determination R2 (Table 2).",
        "There is a significant positive correlation between the variables, especially for change over a two-year time span.",
        "during year t and frequency change in MZEE between t and year u = t + i Initial frequency and dissemination in MZEE In studying the fate of all words in two English Usenet corpora, Altmann, Pierrehumbert and Motter (2011, p.5) found that the measures DU",
        "is defined as the ratio of the actual number of users of word w (Uw) over the expected number of users of w (U?w), and DT ="
      ]
    },
    {
      "heading": "Tw T?w",
      "text": [
        "is calculated analogously fo the actual/expected number of threads in which w is used.",
        "U?w and T?w are estimated from a bag-of-words model approximating a Poisson process.",
        "We apply Altmann et al's model to study the difference in word dynamics between anglicisms and native words.",
        "Since we are not able to lemma-tize the entire MZEE corpus, this study uses the 851 most common anglicism word forms identified by our system, treating all word forms as distinct.",
        "We split the MZEE corpus into six non-overlapping",
        "time window Tt.",
        "We again measure how well these variables predict the change in log frequency",
        "very weakly (0.0309 < r < 0.0692), but significantly (p < .0001) positively correlated with ?",
        "log10 ft:u.",
        "However, in contrast to Altmann et al.",
        "'s findings that DU and DT serve better than frequency as predictors of word fate, for the set of anglicisms (Table 3), all correlations were both negative and stronger, and initial frequency log10 ft (not dissemination) is the best predictor, especially as the time spans increase in length.",
        "That is, while most words?",
        "frequency change cannot generally be predicted from earlier frequency, we find that, for anglicisms, a high frequency is more likely to lead to a decline, and vice versa.1.",
        "1A set of 337 native German words frequency-matched to the most common 337 anglicisms in our data set patterns with the superset of all words (i.e., is not well predicted by any of the",
        "semination over users and threads and a change in frequency for the 851 most common anglicisms in MZEE.",
        "Finally, from the comparison of timespans in Table 3, we see that the predictive ability (R2) of the three measures increases as the timespan for ?",
        "log10 f becomes longer, i.e., frequency and dissemination effects on frequency change do not operate as strongly in immediate time scales.2."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "In this study, we examined factors hypothesized to influence the propagation of words through a community of speakers, focusing on anglicisms in a German hip hop discussion corpus.",
        "The first analysis presented here sheds light on the lexical dynamics between the English and German hip hop communities, demonstrating that English frequency correlates positively with change in a borrowed word's frequency in the German community?this result is not shocking, as the communities are exposed to shared inputs (e.g., hip hop lyrics), but the strength of this correlation is highest in a two-year timespan, suggesting a time lag from the frequency of hip hop terms in English to the effects on those terms in German.",
        "Future research here could profitably focus on this relationship, especially for terms whose success in the English and German hip hop communities is highly disparate.",
        "Investigation of those terms could suggest non-frequency factors which affect a word's variables) in this regard.",
        "2An analysis which truncated the forms in the first two timespans to match the N of the third confirm that this increase is not simply an effect of the number of cases considered.",
        "success or failure.",
        "The second analysis, which compared three measures used by Altmann, Pierrehumbert, and Motter (2011) to predict lexical frequency change, found that log10 f , D U , and DT did not predict frequency change well for non-anglicism words in the MZEE corpus, but that log10 f in particular does predict frequency change for anglicisms, though this correlation is inverse; this finding relates to another analysis of loanwords.",
        "In a diachronic study of loanword frequencies in two French newspaper corpora, Chesley and Baayen (2010, p.1364-5) found that high initial frequency was ?a bad omen for a borrowing?",
        "and found an interaction effect between frequency and dispersion (roughly equivalent to dissemination in the present study): ?As dispersion and frequency increase, the number of occurrences at T2 decreases.?",
        "A view of language as a stylistic resource (Cou-pland, 2007) provides some explanation for these counter-intuitive findings: An anglicism which is used less often initially but survives is likely to increase in frequency as other speakers adopt it for ?cred?",
        "or in-group prestige.",
        "However, a highly frequent anglicism seems to become increasingly undesirable?after all, if everyone is using it, it loses its capacity to distinguish in-group members (consider, e.g., the widespread adoption of the term bling outside hip hop culture in the US).",
        "This circumstance is reflected by a drop in frequency as the word becomes passe?.",
        "This view is supported by ethnographic interviews with members of the German hip hop community: ?Yeah, [the use of anglicisms is] naturally overdone, for the most part.",
        "It's targeted at these 15, 14-year-old kids, that think this is cool.",
        "The crowd!",
        "Ah, cool!",
        "Yeah, it's true?the crowd, even I say that, but not seriously.?",
        "-?Peter?, 22, beatboxer and student at the Hip Hop Academy Hamburg.",
        "In summary, the analyses discussed here leverage the opportunities provided by large-scale corpus analysis and by the uniquely language-focused nature of the hip hop community to investigate issues of sociohistorical linguistic concern: what sort of factors are at work in the process of linguistic change through contact, and more specifically, which word-extrinsic properties of stems and word-forms condition the success and failure of borrowed English words in the German hip hop community."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": []
    }
  ]
}
