{
  "info": {
    "authors": [
      "Wallace L. Chafe"
    ],
    "book": "ACL Microfiche Series 1-83, Including Computational Linguistics",
    "id": "acl-J79-1010",
    "title": "An Approach to Verbalization and Translation by Machine",
    "url": "https://aclweb.org/anthology/J79-1010",
    "year": 1979
  },
  "references": [],
  "sections": [
    {
      "heading": "AN APPROACH TO VERBALIZATION AND TRANSLATION BY MACHINE",
      "text": []
    },
    {
      "heading": "Abstract",
      "text": [
        "This report describon a moda for machine trannlation developed at Berkeley during 1972-74.",
        "The Todel in built around a cot of procedures cllled vorbalizati-)n, intended to siLidlaLe the proce::ses emnloyed by a s')eaker or writer in tarninr stored knowled e nto words.",
        "verbalizntion in r,een to consLnt of subcoacciftnalizatirm and lexicqlizatiim processes which involve c:-ative choicon on the part of' the vrb'llizer, to,retber with ali;orithmic n.Tntridtic procesr,es determined Iv the lanr,uar;r: hei,fp; aned.",
        "2r-nniati,rn as vie/:-d us (1) ne r'const-uct,rm of tie vh] 1zti ii rrnm iiii1 went into the oririnal s.orce laniar) text arid nponcation of parallel erbalizatiprocesses in the r()..et 1 ;11:uare.",
        "-he tar:et lan-to-e verb,tlization Juoks S'or c-9tive choices t) tio sour;e lanGu-le-verbaliz,-ttion Tad tries to anply corref_f5ondinF choicehe sbme time that it aD lies syntactic nrQcesses dictate by the grammar ol tlae tlJret lanrruare.",
        "ierbllization and translati)n processes are illustrated, with examplp taen 'ftr7lish and Japanese.",
        "A few of these procenres hive been i,r.,lementerl In an interactive proc;r m 'sin; the fricilitien of the Imwrence 3er.1:7 Laboratory, hut the am.to'it of ble.",
        "re;)ort is Lo demorisLrut kinds of pr),:esses th,,Jt need to he inco_rortt!d axi n:,rrn,em."
      ]
    },
    {
      "heading": "Acknowlegments",
      "text": [
        "This report deals with work performed by the Contrastive Semantics Project in the Department of Linruistics of the University of California at Berkeley.",
        "The project was supported by Air Force Contract No.",
        "F30602-72-C-0/1-06.",
        "Associated with the project during its entire life, in addition to the author, were Patricia M. Clancy, Leonard M. Yaltz, Christopher Murano, and Hasmig Seropian.",
        "Also active during more than half of this period were Masayosti Shibatani and Linda oobek.",
        "Associated during shorter periods of time were Teresa M. Chen, Charles J. Fillmore, Robert E. Gaskins, and Marie-Claude Jorlatd.",
        "Masayoshi Hirose served as a consultant on Japanese during the final two months.",
        "This same reoort, in slightly different form, was published by Rome Air Development Center, Griffiss Air Force Base, Aew York, as RADC-TR-74-2'71 (October 19'74).",
        "here is the notion of verbalization, Verbilization is the application of processes by which som holistic conceptual chunk, recalled from memory, is converted into sentences and words-into a phonetically or grahically communicable linguistic representation.",
        "(ouch a notion assumes that the underlying content of what is being communicated is not, or need not be, in verbal form to begin with.",
        "At the very least it may be a complex system of discrete elements and relations, represen able perhaps as a network of nodes and arcs.",
        "It may also involve an important nondiscrete or analog component, representable only in some other terms.",
        "(For excellent summaries of both sides of thi- particular issue see Pylyshyn 1973 and Faivio 1974.)",
        "4vhatever may turn out to be the case here, it seems clear that some sorts of processes must be applied in order to transform the original form of storage into a verbal output: that the stored materi I must be verbalized.",
        "In any particular instance of translation there are two instances of verbalization.",
        "One I'S the originil verbnlization performed by the Grill-tor of the source language text.",
        "The other is the verbalization produced in the tlrget language by the translator.",
        "Besides being in different lnguages, these two verbalizations are fundamentally different in one other respect.",
        "2he source language verbalization is, we might say, autonomous.",
        "It is freely produced by the speaker or writer in any way he decides is a)propriyte to the content Ind the occasion, provided he adhere Q to the rules of his culture and the lanpu Re he is using.",
        "2he tarcret",
        "language verbalization, on the other hand, is parasitic on the source language one.",
        "Not only must the translator adhere to the rules of his own language, he must also produce a verbalization that communicates, so flr as possible, the same underlying content or knowledge that was communicated by the source language verbalization.",
        ".he verbalization in the target language is thus subject to this special kind of constraint., Its producer is not free to \"say what he wants,\" but must insofar as poqsible say the same thing as the producer of the source language text.",
        "we suggested in an earlier report that there are two dimensions of high quality translation, which we termed naturalness and fidelity.",
        "Naturalness is achieved when the target language verbalization adheres to all the constraints of that language; the output will then sound \"natural% Fidelity is achieved to the extent that the target language verbalization communicates the same content as the source language one.",
        "Verbalization in general, as we see it, consists of a mixture of two kinds of orocesses: those which necessitate creative decisions on the Dart of the verbalizer and those wlaich do not, Deli:1g governed by the constraints imr)osed by the 11nruage.",
        "might sneak of creqtive processe- and algorithmic processeb.",
        "tive processes are ultimately governed by the content which underlies the verbalization; the verbalizer has to decide how best to verbalize that content.",
        "Normally a range of choices will be open to him, and he must decide what will most effectively convey what he has in mind.",
        "After he has made sch choices, there are often automatic consequences which follow from them because of the",
        "particular rules of the language (but which are themselves likely to lead to the necessity of further creative choices).",
        "We can say, then, with respect to the two verbalizations involved in a translation, that the producer of the source language, verbalization, has applied both creative and algorithmic processes, whereas in the target language verbalization only algorithmic processes are autonomously applied, the necessary creative choices being determined by the choices that were made in the source language verbalization.",
        "Thus the naturalness of the fanal translation depends largely on adherence to the algorithmic processes of the target language, while its fidelity depends on the extent to which the translation has been able to incorporate creative cuoices that correspond to those originally applied in the source language.",
        "In ail probability there are cases where exact correspondence in these choices is not possible, and where a certain amount of autonomous creativity has to be introduced into the target verb lization -1,s well.",
        "These are the cases where automatic translation becomes most problematic.",
        "One useful goal of machine translatin research can be to determine pracisely the nature and extent of such cases.",
        "tie are led, then, to the general picture of translation which is shown in Figure 1.",
        "The two vertical columns represent the two verbalizations which are involved: .)n.",
        "the left the source languao verbalization and on the right the target verbalization, 2he inpat to a to a translation procedure, of course, is an already produced verbal output or text in the source language.",
        "The first major component of the translation procedure will have to be the reconstruction from that text of the verbalization processes by 8 which it was produced, 1 kimd of \"deve'balizRtion\" 'isie will refer to thin an the LEEELE1 com»nnt, although it is cleorly diffdrent from conventional parsing.",
        "lt aims to roconstruct, not a single deer) structure underlying the surlae text, bt rath r n sorios of processes by which that text was i,re'ited from the knoWldr'e--not only nonverb 1 but D ssiblA even nondiscrete--wie,h the enkor or writer hnd in Tqind.",
        "The but--)ut of the parsing comnent is ideally a com lete reconstruction of both the creative and tne alflorithmic rocesses which the source langu-te verbalizer apolied.",
        "The other major convonent of the translation procedure is the translation component.",
        "It is equivalent to a v2rbnlization-in tne targ2t language.",
        "The processes wqich make uo tclis verbalization are to the extent that they are algorithmic, those which exnrrtns target language constraints and, to the extent ftat they r.-e crea-ive, those which correspond to choices already made n the reconstructed source language verbalization.",
        "The necossity of reference to the source lanmar,o verbalization for creative choices at many points is sumestd in Figure 1 b the zir7a7 arrows itie believe that thin picture provides a plaumblc, bw;is for translation renearch, but needloss to nrly it oresents rvtny problems whose solutions are only dimly foreseen at the present time.",
        "uur project concentrated mor of its attention an verbalization itself t4an on parsing or tmnslation, since both of the latter depend on a prior understanding of verbalization.",
        "Any other orderin,(- of priorities would be putting the cart before the horse.",
        "Any detailed investigation of the parsing comoonent would be futile if we did not know what sort of output we would expect that comonent to produce:",
        "the processes that went into a p.artieular verbalization.",
        "The trdns-lation component is a verbalilaion4 thQuRh one of a soecial sort, and there again a detailed understanding of verbalization processes is necessary.",
        "This report, then, will be most concerned with the nature of verbalization.",
        "We will also devote considerale space to the nature' of that special sort of verbalization which is translation.",
        "We will have the least to sAy about parsing.",
        "Examples will be cited from English and Japanese.",
        "For bout the last nine months of the project we were concerned with the development of an interactive computer program that would implement the verbalization Drocesses we nypotqesized.",
        "Aithouirla this prOgram remained primitive, the intention was that it would gradually achieve increased sophistication in its ability to simu-iate verbElization, translation, and parsing.",
        "As it presently simulates the processes of verbalization, it begins with an item that represents the initial holistic idea which the sneaker or writer of a text wishes o communicate.",
        "It then asks the user, seated at a teletype, to make the series of creative choices that are hecessary in the production of the final text.",
        "At the same time it attempts to apply on its own the algorithmic processes which a-e called for.",
        "It knows when cretive choices are necessary, but must ask the user what choices to make.",
        "Ideally it should be able to apply the alcrorithmic processes without help.",
        "As it simulates translation it should likewise be able to apply the algorithmic processes of the targlt language automatically, and also to apply certain creative processes",
        "on its own by looking at the source language verbalizatiAn to see wnat creative choices were made there.",
        "Whenever it is not able to make a creative choice, the program asks the user to do so.",
        "e find that this kind of machine-user inter ction nrovides a valuable research technique.",
        "Taking as out ultimate goal the eventual elim-inRtion of the user from the translation program aqtogether, we start with a situation in which the user intervenes at many points.",
        "As we learn more we can graaually give the machine more to do and tne user less.",
        "This technique can be followed not only in verbalization, but also in parsing Whetner the user will .eventually disappeax from the Picture altogether is uncertain.",
        "However that may be, the Eoal ai a proc;ram in which the conti.ibution of the user is significantly diminished in relation to that of the machine seems workable.",
        "aort of the final goal of eliminating tne user altogether, an intermediate goal identifiable as \"human-aided\" machine translation can more easily be foreseen.",
        "Here the machine will do the many things for which it is suited; but a human brain will be introduced at those points where the machine has reached its limits.",
        "This intermediate goal has, we believe, significant practical as well as theoretical value.",
        "Funding for thi.s project ceased in June 1974.",
        "The report mutt be read, therefore, as a summary of work that was interrupted Lia mid-course, andsas a partial blueprint for further work should the necessary funding ever materialize.",
        "At this point, six months after the termination of the project, the need for varibus modifications is already evident.",
        "It seems best, however, to document consistently how things stood at the time of interruption, without 12 trying to thtroduce neW and untested material."
      ]
    },
    {
      "heading": "II. Subconceptualization",
      "text": [
        "de assume that a speaxer or writer begins with a single, unitary; holistic concentual chunk that he has recalled from memory and has decided, for some reason to communicate.",
        "Thus he may nave in mind some incident in which he was involved, something of interest he was previously told about or read about, some experiment he wishes to report on, or whatever.",
        "de label such a chunk, as well as the smaller chunks into which it will be analyzed, with the prefix CC (for \"conceptual chunk\") followed by a four-digit gumb_er.",
        "The first digit indicates the lang:uage n which verbalization is to take place (\"1\" for English and \"2\" for Japanese), and the remaiming three digits constitute an arbitrary index – for the particular chunk.",
        "Thus-Ce--1001 might be the name given to some particular chunk of this sort that is about to be verbalized in English.",
        "We assume, futhermore, that while this chunk is from one point of view a unit, from another point of view it has a more or less rich content', aild that it is this content which the speaker.wishes to convey to his audience.",
        "Sometimes, though not in most cases, the initial chunk itself may have a linguistic label.",
        "If it is a folktale, for example, it may have a name like \"Cihderella\" or \"The Three Bears\".",
        "But someone who has decided to tell a story is not likely to say jdst \"Cinderella\" and let it go at that.",
        "(One is reminded of the old story about a convention of comedians at which people said things like \"119\" or \"178\" and",
        "elicited laughter each tLme because everyone knew the jokes these numbers stood for.)",
        "Normally it is necessary instead for the speaker to get inside the content of this initial unit--to analyze it into smaller chunks.",
        "This kind of process can be pictured as shown in Figure 2, wherP the initial chunk 00-1001 has been, as we say, subconceptualized into chunks CO-1002•and (..-1003.",
        "In a text of any size each of these smaller chunks will be further broken down into still smaller ones, and sp on, so that a hierarchical structure of succ.essively smaller subconceptualizations emerges.",
        "Subconceptualization belongs-to the class of verbalization processes which are creative.",
        "Normally a chunk does not automatically determine a particular subconceptual breakdown, but the speaker must creatively choose how to subconceptualize each one.",
        "It is useful to think of the content of each chunk--each circle in Figure 2--as if it were a mountainous landscape, with the most slalient aspects :tanding out in bold relief and the less salient appearing as only minor hills.",
        "All other things being equal, the more salient some aspect of the total content is, the more likely the speaker is to express it when he subconceptualizes.",
        "He is not likely to make exactly the same subconceptual breakdown each time he communicates the same initial chunk, partly because he may judge different things ',;() be salient in different contexts and partly because the landscape itself may change over time, the relative salience of its different aspects being modified in long-term memory.",
        "1de assume that any particular subconceptuali-zation necessarily leaves out part of the content of what is being subconceptualized, as suggested by the area that lies within",
        "the lqrger circle but outside the two smaller circles in Figure 2.",
        "Subconceptualization, that is, is necessarily a selective process.",
        "No one over says everything he could say about what he has in mind.",
        "6ubconceptualization of pi particular chunk, say 03-1001, produces two or more hew chunks, say CC-1002 and C0-1003.",
        "These new chunks, furthermore, are conceivd of as related to each other in some way.",
        "For example) 33-1002 might be the \"reason\" for 30-1003.",
        "Suppose the entire text consisted of the sentences, \"I bolOit a bike yesterday.",
        "I decided I need more exercise.\"",
        "Let us say that the first sentence is a verbalization of 00-1003 and the second sentence of 00-1002. vJe can say that 30-10Q2 is the reason for CC-1003.",
        "write a subconceptualizati,n process of this kind in the following way: 1) ,1C-1001 S> CJ-REASON (CC-1002, 00-1003) This statement says that the initial chunk, 00-1001, is subconceptualized (S>) into the chunks CC-1002 and 00-1003, and th:t these two new chunks are related by the predicate labeled CJ-ILE,:.2)0N.",
        "The prefix CJ stands for \"conjunction\" (derived from the Erammatical, not the logical use of this term).",
        "1Lny relTtion between -Jj's is labeled with this prefix.",
        "e use a different notation to repre::ent each of the various stages in the verbalization process.",
        "c the outset, in this example the initial chunk 30-1001 was all that was present.",
        "This initial representation, before any verbalization processes had been applied, was simply: 2) CC-1001 After the subconceptualization soeffified in 1) was applied, the",
        "Subconceptualization processes are ';hus rewrite rules, which replace one stage in a verb:Ilization with a subsequent stage.",
        "The format ,de to represent such stages, as in 3), shoWg predicates with their arguments written indented below them.",
        "In simulating verbalization our program presently asks the user to specify all the creative choices, restricting its own contribution to the applicatinn or algorithmic Processea determined by the grammar of discourse, sentences, and words in tne lanpjuage involved.",
        "fne program is labeled VAT (for nverblizei and translatoe), and we can illustrate conversations between VA: and the user identifying them as V and LT respectively.",
        "he prof7rambegins by asking:",
        "4) V: fil4T VAT TA,r: Aur",
        "to which one possible answer is: 5) V203.",
        ":11= Skipping several steps to illustrnt ,Anly the rotr;h outlines of subconceptializati_on; we are interaP,teri just now in tIle (1uw-,tirm:",
        "At this point VI-LT will com-truct the representation shown in 3).",
        "In givinf; an answer like thnt in 7) the user of tHL,1,s proram is assumed to be El_king explicit a decizion wqich a real s eraker would make L•con.-3cic)usly the brlsis of a variety of complex criteria.",
        ":le do not pretend to understand how such a de,:is:on is reached; 'Iut",
        "can at least introduce the decision itself into the verbalization model at this stae.",
        "VAT will now apply an algorithmic or, as we say, syntactic process triggered by the presence of CJ-REAWN in 3).",
        "The process applied is of a type th0 is also not clearly understood, but we may view what we do at prerent a first approximation.",
        "Tit the moment VAT simply takes the twb 30s related Iv CJ-REAWN and orders them so that the second will be expressed before the first.",
        "That is, for exatple, if 30-1002 is eventwaly going to be verbalize; as \"1 decided I need more exercise\" and 00-1003 as \"I bought a hike yesterday\", we want the two sentences to be expressed, with 03-1003 preueding 00-1002.",
        "Thus VAT will automatically change the representation in 3) to tne following: .8) 00-10,03 U0-1002 This kind of representation, in which no predicate is shown anove the two COs, indicates that they (or their eventual verbalizetins) are to occur in the final text in the order.&lown, with J0-1003 preceding 00-1002.",
        "In Japanese the corresponaing syntactic process will tyoically lead to the attachment of CJ-\"KAAA\" at the end of th6 second sentence.",
        "2hus if a representation like that in 3) were produced in a Japanese verbalization VAT lowld automatically change it to:",
        "The quotatlnn marks around \"KARA\" indicate that this is an item which will actually appear as a word in the text.",
        "uotation marks",
        "that CJ-\"KARA\" will be part of the same sentence as (C-1002, whereas 00-1003 will (or is likely to) form a different sentence.",
        "We indicate sentence boundaries with the notation CJ-\".",
        "\", \"since the period",
        "The creatioi of these periods is a housekeepinP; task that need not be described in detall here.",
        "Given a representation like tht in 10), VAT will on to ask about the subconcentualzatiim of the first Jo in the ordering.",
        "The general princir)le followed here is one of \"depth.",
        "first\", in the sense that etIrlier it,msin the text are corn letely IrrbJlized bofore the verbalizatim of later items is berun.",
        "211i procedure nrobably has some psychological validity; thNt is, a speaker is liKely to tqink of later parts of what he is roing to say only in terms of the most general chunks, while he is elaborating the earlier Darts in detail.",
        "Only after ne has finished the verb,Ilization of these earlier parts will he turn his attention'to a full verbalization of the later ones.",
        "Thus, omitting various considerations not 14q yet discussed, subconceptualization proc,:eds interactively Ln the following fashion:",
        "In this fashion a sunconceptual hierarchy of any degree of complexity can be constructed and expressed.",
        "The organization of a text may not be entirely hierarchical.",
        "however.",
        "Not only does a speaker break down larger chunks into smaller chunks--larger \"concepts\" into subconcepts; one chunk may also remind him of another, so that the organization which results may be in part concstenative.",
        "We have been viewing concatenation in terms of excursions away from the main hierarchy, and hnve been calling such excursi-ns digressions.",
        "In some discourse, however, there is no necessary constraint that the main hierarchy be returned to, and the result may be a rambling text in which digression is added to digression.",
        "In a more tightly organized text digressions are more likely to appear as parenthetical remarks: brief gidepaths 20 which quickly return to the main hierarchy.",
        "We use the term parenthesis for this brief and transient kind of digression.",
        "If subconceptualization 4can be represented in terms of a tree diagram (which does not, however, provide a convenient means of showing the relations between subconcepts, like CJ-REASON), then digressions can be pictured as subtroes attached to the main tree at one point or another, as surzestod in Figure 3.",
        "One other important modification of the strictly hierarchical model of.subconceptualization results from the common occurrence of summarization.",
        "It is frequently the casc in verbalization tnat an initial chunk will be subject to two sep.]rate hierarchies of subconcepttnlization, one of which can be identified as a summary of the other.",
        "It is cliaracteJristic of a summary th,t its subconceptualization Processes nevr,r proceed beyond some relatively large chunks – chunks which package a relatively large content.",
        "r4e can contrast a subconceptu.3lization hierarchy which is a summary with a hierarchy which constitutes the body of the text and consists of subconceptualization processes that produce a lar,wr number of chunks of smaller size.",
        "A sunmary is typically expressed at the beginning or end of a text; that is, preceding or following the body.",
        "Various conventions for summaries are associated with difr'rJ ent genres of writing.",
        "For example, a scientific article may begin with the celf-conscious kind of summary that is called an abstract; a news report typically contains an opening paragraph telling who, whati where, and when; a fable is likely to end with a moral, and so on.",
        "Our program at present sirinly asks, for the initial COI whether it has an initial",
        "22 summnry (one exprestled at the berdnninK of the tQxt).",
        "If the answer is yes it asks first for subconceptunliiAation of the summary, and moves on to ask About the body of the text only after the summary has been completely verbalized.",
        "At the end of the text it asks whether there is a final summary.",
        "Creativity within a discourse is likely to be limited by the genre to which the discourse belongs.",
        "It would aJpear that there is a continuum ranging from mnximally stereotyped to maximally creative discourse.",
        "Most stereotyped are those forms of discourse, such as rituals, in which the speaker has very little choice as to what he is going to say or how he is going to say it: With eueh discourse the \"grammar\" of the genre provides many of the answers to the questions VAT would otherwise have to ask the us,r,r.",
        "In other words, VAT should be able to produce ritual texts with minimm recourse to creative decisions.",
        "At the other extreme are forms of discourse such ns descriptions of unique personal experiences which have never been described before, where the speaker is relatively free to make a 'reat variety of creative decisions.",
        "We believe it would be of considerable interest to incorporate into the verbalization process the constraints imposed by several different genres, but we hnve not as yet done this.",
        "Js it now stands OUT program does ask ,e4HAT 13 21r1 C;ENRE: as soon as it has established that a verbalization is to be performed.",
        "Possible answers that we would _like to implement in the future are, for example, NEVS REPORT, PSY3HOLOGY A_TIOLE, YALE, and the like."
      ]
    },
    {
      "heading": "III An xample",
      "text": [
        "411 example of these procedures an anplied to a real text can be based on the following United Press report taken, slightly c(ndensed, from the Lan Francisco Chronicle of May 16, 19'74:",
        "13) 1.",
        "An 11-year-o1d boy using a new \"super-glue\" 2. accidentally glued his eye shut 3. while building a model irlarte, 4. and a doctor had to reopen the eye surgically.",
        "5.",
        "Nike Harris said 6. he rubbed his left eye 7. after several drops of the glue squirted into it last Sunday 8. and found his eyelid would not move.",
        "9.",
        "An eye surgeon debated briefly about 10. using a super glue solvent 11. but decided against it 12. for fear it might damage the boy's eye.",
        "13.",
        "The surgeon, who asked not to be identified,",
        "1-1-. finally put Mike in the operating room, 15- tri:Amed Mike's eyelashes, 16. than opened the eyelid surgically.",
        "1').",
        "Mike was released from the hospital Tuesday.",
        "It is a-Troximately the case that each of the numbered lines in this text expresses a terminal subconcept (see below).",
        "pie assume that the text contains a number of intermediate subconcepts as well, which need to be elucidated in a subconceptual hierarchy.",
        "Let us suppose thlit the awbination of VAT and the user are attempting to simulate the verbalization procesiles that went into the production of this text.",
        "For the moment we are concerned only with subconceptualizati-m processes (and, associated syntactic algorithms).",
        "ItAny of the user's answers in the following conversation with VAT are intuitively based.",
        "The success of our eventual parsing component will depend on the extent to which these intuitive answers Gan be predicted from the text together with whatever items of background knowledge are relevant.",
        "2he example will be carried only far enough to suggest the nature of the procedure.",
        "The excnanc:e befs.ins in the usual way:",
        "14) V: JILT VAT ThSK DO YOU oiANT PEITC5IiTIED?",
        "U: VER3ALIZE CC-1001 VAT creates the followinE representation, including a text-final period: 15) CO-1001 VAT's next question seeks to establish what genre constraints apply in this text: 16) V: pid.,T 16 2HE GEN1L?",
        "U: 1,TEW aErORT VT will now assume that the text is a typical news report which begins with a sullmar7.",
        "Its first questions will deal with tine subconceptualization of the summary (expressed in the text in sentences 11-4): 17) V: HOW LD CO-1001 SUBC.",
        ":NCEPTUiLLIZED IN TIE LAI: ilv,11:utY?",
        "U.",
        "YIELD (0C-10021 CC-1005)",
        "the user has answered that ;he first breakdown of the summary is into two subconcepts\", CC-1002 (to be expressed as \"Aft boy using a new \"m zlue\" 6ccidentally clued his eye shut while buildins a model irplane\") and CC-1003 (to be expressed as \"a doctor had to reopen the eye surgically\").",
        "Furthermore the relation between these two JCs has been identified as one labeled YIELD, in which the first CC \"leads to \" or \"results in\" the second.",
        "YIELD diCfers from another, similar relation which is labeld CAUSE in that the event conceptualized by the second CO is not a necessary consequence of the first.",
        "-It is, however, something that presumably would not have happened if the event conceptualized by the first JO had not taxen place.",
        "(Evidently YI.2111) can be equated with IKITIA2E as this term is used by Rumelhart 1974, the relationship between an external event and the willful reaction of an anthropomorbhized being to that event.",
        "3chank 1974 Uses INITIATE differently.)",
        "As a result of the user's answ?r in 17) VAT first creates the -?epresentation:",
        "18) CJ-YIELD CO-1002 CC-1003 CJ-\".\"",
        "and immediately apr.lies syntactic processes which thanges it to: 19) JC-1002"
      ]
    },
    {
      "heading": "CJ-\", AND\"",
      "text": [
        "CC-1003 CJ-\".\"",
        "That is, the two CCs are to be expressed with the \"yielder\" preceding the \"yielded\", and they are to be connected with comma followed by the word \"AJD\".",
        "This is not the only way which YIELD tan be realized, but for the sake of the example we may regard it as such.",
        "VAT will now proceed to ask aJout the subcon",
        "ceptualilation of the earliest CO in 19):",
        "20) V: HOW IS 00-1002 SUBUONCN,PTUALIZED IN THE SUMMARY?",
        "U: FRAME (C0-10041 0C-1005)",
        "The user has answered that 00-1002 is broken down into two CCs, C0-1004 (\"building a model airplane\") and 00-1005 (\"An 11-year-old boy using a new \"super-glue\" accidently glued his eye shut\").",
        "They are related by FRAMES, a temporal relation in Which fae first",
        "CC occupies a time period larger than and including the time period of the second.",
        "In othr words the time period ofC-1004 includes that of 00-1005.",
        "VAT creates, sequentially, th following two representations: 21) CJ-FRAME CC-1004 CC-1005",
        "Although there may be several possibilities for the expression Di' FRAME, VLT has assumed hei:e that two factors are involved: an oraering of the two COs so that the \"framer\" precedes the \"framed\", and a prefixing of the word \"Wili,,E\" to the first ,JC.",
        "(In this example the ordering Of these two OCs will be reversed in a subsequent opertion.)",
        "If FRAME may be expressed in other ways, we assume (gratuitously, for the moment) that subtle onceptual differences are involved; that there is not, in tither words, free Variation among possible syntactic algorithms.",
        "This remains for Low an article of faith.",
        "We would expect VAT to ask next shoat the subconceptualization )f 00-10041 but by a means not yet discussed VAT will discover that ;his is a terminal CC (one not further suoconceptualized).",
        "If C-1004 were followed by \".\"",
        "or by \", AND\", VAT would proceed to isk questions directed at the complete verbalization of this CC.",
        "3ut since C0-10u4 is not followed by one of these boundaries, attention is netfocused on 00-1005:",
        "23) V: HOW IS CC-1005 SUBCONCEPTUALIZED IN THE OUMMAlin U: FRAME (CC-10061 C(i-1007) VAT creates the following representation: 24) CJ-'WHILE\" CC-1004",
        "The user has said that CC-1006 (\"an 11-year-old bo7 using a new super-glue\") occupies a time period which includes JC-1007 (\".accidently glued his eye shut\").",
        "So far we w uld expect this second instance of FRAIME to be expresiled by prefixing the word to CJ-1006, as was done in \"e).",
        "Let us suppose, hower, 1,1-tat '.11ANE actually triggers a more complex algorithm which says in effect that one \"WHILE\" in a sentence is enough, and that a second instanc of FRAME will lead to a different expression.",
        "Here the second Insance leads to the creation of a relative clause which will modify one of the constituents of CC-1007.",
        "Furthermore, the already created \"WHILE\" clause will be moved to a position after 'JO-1007.",
        "(This ordering of the UCs does appear to maximally nStural.",
        "It 28 would be slightly less desirable, for example, trl produce \"While he was building a model airplane an 11-yuar-old boy, using a new \"super glue\", accidentally glued hin eye shut.\"",
        "Certainly, however, the differences in this area are very subtle.)",
        "We will indite the relative clause status of C0-100, to be embedded withan bne expression of )C-1UW, with a slash notation:",
        "The representation in 25) will be discovered tO be the final one in the subconceptualization of the summary, which has been found to cdnsist of four CCs (ultimately four clauses) joined together in the manner indicat(A.. VAT will now proceed to verbalize the summary completely, making use of other kinds of processes.",
        "Wnen that has been done, it will say:",
        "2) V: WE NOW MOVE TO THE BODY OF THE TEXT.",
        "HOW IS CC-1001 SUBOONCEPTUALIZED:",
        "U: YIELD (0C-1002,0C-1003) This is, of course, the same answer that waA given to the corresponding question in 17), above AS CC-1,002 and JO-1003 are further elaborated, however, many diffences will emerge.",
        "Ultimately 00-10021 Which was expresaed in sentences 1-3 of the Summary will be expressed in the buay of the text in sentences 5-8.",
        "0C-1005, expressed in the summary as sentenae 4, will be expressed in the body in sentences 9-14.",
        "A will not repeat here the oper-ttions involvea in.",
        "the sub-conceptualizati)n of the bpdy of the text.",
        "They are for the most 29 part similar to those illustrated above.",
        "Various other relations between COs are in:roduced: for exam de, that ')etween CO-1015 ( Az eye surgeon debated briefly about using a super glue solvent but decide_d :igainst it for fear it might damair,e tne boy's eye.)",
        "and JO-1016 (\"The surgeon, who aSked not to be identified, finally put nye tn he operating Poom, trimmed Ilike's eye)nRhes, then opthled the eyelid surd_cally.\")",
        "The first of these 0s involves an alternative that is rejected in frwor of the alternative conceptualized in the second; thus, the relation ma3 )e labeled REJEC2]D-IN-FAVOR011 Within 00-1015 there is a relati'm of 0 1\\f0.",
        ";IO1' (denial of expectation) beL,ween 0_0-1017 (\"An eye surgeon debated briefly about using a super glue solvent\") and 00-1018 (\"decided c-ianst it for fear it might dam-ige the boy's'eye.",
        "\")- It will be of cans derable interet to isolate relations of this sort in a variety of texts, and to deterLind the ways in which they :,lay e expressed ander varying circumstances in different languages.",
        "2he text does contain one exam-)1e of a parenthesis, exnresseci in the nonrestrictiye relative clause in lile 13 ('he surgeon, wino asked not to be identified,\").",
        "The fact th9t the surgeon asked not to be identified is a mLnor lipression from the mainstream of the acc971int.",
        "it is attqched to the node representing :he surgeon which 14111 becom2 a constituent of '.",
        ";J-1022 (\"finrilly put nike in the oerating room, trimmed Mike's eyelashes, then onenea the eyelid IV.",
        "Lexicalization of a CC use the term lexicalizatiOn to r-,f(r to another maor 30 component of verbalizatin: speAfically to a clurter of processes that are involved in the choice of a particular linguistic expression for a JJ.",
        "':..3ubconceptualization breaks down an initial chtlak into smaller chunks.",
        "These smaller chunks, however, remain onceptual in nature, and other operati)ns are necessary to convert them into surface linguistic reprosentltions.",
        "Roughly speakinE, 141xica1ization involves the choice of \"words\" thNt will anoronriately communicate the content of30,s.",
        "Lexicalization of a 30 takes places at the point where the meaker decides that he hr s subconceptualized far enoligh,.",
        "The aim of subconcetualization is to )roduce chunks of a size apor0priate to linglistic expression, and particularly to linruistic expressiOn that will convey neither too little or too' much information to thE addressee.",
        "Too little informntion is, for example, provided by a summary, whe.re 3ubeonceptualizati)n has proceeded only to a point whe e lexicalization w1 give the a drensee a \"generAl idea\" of the content of the whole.",
        "At the °trier end of the scale, we are all filmilier with erpoitions in which too luch information is conveyed, where we rlre tolti more hp.n we want to know.",
        "One aspect of a sneer's cr-ativity, Lhen, in to decide exacf,ly wilere in the process of sub't-_,,ncel)turJlization he sh)Ild stoe, taking into accoqnt the rieeds aud interests of the addressee.",
        "it is at this point that he turns to lexicalization.",
        "The speaker may 91F0 be influenced in such decisions by the resources his language -nakes Tvailable for pnckainp7 cLunkc of different sizes.",
        "Consider, for example, the amoint of content that is packaged in an English senvenc like \"He hit into a doubie A.ay•\"",
        "If our lanp:uage did not provide this particualr expreSsion, we would have to subconcePtualize, this chunk considerably further and come up with chunks that would have to be expressed im some such way as \"He hit the ball to the shortntop, who threw it to the second baseman before the runner previously on Cirst base could reach second.",
        "2he second baaeman then threw the b111 to the first baseman before the batter couid reach first., Thus his hit caused two outs to be made.\"",
        "l'resumably a language makes aVailable packaging at var ous leves of subconceptualizbtion according to predominant communicative needs within the rmlture of its soeakers.",
        "How are cohceptual chunks communicated: One way to approach this Question is by looking it the spatial and temporal properties of such chunks.",
        "A chunk is typically either an event (\"He rubbed his left eye\") or a situation (\"The glue was next to the lamp\") Both events and aituations have a particular locus in spice and time (the difference being that an event involves some spatial cnange throuqh time, whereas a situation does not).",
        ",)uch chunks.",
        "then', can be rer7nrded as assignable to particular coordinates in both a suatial and a temporal continuum.",
        "(de omit consider tion here of generic chunks, expressed-in 'sentences like \"Dos chase cats' or \"The house had two chimneys\", where -particilarity is absent.",
        "Genericness calls or extended discussion that would take us too far afield at tnis point.)",
        "If we assume that most of the chunks a speaker wants to find linguistic expression for are events or situDtions, -rnd thus have both spatinl and temporal particularity, it is not surprising that langu-ie fails to provide direct labels for them.",
        "cannot, in",
        "the course or nubconceptualization, arrive nt something like CO-1011 then remember that the name for this chunk is \"BLUR\", and comluni cate it by att-et,ing th'it “ord.",
        "Particu]Ar events and situatiohs fire too numerous, and our experience of them too idiosyncratic for eacth to have its own name.",
        "2he way this problem-is solved is thrOvgh the interpretltion)of many lifferent C.Cs as inst'inces of the same catego7.",
        "Thus the tirrie last December when I gave my mothr a Christmas oresent, the time when the mail'aarl f.7)ve rle a registered letter this morning, the time yesterday when the teachr gave my soh a note to take home, etc.",
        "etc.",
        "9re categorizable an in:,-tTince of \"givng\".",
        "ie label the category itself UC-\"GIV.]\"",
        "(T.3 Standing for \"universal category\") and snezify the choice of Oils category by the s enker with the notation: 2n) ,30-1053 C> T.D-\"GIVIE\" Such a statement is to be red \"JO-1053 is cfcteorized 'Is an instance of the cate7Ory 1J-\"GIVE'ttt.",
        "It should be noted that the English word \"GIVE\" is not tho, name of this category; rather any particular .,;C g;hich is so c-Jaforizd can be communicated with the word \"GIVE\".",
        "In other words, the decision described in 27) allows us to use' \"6-\"i\" as a name for J.-;-1055.",
        "The way in which a speaker decides that a particular can be categorized as an instance of some UC is of c)urse a fundamintal psychological quest on.",
        "one thing that seems clear is tiat some Os are more easily categorized than others; ease of catei7orizability has been called \"codability\" (Brown and Lenneberg lqr)A).",
        "in a closer approximation to hu-lan nentn1 processes, therefore, a statement like 27) ourfrIt to be qualified as valid to a certain",
        "degree, and not as an all-or-nothing decision.",
        "%f the degree to which a particular CO is an instance of some UC is very high if the CO is highly codable--then the use of the word provided by the UC will succeed quite well in conveying he content which the s eaker has in mind.",
        "If, on the other hand, the content of the JO is not very well captured by assigning it to the UC, then the speaker is likely to ilant to add one or more modifiers to mold the content 'tore closely to the content Of the CC he has in mind AdVw?bs are an obvious dwice by which such molding is accomplished.",
        "Thus, the speriker might decide that the content of JO-1053 is better captured in an intersection of UC-\"GIVE\" and UC-\"GfflDGING\": 28) 00-1053 3> JO-\"GIVE\" c. U3-\"nUDGIHG\" in.",
        "which case the eventual lexicalization will be \"give grudgingly', and not simply \"give\".",
        "Suppose: 00-1053 is a conceptual chunk that will eventually be varbalized with the sentence: 28) Mrs. Brown gave Tommy a cookie.",
        "'Afe he said that the word \"GIVE\" is available as a label for this CC.",
        "Up to a point that is correct; there was a givinr which took place.",
        "But sentence 28) contains more than the word \"GIVE\".",
        "What kind of conceptual information is conveyed by \"MRS. BOWN\", \"TOVEY\", and \"A COOKIE\": Each of these items evjdently communicates a conce;Dt that is different in nature from a 30.",
        "This other kind of 2oncept we label a PI (for \"particular individual\").",
        "The chief difference between a PI and a CC seems to have to ao with temporal particularity.",
        "A CC is conceived of as odcupying a specific and usually fairly limited period of time.",
        "The time period ocupied by, say, 311- irs.",
        "Brown is much less snecific, and is not likely to be something we are very interested in when we utter a sentence like 28) In other words, although aJd may have temporal particularity in the sense of a lifespan or total time of existence, such a time period tends to be of a different order of magnit:ude from that occupied by a jC, and more often than not is of little relevance when the is communicated.",
        "Furthermore, any one 1 may participate in an indeterminate number of different COs. (Mrs. Brown has done many other things besides that which was reported in 28) ) 11137 do PIs play a necessary role in the communication of a CC?",
        "The answer may have something to do with the necessity for providing anchor points in the addressee's mind.",
        "Because of its lack of temporal particularity, the concept of a PI is a relatively stlble concept, ana one which is liable 17(;) enter consciousn-!ss again and again Ath respect to a wide variety of Cs.",
        "Thus, the only way a sT)eaker can effectively install.",
        "the content of a in the addrssee s mind is to tie it to one or more PIs already known to the addressee.",
        "That i, the urmal way of communicating information is by brinNing one or 'tore iI nodes into the addressee's consciousness, and by predicating something of these nodes.",
        "Lan Puage usually involves takin7, one PI (the \"topic\") as a starting point and either predicating something of it alone, or tying ift to other Is through a relational nredicate.",
        "It should be noted in passing that not everything which is expressed syntactically as a noun is conceptually a 2I.",
        "A wurd like \"Tuesday\" for exam le, may be used as the name for what we",
        "call a PT: a \"particular time\" which might be used to provide temporal orientation in a sentence like \"On Tuesday Mrs. Brown gave Tommy a cookie.\"",
        "In deciding to cateFoxize a CC in a ertain way, say s an instance of UC-IrGIltrl a speaker simultineously establisher-, a framework of PIs ehich a-e separated out from the cofttent of the •1 and which will have to be linguistically represented in some way.",
        "In the case of TIC-\"G.,_VE\" these Is will function as arent, beneficiary, and patient (the giver, the givee, and the given).",
        "The fact that these three Is Ire entailed by the choice of tfl-\"I/.",
        "is expressed as follow.s:",
        "The letters A, B, C, and D in this st tement are variables ranging over particular four digit nunbers.",
        "For eXa=le, C0-A might be 03-1053, PI-B might be PI-1687, etc.",
        "The sytbol E> is to be read \"entails\", and-F> is to be read \"is framed as \".",
        "(The notation to the r1Lht of F> can be rer,rcled as a \"case frame\"; hence the appropriateness of the term \"framing%) The statement in 29), then, slys that w'aen ole has chosen to categorize a particdlar CC as a instance of UJ-'IV.",
        "\", trlis decision entails that the CC r1ll be framed as, or expressed by, the verb (V3) \"GIVE\" atcompanied b three IJs, functioning as agent, beneficiary, and patient.",
        "ottements liko that in 29) are stored in our znglish lexicon.",
        "Thi9 statement actually forms only part of the lexical entry for JJ-\"Gif., The com-)let entry for this category contains a number of additional lines which state -vrious other entailments, for exminle that giving involves transfer of ownership.",
        "These other asects of lexical entries will be discussed below.",
        "To summarize, a CC of the a ,propriate size, arrived at through subconueotualization, will be subject to categorization in terms of some UC, the effect of which will be to 6roate, Iv way of the lexicon, a verbal label for the 313 top,ether with a framework of associ:xed nouns.",
        "The framing operation, in effect, will have factored out those elements (.PIs) having no significant temporal particularity, leaving a word (the VB) to which alone that teworal particularity will be assigned.",
        "It is probably a consequence of its being left with this temporal role that the V3 is likely to end up carrying a temfioral marker of some kind, such as a tense and or Rspect suffix.",
        "If, for.example, the JO occuPieq a temporal locus that )recedes the locus of the speech act, the VB is.likely to end up with a -oast tense suffix attached.",
        "?his part of lexialization we 'all inflection.",
        "Its imolementation will be iliustrated immmediat ly below.",
        "Our orouiam tries to establish at the outset for each whether it can be ci!eorized, on the assuration th,gt_tIle s)eaker is aiming at such catep;orization as a oall and that subconcentual-ization takes place only when the content of the JC is such th.",
        ":it categorization is not appropriate.",
        "2hus the first question asked of any CO is of the sort: 30) V: CA:I JC-l053 BE C.,TEGORIDe If the-user's answer is no, Vi-E2 :oes on to .isk how this .",
        ":,\"J is to",
        "be subconceptualized, as in the example given in section III.",
        "If, on the other hand, the user's answer i yes, VAT will (7) on to ask question ”elev nt to the tense/aspect properties of the JC.",
        "At present it.",
        "asks fiPst:",
        "31) V: Iu C(J-!2053 GENERI?",
        "since special considerations have to be give to CCs that do not have temporal particularity.",
        "If the answer to 51) is no, VAI.2 presently assumes by default that CJ-1053 has a temporal locus preceding that of the speech act.",
        "This is certainly the mdst probable state of affairs for most kinds of discourse.",
        "4e would like eventually to.",
        "elaborate other )ossibilities, which are likely to depend on adverbial and other means of establishing temporal namicularity.",
        "Our program at present will, under these circumstances, add the inflectional notation \"PAST\" after a slasn,as in:",
        "32) ,3C-1053 / \"PAST\" It is now time for the following exchange: 33) V: HJ;,J 16 ',;C-1053 3ATEGORIZED?",
        "U: GIVL The user says that the decision has been to catei-orize this J is an instance of the category tl-\"dIVE\".",
        "VAT then looks into the",
        "Two other consideration l are relevant at this point.",
        "For one thing, VAT will want to replace the .-13I variables in 34) with particular four digit numbers.",
        "Our easiest recourse at present is to",
        "it least some of the answers to the questions in 3c) ought, under some circumstances, to be derivr)ble from the context.",
        "iC hope gradually to teach VAT to discover such -nswers for itself whenever Dossible.",
        "A second considertion at this point in to establish which PI is the subject or topic, the 1JI on which the speaker intends the addressee's attention to be focuse.d and concerning which something.",
        "will be asserted.",
        "Again the easy way out is for VT to nsk the user:",
        "like English.",
        "If the verbalization is in a topic-prominent language VAT will msk instead about the topic (Li 1974).",
        "In English this may be the point at which functional relations such as agent, beneficiary, and patient should be replaced by surface syntactic roles like subject, indirect object, and direct object.",
        "(In",
        "Japanese the introduction of pa-ticles -ike wa, fr,a1 o, 'and ni would be appropriate here.)",
        "Thqs, after 39) VA''.2 mar chance the representation in 36) to:",
        "where IO and DO stand for 'indirect objet\" and ktdiret oeoect\".",
        "Again, the identity of the topic will often be deriv;ible from the.",
        "context.",
        "For example, all other things being equal, topics have a tendency to remain constant from one clause to the_next, agents are mo_e likely to be topics than patients, and so on.. Jonsiderable empirical work will be necessary before all mich, factors have been soPted out.",
        "If the codability of JC-1053 had been somewhat lo_aer and the modified categorization exemplified in 28) had been chosen, the representation at this stage would include an adverlm (AV): 39) VB-\"GIVE' / \"Pra3T\" / AV-\"GRUDGING\" PI-124kSUBJ PI 13451'10 PI 14561TO The lexicalization of C-ii-1053, then, has involvud categorization, possibly modification, inflection, and framing.",
        "The next step in verbalization is to lexicalize- the seve,-ral PIs which are contained in a representation like 38) or 39).",
        "'vie will see that the lexicalization of a pr involves categorization, possibly modification, and inflection.",
        "Framing is for th.#3 most part restricted to the lexicalization of a CC.",
        "40 Lexicalization of a PI A PI is the concept of a concrete object, be it animate ox inanimate, or of an abstraction which has been reified and is being treatect linguistically in ways analoirous to the treatment of physical objects.",
        "The surface linguistic representata.on of a PI may be a proper noun, a common noun, a pronDun, or nothing at all.",
        "Furthermore, bj agreement processes certain features of the PI may be incorporated into the verb with which it is associated.",
        ".",
        ":ach language has its own idiosyncrasies in The treatment of Pis.",
        "Some, like Japanese, are especially fond of deleting the PI altogether whenever it is predicable from context.",
        "Some, of the polysynthetic type, seem to go overboard in the extent to which tqey incorporate.",
        "features of the noun within the verb.",
        "Some 7lake a Point addihg inflectional features expressing \"definiteness\", olurality, and the like to the surface noun, while others seem to get along welll witb-out such expression.",
        "For illustrative -)urpose we will coniine ourselves in this section to the main outlines Of how a _PI is lexicalized in English.",
        "- Much depends on whether 'or not the PI in ouestion is 'given\" – whether it is a piece of knowledge that the speaker believes his already 13,aen brought into the addressee's consciousness in some way) nrior to the uttering of the present sentence (Chafe 19'74).",
        "Here agaiA we have a case_ where the easieSt course for VAT at this Preliminary sta;-e of its development is to ask the user:",
        "for itself.",
        "If, for exampie, II-1234 was mentioned in the preceding sentence the answer to q0) must be yes.",
        "If the preceding sentence was \"Mrs. Brown came over from next doort!",
        "and we are concerned with the lexicalization of PI-1234 within the sentence \"PI-1234 Eave Tommy a cookie\", the givenaless of PI-1234 will result in its lexicalization as \"SHE\".",
        "We can actually go a fair distance in establishing the givenness of a PI on this baoig alone, but the question oi how else givenness is estabLisned, including its introduction from knowledge external to the linguistic text altogether, calls for extensive further work.",
        "Let us assume first that the answer to i-0) has been yes, in which case English is likely to lexiaalize PI-1234 with a orOnoun.",
        "This is not always the case; sometimes a PI that is given will not be pronominalized.",
        "The principal criterion here sems to be whether pronominalizatian will produere ambiguity, and ultimately VAT-will need to deciae whether ambiguity will result.",
        "For now, however, we proceed on the assumption that a PI which ln Riven will automatically be pronominalized.",
        "The procedure we are currently using for pronominalization in English asks first:",
        "This question is asked first because the pronoun \"YOU\" does riot distinguish nuMber, and if the answer to 41) is yes it will not be necessary for VAT to do anythnig beyond lexicalizing P1-123q- as NN-\"YOU\"' (NN, of course, for \"noun\").",
        "Ifi on the other 'wind, the answer to 41) is no, then VAT must ask:",
        "We assume thmt a PI is from one point of view the concept of a set of objects, and thnt une cardinality of the set is relevant in establishing expressions of singularity and plurality, among other things.",
        "Actually the distinction between one and more than one as possible answers to 42) is all that is relevant at the moment.",
        "More interesting questions do arise-in this area.",
        "For example, with cardinalities up to about five there is likely to be a need for distihguislaing each member of th,E> set with a specific PI number, where's with l'irger cardinalities the set is likely to be conceived of sim )1y as containing \"a number of\" or \"many\" members.",
        "If we assume first that the answ.",
        ":r to 42) is one, then VAT will",
        "This classificatim includes human beings, but also named animals such as pets.",
        "If the answ-3r to 4) is no, VAT will lexicalize PI-1234 as NN-\"IT\".",
        "Otherwise it must find the sex of this referent: /1-5)° V: IS PI-123 MALE OR FEMME: and lexicalize it as NIT-\"HE\" or NN-\"SILE\" accordingly.",
        "If theenswer to 42) was a nmber greater than one, VAT must decide between \"WE\" and \"TilEY\", the pronouns which are explicitly plural.",
        "Efsentially it must ask:",
        "There are 6cain.a variety of Ways in Which VAT' miht be able to answer questions like 4-1) throuph 46) without nsking the user, 2he identity of sneaker .1.nd addressee will h'sve been established by p ovidinr ruch discourse parameters at the very beLnning of the discourse; at present we use •ne arbitrary convention that P1-1001 is the sDeakr and 21-1002 the addressee.",
        "In question 41) and 43) 1LIT is asIdnr whether 21-1234 is identical to P1-1002 or 21-1001.",
        "Tut, de endin on the conLext, tlis identity may already nave been established.",
        "As for the cgrdiqality of i-1-1234, it may hove been made axbl:cit through a numeral or in some her way.",
        "knd the gender of thi referent might have been established through the previous use of a sex-s-e-;Ific proper name, or through some other fact that has already been supplied.",
        "Let us row turn to the possibility that 11-1234 is not given-that the answ-!r to Question 40) waF; no.",
        "In that c9se, lexicalization must be either i te.rms of .a proper name, or throu;7h tno use of a caterwriza ion an' ultimately '4 :omm0n nolm V2 first rlsks: D,)S PI-1234 If yes, th ue gives the name and VAT lexializes .P1-1234 as or the like.",
        "The ral situation is not auite ti s simple, since a-1-I is likely to have orie than one proper name (John, Mr. Brown, Dad-17, etc.",
        "ancl the .chic of which, if any, among them to use will de en oq various interpersonal considerations.",
        "_,ventually our Drop;r-m snolld inclkde questions relevant to such a choice.",
        "/1.4.",
        "If the answer to 47) is no, then VAT follows a procedure rouFhly aftalOgous to that associated with the catecorization of a",
        "for examnie).",
        "Basically, at t Lis vAnt, VAT will re lace In.-1254 with NN-\"TAHR\".",
        "At the same time it will store tho qta-tement: 49) PI-1234 C>, tiC-\"TaCH4e and will look at the Lexical entry for this cateE,)ry for whatever relevant information is stored there.",
        "Just as a CC may given a lexi-dization thnt is inflected for tense and/or aspect.",
        "the Irncicalizatiori of a PI may be trjv(m. flections for such features as number and/or definiteness.",
        "If the lexicon shows, for example, that U0-\"7.EA0H]R\" entails that PI-l234 is countable, VAT will also in Vas case ask about its cardinality, as in 42) above.",
        "IT the answer is a number ;reater than one, UT will cre tea renresentation nice TAN-\"].HER\" / Independent of thin number question, VAT,w:11 need to determine whether the use of this c te,7ory in this context will enable the addressee to know whnt T)articular.inst; of the c'tef;ory is being-trilked about.",
        "vie'Alt thiq in terms of the question:",
        "50) V: DC:AS U;-\"T ],.HER\" II):NTI'y 11-1234?",
        "If yes, VAT, will ad the definite article (AR) as an inflection: iikl-\"2];H:]2\" / AR-\"TjE\" If no--that is, if the addressee is assumed not to be able to ideLtify a nreViously know 13I, as the referent, VAT will ae icte )etween, the indefinite artioles ki-\"A\" and AR-\"SOME\" depe ding on whether the cardinality of PI-1234 is one or",
        "3reater than one.",
        "The outcome will thus be either NN-\"TEASIER\" or NN-\"TA(H11\" / \"PlIORAL\" / AR7-'0'VE\"; that is, \"a teacher\" )r \"some teRcilers\".",
        "vie have attempted to formalize some of the ontextual groands on whin VAT will be able to answer a question Like 50) without.asking the user, and this matter will be discussed in section 'VII below."
      ]
    },
    {
      "heading": "VI. The Lexicor",
      "text": [
        "In all, its o-nerations Via must at ,mny points nake access to a store of more or less permanent lexical knowledge which we have formalized in terms of entailments of critegories.",
        "The strytements in the lexicon snecify what we know about a particular JG or PI as a result of its being identified as an instance o a certain category.",
        "Or, to look at it from the ormosite point of view, these statements say what properties a particular°CC Or II must have in order to be catefiorized in a ceru in way.",
        "From the rirst point of view we can say that once we know that a-particular CC has been categorized as an instance of UC-\"GIVE\", for example, the lexicon tells us a number of other thin 7s that we must know about this CC.",
        "From the second point of view we can say that the lexical entry for UC-\"GIVE\" tells us what we must know about a 3J in order to assign it to this category.",
        "1hose two wiys of viawinF lexical entries 'are not in cont-adiction, but are different sides of the same coin.",
        "From aosyclIological stanlpoint the lexicon approximates a description of everything that is involved ina person's interpretation of the world, at least so far as his interDretive grid is depen46 dent on verbal cnter,ories.",
        "We are unable, of nourne, to focus on indlxidual differences, but must attemot to deal with a core that is common to the speakrIrs of a. particular lanuace.",
        "The leYicon is the heart of our pro,rrnm, whether we are engar;ed in verbalization, translation, or parsing, and everythinf7 else denends on the success with which the lexicon has been elaborated.",
        "A se!",
        "',nrate lexicon lias to be develooed for eachmlanguage with 4hich the program tries to de.11.",
        "in a full-f1edF7nd implementaton certninly a very 10.47;h proportion of the total develo37.ient1 effort will,qave to be devoted to lexiCal questions.",
        "As a siNle illustration of the kind of infoimation a,lexical entry might contain, as well as of the formalism we have 'neen using to represent such informati-)h, let us consider at least Dart of what it means for a particular J,-; to be ':,tegorized as an instance of 113-\"LIFT\" +;:e will watt to say thPt when X lifts Y, this entails that X does somethinr, which causes a chate of stlite from Y beinr in one.",
        "location to Y being in another location, and furthel_liore that the new locatinn is 9bove the old location.",
        "The lexic1 entry for 11:;-\"LIPT\", insof-r s it capLhres this much informatvm, is written as follows:",
        "The first two lines are to be read, \"If CC-A is cat(:,?0Pized as an instance of UC-\"LIFT\", this entails...\" The first line under '22,> then L,ives the case frame, saying that there will be a clause containing tne verb \"LIFT\" ac':ompanied by an ar,erit (PI-B) and a patient (PI-0).",
        "The second line under'12> says that it is alternatiVely possible to subconceptalize CO-A in n certain way, wnich amounts to a nara-phr.lse.",
        "That is, although the speakr has.cioL-n not to subconceptualize JC-A further (breStriably because the choice of U0 \"LIFT\" has been judged to provide the right packaing for C0-1,.",
        "), if he had decided to subconcOtualize farther he could have done it in the manner specified in this line, where two new JCs, %3J-D and are joined by Cj-CAUL)E._ In othee words Jj-D is conceived of as causing CC-E. 2he third line under E> sys something about the content of CC-D, namely that it involves an act by PI-B.",
        "(It may be noted that the absence of quotes around k0T in V13-ACT indicates that this is not a conceptual unit that will lead to a direct surface structure represent3tien, as will VB-\"LIF2\".)",
        "Drie fourth line under E> says that 00-2,, which is caused by this act, can be subconceptualized into.",
        "twooconjoined elarients.",
        "The first of these is a 3HANCIE from JO-F to T0-G, and he seond is J-1,1 2he fifth and sixth lines inder E> specify the nature of the prior and subsequent states, CC-F and JOG.",
        "Both involve 2I-J beinE at some location, first PL-I and then PL-J (PL standing for \"particular location\").",
        "The last line elucidates cc-a stating that the new location (PL-J) is above the old location (iIL I).",
        "Thus 51) has captured formally the several bits of knowledge abut CC-A that were summarized discursively at the beginning of this paragraph.",
        "Let us now turn to a more comnlicated example.",
        "This example came up initially as a result of the observation that the Japanese verb kasu can be translated into English as either rent (out) or lend.",
        "In other words this verb is nonspecific as to whether the ap;ent does or does not recive money for the goods or services he provides.",
        "We were interested in how a translation from Je,nanese intD English would decide whether to use rent or lend where the Japanese had used kasu.",
        "This problem led us to consider lexicul entries for several verbs involving transfers and transactions, pnd we arrived at a System of cross-referencing and embedding within laxicn1 entries that captures the content of abstract notions (such as transfer and transaction) at the same time that it links entries one tc another in a way that is renerally useful.",
        "vie may begin by defining a transfer.",
        "we 'assume a category UC-TJN$Fii which, since at does riot cont%in nuotation marks, is understood to be abstract nd not Immediately u(invertible into a surface structu-e verb.",
        "The lexical entry roads as follows.",
        ":",
        "DiscUr.sively, a CC-A which has been categorized as an instance of UC TRAM3F02 Can alternatively be sUbconoeptualized (or paraphrased) 111 ,terms of a change from :,;C-B to CO-0, where the former involves PI-D \"having\"II-E, and the latter involves another party, PI-F, having PI-L.",
        "In other words, a transfer involvub a change in the having of some object (PI-E) from one indiviaual to another The English word have of course performs a variety of semantic functions; our use of-it in this formalism is meant to include at least two varieties of having--ownership, wh ch we will labei HAVE-OWN, and having the use of something, wLich we will call HAVE-USE.",
        "Simple HAVE, as in 52), is mPant to be nonspecific a8 to wqich of these varieties of having i8 involved, as may be accounted for with the",
        "has the ease frame shown in the first line under E>.",
        "The luestion nark before the beneficiary indiaates that it is optLonal; one can say \"Roger gave a book\" without nentioning !)",
        "beneficiary.",
        "The second line under E> shows that this CC; can also be categorized o4 an instance of UC,TRANGPR.",
        "is fact means that the 'JJ also has the ent-ilments listed In 52), LAnce the variables within elch lexical entry are arbitrarily labeled A, 131 j, etc., it i necessary now to state equivalences between the variables in the entry for UC-\"GIVE\" and those in the entry for UJ-TRAN3Y2;A.",
        "These equivalences are listed, indented, in the last three lines of 54).",
        "They to be reaa, \"PI-D of the T;iANGF.. entry is quivalent to PI-B of the \"GIVE\" entry (the giver); 1)I-F of the TRArii1:-.2ER entry is euivalent to PI-.0 of the \"IVE\" entry (the rilvee)w and II-E of the TiF_1:1-t entry is equivalent to PI-D of the \"GIVE\" entry (the given).",
        "In this way 54) and 52) are brought into the correct alignment.",
        "Another, more com)lieated kind of transf r is that involved in the catezory 133-\"L'LID\"",
        "The first seven linesof this entry are entirely parallel to the entry for UJ-\"GIVE\" in 54).",
        "It then becomes necessary to refer to the earlier nala later states, and CO-0, of the Tiit.NFR entry.",
        "These are equated with 00-E and JO-F of the \"LEND\" entry.",
        "It is said that both of these states involve HAVE-J.",
        "2hat is, when X lends an object to YI in the earlier state X has use of the object and in the latei state Y does.",
        "The next to last line says that PI-B, the af-ent of the lending maintains ownarship of PI-D throughout.",
        "The last line says that .",
        ";0-11 cannot be categori4eu as a transaction, ar explained blow.",
        "Ividently tie only difference between 55) an' 3 the entry for UJ-\"AAb-P (i.er kasu) in Jao'Inese is that' for the latter the last line of 55) is missing.",
        "2hus, kasu leaves it unaecidl-d whether a transaction was involved or not.",
        "what, then, is a'Lransactioll: Essen-dally it is a linking of two transfers, where one of th transfers is for tho purpose of the other.",
        "In buying, for example, a typical tr-lnt;actlon, the buyer gives money to the sel1r so that the seller will give him some object in retuld.",
        "vdth buying, a chance of ownershin is involved in both transfers, but that need n,)t be the.",
        "c9se.",
        "rmting, for example, the-2e is a chanfre of ownershi) of the money, tut only",
        "The first line under E> states that 'DC-A can be paraphrased in terms of CC-B and CC-01-the farmer being for the purpose of the latter.",
        "00-B-js a trinsfer in which PI-D (e.g. the buyer) transfers PIE (ecg.",
        "money) to PI-F (e.g. the neller).",
        "43C-C is a transfer in which the roles of PI-D and PIP (and \"hence their relation to the variables in 52)) are reversed.",
        "Furthermore, the object transferred (e.g. the thing bought) is a different one--here PIG.",
        "Besides buying and sqlling, another typical transaction is renting.",
        "The English woud rent is ambiguous, ant we will illustrate here the ehtry for what we call UC-\"RE1T-2\", which 1,9 renting out (German vermieten):",
        "The first line under E> gives the case frame, which includes two obligatory cases, an agent and a patiellb (\"Bill rented (out) his lawnmover\") and an optional beneficiary and measure (MLR) (\"Bill rented his lawnmower to Tom for five dollars\").",
        "The second line under E> says that CC-A is a transaction; it thus conforms to 56) and it is necessary to state the equivalences between the Pis in 57) and those in 56).",
        "Below these PI equivalences it is also stated that the 3C-B of the TRANSACTION definition (the transfer of money) is equivalent to CC-F of the 'RENT-2\" definition, while CC-C of the TRIIN6ACTION definition (the transfer of the object) is equivalent to COG of \"REIJT-2\".",
        "The twu bL,,lues of the first TRANSFER are named CC-H and CC-I, while the two states of the second TRANSFER are named 0C-J and CC-K.",
        "It is then said that the measure, PI-D, must be something categorizabla as a NEDIUM-OF-EXCHANGE--normally money, but potentially anything that would perform this function.",
        "The two",
        "states of the first TRAN2K2 are then both said to be instances of UO-HAVE-OWN, since the money actually changes ownership.",
        "The two states of the second transfer, on the other hand, are instances of UC-HAVE-USE, since the object does not change ownership, but only use.",
        "The last line, like the nextto last line of 55; says that the agenie of the renting retains ownership of the obje'ct.",
        "It was mentioned that the lexical entry for Japanese UC-31K,0is the same qs that for English UC-uLEND\", as ix 55), except that the Japanese entry lacks the last line of 55) in which it is stipulated that lending cannot be a transaction.",
        "It can now be seen that UC-\"KAS-\" is comnatible with both 55) and 57).",
        "we thus have a formal explanation for the fact that kasu may be translated as either lend or rent.",
        "In order to decide between the two translations, it is necessary to searnh the context in which this occurs to discover whether it is or is not a transaction.",
        "We will return to this matter in our discussion of translntion in section VIII.",
        "Lexic 1 entries for categories whose instances are _Pis are designed to elucidate he knowledge which is entailed by the assignment of a partictlar PI to some category.",
        "Such entries do not contain a case frame, but .tre otherwise similar in format to the entries for categories whose instances re °Cs, as described above.",
        "As a simple examnle, we may note,.",
        "that wheh a PI is categorized as an instance of U0-\"CAR\" th 7-0 is an entailment that this _PI will \"have\" a trunk.",
        "-L'his kind of having is different from those discussed in connection with transrers and transactions in the last section; we represent it with HAVE-AS-FART:",
        "It is useful here (and elsewhere in the lexicon) to distinguish between necessary entailments and expected entailments or default options.",
        "The latter constitute knowledge that is normally entailed by the category, but not necessarily so.",
        "We indicate entailments of this sort with a prefixed \"E:\".",
        "AS an example we rtv.iy note that something which has been categorized as a MEDIUTI-011-XCHANGE (cf. 57)) is normally expected to be money, although insome circumstances it might be cowry shells or wampum: 59) PI-A C> UC-TIEDIUTI-OF-1EXCHANGE E> E: PI-A C> UC-\"MONEY\" A more complex example involves the categorization of a PI as an instance of UC-\"BEAGLE\".",
        "In this case we Know that the PI is also categorizable as an instance of UC-\"DOG\", that we may expect that it will have a tail (although some dogs do not), that it will barK, and that it will chase cats:",
        "tnat is, that there is a 0-ontinuous range over which we may expect something to be entailed, with necessary entailment being one extreme.",
        "At least for practical purposes, however, it proves useful to make a three-way distinction oetween necessary entailments (unmarked), 56 default expectations (E:), and a third type which we call optional entailments and mark with \"0:\" These last represent a lower degree of probability; they are entailments which are neither necessary nor expected, but which are easiLy possible.",
        "bor example, a bicycle need not have a blsket and is not expected to have a basket, but it may very well have one:",
        "61) PI A C> JO-\"BIdYCL2",
        "The distinction between nece,E'sary or expected and opt anal entailments is of interest when it comes to the assignment of definiteness, as discussed in the following section.",
        "VT711 wislcourse Information and Readjustments A soeaker needs access to three major classes of information in order to verb.aize stncessfully.",
        "First, of course, he mist have an idea of what he wants to talk about: the content of the vtfbal-ization.",
        "Second, he must have access to general knowledge that is relevant, the kind of knowledge tilt we are attempting to characterize in the lexicon.",
        "But there is a third kind also.",
        "-ehe speaker mast keep track of knowledFe having to do with the very fact that he is verbalizing: knowledge about the speech act itself, and its effect un person his verJalization iS aJdressed to.",
        "It is this tlird kind of knowledge that we are calling discourse information.",
        "We are concerned in this area with such factors as the identity and social relationship of the speaker and the addressee, the time and Pince of the spech act, and factors wqich relate the content of the",
        "dincourse to whnt is assumed to be (wini; on in the mind of the addre nee.",
        "Joletimes, moreovor, it is importnnt to keep track ()I the nct of viq'b lization as' an event in itself, since the verbal-izntlton mn- be tliked about or referred to subsequently in the discourse.",
        "Discourse information is kept by VAT in temporary .ntorve.",
        "Unlike information in the lexicon, it is nnecific to prid even cwe ble within a particular discourse rather t}lan being potentially ,applic-ble to an unlimited dumber of different di8coqrses.",
        "Our treatment of dascourse information is at present rudimntary 'Ind uneven.",
        "6o fpr as sr)eakr an addressee are concerned, we sim ly enter into dlscour'se information store statements like the following:",
        "variety of predicates associated with discourse information.)",
        "The proram makes use of this information in various ways.",
        "For examnle,in lecidinr how to lexicalize PI-1001 and fI-1002 VAT makes ase of information like that in 62) in order to arrive at first and seclnd norson pronouns; of question 1) and 43) in secti'm V above.",
        "irobably in most languages to some-degree, but especially in many Asian languaresv the social relationship between the speaker and addressee plys a role of some kind in vevpalization.",
        "we have been interested in introducing such Qons,iderations into our verbalization procedure; and h-ve so f9r concentrated on the question of how VA2 sho-adi decide to crltegorize in Japanese a Id lirliCh in",
        "il;nr;lish would be catep;.orized an an instance of UC-\"GiVE\" where ard several cater;orien 1% 1;he Jananese lexicon, Ftll of which conform to the definition of U0-\"GiVIO in 54) above, but which differ from etich othet with respect to the speaker-addressee relationship.",
        "dow the ohoice can be made is most easily illustrated in,the context of a translation procedure, and we will return to tI'Lis exanple in the section IX.",
        "VAT does little at present with cd.nr;iderai.ions of the time and pl.ice of the speech act.",
        "tatements like the followin can be included with discourse information:",
        "(where L stands for \"oarticular location\" and for \"oartic'j.lar time\").",
        "whether I'L-1357 and .PT-1579 retain throuhout the discourse or are relaced by other olaces and times depends on th,, n:-.1.ture of the discourse itself; sometimes there will he significrInt chanrws in thse parameters and sometimes not.",
        "ln any c-ise it i8 ossible for V,1!",
        "rto answer nuestions ibout tense, for example, by asking whether the timao-f JJ tnat is beinp; verba3ized is before-or after, or whether it includes, the tinle which hrit; been snecifiod as NO41 s'_1611 as JT-1579 in r)3).",
        "Discourse information is subject to charw,e.",
        "s the diPcourse proceeds.",
        "The way in which Vii'1.1 nresently accom)Iishes such cl-vanE(?.s is through readj'istment processes, -apDlied immediately aft r each sentence has been com.,letely verb lied.",
        "l'hese readjqstiaents secify the wwls in which tftr: St re of discourse informtion has been affected by the Sentence.",
        "Jae of them, for exaMle, c.reates a JJ w _ich is the concept of ti event of producinP; the sentence",
        "itself, which subsequently cnn be treated like any other event.",
        "verythinr; involvetLin the verbalization of that 'sentence belongs to the content of this QC.",
        "If, for examnlei the speNker subsequently has reason to repeat what he DriP;inally said, he may verbalize in exactly the_game way (quote himself directly), or' he may \"say the same thing in different words\" by making different choices in (ate-gorilation and so on.",
        "The relevant information is available withi the CC th-tt represents the orip;inal verbalizatiOn.",
        "Another readjustment has to do with the establishment of \"givenness\" for items communicated in the sentence.",
        "11or each PI-A, for example, there will be, when the senten0 has been comoletely verbalized, a readjustment process state'llgte as: 64) SP-GIVEN (PI-A) If, for examole, the sentence in question was \"Mrs. Brown gave Tommy a cookie\" and Nrs.",
        "Brown, Tommy, and the cookie are 1'1-1234, PI-:1345, and .i3I-l456 respectively, then readjustments after the production of this sentence will create the statements:",
        "If any or all of these Pis occur in the next sentence, they will be pronominalized, and it will not be necessary for ,VA 2 to ask the user a question like 40) above (12 PI-1234 .:IVE'PT:).",
        "Thus, the next sentence might be \"He took them from her gratefully.'",
        "it is difficult to decide when statements like those in 65) should be deleted from the stóre of discrsurse information--when givenness evaporates.",
        "After a c-rtaia- erioct of time has elapsed In which the .",
        ":-I has not been talked about or otherwise kept in the 60 addressee's consciousness, the speaker will probably no longer pronominalize it.",
        "At present wn ]et st-tementn likqr those in 65) remain only through the following sentence.",
        "Thus if 131-1.2341. for example, does not o,;cur in thR next sentence it will not be treated as gilgn two sentences inter, and will not b(!",
        "pronominalized.",
        "jot all discourse works In Way, but this device provides a usefll temporary anpreximation.",
        "A rather similar kind of readjustment has'to do with the establishment of n relation botwon a UJ an/ n :1\" which we call The eresence of this relation eventually leqds to the:leXicalization of the id with the definite article.. ;Junr)ose the sneakr says \"I bought.",
        "A bify7c1e yeterday.\"",
        "B„Arin,7the verbalization of this sentence VT will have created the Statement: 60 PI-198?",
        "3> 1.7J-\"3I0'3\" That isl_i-I1189 has been categorized ns an inrtance of IJJ-\":v;\".",
        "This statement then trirgers a re.djust-,ent process W'Iich brerites the discdurse inform'ition:",
        "ar, instl.nce of Li-.\"",
        "11 ; \", the addre-;see can be expected to know what particular instrrnce it is (in this caSe ?).",
        "When, during a licter sentence, VAT comes to the naestion:",
        "as in 50) above, it is in a position to 'provide its own answer without recourse to the user.",
        "Thus it will, on its own initiative, lexicalize PI-1987 with the definite article: NN-\"BIL;Lii\" / kft-\"TflE\".",
        "It is in ways such as this that we Ar.e attempting to in61 crease VAT's ability to answer its own questions.",
        "As in the case of givenness, the question arises as to when a Statement concerning identifiability like 6\") should be deleted from the store of discourse informatiQn.",
        "All that is clear now is that such statements generally last longer than S_-GIVEN statements, and for the moment we do not delete SP-IDENTIFIES statements before the end of the discourse.",
        "It is undoubtedly the case, however, th:rit some of them should be deleted sometimes, and it will be necessary also to deal eventually with discourses in which there are multiple instances of the some category: \"the first bicycle, the second bicycle, etc.\"",
        "The presence of lexical information of the type that was described at the end of section VI has an interesting and desirable effect on readjustments, snecifically with respect to statements like 67).",
        "As an example,.",
        "we might have a lexical entry for U0-\"BICY3LE\" which includes:",
        "That is, something cater;orized as an instance of UC-\"BICYCLE\" has as a necessary part something categorizable as an instance of U3-\"FRAME\"vmd also has as an optional part something categorizable as an instance of UJ-\"BAL3KS2\".",
        "Now, it may be noted that the second line under E, which deals with the categorization of PI-B, is a statement like that in 66) above.",
        "kfter a sentence like 'I bought a bicycle yesterday\" has been produced, this line will therefore trigger a readjustment proces:3 which creates the statement:",
        "(with whatever number it is appropriate to assign to this Pi).",
        "As a cOn-se•uence, if P1,1468 occurs in a subsequent sentence it will be lexicalized with the definite article, as in \"The frame is extra large.\"",
        "Thus, as is.aesiraole definiteness is created not' only for' instances of the category firat mentioned, but also through entailments of that category.",
        "it should also be noted that in this context it_is a little odd to say \"The basket is extra large\", talking abollt.PI-a.",
        "One would be 'nore likely to say \"It has a basket which is extf'a large\", or in some other way to introduce the basket explicitly.",
        "In other words the process just described works.",
        "better for necessary parts than for optional parts of the first-mentioned objet ‘PI-A).",
        "We therefore exclude from this readjust-tent process Pis that hpve.been introduced through optional entailments.",
        "VIII.",
        "Translation The general nature of the translation procedure was outlined in section I, and diarramed in Figure 1.",
        "10 summarize again, VAT will start with a text in the source language, will reconstruct the verbalization proceses which produced that text, and will then itself produce a parallel.verbalization in the target language.",
        "During this last procedure it will apply syntactic processes ap-apropriate to the target languare whenever it can, but at each of those.",
        "many points where it must make a choice of some kind it will look across to the source language verbalization to see what choice",
        "was made there.",
        "If posbible it will e•quate that choice directly with a corresponding choice in the target Ianguare.",
        "If no direct corre.spondence is available, it will compare the lexicons gf the two languages to determine.what correspondences are possible, and will then search the context.to decide which of them should, be chosen.",
        "‘,:e will be particularly concerned in this section with illustrating a case in which such a Qomplex choice must be made-in which the zigzag arrows in Figure I have considerable content.",
        "First, however', it May be useful to )rovid,e a fPamework by illustrating a relatively simple case where the correspOndences are more direct.",
        "We will use as our first example the following brief text from Japanese':",
        "71) Reizooko o utta.",
        "Okane ga hituyoo datta kara.",
        "refrigerator sold money needed was because loie will want to consider some of the procedures VAll° will follow it translating this sentence into English: 72) I sold the refrigeritor.",
        "I needed the money.",
        "Actually our attention in Oais example will focus on the first sentence, since we will later want to consider the comolicritions that are added by changing the verb in the first sentence from utta 'sold' to kasita 'rented' or '10ht Let :us first reviw the manner in whidh VaT will reconstruct the original verbalization of the Japanese text.",
        "Since our eventual parsing-component will follow a kind of 'analysis by synthesis\" procedure; we will also be suggesting.",
        "here the steps of the parsing program.",
        "The only difference, and of course it is a big one, is that for the moment VAS.",
        "will ask that decisions be_ rlacle by the user",
        "As explained for example 9) in section II, and with the proper insertion of periods, VAT's repref'entation now is:",
        "Vat finds U0-mUR-\" in the Japanese lexicon.",
        "The first three lines of this entry are:",
        "-: VAT next asks.",
        ":",
        "66 whereupon for Japanege,it crenxes the structure:",
        "VAT is.",
        "now at a point where it can lxicalif$e PI-2001 an PI-2003.",
        "Beginning with PI-2u01, it might ask first:",
        "25.",
        "V: IS PI-2001 GIVEN?",
        "26.",
        "U: YES In fact, however, we assume that the speaker (Ind addressee) are submatically given, so that VAT contains a general entailment to the effect that:",
        "Since by convention P1-2001 is the sneaker, the follo*in-g is already stored as discourse informa-ulon:",
        "Thus VAT was able to rr,ive an affirmative answer to question 25 above without asking the user.",
        "Pronominalization in Japanese is a complex matter, dependinr, in nart on social felationships, and we have not. – is yet eL.,asfructed a procedure to introduce the correct pronoun for a PI that is given.",
        "We have, however, taken advantage of the simple fact that given PIs are very often deleted., with no surface representation at all.",
        "In.",
        "the.",
        "present example, and in many others, the simole deletion of such a PI produces the correct re8u1t, SQ that an affirmative answer to question 25 leads to the representation:",
        "VAT now turns its attention to PI-2003: 27.",
        "V: IS TI-2003 GIVEN?",
        "28.",
        "U: NO ,29.",
        "V: DOES P1-2003 HAVE A NAME4 30.",
        "U: NO 31.",
        "V: HOW IS PI-2003 CATEGORIZED?",
        "32.",
        "U: aEIZOOKO",
        "(We omit here considerations of cardinality.)",
        "The renresentation now is: VB-\"UR-\"J \"PAST\" NN-\"REIZOOKO\" / \"0\" CJ-\".\"",
        "CC-2002 _ CJ-KARA\" CJ-\".\"",
        "The first three lines of the above are 7ctually as far as we go at the present time an the surface representation of a sentence.",
        "We try to include in such a representation everything that is needed to arrive at a corrdct linear se4uence of words.",
        "In this case the combination VB-\"UR-\" / \"PAST\" will yield the surface word utta, which wiii be placed in sentence-final position (followed by the period).",
        "That leaves reizooko o as the first words in the sentence.",
        "VAT, would next ask about CC-2002, but we will not carry the verb lization prodess furttier here.",
        "e are interested in how just this much of the text will-be translated into English.",
        "By and large VAT will ask-the same ,questions it asked in the course of the",
        "Japanese verbalization.",
        "It will look for the answers in the answers thRt were ,Pven there, arid when possible will apply corrazponding answers in English..",
        "Along the way, whenever appropriate, it will apply syntactic processes that are called for by the strupture of English.",
        "The translation, then, begins with the same question that begn the verbalization in.",
        "Japanese: V: WHAT VAT TASK DO YOU WANT PrRIPORNED?",
        "The answer given in line 2 above was VERBALIZE 00-2001.",
        "The English translation must use its own four digit numbers; in what follows we will simply substitute the English digit \"1\" for the Japanese digit",
        "At this point the Japanese was UR.",
        "That is, the categorization waS in terms of the Japanese category UG-°tR-\".",
        "It is necessary to find an English category that corresponds.",
        "The procedure at this point is to look first in a stored list of bilingual category equiIa-lences which we call interlingua.",
        "The entries in interlingua are of the following sort:",
        "That is, the list contains pairs of categories, where the members of each pair are assumed to categorize what is, for all practical purposes, identical content.",
        "The assumption is that if a CC can be categorized as an instance of UC-\"UR-\" in Japanese it can also be categorized as an instance of UC-\"SELL\" in English, and vice versa.",
        "Similarly, Japanese UC-\"HON-\" and English UC-\"B0010 are equivalent-categories.",
        "As a general strategy we .expect that pairs will gradually be.",
        "removed from interlingua as differences between the paired categories are discovered.",
        "Lingustic research has not yet progressed to the point th'It we can say With complete certainty that alV two categories from two different languages embrace exactly the same content.",
        "At the outset, however, it is useful at 'east to pretend that .110-\"UR-\" and U0-\"3ELL\" are equivalent, and probably thPrA are at least some pairs in interlingua that will remain viable for some time The present e3Cample was chosen because the answer to the last question above ean be found in interlingua.",
        "Later we will consider a case where it cannot.",
        "At thih point VAT answers its own question with: U: SLIJ then loos at the lexicql entry Ior uu-°SELL\" (whicn we assume does.",
        "not differ 2rom that for U0.,\"Uh-\"), and creates the representation:'",
        "The questions and answers which parallel lines l5-22 of the Japanese verbalization are straightforward:",
        "V: IS TUE BENEFIJIAiLY-XPLIJIT: U: NO V: IS TH-C:EA,iURE EXPLICIT: U: NO V: WHAT IS THE AGENT?",
        "U: PI-1001 V: WHAT IS THE .i.1TIENT:",
        "With the lexicalizatlon of P1-1001 the procedure is different in English, since this item cannot simply be deleted as in the Japanese.",
        "We follow the questions illustrated in examples 40) through 43) in",
        "to see whether that item is there, and we assume that it will be found paired with English REFRIGRATOR.",
        "Although Japanese was able to terminate the verbalization of PD-2003 at this point, English must ask the qlestion introduced in example 50) 91' section V: V: D0E;3 UC \"AEFRiGa-,ATO\" IDENTIFY PI=1003?",
        "The answer de7)ends an the context, but let us as6ume th0,it is yes.",
        "The representation now is:",
        "now have the kind of representation of the first sentence that"
      ]
    },
    {
      "heading": "1.8 our current goal, Normal English word order will put the subject",
      "text": [
        "first, the verb second, and the direct object last to yield the final representation '\"I sola the refrigerator\" of 72).",
        "The above example was chosen to illustrnte a aaximally simple case of translation: one in which, in particulpr, the answers to all questions about cross-language cateEorization could be found in",
        "interlingua.",
        "The interesting cases, however, are those in Which interlingua does not provide all the answers.",
        "It is in these cases that the zigzag arrows of Figure 1 must be further elaborated.",
        "The general method of elaboration is suggested in Figure I.",
        "Assume that we are producing .a vérbalization in the target language and, coming down from the upper righthand corner, we arrive at a point where a CC or PI needs to be categorized.",
        "Following arrow 1, we look across to the source language verbalization to find that the corresponding CC or PI was categorized in a c,ertain way, let us say as an instance of category A.",
        "We look next at interlingua (arrow 2) If A were there, we would take the-target language category paired with it (such as SELL and REFRIGE:-ZATOR in the example above), inttoduce it 4.is0 the target language verbalization, and proceed.",
        "Now, however5 de are considering those cases in which A is not fcound in interlingua.",
        "The next step, following arrow 3, is to look at the entailments of A in the source languan;e lexicon.",
        "Te next follow arrOw 4 to search the target language lexicon for entries Whose entailtents are compatible with thore of A.",
        "(This search procedure is likely to present challenging problems when the source language lexicon reachp-s any interesting size.",
        "It is however, facilitated by the presence of abstract features like TRAM3FER and 'PLANSACTION which can be used to limit the domain of search.)",
        "Suppose that we find two entries in the target language lexicon, B and C, both Of whose entlilments are compatible with the entailments of A.",
        "We then look to see how the entailments of B and C differ and find, aet u say, that B contains entailm,mt(s) X while u contains entailment(s) Y. ie then follow arrow 5 back to tn'e",
        "source language verbalization, hoping to find something in it that will allow us to choose between X and Y.",
        "(Again there are challenging problems in searcning the source language text for the answer.)",
        "Let us now assume that we find something in the sourte language text that is connatible with X but not with Y.",
        "We are then able to choose B as the correct target language category.",
        "We introduce that category into the target language verbalization via arrow 6 and proceed.",
        "In those cases where the choice between X and Y (and hence between B and C) cannot be made--where the source language text does not provide the answer--VAT must resort to asking.",
        "the user for the correc-u cauegor14a-ulon.",
        "We will illustrate this procedure with( the brief Japanese text: 73) Rpizooko o kasita.",
        "Jkane ga hituyoo datta .kaTa.",
        "refrigerator rented money needed was because We will want VAT to translate these, two sentences into English: '74) I rented the rented the refrigerator.",
        "I needed the money We are not concerned in this example with the fact that the first English sentence iq amai'ivunlis between rented (to someone) and rented(from someone).",
        "hut with the fact that the first Japanese sentence is ambtmus between rented and lent.",
        "In both c.lses, it seems, the second sentence serves to disaniguate.",
        "what we are interested in now is the fact that VAT,munt somenow_choose between RENT and LEND as the proper correspondent for JaDanese KAb,„ We carmsume that most of the verbalization in both languages proceeds along the lines already exemplififfd, since 71) and 73) grP minimally different.",
        "Imagtng, then, that we have -a±Tived at 76. the point in the English verbalization where the ouestion is: V: HOW L. 00-1003 CATEGORIZED?",
        "We are now in the upper right of.",
        "Figure/4, and we follow arrow 1 to find that the corresponding Uu in the Japanese verbalization wap categorized in terms of UC-\"Kg;-\".",
        "We then follow arrow •, and find that KAG- is not in interlingua.",
        "We look next via arrow 3 at the 3ntailments of U0-\"KAU-n and find thnt they are 'Is specified in example 55), section VI above) but without the last line of that example:",
        "(PI-2902, 00-29051 and CC-2906 71ave been inserted here as arbitrary numbers.",
        "It i.s ouite possible, however, that these are items whicl show up exFilicitly elsewhere in the Japanese verbalizati'n.",
        "For example, }q-2902, the one who receives the refrirator, might well",
        "be mentioned elsewhere in the text.)",
        "Since.",
        "C0-200 involves a transfer, VAT must also nssign numbers within the definition of U0-TR4iFER, given in section' VI alvve as example 52):",
        "Thus there is a change from the renter or lender (P1-2001) having the object (21-2005) to the rentee or borrower (PT-2902) haying it.",
        "The last three lines of 76) made it clear that this was not a chav( in ownership but only a change in use, and that P1-2001 retains own-erhip throughbut.",
        "Following arrow 4, we carry these entailments across to the English lexicon and search for entries whose entailments are compatible with 76).",
        "Compatibility means that these entries will contain what is in what is 76), but may also contain more.",
        "Let us say that we find two such entries,' one for the category UC-\"LEND\", which was givensin 55) above, and one for tiC-\"RENT-2\", which was given in 57).",
        "The next step is to isolate th,i differences between UC-\"LEND\" and UC-\"RENT-2\" UC-\"L2ND\", as mentioned, differs from 75) in containing an additional final line:",
        "this is a matter of whether PI-20011 the renter or lender, did or lid.not receive money in exchango.for the transfer of use of the abject.",
        "The following digits can be inserted for the variables in the Lexical entry for UC-\"RENT-2\"1."
      ]
    },
    {
      "heading": "What all this says is that the categorization of 0C-1003 as an",
      "text": [
        "instance oi U0-\"RENT-2\" involves a number of things.",
        "First, there must be a person who does tne renting out (PI-1001), a person who receives the rented object (PI-1901), the money that is paid in rent (PI-1902), and the rented object itself (PI-1003j.",
        "Furthertaore, CC-1003 2is said to be a transaction, and certain equivalences are stated between the RE1\\TT-2 definition and the TRAnACTI IN definition.",
        "VAT must therefore assign these particular I and c:C numbers within the definition of UC-TRANSACTION'which was Fiven' as example 56) in",
        "This says that 00-1003 can be priraphrased as two transfers, 00-I901 and 00-19021 the first of which was for the purpose of the second.",
        "(C0-4.901 is the transfer of money, and 00-1902 the transfer of the rented object.)",
        "VAT must, therefore, look also at the defi.nition of U0-TRANSINgR, given in section VI above, as example 52), and ilitro-duce-again the proper PI and CC nUmbers for each of these particular transfers.",
        "The first of them-wili be represented as: 82) -00-1901 C> UC-TRAN6YEli",
        "That is, the first transfer involves &change from JC-1903 to 0C-1904.",
        "In 00-1903 the rentee (PI-1901) has the money (.01-1902), and in 00-1904 the renter (PI-1001) has it.",
        "Tha second tnuisfer is repre",
        "Here there is a change from CC-1905 to 00-1906.",
        "00-1905 the renter (PI-1001) has the object to be rented (.PI-1003), and in 00-1906-the rentee (PI-1901) has it.",
        "80 In 80) it is also stated that PI-1102 cen be categorized, as an Lnstance of MEDIUM-0F.4EX0HANGE, in all probability therefore an instance of UC-11110NE1\" (see example' 59) in section VI above).",
        "Turthetinore it is stated that tie change in the having of the.",
        "money (from 30-1903 to 00=-1904) involves a change in ownership, whereas the ,Thange in the having of the rented object (from 00-1905 to C0-1q06) involves a change in the use.",
        "Finally, it is stated that the renter (PI-1001) retain 8 ownership of the rented object throughout.",
        "What VAT wants to find out, then, is whether these things that.",
        "nust be true if (.C-1003 is to be an inst'aice of UC=L\"RELiT-2\" are indeed true, or whether the bottomline in the entailments of UO-\"LEND\", exampe 73), i8 fulfilled instead.",
        "VT tries to decide.this by following arrow 5 to the verbalizaion of the Japanese text Of course there are-many ways in which the answer might appear in that verbalization, if it appears at all.",
        "If VAT is unsliaccessful.in it search it will have to ask the user directly: 84) V: Is 00-1003 CATEGORIZED AS LEND OR RENT?",
        "In 73), however; we have made things easy by supplying a context which ought to decide the question.",
        "It wil oe remembered that the second sentence in 73) expresses 00-2002, whicri is the REKLk)B for 00-2003, or what is expressed in the first ,oentece.",
        "Now, U-002 is categorized in the Japanese as an instance of UC-\"HITJY0(-, DA\" which means something like \"be nedded\".",
        "Let us as'sume that the Japanese lexicon c)ntains an entry for this category:which incaudes the following:",
        "native framing is pouible in terms.",
        "of an abstract verb WAXT, wherein PI-B wants CC-D, and CC-D is then characterized in terms of PI-B having Pi-C.",
        "In cyLher words, when one needs-something, one wants to have it.",
        "(If this is not always true, at least it is the expected entailment.)",
        "If 85) is-going to proviae an answer to 84), there must also be a general principle of SOMQ kind which relates what is entailed by 00-2002 to what is entailed by-CC-2003.",
        "This general principle can be stated as follows:",
        "The first line says that PI-3 wants CO-C.",
        "The second line says that PI-B does something.",
        "The third line says -:tht his wanting CC-C is the reason he does sometjling.",
        "All of this together is then said to entail that his doing \"somethingentails what 1e wants, or CC-C.",
        "In other words,.if one wants something and does something because of at then what one does must entail what one wants.",
        "During the verbalization of 0-0-2002 as part of the verbalization of the Japanese text, VT will nave recorded the iact that CO-2002 was categorized as an instance of UC-\"HITUY00 DA\", and will have entered the following statements in accordance with 85): 82 37) At this point VAT also has all the particulars needed for principle 86), which can be filled ,out as follows:",
        "The first line of 88) was obtained from 87).",
        "The second line was obtained from 76).",
        "The third line comes from line B of the Japanese verbalization set forth at the beginning (JA this section.",
        "+dhat we are interested in now is the last line of 88), which says in effect that 00-2003 is categorized in such a way that 00-2904 is trte, an' looxing back to 87) we see that 0,r3-2904 involves PI-2001 having PI2902, or the agent Of kasu having okane 'money'.",
        "Naking the necessary correspondences in English, this means that 00-1003 must be categorized in such a way that CC-1904 is true,, where: 89) CC-1904 F> VB-HAVE (P1-1UU1, 1)1-1902) This is exactly what AT finds as the last line of 82).",
        "Since 82) is entailed by UC-\"RENT-2\" but notby UC-\"IEND\", the question in 8,1-) has been answered and the arrow labeled 6 in Figure 4 carries back the choice of UO-11RENT-2\" into the English verbalization, which then proceeds as it did in the translation illustrated earlier.",
        "By this ,complex process involving comparisons of entailments within and across languages, as well as the general principle stated in 86), TAT has been able to make the correct'choice.",
        "So long as the answer to 84) was derivable from somet-ling discoverable within",
        "clear, howeve3to that the route to the answer could be extremely complex, involving chains of entailments of unforeseeibtu-lenEth.",
        "There is no doubt that such procedures are necessary to ansaer sach questions, and that they present an extraordinary challenge to our techniques for information storage_and'search.",
        "IX.",
        "Miscellaneous Problems in Translation bince we have spent considerable time looking into various specific translation problems beyond those illustrated above, we pres,ent here a few additional examples•or tne sorts of things that will have to be taken into account during the implementation of machine translation along the lines suggested above.",
        "Two of these examples will, like those in the last sectlon, involve the .choice of a category in the target language Oam that'chbice is not directly provided by interlingua.",
        "One has to do with the translation of Japanese osieru.into English; the other, the translation of English give into Japanese.",
        "A third example will illustrate the kind of problem that arises at the stage of subconceptualization and sentence formation.",
        "The following three sentences illustrate three possible Englibh translations of the Japanese verb osieru: 90) Gaidolwa Kookyo,ga doko ni.aru ka osiete kuremarata.",
        "guide imperial Palace where is showed Soko kara tookyoo tawaa e ikimasita.",
        "there from Tokyo tower to went The guide showed us where the Zmperial Palace was.",
        "From tnere we went to the Tokyo Tower.",
        "91) Gaido wa KoOkyo ga doko no aru ka osiete kuremasita guide Imperial Palace where is told ga watasitati ga soko e itta toki ni moo simatte but we there to went when already closed imasita.",
        "was The guide told us where the Imperial Palace was but when we got there it was already closed.",
        "92) Kimatu siken no tame ni sensei wa setester-final exam of for the purpose teacher Kookyo ga doko ni aru ka osiete kudasaimasita.",
        "Imperial Palace where is taught For the final exam the teacher taught us where the Imperial Palace was.",
        "Each of these -extunples contains the phrase: 93) Kookyo-ga dnko ni aru ka osiete which is translated in three different ways, determined by the context in 90): show 'where the Imperial Palace is in 91): tell where the,Imperial Palace is in 92): teach where the Imperial Pal -0-0 is The difference is localized in the translation of osiete, a parti-cipial'form of the verb osieru.",
        "This verb may be translated into English as show, tell, or_teach according to the context, and the problem is to identify what the determining ractors are.",
        "The Japaaese category UC-\"06IE-t' is well as the English categories UC-\"Sii0W\", UC-\"TELL\", and UC-NrEACH\" are all included within the more abstract c'Itegory UC-COMKUNICATION, which can be defined as follows:",
        "That i.51 for a Jj to be categorizedras ah instqnce of UJ-OUNMUNIJATIW entails that someone (P]-B) intends something (0.0-C), and that what he intends is will cause ';C-,1;.",
        "00-1) is some act that F] B ■■• performs, and caund by th:lt act, is a chane from state 02-.bh to state CJ-G. JO-: s a Ftate ins which another per on (PI-H) does not know somethinr: (0J-I), and JUG is a state in which that person does ;know it.",
        "uoc teonies of U;-,,;11U raay differ a to the nature of the act (JC:,D) performed by the A_Lild of knowinT7 th t result's (e.,7.",
        "whether it is retained in surface 6r deep memory), and in other ways such as the authbritativeness of the communicator with repect to what is communicated (20-1).",
        "'he Ja;'anes', cateror- j-\",31;,-\", for example, is less specific as to the act 11(,:r.f,or%ed by the 'communicator; apparently he can do lmost anything that will ti-tve a communic3tive function.",
        "U2-\"TELL\", on thr?, other hand, :ntails a verbal act, t3:-\"IC.ive an act, which directs-the other nerson's ri.sual attention to 2C-T, and' U;-\"TJH\" act which is didactic in nature.",
        "It 1, difficult.to delimit the acts waich lali y as teaching, but evidentl they must have an instructional which is hot necessary for.J-HOL).1,3-:\".",
        "TJJ-n2LA0;i\" may •aso be-inique in.requirinFr, that the knowijig (2J-G) be deep -)r long-trm Know\", at least in tri, intention of .-I-t3.",
        "Ja anose 7.1J-\"01.:Ay\" may, for it Dart, require that P1-3 be authoritative",
        "with respect to the content of what is beinr communicated ((X-1).",
        "But how is it fol exaMple, that-the context in 90) restricts the translation of \"03IE-\" to \";JHOW\"?",
        "The second sentence in 90) says that we went from there (soko), whose referent is the location of the Imperial Palace.",
        "Thus, at the time of the communicative event, we must have been at the Imperial Palace.",
        "Now, there is evidently a general' principle, like 86) in the last section, which says that a vr!rbal act is not uBed to communicate where something is when the beneficiary of the act is already at that place.",
        "There is evidently no such rr;striction on directing visual attention tc wh,ilwe it is, hence UC-\"UIOW\" is preferred to 11-\"TIJIJ\".",
        "ince there is nothing in the eontext of 90) to surgest that teaching methods were involved, UJ-\"SAUW\" is ]Aft as the only candidate.",
        "In 91) the situatl,on is otherwise.",
        "?he second clause makes it clear through the phrase translated \"when we fot theDe\" th t we were not at the imp,rial Palace at the time of the cDmmunicative act.",
        "Another P;eneral principle says thlt vis'ual attention can be directed only at thinR.s within visual r4anrre.",
        "Thus 1?2,-\",H011i is In t is case ruled out, as is 41..;-\"TAJUP rurnin because of the absence of didactic context.",
        "U--\"T ,LL\" in thus the choice here.",
        "In '12).",
        "the didactic c-mtext is evident.",
        "Phe ,7nnanese words kimatu, sikcn, and sensei all beloncr within the semantic field of teaching, a fact to be noted in the lexical entry fore-,ch of them.",
        "Hence the English cateory Li-0-\"2AJdn, obviousl a member of the same semantic field, will be the choice h .re.",
        "irobably we shold also tace account of the fact th-t the idiomatic vc-,fb at the end of this sentence, literally 1F7cavel,- reinforces the superior relationship of the communicator: in this case, the fact that he is authoritative with respect to what is beinp comtunicatod.",
        "The 'point of this example of the translati)n of osieru in to emphasize th complexity of the criteria which may have to be invoked to decide between poSsible translations.",
        "!lore we have seen a link betw,en different kinds of commuuimative acts and the location pf the recipient of the communi!ation, information on the 1rJtter beim); derivable from infarmation about the movement of the recibient to or from the pIttcP of esommunication, torTther with temporal information., It is also of interest thnt this example, like the second example in section VIII, led us to recop;nize certain cT,eneral principles: that ohe does not communicate verbally about where 8omethin,7 is when the addressee is already there, ror examPle, and the o0\\kious principle that one does not call visual attention to something ttlat is not visible.",
        "Detailed imnlenentation of this kind of translation research will undoubtedly lead to the recoF-nitian of a number of such principles.",
        "The word kudasimasita in r)2) lea s us to a lifferent kind of complications 1,hat involvecl in the need to oay ecial attention in Japanese verbolizatioll to the social relationsi,ip between the snrik-r and various other rw-orons.",
        "Altr)u,---h-we are chan7inw' the direction of translation here, it is of some interert to consider cl)estions th',t rise in tra!nslatin7 the Znr-lash cory U,-\"GIVE' into ja-oanese.",
        ".",
        ";Iay nssume thqt U;-\"ITL\" hns the entail-lents listed in example '4), section VI above, and that furthermore.",
        "tTie caterories under1=7 alI the Jf1:Thaneso v--\"-)s to be mentioneri share 1-;;Ler,e sRmeekntailments.",
        "I]acn (j-nane'7e c-Itp-orv, 88 however, hris entailments.",
        "of its,own, afid it is the natUre, of these.",
        "maitional entailments that we are intexonted in.",
        "What follows is based on the analysis in Kuno 19'73:127-135.",
        "- The verb kureru is used to expr,t;s instances Df a cfJter7ory Whose entailments include those 0-f, U0--:\"GIVE\"'pluS the following (where idI-B is the agent nnd )17'_; the he,ne•iciary of the riviiiar)",
        "V: 12 P-1-2/4-cl '031A,LY 2HAI; .P1-231)5: V: Mf,1 :T-24qe 2he verb kuciasaru, whose irlickittic function aDnr=ed in 9?-)71 is used to expressinstances GM'c-itory whose r,re.",
        "as follows:",
        "In other words, the •entailments of UC-\"KUDkWiR-\" are the same as those of U3-\"KUM-\" except that the agent of the givinK is socially higher-than the beneficiary.",
        "(It was the exalted position of sense, theteAcher, in 92> that led_to he use of kudasaimasita in that sentence.)",
        "The braces indicate a disjunction.",
        "2huP one of the ways in which this category differs from the last two is in the beneficiai'v of the giving not being socially close to the speaker, or rase in his not being closer to the_speaker than tne ar7ent,o1' the giving.",
        "As in 97) the agent i8 socially higher than the beneficiary.",
        "Further more, as stated in the last lihe, the beneficiary is not heing treated respectfully ,by the speakr.",
        "The verb areru is like yl2D1, excent tfiat thr- Tent of the .iving is not socially higher than the beneficiary:",
        "bpeakerr, while the poneficiary.in socially higher than tne nKent and is being-treated respectfully by tht!",
        "speaker.",
        "it is also possible to use this category when the agent is not 8ocially close to the.",
        "speaker, but evidently Japanese.speakers,are not comoletely comfortable about the choioe in that case; hevertheless,.there is no other cat-Tory available.",
        "One way in whichpVAI-mip;ht be able to Questions regnrdinp: social.",
        "relationships is through the occurrence in the text of categorizations that entail such relationships.",
        "For examrael the occurrence of an instance of U0-flU'ZNi:3Ei\" in example 92) entails a socially hip7her stTtus.for the PI thus categorized than, for the i?1s who are this teacher's students, It thus leads to the choice of tJa-'101J„EAR-\" kinsliip terms also provide examples of automatically entaled social status,.",
        "If AP take'a PI that is an instance of tiJ-\"020o,_4\" 'father' for example, there--are entailments of the followInr sort:",
        "the seakar, will.be,,socia117,close to !_-,he sneakel\".",
        "The en-tailmentsderived fro-1 both 101) ,and 102) are relewaat tb the choice of a translation for Jinp.,lish U,;-\"CTVE\", as si;etched aT,ove.",
        "So far all our exemples of translation problems have involved ca.hegorization.",
        "'.",
        ")ertain1y, however, there are also problems which arise in subconceptu'llization, and in the associated application of syntactic processes which lead to clause and sentence formation.",
        "We have not paid as much attention to questions of this sort, since for pne most part we have been able to tPanslate sentence for sentence with-reasonable success.",
        "One example which seems fai'rly clear arose early-in or investigation, and will be repeated here as an illustration of thee challenges whigh nre likely to arine in this respect.",
        "At issue is.thetranslation af the Enp;lish sentence in 103), the first sentence of a fable, into the sequence of two J-panese sentences in 104): 103) There was once a wolf who saw a lamb drinking at a river, and want-2d to create an excuse to eat it.",
        "104) Mukasi tokoro ni kawa ce AZU o. nonae once certain Dlace in river at water drinking iru ko-hitu2d o mituketa ippiki ,no ookami a imasita.",
        "be lamb saw one wolf waS 13osite sono ookami wa ano kp-hituzi o taberu tame no and that wolf that lamb it for iiwake o tukuri-ta-t:att,e imabita excuse make-want=seeming was The auestion we are concerned with is why it is desirable for the Japanese translation to 'create two sentPnc-s where the English wily one.",
        "We may note Xirst of all th'at e English sentence.contains two conjoined relative clauses (\"wh,oraw...and want'ed...\").",
        "Jananese relative clauses airfer from those in 'xis;lish flh-being preposed to 92 to the noun they .modify.",
        "[lance, if the Ja6anene.wf!re to '\")renerve the structare of'the 'English in a singlb nentence, the speaker would have to say everythinr th t the wolf saw and wanted – h-fbre Ta ever' was able to mention the wolf.",
        "The subject of the seein and the wantinfr, would be held in nusense for so lonr that ,ddressee or readermiht heve some problem in interpreting what was being saia.",
        "Another reason for not reo-atini; the English sl;ructure of twO relative clauses has.to do with the ber;innin of the next sentence: in .1rilish, \"2or that ourpose...he accused the lamb of stirring up the water...\" '2he referent of that.purpo se in English is clear.",
        "It refers to the immediately irecedine: relative clause: wanted to creete.",
        "an excuse to eat it.\"",
        "ijs intang to crePte excuse was his purpose for 'accusinr, the lamb.",
        "In Jaivires however if the clause in Tietion were o (nosed to ookai Lwiicn would then be followed Iv the main verb of the sentence, imasita), the referent of that purpose would LO lon7er, be clear.",
        "37 raakin7 the clause about the wolf's writing to creete the excuse into ari:indn,.ndent sentence, the Japanese is able to refer to it direcly at th, hocin-ninF of the next sentence without difYiolIty.",
        "j(1 h'=-ve not formalized ,-}1Q )recesses hi inich deelde to crn±e two sentences in tho trnnsintin wVre Lh n rce verb'lizatirm has one, but evidently priry:LpleF suc'l Ns the following mu-t eventually be included.",
        "Pirst, there rqust be a testrction of some kind on the amount of material that c-in be iriclided in a orer)osed relative clause, arar' nerhps escially in a relative clause thht introdaces tne main chana:tr of a story (wins() 1_;tr6riction can/lot be out off for too long).",
        "kecond, there is a need for „c3ent'ence",
        "introductory phrase like for that pilrpose to have a clear referent whicla immediately precedes it.",
        "The task of introducing such prin-criplas into V4T'q_o_29rations is formidlble, but nerhaps not impossiWre of accomplishment."
      ]
    },
    {
      "heading": "References Cited",
      "text": []
    }
  ]
}
