{
  "info": {
    "authors": [
      "Eileen Fitzpatrick",
      "Naomi Sager"
    ],
    "book": "ACL Microfiche Series 1-83, Including Computational Linguistics",
    "id": "acl-J79-1002",
    "title": "The Lexical Subclasses of the Linguistic String Parser",
    "url": "https://aclweb.org/anthology/J79-1002",
    "year": 1979
  },
  "references": [],
  "sections": [
    {
      "heading": "THE LEXICAL SUBCLASSES OF THE LINGUISTIC STRING PARSER",
      "text": [
        "The NYIT Linguistic String Parser (LSI)) is a working system for the syntactic analysis of I-l'iglish scientific texts.",
        "It consists of a parsing program, a large-coverage I-Ytglish grammar, and a lexicon.",
        "The grammar's effectiveness in parsing texts is due in large part to a substantial body of detailed well-formedness restrictions which eliminate most incorrect syntactic parses which would be allowed by a weaker grammar.",
        "The restrictions mainly test for compatible combinations of word subclas.es.",
        "This paper defines the 109 adjective, noun and verb subclasses.",
        "These subolasses, as well as others not presented here, are defined in such a way that they can be used as a guide for Ert assi fy mg new entries to the LSP lexicon and as a linguistic reference tool.",
        "Each definition includes a statement of the intent of the subclass, a diagnostic frame, sentence examples and a word list drawn from the present dictionary.",
        "The subclasses are defined to reflect precisely the grammatical properties tested for by the restrictions of the grammar Where necessary for clarifying the intent of the subclass, three additional criteria are employed: excision, implicit and co reference, and paraphrase.",
        "The subclasses have been defined so as to be consistent with a subsequent stage of transformational analysis which is currently being implemented.",
        "An illustration of the treatment of a subclass is: AASP:Frame: an adjective is in AASP if it occurs be .",
        "A .",
        "c _ t only with the non-sentehtial lnon-SN) rightNii - 0 V OBJ adjunct to V OBJ (SN an embedded, or contained, sentence) (DSN6, 7):Examples: John is free to leave.",
        "John is able to walk.",
        "$ John is able for Bill to walk.She is fit to work $ John is able that Bill walks.",
        "The book is a.pt to fall.",
        "$ John is able whether Bill walks.",
        "You are apt to be asked for money.",
        "Adjectives which occur with both non-sentential and sentential right adjuncts areit is a..pt tone assumed that John left.",
        "not in.AASP (see ASENT1, ASENT3), e.g.: She is due to arrive at five.",
        "John is certain to go.",
        "She as right to object.",
        "John is certain that he will go.",
        "John is not certain whether to go."
      ]
    },
    {
      "heading": "NOT AASP:",
      "text": [
        "John is eager to go.",
        "John is eager for Mary to goJohn is certain to go.",
        "(AS'ENT1) He is anxious to leave.",
        "(ASENT3) WORD hIST able, fit, free, quick, ready, set, slow.",
        "Xerox copies of this paper are available from the NIT Linguistic String Project (2 Washing ton Square Village, 2B, Ntlw York, N. Y.",
        "10012).",
        "More extensive word lists from the LSP compute lexicon can be generated for research groups.",
        "This paper defines the 109 adjective, noun and verb subclasses of the NYU Linguistic String Parser (LSP)1.",
        "The subclasses have been treated here in such a way that they can be used as a guide for classifying new words for the lexicon and as a linguistic reference tool.",
        "Each entry below provides a definition of the subclass, a diagnostic frame, sentence examples.",
        "and a word list drawn from the lexicon of the computer grammar (ca 1-0,000 word entries).",
        "The subclasses are defined in terms of string grammar.",
        "In string analysis, a sentence is decomposed into an elementary sentence, or center string, and adjunct strings.",
        "In a string, each word class may ba preceded or followed by left or right adjunct strings 92 and the center string as a whole may have adjunct strings which precede or follow the center string or occur at interior parts of the string.",
        "A string grammar makes restrictions as to which subclasses can co-occur.",
        "The subclass definitions.",
        "therefore, are based mainly on these octurrence possibilities (e.g., a count noun is specified as a noun which canflot occur without a preceding article).",
        "More precisely, the entire computer grammar consists or a set of approximately 200 context-free (BM) definitions, a set of about 250 restrictions, and a word dictionary.",
        "The BNF ddfinitions define the center and adjunct strings of the language as well as sentence nominalization (embedded sentence) strings which may occur in subject, object or complement position.",
        "In parsing a sentence, once an element of a string (e.g., SUBJECT, VERB, or OBJECT) has been identified in the sentence, restrictions are invoked to test.various properties, including the subclasses of the words within this element or within this element and an element previously identified.",
        "When a word is classified for the LSP lexicon it must be assigned to the syntactic classe (N, V, etc.)",
        "which appear in the context-free definitions-and to the specific subclasses (e.g., count noun) which are tested for by the restrictions.",
        "The frames and definitions are .4a compact statement of these constraints.",
        "For reference to the computer grammar, we have used the code names of strings and restrictions, but the text can be read independently of the referenced material.",
        "The strings have roughly mnemonic names.",
        "An explanation of some of the mnemonics used in the text is included in the reference guide which follows this introduction.",
        "The restrictions referred to are of several main types: agreement restrictions (AGREI noun phrase restrictions (N), position restrictions (POS), quantifier restrictions (Q), selector restrictions (S EL), restrictions on sentence embedding (S.N).",
        "and WH-string restrictions CWH) The name of each restriction is preceded by a W or D and followed by an integer, e.g.: WAGR 1111 addition to the Noun, Adjective and Verb classes, the other major classes are Adverb, Pronoun, Quantifier, Article, Subordinate Conjunction and Preposition.",
        "Coordinate Conjunctions and comparative connectives are treated individually.",
        "2 In this text, as in the LSP grammar, the notation LXR (X being a word class, e.g., N noun V verb, etc.)",
        "stands for X appearing with its optional left adjuncts (LX) and optional right adjuncts (RX).",
        "X is called the.",
        "host of its adjunct strings.",
        "Thus, old men with canes is an instance of LNR in which old is a left adjunct of the host N man, and with cane q is a right adjunct of the host N man.",
        "While a subclass is precisely defined by its appearance in the restrictions of the grammar, a person who is classifying words for the lexicon may need additional criteria in order to capture the intent of the subclass.",
        "This is particularly true in defining the verb subclasses which specify the object strings with which a verb can occur (the OBJLIST of the text).",
        "Here the frames and restrictions may not suffice to distinguish occurrences of the words as instances of the subclass from other possible occurrences covered by the grammar.",
        "For example, it is important to distinguish an object string occurrence of SVINGO in-They kept people working overtime from a non-object-string occurrence of the same word class sequence,' e.g., one consisting of a noun with its adjunct such as N + reduceci relative VINGO im They fired people working overtime.",
        "Of course, some verbs will have ambiguous occurrences, e.g.,.keep in the first example.",
        "It would' be incorrect, however, to crass fire as occurring with a SVINGO object on the basis of the second example.",
        "We haye therefore used additional criteria in defining the object strings in order to clarify the intent of particular subclasses.",
        "The criteria used are: (1) Excision.",
        "In an occurrence of an element with its adjunct in a sentence, the adjunct can be excised leaving a well-formed sentence unchanged in meaning and selection from the original sentence (except for detail added by the adjunct).",
        "Thus, we can test whether a word sequence in a sentence is an object string occurrence by excising the portion which might be an nrijunct.",
        "If the remaining sentence is either different in grammaticality, meaning or selection from the original sentente, then the sequence as a whole is considered an object string occurrence.",
        "For our purposes, if the sequence is an object string octurrence, then the verb with which it occurs must be subelassed for that object string.",
        "For example, line, show and carry must be subcla.ssed as occurring with the particle string DP, and walk not, since They lined up.",
        "$ They lined.",
        "He showed off.",
        "He showed.",
        "(difference in meahing) He cactied on.",
        "The.point carried.",
        "(difference in selection) He walked on.",
        "He walked.",
        "(1-io difference in grammaticality, selection or meaning)",
        "(2) Undertood reference.",
        "If a given noun in one sequence-occurrence is understood as referring to a particular noun N1 and, in a different occurrence as referring to an N2, the two occurrences must not be considered as instances of the same string.",
        "For example, since messengers in (1) refers to they and messengers in (2) refers to boys, the two occurrences of as ,N must not be considered as the same string: (r) They served the boys as messengers.",
        "(2) They treated.",
        "the boys as messengers.",
        "(3) Paraphrase.",
        "If a semantic contrast can be found in otherwise identical sequences, then these sequences cannot be considered as instances of the same string when subclassing",
        "a verb.",
        "For example, the as which is equivalent to 'in the capacity of' in (3) functions as part of the object string ASOBJBE, while the as which is equivalent to 'when' in (4) functions as part of an adjunct which does not restrict the verb: (3)-John served as a lieutenant.",
        "(4) John changed as a lieutenant.",
        "Dtie, to the difficulty or judging the appropriateness of a paraphrase, however i(ve have used this criterion sparingly.",
        "As we' have noted, the frames and definitions precisely reflect the use of the, major classes and subclasses in the presently implemented string grammar.",
        "However, it should also be noted that this grammar, and the associated lexical categories, have been defined so as to be consistent with a, subsequent stage of transformational analysis which is currently being implemented.",
        "In some cases, the same string form has several transformational sources; where this affects the dictionary classification, we have noted it.",
        "Something should be said about the form of the dictionary entries as they appear in the computer lexicon.",
        "Each word is classified for all its major class occurrences (N, V, etc.)",
        "and its subclasses within each major class.",
        "The classification is based on the usage of the word in the language as a whole, not its use in a particular text.",
        "However, purely colloquial and literary uses have not been covered because of the intended application, to scientific texts.",
        "The classifications of the words are arranged in a hierarchical structure: the major classes may have subclasses and the subclasses in turn may have subclasses.",
        "For example, the adjective clear, which can occur as the predicate of asentential subject, is in the subclass ASENT1.",
        "The particular type of sentential subjects clear occurs with (WII and THAT embeddings) require that it be classified in the two subclasses AW1-1 and ATHAT of ASENT1.",
        "This part of the lexical entry appears as follows:",
        "where the particular line number assig-aed (.10) is arbitrary.",
        "Where this type of further subdivision of a subclass is necessary, a sample dictionary entry is provided along with the definitions and frames below.",
        "It should be noted that while the entries in the lexicon are by word rather than stem the word entries based on a particular stem can refer to portions of a basic entry which they share in common, e.g., the object list of a verb (OBJLIST) is specified once for all forms of the verb (tensed verb tV, present participle Ving, past participle Ven and infinitive V) The notational conventions used in the subclass definitions and frames are as follows:",
        "frame where the frame also contains a particular lexical item",
        "It should also be noted that the specified frame which delimits a word is not the only frame in whielr tha word can occur; it serves merely as the test frame when classifying words.",
        "The present paper is an outgrowth of ongoing work on the LSP lexicon throughout its various implementations and applications since 1965.",
        "It draws particularly on a previous write-up of the LSP grammar (N. Sager, \" k Computer String Grammar of English\", String Program Report No.",
        "4, Linguistic String Project, New York University, 1968), diagnostic frames prepared for LSP use by Barbara Anderson, and classification work by many members of the LSP staff over the years.",
        "For a recent description of the LSP systemsee R. Grishman, N. Sager, C. Raze, and B. Bookchin, \"The Linguistic String Parser\", Proceedings of the 1973 National Computer Conference, A FIPS, Montvale, N. J.",
        "ACKNOWLEDGEMENT: This work was supported in part by research Grants GS 2462 and GS27925 from the National Science Foundation, Division of Social Sciences.",
        "I. Adjective Subclasses.",
        "AASP: an adjective is in AASP if it occurs only with the non-sentential (non-SN) right adjunct to V QBJ (SN - an embedded, or contained, sentence) (DSNG, 7): John is able to walk.",
        "$ John is able for Bill to walk.",
        "John is able that Bill walks.",
        "$ John is able whether Bill walks.",
        "Adjectives which occur with both non-sentential and sentential right adjuncts are not in AASP (see ASENT1, ASENT3), e.g.:",
        "Frame: N be Adj to V OBJ Examples: John is free to leave.",
        "ae is fit to work.",
        "The book is apt to fall.",
        "You are apt to be asked for money.",
        "It is apt to be assumed that John left.",
        "She is due to arrive at five.",
        "She was right to object.",
        "John is certain to go: John is certain that he will go.",
        "John is not certain whether to go."
      ]
    },
    {
      "heading": "NO X AASP:",
      "text": [
        "John is eager to go.",
        "John is eager for Mary to go:John is certain to go.",
        "(ASENT1) He is anxious to leave.",
        "(ASENT3) WORD LIST: able, fit, free, quick, ready, set, slow.",
        "AINPA: an adjective is in subclass AINPA if it occurs in the adjective position in the s,entence adjunct string PA (P = in or a.t); e.g.: in general, at present, in particular (WPOS11).",
        "The particular P must be specifi.cd for each adjective.",
        "Frame: in at Examples: In general, we can maintain the following.",
        "We do not, at present, know the answer.",
        "We cannot say, in advance, what tomorrow will bring.",
        "We didn't know what to think about her statement at first.",
        "Dictionary Entry: GENERAL.",
        "ADJ: (.10), .",
        ".",
        ".",
        ".",
        "10AINPA: (4 IN4 ).",
        "WORD LIST: advance an), best (at), first (at), full en), general (in), last (at), least (at), particular an), present (at), short (in).",
        "Examples: The figure above illustrates this point.",
        "The people absent represent the dissenting opinion.",
        "This man alone understands the consequences.",
        "The arguments necessary have been listed below.",
        "AINRN: tErn adjective is in the small subclass AINRN if it can occur as a single-word right adjunct of a noun (WN50): the people present the conclusions possible Non-AINRN adjectives in RN require an adjunct or conjunct (WN50): an item worthy of your attention an item worthy a sum greater than they expected $ a sum g-reater) a man courageous and true",
        "An additional five people were found.",
        "an additional five people the following three itemsThe following three items were mentioned.",
        "The occurrence of superlative adjec-Please make the next several payments on tives before Q N (the tallest three boys) istime.",
        "accounted for by a separate statement in We chose the first few people to welcome him.",
        "WN5; therefore, superlative forms should not be listed as A PREQ.The next ten people will constitute the control group... WORD LIST: above, additional, another, best, bottom, first, good, last, necessary, next, other, own, particular, previous, representative, same, top, usual, very, wrong.",
        "APREQ: an adjective (or Ving or Ven form of the verb) is in APREQ if it occurs before a quantifier which is a left adjunct of N (WN5), e.g.: ASCALE: an adjective is in ASCALE if it can occur to the right of the measure sequence QN in which N is in subclass NUNIT 0.nches, feet, pounds, years, etc.)",
        "(WQ2), e.g., long in The line is 10 inches long.",
        "a ten inch long line.",
        "ASCALE includes long, wide, deep, broad, tall, thick, high, old.",
        "Since both ASCALE and non-ASCALE adjectives can occur in Q N Alp in their Frame: Q N Adj (Adj is not comparative) Examples: The line is ten inches long.",
        "This is a ten mch long line.",
        "He is five years old.",
        "He is a five year old child.",
        "This area is 200 feet square.",
        "comparative form (three shades darker), the Q N 1 Comparative Ad j. is accountedThis is a 200 foot square area.",
        "for by a separate statement in WQ2.",
        "'Therefore, comparative forms need not be listed as ASCALE.",
        "WORD LIST: broad, deep, high, long, old, premature, square, tall, wide."
      ]
    },
    {
      "heading": "ASENT 1:",
      "text": [
        "an adjective is in the subclass ASENT1 (similar to notin subclass NSENT1) if it can occur as the object of the verb be when the subject of he is a string from the set SN (i.e., TEATS, (FOR)T0\\70, C1S1-101:LD, SNWI-1) (WSN1): That he sold books is probable.",
        "Whether he will come is uncertain.",
        "As the object of the verb he, an adjective in ASENT1 may have a string from bN as its right adjunct, provided the subject of be is it (DSN2): It is probable that he sold books.",
        "John is probable that he sold books.",
        "Several adjectives which occur as ASENT1 arso occur as ASENT3, e.g. John is certain that he sold book& (ASENT3) It is certain that he sold books (ASENT1) Therefore, such adjectives should be listed as both ASENT1 and ASENT3.",
        "ASENT1 is subdivided according to the type of SN string with which the particular ASENT1s occur; i.e.,",
        "FM John to leave no would be bad.",
        "It would he bad for John to leave now.",
        "That we solve the problem immediately is crucial.",
        "It is crucial that we solve the problem immediately.",
        "That the lied is obvious.",
        "It is obvious that they lied.",
        "Whether they will come isn't clear.",
        "It isn't clear whether they mill come.",
        "Dictionary Entry: CLEAR.",
        "ADJ: 10 10ASENT1: (ANVIL ATIIAT).",
        "ASENT1: (A FORTO) is further subdivided into three classes according to the type of extraction from the embedded sentence which occurs with a particular adjective; viz.: 1) ASENT1: (A FORTO: plITEXT)) occurs in N, t be -- (for N1) to V -N4: The problem will be easy for John to solve.",
        "related to For John to solve the problem will be easy.",
        "2) AS ENT1 : - (A FORTO: .1..TBJEXT)) occurs in Ni t be -- to V OBJ: John was kind to invite me.",
        "related to For-John to invite me was kind.",
        "3) AS ENT1: (A FORTO: N OEXT)) occurs with neither type of extraction: For John to write a letter now would be curious.",
        "$ A letter would be curious for John to write now.",
        "$ John would be curious to write a let-, ter now.",
        "All three subclasses of ASENT1: (AFORTO) an occur with a PN adjunct: For us to leave now would be bad for John.",
        "libr John to invite me was kind of him.",
        "For us to leave now would seem curious to John.",
        "WORD LIST: A FORTO: OBJEXT: bad, base, convenient, difffoult, easy, simple; A FORTO: SUBJEXT: gross, just, kind, origin.al, rash, wrong; A FORTO: NOEXT: cirrious, justifiabl-e, permissible, possible, practical, usual; ASHOULD: crucial, desirable, essential , important, right; ATTIAT : apparent) bad, certain, crucial, curious, good, important, itt.st, likely* natural peculiar, possible, significant, understandable, wrong.",
        ": AWII: clear, insigrnific-Na.nt.",
        "doubtful, uncertain, unclear.",
        "an adjective-is an ASENT3 if, as the object of be, it can have a sentential right adjunct SN while the subject of be is not neeessardy it (see ASENT1); i.e., ASENT3- can occur in the environment N t be -- SN:N t be Adj SN (N / expletive it) Examples: I would be happy for you to come.",
        "He is certain that they passed hisThey were eager for the speaker to address doorway.the crowd.",
        "Ile is tall that they passed his doorway.I am insistent that you go alone.",
        "ASENT3 is subdivided according to I am certain that John will come.",
        "the type of SN string witnin which the particular ASENT3s occur; i.e.,PM grateful that the stuff arrived on time.",
        "1) AS ENT3: (A FORT 0) We re happy that you can come.",
        "I would be happy for you to come.",
        "2) ASENT3: (ASHOULD)He is doubtful whether the plans will come I am insistent that you go alone.off.",
        "3) ASENT3: (ATHAT) I'm not sure whether they will come.",
        "I am certain that John will come.",
        "4) ASENT3: (AWH)We are uncertain why he left.",
        "We are uncertain why he left.",
        "Last week, John told Mary the news.",
        "$ Good week, John told Mary the news.",
        "I will see him next year.",
        "He looked better this time.",
        "COMPARATIVE: an adjective is in the subclass COMPARATWE if it can occur in the environment N1 t be -- than N2: John is happier than Bill.",
        "John is tender than Bill.",
        "Adjectives listed as COMPARATIVEThis light is dimmer than that one.",
        "also occur to the right of the measure se-My left hand is number than my right.",
        "quence QN in which N is in subclass NUNIT (cf. ASCALE)(WQ), (e.g.: three shadesA is higher than B. darker, one pound lighter) COMPARATIVE adjectives are listed separately from their positive forms.",
        "WORD LIST: abler, deeper, earlier, greater, higher, larger, narrower, number, rougher, simpler, smaller, straighter, stranger, stronger, sweeter, weaker.",
        "Examples: Those were the worst tep days of my life.",
        "The longest five minutes of my life V^ ere spent waiting for this.",
        "Give me the tallest five boys.",
        "WORD LIST: ablest, deepest, greatest, highest, lightest, longest, lovest, narrowest, roughest, simplest, straightest, strangest, sweetist, II.",
        "Noun Subclasses.N t\\' (sing/pl) AGGREGATE:Examples: a singular noun is in AGGREGATE if it can occur as the subject of both definitely singular verbs and definitely plural verbs, (WAGR EE1) : e.g.:The group has changed its mind.",
        "The group has changed its mind.The g:roup have changed their minds.",
        "The couple is of one mind_ The group have changed their Minds.The couple are of one mind.",
        "An AGGREGATE noun cannot occur as a predicate of be when the subject of the, sentence is singular (WAGREE2):The public disapproves of it.",
        "Ile is a group.The public disapprove of it.",
        "In the construction Q of N, if N is singular, it is AGGREGATE (WN53):A minority is in favor of the action.",
        "five of the group $ five of the hookA minority.",
        "are in favor of the action.",
        "Also AGGREGATE nouns can occur as the subject of collective and reciprocal verbs (WAGREE3): SUPERLATIVE: an adjective is in the subclass SUPER - LATIVE if it occurs with the suffix -(e)st before a quantifier which is a left adjunct of 'N (WN5), e.g.: the worst ten days the tallest three boys Cf. APREQ.",
        "The group gathered.",
        "$ He gathered.",
        "The group met.",
        "$ He met.",
        "Tests for NHUMAN allow for AGGREGATE nouns in the NHUMAN position: The group who call themselves the rangers are waiting.",
        "(WWII:3) He brought the group a present.",
        "(WPOS22).",
        "WORD LIST: aggregate, assembly, block, board, couple, enseMble, family, group, government, majority, minority, p4ir, publit , remainder, segment.",
        "INITIAL (atomic clasp): used for abbreviation of proper names (Parry S. Truman), names of organizations (A. F. of L.), etc.",
        "The, 26 letters of the English alphabet must appear in the dictionary each followed by a period.",
        "The report John, presented.",
        ".",
        ".",
        "?The report writers presented .",
        ".",
        "3) it can occur in commaluss apposition to a host noun (WCOM10).",
        ": My friend John WORD LIST: Abe, Acheson, Friedman, John, Jones, Mary, Maurey, Ringer, Solomon.",
        "NCLASSIFIER: A noun is in NCLASSIFIER if it occurs as the host of another noun, N2; where N2 ccurs in commaless apposition to NCLASSIFIKR, e.g.: the term revolution the element 'hydrogen All NCLASSIFIEIIS are NONHUMAN; for N NIJUMAN apposition (my friend John) see NAME and Ncourr3).",
        "An NCLASSI FIER is in either: 1) NCLASSIFTER1, which includes metaling-uiStic words that introduce terminology, e.g. term, symbol, or2) NCLASSIFIER2, which includes classifier words specific to the subject matter area (supplied by the user), e.g.: element, drug., acid, enzyme, extract, hormone, ion, mineral ,,coefficient, factor ,etc.",
        "Note: An NCLASSIFIER noun should not be confused with the 'host of a relative clause S N construction.",
        "If a noun can occur as N1 in the string The N1 N2 be .",
        "then N1 is a NCLASSIFIER.",
        "For example: The element hydrogen is the lightest substance.",
        "Therefore element ,is an NCLASSIFIER.",
        "However, The reaction digitalis produces is dangerous.",
        "$ The reaction digitalis Is dangerous.",
        "Therefore, reaction is not an NCLASSIFIER.",
        "WORD LIST: NCLASSIFIER1: expression, symbol, term.",
        "NCLASSIFIER2: acid, amphibian, chemical, carrier, compound, drug, enzyme.",
        "extract, fibre, hormone, ion, isolate, mineral, molecule.",
        "Frame:",
        "The symbol is interpreted as the subject of a sentence.",
        "Linguists often confuse the terms string and sequence.",
        "The expression Rarified gTammar will be used to refer to the grammar in Appendix H. NCLASSIFIER2: The element hydrogen is the lightest substance.",
        "The drug digitalis promotes undesirabje side effects.",
        "The feature singular is necessary 'here.",
        "NCOLLECTIVE: Frame:19 a noun is in N'_OLLECTIVE if it oc-N tV.",
        "curs as the non-plural subject of a collec-N tV N. tive verb when that verb has a null object,tV VCOLLECTIVE Dust gathered in the corners.",
        "$ A book gathered in the corners.Examples:, or as the non-plural object of a collectiveIn the corners, dust collected.",
        "verb, (WAGREE:31, e.g.: While he was away, the fortune accumulated.",
        "The shelf will gather dust.",
        "The cell accumulates sodium.",
        "$ The shelf will gather a book.",
        "These books will only gather dust.",
        "Cf.",
        "AGGREGATE.",
        "He accumulated a fortune.",
        "WORD LIST: acid, alcohol, ammonium, blood, calcium, change, digitalis, down, energy, evidence, fluid.",
        "hydrogen, interest, knowledge, plasma, salt, sweat.",
        "$ Book fell.",
        "$ A blood flows.",
        "WORD LIST: act, advance, agent, amount, amphibian, analogue, animal, antidiuretic, associate,",
        "auricle, author, back, can, case, cat, cation, cause, chemical, chief, claim, collaborator, complex, compound, conclusion, controversy, correlate, cortex, couple, covering, decrease, degree, difference, dog, draw, drug, enzyme, equation., essential, event, example, explanation, factor, foot, fit, fraction, gradient, gross, group, human, hypothesis, inhibitor, investigator, ion, isolate, junction, king, lead, length, limit, look, make, maximum, mean, meeting, negative, nucleus, number, original, peak, period, point, preliminary, president, problem, question.",
        "relation, relative, say, significance, source, subject, synthesis, test, thing, total, try, whole, worker, year NC OUNTI.",
        ": occurs in the environment A (n)tV OBJ, and not in the environment tV OBJ.",
        "(WN9) Nouns not classified as NCOUNT1 (i.e., mass nouns and many abstract nouns) can, begin a headless relative clause SN (DN51):",
        "an NCOUNT1 which, as the object of a specified preposition P, occurs without a preceding article (WN9).",
        "The particular P which occurs with a given NCOUNT2 is specified in the dictionary entry of that NCOUNT2.",
        "WORD LIST: amount (in), answer (in), approach (in), assumption (in, by), bed (in), case (in), charge (in), conclusion (in), contract (against, by, from, in, into, on), course (in, of, on), degree (in, of,, end (vithout), estimate (according to, beyond, by), example (by, for), foot (on, focus (in, into, out of)-, gross (in), hand (at, by, in, on, out of), kind (in), length (at, in), limit (beyond,within, without), line (in, on, off), mark (of), measure (beyond, toy, number (according to beyond, by, fn, of, without), parallel (in, without), phase (in, out of), place ( according to, in, into of, out of), point (in), position (in), process (in), question (beyond, in, into, under, without), ratio (in), reach (beyond, in, into , out of, within), show (for, in, on), significance (of), turn (in), view (from, in, into, on), way (by).",
        "NCOUNT3:Frame: NCOUNT1s which can occur without N t be N a preceding article.after be or in the object position in SOBJBE and OBJBE (see OBJLIST: Examples: (SOBJBE), (OBJBE)) (WN9): He is president.",
        "He is president.",
        "We-elected him president.I am treasurer.",
        "He remained president.",
        "He is chief investigator.",
        "We elected him president.",
        "They appointed me treasurer.",
        "WORD LIST: collector, director, head, investigator, judge, president, secretary.",
        "NAUMAN: Can occur as the first noun in the string NNi.e., as indirect object -(WPOS22): She bought the boy a book.",
        "(cf.",
        "AGGREGATE) or as the host of a right adjunct WH string (relative clause) headed by who/whom (WWH2): The man who ate the cheese left.",
        "Frames: Ni N2 (N1 indirect object) N who Examples: She baught the boy a book.",
        "She wrote the workers a letter.",
        "She showed her relations the presOnt.",
        "NHUMAN does not occur as the host N of a right-adjunct PN string with P - into (WN51): $ The children into the house are noisy, or as the subject of thb sentential predicate be + SI^T (DSN1): $ The man is that we need Money.",
        "WORD LIST: agent, boy, chemist.",
        "doctor, German, host, independent, judge, man neighbor, native, neighbor, Qbserver, parent, person, prvsident, relation, representative, sister, student, subject, woman, worker.",
        "NLETTER: a noun, subclass which contains all the letters of the English alphabet.",
        "It is used in the NQ string as a variant of Q (WN12r: Table 1 Table A size 5 size B Frame: $ N tV (V NOTNSUBJ: NONHUMAN) Examples: $ The clock believes that this is so.",
        "$ The account knows that he is wrong.",
        "$ The apparatus laughed.",
        "WORD LIST: ability, act, assumption, balance, can, day, dose, enzyme, feature, frog, gland, hypothesis, interaction, junction, London, mean, need, organ, pathway; peak, position, property, range, satuFation, tension, use, wonder.",
        "N:PLURAL:Frame: a noun is in the subclass N:PLURAL jilt occurs in the environment These -- tV - OBJ andmot in.This tV OBJ (WAGREE4), e.g.: These groups answered quickly.",
        "$ This groups answered quickly.These N tV OBJ.",
        "Examples: These men love Mary.",
        "$ This men love Mary.",
        "The man whom you saw was Bob.",
        "She needs a friend who can care for her.",
        "NONHUMAN: a noun is in NONHUMAN if it cannot occur as the subject of a verb in VSENT3 (e.g.: believe, deny, discover, know, read) and other verbs which require a human subject (e.g.: hand, laugh, long, skin) (WSEL2).",
        "Cf. NOTNSUBJ.",
        "WORD LIST: abilities, ages, combinations, data, effects, groups, measures, rnucosae, observations, parallels, problems, rises, seconds, tries, uncertainties., uses, valencies, wants, years.",
        "NPREQ:Frame: a noun which is not also a proper name"
      ]
    },
    {
      "heading": "TNQN",
      "text": [
        "is in NPREQ if it occurs as the N of the sequence NQ (Q quantifier, here restricted Examples: to numbers) in the left adjunct of a N, i.e., if it occurs in the environment TQINa size ten dress (WN12).",
        "a pil 7 solution:.",
        "a model Six radio a table 6 caleuration WORD LIST: area, base, figurc, model, pattern, pH, phase, section, site, stage, table, type.",
        "NSCALE: Subclass NSCALE can almost be defined extensionally.",
        "It contains the words length, width depth, height breadth, thickness, age, weight, volume, area, and perhaps a few others.",
        "These words occur as N2 in the sequence Q Ni P N2 where Ni - NUNIT (inches, years, etc.)",
        "and Q quantifier, including numbers (WQ3).",
        "In the case oilength sequence (two inches) a class of nouns, also classified as NSCALE, can occupy the place of length in P NSCALE: two inches in diameter, in circumfrence, along the diagonal, etc.",
        "(The adverbs across and around can also occupy the P NSCALE position.)",
        "Frame: QNPN Examples: The line is two inches in le.r.:12.",
        "He is five years of age.",
        "The area measures twenty feet in width.",
        "The rectangle is two inches along the diaiheter.",
        "WORD LIST: age, altitude, area, breadth, height, intensity, length, luminosity, strength, volume, wavelength, width, circumfrence, diameter, thickness.",
        "NSENTP: occurs in the environment It be P -- SN, where P is of or to (DSN5).",
        "The choice of of or to must be indicated in the dictionary entry of each NSENTP.",
        "The demancl.that salaries be raised was rebuffed.",
        "The plan for him to go to college was foremost in their minds.",
        "His atteMpts to leave were noticed.",
        "The fact that they enrolled is known.",
        "The question whether or not to vote was posed.",
        "The fdct that the atom exists is clear.",
        "$ The book that the atom exists is clear.",
        "NSENT1 is subdivided according to the type of SN string with which the particular NS-ENT1s occur; i.e., 1) NSENV: (A PORTO)",
        "The plan for him to go His attempts to leave 2) NSENT1: (ASHOULD).",
        "The demand that salaries be raised 3) NSENT1: (ATHAT) The fact that they enrolled 4) NSENT1: (AWH) The question whether to .vote WORD LIST: demand, move, notice, order, suggestion, direction, analysis, assumption, charge, claim, conclusion, criticism, doubt, estimate, fact, finding, hypothesis, idea, inter pretation, knowledge, observation, position, postulate, report, representation, response, theory, thought, view, alternative, question.",
        "NSENT2:Frame: A noun is in NSENT2 if it can occur in the environment TSN is SN (DSN5).T N SN be SN Note: NSENT2s are automatically allowesd by the grammar in the environmentExamples: specified for NSENTls (i.e. TSN tV OBJ:The evidence that he remained is that some-The evidence that he murdered her sprprisedone saw him there.",
        "me); therefore, NSENT2s need not also be classified as NSENT1s.",
        "that he loved her.",
        "The reason that he didn't tell the truth was WORD LIST: evidence, indication, reason.",
        "'NSENT:3:-occurs as the subject of be SN (DSN1), but not with a right adjunct SN (DSN5).",
        "Note: NSENTls and NS :,'NT2s are automatically allowed by the grammar in the environment specified for NSENT3s, thus The fact is that he came.",
        "The reason was that he loved her.",
        "Therefore, NSENTls aid NSENT2s need not also be classified ats NSENT3s.",
        "Frame.",
        ": (T) N be SN Examples,: The trouble is that we have no money.",
        "$ The trouble that we have no money bothers us.",
        "The truth is that we need money.",
        "$ The truth that we need money bothers us.",
        "The basis for this theory is that the two factors are the same.",
        "The basis that the two factors are the same is untenable.",
        "WORD LIST: approach, basis, change, conflict, connection, consideration, deal, detail, development, difficulty, erding, error, point, problem, procedure, reason, result, reverse; rule, significance, situation, solution, thing, trouble, wonder.",
        "N:SINGULAR: a noun is in the subclass N:SINGUL.A.R if it occurs in the environment ThistV OBJ and not in These -- tV OBJ (WAGREE4), e.g.: This book fell.",
        "$ These book fell.",
        "Note: words like fish, series.",
        "etc.",
        "are in neither N:PLURAL nor N:SINGULAR Frame: _This N tV OBJ.",
        "Examples: This boy is happy.",
        "$ These boy is happy.",
        "WORD LIST: ability, age, combination, data, digitalis, excitability, group, Gunther, lactone, liberation, measure, mucosa, observation, plasma, rise, sodium, try, uncertainty, use, valency, want, year.",
        "NTIME1: a noun is in NTIME1 if it cannot occur alone as a sentence adjunct.",
        "It occurs as'a sentence adjunct with appropriate left or right adjuncts.",
        "Its left adjuncts include last, next, each, every, etc.",
        "(i.e., adjectival TIMETAGs).",
        "Its right adjuncts include hence, ago, later, etc.",
        "(i.e. adverbial TIMETAGs) (WPOS10).",
        "If in the PN right adjunct of N, P since, the host noun is an NTIME1 (WN51): Frames and examples: LN N Sentence (LN adjectival TIMETAG) Sentence LN N We'll finish the work next time.",
        "Last week, we met in New York.",
        "They eat eggs every day.",
        "BUT NOT: Last meal, the meat was overdone.",
        "(requires special context)",
        "The week since, his arrival has beenN RN Sentence (RN adverbial TIMETAG) hectic.Sentence N RN' A noun in NTIME1 can also occur as An hour hence, the place will be deserted.",
        "the host of when 4 S (WC 0M8) : I saw hinn two days ago.",
        "I remeMber the day when he arrived.",
        "$ Five sentences ago I understood you.",
        "$ A report later they show how it works.",
        "WORD LIST: century, day, evening, Pall, generation, hour, minute, moment, month, morning, night, second, term, time, week, year.",
        "NTIME2:Frame: a noun is in NTIME2 if it can occur - N Sentence.",
        "alone as a sentence adjunct (W.POS10).",
        "NTIME2 is a closed class including yester-Sentence N. day, today, tomorrow, Sunday, Monday, etc.",
        "NTIME,2s (but not NTIME1s) may alsoExamples': occur alone as possessive nouns in noun Yesterday I went to the movies.",
        "phrases: Sunday he will run the race.",
        "Yesterday's meeting was cancelled.",
        "$ Hour's meeting took place on Tuesday.They will sail for atrope tomorrow.",
        "(hour NTIME1) he'll be *here Tuesday.",
        "WORD LIST: yesterday, tomorrow, Swiday, Tuesday.",
        "NTITLE: A noun is in NTITLE if it is a title' which can precede names,of persons, e.g. Dr,, Mrs., Mr., Ms., Prof., Professor (WPOS24).",
        "Nouns,in NCOUNT3 (e.g. President) need not be classified as NTITLE.",
        "WORD LIST: Dr., Doctor, Mr., Ms. Frame: N NAME (INITIAL) (NAME) Examples: Dr. John Smith Prof. Mary Jones NUNIT:Frames and Examples: a noun is in NUNIT if it can occur as"
      ]
    },
    {
      "heading": "QNPN",
      "text": [
        "the N of the measure sequence Q N followed by a P N or A of dimension (in length, ofIt is two inches in width.",
        "age, long, old.",
        "see ASCALE) (DQ3).",
        "He is five years of age.",
        "In the predicate position-, NUNIT agrees in number with Q (WQ1):The play is two hours in length.",
        "Be is five years old.",
        "$ Ile is one years old.QNA(A ASCALE) He is five years of age.",
        "$ He is one years of age.It is two inches Jong.",
        "in the LN position, NUNIT is singular (WQI) and Q N is not followed by a PN (DQ42.",
        "),:He is five years old.26 a five year old childThe play is two hours long.",
        "a two inch long) line $ a five years old childa five year old child $ a five years in age child.",
        "Nouns which are not NUM 1)37 the above criteria, but.which occur in Q N of an LN sequence (e.g.,.a three act .play) will be accepted in the N of Q N if the rare switch is on.",
        "a two hour play WORD LIST: block, centimeter, century, column, day, foot, hand, hour, inch, kg., mile, millisecond, moment, morning, nights, pound, row, section, segment, week, yars.",
        "III.",
        "Selection Attributes Ube Verb.",
        "NOTNOBJ: applies to verbs restricted in terms of the noun objects with AN'hich they can occur in scient4fic writing.",
        "The noun subclasses with which the verb cannot occur are li,sted as NOTNORJ attributes of the verb (WSEL1); e.g., since NSENT1 nouns do not occur as, the object of eat (/ He eats the fact), cat is classified as NOTNOBJ: (NSENT1).",
        "The noun subclasses considered in NOTOBJ are NIIUMAN, NONHUMAN, NSENT1, NSENT2, NSENT3, NTIME1, NTIME2.",
        "NOTNOBJ classes also apply to the compound noun N Vino (hat wearing) , the compound adjective N Ving (a hat wearing man) and the passive Ven as an RN the verse quoted): If for any given verb N4 tV N, does not occur then N2 y_ing and N, Ven do not occur: (WSEL3, 4 and 5 respectively): That man wears a hat Hat wearing A hat wearing man Ile quoted the Verse.",
        "The verse quoted vs. $ Ile eats the fact.",
        "learn, paper, peak, smoOth, summarize; NOTNOBJ: (NONHUMAN): convince, surprise; NOTNOBJ: (NSENT1).",
        ": act, content, decrease, inactivate, lower, prevent, tend, work; NOTNOBJ: INSENT2: act, content, decrease, inactivate, further, lower, maintain, tend, work; NOTNOBJ: rKSENT3): act, content, extract, inactivate, learn, lower, tend, work; NOTNOBJ: (NTIME1): achieve, dindnish, oppose, restore; NOTNOBJ: (NTIME2): .achieve, analyze, diminish, oppose.",
        "NOTNSUBJ: applies to, verbs restricted in terms of the noun subjects with which they can occur.",
        "Similar to NOTNOBJ in form, the value of the NOTNSUBJ attribute is a list of noun subciasse.s which cannot, an scientific writing, at least) occur as the subject of the verb in question (WSEL2).",
        "Also, for occurrences of adjectival Vino N (the dining .gentleman), if' for any given verb N tV OBJ does not occur then Vino N does not occur (DSEL1): The gentleman dined.",
        "The dining gentleman The.",
        "gentleman occurred The occurring gentleman",
        "Examples: He painted red the house on the corner.",
        "He botind tight the ropes which were slipping off the deck.",
        "She in.ade secure the rattling windows.",
        "He marked \"fragile\" the package we sent.",
        "You'Ve already pumped dry the source, you were planning to count on.",
        "We split open the package marked \"fragile\".",
        "WORD LIST: bind, color, draw, grind, keep, make, mark, plate, pound, pump, split, stretch, tie the other.",
        "AMIN is marginal it N is not totiowed by a right adjUnct of N: ?I painted red the house.",
        "I painted red the house which you saw last.Tuesday.",
        "OBJLIST; (ASOBJBE): The object string ASOBJ'BE must be distinguished from the adjunct sequence as + NSTGO.",
        "The two may be distinguished by the fact that the as of the ASOBJBE string is paraphrasable as 'in the capacity or character of', e.g., They served as messengers.",
        "in the capacity ot messengers whereas the as of the adjunct sequence is paraphrasable as 'when' or 'while' e.g., They served as young men.",
        "when they were young men The two may also be distinguished by the fact that in sentences containing the ASOBJBE string, the primary stress of the sentence falls on the head noun of the noun phrase functioning as the OBJBE, e.g., Enzymes function as catalysts.",
        ",g Enzymes function as catalysts.",
        "whereas, in sentences containing the adjunct sequence, the primary sentence stress falls on the verb, e.g., John changed as a lieutenant.",
        ")7f John changed as a lieutenant.",
        "Note 1: a large number of verbs occur with both the object string and the adjunct, e.g., serve (above).",
        "Frame: N tV as N Examples: They served as messengers.",
        "Enzymes function as catalysts.",
        "He can act aA bartender.",
        "This idea-exiginated as a vague possibility.",
        "That invention began as a joke.",
        "John applied as a mechanic.",
        "He will continue as a private.",
        "He ran as a sprinter.",
        "The reaction occurred as an after-effect.",
        "The fact exists as an anomaly.",
        "NOTOBJLIST: (ASOBJBE): John changed as a lieutenant.",
        "John ale well as a young man.",
        "I didn't go to school as a child.",
        "Ile lived in England as a schoolboy.",
        "They served (the king) as mesSengers.",
        "Cf. NASOBJBE.",
        "WORD LIST: appear, apply, arise, begin, Continue, enter, exist, fail, function, go, occur, originate, participate, remain, train.",
        "I assume you will arrive on time.",
        "They feel they are being abused.",
        "He believes the earth is flat.. She discovered he was an excellent cook.",
        "We said we knew a better solution.",
        "It seems he is happier aNNay from home.",
        "Applies to strings in which the adverb preposition (or particle), DP, cannot be analyzed as an adverbial adjunct, e.g.: They lined up.",
        "They lined.",
        "Or; if the verb also occurs without a DP or other object, then it occurs in a different sense than with the DP, as is often indicated by a difference in subject selection: John carried on.",
        "A John carried.",
        "The point carried.",
        "Some of the constructions classified as OBJLIST: (DPI) are the result of 'middling', i.e., they are related to a class of V N DP constructiOns: They blew the house up.",
        "The house blew up.",
        "The particular DP must be specified for each verb.",
        "lie went down to Washington.",
        "Be walked around to the bus station.",
        "Ile sped on past the exit.",
        "hand (around, back, down, in, on, out, over), lead an), leave (in, out), level down, off, out), line (up,), live (down), look (over, up), make (out, over, up), mark (down, off, up), move (in, out), paper (over), point (off, out, up), pump (in, off, out, up), read (over), reason (out), regain (back), rule (out), save (up), show (in, off, out, up), sleep (off), slice (off), Slow (down, up), smooth (away, back, down, off, out), space (out), split (away, off, up), stop (up), store (up) , strip Off), switch (off, on), take (off, out, up), think (out, over), try (on, out)., turn (dawn, off, on, over), use (up), warm (up), wash (away, down, off), weigh (down), work (off, out, over), write (down, in, off, out, up).",
        "OBJLIST: (DP2PN),_(DP3PN), (DP4PN): ,applies to strings in which the adverb preposition, Or particle), DP, cannot be analyzed as an adverbial adjunct; i.e., mix up the last name with the first / mix the last name with the first + up.",
        "As the object of Ving in certain strings 'where Vino usually is followed by of N there is an object form of the DPN PN string where the of occurs between DP and NPN (the splitting up of the project into three _parts).",
        "This form is DP4PN.",
        "applies to small subclasses of verbs which occur with particular adverb subclasses.",
        "E.g., act, do, mean, behave, require an 'evaluative adverb (lie behaves badly but he means well.",
        "$ He behaves but he means); other verbs require an adverb of motion (He glanced up, He glanced about, $ He glanced); still others require a locative adverb (1-le resides here).",
        "The verbs which require a locative adverb also occur with other locative strings He resides on Prince St.",
        "He resides where he pleases.",
        "although a sot of locative object strings is not in the present grammar.",
        "Frame: N tV D Examples: He meant well $ Ile meant.",
        "He did poorly.",
        "$ Be did.",
        "He resides here: $ Ile resides.",
        "WORD LIST: compare, do, handle, head, lie, place, range, rate, tunnel.",
        "OBJLIST: (FORTOVO): The computational treatment of forms like It remains for us to make.the firial deciaion is to define a small subclass, VSENT4 (=appear, happen, remain, seem, turn out which can take OBJLIST: (FORTOVO) where applicable, provided the subject of the VSENT4 is the expletive it.",
        "Note: To distinguish between FORTOVO and the object for N + to V (OBJ) where to V ._ (OBJ) is an adjunct (He is looking for an assistant to aid him in his work), use there as the subject of the FORTOVO: He plans for there to be five people on the committee.",
        "I asked for there to be a proctor at the exam.",
        "Frame: N tV for N to V (OBJ) Examples: I prefer for him to go to college.",
        "It remaips for us to make the final decision.",
        "I plan for him to do it.",
        "I asked for there to be a proctor at the exam.",
        "He is longing for her to ask him.",
        "She moved for the meeting to adjourn.",
        "WORD LIST: appeal, arrange, ask, cry, demand, fight, hope, intend, like, long, mean, motion, pay, plan, prefer, press, provide, remain, wait, wish.",
        "OBJLIST: NA: Verbs which occur with the object string NA each occur with a limited set of adjectives in the adjective position in NA: He painted the house red.",
        "$ He painted the house strange.",
        "This selectional dependency between the verb and the adjective distinguishes the verbs which occur with NA, such as paint, from sentence-container verbs, such as think, consider, l.1..11e, etc.",
        "(classified as OBJLIST: SOBJBE) , which exhibit.no selectional dependencies between the verb and the adjective: I consider the house red.",
        "I consider the house strange.",
        "Verbs which occur with the object string NA also differ from verbs which occur with the sequence NSTGO adjectival adjunct (e.g., She ate the apple green) These two sequences differ in that the noun and adjective of NA permute while the noun and adjective of NSTGO + adjunct do not: He painted red the house on the corner.",
        "He ate green the apple on the table.",
        "Some verbs which occur with NA require an NA object, i.e., they do not also occur with a N object: The blow knocked him senseless.",
        "$ The blow knocked him.",
        "Some border on the idiomatic: Strike him dumb.",
        "Pump it dry.",
        "Frame: N tV N ADJ N tVN Examples: He painted the house red.",
        "He bound the ropes tight.",
        "She made the rattling windows secure.",
        "He marked the package \"fragile\".",
        "Don't pump your sources dry.",
        "we split the package open.",
        "where N3 is a predicate of or refers to N1.. For example, in They served the king as messengers, messengers is predicated of they.",
        "This distinguishes sentences occurring with the object string NASOBJBE from those occurring with the object string SASOBJBE, in which 1\\11 is a predicate of N2 (They treated him as a lackey).",
        "The object string NASOBJ13E must also be distinguished from the sequence N + as + N, where as + N is a sentence adjunct.",
        "These two may be distinguished by the fact that the as of NASOBJBE is 4 paraphrasable as 'in the capacity or character of', e.g.",
        "They served the king as messengers.",
        "in the capacity of messengers whereas the Is of the sequence N + as N is paraphrasable as 'when' or 'while', e.g., 36 Frame: N1 tV N2 as N3 N. is a p.redicate of Ni Examples: They served the king as messengers.",
        "He entered the army as a private.",
        "She interpreted it as a linguist.",
        "He ran the race as a sprinter.",
        "NOTOBJLIST: (NASOBJBE):",
        "They treated him as a lackey.",
        "(SASOBJBE) We will consider John as our preferred candidate.",
        "He established it as a fact.",
        "They served the king as young men.",
        "(adjunct) He discovered the enzyme as a student.",
        "(\") (\") They served the king as young men.",
        "= when they were young men.",
        "Cf. OBJLIST: (ASC)13JBE).",
        "Note: a number of verbs occur with both the object string and the adjunct sequence, e.g., serve (above).",
        "WORD, LIST: begin, continue, enter, interpret, run, serve.",
        "OBJLIST: (ND): applies to strings in which the adverb (D) cannot be analyzed as an adjunct, e.g.: He put it there.",
        "$ He put it.",
        "Or, if the verb also occurs with a noun object alone, it occurs in a different sense than with the N F D: Frame: N tV N[) Examples: They treat thorn well/badly.",
        "Be put it there.",
        "Be bore the news \\Veil.",
        "She set it down.",
        "He waved them by.",
        "She wears her age well.",
        "They treated them.",
        "They treated them well.",
        "There is a selectional dependency between the verb and the adverb such that veYbs specified as OBJLIST: (ND) can occur only with either locative adverbs and adverbs of motion (here, there, nearby, up, down) or with 1evaluat1veraaver577M1, badly, poorly) ( WPOS1 AI) : He put it there.",
        "$ He put it about.",
        "He bore the news well.",
        "$ He bore the news there.",
        "The particular adverb subclass (whether DLOC1 or DLOC3or DEVAL) \\\\ ith which dach verb occurs is not at present checked by the grammar.",
        "WORD LIST: bear, put set, treat, wave, wear.",
        "OBJLIST: (NN): In sentences occurring with OBJLIST: (NN) either the verb is (rive in its modal use (He gave the door a kick) or IN (the indirect object) is NHUM.A.N or AGGREGATE: I gave him a book.",
        "He bought his family presehts.",
        "(WPOS22).",
        "A majority of-the verbs classified as OBJLIST: (NN) enter into the transformation",
        "They allowed the patient a cigar.",
        "It cost him five dollars, N tV N2 P N1 e. N tV NI N2He gave the door a kick.",
        "where NI NHUMAN or AGGR EGAT F Others occur with idiomatic extensions of the transformation: I showed him a good time.",
        "or with quantity expressions of the NQN type: It cost him five dollars.",
        "WORD LIST: allow, ask, bring, cause, charge, choose, deal, deny, design, do, draw, find, gain, give, hand, leave, make, not, order, prepare, read, save, show, take, tell, will, Write.",
        "Frame: N tV N P N particular P for each tV Examples:Mass accio.",
        "They attributed the painting to I fed his lunch to him.",
        "I entered him into school.",
        "I continued him in school.",
        "I directed my attention to the blackboard.",
        "I brought a gift to John.",
        "One can transform X into Y. I emptied the water into the sink.",
        "He concerned himself with the issue.",
        "I incorporated your suggestion into thepaper.",
        "I applied my solution to our problem.",
        "I connected the plug to the outlet.",
        "I.dipped_ my donut into my coffee.",
        "I divided the pie into five parts.",
        "lie fastened the chain to the door.",
        "OBJLIST: (NPN): There are at least several types of verbs which occur with the object string NPN: 1) Those which require the complete NPN object: They attributed the painting to Massaccio.",
        "$ They attributed the painting.",
        "I referred him to the librarian.",
        "$1 referred him.",
        "2) Those for which the PN is droppable They liberated the city from the enemy.",
        "They liberated tile city.",
        "but which exhibit a strong selectional dependency between the verb and the preposition: $ They liberated the city to the enemy.",
        "I filled it with water.",
        "$ I filled it around the edge.",
        "I bought a gift for Mary.",
        "$ I bought a gift to Mary.",
        "This dependency helps to distinguish the object string NPN from the sequence noun object plus P N adjunct (e.g., They liberated the city on Sunday).",
        "IVIarvy verbs can occur with either the NPN object string and the noun object plus P N adjunct, where the preposition is the same in both cases: They liberated the city from the enemy.",
        "(NPN) They liberated the city from motives of political advantage.",
        "(N PNadjunct) The particular P must be specified for each verb.",
        "WORD LIST: accelerate (to), attraot(to), add (to), apply (to), ask (into, to), associate (with), attribute (to) , balance (against, on) , beat (into, to) , bring (into, to) , catat3, se (into) , charge (to) clear fof), combine (with), correlate (with), demonstrate (to), deprive (of), direct (against, at, to, toward), enter (in), expel (from), give (to), idfentify (with.",
        "), limit (to), make (of), obtain (from), pattern (after), present (to, with), slice (Prom, oft), subject (to), take (from, to), turn (against, from, into., on, to), view (with).",
        "OBJLIST: (NPSNWII): The particular Prep must be specified for each verb.",
        "The, P is restricted in terms of the container verb, not in terms of the contained SNWH.",
        "This is evidenced by the fact that the, P of NPSNWH does not permute to the end of the SNWH string, e.g. John asked me about what he should do.",
        "$ John asked me what he should do about.",
        "Cf. OBJLIST: SNWIL Note: Avoid use of what S as the SNWH in the test frame since what S may be the replacement of a given N2 in NIPN2, e.g.: I covered it with what you gave me.",
        "Frame: SUBJ tV IT P SNWII Examples: I asked him about whether my passport would be stamped.",
        "lie interested her in what he was planning to do.",
        "In the object string NPVINGSTG, the left adjunct of Ving (specified in the frame as N3's) is either an overt subject - - I told him about Mary's leaving.",
        "-- ail article I told him about the singing of the.",
        "anthem.",
        "-- or null I told hin,1 about writing puograms.",
        "However, a verb classified as occurring with the object string NPVINGSTG must be capable of occurring with a sequence N P Vingstg in which the Ving has an overt subject and n which this overt subject is not Frame: N1 tV N2 P N's Ving (OBJ).",
        "Examples: I asked him about their offering him more money.",
        "I told him about Mary's leaving.",
        "She asked him about writing programs.",
        "coreferential with' either the subject (N1) or the noun object (N2) of the tV.",
        "Note that VINGSTG here refers to either the object string NSVINGO or the object string VINGOFN.",
        "He told me whether they were coming.",
        "They wrote him who was coming.",
        "I asked him why he did it.",
        "taught him how to do it.",
        "WORD LIST: ask, teach, tell, write.",
        "OBJLIST: (NSTGO): v6rbs classified as occurring with the object string NSTGO include",
        "1) the pure transitives (He accomplished his mission) including those which drop the N object (He reads books; He reads).",
        "2) verbs which occur with,an NPN object where the PN is droppable (He fastened the chain to the door; He fastened the chain).",
        "(Dropping of PN is not an automatic process of the grammar).",
        "3) verbs which require either a conjoined.",
        "or plural object (He equated A and B; He correlated the two sets of values) or a collective noun object It gathers dust).",
        "4) verbs which require reflexive objects: (He absented himself).",
        "5) measure verbs (The line meastires two inches; It costs five dollars).",
        "Note: due to their relatively infrequent occurrence with noun objects, verbs which N tV Examples: He analyzed the compound.",
        "John met Mary.",
        "He amassed a fortune.",
        "He equated A and B.",
        "This key opens the door They per lured themselves It costs five dollars: lie fastened the chain.",
        "occur only with special noun objects (usually nominal transforms of the verb of the sentence: He slept a good sleep) are classified as OBJLIST: (NULLOBJ) only.",
        "WORD LIST: ask, believe, combine, divide, eat, face,, fish, group, like, mean, number, order, part, place, prefer, provide, question, run, relax, require, say, skin, substitute, suppose, take, tell, try, underestimate, vary, want, work, write.",
        "OBJBIST: (NSVING0): The Ving in the object string NSVINGO may occur with either an overt or a zeroed subject: She favors doing it.",
        "She favors their doing it.",
        "The subject of Ving need not be the same as the subject of the container sentence; e.g., in John described his studying.",
        "John or, alternatively, his some other person.",
        "Cf. VINGO.",
        ",Since NSVINGO is more sentence like in its form than the VINGOFN string it is helpful to include in the test frame for NSWNGO features which are characteristic of sentences, e.g.: 1) an object after Ving: We discussed writing novels.",
        "2) an adverb after the object: She prefers doing it quickly.",
        "3) a negative element before the ying: She favors not doing it.",
        "Note: to avoid possible confusion, do not use in the test frame for OBJLIST: (NSVING0).",
        "a Ving which can function as a noun modifier (see VVERYVING).",
        "I.e., you don't want He needs designing women classified as a case of NSVINGO.",
        "N tV (N's) Ving (OBJ) Examples: He desdribed (Ms) studying at night.",
        "He decided to accelerate their advertising.",
        "The group discussed writing novels.",
        "In their program of exercise, they include climbing a mountain.",
        "The nurse has limited (her) seeing visitors so frequently.",
        "He mentioned (his) seeing Mary.",
        "They opposed (their) adjourning early.",
        "She prefers doing it her way.",
        "They proposed sending another letter.",
        "He questioned having to arrive at 8 P.M.",
        "The doctor has restricted his seeing visitors.",
        "He suggested swimming more slowly.",
        "I understand his wanting to leave so early.",
        "WORD LIST: abolish, accelerate, allow, choose, complicate, describe, determine, discuss, evidence, facilitate, include, infer, limit, mean, mention, notice, oppose, prefer, prevent, propose, question, restrict, suggest.",
        "OBJLIST: (NTHATS): The noun object of tV is NIIU1VIAN (WSW.",
        "Note: a verb which takes a sentence string as its subject.",
        "(That no one wants to come troubles her) may appear to take the sentence string in its object when the subject is tite expletive it It troubles her that no one \\\\Ants to come); but these are not considered to be object strings or parts of object strings.",
        "The one exception is the closed class VSENT4.",
        "Frame: N tV OBJ (that) SN Examples: I told you that he came.",
        "I taught him that honesty is the best policy.",
        "WORD LIST: advi-se, caution, content, convince, interest, promise, satisfy, show, teach, tell, trouble, write.",
        "OBJLIST: (NTOBE): verbs classified as OBJLIST: (NTOBE) can occur with the [(Mowing object strings: N to be OBJBE N to have N N to have Ven e.g.: They discovered him to be in error.",
        "We consider Dr Smith to have the best solution.",
        "John was found to have left early.",
        "Verbs classified as occurring with the object string NTOBE cannot occur with an NTOVO object string: $ They discovered him to cross the street.",
        "BoWeyer, when tV occurs in the passive, any verb is allowed in the infinitive: John was found to frequent houses of ill repute.",
        "vs. $ They found John to frequent houses of ill repute.",
        "The to of OBJLIST: (NTOBE) does not equal in order to; i.e., sequences such as They introduced this plan to be controversial ( They introduced this plan in order to be controversial) should not be considered as cases of OBJLIST: (NTOBE).",
        "Frame: N t\\' N, to be OBJ (not: N tV N to V(/ be, have) OM, Examples; They showed him to be a fool.",
        "They shoed him to cross the street.",
        "We found him to be an excellent companion.",
        ".$ We found him to eat hamburgers.",
        "We noticed this to be the case.",
        "They demonstrated the solution to be correct.",
        "They shoed us to be in error.",
        "We consider Dr. Smith to have the best solution.",
        "NOT OBJLIST: (NTOBE): They allow him to be impolite.",
        "(cf. NTOVO) They asked him to be quiet.",
        "(cf. NTOVO)",
        "If N, is a pronoun, it is accusative (WPOS5).",
        "WOIlll LIST: assume, believe, claim, confirm, consider, demonstrate, determine, discover, establish, feel, find, know, observe, note, notice, report, show, suppose, think.",
        "OBJLIST: (Nrr\\OVO):.",
        "The V of the object string NTOVO includes be and Ilave but also other V: They expected him to go home.",
        "They expected him to be on time.",
        "They expected him to have the best solution.",
        "ORTLIST: KTonD).",
        "The to of OBJLIST: (NTOV0) does not equal in order to.",
        "i.e., sequences such as Ile drinks milk to keep thinIle drinks milk in order to keep thin) should not be consideced as cases of OBJLIST: (NTOVO) Note: do not classify verbs which occur with the expletive it as subject (It contents him :to know that she is here) as NTOVO (see ORTT .1 ST: (NTIIATS)) If N. is a pronoun, it is accusative (WPOS5).",
        "Prame; N tV N to V (OBJ) Examples.",
        ": They allowed him to go.",
        "I asked him to do it veste.rclay.",
        "They conditioned them to beg for food like him to Come home early.",
        "I told him to do it over.",
        "They forced him to sign.",
        "They are requiring out to show your WORD LIST: advise, allow ask; taus e, caution, challenge, choose, condition, convince, designate, detail, employ, engage, expect, forbid , force, induce, influence, intend, like, mean, motion, motivate, order, pay, permit, prefer, pr epare, pr('ss, pressure, require, stimulate, suffer, teach, tell, trouble, trust, want, write.",
        "ORTLIST: (NULLOBJ) verbs classified as Occurring with the object string N1'LL011J\\iticludt,.).",
        ".1) verbs which do not allo occur with N or TIN or other object strings iappear vegetate, ache).",
        "2) v(1-bs which can occur with special N objects (Ile slept ) (s ee (.",
        "(NSTG( )) note). )",
        "normally transitive verbs which.",
        "may occur without their N objects (lle reads; Ile reads books).",
        "a VCoLLECTIVE if it occurs with a non-singular or collective subject (1)ust gathers).",
        "Prame: N t V. Examples: The lx)of: has disappeared.",
        "Ile slept Ile ate.",
        "Knowledge .accumulates.",
        "Ile acted John came.",
        "5) verLs with droppable PN or adverb objects: He worked on the problem.",
        "Ile worked.",
        "He walked by, Ile walked.",
        "WORD LIST: accelerate, act, age, appear, care, change, come, compete, compound, continue, decrease, demonstrate, diMinish, draw, eat, enter, exist, fail, fish, follow, go, happen, homogenize, low, last, lengthen, live, look, matter, move, occur, point, provide, publish, ran, read, relax, remain, rest, result, return, ring, see, sleep, start study, sweat, take, think, try, wondei work, write.",
        "OBJLIST: (NULLR ECIP) : a verb is classified as occurring with the object string NULLRECIP if, Mien it occurs with no overt object and with a noun subject which is not singular (i.e., is A.GGREGATE, PLURAL, or conjoined) it would be natural to reconstruct the object each other or P each other (on at least one reading); e.g.: The couple fought (xxith each other), (with me).",
        "The parties conferred (with each other).",
        "John and Mary agree (with each other), (to your plan) John met John fought with each other.",
        "Frame: Ni and N2 tV (P) each other.",
        "Examples: John and Mary met each other at school.",
        "X and Y differ (from each-other) as to structure.",
        "Your claim and my claim cgaitiict (with each (other) .",
        "Bill and Bob fought ith each other).",
        "The groups separ.ated (from each other).",
        "The lines parallel each other WORD LIST: agree, argue, associate, combine, confer, conflict, correlate, differ, link, meet, part, parallel, separate.",
        "OBJLIST: /OBJBE): In the object strong OBJBE, the OBJBE is the predicate of NI.",
        "The machine grammar allows four possible values for OBJBE: 1) NSTG (nemn string) John appeared an idiot.",
        "He seemed a happy man.",
        "The restriction on number agreement between subject and, object (WAGREE2) applies here.",
        "Note: if the sequences N:SINGULAR tV N:PLURAL and/or N:P.LURAL tV N: SINGULAR occur, the tV is not classified as Frame:",
        "OBJBE noun, adjective, adverb, P N Examples: John acted strange.",
        "They appear happy to be here.",
        "He became ecstatic when I told him.",
        "They feel able to assume the responsibility.",
        "OBJLIST: (OBJBO 2) ASTG (adjective string), including adjectival Vens and Vings (see VENDADJ and VVERYVING): They look happy to be here.",
        "We felt satisfied.",
        "The results might seem surprising.",
        "Note: vevbs which occur with only a limited set of adjectives (ring ?rue, blush red, etc.)",
        "are classified as OBJLIST: (ASTG), not OpJLIST: (OBJBE).",
        "3) DSTG (adverb string): I feel down.",
        "He seems down and out.",
        "They looked well.",
        "A restriction limiting adverbs to those which occur after be (WPOS1II) applies here.",
        "Note: verbs which occur with a wider range of adverbs, i.e. which occur with adverbs of Motion, manner, etc., are not classified as occurring with the object string OBJBE: (DSTG), e.g.",
        "He came bere,E2, down, quickly, qtc."
      ]
    },
    {
      "heading": "4) P N:",
      "text": [
        "This appears of great significance.",
        "The matter seems in dispute.",
        "Note: Verbs classified as occurring with OBJBE: PN, as opposed to those classified as occurring with 131,1\", can occur vvith a range of P NSENTP (to his advantage, of value, of interest, of significance) constructions.",
        "Therefore, verbs which can occur with this range of constructions should be classified as OBJBE: (PM), although other PN constructions are also possible here.",
        "She looks capable.",
        "Whether they will come remains unclear.",
        "She seems right for the job.",
        "The eggs smell bad.",
        "John appeared an idiot.",
        "Ile became president a year ago.",
        "She remains a strong woman.",
        "He seemed a happy man.",
        "John appeared down and out.",
        "Bill felt apart from the rest of us.",
        "They looked well.",
        "They seem well.",
        "The matter appears in dIspute It will remain to his advantage to see them.",
        "The cake smells of anisette.",
        "WORD LIST: ASTG: act, appear, become, feel, look, remain, seem; DSTG: appear, feel, look, seem; NSTG: appear, become, remain, seem; PN: appear, remain, seem.",
        "OBJLIST: (OBJECTBE): applies only 'to the verb be in all its forms (am, are, be, been, being, is, w, The sequences which are treated as objects of be include: 1) Ving (OBJ) (He is looking into the matter).",
        "This is the same string as the object string VINGO.",
        "As object of be, the string represents a treatment of theprogressive tense; it is therefore restricted so as to exclude non-wellformed verbal sequences: He is having gone.",
        "$ She was being going, etc.",
        "2) passive Ven + (OBJ) (War was never dealared).",
        "Because of the frequent occurrence of the passive construction in scientific writing, it is more economical to list the passive objects for each verb in the word dictionary than to compute them by a rule of passive omission.",
        "The correspondences between active and passive objects used in the preparatiOn of dictionary entries is given in PO13JLIST below.",
        "3) OBJBE, i.e., a noun.",
        "adjective, adverb or PN string (cf. OBJLIST: (OBJBE):",
        "Ele is a carpenter.",
        "He is happy.",
        "He is here.",
        "The matter is in dispute."
      ]
    },
    {
      "heading": "4) SN (an embedded sentence):",
      "text": [
        "The trouble is that no one knew.",
        "To ask the question is to answer it.",
        "It is not that there was nothing to do.",
        "5) Ving strings (see OBJLIST: (NSVINGO) and OBJLIST: (VINGOPN)): An added burden is filling out innumerable forms.",
        "(3) TOVO (John is to start Monday).",
        "7) ASSERTION (The trouble is John wants to Ko).",
        "8) BEING (John is being a fool).",
        "9) liMBEDDEDQ (The question is: why, did John go ?)",
        "Frame: N tV P N OBJLIST: (PN): verbs which occur with OBJLISY: (PN) exhibit a strong selectional dependency with the preposition: He depends on Mary, $ He depends with Mary.",
        "It matters to me.",
        "$ It matters with me.",
        "and, for the most part, do not also occur (with the sam6 meaning) with a zeroed object: You can rely on John.",
        "$ You can rely.",
        "He stands for justice.",
        "He stands.",
        "Verbs which occur with the object string NPN from which the leftmost N can be dropped (He _gives (money) to charity) are also included here.",
        "In the case of some verbs, a middle form of the verb takes both NPN and PN objects: One can transform X into Y. X transforms into Y.",
        "The particular preposition (s) must be specified for each verb (WPOS15).",
        "Examples: I looked at him.",
        "It consists of protein.",
        "He happened across a new solution.",
        "He accounts for the exceptions.",
        "This adds to our problems.",
        "He ran tor president.",
        "lie is referring to the latest debate.",
        "The pie divided into five parts.",
        "includes those verbs which occur with how S but not with SNWH, e.g.: lie liked how it was done.",
        "$ He liked whether it was done..",
        "Many of these verbs also occur with PN how S which is included M this string.",
        "Frame: N tV (PN) how S (and not N tV,wnether S) Examples: This will complicate bow it is to be done.",
        "They demonstrated (to us) how the situation was handled.",
        "Ibr these verbs the particular preposition(s) must be specified (WPOS15).",
        "NOT OBJLIST: PNHOWS): This concerns [how whether] 1 we are to ascape.",
        "Since PNN is a permutation of NPN, any verb specified for one must be specified for the other.",
        "PNN, however, usually occurs only witen N. - N RN: ?Mary gave to John the book.",
        "Mary gave to John the book which he needed for his exams.",
        "The particular preposition(s) must be specified for each verb (WPOS15) Frame: Ni jtV P N2 N3 tV NI P N2 Examples: He crave to her the book which he himself needed.",
        "They attribute to Massaccio the introduction of perspective into meu.,_,val art.",
        "They correlated with speech variatidn several factors which are usually considered sociolog/cal.",
        "They have depleted of its riches the soil which we cared for so lovingly.",
        "Dictionary Entry: ATTRIBUTE.",
        "TV: (OBJLIST: .3 = NPN:PNN: .17,. .",
        ".",
        ".",
        ".17PVAL: (1 TO4).",
        "WORD LIST: see OBJLIST: (NPN).",
        "OBJLIST: (PNSNWID: The noun of PN is NEWMAN (WS1'8).",
        "The P is from, to or of.",
        "Verbs which can occur only with PN how S and not with the full range of SNWII strings-He described to me how to go.",
        "He described.to me whether to go.",
        "--are classified as OBJLIST: (PNIIOWS) and not as OBJLIST: (PNSNWII)..",
        "Note: avoid use of what S as the SNWII in the test frame since what S may be the replacement of a given N2 in P NI N2 _fe.g.",
        "I will give to him what he needs).",
        "Note: do not classify verbs which occur with the expletive it as subject (It matters to me whether he comes) as PNSNWII (see OBJLIST: (NTHATS)).",
        "The particular preposition(s) must be specified for each verb (WPOS15).",
        "Frame: N tV P N SNWII Examples: They inquired of him whether he was coming.",
        "It matters to me whether he comes.",
        "Ile didn't mention to me whether he was interested.",
        "WORD LIST: admit (tclr, communicate (to), conceal (from), explain (to), hint (to), indicate (to), learn (from), mention (to), prove (to), relate (to), say (to), write (to).",
        "OBJLIST: (PNTHATS): The noun of PN is N-HUMAN (WSW.",
        "The P is from, to or of.",
        "The computational treatment of forms like It appeared to John that Mary was here is to define a small subclass, VSENT4 (- pear, happen, remain, seem, turn out) which can take the object string PNTHATS, where appropriate, provided the subject is it.",
        "Note: do not classify verbs which occur with the expletive it as subject and which also occur with a sentence string as subject (It occurred to John that he was needed.",
        "That he was rieeded occurred to John) as PNTHATS.",
        "(see OBJLIST: (NTHATS)).",
        "PN can be accompanied by an adjunct, in Which case the subject of SN is usually a pronoun: They reported to him (about his leaving) that it had not been voluntary.",
        "The particular preposition (s) must be specified for each verb (WPOS15) Frame: N t\\' P N SN Examples: I learned from John that the matter was under discussion.",
        "I demonstrated to them that the hypothesis accounted for several dispararate facts.",
        "It appeared to him that Mary was here.",
        "Dictionary Entry,:",
        "WORD LIST: admit (to), announce (to), assert.",
        "(to), cry (to), communicate (to), demonstrate (14)), disclose (to), explain (to), hint (to), illustrate (to), indicate (to), intimate am, learn (from), mention (to), motion (to), occur (to), prove (to), remark (to), require (of), reveal (to), say (to), seem (to), suggest (to), write (to).",
        "OBJLIST: (PNTHATSVO): the verb of the embedded sentence is not tensed.",
        "(cf. OBJLIST: (Cl SIIOULD)).",
        "Verbs which satisfy the frame occur with should V as well as,with V. The noun of PN is NIIUMAN (WSW.",
        "The particular prepositron(s) must he specified for each verb (WPOS15).",
        "Usually, however, the acceptability of the PNVINGSTG permutation depends on the presence of one or more adjuncts within the VINGSTG: ?He prefers to going out with Mary staying home.",
        "He prefers to going out with Mary staying home with someone else.",
        "The particular preposition (s) must be specified for each verb (WPOS15).",
        "Frame:",
        "Examples: They liMited.to certain hours his seeing visitors They .reported to the nurse his seeing visitors.",
        "They attributed to his wife's business acumen his succeeding where everyone else had failed.",
        "lie charged to a heavy workload his going home late.",
        "OBJLIST: (PSNWID: The P of the object string PSNWII is restricted in terms of the container verb, not in terms of the contained SNWII.",
        "This is evidenced by the fact that the P of PSNIVII does not permute around the SNWII (Cf. OBJLIST: (SNWID): John asked about whether he should go.",
        "'A.John asked whether he should go about.",
        "Note: avoid use of what S as the SNIVIi in the test frame since what S may be the replacement of a given N in PN (e.g., John landed on what he had been looking for).",
        "The particular preposition (s) must be specified for each verb (WPOS15).",
        "Frame: N tV P SNWII Examples: I asked about whether he would come.",
        "I inquired into whether he would come.",
        "They pondered over whether he would come.",
        "John.",
        "wondered about why she did it.",
        "Dictionary Ditry: ASK.",
        "TV: (OBJLIST: .3, .3PSNWII:.",
        ".",
        ".",
        ".",
        ".13 PVAL: (4 A BOUT ) WORD LIST: ask kabout), care (about), check (on, into), depend .",
        "(on), figure (out), hear (about), hint (at), knew (zibout), look (into), pertain (to), read (about), refer (to), reflect (on, upon), remark (on, about), report (on) speak (about), talk (about), tell (about), think (of.",
        "about), touch (on, upon), wonder (about), write (about).",
        "OBJLIST: (PSVING0): As distinct from the object string PVINGSTG,, the NPSVINGO is not possessive; however, the two object strings overlap extensively: rhisi.",
        "They worried over I .",
        "i drinking Lhnn-so much.",
        "If N2 is a pronoun, it is accusative (WPOS5).",
        "Note: to avoid confusion of the object string PSVINGO with the sequence PN plus a right adjunct Ving (He looked at the door opening on to the balcony), use the expletive there as the.",
        "N2: Frame:",
        "Examples: They worried over him drinking so much.",
        "He focused on the president flying to Florida in a private plane.",
        "We asked about there being no food.",
        "He writes about John's absence disturbing Mary.",
        "Dictionary Entry: We asked about there being no food.FOCUS.",
        "The particular preposition(s) must beTV: (OBJLIST: .3 , specified.",
        "for each verb (WPOS15)..3PSVINGO: .4 8 , .",
        ".",
        ".",
        ".",
        ".18PVAL: (4 ON4 ) .",
        "WORD LIST: account (for), amount (to),answer (for), approve (of), argue (about), ask (about) began (with), center (on, about, around, upon), come (to, of, from), care (about, for), compare (to, with), depend (on, upon), end (in, with), explain (about), focus (on), hear (or, about), lie (about), plan 'on), point (to), read (about), remark (on, about).",
        "remember (about), speak (of, about), thlk (of, about) , think (about), wonder (about), write (about)..",
        "In the object sfring PVINGSTG the left adjunct of Vino.",
        "(specified in the frame as N2's) is either an overt subject-He asked about their writing programs.",
        "--an article-He asked about the writing of programs or null-lie asked about writing programs.",
        "However, a verb classified as occurring with the object string PVINGSTG must be capable of occurring uith a sequence P Vingstg in which the Ving has an overt subject and in which this overt subject is not coreferential with the subject of the tV.",
        "Frame: N1 tV P N2ts Ving (OBJ) Examples: Mary couldn't account for (John's) losing the key.",
        "Mary couldn't account for the losing of the key.",
        "This amounts to (his) writing a new program.",
        "This mounts to the writing of a new program.",
        "They asked about.",
        "(his) leaving early.",
        "They asked about John's reading of the passage.",
        "The results will affect whether or not we will continue.",
        "Faked whether I should go.",
        "I don't care who you got it from.",
        "This statement concerns why he chose to leave.",
        "She is trying to discover whether he killed the woman.",
        "They are discussing whether to leave.",
        "I doubt if he can do it.",
        "We cannot establish how this process works.",
        "WORD LIST: affect, ascertain, ask, calculate, check, contemplate, choose, concern, consider.",
        "control, decide, deduce, denote.",
        "discern, discuss, doubt, establish, examine.",
        "hear, indicate, influence, investigate, judge, know , learn, matter, measure, mention, mind, nate, observe, predict, Drove, question, remember, report, reveal, say, s ee, show, qtate, tell, verify, worder, 1\\ rite.",
        "OBJLIST: (SOBJBE): In the object string SOBJBE the OBJBE is the predicate of N2.",
        "The machine grammar allows four possible values for OBJBE: 1) NSTG (noun string) They considered him their savior.",
        "They elected him president.",
        "They call him a genius.",
        "The restrictions on number agreement between subject and object (WAGRU2) apply here.",
        "2) ASTG (adjective string), including adjectival Vens and Vings (see VENDADJ and VVERYVTNG; also OBJLIST: (SVEN)): Frame: N1 tV N2 OBJBE ()B.THE noun, adjective, adverb, P N Example: They consider him their savior.",
        "They termed him a genius.",
        "She thought him a good man.",
        "He conoiders them foolish.",
        "I found it well-designed.",
        "We thought him interesting.",
        "lie considers them foolish.I believe it possible.",
        "I found it well-designed.",
        "I prefer him here.",
        "We thought him interesting.",
        "3) DSTG (adverb string):I supposed it nearby.",
        "They assumed him on the premises.",
        "They mistakenly thought him here.",
        "We prefer a meeting today.They find it of slight interest.",
        "A restriction limiting adverbs to those whichThey ruled him out of order.",
        "occur after be (WPOS1H) applies 'here.",
        "I consider the matter in dispute.",
        "4) P N: We thought it to his advantage to see you.",
        "For legal purposes, they assumed him on the premises.Dictionary Eritry: They find it of slight interest.CONSIDER.",
        "The particular values of OBJBE must be specified for each verb.TV: (OBJLIST: '.2) .)",
        ".3SOBJI3E: .19, .",
        ".",
        ".",
        ".",
        ".19 BVAL: (ASTG, NSTG, PN).",
        "'WORD LIST: believe (ASTG, DSTG, NSTG, PN), consider (ASTG, NSTG, PN), find (ASTG, DSTG, NSTG, PN), judge (ASTG,NSTG), label (ASTG, NSTG, PN), prefer (ASTG, DSTG, PN), pronounce (ASTG, PN), prove (ASTG, DSTG), report (ASTG, DSTG, PN), show (ASTG), suppose (ASTG, DSTG, PN), term (ASTG, NSTG, PN), think (ASTG, DSTG, NSTG, PN).",
        "OBJLIST: (STOVO-N):Frame: The verbs classified as OBJLIST:.",
        "N1 tV [I to V. (STOVO-N) are be and have.Vingstg If the to V is deleted from an occurrence Examples:.",
        "of STOVO-N either the remaining sentence is unacceptable:He has paying his workers to consider.",
        "He has paying his workers to consider.I have some stuff to deliver.",
        "$ He has paying his workers.",
        "He has money to burn.",
        "There is not a moment to lose.",
        "$ There is not a moment.There is not a moment to lose.",
        "or the sense of the remaining sentence isThere is paying the workers to consider.",
        "changed: That is the right principle to maintain.",
        "I have a guy to see.",
        "have a guy.",
        "It is nothing to sneeze at.",
        "It is nothing.",
        "The NI or Vingstg functions as the logical object of the verb of the embedded sentence.",
        "OBJLIST: (SVEN): The object string SVEN (as in I got the papers duplicated) must be distinguished from (1) the sequence noun plus adjunct Q._ delivered the papers duplicated) and (2) the object string SOBJBE (I considered the 'house well-designed).",
        "SVEN may be distinguished from the noun.plus adjunct sequence by the fact that if the Ven is deleted from an occurrence of SVEN either the remaining sentence is unagceptable: He wishes the tapes destroyed.",
        "$ He wishes the tapes.",
        "or the sense of the main verb is changed: I got the papers duplicated.",
        "I got the papers.",
        "whereas if the Ven is deleted from the noun plus adjunct sequence the remaining sentence is acceptable and the sense of the verb remains the same: I delivered the papers duplicated.",
        "I delivered the papers.",
        "SVEN may be distinguined from SOBJBE by the fact that the Ven of SVEN is a true passive, whereas the Ve-n of SOBJBEis adjectival: I got the papers duplicated.",
        "$ I got the papers beautiful.",
        "cionsider the house well-designed I consider the house beautiful.",
        "Note: In distinguishing verbs which occur with SVEN from those which occur with SOBJBE : (1) add an adverbial left adjunct (well, badly, very, etc.)",
        "to the Ven.",
        "If this addition is acceptable, the verb being tested should be classified as SOBJBE: I thought the house well-designed.",
        "I consider him very reserved.",
        "if the addition is marginal, the verb should be crassified as SVEN: ?I ordered the house well-designed.",
        "$1 got therpapers very duplicated.",
        "Frame: N1 t\\r N, N'en Examples: I got the papers duplicated.",
        "I saw him robbed.",
        "He had John punished.",
        "We want the problems eliminated The king ordered them beheaded.",
        "NOT OBJLIST: (SVEN): I delivered the papers duplicated.",
        "(N adjunct) I considered the house NA ell --desi (OBJLIST: (SO I3JB ) (2) replace the Ven with a pure adjoctive (happy, small, intelligent, etc.).",
        "Er the sentence is still acceptable, the verb being tested should he classified its SORTBE, not SVEN.",
        "S I ordered the house beautiful.",
        "considered the house beautiful.",
        "If N. is a pronoun, it is accusative (WPOS5).",
        "'WORD LIST: assume, bad, like, order, require, see, want, wish.",
        "OBJLIST: (MINGO): The object string MINGO must be distinguished from (1) the sequence noun plus adjunct and (2) the object string SOBJBE.",
        "MIN(() may be distinguished from the noun plus adjunct sequencu by the fact that if the Ving is deleted from an occurrence of SVINGO either the remaining sentence is unacceptable: I left the book lying on the table.",
        "A I left the book.",
        "Frame: N1 tV N. Ving (ORD, Examples: They kept John waiting.",
        "He has the clock \\%orking now.",
        "I left the book lying on the table.",
        "We observed their intellect and their moral sense expanding.",
        "or the sense of the main verb is changed:I've started the machine goi1.",
        "John kept Mary waiting.",
        "NOT 013JLIST: (SVING.0): PBS covered the investigations involving Note: verbs such as sketch illustrate, photx)-Watergate.",
        "graph may be ambiguous between the noun(N adjuntt).",
        "plus adjunct reading and the SVINGO reading,I consider him interesting.",
        "e.g.:(OBJLIST: NOBJBE)4.",
        "Ile photographed the girl laughing.",
        "(MING() Ile photographecl her laughing, not crying; N adjunct Ile photographed the girl who was laughing).",
        "MINGO may be distinguished from SOBJBE by the fact that the Ving of SOI3J13 is adjectival whereas the Ving of SNYTNGO is not (cf. OBJLIST: (SVEN)).",
        "Therefore, the yiag of SOMME occurs with certain adverbial left adjuncts ((pile , very, etc.",
        "): I consider him very interesting.",
        "whereas the Ving of SVINGO does not: $ They kept him very waiting.",
        "John kept Mary.",
        "If N2 is a pronoun, it is accusative (WPOS5).",
        "WORD LIST: detect, discern, display, feel, find, have, illustrate, keep, leave, mind, observe, photograph., remember, sketch, start, watch, visualize.",
        "OBJLIST: (SVO) :Frame: If N2 is a pronoun, it is accusatiVe (WPOS5).SUBJ tV N. V (0133) Note: to avoid confusion with OBJLIST: (C1SHOULD) (Sui..zest he go), use pronouns for N., in the test frame for SVO.acamples: I let him go.",
        "I made him sign a statement.",
        "I watched him do it.",
        "I had him pick up Mary at the station.",
        "WORD LIST: have, let, make, observe, see, watch.",
        "QBJLIST: 1THA.TS): The verb of the embedded sentence is tensed.",
        "Both the verbs for which the that is optional (He believes (that) the earth is flat) and those for which it is obligatory (He argues that it is impossible) must be classified as occurring with OBJLIST: (MATS).",
        "(cf. OBJLIST: (ASSERTION)).",
        "It should be noted that the computational treatment of forms like It appears that John has left is to define a small subclass, VSENT4 (=appear, happen, remain, seem, turn out), which can take OBJLIST: (THATS) where applicable, provided the subject of the VSENT4 is the expletive It.",
        "Frame: N tV that S (V of embedded S tV) Examples: He added that they were happy.",
        "He wrote that John was returning.",
        ".gree, that the matfer should be I know that he was here.",
        "We estimate that it will take five months.",
        "It appears that John has left.",
        "WORD LIST: add, agree, allow, answer, appear, argue, assume, believe, calculate, charge, claim, conclude, confirm, consider, demonstrate, deny, denote,, detect, determine, discover, doubt, establish, estimate, evidence, expect, explain, feel, figure, find, follow, happen, imply, infer, intimate, know, learn, maintain, matter, mean, mention, note, notice, observe, provide, read, reason, report, rule, say, see, seem, sense, show, state, suggest, think, understand, write.",
        "OBJLIST: (TOVO): verbs classified as occurring with the object string TOVO include the aspectUal verbs (those verbs which never occur with an overt subject in the contained sentence: John tried to go.)",
        "and those container verbs which occur with either an overt or a zeroed subject: I want Mary to go.",
        "I want to go.",
        "Note The to of OBJLIST: (TOVO) does not equal in order to; i.e., sequences such as She washed to please her mother ( She washed in order to please her mother), should not he considered as cases of OBJLIST: (TOVO)",
        "Frame: N tV to V (OBJ) Examples: lie appears to like her.",
        "Ile attempted to meet ler.",
        "He claims to lcnow *her He agreed to meet him.",
        "She expected to leave.",
        "She would like to see him.",
        "WORD LIST: affect, agree, appear, ask, attempt, choose, claim, come, continue, demand, determine, expect, fail, happen, have, learn, like, long, mean, need, prefer, prepare, propose, seem, start, tend, use, want.",
        "OBJLIST: (VEN0): The verb h.ve (has, had) is classified as OBJLIST: (VENO) for its occurrence with the past participle: John has gone.",
        "We have, been satisfied.",
        "OBJLIST: (VING0): The Ving of the object string VINGO may occur either with an overt subject-He delayed his writing for two years.",
        "-or a zeroed subject-He delayed writing for two years.",
        "In either case, the subject of .Ving is understood exclusively as referring to the subject of tV.",
        "Cf. OBT.LIST: (NSVINGO).",
        "Thus She began doing it is a case or OBJLIST: (VINGO) while She favors doing it is not.-Frame: N1 tV (N's) \\Ting (013.7) Examples: She began doing it.",
        "Ile delayed writing the book tor two years.",
        "She has continued working.",
        "They started eating at five o'clock.",
        "They stopped eating at nine.",
        "NOT OBJLIST: (\\TING()); She favors doing it.",
        "These new glasses will facilitate reading fine print.",
        "Ile explained seeing to the blind man.",
        "Simon opposes rationing gasoline.",
        "Ile proposed boycotting grapes.",
        "Tie really understands teaching.",
        "W0111) LIST: attempt, continue, delay, start, stop, try.",
        "OBJLIST: (VINGOIN: The Ving in the object string VINGOVN may occur wAth eithersa possessive noun subject-They trtrittate4 his singing of the song.",
        "--or an article-They imitated the singing of the song.",
        "Since VINGOPN is more noun-like in its form than the NSVINGO object string, it is also helpful to include those phenomena which are characteristic of noun strings in the test frame, e.g.: n an adjective before the VinK: You could not duplicate his tactful handling of the situation.",
        "2) a plural Ving form: They covered the bombings of Siagon.",
        "Frame: N's N tV It 1 (Ado Ving of OW Exam )1es: You could not duplicate his tactful handling of the situation.",
        "They imitated his singing of the song.",
        "They covered the bombing of Saigon.",
        "They have decreased the sending of supplies.",
        "They delayed the signing of the contract.",
        "These factors dotermine the stating of the conditions.",
        "Ile directed the editing of the manuscript.",
        "The full ashtrays evidence the smoking of many cigars.",
        "This will facilitate my understanding of the matter.",
        "John influenced his handling of the situation.",
        "Ile noticed the wording of the paso.sepe.",
        "They have restricted the selling of gas.",
        "WORD LIST: advance, affect, assess, block, cause, concern, consider, control, cover, decrease, denote, describe, dirt:et, discuss, expect, explain, facilitate, filM, follow, further, include, infer, influence, inhibit, investigate, limit, mention, notice, oppose, order, propose, question, report, restrict, review, study, time, vary.",
        "OBJLIST: (VINGSTGPN): As with verbs which occur with 'the object string NPN, those which occur w\\ith VINGSTGPN eithbr require the complete VINGSTGPN object: They attributed his succeeding in buSiness to his wife's business acumen.",
        "$ They attributed his succeeding in business.",
        "or exhibit a strong selectional dependency between the verb and the preposition of VINGSTGPN: He charged his going home late to a heavy workload.",
        "$ He charged his going home late for a heavy workload.",
        "This dependency helps to distinguish the object string VINGSTGPN from the sequence VINGSTG plus P N adjunct, e.g.: He described his frequent writing of letters with reluctance.",
        "He described his frequent writing of letters during his absence.",
        "He described his frequent writing of letters for money.",
        "Note that VINGSTG here refers to either the object string NSVINGO or the object string VINGOFN.",
        "The particular preposition (s) must be specified for each verb (WPOS15).",
        "Frame: tV P N2 VINGSTG N1 tV VINGSTG P N2 Examples: They attributed his succeeding in business to his wife's business acumen.",
        "Ile charged his going home late to a heavy workload.",
        "They reartes_lhis seeing visitors to the nurse.",
        "They limited his seeing visitors to certain hours.",
        "He correlated the sinking of the ships with the bad weather in Pyraeus.",
        "where OBJ is either an NSENT1, an NSENT:3, or ASENT1 (DOPT4 ultimate subject routine used in SN restri6tions): That the earth might revolve around the sun seemed an unlikely hypothesis.",
        "It seemed an unlikely hypothesis that the earth might revolvo around the sun.",
        "lbr John to solve that problem remains easy.",
        "It remains easy for John to solve that problem.",
        "Most of these verbs also occur in other environments of be, but the one defined here is the only one used in restrictions.",
        "Frame:",
        "Examples: That the earth might revolve around the sun seemed an unlikely hypothesis.",
        "It seemed an unlikely hypothesis that the earth might revolve around the sun.",
        "That John will arrive too soon appears a problem It appears a problem that John will arrive too soon.",
        "To live here becomes easier as time goes on.",
        "It becomes easier to live here as time goes on.",
        "WORD LIST: appear, become, remain, seem.",
        "VCOLLECT,IVE: a verb is in VCOLLECTIVE if it occur with a noun object which is PLURAL or conjoined, but does not occur with a noun object which is SINGULAR, unless the singular noun is NCOLLECTIVE (e.g., dust) or AGGREGATE (e .g.",
        ", grouP) (WA-G R EE3) : He collected his tools.",
        "He collected a pen, pencil and pad.",
        "The bookshelf collects dust.",
        "He collected a group around him.",
        "He collected a pen.",
        "Also a verb is in VCOLLECTIVE if, when it occurs with a null object (see 0I3JLIST: NULLOBJ), its subject is either PLURAL or conjoined or, if SINGULAR, then AGGREGATE or NCOLLECTIVE (WAGREE:3): People gathered at street corners.",
        "John, Mary and Bill gather in the Commons Room at noon.",
        "where OBJ is N or PN (NHUMAN), (PSN2, ultimate subject routine used in SN restrictions): That no one answered alarmed him.",
        "It alarmed him that no one answered.",
        "Also, if a Ving occurs in the environments It be Ving to V N. N be Ving to V. then the Ving is in VSENT1 (DSN6): It is surprising to hear such allegations.",
        "Such allegations are surprising to hear.",
        "Cf. ASENT1: (AFORTO: (OBJEXT)).",
        "67 Frames:"
      ]
    },
    {
      "heading": "SN tV OW",
      "text": [
        "It tV OBJ SN Examples: It concerned him that no one came.",
        "That no one came concerned him.",
        "It contents her that she is accepted by the family.",
        "That she is accepted by the family contents her.",
        "It disturbs him that she didn't eome.",
        "That she didn't come disturbs him..",
        "It doesn't matter to him that he failed.",
        "That he failed doesn't matter to him.",
        "It has occurred to me that this is a non problem.",
        "That this is a non-problem has occurred to me.",
        "WORD LIST: affect, antagonize, concern, confound, content, disturb, encourage, excite, interest, intrigue, matter, move, occur, shock, suit, surprise, trouble.",
        "VSENT2: A verb is in VSENT2 if its tensed form occurs in the environment SN -- SN (DOPT4, WSN1): That he lied proves that he doesn't care.",
        "$ That he lied alarmed that I'm doesn't care.For him to say that means that he understands the problem.",
        "How he did it explains why he did it.",
        "That he ran the mile in 4 minutes demonstrates that it can be done.",
        "WORD LIST: confirm, demonstrate, establish, explain, imply, indicate, mean, obscure, predict, prove, reveal, say, show.",
        "VSENT,31 a verb is in VS,ENT3 if its tensed form occurs in the environment N SN and not in the environment SN SN: He knows that we are ready.",
        "$ That time is running short knows that we are ready.",
        "The passive form of a VSENT3 can occur in the environment ItSN (WSN2, ultimate subject routine used in SN restrictions): It was blown that she left and in the environment SN (WSN1): That she left was known.",
        "Cf. VSENT1.",
        "Frame: N tV SN (where yi SN tV SN) Examples: He.knows that we are ready.",
        "We asked for the mail to be sent here.",
        "They claim that the experiment is invalid.",
        "I still maintain that this is correct.",
        "WORD LIST: add, argue, ask, believe, care, claim, conclude, consider, deny, determine, diecover, doubt, expect, find, know, learn, long, maintain, mention, note, notice, observe, propose, read, reason, report, require, rule, state, suggest, think, understand.",
        "VSENT4: a verb is in VSENT4 if it occurs in the environment It -- $N butt does not occur in the environment SN (DSNI3): It seems that he left.",
        "$ That he left seems.",
        "It appears that they don't want to come.",
        "$ That they don't want to come appears.",
        "Cf. VSENT1.",
        "Note: The computational treatment of VSENT4 requires that the particular SN strings a.e., THATS, ASSERTION, etc.)",
        "that occur with a given VSENT4 verb must be named on the OBJLIST of that verb.",
        "Cf. OBJLIST: ASSERTION, TEATS, FORTOVO, TOVO).",
        "Frame: It tV SN (where $ SN t_D Examples: It seems that he left.",
        "$ That he left seems.",
        "It appears that they don't want to come.",
        "$ That they don't want to come appears.",
        "It happens that she believes in this.",
        "$ That she believes in this happens.",
        "It turned out that he was innocent.",
        "$ That he was innocent turned out.",
        "It remains for us to find the cure.",
        "$ For us to find the cure remains.",
        "WORD LIST: appears happen, remain, seem, turn out.",
        "V:SINGULAR: a tensed verb tV is in subclass SINGULAR if, in the environment N OBJ, it occurs with a SINGULAR noun and not a PLURAL noun PAGREE1).",
        "The verb subclass SINGULAR, then, includes tensed verbs carrying the suffix s (3rd person singular present tense) and was, am."
      ]
    }
  ]
}
