{
  "info": {
    "authors": [
      "Martha W. Evens",
      "Raoul N. Smith"
    ],
    "book": "ACL Microfiche Series 1-83, Including Computational Linguistics",
    "id": "acl-J79-1083",
    "title": "A Lexicon for a Computer Question Answering System",
    "url": "https://aclweb.org/anthology/J79-1083",
    "year": 1979
  },
  "references": [],
  "sections": [
    {
      "text": [
        "This is an expanded version of a paper presented at the Fifteenth Annual Meeting of the Association for Computational Linguistics, March 16, 1977.",
        "Accepted for publication September 30, 1978.",
        "Copyright 0 1979 Association for Computational Linguistics 2"
      ]
    },
    {
      "heading": "SUMMARY OF A LEXICON FOR A COMPUTER MIESTION-ANSWERING SYSTEM",
      "text": [
        "An integral part of any natural language understanding system, but one which has received very little attention in application, the lexicon.",
        "It is needed during the parsing of the input text for making inferences, and for generating language output or performl.ng some action.",
        "This pdper discusses the principal questions concerning the lexicon as it relates in particular to a question-answering system and proposes a specific type of lexicon to fulfill the needs of this system.",
        "Rather than make a distinction between dictionary and encyclopedia, we have a single global data base which we call the lexicon.",
        "Homographs are differentiated and phrases with fixed meanings are treated as separate entries.",
        "All the information in this lexicon is encoded in the form of relations and words or word senses.",
        "These form a large network with the words as nodes and the relations as edges.",
        "In addition the relations define semantic fields and these are used to treat problems of ambiguity.",
        "Relations are used to encode both syntactic and mantic information.",
        "Axiom schemes are associated with each relation and these are used for inferencing.",
        "The lexical relations then are at the heart (or brain) of the system for representation, retrieval, and inferencing.",
        "For each relation we describe its semantics and the axioms appropriate to it.",
        "In the positing of lexical relations our approach has 3 been influenced by the work of kpresyan, Mel cuk, and Zolkovsity.",
        "The lexical relations we have posited are the traditional synonymy and antonymy, taxonomy, part whole, grading and approximately forty others.",
        "The whole set, deliberately left open ended, is subdilLided into nine subsets which include attribute relations, collocational relations and paradigmatit ones.",
        "Each relation has its own lexical entry giving its properties and telling how to interpret lexical relationships in a first order predicate calculus form.",
        "Jor example, the information for the lexical entry dog includes the statement dog T animal, that is, that a dog is a kind of animal.",
        "The lexical entry for T, the taxonomic relation, in its turn includes informatic.",
        "which allows the statement to be interpreted as Hoido(Ncom(dog,X)) Holds(Ncom(animal,X)).",
        "The inventory of relations is expandable simply by adding lexical entries for new relations.",
        "In addition having both the lexical entries and the relations in the entr.Les expressed in the same notational form as that of input sentences, namely in a Cirst order predicate calculus notation, allows for a consistent, coherent, and easily modifiable system for analysis, inference, and synthesis."
      ]
    },
    {
      "heading": "TABLE OF CONTENTS 1. Introduction • • • 5",
      "text": [
        "f. Preliminary Design Decisions for the Lexicon 26 3.",
        "Some Theories of Lexical Relations 27 4.",
        "The Set of Lexical Relations .",
        "• I 35 a.",
        "The Classical Relations: Taxonomy and Synonymy 39 b. Antonymy .",
        "41 c. Grading 46 d. Attribute Relations 47 e. Parts and Wholes 50 f. Typical Case Relntions • • 52 g. Other Collocation Relations ' 55 h. Paradigmatic Relations .",
        ".",
        ".",
        ".",
        ".",
        ".",
        "57 i. Inflectional Relations 61"
      ]
    },
    {
      "heading": "5. The Organization of the Lexicon and the Semantic . Representations 6. Tha form of the Lexical Entry , . . . . 67 7. Summary 80 Appendix I. The Semantic Representations . 81",
      "text": []
    },
    {
      "heading": "References 5 1. INTRODUCTION",
      "text": [
        "The lexicon presented here is being developed as an integral part of a computer question-answering system which answers multiple-choice questions about simple children's stories; It thus must make information readily available for the parsing process, for building an internal nodel or the story being read, and for making inferences.",
        "Knowledge about words and knowledge about the world must both be stored in a compact but imrediately accessible form.",
        "Many decisions must be made, therefore, about the design of the lexicon.",
        "The first problem is to decide on an organizing structure.",
        "Should lexical and \"encyclopedic\" information be stored separately or together?",
        "Which items will have separate lexical entries?",
        "Which will be included in other entries?",
        "What about homonymy and polysemy?",
        "What connecting links between words and word senses will be recorded and how?",
        "The next problem is to determine a characterization of word meanings.",
        "This leads to some deep theoretical questions What kind of lexical semantic representations are appropriate?",
        "What is the structure ok these representations?",
        "What are the semantic primes, the elements of that structure?",
        "The design of the lexical entry is thus subject to theoretical biases-as well as the practical constraints of space, retrieval efficiency, and effective support of rnference-making.",
        "The decision to use lexical relations as fundamental elements of the structure of the lexicon has strongly influenced our design.",
        "Relations are used to encode both semantic an4 syntactic information.",
        "Axiom schemes essential to inferencing are associated with each relation.",
        "Relational"
      ]
    },
    {
      "heading": "6 information makes up.a significant part of, the lexical gntry.",
      "text": []
    },
    {
      "heading": "Lexical relations offer significant advantages. They a1 Love us to",
      "text": [
        "generalize familiar J.nference patterns into axiom schemes.",
        "They can encapsulate the defining formulae of the commercial dictidnary.",
        "They have an intuitive appeal which we believe reflects a certain measure of psychological reality.",
        "On a practical level they allOw.us to express both syntactic and semantic information in a form that is compact and cagy to retrieve.",
        "They can be used in many ways.",
        "For example, the following paragraph from a test administered to first and second graders by a local school system says: (P1) Ted has a puppy.",
        "His name is Happy.",
        "Ted and Happy like to play.",
        "(Q1) The pet is a: dog boy toy In order to answer this question we need to know what pet means.",
        "In our lexicon the lexical entry for pet contains a simple definition.",
        "a pet is an animal that is owned by a human.",
        "In order to answer this question we also need to know that a puppy is a young dog.",
        "This information in predicate calculus form would be part of the lexical entry for pulpy.",
        "We would, of course, need axioms of the same form as well for the entries for kitten, lamb, etc.",
        "Instead of such a representation we express this information by using a lexica] relation, CHILD.",
        "The lexical entry for puppy contains CHILD dog.",
        "Similarly, the lexical entry for kitten contains CHILD cat; while the lexical entry for CHILD contains the axiom scheme from which the relevant axioms are formed when needed.",
        "We treat verbs in a similar way.",
        "Corresponding to each case relation there is a lexical relation which points to typical fillers of that case slot.",
        "The lexical entry for bake2 includes TLOC kitchen.",
        "It also ihcludes• T rake where T it the well-known taxonomy relation, so that if the story says that \"Mother baked a cake \" we carpinter that she made one arid CAUSE bake' so that we car deduce that the cake has baked The selection restrictions that help us tell instances of bakel and bake2 apart can also be expressed oompactly using the T relation.",
        "We also need to make deductions from main verbs in predicate complement constructions, deductions such as the speaker's view of the truth of the proposition stated in the complement as derived from the factivity of the verb.",
        "In order to answer several questions from the test cited above the reader must infer that everything that Mother says is true.",
        "Lexical entries for main verbs that take predicate complements contain pointers to the implication class.",
        "These relations can Olen be expanded to give the proper axioms.",
        "The lexicon includes separate entries for each derived form unless the root can be identified by a simple suffix-chopping routine.",
        "Lexical relations are useful.here too in saving space.",
        "The lexical entry for man contains PLURAL men.",
        "The lexical entry for went consists of PAST go.",
        "The lexical entry for death consAsts of NOMV die.",
        "There are, as well, lexical entries for some multiple word expressions such as birthday party, ball game, piggy bank, and thank you.",
        "As to the form of presentation here, the next section presents some of the practical problems and theoretical convictions which determined our most critical design decisions.",
        "Then, after a brief description of some earlier developments in the theory of lexical relations, we explain the system of relations which structure our lexicon, discussing each group of relations in turn Finally we describe the actual form of our lexical entries."
      ]
    },
    {
      "heading": "8 2. DESIGN LECISIONS",
      "text": [
        "The lexicon in this system must make information readily available for parsing, for building the story model, and for making inferences during question answering.",
        "Both knowledge about words and knowledge about the world must be stored in a compact but immediately accessible form.",
        "Therefore, many decisions must be made concerning the design of the lexicon The problems involved include the organization of lexical and encyclopedic information, the choice of a lexical model and the determination of appropriate semantic primes, the representation of selection preferences, the recognition and storage of homographs, and the criteria for establishing separate entries fox idioms and other fixed phrases.",
        "Thin paper attempts to develop some consistent solutions to these problems, solutions which determine the design decisions for the lexicon in this question-ansuerinp system.",
        "a.",
        "The dwtsonary and the enchcloredl.a - one database or two9 Any question-answering system must use lexical information in at least two ways, in parsing and in making inferences.",
        "The first critical decision that must be made is whether two separate data-bages are needed to support these separate functions or whether a single unified global database Is better.",
        "Traditionally human beings have used two separate stores of information, the dictionary and the encyclopedia.",
        "Some linguistic and computational models of languagc have also been based on the assumption that information about words should be stored in two separate collections.",
        "In Chomsky's ALL1Bri^ model (1965) there are two separate storage placcs for lexical information, onc in the base component and another in thc semantic component.",
        "Mary (1972) stored syntactic information in a",
        "'dictionary\" and semantic information in an 'encyclopedia\" Winograd (1971) has two separate word lists, one used by the parser and one by the semantic routines, even though the parsing and the semantic routines are very closely interwoven in his BLOCKS system Before deciding on whether to carry on this tradition one must ask whether there is really a clearcut distinction between these two kinds of lexical information Is there a simple algoritim for deciding which data should go where?",
        "Bierman, Biperunsch, Refer, and the Semantic Anctgan of the LPxwon Both the dictionary and the encyclopedia are ways of recording information stored in human memory But human memory is probably not organized in the usual graphic form of an alphabetic word list, therefore alternative memory structures should be examined One such alternative has been presented by Bierman (1964) In his system lexical-semantic fields hre primary, they define the basic organization of semantic information The function of the lexicon, if it has one in the semantic domain, is to index these fields, to store pointers to the location of a word an the various fields containing it An appropriate image for such a system is a very large single page dictionary with Language specific nodes connected by semantic relations (See also Werner 196'9) Can the dictionary and the encyclopedia be distinguished in this context?",
        "Bierwisch and Kiefer (1970) assume that both kinds of information are contained in the same lexical entry The distinction between lexical and encyclopedic knowledge corrdsponds then to the difference between the core and the periphery of a lexical entry, where"
      ]
    },
    {
      "heading": "10",
      "text": [
        "The core of,a lexical reading comprises all and only those semantic specifications that determine, roughly speaking, its place within the system of dictionary entries, i.e. delimit it from other (non-synonymous) entries.",
        "The periphery consists of those semantic, specifications whith could be removed from its reading without changing its relation to other lexical readings within the same grammar (ibid: 69-70) Unfortunately they do not specify whether the lexical-Semantic relations which form the structure of the fields are part of the core or the periphery.",
        "The major difficulty with this criterion is its instability.",
        "As new entries are added to the system, information sufficient to distinguish one entry from another may have to be shifted from the periphery to the core and thus from the encyclopedia to the lexicon.",
        "For instance, stopose a new entry, \"leopard--a large, wild cat\" is to be added.",
        "The entire• lexicon must be aeaeched for entries which mention large wild cats.",
        "If one is found, .say \"lion--a large wild cat\", then enough information must be added to both definitions to differentiate leopard and Zion from each other.",
        "Soviet Lexicography and the Lexical Universe.",
        "Apresyan, iolkuvsky, and Mel\"Cuk run into the same difficulty of distinguishing dictionary and encyclopedic information in attempting to define the lexical universe of a word CO3 The main themes dealt with under the heading 'lexical universe' are: 1) the types of C0; 2) the main parts or phases of C0; 3) typical situations occurring .before or after Co etc.",
        "Thus, the section lexical universe for the word skis consists of a list of the types of skis (racing, mountain, jumping, hunting), their main parts (skis prdper and bindings), the main objects and actions necessary for the correct use (exploitatfon) of skis (sticks, grease, to wax), the main types of activities connected with skis (a ski-trip, a ski-race...) and so on.",
        "Even these scanty, examples make it clear that the information about the lexi",
        "information about skis (their history, the way they are manufactured, etc.)",
        "is not supplied here: the sections contain only such words and phrases as are necessary for talking on the topic, and nothing else.",
        "(1970:19) The problem here is that \"what is needed for talking about the topic\" depends very much on who is going to do the talking.",
        "The definition of ski in Webster's New International (2nd Edition) begins: One of a pair of narrow strips of wood, metal, or plastic, usually in combination, bound one on each foot and used for gliding over a snow-covered surface.",
        "Apresyan, Zolkaysky, and Mel cuk do not provide for three of the items.",
        "mentioned here: what skis are made of (wood, plastic, or metal), what shape they come in (long and narrow) and where they belong spatially (on the feet).",
        "Yet these items could be essential in understanding inferences in a story.",
        "It was snowing.",
        "Jim took out his skis.",
        "He waxed the wooden strips.... You could need this information in answering questions.",
        "Jim skied down the mountain.... What was he wearing on his feet: slippers skis skates?",
        "Although in English or Russian it is possible to refer to skis without knowing that they are long and narrow, It is not possible in Navajo where physical shapes determine verb forma.",
        "While the entry in Webster's goes on at length beyond the sentence given above, it does not include all the items which Apresyan, Zolkovsky, and Mel'cuk mention.",
        "This, however, is not surprising; the boundaries of the lexical universe are not well",
        "A truly interesting memory.",
        "model must be dynamic.",
        "The problems of updating this information are not easy to solve, the problem of distinguishing between dictionary and encyclopedic information in the updating process seems insuperable.",
        "Recognizing definitions phrased in ordinary English is already,diffi cult (Blerwisch and Kiefer 1970, Lawler 1972).",
        "Determining the reliability of such information is also a problem and the dichotomy of dictionary and encyclopedia increases this difficulty.",
        "Unfortunately information does not come neatly packaged and marked \"for the dictionary\" or \"for the en-cyclopedia\".",
        "And addition of information to one part of the entry may necessitate updating 'other parts of the entry.",
        "For example, if we learn that record is a verb as well as a noun we need to add morphological information, iescribe the relations between record and write, and we should• probably describe recording materials.",
        "Mention must be made that record is a factivv, i.e. if someone records that something happened, one can assume that from the standpoint of the speaker the something really did happen.",
        "Which of this information is dictionary information and which is encyclopedic?",
        "And once this decision is made, information added to that entry may requite additions to other entries In the record example, the entries for Phase and write would have to be updated.",
        "Also, a decision must be made (1)n whether a new entry is needed and whether homography or polysemy exists for thls new entry.",
        "13 The work of Kiparsky and Kiparsky (1970), Lakoff (1971) and MCCdwley, (1968) has shown that syntax and semantics cannot be separated into such neat compartments.",
        "But if syntax and semantics are interwoven then does it make sense to put syntactic information in one box and semantic informa-tior in.",
        "another?",
        "The answer to this question given at least by generative pemantics calls into question the traditional distinction between the dictionary and the encyclopedia.",
        "We accept the generative semanticist arguments that syntax add semantics cannot be separated and thus do not separate syntactic and semantic information.",
        "Furthermore, as shown above there seem to be no practical criteria for distinguishing dictionary information from encyclopedic information..",
        "Thus our system has one single, global data bas.",
        "For brevity and since it is a kind of F.ollection of words, it will be called \"the lexicon\"."
      ]
    },
    {
      "heading": "b. Lexical Models - Componential Feature Arialysis ve. Relational Networks.",
      "text": [
        "A second critically important decision involves the choice of an appropriate lexical model, the determination of what semantic primes to use and how they should be combined in lexical semantic structures.",
        "Two important competing models are provided by componential feature analysis and by relational networks.",
        "In a componential analysis model the primes are semantic features and words are defined by bundles of features.",
        "This is a natural extension of the di Linctive feature approach to phoneme description which his been used to explain many phonological phenomena.",
        "Certain practical problems arise.",
        "Thb number of words in any language'is far larger than the number of phonemes.",
        "The number of distinctive features which serve to discrlininate them must be larger too.",
        "The word-semantic feature mattix for a given language would be vastly larger than",
        "the phoneme-phonetic feature iatrix.",
        "In addition, this matrix would be extremely sparse.",
        "Also, it is not 'clear whether all the entries ih this marrjx cdUld be +1- as in a phoneme Matrix.",
        "Are semantic features either definaely absent or definitely present dr are some features present by degrees?",
        "The size of the componential analysis matrix would immediately introduce difficulties in a computerized model.",
        "Fortunately, both numerik-cail analysis and document retrieval offet experience in handling immense matrices by maohige.",
        "When a prix is extremely sparse it tutns out tp be sensible to store a list of eutirco with x.ow and eelumn numbers Here it would mean storing a list of features for each word.",
        "This.",
        "in fact, is close to Katz's proposal (1966).",
        "In a relational network model, however, the primes are relations and words or word senses.",
        "Relations connect fiords together in a network in which the wok.ds are nodes and the relations are edges.",
        "In fact, waxds,are defined in terms of their relationships to other words.",
        "These-models differ radically in their approach to the critical Lexical task pf finding related words.",
        "In the componential analysis model related words share related features.",
        "Precumably, the more features two words share the more closely related they are.",
        "Thus, some kind of cluster analysis must be used to identify related words.",
        "In the relational network model the lexicon is formed from terationships between words.",
        "Thus related words are immediately available Both models, componential and relational, require a search for semantic primes The componential analysis model requires the discovery of possibly thousands ofirsemantic features.",
        "For a relational network model an inventory of lexical relations and their.",
        "properties must be developed.",
        "This is apparently a significantly simpler task than the discovery of semantic features, for the",
        "number of relevant relations is probably quite small.",
        "iolkovsky and Melluk (1970) list about fifty in their paper.",
        "Related to both of these models is the notion of semantic fields.",
        "Intuitively, semantic fields are collections of related words used to talk about a particular subject.",
        "Semantic fields seem-to offer some help in coping with the problems of ambiguity and context.",
        "Many utterances, taken out of context, are ambiguous.",
        "But remarkably, people almost never perceive this ambiguity.",
        "They immediately choose the correct word sense and ignore the others.",
        "Apparently the topic of conversation determines a semantic field and the word sense chosen is the one which lies in this field.",
        "The semantic field pomehow defines the verbal context.",
        "(Or as Fillmore 1977:59 phrases it \"meanings are re-lativized to scenes\".)",
        "The componential analysis model makes it possible to define distinct semantic fields, but getting from one word in the field to the others may take a significant amount of processing time.",
        "Every set of semantic markers can be used to define a semantic field; the fiel& consists of all the words with definitions containing the markers.",
        "The smaller the number of.markers the larger the field obtained.",
        "It is possible to decide immediately whether aogiven word is in the field or not, just by checking its list of markers.",
        "In the relational network model related words are easy to find, but the boundaries of semantic fields are extremely fuzzy and indistinct.",
        "A semantic field can be defined by starting at a particular node and going a given number of steps in any direction.",
        "The semantic fields obtained this way, however, have very arbitrary boundaries and overlap considerably.",
        "16"
      ]
    },
    {
      "heading": "Certain basic philosophical-psychological assumptions may create",
      "text": [
        "a strong bias for one of these models over the other.",
        "Someone who believes that semantic features exist as Platonic ideals or who accepts them as psychological realities may easily find componential aralyEis a most natural kind of description and regard the necessary search for features or sememes as highly relevant.",
        "someone who Feels that \"There is no thought without words\" would be much more likely to prefer a relational network description.",
        "A lexicon ss, in an important sense, a memory model.",
        "Intuitiod about our own internal memory models must have a strong influence on the lexicon we shape.",
        "We have chosen a relational network model for both intuitive and practical reasons.",
        "We find lexical-semantic relations theoretically interesting (see Evens et al.",
        "ms).",
        "Useful inventories of these relations are available, in a later section we describe some of these sources.",
        "As will be shown they provide a convenient way of storing axiom schemes for deductive inference.",
        "As lexical semantic structures we use the same first-order predicate calculus notation in which semantic representations are written in the question-answering system - meanings of words and meanings of sentences must have the same underlying form As McCawley (1970) has argued \"dentist\" and \"doctor who treats teeth\" must contain the same units of meaning tied together in the same ray c 'electton Preferences A third important problem to be faced in constructing a lexicon which is to support a parser is the prohlPm of selection restrictions.",
        "Chomsky (1965) developed the theory of selection restrictions in order to block the generation of nonsense sentences in the syntactic component of his models The lexical entry for frt.ghten, for examlae, contains the information that it requires as object a noun with the featur [fanimate], while drink requires an animate subject.",
        "If these conditions are not met, generation is blocked.",
        "Selectional restrictions seem much too restrictive.",
        "Trailer trucks drink diesel fuel and the earth drinks in the rain.",
        "In describing dreams we can invent perfectly appropriate sentences in which inanimate objegtt by the dozens get up, run around, and drink until frightened back to place.",
        "Still it is true that sentences like these are somehow more surprising than sentences in which cows drink from a brook and are frightened by lightning.",
        "We need some method of recording the ordinary, everyday ways in which words combine without excluding the unusual, the poetic, the metaphoric uses.",
        "We Will call them selection preferences instead of selection restrictions.",
        "Some truly semantic means of identifying semantic anomalies are needed.",
        "Raphael mentions this question rather casually, almost as an aside in the SIR paper.",
        "He draws taxonomic trees, one for the nouns and one for the verbs, from the vocabulary of a first grade reader.",
        "Then he makes statements like this",
        "1.",
        "Any noun below node 1 is a suitable subject for any verb below node 1'.",
        "2.",
        "Only nouns below nodes 3 or 4 may be subjects for verbs below node 3'.",
        "(1968, p. 51)",
        "He makes it clear that he is indeed trying to solve the selectional problem 18 The complete model composed of tree structures and statements about their possible connections, is a representation for the class of all possible events.",
        "In other words, it represents the computer's knowledge of the world.",
        "We now have a mechanism for testing the 'coherence' or 'meaningfulness' of new samples of text.",
        "(1968, p. 51) Werner (1972) has suggested a method for handling the selecttonal problem which uses noun taxonomies in very much the same way that Raphael does.",
        "His proposal.",
        "includes an elegant way of storing seler...tional information within his memory model.",
        "In his network model, noun phrase arguments are connected to the verb by prepositions.",
        "The node representing the lexical entry for the verb has arcs connecting it to compound nodes, one for each prepo.sition which can be used with the verb.",
        "The object of each preposition is a node in the noun taxonomy.",
        "This noun or any noun below it in the taxonomy may serve as an argument for the verb.",
        "Here is an oversimplified example of a network for sell.",
        "o [thing]",
        "This network says that sell takes a human subject, a thing as object, the preposition to followed by a human, the preposition for followed by money.",
        "The square brackets around [human] indicate that this is just a pointer to the top main in the taxonomy for human beings.",
        "Any node in this taxonomy below the node marked human, whether it is Sam or.",
        "a Navajo or Mother, can be used as a subject for sell.",
        "He does 19 not use the verb taxonomy as Raphael does.",
        "Each verb has its own set"
      ]
    },
    {
      "heading": "of selection indicators.",
      "text": [
        "fn his discussion of the goals of a semantic theory Winograd describes semantic markers and selection restrictions, quotes Katz and Fodor (1964) and indicates that he intends to embody this theory in his system.",
        "But in fact semantic markers in the BLOCKS progr4m are derived from a marker tree (Winograd, 1971, Figure 59) which is organized taxonomically.",
        "In the implementation process Winograd seems to have moved from a strict Katz-Chomsky position to a position somewhat closer to Raphael and Werner.",
        "The Raphael and Werner proposals are the guiding principles here, adapted to accommodate case-defined arguments.",
        "The lexical entry for moves, the intransitive move, must tell us about selection as well as how to relata•subject, object, and prepositional phrases to cases.",
        "The information is organized this way: grammatical function case frame selection information",
        "1. subject txperiencer thing move' # 2. from source thing, place 3, to, into, onto goal thing, place",
        "The numbers 1, 2, 3, indicate argument positions for the predicate calculus representation.",
        "The next column lists the grammatical function.",
        "Next come case indications.",
        "Last comes the selection information, the top node in the relevant part of the taxonomy.",
        "For move].",
        "the subject is an experiences.",
        "The source is usually marked by the preposition from.",
        "The goal is usually marked by a preposition like to, into, dr onto.",
        "The selection information in column four is rather dull, since any argument 20 can be a physical argument or thing, the source and goal can both be places.",
        "There is a rule that any physical goal can be replaced by a class of adverbs containing back and there, so these alternatives do not have to be listed.",
        "An attempt is being made to use the verb taxonomy as Raphael suggested.",
        "In this lexicon go is marked as taxonomically related to move.",
        "The entry for go does not contain the information labelled # above.",
        "Instead, when this information is needed, the lookup routine climbs the taxonomic tree in the lexicon until it finds a verb which has this information and copies it from that entry.",
        "Thus it getsrcase-argument and selectional information for go from the entry for move.",
        "It is not clear yet whether this will really work with a sizable vocabulary.",
        "This selectional information is treated as selection preference and not selection restriction.",
        "Each candidate word sense for a verb is checked for selectional preference.",
        "If no arrangement of the available noun phrase arguments is consistent with these preferences another word sense is examined But if all word senses have been rejected on the basis of selectional information, the sentence is not rejected Instead we look again at the candidate word senses and count for Each one the number of steps up the taxonomic tree we have to make toe resolve the conflict.",
        "The word-sens( which requires the fewest steps is chosen.",
        "The hope is that the system will be able to \"understand\" simple metaphors this way.",
        "It would be interesting to try to create metaphors by picking noun phrase arguments close to but not undtr the nodes indicited by the selection information.",
        "21"
      ]
    },
    {
      "heading": "d. The Homonymy-Ftlysemy Problem - Vriteria for Separate Entries.",
      "text": [
        "Words with the same physical shape but different meanings constantly cause trouble in natural language processing.",
        "In designing a lexicon we must decide whether or not to create a senarat4 entry for each variation in meaning aild type of use.",
        "Quillian is particularly interested in words with multiple meanings and he experimented with Several in his memory model.",
        "In Quillian (1968) the word plant is treated as a three-way homonym with three separate type nodes, each with a separate definition-plane: PLANT Living structure which is not ail animal, frequently with leaves, getting its food from air, water, earth.",
        "PLANT2 Apparatus used for any process in industry.",
        "PLANT3 Put (seed, plant, etc.)",
        "in earth for growth.",
        "The type node for the first forms a disjunctive set with token nodes pointing to the other two OR OR PLANT PLANT2 PLANT3 The word food has a single definition with alternative formulations: That which living being has to take in to keep it living and for growth.",
        "Things forming meals, especially other than drink.",
        "A polysemous word like this has a single type node and a single definition-plane, but the two alternative definitions are combined with an OR link.",
        "Apresyan, Mplquk and iolkovsky attack the homonymy-polysemy problem with vigor.",
        "Graphically coincident words are considered homonyms, given distinctive superscripts and listed as separate=entries, if their definitions \"have no common part\" (Apresyan, Llkovsky and Melquk 1970:3) They do"
      ]
    },
    {
      "heading": "22",
      "text": [
        "not define \"a common part,\" but they do give an example.",
        "KOCA (scythe), 2 3 KOCA (braid of hair), KOCA (spit).",
        "If two flefinitibns have a single common part, the word is classified as polysemantic with a single entry divided into separate parts.",
        "They distinguish two types of polysemy.",
        "If one case the difference between two words is regular.",
        "The relation of a verb to its typical object is such a regular meaning change, e.g. record(v) - record(n), fish(v) fish(n), and aid(v) aid(n).",
        "These regular variations in meaning are numbered with Arabic numerals, while irregular variations are numbered with Roman numerals.",
        "Thus part 3 of the lexical entry for bow, the definition, might have the form: bow It 1.",
        "To bend the head in assent or reverence.",
        "(vi)",
        "2.",
        "To submit or yreld.",
        "(vi) 3.",
        "To cause to bend.",
        "(vt) 4.",
        "An inclinaribn of the head.",
        "(n)",
        "A bent \\Implement used to propel an arrow or play a stringed instrument.",
        "(n) II.",
        "1.",
        "The forward part of a boat.",
        "(n)"
      ]
    },
    {
      "heading": "2. One who rows in the bow of a boat. (n)",
      "text": [
        "There seems to be some redundancy between definition-elements and the lexical functions.",
        "Shouldn't regular variations in meaning be captured by regular lexical functions?",
        "If so, then the distinction Apresyan, tolkovsky and Mel'alk make between regular and irregular meaning variations will be apparent from the form and need not be-indicated by different notation, such as Arabic and Roman numerals.",
        "For convenience in lexical lookup we have a single physical entry for each graptical form.",
        "Each word sense whether irregular or regular 23 is numbered separately with Arabic numerals.",
        "Thus the adjective is coal, cool2 it the verb to become coal, and cool is the verb meaning to cause to become coati.",
        "Separate information about lexical relations, etc.",
        "is stored for each subentry."
      ]
    },
    {
      "heading": "e. Zd2omb",
      "text": [
        "Idioms present a serious problem to the designer of an English lexicon Some criteria must be established for deciding which idioms deserve separate lexical entries and how multi-word phrases should be stored.",
        "When does an idiom deserve to be treated as a separate Lexical unit?",
        "Apresyan, Zolkovsky, and Melqfuk (1970) and Kiparsky (19/5) represent opposite poles of opinion here.",
        "In the explanatory-combinatory dictionary (ECI) of the Soviets word combinations which have a definition of their own or \"a peculiar'combinability pattern\" have separate entries.",
        "Kiparsky (1975) considers an idiom as a separate lexical ugit only if it invoixes syntactic patterns which are no longer productive.",
        "Thus \"house beautiful\" and \"come hell or high water\" are treated es units, but \"make headway\" is not.",
        "Instead headway is defined as \"progress\" and marked as appearing after make' and lose.",
        "Kiparsky's proposal places a greater burden on the recognition program which would have to be able to retrieve and put together the pieces of the idiom using his lexicon The system described here follows Apresyan, Llkovsky and Mel'Cuk, and treats fixed phrases as units.",
        "In particular, all noun-noun combinations like piggy bank and birthday cake are separately defined, although this is certainly a productive part.of English.",
        "Judith Levi (1974, 1975) has proposed a theoretically elegant and intuitively attractive method of generating these forms.",
        "According to 24 Levi the underlying structure for \"birthday boy\" is \"boy-have-blrthday\" and the underlying structure for \"Birthday cake\" is \"cake-for-birthday.\" Then under certain conditions have, for, etc.",
        "can be deleted to give us the noun adjunct expressions.",
        "Given these rules, she argues, it is not necessary to treat these expressions at separate lexical items.",
        "While her rules seem sufficient to allow us to synthesize these compounds correctly, diffidaties arise when we try to use them for analysis.",
        "The question-answering system needs to be able to infer from \"birthday boy\" that the boy in question is having a birthday, but to avoid inferring from \"birthday cake\" that the cake is having a birthday.",
        "For correct recognition we need to be able to recover the unique underlying.",
        "structure if one exists.",
        "(For a similar criticism see Downing 1977:814-15.)",
        "Levi's theory accounts for the generation of new noun-noun compounds.",
        "However, in order to .account for the recognition process we need lexical entries for familiar fixed compounds and her theory to analyze new compounds.",
        "We have used Levi's structure as a basis for our representation of compound nouns.",
        "Noun-noun compounds have separate entries.",
        "A birthday cake is treated as \"a cake for a birthday.\" A ball game is represented as \"a game that has a ball\".",
        "A piggy bank is defined as \"a bank that is a pig.\" The system is told that Jim has a piggy bank and asked what the bank looks like.",
        "It could be argued that anyone with sufficient cultural knowledge ought to be able to answer this even if all the banks in his past were shaped like bee-hives, but we need a place to write down this cultural encyclopedic knowledge and a lexical entry for piggy bank seems like a good place to put it."
      ]
    },
    {
      "heading": "25",
      "text": [
        "Becker in his work on \"The Phrasal Lexicon\" (1975) has produced evidence on the Soviet side of this argument.",
        "His data suggest that fixed phrases comprise approximately half of our spoken output and have an independent lexical existence.",
        "He includes in his lexicon euphemisms 9 pure (\"the oldest profession\"), phrasal constraints-(\"day sheer coincidence\"), deictic locutions (\"for that matter\"), sentence builders (\"(person A) gave (person B) a long song and dance about (a topic)\"), situational utterances (\"How can I ever repay you?\"), and verbatim texts (proverbs, song titles, etc.).",
        "He claims that we speak mostly by stitching together swatches of text that we have heard before; productive processes have the secondary role of adapting the old phrases to the new situation most utterances are produced in steteetyped social situations, where the communicative and ritualistic functions of language demand not novelty, but rather an appropriate combination of formulas,, cliches, idioms, allusions, slogans... (1975:60) He has collected 25,000 phrases for the phrasal lexicon.",
        "Catherine Flournoy (1975) has found several hundred.",
        "fixed phrases in d computer study of Father Coughlin's speeches.",
        "This is not a new idea to students of oral epic poetry.",
        "Homer constantly used fixed phrases to fit syntactic and metrical slots.",
        "Dawn is always \"rosy-fingered\"; Hector is constantly \"tall Hector of the:shining helm.\" There is a serious space-time tradeoff here between parsing time and lexical storage space.",
        "It is probably true that people possess and constantly use a phrasal lexicon.",
        "Whether we should use storage space for items which we can parse/produce without ambiguity is another question.",
        "26 Currently we provide separate entries for any phrase that we cannot parse and interpret correctly from the entries for individual words.",
        "Brie entries for these phrases seem absolutely necessary for any practical recognition scheme.",
        "These entries also seem to be the appropriate place for indexing pointers to the cultural information necessary for Waiving inferences and answering questions about birthday cakes and birthday parties.",
        "There are theoretical arguments for such entries as well.",
        "We believe, as Becker does, in the phrasal lexicon, although we do not include entries for any phrases that can be parsed and interpreted correctly without a separate entry.",
        "Any complete system for language processing must also, of course, contain rules like Levi's to provide an ability to process novel forms.",
        "The goal of this project is a lexicon sufficiett for parsing, forming semantic representations, and making inferences,, compact but still allow-img rapid lexical lookup.",
        "The lexicon is a global database for the question-answering system, a combination lexicon-encyclopedia.",
        "Syntactic and semantic information are combined in the same lexical entries.",
        "Lexical semantic representations are written in the same form as the semantic representations for sentenced, in a many-sorted.",
        "first order predicate calculus.",
        "Homographs which vary in meaning or use are differentiated by Arabic numeral subscripts.",
        "Separate entries are included for phrases with fixed meaning.",
        "The lexicon is organized in terms of lexical relations.",
        "Semantic fields defined by relations are used to handle problems of ambiguity and context.",
        "27 The relations are used to express and retrieve many different kinds of information, from past participles to selection preferences to proper habitats for lions.",
        "Thus the system of lexical relations is crucial to representation, retrieval, and inference."
      ]
    },
    {
      "heading": "3. SO4 THEORIES OF unnAL RELATIONS",
      "text": [
        "While developing our lexical relations we examined a variety of relational theories in anthropology and linguistics and even collected folk definitions of our.",
        "own (Evens 1975).",
        "We have been particularly influenced by the anthropological fieldwork of Casagrande and Hale (1967) by the memory models of Raphael (1968) and Werner (1974), and most of all by the BCD of Apresyan, Mel cuk, and Llkovsky (1970).",
        "But we looked at each of these relational theories from the Peculiar point of view of coar puter question-answering and the particular lexical environment of children's stories, adding and discarding relations to fit the problem.",
        "Casagrande and Hale (1967) collected 800 Papago folk-definitions and sorted them into groups on the basis Of semantic and grammatical similarities.",
        "They produced the following list of thirteen lexical relations.",
        "(Table 1)"
      ]
    },
    {
      "heading": "Relation Word English Gloss of Papago Definition'",
      "text": [
        "Attributive burrowing owl but they are small; and they act like mice; they live in holes.",
        "2.",
        "Contingency to get angry When we do not like something we get angry.",
        "'unction tongue with which we speak 28 4 Spatial bucket in which we get water 5.",
        "Operational bread which we eat 6.",
        "Comparison wolf they are rather like coyotes, but they are big 7.",
        "Exemplification sweet as s igar 8.",
        "Class Inclusion crane a bird 9.",
        "SynDhymy amugEng funny 10.",
        "Antonymy low not high 11.",
        "Provenience milk we get it from a cow 12 grading Monday the one following Sunday 13.",
        "Circularity near when something is sitting nearby we say near",
        "Casagrande and Rale make no claim that they have found all possible lexical relatiops.",
        "These definitions were collected as part tof a study of dialect variation in Papago and Pima, The wads to be defined were chosen heLause they night exhibit dialect differences and not to elicit all possible defining formulae.",
        "They suggest for intuitive reasons adding the part-whole relation to their list although they did not identify it in their data, They also provide an Interesti4g aiscussian of word association data in which they give stimulus-renanse pairs from the Aftnnesota Norms of Russell and Jenkins (1954) exemplifying each of their lexical semantic relations (except for arculargity).",
        "They cite some word association pairs which do not have exact analogues in the Papago definitions.",
        "These are \"coordinate\" pairs like \"needle-thread\" or \"bread-butter\", \"clang\" responses like \"table-stable\", or sequential responses \"wish-bone\" and \"witistle-stap\".",
        "They remark about the 29 bread-butter pair that the relationship involved between \"bread\" and \"butter\" is similar to that discussed for contingency, except that in the Papago sample, the contingency relationship is not used if both X and Y are nominal concepts.",
        "Webster's New Collegiate Dictionary does pot mention butter in the bread entry but it has a separate entry: \"bread and butter.",
        "Bread spread with butter; hence, Colloq.",
        "livelihood (p. 103) It does mentiot thread in the needle entry and needle in the thread entry.",
        "This kind of association belongs in every lexicon.",
        "There are two ways to go from the study of folk definitions.",
        "One way is to find or invent lexical relations to fit all the folk definitions one can collect in a given language, and then look for more in.",
        "the formulas of published dictionaries of that language.",
        "The other is to abstract a minimal set of language-universal lexical-semantic relations and then attempt to express other proposed lexical relations in terms of the minimal set.",
        "Werner has-made substantial steps in this second direction (Werner and Topper 1976).",
        "Werner's basic semantic relations are the taxonomic relation (T), the modification or attribution relation (M) and the temporal sequencing relation, queuing (Q).",
        "These he calls \"the basic cement of the organization of•cultural knowledge and memory.\" (1974:17)-, The telation of taxonomy (T), the one expressed in English by \"a canary is a (kind of) bird , is written (bird) T (canary) and is represented in Werner's diagrams by a directed arc labelled T."
      ]
    },
    {
      "heading": "The relation of modification or attribution (M), fhe one expressed",
      "text": [
        "in English by \"the yellow bird\" or \"the bird is yellow\", is represented by a directed arc labelled M.",
        "These last two diagrams can be combined to express the idea that a canary is a yellow bird.",
        "(canary) The queuing relation Q represents the idea of order or sequence.",
        "For example, (Monday) Q (Tuesday).",
        "This relation is fundamental in the representation of plans in Werner's memory model.",
        "\"knowing how... requires the retention of temporal order.",
        "there are things to be 4one first, second, and so on and usually nonsense results if the order is changed (One can't drink the beer before the bottle cap is removed).\" (ibid, p. 11) Relations like '4onsists of,' 'part of,' 'cause of,' 'like' are handled as complex relations and composed from the primitive relations M and T using the logical operators not ( – ), and (44r) or (V) and particular lexical items.",
        "For the 'part of relation he gives the example"
      ]
    },
    {
      "heading": "This *diagram essentially says 'the thumb is a (kind of) hand-part.\"",
      "text": [
        "This is an extremely elegant and general theory.",
        "Werner's claim of linguistic universality seems well-founded.",
        "His model is in -.many ways intuitively appealing although we are not convinced that our basic lexical relations and our basic semantic relations are the sate.",
        "Our decision to try to design a lexicon witk a larger set of lexical relations is really an engineering decision, based on two probably temporary practical difficulties.",
        "(1) We do not know how to prove theorems in Werner's model.",
        "(ii) We believe that a variety of language specific lexical relations can produce a more compact lexicon with more efficient search routines.",
        "Raphael's Semantic Information Retrieval program (1968) combined a semantic net representation with a relational calculus which drakes inferences in this net.",
        "SIR inputs simple English sentences, translates them into node-relation-node form, uses a relational calculus to prove theorems, asks for more, information, if needed, and answers questions using those inferences.",
        "The relations which Raphael used are: xcy (An x is a y, e.g. A boy is a person.)",
        "x ( y (x is a y, e.g. John is a person.)",
        "32 equi;y[x;y] (x and are two names for same thing.)",
        "owng[x;y] (Every y owns an x.)",
        "own [x;y] (y owns an x.)",
        "partg [x;y] (Some x is part of every y.)",
        "part [x;y] (An x is part of y.)",
        "right tx;y] (x is to the right of y.)",
        "jright [x;y] (c As just to the right of y.)",
        "(ibid, p. 92) Each relation R has an inverse R. If aRb then the pair (R,b) is stored on the property list of a and (R,a) is stored on the property list of b.",
        "For each relation there are axioms.",
        "Further axioms describe how different relations interact.",
        "For instance, the set inclusion relation has the following properties: Ir[c] i.e., set inclusion is transitive equiv[x,y]->x c y"
      ]
    },
    {
      "heading": "ExA xcy->acy",
      "text": [
        "The interaction between set inclusion and partg is expressed by the axiom partg[x;y] Azc y partg[x,z] In other words, if an x is part of a y and a z is a y then an x is paint of a z.",
        "For example, if you know that mammals have hair and that whales are mammals, then you know that whales have hair.",
        "Some of Raphael's relations represent particular information, some represent generic information.",
        "It is the generic relations which correspond to the kind of lexical relations we are working with: set inclusion, equiv, partg.",
        "and owng.",
        "33 dpresyan, iakoveky, and Mei'5uk.",
        "The Explanatory-Combinatory Dictionary of Apresyan, Nelquk, and iolkovsky (1970) contains a wide variety of lexical relations.",
        "Whenever they notice a lexical regularity, they invent a lexical relation to express it.",
        "Their paper contains about fifty relations and they outline ways of combining the given relations to get still more.",
        "Many of these relations appear in an earlier paper by Zolkovsky and Mel'&k, which emphasizes the importance of specifying the grammatical transformations associated with eacI lexical pairing.",
        "Suppose a story says: The prince's gift of a magic apple to Zamiya dismayed his mother.",
        "In order to represent this correctly or answer a question like \"What did the prince give Zamiya?\" the system.",
        "needs to know not only the lexical relation between give and gift but also the transformation which carries one string into another.",
        "In this lexicon the accompeuying transformation will be indicated in the lexical entry for the relation, not in the lexical entry for the particular words give and gift.",
        "Most of the relations given in these two papers are as appropriate in English as in Russian.",
        "Some, although appropriate in English, embody more sophistication than seems necessary in this ptoject.",
        "The Soviet collection of relations is open-ended.",
        "They expect to identify more in further lexicographical work and to discover further properties of the relations already identified.",
        "This seems.",
        "highly intuitive.",
        "It is probably the case that people go on expanding their repertoires of lexical relations and learning their properties and that this learning continues to a much greater age than the acquisition of syntax.",
        "Lexical 34 relations can be added to our lexicon just by adding a lexical entry for the relation.",
        "At this point the actual addition of entries can only be done by internal manipulation.",
        "Eventually it would be preferable for the system tov\"learn\" such relations or at least accept them in English form.",
        "The authors refer to their relations as functions and the examples are wrtten in functional notation: Figur(passion)=Iname; Anti(beautiful) = plain ugly.",
        "Since these functions are definitely not single-valued, we have used the term lexical relation, in deference to the mathematical conventions.",
        "35 4.",
        "THE SET OF LEXICAL RELATIONS The research reviewed above and our own experience with children's",
        "relations of synonymy and taxonomy, aud presents an expanded sub-catego.",
        "rization within antonymy.",
        "The grading category includes a somewhat diverse collection of three relations.",
        "The attribute relations and the part whole category seem firmly motivated.",
        "The next two categories consist of co-occurrence or collocational relations.",
        "The last two groups of relations are paradigmatic in nature.",
        "The set of relations presented here is by no means complete.",
        "Indeed, it is deliberately open-ended.",
        "Whenever a new lexical regularity is seen in the data, a new relation is added.",
        "In order to make the system of relations extensible, therefore, a separate lexical entry has been constructed for each relition containing its special properties and associated axiom schemes.",
        "(Examples of this appear below, for example, in section d. 'In addition definitions of properties, such as transitivity, OnA A discussion of their use in this system can be found in Appendix II).",
        "There are several arguments for this methodology.",
        "Primarily we are convinced that lexical relations do not constitute a fixed set al language-universal semantic primes.",
        "We also feel that we have not yet discovered the most appropriate collectior or our own use.",
        "In addition we hope to",
        "36 a.",
        "Classical Relatsons 1.",
        "T taxonomy lion animal 2.",
        "S synonymy amusing single COMP married funnY1 b. Antonymy complementarity 1.",
        "COMP 2.",
        "ANTI antonymy hot ANTI cold 3.",
        "CONV converseness to buy CONV (3-2-1-4) sell 4.",
        "RECK queuing reciprocal kinship husband RECK wife Monday Q Tuesday c. Grading 1.",
        "Q 2.",
        "SET set-element flock SET sheep.",
        "3.",
        "STAGE manifestation ice STAGE water d. Attmbutbs male - unmarked drake MALE ducl4 1.",
        "MALE term 2.",
        "FEMALE female - unmarked lioness FEMALE lion tdrm 3.",
        "CHILD juvenile - parent calf CHILD cow 4.",
        "HOME habitat - object Africa HOME lion 5 SON characteristic bark SON dog sound - animal 6.",
        "MADEOF substance ski MADEOF wood e., Parts and Wholes 1.",
        "PART part - whole horn PART cow 2.",
        "CAP head - organization chief CAP tribe 3.",
        "EQUIP personnel - object crew EQUIP guu 4.",
        "PIECE count - mass lump PIECE sugar 5.",
        "COMESFROM provenience milk COMES cow",
        "FROM The numbering matches that in the text."
      ]
    },
    {
      "heading": "5. TINST 6. TSOURCE 7. TEXPER 8. TLOC",
      "text": []
    },
    {
      "heading": "2 LIQU destIving verb 3. PREPAR verb which moans-prepare 4 DEGRAD verb to deteriorate 5. INC increase verb DEC decrease verb 6 PREPOS preposition - Object",
      "text": []
    },
    {
      "heading": "2 BECOME 3 BE 4. NOMV",
      "text": [
        "cause - thing or to send CAUSE to go action effected",
        "model the acquisition of relations at some later point.",
        "And finally, we are attempting to introduce some modularity of design into a difficult programming project."
      ]
    },
    {
      "heading": "a. The Classical Relations: Taxonomy and Synonymy.",
      "text": [
        "Aristotle demanded that every definition begin with the statement of the genus to which the term belonged.",
        "The genus nor, is called a superordinate taxon and the relation between the term and its genus is labelled as the taxonomy relation.",
        "Even today commercial lexicographers following the classical tradition use taxonomy along with synonymy as the funda-vental relations.",
        "These relations also have played an essential part in attempts at question-answering.",
        "In Raphael's (1968) system they appear as set inclusion and equivalence.",
        "In Simmons' (1973) system they are called IMPIY and EQ.",
        "The inference-making scheme in Marx's question-answering system is based on these two relations.",
        "For example, one of his test paragraphs says that a dog is brown and the question asks, \"It the animal brown?\" (Marx 1972:224).",
        "A dictionary lookup of dog finds the taxonomic relationship between dog and animal.",
        "Animal is substituted for dog and the two sides match.",
        "Marx uses synonymy in the same way.",
        "Suppose the text says \"John wants money\" and a question asks \"Does John desire.",
        "oney?\" (1972:229).",
        "A dictionary lookup finds that dprirg is a synonym of want.",
        "'The substitution of one for the other results in a successful pattern match.",
        "1.)",
        "Taxonomy.",
        "The taxonomy relation T is expressed in many ways in English; perhaps \"is a kind of\" is the most typical: A dog is a kind of animal.",
        "A dog is an animal."
      ]
    },
    {
      "heading": "Dogs are animals.",
      "text": []
    },
    {
      "heading": "40",
      "text": [
        "The notation dog T animal is used to state this relationship.",
        "In the lexicon it is represented by an edge from the dog entry to the animal entry labelled T. Werner's work on the taxonomy relation in memory models has shown that this relation plays a crucial role in lexical theory as well as in practical question, answering.",
        "He has discussed the theoretical aspects of the taxonomy relation at length (Werner 1969, 1972, 1973, Perchonock and Werner L969, Werner and Fenton 1970) and has used it in several studies (Werner and Begishe 1969, 1970).",
        "Casagrande and Hale (1967) and Raphael (1968) use the name inclusion for this relation.",
        "It is certainly related to set inclusion.",
        "If A T B then the set of objects named by A, the extension of A, is a subset of the set of objects named by B, the extension of B.",
        "The set of dogs is a subset of the set of animals.",
        "If we look instead at tie intensions of A and B, the sets of attributes implied by the terms, we again find a set inclusion relationship but in the other direction.",
        "If A T B then the intension of A includes the intension of B.",
        "The characteristics that let\\us identify an object as a dog include the characteristics that make it an animal.",
        "Because of the possible confusion about the direction of the inclusion relation, it seemed like e good idea to use another name.",
        "The term taxonomy is the natural choice since it is now well--known in anthropology.",
        "2.)",
        "Synonymy.",
        "The synonymy relation poses some diffiGuit philo",
        "sophical problems.",
        "Do two words ever have the same meaning, or are there always differences?",
        "What criteria can be used to decide whether two words 41 are synonymous?",
        "Apresyan, iolkovsky and Melre/uk (1970:5) have attempted to state a precise criterion: the two words should be semantically substitutable fdr each other, the meaning of one should be expressible through the other in any context.",
        "But this criterion substitutes one problem for another.",
        "How can one tell whether such a substitution is successful, whether the resulting sentences have the same meaning?",
        "It can be argued that different sentence forms existsprecisely in order to allow the expression of differences in meaning.",
        "However impossible it may be to define synonymy precisely, this concept is used daily in ordinary discourse.",
        "Dictionary writers use it constantly.",
        "To simplify matters it is assumed here that the synonymy relation holds between two words whenever any of the dictionaries in the bibliography defines one as the other.",
        "This should be read as \"rough synonymy\" ar \"approximate synonymy.\" b.",
        "-Antonymy.",
        "Antonymy has long been recognized as a lexical relation.",
        "Webster's New Collegiate Dictionary, for gample, regularly lists antonyms.",
        "Its definition of cold includes \"Ant.",
        "Hot\" (1951 161).",
        "(The definition of hot, although it mentions cold, does not include \"Ant.",
        "cold\" ) The same dictionary defines antonym as \"A word so opposed in meaning to another word that it negates or nullifies every single one of its implications.\" It is true that antonymy indicates some important facts about implications, and these need to be captured, but it is not true that anitoymy involves neisting every proposition in sight.",
        "The problem is that there are many kinds of oppositeness of meaning.",
        "We have found four separate lexical relations whioh Correspond to separate subcategories of antonymy: complementarity, antonymy proper, 42 converseness, and reciprodal kinship.",
        "1) Complempntoxity, isolated by Lyons (1960, is the kind of oppositeness that holds between single and married or male and female.",
        "The denial of one implies the assertion of the other: the assertion of one implies the denial of the other.",
        "It John is married, then John is not single.",
        "If John is not married, then John is single If John isusi4gle, then John is not married.",
        "If John is not single, then John is married.",
        "This kind of relation seems to hold primarily between two adjectives or two adverbs belonging to the same primitive concept.",
        "If we set up a lexical relation COMP, then the appropriate axiom schemes seem to be, for the case where Adji COMP Adj2, if Z2, looked at along dimension Z1, has property Adj1, then it also has the property Not(Adj2) and vice versa.",
        "In the notation used for the bemantic representations in the question-answering system this is stated:"
      ]
    },
    {
      "heading": "Holds (P(42 Z Adji)) Holds (1)(71,Z2 ,Not(AdJ2)))",
      "text": [
        "if, on the other hand, it has the property NotCAdjl) then it a.1 go has the property Adj2 and vice versa.",
        "Holds (P (Z1, Z2 , No t (Adit) )) Holds (1\")(z1 9Adj 2)) (and similarly for adverbs).",
        ",OMP is a symmetric relation.",
        "If A COMP B, then B COMP A.",
        "In other words it is its own inverse In this lexicon If A is marked COMP B, then B is.marked COMP A and so inferences are available in both directions.",
        "Anything marriageable is either married or",
        "single, not both; if one term applies, the other must not.",
        "2.)",
        "Antonymy.",
        "Lyons restricts the term antonymy to the situation where the assertion of one implies the denial of the other, but the denial of one does not imply the assertion of the other.",
        "Red and green are antonyms in this sense.",
        "If X is red, it is not green.",
        "On the other hand, if X is not red it does not have to be green.",
        "It could be blue or yellow instead.",
        "Hot or cold behave in the same way.",
        "If X is hot then it is not cold, but if X is not hot we do not know for sure that it is cold; it may just be lukewarm.",
        "We set up a lexical relation ANTI to express this kind of antonymy.",
        "Again it applies particularly to adjectives and adverbs belonging to the same primitive concept.",
        "The lexical entry for ANTI gives an appropriate axiom scheme for the case in which Adj1 ANTI Adj2: If Z2 is Adji then it is not Adj2.",
        "Holds (P(Z1,Z2,Adji)) Hoids (P (Z 21Not(Adj2))) (Similarly for adverbs.)",
        "Verbs may be included in this kind of antonymy.",
        "'Consider the pairs love-hate and open-shut.",
        "For a child, at least, \"X loves Y\" may imply 4-X hates Y.\" The appropriate axiom scheme fot verb ANTI verb2 would be:",
        "Holds(R (v erb , Z2,Z3,Z4))"
      ]
    },
    {
      "heading": "Holds (R(verb2,Zi,Z2,Z3,Z4))",
      "text": [
        "Since such vett' pairs do not appear in our examples such problematical inferences have been avoided.",
        "44 There are some.",
        "important semantic realities here which are not being captured.",
        "There is a set of inrnmpatible color terms: red, orange, yellow, green, blue, purple, brown, black, white.",
        "One can describe any small area of a physical object in one of these terms if it is forbidden to use hedges like turquoise and pink.",
        "Hot and cold, like big and small, are opposite ends of a scale.",
        "Between hot and cold, warm and cool can be placed somewhere.",
        "Binary lexical relations are not adequate here.",
        "Perhaps devAlopments in the theory of fuzzy sets will eventually provide a better description.",
        "There are logical problems here too.",
        "If the story says the toy is red, then we want to answer \"no\" to the question \"Is the toy green?\" But toys can be both red and green in spots, patches, or striper Jr the story says that the toy is red and green, we do not want 4 get lost inba self-contradiction.",
        "Adjectives which imply grading (cf section c below) involve potential self-contradictions of a slightly different kind.",
        "Lyons discusses the sentence reference \"A small elephant is a large animal.\" The current representation for that sentence in our system would be:",
        "For more details see the section on semantic representations.",
        "But smaVZ ANTI large so ma must conclude from P1 that P(size,X1,Not(large)).",
        "The problem is that when we call something a small elephant we imply a cm.",
        "parison with some norm for elephants.",
        "However, this comparison does not appear in our representation.",
        "(This diffitulty has also been discussed 45 by Bierwisch 1969 and Simms 19730",
        "3.)",
        "Canverseness, This is Lyons' name for a third kind of antonymy.",
        "As examples he gives the pairs buy-sell and husband-wife.",
        "This kind of oppositeness does not seem to involve negation at all.",
        "Rather it involves some kind of permutation of the associated individuals.",
        "Dale calls this relation reciprocity and explains it this way: Buy and sell are reciprocals, as are give and receive.",
        "What distinguishes these from antonyms (which they are, in a sense) is that whenever a sentence using one of them is appropriate, there is another appropriate sentence using the other member of the pair.",
        "For example, John buys books from Bill has the same meaning as Bill sells books to John.",
        "He gave flowers to her has the same meaning as She received flowers from him.",
        "This is a sort of \"semantic passive\"--like the passive transformation in syntax, it presents die same meaning from a different point of view.",
        "(1972: 144) WHether Dale's sentences have exactly the same meaning or not is debatable, but anyone would agree that one implies the other, What is needed is some compact way to indicate what these other appropriate sentences are and to derive them when they are needed.",
        "Zolkovsky and Mel'%61k (1970) have a clever way of doing this for verbs.",
        "They use a notation of the form: Buy CONY (3 2 1 4) Sal to indicate that X./.",
        "buys K2 from X3 for X4 becomes X3 sells X2 to X for X4 1 We have borrowed this notation, applying it to cases rather than subjects and objects.",
        "It is interesting that the Soviets include regular 46 syntactic passives in their discussion of this relation.",
        "Since in this system inferences are made on the basis of the fully formed semantic representations from which passives have been eliminated, they need not be included here.",
        "4.)",
        "Reciprocal Kinship.",
        "If we had followed Reichenbach (1966) in",
        "treating kinship relations as functions of several arguments then wwdould have used CONV for pairs like husband-wqe also.",
        "Since kinship and social relationships like teacher-student are expressed in terms of have, however, it makes sense to posit a new relation RECK for RECiprocal Kinship and other social terms.",
        "Husband and wife relationships are replesented this way: Len is Martha's husband.",
        "ftgve,X1,X2,husband) Martha is Len's wife R(have,X2,X1,wife) We want to be able to derive one of these►sentences from the other, using the lexical information husband RECK wife, i.e. if X1 has X2 as husband then X2 has Xi as wife.",
        "The axiom scheme for A RECR B says that if X has X2 as A then X2 has Xi as B."
      ]
    },
    {
      "heading": "Hads(R(have,X1,X2,A)) Hads(R(have,X2,X B))",
      "text": []
    },
    {
      "heading": "Other kinds of converseness or reciprocity have not occurred often enough",
      "text": [
        "to warrant a separate relation and a separate axiom scheme.",
        "They are entered as individual interences in each entry.",
        "Antonymy seems to be a highly diverse lexical concept.",
        "With further study it may spawn still more lexical relations."
      ]
    },
    {
      "heading": "c. Grading.",
      "text": [
        "Grading relations like antonymy relations involve alternatives of some kind.",
        "Graded alternatives appear to be organized in lists or other 47 kinds of formal structures.",
        "Our collection of grading relations is in a state of f.ux, many aspects of grading are still not properly defined.",
        "1.)",
        "Queusng.",
        "The notation Q is borrowed from Werner but used in a",
        "very restricted sense to connect adjacent items on lists, as in Monday Q Tuesday.",
        "It could be read \"is immediately followed by.\" Z.)",
        "Set-element.",
        "SET relates the name for the set to the name of the elements, e.g. flock SET sheep.",
        "This is the relation which the Soviets call Mult.",
        "This relation seems to be particularly well-founded psycholo-4.",
        "gically, for English has many special words of this type pride of lions, bevy of maidens, gaggle of geese, and it is certainly a source of word-pla3 3.)",
        "Mansfestatson.",
        "By contrast the STAGE relation, as in sae STAGE water, Seems very shaky.",
        "The axiom schemes are not satisfactory and some of the territory is covered by the CHILD relation described in the section on attribute relations.",
        "There seems to be a gap in our collection here.",
        "We have no parallel to the comparison relation of Catagrande and gale (1967).",
        "Of course &a the most common type of examples where the items related are taxonomic Brothers, or cohyponyms as they are sometimes callea, the comparison relation can be expressed by a combination of T and T. Recent work by Litowitz (1977) suggests that comparisons are an important component of the defining strategy of children.",
        "The boundary between the grading relations and the attribute relations described in the next section is also uncomfortably arbitrary."
      ]
    },
    {
      "heading": "d. Attribute Relatsons.",
      "text": []
    },
    {
      "heading": "According to Casegrande and Hale (1967 168) whenever \"X is defined",
      "text": [
        "with respect to one or more distinctive or characteristic attributes Y\".",
        "48 a definition is \"attributive\".",
        "Given this all-inclusive description it is not surprising that the attributive category was the largest in their sample.",
        "They propose several subcategories including stimulus properties like size and color, distinctive markers, habitat, behavior, sex, generation, and line of descent.",
        "But in order to facilitate inference we need to associate axiom schemes with each relation.",
        "Thus we have broken these subcategories into still more precise relations.",
        "1.)",
        "Male.",
        "The relation MALE as in drake MALE duck relates the masculine to the unmarked term.",
        "We want to be able to infer that if something is a drake, then it is a duck and it is male, i.e. Ncom(drale,Zi) Ncom(duck,Z1) A P(sex,Z1,male) This axiom can be derived when needed from an axiom scheme in the lexical entry for male which says that whenever Mil MALE ZN2 then a ZN1 is also a ZN2 and it is male; i.e., Ncom(ZN1,Z1) Ncom(ZN2,Z1) A P(sex,Z1,male) 2.)",
        "Female.",
        "Similarly, FEMALE, as in lioness FEMALE Zion, relates the name of the female to the unmarked term.",
        "3.)",
        "Terms for juveniles.",
        "The most common attribute relation in our vocabulary is CHILD, which relates the term for the offspring to the term",
        "for its parent, as in puppy CHILD dog, kitten CHILD cat, lamb CHILD cheep.",
        "The lexical entry for CHILD contains the axiom scheme",
        "When puppy.",
        "and dog have been substituted for ZN1 and ZN2 respectively we get an axiom that tells us that if Zl ig a puppy then Z1 is a dog and Z1 is young.",
        "This relation seems to underlie a crucial part of the vocabulary of young children.",
        "Why is such a tremendous amount of time spent teaching children words like meow?",
        "Was this information once life-preserving or is it a way of teaching how sound is structured into words, the phonology of the language?",
        "For whatever reason, children who never see a farm are carefully taught to associate the sound moo with cows.",
        "6.)",
        "Substance.",
        "The relation we call MADEOF as in"
      ]
    },
    {
      "heading": "ski MADEOF wood",
      "text": [
        "relates an object to the substance of which it is made.",
        "Casagrande and Hale classify as provenience both batea: 'Twhich is made out of mesquite\" and milk: \"we get it from a cow\" (1967:184).",
        "Since in-English these-re-lationships'are expressed in different ways, for example, the ski is made of wood - wooden ski, but milk comes from a cow - cow's milk, and since the appropriate inferences are different (the milk was once in the cow but the ski was not in the wood), we chose to classify them separately.",
        "As the vocabulary expands we expect the list of attribute relations to expand.",
        "Litowitz (1977) is currently collecting definitions-from 50 children and isolating further relations.",
        "Smith and.",
        "Maxwell (1977) have identified certain attribute relations which occur repeatedly in defining",
        "The PART relation seems to be crucial in the definition of many every day objects.",
        "While it is clearly important-in computer models of memory, it seems hard to isolate from natural English sentences.",
        "Raphael's (1968) SIR model used some subtle heuristics to determine whether a particular instance of tile verb have should be represented by the part relation or the own relation.",
        "Sometimes dialog with a human is necessary to resolve the ambiguity.",
        "Simmons (1973) recognizes a three-way ambiguity in have which is represented variously as HASPART, POSSess, and ASSOC (1973:76) Mary has long fingers HASPART Mary has money POSSess Mary has fun in the park ASSOC Apparently the part-whole relation is hard to identify in Papago also.",
        "Casagrande and Hale do not find it in their Papago sample.",
        "They classify as exemplification definitiong*which,are translated into English as \"cows have horns\" and \"horses have tails.\" However, on, the basis of intuition and the word-association data of Russell and Jenkins (1954) they posit a fourteenth relation (1967:191):",
        "The example given is cheek-face."
      ]
    },
    {
      "heading": "Apresyan, Mal tuk and Iolkovsky do not have an explicit part-whole",
      "text": [
        "relation but day do include two relations in this same area.",
        "We have borrowed",
        "2.)",
        "Head-Organization.",
        "CAP relates the head to the organization.",
        "chief CAP tribe 3.)",
        "Personnel-Object.",
        "EQUIP relates the associated staff to the organization or object they serve.",
        "crew EQUIP ship 4.)",
        "Count-Mass.",
        "The relation PIECE which carves, a countable chpnk out of a mass also belongs to the part-whole family.",
        "For example,"
      ]
    },
    {
      "heading": "lump PIECE sugar item PIECE news",
      "text": [
        "Jespersen was intrigued by this mechanist which he named individualization (1933:209); he discovered and listed many such examples.",
        "This seems to"
      ]
    },
    {
      "heading": "O",
      "text": [
        "be the relation which the ECD calls SING (Apresyan et al., 1970:11).",
        "5.)",
        "Provenience.",
        "We include here also the relation COMESFROM, as in milk COMESFROM cow.",
        "This is one aspect of the relation which Casagrande and Hale (1967) call provenience.",
        "(It should possibly be listed as an attribute relation along with its close cousin MADEOF.",
        ")4",
        "Our current lexicon contains only two axioms for the part-whole relation.",
        "One is transitivity: if X PART Y and Y PART Z, then X PART Z.",
        "The other, borrowed from Raphael, connects PART and Taxonomy.",
        "Essentially 52 it says that if all X's are Y's and all l's have Z's as parts, then all X's also have Z's as parts.",
        "There is an extensive philosophical literature involving this relation.",
        "Martin (1971) presents a system of axioms for part-whole and a review of work by Lesniewski, Woodger, and Tarski.",
        "f. Typical-Case Relations.",
        "Casagrande and Hale discovered that certain familiar objects, body parts, foods, tools, and other objects of material culture were most often defined not by the relations discussed above but rather by their use in daily life, by common activities associated with them.",
        "For example, under the !'function\" relation they classify examples in which \"X is defined as the means of effecting Y\" such as eye: \"...with which we see things\" money: \"...we buy things with it\" (1967:175) The \"operational\" class includes examples in which X is defined as \"the characteristic goal or recipient\" of action Y bridle: \"...which they put on horses\" (1967:178) What they call the \"spatial\" relation also seem to be of this same type.",
        "grindstone: Pt ...on which a knife is sharpened\" (1967:177) Folk definitions collected from speakers of English often are of this variety, sometimes combined with taxonomy, e.g. \"a house is a building in which people reside\" (Evens 1975:340).",
        "Children in particular seem to prefer functional definitions (cf. Ruth Krauss' collection of children's definitions, A Hie is to Dig, 1952).",
        "Apresyan, Mel'Llc, and iolkovsky's system includes a family of funtAions Sl, S2, S3, S4 which relate nouns and verbs or adjectives.",
        "Their semantic structures are based on grammatical relations.",
        "For verbs these are a subject relation, a direct object relation, and two kinds of indirect object relations.",
        "The functions Si, S2, S3, and S4 correspond to these grammatical relations.",
        "S1 relates the verb to its generic subject.",
        "S2 relates the verb to its generic direct object, etc.",
        "For example (1970:10: (to sell)=seller S2(to sell)=goods (that which is sold) S (to sell)=buyer, client, customer (the one to wbom the goods 3 - are sold) S4(to sell)=price (that for which the goods are sold) The ECM also contains four other substantive relations (1970:11).",
        "The values are nouns.",
        "The arguments can apparently be verbs, adjectives or nouns.",
        "First is Smod which gives the noun denoting the mode of action;-.",
        "Smod (to write)=handwriftng.",
        "Sloe gives the noun denoting the place of the argument; Sloc(action) – ecene.",
        "Sinstr gives the noun denoting the instrument; Sinstr(communicationmeamo, Sinstr(to think)=brain.S res the noun denoting the result; Sres(to hunt)=bag.",
        "Since the semantic representations in the question-answering system are structured in terms of cases Lather than grammatical relations we have set up a group of \"typical-case\" relations, one for each case relation in our case system.",
        "The typical-case relation relates the verb to typical fillers of that case.",
        "argument slot.",
        "Thus, corresponding to the semantic relation AGENT we have a lexical relation TAGENT.",
        "The fact that someone who bakes can be called a baker is expressed in our lexicon baker TAGENT to bake 54 The stuff that you eat Is usually called food; food TOBJECT to eat.",
        "The result of digging is usually a hole; hole TRESULT to dig.",
        "When the Cubs beat the Cardinals the Cardinals are the losers; loser TCAGENT to beat.",
        "The thing you sew with is called a needle; needle TINST to,sew.",
        "(This is the Casagrande and Hale operational relation.)",
        "Most plants sprout from earth; earth TSOURCE to sprout.",
        "One who loves is called a lover; lover TEXPR to love.",
        "People usually bake cakes in a kitchen; kitchen TLOC to bake2.",
        "It should be noticed that the relation TLOC bears a close resemblance to HOME which gives the typical habitat fdr an dhimal or other object.",
        "The Soviet relation Sloc seems to include both.",
        "It is not clear that semantic theory can justify using two re-latiors here.",
        "We have made a distinction because our systeff of semantic representations treats nouns and verbs differently, so that the associated axiom schemes for TLOC and Rom are formally different.",
        "It would be possible to use only one relation and test the argument for part of speech before choosing an axiom scheme Perhaps the real problem is in the system of semantic representations.",
        "This particular choice of lexical relations is based on the particular case system being used.",
        "We claim, however, that the•same basic scheme would be effective for a lexicon functioning with a diff?rent system of semantic representations based on any other set \"of case or grammatical relations.",
        "This is so sine in this scheme corresponding to each semantic relation in the semantic representation there is a lexical relation in the lexicon relating-verbs and typical fillers of argument slots.",
        "The relations in this group, like the typical case relations examined in the preceding section, are basically coocurrence relations.",
        "They connect words which cooccur constantly and point to words which have special meanings in particular contexts.",
        "This is an important paLL of the lexical knowledge of the native speaker often neglected in dictionaries.",
        "Most of our relations in this group are borrowed from the Soviet lexicographers: COPUL, LIQU, PREPAR, DEGRAD.",
        "1.)",
        "Special Copula Verb.",
        "The COPUL relation indicates the correct copula verb for nouns where be/become is not appropriate.",
        "For example, to fall is the special copula verb for victim, to fall COPUL victim, as in \"Constance fell victim to Louis' charm.\" 2.)",
        "Destroying Verb.",
        "LIQU relates a noun and the verb which means to liquidate or destroy it.",
        "This seems to be useful in English as well and some examples belong to a child's vocabulary.",
        "to erase LIQU mistake to wipe out LIQU traces"
      ]
    },
    {
      "heading": "30 Prepare for use. The relation PREPAR relates a noun and the verb",
      "text": [
        "which means to prepare the object, to make it ready for use.",
        "This is particularly useful in making deductions about why people are doing things.",
        "These are all colletational relations that we have observed in our data.",
        "Melquk's ECD contains even more collocation relations but we have not included them because they seem too literary or too sophisticated for the vocabulary of children a stories.",
        "For example, Bon (Apresyar Melquk, and Zolkovsky 1970:13) points to attributes meaning \"good\":",
        "Both the typical-case} relations and the other collocation relations which we have describedrare syntagmatic relations.",
        "They connect words with other words which concur frequently in natural language sentences, sometimes with special meanings.",
        "We turn now to a group of paradigmatic relations which connect words which express aspects of the same core of 37 meantpg as it appears in various contexts or in different parts of speech."
      ]
    },
    {
      "heading": "h. Paradigmatic Relations.",
      "text": []
    },
    {
      "heading": "The relations which we have grouped together as paradigmatic relations",
      "text": [
        "are highly disparate in kind and importance.",
        "CAUSE, BECOME, and NOMV-are, we believe, essential to the sitructUre of the Bnglish lexicon; ABLE and ADJN seem potentially quite useful.",
        "There seem to be very few examples of BE.",
        "All except BECOME were influenced by the inventory of Apresyan; Zolkovslty, and mellnk.",
        "1.)",
        "Cause.",
        "Traditional dictionaries use-cause constantly to describe relationships between verbs.",
        "Dennison (1972) defines to send as \"to cause to go\".",
        "Webster's New Collegiate (1951) defines to boil as \"to cause to bubble....\" (p.9b).",
        "Schank (1975) treats cause as the most important relation.",
        "McCawley (1975c) in discussing to open argues for two lexical entries, open for \"intransitive\" uses: \"the door opened\" and open2 for \"transitive\" uses: \"John opened the door.\" Open).",
        "and opeii2 axle related by cause: to open2 is to cause to open].. McCawley's formulation will be followed here.",
        "The first and longest entry in Webster's New Collegiate Diciionary for Open belongs to the adjective.",
        "The definition of the intransitive verirbegins \"to become open\".",
        "This suggests a renumbering: open].",
        "- adjective - \"the door is open\"",
        "behaves like open.",
        "We start with the adjective coal,\"the jello was cool\".",
        "Tjle intransitive rens cool2 means \"to become cool \", \"the jello cooled in the refrigerator.\" The transitive verb 00013 means \"to cause to become coop'' \"Jane cooled the jMo in the refrigerator.\" Other verb-adjective homographs like clean gum a different pattern, the in transitive verb is missing.",
        "clean - adjective - The rodm was clean.",
        "tclean?",
        "- to become cleanr- the room cleaned.",
        "clean2 - to cause to become cl - Jane cleaned the room.",
        "Not all verb-adjective pairs are homographs.",
        "Modern English retains traces of an old suffix en which turns adjectives into verbs.",
        "To redden is to make or become red.",
        "Sometimes the verb and the adjective are etymologically distant: to age.' is to become old.",
        "We need a lexical relation CAUSE relating send and go, open3 and open2.",
        "send CAUSE go open3 CAUSE open 2 The appropriate axiom schema for the case verb CAUSE verb2 tells us that: if the sentence containing verb].",
        "holds, then so does the sentence containing verb2.",
        "Formally,",
        "Holds(R(vgzi Z2,Z3,Z4)) 4 Holds (R(vrb2., Z.2 ,Z3 ,Z4 , Z5)) 2.)",
        "Vecome Adjective.",
        "We also' need a lexical relation BECOME",
        "relating age, and old, open9 and open.,.",
        "59 ages BECOME old redden BECOME red open 2 BECOME van].",
        "If verb' BECOME adj1; then if the sentence containing verb].",
        "holds, then the object that did the becoming must now have the property expressed by the adjective, Leh",
        "where ZC1 is the primitive concept corresponding to adj1.",
        "(This axiom may conceivably react in uncomfortable ways with tense.)",
        "For the moment the relation between clean2 and clean].",
        "the \"cause to become\" relation will be compounded from CAUSE.",
        "and BECOME‘ It will probably occur often enough to deserve a name of its own, perhaps MAKE.",
        "3.)",
        "Be.",
        "The relation BE parallels BECOME very closely.",
        "While BECOME relates the verb of becoming and the predicate adjective, BE relates the verb of being and the predicate adjective.",
        "For example, to neighbor is the verb which means to be near."
      ]
    },
    {
      "heading": "to neighbor BE near",
      "text": [
        "This is the inverse of the relation which the Soviets call PRED.",
        "For some reason it seems to be much less common than BECOME.",
        "4.)",
        "Process Noun and Verb.",
        "NOMV relates a process noun and its verb.",
        "Death•is the nominalization of the verb to die; death NOMV to die.",
        "(This is the Soviet relation Vo and the inverse of the relation S:) 0 5.)",
        "Adjective and noun.",
        "The relation ADJN, the inverse of the Soviet A0, relates adjectives and nouns) as in solar ADJN sun.",
        "This relation may have to be split into two or more pieces.",
        "Magnus Ljung (1970) 60",
        "suggests that adjectives formed from nouns by adding -y, e.g. sunny as opposed to solar, mean \"having more than a normal amount of\" whatever the noun denotes.",
        "Adjectives in al and -ful may present certain other semantic regularities.",
        "6.)",
        "Able.",
        "The relation ABLE is used in combination with case relations only.",
        "The Soviet version of this relation has different subcategories - Able]., Able2, Able3, Able, - to indicate grammatical arguments of the verb.",
        "Able].",
        "(to burn) = combustible things are precisery those which can be subjects of the verb to burn.",
        "On the other hand, Able2 since edible things are those which can be objects of the verb to eat.",
        "Since the semantic representation system in the question-answerer .uses cases to connect verbs acid arguments, we handle different kinds of ABLE-ness by combining ABLE with a case.",
        "7.)",
        "Irregular imperative.",
        "The relation IMPER comes directly from the Soviet inventory.",
        "It relates colloquial imperative expressions to the appropriate main verb.",
        "fire!",
        "IMPER to shoot",
        "go ahead!",
        "IMPER to talk"
      ]
    },
    {
      "heading": "This relation esqentially involves very irregular imperatives; and this",
      "text": [
        "brings us to the inflectional relations.",
        "(to eat) =edible,"
      ]
    },
    {
      "heading": "i. Inflectional Relations.",
      "text": []
    },
    {
      "heading": "Inflectional relations are dull but useful. Regular noun plurals",
      "text": [
        "and verb forms are handled by a suffix-chopping algorithm but words like men and sang defeat it completely.",
        "We get around this difficulty in essentially the same way as some commercial dictionaries do.",
        "A separate entry is included for these words.",
        "The lexical entry for men Consists of PLURAL man.",
        "The entry for sang is PAST-to sing; for sung we have PP to sing.",
        "The axiom-generator for PLURAL changes the number associated with the object if necessary and moves to the main entry to pick up other axiom scheme's there.",
        "The inflectional relations are, of course, paradigmatic relations, but are grouped separately because of their strong family resemblance and particularly uninteresting nature."
      ]
    },
    {
      "heading": "5. THE ORGANIZATION OF THE LEXICON AND THE SEMANTIC REPRESENTATIONS",
      "text": [
        "The lexicon is a large network in which the nodes are lexical entries and the arcs are lexical relations; all the arcs are double-ended.",
        "To represent the network in the data base, each entry contains a list of attribute-value pairs.",
        "Each pair consists of an arc (i.e. a relation name) and the name of the entry at the other end of the arc.",
        "Each lexical relationDL has an inverse Ir.",
        "If entry].",
        "contains the attribute-value pair L-entry2, then entry2 contains L-entry].. Each relation also has a lexical entry which gives its properties and also tells how to iftterpret lexical relationships in the predicate calculus.",
        "For example, the entry for dog includes the information dog T"
      ]
    },
    {
      "heading": "Holds (Ncom (dox,X)) Holds (Ncom (animal,X)).",
      "text": [
        "The lexical entry for T also tells us that T is transitive.",
        "The inventory of relations is expandable.",
        "To add a relation we need only add a lexical entry.",
        "When the meaning of the word cannot be expressed solely in terms of lexicalxelations, a defLnition is added to the lexical entry, phrased in the same form as the semantic representations and using the same depth lexis.",
        "These lexical semantic relations are wtiteen in the same form as semantic representations for sentences.",
        "The lexical entry for pet includes the information that a pet is an animal which is owned by a human"
      ]
    },
    {
      "heading": "Ncom(animal,Z1) A Ncom(human,Z2) A R(awir, Z2,Z1)",
      "text": []
    },
    {
      "heading": "This becomes the Axiom",
      "text": [
        "If an individual Z1 is a pet, then Z1 is an animal and is owned by a human Z2.",
        "Thus this lexicon is a relational network model with words and lexical relations as semantic primes.",
        "Definitions are written using lexical relations and first order predicate calculus formulas.",
        "The design of this lexicon is independent of a particular representation scheme and the lexical relations we propose can be equally useful in another context.",
        "Nevertheless an overview of the semantic 63 representations is included here in order to enable the reader to understand the notation in the examples of lexical entries in the next section.",
        "Anyone who does not find notational problems attractive should skip these• paragraphs; with the exception of a few lines of formal details the rest of this paper will make sense without it."
      ]
    },
    {
      "heading": "An Overviev of the System of Semantic Representations.",
      "text": [
        "The question-answering system of which this lexicon is a fundamental part uses a first order predicate calculus system of semantic representations.. As it readsys paragraph, the system makes an internal model of the story, identifying objects and events and the relationships between them.",
        "The representations are written in a first order predicate calculus so that they can be used in an existing theorem prover (Henschen, Over-Beek, and Wos 1944)'.",
        "In a first order predicate calculus we are allowed predicates, functions, and quantifiers like \"there exists\" and \"for all\" but predicates are not allawdd to be arguments of other predicates.",
        "This particular calculus is many-sorted; that is, there are many different classes of objects in the system."
      ]
    },
    {
      "heading": "Suppose a story begins:",
      "text": [
        "Peter heard a meow.",
        "Mother said, \"The kitten is hungry.\" ,She sent Petet to the store.",
        "He bought milk and a big, red lollipop.",
        "As we process this story we need first of all to recognize the different entities in the story.",
        "Here we have seven individual objects:",
        "We can write Ncom(lollipop,X7) to signify that X7 is a lollipop since lollipop is the common noun that names X7.",
        "The story mentions two properties of the lollipop; it is big and it is red.",
        "The lexicon tells us that red is an adjective of color, so we represent this property using a functional notation",
        "records the fact that the lollipop is big.",
        "These properu,es are numbered and put on a list for convenient retrieval.",
        "We may write P1 = P(color,X7,red) P2 =2 P(sizAt,X7,big) This story also tells us some relations between entitles.",
        "\"He bought a lollipop,\" can be expressed as Ri = R(buy,X1,X7) since he refers to X1, Peter, and X7 is the lollipop.The third sentence in the story: She sent Peter to the store contains a relation R3",
        "and a property of that relation",
        "The predicate Holds is used to make assertions.",
        "To assert the third sentence we write"
      ]
    },
    {
      "heading": "Holds (P4)",
      "text": []
    },
    {
      "heading": "65",
      "text": [
        "The connection between the milk and the lollipop in the last sentence is described by an interrelation I, /(and,X6 X7) so-that the whole sentence becomes",
        "but it is applied only if some kind of inference is required from this sentence, .e.",
        "g. if a question asks, \"Did Peter buy same milk?\") To obtain these representations we, of course, need a great deal of information from the lexicon (like the information mentioned above that red is an adjective of color and that big is an adjective of size).",
        "lexical information is also used in setting up representations for questions like",
        "1.",
        "What color is the lollipop?"
      ]
    },
    {
      "heading": "P(color,X7,?)",
      "text": [
        "The answer to this question can be found by a simple matching process because the story representation already contains this kind of lexical information.",
        "A question such as",
        "2.",
        "Did Peter buy some candy?",
        "requires further lexical lookup since the word candy does not appear in the story, The answer is found using the lexical relation T (taxonomy or class inclusion) between lollipop and candy - the entry for-lollipop includes T candy.",
        "Similarly, the entry for candy includes T lollipop, where Y is the inverse or, converse relation of T, which relates the same pairs of objects in the opposite order.",
        "Likewise a multiple choice question such as 66 3.",
        "Where does milk come from: cats cows trees cars can be answered correctly using the provenience relation COMESFROM listed in the entries for milk and cow.",
        "The question",
        "4.",
        "Where did Peter go?",
        "is represented",
        "The lexicon is then used to look for coinections between go and send.",
        "The lexical entry fob send includes the information CAUSE go.",
        "The entry for the Iexioal relation CAUSE contains several axiom schemes.",
        "With send and go substituted in the correct positions we get the axioms",
        "and",
        "In order to answer the question 5.",
        "How old is the cat?",
        "we must first identify the cat in the story, that is, recognize that a kitten is a cat and then realize that it is a young one.",
        "The lexical relation CHILD is essential to this task.",
        "The definition of kitten consists of CHILD cat.",
        "The ]exical entry for cat contains CHILD kitten.",
        "The lexical entry for the relation CHILD contains axiom schemes which, when kitten and cat are filled in in the prwer places, tell us that if X is a kitten then it is a cat and it is young.",
        "That is, if Ncom(kitten,X) then Ncom(cat,X) and Nage,X,young).",
        "In addition some questions force us to look at the interaction between Mb or more lexical relations.",
        "To answer the question",
        "67 6.",
        "What animal did Peter hear?",
        "we need to know that a meow is a typical cat sound, which is expressed by the lexical relation SON, meow SON cat.",
        "We also need to know that a cat is an animal, cat T animal, and that a kitten is a young cat, al above kitten CHILD cat.",
        "This has been an extremely brief introduction to the semantic system used in the question-answering scheme of which this lexicon is a part.",
        "For those who are interested in the representations themselves Appendix I contains a brief formal presentation.",
        "A more complete description is in preparation.",
        "(M. Evens and G. Krulee, \"Semantic Representations for"
      ]
    },
    {
      "heading": "Question-Answering Systems.\")",
      "text": [
        "Lexical relations, we are convinced, are an extremely useful addition to any lexicon, whatever the underlying semantic system.",
        "The axioms which are associated with each relation.",
        "of course, have to be expressed in the semantic representations of the system in which the lexicon is being used."
      ]
    },
    {
      "heading": "6. THE FORM OF THE LEXICAL ENTRY",
      "text": [
        "The most crucial step for the lexicographer is the design of the lexical entry.",
        "Somehow all the different kinds of lexical information previously decided upon must be neatly packaged into a compact, consistent, and accessible package.",
        "The lexicon is a large network in which the nodes are lexical entries and the arcs are lexical relations.",
        "Lexical entries can be found from.",
        "an alphabetic list, so that the network may be entered at any point.",
        "There is a subnetwork containing lexical relations and their logical properties."
      ]
    },
    {
      "heading": "68",
      "text": [
        "Each entry begins with the letter string which names it.",
        "Homographs are numbered 1,2,3,... to prevent confusion.",
        "Thus, isaearl is the adjective, clear2 is the verb 'to become clearli, and clear3 is the verb In cause to clear2' or 'to cause to become ciearl'.",
        "Entries contain",
        "(i) Category - Part of speech, sort, lexical relation, etc.",
        "(ii) Irregular inflectional morphology.",
        "This latter is stated in terms of a special set of lexical relations PAST, PP (past participle), and PLUR(al) are the only ones needed for our simple database.",
        "The lexical entry for make includes PAST - made, PP - made.",
        "Made has a separate lexical entry but a very short one made PAST - make PP make The lexical entry for child includes PLUR ckadren, the lexical entry for children consists of: children PLUR child",
        "(iii) Lexical relations and pointers to their values in the form of attribute-value pairs.",
        "The lexical entry for puppy contains CHILD - dog.",
        "The lexical entry for dog contains CHILD - puppy.",
        "The lexical entry for the lexical relation CHILD tells us how to interpret these.",
        "It contains an axiom scheme which when filled in tells us that X is a puppy if and only if X is a dog and X is young NcOm(puppy,X) means that Ncom(dog,X) and also P(age,X,ygung).",
        "Information often classed as",
        "derivational morphology will be included here, the lexical entry for 69 soap, for example, contains AWN soapy Some of this derivational information could be stated instead in general rules and probably should be in any larger data base.",
        "(.10- Parameters appropriate to particular categories.",
        "(v) Definitions.",
        "These are in the form of logical inferences that may be drawn when a given word is used, and which are idiosyn",
        "cratic enough not to be coded in terms of lexical relations.",
        "Only a few words have definitions.",
        "Puppy, for example, does not because the information that a puppy is a young dog is indicated by the lexical relation CHILD - dog.",
        "Pet, on the other hand, has a definition"
      ]
    },
    {
      "heading": "Ncom(pet,Z1) Ncom(animal,ZDA Ncom(human,Z2) A R(own,Z2,Zi)",
      "text": [
        "When this definition is retrieved it is transformed into the axiom Holds (Ncom (pet ,Z1))-' holds Ncom (animal ,Zi) ) A Holds Mom (human , Z2) ) A Holds ( R (own , Z 2 , Zi) ) In other words, if some individual Zi is a pet, then Zi is an animal owned by some human Z2, Omitted from this lexicon are the examples which are an important and valuable part of other dictionaries.",
        "This system does not have the generalizing power to use examples effectively and, in addition, they occupy a great deal of space.",
        "The most natural way of handling examples in such a model might be to accumulate them from semantic representations of sentences which the system parses.",
        "The task of organizing, pruning, and generalizing from examples is too formidable to tackle here."
      ]
    },
    {
      "heading": "Count/Mass Counto Mass",
      "text": [
        "Originally, following Winograd, the number and count features were combined into a single feature with three values: singular, plural, and mass.",
        "But McCawIey has recently (1975a) given examples of plural mass nouns: clothes guts, brains, etc.",
        "It is impossible to argue with counterexamples from everyday langu&ge.",
        "The feature information can le expressed compactly as a vector of l's and 0's."
      ]
    },
    {
      "heading": "Gender Animateness Number Count",
      "text": [
        "M F N HAI S P C M Ted 100 100 1 0 1 0 puppy 111 110 1 0 1 0 sugar 0 0 1 0 0 1 1 0 0 1 fish 111 010 1 1 3 1 boat 011 011 X 0 1 0 clothes t 0 1 0 0.t.1 0 1 0 1 71 These features are used to determine pronoun choice, for example, not to provide semantic information.",
        "Puppy is marked as having the feature human so that the system can parse \"the puppy who barks\" and \"the cat"
      ]
    },
    {
      "heading": "who walks alone.\" Definitions for nouns begin with the specification of the function,",
      "text": [
        "Ncom or Nprop;",
        "Smith and Maxwell 41977) include here commonly understood metaphorical extensions, metaphorical cliches (e.g. pitch=hell).",
        "These also can be expressed by lexical relations (cf. the Soviet Figur function which gives figurative forms; presumably pitch Figur hell).",
        "No obvious ones occur in this data base, so that this item is not currently included.",
        "Sample entry for puppy: Category: common noun"
      ]
    },
    {
      "heading": "Relations: S pup",
      "text": []
    },
    {
      "heading": "CHILD dog",
      "text": [
        "Parameters: 111 110 10 10 The relationship puppy T animal is not includ rd.",
        "It can be inferred from puppy CHILD dog and dog T animal rtma omission of relationships which can be easily inferred saves space but costs time.",
        "It is probably the case that people actually store these relationships directly.",
        "The fact that most, if not all, puppies in the child's world are pets is not stored either.",
        "This is open to question."
      ]
    },
    {
      "heading": "RECK owner",
      "text": [
        "Parameters: III 110 10 la"
      ]
    },
    {
      "heading": "Definition: Ncom(Pet,Z1): Ndom(animalp4) A Ncom(human,Z2) A R(own,Z2,Z1)",
      "text": [
        "The word owner definitely belongs in the lexical universe of pet: We can recover it from the presence of own in the definition and the fact that owner TEXPER own.",
        "In a child's world, though, the pet-owner relationship seems to be a reciprocal kinship relationship like daughter-mother.",
        "Non-Copula Verbs Every non-copula verb entry includes case information, in the form of a list of one or more arguments.",
        "For each argument we need four pieces of information: (i) How it is realized syntactically: subject, object, or a list of prepositions.",
        "(ii) The case(s) involved.",
        "(iii) Whether the case must be explicitly speciriea whether it is optional and unnecessary (OPT), or whether when absent it must be understood (ELLiptical).",
        "(iv) Selection preferences: the top node of the taxonomy subtree.",
        "(The classification names in (iii) are borrowed from the SPEECHLIS project, Nash-Webber, 1974).",
        "The elliptical cases belong to verbs 73 whirl Chomsky (1965) marked [-f-objEct-deletion], which allow the object deletion transformation.",
        "Such verbs are eat and read where the object is easily understood.",
        "But this phenomenon also occurs with other associated noun phrases, not just the object.",
        "The sentence"
      ]
    },
    {
      "heading": "John and Mary gave an alarm flock.",
      "text": [
        "begs for a dative-experiencer in isolation, but sounds perfectly appropriate in answer to the question What did John and Mary give the Andersons for a wedding present?",
        "For give both the object and the experiencer may be deleted.",
        "A sign on the door sayAhg \"We gave\" is acceptable because everybody understands that it means \"We gave money to the United Fund \" For buy the arguments are i ii iii iv"
      ]
    },
    {
      "heading": "1 Subject agent, source OBL human, organization. 2. Object objective OBL thing (In the Wall Street Journal dialect this argument is ELLiptical.) 3. From source OPT human, organization. 4. For instrument OPT money",
      "text": [
        "For give, they are",
        "1.",
        "Subject agent, source OBL human, organization.",
        "2.",
        "Object objective ELL thing 3.",
        "To, Object experiencer ELL human, organization.",
        "The next item tells us whether a verb is an actior verb or hot (ACTION).",
        "Action verbs and adjectives can appear in imperative",
        "The next item tells us whether the verb allows a regular passive or not.",
        "Only thobe which do not allow a passive are marked.",
        "Aprdsyan, Mel'&ik, and olkovsky treat this also using lexical relations.",
        "Eventually this will probably be computable.",
        "from other information in the entry.",
        "Some important items apply only to verbs that take sentential com-pltments.",
        "This includes the complementizer(s) the verb takes and whether or not it allows not-transportation.",
        "The possible complementizers are."
      ]
    },
    {
      "heading": "THAT Mother said that Mike should move. FORTO Mother told Mike to move.",
      "text": [
        "John said that Mary hadn't gone.",
        "This complementizer information is coded by adding to the entry: THAT, FORTO, ING, FROM, or NOT, as appropriate.",
        "The next item is the implicational structure of the verb.",
        "There are seven such verb lasses and an eighth wastebasket class from which no inferences can be made (Joshi and Weischedel 1973; Karttunen 197c0; Kiparsky and Kiparsky 1970); see table 3.",
        "In this system factives are the unmarked case since we always assume that we can assert arguments unless we are explicitly told not to.",
        "The lexical entry for each verb which :an take a predicate complement and which is not a factive is not a tactive is marked with its class name.",
        "Each class name appears in the lexicon with its appropriate inference pattern.",
        "For a negative-if verb, for example, this is: If R(V,Z1,S) can be asserted then S can be denied.",
        "The next)to last item is the performative classification.",
        "The classification used is that proposed by McCawley (1975b) as an extension to the work f Austin and Vendler: Verdictive, Operative, Advisory, Imperative Commissive, Behabitive, Expositive (1-7).",
        "This is really, a.luxury fri a recognition-only system for children's paragraphs.",
        "The only speech-act verbs involved in our data are say and tell.",
        "Per-formative classification dyes interact with syntax (especially modals), 77 particularly in use with \"would like to\", \"would\", \"will.\", and \"let me\".",
        "The last item tells whether a verb takes indirect question (IQ).",
        "It is probably the case that when factivity and performative structure are understood, this item will be predictable.",
        "The IO verbs are apparently all expositives, but not all expositives are IQ's and the IQ classification seems to cut across Maawley's subclassification of the expositives."
      ]
    },
    {
      "heading": "Presuppositions are included in the definition, at present, rather",
      "text": [
        "than as a separate item.",
        "Sample entry for bakel: (The cake baked in the oven.)",
        "(The rock baked in the sun.",
        "Category: noncopula verb"
      ]
    },
    {
      "heading": "Relations: CAUSE bakes",
      "text": [
        "Sample entry for bake2• (Mother baked a cake.",
        "Category: noncopula verb"
      ]
    },
    {
      "heading": "Relations: T make CAUSE bake1 TAGENT baker TLOC kitchen",
      "text": [
        "(that is, if someone tells somebody to perform an action then he is saying that he orders that person to perform the action.)",
        "Copula Verbs: These are marked as verbs of perception or verbs of motion as appropriate if they are not of the 'be-become-seem' variety.",
        "Verbs of perception are marked with the perceptual sphere.",
        "This helps to construct appropriate semantic representations.",
        "There is a close relation between the following sentences and we need to make inferences from one to another.",
        "Sally listened to the trumpets.",
        "(active Sally heard the trumpets.",
        "(cognitive) The trumpets sounded beautiful to Sally.",
        "(flipped) The third sentence is called flipped because its arguments are switched from those in the first two.",
        "Sound is the flip perception verb for hear £cf.",
        "Rogers 1972).",
        "Thus, the entry for the copula verb Sound Is marked: type - perception sphbre - aural flip - hear Adjectives: The first special item for an adjective is the primitive concept.",
        "For red it is color; For big and small it is size.",
        "The second item is the selection preference.",
        "For red it is thing; for big it is thing, thought.",
        "The selection preference could probably be stated once in the entry for the primitive concept and not repeated.",
        "Since it is useful to have it readily available in parsing, it is 80 included separately in every adjective entry.",
        "With adjectives as with verbs we often have causally related homographs.",
        "The warm in \"warm coat\" has a different meaning from the warm in \"warm pie.\" A warm pie has a temperature greater than room temperature, but a warm coat makes you warm.",
        "These are called warm and warm2 ►and are connected by warm2 CAUSE warms.",
        "How does one recognize which is which?",
        "If the head noun is clothing or one of the 'furnace-stove-oven' family or indeed anything else which has function heat, warm2 is assumed.",
        "Adjectives, like verbs, are marked 'Action - Yes' or 'Action - No' Lexical entries For adverbs are very much like those for adjectives.",
        "The Main strategy 'followed in the design of the lexical entry has been to make it as compact as possible.",
        "It seems likely that more information will have to be added later."
      ]
    },
    {
      "heading": "7. SUMMARY",
      "text": [
        "This lexicon is designed to serve as the global data base for a computer question answering system.",
        "It is therefore an integrated lexicon-encyclopedia, storing information needed for parsing, for development of an internal model, and tor making inferences.",
        "Syntactic and semantic information are integrated into each entry.",
        "Lexical entries are provided for all words which appear in the text except for those derived forms whose roots can be recovered by a trivial computation.",
        "Thus there are entries for went and gone but not for goes and going, for unwanted but not for wanted.",
        "Entries are also provided for some word combinations, such as birthday cake and thank you.",
        "Lexical entries-are tied together by lexical-semantic relations which provide the 81 internal structure df the lexicon.",
        "Relations present both practical advantages and theoretical charms.",
        "The most immediate practical advantages appear in the mechanisms for saving space.",
        "Relations allow us to abbreviate enigies, to state axiom schemes once and produce particular axioms only when they are needed, to include selection preferences in a compact form.",
        "They are in one sense a generalization of defining formulae already present in commercial dictionaries.",
        "Thus mere is a possibility that we can extract some relation values automatically from existing dictionaries (cf. Smith and Maxwell 1977).",
        "From a theoretical,standpoint relations provide a model of lexical memory with some modicum of psychological reality.",
        "Lexical-semantic relations and the theory of semantic fields suggest a tentative approach to the problem of identifying the context, of finding the right frame or script."
      ]
    },
    {
      "heading": "Appendix T. The Semantic Representations.",
      "text": []
    },
    {
      "heading": "This is a somewhat more formal description of the system of seman-1",
      "text": [
        "tic representations described informally in Section 5.",
        "(more details may be found in M. Evens and G. Krulee, \"Semantic Representations for Question-Answering Systems,\" in preparation).",
        "The representations are currently written in a many-sorted first order predicate calculus with individual constants and variables, function constants, and a predicate constant."
      ]
    },
    {
      "heading": "(1) Individual constants of each sort.",
      "text": [
        "The object constants are written X1, Each corresponds to a unique object in the story.",
        "Most of the time this example will be abbreviated \"R(hit,X1,X2)\".",
        "Unspecified arguments are often omitted for convenience in writing.",
        "Within the system they are represented by variables and thus will match anything.",
        "If the story says, \"Donna sang a song\", the internal representation is R(sing,X3,X4,Z1,Z2) with Nprop(Donna,X3) and Ncom(song,X4).",
        "The notation 'P1 =P(manner ,X1,kind)\" merely indicates that P(manner,X ,kind) is the first property formed in the representation of a particular story.",
        "Both noun and verb phrase complements are represented by writing the subordinate relation or property as an argument of the formula which represents the main clause Relative clauses are represented as interrelations.",
        "Clauses introduced by relative pronouns arse ordinarily treated as conjoined main clauses.",
        "Po] adverbial clauses the conjunctive adverb serves as interrelational operator I(when,Si,SJ) or /(because,Si,SJ).",
        "Generic-relatives and other types of generic expressions are treated as conditions.",
        "(6) Lists and tbe Model of the Story World",
        "As the system reads the story it forms a model of the world the story describes.",
        "The representations developed here are organized in five sepatate lists"
      ]
    },
    {
      "heading": "Lists of Interrelations",
      "text": [
        "We have cleaned the folioxing sorts.",
        "For each sort we have 4pRe constants and an infinite supply of variab3es."
      ]
    }
  ]
}
