{
  "info": {
    "authors": [
      "Robert F. Simmons",
      "Gordon Bennett Novak"
    ],
    "book": "ACL Microfiche Series 1-83, Including Computational Linguistics",
    "id": "acl-J79-1018",
    "title": "Semantically Analyzing an English Subset for the Clowns Mircoworld",
    "url": "https://aclweb.org/anthology/J79-1018",
    "year": 1979
  },
  "references": [],
  "sections": [
    {
      "heading": "SEMANTICALLY ANALYZING AN ENGLISH SUBSET FOR THE CLOWNS MICROWORLD",
      "text": [
        "Copyright 1975 Association for Computational.LingulAticq 2 ABSTRACT A microworld system is described for displaying visual representations of the meaning of a subset of English thaticon-cerns a clown that can balance objects and can participate in motion scenarios.",
        "Nouns such as \"clown\", \"lighthouse\", \"water\" etc.",
        "are programs that construct images on a display screen.",
        "Other nouns such as \"top\", \"edge\", \"side\", etc.",
        "are defined as functions that retiarn contact points for the pictures.",
        "Adjectives and adverbs provide data on size and angles of support.",
        "Prepositions and verbs are defined as semantic functions that explicate spatial relations among noun images.",
        "generally, a verb produces a process model that encodes a,series ofiscenes that represent initial, intermediate and final displays of the changes the verb describes.",
        "The system is programmed in UTLISP for CDC equipment and uses an IMLAC display system.",
        "Itl Currently occupies 3210K words of core and requires less than a second to translate a sentence into a picture.",
        "Applications,to teaching linguistics and languages are suggested.",
        "• • • • .",
        "• , 9 • • .",
        "13 • .",
        ".",
        ".",
        "18 .",
        "• .",
        "19 .",
        "• .",
        ".",
        ".",
        ".",
        ".",
        "25 • • • .",
        "• .",
        ".",
        "26 • • • • .",
        "• .",
        ".",
        "27 • • Oa, • • • • .",
        "36 .",
        "• • .",
        "• • .",
        ".",
        "39 • .",
        "• • .",
        "• • .",
        ".",
        "43 • .",
        "• • • • • • .",
        "45 • .",
        "• 10"
      ]
    },
    {
      "heading": "SEMANTICALLY ANALYZING AN ENGLISH SUBSET FOR THE CLOWNS MICROWORLD I Introduction",
      "text": [
        "Several examples of semantically based grammars have appeared in the literature since 1970.",
        "The moat complete of these are Winograd's (1972) outline of a systemic grammar for commanding and questioning the robot hand in the MIT blocks world,, Heidorn's (1972) rewrite rules for analyzing and generating English descriptions and transforming them into GPSS programs, and the ATN grammar of questions for the.Lunar Rocks Data Base presented by Woods, Kaplan and Nash-Webber (1972).",
        "Most other grammars of significan size, such as that of the NYU String Analysis Project (Grishman and.",
        "Sager 1973) and numerous grammars developed for mechanical translation are largely syntactic in orientation and not easily accessible.",
        "Riesbeck also presents a semantic grammar in the form of a set of LISP programs to comput conceptual dependencies (1975).",
        "A difficulty with these reports is that the systems using the grammars are typically-quite large programs--100K+--and the interactions between the grammar and the rest of the system are frequently quite complicated.",
        "The reader who wishes to use them as a basis for constructing a small natural language understanding system may well be at.a loss as how to•begin.",
        "He may have the impression that a natural language processing,system is a vast undertaking involving great complexity of programming.",
        "He will not be completely incorrect in these impressions, but in fact prgramming a grammar and semantic system for a micrdworld model to understand a small subset of English is no longer a formidable task.",
        "the b vocabulary can 'be restricted to one hundred or so words, a minimally sufficient syntactic and semantic system can be expressed in a few dozen rules supported by a dozen or so semantic functions, and the pragmatics of such microworlds as the STRIPS robot, the blocks world, or the CLOWNS world presented here, can be modelled very simply.",
        "The simplest microworld models that communicate in English require an effort somewhere between a two week homework exercise and a graduate term project.",
        "CLOWNS represents about 6 man-months of effort so far.",
        "But is there any real purpose in studying English communication in these trivial microworld situations?",
        "If we Adel language behavior in one microworld we remain several orders of magnitude short of understanding the general use of the language in text, or in verbal discourse and equally far from the possible goal of instructing computers in English to accomplish a general run of tasks.",
        "I remain incurably optimistic.",
        "The generalizations about tiny subsets of language and behavior that emerge from microworld models gradually accumulate in Our human minds into what may eventually prove sufficient understanding fbi- the accomplishment of ,socially useful tasks.",
        "The initiation ritual of programming a mini-intelligence is a recessary prerequisite to programming one that is more sophisticated.",
        "In this paper, CLOWNS, a simple microworld model is presented with an explicit tutorial intent.",
        "A brief grammar is described that accounts for much of the embedding logic of English constructions; a system of transformations of English constituents to property list representations of",
        "semantic network structures is followed by their representation in a dynamic process model that can be operated to produce successive states described by the English.",
        "The principles used in the system area concise representation of my gleanings from recent literature And of course from work of my own and my students.",
        "II Background In this section only a few o hundreds of natural language processing papers are suggested as entries to thelliterature.",
        "At least a dozen reviews of this literature are available; Walker's is not only among the most recent and complete (Walker 1973), but it includes a section that cites the reviews.",
        "Since 1970, the language processing literature has been rich in reports of natural language systems that can understand subsets of English with respect to various microworlds.",
        "In addition to previously mentioned work by Woods, Heidorn and Winograd, there are less frequently cited but quite interesting theses by Badre (1972) that learns to do very simple number problems from text, by Scragg (1975) that answers questions about food preparation processes and by Bruce (1972) that presents a logic and a system for answering questions about temporal reference.",
        "Schank Riesbeck, Goldman and Rieg.er (1975) have published a significant series of papers on semantic parsing., inference and generation for an English subset concerning fairly ordinary human actions.",
        "Hendrix, Slocum and Thompson (1973) describe, a system for understgnding and generating English about commercial transactions and Simple movements.",
        "Hendrix (1975) has also developed a set theoretic system of process models for representing natural language meanings.",
        "These models are descended from robot problem solving research by Fikes and Nilsson",
        "that useh problem solving, inference and learni4 methods to teach a robot facts about its micraworld.",
        "Hobbs (1974) presents an hpproach to natural language.",
        "semantics that is shown to apply to several applications, diagrams-to-language,, English and Algol-to-Algol, etc.",
        "Much of the most recent work by Abelson (1975), Charniak (1972), Schank and Abelson (19'75),, Minsky (1975)., Winograd (1975), Bobrow and Norman (1975), Collins and Warnock (1975), Rumelhart (1975) has progressed beyond the question of grammar and semantic systems to that of such larger units of semantic organization as Frames, Story grammars, Plans, Schemes, Dremes, etc.",
        "Although at this writing most of these formulations still fall short of computational realization, it is clear that the research task of the immediate future is one of formulating and programming structures of organizationtthat will successfully model much more complicated microworlds than those presently achieved.",
        "A forthcoming book edited by Collins and Bobrow will present many of these ideas.",
        "LISP is still the language of most frequent choice for these experiments and thanks to the prevalence of virtual memories and virtual LISP,,the limitation to in,-core implementations has essentially vanished.",
        "M*1y of the programs cited used require from 100 to 300K10 cells of storage.",
        "The system described in subsequent,sections resides in 32K on a CDC system, although our most recent additions have caused us to use a virtual memory version of UTLISP that was developed by-Mabry Tyson."
      ]
    },
    {
      "heading": "III Pictorial Models",
      "text": [
        "Ignoring early work largely lost in the archives of corporate memos, Winograd's language processor is essentially a first reporting of how to map English sentences into diagrammatic pictures.",
        "Apart from potential applications, the pictures are of great value in providing a universally understood second language to demonstrate the system's interpretation of the English input.",
        "While we are still struggling in early stages of how to compute from English descriptions or instructions, there is much to be gained from studying the subset of English that is picturable.",
        "Translation of English into other more general languages such as predicate calculus, LISP, Russian, Basic English, Chinese, etc.",
        "can provide the same feedback as to the system's interpretation and must suffice for the unpicturable set of English.",
        "But for teaching purposes, computing pictures from language is an excellent instrument.",
        "We began with the notion that it should be quite easy to construct a microwQrld concerning.a clown, a pedestal, and a pole.",
        "The resulting system could draw pictures for such sentences as: A clown holding a pole balances on his head in a boat.",
        "A clown on his arm on a pedestd1 balances a smell clown on his head.",
        "Figure 1 shows examples of diagrams produced in respotte'to these sentences.",
        "We progressed then to sentences concerning movement by adding land, water, a lighthouse, a dock and a.boat.",
        "We were then able to draw pictures such as Figure 2 to represent the meanings of: our •,• 4.",
        "1r • MI MAIM ea wi ■ ILO",
        "A clown on his head sails a boat from the dock to the lighthouse.",
        "In the context of graphics, two dimensional line drawings are attractive in their 'Simplicity of computation.",
        "An object is defined as a LOGO graphics program that draws it (see Section VI) A scene is a set of objects related in terms of contact points, A scene can be described by a set of predicates",
        "Orientation functions for adjusting starting points and headings of the programs that draw the objects are required and these imply some trigonometric functions A LISP package of about 650 lines has been developed by Gordon Bennett to provide the picture making capability What is mainly relevant,to the computation of language meanings is that a semantic structure sufficient to transmit data to the drawing package is easily represented as a property list associated with an artificial name for the scene For example, A CLOWN ON A-PEDESTAL\" results in the following structure (Cl, TOK CLOWN, SUPPORTBY C2, ATTACH(C1 FEETXY C2 TOPXY)) (1C2, TOK PEDESTAL, SUPPORT Cl, ATTACH(C2 TOPXY Cl FEETXT)) (CLOWN, EXPR(LAWA() .)",
        "FEET XY, SIZE 3.",
        "STARTPT XY, HEADING A) (PEDESTKL, EXPR(LAMBDA() ) TOP XY, SIZE 3, STARTPT XI, HEADING A) A larger scene has more objects more attach relations, and may include additional relations such as INSIDE, LEFTOF, RIGHTOF, etc In any case the scene is, semantically represented as a set of objects connected by",
        "relations in a graph (1 e a semantic network) that can easily be stored as a property list with references to other objects with property lists We take \"balance\" stand' \"support \"hold' is on\" etc.",
        "as state describing verbs in contrast to those such as \"sail\", 'ride' , fly' \"buy etc which describe changes of state To model the meaning of state verbs requires only a single diagram to show the state described For change of state verbs a series of pictures'is required and a process model is used to construct a sequence of state descriptions each of which can produce a diagram IV An English Subset Grammar We take the Woods ATN as a basic formalism for describing a grammar computationally This system has been well-described by Woods (1970), its application to English semantics by Simmons (1973) and a UTLISP version was programmed by Matousek & Slocum (1972) While generally ignoring theoretical issues in linguistics, we do use such principles as the fact that sentences are composed of constituents, that there are syntactic rules defining acceptable sequences of constituents, and that.",
        "underlying the English statement there is an idea that can be expressed in some other language by transformations on the English constituents The underlying idea can be expressed in a formal language such as some version of predicate logic, or in a computer data structure cm in a language of functions and arguments such as LISP or PLANNER In presenting the_following grammar and semantic system cur emphasis Is on dealing with the highly ,Jariable nature of Fnglish embeddings This means that we have been more interested in the many forms of dependent",
        "clause – prepositionh phrase, relative clause, infinitive, participial phrase, relative cpniunetive clause, etc. – than in the fine detail on noun phrase, noun-noun combinations; and the fine, grain of verb strings, We have also for the moment ignored ordinary conjunctions in view of the clear treatment offered by Woods, Winograd, and Grishman; each of whom points out that an and or an \"or\" triggers a special subgrauimar that attempts to find a structural repetition of a constituent that was lust completed.",
        "Because of our interest in embeddings we have chosen to consider relative clauses at the toplevel of the grammar where possible.",
        "The following constituent description defines a very fluid subset of English with great potential for embeddings.",
        "or more x sjor , means IIorII,tmeans etc.",
        "; And x/y means x is the initia 'element of y.",
        "The arrow,-)- means \"defined by\".",
        "The form of notation above _is a concise recursive description for the",
        "ordering of constituents.",
        "It shows nothing about the semantics that may be included in the system, and the flow of control for parsing is not at all obvious.",
        "Augmented Transition Network graphs following Woods show the",
        "conditions, on elements of the sentence and the flow of control in terms of directed arcs leaving-nodes in a two-dimensioned diagram of the grammar Even more importantly, an ATN provides for the display of semantic operations that are to be undertaken on each constituent.",
        "The convention for drawing an ATN is to write conditional statements above the arcs, and operations below.",
        "For example: 16.",
        "In this net, if the sentence begins with an NP, the PUSH NP will return the structur'e of an NP in the * register.",
        "At that point the register gUBJect is set to 'that value.",
        "When a VString is analyzed, by PUSH VS 'then V is set to the value'VS returned.",
        "At this point further structure is built-by PUTting on the verb's property list the attribute SUBJ with the value contained in the register SUBJ.",
        "Similarly, when an OBJect NP is parsed, it can be added to the structure of V and, the value of S can be POPped--i. .",
        "returned--as the register Ar,which will allow access to the property list of the verb on which the values of subject and object can be found by consulting those properties as in (GET (LAST(GETR V)) \"SUBJ).",
        "The function LAST is used in thiS example to obtain the last element of a list.",
        "Notice this example illustrates that our general approach to recording .semantic information is one of putting detailed information such as the arguments or cases of a verb on the property list of that object.",
        "Thus the result of parsing \"clowns hold, poles\" with the above net is:"
      ]
    },
    {
      "heading": "(HOLD SUBJ CLOWNS, OBJ POLES)",
      "text": [
        "In,fact, it is necessary to create new names tor each word used in a 17 sentence--to avoid clobbering dictionary information--so the result from actual nets would be:",
        "Tlierelation TOK shows that Cl is an instantiation of-the lexi&al item HOLD.",
        "In this convention for stating property list values, the first element is the ATOM and each pair separated by commas ig an ATTRIBUTE and its VALUE.",
        "The Woods system also stores its past states and provides for backup in the Frcient that no conditional arc succeeds and yet there IS still sentence to be scanned., In this event the system recursively consults the state leading to the current node'to see•if there were arcs that were untried that lead to a successful parsing for the sentence string.",
        "The * register has special significance in that ordinarily it contains the sentence element under the scanner, except when a subnet such as NP returns a value, in which case the POP arc sets the value in the * register.",
        "The overall flow of control through an ATN is that * is set to the first element of the sentence, then the topmost net, CLAUSE or Si applies the grammar in topdown fashion.",
        "Each time a constituent a word, a.phrase, a clause--is recognized and control is passed to another nodes the scanneris advanced and parsing proceeds from the new node.",
        "For programming simple grammars without much embedding and without backup capabilities an ATN may be t4sed as a flow chart to design the program.",
        "If more complex grammars are required, Woods has provided complete set of language conventions and an Interpreter with the capability"
      ]
    },
    {
      "heading": "of storilag past states and backup.",
      "text": [
        "texicOnc English wprds, their Word classes and features and other information such as program definitions etc.",
        "are recorded on a property list structure for easy access by functions used in the ATN.",
        "The following examples illustrate this structure:",
        "The function (PUT X Y Z)--e.g. (PUT \"CLOWN \"NBR \"SING)--will add the pair (Y Z) to the atom X or replace the value of X's attribute Y with the new value Z.",
        "The function (GET X Y) will then return the value Z.",
        "Such ATN functions as CAT and GETF simply call GET with the first argument set to the value of the word under the sentence scanner.",
        "The EXPR values associated with an English word are semântic functions that are explained later.",
        "Many modifications to this simple scheme can be added to provide for morphological variants referring,to root forms instead' of requiring a, definition .off theirown, and an attribute; FOLLOWEDBY, can be used to collect multiple word terms.",
        "The basic property list representation of a dictionary can be expanded to include multiple word senses as well, but it always retains the character of a basic LISP system for storage and retrieval of data associated with an atom.",
        "Grammar: This is the toplbvel net for the grammar.",
        "It is named clause and transfers control to states Cl and C2 each of which can POP a value in the event that the sentence string has been completed or a clause successfully parsed.",
        "The barred pointer,14+ Indicates a HOP, operation which passes control without advancing the sentence scantier or changing the * register.",
        "This net accepts sentences beginning with an NP, a VP or a dependent clause.",
        "HD is the name of a register that generally contains the last constituent found.",
        "The UNHOLD arc emanating from Cl causes a list, HOLD, to be processed.",
        "HOLD contains Dependent Clauses that are missing some element that delays their semantic processing.",
        "Felx example, \"on his nose\" in \"on his nose a clown balances\" cannot be sema04cally processed until \"clown\" shows up as a following NP.",
        "The net is satisfied by a sentence or-by a single noun phrase such as \"a clown in a boat\" dr by an imperative, \"balance a pedestal\".",
        "It ddes not accept question forms; that would require an additional arc from CLAUSE labelled, PUSH QFORM SNTC.",
        "The ordinary form of an arr is an arc–label such as CATegory, PUSH, POP, TST followed by its argu= ment, followed by any.condition statement.",
        "SNTC is simply the variable that 20 contains any remaining sentence string, so the condition SNTC is true except when the string has been.",
        "exhausted.",
        "If SNTC is nil, there is no point in further processing.",
        "The arc PUSH VP (SENDR SUBJ),will send the value of the register SUBJ to the pubnet VP,* If VP is successful, the operation under the arc (EVAL-((GET * TOK) * )) will can.",
        "for a function associated with the verb to translate the subject, object and complements of the sentence into the particular semantics of pictorial relations.",
        "The verbs SUPPORT, SAIL, and MOVE are defined as semantic functions in section V. Pre-\" positions are also defined as semantic functions in that section.",
        "When HD is popped from Cl or C2 it contains the name of an object on.the property list as described earlier.",
        "The result of a parse is an atom name whose property list contains labelled references to its arguments which are either symbolic or numeric values, or Teferences to other atots which have property lists.",
        "This of course is a property list representation of a semantic network.",
        "This NP net is operated dh the tall, PUSS` NP T. It allows for a pronotiwor a sequence of (arMadj*) N. Its operation includes some basic semantic transformations on the head noun.",
        "If the sentence begins with an-ARTicle, the determination is set to DEFINITE or INDEFINITE depending on what feature GETF finds associated with it.",
        "A pronoun implies definite determination, and a noun phrase without,an article implies indefinite except, in the case of proper nouns not considered in this net, Adjectives are appended to a list named MOD.",
        "When the noun head is encountered, MAKETOK creates an atomic name CI using the LISP function (GENSYM C) and puts on its property list, the pair, TOK WORD.",
        "The remaining operations under the CAT N arc add property value pairs to this TOKen of the noun.",
        "From NP2 the arc, POP HD (PUTMODS HD), is encountered.",
        "PUTMODS is a semantic function that works with adjectives and adverbs in the following fashion: An adjective, e.g. big, has the following lexical structure: (BIG ADJ I, POS T, TYPE SIZE, VALUE 7) PUTMODS will for each adjective obtain the TYPE and VALUE and put them on the noun's property list.",
        "Thus, \"a big red clown\" results in: (C1 TOK CLOWN, DET INDEF, NBR SING, SIZE 7, COLOR 1) where COLOR 1 assumes that some mechanism for assigning colors likes numbers as inputs, even as the drawing programs require numerical values for SIZE.",
        "The result of parsing a noun phrase with this'network is to return the semantic structure of an object as a set of property-value pairs associated with the name Ci which is a token of the word used.",
        "The net is not sophisticated as NP definitions go, much more complete grammars of the NP are"
      ]
    },
    {
      "heading": "offered by Winograd and Woods. The lack of a continuation into a modifying",
      "text": [
        "clause such as a PP or reldtive clause is deliberate in that we prefer to return control to the structure calling the NP so that its syntactic",
        "This VP net fi'rs't pushes a VG, verb group.",
        "VG is not shown in this discussion, but it scans the sentence string for an acceptable sequence of auxilaries, and adverbs dominated by a verb.",
        "It makes a token of the verb and puts its tense and auxiliaries on that token as property value pairs.",
        "It returns the token name.",
        "In exiting node VP1 we setk an NP as a syntactic OBJect and finding one, add the subjgct and object as properties of the-ver*.",
        "If no NP follows the verb, the next arc tests to determine whether the verb is a passive form and if so sets the flag PASV, sets object to subject, and subject to nil.",
        "If a \"by\" prepositional phrase follows, it becomes the subject.",
        "Additional modifying phrases are picked up by the DCLAUSE loop.",
        "No actions are associated with PUSH DCLAUSE arcs 23"
      ]
    },
    {
      "heading": "because each DCLAUSE calls semantic routines that bind the modifier to",
      "text": [
        "the noun or verb it modifies--frequently not the one it immediately follows.",
        "The VP net accepts a verb, a verb group, or a verb group followed by an NP and a string of PPs or other modifying clauses.",
        "It lacks the case of two NPs to account for direct and indirect objects.",
        "relative pronoun clauses, infinitive modifiers, participial clI'uses and clauses introduced by relative conjunctions.",
        "A PP is one or more prepositions followed by an NP.",
        "A RELCONJ starts with an RCONJ such as \"while\", \"after\" etc.",
        "and may be followed by a DCLAUSE or a CLAUSE.",
        "A relative, pronoun clause begins with an optional relative pronoun and is „followed by a pronoun clause which is either a VP or an NP followed by a VG an& optional DCLAUSES.",
        "For the moment we insist for computational economy that a relatiIe clause he introduced by a relative pronoun; actually the form of a pronominal clause is sufficiently well defined that PUSH PRONCLAUSE can identify it",
        "phrase is modifying.",
        "As in PREPMATCH, the head noun is frequently not the one just preceding the modifying phrase.",
        "and-the particular verb and its ending are, used, in choosing its head noun or verb.",
        "GLST is the name of a list of candidates.",
        "In the event that the DCLAUSE is a relative pronoun or a participial or infinitive construction, the final step is to call the semantic function associated with the verb and evaluate it for the subject, object and complement arguments.",
        "DCLAUSE i8 undefined for adjectival and adverbial clauses that can be used as modifiers.",
        "When defined they can be added as additional arcs.",
        "This abbreviated PP' net is presented to call attention to its method for accepting a string of prepositions and for accomplishing the semantics by calling PREPMATCH.",
        "Although Section IV concerns semantics, it is worth noting that the ettect of PREPMATCH is to add information to the semantic structure representing a noun or a verb.",
        "For exapples: \"a clown on a pedestal on.",
        "his nose \" (C1 TOK CLOWN•, SUPPORTBY #PEDESTAL, BALPT #NOSE) \"...balances on a pedestal on his nose\" (C2 TOK BALANCE, TENSE PRESENT, COMPS(#PEDESTAL #NOSE)) Thus if a verb intervenes between a noun and prepositional phrases that might Modify it, the PPs become COMPlements to the verb under the attribute COMPS, and the verb's semantic function has the task of relating it to other elemtas of the sentence.",
        "V Semantics of the Subset Parsing a sentence with the ATN grammar just described results in a set of symbols each of which is further characterized by attributes and values on a property list.",
        "If no semantic functions were applied--such as those associated with prepositions, modifiers and verbs--the result would be a tree such as the following: (C1 TOK BALANCE, SUBJ (C2 TOK CLOWN, DET DEF), OBJ (C3 TOK POLE, DET INDEF),",
        "ae effect of the semantic functions for this sentence is to produce the fttlowing: (C2 TOK CLOWN, SUPPORT C3, SIZE 3, ATTACH (G2 C3 )) xy xy (C3 OK POLE, SUPPORTBY,C2, SIZE 3, ATTACH (C3 C2 )) xy xy which is minimally sufficient information for the graphics to produce a single icture to represent the state of affairs the sentence described.",
        "It s perfectly feasible to compute the syntactic form first and then apply the semantics, but as Winograd, Riesbdck and.others have fouftd, the",
        "early application of semantics can be used to minimize the ambiguities of the syntax.",
        "For this reason, as each prepositional phrase is parsed a semantic function is called to determine which noun or verb might be its governor or head.",
        "Each time a Verb Phrase is completed, a semantic function is called to translate its syntactic arguments, i.e. SUBJ, OBJ, COMPS, into pictorial relations such as, SUPPORT, ATTACH points, etc.",
        "Semantics of Prepositions: After a PP constituent has been identified, a function PREPMATCH is called with a list of the nouns and verbs so far encountered, GLST, Each preposition is associated with a function that examines a candidate head from GLST-and the noun object to determine if the candidate can dominate the PP in question.",
        "For example \"ON\" is defined as a LISP function with two arguments.",
        "When called with 'clowe and \"nose\", ON returns a structure in which the ATTACH poidt of the clown is the XY coordinates of his nose.",
        "When called with \"clown\" and'\"pedestal\" it returns a structure in Which the pedestal SUPPORTS the clown.",
        "If called with \"nose\" and \"pedestal\" it returns NIL since nose is neither•an independent picturable object nor a part of the pedestal.",
        "PREPMATCH does the bookkeeping by calling the preposition function with each candidate from the GLSTJ If the candidate is a verb that can be modified by that preposition, PREPMATCH adds the PP to the verb's list of-COMPS, and the verb Semantic function will interpret it.",
        "The function BESIDE offers a simple example definition that shows how one preposition can imply another.",
        "Thus.",
        "\"a beside b\" is quite arbitrarily interpreted to mean \"b is 0 the right of a\".",
        "RIGHTOF requires that its two arguments be picturable objects.",
        "\"A clown on his nose beside a pedestal\" causes PREPMATCH",
        "((NOSE CLOWN) PEDESTAL).",
        "PREPMATCH first calls (BESIDE NOSE PEDESTAL) BESIDE calls RIGHTOF which returns pecause \"nose\" is not an independent PICTure.",
        "Then PREPMATCH calls (BESIDE CLOWN •EDESTAL) and the return is (essentially*) PEDESTAL RIGHTOF CLOWN.",
        "Somewhere else in the forest, the relation RIGHTOF will be interpreted to mean contact between leftsid.e and'rightside of two objects.",
        "So wesquite arbitrarily force a.preeise meaning--so far sufficient for our purpose-OR the geometrically vague term, \"beside\".",
        "In general the prepositional semantics for a micrpworld model are definable where the number df possible meanings for each preposition are limited by the situation.",
        "Nth the CLOWNS world, \"with\" \"on\" and \"by\" have multiple meanings that are selected dn accordance with the conditions described by their semantic functions.",
        "In.contrast, \"from\" so far has a single meaning.",
        "Verb Semantics: The English verb is a remarkably complex conceptual object.",
        "It may carry several meanings dependent on its arguments and on its larger context.",
        "It communicates information about temporal ordering of its process by auxiliaries and its suffix.",
        "It implies one or a sequential series of events.",
        "Its syntactic position and ending can be used to signal that it is a pre-modifier or a post-modifier for another verb or a noun.",
        "It is part of a classification structure and may imply special argument values to some more general verb higher in the classification.",
        "Far example.",
        "\"retort\" means 'answer sharply\" Which means \"communicate sharply it/ response to a communication\".",
        "The verb may imply special arguments in another way; the verb, \"sail\", implies that \"someone caused a vehicle to move through a fluid by a means involving aerodynamics from 'one place to another\" If the sentence omits some of these arguments, the verb semantics implies them.",
        "Thus we can sail a boat, a kite, an airplane, a saucer, but hardly a locomotive or a desk.",
        "If the arguments are inappropriate we can ascend the classification tree and call the statement a metaphor.",
        "In addition,, the verb allows its arguments to occupy practically any syntactic position in the clause or sentence and must sort them out on the basis of semantic information.",
        "By analogy, a verb is a dramatic skit with a variable set of characters that successively relates the character roles to one another over a period of t,me.",
        "A verb has a set of arguments, case roles filled by semantic objects; it has an initial state, a set of relations among its characters; a set of intermediate states, one or more sets of relations among its characters; and a final or resultingAstate similarly characterized.",
        "In addition, recent work particularly by Abelson and Schank suggest that in a given culture a verb models a situation that is prklictably preceded and followed by mare or less typical situations.",
        "If a person strikes another person„the first one was probably angered by the second, dominates the second, etc.",
        "while the second, feels pain, may react in anger,, etc.",
        "So it is reasonable to suppose tBat our experience is organized in scripts, frames, scenes, dremes, etc.",
        "whose component elements include the dynamic skits that verbs signify.",
        "In the CLOWNS world a verb selects an associated semantic function to sort its arguments into typical roles in its picturable dramatic skit and relates them in typical ways for display as initial, intermediate and final conditions.",
        "In this Cashion, the verb ''sail\" relates an Agent, a Vehicle.",
        "a Medium, a Start point, Intitrmediate points, a Goal point and possibly a Means ot movement.",
        "The semantic routine must translate syntactic entities such as Subject Object ana Complements into these roles, i.e. bind the variables.",
        "It must then relate them-ii appropriate ways AGENT 'IN VEHICLE.",
        "VEHICLE AT STARTPOINT, VEHICLE on MEDIUM, etc.--for each of its temporal states and call the graphics system to display them.",
        "Support is a verb that describes a static single state of affairs in \"The world.is supported on a turtle's back\".",
        "The verbs \"balance\",\"aupport\", \"stand\" \"hold\".",
        "are each associated with the semantic tunction SUF?UKTI.",
        "When a VP constituent using me ot these verbs is completed, SUPPORT1 is called to compute a model of the situation described.",
        "SUPPORT1 binds the cases TH1, TH2, SUPPORTPT1, BALPT2.",
        "TE stands for THEME and the other two cases ror Support Point, and Balance Point.",
        "The following diagram shows the spatial relation-S.signified by these cases:",
        "Thl supports TH2 on its BALPT2 on/with/in his SUPPORTPT1.",
        "if these four arguments are bound.",
        "the suliport relation is completely defined.",
        "If not, means are taken to till in the missing arguments by 3 default logic.",
        "SUPPORT1 takes as arguments, SUBJ, OBJ, and COMPS where COMPS is a list of complements.",
        "SUBJ and OBJ were computed by the VP parser as the subject and 30 object of the ACTIVE form of the clause.",
        "The conditions or rules for transforming these syntactic arguments into semantic roles are as follows:",
        "For the following two example sentences, the above riles result iv the bindings shown: Ex 1 A clown balances a pedestal pn his head On its side Till TH2 SUPPORTPT1 BALPT2 Ex 2 A clown balances on 1 pedestal on'its side on his head TH2 TE1 SUPPORTPT1 BALPT2 Additional modifiers may have been present as..in the example sentences: A clown.",
        "on his hands balances a pedestal on his head, on its side beside a pole.",
        "A clown with a pole in his hands balances on a pedestal...",
        "The earlier action of the preposition semantic functions will have reduced these additional complements to no more than those shown in Eltamples 1 and 2.",
        "fix Not X II Quote 14(x) Evaluate function F of X Brief forms such as \"A clown balances on his hands\" or \"A clown holds a pole\"result in incomplete bindings from the rules of SUPPORT L. The legitimacy of such brief forms requires a default logic that in the first case assumes that the Ground supports the clown.at a point called TOP of the ground.",
        "In the second case, the clown's SUPPORTPT1 for the pole is bound to his hands and the BALPT2--for the pole is bound to the BOTTOM of the pole The verb \"hold\" puts a default value of \"hands\" on the structure it passes to SUPPORT1 according to the following definition:",
        "The default logic of the verb seeks these values to bind them appropriately to any–empty case arguments.",
        "The more general default values of TOP as a missing SUPPORTPT1 and BOTTOM as a missing BALPT2 and the fact that the object on the bottom of the heap must be supported.",
        "by the GROUND are all supplied just prior to constructing a pictuxe frame.",
        "The result df SUPPORT1 is to create a process model of the following form: (Ci TOK balance, GLOBAL (...),,,INIT(...),INTER(..",
        "RESULT (...)) The value of the attribute, GLOBAL is a quoted set of (PUT X Y Z) wHIch true at all times in the model.",
        "INIT is the set of relations true At the initial state of time in the model, INTER is those for the intermediate states, and RESULT is the set for the final state.",
        "When a function DRAG for Pragmatics evaluates one of these attributes, the result is to evaluate these PUT functions to produce a semantic network representing the gtate of",
        "affairs at a given instant of time.",
        "The semantic relations are translated to ATTACH 4-tuples which then generate a picture of the state.",
        "Successive pictures are obtained by calling PRAG repeatedly for INITial, INTERtiediate, and RESULT states.",
        "Por the examples of the SUPPORT1 verb, only the GLOBAL attribute is given values as fellows:",
        "Initial, Intermediate and Result states are null since the verb simply describes a static state.",
        "The verb MOVE* is more_complex and more interesting.",
        "Let us assume as input the-sentence, \"A clown on his head sails from 'Como to Menaggio\" When the parser has completed its VP the semantic structure.is as follows: (abbreviated to the portion relevant to–this discussion.)",
        "(C1 TOK CLOWN, BALPT HEADXY, SIZE 3) (C3 TOK SAIL, SUBJ Cl, COMPS (C4 C5), TENSE PAST) (C4 TOK COMO,...,PREP FROM) (C5 TOK MENAGGIQ, ..., PREP TO) At this point VP calls'(SAIL C3).",
        "SAIL is defined as fellows: (SAIL(LAMBDA(ST)(PROGO",
        "Lnformation to MOVE* which may have to use it to bind its case roles of AEDIUM and VEHICLE which in fact arg not inentionea explicitly in the example sentence.",
        "MOVE* binds the arguments Agent, THeme, VEHICLe, Source, Goal, and KEDiusilkby sorting out the information contained in SUBJ, OBJ and COMPS by the following rules:"
      ]
    },
    {
      "heading": "OBJ TH OBJ FOR EACH COMP",
      "text": [
        "ti MED A IN V ONN THROUGH A MEDIUM( COKP) MID 4 COMP ' VEHIC A IN V ON V WITH A VEHIC(COMP) VEHIC 4 COMP ti S A QOM A PLACE (COMP) S f GOIT2 ti G A TO A PLACE(COMP) G+ COMP"
      ]
    },
    {
      "heading": "T PRINT (LIST \"UNDEFINED-COMP: COMP) DEFAULT:",
      "text": [
        "ti VEHIC 4 VEHIC + (GET ST VEHIC); '1, S9-S-4-• (MAKETOK \"POINT) al, MED MED 4 (GET ST MEDIUM) ; NG4G-4- (MAKETOK \"POINT) This definition of the conditions for MOVE* is still incomplete except for the verb \"sail\" and will be modified with further experience.",
        "Having bound the role variables, MOVE* creates a process model by assigning to ST, sets of values for the attributes GLOBAL, INITial, INTERmediate, andAESULT.",
        "Fig.",
        "3 shows these states in the form of a process model.",
        "When this process model, C3, is evaluated, the function PRAG is called with the arguments C3 and either INIT, INTER, or RESULT.",
        "PRAG will first interpret the GLOBAL attribute causing the state represented on the property lists for Tokens of clown, boat, etc.",
        "to be changed.",
        "It will then make the changes indicated by the PUTs which are additions, and the REMPROPs which are deletions.",
        "If PRAG is called three times in succession for INIT, INTER, and RESULT, three successive states are created to show the progression of the process from start to finish.",
        "After PRAG has been called the support points and balance points are all defaulted as necessary to TOPs and BOTTOMS by the function that calls the GRAPHICS system., This function",
        "36 also establishes horizontal contact points for BETWEEN, RIGHTOF and LEFTOF.",
        "VI Semantics of Scenes A scene is composed of a set of Pictures related to each other by adjacency and support relations including their points of contact.",
        "A picture is a LOGO display program that when called with a given start point and heading of the display turtle or cursor will construct a two dimensional line drawing.",
        "A square can be drawn by the following sequence of operations.",
        "(See Papert 1972.)",
        "PENDOWN, FORWARD 20, RIGHT 90, FORWARD 20, RIGHT 90, FORWARD 20, RIGHT 90, FORWARD 20, RIGHT 90, PENUP.",
        "The last \"FIGHT 90\" restores the cursor to its original heading.",
        "FORWARD and BACK are vector making functions that draw a vector from the current xy point of the curser a given number of units in the direction the cursor is aimed, The language uses functions with arguments and may create and call subroutines.",
        "Square may be defined as SQUARE:SIZE: FORWARD:SIZE,.....ETC.",
        "If a triangle has also been defined, we can then define: HOUSE:SIZE; SQUARE:SIZE; FORWARD:SIZE; TRIANGLE:SIZE; It is the convenience and simplicity,of these LOGO conventions that convinced me that drawing pictures from sentences would not add any treat complexity to a basic language analysis system., LOGO offers many additional features as a language for teaching programming skills to non-mathematically oriented users and one of the most important of these may be as a parenthesis-free form of LISP.",
        "In our use of LOGO graphics, we-consider that a picture has a name, a program to draw it, a cursor startpoints-value) a heading, a size, a frame of minimum and maximum X and Y coordinates, a center of gravity and coordinates associated with any points on it that we need to refer to, such as feet, hands, head, top, bottom, etc.",
        "All of the XY coordinates designated in a picture structure are relative to the startpoint, heading and size.",
        "If we set the startpoint to a given value, say 500, 0; the clown will be drawn from the bottom center of the screen.",
        "If we set HEADING to 90, it will be drawn on its side.",
        "If we change size to 2 each vector composing the picture will be twice as long.",
        "If we wish to translate the clown to the right 50 units, 50 is added to the X coordinate of the startpoint.",
        "IF we wish to move it up, a number is added to the Y coordinate of the startpoint.",
        "If we Wish to rotate it onto its head with its head at 500,100 life is more difficult.",
        "We must use trigonometric functions to compute a heading value and a location of the startpoint that will achieve this result.",
        "A function",
        "called ORIENT* takes as arguments an object, its balance point, and a reference point.",
        "(ORIENT* CLOWN, HEADXY, (500,100)) This function adjusts the startpoint and heading'so that the head of the clown will be at (500,100) with the center-of gravity above the point.",
        "Similar adjustments are made to the PFRAME values to translate and rotate the imaginary picture frame defined by the XY extremals.",
        "To assemble a set of pictures into ,a scene, the bottom picture is assigned an XY startpoint and heading.",
        "Each picture it supports is translated and rotated to result in adjustments to startpoint, heading and pframe values.",
        "Each picture beside it is similarly adjusted until a scene is completed by accounting for all its pictures.",
        "At this point, the scene is scaled to the size of the display screen, and the picture drawing programs are executed.",
        "The PFRAME concept developed by Gordan Novak and Mike Smith is very helpful as a computational abbreviation for.the program that draws the picture.",
        "The PFRAME attribute hag a minimum x, maximum x, minimum y, maximum y as four points that define a rectangle that surrounds the extreme points of the pictUre, When the picture is programmed these are assigned by hand with reference to whatever startpoint and heading were used.",
        "The picture as defined is taken as size 1.",
        "Whenever the picture is translated or rotated the values of PFRAME, STARTPT and HEADING are adjusted accordingly.",
        "As each pair of pictures are combined into a scene, a PFRAME is computed for the scene.",
        "The final PFRAME for the entire scene is adjusted to the size of the screen with appropriate scalirig of the size values of its component pictures.",
        "A frequent use of PFRAMES is to find default values for TOP, BOTTOM, LEFTSXDE and RIGHTSIDE as contact pointssbetween pairs of pictures.",
        "Deteiled descriptions of these processes are.not particularly relevant to this paper's goal of presentipg an easily computable syntactic-semantic scheme for subsets of English but will be presented it forthcoming papers by Bennett-Novak and by Michael Smith."
      ]
    },
    {
      "heading": "VII CONCLUDING DISCUSSION",
      "text": [
        "In previous sections the terms \"process model\", \"skit\", \"scene\" and \"pframe\" have been used to describe very limited' structures of verb and noun semantics.",
        "This usage is in contrast to the much broader ideas associated with \"scripts\", \"frames\" etc.",
        "which ate typically used to describe worlds of vision and belief systems.",
        "Example process models for \"support\" and,\"move\" have been described and applied to the task of organizing images into scenes.",
        "Nouns such as \"clown\", \"dock\", \"pedestal\", etc.",
        "have been represented as programs that construct line drawings.",
        "Adjectives have been used to communicate variations in size, and adverbs to' indicate angles.",
        "Other nouns, such as \"top\", \"bottom\", \"edge\" etc.",
        "are defined as functions that reference particular x-y coordinates of a picture.",
        "Nuns such as \"circus\", \"party\", \"ballgame\" etc.",
        "have not yet been attempted.",
        "They imply partially ordered sets of process models and are the most exciting next step in this research.",
        "More complex verbs like \"return\" or \"make a roundtrip\" imply a sequence of interacting process models.",
        "Thus.",
        "\"a clown sailed from the lighthouse to the dock and retorted by bus\" offers",
        "interesting problems in discovering the arguments for MOVE*-return as well as in the design of a higher level process model whose intermediate conditions include the models of MOVE*-sail and MOVE*-return.",
        "We have also noticed that the semantic network that is produced as a result of semantic analysis can be seen as a problem graph by the functions that organize images and it is apparent that as these graphs come to contain larger numbers of images, it will be necessary to develop graph searching strategies along the lines of ordinary problem solvers.",
        "Our first experiment in this litre will be to semantically analyze the missionaries and cannibals problem and illustrate the solution.",
        "As it stands, the CLOWNS system has served as a vehicle for developing and expressing our ideas of how to construct a tightly integrated language processing system that provides a clearcut syntactic stage with coordinate semantic processing introduced to reduce ambiguity.",
        "Twd stages of semantic processing are apparent; the first is the use of prepositions and verbs to make explicit'the geometric relations of \"support\", \"leftof\" etc.",
        "among the objects symbolized by the nouns; the second is the transformation of these geometric relations into connected sets of x-y coordinates that can be displayed as a scene.",
        "Schank't notion of primitive actions is reflected in our approach to programming higi level Verbs such as MOVE* to encompass the idea of motion carried in verbs such as \"sail\", \"ride\", etc.",
        "Woods' ATN approach to syntactic analysis is central to this system and in sharp contrast to the approach of Schank and Riesb6ck who attempt to minimize formal syntactic processing.",
        "Our process model reflects the ideas developed by Hendrix in his development of a logical structure for English semantics.",
        "The system is not limited to its pretient grammar nor to its present vocabulary of images.",
        "Picture programs to construct additional objects are easily constructed and the semantic routines for additional verbs and prepositions can be defined fc.1 the system with relative ease.",
        "We hope in the near future to illustrate the following sentence: \"One of the first plants to appear On a newly formed volcanic island is the stately and graceful coconut palm.\" .Tlas will involve programming the n In& verbs • \"a ear\", Lpirm\", grow 0 and programming pictures of plants, coconut palms and islands.",
        "Very interesting problems are apparent in understanding and representing the ideas of \"first\" and \"new\" as well as in the relation between \"plants\" and \"coconut palms\".",
        "The system has been used successfully to communicate methods for natural language computation to graduate students and to undergraduates.",
        "It appears to have immediate possibilities for teaching the structure of English, for teaching precision of English expression, and for teaching foreign languages through pictures.",
        "Eventually'it may be useful in conjunction with very good graphic systems for generating animated illustrations for picturable-text.",
        "In my and CLOWNS shows the power and value of the microworld approach to the study of Artificial Intelligence.",
        "By narrowing one's focus to a tiny world that can be completely described, one.",
        "can define a subset of English in great depth.",
        "This is in contrast to the study of text where the situations described are so complex as to forbid exhaustive analysis.",
        "The translation into a visualized mitroworld provides an immediate display in a two-dimensional language of the interpretations dictated by the syntactic and semantic systems and thus a scientific measuring instrument for the accuracy of the interpre",
        "VIII REFERENCES",
        "1.",
        "Abelson, Robert P., \"Concepts for Representing Mundane Reality in Plans,\" In Representation and 'Understanding: Studies in Cognitive Science, edited by D. Bobrow and A. Collins Academic Press.",
        "In Press.",
        "2.",
        "Badre, Nagib A., \"Computer Learning from English Text.\" Electronics Research Laboratory, College of Engineering, University of California, Berkeley, 1972.",
        "3.",
        "Bobrow, D., and Collins, A., Studies in Cognitive Science, Academic Press, New York 1975.",
        "In Press.",
        "4.",
        "Bobrow, D.G.",
        "and Norman, D.A., \"Some principles of cognitive systems.\" In Bobrow and Collins.",
        "5.",
        "Bruce, Dv-tram C., \"A model for temporal references and its application in a question answering program.\" Artificial Intelligence, 3 1972 pp 1-25.",
        "Charniak, Eugene C., \"Toward a Model of Children's Story Comprehension.\" AI TR-266, MIT, Cambridge, Mass., 1972.",
        "7.",
        "Collins, A., and Watnock, E., \"Reasoning from Incomplete Knowledge.\" In Bobrow and Collins.",
        "8.",
        "Pikes, R.E., & Nilsson, N.J. \"STRIPS: A new approach to the application of theorem proving to problem solving.\" Artificial Intelligence Vol.",
        "2 pp 189-208."
      ]
    },
    {
      "heading": "AND-IS WRITTEN TO INTFPFAcF WITH AN IMLAC nISPLAY. THTS,TS THE SET OF CONTooL FUNCTIONS., DRAW, PRAG ETC. DRAW TAKES THF SENTENCE AS INPUT.... LATER PHAG► PREPRAG MAKE SFMANTIC .NETWORK TO PFPPFSENT THE MEANING OF THE SENTENCE ANC CALL THE rFFP SEmANTTC FuNCTIONs ITO DRAW IT 4.",
      "text": []
    },
    {
      "heading": "TURN TURTLE HEADING TO THE LEFT.",
      "text": [
        "(LEFT '(LAMBDA (N) (HEADING (DIFFERENCE THETA N)))) 4, ESTABLISH TURTLE HEADING.",
        "ARr,UMENT IS HEADING IN",
        "(SET() IX (IROUtD (0IFFFRENCF XP IXTOTAL))) (SETA TY (IRCUND (DIFFFRENCE YP IYTnTAL))) SET 1 IXTOTAL (PLUS IX IXTOTAL))"
      ]
    },
    {
      "heading": "(8ETo IYTOTAL (PLUS IV TYTOTAt)) (SETA IT0T4L XP) (SETA YTOTAL YP)",
      "text": []
    },
    {
      "heading": "A VECTOR, FOR PURPOSES OF THE FOLLOWING VECTOR ROUTINES, IS A LIST OF rwn VALUES+ THE X AND Y COORDINATE, VSUM FORMS 1`4F SUM OF Two VECTORS AS AN OUTPUT VECTOR. 4, (VSUM (LAMBDA (VI V2) (LIST (PLUS (CAA V1) (CAR V2)) (PLUS (CAM; Vfl (CADP•V2)) ) ))",
      "text": []
    },
    {
      "heading": "VOIFF FORMS THE DIFFERENrF.nF Two,vECTORS",
      "text": [
        "(VOIFF (LAMBDA (V1 V2) (1:.IS1 (DIFFERENCE (CAR Vi) (CAR v2) ) (DIFFEREKCE (cAOR ‘6) (CAnR v2)) ) ))"
      ]
    },
    {
      "heading": "VSCALE SCALES-A VECTOR BY A SCALAR.",
      "text": [
        "(VSCALE (LAmRnA (V s) (LIST (TIMES (CAP v) S) (TINES (CADR v) 5)) ))"
      ]
    },
    {
      "heading": "VECT tpAWS A VECTOR WHICH WILL nC FROM THE CeRRFNT POSITIor, AN() ORIENTATION By A SPECIFIED AMOUNT FORWARC AND A SPECIFTFO AMOUNT TO THE RIGHT, THIS IS NEEDED RECAUSF IT IS USUALLY THEccAsE THAT EITHER THE LENGTH CR THE ANGLE IS A NASTY NUMBER, 4, (VECT (LAMBDA (FW RT) (PPOG (ANC, (SETO ANG (VANG (LIST FW RT))) (RIGHT ANG) (FORW, (VmA(, (LIST FW PT))) (LEFT AN(3) )))",
      "text": []
    },
    {
      "heading": "DISPLAY CLOSES THE CURRENT ITEM AND AnnS IT To THE CURRENT",
      "text": [
        "SEND A COMMAND TO THE TMLAC TC CLOSE THE CURRENT ITEM.",
        "4, (Gout EC!, NIL) (RETURN) )))"
      ]
    },
    {
      "heading": "DELITEM OELETEs AN TIEN BOTH FRoN THE LISP DATA STRUCTURE ANR FROM THE DISPLAY. 4.",
      "text": []
    },
    {
      "heading": "ABsVAL RETURNS ME ABSOL►TE PnSITION OF, A POINT IN RELaTlq;' ODOPOINATES ON AN OBJECT W4ICH HAS BEEN poSTTIONED By ORIENTlip 4 (ARSVAL (LAPROA (OBJECT PELPT) (FROG (mOnEL vnE1 ROT) (SETO MOOED, (GET OBJECT :TOK)) (SETO VOEL (VSCALE (VDTFF RELPT (GFT MODEL :STAPTPT)) (GEJ OBJECT =SITE)) (CCND ((SETO RCT (GET 1RJECT ;CRIENTATION)) (SETO VDEL (VPOT vnEt RCT))4)) (RETURN (Mim (GET OBJrcT iSfVAL) VOEL))",
      "text": []
    },
    {
      "heading": "OTSKOUT IS THE FUNCTION RY MARRY TYSON THAT GIVES US VIRTUAL MEMORY FOR FuNcTTnNs.",
      "text": []
    },
    {
      "heading": "(ANC (GET TK :RALPT) 1SETO ROT (DIFFERENCE 907.0 (VANG (\\MIFF (GET' 4K TK ECG) (GET TK =8A1 6T) )))) (GREATE0P (ARS ROT) 0,00001))) (PUT TK SORIENTATION ROW) (COND ((SETO TKS (COP TIcs)) (GO A))) ))) +IF ST HAS PPOPI RETURNS T ELSE PUTS PROF:02 AS VALUE OF PROPI FOR ST4 (DEFAULT(LAPROA(ST PROPI PPOPp_) (cOND(OET ST PROPI)T) (T (PUT ST PROP1 (GETOK ST PROP2))) )",
      "text": [
        ")) 4GET0K,PRONOuNCED GET-TOK GETs THE VALUE OF PROP"
      ]
    },
    {
      "heading": "FRO' THE OBJECT ST IS A TOKEN 0F4 COMBINE PICTURE ELEMENTS_ To FORM A,CompLETE PICTURE THIS RoUTINE GOES THROUGH THE LIST TOKS AN• HAKES PICTURE FRAMES UNTIL-ALL THE 00JFCTS IN TOKS APE INCLunEO IN SCME",
      "text": []
    },
    {
      "heading": "DEFINE OVERALL PICTURE SCALE AY FINDING THE LENGTH OF THE BIGGEST OPJECT FOR WHICH A cENGTH TS SPECIFIED. 4,",
      "text": [
        "(OR (NULL.",
        "seL) (GREATERP SCLP ScL)))"
      ]
    },
    {
      "heading": "(SETO sCLP))) (COND ((Am') (SETO ECLP (CAR (GET ATM EMASS))) (OR (NULL MSCC) (GREATERP SCLP MSCL)) ) (SETQ MSCL SCLP)))",
      "text": []
    },
    {
      "heading": "(GO A)",
      "text": [
        ") ) )"
      ]
    },
    {
      "heading": "CONSTRUCT A nTAGRAM FOP THE PHYSICS PROBLEM. THE ARGUMENT IS THE OBJECT 10 START THE DIAGRAM WITH. 4'",
      "text": [
        "(DIAGRAM- (LAmRC.4 (OBJ) (FROG (OPJL PTCSCL PF OP ORPF"
      ]
    },
    {
      "heading": "(PUT OB,J ESIZF SIZ) (PO OBJ-RsTVAL SPT) (PUT 08,1,=0PTGsT SPT) (RFTURN •(LIO OF 08J))",
      "text": [
        ")))"
      ]
    },
    {
      "heading": "COMPUTE FRAME FM; A ROTATE' PICTURE 14 JAN 75 4,",
      "text": []
    },
    {
      "heading": "FRIO ERROR MESSAGE AND SUBSTITUTE WORDS FOR øs 4, (PRTNTFRR (LAMBDA (MSG ARGS) (PRCG ()",
      "text": []
    }
  ]
}
