{
  "info": {
    "authors": [
      "Jaime G. Carbonnell",
      "Allan M. Collins"
    ],
    "book": "ACL Microfiche Series 1-83, Including Computational Linguistics",
    "id": "acl-J79-1003",
    "title": "Natural Semantics in Artificial Intelligence",
    "url": "https://aclweb.org/anthology/J79-1003",
    "year": 1979
  },
  "references": [],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "This paper discusses human semantic knowledge and processing in terms of the SCHOLAR system.",
        "In one major section we discuss the imprecision, the incompleteness, the open-endedness, and the uncertainty of people's knowledge.",
        "In the other major section we discuss strategies people use to make different types of deductive, negative, and functional inferences, and the way uncertainties combine in these inferences.",
        "Impreeision can occur either in memory or in communication.",
        "SCHOLAR can have precise values or fuzzy values stored, and its procedures can, to some extent, deal with fuzzy questions when precise values are stored, and with precise queltions when fuzzy values are stored.",
        "Embedding allows information to be specified in the data base to any level of detail or precision.",
        "But SCHOLAR only communicates the most important information on any topic (as measured by importance tags), unless more information is requested.",
        "It should also be possible by using importance tags to adjust what information SCHOLAR communicates, in accord with the sophistication and interests of the listener.",
        "Inference strategies that are appropriate when the complete set of object attributes, or values, is known (i.e., in a closed world) do not apply when knowledge is incomplete (i.e., in an open world).",
        "There are a variety of uncertain inferences that people use to circumvent the holes in their knowledge, which are being programmed in SCHOLAR.",
        "There is a set of transitive relations -- superordinate, superpart, simil&rity, proximity, subordinate, and subpart relations -- that people frequently u c to make deductive inferences.",
        "Currently SCHOLAR only handles superordinate inferences (e.g., the Llanos has a rainy seccon because it is a savanna) and superpart inferences (e.g., the language in Rio is PortUguese because Rio is pat of Brazil).",
        "Deductive inferences can be more or less certain (similarity inforances are like suparordinate inferences, but less certain) and can have restrictions on their u e (only certain attributes transfer on superpart).",
        "When knowledge is incomplete, it is not safe to assume that something is not true just because it is not stored.",
        "Thus an inference is necessary to decide when to say \"No\" and when to say \"I don't know.\" There is a complicated set of strategies in SCHOLAR to find various kinds of contradictions that people use to say \"No.\" If a contradiction cannot be found, another negative inference, called the \"lack-of-knowledge\" inference, is tried.",
        "When enough is known about an object, it is possible to conclude that something is not true ..ut that object on the grounds that if it were true, it would be stored.",
        "Another class of uncertain inference E depends on ill-defined knowledge of functional dete inants, e.g., that climate depends on latitude and altitude.",
        "Different ways that people use functional knowledge involve functional calculations (e.g., if a place has a particular latitude, it probably has a particular climate), functional analogies (e.g., if a place is like another place in latitude and altitude, it probably has the s e cli .te), and to nn-wer Why questions (e.g., a place has a particular climte because of its latitude and altitude).",
        "Different inferences can combine in different way3.",
        "So tin one strategy may call another strategy to find an answer.",
        "When different inferences independently reach the s e or different conclusions, they combine to increase or decre3se certainty.",
        "The pin-gramming of uncertain infurcaces is necesrary to make computers a clever and as fuzzy-thinking Llr; p ple."
      ]
    },
    {
      "heading": "3. Natural Semantic Information............. ..... 0.00.00000011",
      "text": []
    },
    {
      "heading": "3.1 Imprecision or Fuzziness 0000000000000000000000000000 11 3.2 Incompleteness, Embedding, and Relevancy. l2 3.3 The Reference Problem and Context.-.................13",
      "text": []
    },
    {
      "heading": "3.5 The True-False Dichotomy and Quantification. 0000000.17 4 Natural Inferences............ 000000000000000000000000000 18",
      "text": []
    },
    {
      "heading": "4.1 Deductive Inferences................................19",
      "text": []
    },
    {
      "heading": "4.2 Negative Inferences.................................22 4.3 Functional Inferences...............................25 4.4 Inductive Inferences................................28",
      "text": []
    },
    {
      "heading": "4.5 Combining Inferences and Accumulating Uncertainty. ..29",
      "text": []
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In this paper we will discuss how to represent and process information in a computer in way that are natural to people.",
        "This does not mean doing away completely with representations and procedures which computers have traditionally used, but adding new representations and procedures which they have not used.",
        "People often store and communicate imprecise, incomplete, and unquantified information; they often assert truth or falsity in relative terms; and they seldom seem to use rigorous logic in their inferential processes.",
        "Because of these conditions, people seem to have an almost infinite information processing capacity, with inference making and problem solving abilities more refined and far more flexible than any existing computer progr How an we study these human capabilities in ord r to make our machines show similar performance?",
        "A combination of approaches is perhaps best.",
        "Observation of people's behavior, introspection, some experimentation, protocol analysis, and synthesis of computer programs ccil all be valuable techniques.",
        "A recent paper (Collins, Warnock and Pas fiume6) discusses a technique for combining protocol analysis with program synthesis as applied to tutorial dialogues.",
        "The synthesis directs what to alyze, and the strategies observed in the analyrda are evaluated by synthesis, in a kind of feedback loop We have been using the SCHOLAR system in this way as a vehicle for experimentation with natural semantics.",
        "Before we discuss some of the major problems in natural semantics, we will briefly describe the SCHOLAR system, since it is the environment for our research.",
        "A word of caution though: we are only trying to develop some insights, without attempting to be exhaustive.",
        "More questions will be raised than Answers provided.",
        "There are many observable things people do that we do not know how to simulate."
      ]
    },
    {
      "heading": "2. The Scholar S stem as an Environment to Study Natural",
      "text": []
    },
    {
      "heading": "Semantics",
      "text": [
        "In this section we will discuss, very briefly, some pertinent spects of SCHO mixed-initiative instructional system.",
        "More detailed discussio s are provided in Carbonell2'3'4 and Warnock d Collins14.",
        "Several data bases currently exist: one out the ge graphy of South America, another about the ARPA net rk, d a third about a text-editing system called NLS.",
        "SCHOLAR s knowledge about any subject tter is in the form of a st tic se antic network of facts, concepts, and procedur s. This is a modified and extended network a la Quilli 12 and has a rich intern 1 structure with a well-dined syntax.",
        "Dialogue with SCHOLAR talus place in a subset of English that is limited mainly by SCHOLAR's currently primitive syntactic capabilities.",
        "In tutorial fashion, the system uses its semantic notork to generate the material it presents, the questions it asks, and the corrections it makes.",
        "At any time SCHOLAR accepts questions and requests from the student, and generates responses based on its semantic network, making calculations and inferences of different types that it has been progca fled to handle.",
        "The dialogue is unanticipated, and is dependent on the student's responses, questions, and requests.",
        "Figure 1 pretents a sample protocol of an interaction with SCHOLAR; the person types after the asterisk and returns control to the system with a second asterisk.",
        "Figure 2 shows some excerpts of SCHOLAR's se ntic network.",
        "Properties, none of which are obligatory, can have as values (single words usually English words defined elsewhere in the network) numbers, different types of lists, and other properties.",
        "Attributes are usually English words, but there is a set of special attributes for important relations, like SUPERC (for superconcept or superordinate, e.g., Li is a city and a capital), SUPER?",
        "(for superpart, e.g., Lima is a part of Peru and South America), SUPERA (for superattribute„ e.g., fertile refers to soil and soil refer to topography), APPLIED/TO (color applies to things,"
      ]
    },
    {
      "heading": "WHAT IS THE LANGUAGE OF ARGENTINA? *PROBABLY SPANISH* VERY GOOD. APPROXIMATELY WHAT IS THE AREA OF ARGENTINA? *TELL ME SOMETHING ABOUT PERU* PERU IS A COUNTRY. IT IS IN WESTERN SOUTH AMERICA. IT IS ON THE COAST OF THE PACIFIC. THE CAPITAL IS LIMA. THE MOUNTAINS ARE NUMEROUS. THE REGIONS ARE THE AMAZON IUNGLE, THE ATACAMA DESERT, AND THE ANDES. NOW YOU CAN EITHER ANSWER MY QUESTION OR ASK A NEW ONE. *THE AREA OF ARGENTINA IS 10100,000 SQUARE MILES*. APPROXIMATELY TRUE, BUT A MORE EXACT VALUE 18 1,200,000. THE EASTERN BORDERING COUNTRY OF PERU IS --- *CHILD*",
      "text": [
        "NO."
      ]
    },
    {
      "heading": "THE SOUTHERN BORDERING COUNTRY OF PERU IS CHILE. THE EASTERN BORDERING COUNT 'Y OF PERU IS BRAZIL. ERE IS PERU? *WHAT IS THE MOST IMPORTANT DIFFERENCE BETWEEN PERU AND PARAGUAY?* THE PRIMARY DIFFERENCE IS: PERU IS IN WESTERN SOUTH AMERICA. BUT PARAGUAY IS IN CENTRAL SOUTH AMERICA.",
      "text": [
        "nnd c(71pital to countrien and states), CONTRA (for contradittion,e.g.",
        "barren contradicts fertile and democracy contradicts dictatorship), case-structure attributes like agent and fnstrument (see Fillmore8), and various others.",
        "The entry for location under Peru in Figure 2 illustrates an important aspect of SCHOLAR's semantic network called embedding.",
        "Under the attribute location there is the value South America plus everal subattribut ng which is bordering countries.",
        "But under bordering countrios there are subattributes like northern and eastern, some of which have several values.",
        "Embedding describes the ability to go down as deep as necessary to describe a property in n.re or les de il.",
        "In the dat b se ther re al o tags, such as the (1 0) after loc tion ad the (I 1) after bordering countries.",
        "These tags are called importance or isrelevanqt tag (1-tags), and they vary fror 0 to 6.",
        "The low r the tag, the re important the piece of info tion 1, Th tags add up as you go down through 1 er edded 1ev-is0 Oflr of rhe ways SCHOLAR use I-tags is to decide what relevant to say at any given ti Ir the rest of this paper, we will discuss how we are using SCHOLAR to cope with so e of the probl in tural scAantics.",
        "However, there ar still m ny thral mantics problems w have not touched."
      ]
    },
    {
      "heading": "30 Natural Semantic Information",
      "text": [
        "In this section we discuss some aspects of natural semantic information and its relation to artificial intelligence."
      ]
    },
    {
      "heading": "3.1 Imprecision or Fuzziness",
      "text": [
        "Imprecise language is an essential characteristic of human unication.",
        "As Lyons10 says, \"Far from being a defect as some philosophers have suggested, referential 'impreciseness'... kes language a more efficient means of communication.\" Talking about a tall person or a blue-green object does not require precise specification of height or spectral characteristics.",
        "The imprecision may occur either in communication or storage.",
        "If we say that a colleague receives a large salary, we may or may not know the figure.",
        "SCHOLAR currently stores areas and populations in numerical form, but it can respond to the fuzzy question \"Is Montevideo large?\" with a pertinent an er like: \"It is not one of the largest cities in South America, but it is the largest city in Uruguay.\" Here SCHOLAR has found t superparts, South America and Uruguay, and then compared Montevideo to other cities in each with 4espect to population.",
        "However, it is more co n for people to ctore values recise or 'fuzzy', what Zadeh19 calls 'linguistic'",
        "either precise values or fuzzy values interchangeably.",
        "(In fact, SCHOLAR has fuzzy values as well as precise values stored, e.g., that the Brazilian Highlands has a large population.)",
        "Furthermore, the procedures that act upon these values must be flexible enough to deal with either."
      ]
    },
    {
      "heading": "3.2 Incompleteness, Embedding, and Relevancy. Imprecise statements are often motivated by incomplete",
      "text": [
        "specification.",
        "Since all specifications can be refined, they are essentially incomplete.",
        "We store what is necessary, and if we store more, we only co unicate what is pertinent.",
        "SCHOLAR does thi through its I-tags.",
        "If it is asked \"Tell me about Peru,\" it only gives a few salient facts."
      ]
    },
    {
      "heading": "Further specification can be added by refining existing",
      "text": [
        "v lues.",
        "For ex ple, instead of 'blue' we can have 'Navy blue', or 'quite dark Navy blue', etc.",
        "Further specification can also be added by giving new properties with attributes som hat orthogonal to previous ones0 ex.",
        "pie of this is 'tall ver us °tall, heavy n wearing glasses'.",
        "Properties can be specified to any level of detL il by e edding, an inherent quality Li.S of SCHOLAR-type antic networks0",
        "Somewhat related to incompleteness and relevancy is the eference problem (see Olson11).",
        "R_3forring to a colleague, my 'define' him as the father of Jack and Jill, or the author of that paper on self-referential stat ents, or the tall thin fell path glasme We decide on c,oLla specification depending on the ontext, including our assumptions about the paroon we are talking to.",
        "People usually specify only to the degree that is needed.",
        "In this sense, every partial specification is a 'definition'.",
        "The problem of context pervades natural semantics.",
        "Definitions and specifications, anaphoric references, what and haw to answer, all depend on context.",
        "Furthermore, there usually coexist a range of contexts from overall context to short-te running contexts.",
        "For example, at a given time, SCHOLAR may have the contexts South America, Argentina and Buenos Aires, each with some dynamically adjustable life.",
        "What is relevant.",
        "at any given time depends on this contextual hierarchy.",
        "A start toward making references specific to the listener is possible in a SCHOLAR-type syst by using I-tags (see Collins, Warnock, and Passafiume6).",
        "The likelihood that another person will know about any concept is roughly proportional to the importance of the concept, as acured by the I-tzigu, with 13 respect to the overall context.",
        "Thurafore, it is possible to 14 esti te the sophistication of a person based On the level of tags of the concepts he mentions in his conversation.",
        "This estimate then can influence the description one uses in referring to So concept.",
        "For example, to an unsophisticated listener one might refer to the \"capital of Argentina\" rather than \"Buenos Aires,\" because the I-tags for the concepts \"capital\" and \"Argentina\" are lo r than those for \"Buenos Aires,\" as measured from a context such as geography.",
        "In the future we want to have adjustable contexts in SCHOLAR, that it can talk about the ARPA network, say, \"from a communi-tions point of view\" to one person and \"from 4 progr ing point of vi w\" to another person.",
        "What this entails is a temporary alteration of the r lative values of I-tags throughout the s antic n twork.",
        "Thos concepts that are referred to under the concept \"corr ication\" (such as message capacity# bit-rate, etc.)",
        "should be temporarily increased in importance wherever they occur in data base, forth person interested in communication.",
        "A corresponding change must be de for the person interested in progr i g or ry other concept or set of concepts0 This kind of s nsitivity to the interests and background of the porson, and the kind of se itivity (d scribed above) to the sophistication of the person y be the two major lement in the w y people t what they say to the listener.",
        "15"
      ]
    },
    {
      "heading": "3.4 ClOsed versus Open Worlds",
      "text": [
        "In some realms of discourse such as an airline reservations system (foods17), a blocks world (Winograd15), or a lunar rocks catalogue (Moods, Kaplan, land Nash-Webber18), there is a closed set of objects, attributes, and values to deal with.",
        "H ever, in most real world domains such as those faced by SIR (Raphaella), TLC (Quillian12) or SCHOLAR (Carbone112), there are open sets of objects, attributes, and values.",
        "It turns out that the procedur s and even the rules of inference that can be applied are different in closed and open worlds.",
        "The distinction between closed and open oets is one of exhaustiveness and not one of size.",
        "For ex m.le, the set of states (e.g., Iowa), which i a closed set for w.t people, probably larger than the set of cattle breeds (e.g., Holstein), which is an open set.",
        "However, cpen sets t d to be lhrger general than closed sets.",
        "The distinction is important in a variety of way.",
        "For example, if there are no basaltic rocks ntored in a closed dat base, then it makes sense to say \"No\" to the question \"'Were any basaltic rocks brought back?\" But if no '.lcanoes are atored for the U. S., it does not follow that the answer should be \"No\" to the question \"Are there any volcanoes in the U. S.?\" A more appropriate answer is \"I don't know.",
        "° Furthermore, it L.17.-Aes sense to ask what the ouallest block in a scene is or the r k with lam t umin concentration, but it mks no sense to a k 16 fl what is the iallest city in Brazil or the least famous lawyer in the U. S. It .u1d be an appropriate strategy for deciding how many flights from Boston to Chicago are nonstop, to consider each flight d count how many make 0 stops.",
        "But it .u1d not be an appropriate strategy to consider each per .n stored in a limited data base (such as hurnn have), in order to an=ar the quection \"How many people in the U. S. are over 30 years old?\" Within open worlds there are closed sets, so that a question like \"Hot/ many tat are on the Pacific?\" makes sense whereas \"How any cities are on the Pacific?\" does not.",
        "SCHOLAR dOils with this by di tingui hing e':hzustive sets from non-exhaustive sets.",
        "We will discuss in Section 4 how SCHOLAR begins to doal with open rid santic Th eu enti 1 point her is that the well-defined p cedures that are appropriato for a clocad world simply do not carry ovc.):.",
        ": to open rld.",
        "Unfortunately, 13t of h n k wledge is open-end de and so people have complex trategi for dealing with uncertainty nd facing p blGal.,; such ao how to apply new attribute or values to objcts tale they havon't applied in the past."
      ]
    },
    {
      "heading": "3.5 The Ttue-False Dichot and Quantification",
      "text": [
        "The t.-valued logic that underlies the propositional calculus and related approachco to inference cannot encompcss natural saztics.",
        "The trouble arises beccuoe truth varies in degree, in time, in range, in certainty, and in point of view of the observer, when it is applied to rncil-world objects.",
        "re All briefly examine some of the implications of the multivalued nature oP truth for natural saaantics, olic logic us(A7 quantification to distinguish bet,ecn the universal and the particular, e.g., between \"All men are",
        "• rtal\" and \"Some men have rts.\" But there is no allowance",
        "de for the degreec of truth as between say \"Some have warts\" and \"Some men hav ears,\" even though only a fraction have w-krts and almotit all have ears.",
        "P ple will infer that Newton had ears (given no information to the contrary a 7.7ith Van Gogh), but will not infer that Newton hcd warts.",
        "The inference in the fol:Lor case treat the particular like the universal, because all'o t all men have ear3.",
        "The re generally tr c statement is, the I • re certainty people cosign to such an inference.",
        "Thrn just are not y universal truths to be found out in the cold, cruel rld, and so people m-ko tho bot of it.",
        "Degree of truth ries not only with respect to fuzzy variables (see Section 3.1) d q ntification, but also in other",
        "respects.",
        "The sky is blue, but not all the time.",
        "The yellow of a le 4,11 is less variable than the yellow of corn, which sometimes borders on white.",
        "Boston is cold in the winter, but it is not so cold from the point of view of an tskill• Nixon told us that he didn't know about the cover-up of Wntergate, but one is only rlre or less c717 ain that he didn't know.",
        "!That these examples are designed to show is that people are uncertain about the truth of any propo ition for a variety of reasons.",
        "Sometimes people seem to merge all the iny sources of uncertainty together, but someticas they c n distinguish different aspects of their certainty with respect to a single proposition.",
        "SCHOLAR does not now have y means for representing cert ..nty, but the natural way to add such information is in tags st red along with the I-tg .",
        "Just an with I-tags, U-tags car apply at 11 I4edded levels of the data base.",
        "Because we have st rted on progr certain inferences (discussed below), it has beco e desirable repre ent the underlying uncertainty in th data base 11, in order to eval te how certain any inference y be0"
      ]
    },
    {
      "heading": "4. Natural Ihferences",
      "text": [
        "We cllify h L'oEM ntic inf renc into four jor type deductiv, negative, f ctional, and inductive inforonco,J.",
        "The various type Lice discussed in somewhat gre ter detail in Collins",
        "and Quillian7 And Collins, Carbonell, and Warnock5.",
        "We do not argue that these describe all the inferential strategies that people use, but only one of the -jor varieties.",
        "The different strategies described are being implamanted as subroutines in SCHOLAR.",
        "Mile we think that people have a large set of such strategies, the n er is probably less than one hundred.",
        "Itt • Therefore, despite the inelegance of such an approach, we do not regard it as an endless task to encompasc the bag of inferential tricks a person uses.",
        "In Figure 3 we hava included excerpts from tape-recorded dialogues betwen human tutors and students to illustrate so of the more complic ted strategies people uno, and the '.ys they combine together.",
        "we will discuss examples individually below."
      ]
    },
    {
      "heading": "4.1 Deductive Inferences",
      "text": [
        "There are several tranoitive relations that 1:..ople use frequently to infer that a property of one thing may be a property of the other.",
        "These include superordinate, superpart, similarity, proximity, rdi te, and subpart relations.",
        "Of tho above types SCHOLAR now handles only superordinate and supnrpart infcrences, which are the most co n. For example, if asked \"Does the Llanoc h(Ar rainy season?\", SCHOLi'lll will",
        "Similarity and proximity inferences parallel the superordinate and superpart inferences, but they carry less certainty.",
        "An ample of a person using a proximity inference is shown in the latter part of the tutor's response in Example 1 of Figure 3.",
        "The tutor first said that a savanna could not be used for growing coffee, but then he backed off this conclusion because of the proximity of the large Brazilian savanna to the coffee-growing region there.",
        "To illustrate a similarity inference: if one knows a wallaby is like a kangaroo, only amaller, then one will infer that a wallaby probably has a pouch.",
        "We plan to add similarity information to SCHOLAR in the near future, because it 22 will also be useful in making functional analogies which are discussed below, The tecently added map facility (Warnock and Collins14) which ties together visual and semantic representations, makes proximity inferences possible, but they are still a way off.",
        "Subordinate and subpart inferences follow a somewhat different pattern from the others discussed.",
        "If asked whether South America produces any oil, a person will answer \"Yes\" because Venezuela, which is part of South America, produces oil.",
        "But one does not want to conclude that South America is hot because the Amazon jungle is.",
        "We haven't worked out the details of the restrictions on these inferences as yet.",
        "There are other transitive relations that are used to :.ke deductive inferenc s but they are not as prevalent as the ones outlined here.",
        "4,2 Negative Inferences Negativ info ration, such as the fact that men do not have wheels, is not usually stored but rather inferred.",
        "In a closed world this presents no problem; it is reasonable to assu that if pomething is not stored, then it is not true.",
        "In fact, early versions of SCHOLAR say \"No\" if asked \"Is oil a product of Brazil?\" just becilArle oil isn't stored for Brazil.",
        "But in the real .r1d, the fact that so thing is not stored does not necer-;Fial:ily mean",
        "that it is not true.",
        "People seem to have complex strategies for deciding when to say \"No\" and when to say \"I don't know.\" We have recently been implementing these in SCHOLAR.",
        "One kind of negative inference now in SCHOLAR is a simple contradiction procedure.",
        "It relies on contradictory values stored with various concepts: for example, barren contradicts fertile, and democracy contradicts dictatorship.",
        "Suppose SCHOLAR is asked \"Is the Pampas barren?\" It would find the soil of the P pas is fertile, and since fertile contradicts barren, it uld say \"No.",
        "The soil of the Pampas is fertile.\" There is an important class of contradictions that are not subsumed under the procedure above.",
        "For example, consider the question \"Is Buenos Aires a city in Brazil?\" The fact that Buenoc Aires is not among the cities of Brazil is no reason to say \"No,\" because there are cities in Brazil, such as Cor • which are not stored.",
        "But there are three facts that ether II ke a contradiction possible: (1) Buenos Aires is located in Argentina, (2) cities only have one location, and (3) Argentina and Brazil are mutually exclusive.",
        "We can illustrate the necessity for conditions (2) and (3): (2) even though Portuguese is the language of Portugal, it is also the language of Brazil (i.e., language can have re than one location); (3) even though Sao Paulo is in South America, it is also in Brazil (i.e., South",
        "America and Brazil are not mutually exclusive).",
        "Making an incorrect negative inference about cities with More than one location (e.g., Kansas City) or different cities with the same name (Rome, New York, and Rome, Italy) is precluded by storing both locations specifically, just as with deductive inferences.",
        "The strategy we have rked out and implemented to find different contradictions of this kind is fairly complex.",
        "Failure to find a contradiction leads to another kind of negative inference people use which call the lack-of-knowledge inference (Collins, Carbonell and Warnock5).",
        "Ex le 2 of Figure 3 shows the tutor using this strategy.",
        "The baci of the tutor's inference is this: since he knows as much about other South Aterican countries as he knows about Venezuela, it is a plausible but uncertain inference that if other countries produced oilf h would know about it.",
        "(Hid conclusion was at lea ;t somewhat wrong, because there are in fact several other countries in South America that produce oil, though for those countries oil is not nearly so important as it is for Venezuela.)",
        "Sach a strategy is currently being implemented in SCHOLAR in the following way: If asked a question like \"Is oil a product of Uruguay?\" where no oil is stored, SCHOL can look for oil under similar objects (e.g., Venezuela or Brazil) or objects with the",
        "Venezuela (say with an I-tag of 3) and if it has enough information stored about Uruguay (up to an I-tag of 8, say) to know about oil if it were at all important, then it can infer that Uruguay probably has no oil.",
        "The degree of certainty exprevsed in the an er should depend on the difference in I-tags between the depth of what it knows about Uruguay and the level at which oil is stored with similar objects.",
        "If SCHOLAR can find no i2ilar objects that have the property in question, as with \"Is sand a product of Uruguay?\" the appropriate anscler is something like \"I don't know whether sand is a product of any country in South America.\" The lack-of-knowledge inference is based on the assumption that one's knowledge is fairly consistent for similar objects."
      ]
    },
    {
      "heading": "403 Functional Inferencos",
      "text": [
        "Functional inferences are co n in the dialogues CYQ collected I I I • (Ccllins, Warnock, and Passafiume6).",
        "Examples 1, 3, and 4 in Figure 3 illuztrate the three different ways tie have s n people use functional knowledge: in qua i rcalculations, in analogies, and in an er to \"why\" quactions, 26 Functional knowledge, which includes knowledge about functional determinants and their interactions, is learned, just is factual knowledge, and therefore is stored in SCHOLAR's data base under concepts such as climate or agricultural products.",
        "We would argue that the representation of functional knowledge should be in a form that different procedures can use.",
        "One problem is to find a way to represent such knowledge in SCHOLAR so that it can be more or less precise, and still be accessible to different subroutines that infer answers to questions or that describe the functional relation to students.",
        "Functional calculations can be used in both a positive and negative way.",
        "One simple positive function now in SCHOLAR calculates the climate of a place if the information is not stored.",
        "Based on the major functional determinants of climate, which are 1 titud d altitude, SCHOLAR will infer whether the cli te is tropical, sub-tropical, t liperate, or cold/polar.",
        "A negative use of calculation based on the agricultural products t ction is shown in the first part of the tutor's answer in E ple l. The functional determinants of agricultural products include th clikaLte, soil, and rainfall.",
        "The tutor picked the lack of rain aL ba:Ji3 for a tentative \"No.",
        "* Negative calculations do not require as precise knowledge as positive calculations.",
        "They often only require that one or two of the functional determinants have an inappropriate value.",
        "Like functional calculations, functional analogies can be lositive or negative.",
        "Example 3 shows the tutor making a positive functional analogy, again with the agricultural products function.",
        "rhere he thought of a region, western Texas, that matched the Maco in terms of climate and rainfall, the functional determinants of cattle raising.",
        "Since he knew that western Texas une cattle country he inferred that the Chaco might be as well.",
        "A negative functional analogy might have occurred if the student had asked whether the Chaco produced rubber.",
        "Since the Amazon jungle and Indonesia produce rubber, the tutor could have said 'No\" on the basis of the mismatch between the Chaco and tho regions, with respect to climate and rainfall.",
        "A positive and negative analogy subroutine has been implemented in SCHOLAR.",
        "It is a fallback strategy to be used if there is not enough info fl.tion stored to calculate the functional relationship.",
        "For a functional analogy it is only necessary to know the functionally relevant attributes and their relative importance.",
        "Then SCHOLAR looks to see if it knows any similar objects where the property in question is in f ct stored.",
        "It tries to find a match or a mismatch by comparing the gi object and the similar object with respect to their values on the functionally relevant attributes.",
        "People frequently use such analogical reasoning, probably because of the ill-defined nature of their knowledge about functional relations.",
        "The last example in Figure 3 shoOs the use of a functional relation to answer a \"Why\" question.",
        "The population density of a place depends on an indefinite set of functional determinants: climate, soil, and rainfall are m jor ones but distance from the sea, the par.'\"icular continent, presence of valuable minerals, all contribute in different ways.",
        "The tutor picked one determinant that had a value inappruriate for a large population density and gave that as a reason.",
        "By contrast a geographer could probably write a whole treatise on why the Chaco has a low population density.",
        "What we aspire for SCHOLAR to do is what the tutor did, that is, to pick one or two of the majtar determinants with appropriate values and give those as a reason."
      ]
    },
    {
      "heading": "404 Inductive Inferences",
      "text": [
        "tior inductive inference herr only because they are a major class of h 'Ian inference.",
        "We have not yet tried to progr them in SCHOLAR since they occur stly in storing r ther than retrieving inform tion.",
        "The generaliztion and dis=' crimination processes underlying induction have been discussed in de.il elsewhere (Beck r1; Winston16; Collins and Quillian7).",
        "29"
      ]
    },
    {
      "heading": "4.5 Combining Inferences and Accumulating Uncertainty",
      "text": [
        "The inferential proceicsos described can combine in a variety of ways.",
        "For instance, contradictions can combine with deductive inferences.",
        "SCHOLAR will answer a question like \"Is the Atlantic orange?\" with \"No, it is blue,\" becauoe it finds blue i,e7 tored with the SUPERC, ocean.",
        "Also one functional inferonco m3y call another.",
        "If the agricultural products function needs a value for the climate of some region, it could call the cli te function to compute it.",
        "A more important way that inferences combine dhows up 01.2.11 different strategies reach independent conclusions about the oLlio question.",
        "A good example is Example 1 in Figure 3.",
        "The negative functional inference, with an implicit lack-of-knowledge inference, first led to a tentative \"No\" ansuer, but then a proximity inference produced a possible \"Yes\" answer, and so the tutor backed off his earlier \"No.\" When several inferences coApine to yield the same conclusion, they increase the certainty of answer, and when they produce opposite conclusions, they decreioc the certainty.",
        "There are a number of sources of uncertainty in inferential procedures.",
        "Uncertainty can derive from the size of the diffuroace between I-tags in the lack-of-knowledge inference, it can darive from the degree of match or mi match in a functional analogy, it can derive from the degree of predictivene,Ls of the function ;l",
        "determinants, and as we discuasal earlier, it can derive from the degree of certainty about the into tion stored.",
        "These sources of uncertainty iy be combined to produce an overall uncertainty (r7e for e:,unple /Cling9).",
        "This ovorcll uncertainty is important so that long, tenuous chains of roc:coning are not pursued to their pointless end, and so that the dcgree of uncertainty in the an 77er can be iadicated to the student."
      ]
    },
    {
      "heading": "50 Conclusions",
      "text": [
        "What we have tried to show in this paper is the fuzzy, ill-d fi2 d, uncL-2.2tain nature of much of huu_n knowledge and thinking.",
        "We ,Int SCHOLAR to be just as fuzzy-thinking as ve are."
      ]
    },
    {
      "heading": "6. Acknowledgments",
      "text": [
        "This paper was started by Jai R. Carbonell who died suddenly 1ebruary 29 1973.",
        "I have completed it as best I could following his outline.",
        "I w nt to thank Eleanor H. Warnock who helped me with the editing and D niel G. Bobrow and s Quillian wh have contributed rny ides to our work.",
        "The progra ing of variouL urbroUtines described in the paper was done by Nelleke Aiello, Jaime G. Carbonell, Susan M. Graesser, Mark L. Miller,"
      ]
    }
  ]
}
