{
  "info": {
    "authors": [
      "Sylvia Weber Russell"
    ],
    "book": "ACL Microfiche Series 1-83, Including Computational Linguistics",
    "id": "acl-J79-1044",
    "title": "Computer Understanding of Metaphorically Used Verbs",
    "url": "https://aclweb.org/anthology/J79-1044",
    "year": 1979
  },
  "references": [],
  "sections": [
    {
      "heading": "COMPUTER UNDERSIANDING OF METAPHORICALLY USED VERBS",
      "text": []
    },
    {
      "heading": "Summary",
      "text": [
        "A major problem confronting computer pro;iram, driven by natural-1 ngu ge input consists of the interpretation of linguistic expressions for which the intended literal meaning is not explicitly given by the lexiovl components of the expresAon.",
        "An example is the \"extended use\" of the verb 'leap' in 'the country leapt to prosperity'.",
        "such extended usages--whether quasi-as imilatcd or original-can be considered metaphorical to the eXtent th-tt they are based on analogies.",
        "This paper establishes a framework for interpreting mmetaphorical expres ions by analysis of underlying abstract components--such zIs \"transItion\" and \"intensay!'",
        "for the above example.",
        "This is in contrast to pre-viouq approaches which rely on a -aumber f word senses intended to represent metap oric.11 ust ges directly.",
        "An experimental rro,ram find, literal interpretations for input repreJenting a simple scnt,ice in Lhicl, the \"verbol concept\" (action, state or ttributc) is used metaphorically.",
        "This in ut has the gener 1 configuration"
      ]
    },
    {
      "heading": "'6UBJECT VL:L.B OBJECT .10URCE/G0.11,' or '..1)B.11,CT",
      "text": [
        "ADJECTIVE'.",
        "The interpretation are Given in the form of primitive ::nglish peraphrases.",
        "Thee paraphrases, which are intended merely to illustrate the information which can be extracted from metaphorical imut, are b_sed on",
        "semantic representations which are convertible to structures specified by Schonkts conceptual dependency theory.",
        "The interpretation of metaphorically used verbs thus represents a particul.x case of the general tasks of disambiguation and interpretation encountered by the conceptual dependency parser.",
        "The bpproximetion to the literal metning of a metaphorical verb is achieved through reference to semantic descriptions based primarily on a sm,111 number of•conceptual features and abstract structures.",
        "These descriptors are specified for classes of those concepts which are expressed in Jnglish by nouns, verbs, adjectives ,Ind prepositional phrases.",
        "The complete set of values tor the descriptors or: verbal concepts is represented as a multidimensional matrix containing the defined concepts.",
        "This matrix, which is only partially described in this paper, exhibits relationships and analogies which underlie metaphorically used verbs.",
        "The relative independence and cbstrzlct character of the basic semantic descriptors render the system easily extensible to further capabilities, such as more consclusive interpretations or the tre tment 0f more challenging expressions.",
        "The emphasis on systematic aescriptions ,nd primitive concepts to produce simple p raphrases is viewed as reflecting human understanding ox novel linguistic expressions and providing"
      ]
    },
    {
      "heading": "2. Characterization of Verbal Concepts 14",
      "text": []
    },
    {
      "heading": "2.1 Levels 15 2.2 States 16 2.3 Structures 22 2.4 Features 23",
      "text": []
    },
    {
      "heading": "3. Characterization of NOMINALs 24",
      "text": []
    },
    {
      "heading": "3.1 Features 25 3.2 Function descriptors 27",
      "text": []
    },
    {
      "heading": "4. Nethod of Interpretation 28",
      "text": []
    },
    {
      "heading": "4.1 Conditions on metaphorical extension 29 4.2 Operational context 33 4.3 General procedure 35 4.4 Operation of routine 37 4.5 Tests and criteria 4C",
      "text": []
    },
    {
      "heading": "5. Examples 42",
      "text": []
    },
    {
      "heading": "5.1 Level shift 42 5.2 Category shift 4E 5.3 R-0 switch 5E 5.4 Intra-level feature shift 5:",
      "text": []
    },
    {
      "heading": "Metaphorical usages have often been regarded as \"special",
      "text": [
        "c4ses\" to which the particular language analysis method under discussion did not apply.",
        "This paper presents a method for comduter understanding of a class of phrases in which the verb is used \"metaphorically\", but which ignores the distinction between \"extended\" and \"assimil ted\" usages.",
        "This approach provides flexibility in handling previously unseen usages.",
        "The assum)tion underlying this approach is that analogies are involved in language understanding to a greater extent than speakers consciously realize."
      ]
    },
    {
      "heading": "1.1. Analogies",
      "text": [
        "Analogies are the means by which we substitute, extend",
        "or borrow concepts.",
        "In the use of an analogy, a word is borrowed from its usual context to express some component of",
        "meaning shared by the concept underlying the borrowed word in its literal sense and the concept which the borrowed word is to represent.",
        "This results in an extended or metaphorical use of the word.",
        "The system to be described is intended to show the analogy comprehension necessary for the interpretation of metaphorical usages of verbs."
      ]
    },
    {
      "heading": "The problem of determining the meaning of a metaphorical",
      "text": [
        "expression is one of knowing the critical similarities and differences which a borrowed sense of a word has with respect",
        "to the original sense.",
        "In some case, an esoentiolly meta.",
        "phorical usage ceases to be thought of as borrowed, and acquires an idiomatic sense of its own.",
        "Ilowovor, the similarities and diifferencLs which enter into letaphoricol uscu;es cs2n be identified, we can still h, ndle such an expression as we do those expressions which csre E;enerAlly viewed as mtalhorical.",
        "Oonsidor the cx,laples",
        "1) the ;louse Killed the bill 2) I see whet you mean",
        "Here the first example appears to be metaphorical, the second not.",
        "A language analy.,er prepared to handle only non-meta-phoricLi input might achieve the correct interpretation of 'I see' in the sense of 'I uncierst,nd'.",
        "UoJever, it would succeed only if 'see\"were listed' in the dictionnil, as eouiv-alent to 'unuerst,nd' in one sense.",
        "Such a solution ignores the capabilities which humcns tulve for correctly interpreting such sentences without h ving learned this synonymity.",
        "A parser which lacks this ability, i.e. to interpret without relying on ad hoc aids, will n.,t have the flexibility required to approach similir problems in which such aids are missing due to the prejudices of the person who defines verbs for the lexicon.",
        "In this sense, we should be able to unaerst-md metaphorical sentences on the basis of an analogy to the ordinary or literal sense of the words involved.",
        "The ex,inles",
        "are all metaphorical in different ways with respect to the ordinary sense of the verb: the literal effect of 'hide'' is Visual; that of 'relinquish' has to do with control of a physical concept; that of 'say' has to do with Linguistically expressed information.",
        "But in each case there is an analogy between the ordinary ano the metaphorical usage of the verb.",
        "The ansloonsists of the similarity of the \"effects\" which occur in the men--metaphorical and metaphorical usages: 1), The idea (= to grow their own radishes) was born The baby (= Percy) was born"
      ]
    },
    {
      "heading": "Effect = A new idea (baby) can be related to",
      "text": [
        "2) He hid his embarrassment about the honey pot He hid the honey pot Effect = Others are not visually aware of his embarrassment (honey pot) 3) He relinquished his hopes He relinquished the presidency"
      ]
    },
    {
      "heading": "Effect = He no longer has a certain attribute",
      "text": [
        "4) Her painting said something to me Her book said sometl ng to me She said something to me"
      ]
    },
    {
      "heading": "Effect = I have a, new mental concept to consider",
      "text": [
        "Information derived from such metaphorical expressions should at least include analogous effects of this kind, which represent the \"result\" component of the meaning of the expression.",
        "(A related problem of extracting conceptual inferences is discussed by Schenk and Aeger (8).)",
        "This task requires a verb description system which categorizes verbs by two criteria:",
        "1) the identilication of an.",
        "underlying structural component which is similar for verbs which are used analogously in linguistic expressi.ns, and 2) the identification of a certain level at which the verb applies, such as \"physical\".",
        "Each verb will thus be classified, not in terms of a single category, but in terms of two types of variables having values according to these two criteria.",
        "Thus levels and structure-concepts must be determined which can be used as a basic form of description of verbs in the dictionary."
      ]
    },
    {
      "heading": "1.2. Conceptual dependency interpretations",
      "text": [
        "In addition to such verb descriptions, which serve the analysis task, the form of \"target\" representations, i.e. of the literal interpretations must be considered.",
        "The basic assumption underlying a choice of representation is that a \"translation\" from a metaphorical to a corresponding literal ex2ression cannot be achieved by manipulation of components",
        "at any syntactic level.",
        "What is needed is an \"interlingua\", which deals with relationships between concepts at the cognitive level.",
        "The conceptual representations which apply to this interlingua are not dependent on the original lexical form (or language) of the input, and can be used to generate paraphrases of the input into the same or other languages, given the concept-to-syntax mapping rules for that Language.",
        "The choive of a form of conceptual representation must be guided by the extent to Alicia it shows relationships between concepts at the cognitive level.",
        "The conceptual dependency theory of Schank (6-9) provides such a representation in terms of predicative and qualifying dependencies between conceptual categories and is assumed as the context of the method presented here.",
        "In a dependency, according to this theory, a concept of one conceptual category is dependent on, qualifies directly or serves to describe a concept of another conceptual category according to rules of conceivability.",
        "These unambiguous, language-free dependencies are word-independent, although the concept symbols on occasion map directly into some lexical term expressing these concepts.",
        "The nature of conceptual dependency representations, as well as their suitability for metaphor analyses, can be conveyed by a simple example.",
        "'The ink stained the floor' can be represented conceptually as",
        "• • •ink.",
        "• •",
        "representation lies not in the particular notation adopted, but in the components of meaning which it reveals.",
        "The dots (... ...) indicate that the ink is not necessarily the agent, but is merely somehow involved in the action.",
        "The \"dirttion arrow\" (a) indicates a causal relationship as opposed to the example 'the ink hit the floor'.",
        "'The notation indicates a change of state of 'floor', or more specifically, an Inalienable PART of the floor.",
        "The 'NBGative' notation is a \"connotation\" (5) which is secondary to the purely objective representation of 'stain'.",
        "If it is assumed that the use of metaphor relies on some similarity of semantic components between an ordinary and an extended sense, it can be seen that a representation of this type, reflecting a conceptually-oriented semmtic theory, is adequate to the task at hand.",
        "By reference to the abstract components of causation, change of state, part vs. whole and negativeness revealed by the above conceptual structure for 'stain', a paraphrase for the metaphorical 'his business activities stained his reputation' is easily approximated: 'his activities caused a negLtive change in (part of) his reputation'.",
        "There is no dependence on complex transformations or multiple word senses, which might in fact fail in",
        "between which the various conceptdal dependencies exist are ACT, PP (\"picture producer\") and PA (\"picture assister\").",
        "At the Ontactio level, these categories are sometimes ex4 pressed in the English language by verbs, nouns and adjectives respectively.",
        "However, such correspondence does not always occur.",
        "For example, many nouns can be expressed directly in terms of verbal or attributive concepts ('the state of...', 'that which...').",
        "Such nouns would not be mapped directly into PPs.",
        "The dependencies which hold between the specified categories at the cognitive level must ultimiAtely be given.",
        "by a \"conceptual grammar\" which reflects their conceivability and therefore their comprehensibility.",
        "Such a grammar, independent Of actual word-construct usage, would include information such as what kind of concepts can be related by a specification of position in time.",
        "Our concern here, however, will be mainly with the lower-level and more detailed information contained in a \"conceptualization\", or simple conceptual structure.",
        "The general conceptual dependency format which has been established for the conceptualizations which will be referred to takes one of the following forms (semantic terms which are irrelevant to the metaphor problem, such as tense, will be ignored):",
        "The actual relevance and character of some of the components of the latter type depends on which ACT is present.",
        "The list of i..CTs is: MOVE GRASP PTR, .NS"
      ]
    },
    {
      "heading": "PROPEL SPEAK NTRANS INGEST ATTENL ATRANS EXPEL MBUILD",
      "text": [
        "The source-goal component is irrelev nt to the ACT GRASP, for example.",
        "For PTRANS (physical transition), the object, source and goal must be specified and are physical.",
        "For MIT.ANS Imental transition), the object is itself a conceptualization and the source and goal arc the ment•l processors of human or at least animate beings: Conscious Processor, Long Term Memory and Immediate Memory.",
        "For TRANS (abstract transition) the object is a form of control and the source and goal re animate beings.",
        "Each of these three forms of transition involves a type of \"conceptual case\": PTRAS takes the Directive or locative case ( k ), and NTRANS"
      ]
    },
    {
      "heading": ".-.4 R ..4",
      "text": []
    },
    {
      "heading": "and ►TRANS the Recipient or possessive case (",
      "text": [
        "The object which is dependent on an ALT in that it is",
        "one 4=:>D0 This component underlies verbs such as 'make' (",
        "reali.„ea le:cically as verbs, adjectives or prepositional relations, such concerts will be relerred to as tV_,RBs', as opposed to the lexical 'verbs'.",
        "The column headings of this matrix live the characteristic \"structures\" of the V.L:Bs, either explicitly or as con2i urations of feature.",
        ";,, ano, the row heauings ore \"levels\", \"pl.nes\" or \"Li'.",
        "rieworks of the VtaBs.",
        "Each entry then represents a \"catcory\" o.E verbs which satisfy column and row (and further dimenstimn-) values.",
        "Conceptual ACTs as introduced in the previous section are also subject to definition in terms of his matrix.",
        "=Awl's cre considered to be sufficient as a basis for describing all actions underlying language, araless of how this action is expressed in a p rticular tangua,:_e.",
        "For instance, the ACT 'MTRriNs' underlies the verbs 'tell',"
      ]
    },
    {
      "heading": "1.5",
      "text": [
        "'forget' and other verbs of mental transition.",
        "It is these primitive concepts rather than any specific lexical verb which will be retrieved from the matrix as output of an operational metaphor routine."
      ]
    },
    {
      "heading": "2.1. Levels",
      "text": [
        "The four levels postulated for verbal concepts are:"
      ]
    },
    {
      "heading": "PHYSICAL (e.g. 'touch') MENTAL (e.g. 'think') SENSORY (e.g. 'see') CONTROL (e.g. 'donate')",
      "text": []
    },
    {
      "heading": "The PHYSICAL level includes verbs which predicate the",
      "text": [
        "existence, attributes or associations of objects with spatial (material) aspects.",
        "The MENTAL level is distinct in that \"objects\" on this level are representations of objects, or of other representations in a recursive manner.",
        "It is thus the level through yhidithought and communication take place.",
        "Verbs of thought ]have been analyzed in (8).",
        "Since MENTAL objects are not real-world objects or situations, but rather pointers to such objects, they cannot be conceptually dependent on non-MENTAL concepts other than (usually human) mental processors."
      ]
    },
    {
      "heading": "16",
      "text": [
        "The SENSORY level includes VERBS of perceptian, or the reception of \"images\".",
        "Concepts on this level provide the link from the physical world to the consciousness of a language user as well as to other animate beings.",
        "SENSORY concepts could be analyzed in PHYSICAL (spatial and temporal) terms.",
        "However, this kind of detail seems to have little relevance to the linguistic problems under considerhtion.",
        "The CONTRuL level refers to relationships which express possession or control by an animate being.",
        "An object on this level is a form of control, or a \"potential for action\".",
        "CONTROL VERBS basically consist of conditions attached to the actions of an animate being and are sometimes expressed lexically through modal auxiliaries, for example as 'can', 'may' or 'must'.",
        "Possession defined as a CONTROL relationship is thus distinguished from purely PHYSICAL or locative relationships.",
        "The verb 'have (a physical object)', for example, is defined in terms of the CO.NTR■L level rather than the PHYSICAL level.",
        "Each of these levels has a few sublevels (e.g. SENSORY: eye, ear) which are sometimes specifically referenced in metaphorical extensions.",
        "These are described in (5)."
      ]
    },
    {
      "heading": "2.2. States",
      "text": [
        "Given the matrix format of the verb descriptors, the specified levels (row components) can best be clarified 17 by consideration of the \"simplest\" structure (column component) as it applies on each level.",
        "This structure is referred to as a STATE or as a STATIC structure, and represents in general terms \"existence, with or without an attribute, and with or without association with another object\".",
        "STATEs are presented here in two forms which represent the '4.1 and 1-2 values of one of the \"features\" (Section 2.4) which further differentiate VERBs.",
        "These two feature v lues are termed \"actual\" and \"potential\", according to whether the given STATE has the feature value '-HYFothetical* or '+HYPothetical'.",
        "SMTEs in these two forms represent primitive concepts to which further features can be applied to obtain more complex VERBs.",
        "An explanation of verb entries which are examples for the two forms at various levels should give some idea of the scope and basis of the verb anelysis.",
        "Space considerations limit the discussion to two levels.",
        "If other feature values are ignored for the moment, -/+HYPothetical STATEs can be thought of as the first two columns of the matrix.",
        "At the MENTAL level we have:"
      ]
    },
    {
      "heading": "ACTUAL POTENTIAL",
      "text": []
    },
    {
      "heading": "Perception",
      "text": [
        "0-Preaication:",
        "The NLNTAL level is divided into two sublevels to correspond with the faculties of perception and volition.",
        "Perception in turn has two forms--the predication of the existence of the Object, and the valued perception of a presupposed Object.",
        "Only the former type is examined here.",
        "It is first noted that this and each sublevel allows for an R-, 0 and VAL-form of a 0 = Object, R = Recipient or experiencer (\"location\", \"source\" or \"goal\" of 0), and VAL = VALue of 0.",
        "The labels R, 0 and VAL indicate whether the lexical entry which maps into the slots headed by these labels expresses a verbal concept from the point of.",
        "view of R or 0, or expresses a value o.j.",
        "O. Syntactically, the \"point of view\" of R or 0 is reflected by a verb having a noun with' \"role?'",
        "R or 0 respectively as syntactic subject.",
        "For examole, the R-role 'see' corresponds to the 0-role",
        "'appear'.",
        "If no verb for a given slot comes to mind, a phrase is given which simply reflects the conceptUcl representation of this STaTE.",
        "Thus the 0-role entry corresponding to 'believe' is '0(=propOsition) be in Long Term Memory'.",
        "The value imr,osed by 'believe' on the Object, which for this sublevel is a Truth Value (TV), is positive ('+1).",
        "Verbs or predicate adjectives in the 'VAL' row express a possible value of the Object as opposed to the relationship of the Object to an R which is given by 0-role verbs.",
        "Although the verbs and adjectives given as examples 4,11 presume a positive value of 0, other degrees of positiveness on the value scakcould underlie othcr verbs or adjectives.",
        "For instance, 'be indifferent to' means that the bject lies midway between the '+' reau Attitude or Aesthetic vnlue for the experiencer.",
        "since a MENTAL sTgatE expresses an attitude towards a Mi:NTAL object which may or may not correspond with that of \"outside observers\", verbs may express either a 'SUBJective' or an 'OBJective' MENTAL ST.ITE, as shown, That is, a speaker says 'he knows that...' to mean 'he believes that..., and it is true'.",
        "The difference between the ACTUAL and POTLNTIAL columns can best be explained in terms of the present examnle.",
        "Generally, 'actual' refers to the fact that the relationship underlying the verb is presently \"in operation\", \"realiLed\" 20 or -expressed\".",
        "'Potential' denotes that the object cart be retrieved in order to create an 'actual' relati.nship.",
        "Thus 'think' in the sense of mental activity ('think about') involves an \"active\" object and says something about the present state of the thinking person, but 'believe' or 'know' represents a \"stored\" rather than an active object.",
        "This ditA:erence is expressed through representation of K as CP (Conscious Processor) and LTM for 'think' and 'believe' respectively.",
        "There is no value ssigned to u for this sense of 'think', since a truth value is not assigned to a 1,12MiL object except in the process of forming a belief or waking an assumption.",
        "The 6,Z,3ORY level can be illustrated bfiefly by reference to the representation of conceptual attributes in terms of this level.",
        "'Be iutiful' is cleaned by primitive components on the 'visual' sublevel: I0E:'6ORY (eye) VAL: AV=+' or, 'a visually perceived, aeJthetically positive attribute of an object'.",
        "All three non-P:IYS'ILIL levels involve objects 0 which are non-material, i.e. not iPs.",
        "Rather the object is a form of information, image or control for the EENTAL, Sf,n50I:Y and CONTROL levels respectively.",
        ":al of thebe objects, which might be thought of conceptually as verixl or attriL)utive concepts, have a \"relationship\" only to a true exl,eriencer, i.e. an animate k. _it the PHYSICAL level, on the other hand,"
      ]
    },
    {
      "heading": "21",
      "text": [
        "R need not be animate.",
        "The PHYSICAL Level reflects only the physical aspect of the relationship expressed by a VE1J3; R may h,,ppen to be animate, but the animate aspect is irrelevant to this level.",
        "This means that 'have' in the sense 'John has the newspaper' is assigned to the CONTROL level rather than to the PirtolcAL.",
        "However, a l'IlYz)ItJAL relationship, as expressed by John has the newspaper on his head' or in front of him', could be derived as an inference of the CONTRDL-level 'have'.",
        "Representative verb forms for LaTi.",
        ";s at the PHY,IC.ktL level follow;"
      ]
    },
    {
      "heading": "ACTUAL POTENTIAL",
      "text": [
        "R have as part contain have on 0 be connected to be near be in almost be be on be at VAL be be SPA-value> e.g. be red The R and 0-VERBs correspond to relntions between PPs identified in (5) (IN, ON, AT, PROX), whereas the VAL VERBs are conceptual attributes--PA dependencies on PPs.",
        "The ACTUAL/ POTENTIAL distinction as described above does not strictly apply to the PHYIC,AL level, for in one sense all PHYSICAL relationships are \"actual\".",
        "However, an analogy suggested by this analysis in comparison with the other levels is discussed in (5)."
      ]
    },
    {
      "heading": "2.3. Structures",
      "text": [
        "Structures reflect abstractions of verbal concepts, i.e. elements of conceptual states or actions which humans recognize independently of whether any matter or object involved is visible.",
        "A VEL.8 structure consists of an \"eftect com)onent\" and, if the concept of chcki,e is implied in the VERB, a \"cause component\".",
        "If both a cause and, an effect component are present, they are connected by a causal link-3 – as for 'achieve', or a \"tried\" (Section 2.4) eN.",
        "causal link 11:: as for 'practice (for)'.",
        "Effect structures take one of the following forms: 4==*.",
        "R locative STATE O ItE:;) VAL attributive SLITE STATE (new) O transition of loc:tive STATE STATER (old) ESTATEvAL (new) O transition of attributive ST.-1TE STATEvAL (old) STATES, which underlie verbs such as 'think,,Natch', 'control', 'have' and 'be', have been introduced above.",
        "In the verb definitions to follow, STATEs are represented mnemonically as '(0 AT R)' and '(0 BE)' or '(0 BE <VAL>: )'.",
        "The transition-arrow should reflect the assumption that language-users usu'lly focus on a certain aspect of the change duality, e.g. 'start sttte' or 'stop state', even though stopping one state alwAys meins starting another.",
        "Thus there are three types of change-of-state effects:",
        "These structures underlie verbs such as a) 'give', b) 'forget', 'lose'; and c) 'enter', 'join'."
      ]
    },
    {
      "heading": "2.4. Features",
      "text": [
        "Features might be thought of either 1) as each providing an additional dimension of the matrix in terms of its set of values or 2) as applying to structures in various combinations of values to form configurations of feature values.",
        "In the latter case, the c,_nfigurations provide the values (columns) of one (horizontal) dimension.",
        "In either case, the values of the following binary features indicate whether a certain conceptual element is present in a VERB.",
        "The above structures implicitly presume a negative value for all features except CONTINuous, which is positive (c.f.",
        "Fillmore's l-Nomentary' (1)).",
        "Explicitly stated feature values expand the information given by these structures in a VEkB description.",
        "The features,with '+' and '.'",
        "examples, arc: AGENTive e.g. break (vases)/(vases) break HYPothetical believe/contemplate"
      ]
    },
    {
      "heading": "SHARED agree/believe",
      "text": [
        "24 The AGalTive feothre has particul r signLictnce in that Lt is related to the role specifiqation of the verb as de-3cribed in section 2.2.",
        "The syntactic subject of a 4.,IGI;NT krerb has role AGI:NT and the object role \"or 0.",
        "The feature \\ itself is uelineu in a restrictive sense; +/-AG,Nf refers to or orhether an agent which is external, i.e. other th..n '0, i4 involve, Thus 'tell' mu 'give' are +It= (one who tells = AG,NT; recipient of information = k; informat on received = 0), but 'recall' (in t e sense of 'remember') and 'take' ,-.0e AGENT (one uelo recalls = one -;110 \"receives\" = 11; infdrntion \"received\" = 0).",
        "3.",
        "Characterization of FOILINALs",
        "In order to know when verb substitutions along a vertical dimension c)J:' the m trix.c,in be made \"meaningfully\", we need a description system for \"Ii011INALs\", i.e. concepts that serve as \"objects\" at one of the above levels, which governs possibilities of dependencies of these NOLINALs on the VERBS.",
        "Furthermore, in order to allow more flexibility in handling the inherently vague problem of.",
        "what is meaningful, it is useful to refer to a two-level hierarchy of \"degree of restrictiveness\" in judging whether such dependencies renre-sent metaphorical phr:ses.",
        "In the verb definitions, this information is given in terms of s)ecifications on the 25 NOMIN4s which appear in the dictionary definition of the verb.",
        "The two degrees of restrictiLn Lire marked 'B (Broad)' and 'N (Narrow)t; the specifications themselves con,:ist of either specific Ncl.INi.Ls or features of N01‘,INALs.",
        "These descriptors are illustrated in Sections 4 and 5.",
        "Features A fet,ture-oriented system of description for NOTIIRiLs is described in (5).",
        "Here the defining elements of NONINALs are presented without elaboraLion, merely to show the terms in which Nauru', dependenciest on verb 1 eonceots are-specified.",
        "A configurz.tion of levels for Nut INliLs I-1,,s been deviseu Viich is not i.lentical to but is related.",
        "to that estLblished for th,L.",
        ":13s NTh,L; bilt.",
        ")ORY , L, A,TIVL , TI1,114, :›PALL.",
        "However, for chis Limited discussion, VL113 levels will be as.",
        ";umed for NONIN..,Ls, wi+th 'PHYoIC,tLi corre6von,..ing to .",
        "The features are presented in three grovs, although► this diviJion is not significant to the imulementation of the theory.",
        "The first group expresses topolo•ical or b .sic physic..1 properties:",
        "roof, step / house, proof rainbow, idea / fog, geogrDohy shoe / pencil fielci, tree / bird, ball fence, streak / ball, flash ocean, tdble / pole, st tue \"plural\" concept, rivcr, (some) time / ice, moment 26 It might be seen by the examples given that these fe,Itures art considered a. abstract properties which aro extens4e, to levels other nan the illY01A,AL.",
        "Thy: sLcond.",
        "group consist8 of: +/- HUMAN ANIMATE +HUMAN will be considered to imply third group iocu,es on the \"mo,...nin6\" of a concept rather than on an, objective properties: +/_ MAN/AA„E key, motor, story / boy, stone llYNAMIC boy, motor, story / key, stone The DYNAI,IC feature refe2s not to the presence or absence mkving parts, but rather to whether the concept has some kind of \"continuous existence\" by itself, other than mere spatial presence.",
        "The difference between 'story' and 'motor' on one hand and 'key' on the other is that a key is an inert object which is used passively for a single oleration, .fter which it (again becomo.s morel a _dace of wtat.",
        "A. motor (like an animate being), once starter:, a•pe.",
        "'rs to function by itself.",
        "Likewise, a story and in fact m,st mental concepts can be thought of as having an effect or \"continuous function\" for those people who come in contact with these concerts.",
        "Th.. significance of this feature is suggested by the many cages in which people s)eak of +DYNAMIC concepts as being \"aLive' or effective in themselves.",
        "These features are all essentially binary (T+1, I-I) with a possible variable value ('?')",
        "for s,,mg, features.",
        "27 The 'PIXEL' feature, for example, is \"variable\".",
        "A flower is +FIXED in its natural state, but FIXED when in a vase or in many other circumstances."
      ]
    },
    {
      "heading": "3.2. Function descriptors",
      "text": [
        "In addition to conceptual features which aetermine the conceivability of certain -hrasea, metaphorical or otherwise, there are specific non-conceptual function associations which apply to m.-ny NOMINIZA, especially +1,1aNII,WE ones, which serve as uczining elements.",
        "Also \"size\" criteria for dependencies are recogni..ed in the form of a 0-.5 scale vL.lue for physical objects.",
        "Although these descriptors are more important for problems not dealt with here (see (5)), they also enter the question of metaphorical interpretations.",
        "Vor example, the knowledge th,lt the functions of both a ship ,:nd a tractor include the notion of 'going' or 'moving' is of use in recognizing the substitution of 'dlip' for 'tractor' in 'the ship plowed the sea' vs. the literal 'the tractor plowed the field'.",
        "The function can then be incorporated into an approximation of the meaning of the former example.",
        "oeveral types of function have been identified, according to the conceptual roles which the object plays in the action which represents the realization of this function.",
        "The type which is probably referred to most extensively in metaphorical interpretations is 'EXTERN L', meaning that the functional object appears as an external (to the actor) object in the conceptual representation of an action which",
        "serves as an instrument to some result.",
        "In this experimental implementation an abbreviated funcUon re?resentation is used: 1kni.ce (FN: LIXT (cut))'.",
        "4- Methoq.12LIFItEEPEttEan.",
        "As pointed out at the be;',inninz QX this paper, if a definition of metaphor restricted to incluuL, only those usages which strike the speaker of the ,;ivcn languk,,e as poetic or colorful, that 1/4iefinition will be ambi uous, for language is constantly changing with rLspect to what is.",
        "considered \"original\" vs. what is an established word sense or idiom.",
        "This phenomenon could prove to be a quandary for anyone defining verbs or other lexical items for entry Into the dictionary.",
        "The cuestion of what snse of a verb is literal and what is metaphorical can be ex:Iectec to vary not only from one individual to another, but also over time.",
        "In order to alleviate this problem, it is suggested that a definition of a metaphorical usuge include any verb which is \"borrowed\" from anot'ler level, whether or not speakers are still conscious of this borrowing.",
        "For",
        "to other levels.",
        "A verb is simply always defined as applying \"normAlly\" only to a certain base level (which in case of doubt can be considered to be the PHYSICAL level, if that level is one of the alternatives).",
        "A human editor need not worry about whether usages of the verb at other levels Are metaphorical.",
        "Thus the proposed procedures rest on the, assumption that the \"metaphorical sense\" of a verb is not in the lexicon as suchi the semantic component should exhibit the analogy comprehension of humans, who do not need to have such senses explained to them.",
        "If we accept that analogies refer to the sharing of a conceptual component, and are therefore reflected in our \"levels\", which share one or more columns of our matrix, then the most significant way in which the verb description system can be applied is evident; given a verb which is defined in \"thematrix by 4 An entry iU a given column (structure) and row (level), a metaphorical sense of this verb is represented by a VERB with the same structure but a different level.",
        "This type of extension can be referred to as \"level shift\".",
        "A second type of extension, which abstracts the effects of animate actiLng and applies them to inanimate objects is aescribed in Section 5.4."
      ]
    },
    {
      "heading": "4.1. Conditions on meta•horical extension",
      "text": [
        "Identification of a metaphorical usage recuires the 30 knowledge that semantic restrictions on the dependency context of the verb as used on the base level re being violateu, but that this violation represents a comprehensible metaphorical substitution rather than an \"anomalous\" case which must be passed to some subsequent routine for interpretation.",
        "In other words, interpretations tor metaphorical expressions must satisfy certain notions of conceivability, just as concepts underlying literA.",
        "usages do.",
        "In terms of dependencies between an object, its location and/or its attributes as described above, the most ifloortant condition for \"conceivability\" is that the MENTAL and PITY,IC_IL levels can never \"mix\" across the uepenuency links releting an 0 and an R, though both types of levels mcy coexist in a 1,2 which maps into one of these role-concepts (e.g. rbook').",
        "In other words, in may metaphorical usage, as in a literal one, some correspondence between the types of components within a conceptualization must exist.",
        "in terms of-syntax, if a direct object is conceptually a MLNTAL object, then the verb must be either lu:NTAL-level or used metaphorically on the 1,f2;NTAL level.",
        "Thus the dependencies on a verb 1 concept its a metaphorical use do not conform to the level of the verb in its literal sense.",
        "The noun which ma,,s into the object of a conceptualization determines the level to which other elements of the conceptualization conform.",
        "In general, non-PHY6ICL objects",
        "are obviously specific to one level.",
        "Nouns with an underlying PHYSICAL comltnent, on the other hand, often are mapped into conceptual constructs representing another level.",
        "For example, 'he heard a squeaky violin' is analyzed as a S,;00RY-level conceptualization corresoonding more accurately to 'he he,ird the squeaky sound of a violin', even though the syntactic object ('violin') is IlIMIUAL-level.",
        "A seconu, less rigorous criterion in distinguishing literal, metaphorical and \"anomalous\" uses of verbs is, respectively, the satisfaction ci 'Narrow' restrictions on the dependent NONIN.",
        "Ls, the satisfaction of 'Broad' but not 'Narrow' restrictions, and the satisfaction ef neither type of restriction as described in Section 3.",
        "The 'Broad' 'Narr.,,w' restriction criterion is not to be overem.basized; it is not claimed that such a dist_nction presents itself easily.",
        "It is merely buggested that for a given verb, a subset ox features (for which the clbovc features serve as a starting point) used to restrict dependencies at a literal level plays a rc,le in the determimItion of usages at a Metaohoric,1 lev 1.",
        "It appears that some features are inherently more instrumental in such determirutions than others.",
        "For excmple, a 'game' and a 'concert' can 'close' because they are conceived of as possessing a 4-CuNTrIIN fecture value, whereas a 'touchdown' or a '(musical) note', in an intuitive rather than a strict sense, do not.",
        "The feature 32 FIXED, on the other hand, is less important than CONTAIN in the dete minntion of a metaphcrical expression.",
        "In judging the consequences of the uncertainty which may arise in the definition of these criteria, one should keep in mind that the distinction between metaphoric,1 and an incomprehensible ex iression is also vague and in \"borderline\" ca.",
        ";es may vary from one inuividual to another.",
        "The problem in language understanding is more often to find an interpretation rather than to exclude \"strange\" constructs.",
        "A lexicon editor, therefore, may in case of doubt ream nably adopt a policy of minimizing the 'Broad' restrictions on the NOUINALs potentially delendent on the verb which is being ueLined.",
        "A related problem of definition is -Cie internrctation of the features in terms of which the foregoing restrictions exe defined.",
        "The meaning of ,e presented features has been brieEly describeu for the PHYIUAL level; a mLre com'aete interpretation of t ese fee.",
        "tures for other lev is should eventually be concisely ddscribed.",
        "For exam le, at t-e PHYSIC IL level t'-.ere is a Ldstinctionbetween 'contain' in the sense of 'surround' and 'contain' in the sense of 'consist of.",
        "At the 11LNThL level these senses merge, or rather the former sense seems to lose its relevance.",
        "In addition to the above criteria, there are semantic criteria governing the \"taraet re-)re3cntation\" which ensure 33 that the interpretation given as output satisfies the general requirements of conceptual denendency for any conceptual structure.",
        "Since these conditiuns are not peculiar to the problem of metaphor itsalf, it is noted here only that two labels exist which inuicate \"how seriously such criteria must be taken\".",
        "The satisfaction of 'unconditional' criteria indicates that the resulting interpretation should be accepted in any case.",
        "'Conditional' refers to criteria which support a \"last resort\" interpretation--an interpretation to be considered if no better alternativs are available to the parser.",
        "The im lemented procedures do not yet exhibit this discriminatiot in their output.",
        "4-2- atEaLii-milJasaLpLL The parser with which the metaphor interpretation procedure is intended tot unction (Riesbeck (4)) operates on tile basis of semantic expectations.",
        "To a large extent, thede expectations are concerneu with finding in the sentence being pursed an object whicil conforms to basic semi ntic re uirements soverning •C'e depenuenc of that object on a verb which has appeared in the sentence.",
        "If there is more than one possible sense of t'e verb which has been found, the choice of sense depends on what kind of on object is fount.",
        "This object is described by a few feLturLs such as PHYSICAL and ANIM,TE.",
        "As the parser presently is \"physically"
      ]
    },
    {
      "heading": "34",
      "text": [
        "oriented\", expecting physical objects for verbs which ordinarily are interpreted in a physical sense, it is not able to find an interpretation for extended usages in which the only candidate for an object is non-PHYsICAL.",
        "bore specifically, appose that the parser finds the verb 'drop' is the course of a sentence analysis; that only one sense of the verb is given in the dictionzryapart from idiomatic usages such as 'drop someone a line'; and that the minimal requirements for its object inclu.i.e the specification IPHYSIC.AL'.",
        "If this restriction is not satisfied, the parser must turn to the metaphor routine for an interpretation.",
        "Thus if 'idea' were the only candidate for an object of 'drop', the parserwould note theta PHYSICAL-level specification (which could be represented as a +PHYSICAL feature-value) is missing from the definition of 'idea'.",
        "It would then check with the metaphor routine, passing as information the candidate for an object ('idea'), the verb sense of 'drop' which would have been selected, had the object possessed a +PHYSIC 11 feature, and any potential dropper, source and/or goal.",
        "As output the metaphor routine returns a representation for each level at which the verb can be interpreted.",
        "\"'his representation, wIlich is based on the semcntic components introduced in Section 2 ('TR-L (0 AT R) (VOL +) 0 =",
        "to build the correct conceptual structure (or to form an a2pL-0:cim to paraphrase according to t‘e orogr,m Liescribed belo).",
        "2hat is, this information contains mtrix dimenAion oointers ich lead Lo he cato ory of the inv lved action or &LITE z.mi to the .LOT or conceptual notation which underlies this action or ST.tTZ rt...3pecLively.",
        "For our emmple, the und.",
        "rlying conceptual information associated with the above sem ntic components at the 1.1„.N.LVIL level determined by 'Luca' gives",
        "the elimirwtian of a component of the M.XYAL ST,d of on inuivicIual.",
        "(Additional notation representing the concept underlying 1.+VOL' is discussed in (7).)"
      ]
    },
    {
      "heading": "4.3. General proLedure",
      "text": [
        "The general method ,f the metaphor routine for under-standinL, metaphorical expres ions c n be specified as follows.",
        "The routine examines the semJntic descri2tors of the co'nceptual W.A.B which corresp nus to the givi_nverb sense.",
        "This semantic information c_lnb e obtained airectly from the diction .ry entry for that verb, or indirectly in case the entry is represented in tertas of another verb and certain feature values.",
        "It notesthe specified NOMINAL dependencies, including the 'Narrow' specifications on these NODIN,Ls, if any.",
        "The satisfaction-of .nese specifications by the 36 NuM1NALs which actually occur in Lhe input would indicote th,'t a base interpretation is available.",
        "The routine thus contains the capability of determining such interpretations; however, in actual operation it will be assumed that the parser 1) has unsuccessfully checked for the ossibility of b,:se interpretations before turning to the met„phor routine, or 2) has found a base representation, but is interested in dossible metaphoricol interpretations.",
        "Case (2) reflects he fact that the identification of a base intelTretntion ?recludes cnomaly bur.",
        "not the possibility that a metaphorical interpretation was acLually-intended.",
        "This is particularly likely in the case that the NCNIN Ls involved have features which place them on more than one level, with the metaphorical level being more \"usual\" than the base level.",
        "An example of thi.3 type to bc considered is 'Europe and America are drifting apart'.",
        "In either case, the t.:sk of the routine is to determine, on the basis of the guidelines of section 4.1, whether there are yetap',:rical interpretations for the giv:n inilut, and, if so, to return represLmtations for tlem.",
        "Inter-xetations for all possible levels should ultimately be 3iv_n nriorities.",
        "No definite me-nod has been stablishe for determining priorities in isolation from the context of discourse.",
        "Presumably such context would be th,_ dominating factor in establishing the level of the expression.",
        "Tsus if the 37 acti ns of humans are bein discussed, ',...,uropet would be interpreted in its institutional or ANIti►tri.",
        "; sense rather than its geographical PHYSICAL-level sense.",
        "If the expression is accepted as metap'IoricAl, its meaning remains to be represented.",
        "In order to arrive at the verbal concept which expresses Lhe \"effect\" underlying the analogy employed, the Program uses the structural elements underlying the input verb as a \"roadmap\" through the motrix to obtain the corresponding target verbal concept at the desired level.",
        "That is, the structural elements or feature values cfin bu thought of as values of dimensions of the matrix which specify an entry.",
        "This entry, which may consist of a primitive ACT, for example, can then be inserted into the representation which gives an approximiliion of Lhe meaning of the phrase.",
        "Along with structural elements, any magnitude descriptors present, i.e. AM.UNT or INI,,N0ITY: < are carried ever to the targei representation, since it is Zre uently these com-pz/nents which Lre focused on in a mutaphoricta expression (the jumped (INTLNSITY: >) to conclusionsi).",
        "However, the program referred to here does not yet include this mechanism."
      ]
    },
    {
      "heading": "4.4. Operation of routine",
      "text": [
        "The procedure to be described has been im,lemented in an extended version oz izOiaRAN IV, which wa,, the only language conveniently accessible at the time.",
        "The outline",
        "given here represents the rocedure actually followed in the implementation, which was desigled only for test nur,,oses.",
        "a) Input: The input consists of two or three lexical items in Lheir \"root\" forms in the order 'noun verb (noun)' .",
        "This group represents a syntacac configuration determined tentatively by the parser as 'subject verb' qr 'subject verb object'.",
        "In terms of rotes, the first case may represent 'AGENT V,XB' or '0 (OBJECT) VI;a131; the second 'AGAT V.]KB 0' or '0 VEI:B R (SJUME or GOAL)'.",
        "Theoret",
        "ically, then, the entire role con4guration 'AGENT VERB OBJECT ol-JUIRUZ and/or GOAL' need not explicitly be provided for in the input, since t''is configuration is covered by the two component configurations just given.",
        "c) Roles: At this point of the procedure, roles to b e assigned are only temporary; a test for the \"R-0 switch\" type of metaphor (Section 5.3), for instance, may determine",
        "that the role configuration expected on the basis of syntactic information has been altered in the extended use.",
        "The tentative roes are assigned according to role informat,an !iven in the definition of the verb: For SV: Role of verb (r. or 0) is assigned to subject."
      ]
    },
    {
      "heading": "For SVO: If verb is +AGENT:",
      "text": [
        "AGENT is assigned to subject and role of verb is assigned to object.",
        "If verb is -AGENT: Role of verb (R or 0) is assigned to subject and the other role (0 or R respectively) is assigned to object.",
        "d) Interpretations: Control is then passed to other routines, depending on which rule configuration is present: RV ov RVO OVR AVR AVO These routines return any interpretations found, accordinb to the criteria to follow.",
        "In this version the interpretations are expressed as pseudo-paraphrases, i.e. poraphrases which ignore certain syntactic details such as word suffixes and tenses, in order to allow for some measure cf judgment as to :he extent to which the meaning of the metaphcricel phrase is captured.",
        "However, in actual operation, the target representation will be a Concer;tual one, which could be operated on by a dialogue program or by a paraphrase program (Goldman (2)),"
      ]
    },
    {
      "heading": "4.5. Tests and criteria",
      "text": [
        "The following tests with corresnonuing criteria for appli-cdtion an( for success represent procedures which have been implemented.",
        "Each test (b through d) refers to a certain type of metaphor as shown.",
        "The discussion of relev nt ex, males in the next section complements these ipeciLications by indicating the rationale used in the approach to finding metaphoric 1 interpretations.",
        "A test for a base-level interprct1Ltion (a) has been incluued for purposes of comparison with examples seen as either metaphorical or (with respect to the given test) anomalous.",
        "along with discussion of these and other ex, mples cs they occur in the following exposition of the various types of metaphor."
      ]
    },
    {
      "heading": "5.1. Level shift",
      "text": [
        "Not all extensions are made from the PHYSICAL to the non-PHYSICAL levels.",
        "The M.1NTAL, ___,NSOLY and CONTROL levels",
        "sometimes serve a..3 a base from which metaphorical extensions"
      ]
    },
    {
      "heading": "CONTROL - SENSORY: Her hat usurped his view.",
      "text": [
        "'He closed his mind' appears in the output of Figure 1.",
        "The base--i.e.",
        "PHYSICAL--definition of 'close' is one of the more complicated verb definitions, since the syntactic object is either a space cr an object containing the space (which is filled or eliminated), and its complete representation will not be discussed here.",
        "However, the \"effect\" portion of the semantic representation for the sense in which the object is a space is tiv...t nothing can pass into or Lut of the object containing the space.",
        "The relevant portion of the \"pass into\" interpretation is reDresented by the nested uel.initiAn:",
        "It is noted that the +HYP Value refers to the potential character of the outermost ST.CE; the HYP value far the innermost STATE is negative, Consistent with the observation in Section 2.2 th,t all physical relationships (excluding separation) can be considered \"actual\".",
        "The role routine determines th.t, since 'close' is R-role, the uirect object of 'close', i.e. 'his mind', maps into R. But therbase-interpretation routine then discovers that n is +MENTAL and not +PHZIG,L as required by 'close'.",
        "The program therefore attempts an interpretation ot the L level, the level of 'mind'.",
        "R = 'mind' is an ANIELATL: P C' he (D.LLIT: mind = +;%:!",
        ":]Nr.LLI) in fulfillment of criterion 'c-1'.",
        "It can therefore serve as a \"location\" at the 1.2ZUL level.",
        "0 is unspecified in the sentence and thus does not impose any level or other restrictions.",
        "In checking to see 01,17t the 'Broad' s.)ecifications by 'close' are satisfied by 'mind', the program finds that 'mind' does have the +CONTAIN feature Lls required.",
        "rhe, verb can therefore be interpreted at the MENTAL level.",
        "The innermost 3tructure--TR-E (SLk2_.",
        "(0 .,11 R))--is extracted and the IENT,til level is substituted for the .PHYL,IOAL.",
        "The absence of a value indication is interpretea as '+'.",
        "The",
        "\"roadmap\" through the matrix portion given in Agure 2 then consists of the dimensions: 'MENTAL (level) P,(sublevel)",
        "poses of paraphrasing directly out of the matrix, the entry resulting from this se.rch is the L4nglish verb 'think', which would corres►ond to a conct\\.ptual structure 0<=1,1.,OG (CP(R)), i.e. '0 be (mentally) located in the conscious processor of R'.",
        "Uith closer attention to the sublevel(s) of 'mind', a more specific expression could be determined.",
        "For instance, an association of both the P and V sublevels with ;mint,.'",
        "yields 'think about the truth of...' and 'think about doing...1.",
        "In order to complete the paraphrase, the program assumes that 'he' has the same referent as 'his' and notes from the definition of 'mind' that 'mind' is an IPART of this referent.",
        "It then picks up those conceptual elements of 'close' other than those describing the innermost underlying &TATE--(TR-L (HYP +) TR-E)--and submits the entire list of elements (he (IPART: mind) T1 L STATE (HYP +) TR-E think) to a simple mapout routine.",
        "This gives the \"paraphrase\" 'he (I1',IRT: mind) STOP POSSIBILITY..OF START think'.",
        "An actual generator could arrive at paraphrases such as 'he stopped thinking'.",
        "corresponding 0-role interpretation would be 'nothing can start to b e in (i.e. enter) his mind', which is also a reasonable approximation.",
        "The aspect of 'close' which implies that nothing can leave rather than enter would yield 'he started to keep everything in his mind'.",
        "This might be unaerstood-in terms of not forgetting or not expressing oneself.",
        "The inability of the described 46 method to identify exactly which meaning is intended is the price of its objectivity and flexibility in being able to arrive at an interpretation with no previous knowledge of what such phrases refer to in a given culture.",
        "In this respect the mouel represents the abilities of a language-user who is unfamiliar with the idioms of the speakers of his environment.",
        "5'.2.",
        "Category sAft A \"category shift\" refers to the fact that instead of a PP or a conceptual NOMIN L, an attributive or verbal concept in the form of a noun appears as the concept which has been assigned role O.",
        "More specifically, these concepts are either \"conceptual attributes\" (of Objects) as represented by 'color', 'truth', 'beauty', 'value', etc., or attributes of animte Rs which taight be described as KEMAL-, SENSORY or CONTROL level VERBs in which the focus is on R rather than on the relationship between R and some 0, as represented by 'confidence', ',perception', 'pos.",
        ";ession', etc.",
        "Netaphorical uses involving either type of concept often involve level shift, as in 'its value deflated' or 'she built up his confidence'.",
        "In this sense they resemble that class of express ions designated simply as \"level shift\".",
        "Also, the procedures for interpreting the (level- and) category-shift 'they decimated his joy' and the level-shift 'they decimated his version of the accident' are similar.",
        "However, the designation of a cate3ory shift allows for the interpretation of the metaphorical '11.",
        ":.s smile disintegrated', which does not involve a level shift in the sense described above.",
        "Inaddition, this dlsign tion preserves the theoretical distinction between 'joy' as an (animate) attribute and the NOMINAAL 'Version' ('story'l etc.)",
        "as a concept which is isolated f±om its aniate source, a distinction wilich is realiL.ed in the definition of 0 in each case.",
        "Rather than being defined as a NOMINAL, 'joy' or the noun 'smile' is defined a$ a noun with a basic was structure and level.",
        "NOMINAL feutures, which are not as criticl for non-PHYSICAL as for PHYSIC 1L NOMINALs, are even less distinguishable for attributes.",
        "The .NIM TE feature divides the class of attributes as described abc.ve; in general, however, feature volues are presently ignored possible restrictions on metaphorical uses of attributes.",
        "A few examples of category shift in which the topical focus is on an attribute rather than on a human experiencer R, illustrate auditional points concerning metapLtorical inter)retations.",
        "One of the general problems of metaphorical interpretation is to show in the representation of a phrase the analogy to a conceptual object, as well as \"what is really happening\".",
        "They in7ut exam,Ile 'his smile disintegrated' should",
        "smiling'.",
        "Yet the ability to thus relate these expressions must be bdsea on some underlying similarity with intuitive appeal.",
        "This task requires a verb definition procedure such as the one presented here, which rests on a sm .11 number of conceptual elemtnts.",
        "The primitive element of TRANSITIoN underlies 'he stooped smiling', 'his smile disintegrated' and 'his smile left him', even though on the surface it appears only to underlie the latter (third) form of expresAon.",
        "This element is expressed in our semantic representation as TR-L. From there the TR-L structure could be incorporated into a conceptual diagram in a number of ways, e.g. by a transition arrow by a \"cause-to-not\" or or by a \"finish-ACT\" notation structure tf 0===0 .",
        "The latter notation is the one actually used in conceptual dependency for examplesof the type given.",
        "This notation does not express any relationship between the three forms of the exam?le given above.",
        "Howeve•, it is mapped out or TR-L, which does show this relationship and is referred to in the following analysis of 'his indiffereace disintegrated' Briefly, 'disintegrate' is defined as changing from existence to non-existence of an object, on the PHYSICAL level: ((PH) TR-L (STATE (0 BE)) ...).",
        "Since 'indifference' is not consistent with, the PHYSICAL level, a base-level interpretation fails.",
        "Since 'he' is +ANIMATE, the NENTAL-level noun 'indifference' can serve as an attribute of the'",
        "as ex)eriencer There are no feature specifications which must be fulfilled by the attribute 'indifference'; therefore there crc no obstacles to an intdrpretation on the nJNITAL level.",
        "The deanition of 'indifference' yields the descriptors '((kr; A) (ST.ar; (0 R) (VAL +-)))'„ where 'A' represents AVAL, i.e. the 1,.ENTI.L sublevel 'Attitude', and '+- is the value ,.or 'neither positive nor negative'.",
        "'Indifference' can be defined in terms either the LTM or the JP, i.e. either as +HYP or -HYP; +HYP is arbitrarily assumed fur non-PHYSICAL concepts.",
        "The program thus enters the matrix with dimension information (nE A R ST-TE +H +-) to obtain a corresonding R-role VEL.B.",
        "It finds 'be-indifferentto', uses the R already determined as subject and adds structure element TR-L given by the verb to obtain 'he STOP be-indifferent-tow', leaving a slot for the object of the indifference.",
        "The procedure is similar for 'his smile disintegrated'.",
        "The .1rogrcm determines a category shift and accepts the T1.-L structure for 'disintegrate' with the \"loss of existence\" of O (0 BE) interpreted as the \"loss of state\" of R (0 AT R).",
        "Thus the resulting R-role representation is the swine as that for 'he stopped smiling'.",
        "CIt might be noted thct the substitution of a concept sucha s 'smile' for a physical object could be represented as a PHYSICAL-to-ACTIVE.shift, if an ACTIVE level ispostul.Ated for NOMINALs snd VERBs (5).",
        "Pursuit of this approach would designate this example; like 50 the other extmples of this section, as a case of lev.1 shift.)",
        "The example 'truth burned up' is dismissed by Katz (3) as sem.nticolly anomrlous.",
        "However, if huiwns untlerstand sentences involving verbs which apparently violate selectional restrictions, t1ien such expressions are also .subject to computer understanding.",
        "In terms of the matrix, 'truth', a conceptual attribute, represents a positive V,Ilue of an attribute of a Llexically absent) MNTAL object, which is in turn dominated by a (le:dcally absent) a.",
        ".ince 'burn up' differs from 'disintegrate' only in the me.ns or manner of the notion, the analysis of this example is similor to that of 'his indifference disintegrated', with o shift to the TVAL- rather than to the rtVAL sublevel.",
        "By llowing for the assumed R and 0, the output routine can obtain the approximation 'one STOW know...' Cpeople stonped knowing') or 'one STOP a.LATE-TO true information' ('people stopped lulving or telling the truth').",
        "Thus although contextual restrictions on 'burn up' would indicate a +PHYSIOtLL NOMINAL as actor, the program still \"understands\"-the usage while recognizing that it is not base or \"normal\" usage.",
        "This is possible because the system isol tes the •rimitive structure of a verb from its ordinary selectional restrictions.",
        "That is, 'prosperity' maps into an attribute on the CQNTADL level (Extrinsic control of PHysical concepts), is positively valued, of a great AMOUNT, and dependent on any *HUMAN concept.",
        "'Country' has the feature ret uired for an R on the_CuNTROL level (+ANIMATE), and further, it satisfies the 41-iurdN specification demanded by 'prosperity'; 'leap to' specifies no particular restriction for R other than +PHY.ICAL.",
        "therefore wish to take over the structure for 'leap to', but to indicate the CONTR9L rather than the FHY:ICAL level.",
        "The structure essentially is TR-C as found in the definition of the 0-role verb 'leap-to'.",
        "The concert of 'start to b e' or 'become' which underlies TR-E at any level is transformed to 'start to have' in an R-role evression.",
        "The dbject of the control involved, in 'proverity', which is given as 'PHYSICAL', canbe mapped into the word 'material' for purposes of generation.",
        "Thus our representation yields the R.-role 'country START have-material' in the implementation,",
        "and could be the basis for other non-metaphorical paraphrases such as the U-role 'the country wzs becoming prosnerousi.",
        ":mother example-, interestirq, becauae potentially all level...) arc involved in its metaphorical interlItetatLon, is anti America arc drifting apart'.",
        "Subject to the context of the discourse, the metaohorical internret•ion in this case 1►6.y turn out to be a more likely interpretation than the bt se (.211Y0IUAL) one.",
        "',rift apart' is defined in the dictionary as a symmetric, i.e. +SHARL:1) verb on the P YsIGAL level: ((PHYS) TR-L (ST 21., (0 AT R)) (an.",
        "0) (z:(3'2.NT -)...(SHARLD +)).",
        "Si-,ce the syntactic joint actors, 'T:.urope' and 'America', are both de2ined FS having a +PKYoICAL component, i.e. their geographical areas, we have the PHYICAL interpretntion that the continents of Lurope anti mric,I.are in the process of going away from one another.",
        "That is, .uro2e or America or both are losing the location they once shored.",
        "Since 'drift' potentially takes a source or goal as indicated by '4iT R', the exLmple satisfies the condition for testing for an R-0 switch.",
        "The missing NOMINAL or attribute (which would correspond to 'prosperity' in the Previous example) implied in the sentence can have any level, since it is not explicitly given.",
        "'urope' and ' =Heat as institutions fulfill the +ANIMATE condition for R:",
        "missing NOMINAL or attribute from wh-Lch they are drifting is Unknown.",
        "Thus the.",
        "program determines that interpretations on the MLNTAL, Z)L;NoORY and CONTROL levels arc also possible.",
        "On the 1\\112.MIL level, the above structure for 'drift apart' is the structure which underlies a possible paravhrase generation of 'Europe and America no longer ogrcei; on the SENSORY level it is the structure for 'Europe and America no longer perceive the same things'; and on the CONTROL level it is the structure for 'Europe and .merica no longer have the same rights, responsibilities or types of control!."
      ]
    },
    {
      "heading": "5.4. Intra-level feature shift",
      "text": [
        "In the level shifts described above, a verb is usually borrowed frOm lone level 3nd applied at the level of the object with which it will be used.",
        "In intra-level feature shifts, all components conform to the same level, usually the piasickz, but a specifications) or feature(s) of the object is violated.",
        "When the +ANIMATE feature of an actor is violated, a kind of personification or anthropomorphic behavior results, as in 'the chair drank the ink'.",
        "This can be referred to as an \"actor-feature shift\".",
        "(A corresponding example on the UENTAL level might be 'that painting says something to me', where the painting does not literally say anything, but the result of looking at the painting is the same as if something had been 54 said.)",
        "If, however, it is the object which does not meet the specifications of the verb definition ,.nd yet the ,phrase is \"comprehensible\", there is an \"object-feature An example is 'the ship plowed the sea'.",
        "5.4.1.",
        "Actor-feature shift As stated above, there is no change in level for this type of metop'ior, but the +.0:11%L.T,; restriction on the actor is violated.",
        "Thus 'the chair drank.the ink' i, example of intro-level ..hint ,but' 'the boy drank in the -,oetry' is not, as it involves an extension to a different level.",
        "In general, the semantic recuirements on the object of such an expression are the scale as tho..c in r non-metaphorical usage.",
        "In 'tae chair dr..nk the ink', both the 'c lair' and the 'ink' arc ordinary phy-ical concepts, although the use of 'drink' is not quite the ordira ry one.",
        "An ex,-4.11nation of this exauple by t.hc 30.11 ntic com-onent reveals nothin unusual AboU'l: 'drank the ink', 'ink' is -1-1.7!",
        ";,A...tul, and +FLUI, as rec uireu by th,-;.",
        "'Narrow' speci.acations of 'drink'.",
        "'Chair', though +.0IrfoICAL, is noted to lack the +ANIliaL feature value specified by 'drink', so the ordinary sense is rejected, while the conditions for an actor-feature shift cre satisfied.",
        "The determination of a metaphorical interpretation implies that the effects or linguistic inferences derivable from the underlying conceptualization are simil,r to those derivable from a conceptualization containin,; the literal ,"
      ]
    },
    {
      "heading": "55",
      "text": [
        "senae of Turink', which is 'to INGL.",
        ";ST a +PHYSIC.J.J, +FLUID substance'.",
        "Since the input example is already in R-role form, i.e. with the Recipient as subject, an 0-role form is given as paraphrase in the output.",
        "Because the structure is a TR-E one, with 0 = 'ink', it is known that the ink was removed from somewhere and is now in the chair.",
        "The information given as a result is 'ink START B in chair'.",
        "Considering other variations on this input, we note th,it we could not readily interpret 'the blotter drank the chair', since 'chair' is -iLUID.",
        "The example 'the ship plowed the sea' fails a literal interpretation on the basis cif the definition of 'plow': (plow ((lINYS) TR-I; (ST4 TE (0 BE SHAPE: )) (ROLE 0) (AGENT +)"
      ]
    },
    {
      "heading": "(INSTR: TR (STATE (0 tiT R))) (0 (NRW land) (BUD (2D +) (FIXED +))) )),",
      "text": [
        "since 'sea' is not a synonym for 'land'.",
        "However, 'sea' fulfills the 'Broad' specifications of 'plow' for O.",
        "'Ship', the syntactic subject, is assigned the role of AGENT.",
        "In (5), it is explained that an AGENT, i.e. a NOMINAL which has some role in a causative action, either 1) is +.1NIM„TE, 2) itself represents an action and therefore has the ACTIVE level, or 3) has a specific function which enterf, into the causation.",
        "Since 'ship' isneither +.1NIKITE nor ACTIVE-level, it is assumed to have a functional role in the causing conceptualization.",
        "The program checks to see that certain 56 reouirements of an instrumental involvement of 'ship' in 'plowing' are fulfilled.",
        "The function of 'ship' is given as 'sail'.",
        "The structul'e uftderlying is TR (ST;iTE (0 AT R)).",
        "Although the noun 'plow' might be given as the ex )licit instrument of the verb the program ignores the failure to agree with such specific information, just as it ignores 'Narrow' restrictions on' objects when considering metaphorical expressions.",
        "On examining the general structure given for the instrumental conceptualization of 'plow', the program finds TR (6T,sTE (0 AT R)) which agrees with the verb structure of the function of In other words, although only a 'plow' can truly 'plow', in a metanhorical interpretation anything' which \"physically goes\" can conceivably 11..ve a \"plow-like\" effect.",
        "fhe pro ;ram therefore arrives at the rough interpretation 'ship DO (sea -.17 IRT (BE SHAPE: )).",
        "Conceptual depen..ency rules would then transform 'ship DO' into a structure corresnonding to 'one operate ship'.",
        "Consider now a verb--'kill.'",
        "--which is subject to metaphorical use.",
        "but in a non-straightforward way, since a level shift and/or-an object-feature sh_ft maybe involved.",
        "14 the exam?les 'John killed the cat' and 'the House killeu the bill', the ordinary object of 'kill' ( cat') is no more a mere physical object than the metap'llorical object (thin') is a mere mental object.",
        "The PHYSIOAL-to-I,ENTAL extension 57 in the aecond example is obscured by the simultaneous presence of an object-feature shift.",
        "To clarify the role which each type of shift plays, a similar example is first presented which involves only object-feature shift: 'he killed themotor'.",
        "This example could be more explicitly paraphrased as 'he did something which uaused the motor to die*.",
        "The interpretation depends on what it means-for Vine object, Imottlirs, to 'die' or 'be dead'.",
        "It would be desirable to obtain the interpretation 'he stopped the operation or running of the motor', while rejecting a dimilur interpretation for 'he killea the stone'.",
        "*Motor' and 'stone' are,both PHThIJAL NOMINALs; no level shift is involved.",
        "Rather, the +AN11\"4021'.",
        "specification on the object is violated, yielding a metaphorical interpretation in the first case and no interpretation in the second.",
        "Motor' is a meaningful object of 'kill' because it is a +DYNAMIC NOMIN 1, its function being to 'run'.",
        "(It is recalled from Section 3.1 that the +DYNAMIC feature value specifies a function which can be identified with the particular meaning of a NOMINAL.)",
        "When a motor is 'killed', this function attribute is eliminated--a consequence which differs from e.g. the disintegration of the motor which might represent its being 'destroyed'.",
        "The proceaure of the program operating on the first two examples canbe outlined as follows.",
        "The semantic representation for 'kill' is:",
        "the verb are met by the words of the input.",
        "In particular, IrYelatt is 4 YDIATE; that is, in terms of DYNAMIC FUNCTION, it 'lives' in a literal sense.",
        "Thus the literal sense of 'kill' Is accepted.",
        "If the inidut'John killed the stone' is encountered, the program notes that 'stone' has no +ANIMATE feature value and therefore fails a base interpretation.",
        "Furthermore, 'stone' isnot +DYNAMIC and therefore does not satisfy the 'Broad' specifications necessary for a metaphorical interpretation.",
        "The input 'the House killed the bill' presents a more interesting case.",
        "'House' in the sense of 'House of Repre-sentatives' or 'Lower House' tv.s the +ANIMATE feature preferred by the target representation conditions on an AGENT as specified aboviiwith respect to 'ship'; however, 'bill' does not have the +ANIMATE feature value as required by Thus a base-level interpretation is rejected.",
        "However, 'bill' does have the +DYNAhIC value, corresponding to the observation that it has a \"continuous effect\" on people.",
        "Thus the basic components are satisfied for an interpretation.",
        "Since the dispensable 'Narrow' +ANIMATE descriptor, i.e. the literal 'live' function, is violated,but the minimal, i.e.",
        "'Broad' requirements are fulfilled, the employment of 'kill' is considered a metaphorical extension from the PHYSICAL to the 1'ILNTAL level.",
        "The structure TR-L (STATE (0 ‹FN (0)) )) (AGENT +) then yields the paraphrase 'House al1010 bill become law', where 'law' is a CONTROL concept rerxesented in terms of 'one must' and 'one may'.",
        "By noting that which is common to both the base sense and metaphorical senses of we c..n comp re the meanings of these senses.",
        "The underlying structure of the verb itself specilfies in all cases that an vction was successfully t,,ken to eliminate the DYNAMIC function or effectiveness of the Object.",
        "The effect component o1 this structure says that the Object no longer exists in its previous State, for this is t'le interpretation assigned to the TR-L structure.",
        "Thus the cat no longer lives; the wotor no longer runs; consideration of the bill stops, and the_intended result, defined conceptually as is prevented--thus the prohibition, order or permission contained in the bill is never realized."
      ]
    },
    {
      "heading": "5.5. Noun compounds",
      "text": [
        "This type of metaphor analysis can also be applied to noun compounds in which the nouns are defined in terms of verbal concepts.",
        "The further L.evelopment of the above mech-animsms must precede an implementation of the more complex noun-compound metaphor analysis; however, the ctporoach to interpretation of such constructs can be indicated.",
        "An 60 example is given by the noun compound idea factory', \\Alich is close in meaning to the verb-noun compound 'think tank'.",
        "If the +PlUolUtiL objects or matter usually associated with 'factory' or 'tank' are ignored, noun-compound interret.ition procedures (5) can be used to arrive at 'institution which makes ideas' or 'environment in which one thinks' respectively, Here the verb 'think' and the noun 'idea', which is an object oL thought, retain their literal st,nse, whereas the functions underlying 'factory' ('make l) and 'tank' ('be in') undergo an abstraction process similar to that involved in level shift.",
        "Consider also the example 'the foreign-born may hold the White House key soon'.",
        "It is possible to understand 'White House key' in itt metaphorical sense because: 'key' is a NONINAL described as having the function 'onen'; 'opening* implies the possibility of 'entering' (cf. 'close', Section 5.1); and ' hite House' is not only a PHYCia, building, but is also defined with the Lectures of tan institution, which includes ANI11,,TE beings.",
        "Thus the framework exists tor handling some metaphorically used noun constructs with underlying verbal and/or attributive concepts."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "The examples of Sections 5.1-5.4 are representative of the vLrious metaphor mechanisms which have been identified.",
        "The question arises as to the extent to which such mechanisms hold for any metaphorical use of a verbal or attributive 61 concept.",
        "An assessment of the validity of the analysis method for such metaphorical uses depends upon 1) the completeness of the identified categories, i.e. whether such categories cover all types of verbs in the class under consideration; 2) whether such categories are based on the most \"important\" component which enters into metaphorical extensions; and 3) the extent to which vriotions within a category af4.ect the plausibility of an interpretation.",
        "The first two conditions are concernecWith, the queution of \"minimal\" interpretation, i.e. the exclusion of a \"false\" interpretation, the third with an \"adequate\" interpretation.",
        "With respect to the first point, the Verb description system presented has intentionally focused on the breauth or scope of the categorization r,Ither th,,n on a more detailed illustrwtion of any one category.",
        "such an overview must have prior consideration because the translztion of a metaphorical verb requires comparimn with other verbs, which themselves must be assigned a \"location\" within the sistem before any"
      ]
    },
    {
      "heading": "refinement of interpretations can begin. The sivcn system",
      "text": [
        "outlines t is categorization in term of three reloted primitive structures.",
        "STATE, ENTER-.SZATE and LEAVZ-ST_CE, which are subject tc, embedding, as in the case o 'close' (Section 5.1).",
        "Roles define the ap location of zheke structures to an \"object\", a \"location\" of an object and an \"agent\" of any change, the result of which is represented by such a structure.",
        "These roles, which are few in number and relotively simple to identiLy vny given verb, are adecuate to relate any lexical verb mom to an underlyin.",
        "structure.",
        "This structure-role description divides the class or predicc:ive concepts with the exception of \"logical\" terms such as 'imply' or 'equate'.",
        "Thus the field of verbal and attributive concepts is covered by this minimal classification based on intuitive abstract concelyts.",
        "These abstract structures can be primitively realized in the literal output paraphrases as 'be (or not be) in a certain state', 'start to be in a certain stete' and 'stop being in a certain state'.",
        "The nature of the 'state ' can then be described to Cie extent allowed by the level/sublevel definition of the Object of the -1hrase.",
        "The iL-entified levels which define the field of metaphorical extension cLn always be exp“nued or refined to give more inform, tion, since they Lo not aflect those components-structures and \"structural\" features excluuing HYP and VOL-which remain constant in an extension.",
        "It is cloimed th.,t these structures arc the mast basic characteriAng elements of a verb in the sense th, t the identified primitives and mech,nigms are those which can also be recognized as unoerlying conceptually simpler linguistic constructs not usually thought of as metaphorical.",
        "Although a phrase such as 'he reached ;prosperity' is not obviously metaphorical, there is a \"trLnslPti.sn\" between it",
        "and the phrase 'he became prosperous' which is similar to the translation between the more coLoriul The leapt to prosperity' and 'he became (suddenly) prosperous'.",
        "In each case, the primitive TR-E representing 'start to' relates the two forms of the expression.",
        "This similarity rests on the fact that all linguistic expressions which treat abstractions ('prosperous') as objects ('prosperity') might in a sense be considered metaphorical.",
        "It seems reasonable to ap roach the problem of metaphor with an analysis valid for the simplest form of such expressions.",
        "The analysis represented by the structural descriptors is trivial but basic in that it is a prerequisite to any more complete interpretation, and in that it relates expressions exhibiting varying degrees of metaphor without resorting to ad hoc definitions or rules.",
        "Although they provide a basic interpret:4tion, the structures and features whiel render an extension meaningful are not necessarily, the focus of a metaphorical expression.",
        "The focus may be an attribute which, while provided for and",
        "broauly classified by the structure-level definition of the verb, itself remains to be defined.",
        "To take a r. tiler difficult examole, the verb 'bleach' can be .efineu as '+AGI:INT TRnL 624i1'L; Q0 13-:; CU ,OR: ) LOLL OP, or, 'to cvuie .vn object to 1,L;.11/1; a dX,ZE of QOLOW.",
        "It 'bleach' 5... uJed metaphorically, as in 'she bleached the story•, this deanition gives the minimal information that some attribute of the tory disappears.",
        "This is the\" moJt basic or nece.",
        ":..,cry p‘rt of the interpretation, but is not)very interesting.",
        "It would also be desirable to know how the attribute itself enters into the metaphor, i.e. what the color or loss oz color signifies.",
        "For quantit,tive attributes, i.e. those with magnitudes as values, ne prinitives '..V...;UNT' and 'INTL;:„IiT' arc included in the definition at the PHY,SIuAL level rnd are easily extendeu to other levels.",
        "The characterization of qualitPtive attributes, such as 'with or without (a certain) color', is more difficult.",
        "A aug-,csted ooproach (5) as3igns KaITIVEMD322IVE value \"connot tions\"':o ttributes where they suggest themselves; for example -'bri;ht: P00', 'flat: NL:G' (but 'even: POS' I).",
        "These assignments can be expected to reflect culturA.",
        "differences in understanding metaphor.",
        "j\"or the present exam:le, even th4q miniaaL definition is difficult, because literal bleach .n, can be done for different purposes; bleaching mi,,ht be rerceived as NZGATIVE in the sense of 'removing color', but 20bITIVE in the sense",
        "of 'launuering' or 'removing stains' (TR-L oT TE (0 ) COLuR: NLG)).",
        "However, the resulting ambiguity in any metaphorical interpretation 1rgely reflactb the ambiguity of any literal use of the verb.",
        "In both cases a knowledge of the linguistic or situational context is required for a correct unuerstanding of the use of 'bleach' ('he bleached the report of the war casualties', 'he bleached the anecdotes' This example points out the accomplishments and limits of the syJtem in defining components significant to metaphor.",
        "ghat it uoes is to s-ecify ,1 structural framework Lin terms of which those properties of predictive concepts relev..nt to metaphorical usages ci.n be methodically defined.",
        "In other words, the system distinguishes the conceptual structure component underlying a verb form from •thOse semantic attributes which are \"non-structureu\".",
        "Thus .the structure unuerlying 'bleach' is autonttically specified, as above, and )rovides \"slots\" such as Poo/NLG for the attrthute represented by 'white' or 'without color'.",
        "The s•)ecifications for qualitative attri;;utes must remain flexible, subject to the associations which a culture or subculture assi-ms to such attributes; the symbolic value of an at traction such as 'black' iJ difficult tc.",
        ".define in v gcner,'l m nncr, apart from mny context.",
        "In this sense the reuuctiun of a verb use to quantitLtive primitives qualitative attribute-values may.re2resent the limit to which metaphorical z'nalyses can be generalized.",
        "b6 Given that this system of'represontation pro,uces minimal interpretntions wherever possible, pis op')oscd to the alternative of dismissin an expression as i.nomAloull, it reuains to consiue%r the third condition listen above, n melt' the adequacy of the mc thod as tk vkrbal conce-Its which are claitaed to 4all within a catgory, 4 -.e.",
        "which ore a8si neu the satae configuration-of dcserilNtors.",
        "it is assumed that the primitive structure unuerlying a verb is .11ways carried over in a metaphorica usage, dlthou 1a it =y be magnitude (which is llowed for in terms of AMU NT and INTENSITY) or some other aspect of \"style\" (which is not lrovided for) which is emphasized.",
        "T''us 'leap to', 'drift into', 'land on', 'hit' and 'plow into' or 'plow through to' (which share the si,me structure and fetture v,lues except foi:.",
        "VOL) all lead to similar interpret tions, given a common goal, e.g. 'prosperity' Al yield 'the beginning of a prosperJus state'; with incorporation of the INTENSITY descriptor, 'leap to' and 'hit' yield 'sudden beginning'.",
        "Treating (one sense of) 'hit' and 'leap to' as neLrly synonymous (TR-E ST“TE (0 ON R for 'hit', 0 AT R for 'leap to') (INTEN.ATY0) (a0LE 0) ), which they are not, entails some loss of information, of course, but the resulting approximation is useful.",
        "In the case of 'plow through to', on the other hand, the lack of the information that a \"laborious effort\" is involved weakens the interpretation to a greater degree; this kind of style, which depends 67 on toe specific mechanics of the action or the attitude of the actor, is difficult to incorporate into a systematic characterization.",
        "HoweVer, sudi intoymation, independently determined, could be added to the verb d6scril)tion.",
        "For example, the descriptor 'INTLNSITY:›1 appended to the feature vaue i+VOLt could be assigned to the verb 'plow'.",
        "These descriptors would be carried over to the incomnlete but more informative metaphorical \"interpretation\": the very consciously did something to become prosperous'.",
        "Thus it can be concluded that the method presented covers a major class of predicative concepts, and that the resulting approximLtion to the meaning of an expression is reason,ble but varies in the amount of informotion conveyed.",
        "It is of significance.",
        "that the emphasis on inclusive classes together with a specific suggested format allows for extension of the system.",
        "Interoretationsproduced on the basis of relatively minimal information will not always be completely satisfactory, nor will they 7rovide all the nuances of linguistic expression.",
        "However, the possibility that interpretations of L. large class of metaphorical ex)ressions can be approximated by a systematic analysis of the concepts involved ensures further opportunities to aevelop computer understanding of novel expressions."
      ]
    },
    {
      "heading": "FIGURE 1 OUTPUT INTERPRETATIONS Format: <INPUT PHRASE> <TYPE OF METAPHOR> <INITIAL ROLE CONFIGURATION> <OUTPUT PARAPHRASE> ( CHAIR DRINK INK ) FEATURE-SH1Fr RVO",
      "text": []
    },
    {
      "heading": "( COUNTRY LEAP-TO PROSPERITY ) RO-SHIFT OVR ( COUNTRY START HAVE-MATERIAL ) (PROSPERITY DISINTEGRATE ) CATEGORY-SHIFT OV",
      "text": [
        "Mappinr into Paeaphrase Words ---"
      ]
    },
    {
      "heading": "(STATE TR-E TR-L (HYP +)) (BE START STOP POSSIBILITY-OF) Input Phrases; CHAIR DRINK INK; HE DRINK INK; HE CLOSE INK; HE CLOSE MIND; SHIP PLOW SEA; SHIP PLOW CHAIR; CHAIR PLOW SEA; SHIP DISINTEGRATE; INDIFFERENCE DISINTEGRATE; COUNTRY LEAP-TO PROSPERITY; PROSPERITY DISINTEGRATE;",
      "text": []
    }
  ]
}
