{
  "info": {
    "authors": [
      "M. Sharon Hunnicutt"
    ],
    "book": "ACL Microfiche Series 1-83, Including Computational Linguistics",
    "id": "acl-J79-1057",
    "title": "Phonological Rules for a Text to Speech Sytem",
    "url": "https://aclweb.org/anthology/J79-1057",
    "year": 1979
  },
  "references": [],
  "sections": [
    {
      "text": [
        "The phonological rules discussed in this paper are part .of a system which has been 'under development at M.I.T.",
        "to convert unrestricted text to speech.",
        "The system utilizes a morph lexicon and a vocal tract model.",
        "Although most of the linguistic analysis is done by decomposing words into their constituent morphemes, such a system is not stAfficient for unrestricted text.",
        "In order to attain the competence of a comprehensive system, it was necessary to develop a scheme for dealing with unrecognizable words.",
        "This is called the \"letter-to-sound\" system.",
        "When a decomposition fails, that is, when a word, cannot be decomposed into its cons_tituent morphs or when it is too infrequent in the English language to be included in the morph lexicon, the \"letter-to-sound\" system is invoked.",
        "The letter string which it receives is converted into a stressed phoneme string using two sets of ordered phonological ruled.",
        "The first set to be applied converts letters to phonemes, first stripping affilxes, then converting consonants and finally converting vowels and affixes.",
        "The second set applies An ordered set of rules which determine the atress contour of the phoneme string.",
        "These rules were developed., by a procesrs of extdnsive statistical analysis of English words.",
        "The form of the rules reflects the fart that isronunciation of vowels and vowel digraphs, consonants and consonant c4usters, and prefixes and suffixes is hrghly dependent upon context.",
        "The method of ordering rules allows converted strings which are highly dependable to be used as context for those requiring a more complex framework.",
        "Detailed studies of allowable suffix combinations and the effect of suffixati,on on stress and vowel quality have also provided for more reliable resdlts."
      ]
    },
    {
      "heading": "I. The Text-to-Speech System",
      "text": [
        "A system to convert unreltricted printed text to speech has been under development for several years at M.I.T.1'2'3 The approach has been to model the proces.s employed by a native speaker of English when reading aloud.",
        "In order to develop correct computational algorithms for the pronunciation of English words, it has been necessary to reflect Che basic nature of linguistic processes.",
        "Consequently, considerable emphasis has been placed on the development of morphological and phon9logical analysis, stress patterns, parsing systems and prosodic correlates.",
        "It i possible, using the current system, to convert any English word or string df words in a textual representation to intelligible speech.",
        "In order to effect this conversion, a number of subsystems are utilized including morphological analysis, letter-to-sound rules, stress rules and phonemic speech synthesis.",
        "Prosodic studies are now in progress; experimental parameteLs for fo contours and timing patterns will soon be included in the system.",
        "The letter., string which represents a word is usually converted to a phoneme string in preparation for speech synthesis by a process of morphological analysis.",
        "A morph lexicon containing approximately 11,000 entries has been developed and is used in conjunction with a morph decomposition algorithm.",
        "Included in the lexicon are two major classes of morphs.",
        "One class is composed of roots such as \"trust\" and \"snow,\" i.e.; words which car occur alone, and bound roots such as -celve perceive, receive, conceive), rot (rotary, rotate, rotor) and miss (dismiss, missive, permissiveness).",
        "Affixes make up the second class and may be attached either to roots or tc bound morphemes.",
        "Accompanying each lexical entry is its phonemic representation, its morph class and its part(s) of speech.",
        "Algorithmic decomposition of letter-strings models the prpcedure used by a native speaker when confronted by a word which he does not immediately recognize or has previously not encountered.",
        "If the word is not immediately recognizable, i.e., if It is not in the \"lexicon\" of the native speaker in its entirety, an attempt will be made to break it apart into its constituent morphs.",
        "Such a process is probably used when vile reads a word siich as antidisestablishmentarianism, earthrise\" or \"cranapple- for the first time The algorithm also models the ability to recognize mutations such As the dropping of a final silent re-14 (observe - observance), the doubling of t a final consonant (red-reddest) and preceding vocalic suffixes (glory - also included, modeling the ability plural (horses, cats, dogs) or past tense (quieted, hushed, whispered), and to palatalize in appropriate contexts ( sculpt - sculpture, confuse - confusion).",
        "Another feature of the algorithm is a set of selectional rules which, although very simple in form, choose Ole corpect morphomic analysis from all possibilities in a large number of cases.",
        "A standard form for sequences of morphemes is compared with each possibility, and rules describing preferred composition are used in a pairwise comparison leading to an acceptable result.",
        "The word \"formally\" provides an example in which the only rule needed is one stating that a root followed by a suffix is preferable to two concatenated roots.",
        "Possible decompositionsof the word \"formally\" are the substitution offor final [y1 glorious).",
        "Morphophonemic rules are to give a correct pronunciation for any detected as follows(R represents \"root\" and S, \"suffix\"): form (R) + al (S) + ly (S)form (R) + ally (R) for, (R),-,- mall (R) + y (S)form (R) + all (R) + y (S) It is clear that the correct decomposition is the only candidate having the form of a single root followed by suffixes.",
        "When a complete morphemic analysis fails, that is, when a word encountered by g native speaker cannot be separated into its constituent morphemes, or when it is so infrequent in the English language that he has previously not encountered it, a \"letter-to-sound\" system is invoked, i.e., an attempt is made to sound out the word letter by letter.",
        "The competence of a native speaker which allows him tQ perform this conversion is based on correspondence,s; between Petters and sounds in English which have been internalized through experience.",
        "(A native speaker will also apply the same correspondences to a foreign, word from any language of which he has no knowledge.)",
        "A scheme4 to model this vrocess,must be made available, sequenced after the decomposition algorithm, in order to be able to convert unrestricted text to speech.",
        "The text-tb-speech System includes a phonological model having a two-phase structure: the first phase is 4 set of rules which converts letters to phonemes, and the second is an algorithm for placement of stress on the converted phonemes.",
        "This system has been implemented in BCPL on a DEC PDP-9 and on a PDP-10 in.MAC LISP.",
        "On might ask why, with a set of letter-to-sound rules available, it is necessary to have a lpxicon.",
        "There ire three reasons; all are restrictions which must be Imposed om any viable letter-to-sound system.",
        "-First, it has been observed that high-frequency wotds perhaps because of extensive use, do not always follow letterto-sound rules.",
        "For example, the only instance in which a final Lf] is pronounced as /v/ is in the word \"of \" The letter [w] following a consonant is generally pronounced like the Da] in \"sweet\" or \"twill,\" but in the word \"two\" it is not pronounced\" at all.",
        "A study5 of the 200 most frequent words in English according to the Brown Corpus6 c.ras made to determine their regularity of pronunciation.",
        "It was found that although the regular case is that a final [e] preceded by a single consonant (other than lengthens the preceding vowel, four of the 200 words, i.e., \"have\" (compare \"behave,\" \"shave\"), ''onesome\" and \"come.\" (compare \"lOne,\" \"ode\") are exceptions.",
        "The case of initial [th3 is even more irregular among high-F frequency words.",
        "In most English words, initial l_th Is unvoiced as in \"thistle,\" \"thin,\" \"thesis,\" However, twelve of the 200 words began with voiced rthl.",
        "Secondly, it must be recognized that the letter-to-sound rules which operate within a morpheme do not necessarily apply across morph bounddries.",
        "In particular, the pronunciation of compounds requires a lexicon.",
        "Such.",
        "words as \"ha.tbouse\" or \"potherb\" might ethervise appear to contain the consonant cluster th-,1, and the motpk-final silent el in \"houseboat\" would certainly not be silent if the word were not recognized as a compound.",
        "The application of letter-to-sound rules must therefore be restricted to words containing no more than a single root.",
        "Thirdly, foreign words which retain their original pronunciation must be lexical entries.",
        "The entries may be made in the same way a native speaker of English would add a foreign word to his vocabulary, i.e., by pronouncing it -8-as if ft were an English word (using English letter-to-sound rules) until 1:nformed of its correct pronunciation, and then placing it in his mental lexicol.",
        "It is apparent, then, that both morphnlogical and phonological systems are necessary and that together, in sequence, they can proVide a phonemic representation for any English word presented for conversion to speech.",
        "Although, at present, there is no interaction between the decomposition and letter-to-phoneme algorithms, a more highly efficient system could be developed in the future.",
        "The size of the lexicon could be reduced, fr example, by app,lication of stress placement rules to the output of the decomposition algorithm or by omitting unnecessary phonemic representations II.",
        "Letter-to-Sound The conversion of a letter string to a phoneme string in the letter-tosound program proceeds in three stages.",
        "In the first stage, prefixes and suffixes are detected, (cf.",
        "Figure 1)Such affixes appear in the list.",
        "of phonological rules.",
        "Each is classified according to :1) its possible parts of speech, (2) the possible parts of speech bf a'suffix preceding it, (I) its restriction or lack of restriction to word-final posItiop and (4) its.abirity to change a preceding [y] to [i] or to cause the omission of a preceding Le].",
        "Prefixes are given no further specification.",
        "Detection of auffixes proceeds in a tight-Eo-left, longest-match-first fashion.",
        "When no additional Duffixas can be detected, ou When a possible suffix is judged as syntactically incompatible with its right-adjacent suffix by a parts-of-speech test using classifications (1) and (2) above, the prOCOSS is terminated.",
        "Finally, prefixes are detected left-to-right, also, by longest match first.",
        "If at any time the removal of an affix would leave no consonant or no vowel in the remainder of the word, the affix is not removed.",
        "Example: dictatorship",
        "dicti+ ate + or + shippossible suffix analysts ship: (a) nominal suffix (b) follows nominal suffix or:(a) nominal suffix ate:(b) follows verbal suffix (a) verbal, nominal and adjectival (b) follows verbal, nominal and adjectival suffixes dict + ate + or + shipparts of speech are compatible; analysis accepted.",
        "-10-Example: passing pa + s + s + ingpossible suffix analysis ing: (a) nominal and vetbal suffix (b) follows nominal or verbal suffix.",
        "sl(a) nominal and verbal suffix (b) follows nominal and verbal suffixes (c) appears only inunacceptable analysis",
        "in word-final position pass + ingcorrect analysis Example; finishing fin + ish + ingpossible suffix analysi's",
        "ing: (a) nominal and verbal suffix (b) follows nominal or verbal suffix ish:(a) adjectivalparts of spe-dch not compatible (b) follows nominal 0\"-e adjectival suffix",
        "finish + ingcorrect analysis: root functions.",
        "as verb with verbal ending, ish The domain of application of the second stage rules excludes any previously recognized affixes and is assumed to be a single morpheme.",
        "This stage is intended primarily for consonant rules and proceeds from the left cf the string to the right.",
        "Extending the domaih to the whole letter string once again for the third stage, a phonemic representation is given to affixes and to vowels and vowel digraphs, (cf.",
        "Figure 1).",
        "Phonemic reptesentations are produced by a set of ordered rules which convert a leter string to a phoneme -suiag in a given context.",
        "Both left and right contexts are permitted in the expression of a rule, and may contain, variables as well as letters or phonemes Any one context may be composed of either letters and Letter variables or of phonemes and phoneme v5ariables_ Cotbination of these possibilities for both left and right contexts allows foF four possible context types.",
        "One type of rule, for example, makes it possible to convert a particular letter string to a phoneme string only if the left context is a specified phoneme string and the right context is a specified l.etter string.",
        "The method of ordering rules allows converted strings which are highly dependable to be used as context for those requiring a more complex framework.",
        "Because the pronunciatioh of consonants is least dependent upon context, phonological rules for consonants are app1ied first, i.e., in the second stage.",
        "Rules for vowels and affixes, requiring more specificAtion of environment, are applied in the third-and final stage.",
        "With the benefit of a previously converted consonant framework and the option of including as context any phoneme to the left of ma string under consideration, the task of converting vow-6s and affixes is simplified.",
        "Stage 1: (a) recognition and isolation of suffixes (b) recognition and isolation of prefixes Stage 2: conversion of consonants in root Stage 3: (a) conversion of prefix (b) conversion of vowels in root (c) conversion of suffixes",
        "di = n.amin + ej + 311 + zResult of Stress Placement Rules All phonemes are given in IPA symbols.",
        "A dash (-) serves as a place-holder for a letter which has not yet hen converted; an equals sign (=) follows each prefix; a plus (+) precedes each suffix The result.",
        "of stress placementalsd given.",
        "Figure 1 Application of Letter-to-Sourid Rules.",
        "Within the two sets of rules for conversion of consonants and vowels, orftring proceeds from longer strings to shorter strings and, for eactk string,sfrom specific context to general context.",
        "The rule for pronunciation of ipaa, then, appears before the rules for [cc\"1 and chl, each of which is ordered before rules for V] and [113.",
        "Procedures for the recognition of prefixes and suffixes also require an ordering: the prefixes [cc:mil and tcon] must be ordered before [co]; any suffix ending with the lettermust be recognized before the suffix consisting of that letter only.",
        "As an example of ordering rules for a particular string, consider the vowel [a] and assume that it is followed by the Letter [r].",
        "This Cal may be prpnounced like the [al in \"warp,\" \"lariat\" or \"carp\" depending upon spetification of further context.",
        "It is pronounced like the [a] in \"carp\" if it is followed by [r3 and another consonant (other than [r)) and if it is preceded by any consonant phoneme except /w/ (note \"quarter,\"' \"wharf\") Consequently, a rule for ta3 in the context of being preceded by the phoneme /w/ d,followed by the sequence trCf is placed in the set of rules.",
        "Specification of a left context in the rule for the [al in \"carp\" is subsequently unnecessary.",
        "If the [a] is preceded by a /w/, this rule will never be reached; if preceded by a vowel, a rule for vowed digraphe will already have-applied.",
        "Using this methoO.",
        "rules may be stated simply and without redundancy.",
        "Development of the set of phonological rules was begun by informal inspection and reference to published works, e.g., Venezky.8 By,a process of extensive statistical analysis, other rules were added and ordered -14-appropriately.",
        "The principal source of words was the Merriam Webstet 'Pocket Dictionary.9 A computer printout was generated in which all words contatning each letter and each specified cluster of letters were isolated.",
        "Within each category, words were sorted alphabetically according to the right-hand context of the letter(s) under consideration.",
        "In addition, Walker's rhyming dictionary10 was used to determine pronunciation of suffixes and the effect of suffixation on precedirig phonemes.",
        "Words from ChV Brown Corpus, the Heritage English Dictionary11 and Stedman's Medical Dictionary12 have beeri used in testing procedures."
      ]
    },
    {
      "heading": "Examples of Rule Application",
      "text": [
        "In this section, a number of words will be analyzed according to the phonological rule program.",
        "Intermediate output, i.e.,.th'e results of the first and second stages, will be provided for each word, and the rules which have been applied to produce this output will be discussed.",
        "Generalizations of these rules and rules, which are believed to be related will lA included in the discussion whenever possible.",
        "All phonemes are given in IPA Aymbols; a dash (-) is a place-holder for aletter which is to be converted in a later stage.",
        "The result of application of stress rules (to be discussed later) is given without comment following each derivation.",
        "the first stage, [icl is recognized as a suffix and a plus (4) is inserted to its left.",
        "Since no other affixes are recognized, Stage 1 is terminated.",
        "Morph-initial [pt) is pronounced /t/, and [1] and [m] are given the pronunciatinrm /1/ and /m/ respectively, according to the most general rule in the rule sequence for each.",
        "(The most general rule is the final rule in the rule sequence and contains no specified context.)",
        "In Stage 3, the contexts of the vowels [o] and Le] are not among those contexts specified in the sequence of rules and are pronounced according to the final, context-independent rule.",
        "The vowel [al, on the other hand, precedes anokber vowel and, for this reason is lengthened (tensed).",
        "The suffix [-Eic] is word-final and receives the pronunciation /11(/.",
        "In the final result, stress rules have beer) applied and unstressed non-tense vowels have been reduced.",
        ") Morph-initial [pm] and [ps] are given the pronunciations /n/ and /s/ respectively, the tpl remaining silent as in morph-initial[ptl.",
        "2.)",
        "Vowels in pre-vocalic position are usually lengthened (tensed).",
        "3.0 There is only one context in which [ic] is pronounted /ts/ rather than /z1a, i.e., preceding the variable representing the vowels Le) and (y).",
        "B. TABLEInput TABLEResult of Stage 1 t-b .1Result of Stage 2 tet 1Result of Stage 3",
        "teb .1Fina] result after stress The,regUlt of Stage 1, in thts case, is the same as the input since no affixes are detected.",
        "The letter Lt.] is pronounced by the most general rule in its rule sequence, and [b] has only one given pronunciation.",
        "However, [1] precedes morph-final [e3 and is itself preceded by another consonant, [ill. Tin thiE context, [I] is syllabic.",
        "The sequence Dlel now forms a very specific context for the third stage.",
        ".The letter [a] when followed by [Cle] is lengthened if the consonant, C, is neither Lrl nor ill.",
        "The vowel (e] is morph-final and therefore silent.",
        "SCENARIOResult of Stage 1 ss-n-r--Result of Stage 2 sstnaerioResult of Stage 3 sTna4rioFinal tesult aiter stress In Stage 2 we find that the consonant cluster Isc], like the let:ter [c], usually has the sound of /s/ preceding [e], [i] or Ly].",
        "The letter Irl does not occur in any context given in its rule sequence and is therefore givenAts moss general pronunciation.",
        "Therepis only one rule for the pronun'ciation of Cn).",
        "Moving on to Stage 3, the vowel Cel receives the pronunciation /0 given by its most geperal rule.",
        "The vowel (a] follows the rule given in the previous example.",
        "The vowel [o] is morph-final and has the feature [-constricted pharynx], and is lengthened accordingly.",
        "Because the vol./el precedes another vowel, it is lengthened also.13",
        "1.)",
        "The consonant cluster [se] is given the representation of a -19-double phoneme because the information that it is orthographically a double consonant is needed both in the vowel rules and in the rules fort stress., It is later reduced to a single phoneme.",
        ".)",
        "Two other contexts or Iscl must be ordered before the rule which applied to \"scenario.\" If isc] precedes [i) followed by anoLner vowel, and certain letters precede iscl , a palatalization effect is nbserved.",
        "When preceded by a vowel in this context, iscl becomes /5/, e.g.,\"prescience\"; when preceded by an [1111 it bednmes // or /4/, e.g., conscious.\" 3.)",
        "The pronunciation tpc3 receives in \"scenario\" is also found preceding syllabic CO in exgmple B.",
        "4.)",
        "If none of the contexts mentioned in 2.)",
        "or 3.)",
        "are found, the phonemic representation of [scl becomes /sk/.",
        "5.)",
        "The reduction of /E/ to /1/ occurs in the stress rules.",
        "E.SUBVERSIONInput",
        "sab=v Z+anFinal result after stress' In this example, the Quffix.t+ion] and the prefix [sub.)",
        "are recognized in Stage 1.",
        "There is only one pronunciation provided for the consonant Cv), and Cr3, because it does not fit a specified context for syllabic tr3 is given the standard pronunciation.",
        "The letter [s] is followed by the sequence -20-making it a candidate for palatalization.",
        "The palatalization rule which applies assigns the phoneme In the final stage of letter-to-phoneme conversion, the affixes and vowels are considered.",
        "The prefix Csub=] has only one possible pronunciation.",
        "The letter te), because it precedes the sequence IrC1 where the consonant, C, is not an [a is given the pronunciation hod.",
        "The palatal phoneme rif/ now forms a left context for the suffix ijion], which, being word-final, is pronounced /an/.",
        "1.)",
        "Because C.-Fs] is marked as occurring in word-final position orly, 'the ts1 preceding D-ion] is not recognized as a suffix'.",
        "This step also prevents the Cer) preceding ale [s] from consideration as a possible suffix.",
        "2.)",
        "When an [s3 preceding the sectuence (+IV] or UK) is preceded by either a vowel or an Cr], it is usually pronounced /if/.",
        "Some examples ard \"revision,\" \"artesion,\" \"Persian\" and \"dispersion\"; two exceptions are \"controversial\" and \"torsion.\" When [s3 is preceded by [1], and when it occurs as part of the consonant cluster (ss], the phoneme preceding the wowel sequence is /5/, e.g., \"emulsion,\" \"Russian.\" A third pronunciation Is obgerved when Cs) is preceded by [nl, e.g., \"transient,\" Icomprehensiva.\" 3.)",
        "The sequence /Ar/ is latet changed to /P5/.",
        "4.)",
        "The sequence Cionl following a non-palatalized consonant is pronounced /in/, e.g., \"oblivion,\" \"criterion,\" \"champion.\"",
        "The suffix [4-ion] may be given other prouuhciations if not.",
        "morph final.",
        "For example, it is pronounced /+ian/ in gangliOnic\" and \"histrionic.\" F.SCIENCEInput SCI + ENCEResult of Stage 1 ss- +Result Stage 2 ssa + 'msResult of Stage 3 sat + insFinal result after stress In Stage 1, t+encel is recognized as a suffix.",
        "The consonant cluster [se3 precedes Cil and is therefore given the pronunciation /ss/, later changed to /s/ as described earlier.",
        "The pronunciation of [i] preceding a vowel as /as/ is a consequence of its left context being a morph-initial cunsonant cluster.",
        "Conditions: (1) if ( )as not present, ( ), must be present (2) not applied to the first vowel if applied td second vowel"
      ]
    },
    {
      "heading": "Lexical Stress Placement",
      "text": [
        "The stress rules which have been implemented are a modification of a set of ordered rules developed by Halle.14 Modifications fall into three categories: (1) adjustments due to the condition that input is completely phonemic, (2) reduction of the numbet of strE-ls to I stress (primary) 2.stress (stress less than primary) aLLu 0 stress, and (3) addition of special suffixrdependent stress categories.",
        "Application of the rules proceeds in two phases.",
        "The first phase consisLb of the application of three ordered rules which are applied cyclically, first to the root, then to the root and leftmost suffix combined.",
        "The 'process continues with one more suffix adjoined to the string under consideration before each cycle begins until the end of the word is reached.",
        "This cyclic phase is devoted solely to the placement of primary stress.",
        "The second, non-cyclic phase, includes the application to the entire word of ordered rules and reduces all but one of the primary stress marks to secondary or zero stress.",
        "In the following section, stress placement rules will be given in symirolic form.",
        "Each rule which contains more than one case is brdker.",
        "down into cases for whick,brief descriptions and examples are given.",
        "The rules are listed in the order in which they apply and are marked either \"cyclic\" or \"non-cyclic I, Particular modifications to each rule will be given at the end of the discussion about that rule under the subheading Modifications.",
        "(See Figure 3 for an explanation of notation, Figure 4 for a flow ohart of th& stress rules and Figure 5 for the complete set of stress-placement rules in linguistic notation.",
        "the antepenultimate vowel receives primary stress.",
        "Modifications: The presence of the optinnal vowel immeOiately preceding another vowel and the presence of the morph-final vowel are necessary -.33-modifications of the Main Stress Rule due to the difficulty of retrieving the long (tense) pronunciation of a laxed vowel when its orthographic representationno longer available.",
        "The Main Stress Rule, as developed by Halle, applies only to roots which function as nouns and to suffixed forms.",
        "However, until parsing methods are further developed, it will not be possible to take advantage of known parts of speech.15 For this reason, the Main Stress Rule is currently applied to all roots.",
        "The suffixes referred to in Condition (2) fall into two categories.",
        "Some suffixes are marked to force stress to be placed on either the final or the penultimate syllable of the root and suffixes under consideration.",
        "This placement of stress replaces the MSR on the cycle in which the special suffix is the rightmost morph.",
        "These suffixes are listed below with the phonemic representation which actually appears as input.",
        "(b) formidable, nOticeable, manageable, knowledgeablE ABLY: as with ABLE above",
        "AGE:(a brigandage, vagabondage, chaperonage",
        "(b) anecdotage -- at the time Walker's rhyming dicttonary was compiled, the two stresses were interchangeq 1 DOM:(a) bachelordom",
        "(b) words such as chrjstendom and martyrdom do not stpply evidence; \"doe must be considered a separate syillable, i.e., the syllable preceding \"om\" is not strong 1211 ED:(a) opinionated, talented, shepherded (b) Exceptions occur in words with no secondary stress and with primary stress more than two syllables to the left before the affixation of +ed, e.g., 1212 precedented, interested (in some dialects) (c) Note that ED has no vowel in it pronunciation if not preceded by [t] or f_dl, 4.e., it is not a separate syllable.",
        "-362121 ERR:(a) caravaneer, charioteer EN:There is no evidence of stress change due to the suffixation of \"en\"; most words to which it is added are 1-syllable roots.",
        "(b) words such as putrescible and fermentescible are not exceptions; the verbal ending ESCE always carries primary stress IBLY: as with IBLE above",
        "ILE:replicatile, fluviatile",
        "ING:(a) conveyancing, countenanting (b) Exceptions may occur in those contexts mentioned under ED.",
        "In the case, of \"countenancing,\" the syllable consisting of \"en\" is generally so reduced that it is imperceptible as a syllable.",
        "LESS: conscienceless, characterless, objectless LET: No evidence of stress change due to the affixation of \"let.\"",
        "LY: particularly, passionlessly, precipitously",
        "MENT: (a) Words such as government and eojournment indicate that MENT should be placed in this category.",
        "(b) Most words of four or more syllables are given alternate pronunciations corresponding to the placement of MENT in either this category or in the category of regular stress placement, e.g.,",
        "advertisement / advertisement, medicament / medicament 11 NESS: disinteTestedness, haphazardness",
        "OR: 1 governor, warrantor, incubator",
        "RY: heraldry, wizardry, charlantanry SELF: No evidence of stress change",
        "SHIP: (a) umpireship 12121212 (b) advocateship, candidateship,tlaureateship, cardinalship SOME: No evidence of stress change",
        "TY:sheriffalty, suzerainty",
        "propagandapraplkgAnda.e.",
        "(stress on leftmost stressed vowel later reduced)",
        "prefix precedes a one-syllable root or bound morpheme, e.g., [permit]N vs. 1121 [pB-wit) , [insult)N vs. U.nsul]because there are many tore verbs of VV this sort than nouns, the Stressed Syllable Rule has been mod.ified to prevent the retraction of stress into a prefix.",
        "The effect.of this modification is to produce only the verbal pronunciation of two-syllable noun/verb pairs.",
        "Another more positive, effect is the correct placement of stress in trtrbs",
        "such as edit,i.",
        "inhibit and pummel.",
        "However, two-syllable nouns of the form \"prefix-roan which.",
        "have no verbal counterpart are stressed incorrectly, e.g. 11 empire, inverse.",
        "(This modification will be removed or changed after a parsing algorithm is incorporated in the system.)",
        "Exceptions; Note that words sucn as peregrinate, oxygenate and 12 metropolitanate which are correctly stressed Dy the Stressed Syllable Rule are stressed incorrectly, thereafter,by the Alternating Stress Rule.",
        "Modification: The optional vowel in pre-vocalic position appears in the Alternating Stress Rule as well as in the Main Stress and 'Stressed Syllable rules.",
        "Proposed Modification: The restriction 'of the Alternating Stress Rule to words in which a prefix boundary does not precede the final primary stressed syllable could be constrained to uerbs.",
        "Such a constraint would provide the correct stress placement in nouns and adjectives such as 12I21212 multiform, contraband; intercept and miniskirt while retaining correct.",
        "21Z121 stress placement in the verbs intercept contradict-and comprehend.",
        "Such a modification would require moving the Strong First Syllable Rule in Halle's scheme to follow the Compound Stress Rule, aseigning [2 stress 1 in the same context in which (1 stress] was previously assigned.",
        "This-modification has already been implemented in this program for independent reasons.",
        "-42-L and is discussed under the heading Modifications in the Strong First Syllable 'Rule.",
        "Destressing Rule (non-cyclic, applicable to all vowels having required context)",
        "Conditions: (1) if ()ais not present; ()b must be present (2) not applied to first vowel if.",
        "appliedto second vowel Case 1.",
        "(Vowel to be reduced not in first syllable)",
        "syllable, and is immediately followed by one consonant and a vowel which has previously been assigned primary stress, and if (1) does not apply to the vowel in the second syllable, remove any stress that has be assigned to -43-the vowel in the first syllable.",
        "ModificaEion: The single required consonant preceding the primary",
        "stressed vowel has been changed from Co (zero or.",
        "one_consonan*C (exactly one consonant) so that pre-vocalic vowels are not shortened.",
        "Compound Stress Rule (non-cyclic) This rule, as developed by Halle, applies to both compounds and non-compounds.",
        "As it applies to words converted by letter-to-phoneme rules in the program, and therefore to non-compounds only, its effect is to locate the primary stress which is to be retained.",
        "All other primary stress is reduced to secondary.",
        "Halle has used the Nuclear Stress Rule for both phrase level stress and the reduction of secondary to tertiary stress in lexical.",
        "items.",
        "Neither is necessary in this algorithm; the Nuclear Stress Rule has therefore been omitted.",
        "stressstress-) / E. Y (VC() ( [7stress )) :a Condition: (1) Y contains no 1 stress (2) if right most morph is a suffix, check for special stress retention or stress exclusion category and reassign (1 stressl according to category",
        "in [ithm], although is equivalent to the statement that function as a syllable in morph-final stress pattern appears in word ending it is not included here as a suffix, e.g.,",
        "logarithm, algorithm.",
        "The same categorization should be extended to morph-final syllabic t13.",
        "However, it does not function as a suffix, e.g.,",
        "-long Case 1.",
        "(reduction of /e./ and /2/)",
        "(a) tutor, duty, studious, duration, tureen In these-cases, the /t/ or /d/ is in the initial consonant cluster",
        "(b) adumbration, modus, status The It!",
        "or /d/ in these cases is not in the initial consonant cluster, but precedes unstressed /9/ which was not /u/ or /V/ before application of stress rules.",
        "2121112 (c) institution, centurion, Hindu, constitute",
        "In the above cases, /t/ or /d/ is not in the initial consonant cluster and precedes stressed /u/ or /U I.",
        "The stress program has been modified to effect this change.",
        "The phonemes it/ and /d/ preceding unstressed /u/ or /1.)",
        "/ not in the first syllable are chpnged following the cyclic rules which place all stress.",
        "After the Destressing Rule and the Cursory Rule, a change is also made if the destressed (and possibly -shortened) vowel was previously a Jul or /1,)/ and not in the first syllable.",
        "Note: The addition of special medical prefixes would increase the accuracy ef rules applied-to the sample from Stedman's Medical Dictionary by approximately ten per cent.",
        "The set of rules current] y being used in the text-to-speech system is the set containing 411 rules A list of the maximal set of 557 rule together with instructions for extracting the other sets of rules is given in the appendix.",
        "There are a number of problem areas, many of which derive from the lack of a lekicon.",
        "Problems of this type include incorrect suffix or prefix -53-recognition and the treatment of compounds as single norphs.",
        "Some examples from each problem area are given below: Mispronunciation of siule vowel:",
        "The pronunciations of the underlined vowels in the contexts above are encountered infrequently, And, in most cases, are not predictable.",
        "In the word international, the contoct which determines the pronunciation of v3 is the right-hand context [c+iV], A 161:-F _vowel almost always is found in this context as in nation, station, explanation, observational, sensational.",
        "A short [e) is usually found preceding (C+iC) e.g., malef,c, angelic, systemic, photogenic, and is long only in a few words, e.g., strategic, scenic, and tn the suffix +plegic.",
        "Mere are very few words ending in the voweltu]-- most are either low frequency words or proper names.",
        "The palatalization in menu is not tound in other words with finalLU), e.g., flu, emu, gnu, fmpromptu.",
        "The word two is very irregular in pronunciation.",
        "Most words ending into) such as go, no, so, calico, echo have the sound /o/.",
        "It may be noted, however, that two other words which, like two, 're very high frequency words, have the same pronunciation of final Has two, i.e., do, to.",
        "The mispronunciation of the(e)in modeled is due to the assumption, lacking a lexicon, that the morphemic analysis is model + ed.",
        "-5A-Mispronunciation of vowel digraph:",
        "The reasons for mispronunciation of the vowel digraphs underlined above fall into a number of categories.",
        "There are very high frequency words, said, should and would, which do not follow letter-to-sound rules.",
        "Said may be contrasted with the words laid, maid, paid, and raid; the words should and would contrast with mould, shoulder and boulder.",
        "The sequence krlas in theirs, heir, weir is not found frequently in English, nor is the sequence ffeilas in fo/feit, surfeit and counterfeit.",
        "Rules for i41 in these two contexts were-,cdtisidered unproductive.",
        "FinaljAin English is usually pronounced as in oboe, toe and foe; the pronunciation found in shoe, and also in canoe, is rare.",
        "Rules governing the pronunciation of Ips...7.",
        ")(endowed) aniqd] (guitars) are statistically based.",
        "Although-thee are many-words in-which-similar nan-context d-ependent-pTionunciationg-Trefoulvd, e.g., cow, allow, eyebrow and build, guilt, guinea, other pronunciations are statisEically more likelyc, e.g., those found in shadow, glow, follow and bruise, juice, nuisance.",
        "The pronunciation of break is not-predictable -- the word steak has the same digraph pronunciation, but other similar words such as creak, freak and gtreak are pronounced like the majority of words conpaining the digraph[ea).",
        "-55-Mispronunciation of ,single consonant:",
        "The consonants underlined above are either silent or have unpredictable or unusual pronunciations.",
        "Silent consonants are found in two, corp and exhaust: The Nord two is a high-frequency word in which both thelAand [93 have unusual pronunciation.",
        "Silent [W] is rare, although it is also found in the word sword.",
        "tinal silent [0, as found in corp is also rare.",
        "(This word is considered in this section because the pronunciation of both the,[] and the [p] are determined by rules for single consonants.)",
        "There are a few Words, like exhaust, in which [14 is silent following lc],) e.g. exhibit, exhilarate, exhort and exhume.",
        "However, this rule is not sufficiently productive to merit inclusion.",
        "The letter Cg]preceding leb [1.1 and ty] in English usually has a soft sound as in integer and wager.",
        "In particular, many words ending in Eger) are a combination of a root with final [e] and the suffixe.",
        "g. , lbrager, , manager, merger, all of which have a soft [g] sound.",
        "The pronunciation of thels)in eager is unusual and not predictable.",
        "Another prqnunciation which is frequently unpredictable, i.e., not context-dependent,, is that of the letters) between vowels.",
        "The rule for this context predicts the mote frequent sound /s/ whereas the sound /z/ is found in deserts and physiological.",
        "The letter t z] in schizophrenic has the rare pronunciation /ts/, and the word if, as previously discussed, is the only English word in which a final [f] is pronoudced as /v/.",
        "14ispronunciAtion.",
        "of consonant cluster:",
        "Consonant clusters are infre,quently mispronounced The cluster [chl is the most frequent problem in t,his category, its pronunciation being determined, in many cases, by the Greek or Latin origin of the word in which it appears.",
        "The pronunciation /Jr,/ as in chef and criches is less frequent than either /C/, e.g., church, or /k/, e.g., chemical.",
        "Morph final [el) may be pronounced either if/ as in laugh, enough and cough or, with slightly higher probability, not pronounced, aA in hi,gh, weigh and dougt.",
        "Unusual and rare pronunciations of the clusters ts, ss, ld arid if are found in other yoxds above.",
        "The pronunciat,icin of [ss] as /1/ is found preceding certain suffixes, e.g.,.delorgssion, fissutg, but rarely within a morph, (tissue, above).",
        "Russian orthography is still reflected in the English spelling of tsar even though the pronunciation has been Anglicized.",
        "A silent [1] appears in could, :would and calf.",
        "The words could and would are high freauency words and also Ziffer from regulan.pronunciation in the vowel digraph tou].",
        "Although half like calf, also fias a silent [1], in most words a finaltlths pronopnced /1f/, e.g., elf, shelf, self, _gulf.",
        "The high-frequency-ward pronunciation o morph-initial[thlas /j../, e.g., these, then, the, has been discussed previousa \"",
        "renegadebrigade, serenade, marinade The word selects is stressed incorrectly due to lack of information concerning its part of speech (c.f., discussion of modifications in the Main Stress Rule).",
        "The results of this study indicate that the letter-to-phoneme system is quite powerfill, even in isolation.",
        "When considered in the domain of the overall text-to-speech system in which a lexicon is available for high frequency words and compounds, the letter-to-phoneme system should be highly reliable."
      ]
    },
    {
      "heading": "NOTES",
      "text": [
        "1.",
        "Alleq, J.",
        "\"Speech Synthesis from Unrestricted rext\" in Speech Synthesis, edited by J. L. Flanagan and L. R. Rabiner, Stroudsburg, 1973.",
        "2.",
        "Allen, J.",
        "\"Reading Machines for the Blind: The Technical Problems and Methods Adopted for their Solution,\" IEEE Transactions on Audio and Electroacoustics, Vol.",
        "Au-21, No.",
        "3, June 1973, 259-264.",
        "3.",
        "Allen, J.",
        "\"Synthesis of Speech from Unrestricted Text,\" Proceedings of the IEEE, Vol.",
        "64, No.",
        "4, April 1976, 433-442.",
        "4.",
        "I?..ackets will be used to denote letter, slashes to denote phonemes.",
        "5.",
        "Hunnicutt, S. \"Pronunciation of HighrFrequency English Words,\" Natdral Language Processing Group Memo, M.I.T., 1973.",
        "6.",
        "Kucera, H. and Francis, W. N. Computational Analysis of Present-Day American English, Providence, R. I., Brown University Press, 1967.",
        "7.",
        "The symbol C is used to denote a consonant, the symbol V to denote a vowel.",
        "8.",
        "Venezky, R. A Study of English Spelling-to-Sound Corresponderices on Historical Principles, Ann Arbor, 1965.",
        "9.",
        "This source is available on tape from J. Olney, System Development Corporation, Santa Monica, California.",
        "10.",
        "Walker, J. Rhyming Dictionary of the English Language London, 1924 11.",
        "The American Heritage Drctionary of the English Language, Paperback edition, New York, 1973.",
        "12.",
        "Stedman's Medical Dictionary, Baltimore, 1961 13.",
        "Although some phonologists .would consider both prevocalic Li-land morph final Id] to be underlyingly short (lax), and would apply a lengthening (tensing) rule to them after stress placement (N. Chomsky and M. Halle, The Sound Pattern of English (New York, 1968), p. 74; M. Halle and S.J.",
        "Keyser, English Stress (New York, 1971) IS.",
        "30), it has been necessary,",
        "because of the difficulty of preserving orthographic information, to consider both vowels as being long before stress placement, exempting them from stress by a contextual analysis.",
        "The replacement of the required feature (-low] in the lengthening rule for morph-final vowels by the feature (-constricted pharynx) is due to Halle (Course 23.761, M.I.T.",
        "), Nov. 1972.",
        "14.",
        "Class lectures, Course 23.761, M.I.T., Fall 1972.",
        "Profesor has since revised this set of rules.",
        "15.",
        "Changes ta the stress rules due to the incorporation of a parsing algorithm in the system will be made during the summer, 1976.",
        "16.",
        "Hunnicutt, S. \"Removal of the Trisyllabic Shortening Rule from Stress,\" Natural Language Processing Group Memo, M.I.T., 1975.",
        "17.",
        "Webster' g Third New International Dictionary, Springfield; 1.966."
      ]
    },
    {
      "heading": "APPENDIX",
      "text": [
        "The set of rules which follows is a maximal set.",
        "The nth largest set of rules may be derived by deleting all lines preceded by integeri less than n. Preceding the rules are three lists of variables.",
        "(A variable is symbolized by a letter or the sequence \"up-arrow\" - letter,11, preceded by a dollar sign.)",
        "The first list contains only two variables, $B, which represents either a word boundary (#) or a suffix boundary (+), and $D, which represent either a word boundary or a prefix boundary (=-).",
        "The second list consists of variables representing letters-, and the final list, of variables representing phonemes A table of the symbols used to represent phonemes with the corresponding IPA symbol immediately precedes the list of rules: The general form of a rule is",
        "where the Si are strings (S1 0 0), / (slash) is one of four possible contexts to be explained below, and(back-arrow) is a place-holder for Si.",
        "The string S1 is a letter string which is to be converted into the phoneme string S2 if it (S1) is preceded by S3 and followed by S4.",
        "S3 and 54 may be either letter etrings or phoneme strings set by the following context markers:",
        "In a left context, variables are followed, rather than preceded by a dollar sign.",
        "The final two sections in the set of rules are marked PREFIX and SUFFIX respectively.",
        "Prefixes are listed left-to-right longest-matchfirst fashion (e.g., extra precedes ex, uni precedes un) within a left-toright alphabetical sort.",
        "Suffixes are listed right-to-left longest-match-first, (e.g., uous precedes ous which precedes us which precedes s) within a right-to-left alphabetical sort.",
        "Each suffix is preceded by a letter and a 2 or 3 digit number.",
        "The letter represents the type of suffix as follows: a non-vocalic suffix (suffix which does not begin with a vowel) before which a [Amy change to Li] a suffix (generally vocalic and very short) which is recognized only before inflectional and consonantal suffixes regular suffix The number preceding each suffix is the octal represent.atioli of a code describing the syntactic compatibility of that suffix with other suffixes.",
        "The right-most-digLt represents the possible parts of speech of a preceding suffix (a suffix to the left of the suffix under consideration).",
        "If the suffix may be preceded by an adjectival suffik, tbe digit is",
        "1, if 15ossib1y preceded by a verbal or nominal suffix, the digit is 2 or 4 respectively; if the suffix may be prec.eded by a combination of these, the digit is the sum of the corresponding digits.",
        "The digit immediately to the left of the rightmost digit represents the possible parts of speech of the suffix under consideration; it is calculated as above.",
        "If the number contains 3 digits, its leftmost digit is a 1, indicating that the suffix occurs only at the end ot a word."
      ]
    },
    {
      "heading": "2 PSEUDO 5 PSYCHO RE 3 SELF 2 SEMI 4 SUB 3 SUPER TRANS 4 ULTRA UNDER 4 UNI UN %SUFFIX",
      "text": []
    },
    {
      "heading": "3 F 45-ETTE 5 F 70-UTE 2 F 14-ESQUE 2 F 10-IFICATIVE 5 F 57-ATIVE F 52-IVE 4 F 20-OGIZE",
      "text": []
    },
    {
      "heading": "AUTHOR INDEX - AJCL AUTHORS OF SIGNED CONTRIBUTIONS",
      "text": []
    },
    {
      "heading": "MICROCOPY RESOLU I ION TEST CHAR,I Ntur-)NAI. BURLAU OF11\\ NI Af-:\"",
      "text": []
    }
  ]
}
