{
  "info": {
    "authors": [
      "Candace L. Sidner"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P79-1018",
    "title": "The Role of Focussing in Interpretation of Pronouns",
    "url": "https://aclweb.org/anthology/P79-1018",
    "year": 1979
  },
  "references": [],
  "sections": [
    {
      "text": [
        "In this paperl I discuss the formal relationship between However, their approaches are either simple heuristics which the process of focussing and interpretation of pronominal offer no unified treatment (Winograd) or require the anaphora.",
        "The discussion of focussing extends the work of computation of a structure which must assume the pronouns Grosz [19771 Focussing is defined algorithmically as a process have previously been resolved (Lockman).",
        "which chooses a focus of attention in a discourse and moves it around as the speaker's focus changes.",
        "The paper shows how to use the focussing algorithm by an extended example given below.",
        "D1-1 Alfred and Zohar liked to play baseball.",
        "2 They played it everyday after school before dinner.",
        "3 After their game, the two usually went for ice cream cones."
      ]
    },
    {
      "heading": "4 They tasted really good. 5 Alfred always had the vanilla super scooper, 6 while Zohar tried the flavor of the day cone. 7 After the cones had been eaten, 8 the boys went home to study.",
      "text": [
        "In this example, the discourse focusses initially on baseball.",
        "The focus moves in D1-3 to the ice cream cone.",
        "Using this example, I show how the formal algorithm computes focus and determines how the focus moves according to the signals which the speaker uses in discourse to indicate the movement.",
        "Given a process notion of focus, the paper reviews the difficulties with previous approaches (Rieger [1974], Charniak [1972], Winograd [1971], Hobbs [1975] and Lock tnan [1978]).",
        "Briefly, the first four authors all point out the need for inferencing as part of anaphora disambiguation, but each of their schemes for inferencing suffer from the need for control which will reduce the combinatorial search or which will insure only one search path is taken.",
        "In addition, Winograd and Lockman are aware of pronoun phenomena which cannot be treated strictly by inference, as shown below.",
        "D2-1 I haven't seen Jeff for several days.",
        "2 Carl thinks he's studying for his exams.",
        "3 Oscar says he is sick, 4 but I think he went to the Cape with Linda.",
        "1.",
        "This report describes research done at the Artificial",
        "Intelligence Laboratory of the Massachusetts Institute of Technology.",
        "Support for the laboratory's artificial intelligence research is provided in part by the Advanced Research Projects Agency of the Department of Defense under the Office of Naval Research under Contract Number N00014-75-C-0643.",
        "In order to state formal rules for pronoun interpretation, the concept of antecedence is defined computationally as a relationship among elements represented in a database.",
        "Using this framework, the paper supports two claims by means of rules for antecedence."
      ]
    },
    {
      "heading": "1. The focus provides a source of",
      "text": [
        "antecedence in rules for interpreting pronominal anaphora.",
        "2.",
        "Focussing provides a control for the inferencing necessary for some kinds of anaphora.",
        "The rules for pronominal anaphora rely on three sources of confirming information: syntactic criteria, semantic selectional restrictions and consistency checks from inferencing procedures.",
        "The use of these rules are presented for examples D2 above and D3 below.",
        "03-1 Whitimore isn't such a good thief.",
        "2 The man whose watch he stole called the police."
      ]
    },
    {
      "heading": "3 They caught him.",
      "text": [
        "These examples show how to use the three sources of information to support or reject a predicted antecedence.",
        "In particular, inferencing is controlled by checking for consistency on a predicted choice rather than by search using general inference.",
        "The paper also indicates what additional requirements are needed for a full treatment of pronominal anphora.",
        "These include use of a representation such as that of Webber [1978]; linguistic rules such as the disjoint reference rules of Lasnik [1976] and Reinhart [1976] as well as rules of anaphora in logical form given by Chomsky (1976); and presence of actor foci such as they in 03.",
        "The nature of these requirements is discussed, while the computational inclusion of them is found in Sid ner (1979)."
      ]
    },
    {
      "heading": "I. References",
      "text": []
    }
  ]
}
