{
  "info": {
    "authors": [
      "William M. Fisher",
      "A. Maynard Engebretson"
    ],
    "book": "ACL Microfiche Series 1-83, Including Computational Linguistics",
    "id": "acl-J79-1016",
    "title": "Simple Digital Speech Synthesis",
    "url": "https://aclweb.org/anthology/J79-1016",
    "year": 1979
  },
  "references": [],
  "sections": [
    {
      "text": [
        "EMMARY Relatively simple computer methods for synthesizing speech to be used in phonetic/perceptual research are presented, witb particular references to the problems and successes encountered in the development of such a system at Central InstitUte for the Deaf and the Biomedical Computer Laboratory of Washington University.",
        "The purpose of this paper is to present a synthesis and clarification of established methods so as to encourage other computational linguists to tackle digital speech synthesis.",
        "The approach is semi-tutorial: crucial algorithms are given in Fortran or block-diagram form, and bibliographic references that were found to be most useful in the system development are listed and discussed.",
        "The system described requires a minimum of hardware; a minicomputer is sufficient, if it is equipped with tape or disk secondary memory.",
        "The sound pressure wave is calculated entirely by software and only a digital-to-analog converter and a low-pass filter.",
        "are.required to convert it to a recordable electrical signal.",
        "The vocal apparatus is simulated by a rough model which is still general enough to make most speech sounds.",
        "The two main types of excitation of the vocal tract --jperiodic glottal waves for voicing and random noise for frication or aspiration -- are supplied by algorithms presented as function subroutines.",
        "The effect of the vocal tract on these inputs is modelled by combinations of three other elemental functions, whose coding is based on recursive equation theory for computational efficiency.",
        "A resonance provides the user with a means for accentuating the signal at a certain frequency, such as a formant frequency of a vowel; an antiresonance or notch filter is provided to cut back the energy at a certain frequency, as in simulation of the nasal anti-formant; and a radiation-effect subroutine simulates the effect on the speech signal of passage from the lips through a short stretch of air.",
        "Empirically obtained wave shapes and spoctra of the outputs of these five basic functions are given in order to give the reader a better feel for what they do.",
        "These five elements can be combined in a number of ways.",
        "A detailed discussion is given for one of the simplest reasonable models, in which the glottal wave and frication generators excite a series of three variable resonators, using a set of fixed resonances to simulate higher frequency formants in addition to the radiation-effect simulator.",
        "Several other more complex arrangements are presented, including parallel resonator models and models with separate filters for shaping voiced, fricative, and nasal components, and their advantages and disadvantages are discussed.",
        "An example is given of a complete modular Fortran program generating the word \"seat\".",
        "The equations for specifying the parameters controlling the elemental functions were derived, with much effort, from analysis of one token utterance, and spectrographs of the real and synthetic words are shown to illustrate the degree of naturalness obtainable with the simple three-resonator series model.",
        "A simpler example for generating a constant vowel sound is also given, along with a summary of data useful in making many vowels.",
        "This paper is a slightly expanded version of one given orally at the,l2th annual A.C.L.",
        "meeting in Amherst Massachusetts,",
        "1.",
        "Glottal Wave Generator.",
        "10 • • • • 2.",
        "White Noise Generator • • .",
        "• • II 16 B. Spectral Shaping Clements .",
        ".",
        "• .. • .",
        "17 1.",
        "Resonances and Anti-resonances .",
        "• • • .",
        "17 2.",
        "Radiation Effect .",
        ".",
        "..... .",
        "22 IV, Organization of Elements .",
        ".",
        "• • V • • • • NI • • 22 A.",
        "The Simplest Model .",
        ".",
        ".",
        "• .",
        ".",
        ".",
        ".",
        "22 B.",
        "Control .",
        ".",
        "• • .",
        "• • • • .",
        ".",
        ".",
        "• .",
        "28 C. Other Models .",
        "•• • •• •• a a 30 1.",
        "Parallel Formant • .",
        ".. .",
        "flea 31 2.",
        "Separate Noise Shaping Channel ,31 • • • • 3.",
        "Other More Complex Models .33 • • • a • D. A Complete Example .33 • • • • • • • • • V. Final Remarks .",
        "44 • • a • II • • • • • • ••",
        "Several years ago, it was decided that the Research Department at Central Institute for the, Deaf in St, Louis should have a digital speech synthesizer to aid studies in psychoacousticeP and phonetic perception.",
        "The equipment on hand at the time consisted primarily of a 12-bit-word minicomputer with keyboard and scope, with special-purpose hardware for doing digital-to-analog conversion, low-pass filtering, and floating-point arithmetic Mare peripheral devices and core memory have now bten added, We have been working since then on writing digital computer programs to synthesize speech studying the literature and gaining practical experience.",
        "Almost all of the theory and techniques necessary to program the synthesis of English sounds clan be found in published literature, but in bits and pleces, here and there.",
        "Utilizing the contributions of many authors, plus our awn experience, we present and explain a basic program tor synthesizing speech, in the hope that computational linguists who have not worked with low-level speech phenomena may be encouraged to program synthesizers.",
        "The use of synthetic-speech stimuli has been extremely important to the investigation of the perceptually, distinctive features of speech and of low-level phonological rules, but much work remains undone.",
        "Synthesizing speech is clearly important to phonetic research, and the field could well use more researchers 'with linguistic training.",
        "The system described in this paper requires relatively small investments in equipment and programming.",
        "II.",
        "Overview Synthesizers use varying amounts of special purpose hardware.",
        "The type of synthesis we describe here uses the bare minimum, calculating the speech wave on a digital computer and requiring only a digital-to-analog converter and a low-pass analog filter as special.",
        "hardware.",
        "This minimum set of equipment is shown in",
        "storage is available, then a 4 k 12-bit-word minicomputer is sufficiently large, and a 12-bit D/A converter will give enough dynamic range.",
        "Once the speech wave is generated and stored on tape or disk, there is a problem of writing a program to output enough of it synchronously at a fast enough rate.",
        "We will not go further into this problem here, since the solution will depend on the particular machine installation you have.",
        "Whatever output sample rate you achieve, there are two things to note: the analog low-pass filter should pass only frequencies below the output sample rate, and the output sample rate is a parameter whose value must be fed into the digital calbulations.",
        "Although our synthesizer can be described as a terminal analog model of the vocal apparatus, the attitude we take is that our method of synthesis is used rather to produce the significant acoustic features of speech.",
        "To set the stage for an understanding of the synthesizer presented here, and for the benefit of those not familiar with acoustic phonetics, let us review for a minute what we are synthesizing.",
        "\"seat,\" Frequency is the vertical axis, time the horizontal, and darker marks indicate more energy.",
        "The mottled area at the upper left is the qUasi-random noise of the /s/ sound.",
        "To make other fricatives, such as /f/, we need to alter the frequency spectrum and intensity of the noise.",
        "The dark horizontal bands in the center are concentrations of,energy -- resonances called \"formants\" characteristic of vowel sounds.",
        "To make different vowels, we need to change the center frequencies, bandwidths, and relative intensities of the three lower formants visible here.",
        "There are higher-frequency formants, which do not show up well in this spectrogram, but they seem to be important only to the naturalness of the speech, not to which vowel is perceived.",
        "Note the beginning and ending slopes of the formants; these formant transitions are crucial to the perception of occlusive consonants such as the stops /b/, /d/, and /g/, And finally, the vertical mark at the tar right is a burst of noise marking the release of the final consonant, The detailed algorithms we present here will be expressed in Fortran for clarity, although the synthesizer with which we have had the most experience is coded in assembly language.",
        "We are presently converting to Fortran, and the subroutines and final example program listed in this paper have been tested in their Fortran form.",
        "Before we get into details of synthesis, consider the overall logic, Figure 3, page 9.",
        "The main thing to•note ix",
        "generated.",
        "This program will produce an integral number of buffer-loads, but other methods for terminating the main loop are easy to implement.",
        "III.",
        "Basic Elements There are five basic elements in this method of speech synthesis:",
        "1.",
        "A glottal wave generator, with controls for repetition rate (pitch) and amplitude; 2.",
        "A white-noise generator, with a control for amplitude; 3.",
        "A resonant filter, with center frequency and bandwidth controls; 4.",
        "An anti-resonant filter, with similar controls; and 5.",
        "A radiation-effect simulator.",
        "These five elements can be connected in a variety of ways tp produce models of greater or lesser complexity.",
        "The glottal wave generator and noise generator produce sounds whose spectra are then shaped by combinations of the other elements."
      ]
    },
    {
      "heading": "A. Sources",
      "text": [
        "11. and a theoretical spectral analysis of a linear approximation shows regular lobes sliperimposed on this spectrum.1 We have just begun to study natural glottal waves in our Research Department, and while no definite results can be reported yet, Figure 4, page 12, shows the wave shape and spectral analysis of one typical male glottal wave period, The opening and closing phases will be more apparent if the wave is considered to begin and end at the minimum value instead of a zero value as our analysis program has done.",
        "There does not appear to be a closed phase of the wave, but this is bne of the variations reported in the literature.",
        "Two general methods have been used to produce approximations to glottal waves: in the first, an impulse is generated and fed into appropriate spectral shaping filters,2 while in the second, a standard wave shape is used as a pattern for each glottal pulse.3 We chose the second method, because Rosenberg has shown that some simple wave shapes produce synthetic speech that sounds natural,4 and the method seemed conceptually cleaner.",
        "Rosenberg studied the naturalness of speech synthesized from a number of different wave shapes used as glottal pulses.",
        "We have used two of his shapes in our work: the linear (called by some \"triangular\") and the polynomial approximations.",
        "Of the shapes he studied, the linear requires the least amount of",
        "1. cf. Flanagan (1958) and Dunn et al.",
        "(1962) 2. cf. Rabiner (1968) and Fant and Martony (1962) 3. cf. Rosenberg (1971) and Sekimoto (1973) 4.",
        "Rosenberg (1971) reports that some subjects preferred",
        "synthetic speech with certain glottal wave shapes to natural speech.",
        "Typical Glottal Wave Period.",
        "The intensity spectrum has been normalized so that the largest component is at the 80 dB level; before normalization it was 61.54 dB relative to an arbitrary standard Qf 0.25.",
        "The horizontal line across the intensity spectrum graph is a conservatively estiveted noise cut-off line; any component with magnitude less than this level may be the product of computational noise.",
        "The phase angles of the components are 01, where the wave is represented by AAn sin(nwit + qn) and 01 is arbitrarily zero.",
        "The ase angle diOplay is suppressed for any component whose intensity falls below the noise cut-off line.",
        "13 execution time and the polynomial scored the highest in his tests of naturalness.",
        "Figure 5, page 14, shows the wave shape and spectrum of a linear approximation and Figure 6, page 14, shows that of a polynomial approximation.",
        "The overall falloff of the spectrum of the polynomial more nearly matches our example wave, but no lobes are apparent, as they are in the spectra of the linear approximation and the natural example.",
        "Judging from some informal listening tests we have made, these distinctions do not seem to make a great difference: both approximations sound good.",
        "As Figure 7, page 15, we present a Fortran function GLOT(P,AV) for generating glottal waves using the polynomial approximation.",
        "Values of pitch (P) and zero-to-peak amplitude (AV) are passed directly as control parameters.",
        "The subroutine uses the common area to store several variables, which or course could be declared as formal parameters instegd.",
        "ISWV is a voicing switch used in the logic internal to GLOT.",
        "TDEL is the period between output sample points in milliseconds; in the overall initialization of the program, its value should Ice calculated as 1000.0/0SR, where OSR is the output sample rate in samples per second.",
        "TG is a variable used as a simulated time clock by GLOT, keeping track of how far through the glottal wave it has gone.",
        "TP, T1, and T2 are durations (in milliseconds) from the beginning or the glottal pulse, calculated and used by GLQT: TP is the duration of the pulse, Tl is the duration of the opening phase, and T2 is the duration of the opening and closing phases combined.",
        "OPTR (an acronym for \"opening time"
      ]
    },
    {
      "heading": "PHASE AROLE SPECTRUM",
      "text": [
        "Figure 6, Wave Shape and Spectral Analysis of a Polynomial Approximation to a Glottal Wave.",
        "For details of the display, cf.",
        "Figure 4.",
        "16. ratio\") is the traction or the wave occuplea Dy :cne opening phase, and CLTR is the fraction occupied by closing.",
        "In the overall initialization, OPTR should be set to .40 and CLTR to .16, values which maximize naturalness according to Rosenberg's paper.",
        "If the instantaneous values of AV were used by GLOT, the standard wave shape would be altered if AV were changing during generation of a glottal wave.",
        "To keep the wave shape constant, GLOT uses the variable AVSAVE to store the value of AV at the beginning of each pitch period, and during the generation of the pulse, AVSAVE is used as the (constant) amplitude.",
        "Between calls to GLOT, the values of ISWV, TG, TP, Tl, T2, and AVSAVE should not be altered, Rosenberg's equations for the polynomial approximation are used in GLOT; to get the linear approximation, the following two lines of Fortran should be substituted in GLOT for lines number 60 and 64:"
      ]
    },
    {
      "heading": "2. White Noise Generator",
      "text": []
    },
    {
      "heading": "Almost any reasonably good random-number generator can",
      "text": [
        "be used as a source of white noise.",
        "If the spectrum of the random numbers produced is flat, it will be easier to shape into the desired spectra for the different fricative sounds.",
        "The algorithm we use was developed for use in synthetic speech work; it is very fast, and produces noise with a quite flat spectrum.",
        "Its presentation by Rader, Rabiner, Schafer, 17. and Perry' easy to follow and implement.",
        "The logic of the algorithm is formally stated in Fortran in Figure .8, page 18, but if possible this should be one function coded in assembly language: if the right machine instructions are available, it will be a snap, but \"bit fiddling\" in Fortran is very slow.",
        "Our function IRN4(X) -- X is a dummy variable required by our Fortran compUer -- contains this algorithm in assembly language, producing on successive calls a series of random numbers with a uniform distribution over the interval from -2047 to +2047.",
        "To implement a white noise generator, only this",
        "where AN is a variable whose value is the amplitude of noise desired.",
        "A typical stretch of noise produced in this manner, along with its spectrum, is given as Figure 9, page 19.",
        "Note that there does not appear to be any significant deviation from flatness in the spectrum intensity.",
        "B. Spectral Shaping Elements 1.",
        "Resonances and Anti-resonances",
        "We use recursive equations, a technique developed by electrical engineers, to simulate resonant and anti-resonant (notch) filters as elements to shape spectra.",
        "Each individual filter can be represented by a second-order linear differential",
        "NM1(19) and NM2(19) are arrays whose elements have either the value 0 or 1.",
        "MOR(N1,N2) is a function returning the exclusive or of N1 and N2, variables having either the value 0 or 1.",
        "MINT(N) is a function whose argument N is a bit-string array such as NMI.",
        "and which returns a 12-bit integer value consisting of the leftmost 12 elements of N packed into a single word.",
        "of the Output From the White Noise Generator, For details of the display cf.",
        "Figure 4.",
        "19.",
        "20. equation, giving only one resonance or antiresonance.",
        "For those who feel at home in the s-plane, the recent book Speech Synthesis edited by Flanagan and Rabiner contains reprints of papers developing the theory of recursive equation filter simulation: for the rest of us, the paper by Lovell et al.",
        "(1973) is a clear presentation, with some more general Fortran algorithms than will be given here.",
        "two Fortran functions which we use to simulate resonant and anti-resonant filters.",
        "The functions RES and ARES return the output values of simple resonant (conjugate pole pair) and anti-resonant (con jugate zero pair) filters, respectively.",
        "AO, Al, and A2 are coefficients used in the recursive equations.",
        "YM1 and YM2 axe remembered previous values of the signal, and Y is the input to the filter.",
        "AO, Al, and A2 determine the characteristics of the filter: center frequency and bandwidth.",
        "Each simulated filter should have its own variables in which to save the values of YM1 and YM2, and between calls to the function simulating that filter, the values of these variables should not be changed.",
        "The subroutine COEFF is used to calculate appropriate values for AO, Al, and A2, based on CF, the center frequency, and BW, the bandwidth, of the resonance or anti-resonance.1 SR is the output sample rate, and MPZ tells the subroutine",
        "ZZ.",
        "whether to compute coefficients for a resonance or an antiresonance The spectral effect of a resonance with center frequency of 3000 Hz and bandwidth of 200 Hz is illustrated in Figure 11, page 23, while Figure 12, page 23, is a similar illustration of the, effect of an antiresonance of the same center frequency and bandwidth.",
        "In these figures, the first graph shows output for an impulse input and the second graph shows the normalized intensity spectrum of that output."
      ]
    },
    {
      "heading": "2. Radiation Effect",
      "text": [
        "The effect .on the spectrum of.",
        "the radiation of sound from the lips through a short stretch of air can be reasonably approx.-tmated by a differentiator.1 Figure 13,- page 24, gives a simple Fortran function RAD simulating this effect.",
        "Y is the speech wave input to the simulater, YM1 is the remembered immediately previous value of Y, and G is a normalizing gain control which should be calculated in the overall initialization as a direct function of the output sample rate, some K times OSR.",
        "The spectral effect of RAD, approximately a 6 dB/octave rise, is illustrated in Figure 14, page 24.",
        "IV.",
        "Organization of Elements A.",
        "The Simplest Model The simplest reasonable model for connecting these elements, which we have taken to calling \"Model T\", is given in block diagram form in Figure 15, page 25.",
        "We use this organization in our currently running synthesizer.",
        "The three variable",
        "as Simulated by Function RAD.",
        "resonant filters are used to make the formants of voiced speech and, in a rather strained fashion, to shape the noise spectrum during frication and aspiration.",
        "All of the elements in this figure should now be familiar except the one called \"higher otder correction filter.\" This is a series of resonant filters of fixed center frequency and bandwidth which compensate for the effect of higher-frequency resonances present in a real vocal tract but absent in a digital simulation of this kind, Their use is discussed in Rabiner (1968i from which the values presented in Figure 16, page 27, were taken.",
        "These are the values to use for center frequency and bandwidth of the higher order correcting filters.",
        "Only higher-order filters with center frequency less than -- the output sample rate should be used.",
        "The recursive equation coefficients AO, Al, and A2 need '12e calculated only once, in the overall initialization.",
        "Theoretically, the order of computation of the series elements such as those in the main stem of Model T, makes no difference.",
        "However, because the digital numbers are finite in length round-off or truncation errors are introduced at each step of the computation The overall error increases afl the number of computational steps increase.",
        "Some types of computation such as differentiation tend to increase the error, while other types such as integration tend to uecrease the error.",
        "For this reason, overall system error is related in a complex way to the order of computation.",
        "An understandin of error buildup and testing of the various algorithms will help in choosing the computational sequence that results in smallest errors In the case of cascaded resonators.",
        "it is better to perform the computation in reverse order from that implied by Fig. 15 - radiation effect first, then higher order filters in descending center frequency order, then formant filters.",
        "Frequencies and Bandwidths.",
        "From Rabiner (1968)",
        "28 The conversion of the Model T block diagram into Fortran is illustrated by Figure 17, page 27, the series elements being here computed in their natural order.",
        "This coding is an example of what should be inserted into the overall logic (Figure 3, page 9) following the comment lines \"GENERATE NXT SPEECH WAVE POINT...\".",
        "B.",
        "Control In the Model T organization, nine control parameters are available P (pitch), AV (amplitude of voicing), AN (amplitude of noise) and the center frequency and bandwidth of three variable formant filters.",
        "In the main loop, just before generating the next speech wave point, a subroutine (it can be in-line code, of course) calculating values of these parameters is needed.",
        "If at the beginning of the program the variable T (time) is initialized to zero and incremented by TDEL at the end of the main loop, it can serve as a simulated-time clock on which to base calculation of the, control parameters.",
        "The simplest method of control is to formulate the desired control parameter curves algebraically and just 29. include Fortran statements in this section calculating their values as in the algebraic equations.",
        "For example, suppose we wanted the pitch to rise linearly from 80 to 120 Hz in the first 100 msec, stay constant at 120 Hz for 200 msec, then fall linearly to 100 Hz in the next 100 msec and stay at that value from then on.",
        "The following Fortran statements can be used to calculate P:",
        "variable formant filters, subroutine COEFF should be called to translate these into the coefficients AO, Al, and A2 actually used by function RES.",
        "If new values of the control parameters are calculated every sample point, the execution time of the program will be very long There axe several obvious ways to speed up this calculation.",
        "One way is to calculate new values for P and AV only at the, beginning of each pitch period, since this is the only time GLOT uses them.",
        "30 With some error introduced, the control parameters can be recomputed only every so many msec to speed things up.",
        "A variable used as a time clock in the same way that TG is used by GLOP can control this period.",
        "Computing the source control parameters (P, AV, and AN) this way introduces error only in that the actual parameter curves will follow the desired curve in a stepwise fashion, but changing the characteristics of the formant filters this way will introduce another type of error, which comes out sounding like clicks or static if the change in filter characteristics is too large.",
        "Our currently-implemented assembly-language synthesizer reads a fire of tabled values created by another program as values representing the parameter curves.",
        "The period between tabled parameter values is changeable, but on the order of 5 to 10 msec.",
        "In computing the actual parameter values used, the synthesizer interpolates linearly along the tabled parameter data curves.",
        "The step size of the interpolation can be easily changed, allowing a smooth trade-off between accuracy and execution time.",
        "To sum up, computing new control parameter values for each sample point generated is the easiest and most accurate way, but alternative schemes allowing a convenient trade of accuracy for speed are easily programmed C. Other Models We will briefly describe several alternative organizations of the elements, although most of our practical experience has been with the Model T organization.",
        "31.",
        "1.",
        "Parallel Formant",
        "One model used in some synthesizers is the parallel formant model, whose block diagram is given as Figure 18, page 32.",
        "In serial formant models such as Model T, no independent control of the relative intensities of formants is possible, since the order of operations is immaterial.",
        "It has been shown that the relative intensities of formants in a serial synthesis closely match those found in natural speech,1 which is some justification of the serial model as an analog of the vocal tract.",
        "But in a parallel formant arrangement, each parallel channel must have a separate gain control.",
        "This is fine if you're investigating the perception of relative formant intensities, but not many have chosen this model for general speech synthesis Rabiner (1968) contains a worthwhile discussion of the relative merits of serial and parallel synthesis.2 If you decide to try a parallel formant model, the higher order correcting filters are apparently unnecessary, and Rabiner (1968) mentions that zeros -- anti--resonances -- are introduced into the spectrum.",
        "2.",
        "Separate Noise Shaping Channel In Model T, the same three filters are used to make the formants or voiced speech and to shape the spectrum of noise during unvoiced speech.",
        "This is cumbersome and difficult, and a simple alternative is illustrated in Figure 19, page 34.",
        "1.",
        "Pant (1956) 2. so does Flanagan (1957)",
        "33.",
        "A separate channel is devoted to noise, with its own resonant and anti-resonant filters for spectral shaping.",
        "It has been suggested that one resonance and one antiresonance are sufficient to model most English fricatives.1 Of course, this model adds two new control parameters to be computed.",
        "3.",
        "Other More Complex Models",
        "Model T does not use anti-resonances; they are not typical of voiced speech, but rather are present in the spectra of fricatives and nasalized segments.",
        "For making nasal sounds, a parallel nasal channel whose input is the glottal wave and whose output is added in just before the radiance effect calculation can be added.",
        "The spectral shaping filters needed in this channel are not obvious from published reportse but one variable antiresonance and several fixed resonances are probably a minimum complement.",
        "A multitude of more complex models can be seen in the literature, -- Rabiner (1968), to take one example, includes a special arrangement for generating voiced fricatives.",
        "D. A Complete Example To illustrate the capabilities of the simplest synthesis model, on the following pages we present as Figure 20 a complete Fortran program for synthesizing the word \"seat\" ([sith] ).",
        "We tried to duplicate one particular token utterance of_this word.",
        "Spectrograms of the original sound used as a model and the synthesized sound calculated by the Fortran program are shown in",
        "1.",
        "Heinz and Stevens (1961)",
        "token utterance took a lot of work, but as Figure 21 shows, the resulting synthetic word is a reasonably close copy of the original.",
        "For those who may want to use, this program as a beginning to their work, several features of it will be explained.",
        "The basic model used is the simplest, model \"T\" (Figure 15, page 25) with one addition: the noise signal is multiplied by a relative gain constant (GFRIC) before entering the vocal tract (variable filter) section.",
        "The output sound wave is stored a block at a time in file RAPWRK1.",
        "This file is opened by the subroutine called in line 43 written into in line 455, and closed in line 470.",
        "Parameter values are periodically calculated from piecewise polynomial algebraic specifications in the section called l'GPARII, lines 142 to 415.",
        "The periods between parameter recalculations are controlled by two variables serving as clocks, TVOC for voicing parameters and TFRIC for frication parameters.",
        "The values of PVOC and PFRIC are the times in msec between recalculations of vocalic and fricative parameter values, respectively.",
        "These parameter values can be reset more often by merely changing the values assigned to PVOC and PFRIC in lines .33 and 37; at present frication parameters are reset every 0.1 msec and vocalic parameters every 0.2 msec.",
        "The Fortran logic calculating the parameters was coded for clarity, not economy, and though lengthy should be easy to follow.",
        "The primitive subroutine TPOW returns powars of a variable for ease in calculating polynomial functions of time: after calling TPOW(T,N,TX) TX(1)=T1, TX(2)=T2, TX(N)=TN Certain parameters are constant during some of the sounds, e.g., spectral parameters during \"S\".",
        "As a minor concession to execution speed, these constant parameters are not reset after the first entry into the section during which they are constant The variables ISW1, ISW, and ISW3 are °first-time-through\" switches, used to remember whether or not the temporarily constant parametets have been calculated yet.",
        "We have found that duplicating a token of natural speech using this simple basic synthesis model, though possible, can be quite difficult, requiring much trial-and-error work.",
        "Fortunately, much research on speech perception does not require exact duplication of given utterances, but instead uses simpler sets of parameter curves.",
        "An example of such a program, which synthesizes the vowel /i/ with constant pitch and intensity can be made by substituting the following code for the °GPAR° Section, lines 151 to 411 of the sample program.",
        "and Synthesized \"Seat\".",
        "This spectrogram was made on the Voice Identification, Inc. Ceries,700 machine.",
        "with wideband setting and high frequency'shaping above 1 kHz.",
        "not easily available, the primary sources of Dunn's data are also listed in the bibliography.",
        "The fundamental and three formant frequencies for men, women, and children were taken from Peterson and Barney (1952).",
        "The three formant amplitudes for each vowel are also from the Peterson and Barney measurements, but averaged over all three classes of speakers.",
        "Dunn took the relative strengths of the first formants of the different vowels from the measurements ,of Sacia and Beck (1926), as quoted by Fletcher (1953) arbitrarily assigning the zero decibel level to the strongest vowel, [ The three formant bandwidths are the average of three sets given by Fant (1962), one set his own measurements, one those of House and Stevens, and the third measured by Dunn himself (1961).",
        "Dunn cautions that the bandwidths vary widely among individual speakers.",
        "These values of center frequency and bandwidth of formants for the different vowels can be used as variable formant filter control parameters in Model T with unimpeachable results."
      ]
    }
  ]
}
