{
  "info": {
    "authors": [
      "Geoffrey Sampson"
    ],
    "book": "ACL Microfiche Series 1-83, Including Computational Linguistics",
    "id": "acl-J79-1025",
    "title": "Natural Language as a Special Case of Programming Languages",
    "url": "https://aclweb.org/anthology/J79-1025",
    "year": 1979
  },
  "references": [],
  "sections": [
    {
      "heading": "SUMMARY",
      "text": [
        "I offer a tentative answer to a question posed by Leo Apostel: 'what type of automata would produce and use structures such as natural languages rpossess3'?",
        "Noam Chomsky has pointed out that natural languages share certain common structural enaracteristics, and he argues that these linguistic universals have implications for our understanding of human mental processes.",
        "In my 'The Form of Language' (1975), I suggest that we should develop a model of human mental machinerv by designing an abstract automaton which accepts programa having the range of structures universally found in the semantic analyses of sentences of natural languages.",
        "This article makes concrete proposals about such an automaton.",
        "An automaton is defined by specifying a set of states, a set of acceptable programs1 an input function mapping pairs of program and prior state into new states, and a successor-state relation which permits the automaton to move spontaneaasly from one state to another, either deterministically ox non-deterministically.",
        "In an automata-theoretic model of human mental processes, sentences will play the part of programs, automaton-states will correspond to structures of knowledge or belief, the input function will specify how a person's belief-structure is altered by the sentences he hears or reads, and the successor-state relation will correspond to the rules of inference by which One derives new beliefs from the beliefs one alreadY has.",
        "A computer is a physical realization of an automaton; but an automaton modelling the behaviour of users of natural language will certainly be very different from the automata which ... and concentrate on semantic features which appear to be constant for all natural languages.)",
        "The model I propose turns out, as an unexpected bonus, to offer satisfying solutions to a number of controversial points of philosophical logic.",
        "On the other hand, it remains to be seen whether the model can successfully be extended beyond the subset of natural language it now covers, I conclude by listing some unsolved problems."
      ]
    },
    {
      "heading": "1",
      "text": [
        "This article proposes a tentative answer to a question posed by Apostel (1971: 22): 'what type of automata would produce and use structures such as natural languages [possess]'?",
        "Chomsky has pointed out that natural languages show common structural characteristics: each natural language is derived transformationally from a context-free phrase-structure language.",
        "Chomsky (e.g. 1968, and cf. Lenneberg 1967) argues that this shows that we have innate psychological machinery for processing language.",
        "I have suggested (Sampson 1972a, 1975a: ch. 8) that a fruitful way to construct a theory of such psychological machinery will be to view the relation between sentence and hearer as analogous to that between computer program and computer.",
        "Here I wish to offer some concrete proposals about the psychological machinery involved in the comprehension of natural language, based on comparing the structure of natural language with that of actual computer programming languages in practical use.",
        "1 I insert 'possess', sinde I prefer to speak of languages having structures rather than being structures.",
        "I discuss Apostel's own comments on this question elsewhere (Sampson 1974).",
        "2 I show elsewhere (Sampson 1973b) that this is an empirical hypothesis, despite the findings of Peters & Ritchie and others that any recursively enumerable language can be generated by some transformational grammar."
      ]
    },
    {
      "heading": "2",
      "text": [
        "It is usual to distinguish the terms automaton and computer: an automaton is a mathematical abstraction of a certain kind, while a computer is a physical object designed to embody the properties of a particular automaton (cf. Putnam [1960j 1961: 147), as an ink line on a sheet of graph paper is designed to embody the properties of a eontinuous function; thus e.g. a computer but not an automaton, may break down, as a graph, but not a function, may be smudged.",
        "Naturally, though, the only automata for which there exist corresponding computers are automata .which it is both possible and useful to realize physically; so the class of computers represents a rather narrow subset of the class of automata as defined below.",
        "We shall sometimes speak of 'computers' meaning 'automata of the class to which actual computers correspond'; category mistakes need not bother us if we are alert to their dangers.",
        "We may define an automaton A as a quadruple ( X, Lit, Sue), in which Zr is a (finite or infinite) set of states, gi is a (finite or infinite) language (i.e. set of strings of symbols), Int is a partial function from 2)4",
        "(the Cartesian product of tP with t) into T (the 1.1.2aLt function)t and Suc is a relation on j91 i.e. a subset of JPx JP (the successor-state relation).",
        "ole is called the machine langu-Eze of A; a timber of ot is a program.",
        "We treat the flow of time as a _succession of discrete instants (corresponding to cycles of actual computers), Between any adjacent pair of instants, state a & Y.",
        "At any given instant, a",
        "wise, no change of state occurs, and S is called a stopping state.)",
        "If Suc is a (partial) function (i.e. if for each S there is at most one state S' such that S Suc S'), the automaton is deterministic An ordinary digital computer is a deterministic automaton whqse states are realized ad different distributions of elect-Tical charge (representing the digits 0 and 1) over the ferrite cores in a store together with a set of working registers and an address counter.",
        "The number of states of such an automaton IS finite but very large: a simple computer with a store containing 4096 words of 16 bits together with a single working register would have on the order of 5 x 1019736 states.",
        "The programs of the machine language of such an automaton will consist of sequences of machine words not exceeding the size 01,' the store, and thus the machine language will again be finite.",
        "The input of such a program containing, say, n words will cause the automaton to load these words 'into the first n places in It store, replacing the current contents, and to set the address counter to 1.",
        "The successor-state function is determined by the number in the address-counter together with the code translating machine words into instructions; whenever the counter contains the number i the automaton changes its state by executing the instruction in the ith place in store and Lacrementing the aounter by one.",
        "A proper subset of the automaton's states are stopping states: whenever the storage word indicated by the address counter is not the code of any instruction, the machine stops.",
        "state function, beginning with S and ending (if the succession is finite) at a stopping-state.",
        "A computer is arranged so that, on entering certain states, it performs certain output actions (e.g. it prints a symbolic representation of part of its internal state onto paper).",
        "The art of programming such a computer consists of finding an input program which moves the computer into a state, the succession of which causes the computer to perform 4ctions constituting a solution to the programmer's problem, while being finite and as short as possible.",
        "3.",
        "A natural language, such as English, is specified syntactically and semantically by defining a set constituting the sentences of the language together with a subset of at* X (where 'ce' denotes the power set of Z), such that {Li, L2, ••, L t Lo iff Lb is implied by the premisses 12, •••, L 4-01 0, Li e whenever 0 i n).",
        "(En the limiting caselm-the null set 0 F L if L is analytic.)",
        "In 0 practice, the infinitely numerous members of t are generated by a finite set of context-free phrase-structure rules, together with syntactic transformations which operate on the structures defined by those rules.",
        "The infinitely numerous members of 1 will be defined by a specification of a relation between the sentences of 4 and a set of arrays of symbols called 'semantic representations' of those sentences, together with a finite set of rules of inference, similar to those of extant formal logics, which permit the construction of a derivation containing the semantic representation of 1.40 as conclusion and the semantic representations of L41 L as premisses",
        "just when {Li, 1.21 ...I L 1 Lo.",
        "The 'generative semantic rules revealed by independently-motivated syntactic analysis (e.g. Postal C1970) 1971: 2521); although this hypotnesis certainly not altogether correct (see e.g. Partee 1971), it seems, likely that the semantic representation of a sentence is some simple function of its syntactic deep structure and its surface structure.",
        "The rules of inference for natural languages will no doubt exhibit the 'structure-dependence' characteristic of syntactic transformations, as do the rules of inference of formal logics, cf. Sampson (1975a: 163.7, forthcoming) (thus, the term 'X:DY' in the standard rule of modus ponens, i.e. '1X:2Y, X1-5, , is a structqral description not of all formulae containing an instance of 1r.p' but only of those in which 1=1 is an immediate constituent of the whole formula).",
        "For discussion of the philosophical problems involved in this way of describing natural-language semantic analysis, including problems relating to the analytic/synthetic distinction, cf. Sampson (1970, 1973a, 1975a: ch. 7)."
      ]
    },
    {
      "heading": "4.",
      "text": [
        "It is tempting to view the mind of a speaker of e.g. English as an automaton in the defined sense, with the sentences of English as the programs of its machine language, and the rules of inference of English determining the successor-state relation.",
        "In other words, some component of the mind of an English-speaker would be a device capable of entering any the relation between sentences and semantic representations is a function.",
        "In practice it will not be (ambiguous sentences will have more than one semantic representation), so 'the' should read 'one of the .\" (respectively)'.",
        "one of a (perhaps infinitely) large number of discrete states; hearing (or reading) a sentence would move this device from one state to another in accordance with definite rules; and other rile d Eelated to the rules of inference of English would govern, how it passes through different states when not immediately reacting to speech (i.e. when the owner of the mind is thinking).",
        "Although the analogy is tempting, extant computers and their machine language d are not promising as sources for a theory of the relation between human minds and natural languages.",
        "The machine language sketched above is not at all reminiscent of natural languages.",
        "The latter typically contain infinitely many sentences, only the simplest of which are used in practice; the machine language of §2 contains an enormous but finite number of programs, and the programs which are useful in practice (those which compute important functions) are not typically 'simple' in any obvious sense.",
        "Fortunately, the machine languages of the various extant computers are not the only artificial programming languages in use.",
        "Partly for the very reason that machine languages are so different from natural languages 5 most programs are written not in machine languages but in so-called 'high-level',programming languages, sudh as FORTRAN, SNOBOL, APL, PL/1 (to name a few among many).",
        "We may think of a computer Alm supplied with a compiler program for some high-level langtigge 041 as simulating the workings of a very different computer, say",
        "No such computer as AR, actually exists: high-level languages are not typically the Elachine languages of any physical computers, and there are qndoubtedly sound engineering reasons for this.",
        "But the abstract automaton Ala may be described just as precisely as the automaton44 whia underlies the real computer.",
        "One who programs an 'system' (i.e. conjunction of eomputer with 4-compiler) commonly thinks of the machine he is dealing with \"gs having the properties of All, and may be quite unaware of the properties of the machine Alm with which he is in fact interacting.",
        "High-level languages, and the abstract automata whose 'machine languages' they are, differ from one another in more interesting ways than do real computers and their machine languages; and furthermore (not surprisingly, since high-level languages are designed to be easily usable by human programmers) they are much more comparable with human languages than are real machine languages.",
        "(T/pically, a high-level programming language is a context-free phrase-structure language, for instance.)",
        "I shall suggest that the relationship betweer high-level languages and their corresponding automata gives us mUch better clues about human mental machinery than does that between real computers and machine languages.",
        "5.",
        "Le V me first give an example of a high-level language: I shall choose the language APL (see e.g. Iverson 1962, Pakin 1968).",
        "LPL is interesting for our purposes because it is particularly high-level: i.e. it is related more distantly to machine languages of real computers, and more closely to human languages, than many other high-level languages.",
        "It is a real-time rather than batch-processing-language, which means that it is designed to be used in such a way that the result of inputting a program will normally be crucially dependent on the prior atate of the system (in a batch-processing language, programs are designed to be unaffected by those remains of the prior state which survive their input): this is appropriate for an analogy with human language, singe presum",
        "ably the effect on a person of hearing a sentence depends in general on his prior system of knowledge and belief.",
        "The complete language APL includes many features which are irrelevant to our analogy.",
        "For instance, there is a large amount of apparatus for making and breaking contact with the system, and the like; we shall ignore this, just as we shall ignore the fact that in human speech the effect of an utterance on a person depends among other things on whether the person is awake.6 Also, APL provides what amounts to a method uf using the language to alter itself by adding new vocabulary; to discuss this would again complicate the issues we are interested in.?",
        "We shall assume that programmer and system are permanently in contact with one another, and we shall restrict our attention to a subset of APL to be defined below: rather than resorting to a subscript to distinguish the restricted language from APL in its full complexity, we shall understand 'APL' to mean the subset of APL under consideration."
      ]
    },
    {
      "heading": "5 The practising computer user may find my definition of",
      "text": [
        "the real-time/batch-processing distinction idiosyncratic; the difference I describe is the only one relevant for our present purposes, but it is far rrom the most salient difference in practice."
      ]
    },
    {
      "heading": "6 In APL terms, we ignore all system instructions, i.e. words beginning Atha.- Note that we use nyz underlinin",
      "text": [
        "(corresponding to bold type in print) to quote symbols or sequences of symbols from an object-language, whether this is an artificial language such as APL or a natural language such as English.",
        "?In APL terms, we ignore the d9finition mode and the use of characters 17A:4.",
        "1 LI6.",
        "We begin by defining the set .1 of states of 4"
      ]
    },
    {
      "heading": "APL An'",
      "text": [
        "First, we recursively define a set of APL-propefoties: any positive or negative real number is a numeric APL-property of dimension 0; any character on the APL keyboard (i.e. any of a_fipite set of characters whose identity does not concern us) is a literal APL-property of dimension 0; for any integer n and integer-string D, any n-length string over the set of numeric (literal) APL-properties of dimension D is a numeric (literal) APL-property of"
      ]
    },
    {
      "heading": "dimension Tru8.",
      "text": [
        "For any finite string D over the integers, any numeric or literal APL-property of dimension D is an APL-property, and nothing else is ouch.",
        "Clearly, there are infinitely many APL-properties..",
        "The length of the dimension of an APL-property is the rank of that APL-property.",
        "Thus, a number is a rank-0 numeric AFL-property; a four-letter word, e.g. LOVE, is a rank",
        "An APL-identifier is any rank-1 literal string beginning 8 The symbol \"\" stands for concatenation (a dimension is always an integer-string).",
        "Concatenation is a function from sets of strings, so we should strictly write 'DAN' (where N is the length-one string over inl) rather than IDAnT.",
        "For any set S and any integer n 0, we use the terms •n-tuple of elements of SI and 'lenghtE.n sTir over 3' interchangeably for any funetnn from the segment 1 2 • • I nl of the natural .",
        "4. numbers into 8, note that the null set 0 is therefore the length-0 string over any set.",
        "with an alphabetic character: there are therefore infinitely many APL-identifiers.",
        "We define Ident as the set including all APL-identifiers together with an entity, assumed to be distinct from all the APL-identifiers, denoted by the symbol Ci.",
        "An APL-object is a pairing of any member of.Ident with an APL.",
        "property; we call the first member of an APL-object the identifier of the object and the second member the .Oroperty of the object.",
        "An APL-state is a finite set of APL-objects in which no distinct objects bear the same identifier.",
        "(We may thus think of an APL-st-atb as a function from a finite subset of Ident ' into the set of APL-properties.)",
        "We write 4ATLfor the set of all APL-states: clearly, ejun is infinite.",
        "We now define titre language kvis of 04Lpii.",
        "grAPL is generated by the context-free grammar on p. 16.",
        "The initial symbol of that grammar is asst (for 'assignment').",
        "Since capital letters occur among the terminal symbols ofe we PL1 use miniscules as non-terminals; terminal symbols of APL are wavy-underlined (cf. note 6, p. 13), whether they are letters or other characters.",
        "id -1, [any APL-identifieri numname [any number or string of numbers, denoting the corresponding rank-0 or rank-1 numeric APL-propertyl9 litname 0 [any character or string of characters between inverted commas, denotint5 the corresponding rank-0 or"
      ]
    },
    {
      "heading": "rank-1 literal APL-property]10",
      "text": [
        "mf 0 [any of a large finite set of symbols Or symbol-strings denoting partial monadic functions on the set of API,-properties111 df [any of a large finite set of symbo].",
        "(-string)s denoting partial dyadic functions on the set of APL-properties] tf [any of a finite set of symbol(-string)s denoting partial triadic functions on the set of APL-propertied2 deic Eau of a small finite set of symbol-strings denoting total monadic functions from the set of possible programming-acts into the set of APL-propertiesji3"
      ]
    },
    {
      "heading": "The senteinces of Aun are the strings defined by the above",
      "text": [
        "grammar, disambiguated by the use of round brackets (with assoc4ation to the right where not indicated by bracketing)."
      ]
    },
    {
      "heading": "The sequence of symbols 04- may optionally be deleted when init",
      "text": [
        "ial in a sentence.14 Clearly there are infinitely many sent"
      ]
    },
    {
      "heading": "ences in X A sentence of Jgjarli is an APL-prwam.",
      "text": [
        "APL We now go on to specify the function IntAn from"
      ]
    },
    {
      "heading": "J)ApL x APL Y which specifies the change of APL-APL",
      "text": [
        "state brought about by a given APL-program.",
        "To determine the new state arrived at from an arbitrary ignore these practical complicatbns for the sake of simplic"
      ]
    },
    {
      "heading": "ity.",
      "text": []
    },
    {
      "heading": "101 ignore complications relating to strings containing",
      "text": [
        "the inverted comma character.",
        "11Some of these functions, and their names, are common to all 'dialects' of APL: e.g. 44 which denotes the function taking integers into their factorials, ,strings of integers into the corresponding strings of factorials, etc., and which is undefined e.g. for literal APL-properties.",
        "The facility of 'user-definition' (cf. note 7) permits a programmer to alter APL.by adding new functions."
      ]
    },
    {
      "heading": "12APL contains no triadic functions other than user",
      "text": []
    },
    {
      "heading": "defined ones.",
      "text": [
        "13E.giaa denotes the function taking any programming act into a string of integers representing the time of day at which it occurs."
      ]
    },
    {
      "heading": "syntactic transformations in natural languages, concerning a",
      "text": [
        "dyadic function called index, which is denoted by square brackets, we ignore these complications, and shall not consider 'index' apart from the other dyadic functions.",
        "18 current state on input of an arbitrary program, we consider the phrase-marker of which that program is the terminal string.",
        "Beginning at the leaves and working towards the root, and evaluating the rightmost node whenever there is a choice, we associate each deer node with an APL-property as its denotation and each aast node with a change to be made to the current APL-state: the new APL-state is the one that results from the old state by making all the changes associated with the various asst nodes in the order mentioned, terminating with the change associated with the root asst node (which may of course be the only one).",
        "If at any point a deer node cannot be assigned a denotation (e.g. because it is realized as an APL-identifier which is not the identifier of any object in the current state), the state-changes already made (if any) are the total changes achieved by that program.",
        "The rules for evaluating nodes are as follows: A deer node realized as an identifier denotes the APL-property, if any, paired with that identifier in the current state; a deer node rewritten as numname or litname denotes the APL-7.property denoted by its 'exponent' (i.e. the terminal material it dominates); a deer node rewritten as deic denotes the APL-property given by applying the function denoted by its exponent to the current programming-act; when a dscr node do dominates an mf node di followed by a deer node de, if di denotes some monadic function f and d2 denotes an APL-property then do denotes the APL-property f(g), provided 2, e dom(f); the extension to deer nodes rewritten dser df deer and deer tf deer deer is obvious.",
        "An asst node dominating a member i of Ident, followed",
        "has the constituent structure which appears in Fig. 1 on the next page (in which deter and asst nodes are numbered in the order they are to be evaluated)."
      ]
    },
    {
      "heading": "Suppose the program is input in the morning, say at 11.30",
      "text": [
        "a.m. Then dscri will denote the string 11 30 0.",
        "The function > takes (12 0 0, 11 30 0) into 1 0 0, which becomes the denotation of dscr -- in fact deer will denote 1 0 0 whenever the program is input in the morning and 0 0 0 whenever it is input in the afternoon (when the hour integer will be 13 or more).",
        "The monadic function +/ adds the numbers in a string, so if dscr3 denotes 1 0 0 then deer11 denotes 1.",
        "Dser5 denotes 10 (identified by DI so deer also denotes 10.",
        "Accordingly, 15 In the full version of APL, aean occur as a rewrite of dscr, in which case deer is assigned an APL-property input by the at the time deer is evaluated by the system.",
        "We ignore this, since it interferes With the analogy with natural language.",
        "IL the full version it is also possible to output symbol-strings which do not represent individual APL.",
        "properties; again we ignore this.",
        "property, and dscr denotes 11T 1, so deter denotes 3, and hence dscrio denotes 13.",
        "Finally, asstil adds an object (Q, 13) to the current state.",
        "In other words, if the program is input in the morning and the prior state is as quoted, the final state will be i(A, 11 1), (11,„ 10), (0, 10), (Q, 13)1, whereas if it were input in the afternoon to Ajun in the same prior state the resulting state would be i(A, 1 1 1), (Bo, 10), ( U, 0), (Q, 3)1.",
        "To define AAPL fully it remains only to specify the relation Suclam on J.A.1011 which controls the changes-of-state AAPL undergoes-spontaneously.",
        "SucAn is the empty relation: every APL-state is a stopping state.",
        "A programmer working in APL has no wish for the system to take any actions beyond those specified by his programs: by defining monadic, dyadic, or",
        "computer, which will have only finitely many states and possible programs, can be made to simulate an automaton such as A which has infinitely many states and programs.",
        "And, of"
      ]
    },
    {
      "heading": "APL",
      "text": [
        "course, in practice the simulation is not perfect.",
        "Although 22 an APL-state may contain any number of objects, for, any APL computer/compiler system there will be a finite limit on the number of objects in a state; although any real number may be an APL-property, in a practical APL system real numbers are approximated to a finite tolerance.",
        "The Situation is quite analogous to the case of natural language, where the individual's 'performance' is an imperfect realization of an ideal''competence', in one sense of that distinction; just as in linguistics, so in the case of high-level programming languages it is normal to give a description of the ideal system separately from a statement of the limitations on the realization of that system in practice, which will differ from one person to another in the natural language case, from one computer/compiler pair to another in the programming language case.",
        "Other high-level programming languages differ from APL not only in terms of their sentences but in terms of the nature of the states on which their sentences act.",
        "Thus in states of e.g. SNOBOL, all objects are character strings; in PL/1, objects include not only arrays of the APL kind but also trees, trees of arrays, arrays of trees, etc.",
        "Space does not permit a survey of the differences between highlevel languages with respect to the nature of their states.",
        "8.",
        "At this point we are ready to begin to answer Apostel's question, about what sort of automata natural languages are appropriate programming languages for.",
        "Any answer ,to such a novel question must obviously be very speculative; but the ideas that follow seem plausible enough to be worth consideration.",
        "We do not know with any certainty even what the semantic representations or syntactic deep structures of our sent23 ences are; but we have seen that there is good reason to think the two may be similar, and we can make more or less detailed conjectures about their form.",
        "In my exposition I shall make various assumptions about semantic representations, some of which have already been made for independent reasons by other scholars* Insofar as my theory depends on these assumptions, a refutation of the latter refutes the theory -- this is one of the respects in which my theory is falsifiable, i.e. scientific.",
        "I shall present my theory in a 'relatively informal, intuitive way to begin with, and formalize it more carefully later.",
        "What we are looking for is a specification of a met 4Eng of states, which we can interpret as states of some subpart of the mind of an English-speaker, such that semantic representations of English sentences are rather natural devices for moving this part of the mind from one of its states to another.",
        "It will be convenient to have some name for that part of a human's total psychological make-up which is described by specifying In earlier, unpublished work I have called this the topicon (coined on the analogy of 'lexicon'), since I envisage it as containing a set of entities corresponding to the objects of which its owner is aware, and to which he can therefore take a definite description to refer.",
        "i;11 , then, is to be a set of possible topicon-states.",
        "The sets of topicon-states available to speakers of natural languages othar than English will differ from (cf. 17 below), but not in respect of the properties on which this paper will concentrate.",
        "Note that a topicon-state is certainly not to be equated with a 'state of mind' or 'psychological state': a topicon is claimed to be only one small part of a human's mental machinery, and there will be many ways in which the latter can vary e.g. the human may be happy or sad, asleep or awake -- without implying any difference in topicon-state."
      ]
    },
    {
      "heading": "Just as an APL-state contains a set of APL-objects with",
      "text": [
        "properties drawn from a fixed class, so a topicon-state will contain a set of objects I shall call referents.16 Suppose some person P knows of the existence of a red car C; then P's topicon will include a referent c corresponding to C. The referent c will be P's 'Idea' of CI in Gekch's terms (1957).",
        "The possible properties for referents will be determined by the vocabulary of P's language, in this case English: each lexical item of English will correspond to a referent-property.",
        "I shall use Geach's operator IR )' (1957: 52) to form names of referent-properties from lexical items: if P knows that C is a red car then c will have the properties §(red) and gear).",
        "(An element of a mental state cannot be red, but it can be KM1,.",
        ")•) P's topicon will include not only referents representing physical objects but referents for any entities of Which P is aware and which he can take definite descriptions (referential NPs) to denote: there will be referents for characters in fiction, for abstractions like the centre of this circle, etc.",
        "etc.",
        "But, at any given time, P's topicon will contain only a finite number of referents.",
        "Given enough time, of course, there is no limit to the number of objects whose existence P could deduce or imagine; and I shall suggest that for P to 'Here and below, rather than coining neologisms I use terms having established usages in philosophy and logic in senses which clash with their normal use; in such-cases I use the term only in the sense I define.",
        "25 deduce or imagine the existence of some entitY B is for P's topicon to acquire a new referent representing B.",
        "But deduction and imagination take time: in a finite amount of time P's topicon will have acquired only finitely many referents.",
        "9.",
        "Consider sentences (2a) and (2b) addressed to P (and let us simplify things initially by supposing that P does not pre-vicasly know of any red cars -- we shall consider the more general case in §10):",
        "(2h) I sold the red car today.",
        "The NP a red cdter in (2a) will create a referent with the properties §(red) and §(car) in P's topicon.",
        "On the other hand, when he hears (2b) the NP the red ear will pick out the referent which a red car has already created (in order to act on it in ways which will be discussed later).",
        "In other words, the distinction between the red car and a red car is quite parallel to the distinction between deer and asst constituents, respectively, in APL: the former selects an object from the current state, the latter aaas an object to the current state.",
        "Let us call natural-language expressions which act in the former way 'identifying expressions' (IEs), and expressions which act in the latter way 'establishing expressions' (Es).",
        "Clearly the IE/EE distinction is related to the traditional distinction between 'definite' and 'indefinite' NPs.",
        "However, I do not claim that-all definite and indefinite NPs count as IEs or EEs respectively.",
        "Consider, for instance, the de dicto / de re or opaque reference / transparent reference) ambiguity exhibited by Ns in 'intensional contexts' (see e.g. Quine 1960: §30,",
        "In the de diet° sense of an 21telet, (3) does not imply that there are any elephants, although in the de re sense it implies that there is at least one.",
        "Only in the de re sense is an ele-Vitally, in (3) an EE in my terms, though syntactically an 219,047 ant is clearly an 'indefinite NP' in both cases.",
        "On the other hand, in sentences containing quantifiers, definite NPs may not always be IEs: thus, in (4) the definite NP the tjçjt does not denote a particular object (and therefore, perhaps, does not pick out a particular one of the hearer's referents).",
        "just as the indefinite NP a book does not seem to establish the existence of a single book:",
        "(4) Whenever Io blAzz.",
        "a book.",
        "I remove the du.,,%;!,‘,.3.1ttacl,i.jat."
      ]
    },
    {
      "heading": "looft•AM0106 .1~\"",
      "text": [
        "I shall develop my theory with a view to handling the subset of English which excludes quantification and intensional contexts, and in which 'definite' and 'indefinite' NPs do coincide with IEs and EEs respectively.",
        "Later I shall consider some of the aspects of English which my theory doAs not handle successfully as it stands.",
        "Even in the subset of English considered here, not all definite NPs will in fact refer to referents already in the hearer's topicon.",
        "For instance, a child may come home from school at the beginning of a new term and say to his mother:",
        "teacher, i.e. it may be that her topicon contains no referent for which the phrase the new teacher is appropriate; but in practice she is likely to work out from her child's sentence that there is a new teacher, and to understand that the child saw him.",
        "In other words, in this case the phrase the new teacher acts as an EE to create a new referent in the mother's topicon.",
        "However, it seems plausible to say that this is in some sense not the central use of a phrase such as the new teacher; it-would be more appropriate, if the mother does not know about the new teacher, for the child to say something like:",
        "(6) There is a new teacher at school and I saw him -5,2aeL., 4.",
        "WA& #101006\".~~ Aft*, \"\"A\".04014W /■••••■■■•• Nio%•••• AP•01#040",
        "in which the referent denoting the teacher is first introduced by an.EE and only then re-identified by an IE.",
        "Notice that the mother may react to (5) by sayinK something like:",
        "(7) What new teacher?",
        "I didn't know there was one.",
        "\"0-04,\"\" ^VW.",
        "AAIV~644401\"1040 IV \"V~.040N/leb‘ ,A0VAAqfto .OVVAIw~ INAA44/ '‘04°A•low•et",
        "which would not be a possible reaction to a sentence using the EE a new teacher.",
        "What happens when the mother successfully acquires a new referent in response to (5), I suggest, is that she imagines some circumstance in which the new teacher would succeed in 04-vw picking out a referent in her topicon -- for instance, if there were a new teacher at her child's school -- and, in imagining these circumstances, creates the referent; after which the sentence operates on her topicon in the normal way.",
        "The APL system does not work like this: if one inputs the sentence A 4--B to an APL-state lacking an object named B, the system 28 prints out a message pointing out one's error but does not change state.",
        "It is natural enough, though, that human linguistic behaviour shows more initiative than the behaviour of artificial automata.",
        "A programmer has complete control over the automaton he programs, and it is easier to require the programmer to get his programs right than to equip the automaton with routines to guess what the programmer means by defective sentences.",
        "A human speaker, on the other ,hand, has no way of knowing exactly what state his hearer's topicon is in, so it is all to the good if the hearer can compénate in simple cases for defects in the speaker's sentences.",
        "Since-I shall frequently be speaking of the relations between linguistic expressions, topicon-referents, and the entities in the outside world which the linguistic expressions denote, let me lay down some terminological conventions.",
        "I shall use denotation for the relation between an 1E and -che thing which a hearer takes that IE to correspond to; my theory asserts that denotation is a composition of two relations, a relation of reference between linguistic expressions and topicon referents, and a relation of representation between topicon-refereats and things.",
        "Thus, if the phrase your car said to P now picks out a referent ri in P's topicon, and if P owns exactly one car C, then your car refers to ri and denotes C, and ri represents C. We say that ri is the referent of, and C the denotatum of, your car (on this occasion), Notice that an IE may refer, without denoting: if P has read Crime and Punishment, then his topicon will contain two referents, say r 13, such-that RaskolnikoV refers to r2 and Alena Ivanovna refers to, though neither of these",
        "NPs denotes anything (and, correspondingly, E2 and r3 will both have the property Rfictional)).",
        "Furthermore, identity of the 29 denotata of two IEs does not imply identity of their referents.",
        "Thus, if P knows that I have exactly one brother and that he is the new doctor, then the IEs the newdoctor and Sampson's brother will refer to the same referent in P's topicon, and hence also denote the same man (the details of reference by means of the genitive construction are discussed in §12 below); but if P knowS that I have one brother and that there is a new doctor, but does not realize that they are the same man, then the two IEs will refer to different referents in P's topicon, even though each of these referents will in fact represent the same man.",
        "10.",
        "So far we have assumed that, when a hearer hears an IE such as the red car, his topicon contains only one referent with the properties (red) and Rear).",
        "Clearly this will not in general (or even usually) be so: when one hears an IL, it will often be the ease that one knows of a number of objects fitting the description.",
        "17 One who hears the red car will take the phrase to refer to one among the various red cars of which he is aware which is in some way closer than the others to the",
        "focus of his attention.",
        "This will translate into our theory as the notion that the referents in a topieon are arrayed in some kind of space, one point of which constitutes the focus of attention at any given time.",
        "The nature of this space, and the factors which determine the position of the referents and focus of attention in it, will be considered in §16 below; for the moment, let us simply assume that the notion can be made precise.",
        "Then we can say that any 1E consisting of the word the followed by a series wi m2 w of adjectives and noun will refer to the nearest referent 'CO the hearer's focus of attention having all the properties (w1), gI2), and gild.",
        "Thus, the oar will refer to the nearest 9(car) referent to The focus, while the red car will refer to the nearest referent to the hearer's focus which is both gred.)",
        "and Year).,18 One would expect that the nearest referent of all to the focus in any topicon-state should be referred to as the; in English a syntactic rule replaces the as a complete NP by he, she, or it."
      ]
    },
    {
      "heading": "11. In APL, object an be referred to by their identifiers.",
      "text": [
        "The obvious candidates as natural-language equivalents of identifiers are proper names.",
        "However, although some logicians have discussed proper names, under the label singular terms, as if"
      ]
    },
    {
      "heading": "181 can offer no explanation of the syntactic distinction",
      "text": [
        "between nouns and adjectives, which serves no obvious semantic function; however, since the distinction appears to be universal in natural languages, my account of English semantic representations will incorporate it.",
        "(The solution to this puzzle may have to do with the fact that some adjectives are isyncat-egorematics in a way which nouns never are: a 'good actor' is not necessarily good though he is necessarily an actor.)",
        "convincingly that in deep syntactic structure proper nouns are preceded by the, and that proper and common nouns are syntactically quite parallel in the base.",
        "We shall take it that proper nouns correspond to properties for referents in just the same way as commoi nouns: London refers to the nearest §(London) referent to the hearer's focus, as the car refers to the nearest §(car) referent.",
        "(The problems of how the pairs of IEs in (8) and (9) succeed in referring to distinct referents will be answered in §12 and §15 respectively.)",
        "Clearly there is a distinction between names and common nouns in that the applicability of a name to an object is more 'arbitrary' than that of a common noun.",
        "But this distinction is gradient rather than all-or-none; e.g. a schoolboy's nickname, such as will be intermediate in arbitrariness (a boy called"
      ]
    },
    {
      "heading": "Mtz will probably be fat, but not all fat boys will be called",
      "text": [
        "Fatty), 12.",
        "A somewhat more complicated situation arises in connection with IEs involving genitive constructions.",
        "The 'basic' sense of the genitive is commonly taken to be possession, as in John's ear; however, the genitive often represents other relationships-4 as in John's father, John's 9,21111Ey, John's God, the orAVaof the problem, the density of the Ltail, etc.",
        "etc.",
        "Even in a ease where the genitive NP denotes a person and the head NP denotes an inanimate objpet, such as John's car, although on manyoccasions of use the NP will be paraphrasable as the 'Oar which John owns, the same NP will surely be used equally frequently in other situations in which the appropriate paraphrases would be the ear wnich we saw lessau miss ....i]aLalag_ John down, the car which John Items 527211.11E he'd like to 12,12,,y if he 2alz had the mom:, or other expressions of urely idiosyncratic and ephemeral relationships between the denotatum of the genitive NP and that of the head NP.",
        "The device of the topicon space permits a neat account of this situation.",
        "In an NP of the form A's B or the B of A (e.g. John's ear, the roof of the house), A will as usual pick out the nearest referent to the hearer's focus (say r ) having the properties corresponding to the lexical items of ]r, while the NP as a whole will pick out the nearest referent to r having the properties corresponding to the lexical items of M4 Thus in the ease of John's ear, John will pick out the nearest referent to the hearer's focus having the property §(John) and, if that referent is r4 9 John's car will pick out the nearest refer-\"...",
        "I ows wow.u.",
        "ent to Li having the property §(car).",
        "The latter referent need not be the nearest §(car) referent to the hearer's focus; if it is not, the car and John's car will have different reference",
        "reflexives, correspond to the terms labelled deic in APL: these include I, now here, etc.",
        "19 Deictics, like other IEs, pick out referents of the hearer's topicon; but their referents depend on characteristics of the speech act in which they are used, and are independent of the arrangement or properties of referents in the hearer's topicon.",
        "For this reason, deietics neve/' occur as the head of a genitive construction, and there are no phrases like *the eangE22212.",
        "you (with 's as genitive rather than short for is); you will refer to the same referent on a given occasion (namely the referent representing the addressee of the speech act -- the owner of the topieon, unless he is overhearing words addressed to someone else) whatever other referents are in the vicinity, so it would be otiose to modify a deictic with a genitive NP.",
        "person pronouns among the 'deictics'2 but logically they are of the same category.",
        "arrays of predicate followed by arguments, and the syntax of the predicate calculus does not permit one to occur in place of the other.",
        "However, in English, if e.g. John 12220t the car has the semantic representation 'f(al b)' (where f is the predicate bu and a and b are singular terms standing for John and the car), then presumably the semantic representation of:",
        "(10) It surprised Mary that John bought the car.",
        "will have to have 'f(a, b)' as one of the arguments of the predicate -- (10) will have to be represented as something like ie f(a, b), c PI where E is surprise and c stands – for Mary (tense is discussed later in this section).20 If 20Rosenbaum (1967) has shown that in deep syntax, before the application of a transformation called 'Extraposition', (10) has the normal subject-verb-object structure with that i.oliaknat rat car as subject.",
        "The need to permit propositions as arguments of predicates is discussed by Leech (1969: 25-6).",
        "In the 'semantic representations' given here, I arrange the predicate-symbol to the left of all the arguments, in order to clarify the comparison with standard logical notation.",
        "It is by a quite arbitrary choice, however, that formal logic writes 'f(al b)' rather than 'a f b', and when I define Aams below I 11E111 adopt the ordering winch more closely reflects the surface structure of English.",
        "at is a moot point within linguistics whether the deep structures of English sentences have the ordering subject-verb-object or verb-subject-object.)",
        "facts, as well as things, may be denoted by suitable linguistic expressions, then we may suppose that a topicon contains referents representing facts (propositional referents) as well as referents representing things (individual referents).",
        "We will suppose further that the referents in a topicon are linked in a graph structure in which propositional referents dominate n-tuples of (propositional or individual) referents, corresponding to the arguments of the respective propositions.",
        "Consider e.g. one who knows that someone called John bought a car: his topicon will contain a structure of the following form: In (11) nodes stand for referents, which I shall call 'r etc.",
        "(N.B.",
        "I shall always use 'r° for nodes of topicon",
        "states, as opposed to 'd' for nodes of phrase-markers of sentences).",
        "The lowest-level referents are unlabelled, while the higher-level referents are each labelled with an English word.",
        "in the case of proper names).",
        "To say that a referent, say £2' has the property §(car), is to say that there is some referent, in this case 1:5, which dominates the 1-tuple E2 and which is labelled car.",
        "A sentence acts as an EE for the establishing of propositional referents, as an indefinite NP such as a car is an EE for establishing individual referents.",
        "Thus, suppose P's topicon contains the structure of (11), together with a §(Mary) referent, say re, (that is, re, is dominated by a propositional referent r7 labelled Mary): then P's hearing (or reading) the sentence (10), i.e.",
        "It is.,I.Lryai..E.Led Mary that John bought the car, will create in P's topicon a new propositional referent, say Ea, labelled st^2.Ezriz., and dominating the 2-tuple (114, E6): P's new topicon-state will contain the structure shown as (12) on the next page.",
        "In (12), broken lines show the new structure created by sentence (10).",
        "Notice that propositional referents, like individual referents, may be referred to by pronouns; if E4 is close enough to P's focus of attention, the same effect will be achieved by the sentence: (13) It surprised Mary.",
        "The number of referents dominated by a given referent in a topicon will corrdlate with the label of the latter referent.",
        "An unlabelled referent will be an individual referent and will",
        "dominate nothing; a referent labelled with an n-adic predicate will dominate an n-tuple of referents.",
        "Thus a referent labelled with a noun will dominate one referent; a referent labelled with a verb taking subject, direct object, and indirect object will dominate a 3-tuple of referents; and so on.",
        "In natural languages the distinctions between th different arguments of a verb are shown sometimes by ordering, sometimes by prepositions (to :IOW or case endings (Johanni), etc.",
        "I assume that some individual referents represent points of time, and that one of the arguments of most verbs in natural",
        "languages is the time at which the action in question occurred.",
        "/mere a verb in the preterite occurs with no phrase overtly denoting a point of time, I take it that the nearest time referent to the hearer's current focus of attention becomes the respective argument of the new propositional referent: one would not normally say e.g. John bought the car unless the hearer can be expected to know what occasion one is speaking about.",
        "In other words, preterite tense picks out the nearest §(time) referent as he picks out the nearest (male) referent.",
        "McCawley (1971) has argued that preterite tense and pronouns have a common syntactic origin, a finding which renders my semantic approach all the more appealing.21 Although I assume time arguments for verbs, to avoid clutter I shall not include them on diagrams.",
        "That clauses may be used to refer to propositional referents either as IEs or as EEs, without the distinction being marked syntactically.",
        "sentence (10) (It eamojsta Mau that John lasmia the car) is equally appropriate whether or not the hearer already knows that John bought the car.",
        "Thus, if P's topicon contains the structure of (11) (p. 35), the phrase that John batiet the car in (10) will pick out 14 and create the extra structure of (12); but if P's topic on lacks E4, then the same phrase will create a referent labelled lita and dominating r1 and r2 (and a time referent) before the rest of the 21A verb in the perfect, as in John has bought the car, will act as an EE for a time referent, as a vero In th7preterite acts as an IE.",
        "These remarks might, however, have to be modified to handle American usage: one of the characteristics of American English is that it permits the preterite in circumstances where the perfect would be obligatory in British usage.",
        "sentence creates a node labelled faurke.2 dominating this new node, E6, and a time referent.",
        "The absence of syntactic dig-tinction between phrases establishing propositional referents and phrases identifying them can readily be explained.",
        "Either John bought the car at the time in question or he did not, there will never be two referents both labelled taz and dominating the same 3-tuple of individual referents, so if P's topicon contains (11) and he hears the phrase that John \"tomn the car then he knows that this must refer to r rather than 4 calling for the creation of a new propositional referent.22 If there were no distinction between the car and a car, on the other hand, he would have no way of knowing, on hearing the NP car, whether 1:2 or some new §(car) referent was intended.",
        "I take it that languages lacking definite and indefinite articles mark the IE/EE distinction for individual referents by some other syntactic devices.",
        "15.",
        "The graph structure into which an individual referent"
      ]
    },
    {
      "heading": "enters can be used to pick out that referent by means of relat",
      "text": [
        "ive clauses.",
        "Thus if the car refers to r then the IE: .2 (14) the man who bought the car will refer to the nearest referent, say rx, to the hearer's focus such that r has the property g(manT and such that some .x 22It is convenient to speak of a topicon's owner as 'knowing' facts about his topicon, just as it is convenient to anthropomorphize a computer program and speak of it 'knowing' various facts, these locutions are, of course, literally nonsense, but they could easily be replaced by longer paraphrases which did not commit category mistakes.",
        "referent labelled taz dominates a 3-tuple includiag rx, 1.21 and the nearest time referent.",
        "If P knows that the denota-tum of Li is a man (i.e. if his topicon includes, in addition to the structure diagrammed in (12) (p. 37), a referent labelled man and dominating ri), and if there are no tense problems, then (14), the man who bought the car, will refer to rl.",
        "However, note the distinction between restrictive and appositive relative clauses (cf. Bach 1968).",
        "A restrictive relative clause, e.g. who bought the car in (14), is part of an IE: it gives a property of the target referent.",
        "An appositive relative clause, on the other hand, as in (15), acts as an EE: (15) The man, who 122uOt the car, is old."
      ]
    },
    {
      "heading": "\"e\"\"\".. AOsm• 40%.\"",
      "text": [
        "In (15), the man acts as a complete IE; when (15) is input to a topicon, the man will pick out the nearest §(man) referent to the focus (say r ), and then the appositive relative will create a new refereat labelled buy and dominating r and the referent of the car, before the main clause createi-a referent labelled old dominating E2: The function of appositive relat-\",... ive clauses in natural languages is thus quite comparable to that of embedded asst clauses in APL.",
        "16.",
        "The principle that each sentence received by a hearer creates a new referent in the hearer's topicon suggests a natural way of reconstructing within the theory the notion of a focus of attention', which varies with the topics being discussed: we may define the focus of attention as the most recently-created referent at any given time.",
        "The graph structure associated with propositional referents offers a way of formal",
        "izing the notion of distance between referents in the topicon: we may define the distance between any two referents as the minimum number of edges (i.e. )4nes which link nodes) that must be traversed to get from one referent to the other.",
        "Thus, consider the sequence of sentences: 0:0 John122au a car.",
        "(ii) The car hit a man.",
        "(iii) He aalltd-tre police.",
        "Assume the hearer's topieon already contains a referent, say rl, with the properties §(John) and Rman).",
        "ArVer hearing sentences (i) and (ii) but before (iii) the hearer's topicon will include the structure of (16), with the focus at E.8 (the referent created by (ii)):",
        "(16) contains two referents to which he could refer, namely El and r ; E3 is one edge from the focus and r is three edges .3 Therefore the theory 1 away.",
        "to refer torather predicts that he in (iii) will be taken E3 than r19 and this prediction seems",
        "ized as who, which, or that and fronted.",
        "and Ile is realized as she in certain circumstances; adjectives have the verb be 2 Ad■www• supplied, or are moved in front of their noun with the relative pronoun th deleted; clauses outside an IE are given commas to mark them as appositive rather than restrictive relative clauses; etc.",
        "I shall not attempt to render explicit every detail of the relation between my semantic representations and superficial structures of English sentences.",
        "We may define the set JPL13 of states of the automaton *Egg as follows.",
        "Suppose MI is the finite set of English predicates, i.e. the set EZ u in (17).",
        "Then a pair (M., Foe) in which (i) 111_ is a semiforest24 over Pred such that 231 treat the distinction between he and ah2 as determined rather than as needing to be marked in Ee semantic representation: in the standard use of English pronouns (leaving out of account the special rules operating under contrastive stress), 14 is appropriate only if the intended referent is the nearest individual referent of all to the hearer's focus, not merely the nearest of the Rmale) referents.",
        "241 use semiforest as a generalization of the notion tree: 44 each node immediately dominating a length-n string is labelled with an n-adic predicate and each leaf is unlabelled, and (ii) Foe is a root of M, is a member of YEns.",
        "The function Int which determines how a sentence of this grammar moves a topicon from one state to another is specified by rules which associate subsets of the referents of the current topicon state with nodes in the structural description of the sentence, as in the APL case, certain nodes cause additions to the current state.",
        "We shall write 'Ref' for the partial function, specified by these rules, from nodes of the sentence into subsets of the topicon-referents; in the ease where a constituent refers (in our technical sense) to a referent, Ref will take the node dominating the constituent into the unit set containing that referent.",
        "The rules determining Intg are as follows: (see next page) En a semiforest is allowed to have more than one rout, and nodes are allowed to branch upwards as well as downwards.",
        "A semiforest over a vocabulary V is a triple (D, 8, pc) where D is a set of nodes, g is a partial function of iimediate dominance from D into stringsover D such that every node is dominated (not necessarily immediately -- dominate is the ancestral of simmedi ately dominate') by at leairEFTUOt (i.e. undominated node), and oGis a partial function of labelling from D into V. Nodes outside the domain of 8 are leaves, or terminaTnodeJ.",
        "Note that, by defining the range of a as containing strings, I have built left-to-right ordering into my aefinition; semiforests as defined here are istringsemiforests!",
        "rather than 'setsemiforests' in the sense of Sampson (forthcoming)."
      ]
    },
    {
      "heading": "2 n ,",
      "text": [
        "if, for some i (1 i n), NPi is realized as wh, then Ref(S) is the set of all referents r such that, for some referent r – x 0 labelled P and immediately dolinating some string of referents",
        "if (R8) If NP immediately dominates NP' S, then Ref (NP) = Ref(NP') if NP is not dominated by an IE node; otherwise Ref(NP) = Ref(NP')n Ref(S).",
        "(R9) If a Noun node realized as N is not dominated by an IE node then Noun creates an individual referent r and a referent labelled N immediately dominating r, and Ref(Noun) = frl; otherwise Ref(Noun) is the set of all §(N) referents in the topicon.",
        "(R10) Whenever a new refere4 is created it becomes he current focus.",
        "The ownerof the topicon diagrammed in (20), to whom (19) is addressed, is represented in (20) by r5: he is a man called Dick who has caught and eaten a fish, and who loves the denotatum of r who is a .171 woman teacher who has bought a horse.",
        "The denotatum of r is a man called John who has also bought .2 a horse and has eaten a fish which was caught by the denotatum 'Of r a man teacher called Tom, who loves the same woman as Dick.",
        "We now use rules R1-R10 to interpret the nodes of (19), beginning with the leftmost interpretable leaf (since the material on the left of (19) is what is heard first).",
        "Nouni is dominated by 1E, so by R9 Ref(Nouni) = iris r21 r57"
      ]
    },
    {
      "heading": "S ;",
      "text": [
        "hence by R1 Ref(NP2) is also frli r2, /153.",
        "Similarly Ref(NP3) is {r211 so, trivially, by R2 Ref(IE4) is frl.",
        "Ref(NP5) is 113, 1:61; by R3, since E3 is two edges from r2 while E6 is eight edges from r2, Ref(IE6) is fr3i (John's fish denotes the fish that John ate, on this oocasion).",
        "By R7, Ref(67) = frii (only Tom caught the denotatum of E3), so, by R8, Ref(NP8) = Iry r51 fril, i.e. fril, and by R2 and R1 Ref(NP9) is also {r1}.",
        "By R6i, Ref(NP10) = tril • Sil is not dominated by an IE node, so by R6iii 1...30 is created with the label bald, dominating ri, and by R10 the focus shifts to r30.",
        "By R8,"
      ]
    },
    {
      "heading": "You is a deictic which always refers to the referent repre",
      "text": [
        "senting the addressee, so Ref(NP13) = fr5i.",
        "Ref(NP14) = irl, E.171 Ref(NP15) = irk, r8i; both ri8 and 16,29 dominate pairs of referents the second member of which belongs to Ref(NP14), so, by R7,1221,(816) = fr21 r731 and by R8 Ref(NP17) (and hence",
        "Notice that, were it not for the appositive clause who was bald, the phrase that you loved the young teacher in (18) would be redundant.",
        "The initial focus was at 225 (the previous sentence had been You love the utaa&., teacher, say); the sentence The man who am:541 John's fish knew it would serve as well as The manwho sstjal John's fish knew that ualove the usumteacher or that you love her to create the referent rHowever, the appositive clause who was bald shifts the .31• focus to I.301 so my theory predicts that it in the sentence The man who aamat John's fish, who was bald, knew it will be taken to refer to r rather than to ri.e.",
        "to denote the -30 -25 4 fact of his baldness rather than that of Dick's loving the teacher.",
        "Intuitively this prediction seems correct.",
        "The relation SucEng, which determines which possible next stateisg can move to from any given state independently of En input, will correspond to the rules of inference in the semantic description of English.",
        "Thus, suppose there is a rule 'x fish & z catch x .-!px die' in English (i.e. suppose it is part of the meaning of the words fish, die, and catch that a fish dies if it is caught); then the topicon of (20) will be liable at any time to acquire a referent labelled die and dominating E3 or E6, since each of these have the property gfish) and occur as second argument of a referent labelled 4scatsg.",
        "Clearly, 4101, will be a non-deterministic automaton: the single rule of inference mentioned permits two alternative successor states for (20).",
        "Anyone with experience of constructing deductions in formal logic knows that there are typically a large (though finite) number of ways of continuing a given derivation; similarly, the rules of inference for a natural language will no doubt permit many,possible successor-states for any given state.",
        "If the process of moving through states",
        "under the control of the successor-state relation is to be the reconstruction within the topicon theory of the pretheoretical notion of thinkinfs, this characteristic seems desirable: we do not feel that human thought flows along deterministic channels.26 18.",
        "Although the effects of most changes of state in the cases of the machine-language discussed in §2 and of APL were confined to the automata themselves, in both cases certain state-changes were associated with action by the automaton on its environment.",
        "Thus, whenever an AM-state acquired an object named 0, a representation of the :property of that object wasP printed by the system on an output sheet of paper.",
        "We may imagine that action is linked to thought in this way also in the human case.",
        "Suppose some referent ro in a topicon represents the person who owns that topic on; then it might be that whenever, during a sequence of state-changes controlled by the successor-state relation, the topicon acquires a referent labelled assert and dominating ro in subject position and some propositional referent ri in object position, the owner of the topicon utters a sentence which asserts the proposition represented by rl.",
        "And, supposing 1:12 represents some person, say John, if a hit referent is created dominating (E0, r2) then 26I do not intend this paragraph to imply any position on the determinism/free-will issue.",
        "If determinism is correct, then there will presumably be laws deciding which out of the various successor states permitted by the rules of inference of its language a given topicon actually moves into at a given time.",
        "Such laws lie outside the scope of this article.",
        "the topicon-owner hits John.27 19.",
        "There are two obvious problems eonnected with the notion that the referents in a topicon, which are supposed to correspond to the entities of which the topicon-owner is aware and the propositions he believes, are created by input sentences.",
        "The first problem is that no allowance is made for the possibility that speakers are not believed.",
        "Thus, if the topicon-owner hears John, the denotatum of r2, sayIboutat a car yesteraz, then according to the rules I have laid down his topicon acquires a Rear) referent representing John's new car.",
        "But in practice, obviously the topicon-owner may choose to disbelieve John; what happens to his topicon in this ease?",
        "The second problem is that it is simply untrue that a person acquires beliefs about the existence of entities and the truth of propositions only by being told about them.",
        "I may come to believe that there exists a red car either because John tells me that he has bought a red car and I believe him, or because I see the red car; similarly, I may come to believe that John bought the red car either because he tells me so or because I watched the transaction take place.",
        "The car may subsequently be denoted by the phrase the red car, and the proposition about it by the clause that John bought the red car, irrespective of whether the referents refrrese the car and the proposition were created in response to speech or observation.",
        "22 These remarks may sound as if I am tregting humans as mindless robots -- 'automata' in the pejorative, deterministic sense -- but quite the reverse: remember that the referents whose creation correlates with the topicon-owner's actions are brought into being by the process we have identified with thinking.",
        "There is nothing disrespectful to our species in suggesting that our actina are controlled by our thought.",
        "The answers to these problems are related.",
        "I suggest that the sight of John buying a car is the kind of input to a person that has the effect on his topicon which I have so far attributed to the hearing of the sentence John lualvIt a car (or John 1221102I the car, if the car is one of which the topicon P.M\".",
        "dwoo 1•0%0■46 owner is already 'aware): in other words, this sight creates a referent labelled buy and dominating referents representing John and the car.",
        "On the other hand, hearing, say, Mary uttering the words John 1221.1E14 a car, or hearing John say I 122aet a car, has a more complex effect than I have been suggesting: it creates a node labelled assert dominating the referent representing Mary (or John) together with a new buy referent as already mentioned.28 I diagram the two cases in (21) and (22), on the next page.",
        "The part of the diagram in solid lines is the same in each case, and represents part of the hearer's topicon before the change of state.",
        "In (21) the dotted lines represent the effect on the topieon of seeing John buy a car; in this case, since the topicon owner sees the car, we may assume that he adds some further facts about it (such as that it is red) to his topicon.",
        "In (22) the dotted lines show the result instead of hearing"
      ]
    },
    {
      "heading": "John say I 122115111 a car. In this case, the referent represent",
      "text": [
        "ing the car will be dominated just by the ear node and the buy node, since the hearer has no independent information about it.",
        "28, AOSS (1970) and others have claimed that there is actually syntactic evidence that 42:2.4.0.",
        "1;am:id a has a deep structure something like I Bert tgat John boght a .29L.",
        "Ross's arguments are attacked by Fraser t1-970), Anderson (1970), Matthews (1972).",
        "My theory is intended to be independent of Ross's claim, although the latter, if accepted, would possibly make my theory seem more plaudible."
      ]
    },
    {
      "heading": "John bought a car after watching him buy it, rather than doubt",
      "text": [
        "ing the truth of what is said to' one."
      ]
    },
    {
      "heading": "Clearly there are enormous problems about how observations",
      "text": [
        "via the senses of a complex and continuous environment result in topicon changes corresponding to the input of a discrete sentence: why should my view of John handing over a cheque on the car-dealer's forecourt change my topicon in the way which corresponds to the sentence John bought a car, rather than any of the (surely) infinitely many other propositions which could be corroborated on the evidence of my current visual, auditory, etc.",
        "inputs?",
        "However, these problems are in no sense created by the topicon theory: these are already familiar problems in psychology and in the philosophy of science.",
        "(Cf. e.g. Hanson 1958, Gregory 1970.)",
        "Some process of deriving discrete propositional beliefs from continuous sensory input must occur, if observation is to be relevant to propositional knowledge at all.",
        "Since this process is known to exist independently of my theory, and since I can make no contribution to understanding it, I shall not consider it further.",
        "Once we agree to treat simple declarative sentences as creating propositional referents labelled assert, there is no special difficulty in handling sentences performing other illoc-ationary acts; e.g.",
        "Shut the door!",
        "will establish a command referent dominating referents representing speaker, hearer, and 56 the proposition that the hearer will shut the door."
      ]
    },
    {
      "heading": "Rules of inference may permit referents representing facts",
      "text": [
        "about the world to be created on the basis of referents representing facts about assertions.",
        "Suppose, for instance, that there is a rule of inference which we might state as",
        "referents representing the fact that John is truthful and the fact that John asserted that he bought a car will be able to move to a state in which the representation of the proposition",
        "Similarly, one can imagine that there might be rules of inference taking a topicon from the state created by the reception of Shut the door!",
        "to a state which causes the topicon-owner to shut the door.",
        "However, here we come close to the point at which my theory in its present state breaks down; I defer discussing this until §22.",
        "20.",
        "According to the theory I have sketched, English as a programming language is not dissimilar to APL, SNOBOL, etc.",
        "It resembles the latter in that its states consist of arrays of objects drawn from a specified class (although the precise structure of the arrays is different as between English and the artificial programming languages, as it is between the latter themselves), and in that the structural descriptions of its sentences include a subclass of nodes which pick out objects from the current state and another subclass which add new objects to the current state.",
        "English differs from APL, SNOBOL, etc., in lacking identifiers, and in using the property of distance between objects in a state in order to identify objects.",
        "My theory is certainly inadequate to account for many quite elementary facts about English and other natural languages.",
        "It may be that its deficiencies are too great for the theory to merit consideration.",
        "However, I would argue that it is Worth according my theory the temporary immunity from falsification to which Lakatos (1970: 179) suggests new research programmes are entitled, in eLse anyone can suggest modifications which preserve its goo pointswhile removing its defects.",
        "58 21.",
        "Before discussing the objections to it, let me mention a number of points to which my theory offers satisfactory solutions.",
        "In the first place, the theory is attractive simply because it offers an answer (evbn if.",
        "the answer eventually turns out to be wrong) to the question why humans should spend so much of their time exchanging the abstract structures called 'sentences': unlike cultivating, the ground or building houses, the utility of this occupation is not immediately apparent to the observer (Sampson 1972a, 1975=133-6).",
        "In my theory, the exchange of sentences, like direct observation *of the environment, helps humans build up a complex but finite 'map' 'model' of the world, a model which can be described in quite concrete terms and which controls the human's actions in ways which, again, in principle should be quite explicitly definable.",
        "The notion 'model' is of course a central one in the most influential current view of what language is for -- the view which explicates natural-language semantics in terms of 'model theory'.",
        "But the 'possible worlds' of model theory, unlike the topicons of my theory, are infinitely complex entities which can hardly be taken to represent characteristics of finite human minds.",
        "Furthermore, in the model-theoretic approach to natural language, the point about a true sentence is that it denotes the Fregean truth-value True (see e.g. buppes 1973); but if we think of the act of uttering a true sentence as the act of denoting the True, then it is quite unclear why people should utter sentences (let alone why they should utter one true sentence rather than another).29 [Footnote on p.59:1 59 In my theory, to utter a particular true sentence to a hearer is to make a particular change to his mental model of the world which gives the hearer more premisses from which to predict the consequences of his actions; thus, the more true sentences a person hears, the more rational his actions can be.",
        "My theory has Some more specific points in its favour.",
        "It explicates neatly some syntactic/semantic distinctions which seem rather pervasive in natural language bdt which have resisted other attempts at explication: the definite/indefinite distinction in noun-phrases, the restrictive/appositive distinction in relative clauses.",
        "Also it neatly explains the genitive construction.",
        "Accounts of the genitive which treat it in terms of possessioh (e.g. Suppes 1973: 382-3) are simply unfaithful to the facts; it seems that any relation between the denotatum of the head NP and that of the genitive NP in a genitive phrase can be used to understand such a phrase, but this makes sense only if, for a given hearer, there are a well-defined, limited set of relations between denotata -- as my theory asserts.",
        "My theory shows how it can be that definite descriptions succeed' in referring even though, contrary to Russell's theory of descriptions, the properties they mention are typically not Uniquely instantiated -- and, more remarkably, in the case of pronouns no properties of the denotatum are specifiea at all.",
        "My theory is also satisfying in its treatment of presuppositions.",
        "Although the fact that sentences typically embody presuppositions has by now received much discussion in linguistics, it has not been clear how the distinction between assert29*."
      ]
    },
    {
      "heading": "-.For objections to model theory as a means of explicating",
      "text": [
        "natural-language semantics and pragmatics, cf. Sampson (1974, 1975b), Potts (1975), Jardine & Jardine (1975)."
      ]
    },
    {
      "heading": "60",
      "text": [
        "ions and presuppositions should be represented in terms of syntactic or semantic descriptions.",
        "One proposal (cf. Fillmore 1969, Iakoff 1969, Horn 1970) is that the semantic description of a sentence should be a pair of objects, one element repre-sentinglMe proposition asserted and the other the proposition presupposed.",
        "This proposal is problematical, first because it seems arbitrary -- why should a semantic description of a sentence consist of a pair of propositions rather than one proposition or a 5-tuple of propositions?",
        "-- and, more seriously, because it is not clear that there is in general just one or even any fixed number of propositions presupposed by a sentence, as there is just one proposition asserted by a sentence.",
        "Thus, the sentence: (24) The car which John boughtis red.",
        "tv.",
        "presupposes that John bought11 a car, but also presumably that there is someone called John; John's car perhaps presupposes that John bought a car, but perhaps alludes to the fact that John was 'almost run down by a car, etc.",
        "etc.",
        "On my theory, failure of presupposition occurs when the input sentence is undefined for the current topicon-state.",
        "(24) will fail if there is no triple rl, E2, Es3 of referents in the current state such that El is §(John), is (car), r3 is labelled bug, and E3 immediately dominates (r1, E2).",
        "To say that (24) presupposes that John boxiVII a nar corresponds to the fact that if the latter phrase does not pick out any current referent by the rules 111-R10 which define the function Int ---Eng , then the sentence (24) will fail to create a node labelled assert -- i.e. will fail to make an assertion.",
        "Presupposition-failure is quite akj.n to the case in APL when a dscr node is realized as"
      ]
    },
    {
      "heading": "61",
      "text": [
        "an identifier belonging to no current object, or as a function together with a set of arguments falling outside the domain of that function; in the APL case, higher asst nodes will fail to create corresponding APL-objects, as the sentence (24) fails to create either a referent labelled red or one labelled assert in a topicon lacking £13.",
        "have argued elsewhere (1972b) that the reason why the Liar paradox does not render English inconsistent is that, as a matter of observable fact, a definite description in a natural language is never taken by naive native speakers to refer to a proposition asserted by the sentence in which that definite description occurs/ whether or not paradox would result if it were.",
        "This immediately raises the question why natural languages should have such a convenient property.",
        "My theory explains this simply: in natural languages, as in APL, interpretation of nodes takes place not simultaneously but sequentially, from the bottom upwards.",
        "At the time the referent of the NP what I am now tulag is to be located, the referent tcl be cl:eated by the sentence Cvihat I am now saying 'j false cAtmot yet have been brought into existence, so the possibility that the two might be identical does not arise.",
        "The theory also explains the puzzling fact that (25) Scott isjaentical to the author of 'Waverley'.",
        "can be a useful thing to say, while (26) Scott is identical to Scott.",
        "can hardly be so (Russell 1905: 108; cf. e.g. Linsky 1967: 26).",
        "pendently of any input.",
        "In the case of (25), however, if the hearer does not know that Scott is the author of 'Waverley', then the two NPs will pick out different referents ri, £2 in his topicon and will create an identical node dominating (ri, E2); clearly'no English rule of inference will do this.30 The composite nature of the denotation relation incorporated within my theory copes neatly with the fact that natural languages use exactly the same syntactic devices for discussing characters in fiction, and the like, as for discussing real entities.",
        "Anyone who has read Crime and Punishment will understand the sentences:",
        "(27) Raskolnikov killed Alena Ivanovna.",
        "(28) Alina Ivanovna killed Raskolnikov.",
        "and will agree that the former is true and the latter false."
      ]
    },
    {
      "heading": "3 °Strictly speaking, (25) will create an assert node,dom",
      "text": [
        "inating the referent representing the utterer OrTg5) and the identical node mentioned.",
        "We may assume that one of the rules ninbucr„, lays down that when two distinct nodes r, r' are domiafgerby an id.",
        "ntical node dominated by tme(iTh .hen the bearer comes to e leve hat the denotata of twophrases are identical) a new state may be formed in which r and r' are replaced by a single referent connected with all tEe referents to which either r or r' were linked.",
        "The fact that the referent of Raskolnikov will have the property §(fictional) while that of Richard Nixon has the property greal) is no mote reason to distinguish sentences (27) and (28) from sentences about Richard Nixon and Spiro Agnew syntactically than is the fact that the referent of Raskolnikov has the property (Russian) while that of Nixon has the property"
      ]
    },
    {
      "heading": "gAmerican).31",
      "text": [
        "31 The topicon theory thus seems to make some sense of the"
      ]
    },
    {
      "heading": "ontological views of Meinong (1913) and the early Russell (cf.",
      "text": [
        "Minsky 1967: 2-3).",
        "Meinong was troubled by the truth of e.g. (i) Pegasus does not exist.",
        "since, if Pegasus rekly does not exist, there appears to be nothing which (i) can be about, and thus (i) cannot make a true statement.",
        "Meinong therefore suggested (382-3, 491) that, although it was true of only some definite descriptions that their denotata actually existed, the denotatum of any definite description had quasi-existence, and this was enough for an entity to serve as the subject of a statement.",
        "In our terms, to 'denote a quasi-existent object' is to refer to a referent; to 'denote an existent object' is to refer to a referent having a denotatum.",
        "64.",
        "Finally, my theory suggests why there are three categories of Austinian 'speech acts'.",
        "Austin (1962) distinguished (not consistently, admittedly) between locutionary acts (speaking), illocutionary acts (doing something, e.g. giving an order, in speaking), and perlocutionary acts (achieving some effect, e.g. causing the hearer to perform an action, through speaking).",
        "(A number of current commentators on Austin would not agree with my presentation of his distinctions; however, I believe my discussion is faithful to Austin's own views in much of How to Do Things, with Words.)",
        "Why should there be just three categories of speech act, rather than two or four?",
        "Some scholars have suggested that the three-category analysis is incorrect; but I would support it.",
        "Consider the various consequences of speaking.",
        "At the first level, sound is produced; the production of this sound is a locutionary act.",
        "If the sound is a well-formed sentence of English which is defined by the input function for the hearer's topicon state, then that sentence"
      ]
    },
    {
      "heading": "produceil a specific effect on the hearer's topicon: the pro",
      "text": [
        "duction of this effect is an illocutionary act of the type defined by the label of the topmost new referent.",
        "Thus, if the sentence adds to the topicon a referent labelled assert, the illocutionary act is one of assertion; the 'misfiring' of an illocutionary act, as when a sentence syntactically in declarative form fails to make an assertion because one of its definite descriptions fails to refer, corresponds to failure to create an assert referent in the hearer's topicon.",
        "(We have seen that, when a subordinate node cannot be evaluated, processing of the phrase-marker stops.)",
        "The new topicon state may lead to other topicon states and, perhaps, to actions on the hearer's part, via the successor-state relation: the production of such effects may be identified with Austin's perlocution",
        "ary acts.",
        "My theory predicts that the illocutionary force of a given sentence should be well-defined and drawn from a finite class of illocutionary types (corresponding to the possible labels of sentential phrase-marker roots), while (since Ens is non-deterministic) the perlocutionary effects may be many and various; this seems to accord with Austin's discussion.32 22.",
        "Having presented my theory and discussed the respects in which it seems successful, I must now discuss its many inadequacies.",
        "Some aspects of English have been omitted from the present account simply for the sake of brevity; I believe there is no difficulty of principle in expanding my account to handle e.g. plurality, coordination with and, prepositions, adverbs, modality, and most subordinate clauses.",
        "But a number of English constructions present greater problems.",
        "These include, for instance, negation and universal quantification.33 For negation, one might think of treating not, as a monadic predicate whose argument is a proposition, so that, e.g., John did not 1,12z.",
        "a car would have the same effect on a hearer's topicon as John boupt a car, followed by the creation of a 32 In the framework of my theory, the locutionary/illocutionary distinction becomes rather parallel to the distinction between seeing and seeing as which exercised Wittgenstein and other philosophers.",
        "I see the duck-rabbit picture (cf. Hanson 1958) if light reflected from that picture stimulates my optic nerve I see it as a duck, if this stimulation leads to the creation of a (ITTA) referent in my topicon.",
        "33 The fact that these two constructions should both be problematic is no coincidence.",
        "We can handle sentences whose translations into predicate calculus involve existential'quantification, e.g. '0)(c(x) & b(11 x))' for a2ha 19,RaOad a car; is interehangegae wiTla so, if we could hgndre negiaon, we should be able to hanne universal quantification.",
        "not referent dominating the 19,112 referent just created.",
        "But riAn.v then it would make sense to speak of tdh..f oar which tIRta didn't busy, whereas in its commoner sense iskE (114 not 12.aly 9,25 does .",
        "not imply the existence of any particular unbought car.",
        "Again, one might think of interpreting e.g. All flirls le John as creating a 1;oye, referent dominating each pair (El, E2) of referents in the hearer's topicon such that El is igV21) and E2 is the referent representing John.",
        "But this would be quite inadequate: the sentence is about, not the particular girls the hearer knows of when he hears it uttered, but all girls whatsoever.",
        "A related point is that the theory does not handle the generic sense of definite NPs, noble beast.34 Other difficulties ,... with the distinction between 'factive' and 'action' interpretations of complement clauses (Mary's Saac,ft was unexpected v. tlar2,12, analRe.",
        "was 5pmfal), with trOh-functional connectives such as if, or, with conjunctions such as but V. and, alva2a001 v. because whose appropriateness depends on a given proposition constituting evidence for or against the truth of another, and with comparative and superlative constructions.35 34 One approach to these problems might involve introducing referents representing 'universals' (in the logical sense), so that for an individual referent to have the property (girl) or Rele hant) would be for that referent to be one of %heun-.",
        "ordered set of individual referents dominated by the referent representing the universal giEl or (in (in which case the notion of 'labelling' propoitional referents might be dropped).",
        "Then the propositional referent created by All EJ,0„._q_ love,John would link the referent representing the ulinZrYali-tkl the individual referent _for John.",
        "It remains to be seen whether an adequate solution can be produced along these lines."
      ]
    }
  ]
}
