{
  "info": {
    "authors": [
      "Evangelos A. Afendras"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C69-5601",
    "title": "Mathematical Models for Balkan Phonological Convergence",
    "url": "https://aclweb.org/anthology/C69-5601",
    "year": 1969
  },
  "references": [],
  "sections": [
    {
      "heading": "0.0 Phonological typologies, statistical counts and mathematical models",
      "text": [
        "The high structuring of phonology, the obvious classes of sounds, and the classes of their classes, have made phonological typologies a not too rare proposal.",
        "And even where typologies were not claimed as such, they were often implicit in the statements made.",
        "Both phonetic and phonemic, acoustic and articulatory, structural and non-structural, have all been proposed and have evoked discussions, critiques and applications.",
        "One can mention works by the Prague linguists culminating in the writings of, among others, Skalieka, Krmsky, and notably Trubetzkoy and Jakobson.",
        "In America, we have work by Greenberg, Hockett, Saporta and Voegelin as well as numerous followers and critics.",
        "Among other European contributions the acoustic typologies by Menzerath and Meyer-Eppler.",
        "0.1Mathematical models and mathematical (more precisely statistical) techniques of analysis have also been elaborated.",
        "Classification, distribution and frequency characteristics of various sound patterns have been a particular concern and represent the bulk of numerical phonological typologies, especially in the U.S.1 Often, again, the subject is classification of inventories and particular types (articulatory) of phonemes.",
        "Such is, for instance, Pierce's \"A Statistical Study of New World Consonants\", with counts of from the most to the least common consonants and classes of consonants in a great number of Amerindian languagLr A critique r.nd evaluation is found in Saporta 1957.",
        "We have probably the least structural end of the typological spectrum here.",
        "ature typologies There is another series of phonological typologies based on Jakobson's distinctive feature analysis and of course their Praguian and particularly their Trubetzkoyan background.2 2.0 The distinctive feature indices of Andrej Avram Typological indices derived from Jakobsonian features were proposed by Andrej Avram (1961),to study the distribution of distinctive features in the phonological system.",
        "Avram proposes the following indices (if I understand him well): P = number of phonemes T number of features D = number of features with which each feature combines Dmaverage distribution of distinctive features",
        "Avram also includes maxima and minima for Dm, Rm, Cm.",
        "2.1His typology was a good first step for studying systems via their feature distribution.",
        "However, there are cases, such as the following two hypothetical systems, different (but of undecided distance), which Avram's typology fails to distinguish.3",
        "Indices:",
        "It is obvious after inspection of the indices, that the two systems are not distinguished.",
        "Such aloss of information is characteristic of averaging."
      ]
    },
    {
      "heading": "3.0 Postovalova's valence and probability indices",
      "text": [
        "More complicated yet much more adequate measures of distinctive feature distributions were proposed by the Soviet linguist Postovalova.",
        "Although they were first used for the study of just one syste5typological applications were also suggested by the author.",
        "Postovalova's paper in Problemy Linguisti6eskogo Analiza examines the subject of feature distribution in a phonological system.",
        "Severalstatistics are defined:",
        "3.1simDle probability, i.e. frequency of utilization of a feature by the system for phoneme composition; the three possibilities,, 0 are considered separately.",
        "For feature a we have:",
        "3.2conditional probabilities, indicating how frequently different pairs of features characterize phonemes in the system, which is to say, given feature a for a phoneme what are the chances that feature b will combine with a in the same phoneme.",
        "Given feature a the probability that b will combine with it for the same phoneme is:",
        "where m' - number of phonemes with a and b n' = number of phonemes with a.",
        "3.3Finally, Valence is defined by Postovalova to disclose information on a feature's combinability with the other features and also information on the system as a whole (by including total number of features).",
        "where n = total number of distinctive features in the system.",
        "(The probability of a feature appearing combined with another",
        "feature would ben-1 if all features were equiprobable.)",
        "studies (Kazazis, Civ'jan, Birnbaum in several articles, Klagstadt, etc.)",
        "Balkan phonology has prompted many comments by Jakobson, Ivi6 and others, but to my knowledge only one systematic study (Havrnek, 1933) which actually drew heavy criticism (Malecki Stankiewicz), Interesting results were obtained by applying the above method to the study of several Balkan idioms.4 4.1But before discussing the results some of the basic problems encountered will be mentioned: The systems were compared against a maximal matrix which included all the features occurring in the population of the systems analyzed.s Any of the actual systems include a subset of this maximal set of features.",
        "In the final correlation each system was considered as having O's throughout for the features which it did not utilize.",
        "But O's were also indicative of impertinence of a feature for a given phoneme when the feature was distinctive for other phonemes in the system.",
        "Thus two kinds of concepts were collapsed as they both were represented by O.",
        "However, this has probably been rectified by the fact that features not used in a system have a 0 throughout.",
        "4.2Another actual handicap is the non-availability of distinctive feature descriptions for the vast majority of the systems compared.",
        "And even when available, they were often tinted by both the author's views and his preferences (e.g. Petrovici on Rumanian) or were out of different periods of theoretical development of distinctive features.",
        "In such cases, I took the liberty of normalizing the data by modifying the existing analyses (:the same method was followed throughout e.g. constructing branching-trees).",
        "In some other instances more than one solution were possible and for lack of data I kept the alternatives.",
        "Such systems appear in the figures as language X-1, 2, 3 etc.",
        "Other instances of numbered, multiple systems for one language refer to situations where such variety actually exists either stylistically or in social dialects (e.g. literary Makedonski).",
        "4.3Some features are very typical of vocalic systems either universally, or for the European languages, or, more specifically, for the Balkan languages.",
        "E.G. diffuseness, gravity, flatness, stress (simole occurrence is considered here, not combinations).",
        "Then, other features s.a. length, tone, nasality etc.",
        "are much less common.",
        "An ideal comparison should give different weights to such features.",
        "Sharing nasality, for instance, should be typologically very significant and two systems which do, should be classed as very similar.",
        "Conversely, if in a group of many languages which draw on 5-6 features to distinguish their vowels, but usually have 3 or 4, only one uses nasality this should be significant enough to set this particular language quite far apart.",
        "Now, in the correlation some factors take this into account but indirectly and not sufficiently.",
        "On the other hand since in reality (i.e. in the Balkan case) systems having \"odd\" features have also the \"common\" features, their typological distance is reflected in their having a higher number of features than the other languages,",
        "a fact reflected in the Valence matrix (:lower values for each cell).6 4.4 The introduction of a new feature usually results in a whole series of new phonemes, and actually the more numerous these phonemes the more important the new feature to the system.",
        "This is expressed by the product of number of distinctive features X number of phonemes total # of cells in the feature by phoneme matrix.",
        "An index incorporating this will reflect more qualities of the whole system.",
        "I propose therefore,tentatively,a modification of the valence formula to: ia(b) = Kr% V where K - # of phonemes This weighting makes the index much more sensitive to variadons in the number of features.",
        "4.5Higher order conditional probabilities can also be introduced,",
        "And so on until we have the P 1(n-2) (n-l) and the resulting .",
        ".",
        ".",
        "Valence.",
        "The results presented here are based on Postovalova's original formula.",
        "and Va(b) matrices calculated, and these final matrices were correlated and plotted using two different methods according to distance from each other.",
        "Gammon (1967) used a similar statistical technique for finding the similarity (conversely, the distance) between several Polynesian languages.",
        "In his case, the information was not in the form of matrices but in the farm of lists."
      ]
    },
    {
      "heading": "6.0 Results",
      "text": [
        "In the final plotting (see figures 1, 2, 3 and 4) several groupings can be discerned.. First, in the multidimensional scaling analysis, we can speak roughly of 3 groups: two form a sort of a nucleus in the center and the third (distributed in two subgroups also) surrounds it.",
        "On the external group we have Old Church Slavic, and close by Common Slavic.",
        "Then spread around mostly Serbo-croatian dialects, with some other idioms (e.g. 7-vowel Mom6ilovci Bulgarian,(9-Wasal) vowels Barile Tosk Albanian, 8-vowel Meglenitic, 7-vowel E. Bosnia Serbo-croatian).",
        "This group seems to include only dialects with the feature of tenseness.",
        "Except for the Albanian dialect, all group members are dialects located",
        "in the Central Balkans, i.e. we have here an areal grouping.",
        "Four out of six Albanian systems (all of the dialects within the geographic area of the Balkans) fall in one group and are closer to Macedonian and Bulgarian than to Rumanian.",
        "Greek dialects are quite diffused but stay within the two nuclear groups (this includes Classical Attic and Medieval Greek.)",
        "In the diameter method (figure 4), the most interesting grouping is that of all seven systems with the 5-vowel pattern (irrespective of additional features such as length - nasality - tone) on the same side of the initial bifurcation.",
        "Another subgrouping includes only systems which use flatness to distinguish a second series of back vowels (Rhodope Bulgarian, Kragova I Serbo-croatian, Bulgarian Sarakadan Greek, and Hrupilta Arumanian).",
        "Among the other interesting results are the following: contrary to Old Church Slavic and Common Slavic', which in both analyses stand apart, Attic Greek is classed ssvery similar to the bulk of the systems analyzed: in the diameter method through early joining of the branching tree, and in the multidimensional sealing by being located in the middle of the one of the two central constellations.",
        "This is all the more Intriguing in the light of the fact that in a similar statistical correlation (see figure 5) of some Balkan and other",
        "On statistical techniques, Pierce (1957, 1962), Saporta (1957), Spang-Hanssen, Herdan; in Eastern Europe extensive work, of which one can mention Krimsky who typifies some of the Prague research and Andreyev's group in the Soviet Union.",
        "For general discussions, see Birnbaum 1966, 1968, 1969, Edmundson 1967, Greenberg 1957, Horne 1966, Kutera and Monroe 1968, Plath 1963, Spang-Hanssen 1961-1964, Uspenskij 1966.",
        "For a historical-phonetiC typology see Grimes 1961."
      ]
    },
    {
      "heading": "SUMMARY",
      "text": [
        "In this study, the vocalic systems of a large number of Balkan - idioms (past and present) were analyzed in terms of Jakobsonian distinctive features.",
        "Various methods for comparison and scaling for similarity, as well as the problems encountered, are discussed and evaluated.",
        "Some questions of typology, such as distinctive feature weights, are revealed; suggestions are made for their future incorporation into typologies of this nature.",
        "It is a surprising fact in linguistic scholarship that no feasible, nor adequate manner for comparing phonological systems quantitatively has been devised.",
        "The notion of distinctive feature valence proposed by the Russian linguist, V. I. Postovalova, answers the need for such a feature distribution measure.",
        "The valence matrices for the vocalic systems of fifty-one Balkan idioms, as well as simple and joint probabilities of distinctive feature occurrence are calculated.",
        "Finally, the results are correlated and submitted to computerized factor analysis (various programs)."
      ]
    },
    {
      "heading": "APPENDIX A A LIST OF ALL BALKAN IDIOMS ANALYZED ALBANIAN",
      "text": [
        "1.",
        "Dushmani Geg 2.",
        "Scutari Geg 3.",
        "Berat Tosc 4.",
        "Mandres Tosc 5.",
        "Barile (Italy) Tosc 6.",
        "Vaccarizzo (Italy) Tosc BULGARIAN 7.",
        "Colloquial Standard B.",
        "Literary Standard 9.",
        "Bobol'evo 10.",
        "Erkee' (2) 11.",
        "Kolarovgrad 12.",
        "Momeiilovci 13.",
        "Rhodope GREEK 14.",
        "Standard; also most JUDEOSPANISH 15.",
        "Conservative SarakaCan 16.",
        "North including SarakaCian; some JUDEOSPANISH 17.",
        "Saraka.Can of Bulgaria I 23, AENDIN A (cont.)",
        "C,1:EEK (cont.)",
        "S. Sarakanan of Bulgaria II 19.",
        "Propontis Tsakonian 20.",
        "Thessalian, Thracian 21.",
        "Micrasiatic - Pontus 22.",
        "Micrasiatic - Pharassa 23.",
        "Micrasiatic - Silli, also TURKISH 24.",
        "Early medieval 25.",
        "Attic Classical MAKEDONSKI 26.",
        "Standard Literary I 27.",
        "Standard Literary II (Regional-Stylistic variant) 28.",
        "Standard Literary III (Regional-Stylistic variant) 29.",
        "Sucho 30.",
        "Bobon'ica I 31.",
        "Bobonica II (alternative phonemicization) 32.",
        "OLD CHURCH SLAVONIC 33.",
        "COMMON SLAVIC 34.",
        "COM:MON RUMANIAN"
      ]
    },
    {
      "heading": "APPENDIX A (cont.) RUMANIAN",
      "text": [
        "35.",
        "Standard 36.",
        "Banat 37.",
        "Crisean 38.",
        "Moldavian 39.",
        "Fraseri Arumanian 40.",
        "Other Arumanian of Albania I 41.",
        "Other Arumanian of Albania II (alternative phonemicization) 42.",
        "Hrupista Arumanian 43.",
        "Meglenitic"
      ]
    },
    {
      "heading": "BIBLIOGRAPHY",
      "text": []
    }
  ]
}
