{
  "info": {
    "authors": [
      "Karl Dieter Bunting"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C69-3001",
    "title": "Empirical Investigation of German Word Derivation With the Aid of a Computer",
    "url": "https://aclweb.org/anthology/C69-3001",
    "year": 1969
  },
  "references": [],
  "sections": [
    {
      "text": [
        "1.",
        "Introductory remarks and abstract",
        "The contribution reports results from about four years of research about German word derivation.",
        "The aim of the project is twofold: to find out facts about word derivation, especially about the productivity of \"open\" derivation patterns, and to test the utility of the computer as a tool in linguistic research of this type, the latter being planned as a demonstration for German traditionally minded philologists rather than for the international linguistic community with ample computational experience.1) In this paper, I will neither deal with formal aspects (formalisation) of the grammar used nor with programming, but only with linguistic and data-oriented aspects in the following order: terminology and linguistic notions; source of data; homography and derivation by \"zero-affix\"; derivation by affixation; further research.",
        "The research was conducted at the Institut fur Kom-munikationsforschung und Phonetik der Universitat Bonn.",
        "It was initiated by SCHNELLE and since 1965 supervised by UNGEHEUER.",
        "Programs and computational experience of the staff, especially KRALLMANN, were of incalculable value.",
        "The programs were run at the GroBdatenverarbeitungsanlage der Institute far Instrumentelle und far Angewandte Mathematik der Universitat Bonn on IBM 7090/1410 machines.",
        "Progress reports of various stages of the research are to be found in SCHNELLE/KRANZHOFF (1965 a,b), SCHNELLE (1966), BUNTING (1966a,h), (1969).",
        "2.",
        "Terminology and linguistic notions 2.1 Code",
        "Data processing calls for explicit notation, therefore the investigation is based on written German.",
        "The gra-phemic representation of language is henceforth called natural c o d e.2) The code employed here differs somewhat from normal German because the available computer code was to be used directly: only capital letters are allowed - thus the graphematic distinction between nouns and non-nouns in German is eliminated, which is of little importance in dictionary work, German \"Umlaute\" A,O,0 appear as AE, OE, UE respectively, and \"B\" is written SS.",
        "The explicit notation of grammatical statements about graphemic sequences, for example the classification of sequences as a noun or verb, is called the artificial c o d e; it will be introduced in detail later."
      ]
    },
    {
      "heading": "2.2 Status of definitions",
      "text": [
        "Two ways of defining language entities are employed.",
        "Language unit is used as term for intuitively won entities which are obviously present in at least the German language but cannot without elaborations and without severe restrictions be exactly defined.",
        "Word is the class of language units to be discussed.",
        "The word definition, which is often used for data processing purposes, stating that a word is \"the sequence of graphemes between two blanks\", rests solely upon graphematic properties 2)This means, that phonological aspects are a priori excluded and the spelling conventions of contemporary German as laid down in dictionaries are accepted as part of the investigated phenomenon, although these.",
        "conventions certainly deserve some critical attention and revision.",
        "- 3 - of words, which is adequate enough for a practical purpose but not for linguistics.",
        "It is the aim of the reported research to define some linguistic properties of German words.",
        "Linguistic u n i t, on the other hand, is the term for entities that are defined according to theoretical considerations about specific grammatical functions or something like a semantic meaning.",
        "Morpheme and a f f i x, for instance, are classes of linguistic units.",
        "They are written for data processing as a graphemic sequence in natural code and a number of markers in artificial code denoting those specific functions which are substantially represented by the graphemic sequence; e.g.: FEIND receives the marker A denoting that it is a \"kernelmorpheme\" (stem) of a masculine noun, or TAG is marked A and I which is to say that it is the kernelmorpheme of a masculine noun and of a transitive verb.",
        "Markers are explained later in detail.",
        "2.3 Grapheme sequence and linguistic units: allostatus and homography The linguistic units are said to be determined by certain grammatical properties and their representation by graphemic sequences (forms).",
        "If one set of properties is represented by more than one form, the forms are said to be a 1 1 of o r m s; they may be subclassified according to other properties and are then said to have a specific al lostatu s. Example: The verb-stem for the German equivalent of English \"to find\" is represented by the alloforma FIND - FAND - FAEND - FUND - FUEND; each of the allo-forms represents a certain allostatus governed - 4 - by inflexion.",
        "If, on the other hand, one form represents more than one set of properties, it is called a h o m o g r a h in respect to these properties.",
        "Otherwise it is called a h a p 1 o g r a p h. Example: FUND represents the participle form of a verb and the nominative singular form of a noun.",
        "Investigation of word-class homography was a major goal of the first stage of the project.",
        "2.4 Linguistic propertim to be used for defining units a. wordability': a graphemic sequence is said to be word-able if it either is identical with the sequence of a word or if it can form a word in combination with an inflexional ending.",
        "The latter are here taken for granted (cf. BONTING, 1966 b).",
        "b. word-class status: word classes, as employed here, can be defiad distributionally by adding a class of inflexional endings - including zero, if you wish, - to the \"stem\" of words; only the classes n o u n, verb, and adjective are treated.",
        "c. semantic meaning: graphemic sequences are said to either represent a semantic meaning or not.",
        "Nothing is assumed about the nature of the meaning.3)",
        "2,5 Definition of units Three types of units are defined, under the overall term m o r p h e m e, as graphemic sequences representing certain properties whose sequence of graphemes cannot be changed - except in cases'of alloforms - without disturbing the relation between form and set of properties.",
        "3)As defined here, semantic meaning does not include grammatical meaning like the inflexional status.",
        "- 5 -",
        "a. kernel morphemes (K): are wordable, have a word-class status, and a semantic meaning b. affixes (A): are not wordable, have a word-class status, and a semantic meaning c. inflexional morphemes (F1): are not wordable, have a word-class status and no semantic meaning 2.6 Word-strucutre in terms of morpheme classes",
        "Words (language units) can be described as a sequence of morphemes (linguistic units).",
        "A first rough description will yield at least three types of words, here introduced in their traditional terms and with a formula in terms of morphemes.4) a. simple words: consisting of one and only one kernel and perhaps on or more inflexional morphemes",
        "b. derived words: consisting of one and only one kernel, at least one affix, and perhaps one or more inflexional morphemes",
        "c. compound words: consisting of at least two kernels, perhaps one or more affixes, end perhaps one or more inflexional endings",
        "Certain aspects of simple and of derived words were investigated.",
        "They will be discussed after the data are introduced.",
        "4)The \"+\" denotes combination but not sequence in surface structure; parentheses denote possible presence of one or more morphemes.",
        "- 6 - 3.",
        "Data",
        "Starting point was a still unpublished dictionary of German words analysed into morphemic segments and punched on cards by KANDLER at the Sprachwissenschaft-liches Seminar der Universitat Bonn.",
        "When I had access to the material, it consisted of 117.370 uncorrected entries, most of which entailing morphemic segments of words and markers for categories like word-class, gender, transitivity, dialect, sociolect, foreign origin etc5).",
        "The entries and categories were copied from \"Deutsches Warterbuch\" by MACKENSEN, edition 1955.",
        "From KANDLER's material a list of 2.111 kernels - stems of simple words from classes noun, verbs with inlexio-nal ending EN, and adjectives, - was prepared, mainly by automatic data processing\".",
        "As to allostatus, only dictionary forms were available at that stage.",
        "Therefore various alloforms of the morphemes were added and marked according to their allostatus.",
        "The alloforms consist of what are usually called umlaut or ablaut-variations.",
        "Included were \"potential\" umlautforms; they are kernels that do not appear in inflexion but have vowels that permit Umlaut and in derivation often actually do have it, like, for example, BROT (bread) - plural BROTE - derivation BROETCHEN.",
        "The resulting list had 3.613 entries, marked as follows - 5)Grammatical markers about gender and transitivity were copied but so far neither checked nor actually used.",
        "They appear in the artificial' code list but not in the data statistics.",
        "6)The entries were sorted down to about 4000 by computer with the help of the grammatical markers; then mistakes, peculiar entries, unmarked dialectical words etc.",
        "were eliminated by hand.",
        "Reasons are given in BUNTING (1969).",
        "4.",
        "Simple words: word-class homography and derivation by zero-affix",
        "The list of 3.613 kernels was by computer sorted to discover word-class homography7).",
        "Results are shown in table 1.",
        "While being compared, homograph kernels were marked accordingly and deleted except for one grapheme sequence.",
        "The resulting list, which contained 2.759 kernels, was taken as basis for the study of derivations.",
        "Table 1.",
        "The table shows, that somewhat less than half of the kernels are word-class homographs.",
        "All three covered word-classes have about the same homograph-haplograph ratio.",
        "Of course, only lexicalised homography can be stated here.",
        "In German sentences, every verb or adjective can syntactically be used as a noun8).",
        "Homography according to gender or transitivity etc.",
        "is marked in artificial code, D or K respectively; homography according to semantic meaning like in SCHLOSS (\"palace\" or \"look for key\") is not treated.",
        "8)Cf. paragr.",
        "6 for discussion of syntactic and semantic aspects of derivation.",
        "- 8 Traditionally, what is here called word-class homography is called derivation or derivation by zero-affix.",
        "I would suggest not to speak of derivation in a syn-chronic description, because no direction of the derivation can be concluded from the data.",
        "Only with historical information is it possible to call TAGEN a verbalisation from TAG (Old High German there was only a noun taga but no verb), and on the other hand to call LAUF a nominalisation from LAUFEN (Old High German verb liofan with pretaerite Ablautform louf, which served as basis for derivation)9).",
        "So I propose to speak of word-class homography when lexicalised forms are concerned.",
        "The use of adjectives and verbs as nouns and of participles as adjectives in sentences ought to be treated in syntax as syntactical transformations and should be excluded from word-formation.",
        "5.",
        "Derivation by affixation The morphological structure of derivated words was given in the formula K t A (tA) (tFl).",
        "To gain precision, some of the following questions have to be answered: which kernels appear together with which affixes, and are there reasonable classification?",
        "What is the surface structure of the morphemes in words?",
        "What grammatical functions and - perhaps - semantic meanings are represented by the affixes?",
        "It was - and still is - our intention to collect as many data as possible, so that the derivation formulas can be rendered more precise through induction from the data evidence.",
        "The first step was to consider surface structure and reformulate the formula in terms of actually used prefixes 9)Only where ablautvariants are involved can a direction of derivation be safely concluded from synchronic data.",
        "- 9 - and suffixes.",
        "WEISGERBER (1958) proposed to use the Term A b 1 e i t u n g s t y p (derivative type or derivation pattern) for a kind of substitution frame where one or more affixes are the frame and kernels are to be inserted.",
        "For a beginning, seven derivation patterns were formulated.",
        "Reasons for choosing these particular types are not very sophisticated: we wanted to include nominalisation, verbalisation, and ad-jectivation as well as prefixation and suffixation just to try the usefulness of the computer as a word-producer.",
        "Into each frame, all 2.759 Kernels were inserted, which amounted to an output of 15.013 artificial \"words\".",
        "These were then checked against the KANDLER-MACKENSEN material for lexicalisation and marked as booked or not booked (a \"Y\" or \"-\" in artificial code in a certain column).",
        "The count of the results and the derivation patterns are shown in tabel 2.",
        "As an example, one page of output is copied in table 3.",
        "A more detailed analysis, which takes account of word-class information is given in table 4 .",
        "From the statistics of these tables and from a comparison of lexicalized and non-lexicalized forms, we hope to gain insight about derivation.",
        "To demonstrate how we plan to progress, the pattern / ...-UNG/ is discussed."
      ]
    },
    {
      "heading": "5.2 Lexicalization",
      "text": [
        "The artificial forms printed in table 5 were also found in the dictionary: of these, 36,7 % contain haplograph verbal kernels, 49,5 % are homographs which can be interpreted as verbal, 10,9 % are haplograph noun kernels, and 3,5 % haplograph adjective kernels.",
        "Deverbalization seems to be the predominat function of the suffix UNG.",
        "Of the 11 deadjectives, one is archaic (HARTUNG for - 10 - (february), one poetic (WIRRUNG from a novel by Fontane called \"Irrungen, Wirrungen\"), one a misclassified deverbative (HOEHLUNG from HOEHLEN), and the rest socio-lects spoken by hunters (ALTUNG, DICKUNG, SCHALUNG) craftsmen (DUENNUNG, HALBUNG, LASCHUNG, RAUHUNG, SCHALUNG with a different meaning), or sailors (STEILUNG).",
        "The 34 derivations from noun kernels can likewise be explained as historically old (e.g. ZEITUNG, WALDUNG), untypical)or misclassified (for details cf. BUNTING, 1969, 89 f.)."
      ]
    },
    {
      "heading": "5.3 Productivity",
      "text": [
        "The deverbative function of UNG is confirmed, when productivity is considered by looking through the non-lexicalized artificial words.",
        "To check my own judgement about the acceptability of various forms, I am currently trying to find ways how to get information from informants about these artificial words.",
        "So far, one general conclusion can be drawn from the various questionaires which I had filled in by students: there is wide disagreement about 1. dictionaries, 2. what individuals think is normal and ought to be in a dictionary, and 3. what individuals think is normal, acceptable, peculiar, unacceptable, unrecognized.1\" There are, however, some characteristic grammatical restrictions for acceptabillity, which parallel those of lexicalizations: accepted derivations are generally deverbative, and the verbs are predominatly transitive.",
        "That is no new insight; HENZEN has aid so in his \"Deutsche Wortbildung\" (1965, 181) in regard to lexicalized forms.",
        "However, if it holds true for the potential forms, as the test suggests, a general rule can be formulated, where a relation between transitivity of verbs and ability 10)cf. CHAPIN (1967) for evaluation categories to form derivates with UNG is stated."
      ]
    },
    {
      "heading": "5.4 Functional and semantic derivation",
      "text": [
        "Rendering the general formula for derivations more precise in terms of grammatical functions leads to a more general point: the distinction between grammatical and semantic aspects of derivations.",
        "MARCHAND (1967), 13-26) and (1966, 138) suggests the following distinctions and terminology: expansion: no change of word-class derivation: change of word-class functional derivation: no additional semantic content semantic derivation: additional semantic content.",
        "According to this terminology, GLEICHUNGvould be a semantic derivation (mathematical equation) whereas LOCHUNG (punching) would be a functional one; with UNG there is, however, a complication, because it denotes either the act signified by the verb or the result of the action.",
        "MARCHAND' s suggestions should be applied to empirical data; and they should be used in dictionary work, where only semantic derivations deserve an entry and functional derivation ought to be treated by rules, perhaps analogue to those covering purely syntactic transformations as suggested (cf. paragraph 4)."
      ]
    },
    {
      "heading": "6. Future plans",
      "text": [
        "There need be no discussion about the value of a computer for collecting and sorting empirical data.",
        "The approach of forming artificial words and then comparing them with a dictionary rather than collecting only dictionary material seems particularly suited for investigation of productive patterns of word formation.",
        "Therefore, we are planning to continue by",
        "- 12 - 1. processing more and more derivation patterns 2. sharpening the description in terms of grammatical and semantic functions 3. adding kernels; for example, the class of nonwordable (bound) kernels like GESS from VERGESSEN or SCHMITZ from VERSCHMITZT derserves attention.",
        "BUNTING, Karl D.:\"Zur Erzeugung deutscher %garter mit einem Computer\" in Forschungsbericht 66/5 des IPK der Universitat Bonn (1966 a), 34 Seiten \"Zur Flexion deutscher %garter mit einem Com-puter\" in Forschungsbericht 66/5 des IPK der Universitat Bonn (1966b), 19 Seiten.",
        "\"Morphologische Strukturen deutscher %garter: ein Problem der linguistischen Datenverarbei-tung, Diss.",
        "Bonn (Masch.",
        ")(1969) HENZEN, Walter:\"Deutsche Wortbildung\", 3. erg.",
        "Aufl.",
        "Tubingen (1965).",
        "MARCHAND, Hand: \"Review of ZIMMER: Affixal negation in English and other languages\" in Language 42 (1966), 134-142.",
        "5 \"Expansion, Transposition, and Derivation\" in La Linguistique 1 (1967), 13-26 SCHNELLE, Helmut:\"Zur Formalisierung der Wortableitung des Deutschen\" in Forschungsbericht 66/5 des IPK der Universitat Bonn (1966).",
        "und KRANZHOFF, J.A.",
        ": \"Zur Beschreibung und Be-arbeitung der Struktur deutscher %garter\" in Beitrage zur Sprachkunde und Informationsver-arbeitung, 1.",
        "Teil Heft 5 (1965a), 80-89, 2.",
        "Teil Heft 6 (1965 b), 65-87.",
        "CHAPIN, Paul G.: \"On the syntax of word-derivation in English\" in Information system language studies"
      ]
    }
  ]
}
