{
  "info": {
    "authors": [
      "William S. Y. Wang"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C69-7101",
    "title": "Project DOC: Its Methodological Basis",
    "url": "https://aclweb.org/anthology/C69-7101",
    "year": 1969
  },
  "references": [],
  "sections": [
    {
      "heading": "I.",
      "text": [
        "Dictionary on Computer, hereafter DOC, is part of an overall effort to harness an on-line computer for phonological research.",
        "For certain problems the linguist finds it necessary to organize large amounts of data, or to perform rather involved logical tasks -- such as checking out a body of rules with intricate ordering relations.",
        "In these situations a computer can be invaluable in that it forces the linguist to think through his problems with great precision and in that it can do certain jobs with a speed and accuracy not otherwise possible.",
        "The overt aim of DOG is to reconstruct the phonological histories of the major Chinese dialects.",
        "At a deeper level our interest is to find out more about how phonological structures change in general and the relation between these changes and the synchronic systems they lead to.",
        "To achieve these objectives we must attempt to account for oceans of data (the regular and irregular developments of thousands of morphemes in dozens of dialects).",
        "The hypotheses we posit, i.e., the reconstructed forms and the associated rules, are likewise numerous and complex.",
        "The project is further complicated by the tens of thousands of logographs which must be contended with, especially when we involve the rime dictionaries and the rime tables.",
        "These considerations lead naturally to the use of a computer in our work.2 To construct significant hypotheses and to generalize them beyond the confines of our data pool, to grasp the theoretical import of each discovery, clearly these are creative tasks that cannot be mechanized.",
        "Nonetheless a well-hewn tool, such as we hope to develop DOC into, can contribute substantially to facilitate these creative tasks.",
        "Of the many language families in the world, Chinese offers an ideal laboratory within which to study phonolo-Eical change for many reasons.",
        "Chief among these are two: (1) its unrivaled wealth of materials, and (2) its distinctive phonology and orthography.",
        "(1) The earliest extant materials date back to ca.",
        "1500 B.C.",
        "in the form of oracle inscriptions.",
        "We have a virtual time depth of some three and one-half millenia of literature.",
        "This literature includes not only such works as rime tables and rime dictionaries, but also extensive contributions from a tradition of philological scholarship that arose in the early Song and reached considerable sophistication in the Bing period.",
        "Indeed the view has been expressed that in China the methods of scientific reasoning were primarily developed in the hands -3-of the Qing philologists (as opposed to Europe where they originate in the physical sciences).",
        "Few language groups compare with Chinese with respect to this immense treasure of literature to work with.",
        "(2) By far the greatest bulk of the present knowledge of phonological change comes from investigations of Indo-European languages.",
        "It is not unlikely, then, that the present theories and methods are skewed in the direction of characteristics found in these languages.",
        "Studying a language family with a very different structure will help us balance this skewed perspective.",
        "Indeed Meillet must have had something like this in mind back in 1913 when, in discussing the comparative method, he wrote: \"Les rapprochements recoivent des confirmations utiles quand on peut constater que des concordances grammaticales s'ajoutent a la concordance du son and du sens – .Les langues qui, comme lee langues indo-europeenes – ont des particularites grammaticales attachees a certain mots se pretent donc mieux a la demonstration de l'etymologie que les langue ou tousles mots se conforment aux meme regles grammaticales.",
        "La difficulte qu'on eprouve a poser la grammaire comparee de certaines langues, notamment en Extreme-Orient, vient en partie de la.\" (p. 32).",
        "A language of the Chinese type is distinct in that (a) it has no inflectional paradigms and no morphophonemic alternations to speak of, (b) it has a very simple syllabic -4-structure, (c) it has tones, and (d) its orthography is logographic.",
        "These characteristics all have implications for research on phonological change.",
        "(a) Current views of diachronic phonology invariably emphasize the importance of paradigmatic analogy as one of the two major forces of phonological change (the other major force being phonetic).",
        "The formalization of analogy may be in terms of proportionality in a structuralist framework, or in terms of rule simplification within the context of generative phonology.",
        "It would be of considerable theoretical interest to examine these views with respect to Chinese, which has virtually no paradigms.",
        "In particular we would want to investigate what are the mechanisms whereby a change diffuses lexically3 in Chinese, where word classes are not related by morphophonemic alternations.",
        "An understanding of these mechanisms is crucial toward answering the question of whether phonological change is or is not phonetically actuated.",
        "(b) The simple syllabic structure of the morphemes and the even accentual structure of the sentences are also of special interest.",
        "Whereas many recurrent types of change outside of Chinese involve the reduction of consonant clusters into geminates, or the breaking up_of clusters by vowel epenthesis, or the reduction of syllabic elements due to stress shifts, these changes hardly occur at all in Chinese.",
        "The pervasive themes found in phonological",
        "-5-structures like Chinese are palatalization, dento-labialization, reduction of post-vocalic obstruents, and various complex interplays between the segmental syllable and tones.",
        "Research on phonological change now suffers from a severe lack of a systematic catalog of carefully documented changes.",
        "Given that X has the reflex Y, we need to know if this change was induced within the system or if it was actuated by another linguistic system; did X go directly into Y or were there intermediate phonemic stages; if each direct change was abrupt or gradual, phonetically and lexically.",
        "Only when a sufficient fund of such information is available can one successfully meet the challenge of phonetic and other types of explanations, and only then can phonology make the exciting transition from a descriptive effort into an explanatory science.",
        "DOC is designed to facilitate the gathering of this fund of information.",
        "The tones of Chinese have intrigued students of language for many years.",
        "They are of interest to phonological theory because they form a relatively self-contained subsystem in the sound structure that can serve as a relatively independent testing ground for the theory.",
        "The Chinese have had a categorical (though not physical) understanding of the tones of their language for well over 1500 years.",
        "During this period although the morpheme membership of the tonal categories has been relatively stable, the physical manifestations of the tones have undergone considerable -6-changes.",
        "Some of these changes, it appears, are intricately connected to segmental features.",
        "The investigation of these changes can contribute much toward our understanding of the interrelationships between phonation and articulation.",
        "Lastly, the logographic system of writing has certain unique implications.",
        "Since the logographs are much more distantly related to the sounds of the language than are the alphabets of the European languages, one can assume that they have exerted very little influence on the developments of the various sound systems.",
        "In other words, we have fewer cases of historical confusion due to spelling pronunciation to contend with.",
        "By the same token the logographs themselves have an amazing longevity, so that we can make many inferences about their phonetics for as far back as three thousand years ago.",
        "In sum, then, DOC is being developed as a powerful tool that will give phonological research a speed and precision not otherwise attainable.",
        "Its creative use can lead us to a deeper understanding of phonological structure and change on a quantitative basis.",
        "At present this too .",
        "is being developed within the context of Chinese, for the reasons outlined in the foregoing paragraphs.",
        "We expect that the methods we will have worked out will be largely applicable to the study of the phonology of any language group.",
        "Indeed, it is to be hoped that a field like -7Indo-European may one day be subjected to the rigors of this tool, and its results validated on a quantitative and objective basis.",
        "II.",
        "At present the primary source of data is the Hanyu.",
        "Fangyin Zihui.",
        "The 17 dialects reported in the Zihui are now available on Linc tape.",
        "Outside of the Zihui, we have the complete Kan-on, Go-on, Sino-Korean and portions of the Zhongyuan Yinyun.",
        "For a variety of reasons, such as ease of tape-punching, ease of proofreading and error-correction, and ease of writing of utility programs, the data are stored in several formats.",
        "These formats are related to each other by a set of supporting programs, as shown in Figure 1.",
        "The rectangles indicate data formats and the circles indicate supporting programs.",
        "The first stage in the data collection is the punching of paper tape on the teletype.",
        "A standard entry requires 24 punches:",
        "For proofreading and error correcting, the Dialect tapes may be converted into File tapes in the format of LI-LP 6 4as shown in Figure 3.",
        "In this format each entry has 20 characters (or half-words) which is the maximum number that can be displayed per line on the scope; each entry is further followed by a CASE (Lino code 23) that is disregarded by FILEDOC and a A (Line code 12) that shifts the display to the next line.",
        "So each entry_on the Linc tape is still 22 characters or 11 words long, even though only 20 characters are displayed.",
        "The spaces (Linc code 14) are converted into periods (Line code 20) for ease of reading.",
        "-9-LAP 6 D is modified from LAP 6 in two ways.",
        "The left margin is moved 4 positions to the left so that each entry will exactly fit one line.",
        "More space is allotted for files on both the systems tape and the file tape.",
        "According to my present understanding, each dialect tape is just about the size that a single file can accommodate.",
        "The uses of LAI 6 D files are obvious.",
        "We can use the full set of meta commands for such files as well as the editing conveniences.",
        "The AC tape contains the (aa-Yan information for the logographs as these are recorded in the Zihui, as shown in Figure 4.",
        "The use of this tape makes it possible to add this information to any dialect tape by matching the telegraphic codes via the ACCOD.6 program.",
        "The resultant AC-Dialect tape has the structure also shown in Figure 4.",
        "Notice that positions 17 through 32 correspond to 7 through 22 in entry structure of Dialect tape illustrated in Figure 2.",
        "As shown in (D)'in Figure 4, the number of dialect forms for each entry can be easily increased.",
        "Finally, it will be useful for certain problems to have the result in the form of a set of logographs.",
        "At present our computer can only give us the telegraphic code of the characters.",
        "With LOGOTAB we hope to be able to display the logographs on the scope and/or print them out by means of a special purpose computer.",
        "The 16 x 16 matrix representations of several thousand logographs have -10-already been designed by Susumu Kuno's group at the Harvard Computation Laboratory, cf. Hayashi, et al., 1968.",
        "LOGOTAB will be essentially a table lookup program that will translate telegraphic codes into those matrix representations.",
        "We are also giving thought to a similar logograph input device as that used by the Harvard group.",
        "Although the ideas for DOC were first conceived in 1966, it is only in late spring 1969 that the_project began to be operational.",
        "Several linguistic programs have been written for it, especially with respect to the seven Mandarin dialects.",
        "In Figure 5 we see a correlation program that quantifies the development of the Ancient Chinese tones into each of the Mandarin dialects.",
        "The points of greatest interest are of course with the cells which show the small number of exceptional developments.",
        "Are they due to borrowing from other dialects, residue from changes that have not yet completed their course, or are they due to the inception of new changes yet to be systematised?",
        "As the data pool becomes richer and richer with the ad(Ation of each new dialect or rime dictionary, it became increasingly obvious that our little laboratory Linc would not be able to cope with all the problems efficiently.",
        "Since the beginning of the summer, Tom McGuire of the Phonology Laboratory has helped us establish a remote terminal that connects to the CDC 6400 in the University Computer Center.",
        "Some of our materials have already been converted into magnetic tape that is compatible with that computer.",
        "An example of the new format of DOC is shown in Figure 6.",
        "cnange operates gradually across the lexicon is admittedly controversial.",
        "The hypothesis would not be acceptable to theorists in the Neogrammarian tradition, e.g., L. Bloomfield.",
        "However, as I argue in Wang (1969), there are good reasons for thinking that this is indeed how changes are implemented within narrow time spans, i.e., morpheme by morpheme rather than phoneme by phoneme.",
        "The proof of the hypothesis requires large scale studies of the sort exemplified by DOC.",
        "4.",
        "The Zihui has many draw-backs, as pointed out in Lyovin's review (1969).",
        "However, it is obviously the best set of core materials to start the project on.",
        "-21"
      ]
    }
  ]
}
