{
  "info": {
    "authors": [
      "Szabo Zoltan"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C69-5901",
    "title": "Some Problems of Word-Formation Within the Framework of a Generative Grammar",
    "url": "https://aclweb.org/anthology/C69-5901",
    "year": 1969
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Some -vroblems of Word-Formation within the Framework of a Generative Grammar Szabd Zoltan Word-formation has not yet received due attention in generative Lrammars, probably because it is an interim problem between that of the more-or-less clearly established morpho-phonological possibilities and the problem of the lexicon, which has not yet been worked out (rec,ardint; wor4formation see the productive attempts of Chomsky, Worth, Motsch, Volotskaia, Zimmer).",
        "Vy intention is tJ examine word-formation from a generative approach, i.e. to trace the possibilities of ,e-neratin, derivatives.).",
        "shall base my attempts on examples drawn from word-formation in hunt,arian, a lan6ua6e exceptionally rich in formative devices.",
        "1. i'ne first step is the separation of grammatical and lexicoloLical derivatives.",
        "This is necessary in order to show want belono to the lexicon and w;.at does not.To ma - ke this delimitation we can use a relatively simple transformation: derivation (D)----* syntactic construction (SC).11ere the meanin6 of the stem (SW) and.",
        "of the suffix (SuM) is carried by different elements of the syntactic construction, e.,.",
        "SW: predicate, word qualified Author rs address: Cluj str, Horea 31, ROMANIA",
        "If this transformation can be carried out, the derivative is grammatical; it does not belong to tfle lexicon.Derivatives of great semantic complexity ,Lave to ue made SI* subject to a complementary and at the same time also controlling transformation, (see my paper: La delimitation de la derivation lexicologique et grammaticale du hoagrois a l'aide de l'analyse transformationnelle.",
        "Carriers de lin7 guistique th6orique et Liopliquee, Bucarest, 11, 1965).",
        "2.",
        "The generating of grammatical or even of productive lexicolugical derivatives can be carried out with relative ease in the manner in which Ohomsky demonstrates ,:he formation of, e.g., the past tense.accordingly, the (une-racing of the derivatives in qLestion: dub 'throw' frequentative dob61 'theow one after the other'.",
        "And even if some difficult cases are to ue found, they can be resolved by applying a nomiaalization (or negation etc.)",
        "transformation at the appropriate stage of derivattion to the generalized Phrase-marker.",
        "The productive grammatical or even lexicolo•ical derivatives will not be entered in the lexióon (d.Chomsky: As-:.",
        ":;ects of tiletsvgy Theory of Syntax 184).",
        "3.",
        "Derivational processes discussed before raise no serious difficulties,' for generative grammars.But there are a lot of derivatives that create much more problems.Consi",
        "-3 – sider first of all the quasi – productive processes or the great variety of sporadic, single cases.le is pretty dif-eicult to find rules of any generality that produce derivatives of such types.There are, horever, some wide classes of cases with varying degrees of productivity which require non – adhoc soll.Cions.i:he solutions that Jan be achi eyed are characteristic of derivation us a t,ypical morpho-semantical process.",
        "ihe most difficult task is the generating of derivatives of great lexicological and morohological complexity, e.t.",
        "asztalos 'cabinet maker' (asztal 'table'+ – os: asztalos).",
        ".1n the case of such -,ords as usztalos one might seek syntactic jtstification for a transformational analysis from' an underlying constriction so that \"he is a table maker\" or \"he makes ',able\" would derived from the more general and more abstract structure \"he is the maker of F\" or \"he :nukes F\".This generation raises many semantical objections because the as\"talos is not a 'table maker', but a 'furniture maker' .The solution must be tnerefore in any case se.,,antical.",
        ":ihe generation of derivatives of this sort proceeds by expansion of the meaning of the stem: (1) E6i.",
        "icA table 4 chair bed+ ... furniture If and only if feri; where Ci is an optional object, f is the semantic distinctive feature 'furniture' and [0;1 -4– is the set of semantic distinctive.",
        "features of the obdect Li.Pherefore semantically [0i3--) [F], i.e. the set of the semantic distinctive features of any individual Oi can be replaced by the set of semantic distinctive fea-!",
        "tures of F.Accordingly IA is the expanded meanin6 of the SW (formulated with the help of rettifi S. Janos).",
        "(2) StU Sufi D 'furniture' 'maker' tfurniture–mukee There are still further possibilities.",
        "(Ale of the most important conclusions that can be drawn points out also the remote task: the generating of derivatives re4uires a semantical solution, such as can be worked out only by mathematical means."
      ]
    }
  ]
}
