{
  "info": {
    "authors": [
      "Janos S. Petofi"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C69-5001",
    "title": "On the Problems of Co-Textual Analysis of Texts",
    "url": "https://aclweb.org/anthology/C69-5001",
    "year": 1969
  },
  "references": [],
  "sections": [
    {
      "text": [
        "ABSTRACT My paper will deal with the theoretical and practical questions of the co-textual analysis of texts.",
        "The theoretical frame is contained by the chapters titled Introduction and Conclusion.",
        "My aim here is to show that the automatization of the text analysis expects the accumulated experiences of the general linguistics and the documentation-theory to be summed up in one coherent theory.",
        "The linguistics has to examine the problems of documentational thesauri, abstracting, indexing from its own aspect, and has to insert these means and methods of the documentation in the system of the text-analysis.",
        "The practical questions, certain concrete phases of the co-textual analysis of texts are dealt with in the chapters 2 and 3.",
        "In connection with certain steps we hope our demonstrative examples to contain solutions that will necessarily become simpler further on.",
        "Our aim was, first of all, the presentation of the complete process on a special type of text.",
        "Not all the parts of this complete process can be automatized yet.",
        "But the presentation will always happen with respect to the automatization.",
        "The next step should be the getting up of an analysing system that is built on the thesauristic elaboration of a relatively not big material.",
        "Then we have to solve such special problems of certain phases of the analysis that we could not even mention in this flow chart-like survey.",
        "Beside and after the theoretical analysis, only this can be the test of the usefulness of the system."
      ]
    },
    {
      "heading": "1. INTRODUCTION",
      "text": []
    },
    {
      "heading": "1.1 Before I should analyse the problems of the",
      "text": [
        "technical means and a method for the text analysis, I should like to touch a more general question.",
        "I wish to give a short sketch of the connection between the method to be presented and the problems of the modern theory of grammar and theory of documentation.",
        "To see the connections of the theory of grammar clearer, let us start from Figure 1.",
        "Every message is an element of a net of connections /context/, determined by time, geographical place, cultural environments etc.",
        "The linguistic analysis can set the only aim of discovering the inner /co-textual/ linguistic structure of the text with the demand of completeness.",
        "/It can dray, near to the contextual connections only to an extent that is made possible by the structure of the dictionary having used at the analysis./ The co-textual analysis and the immediate constituent and sentence analysis that are organic parts of it can be done on different ways.",
        "The Figure 1 shows the components of Chomsky's generative theory.",
        "Chomsky's generative process /0/ starts from the 'base component' /Bt.",
        "The deep structure of the sentence /\" comes to existence from the sentence-basis by filling it up with lexical elements in the 'lexicon' /Li.",
        "The surface structure /BSI comes to existence by using different kinds of transformations in the 'transformational component' IT/.",
        "/The situating of the lexicon and the transformational component in Figure 1 wishes to demonstrate that we may need turning to the lexicon even",
        " – 3 – during dispatching the transformations./ The proper interpretating components /Ins and Iss✓ provide the surface and deep structure with phonetic and semantic interpretations.",
        "These interpretations, to a certain extent, relate to the extralinguistic reality_ already.",
        "The phonetic interpretation contains the basic elements, too, necessary to the real pronouncing of the sentence, beside the phonological interpretation of the surface structure /PHTE = phonetic representation/.",
        "/The elements originating in the speaker's subjective interpretation either settle on or colour this./ The semantic interpretation beside the establishing of the semantic character of the immediate constituents trends to the discovering of logical connections independent from language, hidden behind the given verbal representation /LOSR = logical semantic representation versus LISR = linguistic semantic representation/.",
        "A part of the investigations included by the generative linguistic theory, like other examinations of other kinds, raise the possibility of generating sentences on another way, too.1 This generative process /G'/ starts from the universal logical construction /LOSR/.",
        "/The universal logical construction is a net of connections containing 'notion-words22./ We have to order a linguistic structure / DS/ reflecting the characteristics of the gi-ran language to this construction, and make a concrete sentence of it / SS/.",
        "The way of the sentence-analysis /A/ is of the opposite direction to both.",
        "At the aame'time, our sketched analysis is built on the theoretical basis, which has developed during the investigation concerning the problems of the generative processes /G and G2/ summarized.above.",
        "But, as the text analysis goes beyond the",
        "boundaries of the sentence, we have to widen the sentence-centered theoretical basis, as wel1.3 1.2 When analysing the notion 'text-structure' we can make a difference between the linguistic and the sound-textural components of the text.",
        "Both can be linearly and hierarchically patterned.",
        "The 'linear patterning' is a net of the recurrences of elements that interweave the whole text.",
        "The 'hierarchical patterning' means the way as the text as a whole is built up from the basic units of the structure through the levels of the composition units of different complexity.4 Of course there are texts where the sound-textural component is the organizer of the structure, but as it is not my intention to deal with this now, I shall ignore their problems at present.",
        "A great part of the essays dealing with text analysis considers making lists of the structural elements of similar construction.",
        "/It mostly remains among sentence-boundaries, so the use of a sentence-centered theory is enough./ These lists are undoubtedly essential characteristics of a text, but they reflect only one aspect of the text structure.",
        "This is what I called 'linear patterning'.",
        "The other --and, from a certain point of view more important aspect is the 'hierarchical patterning' of the text.",
        "Its analysis means much more problems.",
        "The problems are different, according to the types of texts.",
        "Even if we consider only the most homogeneous texts the scientific didactic prose or the prose told only in the third person not containing indirect speech 5 - even then we meet the following basic problem: grammatical /syntactic, semantic/ connections can be discovered only among sentences constructing the so-called 'paragraphs'.",
        "/At the same time, no one has yet established the types of it, neither has anyone described its rules as a system./ Among larger text-units than 'paragraphs' only such connections can be shown that are carried by the 'content structure'.",
        "Thus, beside the examination of the grammatical construction of the 'paragraphs' we also have to look for the means to help us to discover the connections of this kind."
      ]
    },
    {
      "heading": "1.3 On this field we can get the greatest help from the",
      "text": [
        "documentation theory.",
        "During the last ten years the documentalists wrought out means and methods that will probably prove useful at the analysis of not scientific texts as well.",
        "I should like to mention the thesaurus as the most significant means.",
        "The thesaurus as known is a notion-dictionary serving for the normalization of the indexing and searching language, which provides the different connections among the notions.",
        "It is this feature, that I think makes this means very useful to the linguistics for its own purposes, too.",
        "From the methods those of the abstracting and automatic indexing may become significant in our analysis.",
        "In the text analysis there is a 'great obstacle%that the texts are too extensive.",
        "For the sake of making the analysis easier and the hierarchical structure clear-cut it is both useful and necessary to replace the larger structure-units by their abstracts.",
        "When speaking of abstracting though abstracts made by statistic methods may mean a good help temporarily I do not think of",
        "statistic abstracts alone.",
        "In a broad outline these aspects of the documentation theory mean the wider frame, in which certain questions of the following analysing method can be examined."
      ]
    },
    {
      "heading": "2.",
      "text": [
        "ON THE MEANS OF THE CO-TEXTUAL ANALYSIS OF TEXTS In my opinion, the following means are necessary for the co-textual analysis of texts:",
        "1. a thesaurus including different sectors; 2. a rule-system working on sentences: a/ phonological, morphonological rules, b/ syntactic rules, c/ semantic rules to the linguistic semantic interpretation to the logical semantic interpretation; 3. a system of the syntactic-semantic rules of the basic composition units; 4. a rule-system of an abstracting process; 5. a rule-system of a process that is able to establish the thematic connections of a 'text' consisting of abstracts.",
        "In this chapter I want to deal only with the questions of the structure of the thesaurus in details.",
        "The work of all the rule-systems is based on the below-sketched thesaurus structure."
      ]
    },
    {
      "heading": "2.1 The thesaurus",
      "text": [
        "The base of the linguistic analysis has to be a thesaurus that unites the structures of the thesaurus made for the purpose of documentation and that of the lexicon having developed during the general linguistic - 7 - investigations.",
        "Such a thesaurus consists of two main parts: the sector of definitions and that of classifications.",
        "2.1.1 On the sector of definitions The headwords of the documentational thesaurus combining the structural characteristics of the more important thesauri5 -- contains the following constituents:",
        "/terms to which the headword is connected but not as a logical broader term or a whole/"
      ]
    },
    {
      "heading": "ASC associated terms ASCR associated reflexive ASCT associated to ASCE associated from EC empirically connected",
      "text": [
        "Let us demonstrate these constituents by the thesaurus-entry of two concrete words:",
        "Ed 'coast', 'island', 'harbour', 'ship', 'buoy', 'lighthouse',"
      ]
    },
    {
      "heading": "ASCR 'infinitude' ASCT 'waves', 'storm' ASCF 'gulls'",
      "text": [
        "/We shall deal with DEF that contains SF and CAT separately later./ We did not meet TR and SN in these examples, though in certain cases they may be necessary also in non technical texts; E.g. at foreign words and geographical names related to the given language archipelagus /archipelago/"
      ]
    },
    {
      "heading": "TR 'insular world'",
      "text": [
        "Duna SN 'the main river of Middle-Europe Stockholm /and Hungary/' SN 'the capital of Sweden' The DEF /the lexical definition/ has to contain the following informations on the base of the results of the linguistic theoretical research referring to a lexical unit /LU/:6 PHM phonological matrix SIT syntactic informations USC the undifferentiated syntactic category of the given LU USC-CE the undifferentiated syntactic category-chain marking the micro-syntactic structure of the given LU SIMS the ordered sets of syntactic markers of the given LU"
      ]
    },
    {
      "heading": "MOI morphological informations",
      "text": []
    },
    {
      "heading": "SYMS +common SYMS +transitive count !Abstract MCI MOI",
      "text": [
        "SEI physical SEI go with; or mental happen or do awareness at the same time",
        "the ordered sets of semantic markers of the given LU informations referring to the syntactic semantic conditions and consequences of the use of the given LU other informations: the origins the stylistic value, etc.",
        "of the given LU Thus the DEF of a lexical unit is of the following structure: erzes /feeling/ - 10 - Nevertheless, in the thesaurus we have to find not only the entries of the lexical units but those of the grammatical morphemes /GM/ as well.?",
        "The structure of the DEP of the grammatical morphemes is simpler, though it shows analogous features to the DEP of lexical units:"
      ]
    },
    {
      "heading": "PHM phonological matrix",
      "text": [
        "SYI USC the undifferentiated syntactic category of the LU that the given GM can join SEI the grammatic meaning of the given GM COI informations referring to the possible immediate context of the given GM 0TH informations referring to the rules that realize the morphonological changings that are connected with the use of the given GM Thus the DEF of a grammatical morpheme is of the following structure: e t PHM /e/ PHM /t/ STI USC N SYI USC V SEI possessive 'MI sing of 'past' personal suffix",
        "3. person",
        "singular COI root or COI root or formative formative suffix IN/ suff.",
        "suffix /V/ suff.",
        "I have dealt with the construction of the lexical entries and grammatical morphemes in the thesaurus above.",
        "I should like to add the following to what I told so far.",
        "1.",
        "By dividing the entry of the thesaurus into a lexical definition /LDEF/ and a thesauristic information block /a thesauristic definition: TDEF/, the verbally manifestating knowledge can be separated from the so-called encyclopedic knowledge.",
        "2.",
        "The syntactic informations of the lexical definitions naturally contain only the informations relevant in the given language.",
        "3.",
        "The semantic informations are demonstrated here only with a lexical definition.",
        "Of course this is not the form that I find suitable but the definitions written in a semantic metalanguage.",
        "4.",
        "The thesauristic informations are the results of a multihierarchical classification.",
        "For expressing them we have to elaborate the own 'notional language' of the thesaurus.",
        "5.",
        "The information FIELD points to the groups and fields into which the notion represented by the given word is classified.",
        "The group and field structure has to unit the virtues of the thematic classifications of the linguistic thesauri /Roget, Dornseiff/, the documentation thesauri and the illustrated dictionaries.",
        "But its realisation can be built only on a classification-theoretical basis.",
        "6.",
        "For reaching a satisfactory or suitable degree of the division of the informations BT NT and COL we have to analyse it further.",
        "7.",
        "When defining the informations ASC we of course think only of the minimal informations that can be defined with a relatively big probability.",
        "We wanted to mark the indefiniteness of the definition by selecting it from the others with a dotted line.",
        "- 12 - 2.1.2 On the sector of classifications",
        "The sector of classifications first of all has to contain an alphabetic index that includes all the roots of words and grammatical morphemes, with reference to the form by which they can be found in the sector of definitions, /Beside the basic alphabetic index we may construct an a-tergo list and a morphematic KWIC list as well.",
        "This latter one reflects the connections SF and ISF./ Different special classifications can be made on the basis of the lexical and the thesauristic informations.",
        "Lexical classifications: The classes of lexical units having the same syntactic categories,",
        "origin, The classes of derivative endings, suffixes, of the same character.",
        "Thesauristic classifications: groups fields of the elements having the same FIELD marker Different hierarchical and/or associative nets.",
        "We can provide the classifications with",
        "identificators,and we can order the identificators to the thesaurus entries.",
        "Thus the structure of a thesaurus-unit is as follows:"
      ]
    },
    {
      "heading": "2.2 As I have already mentioned, I do not wish to deal",
      "text": [
        "here with the other means of the co-textual text analysis.",
        "We can feel the character of their structure at the presentation of the way of analysing.",
        "Their real elaboration can be realized only on the basis of a profound analysis of the mutual influences of all the means.",
        "3.",
        "ON THE METHOD OF THE CO-TEXTUAL ANALYSIS OF TEXTS ."
      ]
    },
    {
      "heading": "3.0 The algorithm of the analysis",
      "text": [
        "The process of the co-textual analysis of texts consists of the following larger units:",
        "1. the segmentation of the texts, 2. the discovery of the grammatical structure of the individual sentences, 3. compiling of special text-thesauri, 4. the discovery of the net of connections of the communication units, the establishment of the basic composition units, 5. making the abstracts of the basic composition units, - 14 - 6. the thematic analysis of the text consisting of abstracts in more steps."
      ]
    },
    {
      "heading": "3.1 The segmentation of the text",
      "text": [
        "The notion of 'text' is interpreted on the basis of extralinguistic criteria.",
        "The text is always given to us.",
        "The 'whole' is obvious owing to typographical reasons or mainly in case of spoken texts the beginning and the end are determined another way.",
        "For illustrating the method of analysis we have chosen a written, 'simple narrative text', one that contains only communications in the third person and maybe direct speech in the first person beside.",
        "The boundaries of the segments of the primary classification as we have a written text are marked by the author's punctuation-marks.",
        "The text chosen to the demonstration and its informativ English equivalent are as follows.",
        "/The bigger line-spaces sign the boundaries of the paragraphs located by the author./ Madarak a tenger felett",
        "1.",
        "A Duna hidjen, a kor-latnal, emberek 611nak, feln5ttek es gyermekek vegyesen.",
        "2.",
        "Nezik a folyeifelett hintaz6 s a vizre le-leszdlld 3.",
        "A mi Duna-szakaszunkon is gyakran ldtom ezeket a viz felett lebegd ko-rellpiros cadre madarakat"
      ]
    },
    {
      "heading": "4.1 Neha magasra felcsapnak",
      "text": [
        "Birds above the sea There are people standing on the bridge of the Danube, at the rail, adults as well as children.",
        "They are looking at the gulls that are swinging above the river and flying down to the water from time to time.",
        "I often see these coralline-beaked birds hovering above the water at our reach of the Danube as well.",
        ", Sometimes they dart up high -15",
        "4.2 s a szemem elveszti 6 ket a keksegben vagy a kddben.",
        "5.",
        "De tenger felett is lettam sirelyokat.",
        "6.1 Akkor mar teliesre for-dult az id6, .2 sergem vilegitottak a sziget nyirfei .3 s az Eszaki-tenger ha-ragosan csapkodta grenit-partjait.",
        "7.1 Hajdm finn kik6t6b61 indult el .2 a a eyed archipelaguson haladt Stockholm ird-nyaban.",
        "-8.1 Amerre haladtunk, gyakran felbukkant egy-egy s6tet granitszigeI, .2 rajta feny6 es nyir, .3 feny6 es nyir., 9.1 Magenyos vilegit6torony emelkedett nemelyiken, .2 s el kellett hinnem, hogy ott ember dl.",
        "10.",
        "Ember, ski talen ldlek-ben is magenyos, mart azzé nevelte az tszaki-tenger nagy melabdja.",
        "11.1 Siiv61t6tt a fedelzeten a sal, .2 s a hullamok fenyeget6en csapkodtek a haj6 oldalet.",
        "12.1 Mel telikabdt volt rajtami .2 s egy ideig kUnn marad-tam a fedelzeten.",
        "13.1 \"My native land good night \"--ktldtem Byron szavaival a blicsiiszet az eltdnt finn partok fele, .2 pedig ne9 is sztil6f61demt61 bucsurtam.",
        "14.",
        "De olyan otthonos dr-and my eyes lose them in the azure or in the mist.",
        "But I have seen gulls above the sea, too.",
        "Then the weather had already turned to winter-like, the birches of the island shone yellow and the North Sea dashed against its granite coasts with anger.",
        "My ship had started from a Finnish harbour and was leaving for Stockholm on the Sweedish archipelago.",
        "Wherever we passed, there were often appearing some dark granite islands, with pines and birches, pines and birches on it.",
        "There were lonely lighthouses towering on some of them, and I had to believe that there was a man living there.",
        "A man, perhaps lonely in soul too, because that is what he was performed by the great melancholy of the North Sea.",
        "The wind was wuthering on the deck, and the waves threateningly dashed against the side of the ship.",
        "I had my winter-coat on already, and I stayed out on the deck for a time.",
        "\"My native land good night\" I sent farewell to the disappeared Finnish coasts with Byron's words, though it was not my native land I said farewell to.",
        "But I had such a homely -16zdsem volt ott, hogy azt dreztem: ha nem otthon, itt tudndk dlni, s %elan boldogan.",
        "18.1 Olykor egdszen a fed41-zetig s a kdmdnyig emelkedtek, .2 majd lesztilltak a hulldmok fold, .3 s a felcsap6 hideg hab meg-megfUrdette 6ket.",
        "19.",
        "Ninths uszdlya lettek volna a haj6nak, ugy ki-sêrtdk.",
        "20.",
        "Ritmus volt a lengdsdkben ds lebegdsUkben.",
        "21.1 Ndha felcsaptak a fejem",
        "fold, .2 bizonyosan azt vdrtdk, hogy megetessem 6ket.",
        "22.1 KU16n6s kdp lehettem: .2 egyetlen fekete utas a feddlzeten, .3 s k6rUl6ttem a vijjog6, rikacso16, k6vete16dz6 tajtdkfelldr siralyok.",
        "23.",
        "Ha 'pm kisertek volna, kibirhatatlanul nyomasz-t6 lett volna az a zord ds viharos tengeri ko-morseg.",
        "24.1 Milyen j6, hogy kisdrnek, .2 milyen j6, hogy ezt rikdcsoljdk: RA.",
        "mi orszdgunk a tenger.",
        "25.",
        "Sirdlyorszdg...\"",
        "feeling there, that I felt: if not at home, I could live here, and maybe happily.",
        "I have never seen Italy, I have always been drawn to the North by my desire... Gulls joined the track of the ship and I was looking at them.",
        "They were bigger than those at the Danube: seagulls.",
        "Sometimes they rose quite upto the deck and the funnel, then flied down above the waves, and the splashing cold foam bathed them again and again.",
        "They accompanied the ship as if they had been a tow-boat to it.",
        "There was rhythm in their swaying and hovering.",
        "Sometimes they darted up above my head, they probably expected me to feed them.",
        "I must have been a strange picture: one single black passenger on the decks and screeching, crying, peremtory, spray-white gulls around me.",
        "If they had not accompanied me, that severe and stormy sea mournfulness would have been unbearably depressing.",
        "How good it is, that they are accompanying, how good it is, that they are crying: \"Our country is the sea.",
        "The country of gulls...\"",
        "26.",
        "Csak az Ova?",
        "Only theirs?",
        "- 17 - 27.",
        "Egyszerre panaszos, magas maddrhang Ut6tte mega fUlemet.",
        "28.",
        "T6bb is.",
        "29.",
        "Olyan hang volt, amilyent 6sszel hallok, mikor nyirfdimraiszall egy faj-dalmasan sire kismaddrcsapat.",
        "30.",
        "Csupa csupa i, de 0 lyan szoiyoru hogy az ember szive megfdjdul t61a: 31.",
        "A hej6 felett szdllt et a sir6 maddrkdk csapata.",
        ".32.",
        "Almdlkodva ndztem uttinuk.",
        "33.",
        "Apr6 madarak a tenger felett dszakon?",
        "34.",
        "101t6z6madarak volnanak?",
        "35.",
        "Tudom, a fecake is, a setr-garig6 is, a gyurgyalag is, a falemille is valal-ja a nagy utat, ha 6szt6ne megsz6lal.",
        "36.",
        "De ezek taldn csak vonu16 madarak.",
        "37.",
        "S taldn a tried szigetvi-lag magyarazza meg nekem hogy miert talalkozom itt veli k. 38.",
        "Szigetr6l szigetre vando-rananak?",
        "39.",
        "S azdrt merik vdllalni az utat a haragosan z6 tenger felett, mert a szigetek nincsenek nagy tavolsagra egymast61?",
        "40.1 A siralyoknak dtelmara-ddkot dobnak ki a tengerdszek .2 s azok moh6n, szinte verekedve faljdk.",
        "41.",
        "De ki eteti mega tenger-nek ezeket az apr6 madareit?",
        "42.",
        "Csodalatos ez a tengeri",
        "Suddenly a plaintive, high bird-voice stroke my ears.",
        "More.",
        "It was a voice that I hear in autumn when a group of painfully crying little lairds flies on my birches.",
        "All i-s, all i-s, but such sad i-s, that one's heart begins to ache.",
        "The group of the crying birdies was flying over the ship.",
        "I was looking after them amazed.",
        "Tiny birds above the sea in the North?",
        "Would they be migratory birds?",
        "I know, the swallow, the yellow-bird, the bee-eater, the nightingale all shoulder the journey when their instinct calls them.",
        "But perhaps these are only moving birds.",
        "And perhaps it is the Sweedish insular world that explains me why I meet them here.",
        "Would they move from island to island?",
        "And do they dare to shoulder the journey above the angrily waving sea because the islands are not very far from each other?",
        "The sailors throw out scrapings to the gulls and they' wolf them eagerly, nearly fighting.",
        "But who feeds these tiny birds of the sea?",
        ".2 s ndha igy sir bennem valami, mint azok az apr6 drdga madarak sir-tak a fejem felett... shoulders the journey above the sea.",
        "Hopeful and elevating.",
        "Encouraging for one who has sorrow inside like me.",
        "Because I am carrying a dear deceased in myself amongst the yelling waves on the North Sea; and sometimes something cries in me just as those tiny dear birds cried above my head..."
      ]
    },
    {
      "heading": "3.2 The discovery of the grammatical structure a the individual sentences",
      "text": [
        "The discovery of the sentence-structure happens in the following steps.",
        "/The examples show only the result of the analysis./",
        "1.",
        "The morphematic segmentation of the sentences",
        "/its morphonological re-interpretation/: Duna-szakaszunkon... /at our reach of the Danube/",
        "The lexival entries are signed by the concrete chaines of letters and the syntactic categories written under them.",
        "During the substituting it can happen that there is a word in the text which is missing from our thesaurus.",
        "The lexical entry of it has to be made and inserted into the thesaurus.",
        "Paralelly with the substitution we can make the list of 'word forms' oP the analysed text.",
        "3.",
        "The discovery of the syntactic relations among the elements of the given surface structure:",
        "It seemes necessary in the surface, structure to sign the constituents of the 'topic-comment' relation.",
        "These signs have to be preserved in the deep structure as well.",
        "4.",
        "The discovery of the 'deep structure' belonging to the given surface structure -- incomplete in many cases.",
        "The deep structure is demonstrated by Figure 2.",
        "5.",
        "The linguistic semantic interpretation of the deep structure.",
        "At the linguistic semantic interpretation the",
        "definition of the semantic character of the immediate constituents happens on the basis of the syntactic and semantic markers of the basic word and the suffixes and/or postpositions.",
        "Eg.",
        "-on Duna-szakasz mar +place +place +time +time Duna-szakaszon nydron /adv.",
        "of place: /adv.",
        "of time: at the reach of in Summer/ the Danube/ In the analysed sentence: AdvP adverb of place 1 AdvP2 adverb of time Det/NP/VP deictic pronoun /one pointing out of the sentence/ AdjPi /S2/ local attribute AdjP2 /Si/ qualitative attribute The analysed sentence does not contain semantic incompatibility.",
        "6.",
        "The logical semantic interpretation of the deep structure.",
        "The snAlysed sentence expresses the following relations: /1/ where: Reach of the Danube /2/ P: belongs to when: often Pk: reach of we the Danube these",
        "/3/ where: above the /4/ \\ water P: has hovers r !IA: birds ty: birds beak",
        "ma: beak :coralline Notes: Roughly this succession is the way from through 188 to 0 on Figure 1.",
        "The steps from 3 to 6 happened on the basis of the lexical /thesauristic/ informations.",
        "The 'conditions' informations /COI/ of the substituted lexical units mean a certain prediction referring to the analysis both inside and outside the sentences.",
        "For example the compulsory complement of the verbs makes it possible to look for the compulsory, possible and not complement like adverbs algorithmically.",
        "The logical semantic interpretation of the deep structure makes it possible on one hand to establish the synonymity of sentences, and to discover the net of thematic connections of the text on the other."
      ]
    },
    {
      "heading": "3.3 The compiling of special text-thesauri",
      "text": [
        "After finishing the analysis of the sentences we compile different kinds of special text-thesauri.",
        "It is this point where the whole interpretation of the linear patterning of the text takes place on the",
        "level of sentences.",
        "I have dealt with its problems in detail at another place.",
        "Here I should like to mention only the things that are necessary for the further investigation of the analysing process.",
        "3.3.1 First of all we make the index of the word-forms of the whole text.",
        "After the word-forms this index gives the numbers of the sentences in which the given word-form occurs.",
        "We shall neglect the complete presentation of this index, we shall just give the list of the roots of nouns, verbs and adjectives that occur more than one time.",
        "/Considering the shortness of the text, a word occurring 'twice can be relevant as well./ The underlined numbers in the list sign the 'implicite' occurrences of the given words.",
        "/We speak about implicit occurrences when the given word is represented by pronouns, verbal endings or demonstrative pronouns.",
        "Their identifications with the proper words have to be done already at the semantic interpretations of the sentences -- and have to be signed by a special code in the continuously compiled text-dictionary./",
        "On the basis of this list especially in case of shorter texts we can also collect the list of the logical relations where the most frequently occurring nouns take place.",
        "3.3.2 Making a list of the conjugated verb-forms, personal pronouns, possessive pronouns, nouns with possessive personal suffixes reflecting the 'communicational net' of the text is an important analysing device.",
        "Let us see for example the list of the words referring to the first person:",
        "akkor /then/ 6 egyszerre/suddenly/ gyakran /often/ 3 8 majd /later/ 18 mar /already/ 6 12 mikor /when/ 29 mindig %always/ 15 27 neha /sometimes/ 4 21 45 olykor /sometimes/ 18 sohasem /never/ 15",
        "We have to make some of the special thesauri, but the making of others can become necessary because of the informations accumulated in the process of analysis.",
        "3.4 The discovery of the net of connections of the communication units 3.4.1 After the analysis of the sentences and the compilement of the special text-thesauri we have to discover the structure of the basic composition units.",
        "Let us see what is at our disposal at the beginning of this process.",
        "We have - the 'trans-segmentated' text; /On the basis of the sentence-analysis we can separate, on the one hand, smaller units in certain sentences of the author we have written the text in this form in the pages 15-19.-- and in certain cases we may contract two'sentences into one unit on the other.",
        "/ The units gained by the trans-segmentation are called not sentences but communication units already.",
        "- the system of connections discovered during the semantic interpretation among the separate communication units; - the list of predictions determined by the predicates of the communication units and not realized in the given communication unit; • the special text-thesauri.",
        ".4.2 Let us examine here the system of the connections discovered among the communication units.",
        "The list below contains the following conventions:",
        "X/Y X is a constituent ordered immediately under Y /if Y is the dominant sentence itself, we never write it out!, X/Z/ Z is an information that defines the character of the constituent X more precisely -- if it is a number it stands for the communication unit that contains X as its constituent, /after a semicolon we have the concrete lexical unit that keeps the communication units in question together!,",
        "The underlined constituent on the left of the signs =, :, or -: represent the proper paraphrase standing on the right.",
        "NP, VP, AdvP are immediate constituents, NPo the 'subject, is marked only by the",
        "The punctuation-marks after the numbers that sign the communication units represents the punctuation marks that end the communication units immediately preceding them.",
        "We presented some of the special text-thesauri in 3.3./"
      ]
    },
    {
      "heading": "3.4.3 As the compositional analysis starts with the",
      "text": [
        "analysis of communication units we build the definitions of the higher units on the notion 'communication unit' instead of the indefinited notion 'paragraph'.",
        "But we need some 'transitional notions', too: What we call a continous communicational chain /CC/ is the succession of communication units with predicates of first person in direct speech.",
        "/In this text we can see it in the communication units 12.2 - 15.2./ What we call a simple block of communication units /SB/ is the mostly continuous chain of the communication units all of which contains one explicate or implicite reference element pointing to the same 'reference'.",
        "This reference element has to be replaced Ay the 'referred element', if we want to give the semantic interpretation of the communication unit.",
        "What we call a complex block of communication units /CB/ is a mostly continuous chain of communication units connected by more 'referred elements'.",
        "/For example the communication units 16.1 - 21.2 form a SB, the communication units 8.1 - 10 form a CB./ We mean the basic units of the compositional structure the following way: We shall call basic composition unit /or composition unit of the first degree/ the structure unit that forms one thematic unit and that comes to existence immediately from the communication units.",
        "/This always has to consist of more than one communication unit.",
        "The 'orphan communication unit' inserted between the composition units forms a composition unit of the zero degree./ Generally: we shall call composition unit of the n degree the structure unit that also forms one thematic unit and that contains composition unit of the /n-1/ degree as well."
      ]
    },
    {
      "heading": "3.4.4 Both the simplex and the complex blocks of the",
      "text": [
        "communication units and the continuous communication chains sign some kind of the compositional dissection already.",
        "But the discovery of the compositional structure demands a detailed thematic analysis.",
        "At the thematic analysis the first fixed point is meant by the 'referential elements'.",
        "When the referential elements hold not many communication units together, this mostly means a smallest thematic unit, too.",
        "Inside the longer simple blocks and in the parts of the text outside the simple and complex blocks the discovery of the thesauristic connections among the lexical - 31 - units may help us to separate the composition units.",
        "The projection of the continuous communication chain on the text can mean a help of another kind.",
        "/The thesauristic connections separate for example the communication units 37-39 /thmaDar world' -- 'from island to island' -- 'islands'/ as one independent composition unit.",
        "The communication chain helps at the compositional segmentation of the text consisting of the communication units 11.1-15.2 /The simple block 13.1-14 is separated by 'the referential element 'Finnish coast', the 12.1-12.2 is separated from 11.1-11.2 by the Person 1./ After all we can separate the following composition units of the zero and first degree:"
      ]
    },
    {
      "heading": "3.5 The process of making the abstracts of the basic composition units",
      "text": [
        "The making of the abstracts of the composition units established in 3.4 happens in more steps.",
        "3.5.1 We take the composition units one by one and reduce their deep structures.",
        "This means that the constituents containing the moat frequent words and the ones expressing time are left,the other constituents of completive character /that is AdvP embedded in NP/S or NP/VP/S/ are omitted.",
        "/Naturally, the 'deep structure' means only the incomplete deep structures containing the really existing constituents of the original communication units here too./ Then we write out the surface representations one by one according to the formerly reduced deep structures.",
        "As the result of this step we shall get the following 'reduced text'.",
        "/Here we illustrate this process only with the composition units 1-11./",
        "1.",
        "There are people standing on the bridge of the Danube.",
        "They are looking at the gulls.",
        "2.",
        "I often see these birds at our reach of the Danube as well.",
        "Sometimes they dart up high.",
        "3.",
        "But I have seen gulls above the sea, too.",
        "4.",
        "Then the weather had already turned to winter-like.",
        "The birches of the island shone yellow.",
        "The North Sea dashed against its granite coasts with anger.",
        "-33",
        "5.",
        "My ship had started from a Finnish harbour and was leaving for Stockholm.",
        "6.",
        "Wherever we passed, there were often appearing some granite islands.",
        "There were pines and birches on it.",
        "7.",
        "There were lonely lighthouses towering on some of them.",
        "8.",
        "The wind was wuthering on the deck.",
        "The waves threateningly dashed against the side of the ship.",
        "9.",
        "I stayed out on the deck for a time.",
        "10.",
        "I sent farewell to the Finnish coasts.",
        "I had such a homely feeling there.",
        "11.",
        "I have never seen Italy.",
        "I have always been drawn to the North by my desire.",
        "abstract we have to examine the orphan blocks consisting of more communication units.",
        "We have to decide if they represent one or more composition units.",
        "This is relatively easy in cases like that of the composition unit 8.",
        "Its two communication units are connected in their content by the explicite thesauristic connection between the 'deck' and the 'aide of the ship' /both are the parts of the 'ship'/.",
        "/We can find an implicite connection as well: \"the wind was wuthering\", \"the waves threateningly dashed\", the question is to what extent can this be made explicite./ The communication units of the composition unit 11 are connected in their form by the pair of adverbs never - always.",
        "The composition unit 4 raises more problems already.",
        "We can establish from the 'birches of the island' -- on the basis of the later occurences of the 'island' and the 'birches' /see the composition unit 6/-- that it refers to the birches of sea islands.",
        "The 'granite island'",
        "'granite coast' connection also links the two last communication units, The 'turned to winter-like' stands only in a slack associative connection with the predicate 'dashed ... with anger', but it is not in any explicitely demonstrable connection with the predicate 'shone yellow'.",
        "Thus we could regard the second and third communication units as an independent composition unit.",
        "3.5.3 In the next step we substitute the separate composition units by one communication unit.",
        "This means the choice of one communication unit /preserving its original form!, or we have to generate a new one originally not occuring in this form.",
        "To be able to carry out these tasks we must have the complete analysis of the sentences of the reduced text.",
        "The choice can happen on structural and/or statistical basis.",
        "We choose for example the first communication unit from the reduced text of the composition unit 16 on structural basis because the others are such attributes of the NP of this communication unit that can be regarded the paraphrases of the attributes occuring inside the communication units /'plaintive' -- 'painfully crying' -'sad'/.",
        "We choose for example the second communication unit from the reduced text of the composition unit 11 on statistical basis because this is connected bylNorthl to the other communication units, while the first one is not connected by 'Italy'.",
        "We choose the last communication unit from the reduced text of the composition unit 18 on structural and statistical basis.",
        "Structurally because this is an",
        "answer to the first two asking communication units, and statistically because the last-but-one communication unit contains NP-s that occur only once in the whole text /'swallow', 'yellow-bird', .../.",
        "When we generate /that means a generating of G' type see Figure 1/ both the structural and the statistical aspect plays an important part.",
        "Actually it is enough to speak of generating only because the choice can be considered as a kind of generating by which we make a communication unit identical with one of the original communication units.",
        "Let us demonstrate the character of generating by making the abstract of the composition unit 10.",
        "The logical deep structures of the communication units of this composition unit are as follows:",
        "Considering the paraphrase-possibilities of the /1/ and /2/ and the tenses occuring in the text we can generate the following sentence from these: 'I said farewell to the homely Finnish coasts.' or, holding to the structure of the text: 'I sent farewell towards the homely Finnish coasts.' When we generate, of course it is not necessary to condense all the informations hidden in the logical representation into one sentence.",
        "After the generating or the choice of the sentences we get the following 'abstract-text':",
        "1.",
        "People on the bridge of the Danube are looking at the gulls.",
        "2.",
        "I often see these birds at our reach of the Danube as well.",
        "3.",
        "But I have seen gulls above the sea, too.",
        "4.",
        "Then the weather had already turned to winter-like.",
        "5.",
        "My ship passed from a Finnish harbour towards Stockholm.",
        "6.",
        "Wherever we passed, there were often appearing some granite islands.",
        "7.",
        "There were lonely lighthouses towering on some of them.",
        "8.",
        "The wind was wuthering on the deck.",
        "9.",
        "I stayed out on the deck for a time.",
        "waving sea because the islands are not very far from each other?",
        "20.",
        "The sailors throw out scrapings to the gulls.",
        "21.",
        "But who feeds these tiny birds of the sea?",
        "22.",
        "This recklessness that shoulders the journey above the sea is encouraging for one who has sorrow inside like me, because I am carrying a dear deceased in myself, and sometimes something cries in ne just as those tiny dear birds cried above my head.",
        "The informations condensed into the abstract of the literary text are relevant with different character than those of the scientific text.",
        "In this abstract every composition unit has to be represented by a communication unit."
      ]
    },
    {
      "heading": "3.6 The thematic analysis of the 'abstract-text'",
      "text": [
        "Among the communication units of the 'abstracttext' we can establish very few connections with the character of those in the primary text.",
        "Here it is rather the thesauristic connections that come forward.",
        "The analysis is similar to the one told earlier.",
        "Its result can be summarized as follows.",
        "The different thesauristic connections dissect the text of the abstract the following way:",
        "/In all the composition units except 1, 2, 4, 15, 16, 18 we can find 'the sea' itself or some element being in some thesauristic connection with it./ The 1-2 forms a composition unit of the second degree, its other connecting element is the 'gulls'.",
        "We can dissolve further the unit kept together by the 'sea'.",
        "The inner 'thematic connecting elements' of the so-gained composition units of the second degree are as follows:",
        "This compositional division will obviously meet the net of connections of the communication units of the primary text.",
        "The orphan composition units /3, 4, 8, 15, 22/ include the orphan communication units.",
        "The composition units of the second degree of the unit linked by the 'sea' form two composition units of the",
        "third degree: /5-7/\"+ /9-11/ : Person 1 /my ship', 'I remained', 'I sent', 'my desire/ /This includes the composition unit 8 as well./ /12-14/ + /16-19/: 'bird' /either as a primary lexical unit or as a semantic and-or thesauristic element/ /This includes the composition unit 15 as well./ The compositional structure of the whole text can be summarized the following way:"
      ]
    },
    {
      "heading": "Birds above the sea",
      "text": [
        "2.",
        "Does the sea belong only to the gulls?",
        "15 3.",
        "A group of the crying birdies was",
        "flying over the ship.",
        "16-19 4.",
        "The sailors feed the gulls, but who feeds the crying birdies?",
        "20-21 E. This recklessness that shoulders the journey above the sea is encouraging 22 In the hierarchical structure we cannot establish levels equally valid to every text, but we can define the 'depth-level' of every composition unit as the compositional distance measured from the 'whole of the work of art' as the broadest composition unit.",
        "/The upper",
        "line of numbers marks the depth-levels./ We can observe that we can meet eg.",
        "a composition unit of the first degree on the most different depth-levels."
      ]
    },
    {
      "heading": "4. CONCLUSIONS",
      "text": [
        "my paper dealt with the questions of the co-textual analysis of a special text-type.",
        "I tried to deliberate on the complete text-analysing process algorithmically.",
        "This process has parts than can be done automatically already now, and theoretically -- I suppose all its parts can be automatized.",
        "But the practical realisation expects the solution of different problems that are among the key-problems of the linguistics and the documentation.",
        "My intention was first of all to show how these are connected even at the analysis of the simplest text.",
        "Finally I should like to point to some problems of basic importance again."
      ]
    },
    {
      "heading": "4.1 Before the compilement of the thesaurus we have",
      "text": [
        "to select the so-called 'notion-words'.",
        "Mostly these 'notion-words' take place in the sector of the thesauristic definitions.",
        "We also have to elaborate the 'semantic basic language' by which the words of the given language can be semantically defined and we have to define the system of the relations to be used in the semantic definitions.",
        "/The 'notion-words' are words, the elements of the 'semantic basic language' are of feature character./ The thesaurus has to provide the interrelations among the different 'notion-words' and the different 'lexical units'.",
        "These interrelations are of one-many",
        "That is: more lexical units /IMEF/ may belong to one 'notion word' /TDEF/.",
        "4.2 The relation 'logical semantic representation' -'linguistic semantic representation' is an analogous equivalent of the relation 'notion word'--'lexical unit'.",
        "The 'logical semantic representation' /LOSE/ represents'logical connections'among 'notion words', while the 'linguistic semantic representation' /LISR/ represents 'verbal connections' among 'lexical units'.",
        "/In facts LISR is a deep structure that demonstrates the semantic character of the constituents, too./ In connection with these we have to define the systems of both the logical and linguistic connections, the way of their representation, the correspondence of these two systems of connections, and the way of passing over from one to the other.",
        "The interrelations are here interrelations of sets and they are also of one-many character.",
        "/That is: to a given set of elementary logical relations more different text-structures can belong.",
        "These text structures one oy one may contain only as many independent deep structures as the number of the elementary logical relations./ The efficacity of the analysing system first of all depends on the determinedness of the elements and relations of the logical and linguistic system and of the rules of - 41 - the matching between the two systems.",
        "4.3 We have to mention that the relation of the phonetic and phonological representation is also analogous to the above told one, though this analogy contains an oblique symmetry.",
        "This is a natural consequence of the continuous and one-way one-many relation passing from the logical representation to the phonetic one.",
        "4.4 From the point of view of the relation of the linguistic deep and surface structure the structure of the syntactic informations and the condition i informations of the LDEF is of primary importance.",
        "It is significant to approach it from the transformations.",
        "/That is, we have to examine to what extent the concrete lexical units occuring in a given deep structure determine the character of the transformations to be used./ 4.5 It is only a solution of the above sketched problems happening on a theoretical, basis forming one coherent system that makes possible the solution of such questions as - the automatic realization of the transitions from the surface structure to the incomplete deep structure, from the incomplete to the complete deep structure, from the deep structure to the logical representation, - the automatic discovery of the thematic connections built on the TDEF-s, - the automatic establishment of the in the given connection irrelevant elements of the deep structure, - the automatic realization of the reduction building on the irrelevant elements,",
        "finally - the automatic dispatching of the generating of G' character necessary during the process.",
        "4.6 The demonstrating material in the chapters 2 and 3 of my paper was a so-called 'simple narrative text'.",
        "When listing the problems we must not ignore the fact that the different kinds of texts will enlarge the above enumerated list of the basic problems with their special problems as well."
      ]
    }
  ]
}
