{
  "info": {
    "authors": [
      "L. Moessner"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C69-6212",
    "title": "Analyse Structurelle Automatique De Grouses Nominaux Anglais",
    "url": "https://aclweb.org/anthology/C69-6212",
    "year": 1969
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Analyse structurelle automatique de groupes nominaux anglais La connaissance precise des relations syntaxiques entre les elements d'unites linguistiques doit etre A la base de toute traduction automatique.",
        "Les Unites linguistiques de l'anglais sent tres souvent representees par des groupes nominaux.",
        "Ceux-ci sont caract:Crises rar =ear element ob2igatoire (noyau) qui doit etre un substantif.",
        "Le noyau peut etre accompagne d'un element facultatif (satellite).",
        "Nous proposons ici un modêle pour ',analyse des groupes nominaux anglais.",
        "Dans ce n::dêle nous trovaillons avec cinq niveaux de structure et del:x relations binaires, ''extension et la coordination.",
        "6elon les niveaux de structure sur les-quels les relations valent, nous distingons quatre classes de relations de ''extension et cinq classes de relations de coordination.",
        "Les deux t:it,s de relations sont sub-classifies.",
        "Le programme d'ordinateur pour l'analyse automatique des groupes nominaux anglais clue nous avons developpe est base sur le modêle ci-dessus.",
        "T1 comprend on 1,rogramme principal et 13 programmes subordonnes.",
        "Destines pour un ordinateur I:3147094, les programmes sant ecrits dans la langue FORTRAN II.",
        "Dans l'etat oil it est, lc Programme peut analyser des groupes nominaux dans lesquels les satellites precedent le noyau.",
        "Des 906 grouses nominaux qui ont eta analyses a titre d'experiment l'-rdinatueur nous a 'lyre L.702.2 d'analyses correci2,:s. L'analyse d'\"n groupe nominal demandait o,ao424 min.",
        "Les resultats de ''analyse automatique nous servent de point de depart pour des etudes plus poussées.",
        "Nous demandons:",
        "1.",
        "Quel role jouert-ils dans la traduction automatique?",
        "2.",
        "Quest-ce qu''ls nous disent sur la realisation des structures prevues dans notre modêle?",
        "Deux resultats paraissent ttre importants: 1.",
        "L'ordinateur decouvre des homonymies structurelles dont le lecteur hnmain ne s'aperooit pas; 2.",
        "La lergueur et la complexité d'un groupe nominal depend de 11•nit& linguistique dont ce groupe est un element.",
        "Automatieche Strukturanalyse engliecher nominaler Gruppen Kenntnie der eyntaktischen Relationen innerhalb lin-guistischer Einheiten einer Sprache jet eine der wichtigsten Voraueeetzungen fir die automatieche SprachAbereetzung.",
        "Linguistische Einheiten des Engliechen warden eehr oft durch nominale Gruppen manifestiert.",
        "Sie enthalten ale obligatoriechee Element (Tukleue) ein Subetantiv, das durch fakultative Elemente (Satelliten) erganzt werden kann.",
        "Wir schlagen ein Modell fir die Analyse dieeee Struk-turtyps vor, das 5 Strukturebenen ansetzt und mit den bi-ndren Relationen Erweiterung und Koordination arbeitet.",
        "Mit Hilfe des Konzepts Strukturebene unterscheiden wir 4 Typen von Erweiterungerelationen und 5 Typen von Koordi-nationerelationen.",
        "Beide Relationetypen sind unterklassifiziert.",
        "Diesee Modell let die Grundlage fur ein Maschinencrogramm zur automatiechen Analyse englischer nominaler % ,ruppen.",
        "Es beeteht aue einem frauptprogramm und 13 Unterprogrammen.",
        "Es jet in der problemorientierten Sprache FORTRAN II geechrieben und bewaltigt in semen jetzigen Zuetand die Analyse nominaler Gruppen, die nach links er-weitert sind.",
        "Die Testlaufe mit 906 nominalen Gruppen lieferten 87,32% richtige Analysen bei einer Analyeezeit von o,00424 min.",
        "pro nominale Gruppe.",
        "Die Ergebnieee der automatiechen Analyse werden ver-wendet zu Untersuchungen Aber",
        "1. ihre Brauchbarkeit fir die automatieche Sprach-Abersetzung, 2. die Realisierungsquote der im Modell enthaltenen StrukturnAgIichkeiten.",
        "Folgende Punkte sollen diekutiert werden: a. Entdeckung etruktureller Homonymien durch die Mae chine, b. AbhAngigkeit von Lange und Komplexitat nominaler Gruppen von Abergeordneten linguistiechen Ein-heiten"
      ]
    },
    {
      "heading": "Automatic Structural Analysis of English Nominal Groups",
      "text": [
        "Comprehensive knowledge of the syntactical relations between the elements of linguistic units is one'of the most' important prerequisites for automatic language translation.",
        "Linguistic units in English are frequently represented by nominal groups.",
        "They are characterized by their compulsory element (nucleus) which must be a noun; it can be expanded by optional elements (satellites).",
        "In our paper we propose a model for the structural analysis of inrush nominal groups.",
        "In this model we distinguish five structural levels and tv.o binary relations, expansion and coordination.",
        "According to the structural level on which the:; hold, cc postulate four types of expansion relations and five types of coordination relations.",
        "Both types of relations src sub-classified.",
        "A cachire :,rop:rah for automatic analysis of :unglish nominal groups is based oh this model.",
        "It consists of a main program and 1f) sub-programs.",
        "The whole complex of programs is written for a computer, model IEfi,704.",
        "The programming language used is F6ItT1ral% II.",
        "In its present stage it analyses nominal ,:roups in which the nucleus is preceded by its satellites.",
        "Tests have been made with 906 nominal groups.",
        "They yielded 87,52 of correct analyses.",
        "The analysis of one nominal group took 0,00424 min.",
        "The automatic analysis results have been further examined.",
        "'de asked two questions:"
      ]
    }
  ]
}
