{
  "info": {
    "authors": [
      "Adam G. Woyna"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C69-3201",
    "title": "Semantics of Prepositional Constructs in Russian: Tentative Approach",
    "url": "https://aclweb.org/anthology/C69-3201",
    "year": 1969
  },
  "references": [],
  "sections": [
    {
      "text": [
        "The primary objective of this paper is to describe an experiment designed to investigate the semantic relationships between the three basis components of a prepositional construct: the governor, preposition and the complement.",
        "Because of the preliminary nature of the experiment, only simple data processing equipment, such as the keypunch and the sorter, was used.",
        "The implementation of this approach on a larger scale, however, would necessitate the use of more sophisticated hardware.",
        "The described procedure uses Russian prepositions because, while working on this problem, the author was a research staff member of the Russian-English mechanical translation group at IBM's Thomas J. Watson Research Center in Yorktown Heights, New York.",
        "While the described procedure presents a tentative approach, which does not offer a solution to the semantic ambiguities within prepositional constructs in Russian, it does suggest a method for examining each basic component of a given construct in relation to other constructs containing different types of prepositions.",
        "The data used in the model was collected mainly from the Soviet",
        "compile data from other dictionaries.",
        "It was found, however, that the presentation and the classification of the data was not detailed enough for the purposes of this study.",
        "Therefore, only some of the prepositions not listed as such in the previously named sources were included in the experiment.",
        "The next logical step, using the arrangement of the data as shown below, should be the culling out of additional data in the case of Russian, and complete data in the case of other languages, from dictionaries, concordances and random texts.",
        "Following various sorting patterns, the results should then be tested through generative processes and checked against concorded 'real life' examples."
      ]
    },
    {
      "heading": "General Purpose",
      "text": [
        "As stated earlier, the purpose of the proposed approach is the establishment of patterns of semantic correlations between:",
        "1.",
        "Given Governor and its Preposition G(---+P (left boundaries) 2.",
        "Given Preposition and its Complement P4---+C (right boundaries) 3.",
        "Given Governor and its Preposition's Complement",
        "These relationships can be diagrammed as follows: where sn=sematic property of any value.",
        "-2-If either of the semantic components is found to exclusively govern the combination of the two remaining semantic components then it can be said that (G)sn + (C)sn h (P)sn = Sx where Sx = valid semantic pattern = sum of semantic properties of (G)sn(C)sn and (P)sn Where confirmed, the established semantic patterns can be incorporated into a lookup table as an additional tool for parsing procedures and for testing the validity of class-membership within prepositional phrases.",
        "Where not confirmed or where the patterns are not clear, further refinement of the semantic properties of the components in question must be carried out.",
        "Method of Procedure Following the classification provided by the Academy of Sciences Grammar (henceforth referred to only as Grammar), prepositional constructs were coded according to the grammatical category of their governors and the type of relationship (henceforth referred to only as TR) with their complement.",
        "The following governor categories were recognized: noun, verb, adjective, adverb, numeral.",
        "Next, the governors as well as the complements were coded ac",
        "Grammar.",
        "This semantic classification was, in a sense, arbitrary in that it did not attempt to map the universe of all Russian words in the five governor categories, but tended to accomodate only those complements and governors contained in the examples, and only if their characteristics seemed relevant.",
        "Thus, if the Grammar provided two examples of the usage of the preposition and the semantic properties of respective governors and complements were clearly identical, only one example was selected.",
        "The listing of these constructs in the five governor categories is given in Appendix I.",
        "Since, in an initial study of this type, a large number of semantic classes might tend to obscure the existence of possible patterns, an attempt was made to keep the number of these classes at a minimum.",
        "As stated earlier, the adoption of this approach in an extensive study of constituents within prepositional constructs would require more elaborate semantic mapping.",
        "For the purposes of this study, the total number of semantic classes for nouns was narrowed to 24, for verbs 9 and 6 for adjectives.",
        "(See Appendix II)"
      ]
    },
    {
      "heading": "The classification of numerals and adverbs as governors was aban",
      "text": [
        "doned when it was discovered that, according to the examples provided by the Grammar, their semantic values in no instance effected the selection of a complement of a given semantic category.",
        "Thus the",
        "examples citing the usage of cardinal, ordinal and indeterminate numbers such as \"RECKGA6KOH showed that these governors may co-occur with a complement of any class.",
        "A similiar phenomenon was observed in the behavior of adverbs acting as governors.",
        "It is possible that a more detailed study of a large corpus will reveal the existence of definite relationships.",
        "The total number of types of relationships (TR) abstracted from the Grammar was 42 (see Appendix III).",
        "Since some of the prepositions, especially of the compound or adverbial type, were not provided by the Grammar with an example of their usage in a given TR, the latter was derived through transformational cross-reference from the Academy of Sciences Dictionary, and when that proved impossible, it was supplied by the native speaker of Russian employed by the Project.",
        "In order to fit the data for each TR on a single IBM card (for easier sorting), those TRs which seemed somewhat redundant or insufficiently documented were combined and the total number of TRs was reduced to 11.",
        "Again, while the TRs were translated literally from the Grammar (admitedly, some of the translations seem a little awkward, e. g. 'togetherness'), the reduction of their total number was an arbitrary arrangement aimed at simplifying the overall research procedure.",
        "The manner in which the 43 TRs were reduced to 11 is shown in Appendix IV.",
        "The 11 TRs used in the final analysis are as follows:",
        "1.",
        "Attributive 7.",
        "TR expressing togetherness 2.",
        "Temporal 8. similarity 3.",
        "Spatial 9. deprivation 4.",
        "Purpose 10. conformity 5.",
        "Causative 11. comparison 6.",
        "Objective In addition to the aforementioned, the following data was added to every construct: 1.",
        "General relationship AA purely attributive",
        "AO attributive with objective shading OA objective with attributive shading etc.",
        "2.",
        "Relative position to the complement A PNP precedes the governor P PNP follows the governor X no preference 3.",
        "Structural restrictions X none",
        "I preposition-complement form an idiom in a given configuration preposition (e.g. Cori/)l 72.140c4 8 Heck0.1‘ko 614 )",
        "The final step consisted of sorting the cards on individual columns for detection of patterns."
      ]
    },
    {
      "heading": "APPENDIX I",
      "text": [
        "Preposition Noun Verb Adjective Adverb Numeral as as as as as governor governor governor governor governor To be read as follows: (grammatical and semantic categories of governor 4 semantic category of complement) = Type of Relationship"
      ]
    },
    {
      "heading": "Appendix I (cont.)",
      "text": []
    },
    {
      "heading": "Abstract",
      "text": [
        "Deverbal transitive intransitive capable of taking prefix NA 0 Adjectival Nouns designating TIME days, year, etc.",
        "events (birth, death, dinner, etc.)",
        "Measure preceded by a numeral Inner state, emotion V Phenomena of nature (rain, frost, etc.)",
        "Any inanimate, abstract or concrete noun -17",
        "Concrete (capable of being perceived and unmistakeably ascertained visually, e.g. tall, wide, white, etc.)",
        "1 Abstract (denoting state, density, mood, age, temperature, sequence, sensed olfactorily or aurally, etc.)",
        "1 2 Qualitative (good, bad, difficult, strong, etc.)",
        "3",
        "1.",
        "Spatial 2.",
        "Temporal 3.",
        "Causative 4.",
        "Purpose 5.",
        "Manner of action 6.",
        "Objective 7.",
        "General attributive 8.",
        "Similarity 9.",
        "Property",
        "The TRs are listed in order of their description in the Grammar."
      ]
    },
    {
      "heading": "APPENDIX IV",
      "text": []
    }
  ]
}
