{
  "info": {
    "authors": [
      "Irene R. Fairley"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C69-6204",
    "title": "Stylistic Analysis of Poetry",
    "url": "https://aclweb.org/anthology/C69-6204",
    "year": 1969
  },
  "references": [],
  "sections": [
    {
      "heading": "Stylistic Analysis of Poetry",
      "text": [
        "The Tricon program has been adapted as an aid to the analysis of syntax in poetry with the hope of identifying the dominant patterns that characterize a poet's style.",
        "The Tricon program (described in Concordances from Computers, S.M.Lamb and L.Gould, University of California, Berkeley,1964)has three active lines which this researcher has used for text, syntactic analysis (following a phrase-structure grammar) and a deviance indicator.",
        "The analysis for the three lines is charted and then transfered to punched cards.",
        "Abbreviated alphabetical symbols are used for the syntactic analysis (AP=adjective phrase) because of the program's 24 unit search limitation.",
        "The program provides the usual textual concordances for vocabulary, punctuation, etc., and a concordance of syntactic patterns and deviances.",
        "Syntactic and deviance lines may be concorded for identidal units (wholes: S-NPPP-P) or for partials (all tokens for S or P).",
        "The program has a wide range of subsort possibilities including multidimensional crossconcordance: subsorts are possible by left or right context on all three lines.",
        "It also has the advantage of a neat multi-line centered print-out, so that the searched token appears with left and right context; this is especially helpful in the analysis of poetry.",
        "The concordances provide totals of the number of tokens for each type as well as totals of the number of types and tokens searched.",
        "An extensive analysis of a poet's poems with the aid of a program like Tricon could provide the basis for a formulaic expression of the poet's syntactic habits, as a set of patterns and deviances.",
        "This kind of analysis might aid in the comparison of styles by identifying differences in their dominant and minor syntactic patterns and deviations (qualitative distinctions) and the variations in their frequencies of occurrence (quantitative distinctions).",
        "Such a formal treatment, of course, looks far into the future, and a program like Tricon must be regarded as at best a breaking of ground.",
        "This researcher is exploring Triconls possibilities in the analysis of e.e.",
        "cummings poetry.",
        "A substantial analysis of his poems using Tricon would help determine what syntactic patterns create the \"cummings style\" and to what extent and in what manner they are deviant from the standard grammar of English."
      ]
    }
  ]
}
