{
  "info": {
    "authors": [
      "Gina-Anne Levow"
    ],
    "book": "SIGHAN Workshop on Chinese Language Processing",
    "id": "acl-W06-0115",
    "title": "The Third International Chinese Language Processing Bakeoff: Word Segmentation and Named Entity Recognition",
    "url": "https://aclweb.org/anthology/W06-0115",
    "year": 2006
  },
  "references": [
    "acl-I05-3017",
    "acl-W02-2024",
    "acl-W03-1719"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The Third International Chinese Language Processing Bakeoff was held in Spring 2006 to assess the state of the art in two important tasks: word segmentation and named entity recognition.",
        "Twenty-nine groups submitted result sets in the two tasks across two tracks and a total of five corpora.",
        "We found strong results in both tasks as well as continuing challenges."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Many important natural language processing tasks ranging from part of speech tagging to parsing to reference resolution and machine translation assume the ready availability of a tokenization into words.",
        "While such tokenization is relatively straightforward in languages which use whites-pace to delimit words, Chinese presents a significant challenge since it is typically written without such separation.",
        "Word segmentation has thus long been the focus of significant research because of its role as a necessary preprocessing phase for the tasks above.",
        "However, word segmentation remains a significant challenge both for the difficulty of the task itself and because standards for segmentation vary and human segmenters may often disagree.",
        "SIGHAN, the Special Interest Group for Chinese Language Processing of the Association for Computational Linguistics, conducted two prior word segmentation bakeoffs, in 2003 and 2005(Emerson, 2005), which established benchmarks for word segmentation against which other systems are judged.",
        "The bakeoff presentations at SIGHAN workshops highlighted new approaches in the field as well as the crucial importance of handling out-of-vocabulary (OOV) words.",
        "A significant class of OOV words is Named Entities, such as person, location, and organization names.",
        "These terms are frequently poorly covered in lexical resources and change over time as new individuals, institutions, or products appear.",
        "These terms also play a particularly crucial role in information retrieval, reference resolution, and question answering.",
        "As a result of this importance, and interest in expanding the scope of the bakeoff expressed at the Fourth SIGHAN Workshop, in the Winter of 2005 it was decided to hold a new bakeoff to evaluate both continued progress in Word Segmentation (WS) and the state of the art in Chinese Named Entity Recognition (NER)."
      ]
    },
    {
      "heading": "2 Details of the Evaluation",
      "text": []
    },
    {
      "heading": "2.1 Corpora",
      "text": [
        "Five corpora were provided for the evaluation: three in Simplified characters and two in traditional characters.",
        "The Simplified character corpora were provided by Microsoft Research Asia (MSRA) for WS and NER, by University of Pennsylvania/University of Colorado (UPUC) for WS, and by the Linguistic Data Consortium (LDC) for NER.",
        "The Traditional character corpora were provided by City University of Hong Kong (CITYU) for WS and NER and by the Chinese Knowledge Information Processing Laboratory (CKIP) of the Academia Sinica, Taiwan for WS.",
        "Each data provider offered separate training and test corpora.",
        "General information for each corpus appears in Table 1.",
        "All data providers were requested to supply the training and test corpora in both the standard local encoding and in Unicode (UTF-8) in a standard XML format with sentence and word tags, and named entity tags if appropriate.",
        "For",
        "all providers except the LDC, missing encodings were transcoded by the organizers using the appropriate Python CJK codecs.",
        "Primary training and truth data for word segmentation were generated by the organizers via a Python script by replacing sentence end tags with newlines and word end tags with a single whites-pace character, deleting all other tags and associated newlines.",
        "For test data, end of sentence tags were replaced with newlines and all other tags removed.",
        "Since the UPUC truth corpus was only provided in white-space separated form, test data was created by automatically deleting line-internal whitespace.",
        "Primary training and truth data for named entity recognition were converted from the provided XML format to a two-column format similar to that used in the CoNLL 2002 NER task(Sang, 2002) adapted for Chinese, where the first column is the current character and the second column the corresponding tag.",
        "Format details may be found at the bakeoff website (http://www.sighan.org/bakeoff2006/).",
        "For consistency, we tagged only ”<NAMEX>” mentions, of either (PER)SON, (LOC)ATION, (ORG)ANIZATION, or (G)EO-(P)OLITICAL (E)NTITY as annotated in the corpora.1 Test was generated as above.",
        "The LDC required sites to download training data from their website directly in the ACE2 evaluation format, restricted to ”NAM” mentions.",
        "The organizers provided the sites with a Python script to convert the LDC data to the CoNLL format above, and the same script was used to create the truth data.",
        "Test data was created by splitting on newlines or Chinese period characters.",
        "Comparable XML format data was also provided for all corpora and both tasks.",
        "The segmentation and NER annotation standard, as appropriate, for each corpus was made",
        "available on the bakeoff website.",
        "As observed in previous evaluations, these documents varied widely in length, detail, and presentation language.",
        "Except as noted above, no additional changes were made to the data furnished by the providers."
      ]
    },
    {
      "heading": "2.2 Rules and Procedures",
      "text": [
        "The Third Bakeoff followed the structure of the first two word segmentation bakeoffs.",
        "Participating groups (”sites”) registered by email form; only the primary contact was required to register, identifying the corpora and tasks of interest.",
        "Training data was released for download from the websites (both SIGHAN and LDC) on April 17, 2006.",
        "Test data was released on May 15, 2006 and results were due 14:00 GMT on May 17.",
        "Scores for all submitted runs were emailed to the individual groups by May 19, and were made available to all groups on a web page a few days later.",
        "Groups could participate in either or both of two tracks for each task and corpus:",
        "• In the open track, participants could use any external data they chose in addition to the provided training data.",
        "Such data could include external lexica, name lists, gazetteers, part-of-speech taggers, etc.",
        "Groups were required to specify this information in their system descriptions.",
        "• In the closed track, participants could only use information found in the provided training data.",
        "Information such as externally obtained word counts, part of speech information, or name lists was excluded.",
        "Groups were required to submit fully automatic runs and were prohibited from testing on corpora which they had previously used.",
        "Scoring was performed automatically using a combination of Python and Perl scripts, facilitated by stringent file naming conventions.",
        "In cases",
        "where naming errors or minor divergences from required file formats arose, a mix of manual intervention and automatic conversion was employed to enable scoring.",
        "The primary scoring scripts were made available to participants for followup experiments."
      ]
    },
    {
      "heading": "3 Participating Sites",
      "text": [
        "A total of 36 sites registered, and 29 submitted results for scoring.",
        "The greatest number of participants came from the People’s Republic of China (11), followed by Taiwan (7), the United States (5), Japan (2), with one team each from Singapore, Korea, Hong Kong, and Canada.",
        "A summary of participating groups with task and track information appears in Table 2.",
        "A total of 144 official runs were scored: 101 for word segmentation and 43 for named entity recognition."
      ]
    },
    {
      "heading": "4 Results & Discussion",
      "text": [
        "We report results below first for word segmentation and second for named entity recognition."
      ]
    },
    {
      "heading": "4.1 Word Segmentation Results",
      "text": [
        "To provide a basis for comparison, we computed baseline and possible topline scores for each of the corpora.",
        "The baseline was constructed by left-to-right maximal match implemented by Python script, using the training corpus vocabulary.",
        "The topline employed the same procedure, but instead used the test vocabulary.",
        "These results are shown in Tables 3 and 4.",
        "For the WS task, we computed the following measures using the score(Sproat and Emerson, 2003) program developed for the previous bakeoffs: recall (R), precision (P), equally weighted F-measure (F = p+R) ), the rate of out-of-vocabulary words (OOV rate) in the test corpus, the recall on OOV (Roo„), and recall on in-vocabulary words (Ri„).",
        "In and out of vocabulary status are defined relative to the training corpus.",
        "Following previous bakeoffs, we employ the Central Limit Theorem for Bernoulli trials (Grin-stead and Snell, 1997) to compute 95% confidence interval as ±2q(p(n p) ), assuming the binomial distribution is appropriate.",
        "For recall, Cr, we assume that recall represents the probability of correct word identification.",
        "Symmetrically, for precision, we compute Cp, setting p to the precision value.",
        "One can determine if two systems may then be viewed as significantly different at a 95% confidence level by computing whether their confidence intervals overlap.",
        "Word segmentation results for all runs grouped by corpus and track appear in Tables 5-12; all tables are sorted by F-score."
      ]
    },
    {
      "heading": "4.2 Word Segmentation Discussion",
      "text": [
        "Across all corpora, the best F-score was achieved in the MSRA Open Track at 0.979.",
        "Overall, as would be expected, the best results on Open track runs had higher F-scores than the best results for Closed Track runs on the same corpora.",
        "Likewise, the OOV recall rates for the best Open Track systems exceed those of the best Closed Track runs on comparable corpora by exploiting outside information.",
        "Unfortunately, few sites submitted runs in both conditions making strong direct comparisons difficult.",
        "Many systems strongly outperformed the baseline runs, though none achieved the topline.",
        "The closest approach to the topline score was on the CITYU corpus, with the best performing runs achieving 99% of the topline F-score.",
        "It is also informative to observe the rather wide variation in scores across the test corpora.",
        "The maximum scores were achieved on the MSRA corpus closely followed by the CITYU corpus.",
        "The best score achieved on the UPUC Open track condition, however, was lower than all scores but one on the MSRA Open track.",
        "However, a comparison of the baseline, topline, and especially the OOV rates may shed some light on this disparity.",
        "The UPUC training corpus was only about one-third the size of the MSRA corpus, and the OOV rate for UPUC was more than double that of any of the other corpora, yielding a challenging task, especially in the Closed track.",
        "This high OOV rate may also be attributed to a change in register, since the training data for UPUC had been drawn exclusively from the Chinese Treebank and the test data also included data from other newswire and broadcast news sources.",
        "In contrast, the MSRA corpus had both the highest baseline and highest topline scores, possibly indicating an easier corpus in some sense.",
        "The differences in topline also suggest a greater degree of variance in the UPUC, and in fact all other corpora, relative the MSRA corpus.",
        "These differences highlight the continuing challenges of handling out-of-vocabulary words and performing segmentation across different reg"
      ]
    },
    {
      "heading": "4.3 Named Entity Results",
      "text": [
        "We employed a slightly modified version of the CoNLL 2002 scoring script to evaluate NER task submissions.",
        "For each submission, we compute overall phrase precision (P), recall(R), and balanced F-measure (F), as well as F-measure for each entity type (PER-F,ORG-F,LOC-F,GPE-F).",
        "For each corpus, we compute a baseline performance level as follows.",
        "Based on the training data, using a left-to-right pass over the test data, we assign a named entity tag to a span of characters if it was tagged with a single unique NE tag (PER/LOC/ORG/GPE) in the training data.3 All In the case of overlapping spans, we tag the maximal span.",
        "These scores for all NER corpora are found in Table 13."
      ]
    },
    {
      "heading": "4.4 Named Entity Discussion",
      "text": [
        "Though fewer sites participated in the NER task, performances overall were very strong, with only",
        "two runs performing below baseline.",
        "The best F-score overall on the MSRA Open Track reached 0.912, with ten other scores for MSRA and CITYU Open Track above 0.85.",
        "Only two sites submitted runs in both Open and Closed Track conditions, and few Open Track runs were submitted at all, again limiting comparability.",
        "For the only corpus with substantial numbers of both Open and Closed Track runs, MSRA, the top three runs outperformed all Closed Track runs.",
        "System scores and baselines were much higher for the CITYU and MSRA corpora than for the LDC corpus.",
        "This disparity can, in part, also be attributed to a substantially smaller training corpus for the LDC than the other two collections.",
        "The presence of an additional category, Geopolitical entity, which is potentially confused for either location or organization also enhances the difficulty of this corpus.",
        "Training requirements, variation across corpora, and most extensive tag sets will continue to raise challenges for named entity recognition.",
        "Named entity recognition results for all runs grouped by corpus and track appear in Tables 14- 19; all tables are sorted by F-score."
      ]
    },
    {
      "heading": "5 Conclusions & Future Directions",
      "text": [
        "The Third SIGHAN Chinese Language Processing Bakeoff successfully brought together a collection of 29 strong research groups to assess the progress of research in two important tasks, word segmentation and named entity recognition, that in turn enable other important language processing technologies.",
        "The individual group presentations at the SIGHAN workshop detail the approaches that yielded strong performance for both tasks.",
        "Issues of out-of-vocabulary word handling, annotation consistency, character encoding and code mixing of Chinese and non-Chinese text all continue to challenge system designers and bakeoff organizers alike.",
        "In future analyses, we hope to develop additional analysis tools to better assess progress in these fundamental tasks, in a more corpus independent fashion.",
        "Microsoft Research Asia has been pursuing work along these lines focusing on improvements in F-score and OOV F-score relative to more intrinsic corpus measures, such as baselines and toplines.5 Such developments will guide the planning of future evaluations.",
        "Finally, while word segmentation and named entity recognition are important in themselves, it is also important to assess the impact of improvements in these enabling technologies on broader downstream applications.",
        "More tightly coupled experiments that involve joint word segmentation and named entity recognition could provide insight.",
        "Integration of WS and NER with a higher level task such as parsing, reference resolution, or machine translation could allow the development of more refined, task-oriented metrics to evalu",
        "ate WS and NER and focus attention on improvements to the fundamental techniques which enhance performance on higher level tasks."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We gratefully acknowledge the generous assistance of the organizations and individuals listed below who provided the data for this bakeoff; without their support, it could not have taken place:",
        "• Chinese Knowledge Information Processing Group, Academia Sinica, Taiwan: Keh-Jiann Chen, Henning Chiu • City University of Hong Kong: Benjamin K. Tsou, Olivia Oi Yee Kwong • Linguistic Data Consortium: Stephanie Strassel • Microsoft Research Asia: Mu Li • University of Pennsylvania/University of Colorado, USA: Martha Palmer, Nianwen Xue",
        "We also thank Hwee Tou Ng and Olivia Oi Yee Kwong, the co-organizers of the fifth SIGHAN workshop, in conjunction with which this bakeoff takes place.",
        "Olivia Kwong merits special thanks both for her help in co-organizing this bakeoff and in coordinating publications.",
        "Finally, we thank all the participating sites who enabled the success of this bakeoff."
      ]
    }
  ]
}
