{
  "info": {
    "authors": [
      "Igor Boyko"
    ],
    "book": "Proceedings of the Fifth International Workshop on Inference in Computational Semantics",
    "id": "acl-W06-3914",
    "title": "Formal semantics of verbs for knowledge inference",
    "url": "https://aclweb.org/anthology/W06-3914",
    "year": 2006
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Formal Semantics Of Verbs For Knowledge Inference",
        "Igor Boyko, Ph.D.",
        "This short paper is focused on the formal semantic model: Universal Semantic Code (USC), which acquires a semantic lexicon from thesauruses and pairs it with formal meaning representation.",
        "The USC model postulates: Knowledge Inference (KI) is effective only on the basis of Semantic Knowledge Representation (SKR).",
        "The USC model represents formalized meanings of verbs and phrasal verbs as a main component of its semantic classification.",
        "USC algebra defines a formula for the verb, limited set of elements, relations between them, and a natural language interpretation of the formula."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Knowledge Inference applications development depends on natural language processing (NLP) components including lexical classifiers for word sense disambiguation.",
        "Word meaning classification and word sense disambiguation techniques facilitate understanding of the terms from different domains.",
        "Numerous approaches of the lexical classification exist.",
        "A regular thesaurus defines the meaning of the world but not provides its formal classification what excludes the possibility of KR and KI from such source.",
        "Unfortunately in this short paper we are not able to make deep analysis of known methods of knowledge inference in comparison with USC and therefore will talk about main features of the USC model.",
        "Functional classification of verbs based on Universal Semantic Code (Martynov, 1996, 2001) covers the idea of combining the thesaurus and formal representation.",
        "In the core the USC model considers verbs as actions and provides inference of the consequences of actions."
      ]
    },
    {
      "heading": "2. Formalization of the Verb Classes",
      "text": [
        "The USC model has algebraic and logic roots and declares that knowledge can be represented and stored with semantic code, and knowledge inference can be implemented on the basis of the theorems and axioms operating with the semantic code.",
        "Every verb represents an action and every natural language statement comprises an action.",
        "Even a statement 'the desk' means the action: 'the desk exists'.",
        "Since USC does not make a difference between 'action' and 'verb' we consider 'verb' or 'action' as a main component of the world description.",
        "Every action should be surrounded with some elements.",
        "Potentially any action is a reaction on some stimulus where stimulus is an action too.",
        "Three-component USC notation (X – Y) means stimulus: X by means of Y affects on Z.",
        "The first element of the reaction is always equal to the last element of the stimulus, because some action was implemented with the object Z.",
        "An example of the complete USC formula is ((X – Y) – Z) – ((Z – Y) – W) or shortly ((XY)Z)((ZY)W).",
        "On the abstract level the interpretation of the formula is: \"X by means of Y affects on Z (stimulus) in a result Z by means of Y affects on W (reaction)\".",
        "In USC the reaction part of the formula can be 'active' or 'passive':",
        "((XY)Z)(Z(YW)) - 'passive' formula with the interpretation: X by means of Y affects on Z in a result Z holds Y in W.",
        "The difference is in changing the position of the parenthesis in the right part of the formula.",
        "The active reaction represents an active action like: create, destroy, compress, etc.",
        "and the passive reaction represents a passive action like: exist, absent, etc.",
        "Each USC formula represents a class of similar actions or similar verbs.",
        "The action assigned as a name to the class represents all of those similar actions.",
        "The class action (CA) defines a name of the class and has one or minimal number of meanings.",
        "For example, the class \"fill\" comprises a list of actions-analogues in Fig.1.",
        "Fig.2 demonstrates actions-analogues for the class \"pay\".",
        "Actions-analogues Charge Inflate Load up",
        "Actions-analogues:",
        "Disburse Pay back",
        "We would like to emphasize that the action \"charge\" is displaced in the both examples according to the meaning."
      ]
    },
    {
      "heading": "3. Interpretation of the CA",
      "text": [
        "Since each CA represents the class of the actions, we are able to formulate its interpretation for extracting the hidden members of the action.",
        "The action \"fill\" has the interpretation \"X by means of Y fills Z into W\".",
        "Then we extract the active members of the action, their roles and substitute them with potential subject and objects of the action.",
        "For instance:",
        "• Y = instrument - loading arm",
        "• W = second object - tanker",
        "The complete phrase is: \"Worker by means of the loading arm fills oil into the tanker\".",
        "Each action of the class \"fill\" has the same interpretation.",
        "So for the action \"charge\", as a member of the class \"fill\", the interpretation is: \"X by means of Y charges Z in W\" and action (phrasal verb) \"load up\" has the interpretation: \"X by means of Y loads up Z in W\".",
        "For the action \"pay\" the interpretation is: \"X by means of Y pays Z\", where:",
        "• X = subject - customer",
        "The complete phrase is: \"Customer by means of credit card pays money\".",
        "So the action \"charge\" as a member of the class \"pay\" has the interpretation: \"X by means of Y charges Z\" and the action \"pay back\" has the interpretation: \"X by means of Y pays back Z\"."
      ]
    },
    {
      "heading": "4. Formal Representation of the CA",
      "text": [
        "So far we have considered two CAs: \"fill\" and \"pay\" and determined their sets of variables:",
        "Complete formula of the class consists of two parts.",
        "The first part of the formula is a stimulus and the second part is a reaction on the stimulus.",
        "A procedure of reading of the formula has several steps.",
        "For instance, the formula and interpretation for the action \"fill\":",
        "((X – Y) – Z) – (Z – (Y – W)) \"A worker by means of the loading arm affects oil in a result oil being kept within the tanker\" or \"A worker fills oil into the tanker by the loading arm\".",
        "The operation of implication [ – ] demonstrates the direction of the action.",
        "The left part of all USC formula: ((X – Y) – Z) is identical as a stimulus for all actions, but the right parts are different.",
        "The operation of implication between two parts of the formula is a standard logical implication.",
        "But implication inside of the parts of the formula is a directed influence of one element onto another.",
        "So for the CA \"pay\" the formula and interpretation are: ((X – Y) – Z) – (Z – (Z – Y')) \"A customer by means of the credit card affects the money in a result the money being kept out of the credit card\" or \"A customer pays the money by the credit card\".",
        "Those formulas for \"fill\" and \"pay\" differ in the right part.",
        "The operation [ ' ] is a pointer on the location of one object with respect to another in space and considered as a negation to the location.",
        "USC is a kind of a spatial geometry.",
        "All objects in the world can have one of three locations: to be in, to be on the cover, to be out of the cover and notations like: W, W', W'' mean accordingly 'inside', 'not inside' that is equal to 'superficially', 'not superficially' that is equal to 'outside'.",
        "For example actions: 'compress' is in, 'join' is on, 'disperse' is out and they are active.",
        "W = inside >CT^W'= not in – superficially",
        "Fig.3 Location of the objects in space Now we can represent action as four-element structure (Fig.4):",
        "Class action: Formula:",
        "Actions-analogs: Interpretation:",
        "Charge X by means of Y fills Z Inflate into W __/ Fig.4.",
        "Structure of the action"
      ]
    },
    {
      "heading": "5. USC Axioms",
      "text": [
        "KI with the USC model is based on the axioms of the USC algebra.",
        "Relations between USC formulas can be represented as an oriented graph of the axioms.",
        "The nodes of the graph are represented by the USC formulas and the arcs are the USC axioms.",
        "Since a solution of an intellectual problem is a kind of inference the solution can be obtained as a route of arcs.",
        "The algorithm of the problem solving is based on the successive drawing of the route from the target situation to the initial one or vice versa.",
        "The axioms of the USC algebra determine the rules of conversion from one formula into another.",
        "For example, the axiom of transposition determines changing of parenthesis in the right part of the formula:",
        "In the axiom of diffusion the right part of the formula can be converted by replacing the variable in the first or second position into the second or third position (Fig.5).",
        "With CAs in the positions of the formulas we receive the consequences of the actions in Fig.6.",
        "connect prevent implement disconnect",
        "Fig 5.",
        "Axiom of diffusion",
        "Fig 6.",
        "Substitution with CAs",
        "The arrows between formulas determine the direction of the inference from the action to the action.",
        "The nodes of the both graphs show antonymic dependence of the class names, like: 'embed' - 'extract' or 'connect' - 'disconnect'.",
        "A set of the USC axioms consists of two parts (Martynov, 2001):",
        "a) Four axioms of generation defining sets of variables and their positions in the formula",
        "b) Four axioms of transformation defining rules of converting one formula into another The axioms define the consequence of the actions cannot be arbitrary.",
        "So, the formal part of the USC algebra has been determined as A = < M, – , ' >, where M is a set of elements, – is a binary-non-commutative and non-associative operation on the given set (the operation of implication), ['] is a unary operation on the given set (the operation of negation).",
        "It strictly corresponds to Lukasiewicz variant of algebra (Lukasiewicz, 1958)."
      ]
    },
    {
      "heading": "6. Semantic Knowledge Inference with USC",
      "text": [
        "To start knowledge inference with USC we should ask: What are we going to infer?",
        "Since USC operates with the actions we will calculate the consequences of the actions because each action has a precedent action or a cause and each action is a cause for a consequent action:",
        "(precedent action – current action – consequent action) == (precedent verb – current verb – consequent verb).",
        "As an example we will consider a process of cooking liquid according to the description (Bon-nisone, 1985): \"The coffee machine's container comprises cold water and heating elements.",
        "The heating elements heat the water in a result the water steam is lifting to the top of the container where grain coffee is displaced.",
        "The steam is condensing in the top cold part of the container then percolates through grain coffee and drops into the cap\".",
        "According to the goal the final result is 'cooked coffee'.",
        "Extraction of the actions from the description gives us a consequence of the actions: heat – lift – condense – percolate – drop\".",
        "Substitution of the actions with the USC formulas gives a consequence of the formulas: (ZY)Y' – (ZY)Y'' – (ZW)Y' – (ZY)W'' – Z(YZ'').",
        "Using the graph of the USC axiomatic action relations we are able to verify correctness of the formulas order.",
        "We will start the analysis from the last formula Z(YZ).",
        "According to the axioms this formula cannot be derived from the (ZY)W. To derive it one intermediate formula should be introduced: (ZY)W'' – Z(YW'') – Z(YZ'').",
        "This inference extends the final stage of the process and corresponds to the USC thesaurus: percolate – cook – drop.",
        "Such inference looks logically correct because cooked coffee is a result of percolation and only then cooked coffee drops down.",
        "On the next step we consider a relation between (ZW)Y' and (ZY)W''.",
        "According to the axioms the next inference between two formulas should be implemented:",
        "(ZW)Y' – (ZY)W' – (ZY)W'' or condense – liquefy – percolate.",
        "If we combine two steps of the inference together then receive the consequence: (ZW)Y' – (ZY)W' – (ZY)W'' – Z(YW' ') – Z(YZ'') or condense – liquefy – percolate – cook – drop.",
        "The next step of verification for (ZY)Y'' – (ZW)Y' shows a necessity to introduce an intermediate formula:",
        "(ZY)Y'' – (ZW)Y'' – (ZW)Y' or lift – cool – condense.",
        "The final step of verification shows explicit axiomatic relation (ZY)Y' – (ZY)Y''.",
        "In a result we have the consequence of the actions: (ZY)Y' – (ZY)Y'' – (ZW)Y'' – (ZW)Y' – (ZY)W' – (ZY)W'' – Z(YW' ') – Z(YZ'') or heat – lift – cool – condense – liquefy – percolate – cook – drop.",
        "Now we are able to reconstruct the description of the whole process in the extended and corrected form: \"The coffee machine's container comprises cold water and heating elements.",
        "The heating elements heat the water in a result the water steam is lifting to the top of the container where grain coffee is displaced.",
        "Oh the top the steam is cooling and condensing on the grain coffee.",
        "As a result the grain coffee is liquefying and liquid is percolating through.",
        "Percolated liquid is a liquid coffee which drops into the cap\".",
        "The example includes the inference with axioms presented and not presented in this short article but all set of rules, axioms and an example of the USC thesaurus could be seen in the book of Martynov V., 2001.",
        "The model was successfully applied for the inventive problems solving (Boyko, 2001) where an inventive solution is a consequence of the actions (technological operations) related through the USC axioms.",
        "Besides, the USC inference using the USC thesaurus and axioms can be applied not only for the technical domain but also for SKI in physical, chemical, biological, informational, and other domains with a condition of having specialized dictionaries coordinated with the USC thesaurus."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "The USC model unites several components including: formal representation of the actions, natural language interpretation, visualization of location of the elements in space, and axioms of inference.",
        "The latest published version of the USC action classifier comprises 96 classes divided on two main parts: 48 physical and 48 informational classes (Martynov, 2001).",
        "In the article we were able to analyze only the part with physical classes.",
        "Informational classes include actions like 'forget', 'understand', 'offend', 'order' etc.",
        "Axiomatic relations between them are similar to axiomatic relations for physical actions represented in the article with some restrictions.",
        "All classes relatively paired by the opposite or antonymic principle: create/destroy, lift/low, push/pull, remember/forget, love/hate, etc.",
        "\"Relatively paired\" means the opposite actions can be deduced by axioms and they are located on the same level in the classification table.",
        "The whole set of actions comprises 5200 entities.",
        "Since 2001 year the number of the classes has not been changed but the names of the classes in some positions has been verified and reconsidered.",
        "Axiomatic structure has been changed slightly.",
        "Formal representation of the actions as an intermediate code in \"human-computer\" interface is the essential property of USC.",
        "The USC formulas have been used to represent not only verbs and phrasal verbs, but also to represent deverbal nouns and adjectives for development of the universal principles of machine translation (Boyko, 2002).",
        "The USC model can be adjusted to any natural language.",
        "In general the models of formal semantic coding for knowledge inference is a new area of machine learning that has been applied almost exclusively to classification tasks.",
        "Most experiments in corpus-based natural language processing present results for some subtasks and there are few results that can be successfully integrated to build a complete NLP system."
      ]
    }
  ]
}
