{
  "info": {
    "authors": [
      "H. P. Edmundson"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C67-1025",
    "title": "Axiomatic Characterization of Synonymy and Antonymy",
    "url": "https://aclweb.org/anthology/C67-1025",
    "year": 1967
  },
  "references": [],
  "sections": [
    {
      "heading": "1. Introduction 1.1.. Background",
      "text": [
        "This work is a continuation of research reported in the paper Mathematical Models of Synonymy, which was presented at the 1965 International Conference on Computational Linguistics.",
        "That paper presented a historical summary of the concepts of synonymy Ind antonymy.",
        "It was noted that since the first book on English synonyms, which appeared in the second half of the 18th century, dictionaries of synonyms and antonyms have varied according to the particular explicit definitions of \"synonym\" and \"antonym\" that were used.",
        "The roles of part-of-speech, context of a word, and substitutability in the same context were discussed.",
        "Traditionally, synonymy has been regarded as a binary relation between two words.",
        "Graphs of these binary relations were drawn for several sets of words based on Webster's Dictionary of Synonkms and matrices for these graphs were exhibited as an equivalent representation.",
        "These empirical results showed that the concepts of synonymy and antonymy required the use of ternary relations between two words in a specified sense rather than simply a binary relation between two words.",
        "The synonymy relation was then defined implicitly, rather than explicitly, by three anions stating the properties of being reflexive, symmetric,.",
        "and transitive.",
        "The antonymy relation was also defined by three =it= stating the properties of being irreflexive, symmetric, and antitransit ve (the last term was coined for that study).",
        "It was noted that thee six axioms could be expressed in the calculus of relations and th this relation algebra could be used to produce shorter proofk of tY eorems.",
        "However, no proofs were given.",
        "In addition, several gecmet ical and topological models of synonymy and antonymy: were posed and examined.",
        "It was noted that certain of these models were of more theoretical than practical interest.",
        "Each model was seen to be simple in that it could be expressed from mathematically elementary concepts, and each stressed certain aspects of the linguistic object being modeled at the expense of others.",
        "However, there seemed to be little theoretical preference among them.",
        "Their adequacy as models could be measured by their generality and predictive power.",
        "In terms of these criteria the algebraic model, whether expressed in terms of relations, graphs, or matrices, seemed to have the most usefulness.",
        "In part, this was due to the fact that one geometrical model, although highly suggestive, did not include a precise specification of the origin, axes, or coordinates for words in an n-dimensional space.",
        "Similarly, one topological model required a closure operation for each of the intensions or senses and had no linguistically interesting interpretation.",
        "1.2 Summary The present paper investigates more thoroughly the characterizations of synonymy and antonymy initiated in Edmundson (1965).",
        "In section 2, synonymy and antonymy are defined jointly and implicitly by a set of axioms rather than separately as before.",
        "First, it is noted that the original six axioms are insufficient to permit the proofs of certain theorems whose truth is strongly suggested by intuitive notions about synonyms and antonyms.",
        "In addition, it is discovered that certain fundamental assumptions about synonymy and antonymy must be made explicit as axioms.",
        "Same of these have to do with specifying the domain and range of the synonymy and antonymy relations.",
        "This is related to questions about whether function words, which linguistically belong to closed classes, should have'synonyms and antonyms and whether content words, which linguistically belong to open classes, must have synonyms and antonyms.",
        "Several fundamental theorems of this axiom system are stated and proved.",
        "The informal interpretation of many of these theorems are intuitively satisfying.",
        "For example, it is proved that any even power of the antonymy relation is the synonymy relation, while any odd power is the antonymy relation.",
        "In section 3, topological characterizations are posed and examined.",
        "A neighborhood topology is introduced by defining the neighborhood of a word.",
        "It is proved that this definition satisfies four neighborhood axioms.",
        "Also, a closure topology is introduced by defining the closure of a set of words.",
        "It is proved that this definition satisfies the four closure axioms.",
        "2.",
        "Algebraic Characterization 2.1.",
        "Introduction - Relations",
        "Before investigating antonymy and synonymy, we will establish some notions and notations for the calculus of binary relations.",
        "Consider a set V of arbitrary elements, which will be called the universal set.",
        "A binary relation on V is defined as a set R of ordered pairs <x,y>, where x,y E V. The proposition that x stands in relation R to y will be denoted by xRy.",
        "The domaincer(R), range/g(R), and field l(F) of relation R are, respectively, defined by the sets",
        "The complement, union, intersection, and converse relations are defined by xRy is ; x(R U S)y E xRy V xSy ; x(R fl S)y m xRylA xSy ; xR1y s yRx The identity relation I and null relation 0 are defined by xIy E x = y ; x0y E (x r x), V (Y y) The product and power relations are defined by xRISy E (az)(xRz A zSy) Rn Ron-1 n k 1 Inclusion and equality of relations are defined by RQS xRy ==> xSy ; R=S E RcSASQR",
        "Later we will use the following elementary theorems which are stated here without proof: Theorem: R g S ==> R-1 g S-1 Theorem: R s S ==> S g"
      ]
    },
    {
      "heading": "2.2 Axioms and Definitions",
      "text": [
        "Under the assumption that synonymy and antonymy are ternary relations on the set C of all content words, the following definitions will be used:",
        "We will assume that the synonymy and antonymy relations are defined jointly and implicitly by.the following set of axioms rather than• separately as in Edmundson (1965).",
        "The properties named in Axioms 6 and 7 were coined for this study.",
        "The above eight axioms may be expressed in the calculus of relations as follows:",
        "This relation algebra will be used to produce shorter proofs, although this is not necessary.",
        "The consistency of this set of axioms is shown by exhibiting a model for them; their independence will not be treated.",
        "In addition to the synonymy and antonymy relations it will be Useful to introduce the following classes that are the images of these relations.",
        "The synonym class of a word y is defined by si(y) E (x which may be extended to an arbitrary set E of words by si(E) n (x (ay)[5. e E A xSiy]) Similarly, the antonym class of a word y is defined by ai(y) (x mAiy) which may be extended to a set E of words by ai(E) a (x (ay)[y e E A xAiY]) 2.3 Theorems For reasons of notational simplicity, the subscript denoting the intension i will be omitted in the sequel whenever possible.",
        "However, the theorems must be understood as if the subscript were present.",
        "As with any symmetric relation, it is possible to get stronger results than Axiom 2 and Axiom 5.",
        "In fact, by induction we have the generalization: Theorem: sn =,S ,n 9 Proof: 3n SISn-- = SI(S1Sn-`) = ..• = SI(S1(s1\"*IS)***) = S. It can be shown that antonymy and synonymy are distinct: A A S. In fact we have the stronger result:",
        "Theorem: A s Proof: Assume A % S. HenceArISA0 or (ax)(35r)Dc(AnS)Yi.",
        "Then xAy A xSy implies xAy A ySx by Axiom 2.",
        "So 'Am, which contradicts xAx by Axiom 4: I G r. Therefore A c S."
      ]
    },
    {
      "heading": "Only because of Axima 8, can we get a stronger result than the anti-transitivity property of Anion 6.",
      "text": [
        "(Yy) Ix [074x A xAy] by Anion 5.",
        "Hence (11y)(Iy =m› yA-11.Y).",
        "Thus I c A-11A.",
        "So A2 St IIS = S. Therefore A4 = S since A2 s S by Axiom 6 and S c A2.",
        "Next, several theorems about synonym classes and antonym classes will be stated and proved.",
        "First, the synonym class of a word is not empty:",
        "- 1 Proof: ye s(x) <==> ySx <==> yS x <==> xSy <==> x e s(y).",
        "Since S is reflexive, symmetric, and transitive, S is by definition an equivalence relation on the set C of all content words.",
        "Hence, we have the important result: Theorem: xSy <==> s(x) = s(y) Proof: (=>) Assume xSy.",
        "First let u e s(x).",
        "Then uSx A xSy ==> uS2y ==> uSy ==> u E s(y).",
        "Hence s(x) G s(y).",
        "Also s(y) s s(x) by a similar argument.",
        "Therefore s(x) = s(y).",
        "(<==) Assume s(x) = s(y).",
        "Then u e s(x) ==> u e s(y).",
        "So uSx ==> uSy.",
        "Hence xSu A uSy ==> xSy ==> xSy.",
        "Therefore xSy.",
        "In fact, we have the stronger result:",
        "Hence for a given intension i the equivalence relation Si partitions the set C of all content words into subsets that are disjoint (i.e., the subsets have no word in ccamon) and exhaustive (i.e., every word is in some subset):",
        "Second, the antonym class of a word is not empty: Theorem: a(y) 0"
      ]
    },
    {
      "heading": "Proof: Axian 8: (Yy)(ax)(xAy] implies a(y) 0.",
      "text": [
        "Note that a word does not belong to its antonym class: Theorem: y a(y).",
        "Proof: Assume y e a(y) so that yAy.",
        "But this contradicts Axian yIy ==> ylry.",
        "Therefore y A a(Y).",
        "Next we will establish sane relations between synonym classes and antonym classes.",
        "Now u e a(x) A xAy – 3 uAx A xAy ==> uA2y ==> uSy > u e s(y).",
        "Hence a(x) G s(y).",
        "Also s(y) G a(x) by a similar argument.",
        "Therefore a(x) = s(y).",
        "(<=) Assume a(x) = s(y).",
        "But y e s(y) = a(x).",
        "Hence yAx.",
        "Therefore xAy by Axiom 5.",
        "In fact, we get the following necessary and sufficient condition for equality: Theorem: a(x) = a(y) <==> s(x) = s(y) Proof: (=e,) Assume a(x) = a(y).",
        "Now a(x) n a(y) y4 0 =e> (azyz a a(x) A a(y)] ==> (az)(z e a(x) A z e a(y)] =w> (3z)(zAx A zAy] ==> (aZ)NAz A zAy] =e> xA2y ==> xSy.",
        "Therefore s(x) = s(y) by a previous theorem.",
        "(<==) Assume s(x) = s(y).",
        "Then xSy.",
        "First, let u e a(x).",
        "Then uAx.",
        "Hence uAx A xSy ==> uAISy ==> uAy ==> u e a(y).",
        "Therefore a(x) G a(y).",
        "Also a(y) G a(x) by an identical argument.",
        "Therefore a(x) = a(y).",
        "2.4 Comments on the Algebraic Characterization Even though s(y) A 0 since ySy.by Axiom 1, it may be necessary to add the following axiom:",
        "Axiom 9 is not necessary if s(y) is permitted to be a unit set for certain words.",
        "Thus, we might define s(y) = (y) for any function word y, e.g., s(and) = (and).",
        "But this will not work for antonymy since a(y) might be considered empty for certain words such as function words, e.g., a(and) = 0.",
        "The alternative of defining a(y) = is not reasonable since it produces more problems than it solves.",
        "Axiom 8: (Vy)(ax)(xAy] is reasonable if the contraries of words (e.g., nonuse, impossible, etc.)",
        "are permitted, i.e., Y e s(Y)•",
        "The theorems",
        "can be summarized in the following multiplication table for products of the relations S and A",
        "Suppose that for every pair <x,y> of words in the vocabulary V of a language exactly one of the following ternary relations holds:",
        "(1) x and y are synonymous, xSy 2) x and y are antonymous, xAy 3) neither (1) nor (2), xMy"
      ]
    },
    {
      "heading": "This can be expressed by (Vx)(Vy)[xpy a V ==> xSy v xAy v xMy]",
      "text": [
        "which is an exclusive disjunction.",
        "Thus the vocabulary V is partitioned as follows: V = s(y) U a(y) U m(y) for every word y.",
        "This also can be pictured in the lattice of relations",
        "It can be shown that the multiplication table for products of the relations S,A, and M is"
      ]
    },
    {
      "heading": "3. Topological Characterizations 3.1. Introduction",
      "text": [
        "We will now examine two topological models of synonymy.",
        "Being topological, they concern \"semantic spaces\" of words without any notion of \"semantic distance\" between two words.",
        "Again, we will restrict our attention to content words.",
        "Topological models for the antonymy relation will not be considered."
      ]
    },
    {
      "heading": "3.2. Neighborhood Topology",
      "text": [
        "The first model considers a neighborhood topology, i.e., a topology based on neighborhoods.",
        "A set is said to have a neighborhood topology if there exist elements x called points and sets Nx called neighborhoods of x which satisfy the following axioms:",
        "These axioms can be pictured informally by the following Euler diagrams: Define a neighborhood n4(x) of a word x as any subset of the synonym class s(x) of x that c6ntains x, i.e., x e ni(x) si(x) Again, for-reasons of notational simplicity, the subscript denoting the intension i will be omitted whenever possible.",
        "First, neighborhood Axiom 1 is satisfied.",
        "Theorem: (Yx)(an(x))[x a n(x)] Proof: By definition s(x) is a neighborhood n(x) of x containing x.",
        "Second, neighborhood Axiom 2 is satisfied.",
        "Theorem: (Vn(x))(Arn'(x))(an\"(x))(n\"(x) n(x) fl n'(x)] Proof: For arbitary n(x) and n'(x), let n\"(x) = n(x) fl n'(x).",
        "Then n\"(x) s(x) since n\"(x) = n(x) fl n'(x) a s(x) n s(x) - s(x).",
        "Also, x e n\"(x) since x e n(x) A x e n'(x) imply x E n(x) fl n'(x) = n\"(x).",
        "Therefore, (Yn(x))(Vn'(x))(an\"(x))Cm\"(x) C n(x) fl n'(x)).",
        "Third, neighborhood Axton 3 is satisfied.",
        "Theorem: (Yy)(1/n(x))(an(y))(y a n(x) ==> n(y) s n(x)] Proof: For arbitrary y e n(x), let n(y) = n(x).",
        "But y e n(x) implies s(x) = s(Y) since y e n(x) G s(x) = (z : zSx) implies ySx and ySx implies s(y) = s(x).",
        "Then n(y) G s(y) since n(y) = n(x) g s(x) = s(y).",
        "Also y e n(y) since y e n(x) = n(y).",
        "Therefore, (Vy)(Vn(x))(n(y))(y e n(x) ==> n(y) G n(x)1.",
        "In fact, the neighborhood topology satisfies Axiom 4, which is a separation axiom: Theorem: (Vx)(Yy),(an(x))(as(Y))(x y => n(x) n n(Y) = 0] Proof: Assume x r y.",
        "Let n(x) = (x) and n(y) = (y).",
        "Then x e n(x) g s(x) and y e n(y) g s(y).",
        ".Thus n(x) n n(y) = (x) n (y) = 0 since x A y.",
        "Therefore, with respect to synonymy, words have a neighborhood topology since"
      ]
    },
    {
      "heading": "3.3. Closure Topology",
      "text": [
        "The second model considers a closure topology, i.e., a topology based on a closure operation.",
        "A set is said to have a closure topolo: if there exists a unary operation on its subsets, denoted by mvand called the closure, which satisfies the following axioms:",
        "Define the closure of a set E of words as the synonym class of E, i.e., E E s(E) The closure axioms can be shown to be satisfied by using the original definition of synonym class s(E) (x (ay)[y e E A xSy]) However, shorter proofs are possible by noting that the synonym class of a set E of words can be expressed as",
        "Second, closure Axiom 2 is satisfied: Theorem: E c s(E) Proof: s(E) =s(y) 2 (y) = E since y e s(y) => (Y) g s(Y)• Y e E Y E",
        "Third, closure Axiom 3 is satisfied:",
        "Therefore, with respect to synonymy, words have a closure topology since",
        "Note that from Axioms 2 and 3 we get Theorem: s[s(E)] = e(E)"
      ]
    },
    {
      "heading": "3.4. Comments on Topological Characterizations",
      "text": [
        "Note that for the neighborhood topology a separation axiom has been added to the three axioms proposed in Edmundson (1965).",
        "Also, the neighborhood topology seems more intuitively satisfying than the closure topology.",
        "However, for the closure topology if we define the 'derived set of a set E of words as the set of all words that *re synonymous to some word of E, but not identical to that word, i.e., E' s [x (Sy)[yeEAxliyAxSy]) then we have the following result: Theorem: s(E) = E U E'"
      ]
    },
    {
      "heading": "which may be given a reasonable linguistic interpretation. An",
      "text": [
        "example is (y)' = s(y) - (y) which was discussed in the section on algebraic characterization."
      ]
    },
    {
      "heading": "4. Conclusions",
      "text": [
        "These results support the belief that the algebraic characterization is insightful and appropriate.",
        "For example, the assumption that synonymy is an equivalence relation also has,been made, either directly or indirectly, by F. Kiefer and S. Abraham (1965), U. Weinreich (1966), and others.",
        "Since the axiom system defines the notions of synonymy and antonymy jointly and implicitly, it avoids certain difficulties that are encountered when attempts are made to define these notions separately and explicitly.",
        "These topological characterizations provide a nonmetric representation of what has been called informally a \"semantic space\".",
        "Previous attempts to construct a semantic space that is metric (i.e., one for which a distance function is defined) have not met with much success.",
        "The consideration of general topological spaces avoids this difficulty."
      ]
    }
  ]
}
