{
  "info": {
    "authors": [
      "Keiji Yasuda",
      "Ruiqiang Zhang",
      "Hirohumi Yamamoto",
      "Eiichiro Sumita"
    ],
    "book": "Proceedings of the Third International Joint Conference on Natural Language Processing",
    "id": "acl-I08-2088",
    "title": "Method of Selecting Training Data to Build a Compact and Efficient Translation Model",
    "url": "https://aclweb.org/anthology/I08-2088",
    "year": 2008
  },
  "references": [
    "acl-D07-1036",
    "acl-J03-1002",
    "acl-N03-1017",
    "acl-P02-1040",
    "acl-P03-1021"
  ],
  "sections": [
    {
      "text": [
        "Target task matched parallel corpora are required for statistical translation model training.",
        "However, training corpora sometimes include both target task matched and unmatched sentences.",
        "In such a case, training set selection can reduce the size of the translation model.",
        "In this paper, we propose a training set selection method for translation model training using linear translation model interpolation and a language model technique.",
        "According to the experimental results, the proposed method reduces the translation model size by 50% and improves BLEU score by 1.76% in comparison with a baseline training corpus usage."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Parallel corpus is one of the most important components in statistical machine translation (SMT), and there are two main factors contributing to its performance.",
        "The first is the quality of the parallel corpus, and the second is its quantity.",
        "A parallel corpus that has similar statistical characteristics to the target domain should yield a more efficient translation model.",
        "However, domain-mismatched training data might reduce the translation model's performance.",
        "A large training corpus obviously produces better quality than a small one.",
        "However, increasing the size of the training corpus causes another problem, which is increased computational processing load.",
        "This problem not only affects the training of the translation model, but also its applications.",
        "The reason for this is that a large amount of training data tends to yield a large translation model and applications then have to deal with this model.",
        "We propose a method of selecting translation pairs as the training set from a training parallel corpus to solve the problem of an expanded translation model with increased training load.",
        "This method enables an adequate training set to be selected from a large parallel corpus by using a small in-domain parallel corpus.",
        "We can make the translation model compact without degrading performance because this method effectively reduces the size of the set for training the translation model.",
        "This compact translation model can outperform a translation model trained on the entire original corpus.",
        "This method is especially effective for domains where it is difficult to enlarge the corpus, such as in spoken language parallel corpora (Kikui et al., 2006).",
        "The main approach to recovering from an un-dersupply of the in-domain corpus has been to use a very large domain-close or out-of-domain parallel corpus for the translation model training (NIST, 2006).",
        "In such case, the proposed method effectively reduces the size of the training set and translation model.",
        "Section 2 describes the method of selecting the training set.",
        "Section 3 details the experimental results for selecting the training set and actual translation from the International Workshop on Spoken Language Translation 2006 (IWSLT2006).",
        "Section 4 compares the results of the proposed method with those of the conventional method.",
        "Section 5 concludes the paper."
      ]
    },
    {
      "heading": "2.. Train language models",
      "text": []
    },
    {
      "heading": "1.. Train translation model",
      "text": []
    },
    {
      "heading": "3.. Calculate perplexity",
      "text": []
    },
    {
      "heading": "4.. Select translation pairs based on the perplexity",
      "text": []
    },
    {
      "heading": "5.. Train translation model",
      "text": [
        "TMn-dom-",
        "selected"
      ]
    },
    {
      "heading": "2. Method",
      "text": [
        "Our method use a small in-domain parallel corpus and a large out-of-domain parallel corpus, and it selects a number of appropriate training translation pairs from the out-of-domain parallel corpus.",
        "Figure 1 is a flow diagram of the method.",
        "The procedure is as follows:",
        "1.",
        "Train a translation model using the in-domain parallel corpus.",
        "2.",
        "Train a language model using the source language side or/and target language side of the in-domain corpus.",
        "3.",
        "Calculate the word perplexity for each sentence (in source language side or/and target language side) in the out-of-domain corpus by using the following formulas.",
        "where PPe is the target language side perplexity, and Pe is the probability given by the target side language model.",
        "Se is the target language sentence in the parallel corpus, and ne is the number of words in the sentence.",
        "We can also calculate the perplexity in the source language (PPf) in the same way.",
        "If we use perplexities in both languages, we can calculate average perplexity (PPe+f) by using the following formula.",
        "PPe+f = (PPe X PPf)î",
        "Small in-domain parallel corpus",
        "Target language i",
        "Source language",
        "4.",
        "Select translation pairs from the out-of-domain parallel corpus.",
        "If the perplexity is smaller than the threshold, use translation pairs as the training set.",
        "Otherwise, discard the translation pairs.",
        "5.",
        "Train a translation model by using the selected translation pairs.",
        "6.",
        "Integrate the translation model obtained in 1 and 6 by linear interpolation."
      ]
    },
    {
      "heading": "3. Experiments",
      "text": [
        "We carried out statistical machine translation experiments using the translation models obtained with the proposed method.",
        "We employed a log-linear model as a phrase-based statistical machine translation framework.",
        "This model expresses the probability of a target-language word sequence (e) of a given source language word sequence (/) given by where hi(e, /) is the feature function, Xi is the feature function's weight, and M is the number of features.",
        "We can approximate Eq.",
        "4 by regarding its denominator as constant.",
        "The translation results (e ) are then obtained by",
        "We used data from the Chinese-to-English translation track of the IWSLT 2006(IWSLT, 2006) for the experiments.",
        "The small in-domain parallel corpus was from the IWSLT workshop.",
        "This corpus was part of the ATR Bilingual Travel Expression Corpus (ATR-BTEC) (Kikui et al., 2006).",
        "The large out-of-domain parallel corpus was from the LDC corpus (LDC, 2007).",
        "Details on the data are listed in Table 1.",
        "We used the test set of the IWSLT2006 workshop for the evaluation.",
        "This test set consisted of 500 Chinese sentences with eight English reference translations per Chinese sentence.",
        "For the statistical machine-translation experiments, we first aligned the bilingual sentences for preprocessing using the Champollion tool (Ma, 2006).",
        "We then segmented the Chinese words using Achilles (Zhang et al., 2006).",
        "After the segmentation, we removed all punctuation from both English and Chinese corpuses and decapitalized the English corpus.",
        "We used the preprocessed data to train the phrase-based translation model by using GIZA++ (Och and Ney, 2003) and the Pharaoh tool kit (Koehn et al., 2003).",
        "We used eight features (Och and Ney, 2003; Koehn et al., 2003) and their weights for the translations.",
        "1.",
        "Phrase translation probability from source language to target language (weight = 0.2)",
        "2.",
        "Phrase translation probability from target language to source language (weight = 0.2)",
        "3.",
        "Lexical weighting probability from source language to target language (weight = 0.2)",
        "4.",
        "Lexical weighting probability from source target to language weight = 0.2)",
        "The experiments used four features (Feature # 1 to 4 in 3.2.2) as targets for integration.",
        "For each feature, we applied linear interpolation by using the following formula.",
        "Here, hin(e, f) and hout(e, f) are features trained on the in-domain parallel corpus and out-of-domain corpus, respectively.",
        "^out is the weight for the feature trained on the out-of-domain parallel corpus.",
        "We used a Good-Turing (Good, 1953) 3-gram language model for data selection.",
        "For the actual translation, we used a modified Kneser-Ney (Chen and Goodman, 1998) 3-gram language model because modified Kneser-Ney smoothing tended to perform better than the Good-Turing language model in this translation task.",
        "For training of the language model, only the English side of the in-domain corpus was used.",
        "We used the same language model for the entire translation experiment."
      ]
    },
    {
      "heading": "7.. Distortion weight (weight = 0.5)",
      "text": []
    },
    {
      "heading": "8.. Target language model probability (weight =",
      "text": [
        "According to a previous study, the minimum error rate training (MERT) (Och, 2003), which is the optimization of feature weights by maximizing the BLEU score on the development set, can improve the performance of a system.",
        "However, the range of improvement is not stable because the MERT algorithm uses random numbers while searching for the optimum weights.",
        "As previously mentioned, we used fixed weights instead of weights optimized by MERT to remove its unstable effects and simplify the evaluation.",
        "Figure 2 and 3 plot the results of the experiments.",
        "The horizontal axis represents the weight for the out-of-domain translation model, and the vertical axis represents the automatic metric of translation quality (BLEU score (Papineni et al., 2002) in Fig. 2, and NIST score (NIST, 2002) in Fig. 3).",
        "Thick straight broken lines in the figures indicate automatic scores of a baseline system.",
        "This base line system was trained on the in-domain and all of the out-of-domain corpus (2.5M sentence pairs).",
        "These data were concatenated before training; then one model was trained without linear interpolation.",
        "The five symbols in the figures represent the sizes (# of sentence pairs) of the selected parallel corpus.",
        "Here, the selection was carried out by using Eq.",
        "1.",
        "For automatic evaluation, we used the reference translation with a case unsensitive and no-punctuation setting.",
        "Hence, higher automatic scores indicate better translations; the selected corpus size of 1.2M (x) indicates the best translation quality in Fig. 2 at the point where the weight for the out-of-domain translation model is 0.7.",
        "In contrast to Fig. 2, Fig. 3 shows no improvements to the NIST score by using the baseline out-of-domain usage.",
        "The optimal weights for each corpus size are different from those in Fig. 2.",
        "However, there is no difference in optimal corpus size; i.e., the selected corpus size of 1.2M gives the best NIST score.",
        "<**",
        "• i",
        "...+..\"7",
        "x.",
        "\\",
        "-■fr\"",
        "/",
        "•",
        "'■',1",
        "1",
        "1",
        ">•• 400 K",
        "\"7*-",
        "1",
        "■.",
        "» +",
        "-•>",
        "V- 800 K < – 1.2 M",
        "■ 1",
        "'.",
        "A",
        " – ",
        "1 – 1.6 M",
        "-",
        "l – 2.5 M",
        "(Sentence pairs)",
        "Table 2 lists the sizes of the translation models of the baseline and optimum-size training corpus.",
        "The size of the phrase table is the uncompressed file size of the phrase table trained by the Pharaoh tool kit.",
        "As the table indicates, our method reduced the model sizes by 50%.",
        "This reduction had a positive effect on the computational load of decoding.",
        "The experiments described above used only target language side information, i.e., Eq.",
        "1, for the data selection.",
        "Here, we compare selection performances of Eqs.",
        "1, 2, and 3.",
        "Table 3 shows the results.",
        "The first row shows the results of using only the indomain parallel corpus.",
        "The second row shows results of the baseline.",
        "The third row shows the results of using linear interpolation without data selection.",
        "Comparing the results for the three equations, we see that Eq.",
        "1 gives the best performance.",
        "It outperforms not only the baseline but also the results obtained by using all of the (2.5M) out-of-domain data and linear interpolation.",
        "The results of using source language side information (Eq.",
        "2) and information from both language sides (Eq.",
        "3) still showed better performance than the baseline system did."
      ]
    },
    {
      "heading": "4. Comparison with conventional method",
      "text": [
        "There are few studies on data selection for translation model training.",
        "Most successful and recent study was that of (Lu et al., 2007).",
        "They applied the TF*IDF framework to translation model training corpus selection.",
        "According to their study, they obtained a 28% translation model size reduction (A 2.41G byte model was reduced to a 1.74G byte model) and 1% BLEU score improvement (BLEU score increased from 23.63% to 24.63%).",
        "Although there results are not directly comparable to ours [??]",
        "because of the differences in the experimental setting, our method outperforms theirs for both aspects of model size reduction and translation performance improvement (50% model size reduction and 1.76% BLEU score improvement)."
      ]
    },
    {
      "heading": "5. Conclusions",
      "text": [
        "We proposed a method of selecting training sets for training translation models that dramatically reduces the sizes of the training set and translation models.",
        "We carried out experiments using data from the Chinese-to-English translation track of the IWSLT evaluation campaign.",
        "The experimental results indicated that our method reduced the size of the training set by 48%.",
        "The obtained translation models were half the size of the baseline.",
        "The proposed method also had good translation performance.",
        "Our experimental results demonstrated that an SMT system with a half-size translation model obtained with our method improved the BLEU score by 1.76%.",
        "(Linear interpolation improved BLEU score by 1.61% and data selection improved BLEU score by an additional 0.15%.)",
        " – *v~",
        ".......",
        "\"■a-..",
        "*--□...",
        "\"A.",
        "..a.",
        "-",
        "\\",
        "-",
        "7",
        "T",
        "ï",
        "I",
        ";",
        "\\",
        "1",
        "i – ",
        "o-- 400 K",
        "_a odd \\y",
        "~ùr - 800 K",
        "X- - 1.2 M",
        "\\",
        "+--•1.6 M",
        "i",
        " – ",
        "-• – 2.5 M",
        "Ü",
        "in domain uoiuus size (sentence pansy out o I domain selection method optimal weight ioi out oi domain model bleu scoi e",
        "EU.",
        "We also compared the selections using source language side information, target language side information and information from both language sides.",
        "The experimental results show that target language side information gives the best performance in the experimental setting.",
        "However, there are no large differences among the different selection results.",
        "The results are encouraging because they show that the in-domain monolingual corpus is sufficient to select training data from the out-of-domain parallel corpus."
      ]
    }
  ]
}
