{
  "info": {
    "authors": [
      "Wenjie Li",
      "Peng Zhang",
      "Furu Wei",
      "Yuexian Hou",
      "Qin Lu"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P08-2023",
    "title": "A Novel Feature-based Approach to Chinese Entity Relation Extraction",
    "url": "https://aclweb.org/anthology/P08-2023",
    "year": 2008
  },
  "references": [
    "acl-D07-1076",
    "acl-H05-1091",
    "acl-I05-2023",
    "acl-N07-1015",
    "acl-P04-1054",
    "acl-P04-3022",
    "acl-P05-1053",
    "acl-P06-1104"
  ],
  "sections": [
    {
      "text": [
        "1 12 1 2 1",
        "Wenjie Li , Peng Zhang ' , Furu Wei , Yuexian Hou and Qin Lu",
        "'Department of Computing School of Computer Science and Technology",
        "The Hong Kong Polytechnic University, Hong Kong Tianjin University, China",
        "{cswjli,csfwei,csluqin}@comp.polyu.edu.hk {pzhang,yxhou}@tju.edu.cn",
        "Relation extraction is the task of finding semantic relations between two entities from text.",
        "In this paper, we propose a novel feature-based Chinese relation extraction approach that explicitly defines and explores nine positional structures between two entities.",
        "We also suggest some correction and inference mechanisms based on relation hierarchy and co-reference information etc.",
        "The approach is effective when evaluated on the ACE 2005 Chinese data set."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Relation extraction is promoted by the ACE program.",
        "It is the task of finding predefined semantic relations between two entities from text.",
        "For example, the sentence \"Bill Gates is the chairman and chief software architect of Microsoft Corporation\" conveys the ACE-style relation \"ORG-AFFILIATION\" between the two entities \"Bill Gates (PER)\" and \"Microsoft Corporation (ORG)\".",
        "The task of relation extraction has been extensively studied in English over the past years.",
        "It is typically cast as a classification problem.",
        "Existing approaches include feature-based and kernel-based classification.",
        "Feature-based approaches transform the context of two entities into a liner vector of carefully selected linguistic features, varying from entity semantic information to lexical and syntactic features of the context.",
        "Kernel-based approaches, on the other hand, explore structured representation such as parse tree and dependency tree and directly compute the similarity between trees.",
        "Comparably, feature-based approaches are easier to implement and achieve much success.",
        "In contrast to the significant achievements concerning English and other Western languages, research progress in Chinese relation extraction is quite limited.",
        "This may be attributed to the different characteristic of Chinese language, e.g. no word boundaries and lack of morphologic variations, etc.",
        "In this paper, we propose a character-based Chinese entity relation extraction approach that complements entity context (both internal and external) character AA-grams with four word lists extracted from a published Chinese dictionary.",
        "In addition to entity semantic information, we define and examine nine positional structures between two entities.",
        "To cope with the data sparseness problem, we also suggest some correction and inference mechanisms according to the given ACE relation hierarchy and co-reference information.",
        "Experiments on the ACE 2005 data set show that the positional structure feature can provide stronger support for Chinese relation extraction.",
        "Meanwhile, it can be captured with less effort than applying deep natural language processing.",
        "But unfortunately, entity co-reference does not help as much as we have expected.",
        "The lack of necessary co-referenced mentions might be the main reason."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "Many approaches have been proposed in the literature of relation extraction.",
        "Among them, feature-based and kernel-based approaches are most popular.",
        "Kernel-based approaches exploit the structure of the tree that connects two entities.",
        "Zelenko et al. (2003) proposed a kernel over two parse trees, which recursively matched nodes from roots to leaves in a top-down manner.",
        "Culotta and Sorensen (2004) extended this work to estimate similarity between augmented dependency trees.",
        "The above two work was further advanced by Bunescu and Mooney (2005) who argued that the information to extract a relation between two entities can be typically captured by the shortest path between them in the dependency graph.",
        "Later, Zhang et al. (2006) developed a composite kernel that combined parse tree kernel with entity kernel and Zhou et al. (2007) experimented with a context-sensitive kernel by automatically determining context-sensitive tree spans.",
        "In the feature-based framework, Kambhatla (2004) employed ME models to combine diverse lexical, syntactic and semantic features derived from word, entity type, mention level, overlap, dependency and parse tree.",
        "Based on his work, Zhou et al. (2005) further incorporated the base phrase chunking information and semi-automatically collected country name list and personal relative trigger word list.",
        "Jiang and Zhai (2007) then systematically explored a large space of features and evaluated the effectiveness of different feature subspaces corresponding to sequence, syntactic parse tree and dependency parse tree.",
        "Their experiments showed that using only the basic unit features within each feature subspace can already achieve state-of-art performance, while over-inclusion of complex features might hurt the performance.",
        "Previous approaches mainly focused on English relations.",
        "Most of them were evaluated on the ACE 2004 data set (or a sub set of it) which defined 7 relation types and 23 subtypes.",
        "Although Chinese processing is of the same importance as English and other Western language processing, unfortunately few work has been published on Chinese relation extraction.",
        "Che et al. (2005) defined an improved edit distance kernel over the original Chinese string representation around particular entities.",
        "The only relation they studied is PERSON-AFFLIATION.",
        "The insufficient study in Chinese relation extraction drives us to investigate how to find an approach that is particularly appropriate for Chinese."
      ]
    },
    {
      "heading": "3. A Chinese Relation Extraction Model",
      "text": [
        "Due to the aforementioned reasons, entity relation extraction in Chinese is more challenging than in English.",
        "The system segmented words are already not error free, saying nothing of the quality of the generated parse trees.",
        "All these errors will undoubtedly propagate to the subsequent processing, such as relation extraction.",
        "It is therefore reasonable to conclude that kernel-based especially tree-kernel approaches are not suitable for Chinese, at least at current stage.",
        "In this paper, we study a feature-based approach that basically integrates entity related information with context information.",
        "The classification is based on the following four types of features.",
        "• Entity Positional Structure Features",
        "We define and examine nine finer positional structures between two entities (see Appendix).",
        "They can be merged into three coarser structures.",
        "• Entity Features",
        "Entity types and subtypes are concerned.",
        "• Entity Context Features",
        "These are character-based features.",
        "We consider both internal and external context.",
        "Internal context includes the characters inside two entities and the characters inside the heads of two entities.",
        "External context involves the characters around two entities within a given window size (it is set to 4 in this study).",
        "All the internal and external context characters are transformed to Uni-grams and Bi-grams.",
        "• Word List Features",
        "Although Uni-grams and Bi-grams should be able to cover most of Chinese words given sufficient training data, many discriminative words might not be discovered by classifiers due to the severe sparseness problem of Bi-grams.",
        "We complement character-based context features with four word lists which are extracted from a published Chinese dictionary.",
        "The word lists include 165 prepositions, 105 orientations, 20 auxiliaries and 25 conjunctions.",
        "3.2 Correction with Relation/Argument Constraints and Type/Subtype Consistency Check",
        "An identified relation is said to be correct only when its type/subtype (R) is correct and at the same time its two arguments (ARG-1 and ARG-2) must be of the correct entity types/subtypes and of the correct order.",
        "One way to improve the previous feature-based classification approach is to make use of the prior knowledge of the task to find and rectify the incorrect results.",
        "Table 1 illustrates the examples of possible relations between PER and ORG.",
        "We regard possible relations between two particular types of entity arguments as constraints.",
        "Some relations are symmetrical for two arguments, such as PER_ SOCIAL.FAMILY, but others not, such as ORGAFF.",
        "EMPLOYMENT.",
        "Argument orders are important for asymmetrical relations.",
        "PERSOCIAL.BUS, ORGAFF.EMPLOYMENT, PERSOCIAL.FAMILY, ... ORGAFF.",
        "OWNERSHIP, ...",
        "O PARTWHOLE.SUBSIDIARY, G ORG AFF.INVESTOR/SHARE, ...",
        "Since our classifiers are trained on relations instead of arguments, we simply select the first (as in adjacent and separate structures) and outer (as in nested structures) as the first argument.",
        "This setting works at most of cases, but still fails sometimes.",
        "The correction works in this way.",
        "Given two entities, if the identified type/subtype is an impossible one, it is revised to NONE (it means no relation at all).",
        "If the identified type/subtype is possible, but the order of arguments does not consist with the given relation definition, the order of arguments is adjusted.",
        "Another source of incorrect results is the inconsistency between the identified types and subtypes, since they are typically classified separately.",
        "This type of errors can be checked against the provided hierarchy of relations, such as the subtypes OWNERSHIP and EMPLOYMENT must belong to the ORGAFF type.",
        "There are existing strategies to deal with this problem, such as strictly bottom-up (i.e. use the identified subtype to choose the type it belongs to), guiding top-down (i.e. to classify types first and then subtypes under a certain type).",
        "However, these two strategies lack of interaction between the two classification levels.",
        "To insure consistency in an interactive manner, we rank the first n numbers of the most likely classified types and then check them against the classified subtype one by one until the subtype conforms to a type.",
        "The matched type is selected as the result.",
        "If the last type still fails, both type and subtype are revised to NONE.",
        "We call this strategy type selection.",
        "Alternatively, we can choose the most likely classified subtypes, and check them with the classified type (i.e. subtype selection strategy).",
        "Currently, n is 2.",
        "3.2 Inference with Co-reference Information and Linguistic Patterns",
        "Each entity can be mentioned in different places in text.",
        "Two mentions are said to be co-referenced to one entity if they refers to the same entity in the world though they may have different surface expressions.",
        "For example, both \"he\" and \"Gates\" may refer to \"Bill Gates of Microsoft\".",
        "If a relation \"ORGAFFILIATION\" is held between \"Bill Gates\" and \"Microsoft\", it must be also held between \"he\" and \"Microsoft\".",
        "Formally, given two entities E1={EMn, EM12,..., EMm} and E2={EM2i, EM22, ..., EM2m} (E is an entity, EMy- is a mention of E*), it is true that R(EM1U EM21)= R(EMU EM2k).",
        "This nature allows us to infer more relations which may not be identified by classifiers.",
        "Our previous experiments show that the performance of the nested and the adjacent relations is much better than the performance of other structured relations which suffer from unbearable low recall due to insufficient training data.",
        "Intuitively we can follow the path of \"Nested == Adjacent == Separated == Others\" (Nested, Adjacent and Separated structures are majority in the corpus) to perform the inference.",
        "But soon we have an interesting finding.",
        "If two related entities are nested, almost all the mentions of them are nested.",
        "So basically inference works on \"Adjacent == Separated''.",
        "When considering the co-reference information, we may find another type of inconsistency, i.e. the one raised from co-referenced entity mentions.",
        "It is possible that R(EM„, EM21) + R(EMU EM22) when R is identified based on the context of EM.",
        "Co-reference not only helps for inference but also provides the second chance to check the consistency among entity mention pairs so that we can revise accordingly.",
        "As the classification results of SVM can be transformed to probabilities with a sigmoid function, the relations of lower probability mention pairs are revised according to the relation of highest probability mention pairs.",
        "The above inference strategy is called coreference-based inference.",
        "Besides, we find that pattern-based inference is also necessary.",
        "The relations of adjacent structure can infer the relations of separated structure if there are certain linguistic indicators in the local context.",
        "For example, given a local context \"EM1 and EM2 located EM3\", if the relation of EM2 and EM3 has been identified, EM1 and EM3 will take the relation type/subtype that EM2 and EM3 holds.",
        "Currently, the only indicators under consideration are \"and\" and \"or\".",
        "However, more patterns can be included in the future."
      ]
    },
    {
      "heading": "4. Experimental Results",
      "text": [
        "The experiments are conducted on the ACE 2005 Chinese RDC training data (with true entities) where 6 types and 18 subtypes of relations are annotated.",
        "We use 75% of it to train SVM classifiers and the remaining to evaluate results.",
        "The aim of the first set of experiments is to examine the role of structure features.",
        "In these experiments, a \"NONE\" class is added to indicate a null type/subtype.",
        "With entity features and entity context features and word list features, we consider three different classification contexts: (1), only three coarser structures , i.e. nested, adjacent and separated, are used as feature, and a classifier is trained for each relation type and subtype; (2) similar to (1) but all nine structures are concerned; and (3) similar to (2) but the training data is divided into 9 parts according to structure, i.e. type and subtype classifiers are trained on the data with the same structures.",
        "The results presented in Table 2 show that 9-structure is much more discriminative than 3-structure.",
        "Also, the performance can be improved significantly by dividing training data based on nine structures.",
        "Nine structures are combined to three by merging (b) and (c) to (a), (e) and (f) to (d), (h) and (i) to (g).",
        "Type I Subtype",
        "Precision",
        "Recall",
        "F-measure",
        "3-Structure",
        "0.791BI0.7356",
        "0.3123I0.2923",
        "0.4479I0.41B3",
        "9-Structure",
        "0 75;;0 7502",
        "0.43B9I0.3773",
        "0.5546I0.5021",
        "9-Structure Divide",
        "0.7733I0.74B5",
        "0.5506I0.5301",
        "0.6432I0.6209",
        "Structure",
        "Positive Class",
        "Negative Class",
        "Ratio",
        "Nested",
        "6332",
        "4612",
        "1 : 0.72B3",
        "Adjacent",
        "2028",
        "27100",
        "1 : 13.3629",
        "F-measure",
        "Table 3 Imbalance Training Class Problem In the experiments, we find that the training class imbalance problem is quite serious, especially for the separated structure (see Table 3 above where \"Positive\" and \"Negative\" mean there exists a relation between two entities and otherwise).",
        "A possible solution to alleviate this problem is to detect whether the given two entities have some relation first and if they do then to classify the relation types and subtypes instead of combining detection and classification in one process.",
        "The second set of experiment is to examine the difference between these two implementations.",
        "Against our expectation, the sequence implementation does better than the combination implementation, but not significantly, as shown in Table 4 below.",
        "Table 4 Evaluation of Two Detection and Classification Modes Based on the sequence implementation, we set up the third set of experiments to examine the correction and inference mechanisms.",
        "The results are illustrated in Table 5.",
        "The correction with constraints and consistency check is clearly contributing.",
        "It improves F-measure 7.40% and 6.47% in type and subtype classification respectively.",
        "We further compare four possible consistency check strategies in Table 6 and find that the strategies using subtypes to determine or select types perform better than top down strategies.",
        "This can be attributed to the fact that correction with relation/argument constraints in subtype is tighter than the ones in type.",
        "Type / Subtype_Precision_Recall_F-measure Type I Subtype_Precision Type Selection",
        "Table 6 Comparison of Different Consistency Check Strategies Finally, we provide our findings from the fourth set of experiments which looks at the detailed contributions from four feature types.",
        "Entity type features themselves do not work.",
        "We incrementally add the structures, the external contexts and internal contexts, Uni-grams and Bi-grams, and at last the word lists on them.",
        "The observations are: Uni-grams provide more discriminative information than Bi-grams; external context seems more useful than",
        "internal context; positional structure provides stronger support than other individual recognized features such as entity type and context; but word list feature can not further boost the performance."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "In this paper, we study feature-based Chinese relation extraction.",
        "The proposed approach is effective on the ACE 2005 data set.",
        "Unfortunately, there is no result reported on the same data so that we can compare."
      ]
    },
    {
      "heading": "6. Appendix: Nine Positional Structures",
      "text": []
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work was supported by HK RGC (CERG PolyU5211/05E) and China NSF (60603027).",
        "Separated",
        "939",
        "799B9",
        "1 : B5.1B53",
        "Total",
        "9299",
        "111701",
        "1 : 12.01",
        "Type / Subtype",
        "Precision Recall F-measure",
        "Entity Type + Structure",
        "0.72BBI0.6902 0.4B76I0.461B 0.5B43I0.5534",
        "+ External (Uni-)",
        "0.7935I0.7492 0.5B17I0.547B 0.6713I0.6321",
        "+ Internal (Uni-)",
        "0.B137I0.7769 0.6113I0.5B36 0.69B1I0.6665",
        "+ Bi (Internal & External) 0.B144I0.7B2B 0.6141I0.5902 0.7002I0.6730",
        "+ Wordlist",
        "0.B167I0.7B32 0.6170I0.5917 0.7029I0.6741",
        "Type I Subtype",
        "Precision",
        "Recall",
        "F-measure",
        "Combination",
        "0.7733I0.74B5",
        "0.5506I0.5301",
        "0.6432I0.6206",
        "Sequence",
        "0.7374I0.7151",
        "0.5B60I0.56B3",
        "0.6530I0.6333"
      ]
    }
  ]
}
