{
  "info": {
    "authors": [
      "Prachya Boonkwan",
      "Thepchai Supnithi"
    ],
    "book": "Proceedings of the Third International Joint Conference on Natural Language Processing",
    "id": "acl-I08-1011",
    "title": "Memory-Inductive Categorial Grammar: An Approach to Gap Resolution in Analytic-Language Translation",
    "url": "https://aclweb.org/anthology/I08-1011",
    "year": 2008
  },
  "references": [
    "acl-E03-1036"
  ],
  "sections": [
    {
      "text": [
        "Prachya Boonkwan Thepchai Supnithi",
        "Human Language Technology Laboratory National Electronics and Computer Technology Center (NECTEC) 112 Thailand Science Park, Phaholyothin Road, Khlong 1, Pathumthani 12120, Thailand {prachya.boonkwan, thepchai.supnithi}@nectec.or.th",
        "This paper presents a generalized framework of syntax-based gap resolution in analytic language translation using an extended version of categorial grammar.",
        "Translating analytic languages into Indo-European languages suffers the issues of gapping, because \"deletion under coordination\" and \"verb serialization\" are necessary to be resolved beforehand.",
        "Rudimentary operations, i.e. antecedent memorization, gap induction, and gap resolution, were introduced to the categorial grammar to resolve gapping issues syntactically.",
        "Hereby, pronominal references can be generated for deletion under coordination, while sentence structures can be properly selected for verb serialization."
      ]
    },
    {
      "heading": "1. Background",
      "text": [
        "Analytic language, such as Chinese, Thai, and Vietnamese, is any language whose syntax and meaning relies on particles and word orders rather than inflection.",
        "Pronouns and other grammatical information, such as tense, aspect, and number, expressed by use of adverbs and adjectives, are often omitted.",
        "In addition to deletion under coordination and verb serialization, called gapping (Hendriks, 1995), translation from analytic languages into Indo-European ones becomes a hard task because (1) an ordinary parser cannot parse some problematic gapping patterns and (2) these omissions are necessary to be resolved beforehand.",
        "We classify resolution of the issue into two levels: syntactic/semantic and pragmatic.",
        "Gapping, which we considered as a set of bound variables, can be resolved in syntactic/semantic level (Partee, 1975).",
        "Omission of other grammatical information is, on the contrary, to be resolved in pragmatic level because some extralinguistic knowledge is required.",
        "Consequently, we concentrate in this paper the resolution of gapping by means of syntax and semantics.",
        "Many proposals to gap resolution were introduced, but we classify them into two groups: non-ellipsis-based and ellipsis-based.",
        "Non-ellipsis-based approach is characterized by: (a) strong proof system (Lambek, 1958), and (b) functional composition and type raising that allow coordination of incomplete constituents, such as CG (Ajdukiewicz, 1935; Bar-Hillel, 1953; Moortgat, 2002), CCG (Steed-man, 2000), and multimodal CCG (Baldridge and Kruijff, 2003).",
        "Proposals in this approach, such as (Hendriks, 1995; Jager, 1998a; Jager, 1998b), introduced specialized operators to resolve overt anaphora, while covert anaphora is left unsolved.",
        "Ellipsis-based approach is characterized by treating incomplete constituents as if they are of the same simple type but contain ellipsis inside (Yatabe, 2002; Cryssmann, 2003; Beavers and Sag, 2004).",
        "However, Beavers and Sag (2004) evidenced that ellipsis-based analysis possibly reduces the acceptability of language, because the resolution is per se completely uncontrolled.",
        "In this paper, we introduce an integration of the two approaches that incorporates strong proof system and ellipsis-based analysis.",
        "Antecedent memorization and gap induction are introduced to imitate ellipsis-based analysis.",
        "The directions ofellipsis are also used to improve the acceptability of language.",
        "The rest of the paper is structured as follows.",
        "Section 2 describes the formalization of our method.",
        "Section 3 evidences the coverage of the framework on coping with the gapping issues in analytic languages.",
        "Section 4 further discusses coverage and limitations of the framework comparing with CG and its descendants.",
        "Section 5 explains relevance of the proposed formalism to MT.",
        "Finally, Section 6 concludes the paper and lists up future work."
      ]
    },
    {
      "heading": "2. Memory-Inductive Categorial Grammar",
      "text": [
        "Memory-Inductive Categorial Grammar, abbreviated MICG, is a version of pure categorial grammar extended by ellipsis-based analysis.",
        "On the contrary, it relies on antecedent memorization, gap induction, and gap resolution that outperform CCG's functional composition and type raising.",
        "All grammatical expressions of MICG are, like CG, distinguished by a syntactic category identifying them as either a function from arguments of one type to result another (a.k.a.",
        "function), or an argument (a.k.a.",
        "primitive category).",
        "Let us exemplify the MICG by defining an example grammar G below.",
        "John, Mary, sandwich, noodle h np",
        "The lexicons John, Mary, sandwich, and noodle are assigned with a primitive category np.",
        "The lexicon eats is assigned with a function that forms a sentence s after taking np from the right side (/np) and then taking np from the left side (np\\).",
        "The lexicon and is assigned with a conjunction category (&).",
        "By means of syntactic categories assigned to each lexicon, the derivation for a simple sentence 'John eats noodle' is shown in (1).",
        "John h np eats h (np\\s)/np noodle h np eatso noodle h np\\s John o (eatso noodle) h s",
        "CG suffers some patterns of coordination e.g. SVO&SO as exemplified in (2).",
        "One should find that the second conjunct cannot be reduced into s by means of CG, because it lacks of the main verb 'eats.'",
        "The main verb in the first conjunct should be remembered and then filled up to the ellipsis of the second conjunct to accomplish the derivation.",
        "This matter of fact motivated us to develop MICG by introducing to CG the process of remembering an antecedent from a conjunct, called memorization, and filling up an ellipsis in the other conjunct, called induction.",
        "There are three mandatory operations in MICG: antecedent memorization, gap induction, and gap resolution.",
        "One of two immediate formulae combined in the derivation can be memorized as an antecedent.",
        "The resulted syntactic category is modalized by the modality UD, where D is a direction of memorization (< for the left side and > for the right side), and F is the memorized formula.",
        "The syntactic structure of the memorized formula is also modal-ized with the notation □ to denote the memorization.",
        "It is restricted in MICG that the memorized formula must be unmodalized to maintain mild context-sensitivity.",
        "For example, let us consider the derivation of the first conjunct of (2), 'John eats noodle,' with antecedent memorization at the verb ' eats' in (3).",
        "As seen, a modalized formula can combine with another unmodalized formula while all modalities are preserved.",
        "John eats noodle, and Mary, sandwich.",
        "John h np Cleats h (np\\s)/np noodle h np",
        "Any given formula can be induced for a missing formula, or a gap, at any direction, and the induced gap contains a syntactic category that can be combined to that of the formula.",
        "The resulted syntactic category of combining the formula and the gap is modalized by the modality where D is a direction of induction, and F is the induced formula at the gap.",
        "The syntactic structure of F is an uninstantiated variable and also modalized with the notation O to denote the induction.",
        "The induced formula is necessary to be unmodalized for mild context-sensitivity.",
        "For example, let us consider the derivation of the second conjunct of (2), 'Mary, sandwich,' with gap induction before the word 'sandwich' in (4).",
        "The variable of syntactic structure will be resolved with an appropriate antecedent containing the same syntactic category in the gap resolution process.",
        "sandwich sandwich h np",
        "OX o sandwich h •",
        "Mary o (OX o sandwich) h •",
        "Gap resolution matches between memorized antecedents and induced gaps to associate ellipses to their antecedents during derivation of coordination and serialization.",
        "That is, two syntactic categories □^C and OgC are matched up and canceled from the resulted syntactic category, if they have the same syntactic categories C, their directions D1 and D2 are equal, and their memorized/induced formulae F1and F2 are unified.",
        "For example, let us consider the derivation of 'John eats noodle, and Mary, sandwich' in Figure 1.",
        "The modalities ^<atsh(np\\s)/npS and O<h(np\\s)/nps are matched up together.",
        "Their memorized/induced formulae are also unified by instantiating the variable X with 'eats'.",
        "Eventually, after combining them and the conjunction ' and,' the derivation yields out the formula (John o (□eats o noodle)) o (and o (Mary o (Oeats o sandwich))) h s.",
        "Gap resolution could also indicate argument sharing in coordination and serialization.",
        "OFD1C and can be also matched up, if they have the same syntactic categories C, their directions D1 and D2 are equal, and their memorized/induced formulae F1 and F2 are unified.",
        "However, they must be preserved in the resulted syntactic category.",
        "For example, let us consider the derivation in Figure 2.",
        "By means of unification of induced formulae, the variables X and Y are unified into the variable Z.",
        "A formal definition of MICG is given in Appendix A. MICG is applied to resolve deletion under coordination and serialization in analytic languages in the next section."
      ]
    },
    {
      "heading": "3. Gap Resolution in Analytic Languages",
      "text": [
        "There are two causes of gapping in analytic languages: coordination and serial verb construction.",
        "Each of which complicates the analysis module of MT to resolve such issue before transferring.",
        "In this section, problematic gapping patterns are analyzed in forms of generalized patterns by MICG.",
        "For simplification reason, syntactic structure is suppressed during derivation.",
        "Coordination in analytic languages is more complex than that of Indo-European ones.",
        "Multi-conjunct coordination is suppressed here because biconjunct coordination can be applied.",
        "Besides",
        "SVO&VO and SV&SVO patterns already resolved by CCG (Steedman, 2000), there are also SVO&SV, SVO&V, SVO&SO (already illustrated in Figure 1), and SVO&SA patterns.",
        "The pattern SVO&SV exhibits ellipsis at the object position of the second conjunct.",
        "The analysis of SVO&SV is illustrated in (5).",
        "It shows that the object of the first conjunct is memorized while the verb of the second conjunct is induced for the object.",
        "Analysis of the sentence pattern SVO&V, illustrated in (6), exhibits ellipses at the subject and the object positions of the second conjunct.",
        "The subject and the object of the first conjunct are memorized, while the verb of the second conjunct is induced twice for the object and for the subject, respectively.",
        "The pattern SVO&SA exhibits ellipsis at the predicate position of the second conjunct, because only the adverb (A) is left.",
        "Suppose the adverb, typed (np\\s)/(np\\s), precedes the predicate.",
        "Illustrated in (7), the predicate of the first conjunct is memorized, while the adverb of the second conjunct is inducted for the predicate.",
        "Mary, sandwich",
        ".,, s and h & Mary o (OX o sandwich) h •",
        "eatsh(np\\s)/np J v '",
        "(John o (Cleatso noodle)) o (and o (Mary o (Oeatso sandwich))) h s",
        "OXo(eatsonoodle) h",
        "and h & OY o (drinks o coke) h O<hnps",
        "(OZo (eats o noodle)) o (and o (OZ o (drinks ocoke))) h 0<hnps Figure 2: Preservation of modalities in derivation",
        "Serial verb construction (SVC) (Baker, 1989) is construction in which a sequence of verbs appears in what seems to be a single clause.",
        "Usually, the verbs have a single structural object and share logical arguments (Baker, 1989).",
        "Following (Li and Thompson, 1981; Wang, 2007; Thepkanjana, 2006), we classify SVC into three main types: consecutive/concurrent events, purpose, and circumstance.",
        "No operation specialized for tracing antecedent projection in consecutive/concurrent event construction has been proposed in CG or its descendants.",
        "In MICG, the serialization operation is specialized for this construction.",
        "For example, a Chinese sentence from (Wang, 2007) in (8) is analyzed as in (9).",
        "'He buys a ticket and then goes inside.'",
        "piao jin qu",
        "np\\s On<ps On<ps",
        "Illustrated in (9), the subject argument ta 'he' is projected through the verb sequence by means of memorization and induction modalities.",
        "Purpose construction can also be handled by MICG.",
        "For example, a Thai sentence in (10) is analyzed as in (11).",
        "Illustrated in (11), the two logical arguments, i.e. the subject khau 'he' and the object th5: 'pipe,' are projected through the construction.",
        "SVC expressing circumstance of action is syntactically considered much as consecutive event construction.",
        "For example, a Chinese sentence from (Wang, 2007) in (12) is analyzed as in (13).",
        "I use chopstick eat meal 'Ieatmealwith chopsticks.'",
        "yong kuaizi chi"
      ]
    },
    {
      "heading": "4. Coverage and Limitations",
      "text": [
        "Proven in Theorem 1 in Appendix A, memorized constituents and induced constituents are cross-serially associated.",
        "Controlled by order and direction, each memorized constituent is guaranteed to be cross-serially associated to its corresponding induced gap, while each gap pair is also cross-serially associated revealing argument sharing.",
        "This causes cross-serial association, illustrated in Figure 3, among memorized constituents and induced gaps.",
        "Since paired modalities are either eliminated or preserved and no modalities are left on the start",
        "John eats noodle",
        "John o (Cleats",
        "symbol, it guarantees that there is eventually no modality in derivation.",
        "In conclusion, no excessive gap is over-generated in the language.",
        "shot by Ronaldo' from (Baldridge, 2002) in (16).",
        "MICG's antecedent memorization and gap induction perform well in handling node raising.",
        "Node raising is analyzed in terms of MICG by memorizing the raised constituent at the conjunct it occurs and inducing a gap at the other conjunct.",
        "For example, the right node 'ice cream' is raised in the sentence 'I like but you don't like ice cream.'",
        "The sentence can be analyzed in terms of MICG in (14).",
        "Topicalization and contraposition are still the issues to be concerned for coverage over CCG.",
        "For example, in an example sentence 'Bagels, Yo said that Jan likes' from (Beavers and Sag, 2004), the NP 'Bagels' is topicalized from the object position of the relative clause's complement.",
        "(15) shows un-parsability ofthe sentence.",
        "Furthermore, constituent shifting, such as dative shift and adjunct shift, is not supported by MICG.",
        "We found that it is also constituent extraction as consecutive constituents other than the shifted one are extracted from the sentence.",
        "For example, the adjunct 'skillfully' is shifted next to the main verb in the sentence 'Kahn blocked skillfully a powerful",
        "Kahn blocked skillfully a powerful shot by Ronaldo",
        "Since MICG was inspired by reasons other than those of CCG, the coverage of MICG is therefore different from CCG.",
        "Let us compare CG, CCG, and MICG in Table 1.",
        "CCG initially attempted to handle linguistic phenomena in English and other Indo-European languages, in which topicalization and dative shift play an important role.",
        "Applied to many other languages such as German, Dutch, Japanese, and Turkish, CCG is still unsuitable for analytic languages.",
        "MICG instead was inspired by deletion under coordination and serial verb construction in analytic languages.",
        "We are in progress to develop an extension of MICG that allows topicalization and dative shift avoiding combinatoric explosion."
      ]
    },
    {
      "heading": "5. Relevance to RBMT",
      "text": [
        "Major issues of MT from analytic languages into Indo-European ones include three issues: anaphora generation, semantic duplication, and sentence structuring.",
        "Both syntax and semantics are used to solve such problems by MICG's capability of gap resolution.",
        "Case studies from our RBMT are exemplified for better understanding.",
        "Our Thai-English MT system is rule-based and consists of three modules: analysis, transfer, and generation.",
        "MICG is used to tackle sentences with deletion under coordination and SVC which cannot be parsed by ordinary parsers.",
        "For good speed efficiency, an MICG parser was implemented in GLR-based approach and used to analyze the syntactic structure of a given sentence before transferring.",
        "The parser detects zero anaphora and resolves their antecedents in coordinate structure, and reveals argument sharing in SVC.",
        "Therefore, coordinate structure and SVC can be properly translated.",
        "No experiment has been done on our system yet, but we hope to see an improvement of translation quality.",
        "We planned to evaluate the translation accuracy by using both statistical and human methods.",
        "Coordinate structures in Thai drastically differ from those of English.",
        "This is because Thai allows zero anaphora at subject and object positions while English does not.",
        "Pronouns and VP ellipses must therefore be generated in place of deletion under coordination for grammaticality of English.",
        "Moreover, semantic duplication is often made use to emphasize the meaning of sentence, but its direct translation becomes redundant.",
        "MICG helps us detect zero anaphora and resolve their antecedents, so that appropriate pronouns and ellipses can be generated at the right positions.",
        "By tracing resolved antecedents and ellipses, argument projections are disclosed and they can be used to control verb fusion.",
        "We exemplify three cases of translation of coordinate structure.",
        "Case 1: Pronouns are generated to maintain grammaticality of English translation if the two verbs are not postulated in the verb-fusion table.",
        "For example, a Thai sentence in (17) is translated, while pronouns 'he' and 'it' are generated from Thai NPs nak'rian 'student' and kha'nom 'candy,' respectively.",
        "nak'rian5 sw:Vstudent buy k\"a'nom0candy",
        "'A student buys candy, then he eats",
        "Case 2: Two verbs V1 and V2 are fused togeth-erif they are postulated in the verb-fusion table to eliminate semantic duplication in English translation.",
        "The object form of S2 is necessary to be generated in some cases.",
        "For example, in (18), the translation becomes 'He reports her this matter' instead of 'He tells her to know this matter.'",
        "Two verbs biik 'tell' and sa:b 'know' are fused into a single verb 'report.'",
        "The object form of 'she,' 'her,' is also generated.",
        "(lS) khaus boikVhe tell",
        "saipv know ruaiBrj nn0",
        "this matter 'He reports her this matter.'",
        "Case 3: A VP ellipsis is generated to maintain English grammaticality.",
        "For example, in (19), a VP ellipsis 'do' is generated from a Thai VP mai ch5:b don'tri: rok 'not like rock music.'",
        "don'trii rokOrock music",
        "'John likes rock music, but I do not.'",
        "Sentence structuring is also nontrivial for translation of Thai SVC.",
        "Thai uses SVC to describe consecutive/concurrent events, purposes, and circumstances.",
        "On the other hand, English describes each of those with different sentence structure.",
        "A series of verbs with duplicated semantics can be also clustered to emphasize the meaning of sentence in Thai, while English does not allow this phenomenon.",
        "Because MICG reveals argument sharing in SVC, appropriate sentence structures can be selected by tracing argument sharing between two consecutive verbs.",
        "We exemplify two cases of translation of",
        "SVC.",
        "Case 1: The second verb is participialized if the first verb is intransitive and its semantic concept is an action.",
        "For example, the present participial form of the verb 'see,' 'seeing,' is generated in (20) .",
        "(20) som'cha:jS da:nV chomV pha:p'khianG",
        "Somchai walk see paintings 'Somchai walks seeing paintings.'",
        "Case 2: If the two cases above do not apply to the two verbs, they are translated directly by default.",
        "The conjunction 'and' is automatically added to conjoin two verb phrases.",
        "In case of multiple-conjunct coordination, the conjunction will be added only before the last conjunct.",
        "For example, in (21), a pronoun 'it' is generated from the NP kh6:k 'coke,' while the conjunction 'and' is automatically added.",
        "Linguistic phenomena",
        "CG",
        "CCG",
        "MICG",
        "Basic application",
        "Y",
        "Y",
        "Y",
        "Node raising",
        "N",
        "Y",
        "Y",
        "Topicalization/contraposition",
        "N",
        "Y",
        "N",
        "Constituent shifting",
        "N",
        "Y",
        "N",
        "Deletion under coordination",
        "N",
        "N",
        "Y",
        "Serial verb construction",
        "N",
        "N",
        "Y",
        "(21) phTi'säiu5 swv khoik0 diiiinv my elder sister buy coke drink",
        "'My elder sister buys coke and drinks it.'"
      ]
    },
    {
      "heading": "6. Conclusion and Future Work",
      "text": [
        "This paper presents Memory-Inductive Categorial Grammar (MICG), an extended version of catego-rial grammar, for gap resolution in analytic language translation.",
        "Antecedent memorization, gap induction, and gap resolution, are proposed to cope with deletion under coordination and serial verb construction.",
        "By means of MICG, anaphora can be generated for deletion under coordination, while sentence structure can be properly selected for serial verb construction.",
        "No experiment has been done to show improvement of translation quality by MICG.",
        "The following future work remains.",
        "First, we will experiment on our Thai-English RBMT to measure improvement of translation quality.",
        "Second, criteria for pronominal reference generation in place of deletion under coordination will be studied.",
        "Third, once serial verb construction is analyzed, criteria of sentence structuring will further be studied based on an analysis of antecedent projection.",
        "Fourth and finally, constituent extraction and the use ofextraction direction in the extraction resolution will be studied to avoid combinatoric explosion."
      ]
    }
  ]
}
