{
  "info": {
    "authors": [
      "Anders Søgaard"
    ],
    "book": "COLING – Posters",
    "id": "acl-C08-2025",
    "title": "On the Weak Generative Capacity of Weighted Context-free Grammars",
    "url": "https://aclweb.org/anthology/C08-2025",
    "year": 2008
  },
  "references": [],
  "sections": [
    {
      "text": [
        "It is shown how weighted context-free grammars can be used to recognize languages beyond their weak generative capacity by a one-step constant time extension of standard recognition algorithms."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Weighted context-free grammars (WCFGs) are used to disambiguate strings and thus filter out subsets of the tree languages of the underlying context-free grammars (CFGs).",
        "Weights can either be used as probabilities, i.e. higher weights are preferred, or as penalities, i.e. lower weights are preferred.",
        "The first convention, also followed by Smith and Johnson (2007), is followed here.",
        "The subsets of the tree languages that consist of the heaviest tree for each yield are called the Viterbi tree languages.",
        "String languages are the yields of tree languages, and Viterbi string languages are the yields of Viterbi tree languages.",
        "Infante-Lopez and de Rijke (2006) show that the Viterbi tree languages strictly extend the tree languages.",
        "The idea explored in this paper is simple.",
        "If trees must have particular weights for their yields to be recognized, weights can be used to encode non-local dependencies.",
        "Technically, the {ri,..., rra}-language is defined as all the strings for which the heaviest, i.e. most probable, tree has weight r» e {r\\,..., rn}.",
        "It is shown that this class of languages includes common classes of context-sensitive languages.",
        "Thanks to Mark Hopkins, Daniel Quernheim and the anonymous reviewers for helpful comments.",
        "In other words, standard Viterbi-style recognition algorithms for WCFGs can be used to recognize these classes by a one-step lookup that checks if the weight of the heaviest tree is in {r\\,... ,rn}.",
        "We say that {r\\,..., rra}-languages are {r\\,... ,rn}-recognized.",
        "Sect.",
        "1.1 presents formal preliminaries and a Viterbi-style recognition algorithm for WCFGs.",
        "Note that for simplicity we restrict weights to be rational numbers.",
        "Sect.",
        "2 defines {r\\,..., rra}-languages and presents some examples of WCFGs that {ri,..., rn}-recognize context-sensitive languages.",
        "Sect.",
        "3 gives a rough characterization of the class of languages that can be {r\\,..., rn}-recognized by WCFGs.",
        "Cortes and Mohri (2000) introduced a similar idea in the context of weighted finite-state automata (WFSAs) and showed that WFSAs can be used to {r\\,..., rra}-recognize context-free languages.",
        "Their results are extended in Sect.",
        "4.",
        "It is shown that WFSAs can also be used to {ri,..., rra}-recognize context-sensitive languages.",
        "It is shown, however, that the non-context-free languages that can be {r\\,..., rn}-recognized by WCFGs strictly extend the non-context-free languages that can be {r\\,..., rn}-recognized by WFSAs.",
        "Sect.",
        "5 discusses a more exact characterization of the weak generative capacity of WCFGs in this view.",
        "Coprime WCFGs (CWCFGs), i.e. a subclass of WCFGs where the weights can be partitioned into reciprocal coprimes, are introduced.",
        "It is conjectured that the infinite hierarchy of fc-CWCFGs is non-collapsing, and the classes of languages that can be {r 1,..., rn}-recognized by fc-CWCFGs are characterized in terms of an untraditional modification of indexed grammars."
      ]
    },
    {
      "heading": "3. Bounds on weak generative capacity",
      "text": [
        "A CFG is a 4-tuple G = (N, T, P, S) where N, T are finite and disjoint sets of nonterminal and terminal symbols, P a finite set of production rules of the form A – > (p where A G N and <f> G (N UT)*, and S G N is the start symbol.",
        "A WCFG is a 2-tuple G' = (G,tt) where G = (N,T,P,S) is a CFG and vr : P -»■ | m G Z+,n G Z+, m, n / 0} a (total) weight function.",
        "A leftmost derivation for some CFG G = (N, T, P, S) is a sequence of production rules (pi,... ,pm) with 1 < i < m : pi <E P such that",
        "pi.",
        "uj is called the yield of t(uj).",
        "The tree language T(G) is the set of all leftmost derivations licensed by the production rules of G. The string language of G is the set of yields:",
        "The accumulated weight of a derivation of a string uj n(t{uo)) is the product of the weight of all the productions in t(uj).",
        "The Viterbi tree language of a WCFG then is:",
        "A simple Viterbi recognition algorithm for WCFGs is presented in Figure 1 for further reference."
      ]
    },
    {
      "heading": "2. Our extension",
      "text": [
        "For a set of n many rational numbers {r\\,..., rn}, the language that is {r\\,..., rn}-recognized by the WCFG G, L{ri^rn}(G), is defined:",
        "Call the class of all languages that can be {ri,..., rn}-recognized by a WCFG for all finite and non-empty sets of rational numbers {ri,..., rn} for balanced weighted context-free languages (BWCFLs).",
        "In all our examples {ri,..., rn} will be a singleton set.",
        "Note that all there is needed to do to recognize the BWCFLs is to change line 7 of the Viterbi algorithm in Figure 1 to:",
        "if (S,n) G t(0,ri),ri G {n, ...,rn} then ...",
        "The first result of this paper is the following:",
        "Theorem 3.1.",
        "The BWCFLs strictly extend the context-free languages.",
        "Proof.",
        "It is not difficult to see that any context-free language is a BWCFL.",
        "Simply construct a WCFG G = (G\",vr) for any CFG G' = (N,T,P,S) such that the weight associated with each production rule in P is j.",
        "It then holds that L^iy(G) = L{G>).",
        "The other direction is not very difficult either.",
        "It is shown that {anbncn \\ n > 0}, which is non-context-free by the Bar-Hillel lemma, is a BWCFL.",
        "The language is, for instance, the set of strings L{i}(G) for the WCFG G = (({S,S'},{a,b,c}'p,S),ir) where P is the following set of production rules, and 7r assigns the weights in the left column to the items in the right column:",
        "L|i| = {anbncn | n > 0}.",
        "Some example derivations are presented in Example 3.2.",
        "□ Example 3.2.",
        "Consider the only and thus heaviest tree for abc, resp.",
        "ab:",
        "The weight of the left tree, whose yield is abc, is j.",
        "The weight of the left tree is \\.",
        "7 if (5, fj) G i(0, n) then return success else failure",
        "It should be relatively easy to see that L(G) = {anbmcndm | n > 0}.",
        "It is not difficult to see that the BWCFLs are a subset of the context-sensitive languages.",
        "This follows from the fact that the leftmost derivations in the Viterbi tree languages of WCFGs are linear in the length of the input string; in other words, BWCFLs can be recognized in nondeterministic linear space and thus by a linear bounded automaton.",
        "Since any language that can be represented by a linear bounded automaton is context-sensitive, the BWCFLs must be a subset of the context-sensitive ones.",
        "The set of BWCFLs is also a subset of the range concatenation languages (Boullier, 1998) by the observation made in the introduction that they can be recognized in polynomial (i.e. cubic) time by standard algorithms and a one-step inspection of the weight of the heaviest tree; and by the fact that the range concatenation languages are exactly the languages that can be recognized in polynomial time (Boullier, 1998)."
      ]
    },
    {
      "heading": "4. Weighted finite-state automata",
      "text": [
        "Cortes and Mohri (2000) showed, in similar work, that WFSAs can be used to recognize context-free, i.e. non-regular, languages.",
        "Example 4.1.",
        "The weighted finite-state automaton T = ({q0,qi}, {a,b},5,q0,{qi}) with the following ^-transitions {j}-recognizes the language",
        "It is not difficult to see that the strings ab,aabb,... have derivations with weights \\, whereas the string aab, for example, only has a",
        "Since \\ {j}, aab 1 .",
        "2 • 1 .",
        "derivation with weight",
        "Cortes and Mohri (2000) also formulated an extension of WFSAs over crossproducts of semirings that recognized certain context-sensitive, i.e. non-context-free languages, but their results can be considerably extended.",
        "The automaton in Example 4.2, for example, even recognizes a language conjectured to be outside the linear indexed languages, namely the MIX language (Gaz-dar, 1988).",
        "Example 4.2.",
        "The weighted finite-state automaton T = {{q0,qi,q2,q3},{a,b,c},6,q0,{q0}) with the following ^-transitions {j}-recognizes the MIX language:"
      ]
    },
    {
      "heading": "5. Coprime WCFGs",
      "text": [
        "cab, bcabac,... have derivations with weights \\,",
        "for instance, has no derivations with weig ht\\.",
        "The string cababa has exactly one derivation whose weight is",
        "8(qo,",
        "a)",
        "= qi",
        "s(qi,",
        "a)",
        "= q2",
        "<*(92,",
        "a)",
        "= qs",
        "s(qo",
        "b)",
        "= qi",
        "S(qi",
        "b)",
        "= q2",
        "%2",
        "b)",
        "= qs",
        "6(qo",
        "c)",
        "= qi",
        "S(qi",
        "c)",
        "= q2",
        "%2",
        "c)",
        "= qs",
        "%3,",
        "A)",
        "= qo",
        "Figure 2: Classes of languages {r\\,... ,rn}-recognized by WCFGs and recognized by the extension in Boullier (2000).",
        "where E is an arbitrary set of coprimes (E C N*) such that there is a bijection from the production rules onto themselves such that if a production rule has weight \\ it is projected onto itself, and otherwise, i.e. if it has weight ^ with m / 1 it is projected onto a production rule with weight y.",
        "A fc-CWCFG for k > 1 is now the extension of CWCFG where the sets of production rules the product of whose weights is 1, can be of size at most k, e.g. the WFSA in Example 4.2 is a 3-CWCFG.",
        "The infinite hierarchy of fc-CWCFGs seems to be non-collapsing.",
        "A fc-CWCFG {r\\,..., rn}-recognizes the language {a™ ... d%k \\ n > 0}, but not {a™ ... aV;k+l \\ n > 0}.",
        "It has this property in common with A;-multiple context-free grammars (Seki et al., 1991).",
        "2-CWCFG can be shown to be weakly equivalent with the extension of linear indexed grammars (LIGs) (Gazdar, 1988) where the stack is a multiset or a bag that is globally accessible and not just along spines.",
        "The universal recognition problem for this extension of LIGs can be shown to be NP-complete by reduction of the vertex cover problem, similar to Sogaard et al.",
        "(2007).",
        "The generalization to fc-CWCFG requires stacks of stacks, but is otherwise relatively straight-forward."
      ]
    },
    {
      "heading": "6. Conclusions",
      "text": [
        "It was shown how weighted context-free grammars can be used to recognize languages beyond their weak generative capacity by a one-step constant time extension of standard recognition algorithms.",
        "The class of languages that can be recognized this way strictly extends the context-free languages, but is included in the cubic time recognizable ones.",
        "Boullier (2000) defines what he calls a \"cubic time extension of CFG\" that recognizes generalizations of the copy language that are beyond",
        "WCFG.",
        "It remains to be seen if the set of BWCFLs is a strict subset of the set of languages that can be recognized by this formalism.",
        "They all recognize the classes of languages in Figure 2.",
        "B.",
        "(2000)",
        "WCFGs",
        "{al... al | n > 0}",
        "/",
        "/",
        "MIX",
        "/",
        "/",
        "{anbmcndm | m, n > 0}",
        "/",
        "/",
        "{wcw \\ w <E {a, b}*}",
        "/",
        "/"
      ]
    }
  ]
}
