{
  "info": {
    "authors": [
      "Fumiyo Fukumoto",
      "Yoshimi Suzuki",
      "Kazuyuki Yamashita"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C08-1030",
    "title": "Retrieving Bilingual Verb-Noun Collocations by Integrating Cross-Language Category Hierarchies",
    "url": "https://aclweb.org/anthology/C08-1030",
    "year": 2008
  },
  "references": [
    "acl-E03-1023",
    "acl-J03-3002",
    "acl-J93-1007",
    "acl-P03-1004",
    "acl-P04-1067",
    "acl-P06-1011",
    "acl-P93-1016",
    "acl-P98-1041",
    "acl-W04-3208"
  ],
  "sections": [
    {
      "text": [
        "This paper presents a method of retrieving bilingual collocations of a verb and its objective noun from cross-lingual documents with similar contents.",
        "Relevant documents are obtained by integrating cross-language hierarchies.",
        "The results showed a 15.1% improvement over the baseline non-hierarchy model, and a 6.0% improvement over use of relevant documents retrieved from a single hierarchy.",
        "Moreover, we found that some of the retrieved collocations were domain-specific."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "A bilingual lexicon is important for cross-lingual NLP applications, such as CLIR, and multilingual topic tracking.",
        "Much of the previous work on finding bilingual lexicons has made use of comparable corpora, which exhibit various degrees of parallelism.",
        "Fung et al.",
        "(2004) described corpora ranging from noisy parallel, to comparable, and finally to very non-parallel.",
        "Obviously, the latter are easy to collect because very non-parallel corpora consist of sets of documents in two different languages from the same period of dates.",
        "However, a good solution is required to produce a higher quality of lexicon retrieval.",
        "In this paper, we focus on English and Japanese bilingual verb-objective noun collocations which we call verb-noun collocations and retrieve them using very non-parallel corpora.",
        "The method first finds cross-lingual relevant document pairs with similar contents from non-parallel corpora, and then we estimate bilingual verb-noun collocations within these relevant documents.",
        "Relevant documents are defined here as pairs of English and Japanese documents that report identical or closely related contents, e.g., a pair of documents describing an aircraft crash and the ensuing investigation to compensate the victims' families or any safety measures proposed as a result of the crash.",
        "In the task of retrieving cross-lingual relevant documents, it is crucial to identify an event as something occurs at some specific place and time associated with some specific action.",
        "One solution is to use a topic, i.e., category in the hierarchical structure, such as Internet directories.",
        "Although a topic is not an event, it can be a broader class of event.",
        "Therefore, it is helpful for retrieving relevant documents, and thus bilingual verb-noun collocations.",
        "Consider the Reuters'96 and Mainichi newspaper documents shown in Figure 1.",
        "The documents report on the same event, \"Russian space station collides with cargo craft,\" were published within two days of each other, and have overlapping content.",
        "Moreover, as indicated by the double-headed arrows in the figure, there are a number of bilingual collocations.",
        "However, as shown in Figure 1, the Reuters document is classified into \"Science and Technology,\" while the Mainichi document is classified into \"Space Navigation\".",
        "This is natural because categories in the hierarchical structures are defined by different human experts.",
        "Therefore, a hierarchy tends to have some bias in both defining hierarchical structure and classifying documents, and as a result some hierarchies written in one language are coarse-grained, while others written in other languages are fine-grained.",
        "Our attempt using the results of integrating different hierarchies for retrieving relevant documents was postulated to be able to solve this defect of the differences in hierarchies, and to improve the efficiency and efficacy of retrieving collocations."
      ]
    },
    {
      "heading": "2. System Description",
      "text": [
        "The method consists of three steps: integrating category hierarchies, retrieving cross-lingual relevant documents, and retrieving collocations from relevant documents.",
        "The method for integrating different category hierarchies does not simply merge two different hierarchies into a large hierarchy, but instead retrieves pairs of categories, where each category is relevant to each other.",
        "The procedure consists of two sub-steps: Cross-language text classification (CLTC) and estimating category correspondences.",
        "The corpora we used are the Reuters'96 and the RWCP of the Mainichi Japanese newspapers.",
        "In the CLTC task, we used English and Japanese data to train the Reuters'96 categorical hierarchy and the Mainichi UDC code hierarchy (Mainichi hierarchy), respectively.",
        "In the Reuters'96 hierarchy, the system was trained using labeled English documents, and classified translated labeled Japanese",
        "Reuters'96 hierarchy UDC Mainichi hierarchy",
        "I Retrieving category pairs | \\m, mi) ~\\ f(m2i, n)",
        "documents.",
        "Similarly, for Mainichi hierarchy, the system was trained using labeled Japanese documents, and classified translated labeled English documents.",
        "We used Japanese-English and English-Japanese MT software.",
        "We used a learning model, Support Vector Machines (SVMs) (Vapnik, 1995), to classify documents, as SVMs have been shown to be effective for text classification.",
        "We used the \"One-against-the-Rest\" version of the SVMs at each level of a hierarchy.",
        "We classify test documents using a hierarchy by learning separate classifiers at each internal node of the hierarchy.",
        "We used a Boolean function b(L{)&&- ■ -&&6(LTO), where b(Li) is a decision threshold value of the i-th hierarchical level.",
        "The process is repeated by greedily selecting sub-branches until a leaf is reached.",
        "We classified translated Mainichi documents with Mainichi category m into Reuters categories using SVMs classifiers.",
        "Similarly, each translated Reuters document with category r was classified into Mainichi categories.",
        "Figure 2 illustrates the classification of Reuters and Mainichi documents.",
        "A document with Mainichi category \"ml\" is classified into Reuters category \"rl2\", and a document with Reuters category \"rl\" is classified into Mainichi category \"m21\".",
        "As a result, we obtained category pairs, e.g., (rl2, ml), and (m21, rl), from the documents assigned to the categories in each hierarchy.",
        "The assumption of category correspondences is that semantically similar categories, such as \"Equity markets\" and \"Bond markets\" exhibit similar statistical properties than dissimilar categories, such as \"Equity markets\" and \"Sports\".",
        "We applied % statistics to the results of CLTC.",
        "Let us take a look at the Reuters'96 hierarchy.",
        "Suppose that the translated Mainichi document with Mainichi category m G M (where M is a set of Mainichi categories) is assigned to Reuters category r G R (R is a set of Reuters'96 categories).",
        "We can retrieve Reuters and Mainichi category pairs, and estimate category correspondences according to the % statistics shown in Eq.",
        "(1).",
        "Date=970625 Category = RUSSIA: Russian space st:",
        "Russia's Mir space station c manual docking exercise, r; poorly financed Russian sp",
        "Russian space officials des accident in recent times\"; ir no immediate danger to a U on board.",
        "The unmanned, Russian-ov 1.20p.m.",
        "(0920 GMT) with t main section of Mir, causing",
        "A spokesman for the U.S. s the crew had been able to s collisidh.",
        "Science and Tec ition collides with",
        "ollided on Wed. w iising fresh doubts ace programme.",
        "-ribed the collision Solving the ageing .S.",
        "astronaut and",
        "med Progress cai ie Spectra scient a partial loss of a",
        "lace agency NAS eaUrff the damag",
        "mology cargo craft.",
        "ith a cargo craft during a about the safety of the",
        "as \"the most serious vessel but said there was two Russian cosmonauts",
        "jjoxraft collided at",
        "ic module attached to the",
        "ir pressure.",
        "\\",
        "A said earlier on Wed. that id compartment after the",
        "Date=970626325 Categc",
        "*g»St--3-MjE*lj *",
        "r.=EX£925B5flSH*]Pi.",
        "xf-ixa^rs – .ikiti&A\"",
        "*St©ft«|[*fFMf£iii«.",
        "*a S)-5i**ltrit,iai»a)K's< K-y*v?LTiAfcr:7Q$rV; ux34j*<xx4i/a>rorx'",
        "r5-vi/jro^s»ff±fc*)id",
        "ry = Space Navig 7©¥S*f\\->.",
        "Im,",
        "*.34J©»»£LT IU »firt©£ää!b<",
        "ition \\ \\ \\ ft, ma^iDRlffitt",
        "3>e*J-b^i\\*2SB,« >X34J ©frMSr.l=QI.»T, i^xAro-aiSSfflliJ;*,",
        "5.35J©hfe±lf{^fl2VB:?",
        "^kkz.hs 2¥a¥», rip^ -ji/jtif[*li««»i=afe.",
        "Two documents are identical?",
        "Figure 3 : Retrieving relevant documents",
        "Here, the co-occurrence frequency of r and m, f(r, m) is equal to the number of category m documents assigned to r. Similar to the Reuters hierarchy, we can estimate category correspondences from Mainichi hierarchy, and extract a pair (r, m) according to the x value.",
        "We note that the similarity obtained by each hierarchy does not have a fixed range.",
        "Thus, we apply the normalization strategy shown in Eq.",
        "(2) to the results obtained by each hierarchy to bring the similarity value into the range [0,1].",
        "Let SPr and SPm are a set of pairs obtained by Reuters hierarchy and Mainichi hierarchy, respectively.",
        "We construct the set of r and m category pairs, SP(r>m) = {(r,m) | (r,m) G SPr n SPm}, where each pair is sorted in descending order of xvalue.",
        "For each pair of SP(r>m-), if the value of xis higher than a lower bound Lx2, two categories, r and m, are regarded as similar.",
        "We used the results of category correspondences from the Reuters and Mainichi hierarchies to retrieve relevant documents.",
        "Recall that we used English and Japanese documents with quite different hierarchical structures.",
        "The task thus consists of two criteria: retrieving relevant documents based on English (we call this IrrLhi & Eng) and in Japanese (InLhi & Jap).",
        "Let dri (1 < % < s) be a Reuters document that is classified into the Reuters category r. Let d!]",
        "(1 < j < t) be a Mainichi document that belongs to the Mainichi category m. Here, s and t are the number of documents classified into r and m, respectively.",
        "Each Reuters document cÇ is translated into a Japanese document d\\-mt by an MT system.",
        "Each Mainichi document cPJ is translated into an English document d™-m*.",
        "Retrieving relevant documents itself is quite simple.",
        "As illustrated in Figure 3, in \"InLhi & Eng\" with a set of similar categories consisting of r and m, for each Reuters and translated Mainichi document, we calculate BM25 similarities between them.",
        "where w is a word within d!p-mt, and u/) is the weight ofw, if/) = log ^\"\"^gj5-1.",
        "N is the number of Reuters documents within the same category r, and n is the number of documents which contains w. K refers to fci((l - b) + b-£^).",
        "hi, b, and ks are parameters and set to 1, 1, and 1,000, respectively, dl is the document length of d^ and avdl is the average document length in words, tf and qtf are the frequency of occurrence of w in c£, and d™-\"*, respectively.",
        "If the similarity value between them is higher than a lower bound Lq, we regarded these as relevant documents.",
        "The procedure is applied to all documents belonging to the sets of similar categories.",
        "\"InLhi & Jap\" is the same as \"InLhi & Eng\" except for the use of dl~mt and for comparison.",
        "We compared the performance of these tasks, and found that \"InLhi & Eng\" was better than \"InLhi & Jap\".",
        "In section 3, we show results with \"InLhi & Eng\" due to lack of space.",
        "The final step is to estimate bilingual correspondences from relevant documents.",
        "All Japanese documents were parsed using the syntactic analyzer CaboCha (Kudo and Matsumoto, 2003).",
        "English documents were parsed with the syntactic analyzer (Lin, 1993).",
        "In both English and Japanese, we extracted all the dependency triplets(o6j, n, v).",
        "Here, n refers to a noun which is an object(obj) of a verb v in a sentence.",
        "Hereafter, we describe the Reuters English dependency triplet as vnr, and that of Mainichi as vnm.",
        "The method to retrieve bilingual correspondences consists of two sub-steps: document-based retrieval and sentence-based retrieval.",
        "We extract vnr and vnm pairs from the results of relevant documents:",
        "co(S-vnr n Smtjunm) I Sjvnr I + I Smt-vnm \\ -2co(S.vnr n Smt.vnm) + 2",
        "Next, we estimate the bilingual correspondences according to the % (vnr, vnm) statistics shown in Eq.",
        "(1).",
        "In Eq.",
        "(1), we replace r by vnr and m by vnm.",
        "f(r, m) is replaced by f(vnr,vnm), i.e., the co-occurrence frequency of and vnm.",
        "We note that bilingual correspondences obtained by document-based retrieval are not reliable.",
        "This is because many verb-noun collocations appear in a pair of relevant documents, as can be seen from Figure 1.",
        "Therefore, we applied sentence-based retrieval to the results obtained by document-based retrieval.",
        "First, we extract vn,.",
        "and vnm pairs the % values of which are higher than 0.",
        "Next, for each vrir and vnm pair, we assign sentence-based similarity:",
        "S-vnreSetr,S-vnmeSetm",
        "Here, Setr and Setm are a set of sentences that include vnr and vnm, respectively.",
        "The similarity between S-vnr and S-vnm is shown in Eq.",
        "(6).",
        "where \\X\\is the number of content words in a sentence X, and co{S-vnr n Smt-vnm) refers to the number of content words that appear in both S-vrir and Smt-vnm.",
        "Smt-vnm is a translation result of S-vmm.",
        "We retrieved vnr and vnm as a bilingual lexicon that satisfies:",
        "Ssim{ynri, vn„",
        "where BP{vnm) is a set of bilingual verb-noun pairs, each of which includes vrim on the Japanese side."
      ]
    },
    {
      "heading": "3. Experiments",
      "text": [
        "We used Reuters'96 and UDC code hierarchies.",
        "The Reuters'96 corpus from 20th Aug. 1996 to 19th Aug. 1997 consists of 806,791 documents organized into coarse-grained categories, i.e., 126 categories with a four-level hierarchy.",
        "The RWCP corpus labeled with UDC codes selected from 1994 Mainichi newspaper consists of 27,755 documents organized into a fine-grained categories, i.e., 9,951 categories with a seven-level hierarchy (RWCP., 1998).",
        "We used Japanese-English and English-Japanese MT software (Internet Honyaku-no-Ousama for Linux, Ver.5, IBM Corp.) for CLTC.",
        "We divided both Reuters'96 (from 20th Aug. 1996 to 19th May 1997) and RWCP corpora into two equal sets: a training set to train SVM classifiers, and a test set for TC to generate pairs of similar categories.",
        "We divided the test set into two parts: the first was used to estimate thresholds, i. e., a decision threshold b used in CLTC, and lower bound Lx2; and the second was used to generate pairs of similar categories using the threshold.",
        "We chose b = 0 for each level of a hierarchy.",
        "The lower bound Lx2 was .003.",
        "We selected 109 categories from Reuters and 4,739 categories from Mainichi, which have at least five documents in each set.",
        "We used content words for both English and Japanese documents.",
        "We compared the results obtained by hierarchical approach to those obtained by the flat non-hierarchical approach.",
        "Moreover, in the hierarchical approach, we applied a Boolean function to each test document.",
        "For evaluation of category correspondences, we used Fl-score (Fl) which is a measure that balances precision (Prec) and recall (Rec).",
        "Let Cor be a set of correct category pairs.",
        "The precise definitions of the precision and recall of the task are given below:",
        "Table 1 shows Fl of category correspondences with Lx2 = .003.",
        "\"Mai & Reu\" shows the results obtained by our method.",
        "\"Mai\" and \"Reu\" show the results using only one hierarchy.",
        "For example, \"Mai\" shows the results in which both Mainichi and translated Reuters documents are classified into categories with Mainichi hierarchy, and estimated category correspondences.",
        "Integrating hierarchies is more effective than only a single hierarchy.",
        "Moreover, we found advantages in the Fl for the hierarchical approach (\"Hierarchy\" in Table 1) in comparison with a baseline flat approach (\"Flat\").",
        "We note that the result of \"Mai\" was worse than that of \"Reu\" in both approaches.",
        "One reason is that the accuracy of TC.",
        "The micro-average Fl of TC for Reuters hierarchy was .815, while that of Mainichi was .673, as Mainichi hierarchy consists of many categories, and the number of training data for each category were smaller than those of Reuters.",
        "The results obtained by our method depend on the performance of TC.",
        "Therefore, it will be necessary to examine some semi-supervised learning techniques to improve classification accuracy.",
        "The training data for choosing the lower bound Lo used in the relevant document retrieval is Reuters and RWCP from 13th to 21st Jun.",
        "1997.",
        "The difference in dates between them is less than ± 3 days.",
        "For example, when the date of the RWCP document is 18th Jun., the corresponding Reuters date is from 15th to 21st Jun.",
        "We chose Lo that maximized the average Fl among them.",
        "Table 2 shows the test data, i.e., the total number of collected documents and the number of related documents collected manually for the evaluation.We implemented the following approaches including related work, and compared these results with those obtained by our methods, InLhi & Eng.",
        "1.",
        "No_hierarchy: Categories with each hierarchy are not used in the approach.",
        "The approach is the same as the method reported by Collier et al.",
        "(1998) except for term weights and similarities.",
        "We calculate similarities between Reuters and translated Mainichi documents, where the difference in dates is less than ± 3 days.",
        "(No_hi & Eng).",
        "2.",
        "Hierarchy: The approach uses only Reuters hierarchy (we call this Reu Hierarchy).",
        "Reuters documents and translated Mainichi documents are classified into categories with Reuters hierarchy.",
        "We calculate BM25 between Reuters and Mainichi documents within the same category.",
        "The procedure is applied for all categories of the hierarchies.",
        "The judgment of relevant documents was the same as our method: if the value of similarity between two documents is higher than a lower bound Lo, we regarded them as relevant documents.",
        "The retrieval results are shown in Table 3 and Figure 4.",
        "Table 3 shows best performance of each method against L#.",
        "As can be seen clearly from Table 3 and Figure 4, the results with integrating hierarchies improved overall performance.",
        "Prec",
        "Hierarchy Rec",
        "Fl",
        "Prec",
        "Flat Rec",
        "Fl",
        "Mai & Reu",
        ".503",
        ".463",
        ".482",
        ".462",
        ".389",
        ".422",
        "Reu",
        ".342",
        ".329",
        ".335",
        ".240",
        ".296",
        ".265",
        "Mai",
        ".157",
        ".293",
        ".204",
        ".149",
        ".277",
        ".194",
        "Jap – > Eng(± 3)",
        "Total # of doc.",
        "Total # of",
        "Jap",
        "Eng",
        "relevant doc.",
        "26/06/97",
        "391",
        "15,482",
        "513",
        "Figure 4: Fl of retrieving relevant documents",
        "Table 4 shows the total number of document pairs (P), Reuters (E), and Mainichi documents (J), which satisfied the similarity lower bound Lq.",
        "As shown in Table 4, the number of retrieved pairs by non-hierarchy approach was much greater than that of \"IntJii & Eng\" at all Lq values.",
        "This is because pairs are retrieved by using only the BM25.",
        "Therefore, many of the document pairs retrieved do not have closely related contents, even if Lq is set to a higher value.",
        "The results of a single hierarchy showed recall of .544, while that of the integrating hierarchies was .585 at the same Le value (20), as shown in Table 3.",
        "This is because in the single hierarchy method, there are some translated Mainichi documents that are not correctly classified into categories with the Reuters hierarchy.",
        "For example, \"Hashimoto remarks on fx rates\" in Mainichi documents should be classified into Reuters category \"Forex markets,\" but it was classified into \"Government\".",
        "As a result, \"U.S. Treasury has no comment on Hashimoto fx remarks\" in Reuters category \"Forex markets\" and the document \"Hashimoto\" are not retrieved by a single hierarchy approach.",
        "In contrast, in the integrating method, these two documents are classified correctly into a pair of similar categories, i.e., the \"U.S Treasury\" is classified into Reuters category \"Forex markets\", and the \"Hashimoto\" is classified into Mainichi category \"Money and banking\".",
        "These observations show that our method contributes to the retrieval of relevant documents.",
        "Table 4: # of documents vs Lq",
        "Table 5: # of J/E document pairs with Lq",
        "Finally, we report the results of bilingual verb-noun collocations.",
        "The data for relevant document retrieval was the Reuters and Mainichi corpora from the same period, i.e., 20th Aug. 1996 to 19th Aug. 1997.",
        "The total number of Reuters documents was 806,791, and that of Mainichi was 119,822.",
        "As the number of Reuters documents was far greater than that of Mainichi documents, we estimated collocations from the results of cross-lingually retrieving relevant English documents with Japanese query documents.",
        "The difference in dates between them was less than ± 3 days.",
        "Table 5 shows retrieved relevant documents that showed best performance of each method against Lq.",
        "From these data, we extracted bilingual verb-noun collocations.",
        "Table 6 shows the numbers of English and Japanese monolingual verb-noun collocations, those of candidate collocations against which bilingual correspondences were estimated, and those of correct collocations.",
        "\"D & S\" of candidate collocations indicates the number of collocations when we applied both document-and sentence-based retrieval.",
        "\"Doc\" indicates the number of collocations when we applied only document-based retrieval.",
        "\"D & S\" and \"Doc\" of correct collocations show the number of correct collocations in the topmost 1,000 according to sentence similarity and the % statistics, respectively.",
        "As shown in",
        "Prec",
        "Ree",
        "Fl-score",
        "U",
        "No_hi & Eng",
        ".417",
        ".322",
        ".363",
        "40",
        "Reu Hierarchy",
        ".356",
        ".544",
        ".430",
        "20",
        "IrrLhi & Eng",
        ".839",
        ".585",
        ".689",
        "20",
        "Approach",
        "Lower Bound Lg",
        "100",
        "80",
        "60",
        "40",
        "20",
        "P",
        "188",
        "319",
        "630",
        "1,229",
        "3,000",
        "No_hi & Eng",
        "E",
        "150",
        "272",
        "543",
        "987",
        "2,053",
        "J",
        "13",
        "16",
        "19",
        "22",
        "25",
        "P",
        "12",
        "17",
        "25",
        "47",
        "186",
        "Reu Hierarchy",
        "E",
        "8",
        "12",
        "19",
        "36",
        "142",
        "J",
        "8",
        "10",
        "12",
        "18",
        "25",
        "P",
        "46",
        "61",
        "83",
        "135",
        "218",
        "IntJii & Eng",
        "E",
        "32",
        "43",
        "60",
        "99",
        "158",
        "J",
        "4",
        "4",
        "5",
        "7",
        "9",
        "-A- Int_hi & Eng",
        "f",
        "---■---Reu Hierarchy",
        ".......-I-......",
        "So hi & Eng",
        "S",
        "\\",
        "\"■+■......._",
        "Approach & (Le)",
        "pairs",
        "Eng",
        "Jap",
        "No_hi & Eng (40)",
        "3,042,166",
        "428,042",
        "70,080",
        "Reu Hierarchy (20)",
        "27,181,243",
        "43,0181",
        "99,452",
        "IntJii & Eng (20)",
        "81,904,243",
        "45,965",
        "654,787",
        "Table 6, the results obtained by integrating hierarchies showed a 15.1% (32.8 - 17.7) improvement over the baseline non-hierarchy model, and a 6.0% (32.8 - 26.8) improvement over use of a single hierarchy.",
        "We manually compared those 328 bilingual collocations with an existing bilingual lexicon where 78 of them (23.8%) were not included in it.",
        "Moreover, 168 of 328 (51.2%) were not correctly translated by Japanese-English MT software.",
        "These observations clearly support the usefulness of the method.",
        "It is very important to compare the column \"rate\" for the numbers of candidate collocations with that for the numbers of correct collocations.",
        "In all approaches, sentence-based retrieval was effective in removing useless collocations, especially in our method, about 1.5% of the size obtained by \"Doc\" was retrieved, while about 4.6(328/72) times the number of correct collocations were obtained in the topmost 1,000 collocations.",
        "These observations showed that sentence-based retrieval contributes to a marked reduction in the number of useless collocations without a decrease in accuracy.",
        "The last column in Table 6 shows the results using Inverse Rank Score (IRS), which is a measure of system performance by considering the rank of correct bilingual collocations within the candidate collocations.",
        "It is the sum of the inverse rank of each matching collocations, e.g., correct collocations by manual evaluation matches at ranks 2 and 4 give an IRS of \\ + \\ = 0.75.",
        "With at most 1,000 collocations, the maximum IRS score is 7.485, and the higher the IRS value, the better the system performance.",
        "As shown in Table 6, the performance by integrating hierarchies was much better than that of the non-hierarchical approach, and slightly better than those obtained by a single hierarchy.",
        "However, correct retrieved collocations were different from each other.",
        "Table 7 lists examples of bilingual collocations obtained by a single hierarchy and integrating hierarchies.",
        "The category is \"Sport\".",
        "(x,y) of category pair in Table 7 refer to Reuters and Mainichi category correspondences.",
        "Examples in Table 7 denote only English verbnoun collocations.",
        "It is interesting to note that 12 of 154 collocations, such as \"earn medal\" and \"block shot\" obtained by integrating hierarchies were also obtained by a single hierarchy approach.",
        "However, other collocations such as \"get strikeout\" and \"make birdie\" which were obtained in a particular category (Sport, Baseball) and (Sport, Golf), did not appear in either of the results using a single hierarchy or a non hierarchical approach.",
        "These observations again clearly support the usefulness of our method."
      ]
    },
    {
      "heading": "4. Previous Work",
      "text": [
        "Much of the previous work on finding bilingual lexicons used comparable corpora.",
        "One attempt involved directly retrieving bilingual lexicons from corpora.",
        "One approach focused on extracting word translations (Gaussier et al., 2004).",
        "The techniques were based on the idea that semantically similar words appear in similar contexts.",
        "Unlike parallel corpora, the position of a word in a document is useless for translation into the other language.",
        "In these techniques, the frequency of words in the monolingual document is calculated and their contextual similarity is measured across languages.",
        "Another approach focused on sentence extraction (Fung and Cheung, 2004).",
        "One limitation of all these methods is that they need to control the experimental evaluation to avoid estimation of every bilingual lexicon appearing in comparable corpora.",
        "The alternative consists of two steps: first, cross-lingual relevant documents are retrieved from comparable corpora, then bilingual term correspondences within these relevant documents are estimated.",
        "Thus, the accuracy depends on the performance of relevant documents retrieval.",
        "Much of the previous work in finding relevant documents used MT systems or existing bilingual lexicons to translate one language into another.",
        "Document pairs are then retrieved using some measure of document similarity.",
        "Another approach to retrieving relevant documents involves the collection of relevant document URLs from the WWW (Resnik and Smith, 2003).",
        "Utsuro et al.",
        "(2003) proposed a method for acquiring bilingual lexicons that involved retrieval of relevant English and Japanese documents from news sites on the WWW.",
        "Our work is also applicable to retrieval of relevant documents on the web because it estimates every bilingual lexicon only appearing in a set of smaller documents belonging to pairs of similar categories.",
        "Munteanu and Marcu (2006) proposed a method for extracting parallel sub-sentential fragments from very non-parallel bilingual corpora.",
        "The method is based on the fact that very non-parallel corpora has none or few good sentence pairs, while existing methods for exploiting comparable corpora look for parallel data at the sentence level.",
        "Their methodology is the first aimed at detecting sub-sentential correspondences, while they have not reported that the method is also applicable for large amount of data with good performance, especially in the case of large-scale evaluation such as that presented in this paper."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "We have developed an approach to bilingual verb-noun collocations from non-parallel corpora.",
        "The results showed the effectiveness of the method.",
        "Future work will include: (i) applying the method to retrieve other types of collocations (Smadja, 1993), and (ii) evaluating the method using Internet directories.",
        "Approach & (Le)",
        "#of",
        "Monolingual patterns",
        "Candidate collocations",
        "# of Correct collocations (top 1,000)",
        "Inverse rank score",
        "(top 1,000)",
        "# of collocations",
        "rate (D& S/ Doc)",
        "# of collocations",
        "rate (D& S/ Doc)",
        "Jap",
        "Eng",
        "D & S",
        "Doc",
        "D & S",
        "Doc",
        "D&S",
        "Doc",
        "No_hi & Eng (40)",
        "25,163",
        "44,762",
        "25,163",
        "6,976,214",
        ".361",
        "177",
        "62",
        "2.9",
        "1.35",
        "0.71",
        "Reu Hierarchy (20)",
        "10,576",
        "37,022",
        "10,576",
        "1,272,102",
        ".831",
        "268",
        "64",
        "4.2",
        "2.24",
        "1.41",
        "IntJii & Eng (20)",
        "8,347",
        "21,524",
        "8,347",
        "560,472",
        "1.489",
        "328",
        "72",
        "4.6",
        "2.33",
        "1.46",
        "Approach & (Le)",
        "Category or category pair",
        "# of collocations",
        "# of correct collocations(%)",
        "Examples (English)",
        "D&S",
        "Doc",
        "Reu_Hierarchy (20)",
        "Sport",
        "262",
        "19,391",
        "36(13.7)",
        "create chance, earn medal, feel pressure block shot, establish record, take chance",
        "IntJii & Eng (20)",
        "(Sport, Baseball)",
        "110",
        "8,838",
        "24(21.8)",
        "get strikeout, leave base, throw pitch",
        "(Sport, Relay)",
        "177",
        "3,418",
        "18(10.2)",
        "lead ranking, run km, win athletic",
        "(Sport, Tennis)",
        "115",
        "2,656",
        "32(27.8)",
        "lose prize_money, play exhibition_game",
        "(Sport, Golf)",
        "131",
        "2,654",
        "28(21.4)",
        "make birdie, have birdie, hole putt, miss putt",
        "(Sport, Soccer)",
        "86",
        "1,317",
        "34(39.5)",
        "block shot, score defender, give free kick",
        "(Sport, Sumo)",
        "75",
        "773",
        "2(2.7)",
        "lead sumo, set championship",
        "(Sport, SkLjump)",
        "68",
        "661",
        "10(14.7)",
        "postpone downhill, earn medal",
        "(Sport, Football)",
        "37",
        "461",
        "6(16.2)",
        "play football, lease footbalLstadium"
      ]
    }
  ]
}
