{
  "info": {
    "authors": [
      "Makiko Matsuda",
      "Tomoe Takahashi",
      "Hiroki Goto",
      "Yoshikazu Hayase",
      "Robin Lee Nagano",
      "Yoshiki Mikami"
    ],
    "book": "Proceedings of the 6th Workshop on Asian Language Resources",
    "id": "acl-I08-7004",
    "title": "Technical Terminology in Asian Languages: Different Approaches to Adopting Engineering Terms",
    "url": "https://aclweb.org/anthology/I08-7004",
    "year": 2008
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Nagaoka University of Technology 1603-1 Kamitomioka, Nagaoka, Japan",
        "nagano.robin@chello.hu",
        "Toyama National College of Maritime Technology 1-2 Ebie-Neriya, Imizu , Japan",
        "Terminology development in education, science and technology is a key to formulating a knowledge society.",
        "The authors are developing a multilingual engineering terminology dictionary consisting of more than ten thousand engineering terms each for ten Asian languages and English.",
        "The dictionary is primarily designed to support foreign students who are studying engineering subjects at Japanese higher educational institutions in the Japanese language.",
        "Analysis of the lexical terms could provide useful knowledge for language resource creators.",
        "There are two adoption approaches, \"phonetic adoption\" (transliteration of borrowed terms) and \"semantic adoption\" (where the meaning is expressed using native words).",
        "The proportion of the two options found in the terminology set of each country (or language) shows a substantial difference and seems to reflecti language policies of the country and the influence of foreign languages on the host language.",
        "This paper presents preliminary results of our investigation on this question based on a comparative study of three languages: Japanese, Vietnamese and Thai."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "For developing countries there is a strong necessity to establish an appropriate set of terminology to enable local people to learn science and technology in an efficient manner throughout their educational programs using their mother tongues as the instructional medium.",
        "Instruction in the mother tongue is beneficial for students to acquire a basic concept in a subject (UNESCO, 2003).",
        "International communities are fully aware of this necessity.",
        "The World Summit on the Information Society (WSIS) addressed this issue, saying that terminology development in education, science and culture is a key to developing knowledge societies.",
        "Unlike the situation with basic vocabulary, scientific or technical terms are usually not \"homegrown\", but are often imported from the outside world.",
        "And when a scientific or technical term is imported from one language (the source language) to another language (the host language), typically two approaches are found.",
        "The first approach is to simply borrow a word by creating a phonetically equivalent word in the host language.",
        "For example, the equivalent of the",
        "The 6th Workshop on Asian Language Resources, 2008",
        "English word \"science\" in Malay is \"sains\", pronounced as /sains/, and \"computer\" in Japanese is written as \" syf^ – ^\" in the Japanese kata-kana1syllabary and is pronounced /konpju:ta/ .",
        "We call this phonetic adoption in this paper.",
        "It is quite similar to transliteration, but not exactly the same due to the difference in phonetic structure between the source and host languages.",
        "The second approach is to create a new word by combining a semantically relevant word-root or word in the host language.",
        "For example, \"science\" in Thai is \"IviEnpnsfglf, pronounced /witthayasa:t/.",
        "This word is derived from the word \"vidya\" (knowledge) in Sanskrit, a source from which the Thai language has imported many words throughout its history.",
        "\"Science\" in Japanese is \" f4^\", pronounced /kagaku/.",
        "This word was coined more than one hundred years ago as a combination of two Chinese characters, \"f4\" and meaning \"a section, or a branch of something\" and \"learning\", respectively.",
        "As shown in these two cases, it often happens that classical languages like Sanskrit or Chinese, rather than the host language itself, provide root-words in this creation process just as Latin and Greek roots are used in scientific and technical terms in English.",
        "We call this approach semantic adoption in this paper.",
        "When we look back on the historical evolution of scientific terms dating from ancient civilization to modern times, both types of adoption are found.",
        "Both approaches to adoption have advantages and disadvantages in terms of ease of creation and ease of understanding, as well as other issues.",
        "The pros and cons of semantic adoption, summarized in Table 1, are in principle the opposites of those of phonetic adoption.",
        "But the choice of adoption approach is not so simple.",
        "The phonetic adoption option is easy to implement, but would have the danger of disturbing language purity, which also has a high priority in many nations.",
        "When the semantic adoption option is chosen, language purity is maintained but the adoption cost is high and it takes time to pre-",
        "In Japanese, four scripts are used to write Japanese, e.g. kanji (i.e., Chinese characters), hiragana, katakana and the Latin alphabet.",
        "Katakana script is conventionally used to represent foreign phonetically translated words.",
        "pare a meaningful number of vocabulary items and to train teachers in their use.",
        "In addition to this dilemma, a completely different approach can be taken when the necessity is very urgent.",
        "This is to design and to implement the whole educational program by means of an established foreign language.",
        "We call this approach the source language approach.",
        "In the real world today, this third approach is widely adopted in many developing countries, to various extents.",
        "The choice of foreign language depends on subject domains and the economic and political condition of the country as well as on historical ties.",
        "In summary, there are three basic options.",
        "However, little research has been carried out on how a language community can effectively formulate terminology focused on Asian languages.",
        "\"Guidelines for Terminology Policy\" (Infoterm 2005) talks about various issues relating to this subject, but no mention is found relating to the question of adoption strategy.",
        "The authors believe that an analysis of the existing terminology can provide practical and applicable lessons to terminology development practitioners and policy makers.",
        "This paper presents preliminary results of our investigation on this question, based on a comparative study of three countries: Japanese, Vietnamese and Thai."
      ]
    },
    {
      "heading": "2. Dictionary",
      "text": [
        "In this paper, the main corpus is extracted from a multilingual engineering dictionary based on Babel (Hayase and Kawata 2002).",
        "Babel is a web tech-",
        "Advantages",
        "Disadvantages",
        "Phonetic",
        "(1) easy to find",
        "(1) disturbs the purity",
        "adoption",
        "connectivity to the",
        "of host language",
        "original word",
        "(2) not easy to guess",
        "(2) easy to create",
        "what it means",
        "Semantic",
        "(1) does not disturb",
        "(1) not easy to find",
        "adoption",
        "the purity of host",
        "connectivity to the",
        "language",
        "original word",
        "(2) relatively easy",
        "(2) not easy to create",
        "to guess what it",
        "means, or at least to",
        "what it relates",
        "The 6th Workshop on Asian Language Resources, 2008",
        "nology dictionary for foreign students in Japan2.",
        "It is composed of the 11 academic domains given in Table 2 and three languages, English, Japanese and Thai.",
        "*there is some overlap with other domains _Table 3.",
        "A Sample of the Lexicon",
        "English Japanese Chinese",
        "Vietnamdiscriminant",
        "Biet thüc factor theorem circular measure radical root limit value divergence natural logarithm point of inflection•Sïvri-Mfvu",
        "Dinh ly MQUVKFnib thùa sô ïnaiJ",
        "So do mrfaiflki cung trôn -4fitWJ gicri han",
        "Phât tân",
        "Dôi sô tu nhiên",
        "Biêm uôn",
        "To this primary source, we added some terms in mathematics and physics and made a multilingual database such as that shown in Table 3 by adding",
        "' http://www.toyama-cmt.ac.jp/%7Ehayase/Project/Babel/",
        "adoptions into 8 languages: Vietnamese, Chinese, Korean, Filipino, Malay, Sinhalese, Myanmar and Mongolian.",
        "The data are coded in Unicode.",
        "At present Vietnamese, Chinese, Korean and Sinhalese language have been translated and other languages will be finished soon.",
        "The dictionary will be made in April, 2008.",
        "For this paper, we have selected three languages for analysis - Vietnamese, Thai and Japanese - because these languages have relatively rich vocabularies."
      ]
    },
    {
      "heading": "3. Comparison of Adoption Approaches",
      "text": [
        "The approach to terminology adoption is examined in this section from various angles.",
        "In order to investigate the portfolio of two adoption approaches, we surveyed the entire lexicon for all mechanical engineering subjects.",
        "In addition, we took a random sampling in our dictionary and chose approximately 25 words from two major subject fields: architecture and computer science.",
        "The portfolios of three languages are shown in Table 4.",
        "Compounds such as hybrids of native and loaned word-components were separated from semantic adoption.",
        "Table 4 shows that the Japanese language has the highest percentage of phonetically translated words from English.",
        "Vietnamese has the lowest percentage of phonetic adopted words from English, but includes terms from French in mechanical engineering plus a few from Russian.",
        "Thai shows a",
        "Table 2.",
        "The Number of Words in the Japanese Lexicon by Subject Domain",
        "Subject Domain",
        "Words (TYPE)",
        "Words TOKEN",
        "architecture",
        "i,3i4",
        "1,798",
        "chemistry",
        "7i7",
        "958",
        "civil engineering",
        "766",
        "1,263",
        "telecommunications",
        "65G",
        "1,410",
        "computer science",
        "94i",
        "1,538",
        "control engineering",
        "i,G8i",
        "1,545",
        "electronics",
        "68i",
        "1,200",
        "maritime science",
        "96i",
        "1,403",
        "mathematics",
        "952",
        "1,284",
        "mechanical engineering",
        "Un",
        "1,186",
        "physics",
        "587",
        "945",
        "others*",
        "i,872",
        "-",
        "Total of all words",
        "ii,639",
        "14,530",
        "Subject",
        "# of",
        "Adoption",
        "Origin",
        "of",
        "words",
        "Rate",
        "Domain",
        "terms",
        "Approach",
        "JP",
        "VN",
        "TH",
        "mechanical engineering",
        "Semantic",
        "G.68",
        "G.89",
        "G.78",
        "U86",
        "phonetic",
        "English",
        "G.32",
        "G.G9",
        "G.2i",
        "others",
        "G.G2",
        "G.Gi",
        "semantic",
        "G.43",
        "G.87",
        "G.78",
        "computer science",
        "23",
        "phonetic",
        "English",
        "G.57",
        "G.i3",
        "G.2i",
        "others",
        "semantic",
        "G.69",
        "G.93",
        "G.76",
        "architecture",
        "29",
        "phonetic",
        "English",
        "G.3i",
        "G.G3",
        "G.24",
        "others",
        "G.G3",
        "The 6th Workshop on Asian Language Resources, 2008",
        "We have collected about i,3GG terms in mathematics for our multilingual engineering dictionary.",
        "Following the Japanese course of study3for grades i-i2, we chose 57 terms from our dictionary and compared those terms with their counterparts in Thai and Vietnamese.",
        "For university-level mathematical terms, following the syllabus of theist year of the Faculty of Mathematics in one Japanese University, we chose ii terms4.",
        "Then we also surveyed those terms in the same way.",
        "Table 6 examines the terms used in various grade levels.",
        "roughly similar balance between semantic adoption and English-origin terms in all three domains.",
        "The high number of Thai and Vietnamese origin words in computer science is rather remarkable, as it indicates a consistent effort to adapt the Thai language to every emerging technology.",
        "Note that over half of the computer science terms for Japanese are of English origin.",
        "Vietnamese draws on different languages to varying degrees; it is notable that the languages of origin vary by subject field.",
        "As we saw in Table 4, Japanese technical terms are often phonetically translated, but less so in architecture than in the other two fields.",
        "To gain a better idea of the distribution of phonetic adoption, we surveyed the entire Japanese lexicon for all subject domains.",
        "Table 5 gives the rate of katakana usage, that is, the rate of words written in the katakana script used for transcribing foreign words.",
        "The domains of computer science, control engineering and mechanical engineering include over 30% of katakana words in their terms.",
        "In contrast, the percentage of katakana terms in architecture, mathematics and maritime science domains is less than 10%, indicating that these domains are highly semantically adopted in their terms, or have little need for imported vocabulary.",
        "We thus see that academic domain affects the adoption of phonetically translated terms.",
        "These data indicate that all languages use either original or semantically adopted from elementary level to junior-high school level.",
        "For Japanese almost all words are Sino-Japanese; in oral instruction native words may be used in Japan but those are not used as keywords.",
        "As for high school, some words phonetically translated from English are used in Thai, while at university level all languages use English-origin words.",
        "As for the rate of Sino-Vietnamese words in mathematics, it is considerably higher than other categories.",
        "This suggests that the likelihood that Sino-origin words can be shared",
        "Level",
        "terms",
        "words",
        "JP",
        "VN",
        "TH",
        "University",
        "ii",
        "Semantic (Sino)",
        "G.9i",
        "(G.9i)",
        "G.9G",
        "(G.64)",
        "G.64",
        "(G.GG)",
        "Phonetic",
        "G.G9",
        "G.G9",
        "G.36",
        "High",
        "School",
        "i7",
        "Semantic",
        "(Sino)",
        "Phonetic",
        "i.GG",
        "(i.GG)",
        "G.GG",
        "i.GG (G.47)",
        "G.GG",
        "G.88 (G.GG)",
        "G.i2",
        "Junior",
        "high",
        "i8",
        "Semantic",
        "(Sino)",
        "i.GG",
        "(i.GG)",
        "i.GG",
        "(G.6i)",
        "i.GG (G.GG)",
        "school",
        "Phonetic",
        "G.GG",
        "G.GG",
        "G.GG",
        "Elementary",
        "22",
        "Semantic",
        "(Sino)",
        "i.GG",
        "(i.GG)",
        "i.GG",
        "(G.5G)",
        "i.GG (G.GG)",
        "school",
        "Phonetic",
        "G.GG",
        "G.GG",
        "G.GG",
        "Subject Domain",
        "# of terms",
        "Katakana",
        "Rate",
        "architecture",
        "i,798",
        "i47",
        "G.G8i",
        "chemistry",
        "958",
        "234",
        "G.244",
        "civil engineering",
        "i,263",
        "i56",
        "G.i23",
        "telecommunications",
        "i,4iG",
        "422",
        "G.299",
        "computer science",
        "i,538",
        "65G",
        "G.422",
        "control engineering",
        "i,545",
        "497",
        "G.32i",
        "electronics",
        "i,2GG",
        "25G",
        "G.2G8",
        "maritime science",
        "i,4G3",
        "5i",
        "G.G36",
        "mathematics",
        "i,284",
        "5G",
        "G.G38",
        "mechanical engineering",
        "i,i86",
        "385",
        "G.324",
        "physics",
        "945",
        "i2G",
        "G.i26",
        "The 6th Workshop on Asian Language Resources, 2008",
        "effectively in other countries using Chinese characters is generally high in the field of mathematics.",
        "We also examined the web presence of pairs of terms, an English word and its equivalent in the host language.",
        "This is an attempt to find how widely the source language approach - direct use of foreign language - is used in technological topics.",
        "Four words from different subject domains were chosen, and a search was carried out for the term (as an exact phrase) using the Google search engine (Table 7).",
        "While data are limited to just four terms, general trends can be identified.",
        "For Japanese pages, while there were many hits for English, the hits for Japanese terms were at least three times higher.",
        "Interestingly, for operand, the one term with two equivalents, the katakana (i.e., phonetically adopted) term was used far more frequently than the semantically adopted kanji term.",
        "In the Vietnamese pages, while far fewer total hits were made, the Vietnamese terms were overwhelmingly more frequent than English terms.",
        "For Thai pages the opposite was found, with the exception of automatic lathe, a tool that may require marketing in the local language.",
        "These results suggest that the major language of technology for Thailand is English, for Vietnam it is the native language, and for Japan there is English use but Japanese dominates.",
        "In order to find if there is a distinction between use in technological fields and in general use, we made a comparison using three non-technical terms (Table 8).",
        "Search through",
        "Search term(s)",
        "# of hits*",
        "EN",
        "ionization",
        "i2i,GGG",
        "JP",
        "WM",
        "419,000",
        "EN",
        "fusion welding",
        "387",
        "Japanese pages",
        "JP",
        "12,900",
        "EN",
        "automatic lathe",
        "258",
        "JP",
        "§»»",
        "56,600",
        "EN",
        "operand",
        "32,5GG",
        "JP",
        "^r^yyV (katakana)",
        "138,000",
        "JP",
        "Sjffft (kanji)",
        "10,700",
        "EN",
        "ionization",
        "89",
        "VN",
        "Dien ly",
        "13,900",
        "EN",
        "fusion welding",
        "6",
        "Vietnamese pages",
        "VN",
        "Han nong chay",
        "66",
        "EN",
        "automatic lathe",
        "2",
        "VN",
        "May tien tu dong",
        "48",
        "EN",
        "operand",
        "111",
        "VN",
        "So tinh toan",
        "810",
        "EN",
        "ionization",
        "10,600",
        "TH",
        "48",
        "EN",
        "fusion welding",
        "692",
        "Thai",
        "TH",
        "6",
        "pages",
        "EN",
        "automatic lathe",
        "39",
        "TH",
        "195",
        "EN",
        "operand",
        "568",
        "TH",
        "24",
        "Search through",
        "Search term(s)",
        "# of hits*",
        "EN",
        "water",
        "2,2GG,GGG",
        "JP",
        "24,200,000",
        "Japanese",
        "EN",
        "novel",
        "2,242,000",
        "pages",
        "JP",
        "9,870,000",
        "EN",
        "zoo",
        "2,580,000",
        "JP",
        "Wmw",
        "2,650,000",
        "EN",
        "water",
        "295,000",
        "VN",
        "nuoc",
        "4,310,000",
        "Vietnamese pages",
        "EN",
        "novel",
        "68,400",
        "VN",
        "tieu thuyet",
        "2,130,000",
        "EN",
        "zoo",
        "41,500",
        "VN",
        "vuon bach thu**",
        "615,000",
        "VN",
        "sa thu***",
        "1,750,000",
        "EN",
        "water",
        "1,850,000",
        "TH",
        "un",
        "2,610,000",
        "Thai pages",
        "EN",
        "novel",
        "269,000",
        "TH",
        "1,830,000",
        "EN",
        "zoo",
        "272,000",
        "The 6th Workshop on Asian Language Resources, 2008",
        "Again, we find that Japanese pages use the Japanese word far more frequently (although zoo is nearly equal - perhaps due to the exotic appeal of a foreign word, and one understood by almost every Japanese) but that English words have a sizable presence.",
        "For Vietnamese pages, the number of hits is substantially higher than that for the technical terms, but the same trend exists: the native language dominates.",
        "Finally, for Thai pages, the hits for Thai words far exceed those for English words in all three cases, although English words are often used.",
        "A comparison of results for Tables 7 and 8 confirms that the role of languages differs between daily use and situations that require technical terminology, even in a country that has adopted the third approach of using a foreign language for science and technology."
      ]
    },
    {
      "heading": "4. Social and Academic Factors",
      "text": [
        "As can be imagined, it is not easy for Asian people to understand technical terms in other Asian languages, because semantic adoption is popular among Asian languages.",
        "The diversity of scripts in Asia is another reason of this difficulty.",
        "In European countries, term-sharing by phonetic adoption is easier because almost all languages were derived from the same origin and are sharing the same script.",
        "Therefore, in order to achieve mutual communication using technical terms in Asian countries, we need to make special efforts to go over the variation and harmonize terms each other.",
        "But we need to discuss why those languages prefer semantic adoption.",
        "Various social, political, and historical factors influence language use.",
        "This applies also to the adoption of technical terminology.",
        "Here, we discuss influences of these factors on the approaches used to adopt technical terms, including the influence of technical domains and academic discipline.",
        "In Vietnam, adoption is strongly promoted under the strict language policy.",
        "The Political Resume of the Socialist Republic of Vietnam states that \"[e]very nationality has the right to use its own language and system of writing, to preserve its national identity, and to promote its fine customs, habits, traditions and culture.\"",
        "Therefore they seldom use phonetically adopted words as such.",
        "One example of its limited use is \"6m\" from the English \"ohm.\"",
        "Another example is proper nouns, when foreign words are used in newspapers This political reason is the primary impetus for the semantic adoption of terms.",
        "Secondly, as in other communist nations, English is not taught as an obligatory subject in Vietnam.",
        "This educational policy also brings about a low rate of phonetically adopted words from English, because many people cannot grasp the meaning.",
        "Thirdly, we need to consider that the Vietnamese language has been historically influenced by several foreign languages, as we can induce from Table 4's results.",
        "Vietnam was under the influence of China for approximately 1,000 years.",
        "A number of Chinese terms were absorbed into Vietnamese as Sino-Vietnamese words.",
        "During the French colonial period, the Vietnamese language added French words for the manufacture of specific products such as automobiles and bicycles.",
        "Lastly, at the end of the 20th century Russian technical terms were introduced by people who had studied in or technical advisers who had sent by the Soviet Union or in Russia",
        "As is the case with Vietnam, Chinese characters and words were imported from China so long ago that the characters and words are regarded as part of the native Japanese language.",
        "In the end of the 19th century, a number of Japanese-kango (words that used Chinese characters but were created by Japanese people) were invented as adoptions of western technical terms, and many of these terms were reimported to China.",
        "After World War H, Japan was occupied by the Allied Forces led by the United States and English became a compulsory subject from junior high school.",
        "English-origin words became easy to understand for many Japanese.",
        "This historical change caused a sharp rise in percentage of phonetic adoptions from English among Japanese technical terms (see Table 5) (Hashimoto 2007).",
        "However, English is not usually used as an instructional medium in",
        "The 6th Workshop on Asian Language Resources, 2008",
        "Japanese institutions of higher education.",
        "Teachers and students know many English loan terms but they use these loan terms not as English but as Japanese, and since they are pronounced according to Japanese phonetic rules, they may not even be intelligible to English speakers.",
        "Thai has different features from the other two countries in that it is less influenced by Chinese.",
        "But the Thai language has been influenced by another foreign language, Sanskrit, the classical Indian language.",
        "We did not examine the rate of Sanskrit origin words in the Thai language in this study, but it seems likely that a high rate of terms phonetically adopted from Sanskrit will be found in our engineering dictionary.",
        "Although Thai has native-language equivalents at the lexical level, English is daily used as an instructional medium in higher education.",
        "Students in Thailand start to learn English at 10 years old or earlier.",
        "Thus, even though they have native terms they prefer to use terms phonetically adopted from English or to use English.",
        "In the Meiji era (1868-1912) in Japan, experts translated technical terms from Western languages semantically, into Japanese-£a«go.",
        "Since World War II, however, it has been the mainstream to transliterate into katakana.",
        "Therefore a decisive factor in adoption approach is when the subject was introduced into Japan.",
        "Table 9 shows the foundation year for major academic societies and institutes in engineering fields, which roughly indicates the time of introduction of the subject.",
        "As shown in Table 5, computer science is the field that uses technical terms in katakana most frequently, while the sampled vocabulary from telecommunications also includes nearly 30% of katakana words.",
        "These disciplines are relatively newly developed in Japan; the societies or institutes related to these fields were established in the latter half of the 20th century.",
        "The oldest societies, the Mathematical Society of Japan and The Physical Society of Japan, were established in 1877; our study showed that only 3.8% of mathematical terms and 12.6% of terms in physics are phonetically adopted terms.",
        "Therefore, disciplines with academic societies established relatively early may have developed a great deal of their terminology during the Meiji era, and may still have a preference for Japanese-£a«go over katakana.",
        "Newer disciplines, on the other hand, may have found it easier to use the imported terms in a relatively direct way.",
        "Each country has specific characteristics of the region, such as regional climate, folk, culture, lifestyle and other indigenous factors.",
        "Technical terms in these fields are therefore strongly connected with regional characteristics.",
        "Before unfamiliar terms or new technologies were brought over to the host country, experts in those fields had already created and used their own technical terms in their native language, and also they were already aware of the concept of a thing indicated by an unfamiliar term in alien language.",
        "All they had to do was to make a one-to-one correspondence and correctly translate a foreign term into the term that was already in use in the mother tongue.",
        "Discipline",
        "Major Academic Society in Japan",
        "Est.",
        "architecture",
        "Architectural Institute of Japan",
        "1886",
        "civil",
        "engineering",
        "Japan Society of Civil Engineers",
        "1914",
        "chemistry",
        "Chemistry and Chemical Industry of Japan",
        "1878",
        "tele-",
        "Information Processing Society of Japan",
        "1960",
        "communications, computer",
        "The Institute of Electronics, Information, and Communication Engineers",
        "1987",
        "science",
        "The Japan Society of Information and Communication Research",
        "1983",
        "control engineering",
        "The Institute of Systems, Control and Information Engineers",
        "1957",
        "electronics",
        "The Institute of Electrical Engineers of Japan",
        "1888",
        "maritime science",
        "The Japan Society of Naval Architects and Ocean Engineers",
        "1898",
        "mathematics",
        "Mathematical Society of Japan",
        "1877",
        "mechanical engineering",
        "The Japan Society of Mechanical Engineers",
        "1897",
        "physics",
        "The Physical Society of Japan",
        "1877",
        "The 6th Workshop on Asian Language Resources, 2008"
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "This preliminary study looks at the different approaches to adopting technical terms in three Asian languages.",
        "The three languages investigated prefer different methods: Vietnamese tends to adopt words into its language semantically, through adoption, while Japanese adopts them phonetically, through transliteration.",
        "Thai, to a large extent, has chosen a third approach, that of using a source language (English).",
        "In Japanese and in Vietnamese, many terms subject to semantic adoption were translated into Chinese characters.",
        "This suggests that Sino-words may be an effective way of communicating concepts among certain language users in certain disciplines, such as mathematics.",
        "The effect of grade level was also investigated, and it was found that native language terms were used in mathematics almost exclusively until high school or university level.",
        "Subject domain was found to have an effect on the adoption approach and was often influenced by whether the domain had a long tradition, and when established a discipline was (as shown by the foundation of academic societies).",
        "A domain effect was seen in Vietnamese, where Russian or French-origin terms appeared in different domains.",
        "While quite limited in scope, this study has revealed clear trends that deserve further investigation."
      ]
    },
    {
      "heading": "6. Future Research",
      "text": [
        "We plan to investigate more fully the rate of phonetically translated words and approach to terminology adoption.",
        "We expect that Chinese and Korean will give us further evidence of widespread use of Sino-words and Mongolian will provide data for phonetic adoption from Russian.",
        "Malay and Filipino are likely to be highly influenced by English, while we will find the influence of Sanskrit in Myanmar and Sinhalese."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The study was made possible by the sponsorship of the Japanese Ministry of Education, Culture, Sports, Science and Technology (MEXT) through the Asian Language Resource Network project.",
        "The authors would like to express sincere gratitude to all lexicon contributors for their help."
      ]
    }
  ]
}
