{
  "info": {
    "authors": [
      "Alessandro Moschitti",
      "Fabio Massimo Zanzotto"
    ],
    "book": "Coling 2008: Proceedings of the workshop on Speech Processing for Safety Critical Translation and Pervasive Applications",
    "id": "acl-W08-2004",
    "title": "Encoding Tree Pair-Based Graphs in Learning Algorithms: The Textual Entailment Recognition Case",
    "url": "https://aclweb.org/anthology/W08-2004",
    "year": 2008
  },
  "references": [
    "acl-H05-1079",
    "acl-P02-1034",
    "acl-P06-1117",
    "acl-P07-1098",
    "acl-W04-2403",
    "acl-W05-1203",
    "acl-W06-2909"
  ],
  "sections": [
    {
      "text": [
        "Encoding Tree Pair-based Graphs in Learning Algorithms: the Textual Entailment Recognition Case",
        "DISI, University of Trento",
        "Via Sommarive 14 38100 POVO (TN) - Italy moschitti@dit.unitn.it",
        "DISP, University of Rome \"Tor Vergata\" Via del Politecnico 1 00133 Roma, Italy zanzotto@info.uniroma2.it",
        "In this paper, we provide a statistical machine learning representation of textual entailment via syntactic graphs constituted by tree pairs.",
        "We show that the natural way of representing the syntactic relations between text and hypothesis consists in the huge feature space of all possible syntactic tree fragment pairs, which can only be managed using kernel methods.",
        "Experiments with Support Vector Machines and our new kernels for paired trees show the validity of our interpretation."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Recently, a lot of valuable work on the recognition of textual entailment (RTE) has been carried out (Bar Haim et al., 2006).",
        "The aim is to detect implications between sentences like:",
        "where 1\\ and H\\ stand for text and hypothesis, respectively.",
        "Several models, ranging from the simple lexical similarity between T and H to advanced Logic Form Representations, have been proposed (Cor-ley and Mihalcea, 2005; Glickman and Dagan, 2004; de Salvo Braz et al., 2005; Bos and Mark-ert, 2005).",
        "However, since a linguistic theory able to analytically show how to computationally solve the RTE problem has not been developed yet, to",
        "©2008.",
        "Some rights reserved.",
        "design accurate systems, we should rely upon the application of machine learning.",
        "In this perspective, TE training examples have to be represented in terms of statistical feature distributions.",
        "These typically consist in word sequences (along with their lexical similarity) and the syntactic structures of both text and hypothesis (e.g. their parse trees).",
        "The interesting aspect with respect to other natural language problems is that, in TE, features useful at describing an example are composed by pairs of features from Text and Hypothesis.",
        "For example, using a word representation, a text and hypothesis pair, (T,H), can be represented by the sequences of words of the two sentences, i.e. (t\\,.., tn) and (hi,.., hm), respectively.",
        "If we carry out a blind and complete statistical correlation analysis of the two sequences, the entailment property would be described by the set of subsequence pairs from T and H, i.e. the set R = {(st,sh) : st = (ti^.^U^Sh = (hh,..,hjr),l < n,r < m}.",
        "The relation set R constitutes a naive and complete representation of the example (T,H) in the feature space {(v,w) : v,w e V*}, where V is the corpus vocabulary.",
        "Although the above representation is correct and complete from a statistically point of view, it suffers from two practical drawbacks: (a) it is exponential in V and (b) it is subject to high degree of data sparseness which may prevent to carry out effective learning.",
        "The traditional solution for this problem relates to consider the syntactic structure of word sequences which provides their generalization.",
        "The use of syntactic trees poses the problem of representing structures in learning algorithms.",
        "Ti",
        "\"Wanadoo bought KStones\"",
        "Hi",
        "\"Wanadoo owns KStones\"",
        "For this purpose, kernel methods, and in particular tree kernels allow for representing trees in terms of all possible subtrees (Collins and Duffy, 2002).",
        "Unfortunately, the representation in entailment recognition problems requires the definition of kernels over graphs constituted by tree pairs, which are in general different from kernels applied to single trees.",
        "In (Zanzotto and Moschitti, 2006), this has been addressed by introducing semantic links (placeholders) between text and hypothesis parse trees and evaluating two distinct tree kernels for the trees of texts and for those of hypotheses.",
        "In order to make such disjoint kernel combination effective, all possible assignments between the placeholders of the first and the second entailment pair were generated causing a remarkable slowdown.",
        "In this paper, we describe the feature space of all possible tree fragment pairs and we show that it can be evaluated with a much simpler kernel than the one used in previous work, both in terms of design and computational complexity.",
        "Moreover, the experiments on the RTE datasets show that our proposed kernel provides higher accuracy than the simple union of tree kernel spaces."
      ]
    },
    {
      "heading": "2. Fragments of Tree Pair-based Graphs",
      "text": [
        "The previous section has pointed out that RTE can be seen as a relational problem between word sequences of Text and Hypothesis.",
        "The syntactic structures embedded in such sequences can be generalized by natural language grammars.",
        "Such generalization is very important since it is evident that entailment cases depend on the syntactic structures of Text and Hypothesis.",
        "More specifically, the set R described in the previous section can be extended and generalized by considering syntactic derivations that generate word sequences in the training examples.",
        "This corresponds to the following set of tree fragment pairs:",
        "where JF(-) indicates the set of tree fragments of a parse tree (i.e. the one of the text T or of the hypothesis H).",
        "RT contains less sparse relations than R. For instance, given T\\ and H\\ of the previous section, we would have the following relational description:",
        "NP VP NP bought NNP",
        "These features (relational pairs) generalize the entailment property, e.g. the pair ([vp[vbpbought] [np]], [vp [vbp own] [np]]) generalizes many word sequences, i.e. those external to the verbal phrases and internal to the NPs.",
        "We can improve this space by adding semantic links between the tree fragments.",
        "Such links or placeholders have been firstly proposed in (Zanzotto and Moschitti, 2006).",
        "A placeholder assigned to a node of Tt and a node of r/j states that such nodes dominate the same (or similar) information.",
        "In particular, placeholders are assigned to nodes whose words ti in T are equal, similar, or semantically dependent on words hj in H. Using placeholders, we obtain a richer fragment pair based representation that we call Rrp, exemplified hereafter:",
        "bought NNPLy]",
        "NP VP NNP[X] VBP NP owns NNPLY] bought NNPLY] owns NNP[Y]",
        "NPVP NPVP",
        "The placeholders (or variables) indicated with X and Y specify that the NNPs labeled by the same variables dominate similar or identical words.",
        "Therefore, an automatic algorithm that assigns placeholders to semantically similar constituents is needed.",
        "Moreover, although Rrp contains more semantic and less sparse features than both RT and R, its cardinality is still exponential in the number of the words of T and H. This means that standard machine learning algorithms cannot be applied.",
        "In contrast, tree kernels (Collins and Duffy, 2002) can be used to efficiently generate the huge space of tree fragments but, to generate the space of pairs of tree fragments, a new kernel function has to be defined.",
        "The next section provides a solution to both problems, i.e. an algorithm for placeholders assignments and for the computation of paired tree kernels which generates RT and Rrp representations.",
        "VP V NP bookV) N a flight a flight a",
        "VP V NP D N a flight",
        "D N flight"
      ]
    },
    {
      "heading": "3. Kernels over Semantic Tree Pair-based Graphs",
      "text": [
        "The previous section has shown that placeholders enrich a tree-based graph with relational information, which, in turn, can be captured by means of word semantic similarities simw(wt,Wh), e.g. (Corley and Mihalcea, 2005; Glickman et al., 2005).",
        "More specifically, we use a two-step greedy algorithm to anchor the content words (verbs, nouns, adjectives, and adverbs) in the hypothesis Wh to words in the text Wt-",
        "In the first step, each word Wh in Wh is connected to all words wt in Wt that have the maximum similarity simw(wt, Wh) with it (more than one Wt can have the maximum similarity with Wh)-As result, we have a set of anchors A c Wt x Wh-simw(wt, Wh) is computed by means of three techniques:",
        "1.",
        "Two words are maximally similar if they have the same surface form wt = w^.",
        "2.",
        "Otherwise, WordNet (Miller, 1995) similarities (as in (Corley and Mihalcea, 2005)) and different relation between words such as verb",
        "entailment and derivational morphology are applied.",
        "3.",
        "The edit distance measure is finally used to capture the similarity between words that are missed by the previous analysis (for misspelling errors or for the lack of derivational forms in WordNet).",
        "In the second step, we select the final anchor set A' C A, such that Vwt (or Wh) 3\\(wt,Wh) e A'.",
        "The selection is based on a simple greedy algorithm that given two pairs (wt,Wh) and (w't,Wh) to be selected and a pair (st, Sh) already selected, considers word proximity (in terms of number of words) between wt and stand between w't and st, the nearest word will be chosen.",
        "Once the graph has been enriched with semantic information we need to represent it in the learning algorithm; for this purpose, an interesting approach is based on kernel methods.",
        "Since the considered graphs are composed by only two trees, we can carried out a simplified computation of a graph kernel based on tree kernel pairs.",
        "Tree Kernels (e.g. see NLP applications in (Giu-glea and Moschitti, 2006; Zanzotto and Moschitti, 2006; Moschitti et al., 2007; Moschitti et al., 2006; Moschitti and Bejan, 2004)) represent trees in terms of their substructures (fragments) which are mapped into feature vector spaces, e.g. W. The kernel function measures the similarity between two trees by counting the number of their common fragments.",
        "For example, Figure 1 shows some substructures for the parse tree of the sentence \"book a flight\".",
        "The main advantage of tree kernels is that, to compute the substructures shared by two trees t\\ and t2, the whole fragment space is not used.",
        "In the following, we report the formal definition presented in (Collins and Duffy, 2002).",
        "Given the set of fragments {/i, /2, ••} = JF, the indicator function h(n) is equal 1 if the target fa is rooted at node n and 0 otherwise.",
        "A tree kernel is then defined as:",
        "where NT1 and NT2 are the sets of the ti's and t2's nodes, respectively and",
        "The latter is equal to the number of common fragments rooted in the ri\\ and n2 nodes and A can be evaluated with the following algorithm:",
        "1. if the productions at ri\\ and n2 are different then A(ni, n2) = 0;",
        "2. if the productions at ri\\ and n2 are the same, and n\\ and n2 have only leaf children (i.e. they are pre-terminals symbols) then",
        "3. if the productions at ri\\ and n2 are the same, and rii and n2 are not pre-terminals then where nc(n\\) is the number of the children of rii and c£, is the j-th child of the node n. Note that since the productions are the same, nc(n\\) = nc(n2).",
        "Additionally, we add the decay factor A by modifying steps (2) and (3) as follows :",
        "3.",
        "A(m,n2) = A [J (1 + A«,<)).",
        "The computational complexity of Eq.",
        "2 is 0(\\NT1\\ x l-ZV^I) although the average running time tends to be linear (Moschitti, 2006).",
        "The above tree kernel function can be applied to the parse trees of two texts or those of the two hypotheses to measure their similarity in terms of the shared fragments.",
        "If we sum the contributions of the two kernels (for texts and for hypotheses) as proposed in (Zanzotto and Moschitti, 2006), we just obtain the feature space of the union of the fragments which is completely different from the space of the tree fragments pairs, i.e. RT.",
        "Note that the union space is not useful to describe which grammatical and lexical property is at the same time held by T and H to trig the implication.",
        "Therefore to generate the space of the fragment pairs we need to define the kernel between two pairs of entailment examples (Ti, Hi) and {T2,H2)as where A evaluates the number of subtrees rooted in rii and n2 combined with those rooted in n3 and 114.",
        "More specifically, each fragment rooted into the nodes of the two texts' trees is combined with each fragment rooted in the two hypotheses' trees.",
        "Now, since the number of subtrees rooted in the texts is independent of the number of trees rooted in the hypotheses,",
        "A(ni,n2,n3,n4) = A(m,n2)A(n3,n4).",
        "Therefore, we can rewrite Kp as:",
        "raieTira2eT2 n:ieH1n4eH2 = Kt(Ti,T2)xKt(Hi,H2).",
        "This result shows that the natural kernel to represent textual entailment sentences is the kernel product, which corresponds to the set of all possible syntactic fragment pairs.",
        "Note that, such kernel can be also used to evaluate the space of fragment pairs for trees enriched with relational information, i.e. by placeholders."
      ]
    },
    {
      "heading": "4. Approximated Graph Kernel",
      "text": [
        "The feature space described in the previous section correctly encodes the fragment pairs.",
        "However, such huge space may result inadequate also for algorithms such as SVMs, which are in general robust to many irrelevant features.",
        "An approximation of the fragment pair space is given by the kernel described in (Zanzotto and Moschitti, 2006).",
        "Hereafter we illustrate its main points.",
        "First, tree kernels applied to two texts or two hypotheses match identical fragments.",
        "When placeholders are added to trees, the labeled fragments are matched only if the basic fragments and the assigned placeholders match.",
        "This means that we should use the same placeholders for all texts and all hypotheses of the corpus.",
        "Moreover, they should be assigned in a way that similar syntactic structures and similar relational information between two entailment pairs can be matched, i.e. same placeholders should be assigned to the potentially similar fragments.",
        "Second, the above task cannot be carried out at preprocessing time, i.e. when placeholders are assigned to trees.",
        "At the running time, instead, we can look at the comparing trees and make a more consistent decision on the type and order of placeholders.",
        "Although, there may be several approaches to accomplish this task, we apply a basic heuristic which is very intuitive: Choose the placeholder assignment that maximizes the tree kernel function over all possible correspondences",
        "More formally, let A and A' be the placeholder sets of (T, H) and (T\", H'), respectively, without loss of generality, we consider \\A\\ > \\A'\\ and we align a subset of A to A'.",
        "The best alignment is the one that maximizes the syntactic and lexical overlapping of the two subtrees induced by the aligned set of anchors.",
        "By calling C the set of all bijective mappings from S C A, with |5| = \\A'\\, to A', an element c e C is a substitution function.",
        "We define the best alignment cmax the one determined by where (1) t(-, c) returns the syntactic tree enriched with placeholders replaced by means of the substitution c, (2) i is the identity substitution and (3) TK(t\\,t2) is a tree kernel function (e.g. the one specified by Eq.",
        "2) applied to the two trees t\\ and",
        "At the same time, the desired similarity value to be used in the learning algorithm is given by the kernel sum: TK(t(T,cmax),t(T',i)) + TK(t(H, cmax),t(H', i)), i.e. by solving the following optimization problem:",
        "For example, let us compare the following two pairs (Ti, and (T2, H2) in Fig. 2.",
        "To assign the placeholders CD, \\2\\ and [U of (T2, H2) to those of (Ti,Hi), i.e. \\X\\ and [Y], we need to maximize the similarity between the two texts' trees and between the two hypotheses' trees.",
        "It is straightforward to derive that X=l and Y=3 allow more substructures (i.e. large part of the trees) to be identical, e.g. [S [NPHTXl VP]] , [VP [VBP NPl3lYl]]; [S [NPHTXlVP [VBP NPOT]]].",
        "Finally, it should be noted that, (a) K8((T,H),(T',H')) is a symmetric function since the set of derivation C are always computed with respect to the pair that has the largest anchor set and (b) it is not a valid kernel as the max function does not in general produce valid kernels.",
        "However, in (Haasdonk, 2005), it is shown that when kernel functions are not positive semidef-inite like in this case, SVMs still solve a data separation problem in pseudo Euclidean spaces.",
        "The drawback is that the solution may be only a local optimum.",
        "Nevertheless, such solution can still be valuable as the problem is modeled with a very rich feature space.",
        "Regarding the computational complexity, running the above kernel on a large training set may result very expensive.",
        "To overcome this drawback, in (Moschitti and Zanzotto, 2007), it has been designed an algorithm to factorize the evaluation of tree subparts with respect to the different substitution.",
        "The resulting speed-up makes the application of such kernel feasible for datasets of ten of thousands of instances."
      ]
    },
    {
      "heading": "5. Experiments",
      "text": [
        "The aim of the experiments is to show that the space of tree fragment pairs is the most effective to represent Tree Pair-based Graphs for the design of Textual Entailment classifiers.",
        "To compare our model with previous work we implemented the following kernels in SVM-light (Joachims, 1999):",
        "• Ks{eue2) = Kt{TuT2) + Kt{HuH2), where d = {Ti,H\\) and e2 = (T2,H2) are two text and hypothesis pairs and Kt is the syntactic tree kernel (Collins and Duffy, 2002) presented in the previous section.",
        "• Kp(eue2) = Kt{TuT2) x Kt{HuH2), which (as shown in the previous sections) en-",
        "Wanadoo bought nnp [Yl",
        "NNP[X] VBP NP[Y] Wanadoo owns NNP[Y] KStones",
        "DT NNED IN NP[2] èowg/î/DTNNH] the president of NNP [U a castle dt nn CD in np M own dtnn H] //îe president of nnp [2] a castle",
        "Figure 2: The problem of finding the correct mapping between placeholders codes the tree fragment pairs with and without placeholders.",
        "Kt((f)c(Hi), (t)c(H2))), where c is a possible placeholder assignment which connects nodes from the first pair with those of the second pair and 0C(-) transforms trees according to c.",
        "Note that Kmax is the kernel proposed in (Zanzotto and Moschitti, 2006) and Kpmx is a hybrid kernel based on the maximum Kp, which uses the space of tree fragment pairs.",
        "For all the above kernels, we set the default cost factor and trade-off parameters and we set A to 0.4.",
        "To experiment with entailment relations, we used the data sets made available by the first (Da-gan et al., 2005) and second (Bar Haim et al., 2006) Recognizing Textual Entailment Challenge.",
        "These corpora are divided in the development sets Dl and D2 and the test sets Tl and T2.",
        "Dl contains 567 examples whereas Tl, D2 and T2 all have the same size, i.e. 800 instances.",
        "Each example is an ordered pair of texts for which the entailment relation has to be decided.",
        "Table 1 shows the results of the above kernels on the split used for the RTE competitions.",
        "The first column reports the kernel model.",
        "The second and third columns illustrate the model accuracy for RTE 1 whereas column 4 and 5 show the accuracy for RTE2.",
        "Moreover, -> P indicates the use of standard syntactic trees and P the use of trees enriched with placeholders.",
        "We note that:",
        "First, the space of tree fragment pairs, generated by Kp improves the one generated by Ks (i.e. the simple union of the fragments of texts and hypotheses) of 4 (58.9% vs 54.9%) and 0.9 (53.5% vs 52.6%) points on RTE1 and RTE2, respectively.",
        "This suggests that the fragment pairs are more effective for encoding the syntactic rules describing the entailment concept.",
        "Second, on RTE1, the introduction of placeholders does not improve Kp or Ks suggesting that for their correct exploitation an extension of the space of tree fragment pairs should be modeled.",
        "Third, on RTE2, the impact of placeholders seems more important but only Kmax and Ksare able to fully exploit their semantic contribution.",
        "A possible explanation is that in order to use the set of all possible assignments (required by Kmax), we needed to prune the \"too large\" syntactic trees as also suggested in (Zanzotto and Moschitti, 2006).",
        "This may have negatively biased the statistical distribution of tree fragment pairs.",
        "Finally, although we show that Kp is better",
        "Table 1: Accuracy of different kernel models using (P) and not using (-> P) placeholder information on RTE1 andRTE2."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We would like to thank the anonymous reviewers for their professional and competent reviews and for their invaluable suggestions.",
        "Alessandro Moschitti would like to thank the European Union project, LUNA (spoken Language UNderstanding in multilinguAl communication systems) contract n 33549 for supporting part of his research.",
        "suited for RTE than the other kernels, its accuracy is lower than the state-of-the-art in RTE.",
        "This is because the latter uses additional models like the lexical similarity between text and hypothesis, which greatly improve accuracy."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "In this paper, we have provided a statistical machine learning representation of textual entailment via syntactic graphs constituted by tree pairs.",
        "We have analytically shown that the natural way of representing the syntactic relations between text and hypothesis in learning algorithms consists in the huge feature space of all possible syntactic tree fragment pairs, which can only be managed using kernel methods.",
        "Therefore, we used tree kernels, which allow for representing trees in terms of all possible subtrees.",
        "More specifically, we defined a new model for the entailment recognition problems, which requires the definition of kernels over graphs constituted by tree pairs.",
        "These are in general different from kernels applied to single trees.",
        "We also studied another alternative solution which concerns the use of semantic links (placeholders) between text and hypothesis parse trees (to form relevant semantic fragment pairs) and the evaluation of two distinct tree kernels for the trees of texts and for those of hypotheses.",
        "In order to make such disjoint kernel combination effective, all possible assignments between the placeholders of the first and the second entailment pair have to be generated (causing a remarkable slowdown).",
        "Our experiments on the RTE datasets show that our proposed kernel may provide higher accuracy than the simple union of tree kernel spaces with a much simpler and faster algorithm.",
        "Future work will be devoted to make the tree fragment pair space more effective, e.g. by using smaller and accurate tree representation for text and hypothesis.",
        "Kemels",
        "RTE1",
        "RTE2",
        "-.P P",
        "-.P P",
        "Ks",
        "54.9 50.0",
        "52.6 59.5",
        "Kp",
        "58.9 55.5",
        "53.5 56.0",
        "K",
        "58.25",
        "61.0",
        "K",
        "50.0",
        "56.8"
      ]
    }
  ]
}
