{
  "info": {
    "authors": [
      "Thamar Solorio",
      "Yang Liu"
    ],
    "book": "Proceedings of the Workshop on Current Trends in Biomedical Natural Language Processing",
    "id": "acl-W08-0626",
    "title": "Using Language Models to Identify Language Impairment in Spanish-English Bilingual Children",
    "url": "https://aclweb.org/anthology/W08-0626",
    "year": 2008
  },
  "references": [
    "acl-W07-1001"
  ],
  "sections": [
    {
      "text": [
        "1 Introduction",
        "Children diagnosed with Specific Language Impairment (SLI) experience a delay in acquisition of certain language skills, with no evidence of hearing impediments, or other cognitive, behavioral, or overt neurological problems (Leonard, 1991; Paradis et al., 2005/6).",
        "Standardized tests, such as the Test for Early Grammatical Impairment, have shown to have great predictive value for assessing English speaking monolingual children.",
        "Diagnosing bilingual children with SLI is far more complicated due to the following factors: lack of standardized tests, lack of bilingual clinicians, and more importantly, the lack of a deep understanding of bilingualism and its implications on language disorders.",
        "In addition, bilingual children often exhibit code-switching patterns that will make the assessment task even more challenging.",
        "In this paper, we present preliminary results from using language models to help discriminating bilingual children with SLI from Typically-Developing (TD) bilingual children."
      ]
    },
    {
      "heading": "2. Our Approach",
      "text": [
        "We believe that statistical inference can assist in the problem of accurately discriminating language patterns indicative of SLI.",
        "In this work, we use Language Models (LMs) for this task since they are a powerful statistical measure of language usage and have been successfully used to solve a variety of NLP problems, such as text classification, speech recognition, handwriting recognition, augmentative communication for the disabled, and spelling error detection (Manning and Schütze, 1999).",
        "LMs estimate the probability of a word sequence W = (w\\, ...wk) as follows (using the chain rule):",
        "which can be approximated using an N-gram as:",
        "Since in our problem we are interested in differentiating syntactic patterns, we will train the LMs on Part-of-Speech (POS) patterns instead of words.",
        "Using a 3-gram we have:",
        "where T = (ti,t2,...,tk) is the sequence of POS tags assigned to the sequence of words W.",
        "The intuition is that the language patterning ofan SLI child will differ from those of TD children at two different levels: one is at the syntactic level, and the second one is at the interaction between both languages in patterns such as code-switching.",
        "Given that the tagset for each language is different, by using the POS tags we will incorporate into the model the syntactic structure together with the switch points across languages.",
        "We train two LMs with the POS sequences: MT, with data from the TD children and Mj, with data from the SLI bilingual children.",
        "Once both LMs are trained, then we can use them to make predictions over new speech samples of bilingual children.",
        "To determine whether an unobserved speech sample is likely to belong to a child suffering from SLI, we will measure the perplexity of the two LMs over the POS patterns of this new speech sample.",
        "We make the final decision using a threshold:",
        "SLI if (PPt(s) > TD otherwise",
        "where PPT(s) is the perplexity of the model MTover the sample s, and PPJ(s) is the perplexity of the model Mj over the same sample s. In other words, if the perplexity of the LM trained on syntactic patterns of children with SLI is smaller than that of the LM trained on POS patterns of TD children, then we will predict that the sample belongs to a child with SLI.",
        "In a related work, (Roark et al., 2007) explored the use of cross entropy of LMs trained on POS tags as a measure of syntactic complexity.",
        "Their results were inconsistent across language tasks, which may be due to the meaning attached to cross entropy in this setting.",
        "Unlikely patterns are a deviation from what is expected; they are not necessarily complex or syntactically rich."
      ]
    },
    {
      "heading": "3. Preliminary Results",
      "text": [
        "We empirically evaluated our approach using transcripts that were made available by a speech pathologist in our team.",
        "The TD samples were comprised of 5 males and 4 females between 48 and 72 months old.",
        "The children were identified as being bilingual by their parents, and according to parental report, these children live in homes where Spanish is spoken an average of 46.3% of the time.",
        "Language samples of SLI bilinguals were collected from children being served in the Speech and Hearing Clinic at UTEP.",
        "The samples are from two females aged 53 and 111 months.",
        "The clients were diagnosed with language impairment after diagnostic evaluations which were conducted in Spanish.",
        "The transcriptions were POS tagged with the bilingual tagger developed by (Solorio et al., 2008).",
        "Table 1 shows the preliminary results using cross validation.",
        "With the decision threshold outlined above, out of the 9 TD children, the models were able to discriminate 7 as TD; from the 2 SLI children both were correctly identified as SLI.",
        "Although the results presented above are not conclusive due to the very small size corpora at hand, they look very promising.",
        "Stronger conclusions can be drawn once we collect more data."
      ]
    },
    {
      "heading": "4. Final Remarks",
      "text": [
        "This paper presents very promising preliminary results on the use of LMs for discriminating patterns indicative of SLI in Spanish-English bilingual children.",
        "As more data becomes available, we expect to gather stronger evidence supporting our method.",
        "Our current efforts involve collecting more samples, as well as evaluating the accuracy of LMs on monolingual children with and without SLI."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "Thanks to Bess Sirmon Fjordbak for her contribution to the project and the three anonymous reviewers for their useful comments.",
        "Sample",
        "PPt(s)",
        "PPi(s)",
        "d(s)",
        "TDi",
        "14.73",
        "23.12",
        "TD",
        "TD2",
        "11.37",
        "16.17",
        "TD",
        "TD3",
        "18.35",
        "36.58",
        "TD",
        "TD4",
        "30.23",
        "22.27",
        "SLI",
        "TD5",
        "9.42",
        "15.50",
        "TD",
        "TD6",
        "17.37",
        "36.75",
        "TD",
        "TD7",
        "20.32",
        "33.19",
        "TD",
        "TDg",
        "16.40",
        "24.47",
        "TD",
        "TD9",
        "24.35",
        "23.71",
        "SLI",
        "SLIi",
        "20.21",
        "19.10",
        "SLI",
        "SLI2",
        "19.70",
        "12.43",
        "SLI",
        "average TD",
        "18.06",
        "25.75",
        "TD",
        "average SLI",
        "19.95",
        "15.76",
        "SLI"
      ]
    }
  ]
}
