{
  "info": {
    "authors": [
      "Kristy Elizabeth Boyer",
      "Robert Phillips",
      "Michael Wallis",
      "Mladen Vouk",
      "James C. Lester"
    ],
    "book": "Proceedings of the Third Workshop on Innovative Use of NLP for Building Educational Applications",
    "id": "acl-W08-0907",
    "title": "Learner Characteristics and Feedback in Tutorial Dialogue",
    "url": "https://aclweb.org/anthology/W08-0907",
    "year": 2008
  },
  "references": [
    "acl-E03-1072",
    "acl-J00-3003"
  ],
  "sections": [
    {
      "text": [
        "Kristy Elizabeth Robert Michael D. Mladen A. James C. Boyera Phillipsab Wallisab Vouka Lestera",
        "Tutorial dialogue has been the subject of increasing attention in recent years, and it has become evident that empirical studies of human-human tutorial dialogue can contribute important insights to the design of computational models of dialogue.",
        "This paper reports on a corpus study of human-human tutorial dialogue transpiring in the course of problemsolving in a learning environment for introductory computer science.",
        "Analyses suggest that the choice of corrective tutorial strategy makes a significant difference in the outcomes of both student learning gains and self-efficacy gains.",
        "The findings reveal that tutorial strategies intended to maximize student motivational outcomes (e.g., self-efficacy gain) may not be the same strategies that maximize cognitive outcomes (i.e., learning gain).",
        "In light of recent findings that learner characteristics influence the structure of tutorial dialogue, we explore the importance of understanding the interaction between learner characteristics and tutorial dialogue strategy choice when designing tutorial dialogue systems."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Providing intelligent tutoring systems (ITSs) with the ability to engage learners in rich natural language dialogue has been a goal of the ITS community since the inception of the field.",
        "Tutorial dialogue has been studied in the context of a number of systems devised to support a broad range of conversational phenomena.",
        "Systems such as CIRCSIM (Evens and Michael 2006), BEETLE (Zinn et al.",
        "2002), the Geometry Explanation Tutor",
        "Barry et al.",
        "2006), ProPL (Lane and VanLehn 2005) and AutoTutor (Graesser et al.",
        "2003) support research that has begun to the see the emergence of a core set of foundational requirements for mixed-initiative natural language interaction that occurs in the kind of tutorial dialogue investigated here.",
        "Moreover, recent years have witnessed the appearance of corpus studies empirically investigating speech acts in tutorial dialogue (Marineau et al.",
        "2000), dialogues' correlation with learning al.",
        "2003, Katz et al.",
        "2003), student uncertainty in dialogue (Liscombe et al.",
        "2005, Forbes-Riley and Litman 2005), and comparing text-based and spoken dialogue (Litman et al.",
        "2006).",
        "Recent years have also seen the emergence of a broader view of learning as a complex process involving both cognitive and affective states.",
        "To empirically explore these issues, a number of ITSs such as AutoTutor (Jackson et al.",
        "2007), Betty's Brain (Tan and Biswas 2006), ITSpoke (Forbes-",
        "Riley et al.",
        "2005), M-Ecolab (Rebolledo-Mendez et al.",
        "2006), and MORE (del Soldato and Boulay 1995) are being used as platforms to investigate the impact of tutorial interactions on affective and motivational outcomes (e.g., self-efficacy) along with purely cognitive measures (i.e., learning gains).",
        "A central problem in this line of investigation is identifying tutorial strategies (e.g., Graesser et al.",
        "1995) that can appropriately balance the tradeoffs between cognitive and affective student outcomes (Lepper et al.",
        "1993).",
        "While a rich set of cognitive and affective tutorial strategies is emerging (e.g., Porayska-Pomsta et al.",
        "2004), the precise nature of the interdependence between these types of strategies is not well understood.",
        "In addition, it may be the case that different populations of learners engage in qualitatively different forms of dialogue.",
        "Students with particular characteristics may have specific dialogue profiles, and knowledge of such profiles could inform the design of tutorial systems whose strategies leverage the characteristics of the target population.",
        "The extent to which different tutorial strategies, and specific instances of them in certain contexts, may be used to enhance tutorial effectiveness is an important question to designers of ITSs.",
        "Given that human-human tutorial dialogue offers a promising model for effective communication (Chi et al.",
        "2001), our methodology is to study naturally occurring tutorial dialogues in a task-oriented learning environment to investigate the relationship between the structure of tutorial dialogue, the characteristics of learners, and the impact of cognitive and motivational corrective tutorial strategies on learning and self-efficacy (Boyer et al.",
        "in press).",
        "A text-based dialogue interface was incorporated into a learning environment for introductory computer science.",
        "In the environment, students undertook a programming task and conversed with human tutors while designing, implementing, and testing Java programs.",
        "The results of the study suggest that the choice of corrective tutorial strategy has a significant impact on the learning gains and self-efficacy of students.",
        "These findings reinforce those of other studies (e.g., Lepper et al.",
        "1993, Person et al.",
        "1995, Keller et al.",
        "1983) that indicate that some cognitive and motivational goals may be at odds with one other because a tutorial strategy designed to maximize one set of goals (e.g., cognitive goals) can negatively impact the other.",
        "We contextualize our findings in light of recent results that learner characteristics such as self-efficacy influence the structure of task-oriented tutorial dialogue (Boyer et al.",
        "2007), and may therefore produce important interaction effects when considered alongside tutorial strategy.",
        "This paper is organized as follows.",
        "Section 2 describes the corpus study, including experimental design and tagging of dialogue and student problem-solving actions.",
        "Section 3 presents analysis and results.",
        "Discussion and design implications are considered in Section 4, and concluding remarks follow in Section 5."
      ]
    },
    {
      "heading": "2. Corpus Study",
      "text": [
        "The corpus was gathered by logging text-based dialogues between tutors and novice computer science students.",
        "The learning task was to complete a Java programming problem that required students to apply fundamental concepts such as iteration, modularization, and sequential-access data structures.",
        "This study was conducted to compare the impact of certain corrective cognitive and motivational tutorial strategies on student learning and self-efficacy in human-human tutoring.",
        "Specifically, the study considered the motivational strategies of praise and reassurance (Lepper et al.",
        "1993) and the category of informational tutorial utterances termed cognitive feedback (Porayska-Pomsta et al.",
        "2004, Tan and Biswas 2006) that followed questionable student problem-solving action.",
        "Following the approach of Forbes-Riley (2005) and others (Marineau et al.",
        "2000), utterances from a corpus of human-human tutorial dialogues were annotated with dialogue acts.",
        "Then, adopting the approach proposed by Ohlsson et al.",
        "(2007), statistical modeling techniques were employed to quantify the relative impact of these different tutorial strategies on the outcomes of interest (in this case, learning and self-efficacy gains).",
        "Subjects were students enrolled in an introductory computer science course and were primarily freshman or sophomore engineering majors in disciplines such as mechanical, electrical, and computer engineering.",
        "The corpus was gathered from tutor-student interactions between 43 students and 14 tutors during a two-week study.",
        "Tutors and students were completely blind to each other's characteristics as they worked together remotely from separate labs.",
        "Tutors observed student problem-solving actions (e.g., programming, scrolling, executing programs) in real time.",
        "Tutors had varying levels of tutoring experience, and were not instructed about specific tutorial strategies.",
        "Subjects first completed a pre-survey including items about self-efficacy, attitude toward computer science, and attitude toward collaboration.",
        "Subjects then completed a ten item pretest over specific topic content.",
        "The tutorial session was controlled at 55 minutes for all subjects, after which subjects completed a post-survey and posttest containing variants of the items on the pre-versions.",
        "The raw corpus contains 4,864 dialogue moves: 1,528 student utterances and 3,336 tutor utterances.",
        "As a chronology of tutorial dialogue interleaved with student problem-solving (programming) actions that took place during the tutoring sessions, the corpus contains 29,996 programming keystrokes and 1,277 periods of scrolling - all performed by students.",
        "Other problem-solving actions, such as opening and closing files or running the program, were sparse and were therefore eliminated from the analyses.",
        "Of the 3,336 tutor utterances, 1,243 occur directly after \"questionable\" student problem-solving action.",
        "(The notion of \"questionable\" is defined below.)",
        "This subset of tutorial utterances serves as the basis for the tutorial strategy comparison.",
        "Student problem-solving actions were logged throughout tutoring sessions.",
        "Two actions were under consideration for the analysis: typing in the programming interface and scrolling in the program editor window.",
        "To interpret the raw logged student problem-solving actions, these events were automatically tagged using a heuristic measure for correctness: if a problem-solving action was a programming keystroke (character) that survived until the end of the session, this event was tagged promising, to indicate it was probably correct.",
        "If a problem-solving act was a programming keystroke (character) that did not survive until the end of the session, the problem-solving act was tagged questionable.",
        "Both these heuristics are based on the observation that in this tutoring context, students solved the problem in a linear fashion and tutors did not allow students to proceed past a step that had incorrect code in place.",
        "Finally, periods of consecutive scrolling were also marked questionable because in a problem whose entire solution fits on one printed page, scrolling was almost uniformly undertaken by a student who was confused and looking for answers in irrelevant skeleton code provided to support the programming task.",
        "Because utterances communicate through two channels, a cognitive channel and a motivational/affective channel, each utterance was annotated with both a required cognitive dialogue tag (Table 1) and an optional motivational/affective dialogue tag (Table 2).",
        "While no single standardized dialogue act tag set has been identified for tutorial dialogue, the tags applied here were drawn from several schemes in the tutorial dialogue and broader dialogue literature.",
        "A coding scheme for tutorial dialogue in the domain of qualitative physics influenced the creation of the tag set (Forbes-Riley et al.",
        "2005), as did the four-category scheme (Marineau et al.",
        "2000).",
        "A more expansive general dialogue act tag set also contributed commonly occurring acts (Stolcke et al.",
        "2000).",
        "The motivational tags were drawn from work by Lepper (1993) on motivational strategies of human tutors.",
        "Table 1 displays the cognitive subset of this dialogue act tag set, while Table 2 displays the motivational/affective tags.",
        "It should be noted that a cognitive tag was required for each utterance, while a motivational/affective tag was applied only to the subset of utterances that communicated in that channel.",
        "If an utterance constituted a strictly motivational/affective act, its cognitive channel was tagged with EX (EXtra-domain) indicating there was no relevant cognitive content.",
        "On the other hand, some utterances had both a cognitive component and a motivational/affective component.",
        "For example, a tutorial utterance of, \"That looks great!\"",
        "would have been tagged as positive feedback (PF) in the cognitive channel, and as praise (P) in the motivational/affective channel.",
        "In contrast, the tutorial move \"That's right,\" would be tagged as positive feedback (PF) in the cognitive channel and would not be annotated with a motivational/affective tag.",
        "Table 3 shows an excerpt from the corpus with dialogue act tags applied.",
        "I The entire corpus was tagged by a single human annotator, with a second tagger marking 1,418 of the original 4,864 utterances.",
        "The resulting kappa statistics were 0.76 in the cognitive channel and 0.64 in the motivation channel."
      ]
    },
    {
      "heading": "3. Analysis and Results",
      "text": [
        "Overall, these tutoring sessions were effective: they yielded learning gains (difference between posttest and pretest) with mean 5.9% and median 7.9%, which were statistically significant (p=0.038), and they produced self-efficacy gains",
        "I (difference between pre-survey and post-survey scores) with mean 12.1% and median 12.5%, which were also statistically significant (p<0.0001).",
        "Analyses revealed that statistically significant relationships hold between tutorial strategy and learning, as well as between tutorial strategy and self-efficacy gains.",
        "First, the values of learning gain and self-efficacy gain were grouped into binary categories (\"Low\", \"High\") based on the median value.",
        "We then applied multiple logistic regression with the gain category as the predicted value.",
        "Tutorial strategy, incoming self-efficacy rating, and pretest score were predictors in the model.",
        "The binarization approach followed by multiple logistic regression was chosen over multiple linear regression on a continuous response variable because the learning instruments (10 items each) and self-efficacy questionnaires (5 items each) yielded few distinct values of learning gain, meaning the response variable (learning gain and self-efficacy gain, respectively) would not have been truly continuous in nature.",
        "Logistic regression is used for binary response variables; it computes the odds of a particular outcome over another (e.g., \"Having high learning gain versus low learning gain\") given one value of the predictor variable over another (e.g., \"The corrective tutorial strategy chosen was positive cognitive feedback instead of praise\").",
        "Cognitive Motivational/",
        "Utterance Tag Affective Tag Tutor: Is there a way you could only write the code to extract the digit once but have it go through each of the five digits?",
        "Student: Create a loop?",
        "EQ Tutor: Yes!",
        "PF P Student: Would a for loop be best?",
        "EQ Tutor: Yes PF Tutor: What are the three things we need for a loop?",
        "EQ Student: Conditions, what we want it to do, then what increments g you want it to increase by.",
        "After accounting for the effects of pretest score and incoming self-efficacy rating (both of which were significant in the model with p<0.001), observations containing tutorial encouragement were 56% less likely to result in high learning gain than observations without explicit tutorial encouragement (p=0.001).",
        "On the other hand, an analogous model of self-efficacy gain revealed that tutorial encouragement was 57% more likely to result in high self-efficacy gain compared to tutorial responses that had no explicit praise or reassurance (p=0.054).",
        "These models suggested that the presence of tutorial encouragement in response to questionable student problem-solving action may enhance self-efficacy gain but detract from learning gain.",
        "Another significant finding was that observations in which the tutor used cognitive feedback plus praise were associated with 40% lower likelihood of high learning gain than observations in which the tutor used purely cognitive feedback.",
        "No impact was observed on self-efficacy gain.",
        "These results suggest that in response to questionable student problem-solving action, to achieve learning gains, purely cognitive feedback is preferred over cognitive feedback plus praise, while self-efficacy gain does not appear to be impacted either way.",
        "Among students with low incoming self-efficacy, observations in which the tutor employed a standalone motivational act were 300% as likely to be in the high self-efficacy gain group as observations in which the tutor employed a purely cognitive statement or a cognitive statement combined with encouragement (p=0.039).",
        "In contrast, among students with high initial self-efficacy, a purely motivational tactic resulted in 90% lower odds of being in the high self-efficacy gain group.",
        "These results suggest that standalone praise or reassurance may be useful for increasing self-efficacy gain among low initial self-efficacy students, but may decrease self-efficacy gain in high initial self-efficacy students.",
        "Considering strictly cognitive feedback, positive feedback resulted in 190% increased odds of high student self-efficacy gain compared to the other cognitive strategies (p=0.0057).",
        "Positive cognitive feedback did not differ significantly from other types of cognitive strategies in a Chi-square comparison with respect to learning gains (p=0.390).",
        "The models thus suggest when dealing with questionable student problem-solving action, positive cognitive feedback is preferable to other types of cognitive feedback for eliciting self-efficacy gains, but this type of feedback is not found to be better or worse than other cognitive feedback for effecting learning gains."
      ]
    },
    {
      "heading": "4. Discussion",
      "text": [
        "The study found that the presence of direct tutorial praise or encouragement in response to questionable student problem-solving action increased the odds that the student reported high self-efficacy gain while lowering the odds of high learning gain.",
        "The study also found that, with regard to learning gains, purely cognitive feedback was preferable to cognitive feedback with an explicitly motivational component.",
        "These empirical findings are consistent with theories of Lepper et al.",
        "(1993) who found that some cognitive and affective goals in tutoring are \"at odds.\"",
        "As would be predicted, the results also echo recent quantitative results from other tutoring domains such as qualitative physics (Jackson et al.",
        "2007) and river ecosystems (Tan and Biswas 2006) that, in general, overt motivational feedback contributes to motivation but cognitive feedback matters more for learning.",
        "Of the corrective tutorial strategies that were exhibited in the corpus, positive cognitive feedback emerged as an attractive approach for responding to plausibly incorrect student problemsolving actions.",
        "Responding positively (e.g., \"Right\") to questionable student actions is an example of indirect correction, which is recognized as a polite strategy (e.g., Porayska-Pomsta et al.",
        "2004).",
        "A qualitative investigation of this phenomenon revealed that in the corpus, tutors generally followed positive feedback in this context with more substantive cognitive feedback to address the nature of the student's error.",
        "As such, the positive feedback approach seems to have an implicit, yet perceptible, motivational component while retaining its usefulness as cognitive feedback.",
        "This study found that explicit motivational acts, when applied as corrective tutorial approaches, had different impacts on different student subgroups.",
        "Students with low initial self-efficacy appeared to benefit more from praise and reassurance than students with high initial self-efficacy.",
        "In a prior corpus study to investigate the impact of learner characteristics on tutorial dialogue (Boyer et al.",
        "2007), we also found that learners from different populations exhibited significantly different dialogue profiles.",
        "For instance, high self-efficacy students made more declarative statements, or assertions, than low self-efficacy students.",
        "In addition, tutors paired with high self-efficacy students gave more conversational acknowledgments than tutors paired with low self-efficacy students, despite the fact that tutors were not made aware of any learner characteristics before the tutoring session.",
        "Additional dialogue profile differences emerged between high and low-performing students, as well as between males and females.",
        "Together these two studies suggest that learner characteristics influence the structure of tutorial dialogue, and that the choice of tutorial strategy may impact student subgroups in different ways."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "The work reported here represents a first step toward understanding the effects of learner characteristics on task-oriented tutorial dialogue and the use of feedback.",
        "Results suggest that positive cognitive feedback may prove to be an appropriate strategy for responding to questionable student problem-solving actions in task-oriented tutorial situations because of its potential for addressing the sometimes competing cognitive and affective needs of students.",
        "For low self-efficacy students, it was found that direct standalone encouragement can be used to bolster self-efficacy, but care must be used in correctly diagnosing student self-efficacy because the same standalone encouragement does not appear helpful for high self-efficacy students.",
        "These preliminary findings highlight the importance of understanding the interaction between learner characteristics and tutorial strategy as it relates to the design of tutorial dialogue systems.",
        "Several directions for future work appear promising.",
        "First, it will be important to explore the influence of learner characteristics on tutorial dialogue in the presence of surface level information about students' utterances.",
        "This line of investigation is of particular interest given recent results indicating that lexical cohesion in tutorial dialogue with low-performing students is found to be highly correlated with learning (Ward and Litman 2006).",
        "Second, while the work reported here has considered a limited set of motivational dialogue acts, namely praise and reassurance, future work should target an expanded set of affective dialogue acts to facilitate continued exploration of motivational and affective phenomena in this context.",
        "Finally, the current results reflect human-human tutoring strategies that proved to be effective; however, it remains to be seen whether these same strategies can be successfully employed in tutorial dialogue systems.",
        "Continuing to identify and empirically compare the effectiveness of alternative tutorial strategies will build a solid foundation for choosing and implementing strategies that consider learner characteristics and successfully balance the cognitive and affective concerns surrounding the complex processes of teaching and learning through tutoring."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The authors wish to thank Scott McQuiggan and the members of the Intellimedia Center for Intelligent Systems for their ongoing intellectual contributions, and the Realsearch Group at NC State University for extensive project development support.",
        "This work was supported in part by the National Science Foundation through Grant REC-0632450, an NSF Graduate Research Fellowship, and the STARS Alliance Grant CNS-0540523.",
        "Any opinions, findings, conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the National Science Foundation.",
        "Support was also provided by North Carolina State University through the Department of Computer Science and the Office of the Dean of the College of Engineering."
      ]
    }
  ]
}
