{
  "info": {
    "authors": [
      "Marina Litvak",
      "Mark Last"
    ],
    "book": "Coling 2008: Proceedings of the workshop Multi-source Multilingual Information Extraction and Summarization",
    "id": "acl-W08-1404",
    "title": "Graph-Based Keyword Extraction for Single-Document Summarization",
    "url": "https://aclweb.org/anthology/W08-1404",
    "year": 2008
  },
  "references": [
    "acl-P04-3020",
    "acl-W00-1109",
    "acl-W04-3252"
  ],
  "sections": [
    {
      "text": [
        "litvakm@bgu.ac.il",
        "In this paper, we introduce and compare between two novel approaches, supervised and unsupervised, for identifying the keywords to be used in extractive summarization of text documents.",
        "Both our approaches are based on the graph-based syntactic representation of text and web documents, which enhances the traditional vector-space model by taking into account some structural document features.",
        "In the supervised approach, we train classification algorithms on a summarized collection of documents with the purpose of inducing a keyword identification model.",
        "In the unsupervised approach, we run the HITS algorithm on document graphs under the assumption that the top-ranked nodes should represent the document keywords.",
        "Our experiments on a collection of benchmark summaries show that given a set of summarized training documents, the supervised classification provides the highest keyword identification accuracy, while the highest F-measure is reached with a simple degree-based ranking.",
        "In addition, it is sufficient to perform only the first iteration of HITS rather than running it to its convergence."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Document summarization is aimed at all types of electronic documents including HTML files with",
        "© 2008.",
        "Some rights reserved.",
        "the purpose of generating the summary - main document information expressed in \"a few words\".",
        "In this paper, we introduce and compare between two approaches: supervised and unsupervised, for the cross-lingual keyword extraction to be used as the first step in extractive summarization of text documents.",
        "Thus, according to our problem statement, the keyword is a word presenting in the document summary.",
        "The supervised learning approach for keywords extraction was first suggested in (Turney, 2000), where parametrized heuristic rules were combined with a genetic algorithm into a system - GenEx that automatically identified keywords in a document.",
        "For both our approaches, we utilize a graph-based representation for text documents.",
        "Such representations may vary from very simple, syntactic ones like words connected by edges representing co-occurrence relation (Mihalcea and Tarau, 2004) to more complex ones like concepts connected by semantic relations (Leskovec et al., 2004).",
        "The main advantage of a syntactic representation is its language independency, while the semantic graphs representation provide new characteristics of text such as its captured semantic structure that itself can serve as a document surrogate and provide means for document navigation.",
        "Authors of (Leskovec et al., 2004) reduce the problem of summarization to acquiring machine learning models for mapping between the document graph and the graph of a summary.",
        "Using deep linguistic analysis, they extract substructures (subjectpredica-teobject triples) from document semantic graphs in order to get a summary.",
        "Contrary to (Leskovec et al., 2004), both our approaches work with a syntactic representation that does not require almost any language-specific linguistic processing.",
        "In this paper, we perform experiments with directed graphs, where the nodes stand for words/phrases and the edges represent syntactic relationships between them, meaning followed by\" (Schenker et al., 2005).",
        "Some of the most successful approaches to extractive summarization utilize supervised learning algorithms that are trained on collections of \"ground truth\" summaries built for a relatively large number of documents (Mani and Maybury, 1999).",
        "However, in spite of the reasonable performance of such algorithms they cannot be adapted to new languages or domains without training on each new type of data.",
        "Our first approach also utilizes classification algorithms, but, thanks to the language-independent graph representation of documents, it can be applied to various languages and domains without any modifications of the graph construction procedure (except for the technical upgrade of implementation for multilingual processing of text, like reading Unicode or language-specific encodings, etc.)",
        "(Markov et al., 2007; Last and Markov, 2005).",
        "Of course, as a supervised approach it requires high-quality training labeled data.",
        "Our second approach uses a technique that does not require any training data.",
        "To extract the summary keywords, we apply a ranking algorithm called HITS (Kleinberg, 1999) to directed graphs representing source documents.",
        "Authors of (Mi-halcea and Tarau, 2004) applied the PageRank algorithm (Brin and Page, 1998) for keyword extraction using a simpler graph representation (undirected unweighted graphs), and show that their results compare favorably with results on established benchmarks of manually assigned keywords.",
        "(Mi-halcea and Tarau, 2004) are also using the HITS algorithm for automatic sentence extraction from documents represented by graphs built from sentences connected by similarity relationships.",
        "Since we work with directed graphs, HITS is the most appropriate algorithm for our task as it takes into account both in-degree and out-degree of nodes.",
        "We show in our experiments that running HITS till convergence is not necessary, and initial weights that we get after the first iteration of algorithm are good enough for rank-based extraction of summary keywords.",
        "Another important conclusion that was infered from our experimental results is that, given the training data in the form of annotated syntactic graphs, supervised classification is the most accurate option for identifying the salient nodes in a document graph, while a simple degree-based ranking provides the highest F-measure."
      ]
    },
    {
      "heading": "2. Document representation",
      "text": [
        "Currently, we use the \"simple\" graph representation defined in (Schenker et al., 2005) that holds unlabeled edges representing order-relationship between the the words represented by nodes.",
        "The stemming and stopword removal operations of basic text preprocessing are done before graph building.",
        "Only a single vertex for each distinct word is created even if it appears more than once in the text.",
        "Thus each vertex label in the graph is unique.",
        "If a word a immediately precedes a word b in the same sentence somewhere in the document, then there is a directed edge from the vertex corresponding to term a to the vertex corresponding to term b.",
        "Sentence terminating punctuation marks (periods, question marks, and exclamation points) are taken by us into account and an edge is not created when these are present between two words.",
        "This definition of graph edges is slightly different from co-occurrence relations used in (Mihalcea and Tarau, 2004) for building undirected document graphs, where the order of word occurrence is ignored and the size of the cooccurrence window is varied between 2 and 10.",
        "Sections defined for HTML documents are: title, which contains the text related to the document's title and any provided keywords (meta-data) and text, which comprises any of the readable text in the document.",
        "This simple representation can be extended to many different variations like a semantic graph where nodes stand for concepts and edges represent semantic relations between them or a more detailed syntactic graph where edges and nodes are labeled by significant information like frequency, location, similarity, distance, etc.",
        "The syntactic graph-based representations were shown in (Schenker et al., 2005) to outperform the classical vector-space model on several clustering and classification tasks.",
        "We choose the \"simple\" representation as a representation that saves processing time and memory resources as well as gives nearly the best results for the two above text mining tasks."
      ]
    },
    {
      "heading": "3. Keywords extraction",
      "text": [
        "In this paper, we deal with the first stage of extractive summarization where the most salient words (\"keywords\") are extracted in order to generate a summary.",
        "Since each distinct word in a text is represented by a node in the document graph, the keywords extraction problem is reduced to the salient nodes extraction in graphs.",
        "In this approach, we try to identify the salient nodes of document graphs by training a classification algorithm on a repository of summarized documents such as (DUC, 2002) with the purpose of inducing a keyword identification model.",
        "Each node of every document graph belongs to one of two classes: YES if the corresponding word is included in the document extractive summary and NO otherwise.",
        "We consider the graph-based features (e.g., degree) characterizing graph structure as well as statistic-based features (Nobata et al., 2001) characterizing text content represented by a node.",
        "The complete list of features, along with their formal definitions, is provided below:",
        "• In Degree - number of incoming edges",
        "• Out Degree - number of outcoming edges",
        "• Degree - total number of edges",
        "• Frequency - term frequency of word represented by node",
        "equals to 1 iff Frequency>threshold",
        "• Location Score - calculates an average of location scores between all sentences containing the word N represented by node (denote these sentences as S(N)):",
        "• Tfidf Score - calculates the tf-idf",
        "score (Salton, 1975) of the word represented by node.",
        "lrThe term frequency (TF) is the number of times the word appears in a document divided by the number of total words in the document.",
        "• Headline Score e {0,1}, equals to 1 iff document headline contains word represented by node.",
        "Ranking algorithms, such as Kleinberg's HITS algorithm (Kleinberg, 1999) or Google's PageR-ank (Brin and Page, 1998) have been elaborated and used in Web-link analysis for the purpose of optimizating the search performance on the Web.",
        "These algorithms recursively assign a numerical weight to each element of a hyperlinked set of documents, determining how important each page is.",
        "A hyperlink to a page counts as a vote of support.",
        "A page that is linked to by many important pages (with high rank) receives a high rank itself.",
        "A similar idea can be applied to lexical or semantic graphs extracted from text documents, in order to extract the most significant blocks (words, phrases, sentences, etc.)",
        "for the summary (Mi-halcea and Tarau, 2004; Mihalcea, 2004).",
        "In this paper, we apply the HITS algorithm to document graphs and evaluate its performance on automatic unsupervised text unit extraction in the context of the text summarization task.",
        "The HITS algorithm distinguishes between \"authorities\" (pages with a large number of incoming links) and \"hubs\" (pages with a large number of outgoing links).",
        "For each node, HITS produces two sets of scores - an \"authority\" score, and a \"hub\" score:",
        "Vj£Out(Vi)",
        "For the total rank (H) calculation we used the following four functions:"
      ]
    },
    {
      "heading": "1.. rank equals to the authority score",
      "text": []
    },
    {
      "heading": "2.. rank equals to the hub score",
      "text": [
        "3. rank equals to the average between two scores H (Vi) = avg {HITSA (V), HITSH {Vi)}"
      ]
    },
    {
      "heading": "4.. rank equals to the maximum between two scores",
      "text": [
        "Score (Si)",
        "NBC accuracy MR lower bound MR upper bound",
        "size of the feature set"
      ]
    },
    {
      "heading": "4. Experimental results",
      "text": [
        "All experiments have been performed on the collection of summarized news articles provided by the Document Understanding Conference 2002 (DUC, 2002).",
        "This collection contains 566 English texts along with 2-3 summaries per document on average.",
        "The size of syntactic graphs extracted from these texts is 196 on average, varying from 62 to 876.",
        "We utilized several classification algorithms implemented in Weka's software (Witten and Frank, 2005) : 148 (known as C4.5), SMO (Support Vector Machine) and Nai'veBayes for building binary classification models (a word belongs to summary / does not belong to the summary).",
        "For the training we built dataset with two classes: YES for nodes belonging to at least one summary of the document, and NO for those that do not belong to any summary.",
        "The accuracy of the default (majority) rule over all nodes is equal to the percentage of non-salient nodes (83.17%).",
        "For better classification results we examined the importance of each one of the features, described in Section 3.1 using automated feature selection.",
        "Table 1 presents the average GainRatio values (\"merits\") and the average rank of the features calculated from the DUC 2002 document collection, based on 10-fold cross validation.",
        "As expected, the results of 148 and SMO (these algorithms perform feature selection while building the model) did not vary on different feature sets, while Nai'veBayes gave the best accuracy on the reduced set.",
        "Figure 1 demonstrates the accuracy variations of Nai'veBayes classifier on the different feature sets relative to the confidence inter-",
        "IntrinsicJnf'o(A) = -J2xlt log [it]",
        "average merit",
        "rank",
        "feature",
        "0.192 +- 0.005",
        "1",
        "Frequent words distribution",
        "0.029 +- 0",
        "2",
        "In Degree",
        "0.029 +- 0",
        "3",
        "Out Degree",
        "0.025 +- 0",
        "4",
        "Frequency",
        "0.025 +- 0",
        "5",
        "Degree",
        "0.017+-0",
        "6",
        "Headline Score",
        "0.015+-0",
        "7",
        "Location Score",
        "0.015 +- 0.001",
        "8",
        "Tfidf Score",
        "val for the majority rule accuracy according to the normal approximation of the binomial distribution with a = 0.05.",
        "Table 3 presents classification results for supervised algorithms (for NaiveBayes the results shown on the top 2 features) based on 10-fold cross validation as well as results of unsupervised learning.",
        "We have studied the following research questions:",
        "1.",
        "Is it possible to induce some classification model based on HITS scores?"
      ]
    },
    {
      "heading": "2.. Is it necessary to run HITS until convergence?",
      "text": [
        "In order to answer these questions we performed the following two experiments:",
        "1.",
        "In the first one, we run HITS only one iteration.",
        "Note, that the ranks resulted from the first iteration are just in-degree and out-degree scores for each node in graph, and may be easily computed without even starting HITS.",
        "2.",
        "In the second experiment we run HITS until convergence (different number of steps for different graphs) and compare the results with the results of the first experiment.",
        "After each experiment we sorted the nodes of each graph by rank for each function (see the rank calculating functions described in Section 3.2).",
        "After the sorting we built an ROC (Receiver Operating Characteristic) curve for each one of the graphs.",
        "Figure 2 demonstrates a sample ROC curve for one of the documents from DUC 2002 collection.",
        "In order to compare between ranking functions (see Section 3.2) we calculated the average of AUC (Area Under Curve) for the 566 ROC curves for each function.",
        "Table 2 presents the average AUC results for the four functions.",
        "According to these results, functions that take into account both scores (average and maximum between two scores) are optimal.",
        "We use the average function for comparing and reporting the following results.",
        "Also, we can see that degree vectors give better AUC results",
        "I k+l_ fcl",
        "Ranking function",
        "Degree vectors",
        "Converged vectors",
        "Authority",
        "0.625",
        "0.600",
        "Hub",
        "0.620",
        "0.601",
        "Avg(Authority, Hub)",
        "0.651",
        "0.622",
        "Max(Authority, Hub)",
        "0.651",
        "0.624",
        "number of words",
        "than converged ones.",
        "In order to compare between the degree-based vectors and the converged ones we calculated the precision curves for each graph in both experiments.",
        "Then for each ranking method the curve representing an average cumulative AUC over the 566 precision curves was calculated.",
        "Figure 3 demonstrates the difference between resulting curves.",
        "As we can conclude from this chart, the degree-based vectors have a slight advantage over the converged ones.",
        "The \"optimum\" point where the average AUC is maximum for both methods is 111 words with the average AUC of 28.4 for degree-based words and 33 for HITS-ranked words.",
        "That does not have much significance because each document has a different \"optimum\" point.",
        "Finally, we compared the results of unsupervised method against the supervised one.",
        "For this purpose, we consider unsupervised model based on extracting top N ranked words for four different values of iV: 10, 20, 30 and 40.",
        "Table 3 represents the values for such commonly used metrics as: Accuracy, True Positive Rate, False Positive Rate, Precision, Recall and F-Measure respectively for each one of the tested methods.",
        "The optimal values are signed in bold.",
        "Despite the relatively poor accuracy performance of both approaches, the precision and recall results for the unsupervised methods show that the classification model, where we choose the top most ranked words, definitely succeeds compared to the similar keyword extraction methods.",
        "(Leskovec et al., 2004) that is about \"logical triples\" extraction rather than single keyword extraction, presents results on DUC 2002 data, which are similar to ours in terms of the F-measure (40% against 39%) though our method requires much less linguistic preprocessing and uses a much smaller feature set (466 features against 8).",
        "(Mi-halcea and Tarau, 2004) includes a more similar task to ours (single keyword extraction) though the definition of a keyword is different (\"keywords manually assigned by the indexers\" against the \"summary keywords\") and a different dataset (In-spec) was used for results presentation.",
        "Method",
        "Accuracy",
        "TP",
        "FP",
        "Precision",
        "Recall",
        "F-Measure",
        "Classification",
        "J48",
        "0.847",
        "0.203",
        "0.022",
        "0.648",
        "0.203",
        "0.309",
        "Nai'veBayes",
        "0.839",
        "0.099",
        "0.011",
        "0.648",
        "0.099",
        "0.172",
        "SMO",
        "0.839",
        "0.053",
        "0.002",
        "0.867",
        "0.053",
        "0.100",
        "Degree-based Ranking",
        "N = 10",
        "0.813",
        "0.186",
        "0.031",
        "0.602",
        "0.186",
        "0.282",
        "N = 20",
        "0.799",
        "0.296",
        "0.080",
        "0.480",
        "0.296",
        "0.362",
        "N = 30",
        "0.772",
        "0.377",
        "0.138",
        "0.409",
        "0.377",
        "0.388",
        "N = 40",
        "0.739",
        "0.440",
        "0.200",
        "0.360",
        "0.440",
        "0.392"
      ]
    },
    {
      "heading": "5. Conclusions",
      "text": [
        "In this paper we have proposed and evaluated two graph-based approaches: supervised and unsupervised, for the cross-lingual keyword extraction to be used in extractive summarization of text documents.",
        "The empirical results suggest the following.",
        "When a large labeled training set of summarized documents is available, the supervised classification is the most accurate option for identifying the salient keywords in a document graph.",
        "When there is no high-quality training set of significant size, it is recommended to use the unsupervised method based on the node degree ranking, which also provides a higher F-measure than the supervised approach.",
        "The intuition behind this conclusion is very simple: most words that are highly \"interconnected\" with other words in text (except stop-words) should contribute to the summary.",
        "According to our experimental results, we can extract up to 15 words with an average precision above 50%.",
        "Running HITS to its convergence is redundant, since it does not improve the initial results of the degree ranking."
      ]
    },
    {
      "heading": "6. Future work",
      "text": [
        "The next stage of our extractive summarization methodology is generation of larger units from the selected keywords.",
        "At each step, we are going to reduce document graphs to contain larger units (subgraphs) as nodes and apply some ranking algorithms to the reduced graphs.",
        "This algorithm is iterative, where graph reduction steps are repeated until maximal subgraph size is exceeded or another constraint is met.",
        "Also, we plan to work on the supervised classification of sub-graphs, where many graph-based features will be extracted and evaluated.",
        "In the future, we also intend to evaluate our method on additional graph representations of documents, especially on the concept-based representation where the graphs are built from the con-",
        "cepts fused from the texts.",
        "Once completed, the graph-based summarization methodology will be compared to previously developed state-of-the-art summarization methods and tools.",
        "All experiments will include collections of English and non-English documents to demonstrate the cross-linguality of our approach."
      ]
    }
  ]
}
