{
  "info": {
    "authors": [
      "Marcus Colman",
      "Arash Eshghi",
      "Patrick G. T. Healey"
    ],
    "book": "Proceedings of the 9th SIGdial Workshop on Discourse and Dialogue",
    "id": "acl-W08-0116",
    "title": "Quantifying Ellipsis in Dialogue: an index of mutual understanding",
    "url": "https://aclweb.org/anthology/W08-0116",
    "year": 2008
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Marcus Colman, Arash Eshghi and Patrick G. T. Healey",
        "Interaction, Media and Communication Research Group Queen Mary, University of London El 4NS UK",
        "This paper presents a coding protocol that allows naïve users to annotate dialogue transcripts for anaphora and ellipsis.",
        "Cohen's kappa statistic demonstrates that the protocol is sufficiently robust in terms of reliability.",
        "It is proposed that quantitative ellipsis data may be used as an index of mutual-engagement.",
        "Current and potential uses of ellipsis coding are described."
      ]
    },
    {
      "heading": "1.. Introduction",
      "text": [
        "Spontaneously generated dialogue, whether naturally occurring or task-oriented, rarely sticks to accepted rules of grammar or even politeness.",
        "Interruptions, ungrammatical utterances and grunts or other noises are found in the majority of contributions in dialogue corpora.",
        "One reason for this is the ubiquitous use of ellipsis; the omission of words or phrases from a contribution which can be inferred or extracted from previous contributions.",
        "Ellipsis is optional; the full constituent could serve communication as well as the elliptical version.",
        "Where ellipsis occurs across speakers i.e., one participant makes (elliptical) use of another's contribution, it provides a direct index of the mutual-accessibility of the current conversational context (cf. Healey et.",
        "al.",
        "2007; Eshghi and Healey, 2007).",
        "In some cases elliptical contributions are obvious, as in the polar response 'yeah', signifying that a question has been heard, understood and considered; however, there are degrees of complexity that would seem to require a close understanding of what another participant is referring to.",
        "It is this issue of mutual-accessibility or 'grounding' that we propose can be investigated through the quantification of elliptical phenomena.",
        "These phenomena are, we propose, also related to the way referring expressions can contract over repeated use.",
        "(e.g. Schober and Clark, 1989; Wilkes-Gibbs and Clark, 1992).",
        "The approach taken in Clark et al.",
        "'s 'collaborative theory' is that as mutual understanding increases, dialogue contributions become shorter as referring terms become part of the common ground.",
        "Clark and Krych (2004) note that various elliptical phrases can be used to establish common ground, from continuers ('uh-huh', 'yeah') or assessments ('gosh') to establishing shared attention through deictic expressions such as 'this', 'that', 'here' and 'there'.",
        "Healey et al.",
        "(2007) demonstrated the basic concept and viability of quantifying ellipsis phenomena as a quantitative index of mutual-accessibility of context.",
        "They showed that the frequency of use of cross-speaker elliptical expressions in online chat varies systematically depending on whether communication is 'local' i.e. within a single chat room or 'remote'.",
        "However, the coding of ellipsis in this study did not follow an explicit protocol.",
        "It relied mainly on the distinctions made by Fernandez et al.",
        "(2004) but specific measures of reliability and validity were not calculated.",
        "ENDOPHOR CATAPHOR VAGUE ANAPHOR",
        "Figure 1.",
        "'Anaphora' decision chart",
        "In this paper we present an ellipsis coding protocol that provides a set of coding categories and we report the inter-rater reliability scores that have been obtained with it.",
        "In order to simplify coding and increase reliability, categories suggested by Fernandez et al.",
        "have been collapsed into broader ones.",
        "It should be pointed out that we are not, in general, trying to produce an accurate or definitive analysis of ellipsis.",
        "The protocol is rather the product of contending with the compromise between robust coding categories and linguistic elegance.",
        "The categories presented here are generally ordered in terms of occurrence in order to assist the coder.",
        "A contribution to dialogue may contain more than one type of elliptical utterance; contributions are not assigned to one mutually exclusive category.",
        "Rather, coders are able to use the protocol to label any part of a dialogue that is elliptical."
      ]
    },
    {
      "heading": "2.. The Ellipsis Protocol",
      "text": [
        "The protocol is designed as a tool for coding one aspect of dialogue, developed with the intention",
        "POLAR ANSWER ACKNOWLEDGEMENT PROMPTED NSU ANSWER UNPROMPTED NSU ANSWER",
        "Figure 2.",
        "'Answers' decision chart",
        "that users with no specific knowledge of linguistics can use it.",
        "As can be seen from Figures 1-4, it consists of four binary branching decision trees that are applied to each contribution in an interaction.",
        "Full instructions for use of the protocol have also been written and are available from the authors."
      ]
    },
    {
      "heading": "3.. Inter-rater reliability",
      "text": [
        "In order to demonstrate reliability between coders, two coders (one computer scientist, one psychologist) applied the ellipsis protocol to a sample of task oriented dialogue.",
        "This was taken from the HCRC Map Task corpus (Anderson et al., 1991); a series of dialogues in which one participant attempts to describe a route on a fictional map to another.",
        "The longest of these dialogues was chosen to be coded (transcript Q1NC1) which consisted of 446 turns and 5533 words.",
        "Cohen's kappa was calculated using the procedure outlined in Howell (1994); see Carletta (1996) for a discussion of the use of kappa in dialogue coding.",
        "Kappa in this instance was .81, which shows very high reliability, even by conservative standards (Krippendorff,",
        "Is the word from the list used after the word or phrase it replaces or refers to?",
        "CLARIFICATION ELLIPSIS NSU QUERY",
        "Figure 3.",
        "'Questions' decision chart",
        "REJECTION MODIFIER CONTINUATION SENTENTIAL ELLIPSIS",
        "Figure 4.",
        "'Statements' decision chart",
        "1980).",
        "Table 1 below presents a breakdown of the instances of categories that were agreed upon.",
        "Table 1 shows the total number and approximate percentage of agreements.",
        "Also given, '1.dis' and '2.dis' are the number of observed instances by coders one and two respectively identified but disputed for that particular category.",
        "The total number of elliptical or non-elliptical instances coded, from single words or phrases to entire turns was 624; of these, 100 (16%) were disagreed upon and 78 instances (12.5%) were agreed to contain no elliptical phenomena (no ellipsis disagreements = 50).",
        "Some categories have very low frequencies; however, previous work suggests that these categories are necessary.",
        "To some extent this table shows the limitations of the kappa statistic; coder agreement varies considerably across these categories.",
        "Endophor",
        "Cataphor",
        "Exaphor",
        "Vague Anaphor",
        "Total",
        "119",
        "2",
        "8",
        "33",
        "%",
        "19",
        ".03",
        "1.3",
        "5.3",
        "1.dis",
        "12",
        "1",
        "1",
        "20",
        "2.dis",
        "10",
        "3",
        "17",
        "6",
        "Polar",
        "Acknowledge",
        "Prompted",
        "Un-",
        "Answer",
        "NSU Ans.",
        "prompted NSU Ans.",
        "Total",
        "113",
        "78",
        "1",
        "7",
        "%",
        "18.1",
        "12.5",
        "0.2",
        "1.1",
        "1.dis",
        "7",
        "15",
        "0",
        "1",
        "2.dis",
        "5",
        "9",
        "1",
        "5",
        "Sluice",
        "Clarification Ellipsis",
        "Check",
        "NSU Query",
        "Total",
        "2",
        "7",
        "20",
        "27",
        "%",
        ".03",
        "1.1",
        "3.2",
        "4.3",
        "1.dis",
        "0",
        "0",
        "2",
        "5",
        "2.dis",
        "2",
        "2",
        "0",
        "2",
        "Rejection",
        "Modification",
        "Continuation",
        "Sentential Ellipsis",
        "Total",
        "2",
        "1",
        "13",
        "13",
        "%",
        ".03",
        ".002",
        "2.1",
        "2.1",
        "1.dis",
        "1",
        "0",
        "3",
        "10",
        "2.dis",
        "4",
        "0",
        "3",
        "3"
      ]
    },
    {
      "heading": "4.. Discussion",
      "text": []
    }
  ]
}
