{
  "info": {
    "authors": [
      "Maria Georgescul",
      "Alexander Clark",
      "Susan Armstrong"
    ],
    "book": "Proceedings of the Third International Joint Conference on Natural Language Processing",
    "id": "acl-I08-2133",
    "title": "A Comparative Study of Mixture Models for Automatic Topic Segmentation of Multiparty Dialogues",
    "url": "https://aclweb.org/anthology/I08-2133",
    "year": 2008
  },
  "references": [
    "acl-A00-2004",
    "acl-J91-1002",
    "acl-J97-1003",
    "acl-P03-1071",
    "acl-P06-1003",
    "acl-P06-1004",
    "acl-W06-2914"
  ],
  "sections": [
    {
      "text": [
        "A Comparative Study of Mixture Models for Automatic Topic Segmentation",
        "of Multiparty Dialogues",
        "Maria Georgescul Alexander Clark Susan Armstrong",
        "ISSCO/TIM, ETI Department of Computer Science ISSCO/TIM, ETI University of Geneva Royal Holloway University of London University of Geneva maria.georgescul@eti.unige.ch alexc@cs.rhul.ac.uk susan.armstrong@issco.unige.ch",
        "In this article we address the task of automatic text structuring into linear and non-overlapping thematic episodes at a coarse level of granularity.",
        "In particular, we deal with topic segmentation on multi-party meeting recording transcripts, which pose specific challenges for topic segmentation models.",
        "We present a comparative study of two probabilistic mixture models.",
        "Based on lexical features, we use these models in parallel in order to generate a low dimensional input representation for topic segmentation.",
        "Our experiments demonstrate that in this manner important information is captured from the data through less features."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Some of the earliest research related to the problem of text segmentation into thematic episodes used the word distribution as an intrinsic feature of texts (Morris and Hirst, 1991).",
        "The studies of (Reynar, 1994; Hearst, 1997; Choi, 2000) continued in this vein.",
        "While having quite different emphasis at different levels of detail (basically from the point of view of the employed term weighting and/or the adopted inter-block similarity measure), these studies analyzed the word distribution inside the texts through the instrumentality of merely one feature, i.e. the one-dimensional inter-block similarity.",
        "More recent work use techniques from graph theory (Malioutov and Barzilay, 2006) and machine learning (Galley et al., 2003; Georgescul et al., 2006; Purver et al., 2006) in order to find patterns in vocabulary use.",
        "We investigate new approaches for topic segmentation on corpora containing multi-party dialogues, which currently represents a relatively less explored domain.",
        "Compared to other types of audio content (e.g. broadcast news recordings), meeting recordings are less structured, often exhibiting a high degree of participants spontaneity and there may be overlap in finishing one topic while introducing another.",
        "Moreover while ending the discussion on a certain topic, there can be numerous new attempts to introduce a new topic before it becomes the focus of the dialogue.",
        "Therefore, the task of automatic topic segmentation of meeting recordings is more difficult and requires a more refined analysis.",
        "(Galley et al., 2003; Georgescul et al., 2007) dealt with the problem of topic segmentation of multiparty dialogues by combining various features based on cue phrases, syntactic and prosodic information.",
        "In this article, our investigation is based on using merely lexical features.",
        "We study mixture models in order to group the words co-occurring in texts into a small number of semantic concepts in an automatic unsupervised way.",
        "The intuition behind these models is that a text document has an underlying structure of \"latent\" topics, which is hidden.",
        "In order to reveal these latent topics, the basic assumption made is that words related to a semantic concept tend to occur in the proximity of each other.",
        "The notion of proximity between semantically related words can vary for various tasks.",
        "For instance, bigrams can be considered to capture correlation between words at a very short distance.",
        "At the other extreme, in the domain of document classification, it is often assumed that the whole document is concerned with one specific topic and in this sense all words in a document are considered to be semantically related.",
        "We consider for our application that words occurring in the same thematic episode are semantically related.",
        "In the following, the major issues we will discuss include the formulations of two probabilistic mixture approaches, their methodology, aspects of their implementation and the results obtained when applied in the topic segmentation context.",
        "Section 2 presents our approach on using probabilistic mixture models for topic segmentation and shows comparisons between these techniques.",
        "In Section 3 we discuss our empirical evaluation of these models for topic segmentation.",
        "Finally, some conclusions are drawn in Section 4."
      ]
    },
    {
      "heading": "2. Probabilistic Mixture Models",
      "text": [
        "The probabilistic latent models described in the following exploit hierarchical Bayesian frameworks.",
        "Based on prior distributions of word rate variability acquired from a training corpus, we will compute a density function to further analyze the text content in order to perform topic segmentation at a coarse level of granularity.",
        "In this model, we will be working with 'blocks' of text which consist of a fixed number of consecutive utterances.",
        "In the following two subsections, we use the following notation:",
        "• We consider a text corpus B = [b\\, b2,bM} containing M blocks of text with words from a vocabulary W = [w\\, w2,wN}.",
        "M is a constant scalar representing the number of blocks of text.",
        "N is a constant scalar representing the number of terms in vocabulary W.",
        "• We pre-process the data by eliminating content free words such as articles, prepositions and auxiliary verbs.",
        "Then, we proceed by lem-matizing the remaining words and by adopting a bag-of-words representation.",
        "Next, we summarize the data in a matrix F =",
        "(/(bi,wi,j))(i,j)eMxN, where f(bi,wi,j) denotes the log.entropy weighted frequency of word witj in block bi.",
        "• Each occurrence of a word in a block of text is considered as representing an observation (wm>n,bm), i.e. a realization from an underlying sequence of random variables (Wm;ra,Bm)||m|M.",
        "wm,n denotes the term indicator for the nth word in the m-th block of text.",
        "• Each pair (wm>n, bm) is associated with a discrete hidden random variable Zm n over some finite set Z ={zi,z2,zK}.",
        "K is a constant scalar representing the number of mixture components to generate.",
        "• We denote by P(zm,n = zk) or simply by P(zk) the probability that the k-th topic has been sampled for the nth word in the m-th block of text.",
        "In this section we describe how we apply latent modeling for dyadic data (Hofmann, 2001) to text representation for topic segmentation.",
        "We express the joint or conditional probability of words and blocks of text, by assuming that the choice of a word during the generation of a block of text is independent of the block itself, given some (unobserved) hidden variable, also called latent variable or aspect.",
        "The graphical representation of the AMDD data generation process is illustrated in Figure 1 by using the plate notation.",
        "That is, the ovals (i.e. the nodes of the graph) represent probabilistic variables.",
        "The double ovals around the variables wm,n and bm denote observed variables.",
        "zm,n is the mixture indicator, the hidden variable, that chooses the topic for the nth word in the m-th block of text.",
        "Arrows indicate conditional dependencies between variables.",
        "For instance, the wm,n variable in the word space and the bm variable in the block space have no direct dependencies, i.e. it is assumed that the choice of words in the generation of a block of text is independent of the block given a hidden variable.",
        "The boxes represent \"plates\", i.e. replicates of sampling steps with the variable in the lower left corner referring to the number of samples.",
        "For instance, the \"word plate\" in Figure 1 illustrates N independently and identically distributed repeated trials of the random variable wm,n.",
        "c",
        "~~^-\\Word plate",
        "Wm n J",
        "According to the topology of the asymmetric AMDD Bayesian network from Figure 1, we can specify the joint distribution of a word wm,n, a latent topic zk and a block of text bm: P(wmn, zk, bm) = P (bm) • P (zfc |bm) • P (wm.njzfc).",
        "The joint distribution of a block of text bm and a word wm,n is thus:",
        "mixing proportions mixture components",
        "Equation 1 describes a special case of a finite mixture model, i.e. it uses a convex combination of a set of component distributions to model the observed data.",
        "That is, each word in a block of text is seen as a sample from a mixture model, where mixture components are multinomials P(«vn|zk) and the mixing proportions are P(zk |bm).",
        "The Expectation-Maximization (EM) algorithm is the most popular method to estimate the parameters for mixture models to fit a training corpus.",
        "The EM algorithm for AMDD is based on iteratively maximizing the log-likelihood function: Cplsa =",
        "Y^M=1Y!N=1f (bm,Wm,n) • logP(Wm,n,bm).",
        "However, the EM algorithm for AMDD is prone to over-fitting since the number of parameters to be esti-",
        "mated grows linearly with the number of blocks of text.",
        "In order to avoid this problem, we employed the tempered version of the EM algorithm that has been proposed by Hofmann (2001).",
        "We use the density estimation method in AMDD to reduce the dimension of the blocks-by-words space.",
        "Thus, instead of using the words as basic units for each block of text representation, we employ a \"topic\" basis, assuming that a few topics will capture more information than the entire huge amount of words in the vocabulary.",
        "Thus, the m-th block of text is represented by the vector (P(zi|bm),P(z2|bm), ...,P(zfcjbm)).",
        "Then, we use these posterior probabilities as a threshold to identify the boundaries of thematic episodes via support vector classification (Georgescul et al., 2006).",
        "That is, we consider the topic segmentation task as a binary-classification problem, where each utterance should be classified as marking the presence or the absence of a topic shift in the dialogue.",
        "Latent Dirichlet Allocation (Blei et al., 2003) can be seen as an extension of AMDD by defining a probabilistic mixture model that includes Dirichlet-distributed priors over the masses of the multinomials P(w|z) and P(z|b).",
        "In order to describe the formal setting of LDA in our context, we use the following notation in addition to those given at the beginning of Section 2:",
        "• m is a parameter notation for P(z|b = bm), the topic mixture proportion for the m-th block of text;",
        "• a is a hyperparameter (a vector of dimension K) on the mixing proportions -m;",
        "M x K), composed by placing the vectors Q1)Q2, ...,QM as column components;",
        "• tfk is a parameter notation for P(w|zk), the mixture component for topic k;",
        "• /?",
        "is a hyperparameter (a vector of dimension N) on the mixture components k ;",
        "• $ = {0k }fc=1 is a matrix of dimension K x N composed by placing the vectors 01; 02,0K as column components;",
        "• Nm denotes the length of the m-th block of text and is modeled with a Poisson distribution with constant parameter £;",
        "LDA generates a stream of observable words «Vn partitioned into blocks of text bm as shown by the graphical model in Figure 2.",
        "The Bayesian network can be interpreted as follows: the variables $, 0 and z are the three sets of latent variables that we would like to infer.",
        "The plate surrounding 0k illustrates the repeated sampling of word distributions for each topic zk until K topics have been generated.",
        "The plate surrounding m illustrates the sampling of a distribution over topics for each block b for a total of M blocks of text.",
        "The inner plate over zm,n and w„^n illustrates the repeated sampling of topics and words until Nm words have been generated for a block bm.",
        "Each block of text is first generated by drawing a topic proportion -m, i.e. by picking a distribution over topics from a Dirichlet distribution.",
        "For each word w„^n from a block of text bm, a topic indicator k is sampled for z„^n according to the block-specific mixture proportion -m. That is, m determines",
        "P(zmn).",
        "The topic probabilities 0k are also sampled from a Dirichlet distribution.",
        "The words in each block of text are then generated by using the corresponding topic-specific term distribution 0Zm>n.",
        "Given the graphical representation of LDA illustrated in Figure 2, we can write the joint distribution of a word w„^n and a topic zk as:",
        "P (wm,ni zfc\\9m, $) = P(zfc\\9m) • P(Wm,n|0fc).",
        "Summing over k, we obtain the marginal distribution:",
        "Hence, similarly to AMDD (see Equation 1), the LDA model assumes that a word w„^n is generated from a random mixture over topics.",
        "Topic probabilities are conditioned on the block of text a word belongs to.",
        "Moreover LDA leaves flexibility to assign a different topic to every observed word and a different proportion of topics for every block of text.",
        "The joint distribution of a block of text bmand the latent variables of the model z*m, -m, $, given the hyperparameters a, /?",
        "is further",
        "topic plate word plate",
        "P(-m|a) • fj P(zm,n|-m) • P(w m,n|0zm>n ).",
        "blocfc plate",
        "Therefore, the likelihood of a block bm is derived as the marginal distribution obtained by summing over the z„^n and integrating out the distributions 9m and $.",
        "Since the integral involved in computing the likelihood of a block bm is computationally intractable, several methods for approximating this posterior have been proposed, including variational expectation maximization (Blei et al., 2003) and Markov chain Monte Carlo methods (Griffiths and Steyvers, 2004).",
        "We follow an approach based on Gibbs sampling as proposed in (Griffiths and Steyvers, 2004).",
        "As the convergence criteria for the Markov chain, we",
        "\\mixture proportion mixture component J",
        "check how well the parameters cluster semantically related blocks of text in a training corpus and then we use these values as estimates for comparable settings.",
        "The LDA model provides a soft clustering of the blocks of text, by associating them to topics.",
        "We exploit this clustering information, by using the distribution of topics over blocks of text to further measure the inter-blocks similarity.",
        "As in Section 2.1.2, the last step of our system consists in employing binary support vector classification to identify the boundaries of thematic episodes in the text.",
        "That is, we consider as input features for support vector learning the component values of the vector",
        "(0m,zi, m,Z2 ) m,Zk )."
      ]
    },
    {
      "heading": "3. Experiments",
      "text": [
        "In order to evaluate the performance of AMDD and LDA for our task of topic segmentation, in our experiments we used the transcripts of ICSI-MR corpus (Janin et al., 2004), which consists of 75 meeting recordings.",
        "A subset of 25 meetings, which are transcribed by humans and annotated with thematic boundaries (Galley et al., 2003), has been kept for testing purposes and support vector machine training.",
        "The transcripts of the remaining 50 meetings have been used for the unsupervised inference of our latent models.",
        "The fitting phase of the mixture models rely on the same data set that have been preprocessed by tokenization, elimination of stop-words and lemmatization.",
        "Once the models' parameters are learned, the input data representation is projected into the lower dimension latent semantic space.",
        "The evaluation phase consists in checking the performance of each model for predicting thematic boundaries.",
        "That is, we check the performance of the models for predicting thematic boundaries on the same test set.",
        "The size of a block of text during the testing phase has been set to one, i.e. each utterance has been considered as a block of text.",
        "Figure 3 compares the performance obtained for various k values, i.e. various dimensions of the latent semantic space, or equivalently different numbers of latent topics.",
        "We have chosen k={50, ...400} using incremental steps of50.",
        "The performance of each latent model is measured by the accuracy Acc = 1 – Pk, where Pkdenotes the error measure proposed by (Beeferman et al., 1999).",
        "Note that the Pk error allows for a slight variation in where the hypothesized thematic boundaries are placed.",
        "That is, wrong hypothesized thematic boundaries occurring in the proximity of a reference boundary (i.e. in a fixed-size interval of text) are tolerated.",
        "As proposed by (Beeferman et al., 1999), we set up the size of this interval to half of the average number of words per segment in the gold standard segmentation.",
        "As we observe from Figure 3, LDA and AMDD achieved rather comparable thematic segmentation accuracy.",
        "While LDA steadily outperformed AMDD, the results do not show a notable advantage of LDA over AMDD.",
        "In contrast, AMDD has better performances for less dimensionality reduction.",
        "That is, the LDA performance curve goes down when the number of latent topics exceeds over 300.",
        "In Table 1, we provide the best results obtained on ICSI data via LDA modeling.",
        "We also reproduce the results reported on in the literature by (Galley et al., 2003) and (Georgescul et al., 2006), when the evaluation of their systems was also done on ICSI data.",
        "The LCSeg system proposed by (Galley et al., 2003) is based on exploiting merely lexical features.",
        "Improved performance results have been obtained by (Galley et al., 2003) when extra non-lexical features have been adopted in a decision tree classifier.",
        "The system proposed by (Georges-cul et al., 2006) is based on support vector machines (SVMs) and is labeled in the table as SVMs.",
        "We observe from the table that our approach based on combining LDA modeling with SVM classification outperforms LCSeg and performs comparably to the system of Georgescul et al.",
        "(2006).",
        "Thus, our experiments show that the LDA word density estimation approach does capture important information from the data through 90% less features than a bag-of-words representation.",
        "LDA",
        "LCSeg",
        "SVMs",
        "Pk error rate",
        "21%",
        "32%",
        "22%"
      ]
    },
    {
      "heading": "4. Conclusions",
      "text": [
        "With the goal of performing linear topic segmentation by exploiting word distributions in the input text, the focus of this article was on both comparing theoretical aspects and experimental results of two probabilistic mixture models.",
        "The algorithms are applied to a meeting transcription data set and are found to provide an appropriate method for reducing the size of the data representation, by performing comparably to previous state-of-the-art methods for topic segmentation."
      ]
    }
  ]
}
