{
  "info": {
    "authors": [
      "Fangtao Li",
      "Xian Zhang",
      "Xiaoyan Zhu"
    ],
    "book": "Coling 2008: Proceedings of the workshop on Human Judgements in Computational Linguistics",
    "id": "acl-W08-1806",
    "title": "Answer Validation by Information Distance Calculation",
    "url": "https://aclweb.org/anthology/W08-1806",
    "year": 2008
  },
  "references": [
    "acl-N01-1005",
    "acl-N04-1007",
    "acl-P06-1112",
    "acl-W02-1033"
  ],
  "sections": [
    {
      "text": [
        "Fangtao Li, Xian Zhang, Xiaoyan Zhu",
        "State Key Laboratory on Intelligent Technology and Systems Tsinghua National Laboratory for Information Science and Technology Department of Computer Science and Technology, Tsinghua University, Beijing 100084, China",
        "zxy-dcs@mail.tsinghua.edu.cn",
        "In this paper,an information distance based approach is proposed to perform answer validation for question answering system.",
        "To validate an answer candidate, the approach calculates the conditional information distance between the question focus and the candidate under certain condition pattern set.",
        "Heuristic methods are designed to extract question focus and generate proper condition patterns from question.",
        "General search engines are employed to estimate the Kolmogorov complexity, hence the information distance.",
        "Experimental results show that our approach is stable and flexible, and outperforms traditional tfidf methods."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Question answering(QA) system aims at finding exact answers to a natural language question.",
        "In order to correctly answer a question, several components are implemented including question classification, passage retrieval, answer candidates generation, answer validation etc.",
        "Answer Validation is to decide whether the candidate answers are correct or not, or even to determine the accurate confidence score to them.",
        "Most of QA systems employ answer validation as the last step to identify the correct answer.",
        "If this component fails, it is impossible to enable the question to be correctly answered.",
        "Automatic techniques for answer validation are of great interest among question answering re-",
        "© 2008.",
        "Some rights reserved.",
        "search.",
        "With automatic answer validation, the system will carry out different refinements of its searching criteria to check the relevance of new candidate answers.",
        "In addition, since most of QA systems rely on complex architectures and the evaluation of their performances requires a huge amount of work, the automatic assessment of candidates with respect to a given question will speed up both algorithm refinement and testing.",
        "Currently, answer validation is mainly viewed as a classification problem or ranking problem.",
        "Different models, such as Support Vector Machine (Shen and Klakow, 2006) and Maximum Entropy Model (Ittycheriah et al., 2001), are used to integrate sophisticated linguistic features to determine the correctness of candidates.",
        "The answer validation exercise (Penas et al.",
        ", 2007) aims at developing systems able to decide whether the answer is correct or not.",
        "They formulate answer validation as a text entailment problem.",
        "These approaches are dependent on sophisticated linguistic analysis of syntactic and semantic relations between question and candidates.",
        "It is quite expensive to use deep analysis for automatic answer validation, especially in large scale data set.",
        "Thus it is appropriate to find an alternative solution to this problem.",
        "Here, we just consider the English answer validation task.",
        "This paper proposes a novel approach based on information retrieval on the Web.",
        "The answer validation problem is reformulated as distance calculation from an answer candidate to a question.",
        "The hypothesis is that, among all candidates, the correct answer has the smallest distance from question.",
        "We employ conditional normalized min distance, which is based on Kolmogorov Complexity theory (Li and Vitanyi, 1997), for this task.",
        "The distance measures the relevance between question focus and candidates conditioned on a surface pattern set.",
        "For distance calculation, we first extract the question focus, and then a hierarchical pattern set is automatically constructed as condition.",
        "Since Kolmogrov Complexity can be approximated through frequency counts.",
        "Two types of search engine \"Google\" and \"Altavista\" are used to approximate the distance.",
        "The paper is organized as follows: Section 2 describes related work.",
        "The fundamental Kol-mogorov Complexity theory is introduced in Section 3.",
        "Section 4 presents our proposed answer validation method based on information retrieval.",
        "In Section 5, we describe the experiments and discussions.",
        "The paper is concluded in Section 6."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "Answer Validation is an emerging topic in Question Answering, where open domain systems are often required to rank huge amounts of answer candidates.",
        "This task can be viewed as a classification problem or re-ranking problem.",
        "Early question answering systems focused on employing surface text patterns (Subbotin and Subbotin, 2001) for answer validation.",
        "Xu et al.",
        "(2003) identified that pattern-based approaches got bad performances due to poor system recall.",
        "Some researchers exploited machine learning techniques with rich syntactic or semantic features to measure the similarity between question and answer.",
        "Ittycheriah et al.",
        "(2001) used Maximum Entropy model to combine rich features and automatically learn feature weights.",
        "These features included query expansion features, focus features, named entity features, dependency relation features, pattern features et al.",
        "Shen and Klakow (2006) presented three methods, including feature vector, string kernel and tree kernel, to represent surface text features and parse tree features in Support Vector Machines.",
        "Ko et al.",
        "(2007) proposed a probabilistic graphical model to estimate the probability of correctness for all candidate answers.",
        "Four types of features were employed, including knowledge-based features, data-driven features, string distance feature and synonym features.",
        "Started in 2006, the annual Answer Validation Exercise (Penas et al.",
        ", 2007) aims to develop systems to decide if the answer to a question is correct or not.",
        "The English answer validation task is reformulated as a Text Entailment problem.",
        "The triplet, including question, answer and supporting text, is given.",
        "The system determines if the supporting text can entail the hypothesis, which is a reformulation from the question and answer.",
        "All participants used lexical processing, including lemmati-zation and part-of speech tagging.",
        "Some systems used first order logic representations, performed semantic analysis and took the validation decision with a theorem proof.",
        "The above approaches should process deep syntactic and semantic analysis for either questions or candidate answers.",
        "The annotated linguistic resource is hard to acquire for the supervised classification problem.",
        "Another alternative solution for answer validation is to exploit the redundancy of large scale data.",
        "Eric et al.",
        "(2007) developed AskMSR question answering system.",
        "They focus on the Web as a gigantic data repository with tremendous redundancy that can be exploited to extract the correct answer.",
        "Lin (2007) implemented another Web-based question answering system, named ARANEA, which is used approximate tfidf method for answer validation."
      ]
    },
    {
      "heading": "3. Preliminaries",
      "text": [
        "Kolmogorov complexity , or algorithm entropy , K(x) of a string x is the length of the shortest binary program to compute x.",
        "It defines randomness of an individual string.",
        "Kolmogorov complexity has been widely accepted as an information theory for individual objects parallel to that of Shannon's information theory which is defined on an ensemble of objects.",
        "It has also found many applications in computer science such as average case analysis of algorithms (Li and Vitanyi, 1997).",
        "For a universal Turing machine U, the Kolmogorov complexity of a binary string x condition to another binary string y, Kjj{x\\y), is the length of the shortest (prefix-free) program for U that outputs x with input y.",
        "It has been proved that for different universal Turing machine U', for a\\\\x,y where the constant C depends only on U'.",
        "Thus we simply write Kjj{x\\y) as K(x\\y).",
        "Define K{x) = K(x\\e), where e is the empty string.",
        "For formal definitions and a comprehensive study of Kolmogorov complexity, see (Li and Vitanyi, 1997).",
        "Based on the Kolmogovov complexity theory, information distance (Bennett et al., 1998) is a universal distance metric, which has been successfully applied to many applications.",
        "The information distance D(x,y) is defined as the length of a shortest binary program which can compute x given y as well as compute y from x.",
        "It has been proved that , up to an additive logarithmic term, D(x,y) = m&x{K(x\\y), K(y\\x)}.",
        "The normalized version of D(x, y), called the normalized information distance(NID), is defined as",
        "Parallel to this, the min distance is proposed in (Zhang et al.",
        ", 2007), defined as",
        "And the normalized version is",
        "Conditional information distance is defined as",
        "The information distance is proved to be universal (Zhang et al.",
        ", 2007), that is, if x and y are \"close\" under any distance measure, they are \"close\" under the measure of information distance.",
        "However, it is not clear yet how to find out such \"closeness\" in traditional information distance theory.",
        "Now the conditional information distance provides a possible solution.Figure 1 gives a more interprétable explanation: the condition c could map the original concepts x and y into different xc and yc, thus the variant \"closeness\" could be reflected by the distance between xc and yc, as shown in Figure 1.",
        "Figure 1: Conditional information distances under different conditions c's",
        "The Kolmogorov complexity is non-computable, that is, to use the information distance measures, we must estimate the K(x) first.",
        "There are traditionally two ways to do this: (1) by compression (Li et al.",
        ", 2001), and (2) by frequency counting based on coding theorem (Cilibrasi and Vitanyi, 2007).",
        "The second approach is implemented in this paper."
      ]
    },
    {
      "heading": "4. Answer Validation with Information Distance",
      "text": [
        "Given a question q and a candidate answer c, the answer validation task can be considered as determining the degree of relevance of c with respect to q.",
        "The intuition of our approach is that the distance between question and the correct answer is smaller than other candidates.",
        "Take the question \"What is the capital of the USA?\"",
        "as an example, among all candidates, the correct answer \"Washington\" is closest to the question under some distance measure.",
        "Thus the answer validation problem is to determine a proper distance measure.",
        "Fortunately, it has been proved that the information distance (Bennett et al., 1998) is universal so that the similarity between the question and the answer can surely be discovered using this measure.",
        "Direct calculation of the unconditional distance is difficult and non-flexible.",
        "We find it possible and convenient to estimate the conditional information distance between question focus and the answers, under certain context as the condition.",
        "As explained previously, different conditions lead to different distance.",
        "With the most proper condition and the nearest distance, the best answer can be identified out of previously determined candidates.",
        "The conditional normalized min distance is employed for distance calculation, which is defined where c is given in both x to y and y to x computation.",
        "Question:",
        "What city is Lake Washington by?",
        "Candidates:",
        "Seattle.",
        "Belle vue.",
        "Khkland...",
        "Question focus:.",
        "Lake Washington",
        "Conditional information distance:",
        "Condition:",
        "where x represents the answer candidates, y is the question focus, and c is condition pattern.",
        "The function c(x, y) will be described in the Distance Calculation section.",
        "Figure 2 shows the procedure of distance calculation.",
        "Given a question and a set of candidates, we calculate the min information distance between question focus and candidates conditioned on surface patterns.",
        "Obviously, in order to calculate information distance, there are three issues to be addressed:",
        "1.",
        "Question Focus Extraction: since the question answer distance is reformulated as the measure between question focus and answer conditioned on the surface pattern, it is important to extract some words or phrases as question focus.",
        "2.",
        "Condition Pattern Generation: Obviously, the generation of the condition is the key part.",
        "We have built a well revised algorithm, in which proper conditions can be generated from question sentence according to some heuristic rules.",
        "3.",
        "Distance Calculation: after question focus and condition patterns are obtained, the last step is calculating the conditional distance to estimate the relevance between question and answer candidates.",
        "Most factoid questions refer to specific objects.",
        "A question is asked to learn some knowledge for this object from certain perspective.",
        "In our approach, we take the key named entity or noun phrase, usually as the subject or the main object of the question sentence as the reference object.",
        "Take the question \"What city is Lake Washington by\" as example, the specific object is \"Lake Washington\".",
        "The question focus is identified using some heuristic rules as follows:",
        "1.",
        "The question is processed by shallow parsing.",
        "All the noun phrases(NP) are extracted as NP set.",
        "2.",
        "All the named entities(NE) in the question are extracted as NE set.",
        "3.",
        "If only one same element is identified in both NE and NP set, this element is considered as question focus.",
        "4.",
        "If step 3 fails, but two elements from NE and NP set have overlap words, then choose the element with more words as question focus.",
        "5.",
        "If step 3 and 4 fail, choose the candidate, which is nearest with verb phrase in dependency tree, as question focus.",
        "A set of hierarchical patterns is automatically constructed for conditional min distance calculation.",
        "Several operations are defined for patterns construction from the original question sentence.",
        "We describe pattern set construction with a sample question \"What year was President Kennedy killed?",
        "\":",
        "1.",
        "With linguistic analysis, the question is split into pieces of tokens.",
        "These tokens inelude wh-word phrases, preposition phrases, noun phrases, verb phrases, key verb, etc.",
        "The example question is split into \"What year\"(wh-word phrase), \"was\"(key verb) \"President Kennedy\" (noun phrases), \"killed\"(verb phrase).",
        "2.",
        "Replace the wh-word phrases with the candidate placeholder (c).",
        "Then the words \"What year\" is replaced with placeholder (c).",
        "3.",
        "Replace the question focus with the focus placeholder (/), and add this pattern to the pattern set.",
        "The example question focus is identified as \"President Kennedy\".",
        "It is replaced with placeholder (/).",
        "The first pattern \"(c) was (/) killed?\"",
        "is generated.",
        "4.",
        "Voice Transformation: with morphology techniques, verbs are expanded with all their tense forms (i.e. present, past tense and past participle).",
        "The tokens' order is adjusted to transform between active voice and passive voice.",
        "Both patterns are added to the patterns set.",
        "For sample question, the passive pattern is translated into active pattern, \"(c) kill (/)\".",
        "5.",
        "Preposition addition: for time and location questions, the preposition (i.e. in, on and at) is added before the candidate (c); Then the pattern \"(c) was (/) killed\" is reformulated as \"(in |on) (c) was (/) killed\".",
        "6.",
        "Tokens shift: preposition phrase token could be shifted to the begin or the end of pattern, and \"key verb\" must be shift before the \"verb phrase\".",
        "Then the pattern \"(in |on) (c) was (/) killed\" can be reformulated as \"(/) was killed (in |on) (c)\".",
        "7.",
        "Definitional patterns: several heuristic patterns, as introduced at (Hildebrandt et al.",
        ", 2004), are added into our final pattern sets, such as \"(c),",
        "By such heuristic rules, the original pattern set is obtained from question sentence.",
        "The patterns are initially enclosed in quotation marks, which means exact matching.",
        "However, by eliminating these quotations, or reducing the scope that they cover, the matching is relaxed as words co-occurrence.",
        "The patterns are expanded into different strict-level patterns by adding or removing quotation marks for each tokens or adjacent tokens combination.",
        "Several condition pattern samples are shown in Table 1",
        "Each operation introduced above is given a predefined confidence coefficientcc).",
        "Then the confidence coefficient of a pattern is defined as the multiplication of cc for all performed operations to generate this pattern.",
        "From the previous step, a set of condition patterns and corresponding confidence coefficient are obtained.",
        "Let pi denotes the ith pattern in the pattern set, and cci is the confidence coefficient for the ith pattern.",
        "The confidence coefficient estimation in previous section contains much noise.",
        "And the patterns with similar confidence coefficient make little difference.",
        "Therefore, the exact confidence coefficient value is not directly used.",
        "We cluster the patterns into different priority groups.",
        "Cj denotes the pattern cluster with jth priority.",
        "Here, the smaller j means higher priority.",
        "The condition patterns are ranked mainly based on confidence coefficient and the number of double quotation marks.",
        "The following algorithm shows each step in detail:",
        "Table 2: patterns ranking algorithm Input patterns set C = {(pi, cci)} Algorithm",
        "(2) if C is empty, end this algorithm",
        "(3) Select (pmax,ccmax), where ccmax > ca, [pi, ca) e C",
        "(4) if Cj is empty, add ccrnax into Cj, jump to (2)",
        "(5) select the minimum confidence coefficient (.Pmin, cemi„) from Cj, compare it with (pmax, ccmax)■ if the number of double quotes(\"\") in pmin is equal to the number in Pmax, add pmax into Cj.",
        "otherwise, j =",
        "Conditional min distance dmin is used to measure the relevance between question and candidate.",
        "From section 3, dmin is not computable, but approximated by frequency counts based on the coding theory:",
        "The function c(x, 0) means substituting (c) in c by answer candidate x and removing placeholder (/) if any.",
        "Similar definition applies to c(y,0), c(x, y).",
        "For example, given pattern \"(/) was invented in (c)\", question focus \"the telegraph\" and a candidate \"1867\".",
        "c{x,$) is \"was invented in 1867\".",
        "c(y, 0) is \"the telegraph was invented\", and c(x,y) is \"the telegraph was invented in 1867\".",
        "The frequency counts f(x) are estimated as the number of returned pages by certain search engine with respect to x .",
        "f(c(<fi, <fi)) denote the total pages indexed in search engine.",
        "Two types of search engines \"Google\" and \"Altavista\" are employed.",
        "The patterns are selected in priority order to calculate the information distance for each candidate."
      ]
    },
    {
      "heading": "5. Experiment and Discussion 5.1 Experiment Setup",
      "text": [
        "Data set: The standard QA test collection (Lin and Katz, 2006) is employed in our experiments.",
        "It consists of 109 factoid questions, covering several domains including history, geography, physics, biology, economics, fashion knowledge, and etc.. 20 candidates are prepared for each questions.",
        "All answer candidates are first extracted by the implemented question answering system.",
        "Then we review the candidate set for each question.",
        "If the correct answer is not in this set, it is manually added into the set.",
        "Performance Metric: The top 1 answer precision and mean reciprocal rank (MRR) are used for performance evaluation.The top 1 answer means the correct answer ranks first with our distance calculation method, and MRR = ± * £t(^r), in which the m1fc.",
        "is 1 if the correct answer occurs in the first position; 0.5 if it firstly occurs in the second position; 0.33 for the third, 0.25 for the fourth, 0.2 for the fifth and 0 if none of the first five answers is correct.",
        "The open source factoid QA system ARANEA (downloaded from limmy Lin's website in 2005) is used for comparison, which implements an approximate tfidf algorithm for candidate scoring.",
        "Both ARANEA and our proposed approaches use the internet directly.",
        "Google is used as the search engine for ARENEA, and our conditional normalized min distance is calculated with Google and Altavista respectively.",
        "The performances of our proposed approach and ARANEA are shown in Table 3.",
        "For top 1 answer precision, our conditional min distance calculation method through Google achieves 69.7%, and Altavista is 66.1%, which make 56.6% (69.7% v.s.42.2% ) and 50.0% (66.1% v.s 42.2%) improvement compared with ARENEA's tfidf method.",
        "Our proposed methods achieve 0.756 and 0.772 compared with ARENEA's 0.581 for MRR measure.",
        "Table 3: Performance comparison, where dmin (G) denotes the distance calculation through \"Google\", dmin {A) through \"Altavista\"",
        "Table 4 shows some correct answer validation examples, the Google Condition(GC) and the Altavista Condition(AC) columns are the employed condition patterns for distance calculation.",
        "For question 1400, the conditional normalized google min distance calculates the distance between question focus \"the telegragh\" and all 20 answer candidates.",
        "The minimum distance score is achieved between \"the telegraph\" and \"1837\" with the condition pattern \"(/) was invented in (c)\".",
        "Therefore, the candidate \"1837\" is validated as the correct answer.",
        "Meanwhile, the minimum value for conditional normalized altavista min distance is achieved on the same condition.",
        "These results demonstrate that the distance calculation method provides a feasible solution for answer validation.",
        "In discussion section, we will study three questions:"
      ]
    },
    {
      "heading": "1.. What is the role of search engine?",
      "text": []
    },
    {
      "heading": "2.. What is the role of condition pattern?",
      "text": []
    },
    {
      "heading": "3.. What is the role of question focus?",
      "text": [
        "tfidf",
        "dmin{G)",
        "# of Top 1",
        "46",
        "72",
        "69",
        "% of Top 1",
        "42.2",
        "69.7",
        "66.1",
        "MRR",
        "0.581",
        "0.772",
        "0.756",
        "Table 4: Question Examples in conditional information calculation through Google and Altavista.",
        "GC: Google Condition; AC: Altavista Condition_",
        "The rise of world-wide-web has enticed millions of users to create billions of web pages.",
        "The redundancy of web information is an important resource for question answering.",
        "Our Kolmogorov Complexity based information distance is approximated with query frequency obtained by search engine.",
        "Two types of search engines \"Google\" and \"Altavista\" are employed in this paper.",
        "The number of top 1 correct answer is 72 through \"Google\" and 69 through \"Altavista\".",
        "There is little difference between two numbers, which shows that the information distance based on Kolmogorov Complexity is independent of special search engine.",
        "The performance didn't vary much with the change of search engine.",
        "Actually, if the local data is accumulated large enough, the information distance can be approximated without the internet.",
        "The quality and size of data set affect the experiment performance.",
        "Pattern set offers convenient and flexible condition for information distance calculation.",
        "In the experiment, there are 61 questions correctly answered by both Google and Altavista.",
        "46 questions of them employ different patterns.",
        "Considering Question 1412, the condition pattern in Google is \"(c) is (/)\", while in Altavista, it is \"(/), (c)\".",
        "However, the correct answer \"Gov.",
        "Bill Ritter\" is identified by both methods.",
        "The information distance is stable over specific condition patterns.",
        "Question focus is considered as the discriminator for the question.",
        "The distance between a question and a candidate is reformulated as the distance between question focus and candidate conditioned on a set of surface patterns.",
        "The proposed approach may not properly extract the question focus, but the answers can be correctly identified when the condition pattern becomes loose enough.",
        "Take the question 1484 \"What college did Allen Iverson attend?\"",
        "as example, the verb \"attend\" is tagged as \"noun\", then question focus is mistakenly extracted as \"Allen Iverson attend\", instead of the correct \"Allen Iverson\".",
        "The two conditional information distance method still identify the correct answer \"Georgetown University\".",
        "Because they both employed the looser condition patterns '\"(c)\" \"(/)\"' and '\"(c)\" did \"(/)\"'.Therefore, our proposed distance answer validation methods are robust to the question focus selection component.",
        "From the discussion above, it can be seen that our algorithm is stable and robust, not depending on the specific search engine, condition pattern, and question focus."
      ]
    },
    {
      "heading": "6. Conclusions",
      "text": [
        "We have presented a novel approach for answer validation based on information distance.",
        "The answer validation task is reformulated as distance calculation between question focus and candidate conditioned on a set of surface patterns.",
        "The experiments show that our proposed answer validation method makes a great improvement compared with ARANEA's tfidf method.",
        "Furthermore, The experiments show that our approach is stable and robust, not depending on the specific search engine, condition pattern, and question focus.",
        "In future work, we will try to calculate information distance in the local constructed data set, and expand this distance measure into other application fields.",
        "ID",
        "Question",
        "GC",
        "AC",
        "Answer",
        "Question focus",
        "1400",
        "When was the telegraph invented?",
        "\"?y was invented in ?s\"",
        "\"?y was invented in ?x\"",
        "1837",
        "the telegraph",
        "1401",
        "What is the democratic party symbol?",
        "\"?y is ?x\"",
        "\"?y is ?x\"",
        "the donkey",
        "the democratic party symbol",
        "1411",
        "What Spanish explorer discovered the Mississippi River?",
        "\"?x discovered ?y\"",
        "\"?x\" \"discovered\" \"?y\"",
        "Hernando de Soto",
        "the Mississippi River",
        "1412",
        "Who is the governor of Colorado?",
        "\"?y is ?x\"",
        "\"?y, ?x\"",
        "Gov.",
        "Bill Ritter",
        "the governor of Colorado",
        "1484",
        "What college did Allen Iverson attend?",
        "\"?y attended ?x\"",
        "\"?x\" \"did ?y\"",
        "Georgetow University",
        "ii Allen Iverson attend",
        "Acknowledgement",
        "This work is supported by National Natural Science Foundation of China (60572084, 60621062), Hi-tech Research and Development Program of China (2006AA02Z321), National Basic Research Program of China (2007CB311003)."
      ]
    }
  ]
}
