{
  "info": {
    "authors": [
      "Afra Alishahi",
      "Grzegorz Chrupala"
    ],
    "book": "EMNLP",
    "id": "acl-D12-1059",
    "title": "Concurrent Acquisition of Word Meaning and Lexical Categories",
    "url": "https://aclweb.org/anthology/D12-1059",
    "year": 2012
  },
  "references": [
    "acl-E12-1024",
    "acl-J92-4003",
    "acl-P97-1054",
    "acl-W00-0717",
    "acl-W08-2112",
    "acl-W10-2922"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Learning the meaning of words from ambiguous and noisy context is a challenging task for language learners.",
        "It has been suggested that children draw on syntactic cues such as lexical categories of words to constrain potential referents of words in a complex scene.",
        "Although the acquisition of lexical categories should be interleaved with learning word meanings, it has not previously been modeled in that fashion.",
        "In this paper, we investigate the interplay of word learning and category induction by integrating an LDA-based word class learning module with a probabilistic word learning model.",
        "Our results show that the incrementally induced word classes significantly improve word learning, and their contribution is comparable to that of manually assigned part of speech categories.",
        "1 Learning the Meaning of Words For young learners of a natural language, mapping each word to its correct meaning is a challenging task.",
        "Words are often used as part of an utterance rather than in isolation.",
        "The meaning of an utterance must be inferred from among numerous possible interpretations that the (usually complex) surrounding scene offers.",
        "In addition, the linguistic and visual context in which words are heard and used is often noisy and highly ambiguous.",
        "Particularly, many words in a language are polysemous and have different meanings.",
        "Various learning mechanisms have been proposed for word learning.",
        "One well-studied mechanism is cross-situational learning, a bottom-up strategy based on statistical co-occurrence of words and referents across situations (Quine 1960, Pinker 1989).",
        "Several experimental studies have shown that adults and children are sensitive to cross-situational evidence and use this information for mapping words to objects, actions and properties (Smith and Yu 2007, Monaghan and Mattock 2009).",
        "A number of computational models have been developed based on this principle, demonstrating that cross-situational learning is a powerful and efficient mechanism for learning the correct mappings between words and meanings from noisy input (e.g. Siskind 1996, Yu 2005, Fazly et al010).",
        "Another potential source of information that can help the learner to constrain the relevant aspects of a scene is the sentential context of a word.",
        "It has been suggested that children draw on syntactic cues provided by the linguistic context in order to guide word learning, a hypothesis known as syntactic bootstrapping (Gleitman 1990).",
        "There is substantial evidence that children are sensitive to the structural regularities of language from a very young age, and that they use these structural cues to find the referent of a novel word (e.g. Naigles and Hoff-Ginsberg 1995, Gertner et al006).",
        "In particular, young children have robust knowledge of some of the abstract lexical categories such as nouns and verbs (e.g. Gelman and Taylor 1984, Kemp et al005).",
        "Recent studies have examined the interplay of cross-situational learning and sentence-level learning mechanisms, showing that adult learners of an artificial language can successfully and simultaneously apply cues and constraints from both sources of information when mapping words to their referents (Gillette et al999, Lidz et al010, Koehne and Crocker 2010; 2011).",
        "Several computational models have also investigated this interaction by adding manually annotated part-of-speech tags as",
        "input to word learning algorithms, and suggesting that integration of lexical categories can boost the performance of a cross-situational model (Yu 2006, Alishahi and Fazly 2010).",
        "However, none of the existing experimental or computational studies have examined the acquisition of word meanings and lexical categories in parallel.",
        "They all make the simplifying assumption that prior to the onset of word learning, the categorization module has already formed a relatively robust set of lexical categories.",
        "This assumption can be justified in the case of adult learners of a second or artificial language.",
        "But children's acquisition of categories is most probably interleaved with the acquisition of word meaning, and these two processes must ultimately be studied simultaneously.",
        "In this paper, we investigate concurrent acquisition of word meanings and lexical categories.",
        "We use an online version of the LDA algorithm to induce a set of word classes from child-directed speech, and integrate them into an existing probabilistic model of word learning which combines cross-situational evidence with cues from lexical categories.",
        "Through a number of simulations of a word learning scenario, we show that our automatically and incrementally induced categories significantly improve the performance of the word learning model, and are closely comparable to a set of gold-standard, manually-annotated part of speech tags."
      ]
    },
    {
      "heading": "2 A Word Learning Model",
      "text": [
        "We want to investigate whether lexical categories (i.e. word classes) that are incrementally induced from child-directed speech can improve the performance of a cross-situational word learning model.",
        "For this purpose, we use the model of Alishahi and Fazly (2010).",
        "This model uses a probabilistic learning algorithm for combining evidence from word?",
        "referent co-occurrence statistics and the meanings associated with a set of predefined categories.",
        "They use child-directed utterances, manually annotated with a small set of part of speech tags, from the Manchester corpus (Theakston et al001) in the CHILDES database (MacWhinney 1995).",
        "Their experimental results show that integrating these gold-standard categories into the algorithm boosts its performance over a pure cross-situational version.",
        "The model of Alishahi and Fazly (2010) has the suitable architecture for our goal: it provides an integrated learning mechanism which combines evidence from word-referent co-occurrence with cues from the meaning representation associated with word categories.",
        "However, the model has two major shortcomings.",
        "First, it assumes that lexical categories are formed and finalized prior to the onset of word learning and that a correct and unique category for a target word can be identified at each point in time, assumptions that are highly unlikely.",
        "Second, it does not handle any ambiguity in the meaning of a word.",
        "Instead, each word is assumed to have only one correct meaning.",
        "Considering the high level of lexical ambiguity in most natural languages, this assumption unreasonably simplifies the word learning problem.",
        "To investigate the plausibility of integrating word and category learning, we use an online algorithm for automatically and incrementally inducing a set of lexical categories.",
        "Moreover, we use each word in its original form instead of lemmatizing them, which implies that categories contain different morphological forms of the same word.",
        "By applying these changes, we are able to study the contribution of lexical categories to word learning in a more realistic scenario.",
        "Representation of input.",
        "The input to the model consists of a sequence of utterances, each paired with a representation of an observed scene.",
        "We represent an utterance as a set of words, U = {w} (e.g. {she, went, home, ...}), and the corresponding scene as a set of semantic features, S = {f} (e.g. {ANIMATE, HUMAN, FEMALE, ...}).",
        "Word and category meaning.",
        "We represent the meaning of a word as a time-dependent probability distribution p(t)(?|w) over all the semantic features, where p(t)(f |w) is the probability of feature f being associated with word w at time t. In the absence of any prior knowledge, the model assumes a uniform distribution over all features as the meaning of a novel word.",
        "Also, a function cat(t)(w) gives us the category to which a word w in utterance U (t) belongs.",
        "At each point in time, a category c contains a set of word tokens.",
        "We assign a meaning to each cat",
        "egory as a weighted sum of the meaning learned so far for each of its members, or p(t)(f |c) =",
        "(t)(f |w), where |c |is the number of word tokens in c at the current moment.",
        "Learning algorithm.",
        "Given an utterance-scene pair (U (t), S(t)) received at time t, the model first calculates an alignment score a for each word w ?",
        "U (t) and each semantic feature f ?",
        "S(t).",
        "A semantic feature can be aligned to a word according to the meaning acquired for that word from previous observations (word-based alignment, or aw).",
        "Alternatively, distributional clues of the word can be used to determine its category, and the semantic features can be aligned to the word according to the meaning associated to its category (category-based alignment, or ac).",
        "We combine these two sources of evidence when estimating an alignment score:",
        "where the word-based and category-based alignment scores are estimated based on the acquired meanings of the word and its category, respectively:",
        "The relative contribution of the word-based versus the category-based alignment is determined by the weight function ?(w).",
        "Cross-situational evidence is a reliable cue for frequent words; on the other hand, the category-based score is most informative when the model encounters a low-frequency word (See Alishahi and Fazly (2010) for a full analysis of the frequency effect).",
        "Therefore, we define ?",
        "(w) as a function of the frequency of the word n(w):",
        "Once an alignment score is calculated for each word w ?",
        "U (t) and each feature f ?",
        "S(t), the model revises the meanings of all the words in U (t) and their corresponding categories as follows: assoc(t)(w, f) = assoc(t?1)(w, f) + a(w|f,U(t),S(t)) where assoc(t?1)(w, f) is zero if w and f have not co-occurred before.",
        "These association scores are then used to update the meaning of the words in the",
        "(2) where F is the set of all features seen so far.",
        "We use a smoothed version of this formula to accommodate noisy or rare input.",
        "This process is repeated for all the input pairs, one at a time.",
        "Uniform categories.",
        "Adding the category-based alignment as a new factor to Eqn.",
        "(1) might imply that the role of categories in this model is nothing more than smoothing the cross-situational-based alignment of words and referents.",
        "In order to investigate this issue, we use the following alignment formula as an informed baseline in our experiments, where we replace ac(?|f, U (t), S(t)) with a uniform",
        "where aw(w|f, U (t), S(t)) and ?",
        "(w) are estimated as before.",
        "In our experiments in Section 4, we refer to this baseline as the ?uniform?",
        "condition."
      ]
    },
    {
      "heading": "3 Online induction of word classes with LDA",
      "text": [
        "Empirical findings suggest that young children form their knowledge of abstract categories, such as verbs, nouns, and adjectives, gradually (e.g. Gel-man and Taylor 1984, Kemp et al005).",
        "In addition, several unsupervised computational models have been proposed for inducing categories of words which resemble part-of-speech categories, by 1We thank an anonymous reviewers for suggesting this condition as an informed baseline.",
        "drawing on distributional properties of their context (see for example Redington et al998, Clark 2000, Mintz 2003, Parisien et al008, Chrupa?a and Alishahi 2010).",
        "However, explicit accounts of how such categories can be integrated in a cross-situational model of word learning have been rare.",
        "Here we adopt an online version of the model proposed in Chrupa?a (2011), a method of soft word class learning using Latent Dirichlet Allocation.",
        "The approach is much more efficient than the commonly used alternative (Brown clustering, (Brown et al. 1992)) while at the same time matching or outperforming it when the word classes are used as automatically learned features for supervised learning of various language understanding tasks.",
        "Here we adopt this model as our approach to learning lexical categories.",
        "In Section 3.1 we describe the LDA model for word classes; in Section 3.2 we discuss the online Gibbs sampler we use for inference."
      ]
    },
    {
      "heading": "3.1 Word class learning with LDA",
      "text": [
        "Latent Dirichlet Allocation (LDA) was introduced by Blei et al2003) and is most commonly used for modeling the topic structure in document collections.",
        "It is a generative, probabilistic hierarchical Bayesian model that induces a set of latent variables, which correspond to the topics.",
        "The topics themselves are multinomial distributions over words.",
        "The generative structure of the LDA model is the following:",
        "Chrupa?a (2011) reinterprets the LDA model in terms of word classes as follows: K is the number of classes, D is the number of unique word types, Nd is the number of context features (such as right or left neighbor) associated with word type d, znd is the class of word type d in the nthd context, andwnd is the nthd context feature of word type d. Hyperparameters ?",
        "and ?",
        "control the sparseness of the vectors ?d and ?k.",
        "1.8M words (CHILDES) 100M words (BNC) train car can will give bring June March shoes clothes man woman book hole black white monkey rabbit business language Table 2: Most similar word pairs As an example consider the small corpus consisting of the single sentence How do you do.",
        "The rows in Table 1 show the features w1 .",
        ".",
        ".",
        "wNd for each word type d if we use each word's left and right neighbors as features, and subscript words with L and R to indicate left and right.",
        "After inference, the ?d parameters correspond to word class probability distributions given a word type while the ?k correspond to feature distributions given a word class: the model provides a probabilistic representation for word types independently of their context, and also for contexts independently of the word type.",
        "Probabilistic, soft word classes are more expressive than hard categories.",
        "First, they make it easy and efficient to express shared ambiguities: Chrupa?a (2011) gives an example of words used as either first names or surnames, and this shared ambiguity is reflected in the similarity of their word class distributions.",
        "Second, with soft word classes it becomes easy to express graded similarity between words: as an example, Table 2 shows a random selection out of the 100 most similar word pairs according to the Jensen-Shannon divergence between their word class distributions, according to a word class model with 25 classes induced from (i) 1.8 million words of the CHILDES corpus or (ii) 100 million word of the BNC corpus.",
        "The similarities were measured between each of the 1000 most frequent CHILDES or BNC words."
      ]
    },
    {
      "heading": "3.2 Online Gibbs sampling for LDA",
      "text": [
        "There have been a number of attempts to develop online inference algorithms for topic modeling with LDA.",
        "A simple modification of the standard Gibbs sampler (o-LDA) was proposed by Song et al. (2005) and Banerjee and Basu (2007).",
        "Canini et al2009) experiment with three sampling algorithms for online topic inference: (i) o-LDA, (ii) incremental Gibbs sampler, and (iii) a particle filter.",
        "Only o-LDA is truly online in the sense that it does not revisit previously seen documents.",
        "The other two, the incremental Gibbs sampler and the particle filter, keep seen documents and periodically resample them.",
        "In Canini et al. experiments all of the online algorithms perform worse than the standard batch Gibbs sampler on a document clustering task.",
        "Hoffman et al2010) develop an online version of the variational Bayes (VB) optimization method for inference for topic modeling with LDA.",
        "Their method achieves good empirical results compared to batch VB as measured by perplexity on held-out data, especially when used with large minibatch sizes.",
        "Online VB for LDA is appropriate when streaming documents: with online VB documents are represented as word count tables.",
        "In our scenario where we apply LDA to modeling word classes we need to process context features from sentences arriving in a stream: i.e. we need to sample entries from a table like Table 1 in order of arrival rather than row by row.",
        "This means that online VB is not directly applicable to online word-class induction.",
        "However it also means that one issue with o-LDA identified by Canini et al2009) is ameliorated.",
        "When sampling in a topic modeling setting, documents are unique and are never seen again.",
        "Thus, the topics associated with old documents get stale and need to be periodically rejuvenated (i.e. resam-pled).",
        "This is the reason why the incremental Gibbs sampler and the particle filter algorithms in Canini et al2009) need to keep old documents around and cannot run in a true online fashion.",
        "Since for word class modeling we stream context features as they arrive, we will continue to see features associated with the seen word types, and will automatically re-sample their class assignments.",
        "In exploratory experiments we have seen that this narrows the performance gap between the o-LDA sampler and the batch collapsed Gibbs sampler.",
        "We present our version of the o-LDA sampler in Algorithm 1.",
        "For each incoming sentence twe run J passes of sampling, updating the counts tables after each sampling step.",
        "We sample the class assignment zti for feature wti according to:",
        "where nz,dt stands for the number of times class z co-occurred with word type d up to step t, and similarly nz,wt is the number of times feature w was assigned to class z. Vt is the number of unique features seen up to step t, while ?",
        "and ?",
        "are the LDA hyper-parameters.",
        "There are two differences between the original o-LDA and our version: we do not initialize the algorithm with a batch run over a prefix of the data, and we allow more than one sampling pass per sentence.2 Exploratory experiments have shown that batch initialization is unnecessary, and that multiple passes typically improve the quality of the induced",
        "Figure 1 shows the top 10 words for each of the 10 word classes induced with our online Gibbs sampler from 1.8 million words of CHILDES.",
        "Similarly, Figure 2 shows the top 10 words for 5 randomly chosen topics out of 50, learned online from 100 million words of the BNC.",
        "The topics are relatively coherent and at these levels of granularity express mostly part of speech and subcategorization frame information.",
        "Note that for each word class we show the words most frequently assigned to it while Gibbs sampling.",
        "2Note that we do not allow multiple passes over the stream of sentences.",
        "Rather, while processing the current sentence, we allow the words in this sentence to be sampled more than once.",
        "do are have can not go put did get play is that it what not there he was where put you not I the we what it they your a to you we and I will not can it on it a that the not he this right got she are do is have on in can want did going one I not shall there then you are we it is in are on oh with and of have do the a your of that it this some not very going want bit go have look got will at little"
      ]
    },
    {
      "heading": "CHILDES",
      "text": [
        "I you he it they we she , You He a the more some all no The other I two as if when that where how because If before what was is 's had , has are would did said the his her their this an that its your my Figure 2: Top 10 words of 5 randomly chosen classes learned from BNC Since we are dealing with soft classes, most word-types have non-zero assignment probabilities for many classes.",
        "Thus frequently occurring words such as not will typically be listed for several classes."
      ]
    },
    {
      "heading": "4 Evaluation",
      "text": []
    },
    {
      "heading": "4.1 Experimental setup",
      "text": [
        "As training data, we extract utterances from the Manchester corpus (Theakston et al001) in the CHILDES database (MacWhinney 1995), a corpus that contains transcripts of conversations with children between the ages of 1 year, 8 months and 3 years.",
        "We use the mother's speech from transcripts of 12 children (henceforth referred to by children's names).",
        "We run word class induction while simultaneously outputting the highest scoring word-class label for each word: for a new sentence, we sample class assignments for each feature (doing J passes), update the counts, and then for each word dti output the highest scoring class label according to argmaxz n",
        "t stands for the number of times class z co-occurred with word type dti up to step t).",
        "During development we ran the online word class induction module on data for Aran, Becky, Carl and Anne and then started the word learning module for the Anne portion while continuing inducing categories.",
        "We then evaluated word learning on Anne.",
        "We chose the parameters of the word class induction module based on those development results:",
        "We used cross-validation for the final evaluation.",
        "For each of six data files (Anne, Aran, Becky, Carl, Dominic and Gail), we ran word-class induction on the whole corpus with the chosen file last, and then started applying the word-learning algorithm on this last chosen file (while continuing with category induction).",
        "We evaluated how well word meanings were learned in those six cases.",
        "We follow Alishahi and Fazly (2010) in the construction of the input.",
        "We need a semantic representation paired with each utterance.",
        "Such a representation is not available from the corpus and has to be constructed.",
        "We automatically construct a gold lexicon for all nouns and verbs in this corpus as follows.",
        "For each word, we extract all hypernyms for its first sense in the appropriate (verb or noun) hierarchy in WordNet (Fellbaum 1998), and add the first word in the synset of each hypernym to the set of semantic features for the target word.",
        "For verbs, we also extract features from VerbNet (Kipper et al006).",
        "A small subset of words (pronouns and frequent quantifiers) are also manually added.",
        "This lexicon represents the true meaning of each word, and is used in generating the scene representations in the input and in evaluation.",
        "For each utterance in the input corpus, we form the union of the feature representations of all its words.",
        "Words not found in the lexicon (i.e. for which we could not extract a semantic representation from WordNet and VerbNet) are removed from the utterance (only for the word learning module).",
        "In order to simulate the high level of noise that children receive from their environment, we follow Alishahi and Fazly (2010) and pair each utterance with a combination of its own scene representation and the scene representation for the following utterance.",
        "This decision was based on the intuition that consequent utterances are more likely to be about re",
        "200% ambiguity.",
        "In addition, we remove the meaning of one random word from the scene representation of every second utterance in an attempt to simulate cases where the referent of an uttered word is not within the perception field (such as ?daddy is not home yet?).",
        "A sample utterance and its corresponding scene are shown in Figure 3.",
        "As mentioned before, many words in our input corpus are polysemous.",
        "For such words, we extract different sets of features depending on their manually tagged part of speech and keep them in the lexicon (e.g. the lexicon contains two different entries for set:N and set:V).",
        "When constructing a scene representation for an utterance which contains an ambiguous word, we choose the correct sense from our lexicon according to the word's part of speech tag in Manchester corpus.",
        "In the experiments reported in the next section, we assess the performance of our model on learning words at each point in time: for each target word, we compare its set of features in the lexicon with its probability distribution over the semantic features that the model has learned.",
        "We use mean average precision (MAP) to measure how well p(t)(?|w) ranks the features of w."
      ]
    },
    {
      "heading": "4.2 Learning curves",
      "text": [
        "To understand whether our categories contribute to learning of word?meaning mappings, we compare the pattern of word learning over time in four conditions.",
        "The first condition represents our baseline, in which we do not use category-based alignment in the word learning model by setting ?",
        "(w) = 1 in Eqn.",
        "(1).",
        "In the second condition we use a set of uniformly distributed categories for alignment, as estimated by Eqn.",
        "(3) on page 3 (this condition is introduced to examine whether categories act as more than a simple smoothing factor in the align",
        "ment process.)",
        "In the third condition we use the categories induced by online LDA in the word learning model.",
        "The fourth condition represents the performance ceiling, in which we use the predefined and manually annotated part of speech categories from the Manchester corpus.",
        "Table 3 shows the average and the standard deviation of the final MAP scores across the six datasets, for the four conditions (no categories, uniform categories, LDA categories and gold part-of-speech tags).",
        "The differences between LDA and None, and between LDA and Uniform are statistically significant according to the paired t test (p < 0.01), while the difference between LDA and POS is not (p = 0.16).",
        "Figure 4 shows the learning curves in each condition, averaged over the six splits explained in the previous section.",
        "The top panel shows the average learning curve over the minimum number of sentences across the six sub-corpora (8800 sentences).",
        "The curves show that our LDA categories significantly improve the performance of the model over both baselines.",
        "That means that using these categories can improve word learning compared to not using them and relying on cross-situational evidence alone.",
        "Moreover, LDA-induced categories are not merely acting as a smoothing function the way the ?uniform?",
        "categories are.",
        "Our results show that they are bringing relevant information to the task at hand, that is, improving word learning by using the sentential context.",
        "In fact, this improvement is comparable to the improvement achieved by integrating the ?gold-standard?",
        "POS categories.",
        "The middle and bottom panels of Figure 4 zoom in on shorter time spans (5000 and 1000 sentences, respectively).",
        "These diagrams suggest that the pattern of improvement over baseline is relatively constant, even at very early stages of learning.",
        "In fact, once the model receives enough input data, cross-situational evidence becomes stronger (since fewer",
        "words in the input are encountered for the first time) and the contribution of the categories becomes less significant."
      ]
    },
    {
      "heading": "4.3 Class granularity",
      "text": [
        "In Figure 5 we show the influence of the number of word classes used on the performance in word learning.",
        "It is evident that in the range between 5 to 20 classes the performance of the word learning module is quite stable and insensitive to the exact class granularity.",
        "Even with only 5 classes the model can still roughly distinguish noun-like words from verb-like words from pronoun-like words, and this will help learn the meaning elements derived from the higher levels of WordNet hierarchy.",
        "Notwithstanding that, ideally we would like to avoid having to pre-specify the number of classes for the word class induction module: we thus plan to investigate non-parametric models such as Hierarchical Dirichlet Process for this purpose."
      ]
    },
    {
      "heading": "5 Related Work",
      "text": [
        "This paper investigates the interplay between two language learning tasks which have so far been studied in isolation: the acquisition of lexical categories from distributional clues, and learning the mapping between words and meanings.",
        "Previous models have shown that lexical categories can be learned from unannotated text, mainly drawing on distributional properties of words (e.g. Redington et al. 1998, Clark 2000, Mintz 2003, Parisien et al008, Chrupa?a and Alishahi 2010).",
        "Independently, several computational models have exploited cross-situational evidence in learning the correct mappings between words and meanings, using rule-based inference (Siskind 1996), neural networks (Li et al004, Regier 2005), hierarchical Bayesian models (Frank et al007) and probabilistic alignment inspired by machine translation models (Yu 2005, Fazly et al010).",
        "There are only a few existing computational models that explore the role of syntax in word learning.",
        "Maurits et al2009) investigates the joint acquisition of word meaning and word order using a batch model.",
        "This model is tested on an artificial language with a simple first order predicate representation of meaning, and limited built-in possibilities for word",
        "at each point in time for four conditions: with gold POS categories, with LDA categories, with uniform categories, and without using categories.",
        "Each panel displays a different time span.",
        "at each point in time in four conditions: using online LDA categories of varying numbers of 20, 10 and 5, and without using categories.",
        "order.",
        "The model of Niyogi (2002) simulates the mutual bootstrapping effects of syntactic and semantic knowledge in verb learning, that is the use of syntax to aid in inducing the semantics of a verb, and the use of semantics to narrow down possible syntactic frames in which a verb can participate.",
        "However, this model relies on manually assigned priors for associations between syntactic and semantic features, and is tested on a toy language with very limited vocabulary and a constrained syntax.",
        "Yu (2006) integrates automatically induced syntactic word categories into his model of cross-situational word learning, showing that they can improve the model's performance.",
        "Yu's model also processes input utterances in a batch mode, and its evaluation is limited to situations in which only a coarse distinction between referring words (words that could potentially refer to objects in a scene, e.g. concrete nouns) and non-referring words (words that cannot possibly refer to objects, e.g. function words) is sufficient.",
        "It is thus not clear whether information about finer-grained categories (e.g. verbs and nouns) can indeed help word learning in a more naturalistic incremental setting.",
        "On the other hand, the model of Alishahi and Fazly (2010) integrates manually annotated part-of-speech tags into an incremental word learning algorithm, and shows that these tags boost the overall word learning performance, especially for infrequent words.",
        "In a different line of research, a number of models have been proposed which study the acquisition of the link between syntax and semantics within the Combinatory Categorial Grammar (CCG) framework (Briscoe 1997, Villavicencio 2002, Buttery 2006, Kwiatkowski et al012).",
        "These approaches set the parameters of a semantic parser on a corpus of utterances paired with a logical form as their meaning.",
        "These models bring in extensive and detailed prior assumptions about the nature of the syntactic representation (i.e. atomic categories such as S and NP, and built-in rules which govern their combination), as well as about the representation of meaning via the formalism of lambda calculus.",
        "This is fundamentally different than the approach taken in this paper, which in comparison only assumes very simple syntactic and semantic representations of syntax.",
        "We view word and category learning as standalone cognitive tasks with independent representations (word meanings as probabilistic collections of properties or features as opposed to single symbols; categories as sets of word tokens with similar context distribution) and we do not bring in any prior knowledge of specific atomic categories."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "In this paper, we show the plausibility of using automatically and incrementally induced categories while learning word meanings.",
        "Our results suggest that the sentential context that a word appears in across its different uses can be used as a complementary source of guidance for mapping it to its featural meaning representation.",
        "In Section 4 we show that the improvement achieved by our categories is comparable to that gained by integrating gold POS categories.",
        "This result is very encouraging, since manually assigned POS tags are typically believed to set the upper bound on the usefulness of category information.",
        "We believe that it automatically induced categories have the potential to do even better: Chrupa?a and Alishahi (2010) have shown that categories induced from usage data in an unsupervised fashion can be used more effectively than POS categories in",
        "a number of tasks.",
        "In our experiments here on the development data we observed some improvements over POS categories.",
        "This advantage can result from the fact that our categories are more fine-grained (if also more noisy) than POS categories, which sometimes yields more accurate predictions.",
        "One important characteristic of the category induction algorithm we have used in this paper is that it provides a soft categorization scheme, where each word is associated with a probability distribution over all categories.",
        "In future, we plan to exploit this feature: when estimating the category-based alignment, we can interpolate predictions of multiple categories to which a word belongs, weighted by its probabilities associated with membership in each category."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "Grzegorz Chrupa?a was funded by the German Federal Ministry of Education and Research (BMBF) under grant number 01IC10S01O as part of the Software-Cluster project EMERGENT (www.",
        "software-cluster.org)."
      ]
    }
  ]
}
