{
  "info": {
    "authors": [
      "Neil Ashton"
    ],
    "book": "Proceedings of the Workshop on Applications of Tree Automata Techniques in Natural Language Processing",
    "id": "acl-W12-0804",
    "title": "Second Position Clitics and Monadic Second-Order Transduction",
    "url": "https://aclweb.org/anthology/W12-0804",
    "year": 2012
  },
  "references": [
    "acl-P01-1033"
  ],
  "sections": [
    {
      "text": [
        "Proc.",
        "EACL 2012 Workshop on Applications of Tree Automata Techniques in Natural Language Processing, pages 31?41, Avignon, France, April 24 2012. c?2012 Association for Computational Linguistics Second position clitics and monadic second-order transduction"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "The simultaneously phonological and syntactic grammar of second position clitics is an instance of the broader problem of applying constraints across multiple levels of linguistic analysis.",
        "Syntax frameworks extended with simple tree transductions can make efficient use of these necessary additional forms of structure.",
        "An analysis of Sahidic Coptic second position clitics in a context-free grammar extended by a monadic second-order transduction exemplifies this approach."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Second position (2P) clitics are ubiquitous in the world's languages, found in genetically and typologically diverse languages (e.g. Serbo-Croatian, Warlpiri, O?odham) from all documented periods (e.g. Hittite, spoken ca.",
        "1600?1300 BC).",
        "They present a persistent challenge for syntactic analysis, inducing a peculiar form of crossing dependency which is not easily expressed in any standard restrictive grammar framework.",
        "2P clitics are emblematic of a wider class of problematic phenomena which existing frameworks can address by incorporating a notion of prosodic constituency.",
        "The transductive perspective on mildly context-sensitive grammar formalisms, which treats them as monadic second-order transductions of regular tree languages, suggests how this can be done: by transduc-ing prosodic constituency from syntactic phrase structure.",
        "The prosodic conditioning of 2P clisis is particularly salient in Sahidic Coptic (Reintges, 2004).1 1?Coptic?",
        "refers to the latest form of the Egyptian lan-A context-free phrase structure grammar extended by a monadic second-order transduction is able to make use of the phonological structure necessary to give a linguistically plausible analysis to a fragment of Coptic clitic syntax."
      ]
    },
    {
      "heading": "2.1 Second position",
      "text": [
        "An intuitive account of the syntax of 2P clitics2 has been known since Wackernagel (1892).",
        "The 2P clitic, which is an immediate functional dependent of a clause, e.g. a sentential adverb, discourse particle, pronominal argument, etc., appears after the first word of that clause, potentially interrupting whatever constituent contains that word as its leftmost member, as the chain of 2P clitics interrupts the NP in the following",
        "poklonio.",
        "presented ?That man presented her with it.?",
        "(Bo?gel et al., 2010) guage.",
        "Sahidic Coptic, the major literary dialect of Coptic from the 4th to the 10th centuries AD, is survived by a rich corpus of Greek-alphabet texts.",
        "The only extant computational model of Sahidic Coptic grammar is apparently that of Orlandi (2004).",
        "This work is unfortunately not available to the author, and so no comparison of approaches has been possible.",
        "This constituency-breaking word order pattern alone poses a descriptive challenge.",
        "The difficulty is exacerbated by the fact that the ?word?",
        "targeted by the 2P clitic is not in general syntactically characterizable.",
        "It is rather a phonological constituent that may include incorporated clitics (Inkelas and Zec, 1990; Zec, 2005).",
        "The alternation in the position of the 2P clitic de in the Coptic sentences",
        "In both sentences, de functions as a clausal conjunction.",
        "But its position varies, appearing between the main verb and its subject in (2) and between the verb and its object in (3).",
        "This alternation is most plausibly phonological.",
        "The 2P clitic appears after the first independently pronounceable word, including its attached clitics, such as the pronominal subject win (3) and the tense auxiliary a-in both sentences.",
        "The behavior of 2P clitics when the verb itself or its direct object are clitics is consistent with this analysis.",
        "Phonological properties alone, however, do not suffice to describe the syntax of 2P clitics.",
        "They are constrained to appear within a syntactically determined subpart of their host clause, typically ignoring topicalized or otherwise left-dislocated elements and thus appearing quite far from strict phonological second position.",
        "Describing 2P clisis thus requires reference to both syntactic and phonological structure."
      ]
    },
    {
      "heading": "2.2 Prosodic constituency via tree",
      "text": [
        "transduction The notion of prosodic constituency (Nespor and Vogel, 1986; Selkirk, 1986) provides the key to a perspicuous account of the multiple factors at play in the grammar of 2P clitics.",
        "Prosodic constituency is a tree structure that defines the ?words?",
        "and ?phrases?",
        "relevant to phonology,",
        "which are in general distinct from yet closely related to their syntactic equivalents.",
        "Both the distinctness of and the relationship between syntactic and prosodic constituency can be captured by transducing the latter from the former.",
        "This transduction in effect interprets syntactic trees as terms over a signature of phonological operations and normalizes the result.",
        "The yield function is a prosodically naive example of such a transduction.",
        "Once this independently necessary transduction has been taken into account, the syntax of 2P clitics is straightforward.",
        "The 2P clitic simply has a non-concatenative mode of phonological combination.",
        "The clitic and its host clause are siblings in syntactic constituency, and their parent node is interpreted as an operation that wraps the latter around the former?alternatively, lowers the former into the latter.",
        "This analysis, which captures in essence both the ?wrapping?",
        "(Bach, 1987) and ?prosodic inversion?",
        "(Halpern, 1995) analyses of 2P clitics, can be schematized as in Figure 1, where ?Word?",
        "is constrained to be the leftmost node with that label in S. This transduction is not direction-preserving in the sense of Bloem and Engelfriet (2000): assuming that the clitic crosses unboundedly many nodes on the way to its host word, a crossing dependency is induced in the paths of the target tree.",
        "This rules out the possibility of formalizing this analysis by means of popular automaton models such as multi bottom-up tree transducers (Fu?lo?p et al., 2004) or their extended variant (Engelfriet et al., 2009), which cannot describe such depen",
        "dencies (Maletti, 2011).",
        "The more powerful automata that can be specified using monadic second-order logic (MSO), which include syntactically restricted classes of macro tree transducers (Engelfriet and Maneth, 1999) and deterministic tree-walking transducers (Bloem and Engelfriet, 2000), can perform this transduction.",
        "Section 3 defines the transduction in MSO, and Section 4 reflects briefly on its implementation."
      ]
    },
    {
      "heading": "3 Sahidic Coptic 2P clitics via CFG+MST",
      "text": [
        "The following context-free grammar and sequence of MSO transductions formalizes, for a fragment of Sahidic Coptic, the analysis of 2P clisis sketched in Section 2.2.",
        "Section 3 breaks the interpretation of a syntactic parse tree as a phonological term into a series (f1?f7) of simple composed MSO transductions.",
        "A ?redex?",
        "phonological term is derived (Section 3.3), and its reducible subterms are then evaluated separately (Section 3.4).",
        "An algorithmic implementation of the transduction is sketched in Section 3.5."
      ]
    },
    {
      "heading": "3.1 Formal preliminaries",
      "text": [
        "The following definitions and assertions rehearse material from Courcelle and Engelfriet (2012), which should be consulted for full details.",
        "3.1.1 Relational structures and tree graphs A relational signature is a finite set R of relation symbols with associated arity ?",
        "(r) ?",
        "N?",
        "for each r ?",
        "R. A relational structure over R is a tuple R = ?DR , (rR)r?R?, where DR is a finite domain of entities and rR , for each r ?",
        "R, is a ?",
        "(r)-ary relation on DR .",
        "A bijection exists between binary relational structures and labelled graphs, with unary and binary relations corresponding to node and edge labels, respectively.",
        "Ordered binary trees can be represented as labelled directed graphs, and hence as relational structures, in the obvious way.",
        "The monadic second-order (MSO) formulas over a relational signature R are as first-order predicate logic, with the addition of monadic second-order variables X,Y,X ?, .",
        ".",
        ".",
        "denoting sets of entities, second-order quantification, and a primitive operator for set membership.",
        "The substitution of n free variables in a formula ?",
        "by entities d1, .",
        ".",
        ".",
        ", dn is written ?",
        "(d1, .",
        ".",
        ".",
        ", dn).",
        "An MSO formula over R is interpreted in a relational signature over R. A formula with no free variables is called a sentence.",
        "If a sentence ?",
        "is true in a relational structure R, we write R |= ?, pronounced ?R models ?",
        "?.",
        "An MSO transduction defines a relational structure in terms of another by taking a finite number of copies of nodes from the source domain, keeping those that satisfy particular formulas in the source structure, and defining the relations that hold in the target structure by means of formulas modeled by the source structure.",
        "The generalization of MSO transduction to k-copying MSO transduction (Courcelle, 1991) allows the target domain to be larger than its source.",
        "MSO transductions whose formulas do not refer to parameters define deterministic functions.",
        "A (parameterless, k-copying) MSO transduction over a relational signature R is specified by a triple ?k,?,?",
        "?, where k ?",
        "N and ?",
        "= {?i |0 ?",
        "i ?",
        "k} and ?",
        "= {?w |w ?",
        "W} are sets of MSO formulas with free variables, and W is the set of all tuples (r, i1, .",
        ".",
        ".",
        ", i?",
        "(r)) for r ?",
        "R. This triple is called a definition scheme.",
        "A definition scheme specifies a target relational structure T with respect to a source relational structure S as follows.",
        "The domain DT of T is the set (D0 ?",
        "{0}) ?",
        ".",
        ".",
        ".",
        "?",
        "(Dk ?",
        "{k}), where each Di = {d ?",
        "DS |S |= ?i(d)}.",
        "For each nary relation r in the relational signature of T , an nary relation on DT is defined as:",
        "Intuitively, a formula ?i specifies conditions on the existence of the ith copy of a node in the target structure.",
        "A formula ?(r,i0,...,j?",
        "(r)) specifies conditions on the relation r holding between copies of nodes indexed i, .",
        ".",
        ".",
        ", j in the target structure."
      ]
    },
    {
      "heading": "3.2 Definitions and abbreviations",
      "text": [
        "The phrase structure grammar which serves as the basis of the analysis of Coptic is presented in",
        "guage of binary trees, members of which can be represented as relational structures, as explained in Section 3.1.1.",
        "This CFG fragment, in combination with the transductions detailed below, suffices to generate sentences (2) and (3) from Section 2.1.",
        "This grammar encodes several claims, already alluded to in Section 2.1, about the syntactic structure of Coptic.",
        "Syntactic dependencies are represented by constituency in the usual way.",
        "The immediate dependence of the 2P clitic de on a host clause is expressed by the siblinghood of Cl and S?",
        "under S. Features of lexical items relevant for agreement and allomorphy are encoded as diacritics on nonterminals, allowing determiners to agree with nouns in gender and the accusative case preposition to covary with the nominal or pronominal status of its complement.",
        "branching Syntactic trees are interpreted into prosodic trees, which may contain prosodic word constituents that branch unboundedly wide.",
        "To fix a binary encoding for such constituents, a ?cons cell?-like variant of the extension operator encoding (Comon et al., 2007, p. 210) is adopted, in which a term of the form @(x, y) is interpreted as extending the interpretation of y by adding x to its root as its leftmost child.",
        "An example of this encoding is given in Figure 3.",
        "Only the fragment of prosodic constituency relevant to the alternation shown in sentences (2)",
        "and (3) is derived.",
        "The output tree therefore contains operator-encoded prosodic constituents as subtrees of unencoded trees containing unan-alyzed phonological combination operators.",
        "All MSO transductions presented below are defined over a binary relational signature R = R1 ?",
        "R2.",
        "The set of node labels R1 is given by the union of the set of all non-terminal and terminal node names in the grammar of Figure 2 and the set {_, ?p, ?e, ?2p, ?id, ?,@}.",
        "The interpretation of these predicates is given in Table 1.",
        "The set of binary predicates R2 is simply {0,1}, the left and right child relations, written as infix operators as a notational convenience.",
        "It will be useful to define several new binary predicates as syntactic abbreviations.",
        "I assume reflexive and irreflexive transitive closures r?",
        "and r+ of relations r ?",
        "R2, as well as immediate domination and precedence ,?, as abbreviations of MSO formulas over primitive predicates.4 Recurring structural properties of lexical items in the base CFG are given by the unary syntactic abbreviations defined below.",
        "These include pro",
        "clitic and 2P clitic status (Pc(x), 2P(x)), independent pronounceability (Str(x)), and the property of being a leaf (Leaf(x)).",
        "MSO transductions are given by transduction schemes, as defined in Section 3.1.3.",
        "In the case that k = 0, irrelevant subscripts are omitted.",
        "Unless otherwise specified, all formulas ?i can be assumed to be the constant True."
      ]
    },
    {
      "heading": "3.3 Transducing a reducible term",
      "text": [
        "A syntactic constituency tree can be interpreted as a term in a phonological algebra, with non-leaf nodes interpreted as operations effecting phonological combination in various modes.",
        "Pronounceable utterances, which consist of concatenations of prosodic constituents (i.e. terms over leaves from the base CFG, @, ?, and _), are normal forms.",
        "This complex interpretation is broken into smaller transductions, the first set of which lays the foundation for the reduction of the ?clitic?",
        "modes of combination.",
        "Non-leaf nodes are first replaced by appropriate combination operators (Section 3.3.1).",
        "Unary nodes are then eliminated (Section 3.3.2).",
        "Finally, the prosodic structure necessary for the next phase of interpretation is generated (Section 3.3.3).",
        "Non-terminal leaves in the syntactic tree are replaced by operators indicating modes of phonological combination, as presented in Table 1.",
        "The transduction to unreduced phonological terms is sensitive to the structure of the syntactic tree.",
        "Some leaves, e.g. clitic pronouns, are not strictly proclitic or enclitic but vary by context: the pronominal subject of a verb or possessor of a noun is proclitic, whereas the pronominal complement of an accusative preposition or pronoun-selecting verb is enclitic.",
        "The relevant syntactic context is the child status of NPpro nodes.",
        "Hence the parent of an NPpro node is replaced by ?p if NPpro is its left child, by ?e if NPpro its right child.",
        "All non-pronominal clitics are phonologically combined with the sibling of their phonologically vacuous unary parent node.",
        "Thus the grandparents of all such clitic leaves are replaced by the appropriate clitic combination operator, ?p for pro-clitics and ?2p for 2P clitics.",
        "Unary nodes are replaced by ?id, and all other non-leaf nodes are replaced by_.",
        "Leaf node labels are left unchanged.",
        "The definition scheme f1 = ?0,?,?",
        "?, where ?",
        "is defined as the union of the formulas given below, specifies this transduction.",
        "The body of the ?_ formula, which consists largely of the disjunction of the negations of the preceding formulas, is omitted, as signaled by [etc]; and the ?w formula which reasserts leaf labels is omitted altogether.",
        "Before any further interpretation takes place, unary ?id nodes, which are phonologically vacuous, can be eliminated.",
        "The definition scheme f2 = ?0,?,?",
        "?, with ?",
        "defined as the union of the following formulas (for i ?",
        "{0, 1}), eliminates unary nodes by connecting a non-?id node dominated by a path of ?id nodes to the parent of the topmost ?id in the path.",
        "Again, [etc] stands for the omitted ?elsewhere condition?, which here reasserts edges from the source.",
        "An example of the composed transduction f2 ?",
        "f1 is given in Figure 4.",
        "3.3.3 Base prosodic words Before reducing the remaining reducible modes of combination, it is necessary to create prosodic word constituents, notated ?, that cover the independently pronounceable ?strong?",
        "leaves of the tree, allowing the word-sensitive clitic modes of combination to be interpreted correctly.",
        "Prosodic",
        "The definition scheme f3 = ?2,?,?",
        "?, with ?",
        "and ?",
        "the union of the ?",
        "and ?",
        "formulas below, specifies a transduction that takes two additional copies of all nodes, relabels the copies of strong leaf nodes as @ and ?, and draws edges as appropriate.",
        "An example of the tree transduction given by f3 is shown in Figure 5, with identity of copies indicated by subscript letters and the number of the copy by superscript numerals."
      ]
    },
    {
      "heading": "3.4 Interpreting clitic combination modes",
      "text": [
        "The composed transduction f3 ?",
        "f2 ?",
        "f1 produces reducible phonological terms in which the prosodic structure necessary to interpret the clitic modes of combination (?p, ?e, and ?2p) is present.",
        "The interpretation of the clitic modes proceeds in three steps.",
        "?Local?",
        "clitics, siblings of prosodic words, are amalgamated into their hosts (Section 3.4.1).",
        "?Long-distance?",
        "clitics, which are not",
        "thus locally attached, are lowered to their hosts (Section 3.4.2) and then attached as local clitics.",
        "Second-position clitics are finally lowered and attached by the same means, as a special case (Section 3.4.3).",
        "Locally connected clitics can be directly incorporated into their hosts.",
        "The word constituent so derived is the recursive structure (e.g. [?clitic [?host]]) generally assumed for cliticized words (cf. Inkelas and Zec, 1990; Zec, 2005).",
        "Proclitics and enclitics can be interpreted separately.",
        "For proclitics, the relevant notion of ?locality?",
        "can be expressed by a predicate ?p(x), which identifies ?p nodes connected to @ nodes by a path of ?p nodes.",
        "The 2-copying MS transduction specified by the definition scheme f4 = ?2,?,?",
        "?, with ?",
        "and ?",
        "given by the union of the ?",
        "and ?",
        "formulas below, produces the appropriate bracketing by projecting a new word above each proclitic and relocating each proclitic's sibling to the new word",
        "mation effected by f4, again with subscripts and superscripts indicating copies.",
        "The interpretation of local enclitics proceeds similarly.",
        "A predicate ?e(x) defines the relevant notion of locality.",
        "?",
        "given by the union of the ?",
        "and ?",
        "formulas below, produces the appropriate bracketing.",
        "This transduction is more complicated than the proclitic transformation in that enclitics, right children in the source tree, must be relocated to left",
        "Long-distance clitics, which are not locally combined with their hosts, incorporate into them in the same manner as local clitics (i.e. by transductions f4 and f5) but must be lowered to them to do so.",
        "Only long-distance proclisis is relevant to the grammar fragment under consideration.",
        "A long-distance proclitic is a non-local proclitic (see Section 3.4.1 for the notion of ?locality?)",
        "adjacent to a word in the yield, ignoring other proclitics.",
        "Pronouns count as proclitics for this purpose, so a predicate Pc?",
        "(x) including pronouns is defined.",
        "The predicate Adj(x, y) expresses adjacency of x and y, and the predicate Lp(x), which identifies the parents of long-distance proclitics, is defined in terms of Adj(x, y).",
        "The parents of long-distance proclitics get attached to ?goal?",
        "nodes?that is, @ nodes or other parents of long-distance proclitics?by the right child relation.",
        "The predicate G(x) identifies goals, and NG(x, y) identifies node x's nearest goal y.",
        "The parent of the topmost in a path of ?p nodes must get attached, by whatever child relation con",
        "nects that parent node to that path, to the right child of the lowest node in the path.",
        "The higher-order syntactic abbreviation PC[i;x, y] specifies the relevant relation, whereby a path of ?p nodes begins with the ith child of x and leads to y.",
        "The parent of a @ node targeted by a set of long-distance clitics gets attached to the highest parent of a clitic in that set.",
        "The predicate Hip(x) identifies such highest proclitic parents.",
        "Only ?maximal?",
        "@ nodes, those that are highest in the right-recursive path of @ nodes leading to an ?, are relevant; these are identified by the predicate Max@p(x).",
        "The abbreviation WC[i;x, y] identifies a highest ?p node y adjacent to a maximal @ node that is the ith child of x.",
        "Once these auxiliary predicates are defined, a simple MSO transduction f6 = ?0,?,?",
        "?meeting the specifications given above can be defined by the union of the following formulas.",
        "specified by f6.",
        "The transduction f4 can be composed with f6 to produce the appropriate constituency for the lowered proclitics.",
        "There is little substantive difference between long-distance proclitics and 2P clitics?both arrive in their position by a ?lowering?",
        "transformation that targets @ nodes.",
        "The transductions",
        "changed, to derive 2P clisis.",
        "Assume a lowering transduction f ?6 identical to f6 except operating on ?2p nodes.",
        "The resulting lowered 2P clitics, which are in a ?proclitic?",
        "configuration, can then be ?rotated?",
        "and relabeled as enclitics.",
        "The MSO transduction f7 = ?0,?,??",
        "given by the union of the following formulas produces this transformation.",
        "The local enclisis transduction f5 is then applied to incorporate the 2P clitics into their hosts.",
        "An example transformation effected by the transduction f5 ?",
        "f7 ?",
        "f ?6 is shown in Figure 3.4.3."
      ]
    },
    {
      "heading": "3.5 Algorithmic implementation",
      "text": [
        "No automaton compiler for MSO transductions exists, and the non-elementary complexity of the MSO-to-automaton translation procedure ensures that the development of a practical compiler will be a difficult undertaking.",
        "The most convenient algorithmic implementation of the above analysis is therefore an indirect one: an extensionally equivalent algorithm constructed in an expressively equivalent transduction framework."
      ]
    },
    {
      "heading": "Second-order Abstract Categorial Grammar",
      "text": [
        "(Kanazawa, 2009b) is one such framework, equivalent to MSO in tree-transforming power (Kanazawa, 2009a).",
        "ACG tree transductions, which are expressed as linear ?-term homomorphisms and thus have the same complexity as linear ?-term normalization, can be implemented in Haskell in the manner of Kiselyov and Shan (2010).",
        "A function extensionally equivalent to that defined logically above can be defined in a simple ACG consisting of a composed pair of homomorphisms and implemented in Haskell in a pair of type classes."
      ]
    },
    {
      "heading": "4 Discussion and conclusion",
      "text": [
        "The analysis of Sahidic Coptic 2P clitics in terms of prosodic constituency and tree transformation given above successfully accounts for the alternation shown in sentences (2) and (3).",
        "It promises to scale to a larger fragment of Coptic grammar, accommodating the addition of clitic main verbs and direct objects without further ado.",
        "The general approach also promises to extend straightforwardly to other languages with 2P clitics, such as Russian and Hittite.",
        "Since the general technique of MSO transduction underlying the analysis applies to all tree-deriving grammar formalisms, richer grammatical backbones than CFG can be deployed as necessary.",
        "This transductive analysis is in line with a nascent convergence in perspectives on restrictive formal syntax.",
        "The mildly context-sensitive languages, polynomially parseable languages containing limited cross-serial dependencies such as those induced by 2P clitics, have received a new logical characterization in light of the past decade's surge of interest in disentangling derivations from their interpretations.6 Mildly context-sensitive languages are the images of recognizable tree languages under monadic second-order transductions.7 This generalizes not only string-generating formalisms like linear context-free rewriting systems (Vijay-Shanker et al., 1987; Weir, 1992) but also context-free languages of graphs (Engelfriet and Maneth, 2000) and linear ?-terms (Kanazawa, 2009a; Kanazawa, 2010).8 This perspective suggests a modular approach to framework revision in the face of problematic natural language phenomena.",
        "Transductive interpretations are an integral, if not universally recognized, component of restrictive grammar frameworks.",
        "Hence, to meet new descriptive challenges such as those posed by 2P clitics, it is natural to extend those frameworks?",
        "interpretive components by means of MSO rather than rebuilding them from scratch.",
        "No software toolkit for MSO transduction comparable to the XFST toolkit for regular expressions (Beesley and Karttunen, 2003) or the MONA toolkit for MSO (Henriksen et al., 1995) presently exists, however.",
        "Nevertheless, MSO is an excellent candidate for a high-level specification language for tree transformations, promising to play the same role for tree transduction that languages such as XFST play for string transduction.",
        "MSO meanwhile serves the useful purpose of providing a denotational check on the complexity of tree transformation algorithms."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "Many thanks to John Hale, Sarah Murray, Michael Weiss, and three anonymous reviewers for their valuable comments.",
        "Thanks also to Chung-chieh Shan, Chris Barker, Greg Kobele, Makoto Kanazawa, and Zolta?n Varju?",
        "for their conversation and inspiration.",
        "This research was supported by the Social Sciences and Humanities"
      ]
    }
  ]
}
