{
  "info": {
    "authors": [
      "Seokhwan Kim",
      "Gary Geunbae Lee"
    ],
    "book": "ACL",
    "id": "acl-P12-2010",
    "title": "A Graph-based Cross-lingual Projection Approach for Weakly Supervised Relation Extraction",
    "url": "https://aclweb.org/anthology/P12-2010",
    "year": 2012
  },
  "references": [
    "acl-C10-1064",
    "acl-C96-1079",
    "acl-D08-1063",
    "acl-D11-1142",
    "acl-E06-1015",
    "acl-H01-1035",
    "acl-H05-1091",
    "acl-J03-1002",
    "acl-N01-1026",
    "acl-P04-3022",
    "acl-P06-1017",
    "acl-P06-1104",
    "acl-P07-1073",
    "acl-P10-1013",
    "acl-P11-1061"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Although researchers have conducted extensive studies on relation extraction in the last decade, supervised approaches are still limited because they require large amounts of training data to achieve high performances.",
        "To build a relation extractor without significant annotation effort, we can exploit cross-lingual annotation projection, which leverages parallel corpora as external resources for supervision.",
        "This paper proposes a novel graph-based projection approach and demonstrates the merits of it by using a Korean relation extraction system based on projected dataset from an English-Korean parallel corpus."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Relation extraction aims to identify semantic relations of entities in a document.",
        "Although many supervised machine learning approaches have been successfully applied to relation extraction tasks (Ze-lenko et al., 2003; Kambhatla, 2004; Bunescu and Mooney, 2005; Zhang et al., 2006), applications of these approaches are still limited because they require a sufficient number of training examples to obtain good extraction results.",
        "Several datasets that provide manual annotations of semantic relationships are available from MUC (Grishman and Sundheim, 1996) and ACE (Doddington et al., 2004) projects, but these datasets contain labeled training examples in only a few major languages, including English, Chinese, and Arabic.",
        "Although these datasets encourage the development of relation extractors for these major languages, there are few labeled training samples for learning new systems in other languages, such as Korean.",
        "Because manual annotation of semantic relations for such resource-poor languages is very expensive, we instead consider weakly supervised learning techniques (Riloff and Jones, 1999; Agichtein and Gravano, 2000; Zhang, 2004; Chen et al., 2006) to learn the relation extractors without significant annotation efforts.",
        "But these techniques still face cost problems when preparing quality seed examples, which plays a crucial role in obtaining good extractions.",
        "Recently, some researchers attempted to use external resources, such as treebank (Banko et al., 2007) and Wikipedia (Wu and Weld, 2010), that were not specially constructed for relation extraction instead of using task-specific training or seed examples.",
        "We previously proposed to leverage parallel corpora as a new kind of external resource for relation extraction (Kim et al., 2010).",
        "To obtain training examples in the resource-poor target language, this approach exploited a cross-lingual annotation projection by propagating annotations that were generated by a relation extraction system in a resource-rich source language.",
        "In this approach, projected annotations were determined in a single pass process by considering only alignments between entity candidates; we call this action direct projection.",
        "In this paper, we propose a graph-based projection approach for weakly supervised relation extraction.",
        "This approach utilizes a graph that is con-stucted with both instance and context information and that is operated in an iterative manner.",
        "The goal of our graph-based approach is to improve the robustness of the extractor with respect to errors that are generated and accumulated by preprocessors.",
        "tion extraction of a bitext in English and Korean"
      ]
    },
    {
      "heading": "2 Cross-lingual Annotation Projection for",
      "text": []
    },
    {
      "heading": "Relation Extraction",
      "text": [
        "Relation extraction can be considered to be a classification problem by the following classifier:",
        "where ei and ej are entities in a sentence.",
        "Cross-lingual annotation projection intends to learn an extractor ft for good performance without significant effort toward building resources for a resource-poor target language Lt. To accomplish that goal, the method automatically creates a set of annotated text for ft, utilizing a well-made extractor fs for a resource-rich source language Ls and a parallel corpus of Ls and Lt.",
        "Figure 1 shows an example of annotation projection for relation extraction with a bi-text in Lt Korean and Ls English.",
        "Given an English sentence, an instance ?Barack Obama, Honolulu?",
        "is extracted as positive.",
        "Then, its translational counterpart ?beo-rak-o-ba-ma, ho-nol-rul-ru?",
        "in the Korean sentence also has a positive annotation by projection.",
        "Early studies in cross-lingual annotation projection were accomplished for various natural language processing tasks (Yarowsky and Ngai, 2001; Yarowsky et al., 2001; Hwa et al., 2005; Zitouni and Florian, 2008; Padó and Lapata, 2009).",
        "These studies adopted a simple direct projection strategy that propagates the annotations in the source language sentences to word-aligned target sentences, and a target system can bootstrap from these projected annotations.",
        "For relation extraction, the direct projection strategy can be formularized as follows: ft",
        ", where A(et) is the aligned entity of et.",
        "However, these automatic annotations can be unreliable because of source text misclassification and word alignment errors; thus, it can cause a critical falling-off in the annotation projection quality.",
        "Although some noise reduction strategies for projecting semantic relations were proposed (Kim et al., 2010), the direct projection approach is still vulnerable to erroneous inputs generated by submodules.",
        "We note two main causes for this limitation: (1) the direct projection approach considers only alignments between entity candidates, and it does not consider any contextual information; and, (2) it is performed by a single pass process.",
        "To solve both of these problems at once, we propose a graph-based projection approach for relation extraction."
      ]
    },
    {
      "heading": "3 Graph Construction",
      "text": [
        "The most crucial factor in the success of graph-based learning approaches is how to construct a graph that is appropriate for the target task.",
        "Das and Petrov (Das and Petrov, 2011) proposed a graph-based bilingual projection of part-of-speech tagging by considering the tagged words in the source language as labeled examples and connecting them to the unlabeled words in the target language, while referring to the word alignments.",
        "Graph construction for projecting semantic relationships is more complicated than part-of-speech tagging because the unit instance of projection is a pair of entities and not a word or morpheme that is equivalent to the alignment unit."
      ]
    },
    {
      "heading": "3.1 Graph Vertices",
      "text": [
        "To construct a graph for a relation projection, we define two types of vertices: instance vertices V and context vertices U .",
        "Instance vertices are defined for all pairs of entity candidates in the source and target languages.",
        "Each instance vertex has a soft label vector Y = [ y+ y?",
        "], which contains the probabilities that the instance is positive or negative, respectively.",
        "The larger the y+ value, the more likely the instance has a semantic relationship.",
        "The initial label values of an instance vertex vijs ?",
        "Vs for the instance",
        "the source language are assigned based on the confidence score of the extractor fs.",
        "With respect to the target language, every instance vertex vijt ?",
        "Vt has",
        "the same initial values of 0.5 in both y+ and y?.",
        "The other type of vertices, context vertices, are used for identifying relation descriptors that are contextual subtexts that represent semantic relationships of the positive instances.",
        "Because the characteristics of these descriptive contexts vary depending on the language, context vertices should be defined to be language-specific.",
        "In the case of English, we define the context vertex for each trigram that is located between a given entity pair that is semantically related.",
        "If the context vertices Us for the source language sentences are defined, then the units of context in the target language can also be created based on the word alignments.",
        "The aligned counterpart of each source language context vertex is used for generating a context vertex uit ?",
        "Ut in the target language.",
        "Each context vertex us ?",
        "Us and ut ?",
        "Ut also has y+ and y?, which represent how likely the context is to denote semantic relationships.",
        "The probability values for all of the context vertices in both of the languages are initially assigned to y+ = y?",
        "= 0.5."
      ]
    },
    {
      "heading": "3.2 Edge Weights",
      "text": [
        "The graph for our graph-based projection is constructed by connecting related vertex pairs by weighted edges.",
        "If a given pair of vertices is likely to have the same label, then the edge connecting these vertices should have a large weight value.",
        "We define three types of edges according to combinations of connected vertices.",
        "The first type of edges consists of connections between an instance vertex and a context vertex in the same language.",
        "For a pair of an instance vertex vi,j and a context vertex uk, these vertices are connected if the context sequence of vi,j contains uk as a subsequence.",
        "If vij is matched to uk, the edge weight w",
        "is assigned to 1.",
        "Otherwise, it should be 0.",
        "Another edge category is for the pairs of context vertices in a language.",
        "Because each context vertex is considered to be an n-gram pattern in our work, the weight value for each edge of this type represents the pattern similarity between two context vertices.",
        "The edge weight w(uk, ul) is computed by Jaccard's coefficient between uk and ul.",
        "While the previous two categories of edges are concerned with monolingual connections, the other type addresses bilingual alignments of context vertices between the source language and the target language.",
        "We define the weight for a bilingual edge connecting uks and ult as the relative frequency of alignments, as follows:",
        "where count (us, ut) is the number of alignments between us and ut across the whole parallel corpus."
      ]
    },
    {
      "heading": "4 Label Propagation",
      "text": [
        "To induce labels for all of the unlabeled vertices on the graph constructed in Section 3, we utilize the label propagation algorithm (Zhu and Ghahramani, 2002), which is a graph-based semi-supervised learning algorithm.",
        "First, we construct an n ?",
        "n matrix T that represents transition probabilities for all of the vertex pairs.",
        "After assigning all of the values on the matrix, we normalize the matrix for each row, to make the element values be probabilities.",
        "The other input to the algorithm is an n ?",
        "2 matrix Y , which indicates the probabilities of whether a given vertex vi is positive or not.",
        "The matrix T and Y are initialized by the values described in Section 3.",
        "For the input matrices T and Y , label propagation is performed by multiplying the two matrices, to update the Y matrix.",
        "This multiplication is repeated until Y converges or until the number of iterations exceeds a specific number.",
        "The Y matrix, after finishing its iterations, is considered to be the result of the algorithm."
      ]
    },
    {
      "heading": "5 Implementation",
      "text": [
        "To demonstrate the effectiveness of the graph-based projection approach for relation extraction, we developed a Korean relation extraction system that was trained with projected annotations from English resources.",
        "We used an English-Korean parallel corpus 1 that contains 266,892 bi-sentence pairs in English and Korean.",
        "We obtained 155,409 positive instances from the English sentences using an off-the-shelf relation extraction system, ReVerb 2 (Fader et al., 2011).",
        "The English sentence annotations in the parallel corpus were then propagated into the corresponding Korean sentences.",
        "We used the GIZA++ software 3 (Och and Ney, 2003) to obtain the word alignments for each bi-sentence in the parallel corpus.",
        "The graph-based projection was performed by the Junto toolkit 4 with the maximum number of iterations of 10 for each execution.",
        "Projected instances were utilized as training examples to learn the Korean relation extractor.",
        "We built a tree kernel-based support vector machine model using SVM-Light 5 (Joachims, 1998) and Tree Kernel tools 6 (Moschitti, 2006).",
        "In our model, we adopted the subtree kernel method for the shortest path dependency kernel (Bunescu and Mooney, 2005)."
      ]
    },
    {
      "heading": "6 Evaluation",
      "text": [
        "The experiments were performed on the manually annotated Korean test dataset.",
        "The dataset was built following the approach of Bunescu and Mooney (Bunescu and Mooney, 2007).",
        "The dataset consists of 500 sentences for four relation types: Acquisition, Birthplace, Inventor of, and Won Prize.",
        "Of these, 278 sentences were annotated as positive instances.",
        "The first experiment aimed to compare two systems constructed by the direct projection (Kim et al., 2010) and graph-based projection approach.",
        "Table 1 shows the performances of the relation extraction of the two systems.",
        "The graph-based system achieved",
        "system with direct projection for all of the four relation types.",
        "It outperformed the baseline system by an F-measure of 3.63.",
        "To demonstrate the merits of our work against other approaches based on monolingual external resources, we performed comparisons with the following two baselines: heuristic-based (Banko et al., 2007) and Wikipedia-based approaches (Wu and Weld, 2010).",
        "The heuristic-based baseline was built on the Sejong treebank corpus (Kim, 2006) and the Wikipedia-based baseline used Korean Wikipedia articles 7.",
        "Table 2 compares the performances of the two baseline systems and our method.",
        "Our proposed projection-based approach obtained better performance than the other systems.",
        "It outperformed the heuristic-based system by 47.21 and the Wikipedia-based system by 9.51 in the F-measure."
      ]
    },
    {
      "heading": "7 Conclusions",
      "text": [
        "This paper presented a novel graph-based projection approach for relation extraction.",
        "Our approach performed a label propagation algorithm on a proposed graph that represented the instance and context features of both the source and target languages.",
        "The feasibility of our approach was demonstrated by our Korean relation extraction system.",
        "Experimental results show that our graph-based projection helped to improve the performance of the cross-lingual annotation projection of the semantic relations, and our system outperforms the other systems, which incorporate monolingual external resources.",
        "In this work, we operated the graph-based projection under very restricted conditions, because of high complexity of the algorithm.",
        "For future work, we plan to relieve the complexity problem for dealing with more expanded graph structure to improve the performance of our proposed approach."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This research was supported by the MKE(The Ministry of Knowledge Economy), Korea, under the ITRC(Information Technology Research Center) support program (NIPA-2012-(H0301-123001)) supervised by the NIPA(National IT Industry Promotion Agency) and Industrial Strategic technology development program, 10035252, development of dialog-based spontaneous speech interface technology on mobile platform, funded by the Ministry of Knowledge Economy(MKE, Korea)."
      ]
    }
  ]
}
