{
  "info": {
    "authors": [
      "Robert Dale",
      "Ilya Anisimoff",
      "George Narroway"
    ],
    "book": "Proceedings of the Seventh Workshop on Building Educational Applications Using NLP",
    "id": "acl-W12-2006",
    "title": "HOO 2012: A Report on the Preposition and Determiner Error Correction Shared Task",
    "url": "https://aclweb.org/anthology/W12-2006",
    "year": 2012
  },
  "references": [
    "acl-N10-1019",
    "acl-N12-1067",
    "acl-P11-1019",
    "acl-W10-4236"
  ],
  "sections": [
    {
      "text": [
        "The 7th Workshop on the Innovative Use of NLP for Building Educational Applications, pages 54?62, Montre?al, Canada, June 3-8, 2012. c?2012 Association for Computational Linguistics HOO 2012: A Report on the Preposition and Determiner Error Correction Shared Task"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "Incorrect usage of prepositions and determiners constitute the most common types of errors made by non-native speakers of English.",
        "It is not surprising, then, that there has been a significant amount of work directed towards the automated detection and correction of such errors.",
        "However, to date, the use of different data sets and different task definitions has made it difficult to compare work on the topic.",
        "This paper reports on the HOO 2012 shared task on error detection and correction in the use of prepositions and determiners, where systems developed by 14 teams from around the world were evaluated on the same previously unseen errorful text."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "It is widely recognized that the correct usage of determiners and prepositions in English is a major problem area for non-native speakers of the language.",
        "The issues here have been explored and discussed extensively in the literature; an excellent and up-to-date summary is available in (Leacock et al., 2010).",
        "However, the various teams that have attempted to tackle these problems so far have tended to use slightly different task specifications, and different data sets for evaluation; this makes it very dif-1We use the broad term ?non-native speaker?, abbreviated ?NNS?, in this paper; other work makes a distinction between ESL (English as a Second Language) speakers (who live and speak in a primarily English-speaking environment) or EFL (English as a Foreign Language) speakers (who are learning English in a non-English-speaking country.",
        "ficult to compare the results achieved using different approaches.",
        "To address this problem, the aim of the HOO 2012 Shared Task was to provide a forum for the comparative evaluation of different approaches to the correction of these errors.",
        "The shared task provides a common training dataset, a shared evaluation framework, and a set of previously unseen test data.",
        "These proceedings contain detailed reports by all 14 teams who participated in HOO 2012.",
        "The present paper provides a summary of the task and its evaluation, and a report on the results of that evaluation.",
        "Section 2 provides an overview of the task and the timeline across which it was carried out; Section 3 provides details of the participating teams; Section 4 describes the training and test data in more detail; Section 5 presents the results of the evaluation; and Section 6 provides some concluding remarks and discussion, reflecting on lessons learned."
      ]
    },
    {
      "heading": "2 The Task",
      "text": [
        "Non-native speakers who are learning English find prepositions and determiners particularly problematic.",
        "The selection of the appropriate preposition in a given context often appears to be a matter of idiom or convention rather than being governed by a consistent set of rules; and selecting a determiner 2HOO stands for ?Helping Our Own?, a reflection of the historical origins of the exercise as an attempt to develop tools to help researchers in natural language processing to write better papers: see (Dale and Kilgarriff, 2010) for the background to this enterprise and (Dale and Kilgarriff, 2011) for a report on the pilot round of the task held in 2011.",
        "depends on a complex of contextual factors which is particularly challenging for those whose native language does not make use of determiners.",
        "The literature suggests that mistakes in the use of the determiners and prepositions account for 20?50% of grammar and usage errors; the extent to which a learner has problems with determiners varies depending on their native language, while the degree of difficulty experienced with prepositions is less varied (see Chapter 3 in (Leacock et al., 2010)).",
        "For the shared task, we made use of data drawn from the CLC FCE Dataset, a set of 1,244 exam scripts written by candidates sitting the Cambridge ESOL First Certificate in English (FCE) examination in 2000 and 2001, and made available by Cambridge Universiy Press; see (Yannakoudakis et al., 2011).",
        "This data is described in more detail below.",
        "The version of the data we provided to teams as training data consisted of the original text as written by the examination subjects, so it contains many errors besides the preposition and determiner errors; it thus provides a quite realistic challenge, as opposed to artificial data sets where the only errors present are the particular errors of interest.",
        "The training data we provided consisted of the raw, errorful texts, and for each text file a set of gold-standard standoff annotations indicating the locations of the preposition and determiner errors and their corrections, which we extracted from the CUP data annotations.",
        "The task consisted in attempting to generate sets of standoff annotations that matched those in the gold standard.",
        "Teams were to be evaluated on three subtasks: detection, recognition and correction.",
        "The first of these is a measure of a system's success in determining that something is wrong in a text and that it requires fixing; the second requires also that the precise extent of the error be identified, and the correct type assigned; and the third requires that a correction matching that in the gold standard be offered.",
        "Scores on each of these subtasks were computed for preposition and determiner errors combined, and for preposition and determiner errors separately; thus, each participating system run could generate up to nine distinct scores.",
        "In addition, we also provided teams with detection, recognition and correction scores for each of the six base error types (see Table 2); some teams report on these statistics in their individual reports.",
        "The training data and evaluation tools were made available on 27th January 2012; test data was released on April 6th 2012, with submissions of results from teams due on April 13th 2012.",
        "Teams therefore had 10 weeks to develop a system that could handle the training data, and one week to provide results on the test data."
      ]
    },
    {
      "heading": "3 The Participants",
      "text": [
        "At the time we released the training data, 26 teams registered interest in the task.",
        "The test data, receipt of which required a signed agreement with Cambridge University Press, was requested by 15 teams; one of these teams subsequently withdrew",
        "from the competition.",
        "The 14 teams who completed the shared task are listed in Table 1.3"
      ]
    },
    {
      "heading": "4 The Data",
      "text": []
    },
    {
      "heading": "4.1 Basic Statistics",
      "text": [
        "The training data consisted of 1000 files drawn from the publicly available FCE dataset.",
        "These were converted from the native FCE format into the HOO data format, which was slightly revised from the version used in HOO 2011 (see (Dale and Kilgarriff, 2011)).",
        "The original data was marked up with all the errors found by the CUP annotator, but we discarded annotations of errors other than the six base types we were interested in, and converted the remaining errors into standoff annotations.",
        "The six types, with examples of each, are shown in Table 2;4 Figure 1 shows a fragment of an FCE data file, and Figure 2 shows a standoff annotation example extracted from this file in the HOO format.",
        "Elements of some of these files were removed to dispose of nested edits and other phenomena that caused difficulties in the preprocessing of the data.",
        "The resulting set of training data comprised a total of 374680 words, for an average of 375 words per file.",
        "The test data consisted of a further 100 previously unseen files provided to us for this shared task by CUP.",
        "These were processed in the same manner as the training data.",
        "The test data comprised 18013 words, for an average of 180 words per file.",
        "Counts",
        "of the different error types in the training and test data are provided in Table 3, demonstrating that the error rate remained fairly constant across training and test data.",
        "However, whereas the training data included information on author's first language (L1) and age range, the L1 information was not present in the test data, thus removing a potentially useful feature that some teams may have hoped to exploit."
      ]
    },
    {
      "heading": "4.2 Revisions to the Gold-Standard Data",
      "text": [
        "Note that Table 3 shows counts for two versions of the gold-standard test data: the original version as derived from the CUP-provided data set (?Test A?",
        "), and a revised version (?Test B?)",
        "which incorporates corrections to errors found in the annotations.",
        "The evaluation process quickly revealed that there appeared to be cases of annotation error in the original test data.",
        "This concerned us because it meant that system performance was being under-reported:",
        "in particular, systems were identifying real errors in the source texts which had not been annotated in the gold standard, and were consequently being penalised for finding spurious errors which were not in fact spurious.",
        "To address this problem, once teams had submitted their results, we allowed a brief period where teams could review the gold-standard data to identify possible corrections to that data.",
        "Table 4 shows the number of revisions requested by each team, and the number of these revisions that were accepted.",
        "Note that there were a significant number of revisions (99) that were requested by more than one team, so the total count of revision requests is larger than the actual number of revisions considered.",
        "Of the total 357 requests, 205 were acted on, in some cases not in the manner requested by the team; 152 requests led to no changes being made to the annotations.",
        "Note that the teams?",
        "original sets of submitted edits were compared against this revised gold standard, so there was no sense in which a system's behaviour could be tuned to the test data.",
        "However, clearly any given team might stand to benefit from identifying particular errors their system had identified that were not in the gold standard, effectively tuning the test data to system behaviour.",
        "Consequently, we provide results below for both the original and the revised data sets, and briefly discuss the impact of these corrections."
      ]
    },
    {
      "heading": "5 Results",
      "text": [
        "Each team was allowed to submit up to 10 separate ?runs?",
        "over the test data, thus allowing them to",
        "have different configurations of their systems evaluated; the number of runs submitted by each team is shown in Table 1.",
        "We report here only on the best-performing runs from each team.",
        "Teams were asked to indicate whether they had used only publicly-available data to train their systems, or whether they had made use of privately-held data: only the ET and CU teams used privately-held data, and in the latter case only for a subset of their runs.",
        "In the tabulated results provided here, reported runs that involve privately-held data are marked with an asterisk.",
        "The results of the evaluation are provided here in six tables.",
        "Tables 5 and 6 provide results for preposition and determiner errors combined; Tables 7 and 8 provide results for preposition errors only; and Tables 9 and 10 provide results for determiner errors only.",
        "In each pair, the first table shows results before the revisions described in Section 4.2 were carried out, and the second table shows the results using the revised gold-standard data.",
        "Each table shows precision, recall and F-score (computed as the harmonic mean) for each of detection, recognition and correction; for each of these, the best score is shown in bold.6 Note that team ET did not participate in the correction subtask.",
        "The scores for all teams improve as a consequence of the revisions being made to the data.",
        "The result of a paired t-test on the ?before?",
        "and ?after?",
        "combined preposition and determiner scores across teams was statistically significant (t = ?3.17, df(12), p < .01);",
        "mented in the evaluation tool, and further details on the evaluation process, are provided in (Dale and Narroway, 2012) and elaborated on at the HOO website at",
        "F-scores improved by a mean value of 2.32.",
        "The same analyses for preposition scores also resulted in significant improvement (t = ?3.29, df(12), p < .01), with a mean improvement in F-scores of 2.6.",
        "A smaller (but still statistically significant) improvement in determiner scores was also present (t = ?2.86, df(12), p < .05), with a mean improvement in F-scores of 1.99.",
        "There are also positive correlations between the rankings before and after revisions.",
        "Pearson correlation coefficients for the ?before?",
        "and ?after?",
        "scores for prepositions and determiners combined, prepositions only, and determiners only (respectively) are .993, .985 and .996.",
        "All correlation coefficients are significant at p < .001, n = 13 (teams).",
        "However, some systems improve more than others.",
        "An obvious question to ask, then, is whether the benefit that a team achieves is positively correlated with the number of accepted corrections they proposed; a calculation of Pearson's correlation coefficient suggests that this is indeed the case (r = 0.821, p = 0.044 (one-tailed)).7 This suggests, then, that the ?before?",
        "results may be a more reliable indicator of comparative performance."
      ]
    },
    {
      "heading": "6 Discussion and Conclusions",
      "text": [
        "In this section, we make some observations on lessons learned with regard to various aspects of the shared task."
      ]
    },
    {
      "heading": "6.1 Data Acquisition",
      "text": [
        "Data annotated with non-native speaker errors has significant commercial value, and so is not easy to find in the public domain.",
        "We were fortunate to be able to take advantage of the recently-made-available FCE dataset as training data, but this left us with the problem of acquiring previously unseen test data.",
        "To address this, we entered into negotiation with Cambridge University Press with the aim of acquiring some additional previously unreleased data.",
        "We started this process in December 2011, but it quickly became apparent that some of the legal aspects would necessarily make this a slow process.",
        "7Computed here on the combined preposition and determiner scores, and taking account only of the five teams that proposed corrections, these being UI, NU, LE, UT and CU.",
        "ET was not included in this calculation since they did not submit to the corrections subtask.",
        "As a backup plan, we informed teams that we might have to fall back on some of the already-available FCE data as test data; to this end, we asked teams only to use versions and subsets of the FCE data that we made directly available.",
        "We thus selected 1000 files from the 1200 that make up the public FCE data set as training data, and reserved the remainder as a source of possible test data.",
        "This is clearly not an ideal situation; fortunately, we finally signed agreements for the use of a new set of FCE data in the week before the test data was due to be released, but this was leaving things rather tight.",
        "The moral here is that one needs to be confident of one's data sources early on in the process."
      ]
    },
    {
      "heading": "6.2 Data Quality",
      "text": [
        "As discussed above, it became apparent that there were what appeared to be annotation errors in our data.",
        "This is perhaps inevitable given the nature of the source data, which was annotated by only one annotator (subsequent to some prior automatic processing).",
        "The issue of reliability of annotation in this area has been noted by others (see, for example, the discussion in Chapter 5 in (Leacock et al., 2010)).",
        "Assuming that we agree an error is present?and this is not always in itself straightforward?there is often more than one way to correct that error; however, the FCE annotation scheme does not permit multiple possible corrections, so in the source data we used, there was only ever one correction per error.",
        "Our revision process identified a number of cases where alternative corrections were equally acceptable, and fortunately the HOO annotation scheme allowed us to incorporate multiple possible corrections; but it's quite clear that we did not identify all cases where multiple corrections were valid.8 This is a significant issue.",
        "If we cannot entirely trust our gold-standard data, then we cannot place too much trust in the results of evaluations carried out using that data.",
        "Of course, annotation quality is a problem in any task, but it may be more severe in cases like the present one because the judgements here are often less clear cut: whereas there is rarely dispute as to whether a given string constitutes a named entity, it is not always so clear that 8The HOO scheme also allows optional edits, but we did not make use of these here since it complicates the scoring process; see (Dale and Kilgarriff, 2011) for discussion.",
        "something is an error, or where that error should be located.",
        "The incorporation of optional and multiple corrections in the HOO framework was intended to address this kind of problem, but the value of these features is only delivered if the scheme is used during annotation, rather than being applied after annotation has already been carried out."
      ]
    },
    {
      "heading": "6.3 The Annotation Scheme and Evaluation Tools",
      "text": [
        "Given real non-native speaker data that contains a wide range of errors other than those that we were particularly concerned with in this shared task, we were faced with three alternatives in how we prepared the data for use in the task.",
        "1.",
        "We could provide the data with all original errors in place.",
        "2.",
        "We could provide the data with all but the preposition and determiner errors corrected.",
        "3.",
        "We could provide the data with selected errors corrected or replaced.",
        "The problem with the first of these options, of course, is that other errors that appear in the context",
        "of a preposition or determiner error could confuse a system focussed only on preposition or determiner errors; if the surrounding context contains errors, then it cannot be relied upon to deliver the kinds of features that one would expect to find in well-formed text.",
        "To partially address this, many teams ran a spelling correction process on the texts prior to applying their techniques; but this only catches a small proportion of the potential problems.",
        "However, the second option has the opposite problem: by removing all the other errors from the text, we would be providing a very artificial dataset where one assumes some other process has fixed all the other errors before the errors of interest here are addressed.",
        "While there are some types of errors that might sensibly be addressed before others in a pipeline, in general this is not a very plausible model; any real system is going to have to address noisy data containing many different kinds of errors simultaneously.",
        "A third alternative, that of selectively removing or correcting errors, is something of a middle road, and has been used in other work using the CLC data: in particular, Gamon (2010) removes from the data sentences where some other error appears immediately next to a preposition or determiner error.",
        "In the end, we opted for the first alternative here, on the grounds that this is the best approximation to the real task of non-native speaker error correction.",
        "The third alternative would also have been possible, but we were concerned about the impact on the size of our test data set that would result from carrying out this process across the board.",
        "However, in the revision step described in Section 4.2, we did remove instances of a particular error type, where a preposition error was immediately followed by a verb error; consider the following sentence and its correction.",
        "(1) a.",
        "What do you do for trying to save the wild life?",
        "b.",
        "What do you do to try to save the wild life?",
        "The compound nature of these errors meant that teams were unlikely to correct them; and it might be argued that they are not preposition errors in the conventional sense.",
        "However, we did not remove these instances uniformly, so some still remain in the test data.",
        "An orthogonal issue with regard to the HOO annotation scheme is that we require precise identification of error locations and accurate specification of these locations at a character-offset level in our",
        "standoff edit notation.",
        "It is often inaccuracies at this level that contribute to the differences between a team's detection score and the corresponding recognition score.",
        "While precise character offset information is important for some error correction tasks (for example, one would not want an automated corrector to insert corrections misplaced by one character), arguably it is too strict in the present circumstances.",
        "Dahlmeier and Ng (2012) propose an alternative evaluation scheme which, along with other properties, overcomes this by operating in terms of tokens rather than character offsets."
      ]
    },
    {
      "heading": "6.4 Summary",
      "text": [
        "Overall, we were immensely pleased with the level of interest in this shared task.",
        "The HOO 2012 training data and evaluation tools are publicly available, so interested parties who did not take part in the shared task can still try their hand retrospectively; unfortunately, our contract with CUP means that the test data used in this round is not publicly available.",
        "Our future plans include packaging a subset of the initially held-out public FCE data set as a new test set, with the aim of establishing a standardised training and testing setup in the same way as Section 23 of the Wall Street Journal corpus is conventionally used as a test set.",
        "We have strongly encouraged the use of publicly available data sets, and have asked teams to be as detailed as possible in their reports in the interests of replicability; we hope this will make it possible for new entrants to the area to get up to speed quickly.",
        "Of course, the FCE data also supports work on many other kinds of errors.",
        "We expect to address subsets of these in future HOO rounds."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We?d like to acknowledge the kind assistance of various people in making this shared task possible: Ted Briscoe for seeding the enterprise by working to make the FCE data publicly available; Diane Nicholls and Adam Kilgarriff for encouragement and advice along the way; Ann Fiddes at Cambridge University Press for providing the previously unseen test data; Richard Cox for statistics; and Joel Tetreault, Claudia Leacock and Jill Burstein for agreeing to host the shared task at the Building Educational Applications Workshop.",
        "Macquarie University provided financial support via a Research Development Grant.",
        "Finally, of course, we?d like to thank all the teams for participating."
      ]
    }
  ]
}
