{
  "info": {
    "authors": [
      "Alexander Panchenko",
      "Olga Morozova"
    ],
    "book": "Proceedings of the Workshop on Innovative Hybrid Approaches to the Processing of Textual Data",
    "id": "acl-W12-0502",
    "title": "A Study of Hybrid Similarity Measures for Semantic Relation Extraction",
    "url": "https://aclweb.org/anthology/W12-0502",
    "year": 2012
  },
  "references": [
    "acl-C92-2082",
    "acl-L08-1139",
    "acl-L08-1204",
    "acl-N04-3012",
    "acl-P09-1031",
    "acl-P94-1019",
    "acl-P98-2127",
    "acl-W02-0908",
    "acl-W02-1029",
    "acl-W03-0415",
    "acl-W06-2501",
    "acl-W11-2501"
  ],
  "sections": [
    {
      "text": [
        "Center for Natural Language Processing (CENTAL) Universite?",
        "catholique de Louvain, Belgium"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "This paper describes several novel hybrid semantic similarity measures.",
        "We study various combinations of 16 baseline measures based on WordNet, Web as a corpus, corpora, dictionaries, and encyclopedia.",
        "The hybrid measures rely on 8 combination methods and 3 measure selection techniques and are evaluated on (a) the task of predicting semantic similarity scores and (b) the task of predicting semantic relation between two terms.",
        "Our results show that hybrid measures outperform single measures by a wide margin, achieving a correlation up to 0.890 and MAP(20) up to 0.995."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Semantic similarity measures and relations are proven to be valuable for various NLP and IR applications, such as word sense disambiguation, query expansion, and question answering.",
        "Let R be a set of synonyms, hypernyms, and co-hyponyms of terms C, established by a lexicographer.",
        "A semantic relation extraction method aims at discovering a set of relations R?",
        "approximating R. The quality of the relations provided by existing extractors is still lower than the quality of the manually constructed relations.",
        "This motivates the development of new relation extraction methods.",
        "A well-established approach to relation extraction is based on lexico-syntactic patterns (Auger and Barrie`re, 2008).",
        "In this paper, we study an alternative approach based on similarity measures.",
        "These methods do not return a type of the relation between words (R?",
        "?",
        "C ?",
        "C).",
        "However, we assume that the methods should retrieve a mix of synonyms, hypernyms, and co-hyponyms for practical use in text processing applications and evaluate them accordingly.",
        "A multitude of measures was used in the previous research to extract synonyms, hypernyms, and co-hyponyms.",
        "Five key approaches are those based on a distributional analysis (Lin, 1998b), Web as a corpus (Cilibrasi and Vitanyi, 2007), lexico-syntactic patterns (Bollegala et al., 2007), semantic networks (Resnik, 1995), and definitions of dictionaries or encyclopedias (Zesch et al., 2008a).",
        "Still, the existing approaches based on these single measures are far from being perfect.",
        "For instance, Curran and Moens (2002) compared distributional measures and reported Precision@1 of 76% for the best one.",
        "For improving the performance, some attempts were made to combine single measures, such as (Curran, 2002; Ceder-berg and Widdows, 2003; Mihalcea et al., 2006; Agirre et al., 2009; Yang and Callan, 2009).",
        "However, most studies are still not taking into account the whole range of existing measures, combining mostly sporadically different methods.",
        "The main contribution of the paper is a systematic analysis of 16 baseline measures, and their combinations with 8 fusion methods and 3 techniques for the combination set selection.",
        "We are first to propose hybrid similarity measures based on all five extraction approaches listed above; our combined techniques are original as they exploit all key types of resources usable for semantic relation extraction ?",
        "corpus, web corpus, semantic networks, dictionaries, and encyclopedias.",
        "Our experiments confirm that the combined measures are more precise than the single ones.",
        "The best found hybrid measure combines 15 baseline measures with the supervised learning.",
        "It outperforms",
        "based on similarity measures.",
        "all tested single and combined measures by a large margin, achieving a correlation of 0.870 with human judgements and MAP(20) of 0.995 on the relation recognition task."
      ]
    },
    {
      "heading": "2 Similarity-based Relation Extraction",
      "text": [
        "In this paper a similarity-based relation extraction method is used.",
        "In contrast to the traditional approaches, relying on a single measure, our method relies on a hybrid measure (see Figure 1).",
        "A hybrid similarity measure combines several single similarity measures with a combination method to achieve better extraction results.",
        "To extract relations R?",
        "between terms C, the method calculates pairwise similarities between them with the help of a similarity measure.",
        "The relations are established between each term c ?",
        "C and the terms most similar to c (its nearest neighbors).",
        "First, a term-term (C ?",
        "C) similarity matrix S is calculated with a similarity measure sim, as depicted in Figure 1 (a).",
        "Then, these similarity scores are mapped to the interval [0; 1] with a norm function as follows: S?",
        "= S?min(S)max(S) .",
        "Dissimilarity scores are transformed into similarity scores: S?",
        "= 1 ?",
        "norm(S).",
        "Finally, the knn function calculates semantic relations between terms with a k-NN thresholding: R?",
        "= ?|C| i=1 {?ci, cj?",
        ": (cj ?",
        "top k% of ci) ?",
        "(sij > 0)} .",
        "Here, k is a percent of top similar terms to a term ci.",
        "Thus, the method links each term ci with k% of its nearest neighbours."
      ]
    },
    {
      "heading": "3 Single Similarity Measures",
      "text": [
        "A similarity measure extracts or recalls a similarity score sij ?",
        "S between a pair of terms ci, cj ?",
        "C. In this section we list 16 baseline measures exploited by hybrid measures.",
        "The measures were selected as (a) the previous research suggests that they are able to capture synonyms, hypernyms, and co-hyponyms; (b) they rely on all main resources used to derive semantic similarity ?",
        "semantic networks, Web as a corpus, traditional corpora, dictionaries, and encyclopedia."
      ]
    },
    {
      "heading": "3.1 Measures Based on a Semantic Network",
      "text": [
        "We test 5 measures relying on WORDNET semantic network (Miller, 1995) to calculate the similarities: Wu and Palmer (1994) (1), Leacock and Chodorow (1998) (2), Resnik (1995) (3), Jiang and Conrath (1997) (4), and Lin (1998a) (5).",
        "These measures exploit the lengths of the shortest paths between terms in a network and probability of terms derived from a corpus.",
        "We use implementation of the measures available in WORD-NET::SIMILARITY (Pedersen et al., 2004).",
        "A limitation of these measures is that similarities can only be calculated upon 155.287 English terms from WordNet 3.0.",
        "In other words, these measures recall rather than extract similarities.",
        "Therefore, they should be considered as a source of common lexico-semantic knowledge for a hybrid semantic similarity measure."
      ]
    },
    {
      "heading": "3.2 Web-based Measures",
      "text": [
        "Web-based metrics use Web search engines for calculation of similarities.",
        "They rely on the number of times the terms co-occur in the documents as indexed by an information retrieval system.",
        "We use 3 baseline web measures based on index of YAHOO!",
        "(6), BING (7), and GOOGLE over the domain wikipedia.org (8).",
        "These three measures exploit Normalized Google Distance (NGD) formula (Cilibrasi and Vitanyi, 2007) for transforming the number of hits into a similarity score.",
        "Our own system implements BING measure, while Measures of Semantic Relatedness (MSR) web service1 calculates similarities with YAHOO!",
        "and GOOGLE.",
        "The coverage of languages and vocabularies by web-based measures is huge.",
        "Therefore, it is assumed that they are able to extract new lexico-semantic knowledge.",
        "Web-based measures are"
      ]
    },
    {
      "heading": "3.3 Corpus-based Measures",
      "text": [
        "We tested 5 measures relying on corpora to calculate similarity of terms: two baseline distributional measures, one novel measure based on lexico-syntactic patterns, and two other baseline measures.",
        "Each of them uses a different corpus.",
        "Corpus-based measures are able to extract similarity between unknown terms.",
        "Extraction capabilities of these measures are limited by a corpus.",
        "If terms do not occur in a text, then it would be impossible to calculate similarities between them.",
        "Distributional Measures These measures are based on a distributional analysis of a 800M tokens corpus WACYPE-DIA (Baroni et al., 2009) tagged with TREETAGGER and dependency-parsed with MALTPARSER.",
        "We rely on our own implementation of two distributional measures.",
        "The distributional measure (9) performs Bag-of-words Distributional Analysis",
        "(BDA) (Sahlgren, 2006).",
        "We use as features the 5000 most frequent lemmas (nouns, adjectives, and verbs) from a context window of 3 words, excluding stopwords.",
        "The distributional measure (10) performs Syntactic Distributional Analysis (SDA) (Lin, 1998b).",
        "For this one, we use as",
        "features the 100.000 most frequent dependency-lemma pairs.",
        "In our implementation of SDA a term ci is represented with a feature ?dtj , wk?, if wk is not in a stoplist and dtj has one of the following dependency types: NMOD, P, PMOD, ADV, SBJ, OBJ, VMOD, COORD, CC, VC, DEP, PRD, AMOD, PRN, PRT, LGS, IOBJ, EXP, CLF, GAP .",
        "For both BDA and SDA: the feature matrix is normalized with PointwiseMutual Information; similarities between terms are calculated with a cosine between their respective feature vectors.",
        "Pattern-based Measure We developed a novel similarity measure Pat-ternWiki (13), which relies on 10 lexico-syntactic patterns.",
        "2 First, we apply the patterns to the WA-CYPEDIA corpus and get as a result a list of concordances (see below).",
        "Next, we select the concordances which contain at least two terms from the input vocabulary C. The semantic similarity sij between each two terms ci, cj ?",
        "C is equal to the number of their co-occurences in the same concordance.",
        "The set of the patterns we used is a compilation",
        "of the 6 classical Hearst (1992) patterns, aiming at the extraction of hypernymic relations, as well as 3 patterns retrieving some other hypernyms and co-hyponyms and 1 synonym extraction pattern, which we found in accordance with Hearst's pattern discovery algorithm.",
        "The patterns are encoded in a form of finite-state transducers with the help of a corpus processing tool UNITEX 3 (Pau-mier, 2003).",
        "The main graph is a cascade of the subgraphs, each of which encodes one of the patterns.",
        "For example, Figure 2 presents the graph which extracts, e. g.: ?",
        "such diverse {[occupations]} as {[doctors]}, {[engineers]} and {[scientists]}[PATTERN=1] Figure brackets mark the noun phrases, which are in the semantic relation, nouns and compound nouns stand between the square brackets.",
        "Uni-tex enables the exclusion of meaningless adjectives and determiners out of the tagging, while the patterns containing them are still being recognized.",
        "So, the notion of a pattern has more general sense with respect to other works such as (Bollegala et al., 2007), where each construction with a different lexical item, a word form or even a punctuation mark is regarded as a unique pattern.",
        "The nouns extracted from the square brackets are lemmatized with the help of DELA dictionary4, which consists of around 300,000 simple and 130,000 compound words.",
        "If the noun to extract is a plural form of a noun in the dictionary, then it is rewritten into the respective singular form.",
        "Semantic similarity score is equal to the number of co-occurences of terms in the square brackets within the same concordance (the number of extractions between the terms).",
        "Other Corpus-based Measures In addition to the three measures presented above, we use two other corpus-based measures available via the MSR web service.",
        "The measure (11) relies on the Latent Semantic Analysis (LSA) (Landauer and Dumais, 1997) trained on the TASA corpus (Veksler et al., 2008).",
        "LSA calculates similarity of terms with a cosine between their respective vectors in the ?concept space?.",
        "The measure (12) relies on the NGD formula (see Section 3.2), where counts are derived from the Factiva corpus (Veksler et al., 2008)."
      ]
    },
    {
      "heading": "3.4 Definition-based Measures",
      "text": [
        "We test 3 measures which rely on explicit definitions of terms specified in dictionaries.",
        "The first metric WktWiki (14) is a novel similarity measure that stems from the Lesk algorithm (Pedersen et al., 2004) and the work of Zesch et al. (2008a).",
        "WktWiki operates on Wiktionary definitions and relations and Wikipedia abstracts.",
        "WktWiki calculates similarity as follows.",
        "First, definitions for each input term c ?",
        "C are built.",
        "A ?definition?",
        "is a union of all available glosses, examples, quotations, related words, and categories from Wiktionary and a short abstract of the corresponding Wikipedia article (a name of the article must exactly match the term c).",
        "We use all senses corresponding to a surface form of term c. Then, each term c ?",
        "C of the 1000 most frequent lemmas is represented as a bag-of-lemma vector, derived from its ?definition?.",
        "Feature vectors are normalized with Pointwise Mutual Information and similarities between terms are calculated with a cosine between them.",
        "Finally, the pairwise similarities between terms S are corrected.",
        "The highest similarity score is assigned to the pairs of terms which are directly related in Wiktionary.",
        "5 WktWiki is different to the work of Zesch et al. (2008b) in three aspects: (a) terms are represented in a word space, and not in a document space;",
        "(b) both texts from Wiktionary and Wikipedia are used; (c) relations of Wiktionary are used to up",
        "date similarity scores.",
        "In addition to WktWiki, we operate with 2 baseline measures relying on WordNet glosses available in a WORDNET::SIMILARITY package: Gloss Vectors (Patwardhan and Pedersen, 2006)",
        "Wiktionary and DBpedia.org as a source of Wikipedia short abstracts (dumps were downloaded in October 2011).",
        "(15) and Extended Lesk (Banerjee and Pedersen, 2003) (16).",
        "The key difference between WktWiki and WordNet-based measures is that the latter uses definitions of related terms.",
        "Extraction capabilities of definition-based measures are limited by the number of available definitions.",
        "As of October 2011, WordNet contains 117.659 definitions (glosses); Wiktionary contains 536.594 definitions in English and 4.272.902 definitions in all languages; Wikipedia has 3.866.773 English articles and around 20.8 millons of articles in all languages."
      ]
    },
    {
      "heading": "4 Hybrid Similarity Measures",
      "text": [
        "A hybrid similarity measure combines several single similarity measures described above with one of the combination methods described below."
      ]
    },
    {
      "heading": "4.1 Combination Methods",
      "text": [
        "A goal of a combination method is to produce similarity scores which perform better than the scores of input single measures.",
        "A combination method takes as an input a set of similarity matrices {S1, .",
        ".",
        ".",
        ",SK} produced by K single measures and outputs a combined similarity matrix Scmb.",
        "We denote as skij a pairwise similarity score of terms ci and cj produced by k-th measure.",
        "We test the 8 following combination methods: Mean.",
        "A mean ofK pairwise similarity scores:",
        "Mean-Nnz.",
        "A mean of those pairwise similarity scores which have a non-zero value:",
        "where ?k is a mean and ?k is a standard deviation of similarity scores of k-th measure (Sk).",
        "Median.",
        "A median of K pairwise similarities: scmbij = median(s1ij , .",
        ".",
        ".",
        ", sKij ).",
        "Max.",
        "A maximum of K pairwise similarities: scmbij = max(s1ij , .",
        ".",
        ".",
        ", sKij ).",
        "Rank Fusion.",
        "First, this combination method converts each pairwise similarity score skij to a rank rkij .",
        "Here, rkij = 5 means that term cj is the 5-th nearest neighbor of the term ci, according to the k-th measure.",
        "Then, it calculates a combined similarity score as a mean of these pairwise ranks:",
        "Relation Fusion.",
        "This combination method gathers and unites the best relations provided by each measure.",
        "First, the method retrieves relations extracted by single measures with the function knn described in Section 2.",
        "We have empirically chosen an ?internal?",
        "kNN threshold of 20% for this combination method.",
        "Then, a set of extracted relations Rk, obtained from the k-th measure, is encoded as an adjacency matrix Rk .",
        "An element of this matrix indicates whether terms ci and cj are related:",
        "The final similarity score is a mean of adjacency matrices: Scmb = 1K",
        "sures are combined and the first extracted the relation between ci and cj , while the second did not, then the similarity sij will be equal to 0.5.",
        "Logit.",
        "This combination method is based on logistic regression (Agresti, 2002).",
        "We train a binary classifier on a set of manually constructed semantic relations R (we use BLESS and SN datasets described in Section 5).",
        "Positive training examples are ?meaningful?",
        "relations (synonyms, hyponyms, etc.",
        "), while negative training examples are pairs of semantically unrelated words (generated randomly and verified manually).",
        "A semantic relation ?ci, cj?",
        "?",
        "R is represented with a vector of pairwise similarities between terms ci, cj calculated with K measures (s1ij , .",
        ".",
        ".",
        ", sKij ) and a binary variable rij (category):",
        "For evaluation purposes, we use a special 10-fold cross validation ensuring that all relations of one term c are always in the same training/test fold.",
        "The results of the training are K + 1 coefficients of regression (w0, w1, .",
        ".",
        ".",
        ", wK).",
        "We apply the model to combine similarity measures as follows:"
      ]
    },
    {
      "heading": "4.2 Combination Sets",
      "text": [
        "Any of the 8 combination methods presented above may combine from 2 to 16 single measures.",
        "Thus, there are",
        "single measures to use in a combination method.",
        "We apply three methods to find an efficient combination of measures in this search space: expert choice of measures, forward stepwise procedure, and analysis of a logistic regression model.",
        "Expert choice of measures is based on the analytical and empirical properties of the measures.",
        "We chose 5 or 9 measures which perform well and rely on complimentary resources: corpus, Web, WordNet, etc.",
        "Additionally, we selected a group of all measures except for one which has shown the worst results on all datasets.",
        "Thus, according to this selection method we have chosen three groups of measures (see Section 3 and Table 1 for notation):",
        "Forward stepwise procedure is a greedy algorithm which works as follows.",
        "It takes as an input all measures, a method of their combination such as Mean, and a criterion such as Precision at k = 50.",
        "It starts with a void set of measures.",
        "Then, at each iteration it adds to the combination one measure which brings the biggest improvement to the criterion.",
        "The algorithm stops when no measure can improve the criteria.",
        "According",
        "to this method, we have chosen four groups of the",
        "The last measure selection technique is based on analysis of logistic regression trained on all 16 measures as features.",
        "Only measures with positive coefficients are selected.",
        "According to this method, 12 measures were chosen: ?",
        "R12 = {3, 5, 6, 8 ?",
        "16} We test combination methods on the 8 sets of measures specified above.",
        "Remarkably, all three selection techniques constantly choose six following measures ?",
        "9, 10, 11, 14, 15, 16, i. e., C-BowDA, C-SynDA, C-LSA-Tasa, D-WktWiki, N-GlossVectors, and N-ExtendedLesk."
      ]
    },
    {
      "heading": "5 Evaluation",
      "text": [
        "Evaluation relies on human judgements about semantic similarity and on manually constructed semantic relations.",
        "7 Human Judgements Datasets.",
        "This kind of ground truth enables direct assessment of measure performance and indirect assessment of extraction quality with this measure.",
        "Each of these datasets consists of N tuples ?ci, cj , sij?, where ci, cj are terms, and sij is their similarity obtained by human judgement.",
        "We use three standard human judgements datasets ?",
        "MC (Miller and Charles, 1991), RG (Rubenstein and Goodenough, 1965) and WordSim353 (Finkelstein et al., 2001), composed of 30, 65, and 353 pairs of terms respectively.",
        "Let s = (si1, si2, .",
        ".",
        ".",
        ", siN ) be a vector of ground truth scores, and s?",
        "= (s?i1, s?i2, .",
        ".",
        ".",
        ", s?iN ) be a vector of similarity scores calculated with a similarity measure.",
        "Then, the quality of this measure is assessed with Spearman's correlation between s and s?.",
        "Semantic Relations Datasets.",
        "This kind of ground truth enables indirect assessment of measure performance and direct assessment of",
        "extraction quality with the measure.",
        "Each of these datasets consists of a set of semantic relations R, such as ?agitator, syn, activist?, ?hawk , hyper, predator?, ?gun, syn,weapon?, and ?dishwasher, cohypo, reezer?.",
        "Each ?target?",
        "term has roughly the same number of meaningful and random relations.",
        "We use two semantic relation datasets: BLESS (Baroni and Lenci, 2011) and SN.",
        "The first is used to assess hypernyms and co-hyponyms extraction.",
        "BLESS relates 200 target terms (100 animate and 100 inanimate nouns) to 8625 relatum terms with 26554 semantic relations (14440 are meaningful and 12154 are random).",
        "Every relation has one of the following types: hypernym, co-hyponym, meronym, attribute, event, or random.",
        "We use the second dataset to evaluate synonymy extraction.",
        "SN relates 462 target terms (nouns) to 5910 relatum terms with 14682 semantic relations (7341 are meaningful and 7341 are random).",
        "We built SN from WordNet, Roget's thesaurus, and a synonyms database 8.",
        "This kind of evaluation is based on the number of correctly extracted relations with the method described in Section 2.",
        "Let R?k be a set of extracted semantic relations at a certain level of the kNN threshold k. Then, precision, recall, and mean average precision (MAP) at k are calculated correspondingly as follows: P (k) =",
        "The quality of a similarity measure is assessed with the six following statistics: P (10), P (20), P (50), R(50), M(20), and M(50)."
      ]
    },
    {
      "heading": "6 Results",
      "text": [
        "Table 1 and Figure 3 present performance of the single and hybrid measures on the five ground truth datasets listed above.",
        "The first three columns of the table contain correlations with human judgements, while the other columns present performance on the relation extraction task.",
        "The first part of the table reports on scores of 16 single measures.",
        "Our results show that the measures are indeed complimentary ?",
        "there is no measure which performs best on all datasets.",
        "For instance, the measure based on a syntactic distributional analysis C-SynDA performed best on the MC dataset achieving a correlation of 0.790; the WordNet measure WN-LeacockChodorow achieved the top score of 0.789 on the RG dataset;",
        "measure H-Logit-E15; (b) 8 hybrid measures.",
        "the corpus based measure C-NGD-Factiva was best on the WordSim353 dataset, achieving a correlation of 0.600.",
        "On the BLESS dataset, syntactic distributional analysis C-SynDA performed best for high precision among single measures achieving MAP(20) of 0.984, while the bag-of-words distributional measure C-BowDA was the best for high recall with R(50) of 0.772.",
        "On the SN dataset, the WordNet-based measure N-WuPalmer was best both for precision and recall.",
        "The second part of Table 1 presents performance of the hybrid measures.",
        "Our results show that if signals from complimentary resources are used, then the retrieval of semantically similar words is significantly improved.",
        "Most of the hybrid measures outperform the single measures on all the datasets.",
        "We tested each of the 8 combination methods presented in Section 4.1 with each of the 8 sets of measures specified in Section 4.2.",
        "We report on the best metrics among all 64 hybrid measures.",
        "A notion H-Mean-S8a means that the Mean combination method provides the best results with the set of measures S8a.",
        "Measures based on the mean of non-zero similarities H-MeanNnz-S8a and H-MeanNnz-E5 performed best on MC and WordSim353 datasets respectively.",
        "They achieved correlations of 0.878 and 0.740, which is higher than scores of any other measure.",
        "At the same time, measure H-MeanZscore-S8b provided the best scores on the RG dataset among all single and hybrid measures, achieving correlation of 0.890.",
        "Supervised measure H-Logit-E15 based on Logistic Regression provided the very best results on both semantic relations datasets BLESS and SN.",
        "Furthermore, it outperformed all single and hybrid measures on that task, in terms of both precision and recall, achieving MAP(20) of 0.995 and R(50) of 0.818 on BLESS and MAP(20) of 0.993 and R(50) of 0.819 on SN.",
        "H-Logit-E15 makes use of 15 similarity measures and disregards only the worst single measure W-NGD-Bing.",
        "As we can see in Figure 3 (b), combining similarity scores with a Max function appears to be the worst solution.",
        "Combination methods based on an average and a median, including Rank and Relation Fusion, perform much better.",
        "These methods provide quite similar results: in the high precision range, they perform nearly as well as a supervised combination.",
        "Relation Fusion even manages to slightly outperform Logit on the first 10-15 k-NN (see Figure 3).",
        "However, all unsupervised combination methods are significantly worse if higher recall is needed.",
        "We conclude that the H-Logit-E15 is the best hybrid similarity measure for semantic relation extraction and in terms of plausibility with human judgements among all single and hybrid measures examined in this paper."
      ]
    },
    {
      "heading": "7 Discussion",
      "text": [
        "Hybrid measures achieve higher precision and recall than single measures.",
        "First, it is due to the reuse of common lexico-semantic information (such as that a ?car?",
        "is a synonym of a ?vehicle?)",
        "via knowledge-and definition-based measures.",
        "Measures based on WordNet and dictionary definitions achieve high precision as they rely on fine-grained manually constructed resources.",
        "However, due to limited coverage of these resources,",
        "bold; the very best scores are in grey.",
        "Correlations in italics mean p > 0.05, otherwise p ?",
        "0.05. they only can determine relations between a limited number of terms.",
        "On the other hand, measures based on web and corpora are nearly unlimited in their coverage, but provide less precise results.",
        "Combination of the measures enables keeping high precision for frequent terms (e. g., ?disease?)",
        "present in WordNet and dictionaries, and empowers calculation of relations between rare terms unlisted in the handcrafted resources (e. g., ?bronchocele?)",
        "with web and corpus measures.",
        "Second, combinations work well because, as it was found in previous research (Sahlgren, 2006; Heylen et al., 2008), different measures provide complementary types of semantic relations.",
        "For instance, WordNet-based measures score higher hypernyms than associative relations; distributional analysis score high co-hyponyms and synonyms, etc.",
        "In that respect, a combination helps to recall more different relations.",
        "For example, a WordNet-based measure may return a hypernym ?salmon, seafood?, while a corpus-based measure would extract a co-hyponym ?salmon, mackerel?.",
        "Finally, the supervised combination method works better than unsupervised ones because of two reasons.",
        "First, the measures generate scores which have quite different distributions on the range [0; 1].",
        "The averaging of such scores may be suboptimal.",
        "Logistic Regression overcomes this issue by assigning appropriate weights (w1, .",
        ".",
        ".",
        ", wk) to the measures in the linear combination z.",
        "Second, training procedure enables the model to assign higher weights to the measures which provide better results, while for the methods based on averaging all weight are equal."
      ]
    },
    {
      "heading": "8 Conclusion",
      "text": [
        "In this work, we designed and studied several hybrid similarity measures in the context of semantic relation extraction.",
        "We have undertaken a systematic analysis of 16 baseline measures, 8 combination methods, and 3 measure selection techniques.",
        "The combined measures were thoroughly evaluated on five ground truth datasets: MC, RG, WordSim353, BLESS, and SN.",
        "Our results have shown that the hybrid measures outperform the single measures on all datasets.",
        "In particular, a combination of 15 baseline corpus, web-, network-, and dictionary-based measures with Logistic Regression provided the best results.",
        "This method achieved a correlation of 0.870 with human judgements and MAP(20) of 0.995 and Recall(50) of 0.818 at predicting semantic relation between terms.",
        "This paper also sketched two novel single similarity measures performing comparably with the baselines ?",
        "WktWiki, based on definitions of Wikipedia and Wiktionary; and PatternWiki, based on patterns applied on Wikipedia abstracts.",
        "In the future research, we are going to apply the developed methods to query expansion."
      ]
    }
  ]
}
