{
  "info": {
    "authors": [
      "Lina M. Rojas Barahona",
      "Alejandra Lorenzo",
      "Claire Gardent"
    ],
    "book": "Proceedings of the 13th Annual Meeting of the Special Interest Group on Discourse and Dialogue",
    "id": "acl-W12-1602",
    "title": "An End-to-End Evaluation of Two Situated Dialog Systems",
    "url": "https://aclweb.org/anthology/W12-1602",
    "year": 2012
  },
  "references": [
    "acl-J97-1002",
    "acl-W03-0705",
    "acl-W06-1303"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We present and evaluate two state-of-the art dialogue systems developed to support dialog with French speaking virtual characters in the context of a serious game: one hybrid statistical/symbolic and one purely statistical.",
        "We conducted a quantitative evaluation where we compare the accuracy of the interpreter and of the dialog manager used by each system; a user based evaluation based on 22 subjects using both the statistical and the hybrid system; and a corpus based evaluation where we examine such criteria as dialog coherence, dialog success, interpretation and generation errors in the corpus of Human-System interactions collected during the user-based evaluation.",
        "We show that although the statistical approach is slightly more robust, the hybrid strategy seems to be better at guiding the player through the game."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In recent years, there has been much research on creating situated conversational characters i.e., virtual characters (VCs) that look and act like humans but inhabit a virtual environment (Gratch et al., 2002; Hofs et al., 2010; Traum et al., 2007; Johnson et al., 2005; Traum et al., 2008; DeVault et al., 2011).",
        "In this paper, we focus on French speaking, situated conversational agents who interact with virtual characters in the context of a serious game designed to promote careers in the plastic industry (The Mission Plastechnologie game or MP).",
        "We present and compare two state-of-the art dialogue systems.",
        "The first system (H) is a hybrid approach that combines an information-state dialogue manager (Lars-son and Traum, 2000) with a classifier for interpreting the players?",
        "phrases.",
        "The second system (QA) is a question/answering character model which predicts the system dialog move given a player's utterance (Leuski and Traum, 2008).",
        "Both systems use a generation-by-selection strategy (Leuski et al., 2006; Gandhe and Traum, 2007) where the system's utterances are selected from a corpus of possible outputs based on the dialog manager output.",
        "While previous work focuses on relatively short dialogs in a static setting, in our systems we consider long interactions in which dialogs occur in a setting that dynamically evolves as the game unfolds.",
        "We evaluate the two dialog systems in the context of the 3D game they were developed for and seek to determine the degree to which a dialog system is operational.",
        "To answer this question, we analyse both systems with respect not only to quantitative metrics such as accuracy but also to user-and corpus-based metrics.",
        "User-based metrics are computed based on a questionnaire the users filled in; while corpus-based metrics are manually extracted from the corpus of Player-VC interactions collected during the user-based evaluation.",
        "As suggested by evaluation frameworks such as PARADISE (Walker et al., 1997) and SASSI (Hone and Graham, 2000), we show that a multiview evaluation permits a better assessment of how well the dialog system functions ?in the real world?.",
        "The metrics proposed assess dialog success and coherence, as well the costs of dialog components.",
        "The paper is organized as follows.",
        "In Section 2,",
        "we present the MP game, the dialogue strategies used in the different dialogs and the dialog data used for training.",
        "Section 3 presents the two dialog systems we compare.",
        "Section 4 presents the evaluation schemes used to compare these two systems and discusses the results obtained.",
        "Section 5 concludes with directions for further research.",
        "2 Dialogues in the MP Game We begin by describing the MP game, the dialogs in the MP game, the strategies used to guide the hybrid dialog manager and the data used for training."
      ]
    },
    {
      "heading": "2.1 The MP Game and Dialogs",
      "text": [
        "The MP game is a multi-player quest where 3 teenagers seek to build a joystick in order to free their uncle trapped in a video game 1.",
        "To build this joystick, the player (who alternatively represents anyone of these three teenagers) must explore the plastic factory and achieve 17 mandatory goals (find the plans, get the appropriate mould, retrieve some plastic from the storing shed, etc), as well as 11 optional goals which, when reached, provide them with extra information about the plastic industry (and therefore increases their knowledge of it).",
        "In total, the player can achieve up to 28 game goals by conducting 12 separate dialogs in various parts of the virtual world.",
        "Each of the 12 dialogs in the MP game helps players to achieve the game goals.",
        "The player interacts with the virtual characters to obtain information that helps her to achieve these goals and, as a consequence, to increase her score in the game.",
        "Table 1 summarises the game goals and the contextual parameters (player's role, location in the virtual world, VCs present) associated with each dialog."
      ]
    },
    {
      "heading": "2.2 Dialog Data and Annotation",
      "text": [
        "To train both classifiers, the one used by the hybrid and the one used by the QA system, we collected Human-Machine dialog data using a Wizard-of-Oz setting and manually annotated each turn with a dialog move.",
        "The resulting corpus (called Emospeech Corpus) and the annotation scheme (as well as the inter-annotator agreement) used are described in de",
        "tail (Rojas-Barahona et al., 2012).",
        "Briefly, the Emo-speech Corpus comprises 1249 dialogs, 10454 utterances and 168509 words.",
        "It contains 3609 player utterances consisting of 31613 word tokens and 2969 word types, with approximately 100 conversations for each dialog in the game.",
        "Turns were annotated with dialog moves (Traum and Larsson, 2003) capturing both domain knowledge (e.g., about the goals set by the game) and the set of core communicative acts."
      ]
    },
    {
      "heading": "2.3 Dialog Strategies",
      "text": [
        "We identified four main dialog strategies underlying the 12 MP dialogs and used these to define the plans guiding the rule-based discourse management in the hybrid system.",
        "These strategies can be seen as transactions made up of conversational games (Carletta et al., 1997).",
        "Strategy 1.",
        "This strategy is used in the first dialog only and consists of a single Address Request move by the VC followed by the player's answer: Lucas requests Ben to find the address of the Plastic Enterprise that must be hidden somewhere in the lab.",
        "Ben can accept, reject or ask for help.",
        "Lucas answers accordingly and ends the conversation.",
        "Strategy 2.",
        "Nine dialogues follow this strategy.",
        "They include several (up to 5) requests for information and the corresponding system/player's exchange.",
        "Appendix A shows an example dialog following this strategy.",
        "Strategy 3: This is a confirmation strategy where the VC first checks that the player has already achieved a given task, before informing her about the next step (e.g. dialogs with Melissa in Table 1).",
        "Strategy 4.",
        "This strategy, exemplified in Appendix B, is similar to strategy 2 but additionally includes a negotiation step where the VC asks the player for help."
      ]
    },
    {
      "heading": "3 Dialogue Systems",
      "text": [
        "The game and the two dialog systems built were integrated as agents within the Open Agent Architecture as shown in Figure 1.",
        "Both systems access a database for starting the appropriate dialogs at the appropriate place in the virtual world while simultaneously storing all interactions in the database.",
        "modules are implemented as agents within the Open"
      ]
    },
    {
      "heading": "Agent Architecture. 3.1 The Hybrid Dialogue System",
      "text": [
        "The hybrid system combines an interpreter; a rule based, Information State Approach dialog manager; a generator; and the game/dialog communication components i.e., the OAA interface.",
        "The Interpreter Module In the hybrid system, the interpreter is a classifier trained on the annotated data (cf. section 2.2), which maps the player's utterance to a dialog move.",
        "To build the classifier we experimented with both SVM (Support Vector Machine) and LR (Logistic Regression) 2 using different sets of features: utterances were preprocessed by removing stop words and converting content words to unaccented lowercase.",
        "Afterwards, we experiment with and without TF*IDF (term fre-quency*Inverse Document Frequency) filtering and context moves (from 0 to 4 previous dialog moves).",
        "Since the game consist of a number of different dialogs, two options naturally arise: we could either train a single classifier on the whole dataset or train one classifier per dialog.",
        "Hence the data sets (and the number of categories to be learned) differ depending on whether we trained one classifier on the whole game data or a classifier for each dialog.",
        "In addition, handwritten rules are used to correct misclassification errors as follows.",
        "The best prediction given by the classifier is matched against the expected move determined by the last move stored in the information-state (see below the description of the dialog manager).",
        "In case of a mismatch, the interpreter selects a move that is valid in the current context and updates the information state with this move.",
        "For instance, if the last move is a yes/no question, confirm and disconfirm dialog acts are valid moves; for propositional questions, Goali is a valid",
        "dialog move 3; etc.",
        "Since the process is non deterministic, this reinterpretation process may improve the system response but it may also be incorrect.",
        "For instance, in the following example reinterpretation correctly overrides the dialog move output by the classifier to a move asking the VC (Samir) for the next goal to be achieved.",
        "Samir: Vous avez d?autres questions pour moi?",
        "Do you have other questions ?",
        "Julie: comment cela fonctionne ?",
        "How does it work?",
        "Samir: Eh bien , il va falloir la fabriquer maintenant cette manette .",
        "Allez voir Me?lissa.",
        "Well, you have to build the joystick now.",
        "Go to see Melissa.",
        "In contrast, the dialog below shows a case where reinterpretation fails.",
        "Instead of reinterpreting the player's (Julie) input as a request for the next goal, it outputs a request for information about the staff thereby yielding an incoherent exchange.",
        "Samir: D?",
        "autres questions ?",
        "Other questions?",
        "Julie: oui qu?est-ce que je peux faire avec ces bouts de papier ?",
        "yes, what can I do with these pieces of paper ?",
        "Samir: Et bien sachez qu?il y a de plus en plus des femmes dans cette industrie ... you should know there are more and more women in this industry ...",
        "The DialogManager We designed a plan for each dialog strategy and extended Midiki (Burke et al., 2003) to support the OAA architecture and access the relational database specifying the configurations of the different dialogs in the game.",
        "Each time a new dialog is launched, the information state is loaded with the corresponding dialog-context (e.g., speakers, list of goals to be discussed) and the plan mod-eling the corresponding dialog strategy.",
        "To support dialog management, we implemented a set of update and selection rules for integrating players?",
        "moves, handling the information-state and for preparing the agenda according to the plan.",
        "More specifically, the following rules are executed at runtime: Integration: integrates dialog moves (e.g., questions, answers, acknowledgments) in the information state (questions are listed in the Question Under Discussion, 3The system asks the player for the goal to be discussed: ask(task(X)) and the player answers one goal in the situated dialog: Goali.",
        "answers change the Commond Ground, player answers are integrated in response to VCs questions).",
        "Manage Plan: searches the next action in the plan.",
        "Refill Agenda: updates the agenda with the next action and Selection: selects the next dialog move according to the plan.",
        "Once the system move has been selected, the Generator searches an appropriate verbalisation.",
        "The Generator As mentioned above, the generator implements a generation-by-selection strategy.",
        "Given the dialog move output by the dialog manager, the generator selects any utterance in this corpus that is labeled with this dialog move and with the identifier of the current dialog.",
        "In addition, two types of dialog moves are given special treatment.",
        "The first two moves of each dialog are systematically constrained to be a welcome greeting followed by either a request to pursue a goal (ask(Goali) or a proposal to help (ask(task(X))).",
        "Furthermore, propositional questions (i.e., proposals by the system to discuss additional topics) were annotated separately with their respective dialog goals.",
        "For example, Samir's sentence: Are you interested in hearing about my job, the people that work here or the security policies?, was annotated with the goals: job, staff and security policies.",
        "For these dialog acts, the generator checks the list of current missing goals so as to retrieve an appropriate propositional question.",
        "In this way, the system can coherently direct the player by suggesting possible topics without using vague and repetitive sentences such as Would you like to know more?."
      ]
    },
    {
      "heading": "3.2 The QA System",
      "text": [
        "The QA system combines a classifier that matches players?",
        "turns to system dialog moves with the same generation-by-selection algorithm used in the hybrid system.",
        "Like the hybrid system, the QA dialog system maintains a constant interaction with the game to allow for the game coherence and continuity.",
        "In particular, at the end of each dialog, the game goals that have been reached through the dialog are returned to the game server so that the game can proceed and be updated with the appropriate score.",
        "For the QA system, we trained a Logistic Regression (LR) classifier for each dialog in the game.",
        "We applied the same preprocessing and extracted the same features used for training the interpreter in the hybrid system."
      ]
    },
    {
      "heading": "3.3 Discussion and Interaction Examples",
      "text": [
        "As shown above, while the QA system simply matches the player's input to a system response, the hybrid system has a much more elaborate dialog management policy including reinterpretation and the use of game and dialog history information, to guide the dialog.",
        "As a result, the QA dialogs are generally more spontaneous, giving the player more initiative whereas the hybrid system enforces a more System-Driven dialog strategy thereby guiding the player through the game.",
        "The following two examples illustrate this point.",
        "Sophia is the system and Lucas the player.",
        "The game context provides two goals which can be discussed: one mandatory (To find out that finishing the manufacturing process involves conditioning the product), and one optional (To be told what conditioning the product means).",
        "The examples show how the hybrid system proposes both goals to the user while the QA engine provides the same information fluently.",
        "ment pour pouvoir l?expe?dier au client.",
        "Aldo, le logisticien assure qu?on ne manque pas de stock et de ge?rer les livraisons et les expe?ditions.",
        "Conditioning the product means packing it carefully in order to ship it to the customer.",
        "Aldo,the logistics coordinator ensures there is no shortage of stock and he is also in charge of the deliveries and shipments.",
        "Sophia: Je vous laisse tester votre manette .",
        "Au revoir I leave you test out your joystick.",
        "Goodbye"
      ]
    },
    {
      "heading": "Question Answer",
      "text": [
        "Sophia: he?",
        "bien c?est du bon travail tout c?a.",
        "Good!",
        "That's a great job kids!",
        "Sophia: Alors , ou` en sommes nous?",
        "So where are we?",
        "Lucas:voila` nous avons utilise?",
        "les composants.",
        "Quelle est l?e?tape suivante?",
        "We used the components, what is the next step?",
        "Sophia: On finis la fabrication par conditionner le produit.",
        "We finish the fabrication by conditioning the product.",
        "Lucas:Ok Sophia: Conditioner le produit veut dire l?emballer soigneuse-ment pour pouvoir l?expe?dier au client .",
        "Le logisticien assure qu?on ne manque pas de stock et de ge?rer les livraisons et les expe?ditions.",
        "Conditioning the product means packing it carefully in order to ship it to the customer.",
        "Aldo,the logistics coordinator ensures there is no shortage of stock and he is also in charge of the deliveries and shipments.",
        "Sophia: Et voila, je vous dis au revoir Ok, I say good bye!"
      ]
    },
    {
      "heading": "4 Evaluation",
      "text": [
        "In evaluating the two systems, we seek to compare their usability: Which system is best suited for use by real users in the context of the MP serious game?",
        "We also seek to better understand which module causes which errors and why.",
        "To address these questions we conducted a quantitative evaluation where we compare the accuracy of the interpreter and the dialog manager integrated in each system; a user based evaluation involving 22 subjects using both the QA and the hybrid system; and a corpus based evaluation where we examine such criteria as dialog coherence, dialog success, interpretation and generation errors in the corpus of Human-System interactions collected during the user-based evaluation."
      ]
    },
    {
      "heading": "4.1 Quantitative Evaluation",
      "text": [
        "We begin by evaluating the accuracy of the interpreter and the dialog manager used by the hybrid and the QA system respectively.",
        "These two classifiers were trained on the Emospeech corpus mentioned above and evaluated with 30-fold cross-validation.",
        "Hybrid System As we mentioned in section 3.1, since the game includes different dialogs, a natural question arise: whether to implement the inter",
        "preter with a single classifier for the whole dataset, or using a different classifier for each dialog in the game.",
        "To answer this question, we compared the accuracy reached in each case.",
        "The details of these experiments are described in (Rojas-Barahona et al., 2012).",
        "The highest accuracy is reported when using a single classifier for the whole game, reaching an accuracy of 90.26%, as opposed to 88.22% in average for each dialog.",
        "In both cases, the classifier used is LR, with L1 regularisation and applying the tf*idf filtering.",
        "However, although the classifier trained on the whole dialog data has better accuracy (learning a model per dialog often run into the sparse data issue), we observed that, in practice, it often predicted interpretations that were unrelated to the current dialog thereby introducing incoherent responses in dialogs.",
        "For instance, in the dialog below, the player wants to know how waste is managed in the factory.",
        "The best prediction given by the interpreter is a goal related to another dialog thereby creating a mismatch with the DM expectations.",
        "Re-interpretation then fails producing a system response that informs the player of the next goal to be pursued in the game instead of answering the player's request.",
        "Ben: Comment on ge`re les dechets ici?",
        "How is the waste managed here ?",
        "Serge: Allez voir Sophia pour qu?elle vous fournisse les composants e?lectroniques ne?cessaires a` votre manette.",
        "Go and see Sophia, she?ll give you the electronic components you need for your joystick.",
        "For the user based experiment, we therefore use the LR models with one classifier per dialog.",
        "QA System For evaluating the QA classifier, we also compared results with or without tf*idf filtering.",
        "The best results were obtained by the LR classifier for each dialog with tf*idf filtering yielding an accuracy of 88.27% as shown in Table 2."
      ]
    },
    {
      "heading": "4.2 Preliminary User-Based Evaluation",
      "text": [
        "The accuracy of the interpreter and the dialog manager used by the hybrid and the QA system only gives partial information on the usability of the dialog engine in a situated setting.",
        "We therefore conducted a user-based evaluation which aims to assess the following points: interpretation quality, overall system quality, dialog clarity, game clarity and timing.",
        "We invited 22 subjects to play the game twice,",
        "a context of four previous system moves, with and without tf*idf filtering.",
        "once with one system and once with the other.",
        "The experiment is biased however in that the players always used the hybrid system first.",
        "This is because in practice, the QA system often fail to provide novice players with enough guidance to play the game.",
        "This can be fixed by having the player first use the hybrid system.",
        "Interestingly, the game guidance made possible by the Information State approach is effective in guiding players through the game e.g., by proposing new goals to be discussed at an appropriate point in the dialog; and by taking dialog history into account.",
        "After playing, each user completed the questionnaire shown in Table 3.",
        "For those criteria such as dialog and game clarity, we do not report the scores since these are clearly impacted by how many times the player has played the game.",
        "Table 4 shows the mean of the quantitative scores given by the 22 subjects for interpretation, overall system quality and timing.",
        "We computed a significance test between the scores given by the subjects, using the Wilcoxon signed-rank test4.",
        "As shown in the Table, for all criteria, except Q.4, the QA performs significantly (p < 0.01) better than the Hybrid system.",
        "native to the paired t-test for correlated samples, applicable, e.g. when dealing with measures which cannot be assumed to have equal-interval scales, as is usual with user questionnaires.",
        "Interpretation.",
        "Question Q.1 aims to captures the user's assessment of the dialog system ability to correctly interpret the player's utterances.",
        "The QA system scores 0.7 points higher than the Hybrid system suggesting better question/answer coherence for this system.",
        "One possible reason is that while the hybrid system detects any incoherence and either tries to fix it using reinterpretation (which as we saw sometimes yields an incoherent dialog) or make it explicit (using a misunderstanding dialog act i.e., a request for rephrasing), the QA system systematically provides a direct answer to the player's input.",
        "The relatively low scores assigned by the user to the interpretation capabilities of the two systems (57.36 and 64.55 respectively) show that the high accuracy of the interpreter and the dialog manager is not a sufficient criteria for assessing the usability of a dialog system.",
        "Timing.",
        "One important factor for the usability of a system is of course real time runtimes.",
        "The evaluation shows that overall the speed of the QA system was judged more adequate.",
        "Interestingly though the difference between the two systems stems no so much from cases where the hybrid approach is too slow than from cases where it is too fast.",
        "These cases are due to the fact that while the QA system always issues one-turn answer, the rule based dialog based approach used in the hybrid system often produce two consecutive turns, one answering the player and the other attempting to guide her towards the following game goal.",
        "In sum, although the QA system seems more robust and better at supporting coherent dialogs, the hybrid system seems to be more effective at guiding",
        "dividuals.",
        "(*) denotes statistical significance at p < 0.01 (two-tailed significance level).",
        "the player through the game."
      ]
    },
    {
      "heading": "4.3 Corpus-Based Evaluation",
      "text": [
        "The User-Based evaluation resulted in the collection of 298 dialogs (690 player and 1813 system turns) with the Hybrid system and 261 dialogs (773 player and 1411 system turns) with the QA system.",
        "To better understand the causes of the scores derived from the user-filled questionnaire, we performed manual error analysis on this data focusing on dialog incoherences, dialog success, dialog management and generation errors (reported in Table 5).",
        "DM Errors The count of dialog management (DM) errors is the ratio WRP of wrong system responses on counts of player's input.",
        "In essence this metrics permits comparing the accuracy of the QA dialog manager with that of the hybrid system.",
        "On average there is no clear distinction between the two systems.",
        "Generation Errors The system response selected by the generation component might be contextually inappropriate for at least two reasons.",
        "First, it may contain information which is unrelated to the current context.",
        "Second, it might have been imprecisely or incorrectly annotated.",
        "For instance, in the dialog below, the annotation of the turn Yes, thanks.",
        "What do you want me to do?",
        "did not indicate that the turn included a Confirm dialog move.",
        "Selecting this turn in the absence of a yes/no question resulted in a contextually inappropriate system response.",
        "SYSTEM: Bonjour les petits jeunes je suis le pre?parateur matie?re.",
        "Hello kids, I am the raw material responsible SYSTEM: Oui merci.",
        "Vous me voulez quoi en fait ?",
        "Yes, thanks.",
        "What do you want me to do?",
        "PLAYER: je veux en savoir plus sur cet endroit.",
        "I would like to know more about this place As shown in Table 5, for both systems, there were",
        "and the QA systems.",
        "Unsuccessful Dialogs We counted as unsuccessful those dialogs that were closed before discussing the mandatory goals.",
        "The results are shown in Table 6.",
        "Overall the QA system is more robust leading to the mandatory goals being discussed in almost all dialogs.",
        "One exception was dialog 8, where the system went into a loop due to the player repeating the same sequence of dialog moves.",
        "We fixed this by Id %Uns.",
        "H. %Inco.",
        "H. %Uns.",
        "QA.",
        "%Inc.",
        "QA.",
        "cessful dialogs integrating a loop detection step in the QA dialog manager.",
        "For the hybrid system, dialog 7, a dialog involving the confirmation strategy (cf. section 2) is the most problematic.",
        "In this case, the DM rules used to handle this strategy are inappropriate in that whenever the system fails to identify a contextually appropriate response, it simply says so and quits the dialog.",
        "The example illustrates the difficulty of developing a complete and coherent DM rule system.",
        "Incoherent Dialogs We counted as incoherent, dialogs where most system answers were unrelated to the player's input.",
        "As shown in Table 6, despite interpretation and generation imprecisions, most dialogs were globally coherent.",
        "They made sense according to the game context: they were related to the task to be solved by the player in the game, and the generated instructions were correctly understood.",
        "The hybrid system produces slightly less incoherent dialogs probably because of its reinterpretation mechanism which permits correcting contextually invalid dialog moves."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "We have presented a multi-view evaluation of two system architectures for conversational agents situated in a serious game.",
        "Although the QA system seems more robust and is easier to deploy, the hybrid dialog engine seems to fare better in terms of game logic in that it guides the player more effec",
        "tively through the game.",
        "The evaluation shows the importance of assessing not only the dialog engine accuracy but also its usability in the setting it was designed for.",
        "In future work, we plan to compute a regression model of user satisfaction for applying reinforcement learning and find the optimal strategy.",
        "In addition, we plan to extend the comparison to other domains such as language learning and complex negociation dialogs."
      ]
    },
    {
      "heading": "6 Acknowledgments",
      "text": [
        "The research presented in this paper was partially supported by the Eurostar EmoSpeech project and by the European Fund for Regional Development within the framework of the INTERREG IV A Allegro Project."
      ]
    }
  ]
}
