{
  "info": {
    "authors": [
      "Jorge Carrillo de Albornoz",
      "Laura Plaza",
      "Alberto Dìaz",
      "Miguel Ballesteros"
    ],
    "book": "SemEval",
    "id": "acl-S12-1037",
    "title": "UCM-I: A Rule-based Syntactic Approach for Resolving the Scope of Negation",
    "url": "https://aclweb.org/anthology/S12-1037",
    "year": 2012
  },
  "references": [
    "acl-D08-1075",
    "acl-P05-3019",
    "acl-S12-1035",
    "acl-W10-2919",
    "acl-W10-3110",
    "acl-W10-3111"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper presents one of the two contributions from the Universidad Complutense de Madrid to the *SEM Shared Task 2012 on Resolving the Scope and Focus of Negation.",
        "We describe a rule-based system for detecting the presence of negations and delimitating their scope.",
        "It was initially intended for processing negation in opinionated texts, and has been adapted to fit the task requirements.",
        "It first detects negation cues using a list of explicit negation markers (such as not or nothing), and infers other implicit negations (such as affixal negations, e.g, undeniable or improper) by using semantic information from WordNet concepts and relations.",
        "It next uses the information from the syntax tree of the sentence in which the negation arises to get a first approximation to the negation scope, which is later refined using a set of post-processing rules that bound or expand such scope."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Detecting negation is important for many NLP tasks, as it may reverse the meaning of the text affected by it.",
        "In information extraction, for instance, it is obviously important to distinguish negated information from affirmative one (Kim and Park, 2006).",
        "It may also improve automatic indexing (Mutalik et al., 2001).",
        "In sentiment analysis, detecting and dealing with negation is critical, as it may change the polarity of a text (Wiegand et al., 2010).",
        "However, research on negation has mainly focused on the biomedical domain, and addressed the problem of detecting if a medical term is negated or not (Chapman et al., 2001), or the scope of different negation signals (Morante et al., 2008).",
        "During the last years, the importance of processing negation is gaining recognition by the NLP research community, as evidenced by the success of several initiatives such as the Negation and Speculation in Natural Language Processing workshop (NeSp-NLP 2010)1 or the CoNLL-2010 Shared Task2, which aimed at identifying hedges and their scope in natural language texts.",
        "In spite of this, most of the approaches proposed so far deal with negation in a superficial manner.",
        "This paper describes our contribution to the *SEM Shared Task 2012 on Resolving the Scope and Focus of Negation.",
        "As its name suggests, the task aims at detecting the scope and focus of negation, as a means of encouraging research in negation processing.",
        "In particular, we participate in Task 1: scope detection.",
        "For each negation in the text, the negation cue must be detected, and its scope marked.",
        "Moreover, the event or property that is negated must be recognized.",
        "A comprehensive description of the task may be found in (Morante and Blanco, 2012).",
        "For the sake of clarity, it is important to define what the organization of the task understands by negation cue, scope of negation and negated event.",
        "The words that express negation are called negation cues.",
        "Not and no are common examples of such cues.",
        "Scope is defined as the part of the meaning that is negated, and encloses all negated concepts.",
        "The negated event is the property that is",
        "negated by the cue.",
        "For instance, in the sentence: [Holmes] did not [say anything], the scope is enclosed in square brackets, the negation cue is underlined and the negated event is shown in bold.",
        "More details about the annotation of negation cues, scopes and negated events may be found in (Morante and Daelemans, 2012).",
        "The system presented to the shared task is an adaptation of the one published in (Carrillo de Albornoz et al., 2010), whose aim was to detect and process negation in opinionated text in order to improve polarity and intensity classification.",
        "When classifying sentiments and opinions it is important to deal with the presence of negations and their effect on the emotional meaning of the text affected by them.",
        "Consider the sentence (1) and (2).",
        "Sentence",
        "(1) expresses a positive opinion, whereas that in sentence (2) the negation word not reverses the polarity of such opinion.",
        "(1) I liked this hotel.",
        "(2) I didn't like this hotel.",
        "Our system has the main advantage of being simple and highly generic.",
        "Even though it was originally conceived for treating negations in opinionated texts, a few simple modifications have been sufficient to successfully address negation in a very different type of texts, such as Conan Doyle stories.",
        "It is rule-based and does not need to be trained.",
        "It also uses semantic information in order to automatically detect the negation cues."
      ]
    },
    {
      "heading": "2 Methodology",
      "text": [
        "As already told, the UCM-I system is a modified version of the one presented in (Carrillo de Albornoz et al., 2010).",
        "Next sections detail the modifications performed to undertake the present task."
      ]
    },
    {
      "heading": "2.1 Detecting negation cues",
      "text": [
        "Our previous work was focused on explicit negations (i.e., those introduced by negation tokens such as not, never).",
        "In contrast, in the present work we also consider what we call implicit negations, which includes affixal negation (i.,e., words with prefixes such as dis-, un- or suffixes such as -less; e.g., impatient or careless), inffixal negation (i.e., pointlessness, where the negation cue less is in the middle of the noun phrase).",
        "Note that we did not",
        "Explicit negation cues no not non nor nobody never nowhere ...",
        "Words with implicit negation cues unpleasant unnatural dislike impatient fearless hopeless illegal ... have into account these negation cues when ana-lyzing opinionated texts because these words themselves usually appear in affective lexicons with their corresponding polarity values (i.e., impatient, for instance, appears in SentiWordNet with a negative polarity value).",
        "In order to detect negation cues, we use a list of predefined negation signals, along with an automatic method for detecting new ones.",
        "The list has been extracted from different previous works (Councill et al., 2010; Morante, 2010).",
        "This list also includes the most frequent contracted forms (e.g., don't, didn't, etc.).",
        "The automated method, in turn, is intended for discovering in text new affixal negation cues.",
        "To this end, we first find in the text all words with prefixes dis-, a-, un-, in-, im-, non-, il-, ir- and the suffix less that present the appropriate part of speech.",
        "Since not all words with such affixes are negation cues, we use semantic information from WordNet concepts and relations to decide.",
        "In this way, we retrieve from WordNet the synset that correspond to each word, using WordNet::SenseRelate (Patward-han et al., 2005) to correctly disambiguate the meaning of the word according to its context, along with all its antonym synsets.",
        "We next check if, after removing the affix, the word exists in WordNet and belongs to any of the antonym synsets.",
        "If so, we consider the original word to be a negation cue (i.e., the word without the affix has the opposite meaning than the lexical item with the affix).",
        "Table 1 presents some examples of explicit negation cues and words with implicit negation cues.",
        "For space reasons, not all cues are shown.",
        "We also consider common spelling errors such as the omission of apostrophes (e.g., isnt or nt).",
        "They are not likely to be found in literary texts, but are quite frequent in user-generated content.",
        "This general processing is, however, improved with two rules:",
        "no doubt without a doubt not merely not just not even not only no wonder ... 1.",
        "False negation cues: Some negation words",
        "may be also used in other expressions without constituting a negation, as in sentence (3).",
        "Therefore, when the negation token belongs to such expressions, this is not processed as a negation.",
        "Examples of false negation cues are shown in Table 2.",
        "(3) ... the evidence may implicate not only your friend Mr. Stapleton but his wife as well.",
        "2.",
        "Tag questions: Some sentences in the corpora present negative tag questions in old English grammatical form, as it may shown in sentences (4) and (5).",
        "We have implemented a specific rule to deal with this type of constructions, so that they are not treated as negations.",
        "(4) You could easily recognize it , could you not?.",
        "(5) But your family have been with us for several generations , have they not?"
      ]
    },
    {
      "heading": "2.2 Delimiting the scope of negation",
      "text": [
        "The scope of a negation is determined by using the syntax tree of the sentence in which the negation arises, as generated by the Stanford Parser.3 To this end, we find in the syntax tree the first common ancestor that encloses the negation token and the word immediately after it, and assume all descendant leaf nodes to the right of the negation token to be affected by it.",
        "This process may be seen in Figure 1, where the syntax tree for the sentence: [Watson did] not [solve the case] is shown.",
        "In this sentence, the method identifies the negation token not and assumes its scope to be all descendant leaf nodes of the common ancestor of the words not and solve (i.e., solve the case).",
        "This modeling has the main advantage of being highly generic, as it serves to delimit the scope of negation regardless of what the negated event is (i.e., the verb, the subject, the object of the verb, an adjective or an adverb).",
        "As shown in (Carrillo de Al",
        "solve the case.",
        "bornoz et al., 2010), it behaves well when determining the scope of negation for the purpose of classifying product reviews in polarity classes.",
        "However, we have found that this scope is not enough for the present task, and thus we have implemented a set of post-processing rules to expand and limit the scope according to the task guidelines:",
        "1.",
        "Expansion to subject.",
        "This rule expands the negation scope in order to include the subject of the sentence within it.",
        "In this way, in sentence (6) the appropriate rule is fired to include ?This theory?",
        "within the negation scope.",
        "(6) [This theory would] not [work].",
        "It must be noted that, for polarity classification purposes, we do not consider the subject of the sentence to be part of this scope.",
        "Consider, for instance, the sentence: The beautiful views of the Eiffel Tower are not guaranteed in all rooms.",
        "According to traditional polarity classification approaches, if the subject is considered as part of the negation scope, the polarity of the positive polar expression ?beautiful?",
        "should be changed, and considered as negative.",
        "2.",
        "Subordinate boundaries.",
        "Our original negation scope detection method works well with coordinate sentences, in which negation cues scope only over their clause, as if a ?boundary?",
        "exists between the different clauses.",
        "This occurs, for instance, in the sentence:"
      ]
    },
    {
      "heading": "Tokens POS",
      "text": [
        "so, because, if, while INuntil, since, unless before, than, despite IN what, whose WP why, where WRB",
        "(7) [It may be that you are] not [yourself luminous], but you are a conductor of light.",
        "It also works properly in subordinate sentences, when the negation occurs in the subordinate clause, as in: You can imagine my surprise when I found that [there was] no [one there].",
        "However, it may fail in some types of subordinate sentences, where the scope should be limited to the main clause, but our model predict both clauses to be affected by the negation.",
        "This is the case for the sentences where the dependent clause is introduced by the subordinate conjunctions in Table 3.",
        "An example of such type of sentence is (8), where the conjunction token because introduces a subordinate clause which is out of the negation scope.",
        "To solve this problem, the negation scope detection method includes a set of rules to delimit the scope in those cases, using as delimiters the conjunctions in Table 3.",
        "Note that, since some of these delimiters are ambiguous, their part of speech tags are used to disambiguate them.",
        "(8) [Her father] refused [to have anything to do with her] because she had married without his consent.",
        "3.",
        "Prepositional phrases: Our original method also fails to correctly determine the negation",
        "scope when the negated event is followed by a prepositional phrase, as it may be seen in Figure 2, where the syntax tree for the sentence: [There was] no [attempt at robbery] is shown.",
        "Note that, according to our original model, the phrase ?at robbery?",
        "does not belong to the negation scope.",
        "This is an error that was not detected before, but has been fixed for the"
      ]
    },
    {
      "heading": "2.3 Finding negated events",
      "text": [
        "We only consider a single type of negated events, so that, when a cue word contains a negative affix, the word after removing the affix is annotated as the negated event.",
        "In this way, ?doubtedly?",
        "is correctly annotated as the negated event in sentence (9).",
        "However, the remaining types of negated events are relegated to future work.",
        "(9) [The oval seal is] undoubtedly [a plain sleeve-link]."
      ]
    },
    {
      "heading": "3 Evaluation Setup",
      "text": [
        "The data collection consists of a development set, a training set, and two test sets of 787, 3644, 496 and 593 sentences, respectively from different stories by Conan Doyle (see (Morante and Blanco, 2012) for details).",
        "Performance is measured in terms of recall, precision and F-measure for the following subtasks:",
        "?",
        "Predicting negation cues.",
        "?",
        "Predicting both the scope and cue.",
        "?",
        "Predicting the scope, the cue does not need to be correct.",
        "?",
        "Predicting the scope tokens, where not a full scope match is required.",
        "?",
        "Predicting negated events.",
        "?",
        "Full evaluation, which requires all elements to be correct."
      ]
    },
    {
      "heading": "4 Evaluation Results",
      "text": [
        "The results of our system when evaluated on the development set and the two test sets (both jointly and separately), are shown in Tables 4, 5, and 6.",
        "It may be seen from these tables that our system behaves quite well in the prediction of negation cues subtask, achieving around 90% F-measure in all data sets, and the second position in the competition.",
        "Performance in the scope prediction task, however, is around 60% F-1, and the same results are obtained if the correct prediction of cues is required (Scope (cue match)).",
        "This seems to indicate that, for all correct scope predictions, our system have also predicted the negation cues correctly.",
        "Obviously these results improve for the Scope tokens measure, achieving more than 77% F-1 for the Cardboard data set.",
        "We also got the second position in the competition for these three subtasks.",
        "Concerning detection of negated events, our system gets poor results, 22.85% and 19.81% F-1, respectively, in each test data set.",
        "These results affect the performance of the full negation prediction task, where we get 32.18% and 32.96% F-1, respectively.",
        "Surprisingly, the result in the test sets are slightly better than those in the development set, and this is due to a better be-havior of the WordNet-based cue detection method in the formers than in the later."
      ]
    },
    {
      "heading": "5 Discussion",
      "text": [
        "We next discuss and analyze the results above.",
        "Firstly, and regarding detection of negation cues, our initial list covers all explicit negations in the development set, while the detection of affixal negation cues using our WordNet-based method presents a precision of 100% but a recall of 53%.",
        "In particular, our method fails when discovering negation cues such as unburned, uncommonly or irreproachable, where the word after removing the affix is a derived form of a verb or adjective.",
        "Secondly, and concerning delimitation of the scope, our method behaves considerably well.",
        "We have found that it correctly annotates the negation scope when the negation affects the predicate that expresses the event, but sometimes fails to include the subject of the sentence in such scope, as in: [I know absolutely] nothing [about the fate of this man], where our method only recognizes as the negation scope the terms about the fate of this man.",
        "The results have also shown that the method frequently fails when the subject of the sentence or the object of an event are negated.",
        "This occurs, for instance, in sentences: I think, Watson, [a brandy and soda would do him] no [harm] and No [woman would ever send a reply-paid telegram], where we only point to ?harm?",
        "and ?woman?",
        "as the scopes.",
        "We have found a further category of errors in the scope detection tasks, which concern some types of complex sentences with subordinate conjunctions where our method limits the negation scope to the main clause, as in sentence: [Where they came from, or who they are,] nobody [has an idea] , where our method limits the scope to ?has an idea?.",
        "However, if the negation cue occurs in the subordinate clause, the method behaves correctly.",
        "Thirdly, with respect to negated event detection, as already told our method gets quite poor results.",
        "This was expected, since our system was not originally designed to face this task and thus it only covers one type of negated events.",
        "Specifically, it correctly identifies the negated events for sentences with affixal negation cues, as in: It is most improper, most outrageous, where the negated event is ?proper?.",
        "However, it usually fails to identify these events when the negation affects the subject of the sentence or the object of an event."
      ]
    },
    {
      "heading": "6 Conclusions and Future Work",
      "text": [
        "This paper presents one of the two contributions from the Universidad Complutense de Madrid to the *SEM Shared Task 2012.",
        "The results have shown that our method successes in identifying negation cues and performs reasonably well when determining the negation scope, which seems to indicate that a simple unsupervised method based on syntactic information and a reduced set of post-processing rules",
        "is a viable approach for dealing with negation.",
        "However, detection of negated events is the main weakness of our approach, and this should be tackled in future work.",
        "We also plan to improve our method for detecting affixal negations to increment its recall, by using further WordNet relations such as ?derived from adjective?, and ?pertains to noun?, as well as to extend this method to detect infixal negations."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This research is funded by the Spanish Ministry of Science and Innovation (TIN2009-14659-C03-01) and the Ministry of Education (FPU program)."
      ]
    }
  ]
}
