{
  "info": {
    "authors": [
      "Marianna Apidianaki",
      "Guillaume Wisniewski",
      "Artem Sokolov",
      "Aurèlien Max",
      "François Yvon"
    ],
    "book": "Proceedings of the Sixth Workshop on Syntax, Semantics and Structure in Statistical Translation",
    "id": "acl-W12-4201",
    "title": "WSD for n-best reranking and local language modeling in SMT",
    "url": "https://aclweb.org/anthology/W12-4201",
    "year": 2012
  },
  "references": [
    "acl-C10-1027",
    "acl-D07-1007",
    "acl-D09-1022",
    "acl-E09-1010",
    "acl-H05-1097",
    "acl-J03-1002",
    "acl-L08-1585",
    "acl-N04-1021",
    "acl-P05-1048",
    "acl-P06-3010",
    "acl-P07-1005",
    "acl-P07-2045",
    "acl-S10-1002",
    "acl-S10-1003"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of SSST-6, Sixth Workshop on Syntax, Semantics and Structure in Statistical Translation, pages 1?9, Jeju, Republic of Korea, 12 July 2012. c?2012 Association for Computational Linguistics WSD for n-best reranking and local language modeling in SMT"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "We integrate semantic information at two stages of the translation process of a state-of-the-art SMT system.",
        "A Word Sense Disambiguation (WSD) classifier produces a probability distribution over the translation candidates of source words which is exploited in two ways.",
        "First, the probabilities serve to rerank a list of n-best translations produced by the system.",
        "Second, the WSD predictions are used to build a supplementary language model for each sentence, aimed to favor translations that seem more adequate in this specific sentential context.",
        "Both approaches lead to significant improvements in translation performance, highlighting the usefulness of source side disambiguation for SMT."
      ]
    },
    {
      "heading": "1 Introduction Word Sense Disambiguation (WSD) is the task of",
      "text": [
        "identifying the sense of words in texts by reference to some pre-existing sense inventory.",
        "The selection of the appropriate inventory and WSD method strongly depends on the goal WSD intends to serve: recent methods are increasingly oriented towards the disambiguation needs of specific end applications, and explicitly aim at improving the overall performance of complex Natural Language Processing systems (Ide and Wilks, 2007; Carpuat and Wu, 2007).",
        "This task-oriented conception of WSD is manifested in the area of multilingual semantic processing: supervised methods, which were previously shown to give the best results, are being abandoned in favor of unsupervised ones that do not rely on pre-annotated training data.",
        "Accordingly, predefined semantic inventories, that usually served to provide the lists of candidate word senses, are being replaced by senses relevant to the considered applications and directly identified from corpora by means of word sense induction methods.",
        "In a multilingual setting, the sense inventories needed for disambiguation are generally built from all possible translations of words or phrases in a parallel corpus (Carpuat and Wu, 2007; Chan et al., 2007), or by using more complex representations of the semantics of translations (Apidianaki, 2009; Mihalcea et al., 2010; Lefever and Hoste, 2010).",
        "However, integrating this semantic knowledge into Statistical Machine Translation (SMT) raises several challenges: the way in which the predictions of the WSD classifier have to be taken into account; the type of context exploited for disambiguation; the target words to be disambiguated (?all-words?",
        "WSD vs. WSD restricted to target words satisfying specific criteria); the use of a single classifier versus building separate classifiers for each source word; the quantity and type of data used for training the classifier (e.g., use of raw data or of more abstract representations, such as lemmatization, allowing to deal with sparseness issues), and many others.",
        "Seemingly, the optimal way to take advantage of WSD predictions remains an open issue.",
        "In this work, we carry out a set of experiments to investigate the impact of integrating the predictions of a cross-lingual WSD classifier into an SMT system, at two different stages of the translation process.",
        "The first approach exploits the probability distribution built by the WSD classifier over the set of translations of words found in the parallel corpus,",
        "for reranking the translations in the n-best list generated by the SMT system.",
        "Words in the list that match one of the proposed translations are boosted and are thus more likely to appear in the final translation.",
        "Our results on the English-French IWSLT?11 task show substantial improvements in translation quality.",
        "The second approach provides a tighter integration of the WSD classifier with the rest of the system: using the WSD predictions, an additional sentence specific language model is estimated and used during decoding.",
        "These additional local models can be used as an external knowledge source to reinforce translation hypotheses matching the prediction of the WSD system.",
        "In the rest of the paper, we present related work on integrating semantic information into SMT (Section 2).",
        "The WSD classifier used in the current study is described in Section 3.",
        "We then present the two approaches adopted for integrating the WSD output into SMT (Section 4).",
        "Evaluation results are presented in Section 5, before concluding and discussing some avenues for future work."
      ]
    },
    {
      "heading": "2 Related work",
      "text": [
        "Word sense disambiguation systems generally work at the word level: given an input word and its context, they predict its (most likely) meaning.",
        "At the same time, state-of-the-art translation systems all consider groups of words (phrases, tuples, etc.)",
        "rather than single words in the translation process.",
        "This discrepancy between the units used in MT and those used in WSD is one of the major difficulties in integrating word predictions into the decoder.",
        "This was, for instance, one of the reasons for the somewhat disappointing results obtained by Carpuat and Wu (2005) when the output of a WSD system was directly incorporated into a Chinese-English SMT system.",
        "Because of this difficulty, other cross-lingual semantics works have considered only simplified tasks, like blank-filling, without addressing the integration of the WSD models in full-scale MT systems (Vickrey et al., 2005; Specia, 2006).",
        "Since the pioneering work of Carpuat and Wu (2005), several more successful ways to take WSD predictions into account have been proposed.",
        "For instance, Carpuat and Wu (2007) proposed to generalize the WSD system so that it performs a fully phrasal multiword disambiguation.",
        "However, given that the number of phrases is far larger than the number of words, this approach suffers from sparsity and computational problems, as it requires training a classifier for each entry of the phrase table.",
        "Chan et al. (2007) introduced a way to modify the rule weights of a hierarchical translation system to reflect the predictions of their WSD system.",
        "While their approach and ours are built on the same intuition (an adaptation of a model to incorporate word predictions) their work is specific to hierarchical systems, while ours can be applied to any decoder that uses a language model.",
        "Haque et al. (2009) et Haque et al. (2010) introduce lexico-syntactic descriptions in the form of supertags as source language context-informed features in a phrase-based SMT and a state-of-the-art hierarchical model, respectively, and report significant gains in translation quality.",
        "Closer to our work, Mauser et al. (2009) and Pa-try and Langlais (2011) train a global lexicon model that predicts the bag of output words from the bag of input words.",
        "As no explicit alignment between input and output words is used, words are chosen based on the (global) input context.",
        "For each input sentence, the decoder considers these word predictions as an additional feature that it uses to define a new model score which favors translation hypotheses containing words predicted by the global lexicon model.",
        "A difference between this approach and our work is that instead of using a global lexicon model, we disambiguate a subset of the words in the input sentence by employing a WSD classifier that creates a probability distribution over the translations of each word in its context.",
        "The unsupervised cross-lingual WSD classifier used in this work is similar to the one proposed in Apidianaki (2009).",
        "The original classifier disambiguates new instances of words in context by selecting the most appropriate cluster of translations among a set of candidate clusters found in an automatically built bilingual sense inventory.",
        "The sense inventory exploited by the classifier is created by a cross-lingual word sense induction (WSI) method that reveals the senses of source words by grouping their translations into clusters according to their semantic proximity, revealed by a distributional similarity calculation.",
        "The resulting clusters represent",
        "the source words?",
        "candidate senses.",
        "This WSD method gave good results in a word prediction task but, similarly to the work of Vickrey et al. (2005) and of Specia (2006), the predictions are not integrated into a complete MT system."
      ]
    },
    {
      "heading": "3 The WSD classifier",
      "text": [
        "Our WSD classifier is a variation of the one introduced in Apidianaki (2009).",
        "The main difference is that here the classifier serves to discriminate between unclustered translations of a word and to assign a probability to each translation for new instances of the word in context.",
        "Each translation is represented by a source language feature vector that the classifier uses for disambiguation.",
        "All experiments carried out in this study are for the English (EN) - French (FR) language pair."
      ]
    },
    {
      "heading": "3.1 Source Language Feature Vectors",
      "text": [
        "Preprocessing The information needed by the classifier is gathered from the EN-FR training data provided for the IWSLT?11 evaluation task.",
        "The dataset consists of 107,268 parallel sentences, word-aligned in both translation directions using GIZA++ (Och and Ney, 2003).",
        "We disambiguate EN words found in the parallel corpus that satisfy the set of criteria described below.",
        "Two bilingual lexicons are built from the alignment results and filtered to eliminate spurious alignments.",
        "First, translation correspondences with a probability lower than a threshold are discarded;2 then translations are filtered by part-of-speech (PoS), keeping for each word only translations pertaining to the same grammatical category;3 finally, only intersecting alignments (i.e., correspondences found in the lexicons of both directions) are retained.",
        "Given that the lexicons contain word forms, the intersection is calculated based on lemmatization information in order to perform a generalization over the contents of the lexicons.",
        "For instance, if the EN",
        "icon built after tagging both parts of the training corpus with TreeTagger (Schmid, 1994).",
        "nine singular form of the adjective habituel) in the EN-FR lexicon, but is found to translate habituel (masculine singular form) in the other direction, the EN-FR correspondence regular/habituelle is retained (because the two variants of the adjective are reduced to the same lemma).",
        "All lexicon entries satisfying the above criteria are retained and used for disambiguation.",
        "In these initial experiments, we disambiguate English words having less than 20 French translations in the lexicon.",
        "Each French translation of an English word that appears more than once in the training corpus4 is characterized by a weighted English feature vector built from the training data.",
        "Vector building The feature vectors corresponding to the translations are built by exploiting information from the source contexts (Apidianaki, 2008; Grefen-stette, 1994).",
        "For each translation of an EN word w, we extract the content words that co-occur with w in the corresponding source sentences of the parallel corpus (i.e. the content words that occur in the same sentence as w whenever it is translated by this translation).",
        "The extracted source language words constitute the features of the vector built for the translation.",
        "For each translation Ti of w, let N be the number of features retained from the corresponding source context.",
        "Each feature Fj (1 ?",
        "j ?",
        "N) receives a total weight tw(Fj,Ti) defined as the product of the feature's global weight, gw(Fj), and its local weight with that translation, lw(Fj,Ti):",
        "The global weight of a feature Fj is a function of the number Ni of translations (Ti?s) to which Fj is related, and of the probabilities (pi j) that Fj co-occurs with instances of w translated by each of the Ti?s:",
        "(2) Each of the pi j's is computed as the ratio between the co-occurrence frequency of Fj with w when translated as Ti, denoted as cooc frequency(Fj,Ti),",
        "and the total number of features (N) seen with Ti:",
        "Finally, the local weight lw(Fj,Ti) between Fj and Ti directly depends on their co-occurrence frequency:"
      ]
    },
    {
      "heading": "3.2 Cross-Lingual WSD",
      "text": [
        "The weighted feature vectors corresponding to the different translations of an English word are used for disambiguation.5 As noted in Section 3.1, we disambiguate source words satisfying a set of criteria.",
        "Disambiguation is performed by comparing the vector associated with each translation to the new context of the words in the input sentences from the IWSLT?11 test set.",
        "More precisely, the information contained in each vector is exploited by the WSD classifier to produce a probability distribution over the translations, for each new instance of a word in context.",
        "We disambiguate word forms (not lemmas) in order to directly use the selected translations in the translated texts.",
        "However, we should note that in some cases this reduces the role of WSD to distinguishing between different forms of one word and no different senses are involved.",
        "Using more abstract representations (corresponding to senses) is one of the perspectives of this work.",
        "The classifier assigns a score to each translation by comparing information in the corresponding source vector to information found in the new context.",
        "Given that the vector features are lemmatized, the new context is lemmatized as well and the lemmas of the content words are gathered in a bag of words.",
        "The adequacy of each translation for a new instance of a word is estimated by comparing the translation's vector with the bag of words built from the new context.",
        "If common features are found between the new context and a translation vector, an association score is calculated corresponding to the mean of the weights of the common features relatively to the translation (i.e. found in its vector).",
        "In 5The vectors are not used for clustering the translations as in Apidianaki (2009) but all translations are considered as candidate senses.",
        "Equation (5), (CFj)|CF |j=1 is the set of common features between the translation vector Viand the new context C and tw is the weight of a CF with translation Ti (cf. formula (1)).",
        "The scores assigned to the different translations of a source word are normalized to sum up to one.",
        "In this way, a subset of the words that occur in the input sentences from the test set are annotated with their translations and the associated scores (contextual probabilities), as shown in the example in Figure 1.6 The WSD classifier makes predictions only for the subset of the words found in the source part of the parallel test set that were retained from the initial EN-FR lexicon after filtering.",
        "Table 1 presents the total coverage of the WSD method as well as its coverage for words of different PoS, with a focus on content words.",
        "We report the number of disambiguated words for each content PoS (cf. third column) and the corresponding percentage, calculated on the basis of the total number of words pertaining to this PoS (cf. second column).",
        "We observe that the coverage of the method on nouns and adjectives is higher than the one on verbs.",
        "Given the rich verbal morphology of French, several verbs have a very high number of translations in the bilingual lexicon (over 20) and are not handled during disambiguation.",
        "The same applies to function words (articles, prepositions, conjunctions, etc.)",
        "included in the ?all PoS?",
        "category."
      ]
    },
    {
      "heading": "4 Integrating Semantics into SMT",
      "text": [
        "In this section, we present two ways to integrate WSD predictions into an SMT decoder.",
        "The first one (Section 4.1) is a simple method based on n-best reranking.",
        "This method, already proposed in the literature (Specia et al., 2008), allows us to easily evaluate the impact of WSD predictions on automatic translation quality.",
        "The second one (Section 4.2) builds on the idea, introduced in (Crego et al., 2010), of using an additional language model to 6Some source words are tagged with only one translation (e.g. stones {pierres(1.000)}) because their other translations in the lexicon occurred only once in the training corpus and, consequently, were not considered.",
        "you know, one of the intense {intenses(0.305), forte(0.306), intense(0.389)} pleasures of travel {transport(0.334), voyage(0.332), voyager(0.334)} and one of the delights of ethnographic research {recherche(0.225), research(0.167), e?tudes(0.218), recherches(0.222), e?tude(0.167)} is the opportunity {possibilite?",
        "(0.187), chance(0.185), opportunite?s(0.199), occasion(0.222), opportunite?",
        "(0.207)} to live amongst those who have not forgotten {oubli(0.401), oublie?s(0.279), oublie?e(0.321)} the old {ancien(0.079), a?ge(0.089), anciennes(0.072), a?ge?es(0.100), a?ge?s(0.063), an-cienne(0.072), vieille(0.093), ans(0.088), vieux(0.086), vieil(0.078), anciens(0.081), vieilles(0.099)} ways {fac?ons(0.162), manie`res(0.140), moyens(0.161), aspects(0.113), fac?on(0.139), moyen(0.124), manie`re(0.161)} , who still feel their past {passe?e(0.269), autrefois(0.350), passe?",
        "(0.381)} in the wind {e?olienne(0.305), vent(0.392), e?oliennes(0.304)} , touch {touchent(0.236), touchez(0.235), touche(0.235), toucher(0.293)} it in stones {pierres(1.000)} polished by rain {pluie(1.000)} , taste {gou?t(0.500), gou?ter(0.500)} it in the bitter {amer(0.360), ame`re(0.280), amertume(0.360)}",
        "directly integrate the prediction of the WSD system into the decoder."
      ]
    },
    {
      "heading": "4.1 N-best List Reranking",
      "text": [
        "A simple way to influence translation hypotheses selection with WSD information is to use the WSD probabilities of translation variants to produce an additional feature appended to the n-best list after its generation.",
        "The feature value should reflect the degree to which a particular hypothesis includes proposed WSD variants for the respective words.",
        "Rerunning the standard MERT optimization procedure on the augmented features gives a new set of model weights, that are used to rescore the n-best list.",
        "We propose the following method of features construction.",
        "Given the phrase alignment information between a source sentence and a hypothesis, we verify if one or more of the proposed WSD variants for the source word occur in the corresponding phrase of the translation hypothesis.",
        "If this is the case, the corresponding probabilities are additively accumulated for the current hypothesis.",
        "At the end, two features are appended to each hypothesis in the n-best list: the total score accumulated for the hypothesis and the same score normalized by the number of words in the hypothesis.",
        "Two MERT initialization schemes were considered: (1) all model weights are initialized to zero, and (2) all the weights of ?standard?",
        "features are initialized to the values found by MERT and the new WSD features to zero."
      ]
    },
    {
      "heading": "4.2 Local Language Models",
      "text": [
        "We propose to adapt the approach introduced in Crego et al. (2010) as an alternative way to integrate the WSD predictions within the decoder: for each sentence to be translated, an additional language model (LM) is estimated and taken into account during decoding.",
        "As this additional ?local?",
        "model depends on the source sentence, it can be used as an external source of knowledge to reinforce translation hypotheses complying with criteria predicted from the whole source sentence.",
        "For instance, the unigram probabilities of the additional LM can be derived from the (word) predictions of a WSD system, bigram probabilities from the prediction of phrases and so on and so forth.",
        "Although this approach was suggested in (Crego et al., 2010), this",
        "is, to the best of our knowledge, the first time it is experimentally validated.",
        "In practice, the predictions of the WSD system described in Section 3 can be integrated by defining, for each sentence, an additional unigram language model as follows: ?",
        "each translation predicted by the WSD classifier can be generated by the language model with the probability estimated by the WSD classifier; no information about the source word that has been disambiguated is considered; ?",
        "the probability of unknown words is set to a small arbitrary constant.",
        "Even if most of the words composing the translation hypothesis are considered as unknown words, hypotheses that contain the words predicted by the WSD system still have a higher LM score and are therefore preferred.",
        "Note that even if we only use unigram language models in our experiments, as senses are predicted at the word level, our approach is able to handle disambiguation of phrases as well.",
        "This approach has two main advantages over existing ways to integrate WSD predictions in an SMT system.",
        "First, no hard decisions are made: errors of the WSD can be ?corrected?",
        "by the translation.",
        "Second, sense disambiguation at the word level is naturally and automatically propagated at the phrase level: the additional LM is influencing all phrase pairs using one of the predicted words.",
        "Compared to the reranking approach introduced in the previous section, this method results in a tighter integration with the decoder.",
        "In particular, the WSD predictions are applied before search-space pruning and are therefore expected to have a more important role."
      ]
    },
    {
      "heading": "5 Evaluation",
      "text": []
    },
    {
      "heading": "5.1 Experimental Setting",
      "text": [
        "In all our experiments, we considered the TED-talk English to French data set provided by the IWSLT?11 evaluation campaign, a collection of public speeches on a variety of topics.",
        "We used the Moses decoder (Koehn et al., 2007).",
        "The TED-talk corpus is a small data set made of a monolingual corpus (111,431 sentences) used to estimate a 4-gram language model with KN-smoothing, and a bilingual corpus (107,268 sentences) used to extract the phrase table.",
        "All data are tokenized, cleaned and converted to lowercase letters using the tools provided by the WMT organizers.7 We then use a standard training pipeline to construct the translation model: the bitext is aligned using GIZA++, symmetrized using the grow-diagfinal-and heuristic; the phrase table is extracted and scored using the tools distributed with Moses.",
        "Finally, systems are optimized using MERT on the 934 sentences of the dev-2010 set.",
        "All evaluations are performed on the 1,664 sentences of the test-2010 set."
      ]
    },
    {
      "heading": "5.2 Baseline",
      "text": [
        "In addition to the models introduced in Section 4, we considered two other supplementary models as baselines.",
        "The first one uses the IBM 1 model estimated during the SMT system training as a simple WSD system: for each source sentence, a unigram additional language model is defined by taking, for each source, the 20 best translations according to the IBM 1 model and their probability.",
        "Model 1 has been shown to be one of the best performing features to be added to an SMT system in a reranking step (Och et al., 2004) and can be seen as a naive WSD classifier.",
        "To test the validity of our approach, we replicate the ?oracle?",
        "experiments of Crego et al. (2010) and estimate the best gain our method can achieve.",
        "These experiments consist in using the reference to train a local n-gram language model (with n in the range 1 to 3) which amounts, in the local language model method of Section 4.2, to assuming that the WSD system correctly predicted a single translation for each source word."
      ]
    },
    {
      "heading": "5.3 Results",
      "text": [
        "Table 2 reports the results of our experiments.",
        "It appears that, for the considered task, sense disambiguation improves translation performance: n-best rescoring results in a 0.37 BLEU improvement and using an additional language model brings about an improvement of up to a 0.88 BLEU.",
        "In both cases, MERT assigns a large weight to the additional fea",
        "tures during tuning.",
        "When rescoring n-best, an improvement is observed only when the weights are initialized to zero and not to the weights resulting from the previous optimization, maybe because of the difficulty to exit the local minimum MERT had found earlier.",
        "As expected, integrating the WSD predictions with an additional language model results in a larger improvement than simple rescoring, which shows the importance of applying this new source of information early in the translation pipeline, before search space pruning.",
        "Also note that the system using the IBM 1 predictions is outperformed by the system using the WSD classifier introduced in Section 3, showing the quality of its predictions.",
        "Oracle experiments stress the high potential of the method introduced in (Crego et al., 2010) as a way to integrate external sources of knowledge: all three conditions result in large improvements over the baseline and the proposed methods.",
        "It must, however, be noted that contrary to the WSD method introduced in Section 3, these oracle experiments rely on sense predictions for all source words and not only content words.",
        "Surprisingly enough, predicting phrases instead of words results only in a small improvement.",
        "Additional experiments are required to explain why 2-gram oracle achieved such a low performance."
      ]
    },
    {
      "heading": "5.4 Contrastive lexical evaluation",
      "text": [
        "All the measures used for evaluating the impact of WSD information on translation show improvements, as discussed in the previous section.",
        "We complement these results with another measure of translation performance, proposed by Max et al. (2010), which allows for a more fine-grained contrastive evaluation of the translations produced by different systems.",
        "The method permits to compare the results produced by the systems on different word classes and to take into account the source words that were actually translated.",
        "We focus this evaluation on the classes of content words (nouns, adjectives, verbs and adverbs) on which WSD had an important coverage.",
        "Our aim is, first, to explore how these words are handled by a WSD-informed SMT system (the system using the local language models) compared to the baseline system that does not exploit any semantic information; and, second, to investigate whether their disambiguation influences the translation of surrounding non-disambiguated words.",
        "Table 3 reports the percentage of words correctly translated by the semantically-informed system within each content word class: consistent gains in translation quality are observed for all parts-of-speech compared to the baseline, and the best results are obtained for nouns.",
        "ambiguated word w (noun, verb, adjective or adverb) in the text are handled by the two systems.",
        "More precisely, we look at the translation of words in the immediate context of w, i.e. at positions w?2, w?1, w+1 and w+2.",
        "The left column reports the percentage of correct translations produced by the baseline system (without disambiguation) for words in these positions; the right column shows the positive impact that the disambiguation of a word has on the translation of its neighbors.",
        "Note that this time we look at disambiguated words and their context without evaluating the correctness of the WSD predictions.",
        "Nevertheless, even in this case, consistent gains are observed when WSD information is exploited.",
        "For instance, when a noun is disambiguated, 70.46% and 76.3% of the immediately preceding (w?1) and following (w+1) words, respectively, are correctly translated, versus 68.69% and 75.17% of correct translations produced by the baseline system."
      ]
    },
    {
      "heading": "6 Conclusion and future work",
      "text": [
        "The preliminary results presented in this paper on integrating cross-lingual WSD into a state-of-the-art SMT system are encouraging.",
        "Both adopted approaches (n-best rescoring and local language modeling) benefit from the predictions of the proposed cross-lingual WSD classifier.",
        "The contrastive evaluation results further show that WSD improves not only the translation of disambiguated words, but also the translation of neighboring words in the input texts.",
        "We consider various ways for extending this work.",
        "First, future experiments will involve the use of more abstract representations of senses than individual translations, by applying a cross-lingual word sense induction method to the training corpus prior to disambiguation.",
        "We will also experiment with disambiguation at the level of lemmas, to reduce sparseness issues, and with different ways for handling lemmatized predictions by the SMT systems.",
        "Furthermore, we intend to extend the coverage of the WSD method by exploring other filtering methods for cleaning the alignment lexicons, and by addressing the disambiguation of words of all PoS."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work was partly funded by the European Union under the FP7 project META-NET (T4ME), Contract No.",
        "249119, and by OSEO, the French agency for innovation, as part of the Quaero Program."
      ]
    }
  ]
}
