{
  "info": {
    "authors": [
      "Dana Dannélls",
      "Lars Borin"
    ],
    "book": "Proceedings of the 6th Workshop on Language Technology for Cultural Heritage, Social Sciences, and Humanities",
    "id": "acl-W12-1004",
    "title": "Toward Language Independent Methodology for Generating Artwork Descriptions – Exploring FrameNet Information",
    "url": "https://aclweb.org/anthology/W12-1004",
    "year": 2012
  },
  "references": [
    "acl-L08-1340",
    "acl-P03-1068",
    "acl-W09-0302"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Today museums and other cultural heritage institutions are increasingly storing object descriptions using semantic web domain ontologies.",
        "To make this content accessible in a multilingual world, it will need to be conveyed in many languages, a language generation task which is domain specific and language dependent.",
        "This paper describes how semantic and syntactic information such as that provided in a framenet can contribute to solving this task.",
        "It is argued that the kind of information offered by such lexical resources enhances the output quality of a multilingual language generation application, in particular when generating domain specific content."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Today museums and other cultural heritage institutions are increasingly storing object descriptions using structured information representation formats, such as semantic web domain ontologies.",
        "To make such cultural heritage content accessible to different groups and individuals in a multilingual world, this information will need to be conveyed in textual or spoken form in many languages, a language generation task which is domain specific and language dependent.",
        "Generating multilingual natural language texts from domain specific semantic representations, such as semantic web domain ontologies, is a task which involves lexicalization and syntactic realization of the discourse relations.",
        "This paper deals with the syntactic realization problem, which is best illustrated with an example.",
        "Consider the possible formulations of the semantic relation Create_representation that has been lexicalized with the English verb paint:",
        "1.",
        "Leonardo da Vinci painted this scene.",
        "2.",
        "The lovely Sibyls were painted in the last century.",
        "3.",
        "The Gerichtsstube was painted by Kuhn in",
        "1763.",
        "The syntactic structure of each sentence differs in terms of the semantic roles of the verb arguments and other constituents of the sentence.",
        "The first sentence contains the semantic roles Creator and Represented, the second sentence contains Represented and Time, and in the third sentence we find Creator, Represented and Time.",
        "As the examples show there are several ways of semantically characterizing the situation expressed by a verb, with implications for the syntactic realization of that verb.",
        "When generating natural language from semantic web ontologies it is important to find generic strategies that allow us to identify the semantic elements of a verb and associate them with the appropriate argument realization of that verb.",
        "This is particularly relevant in multilingual settings because the semantic and syntactic behavior of verbs will vary depending on the target language, both in the constructions found and in their distribution.",
        "Previous work on natural language generation of cultural heritage information from semantic web ontologies has relied on a large amount of specially tailored manual linguistic information to produce descriptions that are targeted to a specific group of readers (Androutsopoulos et al., 2001; Dan",
        "n?lls, 2008; Konstantopoulos et al., 2009).",
        "Although valuable information for generating natural languages is found in computational lexical-semantic resources such as the Berkeley FrameNet (section 3) which exist today in several languages (Erk et al., 2003; Subirats and Petruck, 2003; Ohara et al., 2003; Borin et al., 2010), there has been little emphasis on how to manage digitized data from digital libraries using these open source resources.",
        "In this paper we demonstrate how the information available in such electronically available resources can be exploited for generating multilingual artwork descriptions.",
        "In the remainder of this paper we describe a case study on English and Swedish that underscores the importance of using a lexical resource such as a framenet (section 2).",
        "We present the kind of information that is offered by two existing framenets (section 3).",
        "We demonstrate how a domain specific natural language generator can benefit from the information that is available in both framenets (section 4).",
        "We end with a discussion and pointers to future work (section 5)."
      ]
    },
    {
      "heading": "2 Data Collection and Text Analysis",
      "text": []
    },
    {
      "heading": "2.1 Corpus Data",
      "text": [
        "To identify the semantic and syntactic constructions that characterize object descriptions in the cultural heritage domain, we have collected parallel texts from Wikipedia in two languages: English and Swedish.",
        "In total, we analyzed 40 parallel texts that are available under the category Painting.",
        "Additionally, we selected object descriptions from digital libraries that are available through on-line museum databases.",
        "The majority of the Swedish descriptions were taken from the World Culture Museum,1 the majority of the English descriptions were collected from the"
      ]
    },
    {
      "heading": "Met Museum.2 2.2 Semantic Analysis",
      "text": [
        "The strategy we employed to analyze the texts follows the approach presented by McKeown (1985) on how to formalize prin",
        "ciples of discourse for use in a computational process.",
        "Seven frame elements have been examined, these include: Location (L), Creator (CR), Representation (RE), Represented (R), Descriptor (D), Time (TI), Type (T).",
        "The text analysis has shown that the following combinations of these major frame elements are the",
        "most common: 1.",
        "RE, T, CR, TI, L, D, R 2.",
        "RE, T, CR, R, TI, L, D 3.",
        "RE, TI, T, CR, D, L, R 4.",
        "RE, TI, CR, D, R, L",
        "The listed semantic combinations reflect the word order that we have found in the text analysis for the two languages.",
        "However, since many of the analyzed sentences that begin with the object in focus (the Representation) appear in the passive voice, i.e, was painted by, was created by, the word order of these combinations may vary.",
        "Furthermore, not all of the listed semantic elements are mandatory in the object descriptions.",
        "For example, although corresponding to the first combination of semantic elements, the sentence De Hooch probably painted this picture in the early 1660s only contains the frame elements CR, RE and TI."
      ]
    },
    {
      "heading": "2.3 Syntactic Analysis",
      "text": [
        "The texts have been syntactically annotated using the Maltparser (Nivre et al., 2007).",
        "Figure 1 shows two example sentences converted to constituent trees.",
        "This small example shows that there is a difference in how syntactic trees are built for each language.",
        "While in the English sentence the verb was painted is followed by a preposition phrase (PP), the Swedish verb m?lades (the passive form of ?paint?)",
        "is followed by a cardinal number without a preposition (which could be analyzed as an NP)."
      ]
    },
    {
      "heading": "3 Framenets",
      "text": []
    },
    {
      "heading": "3.1 The Berkeley FrameNet",
      "text": [
        "The Berkeley FrameNet (BFN)3 (Fillmore et al., 2003) is an electronic lexical resource based on the notion of Frame Semantics (Fillmore, 1985); we know the meaning of a word through prototypical situations (scenarios) in which the word (called a lexical unit, LU) occurs.",
        "A frame can be described with the help of two types of frame elements (FEs) that are classified in terms of how central they are to a particular frame.",
        "A core element is one that instantiates a conceptually necessary component of a frame while making the frame unique and different from other frames.",
        "On the other hand, a peripheral element does not uniquely characterize a frame and can be instantiated in any semantically appropriate frame.",
        "For example, table 1 describes the lexical units and the frame elements appearing in the frame Create_representation, which has the following definition (from the BFN website): A Creator produces a physical object which is to serve as a Representation of an actual or imagined entity or event, the Represented.",
        "Each lexical unit appearing in the frame carries information about its related frame elements (semantic valency) and their syntactic realizations (syntactic valency).",
        "Examples of the valency patterns that are found for the verb paint are listed in table 2.4 Examples of sentences that can be formed with these semantic and syntactic representations are:",
        "in the Create representation frame for the verb paint.",
        "1.",
        "The Gerichtsstube was painted by Kuhn in 1763.",
        "2.",
        "The youngest girl had her portrait painted by him .",
        "3.",
        "He painted her at least fourteen times."
      ]
    },
    {
      "heading": "3.2 The Swedish FrameNet",
      "text": [
        "BFN has formed the basis for the development of computationally oriented freely available framenets for a number of languages (Boas, 2009), among these the Swedish FrameNet (SweFN) (Borin et al.,",
        "SweFN takes its conceptual backbone from BFN, i.e., the core and peripheral elements are exactly the same for frames appearing in both framenets.",
        "Each frame also contains semantically annotated example sentences from which we can extract syntactic information.",
        "The most notable differences between the frames can be seen from a comparison of table 1 and table 3.",
        "The lexical units in each SweFN frame are linked to the Swedish lexical-semantic resource SALDO (Borin et al., 2008).",
        "SweFN is also organized into a domain hierarchy, with a general domain and at present the two spe",
        "tion, each frame in SweFN is associated with a semantic type and a list of compounds instantiating part of a frame configuration.",
        "Syntactic valency information is obtained from the Swedish Simple and Parole lexicons (Lenci et al., 2000).",
        "The encoding of this valency information is different from the one provided in BFN.",
        "For example, for the verb avbilda ?depict?",
        "we find the following syntactic valency: S_NP_A/x [vb] DO_NP_B/y S denotes the subject of the sentence, DO denotes direct object.",
        "Both are realized as either animate (A, B) or inanimate (x, y) NPs.",
        "In addition, it is possible to extract almost the same information about semantic and syntactic valency from the example sentences for the verb avbilda (table 4).",
        "It is important to note that the syntactic annotation in SweFN does not follow the BFN model, although we use the same annotation scheme here to facilitate comparison.",
        "Examples of sentences that can be formed using the semantic and syntactic representations listed in table 4 are:",
        "in the Create representation frame for the verb avbilda ?depict?.",
        "1.",
        "Det f?rra ?rhundradet hade han avbildat konstn?rinnan Anna Maria Ehrenstrahl.",
        "?The previous century had he depicted the-female-artist Anna Maria Ehrenstrahl.?",
        "2.",
        "H?r avbildas Gustav Adolf."
      ]
    },
    {
      "heading": "4.1 The Language Generator Tool",
      "text": [
        "We have developed a domain specific grammar application to generate multilingual artwork descriptions from domain specific ontologies.",
        "The application is developed in the Grammatical Framework (GF) (Ranta, 2004).",
        "The key feature of GF is the distinction between an abstract syntax, which acts as a semantic interlingua, and concrete syntaxes, representing linearizations in various target languages, natural or formal.",
        "The grammar comes with a resource library which aids the development of new grammars for specific domains by providing syntactic operations for basic grammatical constructions (Ranta, 2009).",
        "The information available in BFN and SweFN on semantic elements and their possible syntactic realizations with specific lexical units has guided the (manual) development of the generation grammars.",
        "Below we present the abstract and the concrete grammars of English and Swedish for the semantic elements RE, CR, TI and R. In the abstract grammar we have a list of discourse patterns (DPs), encoded as functions that specify the semantic roles appearing in the pattern.",
        "DP1: representation creator time DP2: creator represented time In the concrete grammars, patterns are lin-earized differently for each language.",
        "Semantic elements listed in each DP are expressed",
        "linguistically with the resource grammar constructors.",
        "In the examples below we find six of the GF constructors: mkPhr (Phrase), mkS (Sentence), mkCl (Clause), mkNP (Noun Phrase), mkVP (Verb Phrase), mkAdv (Verb Phrase modifying adverb).",
        "The lexicons which we use to lexicalize the verbs and the semantic elements are the OALD for English and SALDO for Swedish.",
        "When used for generating sentences, the above grammatical representations will yield syntactic trees with the structures exemplified in figure 1 above."
      ]
    },
    {
      "heading": "4.2 Linguistic Realisations from Framenets",
      "text": [
        "The advantage of the implementation strategy presented in section 4.1 is that we can build different syntactic trees for each language to form a description regardless of the order of the semantic elements.",
        "Let us consider the lexical-semantic information provided in tables 2 and 4.",
        "This information could be embedded in the application grammar to compute the following linguistic specifications.",
        "These specifications can in turn be used to generate sentences like the following:",
        "The discourse patterns can be automatically modified to compute a variety of linguistic specifications that are acquired from lexical-semantic frames."
      ]
    },
    {
      "heading": "5 Summary",
      "text": [
        "This paper has demonstrated the differences in the syntactic realization of verbs in two languages.",
        "We described what kind of semantic and syntactic valency can be obtained from the information given in two framenets to improve syntactic realizations of object descriptions from particular sets of semantic elements.",
        "The cultural heritage domain is a potential application area of a framenet, which we argue is an essential open source resource for generating multilingual object descriptions.",
        "We believe it is possible to establish more efficient processing if the framenet is domain-specific and thereby offers linguistic structures that are specific to the domain, in our case the art domain.",
        "Even though our generation grammars at the moment have been manually constructed using the framenet information, we hope that we have shown the utility of being able to draw on a framenet in developing such applications.",
        "The next logical step will be to attempt to generate (partial) grammars automatically from the framenet information directly.",
        "We also intend to increase the grammars to handle a larger set of semantic frames."
      ]
    }
  ]
}
