{
  "info": {
    "authors": [
      "Pablo Duboue"
    ],
    "book": "INLG 2012 Proceedings of the Seventh International Natural Language Generation Conference",
    "id": "acl-W12-1513",
    "title": "Extractive email thread summarization: Can we do better than He Said She Said?",
    "url": "https://aclweb.org/anthology/W12-1513",
    "year": 2012
  },
  "references": [
    "acl-C04-1079",
    "acl-C04-1128",
    "acl-J02-2001",
    "acl-N04-4027",
    "acl-N06-1027",
    "acl-W01-0719",
    "acl-W04-3240"
  ],
  "sections": [
    {
      "text": [
        "Utica, May 2012. c?2012 Association for Computational Linguistics Extractive email thread summarization: Can we do better than He Said She Said?"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "Human-written, good quality extractive summaries pay great attention to the text intermixing the extracts.",
        "In this work, we focused on the lexical choice for verbs introducing quoted text.",
        "We analyzed 4000+ high quality summaries for a high traffic mailing list and manually assembled 39 quotation-introducing verb classes that cover the majority of the verb occurrences.",
        "A significant amount of the data is covered by ongoing work on email ?speech acts.?",
        "However, we found that one third of the ?tail?",
        "is composed by ?risky?",
        "verbs that most likely will be beyond the state of the art for longer time.",
        "We used this fact to highlight the trade-offs of risk taking in NLG, where interesting prose might come at the cost of unsettling some of the readers."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "High traffic mailing lists pose a challenge to an extended audience laterally interested on the subject matter but unable or unwilling to follow them on everyday minutiae.",
        "In this context, high-level summaries are of great help and in certain cases there are people or companies that step into the plate to provide such service.",
        "In recent years, there has been an ever increasing interest (Muresan et al., 2001; Nenkova and Bagga, 2003; Newman and Blitzer, 2003; Rambow et al., 2004; Wan and McKeown, 2004; McKeown et al., 2007; Ulrich, 2008; Wang et al., 2009) in automating this task, with many works focusing on selectively extracting quotes from key email exchanges.",
        "In this work, we focus on finding appropriate and varied ways to cite selected quotes from the email threads.",
        "A seemingly simple task, this problem touches: speech act detection (Searle, 1975) (question vs. announcement vs. reply), opinion mining (Pang and Lee, 2008) (complained vs. thanked) and citation polarity analysis (Teufel, 1999): (agreed vs. disagreed vs. added).",
        "At this stage, we will show training data we have acquired for the task and a set of manually assembled verb clusters that show the richness of the problem.",
        "Moreover, we have used these clusters to highlight a trade-off of ?risk taking?",
        "in NLG, where generating interesting prose might lead to text that can upset some readers in the presence of errors.",
        "This paper is structured as follows: in the next section we discuss the data from where we obtained the raw verbs and then proceed to describe the manual analysis to cluster and identify ?risky?",
        "verbs.",
        "We then present the whole set of clusters and conclude with a discussion of risk taking in NLG."
      ]
    },
    {
      "heading": "2 Data",
      "text": [
        "This work is part of a larger effort to build automatic tools to replace a key resource that the Linux Kernel development community enjoyed for five years: the Kernel Traffic summaries of the activities in the Linux Kernel mailing list (LKML).",
        "The LKML is of extremely high traffic (300 mails a day on average).",
        "For five years (since 1999), Jack Brown hand-picked the most newsworthy threads in a week time and published a summary for each thread.",
        "The summaries were made available (under a Free Software license) in a rich XML-based format",
        "These summaries were in general followed by a much larger audience than the mailing list itself due to a number of factors including the fact that they make for quite an entertaining read.",
        "Mr. Brown's prose was high quality and quite consistent in style,1 which highlights its potential as training material for NLG.",
        "As Reiter and Sripada (2002) pointed out, learning tasks in NLG profit from training data of the highest possible quality in terms of prose and consistency (as compared with training data for NLU, where robustness comes from exposing the system to a variety of malformed texts).",
        "In our journey to approximate Mr. Brown's work by automatic means, we decided to start on a relatively unstudied problem: introducing quoted references in a rich manner.",
        "In the 4,253 hand written summaries by Mr. Brown (made available in 344 newsletter issues) 95% contain a quote, with an average of 3.28 quotes per summary.",
        "Moreover, 72% of the total characters in the summaries are inside quotes (including markup)."
      ]
    },
    {
      "heading": "2.1 Processing",
      "text": [
        "We employed a processing pipeline implemented in the UIMA framework (Ferrucci and Lally, 2004) to extract the verbs immediately before a quotation.",
        "We used annotators from the OpenNLP project (Apache, 2011) implementing Maximum Entropy models for NLP (Ratnaparkhi, 1998).",
        "For the sentence before a quotation we extracted the word 1A quality of prose that continues with his editorial contributions to Linux Journal and Linux Magazine.",
        "marked with the POS tag ?VBD?",
        "closer to the quotation.",
        "Processing the 334 issues available for Kernel Traffic resulted in 11,634 verb occurrences extracted for 344 verbs (and verb-like errors).",
        "These verbs are the ones we employ for the analysis and inferences drawn in the next section."
      ]
    },
    {
      "heading": "3 Analysis",
      "text": [
        "From the grand-total of 344 verbs (including typos and POS-tagger errors), we took all the verbs that appeared at least a hundred times (the top 55 verbs) and expanded them from the larger list (plus WordNet synsets (Miller, 1995)), grouping them into classes.",
        "The grouping captures synonyms for the particular task of introducing quoted text in summaries.",
        "The resulting 39 classes (Table 1) contain 127 verbs accounting for 96% of the cases (the table contains an ?other?",
        "class with the remaining 217 verbs that account for 4% of the occurrences).",
        "The verbs included from WordNet do not appear in the corpus and thus have a count of zero.",
        "This large set of verbs highlights the many possibilities a system that chooses to go just with ?s/he said?",
        "will be missing.",
        "Moreover, such a system can be immediately enriched with 17 different variations with associated likelihoods.",
        "We determined whether or not generation errors for a given verb class would be ?dangerous?",
        "using the following criteria: If the automatic determination of whether the original quote fell into a particular verb class fails, would the original author take issue with the summary upon reading the misclassified verb?",
        "That is, if the system decides that Brendan Cully (from the example in the introduction) has indeed kafloogitated2 with his reply but such decision was made in error (and Mr. Cully was just remarking or explaining), would Mr. Cully take issue with the summary?",
        "As with any automated system, the possibility of automated mistakes should make its designers err on the side of making more conservative decisions.",
        "Under such desiderata, we think the 10",
        "classes highlighted in Table 1 are thus too ?dangerous?",
        "to be addressed currently by automated means.",
        "Initially, that might not appear such a big loss, as none of them account for more than 1% of the total occurrences.",
        "However, as with many other phenomena in NLP, a few cases account for most occurrences: the clusters for ?said,?",
        "?asked,?",
        "and ?replied?",
        "account for 2/3 of the total occurrences and, overall, the top 9 classes account for 93% of the cases.",
        "From the rich tail that encompasses Mr. Brown prose, the ?dangerous?",
        "classes account for 35% of the cases from position 10 and onward.",
        "It is our opinion that such cases were the reason Mr. Brown's summaries were enjoyable to read and are only a small example of the humor and piquancy behind his prose.",
        "Now, it might be the case such quality will be beyond the state of the art of NLG for quite some time.",
        "In that sense, we consider the prevalence of risky classes as a negative result that highlights a problem for NLG well beyond the task at hand: we, as humans, enjoy text that takes a stand, that argues its points in an opinionated manner.3 Such is the distinction between dull reports and flourish summaries.",
        "Even in the highly technical domain of operating system kernel discussions, Mr. Brown felt the need to use words such as ?groused?",
        "and ?chastised.?",
        "The problem might as well be cultural, with opinionated prose paradigmatic to the Western world.",
        "It might also be related to our culture as NLG practitioners, where we always thrive for perfect output.",
        "Our data shows that to go beyond ?He Said She Said?",
        "in a truly interesting manner we will have to be ready to make mistakes which could make some people unhappy, a trade-off that it would be interesting to see explored more often in NLG."
      ]
    },
    {
      "heading": "4 Related Work",
      "text": [
        "Since the seminal work by Muresan et al. (2001), email summarization and in particular email thread summarization has spanned full dissertations (Ulrich, 2008).",
        "Existing resources for email summarization (Ulrich et al., 2008), however, do not emphasize explicitly the type of quotes being used.",
        "Understandingly, most of the work has been devoted to selecting the particular words, sentences or 3Not unlike this discussion.",
        "paragraphs to extract from the original e-mails.",
        "either by distilling terms or topics (Muresan et al., 2001; Newman and Blitzer, 2003) or finding a representative example (Nenkova and Bagga, 2003; Rambow et al., 2004; Wang et al., 2009).",
        "The issue of choosing how to introduce the extracted text has only been studied in the context of speech act detection (Cohen et al., 2004; Wan and McKeown, 2004) within emails or within threaded discussions (Feng et al., 2006), which is limited to questions, replies and the like (a very important case which covers 2/3 of our available data).",
        "The problem of detecting question / answer pairs in emails is by far the one who has received the most attention in the field (Bickel and Scheffer, 2004; Shrestha and McKeown, 2004; McKeown et al., 2007).",
        "The verbs in each of the classes in Table 1 have a near-synonym relation:4 even though ?recommended?",
        "and ?urged?",
        "share most of their meaning, the differences in style, color and subtle meaning need to be further elucidated for successful lexical choice.",
        "This topic has started to be explored in detail recently (Edmonds and Hirst, 2002).",
        "Our work falls in the larger field of summarization by using NLG means, a discipline that has received significant attention of late (Belz et al., 2009)."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "In this paper, we have brought to the attention of NLG practitioners the rich resource embodied in five years of Kernel Traffic newsletters.",
        "We had also highlighted the richness of the problem of lexical choice for verbs introducing quotations in extractive email summarization.",
        "Moreover, we contributed 39 clusters manually assembled from naturally occurring verbs extracted from 4000+ high quality summaries.",
        "These clusters can enrich even the most straightforward existing systems.",
        "Finally, we argued that, while useful summaries might be around the corner, entertaining summaries will be well beyond the state of the art until the field is willing to take the risk involved in standing behind automatically generated prose with intrinsic value-judgments.",
        "In our ongoing work, we are targeting the creation",
        "choosing that class (speech act detection (A), opinion mining (O) or citation link analysis (C)).",
        "Verbs missing due to space restrictions are in the appendix.",
        "of a systemic fragment for the quotation-introducing verbs, in the style of KPML (Bateman, 1995)."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The author would like to thank the anonymous reviewers as well as Annie Ying for valuable feedback and insights.",
        "He will also like to thank the Debian NYC group for bringing the Kernel Traffic summaries to his attention.",
        "Appendix The verbs omitted for reasons of space in Table 1 are the following: for the ?said?",
        "cluster, mentioned (34), commented (25), wrote (20), noticed (17), spoke (9), expressed (6), showed (5), observed (5), stated (5), asserted (4), referred (1), noted (1), declared (1); for the ?concluded?",
        "cluster, resolved (0); for the ?confirmed?",
        "cluster, corroborated (0), sustained (0), substantiated (0); for the ?complained?",
        "cluster, hollered (1), ranted (1), kvetched (1); for the ?speculated?",
        "cluster, theorized (1), conjectured (0); for the ?exclaimed?",
        "cluster, sputtered (1)."
      ]
    }
  ]
}
