{
  "info": {
    "authors": [
      "Hao Xiong",
      "Qun Liu"
    ],
    "book": "Joint Conference on EMNLP and CoNLL – Shared Task",
    "id": "acl-W12-4506",
    "title": "ICT: System Description for CoNLL-2012",
    "url": "https://aclweb.org/anthology/W12-4506",
    "year": 2012
  },
  "references": [
    "acl-J03-1002",
    "acl-N03-1017",
    "acl-N12-1090",
    "acl-W11-1902",
    "acl-W12-4501"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper, we present our system description for the CoNLL-2012 coreference resolution task on English, Chinese and Arabic.",
        "We investigate a projection-based model in which we first translate Chinese and Arabic into English, run a publicly available coreference system, and then use a new projection algorithm to map the coreferring entities back from English into mention candidates detected in the Chinese and Arabic source.",
        "We compare to a baseline that just runs the English coreference system on the supplied parses for Chinese and Arabic.",
        "Because our method does not beat the baseline system on the development set, we submit outputs generated by the baseline system as our final submission."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Modeling multilingual unrestricted coreference in the OntoNotes data is the shared task for CoNLL2012.",
        "This is an extension of the CoNLL2011 shared task and would involve automatic anaphoric mention detection and coreference resolution across three languages ?",
        "English, Chinese and Arabic ?",
        "using OntoNotes v5.0 corpus, given predicted information on the syntax, proposition, word sense and named entity layers.",
        "Automatic identification of coreferring entities and events in text has been an uphill battle for several decades, partly because it can require world knowledge which is not well-defined and partly owing to the lack of substantial annotated data.",
        "we use Google Translator to translate Chinese and Arabic into English.",
        "For more details, readers can refer to (Pradhan et al., 2012).",
        "Before this year's task, researchers proposed two typical novel methods to address the problem of natural language processing across multiple languages: projection and joint learning (Rahman and Ng, 2012).",
        "Specific to this year's coreference resolution task, for projection based method, we could first develop a strong resolver or utilize a publicly available system on English, and translate other languages into English, eventually, we could project the coreferring entities resolved on English back into other language sides.",
        "Generally, a projection method is easier to develop since it doesn't need sentence alignment across multiple languages.",
        "Thus, in this year's task, we investigate a translation based model to resolve coreference on English, Chinese and Arabic.",
        "The whole process is illustrated in figure 1, in which we first use Google Translator to translate Chinese and Arabic into English, and we then employ a strong English coreference resolver to generate coreferring entities, after mapping entities from English into",
        "Chinese and Arabic mention candidates, we could obtain coreferring entities for these languages.",
        "Intuitively, the performance of coreference resolver on English should perform better than that on Chinese and Arabic since we have substantial corpus for English and coreference resolution on English is well studied compared to another two languages.",
        "Thus we could imagine that projecting the results from English into Chinese and Arabic should still beats the baseline system using monolingual resolution method.",
        "However, in our experiments, we obtain negative results on developing set that means our projection based model perform worse than the baseline system.",
        "According to our experimental results on developing set, finally, we submit results of baseline system in order to obtain better ranking.",
        "The rest of this paper is organized as follows, in section 2, we will introduce our method in details, and section 3 is our experimental results, we draw conclusion in section 4."
      ]
    },
    {
      "heading": "2 Projection based Model",
      "text": [
        "As the last section mentioned, we propose to use a projection based model to resolve coreference on multiple languages.",
        "The primary procedures of our method could be divided into three steps: first step is translation, where Google Translator is employed to translate Chinese and Arabic into English, second is coreference resolution for English, last is the projection of coreferring entities.",
        "Since the first step is clear that we extract sentences from Chinese and Arabic documents and translate them into English using Google Translator, hence in this section we will mainly describe the configuration of our English resolver and details of projection method."
      ]
    },
    {
      "heading": "2.1 English Resolver",
      "text": [
        "In last year's evaluation task, the Standford Natural Language Processing Group ranked the first position and they also open their toolkit for research community, namely Standford CoreNLP (Lee et al., 2011) 1, better yet, their toolkit is optimized for CoNLL task.",
        "Thus we could use their toolkit as our English resolver and concentrate on bettering the projection of coreferring entities.",
        "structure is used to solve the problem that mapping coreferring entities into each mention candidates with highest probability.",
        "We use the basic running script that is ?java -cp",
        "-filelist filelist.txt?",
        "to resolve the resolution, where ?filelist?",
        "involves all documents need to be performed coreference resolution."
      ]
    },
    {
      "heading": "2.2 Projection of Coreferring Entities",
      "text": [
        "After generating coreferring entities on English, the key step of our system is how to map them into mention candidates detected on Chinese and Arabic.",
        "For instance, assuming we translate Chinese documents into English and obtain coreferring entities e1, e2, ei,.., eE on translated English documents through aforementioned step, meanwhile, we consider all noun phrases(NP) in original Chinese documents and generate mention candidates m1, m2, mj ,.., mM .",
        "Therefore, our task is to map each ei into one mention candidate mj with highest probability, and it can be obtained by the max",
        "Algorithm 1 Algorithm for computing similarity between two phrases in different languages.",
        "1: Input: we1 , .., wen , wc1 , .., wcm , Phrase Table PT 2: s[n] = [0,?",
        "inf, ..,?",
        "inf] 3: for i?",
        "1..n do 4: for j ?",
        "0..10 do 5: s[i + j] = max(s[i + j], s[i ?",
        "1] + p(i, i + j)) 6: Output: s[n]V imization of the following formula,",
        "i,j{b(j, i)} = 1, where p(i, j) is the probability of ei mapping into mj and a(i, j) as well as b(i, j) are integers guaranteeing each coreferring entity map into one mention and each mention has only one entity to be mapped into.",
        "To solve this problem, we reduce it as a Cost Flow problem since it is easier to understand and implement compared to other methods such as integer linear programming.",
        "Note that the number of mention candidates is theoretically larger than that of coreferring entities, thus this problem couldn't be reduced as the bipartite graph matching problem since it needs equal number of nodes in two parts.",
        "Figure 2 shows the graph structure designed to solve this problem, where the symbols labeled on each edge is a two tuples(Cost,Flow), indicating the cost and flow for each edge.",
        "Since object of Cost Flow problem is to minimize the cost while maximizing the flows, thus we compute the c(i, j) as 1 ?",
        "p(i, j) in order to be consistent with the equation 1.",
        "To satisfy two constraints aforementioned, we set up two dummy nodes ?Start?",
        "and ?End?, and connect ?Start?",
        "to each entity ei with cost 0 and flow 1 ensuring each entity is available to map one mention.",
        "We also link each mention candidate mj to node ?End?",
        "with the same value ensuring each mention could be mapped into by only one entity.",
        "Clearly, there is an edge with tuple (1?p(i, j), 1) between each entity end mention indicating that each entity could map into any mention while with different probabilities.",
        "Thus, solving this Cost-Flow problem is equal to maximizing the equation 1 with two constraints.",
        "Since Cost-Flow problem is well studied, thus some algorithm can solve this problem in polynomial time (Ahuja et al., 1993).",
        "One may argue that we can modify translation decoder to output alignments between Chinese and translated English sentence, unfortunately, Google Translator API doesn't supply these information while its translation quality is obviously better than others for translating documents in OntoNotes, moreover, it is impossible to output alignment for each word since some translation rules used for directing translation include some unaligned words, thus an algorithm to map each entity into each mention is more applicable.",
        "Clearly, another problem is how to compute p(i, j) for each edge between entity and mention candidate.",
        "This problem could be casted as how to compute similarity of phrases across multiple languages.",
        "Formally, given an English phrases we1 , .., wen and a Chinese phrase wc1 , .., wcm , the problem is how to compute the similar score S between them.",
        "Although we could compute lexical, syntactic or semantic similar score to obtain accurate similarity, here for simplicity, we just compute the lexical similarity using the phrase table extracted by a phrased-based machine translation decoder (Koehn et al., 2003).",
        "Phrase table is a rich resource that contains probability score for phrase in one language translated into another language, thus we could design a dynamic algorithm shown in Algorithm 1 to compute the similar score.",
        "Equation in line 5 is used to reserve highest similar score for its sub-phrases, and p(i, i + j) is the similar score between sub-phrases wi, .., wi+j and its translation.",
        "When we compute the score of the sub-phrases wi, .., wi+j , we literately pick one pti from PT and check whether wc1 , .., wcm involves pti's target side, if that we record its score until we obtain a higher score obtained by another ptj and then update it.",
        "For instance, assuming the Chinese input sentence is ?????????",
        "??",
        "??",
        "?",
        "??",
        "?",
        "??",
        "??",
        "?",
        "?, and the Google translation of this sentence is ?The world 's fifth Disneyland will soon open to the public .",
        "?.",
        "Following the aforementioned steps, we utilize English resolver to find a coreferring entity: ?The world 's fifth Disneyland?, and find two translation rules involving the former English phrase from the",
        "bilingual phrase table: ?The world 's fifth Disneyland => ???????????",
        "(probability=0.6) ?",
        "and ?The world 's fifth Disneyland => ??????????",
        "(probability=0.4)?.",
        "Since the Chinese translation of both rules all contain the noun phrase ???",
        "??",
        "?",
        "???",
        "?",
        "??",
        "in the original Chinese input, we thus add this noun phrase into the coreferring entities as the English resolve finding with the probability 0.6."
      ]
    },
    {
      "heading": "3 Experiments",
      "text": []
    },
    {
      "heading": "3.1 English Results",
      "text": [
        "In this section, we will report our experimental results in details.",
        "We use Standford CoreNLP toolkit to generate results for English.",
        "Table 1 lists the F-score obtained on developing set."
      ]
    },
    {
      "heading": "3.2 Chinese and Arabic Results",
      "text": [
        "As last section mentioned, we first translate Chinese and Arabic into English and then use CoreNLP to resolve coreference on English.",
        "To obtain high translation quality, we use Google Translator Toolkit 2.",
        "And to compute similarity score, we run Giza++(Och and Ney, 2003) 3, an open source toolkit for word alignment, to perform word alignment.",
        "For Chinese, we use 1 million bilingual corpus provided by NIST MT evaluation task to extract phrase table, and for Arabic its size is 2 million.",
        "Note that, we extract phrase table from English to Chinese and Arabic with maximum phrase length 10.",
        "The reason is that our algorithm check English phrase whose length is less than 10 tokens.",
        "To compare our results, we also use CoreNLP to generate results for Chinese and Arabic.",
        "Since CoreNLP use some syntactic knowledge to resolving coreference, it can also output coreferring entities for other languages.",
        "From table 2 we find that although CoreNLP is not designed for other languages, it still obtain acceptable scores and beat our projection based model.",
        "The main reason is that our method is coarse and obtain lower precision for mention detection, while CoreNLP use some manually written rules to detect mention candidates.",
        "Another explanation is that projection based model is hard to map",
        "some phrases back into original languages, such as ?that, it, this?.",
        "Moreover, translation quality for some corpus like web corpus is far from perfect, translation errors will surely affect the precision of coreference resolution.",
        "Thus, for the final testing set, we run the CoreNLP to generate the results."
      ]
    },
    {
      "heading": "3.3 Testing Results",
      "text": [
        "Since CoreNLP beats our system in Chinese and Arabic, thus we run CoreNLP for all three languages.",
        "Table 3 lists the final results, and we also give results using golden parse tree for prediction in table 4.",
        "From these two tables, we find that for any language, the system using golden parse tree show better performance than the one using predicted system in term of each metric.",
        "The reason is that the CoreNLP resolve coreference on parse tree and employ some parse features to corefer.",
        "On the other hand, we could also see that the improvement is slight, because parsing errors affect little on finding mention candidates benefiting from high precision on noun phrase prediction.",
        "Finally, since we use an open source toolkit to generate results, unfortunately, we have no ranking in this task."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "In this paper, we present a projection based model for coreference resolution.",
        "We first translate Chinese and Arabic into English, and then employ a strong English resolver to generate coreferring entities, after that a projection algorithm is designed to map coreferring entities into mention candidates detected in Chinese and Arabic.",
        "However, since our approach is coarse and due to limit time preparing for this task, the output generate by CoreNLP beats our results in three languages, thus we submit results generated by CoreNLP as our final submission."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The authors were supported by National Science Foundation of China, Contracts 90920004, and High-Technology R&D Program (863) Project No 2011AA01A207 and 2012BAH39B03.",
        "We thank organizers for their generous supplied resources and arduous preparation.",
        "We also thank anonymous reviewers for their thoughtful suggestions."
      ]
    }
  ]
}
