{
  "info": {
    "authors": [
      "Martin Riedl",
      "Chris Biemann"
    ],
    "book": "NAACL",
    "id": "acl-N12-1064",
    "title": "How Text Segmentation Algorithms Gain from Topic Models",
    "url": "https://aclweb.org/anthology/N12-1064",
    "year": 2012
  },
  "references": [
    "acl-A00-2004",
    "acl-E06-1035",
    "acl-J02-1002",
    "acl-N09-1040",
    "acl-P01-1064",
    "acl-P03-1071",
    "acl-P08-2068",
    "acl-P94-1002"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper introduces a general method to incorporate the LDA Topic Model into text segmentation algorithms.",
        "We show that semantic information added by Topic Models significantly improves the performance of two word-based algorithms, namely TextTiling and C99.",
        "Additionally, we introduce the new TopicTil-ing algorithm that is designed to take better advantage of topic information.",
        "We show consistent improvements over word-based methods and achieve state-of-the art performance on a standard dataset."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Texts are often structured into segments to ease understanding and readability of texts.",
        "Knowing about sentence boundaries is advantageous for natural language processing (NLP) tasks such as summarization or indexing.",
        "While many genres such as en-cyclopedia entries or scientific articles follow rather formal conventions of breaking up a text into meaningful units, there are plenty of electronically available texts without defined segments, e.g. web documents.",
        "Text segmentation is the task of automatically segmenting texts into parts.",
        "Viewing a well-written text as sequence of subtopics and assuming that subtopics correspond to segments, a segmentation algorithm needs to find changes of subtopics to identify the natural division of an unstructured text.",
        "In this work, we utilize semantic information from Topic Models (TMs) to inform text segmentation algorithms.",
        "For this, we compare two early word-based algorithms with their topic-based variants, and construct our own algorithm called Topic-Tiling.",
        "We show that using topics estimated by Latent Dirichlet Allocation (LDA) in lieu of words substantially improves earlier segmentation algorithms.",
        "In comparison to TextTiling (TT), neither smoothing nor a blocksize or window size is needed.",
        "TT using TMs and our own algorithm improve on the state-of-the-art for a standard dataset, while being conceptually simpler and computationally more efficient than other topic-based segmentation algorithms."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Based on the observation of Halliday and Hasan (1976) that the density of coherence relations is higher within segments than between segments, most algorithms compute a coherence score to measure the difference of textual units for informing a segmentation decision.",
        "TextTiling (TT) (Hearst, 1994) relies on the simplest coherence relation ?",
        "word repetition ?",
        "and computes similarities between textual units based on the similarities of word space vectors.",
        "With C99 (Choi, 2000) an algorithm was introduced that uses a matrix-based ranking and a clustering approach in order to relate the most similar textual units and to cluster groups of consecutive units into segments.",
        "Both TT and C99 characterize textual units by the words they contain.",
        "Galley et al. (2003) showed that using TF-IDF term weights in the term vector improves the performance of TT.",
        "Proposals using Dynamic Programming (DP) are given in (Utiyama and Isahara, 2001; Fragkou et al., 2004).",
        "Related to our work are the approaches described in (Misra et al., 2009; Sun et al., 2008): here, TMs are also used to alleviate the sparsity of word vectors.",
        "Misra et al. (2009) extended the DP algorithm U00 from Utiyama and Isahara (2001) us",
        "ing TMs.",
        "At this, the topic assignments have to be inferred for each possible segment, resulting in high computational cost.",
        "In addition to these linear topic segmentation algorithms, there are hierarchical segmentation algorithms, see (Yaari, 1997; Hsueh et al., 2006; Eisenstein, 2009).",
        "For topic modeling, we use the widely applied LDA (Blei et al., 2003).",
        "This generative probabilistic model uses a training corpus of documents to create document-topic and topic-word distributions and is parameterized by the number of topics N as well as by two hyperparameters.",
        "To generate a document d the topic proportions are drawn using a Dirichlet distribution with hyperparameter ?.",
        "Adjacent for each word i a topic zdi is chosen according to a multinomial distribution using hyperparameter ?zdi .",
        "Unseen documents can be annotated with an existing TM using Bayesian inference methods (here: Gibbs sampling)."
      ]
    },
    {
      "heading": "3 Method: From Words to Topics",
      "text": [
        "The underlying mechanism described here is very simple: Instead of using words directly as features to characterize textual units, we use the topic IDs assigned by Bayesian inference.",
        "LDA inference assigns a topic ID to each word in the test document in each inference iteration step, based on a TM estimated on a training corpus.",
        "We use the topic ID, lastly assigned to each word.",
        "This might lead to instabilities as a word with high probabilities for several topics could be assigned to different topics in different inference iterations.",
        "To avoid these instabilities, we save all topic IDs assigned to a word for each inference iteration.",
        "Finally, the most frequent topic ID is assigned to each word.",
        "This mechanism we call the mode method.",
        "Both word replacements can be applied to most segmentation algorithms.",
        "In this work, we use this general setup to implement topic-based versions of TT and C99 and develop a new TextTiling-based method called Topic-Tiling."
      ]
    },
    {
      "heading": "4 Topic-based Segmentation Algorithms",
      "text": []
    },
    {
      "heading": "4.1 TextTiling using Topic Models",
      "text": [
        "In TextTiling (TT) (Hearst, 1994) using topic IDs (TTLDA), a document D, which is subject to segmentation, is represented as a sequence of n topic IDs1.",
        "TT splits the document into topic-sequences, instead of sentences, where each sequence consists of w topic IDs.",
        "To calculate the similarity between two topic-sequences, called sequence-gap, TT uses k topic-sequences, named block, to the left and to the right of the sequence gap.",
        "This parameter k defines the so-called blocksize.",
        "The cosine similarity is applied to computed a similarity score based on the topic frequency of the adjacent blocks at each sequence-gap.",
        "A value close to 1 indicates a high similarity among two blocks, a value close to zero denotes a low similarity.",
        "Then for each sequence-gap a depth score di is calculated for describing the sharpness of a gap, by di = 1/2(hl(i)?si+hr(i)?",
        "si).",
        "The function hl(i) returns the highest similarity score on the left side of the sequence-gap index i that does not increase and hr(i) returns the highest score on the right side.",
        "Then all local maxima positions are searched based on the depth scores.",
        "In the next step, these obtained maxima scores are sorted.",
        "If the number of segments n is given as input parameter, the n highest depth scores are used, otherwise a cut-off function is used that applies a segment only if the depth score is larger than ?",
        "?",
        "?/2, where mean ?",
        "and the standard deviation ?",
        "are calculated based on the entirety of depth scores.",
        "As TT calculates the depth on every topic-sequence using the highest gap, this could lead to a segmentation in the middle of a sentence.",
        "To avoid this, a final step ensures that the segmentation is positioned at the nearest sentence boundary."
      ]
    },
    {
      "heading": "4.2 C99 using Topic Models",
      "text": [
        "For the C99 algorithm (Choi, 2000), named (C99LDA) when using topic IDs, the text is divided into minimal units on sentence boundaries.",
        "A similarity matrix Sm?m is computed, where m denotes the number of units (sentences).",
        "Every element sij is calculated using the cosine similarity between unit i and j.",
        "Next, a rank matrix R is computed to improve the contrast of S: Each element rij contains the number of neighbors of sij that have lower similarity scores then sij itself.",
        "In a final step a top-down clustering algorithm is performed to split the docu",
        "rithm starts with the whole document considered as one segment and splits off segments until the stop criteria are met, e.g. the number of segments or a similarity threshold."
      ]
    },
    {
      "heading": "4.3 TopicTiling",
      "text": [
        "TopicTiling is a new TextTiling-based algorithm and is adjusted to use TMs.",
        "As we have found in data analysis, it is frequently the case that a topic dominates within a sampling unit (sentence), and that units from the same segment frequently are dominated by the same topic.",
        "In contrast to word-based representations, we expect no need to face sparsity issues that require smoothing methods (see TT) and ranking methods (see C99), which allows us to simplify the algorithm.",
        "Initially, the document is split into minimal units on sentence boundaries.",
        "To measure the coherence between units, the cosine similarity (vector dot product) between two adjacent sentences is computed.",
        "Each sentences s is represented as a N dimensional vector, where N is the number of topics defined in the TMs.",
        "The i-th element of the vector contains the number of times the i-th topic is observed in the sentence.",
        "In comparison to TT we search all local minima based on these similarity scores and calculate for these positions the depth score as described in TT.",
        "If the number of segments is known in advance, the segments of the n-highest depth-scores are used, otherwise the cut-off score criteria used in TT is adapted."
      ]
    },
    {
      "heading": "5 Evaluation",
      "text": [
        "As laid out in Section 3, a LDA Model is estimated on a training dataset and used for inference on the test set.",
        "To ensure that we do no use information from the test set, we perform a 10-fold Cross Validation (CV) for all reported results.",
        "To reduce the variance of the shown results, derived by the random nature of sampling and inference, the results for each fold are calculated 30 times using different LDA models.",
        "The LDA model is trained with N=100 topics, 500 sampling iterations and symmetric hyperparameters as recommended by Griffiths and Steyvers (2004)(?=50/N and ?=0.01), using JGibb-sLda (Phan and Nguyen, 2007).",
        "For the annotation of unseen data with topic information, we use LDA inference, sampling 100 iterations.",
        "Inference is executed sentence-wise, since sentences form the minimal unit of our segmentation algorithms and we cannot use document information in the test setting.",
        "The performance of the algorithms is measured using Pk and WindowDiff (WD) metrics (Beeferman et al., 1999; Pevzner and Hearst, 2002).",
        "The C99 algorithm is initialized with a 11?11 ranking mask, as recommended in Choi (2000).",
        "TT is configured according to Choi (2000) with sequence length w=20 and block size k=6."
      ]
    },
    {
      "heading": "5.1 Data Set",
      "text": [
        "For evaluation, we rely on the Choi data set (Choi, 2000), which has been used in several other text segmentation approaches to ensure comparability.",
        "This data set is generated artificially using the Brown corpus and consists of 700 documents.",
        "Each document consists of 10 segments.",
        "For its generation, 3?11 sentences are sequentially extracted from a randomly selected document and merged together.",
        "While our CV evaluation setting is designed to avoid using the same documents for training and testing, this cannot be guaranteed as the segments within the documents generated by Choi are included in several documents.",
        "This problem also occurs in other approaches, but has not be described in (Fragkou et al., 2004; Misra et al., 2009; Galley et al., 2003), where parts or the whole dataset are used for training either TF-IDF values or topic models."
      ]
    },
    {
      "heading": "5.2 Results",
      "text": [
        "For the experiments the C99 and TT implementations2 are executed in two settings: using words and using topics.",
        "When using words, TT and C99 use stemmed words and filter out words using a stop-word list.",
        "C99 additional removes words using predefined regular expressions.",
        "In the case of topic IDs, no stopword filtering was deemed necessary.",
        "Table 1 shows the result of the different algorithms with all combination of provided segment number and using the mode method.",
        "We note that WD values are always higher than the Pk values, and these measures are highly correlated.",
        "First we discuss results for the setting with number of segments provided (see column 2-5 of",
        "TT can be achieved when using topic IDs.",
        "In case of C99LDA, the error rate is at least halved and for TTLDA the error rate is reduced by a factor of 20.",
        "Using the most frequent topic ID assigned during the Bayesian inference (mode method) reduces the error rates further for the TM-based approaches, as the probability for randomly assigned topic IDs is decreased.",
        "The newly introduced algorithm TopicTiling as described above does not improve over TTLDA.",
        "Analysis revealed that the Choi corpus includes also captions and other ?non-sentences?",
        "that are marked as sentences, which causes TopicTiling to introduce false positive segments since the topic vectors are too sparse for these short ?non-sentences?.",
        "We therefore filter out ?sentences?",
        "with less than 5 words (see bottom line in Table 1).",
        "This leads to errors values that are close to the results achieved with TTLDA when the mode is used.",
        "When the number of segments is not given in advance (see columns 6-9 in Table 1), we again observe significantly better results comparing topic-based methods to word-based methods.",
        "But the error rates of TTLDA are unexpectedly high when the mode method is not used.",
        "We discovered in data analysis that TT estimates too many segments, as the topic ID distributions between adjacent sentences within a segment are often too diverse, especially in face of random fluctuations from the topic assignments.",
        "Estimating the number of segments is better achieved using TopicTiling instead of TTLDA.",
        "In Table 2, we compare TTLDA, C99LDA and our TopicTiling algorithm to other published results on the same dataset.",
        "We can see that all introduced topic-based methods outperform the yet best pub"
      ]
    },
    {
      "heading": "Method Segments",
      "text": [
        "different algorithms in the literature.",
        "lished M09 algorithm (Misra et al., 2009).",
        "The improvements of C99, TTLDA and TopicTiling in comparison to M09 are significant3.",
        "TopicTiling and TTLDA are computationally more efficient than M09.",
        "Whereas our linear method has a complexity of O(T ) (T is the number of sentences), dynamic algorithms like M09 have a complexity of O(T 2) (cf. Fragkou et al. (2004)), which also applies to the number of topic inference runs.",
        "When the number of segments is not given in advance, TopicTiling outperforms TTLDA significantly.",
        "As an additional benefit, TopicTiling is even simpler than TT, as no smoothing parameter is needed and the depth scores are only calculated for the minima of the similarity scores."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "The method introduced in this paper shows that using semantic information, provided by TMs, can improve existing algorithm significantly.",
        "This is attested modifying the algorithm TT and C99.",
        "With TopicTiling a new simplistic topic based algorithm is developed that can produce state-of-the-art results based on the Choi corpus and outperform TTLDA when the number of segments is unknown.",
        "Additionally this method is computationally more efficient in comparison to other topic based segmentation algorithms.",
        "Another contribution is the mode method for stabilizing topic ID assignments."
      ]
    },
    {
      "heading": "7 Acknowledgments",
      "text": [
        "This work has been supported by LOEWE as part of the research center ?Digital Humanities?.",
        "We would like to thank the anonymous reviewers for their comments, which truly helped to improve the paper."
      ]
    }
  ]
}
