{
  "info": {
    "authors": [
      "Claire Gardent",
      "Laura Kallmeyer"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E03-1030",
    "title": "Semantic Construction in F-TAG",
    "url": "https://aclweb.org/anthology/E03-1030",
    "year": 2003
  },
  "references": [
    "acl-C00-2087",
    "acl-C88-2147",
    "acl-P01-1019"
  ],
  "sections": [
    {
      "heading": "CNRS, France Abstract",
      "text": [
        "We propose a semantic construction method for Feature-Based Tree Adjoining Grammar which is based on the derived tree, compare it with related proposals and briefly discuss some implementation possibilities."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Semantic construction is the process of constructing semantic representations for natural language expressions.",
        "Perhaps the most well-known proposal for semantic construction is that presented in (Montague, 1974) in which grammar rules are applied in tandem with semantic rules to construct not only a syntactic tree but also a lambda term representing the meaning of the described constituent.",
        "Montague's approach gave rise to much further work aiming at determining the correct rules and representations needed to build a representation of natural language meaning.",
        "In particular, computational grammars were developed which by and large took on Montague's proposal, building semantic representations in tandem with syntactic structures.",
        "Thus for instance, (Copestake et al., 2001) shows how to specify a Head Driven Phrase Structure Grammar (HPSG) which supports the parallel construction of a phrase structure (or derived) tree and of a semantic representation, (Zeevat et al., 1987) shows it for Unification Categorial Grammar (UCG) and (Dalrymple, 1999) for Lexical Functional grammar (LFG).",
        "One grammatical framework for which the idea of a Montague style approach to semantic construction has not been fully explored is Tree Adjoining Grammar (TAG, (Joshi and Schabes, 1997)).",
        "In that framework, the basic units are (elementary) trees and two operations are used to combine trees into bigger trees, namely, adjunction and substitution.",
        "Because the adjunction rule differs from standard phrase structure rules, two structures are associated with any given derivation: a derivation tree and a derived tree.",
        "While the derived tree is the standard phrase structure tree, the derivation tree records how the elementary trees used to build this derived tree are put together using adjunction and substitution.",
        "Furthermore, because TAG elementary trees localise predicate-argument dependencies, the TAG derivation tree is usually taken to provide an appropriate basis for semantic construction.",
        "And thus, the more traditional, \"derived tree\"-based approach is not usually pursued - An exception to this is (Frank and van Genabith, 2001) which presents a fairly extensive specification of a derived tree based semantic construction for TAG and with which we will compare our approach in section 5.",
        "In this paper, we explore the idea of a semantic construction method which is based on the TAG derived tree and show how a Montague style (unification based) approach to semantic construction can be applied to Feature-Based Tree Adjoining Grammar (FTAG, (Vijay-Shanker and Joshi, 1988)) We relate our approach to existing proposals and discuss two possibilities for implementation."
      ]
    },
    {
      "heading": "2 Hole semantics",
      "text": [
        "We start by introducing the semantic representation language we use.",
        "As mentioned above, Montague was using the lambda calculus.",
        "In computational linguistics, two new trends have emerged however on which our proposal is based.",
        "On the one hand, there is a trend towards emulating beta reduction using term unification.",
        "Instead of applying a function to its argument and reducing the resulting lambda term using beta reduction, functors are represented using terms whose arguments are unification variables.",
        "The syntax/semantics interface and the use of unification then ensures that these variables get assigned the appropriate values i.e., the values representing their given arguments.",
        "On the other hand, flat semantics are being increasingly used to (i) underspecify the scope of scope bearing operators and (ii) prevent the combinatorial problems raised during generation and machine translation by the recursive structure of lambda term and first order formulae (Bos, 1995; Copestake et al., 2001).",
        "Our proposal builds on these two trends.",
        "It mi-micks beta reduction using unification and uses a flat semantics to underspecify scope and facilitate processing.",
        "The language Ljj (for \"underspecified logic\") is a unification based reformulation of the PLU logic presented in (Bos, 1995).",
        "We give here an informal presentation of its syntax and semantics and refer the reader for more details to (Bos, 1995).",
        "Lu describes first order logic formulae.",
        "Because we introduce unification variables to support semantic construction, we distinguish two types of Lu formulae: the unifying formulae, which contain unification variables, and the saturated formulae which are free of unification variables.",
        "First we define the set of unifying formulae.",
        "Let Ivar be a set of individual unification variables and Icon be a set of individual constants.",
        "Let H be a set of \"hole\" constants, Lcon be a set of \"label\" constants and Lvar be a set of \"label\" unification variables.",
        "Let R be a set of nary relations over Ivar U Icon U H■ Finally let > be a relation on H U Lcon called \"has-scope-over\".",
        "Then the unifying formulae (UF) of Ltj are defined as follows: Given I G Lvar U Lcon, h G H,ii,...,in G Ivar U I^n U H and Rn G R. Then:",
        "1.",
        "There are well known empirical problems with this approach such as an incorrect treatment of certain conjunction cases.",
        "Nonetheless the order independence supported by unification means that in practice, most large coverage grammars continue to do unification based semantic construction.",
        "2. h > ZisaUFofLc/ 3. ft ip is a UF of Lu if ip is a UF of Lu and 0 is a UF of Lu 4.",
        "Nothing else is a UF of Lu",
        "That is, unifying formulae of Lu consist of labelled elementary predications, scoping constraints and conjunctions.",
        "The saturated formulae of Lu are unifying formulae which are devoid of unification variables.",
        "The models these saturated formulae describe are first order formulae and are defined by the set of possible \"pluggings\" i.e., injections from the holes of a formula to the labels of this formula.",
        "Given a saturated formula cf> G Lu, a plugging P is possible for 4> iff $ is consistent with respect to this plugging.",
        "Let us define in detail what this means.",
        "First, we introduce the relation >^ on L^ U for a given saturated formula ft. for all k, kf, k\" G L^U H<p: 6. nothing else is in >^ Condition 5. is important to separate for instance, between scope and restriction of a quantifier as nothing can be part of both at the same time.",
        "Let P be an injection from to L^ and let ft be the result of replacing in <j> all k G with P(k).",
        "Then P is a possible plugging for (f) iff for all k, k' G Lf.",
        "if k >$> k', then either k = k' or k' ^<p> k. Intuitively, the set of possible pluggings for a given Lu formula defines the set of first order logic formulae which are described by this formula.",
        "The following example illustrates this.",
        "Suppose the sentence in (1) is assigned the Lu formula (2).",
        "(1) Every dog chases a cat In what follows, we use the following notational conventions.",
        "We write Zo, h, ■ ■ ■ for label unification constants, sq, s\\, ... for label unification variables, a, 6,... for individual unification constants and xq, xi, ... for individual unification variables."
      ]
    },
    {
      "heading": "3 A unification based Syntax-Semantics interface for TAG",
      "text": [
        "An FTAG consists of a set of (auxiliary or initial) elementary trees and two tree composition operations: substitution and adjunction.",
        "Substitution is the standard tree operation used in phrase structure grammars while adjunction - sketched in Fig. 1 - is an operation which inserts an auxiliary tree into a derived tree.",
        "To account for the effect of these insertions, two feature structures (called top and bottom) are associated with each tree node in FTAG.",
        "The top feature structure encodes information that needs to be percolated up the tree should an adjunction take place.",
        "In contrast, the bottom feature structure encodes information that remains local to the node at which adjunction takes place.",
        "Fig.",
        "1 - Adjunction in FTAG To construct semantic representations on the basis of the derived tree, we proceed as follows.",
        "First we associate each elementary tree with an Ltj formula representing its meaning.",
        "Second we decorate some of the tree nodes with unification variables and constants occuring in the Ltj formula.",
        "The idea behind this is that the association between tree nodes and unification variables encodes the syntax/semantics interface - it specifies which node in the tree provides the value for which variable in the final semantic representation.",
        "As trees combine during derivation, two things happen: (i) variables are unified - both in the tree and in the associated semantic representation - and (ii) the semantics of the derived tree is constructed from the conjunction of the semantics of the combined trees.",
        "A simple example will illustrate this.",
        "name(jjohn) name(m,mary) Suppose the elementary trees for \"John\", \"loves\" and \"Mary\" are as in Fig. 2 where a downar-row (4) indicates a substitution node and Cx/Cxabbreviate a node with category C and a top/bottom feature structure including the feature-value pair { index: x}.",
        "On substitution, the root node of the tree being substituted in is unified with the node at which substitution takes place.",
        "Further, when derivation ends, the top and bottom feature structures of each node in the derived tree are unified.",
        "Thus in this case, x\\ is unified with j and x2 with m. Hence, the resulting semantics is:"
      ]
    },
    {
      "heading": "4 Some further examples",
      "text": [
        "For lack of space, we cannot here specify the general principles underlying the semantic labelling of lexical trees in a unification based TAG grammar.",
        "Instead, we focus on a number of linguistic phenomena which are known to be problematic for TAG based semantic construction and show how they can be dealt with in the proposed framework.",
        "\"John loves Mary \" particular in Abeille's grammar for French, quantifiers are treated as adjuncts.",
        "First, the noun is added to the verb by substitution then, the quantifying determiner is adjoined to the noun (see Fig.3).",
        "Det N*XtS1 FIG.",
        "3 - Quantifiers Semantically, a quantifying determiner expresses a relation between the denotation of some external verbal argument (the quantifier scope) and that of its nominal argument (the quantifier restriction).",
        "In the flat semantics we are using, this is captured by associating with \"every\" the formula where the two label variables si,s2 indicate the missing arguments.",
        "During semantic construction, these two variables must be unified with the appropriate values, namely with the labels of the restriction and of the scope respectively (e.g., in our example with the labels li and l2).",
        "Moreover the variable x bound by the quantifier must be unified with the variables xi and x2 predicated of by the noun and the verb respectively.",
        "To account for these various bindings, we proceed as follows.",
        "First, we associate with the relevant tree nodes not only an index but also a label so that Cx'l/CXji now abbreviate a node with category C and a top/bottom feature structure including the feature-value pair { index: x, label: /}.",
        "Second, we distribute these variables between top and bottom information so as to correctly capture the semantic dependencies between determiner, scope and restriction.",
        "More specifically, note that the restriction label variable (si) is part of the bottom feature structure of the foot node.",
        "In this way, si remains local to the N* node and unifies with the bottom-label of the root node of the tree to which the determiner adjoins.",
        "By contrast, the scopal label variable s2 (whose value is fixed by the verb) is included in the top feature structure of the root node of the determiner tree.",
        "It thereby can be percolated up to the NP argument node of the verb and thus unified with the label made available at that node i.e.,, with the verb label (£2)- Since the variable x bound by the quantifier is shared by both scope and restriction, it is included in both the top feature structure of the determiner root node and the bottom feature structure of the determiner foot node.",
        "As a result, x is unified with both xi and x2.",
        "As should be obvious, the approach straightforwardly extends to scope ambiguities: by a derivation process similar to that sketched in Figure 3, the semantic representation obtained for a sentence with two quantifiers such as (1) above will be (2) which, as seen in section 2 above, describes the two formulae representing the possible meanings of \"every dog chases a cat\".",
        "In a Montague style semantics, an intersective adjective denotes a function taking two arguments (an individual and a property) and returning a proposition.",
        "Using a flat semantics, this intuition can be captured by having adjectives binding both an individual and a label variable.",
        "Thus in Fig. 4, the adjective \"black\" is associated with the semantic representation S3 : black(xi) where S3 is a label variable and xi an individual variable.",
        "Since the values of these variables are provided by the modified noun and since the combination of adjective and noun is mediated by adjunction, these variables label the bottom feature structure of the adjective tree foot node.",
        "On adjunction, this bottom feature structure is then unified with that of the argument noun (itself labelled with its own index and label) so that noun and adjective end up with identical index and label.",
        "Note that as the adjective \"passes up\" index and label information to the adjective tree root node, combination with a quantifier will further bind the index now shared by noun and adjective to the quantifier index.",
        "Although we cannot present it here for lack of space, the approach can also be extended to deal with non subsective adjectives and account for cases such as \"the former king\" (and similarly for adverbs modifying adjectives \"the potentially contro-Fig.",
        "4 - Intersective adjectives versial plan\") where the individual predicated of is actually not a king (or a controversial plan).",
        "In that case the predicate associated with the adjective must label the adjective node thereby providing a value for its modifier.",
        "Consider the following examples.",
        "(3) a. Pat allegedly usually drives a Cadillac.",
        "b.",
        "Intentionally, John knocked twice.",
        "c. John intentionally knocked twice.",
        "FlG.",
        "5 - VP opaque modifier The sentence in (3a) has three readings depending on the respective scope of \"allegedly\", \"usually\" and \"a cadillac\".",
        "However in all three cases, \"allegedly\" scopes over \"usually\".",
        "Further, there are two possible readings for both (3b) and (3c) depending on whether \"intentionally\" scopes over \"twice\" or the converse.",
        "The first example can be captured as suggested in (Kallmeyer and Joshi, 2002) by ruling out multiple adjunctions (one VP modifier is adjoined to the other rather than both modifiers being applied to the verb) and treating \"usually\" as an \"opaque\" modifier i.e., one that does not pass up the verb label (cf.",
        "Fig.",
        "5).",
        "By contrast, \"intentionally\" (a so-called \"subject adverb\" with the associated scoping properties) and \"twice\" (a postposed VP adverb) are treated as non opaque in that they pass up the verb (rather than their own) label to the bottom feature structure of their root node.",
        "Thereby, scope bearing elements occurring further up in the derived tree bind the verb label.",
        "E.g., in (3b) and (3c), the two adverbs consume and pass on the verb label so that the following Ljj formula is obtained: In a subject control sentence, \"controller\" (the denotation of the subject of the control verb) and \"controlee\" (the denotation of the unexpressed subject of the complement) must be identified.",
        "This is clearest with ditransitive control verbs such as \"promise\".",
        "Given the sentence (4) John promised Mary to leave the meaning representation must make clear that the unexpressed subject of \"leave\" is \"John\".",
        "Fig.",
        "6 sketches the elementary trees associated in FTAG with a control verb and its complements.",
        "As the figure shows, it is easy to associate these trees with semantic information that yields the desired dependencies and in particular, the corefe-rence between the implicit subject of the sentential complement and that of the control verb.",
        "Fig.",
        "6 - Control verbs"
      ]
    },
    {
      "heading": "5 Related work",
      "text": [
        "We now compare our approach with three related proposals: that of basing semantic construction on the TAG derivation tree as put forward in (Kallmeyer and Joshi, 2002); an extension of this proposal presented in (Kallmeyer, 2002b) and the glue semantic approach proposed in (Frank and van Genabith, 2001).",
        "The LTAG derivation tree records how elementary trees are combined during derivation.",
        "Hence the nodes of this tree stand for elementary trees and the arrows either for substitution or for adjunction.",
        "In what follows an upward pointing arrow indicates an adjunction, a downward one a substitution.",
        "As, e.g., (Kallmeyer and Joshi, 2002) shows, semantic construction can be based on the derivation tree as follows.",
        "First elementary trees are associated with semantic representations.",
        "The derivation tree is then used to determine functor-argument dependencies: an (upwards or downwards going) arrow between n\\ and n2 indicates that n\\ is a semantic functor and n2 provides its argument(s).",
        "Although the approach works well in general, it is known that derivation trees do not provide all the necessary functor-argument dependencies.",
        "A first problem case is embodied by quantifiers.",
        "As we saw in section 4, quantifiers are semantic functors taking two arguments namely, a restriction and a scope.",
        "Further it has been argued mainly for French but also for English that syntactically a quantifier should be adjoined to its complement noun.",
        "As a result the derivation tree of a quantified intransitive sentence as in Fig. 3 is as given in Fig. 7.",
        "As observed in (Kallmeyer, 2002b), this is problematic for semantic construction because there is no arrow pointing from the determiner to its scope hence no base on which to determine the scope of the quantifier.",
        "This can be solved however by using multicomponent TAG to represent a quantifier with two trees, one representing the relation between determiner and restriction, the other representing the relation between determiner and scope (Kallmeyer and Joshi, 2002).",
        "A second problem is illustrated by wh-questions.",
        "In that case, an element (the wh-word) has a dual semantic function: on the one hand, it provides a verb argument and on the other, it takes scope over a (possibly complex) sentence.",
        "In Fig. 7, we give the derivation tree for the sentence (5) Who does Paul think John said Bill liked?",
        "As can be seen there is no direct link between \"who\" and the verb introducing its scoping sentence, namely \"think\".",
        "Hence the scoping relation between \"who\" and \"does Paul think John said Bill likes\" cannot be captured.",
        "A third type of problems occur when several trees are adjoined to distinct nodes of the same tree.",
        "This typically occurs when raising verbs interact with long distance dependencies e.g., (6) Mary Paul claims John seems to love.",
        "As the derivation tree in Fig. 7 shows, the multiple adjunction of the trees for \"claim\" and \"seems' to (respectively the S and the VP node of) \"love\" result in a derivation tree where no link occurs between \"claim\" and \"seem\".",
        "But obviously this is needed as the \"seems\" sentence provides the propositional argument expected by \"claims\".",
        "None of these cases are problematic for the derived tree based approach.",
        "Quantifiers are treated as described in section 4 while examples (5) and (6) are treated as sketched in figures 8 and 9.",
        "FlG.",
        "8 - Wh-questions np vp.",
        "FlG.",
        "9 - Raising verbs (Kallmeyer, 2002b; Kallmeyer, 2002a) shows that some of the problems just described can be solved once additional links are added to the derivation jited^ who said Bill John think Paul does (b) Mary claims seems John FlG.",
        "7 - Derivation trees tree.",
        "In particular, given three nodes n\\, n2,113 such that n\\ is above n2 and is above n^, if «3 is a tree adjoined at the root of n2, then an additional link can be established between n\\ and n%.",
        "In this way, adjoining quantifiers become unproblematic as an additional link is established between \"barks\" and \"every\" thereby supporting the semantic relation between the quantifier and its scope.",
        "(Kallmeyer, 2002a) further shows that the approach can deal with questions.",
        "Nonetheless since additional links only are warranted when adjunction takes place at a root node, the approach does not straightforwardly extend to cases such as (6) where none of the two problematic adjunctions takes place at the root node of the \"love\" tree; or to derivations such as illustrated in Fig. 6 where \"john\" is substituted into the tree for \"try\" which itself is adjoined to the tree for \"meet\" (\"john\" does not adjoin to the root node of \"try\", hence no additional link is warranted between \"john\" and \"meet\").",
        "The present approach is closest to the glue semantics approach presented in (Frank and van Genabith, 2001).",
        "As in our proposal, meaning representations are associated with elementary trees, variables are shared by the nodes of the elementary trees and the meaning representations and semantic construction is based on the derived, rather than on the derivation tree.",
        "There are two main differences though.",
        "The first resides in the tools used to do semantic construction.",
        "In a traditional Montague type approach to semantic construction, the assumption that semantic composition follows surface constituent structure results in the stipulation of (sometimes extremely) complex lambda terms as lexical meaning representations.",
        "In a medium size grammar, the complexity induced by this assumption is non-trivial and adds to the complexity of the already difficult task of grammar writing.",
        "In effect, unification-based semantic construction and glue semantics provide two different ways of addressing this problem.",
        "Glue semantics uses linear logic and deduction to combine semantic meanings on the basis of a functional structure wheras the approach proposed here uses unification to do bracketting independent semantic construction on the basis of constituent structure.",
        "The second difference lies in the way variables are assigned a value.",
        "In the (Frank and van Genabith, 2001)'s approach, the assignment of values to variables results from the additional stipulation of a series of variable equation principles: one for substitution, another for adjunction of a modifier auxiliary tree and a third one for the adjunction of a predicative auxiliary tree.",
        "By contrast, in the present approach, this process is mediated by unification and follows from the definition of the substitution and adjunction operation in FTAG.",
        "Since these definitions are already needed for morpho-syntax, it seems a priori better to use them rather than to add additional stipulations for semantics.",
        "Further, for the range of phenomena discussed in (Frank and van Genabith, 2001), such additional stipulations do not seem needed within the flat semantic framework we adopt.",
        "Finally, the chosen unification based semantic construction method together with the choice of a flat semantics means that the ideas developped within the wide coverage and freely available HPSG grammar ERG can be drawn upon when developing a large scale TAG with semantic information."
      ]
    },
    {
      "heading": "6 Implementation",
      "text": [
        "There are at least two obvious ways to implement the above proposal.",
        "A first possibility is to keep elementary trees and associated semantic representations separate and to specify a parser which combines not just trees but pairs of trees and semantic representations.",
        "The second possibility is to integrate the semantic representations into the elementary trees under some priviledged feature say sem and to take the semantic representation of a derived tree to be the unioned values of this sem feature.",
        "We are currently experimenting with the second possibility but within a parsing framework which uses the \"polarities\" presented in (Perrier, 2000) to drastically reduce the parsing search space.",
        "Preliminary results are encouraging as for the small but non trivial grammar fragment available, polarities can be shown to restrict the output to only exactly as many parses as there are possible syntactic and semantic representations for the input sentence."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "We have shown how FTAG could be used to construct flat semantic representations during derivations and compared this approach with related proposals.",
        "Future work will concentrate on (i) implementing and extending the present fragment, (ii) integrating the present proposal within a meta-grammar for FTAG so as to factorise semantic information and automatically produce FTAGs with a semantic dimension and (iii) investigating how semantic information could be used to prune parse forests and improve parsing performance."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The cooperation between the authors leading to this paper was made possible by the INRIA ARC GENI (Generation and Inference).",
        "We are grateful to Anette Frank, Josef van Genabith, Aravind Joshi, Maribel Romero and three anonymous reviewers for their comments on this paper."
      ]
    }
  ]
}
