{
  "info": {
    "authors": [
      "Sarah Borys"
    ],
    "book": "Human Language Technology Conference and Meeting of the North American Association for Computational Linguistics – Student Research Workshop",
    "id": "acl-N03-3002",
    "title": "The Importance of Prosodic Factors in Phoneme Modeling With Applications to Speech Recognition",
    "url": "https://aclweb.org/anthology/N03-3002",
    "year": 2003
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper tests speech recognition using prosody dependent allophone models.",
        "The log likehoods of various prosodically labeled phonemes are calculated using Baum-Welsh re-estimation.",
        "These log likehoods are then compared to log likehoods of non-prosodically labeled phonemes.",
        "Based on the comparison of these log likehoods, it can be concluded that modeling all prosodic information directly in the vowel model leads to improvement in the model.",
        "Consonants, on the other hand, split naturally into three categories, strengthened, lengthened and neutral."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Prosody is an important factor in how humans interpret speech.",
        "The same word string can have different meanings depending on the way it is said.",
        "Many linguists have performed extensive studies of prosody and of the effects of prosodic factors on spoken language.",
        "In his dissertation, Cho (2001) investigates how phonetic features are conditioned by prosodic factors by examining pre-boundary, post-boundary, and accented syllables.",
        "Cho reports that boundary induced articulatory strengthening occurs in phrase final vowel positions and phrase initial consonant positions.",
        "Phrase initial vowels are also more susceptible to coarticulation than phrase final vowels.",
        "Cho also hypothesizes that accented syllables are characterized primarily by sonority expansion.",
        "An accented vowel is usually not affected by coarticulation with a neighboring vowel.",
        "Strengthening effects caused by boundaries and accents cannot be considered the same and Cho discusses several differences between boundary and accent strengthening effects.",
        "In a study performed by Edwards et al. (1991), the effect of final lengthening at prosodic boundaries was examined by studying articulator movement patterns.",
        "It was found that decreasing intragestural stiffness slows down the syllable, affecting the tempo of the spoken word, causing the syllable to be lengthened.",
        "The changing of intergestural phrasing also affects the syllable duration by decreasing the overlap of a vowel gesture with a consonant gesture.",
        "This increases the duration of accented syllables comparatively to unaccented syllables and causes the accented syllable to be strengthened.",
        "De Jong (1994) investigated the supraglottal correlates of linguistic prominence in English.",
        "De Jong suggests that stress involves a localized shift toward hyperarticulated speech.",
        "An increase in the duration in the closure and in the aspiration of initial voiceless stops was observed along with an increase in duration of prevoicing in initial voiced stops in stressed syllables.",
        "Fougeron and Keating (1997) report that on the edges of prosodic phrase boundaries, final vowels and initial consonants have less reduced lingual articulation.",
        "The differences in articulation were manifested in the linguopalatal contact of boundary consonants and vowels.",
        "The linguopalatal contact of both consonants and vowels relates directly to the type and size of phrase boundary.",
        "Boundary type and size also appear to effect the acoustic duration of post-boundary consonants.",
        "Wightman et al. (1992) report that there is segmental lengthening in the rhyme of a syllable that directly precedes a phrase boundary.",
        "Wightman examines the effect of duration and pause on boundary words and shows that speaking rate effects the distribution of phoneme duration.",
        "The lengthening effects of pre-boundary syllables can be used to distinguish several different types of phrase boundaries.",
        "These results show that prosody can cause variations not just in pitch, but also in the articulation of phonetic contrasts in different phonemes.",
        "These variations can be modeled as a part of the phoneme definition in an automatic speech recognition (ASR) system.",
        "However, the question is whether or not modeling prosodic factors with phonemes would lead to improvements in the quality of the phoneme model and thus lead to improvements in both the correctness and accuracy in an ASR system.",
        "Most modern speech recognizers function by breaking words up into mathematical features.",
        "The recognizer then determines the most likely occurring set Consonants Vowels b ch d aa ae dh f g ah ao hh jh k aw ax l m nay eh p r s el er sh t v ey ih w y z iy ow oy uh uw",
        "of phonemes by comparing these extracted features with its own phoneme models.",
        "Phonemes are usually modeled using hidden Markov Models (HMMs).",
        "Once the recognizer has identified a set of the most likely occurring phonemes, it then uses a dictionary to match a word or group of words to that set.",
        "Prosody can be incorporated into the phoneme model by allowing two different HMMs to represent a single phoneme.",
        "One HMM would need to represent the prosody independent version of the phoneme while the other would represent the phoneme in some prosodic context.",
        "This could allow the recognizer to do things such as distinguish between accented and unaccented phonemes or distinguish between boundary and non-boundary phonemes.",
        "Allowing the recognizer to make such a distinction may reduce the confusability of certain phoneme groups, which in turn could allow for increased recognition rates.",
        "The goal of this research is to not only determine if the inclusion of prosody in the phoneme model causes improvement in the model, but also to determine which prosodic factors to model and the best way to model them.",
        "This will be accomplished by first splitting phonemes into different prosodically varying groups and then by comparing the log probability of the occurrence of each phoneme in those different groups.",
        "Because prosody causes noticeable variations in speech, a phoneme model that includes prosodic factors should differ from models of the same phoneme that do not.",
        "This difference will prove to be significant enough to show that prosodic factors should be taken into account for a more accurate phoneme model."
      ]
    },
    {
      "heading": "2. The Database",
      "text": [
        "Boston University’s Radio News Corpus (1995) was used for all experiments.",
        "The speakers from this corpus that were analyzed were F1A, F2B, and M2B.",
        "The usable data from these three speakers consisted of 259",
        "wav files containing 18270 words.",
        "All the wav files that were used were accompanied by two types of prosodic transcription files, .brk and .ton files.",
        "The corpus was labeled according to the ToBI standard.",
        "Silverman et al. (1992) explain the labeling system in detail.",
        "It will not be described in this paper.",
        "The .brk files specify a ToBI break index (0-4) for every spoken word in the associated wav file.",
        "For the experiments, the only boundary distinguished was the intonational phrase boundary (ToBI index 4).",
        "All other boundary types (indices 0-3) were grouped together.",
        "There were 3855 intonational phrase boundaries in the data set.",
        "The .ton files label the times in which an accented vowel occurs.",
        "The most abundant accent label was H* which occurs in a ratio of about 10 H* for every single L*.",
        "Other accent types do occur, but most include H* in bitonal accent."
      ]
    },
    {
      "heading": "3. Prosodic Annotation",
      "text": [
        "The set of 38 different phonemes, shown in figure 1, were used in the experiments."
      ]
    },
    {
      "heading": "3.1 Allophone Modeling",
      "text": [
        "Recognition experiments were preformed for four different allophone sets:",
        "• Tied • Accent • Boundary • Untied",
        "The Tied set contained no prosodically labeled data.",
        "The Accent set contained monophones that were split into two groups, accented and unaccented.",
        "Phonemes were not distinguished on the basis of phrase position.",
        "The Boundary set modeled monophones as phrase initial, phrase medial, or phrase final.",
        "Accented phonemes were not distinguished from unaccented phonemes.",
        "The Untied set distinguish phonemes by both phrasal position and accentuation.",
        "A monophone in this group could be labeled as phrase medial, phrase medial accented, phrase initial, phrase initial accented, phrase final or phrase final accented."
      ]
    },
    {
      "heading": "3.2 Allophone Definitions",
      "text": [
        "Figure 2 contains the six different labels used to represent the allophones of a single imaginary phoneme “phn.” A phrase final phoneme was considered to be any phoneme that occurred in the nucleus or coda of the final syllable of a word directly preceding an intonational phrase boundary.",
        "Phrase initial phonemes, on the other hand, were considered to be any phoneme in the onset or nucleus of the initial syllable of a word that followed an intonational phrase boundary.",
        "Phase medial phonemes were considered to be any other phoneme.",
        "An accented vowel was the lexically stressed vowel in a word containing a transcribed pitch accent.",
        "Because accented consonants are not clearly defined, three different labeled sets of accented consonants were developed:",
        "• All Consonants • After Vowel • Before Vowel",
        "All Consonants considered every consonant in a syllable with an accented vowel to also be accented.",
        "After Vowel considered as accented only the coda consonants.",
        "Before Vowel recognized only the onset consonants of the accented syllable as being accented.",
        "Accents were considered to be limited to a single syllable.",
        "Because there were three different groups of accented consonants and because there is only one way a vowel can be labeled as accented, vowels were",
        "separated into a fourth group of their own, entitled Vowels.",
        "The four groups along with the four different allophone models lead to the sixteen experimental conditions illustrated in figure 3."
      ]
    },
    {
      "heading": "3.3 Dictionaries and Transcription Types",
      "text": [
        "Each experimental condition required its own dictionary and transcription.",
        "Just as each phoneme had six distinct allophones, each word had six distinct types.",
        "A word could be phrase initial, medial or final and accented or unaccented.",
        "Each word type had its own definition.",
        "An example dictionary is shown in figure 4.",
        "Every experimental condition had both a word level transcription and a phone level transcription.",
        "Figure 5 shows an example of the two different levels of transcription files."
      ]
    },
    {
      "heading": "4. Experiments",
      "text": [
        "experiments for the Accented allophone sets.",
        "The \"Merge\" column lists phonemes with WA > LL.",
        "The \"Separate\" column indicates phonemes where WA < LL.",
        "Due to the relatively small size of the data set, several phonemes are missing from the table.",
        "Experiments were performed using the Hidden Markov Toolkit (HTK), which is distributed by the University of Cambridge (2002).",
        "Phonemes were modeled using a three-state HMM with no emitting start and end states.",
        "Each emitting state consisted of three mixture Gaussians and no state skipping was allowed."
      ]
    },
    {
      "heading": "4.1 Experimental Procedure",
      "text": [
        "The Radio News Corpus data was divided into 2 sets: a training set and a test set.",
        "The test set was approximately 10% of the size of the training set.",
        "The experimental procedure was completed for sixteen experimental conditions.",
        "The experimental procedure can be divided into two steps.",
        "In step one, the training data was used to re-estimate the HMM definitions for each phoneme.",
        "Re-estimation was performed with the HTK tool HRest, which uses Baum-Welsh re-estimation described in detail in the HTK book available from Cambridge University (2002).",
        "HMM parameters were re-estimated until either the log likehood converged or HRest had performed 100 iterations of the re-estimation algorithm.",
        "In the second step of the experiments, HRest was used to perform a single iteration of the re-estimation algorithm on the test data using the HMM definitions that were updated from the re-estimation of the training set.",
        "During re-estimation, the log likehoods of each phoneme were output and saved for later comparisons."
      ]
    },
    {
      "heading": "4.2 Post Processing",
      "text": [
        "Once all the log likehoods had been recorded, the Untied allophone sets were used as a basis to determine if the considered monophones were better modeled as prosody independent or prosody dependent.",
        "To determine the best modeling strategy for a particular monophone, six different weighted averages (WA’s) were calculated from the Untied log likehoods and compared to the computed log likehoods of the Boundary, Accent and Tied models.",
        "b.",
        "The proposed modeling of Vowels.",
        "Numbers 1-6 indicate six different distinguishable prosodic types The following three formulas were used to calculate the WA’s of the Untied set for comparison with the Boundary set computed value:",
        "where PM, PI, and PF stand for phrase medial, initial and final, respectively.",
        "Lx represents the computed log likehood of the allophone label x in the Untied allophone set, and Wx represents the frequency of that x. Wx, where x is representative of any of the six types of prosodically labeled monophones, is computed by the following formula: Wx = numx / TOTAL where numx represents the number of examples of the token x, and TOTAL is the sum of all the different phoneme tokens being taken into account for the computation of WA of some set of phonemes.",
        "The two formulas used in calculating the WA’s for comparison with the Accent allophone set are as follows:",
        "where WAU and WAA are the weighted averages of log likehoods for the accented and unaccented tokens respectively.",
        "The WA compared to the Tied set was computed as follows:",
        "where WAT is the weighted average of all of the phonemes in the Untied model.",
        "The weighted averages were then compared to the log likehoods using the following algorithm: if (WA < LL), then split using prosodic labels if (WA > LL), then do not split using prosodic labels LL is the log likehood computed using HRest."
      ]
    },
    {
      "heading": "5. Results",
      "text": [
        "For each prosodic variable (phrasal position or accent), tables were constructed listing the preferred tying of phonemes based on the log likehood results.",
        "Table 1, for example, lists all phonemes that should be tied on the basis of accent and those that should not.",
        "Similar tables exist for phrasal position and for the combination of both accent and phrasal position.",
        "Examples of certain phonemes are not present due to the relatively small size of the data set.",
        "Experimental results varied greatly between consonants and vowels.",
        "For consonants, there appeared to be an improvement in the model when phonemes are distinguished by phrasal position.",
        "Separation of accented and unaccented phrase initial consonants yielded no improvement to the model for most consonants.",
        "This implies that phrase initial accented and phrase initial unaccented phonemes should be merged into a single token.",
        "Accented consonants are also not benefited by positional information.",
        "Results indicate that phrase initial, medial and final accented phonemes can be merged together.",
        "Figure 6a illustrates a proposed model for the prosodic labeling of consonants based on these results.",
        "For vowels, a model showed improvement when the phoneme was separated into phrase initial, medial and final tokens.",
        "Vowel phoneme models also showed improvement when separated by accent.",
        "The accent on a vowel appears to be important regardless of phrasal position.",
        "These results suggest a six-way distinction should be used when modeling vowels and the proposed model is illustrated in figure 6b."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "While the data used for these experiments was sparse for certain phonemes, many of the phoneme models tested showed improvement when prosody was incorporated directly into the HMM definition.",
        "Analysis of experimental results led to two different proposals for the modeling of consonants and vowels.",
        "Verifying that the proposed models are indeed an improvement over standard phoneme modeling will be a goal of future work.",
        "Fougeron, P. & Keating, P. 1997 “Articulatory strengthening at edges of prosodic domains,” JASA 101(6), pp.",
        "3728-3740."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "This work could not have been completed without the help and guidance of Professor Mark Hasegawa-Johnson and Professor Jennifer Cole."
      ]
    },
    {
      "heading": "7. References",
      "text": []
    }
  ]
}
