{
  "info": {
    "authors": [
      "Gregory Aist",
      "John Dowding",
      "Beth Ann Hockey",
      "Manny Rayner",
      "James Hieronymus",
      "Dan Bohus",
      "B. Boven",
      "Nate Blaylock",
      "Ellen Campana",
      "Susana Early",
      "Genevieve Gorrell",
      "Steven Phan"
    ],
    "book": "Conference of the European Association for Computational Linguistics – Demonstrations",
    "id": "acl-E03-2001",
    "title": "Talking Through Procedures: An Intelligent Space Station Procedure Assistant",
    "url": "https://aclweb.org/anthology/E03-2001",
    "year": 2003
  },
  "references": [
    "acl-E03-1078",
    "acl-P93-1008"
  ],
  "sections": [
    {
      "heading": "2 Motivation",
      "text": [
        "The current crew on the ISS is limited to 3 astronauts.",
        "During preflight training, astronauts receive training on basic systems operation, and practice carrying out carefully designed procedures to handle both nominal and off-nominal operations.",
        "The number and variety of the procedures, as well as the duration of ISS missions, precludes the kind of detailed training common to shorter Apollo and Shuttle missions.",
        "Astronauts on Station need to carry out procedures that they may not have trained on specifically in advance, or may not have practiced for a considerable time.",
        "Current practice may require the astronaut to follow through the procedure using a text or computer monitor, or to have a second astronaut read the procedure out loud to the one executing it.",
        "Our approach is to develop a spoken dialogue system provide assistance in reading the procedure, tracking the progress through the procedure, and providing other assistance to support correct and complete execution.",
        "The dialogue system would thus free up the second astronaut for other tasks, increasing Space Station utilization."
      ]
    },
    {
      "heading": "3 System description",
      "text": [
        "The fundamental architecture of the system consists of several components: audio processing, speech recognition, language understanding, dialogue management, HTML and language generation, and visual display and speech synthesis.",
        "We use noise-canceling headset microphones for audio input, transmitted via Sennheiser wireless units to a laptop.",
        "Speech recognition is done with Nuance 8 using a context-free language model constructed from a unification grammar and then compiled into a recognition model (Dowding et al.",
        "1993; Rayner, Dowding, and Hockey 2001).",
        "The output of the speech recognizer is parsed using SRI's Gemini parser.",
        "The text of the recognized speech and the resulting parse are then fed to Alterf (Rayner and Hockey 2003), a robust interpretation module which combines statistical and rule-based interpretation to produce a sequence of tokens, such as \"[load, water]\".",
        "These tokens are then assembled into predicate-argument structure such as \"load(water)\".",
        "We adopt a TRIPS-style division (Allen, Ferguson, and Stent 2001) of dialogue management into three sections: input management, behavior management, and output management (Figure 1).",
        "In the December 2002 Checklist architecture, however, there are multiple behavior agents, each specialized by dialogue task: handling annotations (e.g. pictures and voice notes), manipulating system settings (e.g. volume), and handling procedure-based tasks (e.g. navigation).",
        "The dialogue input manager coordinates the interactions between the multiple behavior agents.",
        "The Checklist system is capable of a number of functions, as provided by the following dialogue behavior agents.",
        "Procedure agent (RavenClaw - Bohus and Rudnicky 2002).",
        "Available functions include the following.",
        "Loading a procedure by saying, for example, \"Load water procedure\".",
        "The procedure is loaded from disk as a XML document and converted into HTML via XSL, and then rendered using Cascading Style Sheets (CSS).",
        "At the same time, the procedure is processed using XSL into a task description for use by the task-oriented dialogue management component (RavenClaw).",
        "Asking yes/no questions of the user, for example \"Are you ready to begin the procedure?\" when indicated by task constraints or by the structure of the procedure itself.",
        "Navigating through the procedure one line at a time (\"next line\") or one numbered step at a time (\"next step\"), and returning to previous lines (\"previous line\") or previous numbered steps (\"previous step\").",
        "Annotation agent handles a variety of tasks.",
        "Requesting a list of available images by saying \"What pictures do you have?\".",
        "Requesting a specific image by saying, for example, \"Show me the small waste water bag.\" Taking a voice note by saying, for example, \"Take a voice note.\" Audio agent handles request to change settings.",
        "Setting an audio alarm by saying, for example, \"Set an alarm for three minutes from now.\" Controlling audio output volume by saying, for example, \"Speak up\", or \"Quieter.\" Output requests from dialogue agents enter a common output queue, where they are transformed into a series of one or more display actions and/or strings of text to speak.",
        "The resulting actions are played one at a time.",
        "The procedure is displayed as an HTML document (Figure 2), with the current step highlighted in light blue, and the current substep (if any) displayed in black text on a white background (to contrast with the light blue of the current (larger) step).",
        "Speech synthesis is handled by AT&T's speech synthesizer, equipped with a customized pronunciation dictionary."
      ]
    }
  ]
}
