{
  "info": {
    "authors": [
      "Serge A. Yablonsky"
    ],
    "book": "Proceedings of the 2003 EACL Workshop on Morphological Processing of Slavic Languages",
    "id": "acl-W03-2912",
    "title": "Russian Morphology: Ressources and Java Software Application",
    "url": "https://aclweb.org/anthology/W03-2912",
    "year": 2003
  },
  "references": [
    "acl-C90-3058"
  ],
  "sections": [
    {
      "text": [
        "Russian Morphology: Resources and Java Software Applications.",
        "Serge Yablonsky",
        "Petersburg Transport University, Moscow av., 9, St.-Petersburg, 190031, Russia, Russicon Company, Kazanskaya str., 56, ap.2, 190000, Russia",
        "serge yablonsky@hotmail.com; root@russicon.spb.su; http://www.russicon.ru",
        "This paper deals with development and application of Russian morphology software and resources.",
        "The approach is particularly dependent on advanced morphological analysis.",
        "The paper presents the structure, formats and content of Russian dictionaries and corpora.",
        "Relevant aspects of the UML data models, XML format and related technologies are surveyed.",
        "We introdu-cee the system based on Java and Oracle 9i DBMS.",
        "1"
      ]
    },
    {
      "heading": "Introduction",
      "text": [
        "Up-to-date language technologies contain efficient morphological analyzers for Romance, Germanic (Karttunen, 1983; Karttunen, Kosken-niemi, Kaplan, 1987; Zaenen, Uszkoreit, 1996) and some Slavic (Chanod, 1997) languages.",
        "In the last 15 years Russian computational morphology has advanced at a great rate from first quite restricted systems towards large-scale practical morphological analyzers ( Ashmanov I., 1995; Belonogov, Zelenkov, 1989; Belyaev, Surcis, Yablonsky, 1993; Bolshakov, 1990; Mikheev, Liubushkina, 1995; Segalovich, 1995).",
        "This paper attempts to introduce results of 15 years ongoing project on developing of Russian resources and software for building advance Russian language morphological analyzers and their applications that enable a different forms of text indexing and retrieval, and a direct benefit from the Russian morphological analyzers in:",
        "■ information-acquisition tools,",
        "■ authoring tools,",
        "■ language-learning tools,",
        "■ translation-tools,",
        "■ summarizers,",
        "■ semantic web etc.",
        "The objectives of this project are not unique.",
        "Several analogous projects have been carried out to different stages.",
        "In the late eighties of XX century we developed one of the first Russian morphologic analyzers on PC (Yablonsky S., 1990; Belyaev B.M., Surcis A.S., Yablonsky S.A., 1993; Yablonsky S.A., 1998; Yablonsky S.A., 1999).",
        "Now we are developing a set of platform independent Internet/Intranet Russian language processing tools based on Java and Oracle technologies."
      ]
    },
    {
      "heading": "2. Russian Resources for Morphology",
      "text": [
        "Russicon company has such main counterparts (Yablonsky S.A., 1998) for Russian morphology software development:",
        "- Russian lexicon which is formed from the intersection of the perfect set of Russicon Russian grammatical dictionaries with inflection paradigms (200.000 paradigms that produce more then 6.000.000 inflection word forms).",
        "It includes:",
        "• Russian basic grammatical dictionary.",
        "• Computer dictionary.",
        "• Geographical names dictionary.",
        "• Russian personal names, patronymics and surnames dictionary.",
        "• Business dictionary.",
        "• Juridical dictionary.",
        "• Jargon dictionary.",
        "- Russicon Russian explanatory dictionary.",
        "The dictionary gives the broad lexical representation of the Russian language of the end of the XX century.",
        "More then 100 000 contemporary entries include new words, idioms and their meanings from the language of the Eighties-Nineties.",
        "The dictionary is distinguished by its complete set of entry word characteristics, clear understandable definitions, its guidance on usage.",
        "All dictionary information for entries is structured in more then 60 attributes:",
        "• entry word;",
        "• multiple word entries;",
        "• usage notes;",
        "• precise, contemporary definitions;",
        "• derivations;",
        "• example sentences/citations;",
        "• idioms etc.",
        "- Russicon Russian thesaurus (set of 11.000 Russian synsets).",
        "Synonym list (8 696 synonym rows) plus word list containing approximately 30 000 normalized entry words with inflection paradigms.",
        "- Russicon Russian Orthographic dictionary (100 000 normalized entry words plus inflection paradigms with stresses).",
        "- Russian WordNet (in development).",
        "- Russian Corpora.",
        "Today linguistically encoded Russian text corpus includes approximately 2 000 000 words and consist of anthology of Russian prose and poetry of the 20th century, law, business and newspapers.",
        "The texts were input from printed resources and Internet (Yablonsky S.A., 1998; 2000)."
      ]
    },
    {
      "heading": "3. General Set Model of Inflection Morphology",
      "text": [
        "In most language technology applications the encoded linguistic knowledge, i.e. the grammar, is separated from the processing components (Zaene, Uszkoreit, 1996).",
        "Linguistic Model (LM) of the language consists of all declarative knowledge about the language, which is concentrated in the set of dictionaries and linguistic tables.",
        "The number of word forms P for Slavic inflection languages is rather high (P>>1) for some parts of speech.",
        "For example, in Russian language P > 100 for verbs.",
        "For the formal description of inflection morphology model the set theory is used.",
        "It is one of the best ways for description of inflection morphology (Bider, Bolshakov, 1976), (Kulagina, 1986).",
        "We present the general set model that permits to define mostly all sides of inflection morphology.",
        "It is realized in the Russian and Ukrainian morphological analyzers.",
        "In this model some concepts for the first time and other have new or more full meaning.",
        "We use definitions from (Yablonsky, 1999).",
        "Let H = { h1, h2, ... , hNh } be the set of part-of-speech (pos) categories and P = { p1, p2, ... , pNp} – lexical categories (LC) of gender, number etc.",
        "In the paradigm of the verb we include participle and adverbial participle.",
        "{\"animate\"}, Xk,t = (X*k,t = {\"nominative case\", \"singular number\"}, {\"genitive case\", \"singular number\"}, {\"dative case\", \"singular number\"}, {\"accusative case\", \"singular number\"}, {\"instrumental case\", \"singular number\"}, {\"prepositional case\", \"singular number\"}, {\"nominative case\", \"plural number\"}, {\"genitive case\", \"plural number\"}, {\"dative case\", \"plural number\"}, {\"accusative case\", \"plural number\"}, {\"instrumental case\", \"plural number\"}, {\"prepositional case\", \"plural number\"}, {\"2-nd genitive case\", \"singular number\"}, {\"2nd instrumental case\", \"singular number\"}, {\"2nd prepositional case\", \"singular number\"}, {\"2nd accusative case\", \"singular number\"}, {\"2-nd accusative case\", \"plural number\"}).",
        "Then i.e. for each part of speech exists it's own, may be empty, set of LC.",
        "Elements of Pk,t are named LC of t-type hk.",
        "For all Pk,t exists partition on three nonoverlapping and may be empty subsets, named P1k,t, P2k,t, P3k,t:",
        "Pk,t u Pk,t u Pk,t=Pk,t , Pk ,t n P2k,t n Pk,t = 0).",
        "Elements of Pkt are named as ordinary LC, elements of Pk t – special LC, elements of Pk t – individual LC of t-type hk For each Pk t set, if Pk)t* 0, there exists ordered sequence of sets Xkt = (XXk,t, Xk,t, ... , XNxktk,t).",
        "That is, if Pk,t = {pk,t,1, pk,t,2, ... , pk,t,Nkt2}, then Xlk,t = {x,j : xj e pUi, i = 1,Nkt2 }, where l = 1,Nxkt, and if Pk,t = 0, then it is considered that Xk,t = (0).",
        "We shall call sequence Xkt s the sequence of lexical categories of word inflective paradigm of t-type hk.",
        "One of lexical categories, usually the first, is named X*tk and called normalized.",
        "There exists a single pair (hk,tk,j), (hke H, tk,je Tk, k = 1,Nh, j = 1,Nk) for every lexeme and, therefore, ordered list of LC Xk,t.",
        "range of values W'i = Wi u {s}, where s -dummy, nonexistent word form.",
        "Thereby, for every lexeme WI an ordered sequence of word-forms = (y1, y2, ... , yNx) (yjeWi for j = 1,Nx ) could be formed.",
        "Such sequence is called word changing paradigm of lexeme Wi (WCP).",
        "If for lexeme WI exists such l, that fi_W(l) = s, it is said that lexeme Wi has a dummy word changing paradigm (Apresyan, 1989).",
        "If the pair (hk, tk,j) corresponds to lexeme WI and for some l = l* from 1,Nx conditions: fl^X(l*) =",
        "X*k,t and y* = fl_w (l*) (y*eYWi, y**s), are fulfilled, then we shall call the word form y* as normalized form or lemma of lexeme Wi.",
        "Usually y* = y1.",
        "As a rule, infinitive is a lemma for the verb etc.",
        "Let YWi - WCP of lexeme Wi.",
        "Then word form's inflections of paradigm YWi form ordered sequence denoted by YFLCi.",
        "Inflection class (FC) number I denoted by FCI is the five:",
        "where hk - some part of speech; tkj - some realization of LC type for corresponding part of speech; Pk,t - ordinary LC, corresponding to tk,j; Xk,t - sequence of special LC of WCP, corresponding to tkj; YFLCi - some i-th sequence of inflections, also called WCP of FC, where |Xkt| = |YFLCi|.",
        "inflection class concept was first used by (Belonogov, Zelenkov, 1985), although inflection class was understood only as ordered sequence of inflections.",
        "b*Nwis*) * (bNo+1, ... , bNwis).",
        "Let us call the ordered sequence zsi,m = ((bNo+1, ... , bNwis), (b*No+1, ... , b*Nwis*)), allowing to obtain lemma WiS from some word form WiS, direct substitution.",
        "Here i is a FC number, m - position number in WiS FC, s - exact pair number among other pairs in the m-th position.",
        "For each i-th FC is defined ordered set Zi (may be empty):",
        "Zi = {zi,1, zi,2, ... , zi,Nzi}, rge Nzi = |Xk,t|.",
        "Each zi,m= {zi,m, zi,m, ... , zNzimi,m}, where m = 1 - |Xk,t|, also is a set of pairs of direct substitutions (may be empty).",
        "if the pair zsi,m = (bm,b*) is a direct substitution, then the pair (b*,bm) is called reverse substitution.",
        "Reverse substitution allows obtaining some m-th word form WiS from lemma WiS.",
        "There is one-to one correspondence between the sets B* = {., b*, .}",
        "and Bm = {..., bm, ...}.",
        "Thus, |B*| = |Bm|; if (b*, bm1) and (b*, bm2), then bV bm2; if (b*1, bm) and (bm, b*2) , then b*1= b*2.",
        "The letters from the constant part of WiS could be added to the beginnings of such character sequences for achievement of this term.",
        "For example, the genitive of the plural noun KÜUEEKÄ (copeck) with lexeme WiS* = (KOnEHK) is WiS 7 = (KOnEEK).",
        "Direct substitution should be (EK, HK), but for the lexeme of the same inflexion class (FC = 154) «nyJIbKA» (kitty or pellet or pool) direct substitution in the same position must be (EK, bK).",
        "This generates ambiguity.",
        "Therefore, two pairs of direct substitutions: (EEK, EHK) h (JJEK, JJbK) are formed in the morphology model for inflexion class 154 and m = 7.",
        "Thus, for some inflection classes the set of direct substitutions should be formed.",
        "So, for obtaining word form of WCP with given LC it is enough to define WiS of the lemma, number of the inflexion class and the number of word form in WCP, thus the three < WiS*, FC, l>.",
        "if Yl = '-', then for given FC and, accordingly, for given lexeme the word form with such LC does not exist.",
        "However, even if Yl * paradigm of the given lexeme could be dummy.",
        "Such situation is described with the help of the set Pkt of individual LC of given lexeme.",
        "For example, lexemes «flEJJATb» (do) and «CflEJJATb» have the same inflection class 175 and, hence, the same realization of ordinary and special LC, but they have different value of aspect: verb «flEJJATb» - imperfective aspect, verb «CflEJJATb» - perfective aspect.",
        "So LC aspect should be the individual LC for this pair.",
        "Additionally, the individual LC could impose restriction on the existence of some inlections of the word.",
        "in the above example for FC = 175 FLC44 = «bIH» h Z175 44 = («EM», ~), where sign '~' designates empty sequence.",
        "For the verb «flEJJATb» WiS* = «flEJJA» _ y44 = «flEJJA-EMblH».",
        "For the verb «QHEJJATb»: WiS* = «CflEJJA» _ y44 = «CflEJJAEMblH».",
        "This contradicts with Russian language standard.",
        "So in the morphologic model should be the rules \"rejecting\" some inflection forms according their individual LC information.",
        "Such exclusion for given lexeme could be set explicitly by indicating the number of concrete inflection.",
        "For example, for lexeme «MEMTA» (dream) there is no y8 - plural genitive inflection.",
        "The set of individual LC realizations of lexeme inflections and numbers of forbidden inflections of WiP are considered to be individual feature of lexeme and are marked by i.",
        "Thus, LC of every lexeme Wi could be given by three:",
        "Linguistic tables (LT) form the second counterpart of the model FC (1).",
        "The structure of each LT depends on its utility type.",
        "For example, let us describe LT of ordinary LC (table of inflection classes).",
        "Table structure is simple:",
        "where m - general number of FC; Lc - 8-bit code of general LC.",
        "The interpretation of general LC in 8-bit code nouns other 4 bits could be interpreted as thus: d7=1, d8=0 - ordinary noun, d7=0, d8=1 - substantial noun, d7=1, d8=1 unchangeable noun.",
        "Bits d5, d6 are defined only for ordinary nouns and define gender p2 = {{\"masculine\", \"feminine\", \"neuter\", masculine/ feminine\"}: d5=0, d6=0 - masculine, d5=0, d6=1 - femine, d5=1, d6=0 - neutur, d5=1, d6=1 - masculine/feminine.",
        "General set model of inflection morphology we presented (Yablonsky S., 1999) permits to define mostly all sides of inflection morphology for Russian, Ukrainian and other Slavic languages.",
        "<<RelationalTable>> LEMVlA",
        "TRANSCR : VARCHAR2 ,jL_ ACCENT : NUMB ER ^jL_B YTE :VARCHAR2 ,jL_WASEXCH : NUMBER",
        "<<RelationalTable>> FARAD KjMA",
        "^lflJ_NAME : VARCHAR2 ^IID PREF LEN : NUMBER ^jlH)_ROOf_LEN : NUMB ER",
        "SUF LEN : NUMB ER ç)SD FLEX LEN : NUMBER >)L_~NUM 'NUMBER ifyfO PKEY-W NAME ,jMJ_T RA NSC R : VA RCHA R2 ^\"ACCENT : NUMBER -=-=Re latbian\"able = FLEX FK ÖFL_NUM : NUMBER ^)FK_NUM : NUMBER FF FKEY1 FF FKEY2",
        "<<RelationalTable» FK",
        "^f^num : number ^fk_ byte:char jyfK example :VARCHAR2 tǣfk_pkey- fk_num",
        "« Relational Tab le» HEWWOR D",
        "nihj nahe :",
        "VARCHAR2 W/il NAME -=-=Reö1loialTable = FK FLEX ^jFKNUM : NUMBER j-jFL_NUM : NUMBER FKF FKEY) FKF FK.EY2",
        "«Rela1onalTable>> FLEX",
        "«RelalonalTable** RES FIND PARADIGMA"
      ]
    },
    {
      "heading": "4. Russian Lexical Databases for Morphology",
      "text": [
        "The morphological analyzer has two main parts:",
        "• dictionary with declarative linguistic knowledge of the language;",
        "• program realization of morphologic model's algorithms.",
        "in general dictionary lexical information is represented in such form:",
        "where Wi = (a1, a2, .",
        ", aLi) - lexical part of dictionary's article: the word or phrase, composed from the alphabet characters A = {aS : s = 1,",
        "Na}; tag part fi = (f1, f2, ... , fk) - subset of tags from the set F = { fr : r = 1, .",
        ", Nf}, Nv - number of the words (word-tokens) in the dictionary, for large-scale dictionaries of inflective languages usually Nv > 1500 000.",
        "There are three main variants of database realization.",
        "The part of the word including prefix(es) and root is called word formative stem (WFS).",
        "The part of the word including prefix(es), root and suffix(es) is called word inflective stem (WiS).",
        "in the compressed WFS - dictionary database all WiS are distributed into word forming groups (WFG).",
        "Word forming group consists of such set of fours:",
        "where SUF - suffix (number of the suffix), FC inflection class number; WISi* = WFSi © SUF.",
        "Usually only first 255 maximum frequent suffixes are coded as separate linguistic units in compress WFS-dictionary realization.",
        "Other suffixes are included in WFS.",
        "For increasing speed of morphological analysis all WIS with stem gradation are generated.",
        "In the compressed WIS - dictionary database the ordered sequence of all lexemes is stored.",
        "The speed of analysis is increased in 10 times.",
        "Besides, several additional tables are used: table of inflection classes, inflection class – inflections, inflection – inflection classes, inflection class – right direct substitutions, joint right direct and right inverse substitutions, direct and inverse tables of suffixes, prefixes and substitutions in prefixes, and some other (see Yablonsky S., 1999).",
        "Today the memory cost is dramatically going down.",
        "So words without compression could be stored on HDD/RAM.",
        "The simplified UML-notation of the database for storing such resources is shown below.",
        "Today Unified Modeling Language (UML) defines a standard notation for object-oriented systems (Booch G., Rumbaugh J., and Jacobson I., 1998).",
        "The objective of modeling is to complete a rigorous design with quality checks before we build a word-dictionary database system.",
        "The UML is an object-oriented methodology that standardizes modeling language and notation, not a particular method.",
        "Using UML enhances communication between linguistic experts, workflow specialists, software designers and other professionals with different backgrounds.",
        "We introduced simplified UML data model (see figure 1) for word-dictionary database and developed a table-based UML mapping according to UML notations.",
        "There are two main tablesin database.",
        "Relational table LEMMA is destined for storing lemma's linguistic information and has such attributes: L_NUM - lemma's index; L_NAME - lemma; FK_NUM - number of inflection class; L_PREF_LEN - length of prefixes; L_ROOT_LEN - length of root; L_SUF_LEN - length of suffixes; L_FLEX_LEN - length of inflection; LTRANSCR - transcribtion; LACCENT - number of accent letter; L_BYTE - byte of additional linguistic information.",
        "Relational table PARADIGM is destined for storing paradigm entry-word's linguistic information and has attributes similar to LEMMA table.",
        "Example of Russian entry word MenTa 'dream' with its inflection paradigm plus grammatical tags and hyphenation see below.",
        "Lemma: Menma.",
        "Relational database management systems (RDBMS) play a crucial role in the storage of richly structured data.",
        "The main advantage of RDBMS is their maturity and almost three decades of experience with them.",
        "In general the main features of Word-dictionary database are implemented using commercial DBMS Oracle9i.",
        "Usage of Unicode simplifies Multilanguage Word-dictionary development.",
        "PL/SQL-script for database creation is available by email request root@russicon.spb.su.",
        "Paradigma:",
        "Menma",
        "noun, feminine, singular, nominative, inanimate",
        "Menmu",
        "noun,feminine, singular, genitive, inanimate",
        "Menme",
        "noun, feminine, singular, dative, inanimate",
        "Menmy",
        "noun, feminine, singular, accusative, inanimate",
        "Menmoü",
        "noun, feminine, singular, instrumental, inanimate",
        "MenmoK",
        "noun, feminine, singular, instrumental, inanimate",
        "Menme",
        "noun,feminine, singular, prepositional, inanimate",
        "Menmu",
        "noun, feminine, plural, nominative, inanimate",
        "MenmaM",
        "noun, feminine, plural, dative, inanimate",
        "Menmu",
        "noun, feminine, plural, accusative, inanimate",
        "MenmaMU",
        "noun, feminine, plural, instrumental, inanimate",
        "Menmax",
        "noun, feminine, plural, prepositional, inanimate",
        "rpat-iMarmjecKHM cjioBapb pyccKoro a^diKa",
        "fpafin Ea3a flaHHbix PaöüTacocnoeaMH noMomt",
        "Mac™ cnoEa pi VflapeHne",
        "VCTaHCiPHTb",
        "K napaflurMe",
        "CooTBeTCTByramaH cnoey napaflurwia: )1 /2 po^efi po>Ke",
        "HacTb pemi jcymecTBirrenbnoe HowepcDK",
        "TpaHCK|3Mni4HFI",
        "flpHHFlTb H3MeHeHHH",
        "npocMorp Bcex nt>M3H3K0B BbiBpaHHoro cnosa napaAiirnbi:",
        "VciaHOBKaflononMHTenbHbix npHSHaKOB napaflMrHbi:",
        "□ HeT pofl.naA-, MH.micna EU ecrt.",
        "2-oh pcifliiT.",
        "naflex P HeT efliiHCTB.",
        "Liiicna |Z1 OTmararibHoe",
        "p hgt mho>k. Mucna oflyiue en e h h oe",
        "P ecTb 2-o(i npefln.",
        "na,qe>n E HeoflyiiieeneHHoe"
      ]
    },
    {
      "heading": "5. Derivational morphology and compounding",
      "text": [
        "Derivational morphology is based on detection of fixed expressions (more then 2000 of Russian idioms, proverbs, sayings), multiword prepositions, prefixes/suffixes with strong derivation functions and productive central derived, compounds (3000 of most frequent Russian compounds), processing 198 features consisting of morphosyntactic features, derivational features, stylistic features and punctuator features.",
        "6 System for construction and support of Russian Grammatical Dictionaries",
        "System allows to receive morphological information of the word and to build normal form for the word, shows paradigm for the word (see figure 2), constructs new words lexicon, constructs",
        "support of Russian grammatical dictionaries",
        "frequency lexicon.",
        "It provides such morphological information for new words treatment:",
        "• input of grammatical characteristics of new words, length of word-building and word-changing stems, number of inflexion class etc.",
        ";",
        "• generation of different variants of inflexion paradigms for new word containing only one correct variant;",
        "• input of inflection paradigm of new words.",
        "Russian Morphological Analyzer",
        "Morphological analyzer and normalyzer allows: • to define following grammatical characteristic s of a word: part of speech, case, gender, number, tense, person, degree of comparison, voice, aspect, mood, form, type, transitiveness, reflexive, animation;",
        "Tun oBbiMHoe",
        "dene Hb.",
        "Pofl IjKeHciciifi",
        "' 1 BpewiH",
        "Miicno eflHHCTBeHHoe",
        "3 an or",
        "riaÄS^ jEMHHTenbHbIM",
        "HaKnoHBHwe",
        "J",
        "Bllfl",
        "] H3MBHaeM0CTb",
        "B03BpaTH0CTb",
        "JIH140",
        "j OflyrueeneHHocTb jHeonviueEneHHbifi",
        "• to modify a given word to its normal grammatical form/s - lemma/s (normalyzer).",
        "A set of applications were build on the base of the processor for three mentioned Slavonic languages.",
        "All applications are designed in Java and Oracle 9i.",
        "This makes them platform independent."
      ]
    }
  ]
}
