{
  "info": {
    "authors": [
      "Adam Przepiórkowski",
      "Marcin Woliński"
    ],
    "book": "Proceedings of the 2003 EACL Workshop on Morphological Processing of Slavic Languages",
    "id": "acl-W03-2905",
    "title": "A Flexemic Tagset for Polish",
    "url": "https://aclweb.org/anthology/W03-2905",
    "year": 2003
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Adam Przepiörkowski",
        "Institute of Computer Science Polish Academy of Sciences adamp@ipipan.waw.pl",
        "Marcin Wolinski",
        "Institute of Computer Science Polish Academy of Sciences wolinski@ipipan.waw.pl",
        "The article notes certain weaknesses of current efforts aiming at the standardization of POS tagsets for morphologically rich languages and argues that, in order to achieve clear mappings between tagsets, it is necessary to have clear and formal rules of delimiting POSs and grammatical categories within any given tagset.",
        "An attempt at constructing such a tagset for Polish is presented."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The aim of this article is to address one of the objectives of the EACL 2003 workshop on Morphological Processing of Slavic Languages, namely, to \"try to reveal lexical structures necessary for morphological analysis and... discuss standardization efforts in the field that can, for instance, enable transfer of applied methods from one language to the other or inform the annotation of morphological information in corpora.\"",
        "One admirable standardization effort in the field of Slavic part of speech (POS) tagging has been the Multext-East project (Erjavec, 2001), one of whose aims was to construct mutually compatible tagsets for 8 European languages, including 4 Slavic languages (originally Bulgarian, Czech and Slovene, later extended to Croatian); additionally, a Multext-East-style tagset for Russian was constructed at the University of Tübingen (http: //www.sfb441.uni-tuebingen.de/ci/ tagset.html).",
        "Those tagsets are based on a common repertoire of grammatical classes (POSs; e.g., 'verb', 'noun', 'adjective', etc.)",
        "and grammatical categories (e.g., 'case', 'person', 'gender', etc.",
        "), and each tagset uses just a subset of those grammatical classes and categories.",
        "Despite the considerable success of Multext-East, and the apparent uniformity of the resulting tagsets, certain weaknesses of this approach are clear.",
        "First of all, the relative uniformity of the POS classes across the 8 languages was attained at the cost of introducing the grammatical category 'type' whose values reflect the considerable differences between POS systems of the languages involved.",
        "Second, it is not clear that various grammatical categories and their values have the same interpretation in each language; for example, it is rather surprising that only the Romanian tagset explicitly mentions strong and weak pronominal forms, it is not clear whether negative pronouns in Romanian, Slovene, Czech and Bulgarian are negative in the same sense of participating in Negative Concord, it is not clear why Romanian has negative adverbs while, say, Czech lacks them, etc.",
        "Finally, and most importantly from our point of view, the approach adopted by Multext-East does not clearly reflect cross-linguistic correspondences, such as the one mentioned in (Er-javec, 2001), that \"in the Romanian case system the value 'direct' conflates 'nominative' and 'accusative', while the value 'oblique' conflates 'genitive' and 'dative'.\"",
        "Such correspondences are not exceptional, e.g., the at least three masculine genders of Polish (Manczak, 1956; Saloni, 1976) are mapped into the single masculine gender of many other languages, the dual and the plural numbers of some languages (Slovene, Czech) are mapped to plural of other languages, etc.",
        "In more general terms, we have identified the following features of currently used tagsets for Slavic in general and Polish in particular which seem problematic from the point of view of their reusability and cross-linguistic applicability:",
        "uncritical adoption of traditional and sometimes ill-defined POS classes, such as 'pronoun' or vaguely delimited classes such as 'verb' or 'noun' (it is often not clear whether gerunds are 'verbs' or 'nouns' in such classifications);",
        "POS classes and categories are often chosen on the basis of a mix of morphological, syntactic and semantic criteria, e.g., 'gender' in Slavic is sometimes defined on the basis of mixed morphosyntactic and semantic properties, and so are 'pronoun' and 'numeral'; mixing morphosyntactic annotation with what might be called dictionary annotation; e.g., tagsets often include tags for proper names or morphosyntactically transparent collocations, which – in our opinion – do not belong to the realm of POS annotation; sometimes the priorities of such mixed criteria are unclear, e.g., should the preposition of in District ofColumbia be tagged as an ordinary preposition, or should it have the 'proper' tag as it is a part of a proper name?",
        "• ignoring the finer points of the morphosyn-tactic system of a given language, e.g., the multitude of genders in languages such as Polish, or categories such as 'post-prepositionality' and 'accommodability' (see below);",
        "unclear segmentation rules (should so-called analytic tenses or reflexive verbs be treated as single units for the purpose of annotation?",
        ").",
        "The main thesis of this paper is that, in order for a tagset to be reusable and comparable with similar tagsets for related languages, it must be based on a homogeneous set of clear formal (morphological and morphosyntactic) criteria.",
        "Only once such criteria for delimiting grammatical classes and categories are presented in detail, can those classes and categories be mapped to grammatical classes and categories of other similarly constructed tagsets.",
        "The remainder of the paper presents such a tagset for Polish, developed within a Polish corpus project and deployed by a stochastic tagger of Polish (Debowski, 2003)."
      ]
    },
    {
      "heading": "2. A Flexemic Tagset for Polish",
      "text": [
        "The tagset presented in this section is based on the following design assumptions:",
        "what is being tagged is a single orthographic word or, in some well-defined cases, a part thereof; multi-word constructions, even those sometimes considered to be morphological formations (so-called analytic forms) or dictionary entries (proper names), should be considered by a different level of processing; cf. 2.1;",
        "• grammatical categories reflect various oppositions in the morphological system, even those oppositions which pertain to single grammatical classes and are not recognized by traditional grammars; cf. 2.2;",
        "the main criteria for delimiting grammatical classes are morphological (how a given form inflects; e.g., nouns inflect for case, but not for gender) and morphosyntactic (in which categories it agrees with other forms; e.g., Polish nouns do not inflect for gender but they agree in gender with adjectives and verbs); semantic criteria are eschewed; cf. 2.3.",
        "By segmentation, or tokenization, we mean the task of splitting the input text into tokens, i.e., segments of texts which are subject to morphosyntac-tic tagging.",
        "We propose the following guidelines for segmentation (for a more complete discussion see our other article in this volume):",
        "tokens do not contain white space; tokens either are punctuation marks or do not contain any punctuation marks; an exception to the previous guideline are certain words containing the hyphen (e.g., mass-media, s-ka = an abbreviation of spölka 'company', etc.)",
        "and apostrophe used in Polish when inflecting foreign names (e.g. La-grange'a); they are given by a list.",
        "Those guidelines do not preculde the situation where an orthographic word is split into several POS tokens.",
        "For example, in the case of Polish past tense finite verbs, the morpheme bearing information on person and number can be attached to the verb itself (1a) or to some other word within the sentence (1b).",
        "For that reason we always consider such a 'floating inflection' morpheme as a separate segment.",
        "Why I-dat not told be-you 'Why haven't you told me?'",
        "b. Dlaczegos mi nie powiedziala?",
        "Why be-you I-dat not told",
        "Although we proposed ignoring some information often present in tagsets, e.g., the 'proper noun' vs. 'common noun' distinction, we argue that morphological categories should be taken seriously and should be as detailed as possible.",
        "What follows is the complete list of morphological categories assumed in the proposed tagset:",
        "• gender: masculine personal ml (facet), masculine animate m2 (kon), masculine inanimate m3 (stöl), feminine f (kobieta, Zyrafa,",
        "Segmentation, as understood in the present context, is discussed at length in (Przepiörkowski and Wolmski, 2003).",
        "ksiazka), two neuter genders nl (dziecko), n2 (okno), and three plurale tantum genders pl (wujostwo), p2 (drzwi), p3 (okulary);",
        "• negation: aff, neg;",
        "• accentability (Pol.",
        ": akcentowosc): akc, nakc;",
        "• post-prepositionality (Pol.",
        ": poprzyimko-wosc): praep, npraep;",
        "accommodability (Pol.",
        ": akomodacyjnosc): congr, rec; agglutination (Pol.",
        ": aglutynacyjnosc): nagl,• vocability (Pol.",
        ": wokalicznosc): wok, nwok.",
        "It may seem surprising, at first, to see 9 gender values in an Indo-European language (as opposed to, say, a Bantu language), but this position is well argued for by (Saloni, 1976), who distinguishes those genders on the basis of agreement with adjectives and numerals; we will not attempt to further justify this position here.",
        "Negation is a category of various de-verbal classes, e.g., participles.",
        "Since we assume that the words piszacy 'writing' and niepiszacy 'not writing' have the same lemma pisac 'to write', these words have to be distinguished with this morphological category.",
        "The category of accentability is used to differentiate accented forms of nominal pronouns (e.g. jego, mnie) from weak forms (go, mi).",
        "It roughly corresponds to the category of clitic used in Multext-East.",
        "Post-prepositionality is another category of nominal pronouns.",
        "It differentiates special forms used only directly after a preposition (e.g., niego, -n) from forms that can be used in other contexts (jego, go).",
        "The category of accomodability is important for the description of Polish numeral-nominal phrase.",
        "Some Polish numerals have forms that agree in case with noun (marked congr), as well as forms that require a noun in genitive case (marked rec):",
        "(2) Przyszli dwaj chlopcy.",
        "came two-nom.congr boys-nom 'Two boys came.'",
        "(3) Przyszlo dwöch/dwu chlopcöw came two-nom.rec boys-gen",
        "The need for the category of agglutination is a result of the way past tense verb forms are segmented (cf. (1) in sec. 2.1).",
        "For the majority of Polish verbs the form used for the first and the second person is the same as the third person form:",
        "(4) a. Ty przyszedtes.",
        "you came b.",
        "On przyszedt.",
        "But for some verbs these forms differ:",
        "(5) a. Ty niost(nagl)es.",
        "you carried b.",
        "On niost(agl).",
        "he carried",
        "Vocability distinguishes those 'floating' forms of the verb byc 'to be' which attach to consonant-final forms (wok, e.g., -em) from the forms which attach to vowel-final forms (nwok, e.g., -m).",
        "Various non-standard categories used above, such as post-prepositionality, accomodability and agglutination, are based on important work by Zygmunt Saloni and his colleagues (Saloni, 1976; Saloni, 1977; Gruszczynski and Saloni, 1978; Bien and Saloni, 1982).",
        "Morphological classes, or parts of speech, assumed within various tagsets are usually taken over more-or-less verbatim from traditional grammars.",
        "For example, the Multext-East tagset for Czech assumes the following parts of speech: noun, verb, adjective, pronoun, adverb, adposi-tion, conjunction, numeral, interjection, residual, abbreviation and particle.",
        "While tagsets based on such POSs are well-grounded in linguistic tradition, they do not represent a logically valid classification of wordforms in the sense that the criteria which seem to underlie these classes do not always allow to uniquely classify a given word.",
        "We will support this criticism with two examples.",
        "Let us first of all consider the classes pronoun and adjective.",
        "The former is morphosyntactically very heterogeneous:",
        "• some pronouns inflect for gender (e.g., the demonstrative pronoun ten, the possessive pronoun möj, but not the interrogative pronoun kto or the negative pronoun nikt);",
        "• some pronouns, but not all, inflect for person;",
        "• some pronouns, but not all, inflect for number;",
        "• the short reflexive pronoun sie does not overtly inflect at all, although it may be construed as a weak form of the anaphoric pronoun siebie.",
        "It seems that the class of pronouns is defined mainly, if not solely, on the basis of semantic intuition.",
        "On the other hand, adjectives are well-defined morphosyntactically, as the forms inflecting for gender, number and case, but not, say, person or voice.",
        "Now, according to these definitions, it is not clear, whether so-called possessive pronouns, such as möj 'my' should be classified as pronouns or adjectives: semantically they belong to the former class, while morphosyntactically – to the latter.",
        "(Traditionally, it is classified as a pronoun, of course.)",
        "Another, and perhaps more serious example concerns so-called -nie/-cie gerunds, i.e., substan-tiva verbalia (Puzynina, 1969) such as pic::picie 'to drink::drinking', browsowac::browsowanie 'to browse::browsing'.",
        "These are nominal forms in the sense that they have gender (always n2) and inflect for case and, potentially, for number, but they are also productively related to verbs, have the category of aspect and inflect for negation.",
        "As such, they do not comfortably fit into the traditional class noun, whose members do not have aspect or negation, nor do they belong to the class verb, whose members have no case.",
        "A similar difficulty is encountered also in case of adjectival participles, which – apart from the adjectival inflectional categories of gender, number and case – also inflect for negation and have aspect.",
        "For this reason, and following the general approach of (Saloni, 1974) and (Bien, 1991), we propose to derive the notion of grammatical class from the notion of flexeme introduced by Bien, where flexeme is understood as a morphosyntac-tically homogeneous set of forms belonging to the same lexeme.",
        "For example, a typical Polish verbal lexeme contains a number of personal forms, a number of impersonal forms, as well as, depending on a particular understanding of the notion of lexeme, various deverbal forms, such as participles and gerunds.",
        "These forms have very different morphosyntactic properties: finite non-past tense forms have the inflectional categories of person and number, adjectival participles have the inflectional properties of non-gradable adjectives and, additionally, inflect for negation and have aspect, gerunds inflect for case and, at least potentially, for number, but not for person, etc.",
        "Ideally, flexemes are subsets of such lexemes consisting of those forms which have the same inflectional properties: all verbal forms of given lexeme with the inflectional category of person and number are grouped into one flexeme, other forms belonging to this lexeme, but with adjectival inflectional properties, are grouped into another flexeme, those forms, which inflect for case but not for gender are grouped into a gerundial flexeme, etc.",
        "Each of such flexemes is characterized by a set of grammatical categories it inflects for and, perhaps, a set of grammatical categories it has lexically set (e.g., the gender of nouns).",
        "Now, given the notion of flexeme, it is natural to define grammatical classes as flexemic classes, i.e., classes of flexemes with the same inflectional characteristics.",
        "For example, the grammatical class non-past verb contains exactly those flexemes which inflect for person and number, and nothing else, and which also have the lexical category of aspect; the class noun contains exactly those flexemes which inflect for number and case, and have gender; the class gerund contains exactly those flexemes which inflect for number, case and negation, and have lexical gender (always neuter, n2, in case of gerunds) and aspect; etc.",
        "It should be noted that, despite the way flexemes have been defined above, the notion of lexeme is of only secondary importance here: it is invoked for the purpose of assigning a lemma to a given form (e.g., a gerundial form such as przyjs-ciem 'coming-inst will be lemmatized to the infinitival formprzyjsc 'to come': even though the form przyjsc does not belong to the flexeme of przyjsciem, it does belong to the lexeme containing przyjsciem).",
        "Moreover, just as in case of deciding whether two forms belong to the same lexeme, also classification of two wordforms to the same flexeme requires some semantic intuition: thus, e.g., pies 'dog-nom' and psem 'dog-inst' belong to the same (f)lexeme, and so do rok 'year-sg' and lata 'year-pl', but pies 'dog' and suka 'bitch' do not.",
        "The basic classification of flexemes into grammatical ('flexemic') classes is given by the following decision tree:",
        "Inflects for case?",
        "YES: Inflects for negation?",
        "YES: Inflects for gender?",
        "YES: 1. adjectival participle NO: 2. gerund NO: Inflects for gender?",
        "YES: Has person?",
        "YES: 3. nominal pronoun NO: Inflects for number?",
        "YES: 4. adjective NO: 5. numeral NO: 6. noun NO: Inflects for gender?",
        "YES: 7. f-participle NO: Inflects for number?",
        "forms, adverbs, prepositions, conjunctions)",
        "Note that most of the classes in the 'inflects for case branch of the tree already are reasonable POSs, i.e., they correspond to traditional POSs (noun, adjective, numeral) or to their well-defined subsets (nominal pronoun, gerund, adjectival participle).",
        "It is important to realize, however, that these classes are defined mainly on the basis of the inflectional properties of their members; e.g., the class numeral is much narrower here than traditionally, as it does not include so-called ordinal numerals (which, morphosyntac-tically, are adjectives).",
        "On the other hand, in the 'does not inflect for case' branch, only the 'inflects for gender' class corresponds to an intuitive set of forms, namely, to so-called l-participles or past participles, i.e., verbal forms hosting 'floating inflections'; cf. powiedziala in (1) above.",
        "The class 8. above can be further partitioned according to the following criteria:",
        "NO: Has a pri sg form?",
        "YES: 8.2. agglutinate",
        "Non-past verb forms correspond to present tense for imperfective verbs (e.g., ide 'I am going') and future tense for perfective ones (e.g., pöjde 'I will go ).",
        "Further, we will remove from the class of nouns the flexeme of the strong reflexive pronoun siebie, which does not inflect for number and does not have overt gender:",
        "Moreover, inflectional class marked as 9. can be further split according to non-inflectional mor-phosyntactic properties of its members in the following way:",
        "The first two classes are closed classes, which can be defined extensionally, by enumerating them.",
        "All other non-inflecting, non-aspectual and non-de-adjectival single-form flexemes fall into the particle-adverb class.",
        "The table on the next page presents the complete repertoire of grammatical classes and their respective inflectional ('0') and lexical ('©') categories.",
        "Some more ephemeral classes not mentioned in the decision tree are briefly described below (a more complete description of a previous version of this tagset is available in (Wolinski and Przepiörkowski, 2001)).",
        "For Polish nouns of masculine personal (mi) gender a stylistically marked form is possible besides a 'regular' form for nominative and vocative case in plural (e.g., profesory vs. profesorowie).",
        "These special forms do not fit in the scheme of regular nominal inflection, and so were moved to a separate flexeme for depreciative noun.",
        "Ad-adjectival adjectives are special forms of adjectives used in compounds like angielsko-polski 'English-Polish'.",
        "Moreover, some adjectives (e.g., polski) have a special form that is required after some prepositions (e.g., po polsku 'in Polish').",
        "This form constitutes post-prepositional adjective flexeme.",
        "A few verbs (e.g., powinien 'should') inflect in an atypical way and lack some verbal flexemes (e.g., imperative and l-participle).",
        "Winien-like flexeme gathers present tense forms of these verbs (which accept 'floating inflection').",
        "The class of predicatives consists of verbs which do not inflect at all (e.g., warto 'be worth', mozna 'can/may', trzeba 'must')."
      ]
    },
    {
      "heading": "9.. Has aspect?",
      "text": [
        "YES: 9.1. non-inflecting verbal forms NO: Inflects for degree or derived from adjective?",
        "YES: 9.2. adverb NO: 9.3. preposition, conjunction, etc.",
        "In order to arrive at a class close to the traditional class of adverbs, we had to define this class disjunctively; it should contain all adverbs inflecting for degree, at least one of which does not seem to be derived from an adjective (bardzo 'very ), as well as all de-adjectival adverbs, some of which do not (synthetically) inflect for degree (e.g., anty-wirusowo 'anti-virus-like', *antywirusowiej).",
        "If our purpose were to define a purely flexemic tagset for Polish, we would have to stop here (and remove the 'derived from adjective disjunct from the subtree above).",
        "For example, it is impossible to distinguish the impersonal -no/-to form, the infinitive, and adverbial participle of the same lexeme on the basis of their morphosyntactic properties alone: they all lack any inflectional categories and have the lexical category ofaspect.",
        "For this reason, we will further partition the class 9.1. above on the basis of purely orthographic (or phonetic) information:",
        "YES: 9.1.2. adverbial participle",
        "(e.g., czytajac 'reading', przeczytawszy 'having read') NO: 9.1.3. infinitive form (e.g., isS 'to go'); should end in c or -c",
        "Finally, the class 9.3. consists of those word-forms which do not inflect, and do not have aspect , i.e.:"
      ]
    },
    {
      "heading": "3. Conclusions",
      "text": [
        "Two tagsets can be compared and respective correspondences between their grammatical classes and categories can be found more easily when the definitions of those classes and categories are stated explicitly and formulated in terms of easily verifiable formal properties of particular word-forms, such as their inflectional, morphosyntactic and derivational characteristics, and their phonological or orthographic makeup.",
        "number",
        "c<3 O",
        "gender",
        "person",
        "degree",
        "aspect",
        "negation",
        "accent.",
        "post-prep.",
        "accom.",
        "00 00",
        "vocab.",
        "noun",
        "©",
        "©",
        "0",
        "depreciative noun",
        "0",
        "©",
        "0",
        "adjective",
        "©",
        "©",
        "©",
        "©",
        "ad-adjectival adjective",
        "post-prepositional adjective",
        "adverb",
        "©",
        "numeral",
        "0",
        "©",
        "©",
        "©",
        "pronoun (non-3rd person)",
        "0",
        "©",
        "©",
        "0",
        "©",
        "pronoun (3rd person)",
        "©",
        "©",
        "©",
        "0",
        "©",
        "©",
        "pronoun siebie",
        "©",
        "non-past verb",
        "©",
        "©",
        "0",
        "future bye",
        "©",
        "©",
        "0",
        "agglut.",
        "bye",
        "©",
        "©",
        "0",
        "©",
        "1-participle",
        "©",
        "©",
        "0",
        "©",
        "imperative",
        "©",
        "©",
        "0",
        "-nol-to",
        "0",
        "infinitive",
        "0",
        "adv.",
        "pres.",
        "prtcp.",
        "0",
        "adv.",
        "anter.",
        "prtcp.",
        "0",
        "gerund",
        "©",
        "©",
        "0",
        "0",
        "©",
        "adj.",
        "act.",
        "prtcp.",
        "©",
        "©",
        "©",
        "0",
        "©",
        "adj.",
        "pass, prtcp.",
        "©",
        "©",
        "©",
        "0",
        "©",
        "winien-like verb",
        "©",
        "©",
        "0",
        "predicative",
        "preposition",
        "0",
        "conjunction",
        "particle-adverb",
        "alien (nominal)",
        "©",
        "©",
        "0",
        "alien (other)",
        "We presented a tagset for Polish constructed with such criteria in mind.",
        "In particular, grammatical classes are understood as classes of flexemes, i.e., they are defined on the basis of, first of all, inflectional and, secondly, morphosyntactic properties of wordforms.",
        "Further distinctions, such as those between non-inflecting forms of verbal lexemes, are also made with the avoidance of any recourse to the semantic or pragmatic properties of such forms.",
        "This allowed us to evade the controversial issues of the exact extent of such semantically-defined traditional POSs as numeral and pronoun.",
        "Despite the evasion of semantic criteria, the resulting set of grammatical classes bears surprising affinity to traditional POSs, with classes such as noun and adjective corresponding directly to traditional POSs, and other classes, such as non-past verb, l-participle or gerund being proper subclasses of such traditional POSs as verb.",
        "Because of this fine-grainedness of the current tagset we were able to evade the controversial issues of whether to classify gerunds as nouns or as verbs, and whether to classify adjectival participles as adjectives or as verbs."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The tagset described here was highly influenced by many discussions with Lukasz Debowski, by the insightful comments we received from Zyg-munt Saloni, and by the various remarks from ElZ-bieta Hajnicz, Monika Korczakowska and Beata Wierzcholowska.",
        "The research reported here was partly supported by the KBN (State Committee for Scientific Research) grant 7 T11C 043 20."
      ]
    }
  ]
}
