{
  "info": {
    "authors": [
      "Tadashi Kumano",
      "Hideki Kashioka",
      "Hideki Tanaka",
      "Takahiro Fukusima"
    ],
    "book": "Workshop on Multilingual and Mixed-Language Named Entity Recognition",
    "id": "acl-W03-1503",
    "title": "Construction and Analysis of Japanese-English Broadcast News Corpus With Named Entity Tags",
    "url": "https://aclweb.org/anthology/W03-1503",
    "year": 2003
  },
  "references": [
    "acl-C94-2175",
    "acl-J93-1004",
    "acl-J93-1006",
    "acl-M98-1002",
    "acl-M98-1028",
    "acl-M98-1029",
    "acl-P02-1051",
    "acl-P91-1022",
    "acl-P96-1018",
    "acl-P98-1069",
    "acl-W98-1005"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We are aiming to acquire named entity (NE) translation knowledge from non-parallel, content-aligned corpora, by utilizing NE extraction techniques.",
        "For this research, we are constructing a Japanese-English broadcast news corpus with NE tags.",
        "The tags represent not only NE class information but also coreference information within the same monolingual document and between corresponding Japanese-English document pairs.",
        "Analysis of about 1,100 annotated article pairs has shown that if NE occurrence information, such as classes, number of occurrence and occurrence order, is given for each language, it may provide a good clue for corresponding NEs across languages."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Studies on named entity (NE) extraction are making progress for various languages, such as English and Japanese.",
        "A number of evaluation workshops have been held, including the Message Understanding Conference (MUC)1 for English and other languages, and the Information Retrieval and Extraction Exercise (IREX)2 for Japanese.",
        "Extraction accuracy for English has reached a nearly practical level (Marsh and Perzanowski, 1998).",
        "As for Japanese, it is more difficult to find NE bound",
        "aries, however, NE extraction is relatively accurate (Sekine and Isahara, 2000).",
        "Most of the past research on NE extraction used monolingual corpora, but the application of NE extraction techniques to bilingual (or multilingual) corpora is expected to obtain NE translation pairs.",
        "We are developing a Japanese-English machine translation system for documents including many NEs, such as news articles or documents about current topics.",
        "Translating NE correctly is indispensable for conveying information correctly.",
        "NE translations, however, are not listed in conventional dictionaries.",
        "It is necessary to retrieve NE translation knowledge from the latest bilingual documents.",
        "When extracting translation knowledge from bilingual corpora, using literally translated parallel corpora, such as official documents written in several languages makes it easier to get the desired information.",
        "However, not many of such corpora contain the latest NEs.",
        "There are few Japanese-English corpora which are translated literally.",
        "Therefore, we decided to extract NE translation pairs from content-aligned corpora, such as multilingual broadcast news articles including new NEs daily, which are not literally translated.",
        "Sentential alignment (Brown et al., 1991; Gale and Church, 1993; Kay and R¨oscheisen, 1993; Ut-suro et al., 1994; Haruno and Yamazaki, 1996) is commonly used as a starting point for finding the translations of words or expressions from bilingual corpora.",
        "However, it is not always possible to correspond non-parallel corpora in sentences.",
        "Past statistical methods for non-parallel corpora (Fung and Yee, 1998) are not valid for finding translations of words or expressions with low frequency.",
        "These methods have a problem in covering NEs because there are many NEs that appear only once in a corpus.",
        "So we need a specialized method for extracting NE translation pairs.",
        "Transliteration is used for finding the translations of NE in the source language from texts in the target language (Stalls and Knight, 1998; Goto et al., 2001; Al-Onazian and Knight, 2002).",
        "Transliteration is useful for the names of persons and places; however, it is not applicable to all sorts of NEs.",
        "Content-aligned documents, such as a bilingual news corpus, are made to convey the same topics.",
        "Since NEs are the essential element of document contents, content-aligned documents are likely to share NEs pointing to the same objects.",
        "Consequently, when extracting all NEs with NE class information from each of a pair of bilingual documents separately by applying monolingual NE extraction techniques, the distribution of the NEs in each document may be similar enough to recognize correspondences between the NE translation pairs.",
        "A technique for finding bilingual NE correspondences will have a wide range of applications other than NE translation-pair extraction.",
        "For example,",
        "• Bilingual NE correspondences have clues for identifying corresponding parts in a pair of noisy bilingual documents.",
        "• The similarity of any two documents in different languages can be estimated by NE translation-pair correspondence.",
        "For this research, we obtained a Japanese-English broadcast news corpus (Kumano et al., 2002) by the Japanese broadcast company NHK3, and we are manually tagging NEs in the corpus to analyze it and to conduct NE translation-pair extraction experiments.",
        "The tag specifications are based on the IREX NE task (Sekine and Isahara, 1999), the evaluation workshop of Japanese NE extraction.",
        "We extended the specifications to English NEs.",
        "In addition, coreference information between NEs, within the same monolingual document and between the corresponding Japanese-English document pairs (henceforth,",
        "we call these in a language and across languages, respectively), is added to each of the tagged NEs, for NE translation-pair extraction studies.",
        "In Section 2, we will introduce the bilingual corpus used in this study and describe its characteristics.",
        "Then, we will discuss tag design for NE extraction studies, and explain the tag specifications and existing problems.",
        "The current status of corpus annotation under these specifications will also be introduced.",
        "We analyzed an annotated part of the corpus in terms of NE occurrence and translation.",
        "This analysis will be shown in Section 3.",
        "In Section 4, we will mention future plans for the extraction of NE translation-pairs.",
        "2 Constructing a Japanese-English broadcast news corpus with NE tags"
      ]
    },
    {
      "heading": "2.1 Characteristics of the NHK Japanese-English broadcast news corpus",
      "text": [
        "We are annotating an NHK broadcast news corpus with NE tags.",
        "The corpus is composed of Japanese news articles for domestic programs and English news articles translated for international broadcasting4 and domestic bilingual programs5.",
        "Figure 1 shows an example of a Japanese news article and its translation in English.",
        "The original Japanese article and the translated English article deal with the same topic, but they differ much in details.",
        "The difference arises from the following reasons (Kumano et al., 2002).",
        "Audience Content might be added or deleted, according to the audience, especially for international broadcasting.",
        "Broadcasting date The broadcasting of English news is often delayed compared to the original Japanese news.",
        "The time expressions might be changed sometimes or new facts might be added to the articles.",
        "News styles/ languages Comparing news articles of two languages reveals that they have different presentation styles, for example, facts are sometimes introduced in a different order.",
        "The",
        "the content tends to be lost through the translation process."
      ]
    },
    {
      "heading": "3.2 In-language characteristics of NE occurrences 3.2.1 Frequency",
      "text": [
        "The number of occurrences for each NE class is listed in Table 3.",
        "The distribution of NE classes is almost the same as that in the data for MUC-7 or IREX.",
        "By comparing the decrease in content (cf. Table 2), the number of NE tokens also decreases for translations.",
        "However, the degree of the NE decrease is less than that of the morphemes/words.",
        "It is also remarkable that the number of NE types is fairly well preserved.",
        "Notice that only a small number of tokens in the NE class TIME appear in English.",
        "The reason may be that detailed time information may become less important for English articles, which are intended for audiences outside of Japan and broadcast later than the original Japanese articles.",
        "To examine the surface form distribution in the same NE groups, we counted the number of members (freq) and sorts of surface form (sort) for each NE group in each article.",
        "The probability that a given member has a unique surface form in a group",
        "that has two or more members (uniq) has also been calculated as follows: uniq = freq − 2Csort − 2 freq − 1 Csort − 1 Table 4 shows the values averaged for all the NE groups that appeared in all articles.",
        "In English, a repetition of the same expression is not conventionally desirable.",
        "Therefore, pronouns or paraphrases are used frequently.",
        "On the other hand, Japanese does not have such a convention.",
        "This difference is considered to be the reason for the result shown in Table 4: freq in English is smaller than that in Japanese, and sort in English is larger than that in Japanese.",
        "As a result, uniq in English is higher than that in Japanese.",
        "These tendencies differ slightly according to the NE classes.",
        "• The sort of English PERSON is notably large.",
        "In English, the name of a person is usually first expressed in full, and after that, it tends to be expressed only by the family name.",
        "In Japanese, only the family name is generally used from the beginning, especially for well-known persons.",
        "(freq ≥ 2).",
        "freq − 1",
        "groups (only for those having cross-language correspondences)",
        "• The uniq of English MONEY is quite high.",
        "A money expression in Japanese tends to be translated into English as both the original currency (usually yen) and dollars.",
        "• The freq of temporal and number expressions are smaller than those of named entities in the narrow sense."
      ]
    },
    {
      "heading": "3.3 Cross-language characteristics of NE occurrences 3.3.1 Correspondence across languages",
      "text": [
        "We calculated the rates for a given NE in a document to have a corresponding NE in the counterpart language.",
        "The units of NE correspondences we used for these calculations are both NE token and NE group (type).",
        "The results, shown in Table 5, show that an NE that appeared in English will have a Japanese NE correspondent with a high rate.",
        "We also conducted the same survey as we did in Table 4 for only NEs having cross-language corefer-ences, whose results are shown in Table 6.",
        "A comparison of both results shows that the freq for only NEs having cross-language coreferences is larger,",
        "especially in Japanese.",
        "An NE occurring more times in an article may have more important information and is more likely to appear in the translation."
      ]
    },
    {
      "heading": "3.3.2 Preservation of NE order",
      "text": [
        "We investigated how well the order of NEs occurring in an article is preserved in the counterpart language as follows:",
        "1.",
        "In every article, we eliminated all NEs except the first occurrence of every NE group.",
        "2.",
        "We calculated the ratio between all of the possible NE pairs in the source language and those translated into the target language with the same order of occurrence.",
        "Table 7 lists the average preservation ratios of the NE order for all NEs (“All”) and for NEs having corresponding NEs in the counterpart (“Corr.",
        "only”).",
        "The scores labeled “All NEs” express ratios for the order of all NEs.",
        "The preservation ratio for each NE class is listed below in the table.",
        "The NE orders are preserved so well even for all NEs that they can be used for determining cross-language correspondences."
      ]
    },
    {
      "heading": "4 Conclusion",
      "text": [
        "In this paper, in which we aimed to acquire NE translation knowledge, we described our construction of a Japanese-English broadcast news corpus with NE tags for NE translation-pair extraction.",
        "The tags represent NE characteristics and coreference information in a language and across languages.",
        "Analysis of the annotated 1,097 article pairs has shown that if NE occurrence information, such as classes, number of occurrences and occurrence order, is given for each language side, it may provide a good clue for determining NE correspondence across languages.",
        "Our future plans are listed below.",
        "• The problems in Section 2.5 need to be reexamined from the point of view of what information bilingual corpora should have for NE translation-pair extraction research.",
        "• The proposed analysis in Section 3 pointed out that identifying coreferences in a language is very important for achieving NE translation-pair extraction.",
        "Richer coreference information should be annotated in our corpus for coreference identification studies.",
        "We are planning to annotate coreference information for pronouns and some other non-NE expressions, referring to the MUC-7 coreference task definition (Hirschman and Chinchor, 1997).",
        "• Corpora with different characteristics, such as a bilingual newspaper corpus, will be annotated and analyzed.",
        "Acknowledgments This research was supported in part by the Telecommunications Advancement Organization of Japan."
      ]
    }
  ]
}
