{
  "info": {
    "authors": [
      "Takehito Utsuro",
      "Takashi Horiuchi",
      "Takeshi Hamamoto",
      "Kohei Hino",
      "Takeaki Nakayama"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E03-1023",
    "title": "Effect of Cross-Language IR in Bilingual Lexicon Acquisition from Comparable Corpora",
    "url": "https://aclweb.org/anthology/E03-1023",
    "year": 2003
  },
  "references": [
    "acl-C02-1065",
    "acl-C96-1006",
    "acl-C96-2098",
    "acl-P95-1050",
    "acl-P98-1041",
    "acl-P98-1069",
    "acl-P99-1067",
    "acl-W95-0114"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Within the framework of translation knowledge acquisition from WWW news sites, this paper studies issues on the effect of cross-language retrieval of relevant texts in bilingual lexicon acquisition from comparable corpora.",
        "We experimentally show that it is quite effective to reduce the candidate bilingual term pairs against which bilingual term correspondences are estimated, in terms of both computational complexity and the performance of precise estimation of bilingual term correspondences."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Translation knowledge acquisition from parallel/comparative corpora is one of the most important research topics of corpus-based MT.",
        "This is because it is necessary for an MT system to (semi-)automatically increase its translation knowledge in order for it to be used in the real world situation.",
        "One limitation of the corpus-based translation knowledge acquisition approach is that the techniques of translation knowledge acquisition heavily rely on availability of parallel/comparative corpora.",
        "However, the sizes as well as the domain of existing parallel/comparative corpora are limited, while it is very expensive to manually collect parallel/comparative corpora.",
        "Therefore, it is quite important to overcome this resource scarcity bottleneck in corpus-based translation knowledge acquisition research.",
        "In order to solve this problem, this paper focuses on bilingual news articles on WWW news sites as a source for translation knowledge acquisition.",
        "In the case of WWW news sites in Japan,",
        "Within this framework of translation knowledge acquisition from WWW news sites, this paper studies issues on the effect of cross-language retrieval of relevant texts in bilingual lexicon acquisition from comparable corpora.",
        "First, we show that, due to its computational complexity, it is difficult to straightforwardly apply previously studied techniques of bilingual term correspondence estimation from comparable corpora, especially in the case of large scale evaluation such as those presented in this paper.",
        "Then, we show that, with the help of cross-language retrieval of relevant texts, this computational difficulty can be easily avoided by reducing the candidate bilingual term pairs against which bilingual term correspondences are estimated.",
        "It is also experimentally shown that candidate reduction with the help of cross-language retrieval of relevant texts is quite effective in improving the performance of precise estimation of bilingual term correspondences."
      ]
    },
    {
      "heading": "2 Acquisition of Bilingual Term Correspondences from Comparable Corpora",
      "text": [
        "Previously studied techniques of estimating bilingual term correspondences from comparable corpora are mostly based on the idea that semantically similar words appear in similar contexts (Fung, 1995; Rapp, 1995; Kaji and Aizono, 1996; Tanaka and Iwasaki, 1996; Fung and Yee, 1998; Rapp, 1999; Tanaka, 2002).",
        "In those techniques, frequency information of contextual words co-occurring in the monolingual text is stored and their similarity is measured across languages.",
        "The following gives a rough formalization of the previous approaches to acquiring bilingual term correspondences from comparable corpora.",
        "Suppose that CCe and CCj denote an English corpus and a Japanese corpus, respectively, and that they can be considered as comparable corpora.",
        "Then, in the previous approaches, for each English term in CCe and each Japanese term tj in CCj, occurrences of surrounding words are recorded in the form of some vector cv(tE, CCe) and cv(tj, CCj), respectively.",
        "In previous works, as weights of these contextual vectors, word frequencies or modified weights such as tf ■ idf are used.",
        "Finally, for every pair of an English term and a Japanese term tj, bilingual term correspondence corrEj{tE,tj) is estimated in terms of a certain similarity measure sim(cv(tE,CCE),cv(tj,CCj)) between contextual vectors cv(tE, CCe) and cv(tj, CCj): Here, in the modeling of contextual similarities across languages, earlier works such as Fung (1995), Rapp (1995), and Tanaka and Iwasaki (1996) studied to measure the similarities of contextual co-occurrence patterns across languages without the help of any existing bilingual lexicons.",
        "On the other hand, later works such as Kaji and Aizono (1996), Fung and Yee (1998), Rapp (1999), and Tanaka (2002) studied to exploit existing bilingual lexicons as initial seed for modeling of contextual similarities across languages.",
        "As the similarity measure sim(cv(tE,CCE)-,cv(tj,CCj)) between contextual vectors cv(tE,CCE) and cv(tj,CCj), measures such as cosine measure, dice coefficient, and Jaccard coefficient are used."
      ]
    },
    {
      "heading": "3 Acquisition of Bilingual Term Correspondences from Cross-Lingually Relevant Texts 3.1 Cross-Language Retrieval of Relevant News Articles This section gives the overview of our framework of cross-language retrieval of relevant news articles from WWW news sites (Utsuro and others, 2002). First, from WWW news sites, both Japanese and English news articles within certain range of dates are retrieved. Let dj and dE denote one of the retrieved Japanese and English articles, respectively. Then, each English article dE is translated into a Japanese document djIT by some commercial MT software. Each Japanese article",
      "text": [
        "sidered as contexts of a term are those that co-occur in the same sentence, or in a window of a few words.",
        "dj as well as the Japanese translation dj of each English article are next segmented into word sequences, and word frequency vectors v(dj) and v(djIT) are generated.",
        "Then, cosine similarities between v(dj) and v(djIT) are calculated and pairs of articles dj and dE which satisfy certain criterion are considered as candidates for \"identical\" or \"relevant\" article pairs.",
        "As will be described in section 4.1, on WWW news sites in Japan, the number of articles updated per day is far greater (5^30 times) in Japanese than in English.",
        "Thus, it is much easier to find cross-lingually relevant articles for each English query article than for each Japanese query article.",
        "Considering this fact, we estimate bilingual term correspondences from the results of cross-lingually retrieving relevant Japanese articles with English query articles.",
        "For each English query article d'E in CCe and its Japanese translation d jIT', the set D j of Japanese articles with cosine similarities higher than or equal to a certain lower bound Ld is constructed: This section describes the techniques we apply to the task of estimating bilingual term correspondences from cross-lingually relevant texts.",
        "Here, we compare several techniques in order to evaluate the effect of cross-language retrieval of relevant texts in the performance of acquiring bilingual term correspondences from comparable corpora.",
        "In the first technique, we regard cross-lingually relevant texts as a pseudo-parallel corpus, where standard techniques of estimating bilingual term correspondences from parallel corpora are employed.",
        "In the second technique, we regard cross-lingually relevant texts as a comparable corpus, where bilingual term correspondences are estimated in terms of contextual similarities across languages.",
        "In this second approach, we further evaluate the effect of cross-language retrieval of relevant texts by comparing the cases with/without reducing candidates of bilingual term pairs with the help of cross-lingually relevant text pairs.",
        "Here, we describe how to estimate bilingual term correspondences from cross-lingually relevant texts by regarding them as a pseudo-parallel corpus.",
        "First, we concatenate constituent Japanese articles of Dj into one article D'j, and regard the article pair dE and D'j as a pseudo-parallel sentence pair.",
        "Next, we collect such pseudo-parallel sentence pairs and construct a pseudo-parallel corpus PPCej of English and Japanese articles: Then, we apply standard techniques of estimating bilingual term correspondences from parallel corpora (Matsumoto and Utsuro, 2000) to this pseudo-parallel corpus PPCej.",
        "First, from a pseudo-parallel sentence pair dlE and D'j, we extract monolingual (possibly compound) term pair where those term pairs are possibly required to satisfy frequency lower bounds and the upper bound of the number of constituent words.",
        "Tnen, based on the contingency table of co-occurrence frequencies of tE ana t j below, we estimate bilingual term correspondences according to the statistical measures such as the mutual information, the cj> statistic, the dice coefficient, and the log-likelihood ratio.",
        "We compare the performance of those four measures, where the <p statistic and the log-likelihood ratio perform best, the dice coefficient the second best, and the mutual information the worst.",
        "In section 4.3, we show results with the <fi statistic as the bilingual term correspondence corrEj{tE-, tj): 2/ (ad – be) Next, we describe how to estimate bilingual term correspondences from cross-lingually relevant texts by regarding them as a comparable corpus.",
        "Here, when selecting the candidates of bilingual term pairs against which bilingual term correspondences are estimated, we evaluate two approaches.",
        "In the first approach, as described in section 2 for the case of acquisition from comparable corpora, for every pair of an English term and a Japanese term, bilingual term correspondence is estimated.",
        "In the second approach, on the other hand, as described in the previous section for the case of acquisition from (pseudo-) parallel corpora, the candidates of bilingual term pairs are selected from a pseudo-parallel sentence pair dlE and Dj as in the formula (2).",
        "In this second approach, we intend to evaluate the effect of cross-language retrieval of relevant texts in the performance of acquiring bilingual term correspondences from comparable corpora, i.e., in reducing useless bilingual term pairs and in increasing the estimated confidence of useful bilingual term pairs.",
        "More specifically, first, a reduced but cross-lingually more relevant comparable corpus is constructed from the result of cross-language retrieval of relevant news articles in section 3.1.",
        "Referring to the definition of the set D j of relevant Japanese articles in the equation (1), the reduced English corpus RCe is constructed by collecting English query articles each of which has at least one relevant Japanese article: Next, the reduced Japanese corpus RCj that is cross-lingually relevant to RCe is constructed by collecting those relevant Japanese articles: Then, for each English term i# in RCe and each Japanese term tj in RCj, occurrences of surrounding words are recorded in the form of some vector cv(tE, RCe) and cv(tj, RCj), respectively.",
        "Here, more precisely, the contextual vector cv(tE, RCe) of an English term tE is constructed by summing up the word frequency vector v(sjITl) of Japanese translation Sj4Tl of each English sentence sE which contains tE'.",
        "Vs«E in rce S.t.",
        "tEGsj, Finally, bilingual term correspondence corrEj(tE, tj) is estimated in terms of a certain similarity measure situe j between contextual vectors cv(tE, RCe) and cv(tj, RCj): corrEj(tE,tj) = simEj(cv(tE,RCE),cv(tj,RCj)) In the experimental evaluation, we show results with cosine measure as the similarity measure simEj(cv(tE, RCe), cv(tj, RCj)).",
        "Here, when selecting the candidates of bilingual term pairs, we compare the two approaches mentioned above."
      ]
    },
    {
      "heading": "4 Experimental Evaluation",
      "text": []
    },
    {
      "heading": "4.1 Japanese-English Relevant News Articles on WWW News Sites",
      "text": [
        "We collected Japanese and English news articles from three WWW news sites A, B, and C. Table 1 shows the total number of collected articles and the range of dates of those articles represented as the number of days.",
        "Table 1 also shows the number of articles updated in one day, and the average article size.",
        "The number of Japanese articles updated in one day are far greater (5~30 times) than that of English articles.",
        "Then, for each of the three sites and for each of the two classes \"identical\" I \" relevant\", we manually collected 50 (i.e., 50 x 3 x 2 = 300 in total) reference article pairs for the evaluation of cross-language retrieval of relevant news articles.",
        "This evaluation result will be presented in the next section.",
        "We evaluate the performance of cross-language retrieval of \"identical\" I \"relevant\" reference article pairs (Utsuro and others, 2002).",
        "In the direction of English to Japanese cross-language retrieval, precision/recall rates of the reference (a) Identical (b) Relevant \"identical\" I \"relevant\" articles against those with the similarity values above the lower bound Ld are measured, and their curves against the changes of Ld are shown in Figure 2.",
        "Let DPref denote the set of reference article pairs within the range of dates, the precise definitions of the precision and recall rates of this task are given below (here, cos(dB, dj) = cos(v(dfT), v(dj))):",
        "In the case of \"identical\" article pairs, Japanese articles with the similarity values above 0.4 have precision of around 40% or more.",
        "For the news sites A, B, and C, and for several lower bounds Ld of the similarity between English and Japanese articles, Table 2 shows the numbers of English and Japanese articles which satisfy the similarity lower bound (the difference of dates of English and Japanese articles is given as the maximum range of dates, with which all the cross-lingually \"identical\" articles can be discovered).",
        "In the evaluation of estimating bilingual term correspondences, we divide the whole set of estimated bilingual term correspondences into subsets, where each subset consists of English and Japanese term pairs which have a common English term.",
        "We construct the set TP(tE) of English and Japanese term pairs which have tE in the English side and satisfy the requirements on (cooccurrence) frequencies and term length in their constituent words as below: conditions L^ – Lj – UjJ = 5).",
        "We call the shared English term tE of the set TP(tg) as index.",
        "Next, all the sets TP(tE),.... TP(t^) are sorted in descending order of the maximum value of the bilingual term correspondence corrEj(tE,tj) among their constituent term pairs.",
        "We denote this maximum value as correj{TP(tE))'.",
        "max corrEj(tE,tj) First, for the site A with the similarity lower bound Ld = 0.3, topmost 200 TP(t^) according to the maximum bilingual term correspondence correj{TP{tE)) are examined by hand and 146 bilingual term pairs contained in the topmost 200 TP(t^) are judged as correct.",
        "We compared those 146 bilingual term pairs with an existing bilingual lexicon (Eijiro Ver.37, 850,000 entries, http : //member .nifty.ne.",
        "jp/eijiro/), where 86 of them (almost 60%) are not included in the existing bilingual lexicon.",
        "This manual evaluation result indicates that it is quite possible to extend a large scale existing bilingual lexicon such as the one used in our evaluation.",
        "Next, Table 3 lists the numbers of English and Japanese monolingual terms, those of candidate term pairs against which bilingual term correspondences are estimated, and those of term pairs found in the existing bilingual lexicon.",
        "The rows with \"(without CLIR)\" show statistics for the whole comparable corpus CCe and CCj.",
        "The rows with \"L^ (with CLIR)\" show lower bounds of article similarities and statistics for the cross-lingually relevant English corpus RCe and Japanese corpus RCj, that are reduced from the whole comparable corpus CCe and CCj.",
        "The columns with \"reduced\" show statistics when the candidate bilingual term pairs are selected from a pseudo-parallel sentence pair as in the formula (2).",
        "The columns with \"full\" shows statistics when corrEj(TP(tE)) full: every term pair, reduced: term pairs found in a pseudo-parallel sentence pair, n/a: due to time complexity,",
        "the candidate bilingual term pairs are every pair of an English term found in RCe on CCe and a Japanese term found in RCj or CCj.",
        "For the moment, several numbers are unavailable (marked with \"n/a\") due to time complexity.",
        "It is very important to compare the column \"rate (full/reduced)\" for the numbers of candidate term pairs with that for the numbers of term pairs found in the existing bilingual lexicon.",
        "The candidate term pairs can be reduced to about 3.5~ 10% of their original sizes with the help of a pseudo-parallel sentence pair, while about 37^50% of the correct bilingual term pairs found in the existing bilingual lexicon are preserved.",
        "Therefore, candidate reduction with the help of a pseudo-parallel The computational complexity of bilingual term correspondence estimation based on contextual similarity in comparable corpora (sections 2 and 3.2.2) is much more than that based on pseudo-parallel corpus (section 3.2.1).",
        "The whole process of estimating bilingual term correspondences for \"without CLIR\" (i.e., from the whole comparable corpus CCe and CCj by the technique described in section 2), for the site A, would take about 6 days on a PentiumlV 1.9GHz processor.",
        "For the sites B and C, Ld = 0.4, it would take 3 ~ 6 days for the processes for \"with CLIR: full\" (i.e., when the candidates of bilingual term pairs are every pair of an English term found in RCe and a Japanese term found in RCj) to complete.",
        "Furthermore, in the case of such large scale experiments as ours (e.g., for the sites B and C), where frequency lower bounds are very low and compound terms are assumed to be up to five words long, it would take more than half a year for the processes for \"without CLIR\" to complete, unless with careful implementation.",
        "correspondence (tE,tj) g TP(tE sentence pair is quite effective in removing useless term pairs while preserving useful ones.",
        "This result clearly supports our claim on the usefulness of cross-language retrieval of relevant texts in acquisition of bilingual term correspondences.",
        "4.3.2 Rates of Containing Correct Bilingual Term Pairs Next, we evaluate the following rate of containing correct bilingual term correspondences: rate Qf ||rP(tE) |correct bilingual term where the correctness of the estimated bilingual term correspondences is judged against the existing bilingual lexicon.",
        "For the site A with the similarity lower bound Ld = 0.4, Figure 3 plots the changes in this rate against the order of TP(Xe) sorted by corr Ej(TP{tE)) (we have similar results with other similarity lower bounds L& and for other sites B and C).",
        "In the figure, \"pseudo-parallel with CLIR\" indicates the plot for estimating bilingual term correspondence based on the pseudo-parallel corpus technique described in section 3.2.1.",
        "\"Contextual similarity with CLIR\" indicates the plots for estimation based on contextual similarity described in section 3.2.2, where in \"reduced\", the candidates of bilingual term pairs are selected from a pseudo-parallel sentence pair bilingual _ term ~~ correspondences",
        "Orderof TP(t^ sorted by corrEJ(TP(tE)) as in the formula (2), while, in \"full\", the candidates are every pair of an English term found in RCe and a Japanese term found in RCj.",
        "For both \"pseudo-parallel with CLIR\" and \"contextual similarity with CLIR: reduced\", the number of bilingual term pairs found in the existing bilingual lexicon corresponds to the one in the column with \"reduced\" in Table 3 (i.e., 543), while, for \"contextual similarity with CLIR: full\", that number corresponds to the one in the column with \"full\" in Table 3 (i.e., 1467).",
        "The differences of the rates in Figure 3 correspond to the difference of these numbers (i.e., 1467 and 543).",
        "However, it is very important to note that, for both \"pseudo-parallel with CLIR\" and \"contextual similarity with CLIR: reduced\", the rate of containing correct bilingual term pairs tends to decrease as the order of TP(ie) sorted by correj{TP(tE)) becomes lower.",
        "This tendency indicates that the estimated values of bilingual term correspondences have positive correlations with the correctness of bilingual term pairs, which supports the usefulness of the estimated bilingual term correspondences.",
        "For \"contextual similarity with CLIR: full\", on the other hand, the rate of containing correct bilingual term pairs seems to be constant and thus the estimated values of bilingual term correspondences do not seem useful.",
        "This result again supports our claim on the usefulness of cross-language retrieval of relevant texts in acquisition of bilingual term correspondences.",
        "Finally, we evaluate the rank of correct bilingual term correspondences within each set TP(tg), sorted by the estimated bilingual term correspondence corrEj(tE, tj).",
        "Within a set TP(tg), estimated Japanese term translation tj are sorted by corrE,j(tE; tj), and the ranks of correct Japanese translation of £g are recorded.",
        "For the site A with the similarity lower bounds Ld = 0.3, 0.4, 0.5, Figure 4 shows this distribution for the correct bilingual term pairs, which are contained in the topmost 200 TP(tg) and are found in the existing bilingual lexicon (we have similar results for other sites B and C).",
        "Here, we compare this distribution among \"pseudo-parallel with CLIR\", \"contextual similarity with CLIR: reduced\", and \"contextual similarity with CLIR: full\".",
        "For all the similarity lower bounds Ld, \"pseudo-parallel with CLIR\" performs best, where about 85~90% of correct bilingual term pairs are included within the 5-best candidates in each TP(tE), and about 90~100% are included within the 10-best.",
        "Here, it is important to note that bilingual term correspondence estimation by \"pseudo-parallel with CLIR\" has another advantage over that by \"contextual similarity with CLIR: reduced/full\" in terms of computational complexity.",
        "Also note that the performance of \"pseudo-parallel with CLIR\" is affected little by the similarity lower bounds On the other hand, for \"contextual similarity with CLIR: reduced/full\", the performance becomes worse as the similarity lower bound Ld becomes smaller and the cross-lingually relevant English/Japanese corpus RCe and RCj becomes noisier.",
        "More specifically, for \"full\", as the similarity lower bound Ld becomes smaller, more and more correct bilingual term pairs become outside of the 100-best candidates.",
        "For \"reduced\", the rate of correct bilingual term pairs included within the 5-best candidates decreases from 70 to 40%, and that within the 10-best decreases from 73 to 45%, as the similarity lower bound Ld becomes smaller.",
        "Furthermore, \"reduced\" outperforms \"full\" and their performance gap seems to become larger as the similarity lower bound Ld becomes larger.",
        "To summarize those results, candidate reduction with the help of a pseudo-parallel sentence pair is quite effective also in the precise estimation of bilingual"
      ]
    },
    {
      "heading": "5 Related Works",
      "text": [
        "As we showed in section 4.3.1, in large scale experimental evaluation of bilingual term correspondence estimation from comparable corpora, it is difficult to estimate bilingual term correspondences against every possible pair of terms due to its computational complexity.",
        "Previous works on bilingual term correspondence estimation from comparable corpora controlled experimental evaluation in various ways in order to reduce this computational complexity.",
        "For example, Rapp (1999) filtered out bilingual term pairs with low monolingual frequencies (those below 100 times), while Fung and Yee (1998) restricted candidate bilingual term pairs to be pairs of the most frequent 118 unknown words.",
        "Tanaka (2002) restricted candidate bilingual compound term pairs by consulting a seed bilingual lexicon and requiring their constituent words to be translation of each other across languages.",
        "In this paper, on the other hand, we showed in section 4.3.1 that, due to its computational complexity, it is difficult to straightforwardly apply previously studied techniques of bilingual term correspondence estimation from comparable corpora, especially in the case of large scale evaluation such as those presented in this paper.",
        "Then, we showed that this computational difficulty can be easily avoided with the help of cross-language retrieval of relevant texts without harming the performance of precisely estimating bilingual term correspondences."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": []
    }
  ]
}
