{
  "info": {
    "authors": [
      "Gemma Boleda",
      "Laura Alonso Alemany"
    ],
    "book": "Conference of the European Association for Computational Linguistics – Student Research Workshop",
    "id": "acl-E03-3003",
    "title": "Clustering Adjectives for Class Discovery",
    "url": "https://aclweb.org/anthology/E03-3003",
    "year": 2003
  },
  "references": [
    "acl-J01-3003",
    "acl-J96-2004",
    "acl-P02-1029",
    "acl-P93-1023",
    "acl-P93-1024"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper presents an exploratory data analysis in lexical acquisition for adjective classes using clustering techniques.",
        "From a theoretical point of view, this approach provides large-scale empirical evidence for a sound classification.",
        "From a computational point of view, it helps develop a reliable automatic sub-classification method.",
        "Results show that the features used in theoretical work can be successfully modelled in terms of shallow cues.",
        "The resulting clusters parallel to a large extent with proposals in the literature, which indicates that automatic acquisition of adjective classes for large-scale lexicons is possible."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "This paper reports on experiments applying clustering techniques to explore the behaviour of Catalan adjectives in running text.",
        "The objectives of the exploratory data analysis were twofold: from a theoretical point of view, to get large-scale empirical insight in order to develop a sound classification; and from a practical perspective, to test whether the features mentioned in the literature could be successfully modelled in terms of shallow cues, which would allow an automatic classification.",
        "A sound classification of adjectives should allow one to predict morphological, syntactic and semantic properties of particular items.",
        "This predictive power can be exploited in several NLP tasks (see Section 3).",
        "Bootstrapping techniques have been recently applied to German adjective class acquisition (Bohnet et al., 2002).",
        "In contrast, we have taken an unsupervised approach in order to test the classes proposed in the literature and investigate their properties (see Section 2).",
        "Clustering is suitable for linguistic investigation in classification tasks (Pereira et al., 1993), and has been specially applied in the lexical domain, where no consensus on classification criteria has been reached yet (see Schulte im Walde and Brew (2002) and Merlo and Stevenson (2001) on verb classes and Hatzi-vassiloglou and McKeown (1993) on adjectival scales).",
        "Clustering can be used as an exploratory technique that provides insight into the organization of such domains, by finding classes of homogeneous objects and the features that crucially characterise them.",
        "The initial hypothesis was a three-way classification based on proposals in the literature (Section 2).",
        "Features discussed in theoretical work were modelled in terms of shallow cues (Section 4) and a series of clustering experiments were performed over more than 3500 lemmata from a tagged corpus (Section 5).",
        "The results obtained support the initial hypothesis, with caveats (Section 6)."
      ]
    },
    {
      "heading": "2 Catalan Adjective Classes",
      "text": [
        "After a review of the literature on adjective classification (Hamann, 1991; Bouillon and Viegas, 1999; Demonte, 1999; Picallo, 2002), a three-way classification was tested, similar to the ones established in resources such as MikroKosmos (Raskin and Nirenburg, 1995) and WordNet (Miller, 1998) for several Indoeuropean languages.",
        "These three classes can be roughly characterised as follows (terms follow Picallo (2002) and Kamp (1975) for nonpredicatives): Qualitative adjectives (drunk, serious, rich)",
        "• syntax: they occur as predicates in copu-lar sentences (my taylor is rich) and in predicative constructions (/ saw her drunk).",
        "In Catalan, they usually appear after the nominal head but can occasionally appear before.",
        "• semantics: they are gradable and comparable: richer, more serious, very drunk.",
        "Grad-ability can be observed in Catalan (in addition to adverbial modification) in regular derivational degree and diminutive suffixes, such as -issim (petit: little, petitissim: very little).",
        "• denotation: they are said to denote attributes or properties of their referents.",
        "Relational adjectives (thoracic, neurological) • morphology: they are usually morphologically complex, either denominal or deverbal: thoracic, from thorax.",
        "• syntax: they only appear as attributes of cop-ular verbs under constrained conditions: *the evolution of the patient is neurological, but the problem of the patient is neurological.",
        "In Catalan, they cannot occur before the nominal head.",
        "• semantics: they are neither gradable nor comparable.",
        "• denotation: they relate the referent of the noun to an external entity (Demonte, 1999).",
        "Nonpredicative adjectives (mere, alleged) • syntax: in Catalan, nonpredicative adjectives only appear before the nominal head and cannot occur as predicates in copular sentences.",
        "• semantics: they are nongradable and non-comparable.",
        "• denotation: they do not denote properties but properties of properties, so they are non-intersective (Hamann, 1991).",
        "In addition to the differences explained so far, there is a major syntactic argument for adopting this classification: adjectives belonging to the same class coordinate when modifying the same noun, but adjectives from different classes do not: *A serious and neurological problem vs. a serious neurological problem, *A mere and rich taylor vs. a mere rich taylor.",
        "When co-occuring, relational adjectives are always nearer to the nominal head than qualitative ones, and qualitative nearer than nonpredicative ones."
      ]
    },
    {
      "heading": "3 Adjective classification: motivation and challenges",
      "text": [
        "Identifying adjective subclasses is useful for several tasks in NLP, at different levels of linguistic description.",
        "For example, in Catalan, if an adjective is qualitative, it can bear a regular grade morpheme (issim), so this information can help broaden the morphological coverage of computational lexicons.",
        "As for syntax, coordination and adjective order can be exploited to disambiguate lexical items which are ambiguous between noun and adjective, one of the most pervasive ambiguities in POS-tagging for many Romance languages.",
        "Finally, class information could help predict and detect potential shifts in meaning.",
        "However, it is very difficult to establish a sharp line between the classes proposed.",
        "Adjective classification, being a matter involving lexical semantics, is hampered by polysemy.",
        "The main problem in this case is class-associated polysemy: many adjectives exhibit mixed behaviour between qualitative and nonpredicative, on the one hand, or relational and qualitative, on the other.",
        "As an example of the qualitative-nonpredicative polysemy, take an adjective such as English poor.",
        "It has at least two meanings associated to different classes: poor man means 'not rich' (qualitative reading) and 'pitiable' (nonpredicative reading).",
        "The difference can be observed when translated into Catalan: the usual translation of poor is pobre, but when used as qualitative it will follow the noun (home pobre) and when used as a nonpredicative it will precede it (pobre home).",
        "As for relational-qualitative polysemy, Catalan economic has two meanings which can be translated as economic (relational) and cheap (qualitative), so that economic can modify a noun like pantalons ('trousers').",
        "Both kinds of polysemy are regular (Apresjan, 1974); moreover, we believe that all relational adjectives could be potentially used as qualitative, and all qualitative adjectives could eventually develop a nonpredicative use.",
        "Why posit different classes, then?",
        "There are at least two answers to that question.",
        "One the one hand, not all adjectives actually have readings corresponding to both classes.",
        "For instance, it is difficult to find an appropriate context where thoracic can be used as qualitative.",
        "On the other hand, as discussed in Section 2, each class presents a different set of linguistic properties.",
        "Therefore, even those adjectives which are ambiguous exhibit the properties of one single class in each particular context.",
        "For instance, as nonpredicatives cannot be used in copular sentences, poor is unambiguously qualitative in such contexts: the man is poor is not synonymous with the man is pitiable.",
        "Conversely, economic is gradable when used as qualitative: pantalons molt economics ('very cheap trousers').",
        "It is therefore useful to draw a distinction between the three classes, even if a particular adjective does not necessarily belong to one single class."
      ]
    },
    {
      "heading": "4 Modelling the Data 4.1 Corpus and tools",
      "text": [
        "The corpus used was a fragment of CTILC (Corpus Textual Informatitzat de la Llengua Cata-lana), collected by the Institute for Catalan Studies (IEC).",
        "The fragment contains 8.5 million words of Catalan written texts from 1970 onwards, belonging to a formal register.",
        "The corpus had previously been automatically tagged and hand-corrected, with information on lemma, part-of-speech and other morphological information (following the EAGLES standard).",
        "It was additionally parsed with CATCG, a shallow parser for Catalan developed at GLICOM (Alsina et al., 2002).",
        "This shallow parser provides each word with a tag indicating its syntactic funcion (main verb, subject, etc.).",
        "In order to minimise problems due to data sparseness, only adjectives occuring more than 10 times in the corpus were taken into account, totalling 3522 adjective lemmata.",
        "The features used to model the adjectives were features detectable in the annotated text itself with no external knowledge sources, because we wanted to model the linguistic behaviour of adjectives using no previous lexical knowledge.",
        "Therefore, information on derivational morphology was not used at this stage (but it was for analysis; see Section 5.3).",
        "The values for each feature were set as true percentages, that is, the number of times a feature is detected for a given adjective, divided by the number of occurrences of that adjective in the corpus.",
        "The lemmata were modelled using features of two kinds.",
        "On the one hand, shallow textual correlates were defined for some of the parameters discussed in Section 2.",
        "Table 1 lists these theoretically motivated features, together with their mean and standard deviation values, as well as the shallow cues that were defined as textual correlates of the features.",
        "On the other hand, and in order to test the strengths and weaknesses of the starting hypothesis, a relatively unbiased description of adjetives was also provided: each lemma was described by distributional features, the POS of a five-word window (two at each side), as seen in Table 2.",
        "It can be argued that some theoretically motivated features, like comparability or gradability, should not be modelled with percentages, because they do not convey relative properties, but rather absolute ones.",
        "However, by assigning these features percentages we hope to distinguish adjectives belonging to more than one class from unambiguous ones.",
        "It is reasonable to hypothesise that ambiguous adjectives will have different values in these features than unambiguous ones, which might yield differences in clustering results."
      ]
    },
    {
      "heading": "5 Experiments",
      "text": [
        "A number of clustering experiments were carried out using CLUTO (Karypis, 2002).",
        "CLUTO is a standalone clustering tool that provides information for analysing the characteristics of the obtained clusters, by means of a list of descriptive and discriminating features of each cluster.",
        "The clustering parameters of CLUTO were held constant throughout the whole set of experiments, so as to focus on the effects of variations in the features used, that is, in the description of the objects.",
        "The clustering parameters used were:",
        "• clustering algorithm: partitioning, based on the clustering criterion H2, a combination of cluster-internal similarity and inter-cluster dissimilarity (Zhao and Karypis, 2002) • distance measure: cosine of the vectors • number of clusters: 2 to 7 for each dataset, to find the most informative granularity level",
        "The 3522 adjectives were clustered with three different subsets of the features described in Section 4.2: distributional features, textual correlates of theoretically motivated features, and both distributional and theoretically motivated.",
        "After a series of experiments, the following distributional attributes were found to perturb classification and were left out of adjective description:",
        "• word 2 is determiner and word 1 is noun present a very high correlation coefficient (0.8), which strengthens their discriminating power.",
        "Since they characterise the default adjectival context in Catalan, solutions using these features group more than half of the adjectives in one cluster.",
        "If not used, less discriminating features yield finer distinctions.",
        "• followed by preposition and word +2 is determiner are very discriminating features, but they distinguish adjectives by their subcate-gorisation behaviour, which is not related to the targeted classification.",
        "• followed by punctuation is also very discriminating, but the classes characterised by this feature are meaningless.",
        "Of the six clustering solutions obtained for the three approaches, ranging from 2 to 7 clusters, 5-cluster solutions were studied in detail, because they presented the best joint values for cluster quality (see Figure 1).",
        "Due to the high number of objects that were clustered, the qualitative analysis of the obtained solutions was problematic.",
        "Since a comprehensive handmade judgement of the solutions was almost impossible, two alternative strategies were adopted: a comparison of the distribution of adjective classes in clusters with a classification built by human judges and with a morphology-based classification; and a cluster-internal analysis via examination of their characterising features and the objects that prototypically represent them.",
        "Fi gure 1: Quality of 2 to 7-cluster solutions with theoretically motivated features, measured by average cluster internal similarity, cluster tightness (internal similarity divided by standard deviation) and distinguishibility (internal similarity divided by external similarity).",
        "In order to analyse the distribution of adjective classes in clusters, two a-priori classifications were built.",
        "First, 4 human judges classified a subset of 102 adjectives.",
        "100 adjectives were randomly chosen, and two nonpredicatives (mer 'mere' andpresumpte 'alleged'), were included so that this class, not found by random selection, was also represented.",
        "Judges assigned each of the adjectives to one of the hypothesised classes (Section 2): nonpredicative, qualitative or relational, or to two additional classes in order to account for polysemy: ambiguous between nonpredicative and qualitative or ambiguous between qualitative and relational.",
        "The kappa measure for agreement between judges ranged from 0.52 to 0.64, with a confidence interval at 95% of +/-0.14.",
        "According to Landis and Koch, (1977) these figures indicate moderate (< 0.61) to substantial (> 0.61) agreement, but Carletta (1996) considers that values below 0.67 are too low to be significant for linguistic tasks.",
        "The agreement among judges is thus relatively poor, which is a clear indicator of the difficulty of the task.",
        "In spite of that, a consensus classification of the subset was established as a comparison ground for clustering solutions.",
        "However, this evaluation only considered 2% of the objects in the dataset.",
        "To avoid low represen-tativity, a large-scale classification was performed using derivational morphology.",
        "Some derivational suffixes yield either qualitative or relational adjectives: for instance, the denominal suffix 6s, roughly denoting 'bearing N' and thus a kind of property, forms qualitative adjectives such as ver-gonyos ('shy', from vergonya, 'shyness').",
        "Adjectives formed by derivational processes were classified according to the suffix they bear, using a list of 54 adjective forming suffixes detected by pattern matching.",
        "Morphologically simple adjectives and very ambiguous suffixes, as far as adjective classes are concerned, were not classified.",
        "No information could be gathered for nonpredicative adjectives, because there are no nonpredicative-forming suffixes.",
        "With this procedure, 2132 adjectives (59% of the whole set) were classified.",
        "In spite of the fact that pattern matching is very error prone, and that morphological processes are not fully regular, this classification shows general tendencies for the distribution of relational and qualitative adjectives across clusters, as shown by the kappa coefficient with the manually annotated set (0.45, close to the lowest agreement between human judges, 0.52).",
        "Figure 2 shows the distribution of adjectives across clusters in the approaches with distributional and with theoretically motivated attributes.",
        "As a second analysis strategy, the characteristics of the clusters as such were explored, based on the list of features that CLUTO provides as most descriptive for the resulting clusters (see Section 5.1).",
        "Moreover, cluster centroids were also examined in order to obtain an example-based, human-friendly idea of the content of the clusters.",
        "An adjective was considered a centroid for a cluster when its values for descriptive features were very close to the mean value of that feature within the cluster.",
        "A summary is presented in Table 3."
      ]
    },
    {
      "heading": "6 Results and discussion",
      "text": [
        "As can be seen in Figure 2, results in both approaches coincide to a large extent, with a kappa coefficient of 0.45.",
        "Kappa agreement was calculated between equivalent clusters for every pair of solutions, considering that cluster equivalence corresponded to sharing a majority of objects.",
        "High statistical correlation coefficients were found between some theoretically motivated features and some distributional ones, as can be seen in Table 4.",
        "This correlation is motivated by the fact that the theoretically motivated features are represented in terms of distributional properties.",
        "Remarkably, though, from the 31 distributional features used, distributionally unmarked in Catalan (recall that the attributes representing the default context were not used; see Section 5.2).",
        "In the solution using theoretically motivated features, cluster first adj.",
        "is characterised by occurring in the first position when combined with other adjectives.",
        "As suggested by the discussion in Section 2, relational occur closer to the noun than qualitatives, so this result is consistent with the initial hypothesis.",
        "Surprisingly, though, cluster last adj.",
        "also contains mainly relational adjectives, even though it has as main characteristic the fact that the adjectives occur in the last position when combined with other adjectives.",
        "This cluster contains many nationality-denoting adjectives, which have been classified as relational or ambiguous between relational and qualitative in the manually annotated corpus.",
        "When co-occurring with other relational adjectives, they appear further from the nominal head: English empiricist philosopher.",
        "This solution, thus, indicates that a finer-grained classification might be needed for relational adjectives.",
        "Since theoretically motivated and distributional features provide comparable solutions, the combination of the two should strengthen the tendencies already noted when used separately.",
        "Indeed, when adjectives are described by the union of these two sets of features, clusters are more neatly defined, as can be seen in Figure 3.",
        "The distribution of clusters is totally comparable to the one sketched above.",
        "As for the features describing the clusters, theoretically motivated features combine with the corresponding distributional ones as expected from the discussion so far (see Table 3)."
      ]
    },
    {
      "heading": "7 Conclusions and Further Work",
      "text": [
        "Clustering has proven to be a successful method for linguistic investigation in a relatively unexplored area such as adjectival classification.",
        "Results show that the features used in theoretical work can be successfully modelled in terms of shallow cues, so that automatic acquisition of adjective classes is possible for large-scale lexicons.",
        "size most characterising features |cluster centroids |cluster label theoretically motivated",
        "non-intersective, first adjective inestimable, feixuc inestimable, heavy non-intersective",
        "gradable, comparable agradable, recent pleasant, recent gradable",
        "first adjective, attributive cultural, decoratiu cultural, decorative first adj.",
        "last adjective, attributive residual, rus residual, Russian last adj.",
        "distributional",
        "word 1 det, word +1 verb ancia, misterios ancient, mysterious non-intersective",
        "word 2 adj.",
        "artistic, emotiu artistic, emotive - theoretically motivated and distributional",
        "word +1 noun, 1 det., non-intersective misterios, alt mysterious, tall non-intersective",
        "word 1 adverb, comparable, gradable doloros, assenyat painful, sensible gradable",
        "word 1 verb, attributive igual, increible equal, incredible attributive",
        "word 2 verb legal, europeu legal, European first, adj",
        "word 2 adj.",
        "corporal, religiös corporal, religious - i F n – r n P B Results using distributional features parallel to a large extent with results using theoretically motivated features, which provides empirical evidence that the properties mentioned in Section 2 are relevant for adjective classification.",
        "Moreover, clustering results largely support the initial hypothesis, as qualitative adjectives are distinguished from relational ones and nonpredicative adjectives are grouped together.",
        "Nevertheless, this approach is not useful for detecting and acquiring data on class-associated polysemy, probably due to heterogeneity in the behaviour of polysemous adjectives.",
        "Several alternatives will be explored in the near future: soft clustering can be used to test whether polysemous adjectives fall into several clusters; also, a bootstrapping approach has been envisaged that exploits information on coordination and adjective order."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": []
    }
  ]
}
