{
  "info": {
    "authors": [
      "Sabine Ploux",
      "Hyungsuk Ji"
    ],
    "book": "Computational Linguistics",
    "id": "acl-J03-2001",
    "title": "A Model for Matching Semantic Maps Between Languages (French/English, English/French)",
    "url": "https://aclweb.org/anthology/J03-2001",
    "year": 2003
  },
  "references": [
    "acl-J02-2001",
    "acl-J98-1001",
    "acl-J98-1004"
  ],
  "sections": [
    {
      "text": [
        "This article describes a spatial modelfor matching semantic values between two languages, French and English.",
        "Based on semantic similarity links, the model constructs a map that represents a word in the source language.",
        "Then the algorithm projects the map values onto a space in the target language.",
        "The new space abides by the semantic similarity links specific to the second language.",
        "Then the two maps are projected onto the same plane in order to detect overlapping values.",
        "For instructional purposes, the different steps are presented here using a few examples.",
        "The entire set of results is available at the following address: http://dico.isc.cnrs.fr."
      ]
    },
    {
      "heading": "1. Goals",
      "text": [
        "This article presents a spatial model that projects the semantic space of a source language word onto a semantic space in the chosen target language.",
        "Although the study presented in this article can be described from various angles, we place it within the framework of artifactual simulations of the translation process, and more specifically, access to the target language’s lexicon.",
        "The model is described as a construction process designed to reproduce cognitive functions and their extensions.",
        "Future research will include the study of the psycholinguistic validity of such a spatial representation.",
        "Now let us briefly describe the scientific basis of the study.",
        "• Three major areas are generally distinguished in the study of the translation process (see Vinay and Darbelnet [1996]), the lexicon (or the study of notions), sentence generation (putting words together), and the message (which brings communicative factors into play).",
        "The first area involves choosing the right word, which is usually left up to the intuition and expertise of the translator.",
        "Our model deals with accessing the lexicon of the target language starting from a notion in the source language.",
        "The utility of this research lies in the fact that different languages break down reality in different ways.",
        "• Although the translation process has been mastered by a number of experts, it is usually still dependent upon the utilization of tools like dictionaries.",
        "The model proposed here relies on semantic maps and offers an alternative method based on the concepts of lexical access and lexical neighborhood.",
        "• The work by Anderson (1983) and Collins and Loftus (1975) on the organization of the lexicon is based on priming and the automatic",
        "spreading of activation to the prime’s neighboring concepts.",
        "As an alternative to these local semantic networks, Masson (1995) proposed a connectionist model that takes into account the subjects’ reaction time during priming experiments (the correspondence is based on the assumption that semantic or phonologic proximity and ease of access are correlated).",
        "Rouibah, Ploux, and Ji (2001) showed that experimental data on interactions between phonology and semantics could be simulated by distances on lexical maps.",
        "One advantage of this proposal is that experimental and artifactual findings converge; another is its ability to describe a real lexicon.",
        "Although the relevance of our model to the representation of the mental lexicon will not be discussed in this article (attempts to gain insight into this correlation are currently underway in other studies), this point is not unrelated to the suitability of our approach to modeling translation as a cognitive function."
      ]
    },
    {
      "heading": "2. Description of the Model",
      "text": [
        "No two lexicons are related by a one-to-one correspondence (Abplanalp 1998).",
        "In other words, the way words are used to refer to extralinguistic reality varies across languages.",
        "Some examples of this are cross-language differences in color naming and, borrowing Chuquet and Paillard’s (1989) English-French examples, differences like:",
        "• room: pi`ece, chambre, bureau (or in an abstract domain) • esprit: mind, spirit, wit",
        "Certain authors (Abplanalp 1998) insist how impossible it is to translate at the word level and propose recourse to the conceptual level as a theoretical alternative.",
        "Concepts are thought to depend on human cognitive abilities that are general and shared by all.",
        "Although the correspondence between words and concepts remains a controversial topic of study (Reboul 2000), the concept/word opposition is nevertheless relevant to any model of translation, even an artifactual one like ours.",
        "As we shall see, even when heeding the specific organization and breakdown of each individual language, the matching operation does not take place at the word level but at the substrate level (defined below), where the set of meanings of each word “cuts out” a form.",
        "First, we will present the model we devised to describe the organization of languages.",
        "Then we will explain the source-to-target spreading method used."
      ]
    },
    {
      "heading": "2.1 A Model Based on Semantic Similarity",
      "text": [
        "The model was initially developed on the basis of a semantic similarity: synonymy.",
        "Note, however, that the data and the model are independent, so this same framework can be used to organize other types of similarity (contextual, phonological [Rouibah, Ploux, and Ji 2001], etc.).",
        "Other authors also organize the lexicon or other kinds of knowledge on the basis of similarity.",
        "For example, in Edelman’s (1998) spatial model of internal representations of the world’s objects, spatial proximity reflects object similarity.",
        "WordNet (Fellbaum 1998) and EuroWordNet (Vossen 1998) organize the lexicon conceptually as a network of terms, each of which is associated with a partition into",
        "Synsets (a Synset being a small group of synonyms that label a concept).",
        "Our model differs from Edelman’s in that it deals with lexical semantics, not perceived objects.",
        "It also differs from Miller’s (1990) approach, in three respects:",
        "• the grain of the semantic units • the lexical structure generation mode • the resulting geometry and organization",
        "Most models1 use separate units to represent words or concepts (symbols, points in a space, nodes on a graph, etc.).",
        "Relationships between units are expressed as proximity links (in spatial models) or as arcs between nodes (in networks).",
        "Our model is spatial, but it differs from local models in that each term is represented by a region in the space, part of which it shares with other terms.",
        "This region is constructed automatically according to lexical similarity links (such as those given by a synonym dictionary).",
        "It is not the result of supervised learning, nor is it a manual, ontological description of how the lexicon is organized.",
        "The next section will break the semantic-space construction process into steps in presenting the initial data, the granular approach, and the resulting organization."
      ]
    },
    {
      "heading": "2.2 Method",
      "text": [
        "2.2.1 Initial Data.",
        "Three databases were used: two synonym databases (one containing French terms and one containing English terms) and a translation database (French-English, English-French) that maps each term to similar words in the other language.",
        "The links between an entry and the terms that follow it were not chosen “by hand.” The data were taken mainly from published dictionaries and thesauruses.2 It is updated and supplemented regularly by the addition of new links between words (synonymy or translation links).",
        "The method used to generate the French synonym database (described in detail in Ploux (1997) was applied again to generate the English and translation databases.",
        "The first step required creating an intermediate database containing the set of all links attested in available work in lexicography.",
        "In this preliminary database, a term was deemed similar to another term if at least one lexicographer had established the link.",
        "The final database was obtained through symmetrization of the links produced in the first step.",
        "While maintaining the shifts in meaning that occur when there is nontransitivity and that, as we shall see, are essential for developing the model, we created new links to symmetrize any initially one-directional ones.3 Table 1 gives a typical example of the structure of the initial data.",
        "Table 2 gives a global evaluation of the number of entries and links in the lexical databases.",
        "Note that we are not attempting here to define the term synonymy.",
        "We rely on lexicographic publications, which as Edmonds and Hirst (2002) remarked, “have always treated synonymy"
      ]
    },
    {
      "heading": "Number of entries and links in the lexical databases.",
      "text": [
        "Number of entries Mean number of Mean number of terms synonyms per entry proposed by the translation database French 54,690 7.5 2.3 English 148,247 6.8 1.9 as near-synonymy.”4 However, having more flexible semantic links does not detract from the accuracy of the model.",
        "No other operations are carried out on the data sets before application of the model.",
        "ciated with a spatial form (or space) (Ploux 1997; Ploux amd Victorri 1998).",
        "The points in the space are finer units of meaning than the word itself.",
        "In our computational simulation, the points are represented by cliques.",
        "A clique is a set of terms related to each other by synonymy.",
        "The conjunction of all terms in the same clique crystallizes and constrains the meaning given to the word.",
        "These cliques thus constitute good candidates for generating the substrate upon which the form will take shape.",
        "The presentation of the results and the features of the model will be illustrated using examples from the headword good for English and from the headword insensible for French.",
        "The Appendix provides the full results, as well as the definition of the word insensible taken from a French dictionary.",
        "These examples are illustrative of the main characteristics of the entire data set.",
        "4 Moreover, for the two languages under study here, there are notable differences in how lexicographers understand and use the concept of synonymy.",
        "Synonymy relations in French dictionaries, for example, are not always symmetrical and are rarely transitive.",
        "What is more, the links have a broader scope.",
        "For instance, the words abri (shelter) and even masure (shed) are given as synonyms of maison (house).",
        "To make the databases homogeneous during the matching operation, a new version of the English database was supplemented with certain hypernym links often given as synonyms in French dictionaries.",
        "The software offers the user the opportunity to see the output obtained using the two versions of the English database, displayed under the headings standard search and enriched search.",
        "Ploux and Ji A Model for Matching Semantic Maps The synonym list contains a heterogeneous set of scrambled terms:",
        "• For the French headword insensible, some of the terms represent a moral value (dur, sans-coeur, ... ), others a physical value (inerte, engourdi, ... ), and still others a perceptual value (imperceptible, inapparent ... ).",
        "• The headword good includes many similar terms.",
        "As a first",
        "approximation, only the most representative are given here.",
        "Some of the terms represent a generic value (right, sound, ... ), others refer to a capability (able, ... ) or have an affect-related value (benevolent, ... ), while still others represent a quality of taste (tasty, ... ).",
        "The clique list contains the cliques generated from this set of terms.",
        "Cliques represent rather precise units of meaning.6",
        "• Here are some examples of cliques representing the moral value of the French headword insensible: 20: cruel, dur, impitoyable, implacable, inexorable, inflexible, inhumain, insensible 21: cruel, dur, impitoyable, implacable, inexorable, inflexible, insensible, s´ev`ere 22: cruel, dur, implacable, inflexible, inhumain, insensible, rigide 23: cruel, dur, implacable, inflexible, insensible, rigide, s´ev`ere Some examples of cliques representing the physical value: 2: anesth´esi´e, insensible 50: endormi, engourdi, inerte, insensible 51: engourdi, froid, inerte, insensible 52: engourdi, immobile, inerte, insensible, paralys´e And some examples of cliques representing the perceptual value: 69: imperceptible, inapparent, insensible, invisible 70: imperceptible, indiscernable, insaisissable, insensible, invisible 71: imperceptible, indiscernable, insensible, l´eger • Here are some examples of cliques representing the more prominent senses of the English headword good:",
        "84: dependable, good, reliable, safe, secure 87: dependable, good, reliable, solid, sound 102: fair, good, honest, honourable, just, right, upright Some examples of cliques representing a more specific meaning of aptitude or ability:",
        "6: able, adequate, capable, competent, effective, good 7: able, adroit, clever, dexterous, expert, good, skilful 8: able, capable, clever, expert, good, skilful",
        " And some examples of cliques with affect-related values:",
        "111: friendly, gentle, good, kind, kindly, nice, sweet 112: friendly, good, gracious, kind, kindly, nice, sweet 113: friendly, good, helpful, kind Note that a given term may belong to several cliques (this characteristic is due to the nontransitivity of the relation).",
        "It appears in each clique with a precise meaning that is constrained by the presence of its neighbors.",
        "• For example, the following cliques have terms in common; the first has a stronger moral value than the second: 15: calme, flegmatique, froid, impassible, imperturbable, insensible 18: calme, immobile, inanim´e, insensible • In the same manner, there are shared terms in the next two cliques of good, the first related to taste, the second to personal qualities:",
        "80: delectable, delicious, good, lovely, savoury, scrumptious, tasty 82: delicious, good, lovely, nice, pleasant This last point brings us to the study of semantic variations.",
        "The following clique path, in which each clique shares at least one term with the next, moves in a relatively continuous way from one value to another.",
        "• Transition from a moral value to a physical value: 21: cruel, dur, impitoyable, implacable, inexorable, inflexible, insensible, s´ev`ere 34: dur, froid, impitoyable, implacable, insensible, s´ev`ere 35: dur, froid, inaccessible, indiff´erent, insensible 39: dur, impassible, indiff´erent, insensible, sto¨ıque 15: calme, flegmatique, froid, impassible, imperturbable, insensible 16: calme, froid, inanim´e, insensible 63: froid, inanim´e, inerte, insensible",
        "83: inanim´e, inerte, insensible, mort The continuity between the moral and physical values has its counterpart in their usage.",
        "For example, one can use the term engourdi in French to qualify the disposition of a person who exhibits little moral reactivity, as in: Il allait comme dans un songe, l’esprit engourdi, paralys´e, sans chagrin vibrant, saisi par une sorte d’engourdissement moral qui l’empˆechait de souffrir, ´eprouvant mˆeme un all´egement qu’augmentaient les exhalaisons ti`edes ´epandues dans la nuit.7 (Maupassant 1881, page 350) Moreover, as we shall see later, this type of continuous link between two values, which acts as a metaphor here, is expressed more explicitly in the English example below.",
        "• Transition from a taste-related value to an affective value:",
        "80: delectable, delicious, good, lovely, savoury, scrumptious, tasty 78: delectable, delicious, excellent, exquisite, good, lovely, scrumptious 77: delectable, delicious, enjoyable, good, pleasant 79: delectable, delicious, good, lovely, pleasant 82: delicious, good, lovely, nice, pleasant 114: friendly, good, kind, kindly, nice, pleasant, sweet 111: friendly, gentle, good, kind, kindly, nice, sweet By contrast, for the French headword insensible, there is greater discontinuity between the perceptual value and the others.",
        "At the present stage of our project, clique lists are in alphabetical order, and the underlying semantic topology has not yet been built.",
        "The geometric model we are now going to present achieves this step.",
        "Table 3 contains an evaluation of the granularity generated by the cliques.",
        "ventional correspondence factorial analysis8 (Benz´ecri 1992) was conducted between the cliques and the synonyms.",
        "For each entry, the initial matrix Mij contains nc rows (where nc stands for the number of cliques) and ns columns (where ns stands for the number of terms).",
        "It is defined by the formula Mij = 1 if clique i contains term j, and 0 if not.",
        "The results showed that the χ2 distances9 calculated using this method furnish a coherent representation of semantic variations.",
        "Table 4 presents the configurations 8 Correspondence analysis is a factor analysis method that uses categorical variables (that is, noncontinuous or discretized ones).",
        "where ci and ck are two cliques, n is the number of synonymous terms, xi.",
        "the number of terms in ci (respectively ck), x.j the frequency of term tj and x the sum of the frequencies of all terms (or the total number of terms in all cliques).",
        "Two-cluster semantic space for the French headword insensible.",
        "on the principal plane for the Euclidean distance and the χ2 distance, reduced to the same proportion.",
        "The headword fast has many cliques, including",
        "• c12: express, fast, quick, rapid, swift • c17: fast, fastened, fixed, secure • c23: fast, firm, lasting, stable, tight",
        "The values obtained using the χ2 distance are more suited to semantic categorization than those obtained using Euclidean distance; cliques representing the same class are closer together (even if they do not share a larger number of terms) than ones representing different meanings.",
        "The dimension of the geometric space is equal to the smaller of the two numbers, ns or nc.",
        "To show the results visually, the projections onto the principal axes are presented in Figures 1 and 2.",
        "(The horizontal axis in the figures is the best representative of the form delineated by the cluster of points such that the distances between the points are maintained to the optimal degree; the vertical axis, perpendicular to the first, is the second best representative, and so on.)",
        "Cliques are represented by points, and each",
        "Three-cluster semantic space for the English headword good.",
        "term by the region in the space delineated by the set of cliques that contains it.10 Using the examples again, let us review the main characteristics of the resulting organization.",
        "The same type of organization is found in all cases.",
        "2.2.4 Distinguishing Semantic Values.",
        "The model plots the different values on the map.",
        "Distinct notions are clearly separate, and gradual variations are maintained.",
        "• In the insensible example (Figure 1), we can see two clusters as a first approximation, one smaller cluster labeled by the terms imperceptible, inapparent, indiscernable, n´egligeable, etc., and representing the perceptual value of the word, and one larger cluster containing the moral and physical values.",
        "In the center of the second cluster, we find the terms dur, inhumain, sans-coeur, cruel, etc., which are prototypes of the word’s moral value.",
        "Two branches come out of this center, one that qualifies a more specific value (r´efractaire, rebelle, imp´en´etrable, etc.",
        "), and one that leads to the physical value.11 • In the good example (Figure 2), the cliques and terms are plotted on the map in accordance with the proximities of the values and their links.",
        "On the principal plane, the cluster of points extends in two directions: the first axis represents the capability value, and the second the affective value.",
        "The affective value gradually turns into a taste-related value (tasty, ... ).",
        "These two main directions are interconnected by the generic value (right, true, ... ) located near the origin."
      ]
    },
    {
      "heading": "Some examples of spatial interconnections between semantic values.",
      "text": [
        "Entry Value at the origin (labeled by Examples of off-centered values a prototype) (labeled by prototypes) d´efendre prot´eger 1. excuser 2. interdire, .. .",
        "maison domicile 1. commerce 2. lign´ee, .. .",
        "insensible sans-coeur 1. imperceptible, 2. engourdi, .. .",
        "home abode 1. family, 2. interior, ... good right 1. able, 2. delicious, .. .",
        "organization.",
        "The middle column contains the generic values (when they exist) that interconnect the different meanings of the word.",
        "Highly specific values are far from the origin.",
        "This organization follows directly from the calculation of the profile matrix, which assigns more weight to infrequent terms and to cliques containing few elements."
      ]
    },
    {
      "heading": "2.3 Matching",
      "text": [
        "As stated above, the breakdown and overlapping of the lexicon varies from one language to the next.",
        "However, several studies (Illes and Francis 1999; Ikeda 1998) have found evidence that the two languages of a bilingual person access a common semantic system.",
        "To handle the problem of lexical differences in our translation model, connections link semantic units rather than words.",
        "Because they are finer-grained than words, semantic units are assumed to be less sensitive to the way a given language “cuts up” the world, and as such, they are better candidates for achieving a closer fit between the two languages.",
        "For a given set of cliques in the source language, the model constructs the set of cliques to be used for the translation.",
        "The two spaces (one associated with each set of cliques) are then projected onto a map that maintains the matches.",
        "The example of insensible is a good representative of the various patterns that can appear.",
        "It has two very different, nearly homonymic semantic values, as well as some other values whose meanings overlap considerably.",
        "For this reason, we present the results for the matching operation using this example.",
        "The four steps in this construction process are described below.",
        "Step 1.",
        "Constructing the source semantic space.",
        "In order to build a semantic space in the target language associated with a term in the source language, the system starts by generating the set of all cliques containing the requested word.",
        "This step is identical to the one described in Section 2.2.2.",
        "initial terms similar to the input word, the translation database furnishes the corresponding terms in the target language.",
        "Some of these terms are relevant to the initial generic meaning; others are clearly far removed from that meaning.",
        "For example, the synonyms timide and l´eger of the term insensible can be translated respectively as (... , shy, ... ) for timide and (... , airy, ... ) for l´eger, neither of which is useful in generating this headword’s target semantic space.",
        "To find the relevant senses, the model compares the source language cliques to the cliques generated from the set of terms proposed by the translation database.",
        "Target clique relevance",
        "Ploux and Ji A Model for Matching Semantic Maps is calculated as follows: Let S be a clique in the source language composed of the terms (tsi)i=1···nS, and let C be clique (tjc )i=j···nC in the target language.",
        "The model evaluates the relevance of the translation based on the rank of matrix MSC, composed of zeroes and ones, calculated using the formula MSC [i] [j] = 1, if tjc translates tsi, and MSC [i] [j] = 0, otherwise.",
        "The rank defines a spreading parameter (in the model, a rank of zero means that the two cliques are unrelated and the target clique represents an out-of-range meaning in the translation operation; a rank of three or more represents a highly cohesive semantic link).",
        "If this last constraint is imposed on all cliques, the model will output a relatively small number of terms belonging to the target’s semantic field.12 Step 3.",
        "Constructing the source-point/target-point geometry.",
        "The factorial analysis algorithm (presented in Section 2.2.3) is followed to determine the correspondences between the source cliques and the target cliques that were retained in step 2, because they are relevant to at least one clique in the source language.",
        "The correspondences are determined by taking the product of the following matrices: Mtr=MScs∗Tsc∗Ma where MScs is the source-clique/source-term matrix defined as in monolingual processing (see Section 2), Tsc is the matrix that defines the translation between the source terms and the target terms (Tsc [i] [j] = 1 if and only if term j translates term i in the initial database), and M�Ccs is the transposed target-clique/target-term matrix.",
        "For a subset of the French cliques of insensible, the closest three English cliques are given below for each French clique, along with a table of the corresponding distances calculated on the principal plane (Table 6).",
        "The maps reproduced in Figures 3–5 summarize the resulting distances for the headword insensible.",
        "• cf28: cruel, dur, f´eroce, impitoyable, implacable, inexorable, inhumain, insensible ce67: cruel, ferocious, fierce, ruthless, savage ce84: cruel, inhuman, merciless, pitiless, ruthless, savage ce28: bitter, cruel, fierce, ruthless, savage • cf40: dur, indiff´erent, inhumain, insensible, sans-coeur ce36: callous, hard, hardened ce33: callous, cruel, hard, hard-hearted, heartless ce92: difficult, hard, tough • cf78: imperm´eable, insensible, rebelle, r´efractaire, sourd ce148: insensitive, unmoved",
        "• cf50: engourdi, froid, inerte, insensible ce100: dull, inanimate, inert, lifeless ce98: dull, expressionless ce87: dead, inanimate, inert, lifeless • cf51: engourdi, immobile, inerte, insensible, paralys´e ce89: dead, numb, paralytic ce17: asleep, numb ce97: dull, dulled • cf68: imperceptible, insensible, invisible ce137: imperceptible, indiscernible, invisible ce112: frivolous, indifferent, insignificant, trifling, unimportant ce129: impalpable, imperceptible, intangible, invisible • cf71: imperceptible, insensible, insignifiant, l´eger ce152: light, slight, trifling, trivial ce114: frivolous, light, trifling, trivial ce149: insignificant, slight, trifling, trivial, unimportant",
        "Step 4.",
        "Defining the lexical regions.",
        "As above, for each language, a term is represented by the clique region that contains it.",
        "The next section will use examples to illustrate the results obtained.",
        "The entire set of results is available at http://dico.isc.cnrs.fr.",
        "English-French space matching for the English headword insensible."
      ]
    },
    {
      "heading": "3. Results",
      "text": [
        "The advantages of the model presented are (1) access to an extended lexicon and a broad semantic field and (2) coherence of the matching between the semantic values in each language.",
        "The results for insensible will be used again in this section to illustrate the second advantage."
      ]
    },
    {
      "heading": "3.1 Access to an Extended Semantic Field and Lexicon",
      "text": [
        "The model fulfills two functions: It searches for a suitable lexicon and organizes the terms found.",
        "For each entry, the initial data provides a short list of terms representing certain prototypes of the word’s translation.",
        "Table 1 lists the four English terms proposed as translations for the French word insensible.",
        "It can happen that certain semantic values in the source language are not represented in the translation database.",
        "For example, insensible has no corresponding French word in our database of English word translations.",
        "However, the model builds the appropriate values in French (Figure 3).",
        "The model builds a much larger vocabulary that includes the initial terms from the translation database and some semantic neighbors.",
        "Table 7 presents an overall evaluation of the results.",
        "Assessment of lexical access spreading to the target language.",
        "Mean number of terms supplied by the Mean number of terms supplied by the translation database from a sample of 60 semantic maps of the same sample terms",
        "Two-cluster separation of the French and English spaces for the French headword insensible."
      ]
    },
    {
      "heading": "3.2 Coherence of the Semantic Matching",
      "text": [
        "The final step in the model consists of establishing a correspondence between the semantic values of the cliques and the terms in the two languages.",
        "By application of the above algorithm, the cliques and terms of the two languages are plotted on the same map.",
        "This map thus provides a summary of the semantic proximities in each language.",
        "In order to demonstrate the coherence of the semantic-value matching after projection onto the target language, the clusters obtained from the French and English cliques for the term insensible are superimposed on one another.",
        "Figures 4 and 5 present the division of the output into two and four clusters.",
        "(The French clusters in these figures are marked by a darker line and set in a darker typeface than the English ones.)",
        "As in the two-cluster semantic space for the French word insensible, Figure 4 separates the perceptual value from the other values.",
        "The three-cluster separation then differentiates the physical-moral value from the moral value.",
        "Figure 5 shows the division within the physical-moral value between what is more specifically physical and what pertains to emotional insensitivity (emotionless, r´efractaire, etc.)",
        "or to the inability to discern that sensitivity (imp´en´etrable, etc.).",
        "Note that although all values initially present in the monolingual space are represented, a reorganization process still takes place during pairing with the target language.",
        "In French, the terms (r´efractaire, inacessible, ... ) were separated from the terms (inerte, engourdi, ... ) by the group made up of the terms (dur, sans-coeur, ... ), but now they are located close to the center.",
        "This layout probably results from (1) the effect of the greater number of terms like (inert, numb, sluggish, chilly, ... ), which, in English, unlike in French, encompass emotional and physical insensitivity and therefore bring these two values closer together on the map, and (2) the prototypical, central nature of this value in English, as expressed by the terms (impassive, insensible, insensitive, ... ).",
        "Four-cluster separation of the French and English spaces for the French headword insensible."
      ]
    },
    {
      "heading": "4. Discussion",
      "text": [
        "We have presented a model for matching a semantic space in a source language and a semantic space in a target language.",
        "This model, currently built from lexical similarity relations (synonymy or near-synonymy and translations), uses several representation levels: cliques, which represent very precise units of meaning; terms, which are represented geometrically by a region in the space containing a set of cliques; and clusters, which are generated from the results of a spatialization process that singles out a term’s main semantic values.",
        "(Again, this last representation level is merely mentioned in the present article; the method used to generate it and the rationale for its use in semantic classification will be described in detail in a forthcoming publication.)",
        "The matching between the French and English spaces is achieved by mapping the cliques of the two languages to each other.",
        "The model software allows a user to choose a candidate word in the target language according to its synonym neighborhood.",
        "A map showing each language’s neighborhoods and separate clusters for each semantic value helps the user make the choice.",
        "This system and its interactive interface is a useful tool appreciated by researchers, translators, writers, and other users.",
        "Although this alone is enough to justify the model, it would be worthwhile to incorporate it into a more complete automatic language processing system.",
        "We are now working on enhancing the system by including context relations, and by bringing to bear a word’s argument structure, qualia structure, and lexical inheritance.",
        "Within the past 10 years, original contributions have been made in the areas of compositional semantics and lexical context assignment (see Ide and Veronis [1998] for the state of the art on word sense disambiguation).",
        "Most studies have dealt with the sentence, but some have looked at the discourse and text levels.",
        "Based on a generative framework, Pustejovski (1995) proposed a computational model that adds a representation of a word’s structures (event structure, argument structure, qualia structure, and",
        "lexical inheritance structure), along with transformation rules for combining units.",
        "In their study, Asher and Lascarides (1995) showed that lexical semantics and discourse structure may interfere with discourse structure and devised heuristics to disentangle the effects of these two interacting levels.",
        "Other authors (Foltz, Kintsch, and Lan-dauer 1998; Kintsch 2001; Sch¨utze 1998) have developed an approach based solely on automatic corpus analysis in which co-occurrences and their frequencies are used to generate the semantic space associated with a given word.",
        "Edmonds and Hirst (2002) proposed a model with two tiers: a fine-grained synonym tier and a coarse conceptual tier.",
        "Unlike Edmonds and Hirst’s approach, which rests on an ontological model and conceptual representations, our model is capable of detecting semantic distinctions solely on the basis of similarity links.",
        "This feature is one of the model’s assets, but it is also a limitation, which provides the incentive for the enhancements we are currently developing.",
        "Here is a brief preview of our ongoing projects:",
        "• Certain words are poorly represented in terms of synonymy.",
        "This is the case for words that are essentially nonpolysemous, like computer or daisy, and thus have very few synonyms.",
        "Such entities are better delineated by an ontological, hierarchical representation and by their qualia structure than by synonymy links.",
        "Grammatical words also have few synonyms, so they too need to be represented in a formalism more suited to their own features than the one proposed in this article.",
        "• Usage contexts or domains of application are not currently given for the different semantic values detected by the model.",
        "For example, the perceptual value of the word insensible is employed to modify external phenomena, whereas the moral and physical values apply to animate beings.",
        "It would thus be useful, as in a standard dictionary, to specify the different types of terms the values obtained can modify.",
        "• Our research should help improve map drawing.",
        "At the present time,",
        "map neighborhoods rely solely on semantic criteria, which sometimes leads to the map’s including terms with similar meanings but different syntactic category memberships than the initial word.",
        "These projects should contribute to furthering research on language and automatic language processing.",
        "As stated in the article’s introduction, we are also working on the cognitive relevance of our model.",
        "We have already conducted an initial study aimed at determining whether a spatial model is an appropriate way of representing the structure of the mental lexicon.",
        "Our work on this problem draws from a preliminary study (Rouibah, Ploux, and Ji 2001) which proposes a homomorphism between lexical distance (the organizing principal of our model) and reaction time (the parameter used in lexical access experiments).",
        "This idea is based on the finding that lexical distance is subject to the same effects as reaction time."
      ]
    },
    {
      "heading": "Appendix",
      "text": [
        "Example of a classification, for the French term insensible (taken from Le Petit Robert version 1.2).",
        "Rough English translations are given in parentheses.",
        "insensible: • I Qui ne sent pas, ne ressent rien.",
        "(Not sensing, feeling nothing.)",
        "Ploux and Ji A Model for Matching Semantic Maps",
        "1.",
        "Qui n’a pas de sensibilit´e physique.",
        "inanim´e, mort.",
        "(Having no physical sensitivity.",
        "inanimate, dead.)",
        "2.",
        "Qui n’´eprouve pas les sensations habituelles, normales.",
        "(Not experiencing the usual, normal sensations) (insensible a` la douleur, au froid, a` la chaleur.",
        "(insensitive to pain, to cold, to heat.)",
        "3.",
        "Qui n’a pas de sensibilit´e morale; qui n’a pas ou a peu",
        "d’´emotions.",
        "(Having no moral sensitivity; having few if any emotions.)",
        "apathique, calme, d´etach´e, froid, impassible, imperturbable, indiff´erent.",
        "cruel, dur, ´ego¨ıste, endurci, impitoyable, implacable, inexorable.",
        "imperm´eable, indiff´erent.",
        "sourd.",
        "´etranger, ferm´e, inaccessible; r´efractaire.",
        "(apathetic, calm, detached, cold, impassible, imperturbable, indifferent.",
        "cruel, hard, egotistical, hardened, pitiless, implacable, inexorable.",
        "impervious, indifferent.",
        "deaf.",
        "foreign, closed, inaccessible; resistant.)",
        "• II 1.",
        "Qu’on ne sent pas, qu’on ne per¸coit pas ou qui est a` peine sensible, perceptible.",
        "imperceptible, l´eger.",
        "(Not being sensed, not being perceived or being just barely sensible, perceptible.",
        "imperceptible, slight.)",
        "2.",
        "Graduel, progressif.",
        "(Gradual, progressive.)",
        "System output for a request to generate the semantic space associated with the French headword insensible.",
        "Your query was: insensible.",
        "There are 71 synonyms and 93 cliques.",
        "Synonym list for the headword insensible (French lexical database).",
        "insensible: adamantin, anesth´esi´e, apathique, aride, assoupi, blas´e, calleux, calme, cruel, de marbre, dess´ech´e, dur, d´etach´e, endormi, endurci, engourdi, flegmatique, frigide, froid, f´eroce, glacial, glac´e, immobile, impassible, imperceptible, imperm´eable, imperturbable, impitoyable, implacable, imp´en´etrable, inabordable, inaccessible, inanim´e, inapparent, indiff´erent, indiscernable, indolent, indolore, inerte, inexorable, inflexible, inhumain, ininflammable, insaisissable, insignifiant, invisible, invuln´erable, l´eger, l´ethargique, mort, neutre, n´egligeable, obtus, paralys´e, progressif, rebelle, rigide, r´efractaire, sans coeur, sans en-trailles, sans coeur, sec, sourd, sto¨ıcien, sto¨ıque, suprasensible, s´ev`ere, timide, ´ego¨ıste, ´etranger, ´etroit.",
        "Clique list for the headword insensible (French lexical database).",
        "...",
        "..."
      ]
    }
  ]
}
