{
  "info": {
    "authors": [
      "Keiji Yasuda",
      "Fumiaki Sugaya",
      "Toshiyuki Takezawa",
      "Seiichi Yamamoto",
      "Masuzo Yanagida"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E03-1010",
    "title": "Automatic Evaluation for a Palpable Measure of a Speech Translation System's Capability",
    "url": "https://aclweb.org/anthology/E03-1010",
    "year": 2003
  },
  "references": [
    "acl-C92-2067",
    "acl-P02-1040"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The main goal of this paper is to propose automatic schemes for the translation paired comparison method.",
        "This method was proposed to precisely evaluate a speech translation system's capability.",
        "Furthermore, the method gives an objective evaluation result, i.e., a score of the Test of English for International Communication (TOEIC).",
        "The TOEIC score is used as a measure of one's speech translation capability.",
        "However, this method requires tremendous evaluation costs.",
        "Accordingly, automatization of this method is an important subject for study.",
        "In the proposed method, currently available automatic evaluation methods are applied to automate the translation paired comparison method.",
        "In the experiments, several automatic evaluation methods (BLEU, NIST, DP-based method) are applied.",
        "The exper- imental results of these automatic measures show a good correlation with evaluation results of the translation paired comparison method."
      ]
    },
    {
      "heading": "1 Introduction ATR Interpreting Telecommunications Research Laboratories (ATR-ITL) developed the ATR-MATR1X (ATR's Multilingual Automatic Translation System for Information Exchange) speech translation system (Takezawa et al., 1998), which translates both ways between English and Japanese. ATR-ITL has also been carrying out comprehensive evaluations of this system through dialog tests and analyses and has shown the effectiveness of the system for basic travel conversation (Sugaya et al., 1999).",
      "text": [
        "These experiences, however, indicated that it would be difficult to enlarge the evaluation target domain/task by simply adopting the dialog tests which is employed in the same way for ATR-MATRIX.",
        "Additional measures would be necessary in the design of an expanded system in order to meet performance expectations.",
        "Sugaya et al.",
        "(2000) proposed the translation paired comparison method, which is applicable to precise evaluation of speech translation systems with a limited task/domain capability.",
        "A major disadvantage of the translation paired comparison method is its subjective approach to evaluation.",
        "Such an approach requires large costs and a long evaluation time.",
        "Therefore, automatization of this method remains an important issue to solve.",
        "Several automatic evaluation methods have been proposed to achieve efficient development of MT technology, (Su et al., 1992; Papineni et al., 2002; NIST, 2002).",
        "Both subjective and automatic evaluation methods are useful for making comparisons among different schemes or systems.",
        "However, these techniques are unable to objectively measure the performance of practical target application systems.",
        "In this paper, we propose an automatization scheme for the translation paired comparison method that employs available automatic evaluation methods.",
        "Section 2 explains the translation paired comparison method, and Section 3 introduces the proposed evaluation scheme.",
        "Section 4 describes several automatic evaluation methods applied to the proposed method.",
        "Section 5 presents the evaluation results obtained by the proposed methods.",
        "Section 6 presents our conclusions."
      ]
    },
    {
      "heading": "2 Translation Paired Comparison Method",
      "text": [
        "The translation paired comparison method can precisely measure the capability of a speech translation system.",
        "A brief description of the method is given in this section.",
        "paired comparison method in the case of Japanese to English translation.",
        "The Japanese native-speaking examinees are asked to listen to spoken Japanese text and then write its English translation on paper.",
        "The Japanese text is presented twice within one minute, with a pause between the presentations.",
        "To measure the English capability of the Japanese native speakers, the TOEIC score (TOEIC, 2002) is used.",
        "The examinees are asked to present an official TOEIC score certificate confirming that they have officially taken the test within the past six months.",
        "In the translation paired comparison method, the translations by the examinees and the outputs of the system are printed in rows together with the original Japanese text to form evaluation sheets for comparison by an evaluator, who is a bilingual speaker of English and Japanese.",
        "Each transcribed utterance on the evaluation sheets is represented by the Japanese test text and the two translation results (i.e., translations by an examinee and by the system).",
        "The evaluator is asked to follow the procedure depicted in Figure 2.",
        "The meanings of ranks in the figure are as follows: (A) Perfect: no problem in both information and grammar; (B) Fair: easy-to-understand with some unimportant information missing or flawed grammar; (C) Acceptable: broken but understandable with effort; (D) Nonsense: important information has been translated incorrectly.",
        "In the evaluation process, the human evaluator ignores misspellings because the capability to be measured is not English writing but speech translation.",
        "From the scores based on these rankings, either the examinee or the system is considered the \"winner\" for each utterance.",
        "If the ranking and the naturalness are the same for an utterance, the competition is considered \"even\".",
        "To prepare the regression analysis, the number of \"even\" utterances are divided in half and equally assigned as system-won utterances and human-won utterances.",
        "Accordingly, we define the human winning rate (Wh) by the following equation:",
        "where Ntotai denotes the total number of utterances in the test set, Nhuman represents the number of human-won utterances, and Neven indicates the number of even (non-winner) utterances, i.e., no quality difference between the results of the TDMT and humans.",
        "Details of the regression analysis are given in Section 5."
      ]
    },
    {
      "heading": "3 Proposed Method",
      "text": [
        "The first point to explain is how to automatize the translation paired comparison method.",
        "The basic idea of the proposed method is to substitute the human evaluation process of the translation paired comparison method with an automatic evaluation method.",
        "There are two kinds of units to apply an automatic evaluation method to the automatization of the translation paired comparison method.",
        "One is an utterance unit, and the other is a test set unit.",
        "The unit of utterance corresponds to the unit of segment in BLEU and NIST.",
        "Similarly, the unit of the test set corresponds to the unit of document or system in BLEU and NIST.",
        "The utterance unit evaluation takes roughly the same procedure as the translation paired comparison method.",
        "Figure 3 shows the points of difference between the translation paired comparison method and the utterance unit evaluation of the proposed method.",
        "The complete flow can be obtained by substituting Figure 3 for the broken line area of Figure 2.",
        "In the regression analysis of the utterance unit evaluation, the same procedure as the original translation paired comparison method is carried out.",
        "In a sense, the test set unit evaluation follows a different procedure from the translation paired comparison method and the utterance unit evaluation.",
        "The flow of the test set unit evaluation is shown in Figure 4.",
        "In the regression analysis of the test set unit evaluation, the evaluation result by an automatic evaluation method is used instead of Wh-'An automatic evaluation method for the proposed method does not have to be a certain kind.",
        "However, needless to add, a precise automatic evaluation method is ideal.",
        "The automatic evaluation methods that we applied to the proposed method are explained in Section 4."
      ]
    },
    {
      "heading": "4 Automatic Evaluation Method",
      "text": [
        "In this section, we briefly describe the automatic evaluation methods that are applied to the proposed method.",
        "Basically, these methods are based on the same idea, that is, to compare the target translation for evaluation to high-quality human reference translations.",
        "These methods, then, require a corpus of high-quality human reference translations.",
        "Zce{CanMdates} En-3rnme{C} Countclip (n-gram) 5^Ce {Candidates} ^^/n – gramG {C} ^oun^(n QTarn) L*e ^ – the number of words in the reference translation that is closest in length to the translation being scored Lsys – the number of words in the translation being scored The DP score between a translation output and references can be calculated by DP matching (Su et al., 1992; Takezawa et al., 1999) as follows:",
        "the number of occurence of u'i the number of occurence of w Lref = the average number of words in a reference translation, averaged over all reference translations the number of words in the translation and 0 is chosen to make the brevity penalty fac-tor=0.5 when the number of words in the system translation is 2/3 of the average number of words in the reference translation.",
        "For Equations 3 and 4, N indicates the maximum n-gram length."
      ]
    },
    {
      "heading": "5 Evaluation Experiments",
      "text": [
        "In this section, we show experimental results of the original translation paired comparison method and the proposed method.",
        "The target system to be evaluated is Transfer Driven Machine Translation (TDMT) (Takezawa et al., 1998).",
        "TDMT is a language translation subsystem of the Japanese-to-English speech translation system ATR-MATRIX.",
        "For evaluation of TDMT, the input included accurate transcriptions.",
        "The total number of examinees is 29, and the range of their TOEIC score is between the 300s and 800s.",
        "Excepting the 600s, every hundred-point range has 5 examinees.",
        "The test set consists of 330 utterances in 23 conversations from the ATR bilingual travel conversation database (Takezawa, 1999).",
        "Consequently, this test set has different features from written language.",
        "Most of the utterances in our task contain fewer words than the unit of segment used so far in research with BLEU and NIST.",
        "One utterance contains 11.9 words on average.",
        "The standard deviation of the number of words is 6.5.",
        "The shortest utterance consists of 1 word, and the longest consists of 32 words.",
        "This test set was not used to train the TDMT system.",
        "For the translations of examinees, all misspellings were corrected by humans because, as mentioned in Section 2, the human evaluator ignores misspellings in the original translation paired comparison method.",
        "Figure 5 shows the results of a comparison between TDMT and the examinees.",
        "Here, the abscissa represents the TOEIC score, and the ordinate represents Wh- In this figure, the straight line indicates the regression line.",
        "The capability-balanced point between the TDMT subsystem and TOEIC score the examinees was determined to be the point at which the regression line crossed half the total number of test utterances, i.e., Wh of 0.5.",
        "In Figure 5, this point is 705.",
        "Consequently, the translation capability of the language translation system equals that of an examinee with a score of around 700 points on the TOEIC.",
        "We call this point the system's TOEIC score.",
        "In their original forms, the maximum n-gram length for BLEU (N in Equation 3) is set at 4 and that for NIST (N in Equation 4) is set at 5.",
        "These settings were established for evaluation of written language.",
        "However, utterances in our test set contain fewer words than in typical written language.",
        "Consequently, for the utterance unit evaluation, we conducted several experiments while varying N from 1 to 4 for BLEU and from 1 to 5 for NIST.",
        "Table 1 shows the detailed results of the paired comparison using automatic evaluations.",
        "Figure 6 shows experimental results of the utterance unit evaluation.",
        "In this figure, the abscissa represents the automatic evaluation method used and the n-gram length, and the ordinate represents the correct ratio (Rcorrect) calculated by the following equation:",
        "where Utotal is the total number of translation pairs consisting of the examinees' translation and the system's translation (330 utterances x 29 examinees = 9570 pairs) and Ucorrect is the number of pairs where the automatic evaluation gives the same evaluation result as that of the human evaluator.",
        "The difference between Figures 6 and 7 is the number of references to be used for automatic evaluation.",
        "In Figure 6, there is 1 reference per utterance, while in Figure 7 there are 16 references per utterance.",
        "In these figures, values in parentheses under the abscissa indicate the maximum n-gram length.",
        "Looking at these figures, the correct ratio of BLEU changes value depending on the maximum n-gram length.",
        "The maximum n-gram length of 1 or 2 yields a high correct ratio, and that of 3 or 4 yields a low correct ratio.",
        "On the other hand, the correct ratio of NIST is not influenced by the maximum n-gram length.",
        "It seems reasonable to suppose that these phenomena are due to computation of the mean of n-gram matching.",
        "As shown in Equations 3 and 4, BLEU applies a geometric mean and NIST applies an information-weighted arithmetic mean.",
        "Computation of the geometric mean yields 0 when one of the factors is 0, i.e., the BLEU score takes 0 for all of the utterances whose word count is less than the maximum n-gram length.",
        "The correct ratio shown in Figures 6 and 7 is low, i.e., around 0.5.",
        "Thus, even state-of-the-art technology is insufficient to determine better translation in the utterance unit evaluation.",
        "For a sufficient result of the utterance unit evaluation, we need a more precise automatic evaluation method or another scheme, for example, majority decision using multiple automatic evaluation methods.",
        "In the original BLEU or NIST formulation of the test set unit (or document or system level) evaluation, n-gram matches are computed at the utterance level, but the mean of n-gram matches is computed at the test-set level.",
        "However, considering the characteristics of the translation paired comparison method, the average of the utterance-level scores might be more suitable.",
        "Therefore, we carried out experiments using both the original formulation and the average of utterance-level scores.",
        "For the average of utterance-level scores, considering the experimental results shown in Figure 7, we used the maximum n-gram length of 2 for BLEU and 5 for NIST.",
        "Figure 8 shows the correlation between automatic measures and Wh- In this figure, the abscissa represents the number of references used for automatic evaluation, and the ordinate represents correlation.",
        "On the other hand, Figure 9 shows the correlation between automatic measures and TOEIC score.",
        "In this figure, the abscissa and the ordinate represent the variable as Figure 8.",
        "Figure 10 shows the system's TOEIC score using the proposed method.",
        "Here, the number of references is 16.",
        "In this figure, the ordinate represents the system's TOEIC score, and the broken line represents the system's TOEIC score using the original translation paired comparison method.",
        "In Figures 8, 9 and 10, white bars indicate the results using the original BLEU score, black bars indicate the results using the original NIST score, and gray bars indicate the results using the DP-based method.",
        "The bars with lines indicate the results using the original BLEU or NIST score, and those without lines indicate the results using the average of utterance-level scores.",
        "When we choose an automatic evaluation method to apply to the proposed method, there are two points that needs to be considered.",
        "One is the ability to precisely evaluate human translations.",
        "This ability can be evaluated by the results in Figures 8 and 9, and it affects confidence interval of the system 's TOEIC score.",
        "The other point to consider is the evaluation bias from the human's translation to the system's translation.",
        "This affects system's actual TOEIC score, which is shown in Figure 10.",
        "Looking at Figures 8 and 9, all of the automatic measures correlate highly with both Wh and TOEIC score.",
        "In particular, the averaged utterance-level BLEU score shows the highest correlation.",
        "However, looking at Figure 10, the system's TOEIC score using this measure deviates from that of the original translation paired comparison method.",
        "From the viewpoint of the system's TOEIC score, the DP-based method gives the best result at 708 points, while the original translation paired comparison method yielded a score of 705.",
        "The original BLEU also gives a good result at a system TOEIC score of 712.",
        "Considering the reductions in the evaluation costs and time, this automatic scheme shows a good performance and thus is very promising."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "We proposed automatic schemes for the translation paired comparison method.",
        "In the experimerits, we applied currently available automatic evaluation methods: BLEU, NIST and a DP-based method.",
        "The target system evaluated was TDMT We carried out two experiments: an utterance unit evaluation and a test set unit evaluation.",
        "According to the evaluation results, the utterance unit evaluation was insufficient to automatize the translation paired comparison method.",
        "However, the test set unit evaluation using the DP-based method and the original BLEU gave good evaluation results.",
        "The system's TOEIC score using the DP-based method was 708 and that using BLEU was 712, while the original translation paired comparison method gave a score around of 705.",
        "To confirm the general effectiveness of the proposed method, we are conducting experiments on another system as well as the opposite translation direction, i.e., English to Japanese translation."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The research reported here was supported in part by a contract with the Telecommunications Advancement Organization of Japan entitled, \"A study of speech dialogue translation technology based on a large corpus\".",
        "It was also supported in part by the Academic Frontier Project promoted by Doshisha University."
      ]
    }
  ]
}
