{
  "info": {
    "authors": [
      "Markus Dickinson",
      "Detmar Meurers"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E03-1068",
    "title": "Detecting Errors in Part-Of-Speech Annotation",
    "url": "https://aclweb.org/anthology/E03-1068",
    "year": 2003
  },
  "references": [
    "acl-A00-2020",
    "acl-A97-1014",
    "acl-C00-1046",
    "acl-C02-1131",
    "acl-E95-1029",
    "acl-J93-2004",
    "acl-W96-0213",
    "acl-W99-0606"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We propose a new method for detecting errors in \"gold-standard\" part-of-speech annotation.",
        "The approach locates errors with high precision based on n-grams occurring in the corpus with multiple taggings.",
        "Two further techniques, closed-class analysis and finite-state tagging guide patterns, are discussed.",
        "The success of the three approaches is illustrated for the Wall Street Journal corpus as part of the Penn Treebank."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Part-of-speech (pos) annotated reference corpora, such as the British National Corpus (Leech et al., 1994), the Penn Treebank (Marcus et al., 1993), or the German Negra Treebank (Skut et al., 1997) play an important role for current work in computational linguistics.",
        "They provide training material for research on tagging algorithms and they serve as a gold standard for evaluating the performance of such tools.",
        "High quality, pos-annotated text is also relevant as input for syntactic processing, for practical applications such as information extraction, and for linguistic research making use of pos-based corpus queries.",
        "The gold-standard pos-annotation for such large reference corpora is generally obtained using an automatic tagger to produce a first annotation, followed by human post-editing.",
        "While Sinclair (1992) provides some arguments for prioritizing a fully automated analysis, human post-editing has been shown to significantly reduce the number of pos-annotation errors.",
        "Brants (2000) discusses that a single human post-editor reduces the 3.3% error rate in the STTS annotation of the German Negra corpus produced by the TnT tagger to 1.2%.",
        "Baker (1997) also reports an improvement of around 2% for a similar experiment carried out for an English sample originally tagged with 96.95% accuracy by the CLAWS tagger.",
        "And Leech (1997) reports that manual post-editing and correction done for the 2-million word core corpus portion of the BNC, the BNC-sampler, reduced the approximate error rate of 1.7% for the automatically obtained annotation to less than 0.3%.",
        "While the last figure clearly is a remarkable result, van Halteren (2000), working with the written half of the BNC-sampler, reports that in 13.6% of the cases where his WPDV tagger disagrees with the BNC annotation, the cause is an error in the BNC annotation.",
        "Improving the correctness of such gold-standard annotation thus is important for obtaining reliable testing material for pos-tagger research, as well as for the other uses of gold-standard annotation mentioned at the beginning of this section – a point which becomes even stronger when one considers that the pos-annotation of most reference corpora contain significantly more errors than the 0.3% figure reported for the BNC-sampler.",
        "The percentage of disagreement caused by BNC errors rises to 20.5% for a tagger trained on the entire corpus.",
        "despite human post-editing, and sometimes are actually caused by it.",
        "Our main proposal discussed in section 2.1 is independent of the language and tagset of the corpus and requires no additional language resources such as lexica.",
        "It detects variation in the pos-annotation of a corpus by searching for n-grams which occur more than once in the corpus and include at least one difference in their annotation.",
        "We discuss how all such variation n-grams of a corpus can be obtained and show that together with some heuristics they are highly accurate predictors of annotation errors.",
        "In section 2.2 we turn to two other simple ideas for detecting pos-annotation errors, closed-class analysis and finite-state tagging guide patterns.",
        "Finally, in section 3 we relate our research to several recent publications addressing the topic of pos-error correction.",
        "2 Three methods for detecting errors The task of correcting part-of-speech annotation can be viewed as consisting of two steps: i) detecting which corpus positions are incorrectly tagged, and ii) finding the correct tag for those positions.",
        "The first step, detection, considers each corpus position and classifies the tag of that position as correct or incorrect.",
        "Given that this task involves each corpus position, only a fully automatic detection method is feasible for a large corpus.",
        "The second step, repair, considers those positions marked as errors and determines the correct tag.",
        "Taking the performance of current automatic taggers as baseline for the quality of the \"gold-standard\" pos-annotation we intend to correct, for English we can assume that repair needs to consider less than 3% of the number of corpus positions.",
        "This makes automation of this second step less critical, as long as the error detection step has a high precision (which is relevant since the repair step also needs to deal with false positives from detection).",
        "Our research in this paper addresses the first issue, detecting errors, and based on the just mentioned reasoning we focus on detecting errors automatically and with high precision.",
        "To do so, we propose three different methods, the first relying on internal corpus variation, the second on closed lexical classes, and the third on patterns in the tagging guide.",
        "We illustrate the applicability and effectiveness of each method by reporting the results of applying them to the Wall Street Journal (WSJ) corpus as part of the Penn Treebank 3 release, which was tagged using the PARTS tagger and manually corrected afterwards (Marcus et al., 1993).",
        "For each word that occurs in a corpus, there is a lexically determined set of tags that can in principle be assigned to this word.",
        "The tagging process reduces this set of lexically possible tags to the correct tag for a specific corpus occurrence.",
        "A particular word occurring more than once in a corpus can thus be assigned different tags in a corpus.",
        "We will refer to this as variation.",
        "Variation in corpus annotation is caused by one of two reasons: i) ambiguity: there is a word (\"type\") with multiple lexically possible tags and different corpus occurrences of that word (\"tokens\") happen to realize the different options, or ii) error: the tagging of a word is inconsistent across comparable occurrences.",
        "We can therefore locate annotation errors by zooming in on the variation exhibited by a corpus, provided we have a way to decide whether a particular variation is an ambiguity or an error – but how can this be done?",
        "The key to answering the question lies in a classification of contexts: the more similar the context of a variation, the more likely it is for the variation to be an error.",
        "But we need to make concrete what kind of properties the context consists of and what counts as similar contexts.",
        "In this paper, we focus on contexts composed of words and we require identity of the context, not just similarity.",
        "We will use the term variation n-gram for an n-gram (of words) in a corpus that contains a word that is annotated differently in another occurrence of the same n-gram in the corpus.",
        "The word exhibiting the variation is referred to as the variation nucleus.",
        "For example, in the WSJ, the string in (1) is a variation 12-gram since off is a variation nucleus that in one corpus occurrence of this string is tagged as preposition (IN), while in another it is tagged as a particle (RP).",
        "(1) to ward off a hostile takeover attempt by two European shipping concerns Note that the variation 12-gram in (1) contains two variation 11-grams, which one obtains by eliminating either the first or the last word.",
        "Algorithm To compute all variation n-grams of a corpus, we make use of the just mentioned fact that a variation n-gram must contain a variation (n – l)-gram to obtain an algorithm efficient enough to handle large corpora.",
        "The algorithm, which essentially is an instance of the a priori algorithm used in information extraction (Agrawal and Srikant, 1994), takes a pos-annotated corpus and outputs a listing of the variation n-grams, from n – 1 to the longest n for which there is a variation n-gram in the corpus.",
        "1.",
        "Calculate the set of variation unigrams in the corpus and store the variation unigrams and their corpus positions.",
        "2.",
        "Based on the corpus positions of the variation n-grams last stored, extend the n-grams to either side (unless the corpus ends there).",
        "For each resulting (n + l)-gram, check whether it has another instance in the corpus and if there is variation in the way the different occurrences of the (n + l)-gram are tagged.",
        "Store all variation (n + 1)-grams and their corpus positions.",
        "3.",
        "Repeat step 2 until we reach an n for which no variation n-grams are in the corpus.",
        "Running the variation n-gram algorithm on the WSJ corpus produced variation n-grams up to length 224.",
        "The table in Figure 1 reports two results for each n: the first is the number of variation n-grams that were detected and the second is the number of variation nuclei that are contained in those n-grams.",
        "For example, the second entry reports that 17384 variation bigrams were found, and they contained 18499 variation nuclei, i.e., for some of the bigrams there was a tag variation for both of the words.",
        "At the end of the table is the single variation 224-gram, containing 10 different variation nuclei, i.e., spots where the annotation of the (two) occurrences of the 224-gram differ.",
        "The table does not report how often a variation n-gram occurs in a corpus since such a count is not meaningful in our context: The variation unigram the, for instance, appears",
        "118.",
        "175.",
        "121.",
        "122.",
        "178.",
        "123.",
        "124.",
        "180.",
        "133.",
        "202.",
        "152.",
        "208.",
        "212.",
        "The table reports the level of variation in the WSJ across identical contexts of different sizes.",
        "In the next section we turn to the issue of detecting those occurrences of a variation n-gram for which the variation nucleus is an annotation error.",
        "Once the variation n-grams for a corpus have been computed, heuristics can be employed to classify the variations into errors and ambiguities.",
        "The first heuristic encodes the basic fact that the tag assignment for a word is dependent on the context of that word.",
        "The second takes into account that natural languages favor the use of local dependencies over non-local ones.",
        "Both of these heuristics are independent a specific corpus, tagset, or language.",
        "Variation nuclei in long n-grams are errors The first heuristic is based on the insight that a variation is more likely to be an error than a true ambiguity if it occurs within a long stretch of otherwise identical material.",
        "In other words, the longer the variation n-gram, the more likely that the variation is an error.",
        "For example, lending occurs tagged as adjective (JJ) and as common noun (NN) within occurrences of the same 184-gram in the corpus.",
        "It is very unlikely that the context (109 identical words to the left, 74 to the right) supports an ambiguity, and the adjective tag does indeed turn out to be an error.",
        "Similarly, the already mentioned 224-gram includes 10 different variation nuclei, all of which turn out to be erroneous variation.",
        "While we have based this heuristic solely on the length of the identical context, another factor one could take into account for determining relevant contexts are structural boundaries.",
        "A variation nucleus that occurs within a complete, otherwise identical sentence is very likely an error.",
        "For example, the 25-gram in (2) is a complete sentence that appears 14 times, four times with centennial tagged as JJ and ten times with centen56,317 times in the WSJ, but 56,300 of these are correctly annotated as determiner (DT).",
        "nial marked as NN, with the latter being correct according to the tagging guide (Santorini, 1990).",
        "(2) During its centennial year , The Wall Street Journal will report events of the past century that stand as milestones of American business history .",
        "Distrust the fringe Turning the spotlight from the n-gram and its properties to the variation nucleus contained in it, an important property determining the likelihood of a variation to be an error is whether the variation nucleus appears at the fringe of the variation n-gram, i.e., at the beginning or the end of the context which is identical over all occurrences.",
        "For example, joined occurs as past tense verb (VBD) and as past participle (VBN) within a variation 37-gram.",
        "It is the first word in the variation 37-gram and in one of the occurrences it is preceded by has and in another it is not.",
        "Despite the relatively long context of 37 words to the right, the variation thus is a genuine ambiguity, enabled by the location of the variation nucleus at the left fringe of the variation n-gram.",
        "The variation n-gram algorithm for the WSJ found 2495 distinct variation nuclei of n-grams with 6 < n < 224, where by distinct we mean that each corpus position is only taken into account for the longest variation n-gram it occurs in.",
        "To evaluate the precision of the variation n-gram algorithm and the heuristics for tag error detection, we need to know which of the variation nuclei detected actually include tag assignments that are real errors.",
        "We thus inspected the tags assigned to the 2495 variation nuclei that were detected by the algorithm and marked for each nucleus whether the variation was an error or an ambiguity.",
        "We found that 2436 of those variation nuclei are errors, i.e., the variation in the tagging of those words as part of the particular n-gram was incorrect.",
        "To get an idea for how many tokens in the corpus correspond to the 2436 variation nuclei that our method correctly flagged as being wrongly tagged, we hand-corrected the mistagged instances of those words.",
        "This resulted in a total of 4417 tag corrections.",
        "Turning to the heuristics discussed in the previous section, for the first one an n-gram length of six turns out to be a good cut-off point for the WSJ.",
        "This becomes apparent when one takes a look at where the 59 ambiguous variation nuclei arise: 32 of them are variation nuclei of 6-grams, 10 are part of 7-grams, 4 are part of 8-grams, and the remaining 13 occur in longer n-grams.",
        "Regarding the second heuristic, distrust the fringe, 57 of the 59 ambiguous variation nuclei that were found are fringe elements, i.e., occur as the first or last element of the variation n-gram.",
        "The two exceptions are \"and use some of the proceeds to\" and \"buy and sell big blocks of\", where the variation nuclei use and sell are ambiguous between base form verb (VB) and third-person singular present tense verb (VBP) but do not occur at the fringe.",
        "As an interesting aside, more than half of the true ambiguities (31 of 59) occurred between past tense verb (VBD) and past participle (VBN) and are the first word in their n-gram.",
        "Problematic cases Of the 2436 erroneous variation nuclei we discussed above, 140 of them deserve special attention here in that it was clear that the variation was incorrect, but it was not possible to decide based on the tagging guide (Santorini, 1990) which tag would be the right one to assign.That is, even without knowing the correct tag, it is clear that the context demands a uniform tag assignment.",
        "Most of those cases concern the distinction between singular proper noun (NNP) and plural proper noun (NNPS).",
        "For example, in the bigram Salomon Brothers, Brothers is tagged 42 times as NNP and 30 times as NNPS; similarly, Motors in General Motors is an NNP 35 times and an NNPS 51 times.",
        "While these variation nuclei clearly involve erroneous variation, they were not included in the total count of incorrect tag assignments detected by the variation n-gram method since the number to be added depends on which tag is deemed to be the correct one.",
        "For the NNP/NNPS cases, either there are 362 additional errors in the corpus (if NNP is correct) or 369 additional ones (in the other case).",
        "Aside from the main proposal of this paper, to use a variation n-gram analysis combined with heuristics for detecting corpus errors, there are two simple ideas for detecting errors which we want to mention here.",
        "These techniques are conceptually independent of the variation n-gram method, but can be combined with it in a pipeline model.",
        "Lexical categories in linguistics are traditionally divided into open and closed classes.",
        "Closed classes are the ones for which the elements can be enumerated (e.g., classes like determiners, prepositions, modal verbs, or auxiliaries), whereas open classes are the large, productive categories such as verbs, nouns, or adjectives.",
        "Making practical use of the concept of a closed class, one can see that almost half of the tags in the WSJ tagset correspond to closed lexical classes.",
        "This means that a straightforward way for checking the assignment of those tags is available.",
        "One can search for all occurrences of a closed class tag and verify whether each word found in this way is actually a member of that closed class.",
        "This can be done fully automatically, based on a list of tags corresponding to closed classes and a list of the few elements contained in each closed class.",
        "The WSJ annotation uses 48 tags (incl.",
        "punctuation tags), of which 27 are closed class items.",
        "Searching for determiners (DT) we found 50 words that were incorrectly assigned this tag.",
        "Examples for the mistagged items include half in both adjectival (JJ) and noun (NN) uses, the predeterminer (PDT) nary, and the pronoun (PRP) them.",
        "Looking through three closed classes, we detected 94 such tagging errors.",
        "In sum, such a closed class analysis seems to be useful as an error detection/correction method, which can be fully automated and requires very little in terms of language specific resources.",
        "Baker (1997) discusses that the BNC Tag Enhancement Project used context sensitive rules to fix annotation errors.",
        "The rules were written by hand, based on an inspection of errors that often resulted from the focus of the automatic tagger on few properties in a small window.",
        "Oliva (2001) also discusses building and applying such rules to detect potential errors; some rules are specified to automatically correct an error, while others require human intervention.",
        "Tagging guides such as the one for the WSJ (Santorini, 1990) often specify a number of specific patterns and state explicitly how they should be treated.",
        "One can therefore use the same technology as Baker (1997), Oliva (2001) and others and write rules which match the specific patterns given in the manual, check whether the correct tags were assigned, and correct them where necessary.",
        "This provides valuable feedback as to how well the rules of the tagging guide were followed by the corpus annotators and allows for the automatic identification and correction of a large number of error pattern occurrences.",
        "For example, the WSJ tagging manual states: \"Hyphenated nominal modifiers ... should always be tagged as adjectives.\" (Santorini, 1990, p. 12).",
        "While this rule is obeyed for 8605 occurrences in the WSJ, there are also 2466 cases of hyphenated words tagged as nouns preceding nouns, most of which are violations of the above tagging manual guideline, such as, for instance, stock-index in stock-index futures, which is tagged 41 times as JJ and 36 times as NN."
      ]
    },
    {
      "heading": "3 Related work",
      "text": [
        "Considering the significant effort that has been put into obtaining pos-tagged reference corpora in the past decade, there are surprisingly few publications on the issue of detecting errors in posannotation.",
        "In the past two or three years, though, some work on the topic has appeared, so in the following we embed our work in this context.",
        "The starting point of our variation n-gram approach, that variation in annotation can indicate an annotation error, essentially is also the starting point of the approach to annotation error detection of van Halteren (2000).",
        "But while we look for variation in the annotation of comparable stretches of material within the corpus, Van Halteren proposes to compare the hand-corrected annotation of the corpus with that produced by an automatic tagger, based on the idea that automatic taggers are designed to detect \"consistent behavior in order to replicate it\".",
        "Places where the automatic tagger and the original annotation disagree are thus deemed likely to be inconsistencies in the original annotation.",
        "Van Halteren shows that his idea is successful in locating a number of potential problem areas, but he concludes that checking 6326 areas of disagreement only unearths 1296 errors.",
        "The precision for detecting errors based on tagger-annotation disagreement thus is rather low, which is problematic considering that the repair stage that weeds out the many false positives of error detection is a manual process.",
        "Eskin (2000) discusses how to use a sparse Markov transducer as a method for what he calls anomaly detection.",
        "The notion of an anomaly essentially refers to a rare local tag pattern.",
        "The method flags 7055 anomalies for the Penn Treebank, about 44% of which hand inspection shows to be errors.",
        "Just as discussed for the approach of Van Halteren mentioned above, the low precision of the method of Eskin for detecting errors means that the repair process has to deal with a high number of false positives from the detection stage, which is problematic since error correction is done manually.",
        "In terms of the kind of errors that are detected by the sparse Markov transducer, Eskin notes that \"if there are inconsistencies between annotators, the method would not detect the errors because the errors would be manifested over a significant portion of the corpus.\" Eskin's method thus nicely complements the approach presented in this paper, given that inter-annotator (and intra-annotator) errors are precisely the kinds of errors our variation n-gram method is designed to detect.",
        "Kveton and Oliva (2002) employ the notion of an invalid bigram to locate corpus positions with annotation errors.",
        "An invalid bigram is a postag sequence that cannot occur in a corpus, and the set of invalid bigrams is derived from the set of possible bigrams occurring in a hand-cleaned sub-corpus, as well as linguistic intuition.",
        "Using this method, Kveton and Oliva (2002) report finding 2661 errors in the NEGRA corpus (containing 396,309 tokens).",
        "Interestingly, most of the errors found by the approaches we presented in this paper are perfectly valid bigrams.",
        "The invalid bigram approach of Kveton and Oliva (2002) thus also nicely complements our proposal.",
        "Hirakawa et al.",
        "(2000) and Miiller and Ule (2002) are two approaches which use the posannotation as input for syntactic processing – a full syntactic analysis in the former and a shallow topological field parse in the latter case – and single out those sentences for which the syntactic processing does not provide the expected result.",
        "Different from the approach we have described in this paper, both of these approaches require a sophisticated, language specific grammar and a robust syntactic processing regime so that the failure of an analysis can confidently be attributed to an error in the input and not an error in the grammar or the processor."
      ]
    },
    {
      "heading": "4 Summary and Outlook",
      "text": [
        "We have presented three detection methods for pos-annotation errors which remain in gold-standard corpora despite human post-editing.",
        "Our main proposal is to detect variation within comparable contexts and classify such variation as error or ambiguity using heuristics based on the nature of the context.",
        "The detection method can be automated, is independent of the particular language and tagset of the corpus, and requires no additional language resources such as lexica.",
        "We showed that an instance of this method based on identity of words in the variation contexts, so-called variation n-grams, successfully detects a variety of errors in the WSJ corpus.",
        "The usefulness of the notion of a variation n-gram relies on a particular word to appear several times in a corpus, with different annotations.",
        "It thus works best for large corpora and hand-annotated or hand-corrected corpora, or corpora involving other sources of inconsistency.",
        "As Ratnaparkhi (1996) points out, interannotator bias creates inconsistencies which a completely automatically-tagged corpus does not have.",
        "And Baker (1997) makes the point that a human post-editor also decreases the internal consistency of the tagged data since he will spot a mistake made by an automatic tagger for some but not all of its occurrences.",
        "As a result, our variation n-gram approach is well suited for the gold-standard annotations generally resulting from a combination of automatic annotation and manual post-editing.",
        "A case in point is that we recently applied the variation n-gram algorithm to the BNC-sampler corpus and obtained a significant number of variation n-grams up to length 692.",
        "The variation n-gram approach as the instance of our general idea to detect variation in comparable contexts presented in this paper prioritizes the precision of error detection by requiring identity of the words in the context of a variation in order for a variation n-gram to be detected.",
        "Despite this emphasis on precision, the significant number of errors the method detected in the WSJ shows that the recall obtained is useful in practice.",
        "In the future, we intend to experiment with defining variation contexts based on other, more general properties than the words themselves in order to increase recall, i.e., the number of errors detected.",
        "Natural candidates are the pos-tags of the words in the context.",
        "Other context generalizations also seem to be available if one is willing to include language or corpus specific information in computing the contexts.",
        "In the WSJ corpus, for example, different numerical amounts, which frequently appear in the same context, could be treated identically.",
        "In terms of outlook, the variation n-gram method can also be applied to other types of corpus annotation.",
        "Given that the quality of syntactic constituency and function annotation in current treebanks lags significantly behind that of posannotation, methods for detecting errors in syntactic annotation have a wide area of application.",
        "By applying the variation n-gram method to a syntactically-annotated string, we can detect those n-grams which occur several times but with a different constituent structure or syntactic function.",
        "Future research has to show whether it is possible to classify the syntactic variation n-grams thus detected into errors and ambiguities with the same precision as is the case for the pos-annotation variation n-grams we discussed in this paper."
      ]
    },
    {
      "heading": "Acknowledgements We would like to thank the anonymous reviewers of EACL and LINC for their comments and the participants of the OSU computational linguistics discussion group Clippers.",
      "text": []
    }
  ]
}
