{
  "info": {
    "authors": [
      "Bogdan Sacaleanu",
      "Paul Buitelaar",
      "Martin Volk"
    ],
    "book": "Conference of the European Association for Computational Linguistics – Demonstrations",
    "id": "acl-E03-2012",
    "title": "A Cross Language Document Retrieval System Based on Semantic Annotation",
    "url": "https://aclweb.org/anthology/E03-2012",
    "year": 2003
  },
  "references": [
    "acl-A00-1031",
    "acl-W98-1117"
  ],
  "sections": [
    {
      "text": [
        "2.",
        "Morphology 3.",
        "Chunking 1.",
        "Concept Annotation 2.",
        "Semantic Relation Annotation",
        "ates the intermediary data representation, and a back-end tier consisting of a search engine system to provide the retrieval technology (see Figure 1.).",
        "The middle tier annotation module consists of more subtiers representing an advanced annotation system that automatically identifies a number of relevant linguistic and semantic features.",
        "Components for part-of-speech tagging (Brants, 2000), morphological analysis (Petitpierre and Russell., 1995), phrase tagging (chunking) (Skut and Brants., 1998), concept and semantic relations annotation are being loosely integrated, through input-output markup interfaces, and generate an intermediary XML representation (Vin-tar et al., 2001) of the input data (see Figure 2.).",
        "Semantic annotation represents the primary information that the retrieval system is using.",
        "Crossing the language barrier from a query in one language to the document collection in another language is done via concept codes as an interlingua representation.",
        "The multilingual entries for UMLS concepts make possible the mapping of lexical items to an intermediate representation (concept codes) to bridge the gap between different languages.",
        "For example, the German word 'Herzinfarkt' in a query will be mapped to the same UMLS code as the English word 'myocardial infarction' in the documents.",
        "The loose integration of the abovemen-tioned components, through their ability to both produce and consume XML data, is an extremely flexible way for reuse.",
        "Through substitution or further chaining of such components the annotation can be extended to embrace a diverse set of domains beside the medical one.",
        "The entry point to the MuchMore* system is a query-processing interface that provides a user interface for completing or refining query construction (see Figure 3).",
        "For this purpose, the following information is displayed:",
        "• the text of the query, serving as reference context for any further refinements • a list of automatically extracted medical concepts along with their frequency and the semantic relations holding among the concepts Balint syndrom is a combination of symptoms including simultanagnosia, a disorder of spatial and object-based attention, disturbed spatial perception and representation, and optic ataxia resulting from bilateral parieto-occipital lesions.",
        "<token id=\"w20\" pos=\"JJ\" lemma=\"spatial\">spatial</token> <token id=\"w21\" pos=\"NN\" lemma=\"perception\">perception</token> </concept> </umlsterm> • a browsing option that helps the user to navigate through the concept space (MeSH) and include more general or more specific concepts in the constructed query",
        "The concept list consists of preferred names of the matched terminology, as found in the controlled vocabulary.",
        "Furthermore, on clicking the frequency number associated with a concept, all its instances in the query are highlighted.",
        "Thereby the user is not only presented with a normalized medical terminology, according to the controlled vocabulary, but he can also inspect which terms in the query document are instances of which concepts.",
        "A list of semantic relations that hold between co-occurring concepts is displayed for each concept.",
        "When the user clicks on a listed relation, the context of the relation and its concepts are highlighted, helping the user to make an informed choice on the relevance of the automatically extracted relation.",
        "For query expansion we provide a browse able contextual view of a concept according to the MeSH hierarchy.",
        "By selecting any concept in the generated list an overview is given of ancestor, sibling and child concepts.",
        "By double-clicking any of these, the query can be extended in a way that is relevant to the user needs, with the added concepts shown in a text area below the original concept list.",
        "The text area can be directly edited to append new terms to the query, which the user considers relevant but were neither automatically extracted nor available through MeSH browsing.",
        "Once the query has been refined according to the user needs, the underlying information about tokens, lemmas, concept codes and their relations is sent to the retrieval engine.",
        "The back-end tier of the system is a retrieval engine with XML-based indexing support.",
        "It allows to index any linguistic or semantic feature from the intermediary XML document representation.",
        "All content words of the documents are indexed as word forms and as base forms (lemmas), whereby, for compounds, base forms are being computed by segmenting them into single words (e.g. Nociceptilspiegel -> Nociceptin, Spiegel).",
        "In addition all semantic codes (MeSH and UMLS codes as well as semantic relations) are indexed in separate classes.",
        "Information relevant to a user query is being retrieved through a vector space similarity match between words, concepts and semantic relations on the query and document side.",
        "Evidence from multiple indexing features are automatically combined into the computation of the relevancy value for each document.",
        "The result page displays a list of relevant documents in a descending order and a list of concepts and semantic relations that the query consists of.",
        "For viewing the content of any retrieved document, a user interface similar to the query processing's view has been implemented, whereby the matched concepts and relations are being highlighted.",
        "As one of the goals of the project is to compare the performance of different document retrieval methods, the system allows for switching between the semantic retrieval engine presented above and other retrieval engines developed in the context of the project by other partners.",
        "Furthermore, a meta-search option allows the end user to query a combination of the available retrieval engines by merging different scoring schemes in one unified result list with the most relevant documents ranked topmost."
      ]
    },
    {
      "heading": "3 Future Work",
      "text": [
        "A next release of the system will add functionality with respect to the following topics:",
        "• Sense Disambiguation and • Relation Filtering"
      ]
    }
  ]
}
