{
  "info": {
    "authors": [
      "Richard Zens",
      "Franz Josef Och",
      "Hermann Ney"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E03-1032",
    "title": "Efficient Search for Interactive Statistical Machine Translation",
    "url": "https://aclweb.org/anthology/E03-1032",
    "year": 2003
  },
  "references": [
    "acl-C96-1067",
    "acl-J90-2002",
    "acl-W00-0507",
    "acl-W02-1020",
    "acl-W02-1021",
    "acl-W99-0604"
  ],
  "sections": [
    {
      "text": [
        "and Chair of Computer Science VI RWTH Aachen - University of Technology, Richard Zens and Chair of Computer Science VI RWTH Aachen - University of Technology, Hermann Ney and Chair of Computer Science VI RWTH Aachen - University of Technology,"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "The goal of interactive machine translation is to improve the productivity of human translators.",
        "An interactive machine translation system operates as follows: the automatic system proposes a translation.",
        "Now, the human user has two options: to accept the suggestion or to correct it.",
        "During the post-editing process, the human user is assisted by the interactive system in the following way: the system suggests an extension of the current translation prefix.",
        "Then, the user either accepts this extension (completely or partially) or ignores it.",
        "The two most important factors of such an interactive system are the quality of the proposed extensions and the response time.",
        "Here, we will use a fully fledged translation system to ensure the quality of the proposed extensions.",
        "To achieve fast response times, we will use word hypotheses graphs as an efficient search space representation.",
        "We will show results of our approach on the Verbmobil task and on the Canadian Hansards task."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Current machine translation technology is not able to guarantee high quality translations for large domains.",
        "Hence, in many applications, post-editing of the machine translation output is necessary.",
        "In such an environment, the main goal of the machine translation system is not to produce translations that are understandable for an inexperienced recipient but to support a professional human post-editor.",
        "Typically, a better quality of the produced machine translation text yields a reduced post-editing effort.",
        "From an application point of view, many additional aspects have to be considered: the user interface, the used formats and the additional support tools such as lexicons, terminological databases or translation memories.",
        "The concept of interactive machine translation, first suggested by (Foster et al., 1996), finds a very natural implementation in the framework of statistical machine translation.",
        "In interactive machine translation, the basic idea is to provide an environment to a human translator that interactively reacts upon the input as the user writes or corrects the translation.",
        "In such an approach, the system suggests an extension of a sentence that the human user either accepts or ignores.",
        "An implementation of such a tool was performed in the TransType project (Foster et al., 1996; Foster et al., 1997; Langlais et al., 2000).",
        "The user interface of the TransType system combines a machine translation system and a text editor into a single application.",
        "The human translator types the translation of a given source text.",
        "For each prefix of a word, the machine translation system computes the most probable extension of this word and presents this to the user.",
        "The human translator either accepts this translation by pressing a certain key or ignores the suggestion and continues typing.",
        "Rather than single-word predictions, as in the TransType approach, it is preferable that the suggested extension consists of multiple words or whole phrases.",
        "Ideally, the whole sentence should be suggested completely and the human translator should have the freedom to accept any prefix of the suggested translation.",
        "In the following, we will first describe the problem from a statistical point of view.",
        "For the resulting decision rule, we will describe efficient approximations based on word hypotheses graphs.",
        "Afterwards, we will present some results.",
        "Finally, we will describe the implemented prototype system."
      ]
    },
    {
      "heading": "2 Statistical Machine Translation",
      "text": [
        "We are given a source language ('French') sentence ff = f \\ ... f j ... f j, which is to be translated into a target language ('English') sentence e[ = e\\... e-i... ej.",
        "Among all possible target language sentences, we will choose the sentence of unknown length / with the highest probability: The decomposition into two knowledge sources in Eq.",
        "2 is the so-called source-channel approach to statistical machine translation (Brown et al., 1990).",
        "It allows an independent modeling of target language model Pr{e\\) and translation model Pr{f(\\e\\).",
        "The target language model describes the well-formedness of the target language sentence.",
        "The translation model links the source language sentence to the target language sentence.",
        "The argmax operation denotes the search problem, i.e. the generation of the output sentence in the target language.",
        "Here, we maximize over all possible target language sentences."
      ]
    },
    {
      "heading": "3 Interactive Machine Translation",
      "text": [
        "In a statistical approach, the problem of finding an extension e\\+1 of a given prefix e\\ can be described by constraining the search to those sentences e{ that contain e[ as prefix.",
        "So, we maximize over all possible extensions ef+1: For simplicity, we formulated this equation on the level of whole words, but of course, the same method can also be applied at the character level.",
        "In an interactive machine translation environment, we have to evaluate this quantity after every keystroke of the human user and compute the corresponding extension.",
        "For the practicability of this approach, an efficient maximization in Eq.",
        "3 is very important.",
        "For the human user, a response time larger than a fraction of a second is not acceptable.",
        "The search algorithms developed so far are not able to achieve this efficiency without an unacceptable amount of search errors.",
        "The one we will use usually takes a few seconds per sentence.",
        "Hence, we have to perform certain simplifications making the search problem feasible.",
        "Our solution is to precompute a subset of possible word sequences.",
        "The search in Eq.",
        "3 is then constrained to this set of hypotheses.",
        "As data structure for efficiently representing the set of possible word sequences, we use word hypotheses graphs (Ney and Aubert, 1994; Ueffmg et al., 2002)."
      ]
    },
    {
      "heading": "4 Alignment Templates",
      "text": [
        "As specific machine translation method, we use the alignment template approach (Och et al., 1999).",
        "The key elements of this approach are the alignment templates, which are pairs of source and target language phrases together with an alignment between the words within the phrases.",
        "The advantage of the alignment template approach compared to single word-based statistical translation models is that word context and local changes in word order are explicitly considered.",
        "The alignment template model refines the translation probability Pr(ff\\e{) by introducing two hidden variables and af for the K alignment templates and the alignment of the alignment tem-Hence, we obtain three different probability distributions: Pr(af-\\e[), Pr(zfL |af\\e{) and Pr{f(\\zi , af', e[).",
        "Here, we omit a detailed description of modeling and training as this is not relevant for the subsequent exposition.",
        "For further details, see (Och et al., 1999)."
      ]
    },
    {
      "heading": "5 Word Hypotheses Graphs",
      "text": [
        "A word hypotheses graph is a directed acyclic graph G = (V,E).",
        "It is a subset of the search graph and is computed as a byproduct of the search algorithm.",
        "Each node n G V corresponds to a partial translation hypothesis.",
        "Each edge (n, n') € E is annotated with both a target language word e(n, n') and the associated extension probability p(n, n') of language and translation model.",
        "The word hypotheses graph is constructed in such a way that the extension probabilities only depend on the two adjacent nodes.",
        "So, these probabilities are independent of the considered path through the graph.",
        "For simplicity, we assume that there exists exactly one goal and one start node.",
        "For a more detailed description of word hypotheses graphs, see (Ueffmg et al., 2002).",
        "An example of a simplified word hypotheses graph is shown in Fig. 1 for the German source sentence \"was hast du gesagt?\".",
        "The English reference translation is \"what did you say?\".",
        "For each node in the word hypotheses graph, the maximum probability path to reach the goal node is computed.",
        "This probability can be decomposed into the so-called forward probability p(n), which is the maximum probability to reach the node n from the start node and the so-called backward probability h(n), which is the maximum probability to reach the node n backwards from the goal node.",
        "The backward probability h{n) is an optimal heuristic function in the spirit of A* search.",
        "Having this information, we can compute efficiently for each node n in the graph the best successor As each node n corresponds to a partial translation hypothesis e\\, the optimal extension of this prefix is obtained by: Hence, the function S provides the optimal word sequence in a time complexity linear to the number of words in the extension.",
        "Yet, as the word hypotheses graph contains only a subset of the possible word sequences, we might face the problem that the prefix path is not part of the word hypotheses graph.",
        "To avoid this problem, we perform a tolerant search in the word hypotheses graph.",
        "We select the set of nodes that correspond to word sequences with minimum Lev-enshtein distance (edit distance) to the given prefix.",
        "This can be computed by a straightforward extension of the normal Levenshtein algorithm for word hypotheses graphs.",
        "From this set of nodes, we choose the one with maximum probability and compute the extension according to Eq.",
        "4.",
        "Because of this approximation, the suggested translation extension might contain words that are already part of the translation prefix."
      ]
    },
    {
      "heading": "6 Evaluation Criterion",
      "text": [
        "As evaluation criterion, we use the keystroke ratio (KSR), which is the ratio of the number of keystrokes needed to produce the single reference translation using the interactive translation system divided by the number of keystrokes needed to simply type the reference translation.",
        "We make the simplifying assumption that the user can accept an arbitrary length of the proposed extension using a single keystroke.",
        "Hence, a keystroke ratio of 1 means that the system was never able to suggest a correct extension.",
        "A very small keystroke ratio means that the suggested extensions are often correct.",
        "This value gives an indication about the possible effective gain that can be achieved if this interactive translation system is used in a real translation task.",
        "On the one hand, the keystroke ratio is very optimistic with respect to the efficiency gain of the user.",
        "On the other hand, it is a well-defined objective criterion that we expect to be well correlated to a more user-centered evaluation criterion.",
        "A simplified example is shown in Tab.",
        "1.",
        "We manually selected paths in the word hypotheses graph (Fig.",
        "1) to illustrate the interaction with the system.",
        "In practice, the system should translate this short sentence correctly without any user interaction.",
        "The reference translation is \"what did you say ?\" and the first suggestion of the system is \"what do you say ?\".",
        "So, the user accepts the prefix \"what d\" with one keystroke (denoted with a \"#\") and then enters the correct character \"i\".",
        "The next suggestion of the system is \"what did you said ?\".",
        "Now, the user accepts the prefix \"what did you sa\" and then types the character \"y\".",
        "Finally, the system suggests the correct translation the user simply accepts.",
        "Overall, the user needed 5 keystrokes to produce the reference translation with the interactive translation system.",
        "Simply typing the reference translation would take 19 keystrokes (including blanks and a return at the end).",
        "So, the keystroke ratio is 5/19 = 26.3%."
      ]
    },
    {
      "heading": "7 Results 7.1 Verbmobil",
      "text": [
        "The first task, we present results on, is the Verbmobil task (Wahlster, 2000).",
        "The domain of this corpus is appointment scheduling, travel planning, and hotel reservation.",
        "It consists of transcriptions of spontaneous speech.",
        "Table 2 shows the corpus statistics of this corpus.",
        "Table 3 shows the resulting keystroke ratio and the average extension time for various word hypotheses graph densities (i.e. the number of edges per source word).",
        "The table shows the effect of both single-word extensions and whole-sentence extensions.",
        "We see a strong correlation between the word hypotheses graph density and the response time.",
        "step no.",
        "extension type When using a larger word hypotheses graph, a considerably larger amount of time is needed to search for the optimal extension.",
        "On the other hand, there is a reduction of the KSR: in the case of single-word extensions, the KSR improves from 54.3% and 0.003 seconds per extension to 41.6% and 0.333 seconds per extension.",
        "Significantly better results are obtained by performing whole-sentence extensions.",
        "Here, the KSR improves from 41.7% and 0.003 seconds per extension to 24.5% and 0.505 seconds per extension.",
        "Additional experiments were carried out on the Canadian Hansards task.",
        "This task contains the proceedings of the Canadian parliament, which are kept by law in both French and English.",
        "About 3 million parallel sentences of this bilingual data have been made available by the Linguistic Data Consortium (LDC).",
        "Here, we use a subset of the data containing only sentences with a maximum length of 30 words.",
        "Table 4 shows the training and test corpus statistics.",
        "Table 5 shows the resulting keystroke ratio and the average extension time for various word hypotheses graph densities.",
        "Again, we show the effect of both single-word extensions and whole-sentence extensions.",
        "The results are similar to the Verbmobil task: by using a larger word hypotheses graph, a considerably larger amount of time is needed to search the word hypotheses graph, but on the other hand there is an improvement of the KSR: in the case of single-word extensions, the KSR improves from 62.9% and 0.003 seconds per extension to 50.3% and 0.436 seconds per extension.",
        "As for the Verbmobil task, significantly better results are obtained by performing whole-sentence extensions.",
        "Here, the KSR improves from 46.3% and 0.002 seconds per extension to 33.1% and 0.556 seconds per extension.",
        "Regarding the experiments carried out on both tasks, we conclude that the set of possible candidate translations can be indeed represented by word hypotheses graphs.",
        "In addition, we conclude that whole-sentence extensions give significantly better results than single-word extensions."
      ]
    },
    {
      "heading": "8 Prototype System",
      "text": [
        "In the following, we describe how the presented method has been used to build an operational prototype for interactive translation.",
        "This prototype has been build as part of the EU project TransType 2 (IST-2001-32091).",
        "It allows an effective interaction between the human translator and the machine translation system.",
        "The prototype has the following key properties:",
        "• The system uses the alignment template approach described in section 4 as translation engine.",
        "• It allows the machine translation output to be interactively post-edited.",
        "The system suggests a full-sentence extension of the current translation prefix.",
        "The user either accepts the complete suggestion or a certain prefix.",
        "• The human translator is able to obtain a list of alternative words at a specific position in the sentence.",
        "This helps the human translator to find alternative translations.",
        "• Since the system is based on the statistical approach, it can learn from existing sample translations.",
        "Therefore, it adapts to very specific domains without much human intervention.",
        "Unlike systems based on translation memories, the system is able to provide suggestions also for sentences that have not been seen in the bilingual translation examples.",
        "• The system can also learn interactively from those sentences that have been corrected or accepted by the user.",
        "The user may request that a specific set of sentences be added to the knowledge base.",
        "A major aim of this feature is an improved user acceptability as the machine translation environment is able to adapt rapidly and easily to a new vocabulary.",
        "The developed system seems to have advantages over currently used machine translation or translation memory environments as it combines important concepts from these areas into a single application.",
        "The two major advantages are the ability to suggest full-sentence extensions and the ability to learn interactively from user corrections.",
        "The system is implemented as a client-server application.",
        "The server performs the actual translations as well as all time-consuming operations such as computing the extensions.",
        "The client includes only the user interface and can therefore run on a small computer.",
        "Client and server are connected via Internet or Intranet.",
        "There is ongoing research to experimentally study the productivity gain of such a system for professional human translators."
      ]
    },
    {
      "heading": "9 Related Work",
      "text": [
        "As already mentioned, previous work towards interactive machine translation has been carried out in the TransType project (Foster et al., 1996; Foster et al., 1997; Langlais et al., 2000).",
        "In (Foster et al., 2002) a so-called \"user model\" has been introduced to maximize the expected benefit of the human translator.",
        "This user model consists of two components.",
        "The first component models the benefit of a certain extension.",
        "The second component models the acceptance probability of this extension.",
        "The user model is used to determine the length of the proposed extension measured in characters.",
        "The resulting decision rule is more centered on the human user than the one in Eq.",
        "3.",
        "It takes into account, e.g., the time the user needs to read the extension (at least approximatively).",
        "In principle, the decision rule in Eq.",
        "3 can be extended by such a user model.",
        "In (Foster et al., 2002) the assumption is made that \"the user edits only by erasing wrong character from the end of a proposal\".",
        "The approach in this paper is different in that the user works from left to right by either accepting or correcting the proposed translation.",
        "Therefore, in our approach, we would have to modify the details of the user model.",
        "An additional difference is the used translation engine: in (Foster et al., 2002) a simple translation model is chosen for efficiency reasons, namely a maximum entropy version of IBM2.",
        "Here, we use a fully fledged translation model and deal with the efficiency problem by using word hypotheses graphs."
      ]
    },
    {
      "heading": "10 Conclusions",
      "text": [
        "We have suggested an interactive machine translation environment for computer assisted translation.",
        "It assists the human user by interactively reacting upon his/her input.",
        "The system suggests full-sentence extensions of the current translation prefix.",
        "The human user can accept any prefix of this extension.",
        "We have used a fully fledged translation system, namely the alignment template approach, to produce high quality extensions.",
        "Word hypotheses graphs have been used to allow an efficient search for the optimal extension.",
        "Using this method, the amount of keystrokes needed to produce the reference translation reduces significantly.",
        "Additional optimizations of the word hypotheses graphs might improve the efficiency of the search.",
        "E.g., forward-backward pruning (Sixtus and Ortmanns, 1999) could be used to reduce the word hypotheses graph density.",
        "Further improvements could be achieved by incorporating a more user-centered cost function like the user model in (Foster et al., 2002).",
        "To answer the question of how long the extension should be, a good confidence measure could be useful (Wessel et al., 2001)."
      ]
    },
    {
      "heading": "11 Acknowledgement",
      "text": []
    }
  ]
}
