{
  "info": {
    "authors": [
      "Oliver Bender",
      "Klaus Macherey",
      "Franz Josef Och",
      "Hermann Ney"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E03-1055",
    "title": "Comparison of Alignment Templates and Maximum Entropy Models for NLP",
    "url": "https://aclweb.org/anthology/E03-1055",
    "year": 2003
  },
  "references": [
    "acl-C96-2141",
    "acl-J93-2003",
    "acl-J96-1002",
    "acl-P94-1004",
    "acl-W99-0604"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper we compare two approaches to natural language understanding (NLU).",
        "The first approach is derived from the field of statistical machine translation (MT), whereas the other uses the maximum entropy (ME) framework.",
        "Starting with an annotated corpus, we describe the problem of NLU as a translation from a source sentence to a formal language target sentence.",
        "We mainly focus on the quality of the different alignment and ME models and show that the direct ME approach outperforms the alignment templates method."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The objective of natural language understanding (NLU) is to extract all the information from a natural language based input which are relevant for a specific task.",
        "Typical applications using NLU components are spoken dialogue systems (Levin and Pieraccini, 1995) or speech-to-speech translation systems (Zhou et al., 2002).",
        "In this paper we present two approaches for analyzing the semantics of natural language inputs and discuss their advantages and drawbacks.",
        "The first approach is derived from the field of statistical machine translation (MT) and is based on the source-channel paradigm (Brown et al., 1993).",
        "Here, we apply a method called alignment templates (Och et al., 1999).",
        "The alternative ap-ich würde gerne von Köln nach München fahren @want_question @origin @destination ggoing proach uses the maximum entropy (ME) framework (Berger et al., 1996).",
        "For both frameworks, the objective can be described as follows.",
        "Given a natural source sentence ff – f\\...fj...fj we choose the formal target language sentence e{ = ei...ej...ej with the highest probability among all possible target sentences: Using Bayes' theorem, Eq.",
        "1 can be rewritten to Eq.",
        "2, where the denominator can be neglected.",
        "The argmax operation denotes the search problem, i.e. the generation of the sequence of formal semantic concepts in the target language.",
        "An example is depicted in Figure 1.",
        "The main difference between both approaches is that the ME framework directly models the posterior probabilities whereas the statistical machine translation approach applies Bayes' theorem resulting in two distributions: the translation probability Pr(fi\\e[) and the language model probability Pr{e[).",
        "In the following, we compare both appreaches for two NLU tasks which are derived from two different domains and show that the ME approach clearly outperforms the statistical machine translation approach within these settings.",
        "The use of statistical machine translation for NLU tasks was firstly proposed by (Epstein et al., 1996).",
        "Whereas (Epstein et al., 1996) model hidden dumpings, we use a method called alignment templates.",
        "Alignment templates have been proven to be very powerful for statistical machine translation tasks since they allow for many-to-many alignments between source and target words (Och et al., 1999).",
        "Alignment templates for NLU tasks were firstly proposed by (Macherey et al., 2001).",
        "Applying ME translation models to NLU has been firstly suggested by (Papineni et al., 1997; Papineni et al., 1998).",
        "Here, we use a concept-based meaning representation as formal target language and propose different features and structural constraints in order to improve the NLU results.",
        "The remainder of the paper is organized as follows: in the following section, we briefly describe the concept based meaning representation as used for the NLU task.",
        "Section 3 describes the training and search procedure of the alignment templates approach.",
        "In section 4, we outline the ME framework and describe the features that were used for the experiments.",
        "Section 5 presents results for both the alignment templates approach and the ME framework.",
        "For both approaches, experiments were carried out on two different German NLU tasks."
      ]
    },
    {
      "heading": "2 Concept-based semantic representation",
      "text": [
        "A crucial decision, when designing an NLU system, is the choice of a suitable semantic representation, since interpreting a user's request requires an appropriate formalism to represent the meaning of an utterance.",
        "Different semantic representations have been proposed.",
        "Among them, case frames (Issar and Ward, 1993), semantic frames (Bennacef et al., 1994), and variants of hierarchical concepts (Miller et al., 1994) as well as flat concepts (Levin and Pieraccini, 1995) are the most prominent.",
        "Since we regard NLU as a special case of a translation problem, we have chosen a flat concept-based target language as meaning representation.",
        "A semantic concept (in the following briefly termed as concept) is defined as the smallest unit of meaning that is relevant to a specific task (Levin and Pieraccini, 1995).",
        "Figure 1 depicts an example of a concept-based meaning representation for the input utterance T would like to go from Munich to Cologne' from the domain of a German train-timetable information system.",
        "The first line shows the source sentence, the last line depicts the target sentence consisting of several concepts, marked by the preceding ©-symbol.",
        "The connections between the words describe the alignments between source and target words."
      ]
    },
    {
      "heading": "3 Alignment Templates",
      "text": [
        "The statistical machine translation approach decomposes Pr(e\\\\f() into two probability distributions, the language model probability and the translation probability.",
        "The architecture of this method is depicted in figure 2.",
        "For the translation approach, we use the same training procedure as for the automatic translation of natural languages.",
        "When rewriting the translation probability Pr( f(\\eIl) by introducing a 'hidden' alignment a{ = a\\... aj... aj, with cij € {1,..., /}, we obtain: The IBM models as proposed by (Brown et al., 1993) and the HMM model as suggested by (Vogel et al., 1996) result from different decompositions of Pr(ff, a{\\e[).",
        "For training the alignment model, we train a sequence of models of increasing complexity.",
        "Starting from the first model IBM1, we proceed over the HMM model, IBM3 up to IBM5.",
        "Using the model IBM5 as a result of the last training step, we use the alignment template approach to model whole word groups.",
        "Source Language Text ^ Preprocessing^ Global Search Target Language Text The alignment templates approach provides a two-level alignment: a phrase level alignment and a word level alignment within the phrases.",
        "As a result, source and target sentence must be segmented into K word-groups, describing the phrases: By decomposing the translation probability with the above-mentioned definitions, we arrive at: Denote z – (e', f '.a') an alignment template, we obtain p(f|e) = ^2zp(z\\e) • p(f\\z,e).",
        "The phrase translation probability p(f\\z,e) is decomposed according to the following equation: where S(-,-) denotes the Kronecker-function.",
        "The probability p(fj\\a ', e) can be decomposed in the",
        "following way: if (i, j) are linked in a ' otherwise.",
        "During training, we proceed over all sentence pairs and estimate the probabilities by determining the relative frequencies of applying an alignment template.",
        "Figure 3 shows an example of alignment templates computed for a sentence pair from the German TAB A corpus.",
        "If we insert the alignment template model and a standard left-to-right language model in the source-channel approach (Eq.",
        "2), we obtain the following search criterion in maximum approximation which is used in combination with beam search:"
      ]
    },
    {
      "heading": "4 Maximum Entropy Models",
      "text": [
        "As alternative to the source-channel approach, we can directly model the posterior probability Pr{e[\\f().",
        "A well-founded framework for doing this is maximum entropy (Berger et al., 1996).",
        "In this framework, we have a set of M feature functions hm(e[, fi),m – 1,..., M. For each feature function hm, there is a model parameter Am.",
        "The posterior probability can then be modeled as follows: The architecture of the ME approach is summarized in Figure 4.",
        "For our approach, we determine the corresponding formal target language concept for each word of a natural language input.",
        "Therefore, we distinguish whether a word is an initial or a non-initial word of a concept.",
        "This procedure yields a one-to-one translation from source words to formal semantic concepts, i.e. the length of both sequences must be equal (I – J).",
        "Figure 5 depicts a one-to-one mapping applied to a sentence/concept pair from the German TAB A corpus.",
        "Further, we assume that the decisions only depend on a limited window of – fj-2---fj+2 around the current source word fj and on the two predecessor concepts.",
        "Thus, we obtain the following second-order model: Transition constraints: Due to the distinction between initial and non-initial concepts, we have to ensure that a non-initial concept must only follow its corresponding initial one.",
        "To guarantee this, a straightforward method is to implement a feature function that models the transitions and to set the feature values of all invalid transitions to zero, so that they will be discarded during search.",
        "We have implemented a set of binary valued feature functions for our system: J+2 are compared Lexical features: The words f to a vocabulary.",
        "Words which are not found in the vocabulary are mapped onto an 'unknown word'.",
        "<D cn fi fi fi o",
        "Formally, the feature will fire if the word fj+d matches the vocabulary entry / and if the prediction for the current concept equals e. 5(-, ■) again denotes the Kronecker-function.",
        "Word features: Word characteristics are covered by the word features, which test for: - Capitalization: These features will fire if fj is capitalized, has an internal capital letter, or is fully capitalized.",
        "- Pre and suffixes: If the prefix (suffix) of fj equals a given prefix (suffix), these features will fire.",
        "Transition features: Transition features model the dependence on the two predecessor concepts: Kej-d,e') • S(ej,e) , d £ {1,2} .",
        "Prior features: The single concept priors are incorporated by prior features.",
        "They just fire for the currently observed concept: S(ej,e) .",
        "Compound features: Using the feature functions defined so far, we can only specify features that refer to a single word or concept.",
        "To enable also word phrases and word/concept combinations, we introduce the following compound features: zk e {/,e'} , dk e {-2, ...,2} .",
        "Feature selection: Feature selection plays a crucial role in the ME framework.",
        "In our system we use simple count-based feature reduction.",
        "Given a threshold K, we only include those features that have been observed on the training data at least K times.",
        "Although this method is not minimal, i.e. the reduced feature set may still contain features that are redundant or non-informative, it turned out to perform well in practice.",
        "Experiments were carried out with different thresholds.",
        "It turned out that for the NLU task, a threshold of 2 for all features achieved the best results, except for the prefix and suffix features, for which a threshold of 6 yielded best results.",
        "For the purpose of training, we consider the set of manually annotated and segmented training sentences to form a single long sentence.",
        "As training criterion, we use the maximum class posterior probability criterion: argmax < V\" logpxu (en\\fn) Af This corresponds to maximizing the likelihood of the ME model.",
        "The direct optimization of the posterior probability in Bayes' decision rule is referred to as discriminative training in automatic speech recognition since we directly take into account the overlap in the probability distributions.",
        "Since the optimization criterion is convex, there is only a single optimum and no convergence problems occur.",
        "To train the model parameters A^ we use the Generalized Iterative Scaling (GIS) algorithm (Darroch and Ratcliff, 1972).",
        "In practice, the training procedure tends to result in an overfitted model.",
        "To avoid overfit-ting, (Chen and Rosenfeld, 1999) have suggested a smoothing method where a Gaussian prior on the parameters is assumed.",
        "Instead of maximizing the probability of the training data, we now maximize the probability of the training data times the prior probability of the model parameters: argmax \\ piXf ) ■ Y]pAM(era|/re) In the test phase, the search is performed using the so called maximum approximation, i.e. the most likely sequence of concepts e[ is chosen among all possible sequences e{: = argmax j £ \\mhm(e[, /j)} .",
        "Therefore, the time-consuming renormalization in Eq.",
        "5 is not needed during search.",
        "We run a Viterbi search to find the highest probability sequence (Borthwick et al., 1998)."
      ]
    },
    {
      "heading": "5 Results",
      "text": [
        "Experiments were performed on the German in-house Philips TAB A corpus and the German in-house TELDIR corpus.",
        "The TABA corpus is a text corpus in the domain of a train timetable information system (Aust et al., 1995).",
        "The TELDIR corpus is derived from the domain of a telephone directory assistance.",
        "Along with the bilingual annotation consisting of the source and target sentences, the corpora also provide the affiliated alignments between source words and concepts.",
        "The corpora allocations are summarized in table 1 and table 2.",
        "For the TABA corpus, the target language consists of 27 flat semantic concepts (23 concepts for the TELDIR application, resp.",
        "), including a filler concept.",
        "Table 3 summarizes an excerpt of the most frequently observed concepts.",
        "In order to improve the quality of both approaches, we used a set of word categories.",
        "Since it is unlikely that every city name is observed during training, all city names were mapped onto the category $CITY{city name}.",
        "Table 4 shows an excerpt of different categories which were used for both the training and the testing corpora.",
        "We have computed three different evaluation criteria: - The concept error rate (CER), which is equally defined to the well known word error 'The TABA corpus was kindly provided by Philips Forschungslaboratorien Aachen.",
        "rate.",
        "The CER describes the ratio of the sum of deleted, inserted, and substituted concepts w.r.t.",
        "a Levenshtein-alignment for a given reference concept-string, and the total number of concepts in all reference strings.",
        "- The sentence error rate (SER), which is defined as ratio between the number of falsely translated sentences and the total number of sentences w.r.t.",
        "the concept-level.",
        "- The concept-alignment error rate (C-AER), which is defined as the ratio of the sum of falsely aligned words, i.e. words mapped onto the wrong concept, and the total number of words in the reference (Macherey et al., 2001).",
        "The error rates obtained by using the alignment templates method are summarized in table 5 and table 6.",
        "Table 7 and table 8 show the performance of the ME approach for different types of ME features.",
        "Starting with only lexical features, we successively extend our model by including additional feature functions.",
        "As can be seen from these results, the ME models clearly outperform the alignment models.",
        "The quality of the translation approach is achieved within the ME framework by just including lexical and transition features, and is significantly improved by adding further feature functions.",
        "Comparing the performance on the TABA task and on the TELDIR task, we see that the error rates are much lower for the TABA task than for the TELDIR task; the reason is due to the very limited training data.",
        "One of the advantages of the ME approach results from the property that the ME framework directly models the posterior probability and allows for integrating structural information by using appropriate feature functions.",
        "Furthermore, the ME approach is consistent with the features observed on the training data, but otherwise makes the fewest possible assumptions about the distribution.",
        "Since the optimization criterion is convex, there is only a single optimum and no con"
      ]
    },
    {
      "heading": "6 Summary",
      "text": [
        "In this paper, we have investigated two approaches for natural language understanding: the alignment templates approach which is based on the source-channel paradigm and the maximum entropy approach which directly models the posterior probability.",
        "Both approaches were tested on two different corpora.",
        "We have shown that within these settings the maximum entropy method clearly outperforms the alignment templates approach."
      ]
    }
  ]
}
