{
  "info": {
    "authors": [
      "Ola Akerberg",
      "Hans Svensson",
      "Bastian Schulz",
      "Pierre Nugues"
    ],
    "book": "Conference of the European Association for Computational Linguistics – Demonstrations",
    "id": "acl-E03-2002",
    "title": "CarSim: An Automatic 3D Text-To-Scene Conversion System Applied to Road Accident Reports",
    "url": "https://aclweb.org/anthology/E03-2002",
    "year": 2003
  },
  "references": [
    "acl-P84-1106",
    "acl-W01-1301"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "CarSim is an automatic text-to-scene conversion system.",
        "It analyzes written descriptions of car accidents and synthesizes 3D scenes of them.",
        "The conversion process consists of two stages.",
        "An information extraction module creates a tabular description of the accident and a visual simulator generates and animates the scene.",
        "We implemented a first version of Car-Sim that considered a corpus of texts in French.",
        "We redesigned its linguistic modules and its interface and we applied it to texts in English from the National Transportation Safety Board in the United States."
      ]
    },
    {
      "heading": "1 Text-to-Scene Conversion",
      "text": [
        "Text-to-scene conversion consists in creating a 2D or 3D geometric description from a natural language text.",
        "The resulting scene can be static or animated.",
        "To be converted, the text must be appropriate in some sense, that is, contains explicit descriptions of objects and events for which we can form mental images.",
        "Animated 3D graphics have some advantages for the visualization of information.",
        "They can reproduce a real scene more accurately and render a sequence of events.",
        "Automatic text-to-scene conversion has been investigated in a few projects.",
        "NALIG (Adorni et al., 1984; Di Manzo et al., 1986) is an early system that was designed to recreate static 2D scenes from simple phrases in Italian.",
        "WordsEye (Coyne and Sproat, 2001) is a recent and ambitious example.",
        "It features a large database of 3D objects that can be animated.",
        "CogViSys (Nagel, 2001; Arens et al., 2002) is aimed a visualizing descriptions of simple car maneuvers at crossroads.",
        "All these systems use apparently invented narratives."
      ]
    },
    {
      "heading": "2 CarSim",
      "text": [
        "We describe here a new system that accepts reports in English.",
        "We developed and tested it using twenty road accident summaries from the National Transportation Safety Board (www.ntsb.gov), an accident research organization of the United States government.",
        "The accidents described by the NTSB are more complex or spectacular than the ones we analyzed in French.",
        "To visualize them, we had to add new vehicle actions like \"overturn.\""
      ]
    },
    {
      "heading": "3 An Example of Report",
      "text": [
        "The next text is an example of summaries from the NTSB (HAR-00-02): About 10:30 a.m. on October 21, 1999, in Schoharie County, New York, a Kinnicutt Bus Company school bus was transporting 44 students, 5 to 9 years old, and 8 adults on an Albany City School No.",
        "18 field trip.",
        "The bus was traveling north on State Route 30A as it approached the intersection with State Route 7, which is about 1.5 miles east of Central Bridge, New York.",
        "Concurrently, an MVF Construction Company dump truck, towing a utility trailer, was traveling west on State Route 7.",
        "The dump truck was occupied by the driver and a passenger.",
        "As the bus approached the intersection, it failed to stop as required and was struck by the dump truck.",
        "Seven bus passengers sustained serious injuries, 28 bus passengers and the truckdriver received minor injuries.",
        "Thirteen bus passengers, the busdriver, and the truck passenger were uninjured.",
        "This text is a good example of the possible content of the NTSB summaries.",
        "It describes a bus driving on State Route 30A and a truck on State Route 7 and their accident in an intersection.",
        "Although the interaction is visually simple, the text is rather difficult to understand because of the profusion of details.",
        "We believe that the conversion of a text to a scene can help understand its information content as it can make it more concrete to a user.",
        "Although we don't claim that a sequence of images can replace a text, we are sure that it can complement it.",
        "And automatic conversion techniques can make this process faster and easier."
      ]
    },
    {
      "heading": "4 The Language Processing Module",
      "text": [
        "The CarSim language processing module uses information extraction techniques to fill a template from the accident narrative.",
        "The information extracted from the text is mapped onto a predefined XML structure that consists of three parts: the static objects, the dynamic objects, and the collision objects.",
        "The static objects are the non-moving objects such as trees, obstacles, and road signs.",
        "The dynamic objects are moving objects, the vehicles.",
        "Examples of dynamic objects are cars and trucks.",
        "The collision object structure describes the interaction between dynamic objects and/or static objects.",
        "We used two available linguistic resources to analyze the texts: the WordNet lexical database (Fellbaum, 1998) and the Link Grammar dependency parser (Sleator and Temperley, 1993).",
        "The strategy to determine the accidents and the actors is to find the collision verbs.",
        "CarSim uses regular expressions to search verb patterns in texts.",
        "Then, CarSim extracts the dependents of the verb.",
        "It evaluates the grammatical function of the word groups, examines words, classifies them using the WordNet hierarchy, and fills the XML template (Akerberg and Svensson, 2002).",
        "Table 1 shows the template corresponding to text HAR-00-02."
      ]
    },
    {
      "heading": "5 The Visualization Module",
      "text": [
        "The visualizer reads its input from the template description.",
        "It synthesizes a symbolic 3D scene and animates the vehicles (Egges et al., 2001).",
        "The scene generation algorithm positions the static objects and plans the vehicle motions.",
        "It uses inference rules to check the consistency of the template description and to estimate the 3D start and end coordinates of the vehicles.",
        "The visualizer uses a planner to generate the vehicle trajectories.",
        "A first stage determines the start"
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work is partly supported by grant number 2002-02380 from the Vinnova Spräkteknologi program."
      ]
    }
  ]
}
