{
  "info": {
    "authors": [
      "Nicola Ueffing",
      "Hermann Ney"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E03-1007",
    "title": "Using POS Information for SMT Into Morphologically Rich Languages",
    "url": "https://aclweb.org/anthology/E03-1007",
    "year": 2003
  },
  "references": [
    "acl-C00-2123",
    "acl-J93-2003",
    "acl-J96-1002",
    "acl-P01-1027",
    "acl-P01-1030",
    "acl-P02-1040",
    "acl-P97-1047",
    "acl-W01-1407",
    "acl-W02-1012",
    "acl-W99-0604"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "When translating from languages with hardly any inflectional morphology like English into morphologically rich languages, the English word forms often do not contain enough information for producing the correct fullform in the target language.",
        "We investigate methods for improving the quality of such translations by making use of part-of-speech information and maximum entropy modeling.",
        "Results for translations from English into Spanish and Catalan are presented on the LC-STAR corpus which consists of spontaneously spoken dialogues in the domain of appointment scheduling and travel planning."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In this paper, we address the question of how part-of-speech (POS) information can help improving the quality of Statistical Machine Translation (SMT).",
        "One of the main problems when translating from a language with hardly any inflectional morphology (which is English in our experiments) into one with richer morphology (here: Spanish and Catalan) is the production of the correct inflected form in the target language.",
        "We introduce transformations to the English string that are based on the part-of-speech information and show how this knowledge source can help SMT.",
        "Systematic evaluations will show that the quality of the generated translations is improved.",
        "The transformations we apply are the following: Treatment of verbs In Catalan and Spanish, the pronoun before a verb is often omitted and instead, the person is expressed via the ending of the verb.",
        "The same holds for future tense and for the modes expressed through 'would' and 'should' in English.",
        "Since this makes it hard to generate the correct translation of a given English verb, we propose a method resulting in English word forms containing sufficient information.",
        "Question inversion In English, interrogative phrases have a word order that is different from declarative sentences: Either an auxiliary 'do' is inserted or the order of verb and pronoun is inverted.",
        "Since this is different in Spanish and Catalan, we modify the word order in English to make it more similar to the Spanish/Catalan one and to help the verb treatment mentioned above.",
        "The paper is organized as follows: Related work is treated in Section 2.",
        "In Section 3, we shortly review the statistical approach to machine translation.",
        "Then, we introduce the transformations that we apply to the less inflected language of the two under consideration (namely English) in Section 4.",
        "After describing the maximum entropy approach and the training procedure we use for the statistical lexicon in Section 5, we present results on the trilingual LC-STAR corpus in Section 6.",
        "Then, we conclude and present ideas about future work in Section 7."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Publications dealing with the integration of linguistic information into the process of statistical machine translation are rather few although this had already been suggested in (Brown et al., 1992).",
        "(NieBen and Ney, 2001b) introduce hierarchical lexicon models including baseform and POS information for translation from German into English.",
        "Information contained in the German entries that are not relevant for the generation of the English translation are omitted.",
        "Unlike this, we investigate methods for enriching English with knowledge to help selecting the correct fullform in a morphologically richer language.",
        "(NieBen and Ney, 2001a) propose reordering operations for the language pair German-English that help SMT by harmonizing word order between source and target.",
        "The question inversion we apply was inspired by this; nevertheless, we do not perform a full morpho-syntactic analysis, but make use only of POS information which can be obtained from freely available tools.",
        "(Garcia-Varea et al., 2001) apply a maximum entropy approach for training the statistical lexicon, but do not take any linguistic information into account.",
        "The use of POS information for improving statistical alignment quality is described in (Toutanova et al., 2002), but no translation results are presented."
      ]
    },
    {
      "heading": "3 Statistical Machine Translation",
      "text": [
        "The goal of machine translation is the translation of an input string s\\,..., s j in the source language into a target language string t\\...., tj.",
        "We choose the string that has maximal probability given the source string, Pr(t[\\s{).",
        "Applying Bayes' decision rule yields the following criterion: Through this decomposition of the probability, we obtain two knowledge sources: the translation and the language model.",
        "Those two can be modelled independently of each other.",
        "The correspondence between the words in the source and the target string is described by alignments that assign target word positions to each source word position.",
        "The probability of a certain target language word to occur in the target string is assumed to depend basically only on the source words aligned to it.",
        "The search is denoted by the arg max operation in Eq.",
        "1, i.e. it explores the space of all possible target language strings and all possible alignments between the source and the target language string to find the one with maximal probability.",
        "The input string can be preprocessed before being passed to the search algorithm.",
        "If necessary, the inverse of these transformations will be applied to the generated output string.",
        "In the work presented here, we restrict ourselves to transforming only one language of the two: the source, which has the less inflected morphology.",
        "For descriptions of SMT systems see for example (Germann et al., 2001; Och et al., 1999; Tillmann and Ney, 2002; Vogel et al., 2000; Wang and Waibel, 1997).",
        "4 Transformations in the Less Inflected Language When translating from English into languages with a highly inflected morphology, the production of the correct fullform often causes problems.",
        "Our experience on several corpora shows that the error rate of a translation from English into morphologically richer languages decreases by 10% relative if we aim at producing only the correct baseform instead of the fully inflected word.",
        "The transfer of the meaning expressed in the baseform is easier than deciding on the correct inflected form.",
        "Especially the translation of verbs is difficult since there are many different inflections in Spanish and Catalan whereas there are only few in English.",
        "Moreover, the pronouns and modals are often omitted in Spanish and Catalan and this information is expressed through the suffix.",
        "This makes it very hard for word-based systems to generate the correct inflection from the English verb which does not contain sufficient information.",
        "Thus, several English words will have to be aligned to the Spanish or Catalan verbs.",
        "This process is relatively difficult for the algorithm and causes noise in the statistical lexicon if English pronouns are regarded as translations of Spanish or Catalan verbs.",
        "In order to enrich the English verb with the needed information, we combine pronouns and/or modals with following verbs and treat those combinations as 'new' fullform words in English.",
        "Thus we can obtain the information needed to select the correct verb form in the target language from one single English word.",
        "The identification of English pronouns, modals and verbs was done by POS tagging applied to the English part of the corpus.",
        "We decided to transform the source language instead of the target language, because in this case we need only the POS tags of the source language as additional knowledge source and nothing else.",
        "Another possible approach would have been to split the suffix in the target language (e.g. 'esta' into 'estar P3S').",
        "This would require postprocessing tools that are able to generate the correct verb form from the baseform and the person and tense information.",
        "Table 1 gives examples of words that have been spliced to form new entries of the English lexicon.",
        "For example, we splice the phrase 'you think' to form the single entry 'you_think' which contains sufficient information for producing the correct Spanish verb form 'crees' or the Catalan 'creus'.",
        "Similarly, the modal auxiliaries can be added as well, like in the entry 'you_will_have' which is much better suited for being translated into 'tendras' (Spanish) or 'tindras' (Catalan) than the verb 'have' alone.",
        "Moreover, in a single word based lexicon, three single entries would have to be added for the translation of 'you will have' into 'tendras': (you,tendras), (will,tendras) and (have,tendras), which spreads the translation probability over far too many entries and makes the probability distribution unfocused.",
        "As the last example in Table 1 shows, 'you can go' is spliced only into two words instead of one in order to better match the Spanish/Catalan form.",
        "In English interrogative phrases, either an auxiliary 'do' is inserted or the order of verb and pronoun is inverted.",
        "The auxiliary 'do' does not carry information that is relevant when translating into Spanish or Catalan.",
        "Thus, we can remove it from the sentence without harming the translation process (as described in (NieBen and Ney, 2001a) for the language pair German-English).",
        "However, we do not remove a question supporting 'do' in past tense, i. e. 'did' is kept in the phrase, because this is the only word containing the tense information.",
        "Afterwards, we can merge the pronoun and verb as depicted in Table 2: 'did you go' is transformed into 'you_did go'.",
        "We do not splice 'you_did' and 'go', because the English simple past is translated into present perfect in Catalan; and it is very likely to be translated into present perfect in Spanish, especially in colloquial language as it is present in this task.",
        "The form 'you.did go' is well suited to be translated into the Spanish 'has ido' or the Catalan 'has anat'.",
        "If there is no question supporting 'do' and the order of pronoun and verb is inverted - see the example 'how are you?'",
        "in Table 3 - we first swap the two words and then perform the splicing step.",
        "This is done in order to avoid having two lexical entries with the same translation: for example, 'you_are' and the interrogative 'are_you' both have the same translation in Spanish or Catalan, respectively.",
        "Table 3 presents examples of transformed English questions.",
        "Comparing them to the Spanish and Catalan reference, we see that it is easier to find a word-to-word mapping for the modified English sentences."
      ]
    },
    {
      "heading": "5 Maximum Entropy Training",
      "text": [
        "If we merge the pronouns/modals and verbs as described above, it might happen that the verb itself (or one of its inflections) has never been seen in training except from its appearance in the new entries in the lexicon which result from the splicing operation.",
        "This makes it impossible to translate the verb itself, because it is then unknown to the system.",
        "The same holds for combinations of pronouns and verbs that are unseen in training, e. g. the training corpus contains the bigram T went', but not the one 'she went'.",
        "In order to overcome this problem, we train our lexicon model using maximum entropy.",
        "• the verb contained in a transformed lexicon entry (e.g. 'go' for 'you_go' or 'you_will_go):",
        "if t contains the verb v 0, otherwise This enables us to translate the verb alone even if it occurs in the training corpus only as a spliced entry.",
        "For an introduction to maximum entropy modeling and training procedures, the reader is referred to the corresponding literature, for instance (Berger et al., 1996) or (Ratnaparkhi, 1997).",
        "We performed the following training steps:",
        "• transform the English (= source language) part of the corpus as described in Sections 4.1 and 4.2 • train the statistical translation system using this modified source language corpus • with the resulting alignment, train the lexicon model using maximum entropy with the features described in Section 5.1",
        "This training can be performed using converging iterative training procedures like described by (Darroch and Ratcliff, 1972) or (Delia Pietra et al., 1997).",
        "The basic training procedures for the translation system and the language model need not be changed.",
        "For translation, we can use an SMT system where the search algorithm does not have to be modified.",
        "Before the translation process, we transform the input in the same way as the training corpus before training the alignment (see Section 5.2).",
        "We simply have to exclude those words from splicing where the splicing operation yields an unknown word.",
        "This training was done using the GIZA++ toolkit which can be downloaded from http://www-i6.informatik.rwth-aachen.",
        "def och/software/GIZ A++.html"
      ]
    },
    {
      "heading": "6 Results",
      "text": [
        "We performed experiments on the trilingual corpus which is successively built within the LC-STAR project.",
        "It comprises the languages English, Spanish and Catalan, whereof we used English as source and Spanish and Catalan as target languages.",
        "At the time of our experiments, we had about 13k sentences per language available; the statistics are given in Table 4.",
        "The corpus consists of transcriptions of spontaneously spoken dialogues.",
        "Thus, the sentences often lack correct syntactic structure.",
        "The domain of this task is appointment scheduling and travel arrangements.",
        "The POS information for the English part of the corpus was generated using the Brill tagger.",
        "As Table 4 shows, the splicing operation increases the cardinality of the English vocabulary as well as the number of singletons significantly.",
        "Nevertheless, they are still below those numbers for Spanish and Catalan.",
        "The quality of the output of our machine translation system is measured automatically by comparing the generated translation to a given reference translation.",
        "The two following criteria are used: The word error rate is based on the Leven-shtein distance.",
        "It is computed as the minimum number of substitution, insertion and deletion operations that have to be performed to convert the generated string into the reference string.",
        "Since some sentences in the develop and test set occur several times with different reference translations (which holds especially for short sentences like 'okay, good-bye'), we calculate the minimal distance to this set of references as proposed in (NieBen et al., 2000).",
        "• BLEU (bilingual evaluation understudy): (Papineni et al., 2002) have proposed a",
        "Although these measures are only approximations, they seem to be sufficient at the present level of performance of machine translation systems.",
        "We compared the two statistical lexica obtained from the baseline system and from the maximum entropy training on the transformed corpus.",
        "For the baseline lexicon, we observed an average of 5.82 Catalan translation candidates per English word and 6.16 Spanish translation candidates.",
        "These numbers are significantly reduced in the lexicon which was trained on the transformed corpus using maximum entropy: there, we have an average of 4.20 for Catalan and 4.46 for Spanish.",
        "Especially for (nominative) English pronouns (which have many verbs as translation candidates in the baseline lexicon), the number of translation candidates was substantially scaled down by a factor around 4.",
        "This shows that our method was successful in producing a more focused lexicon probability distribution.",
        "We performed translation experiments with an implementation of the IBM-4 translation model (Brown et al., 1993).",
        "A description of the system can be found in (Tillmann and Ney, 2002).",
        "Table 5 presents an assessment of translation quality for both the language pairs English-Catalan and English-Spanish.",
        "We see that there is a significant decrease in error rate for the translation into Catalan.",
        "This change is consistent across both error rates, the WER and 100-BLEU.",
        "For translations from English into Spanish, the improvement is less substantial.",
        "A reason for this might be that the Spanish vocabulary contains more entries and the ratio between fullforms and baseforms is higher: 1.57 for Spanish versus 1.53 for Catalan.",
        "This makes it more difficult for the system to choose the correct inflection when generating a Spanish sentence.",
        "We assume that the extension of our approach to other word classes than verbs will yield a quality gain for translations into Spanish.",
        "lated into Catalan.",
        "We see that it is easier for the system to generate the correct verb inflection in Catalan if the verb is enriched with the pronoun.",
        "In the baseline system, it happens that words are inserted - like 'far' as translation of 'will' in the second example which is incorrect.",
        "This can be avoided by the splicing of words.",
        "In the last example, we see that the baseline system generates one word each for the English T prefer' and does not find the correct translation, whereas transformations yield an accurate translation of this expression, because the spliced word contains sufficient information."
      ]
    },
    {
      "heading": "7 Conclusion and Future Work",
      "text": [
        "We presented a method for improving quality of statistical machine translation from English into morphologically richer languages like Spanish and Catalan.",
        "Using POS tags as additional knowledge source, we enrich the English verbs such that they contain more information relevant for selecting the correct inflected form in the target language.",
        "The lexicon model was then trained using the maximum entropy approach, taking the verbs as additional features.",
        "Results were given for translation from English into Spanish and Catalan on the LC-STAR corpus which consists of spontaneously spoken dialogues in the domain of appointment scheduling and travel arrangement.",
        "Our experiments show that translation quality can be significantly increased through the use of our approach: the word error rate on the Catalan development set for example decreased by 2.5% absolute.",
        "We plan to investigate other methods of enriching the English words with information.",
        "It will be interesting to see how other word classes, e. g. nouns, can be handled in order to improve quality of translations into languages with a highly inflected morphology."
      ]
    },
    {
      "heading": "8 Acknowledgements",
      "text": [
        "This work was partly supported by the LC-STAR project by the European Community (1ST project ref.",
        "no.",
        "2001-32216)."
      ]
    }
  ]
}
