{
  "info": {
    "authors": [
      "Jörg Tiedemann"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E03-1026",
    "title": "Combining Clues for Word Alignment",
    "url": "https://aclweb.org/anthology/E03-1026",
    "year": 2003
  },
  "references": [
    "acl-A00-1031",
    "acl-J96-1001",
    "acl-P00-1056",
    "acl-P98-1004",
    "acl-W01-0519",
    "acl-W95-0115",
    "acl-W97-0311"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper, a word alignment approach is presented which is based on a combination of clues.",
        "Word alignment clues indicate associations between words and phrases.",
        "They can be based on features such as frequency, part-of-speech, phrase type, and the actual wordform strings.",
        "Clues can be found by calculating similarity measures or learned from word aligned data.",
        "The clue alignment approach, which is proposed in this paper, makes it possible to combine association clues taking different kinds of linguistic information into account.",
        "It allows a dynamic to-kenization into token units of varying size.",
        "The approach has been applied to an English/Swedish parallel text with promising results."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Parallel corpora carry a huge amount of bilingual lexical information.",
        "Word alignment approaches focus on the automatic identification of translation relations in translated texts.",
        "Alignments are usually represented as a set of links between words and phrases of source and target language segments.",
        "An alignment can be complete, i.e. all items in both segments have been linked to corresponding items in the other language, or incomplete, otherwise.",
        "Alignments may include \"null links\" which can be modeled as links to an \"empty element\".",
        "In word alignment, we have to",
        "• find an appropriate model M for the alignment of source and target language texts (modeling) • estimate parameters of the model M, e.g. from empirical data (parameter estimation) • find the optimal alignment of words and phrases for a given translation according to the model M and its parameters (alignment recovery).",
        "Modeling the relations between lexical units of translated texts is not a trivial task due to the diversity of natural languages.",
        "There are generally two approaches, the estimation approach which is used in, e.g., statistical machine translation, and the association approach which is used in, e.g., automatic extraction of bilingual terminology.",
        "In the estimation approach, alignment parameters are modeled as hidden parameters in a statistical translation model (Och and Ney, 2000).",
        "Association approaches base the alignment on similarity measures and association tests such as Dice scores (Smadja et al., 1996; Tiedemann, 1999), t-scores (Ahrenberg et al., 1998) log-likelihood measures (Tufts and Barbu, 2002), and longest common subsequence ratios (Melamed, 1995).",
        "One of the main difficulties in all alignment strategies is the identification of appropriate units in the source and the target language to be aligned.",
        "This task is hard even for human experts as can be seen in the detailed guidelines which are required for manual alignments (Merkel, 1999; Melamed, 1998).",
        "Many translation relations involve multiword units such as phrasal compounds, idiomatic expressions, and complex terms.",
        "Syntactic shifts can also require the consideration of a context larger than a single word.",
        "Some items are not translated at all.",
        "Splitting source and target language texts into appropriate units for alignment (henceforth: tokenization) is often not possible without considering the translation relations.",
        "In other words, initial tokenization borders may change when the translation relations are investigated.",
        "Human aligners frequently expand token units when aligning sentences manually depending on the context (Ahrenberg et al., 2002).",
        "Previous approaches use either iterative procedures to re-estimate alignment parameters (Smadja et al., 1996; Melamed, 1997; Vogel et al., 2000) or preprocessing steps for the identification of token N-grams (Ahrenberg et al., 1998; Tiedemann, 1999).",
        "In our approach, we combine simple techniques for prior tokenization with dynamic techniques during the alignment phase.",
        "The second problem of traditional word alignment approaches is the fact that parameter estimations are usually based on plain text items only.",
        "Linguistic data, which could be used to identify associations between lexical items are often ignored.",
        "Linguistic tools such as part-of-speech taggers, (shallow) parsers, named-entity recognizers become more and more robust and available for more languages.",
        "Linguistic information including contextual features could be used to improve alignment strategies.",
        "The third problem, alignment recovery, is a search problem.",
        "Using the alignment model and its parameters, we have to find the optimal alignment for a given pair of source and target language segments.",
        "In (Hiemstra, 1998), the author points out that a sentence pair with a maximum of n token units in both sentences has n!",
        "possible alignments in a simple directed alignment model with a fixed tokenization.",
        "Furthermore, a search strategy becomes very complex if we allow dynamic tokenization borders (overlapping N-grams, inclusions), which leads us not only to a larger number of possible combinations but also to the problem of comparing alignments with variable length (number of links).",
        "The clue alignment approach, which we propose here, addresses the three problems which were mentioned above.",
        "The approach allows the combination of association measures for any features of translation units of varying size.",
        "Overlapping units are allowed as well as inclusions.",
        "Association scores are organized in a clue matrix and we present a simple approach for approximating the optimal alignment.",
        "Section 2 describes the clue alignment model and ways of estimating parameters from association scores.",
        "Section 3 introduces the alignment approach which is based on word alignment clues.",
        "Section 4 gives examples of learning clues from previous alignments.",
        "Section 5 summarizes alignment experiments and, finally, section 6 contains conclusions and a discussion."
      ]
    },
    {
      "heading": "2 Word Alignment Clues 2.1 Motivation",
      "text": [
        "The following English/Swedish sentence pair has been taken from the PLUG corpus (Sagvall Hein, 1999): The corridors are jumping with them.",
        "Korridorerna myllrar av dem.",
        "The task for an aligner is now to find all the links between the lexical items in English and the lexical items in Swedish.",
        "The natural way of doing this for a human is to use various kinds of information, clues.",
        "Even without knowing either of the two languages, a human aligner would find a strong similarity between corridors and korridorerna which leads to the conclusion of a possible relation between these two words.",
        "Similarly, a relation could be seen between them and dem.",
        "In a second step, the aligner might use frequency counts of words in both languages and cooccurrence frequencies for some interesting word Of course, the aligner should be aware of the possibilities of false friends especially among short words.",
        "pairs.",
        "The frequency table above gives the aligner an additional clue for an association between corridors and korridorerna and also some ideas about the relation between them and dem but not much about the remaining words.",
        "Finally, the aligner might apply off-the-shelf part-of-speech taggers and shallow syntactic analyzers.",
        "The aligner might look up the descriptions of the English tag set and finds out that NNS is the label for a plural noun, VBP and VBG are labels of verbs in the present tense, IN labels a preposition, and PRP a personal pronoun.",
        "Similarly, (s)he looks for the Swedish tags and finds out that NCUPN@DS describes a definite noun in plural form and nominative case, V@IPAS describes an active verb in the present tense, SPS labels a preposition, and PF@0PO@S describes a definite pronoun object in plural form.",
        "This gives the aligner additional clues about possible links.",
        "(S)he might expect relations between active verbs in the present tense rather than between verbs and nouns.",
        "Finding out that Swedish nouns can bear the feature of definiteness gives the aligner another clue about the translation of the definite article in the English sentence.",
        "Finally, the aligner looks at the output of the shallow parser and gets additional clues for aligning the two sentences.",
        "For example, the two English verbs build a verb phrase (VP) which is most likely to be linked to the only \"verb cluster\" (VC) in the Swedish sentence.",
        "The personal pronoun in the English sentence is used as a noun phrase (NP) similar to the pronoun in the Swedish sentence.",
        "Putting all the clues together, the aligner comes up with the following alignment without actually having to know the two languages: However, looking at the sentence pair again, a second aligner with knowledge of both languages might realize that the verbs myllrar (English: swarm) and jumping do not really correspond to each other in isolation and that the expressions are rather idiomatic in both languages.",
        "Therefore, the second aligner might decide to link the whole expression \"are jumping with\" to the Swedish translation of \"myllrar av\".",
        "This kind of disagreement between human aligners is quite normal and demonstrates quite well the problems which have to be handled by automatic alignment approaches.",
        "Now, we would like to use a similar strategy as described in the previous section for an automatic alignment process.",
        "In our approach, we use the following definitions: Word alignment clue: A word alignment clue Ci(s,t) is a probability which indicates an association between two lexical items s and t in parallel texts.",
        "Lexical item: A lexical item is a set of words with associated features attached to it (word position may be a feature).",
        "A clue is called static if its value is constant for a given pair of features of lexical items, otherwise it is called dynamic.",
        "Furthermore, clues can be declarative, i.e. predefined feature correspondences, or estimated, i.e. from association scores or from training data.",
        "Generally, a clue is defined as a weighted association A between s and t: The value of Wi is used to normalize and weight the association score A,.",
        "Alignment clues can be estimated from association measures given empirical data.",
        "Examples of such measures are given below: the corridors are jumping with them Co-occurrence: Anice(s, t) (the Dice coefficient) String similarity: ALcsR(s,t) = LCSR(s,t) (the longest common subsequence ratio) Other clues can be estimated from word aligned training data: fs and ft are sets of features of s and t, respectively.",
        "They may include features such as part-of-speech, phrase categories, word positions, and/or any other kind of contextual features.",
        "Clues can also be predefined.",
        "For example, machine-readable dictionary can be used as a collection of declarative clues.",
        "Each translation from the dictionary is an alignment clue for the corresponding word pairs.",
        "The likelihood of each translation alternative can be weighted, e.g., by frequency (if available).",
        "So far, word alignment clues are simply sets of weighted association scores.",
        "The key task is to combine available clues in order to find interlingual links.",
        "Clues are defined as probabilities of associations.",
        "In order to combine all indications which are given by single clues C{(s,t) = P(di) we define the overall clue Cau(s,t) for a given pair of lexical items as the disjunction of all indications:",
        "Word alignment clues may refer to any set of words from the source and target language segment according to the definitions in section 2.2.",
        "Therefore, clues can refer to sets of words which overlap with other sets of words to which another clue refers.",
        "Such overlaps and inclusions make it impossible to combine the corresponding clues directly with the formulas which were given in the previous section.",
        "In order to enable clue combinations even for overlapping units, we define the following property of word alignment clues: A clue indicates an association between all its member token pairs.",
        "This property makes it possible to combine alignment clues by distributing the clue indication from complex structures to single word pairs.",
        "In this way, dynamic tokenization can be used for both, source and target language sentences and combined association scores (the total clue value) can be calculated for each pair of single tokens.",
        "Now, sentence pairs can be represented in a two-dimensional matrix with one source language word per row and one target language word per column.",
        "The cells inside the matrix can be filled with the combined clue values for the corresponding word pairs.",
        "Henceforth, this matrix will be referred to as a clue matrix.",
        "Consider the following English/Swedish sentence pair: Then hand baggage is opened.",
        "Sedan oppnas handbagaget.",
        "Assume that the alignment program found the following alignment clues which are based on string similarity and co-occurrence statistics: The alignment clues contain only three multiword units.",
        "However, even these few units cause several overlaps.",
        "For example, the English string \"hand baggage\" from the set of string similarity clues overlaps with the string \"baggage\".",
        "The clue for the pair \"is opened\" and \"sedan oppnas\" overlaps with six other clues.",
        "However, using our definitions of alignment clues, we can easily construct the following clue matrix:",
        "1.",
        "Find the best link in the clue matrix, i.e. find the word-to-word relation with the highest value in the matrix.",
        "Set the corresponding value in the matrix to zero.",
        "2.",
        "Check for overlaps: If the link overlaps with other links from more than one accepted link cluster – > continue with 1.",
        "If the link overlaps with another accepted link but the non-overlapping tokens are not next to each other in the text – > continue with 1.",
        "3.",
        "Add the link to the set of accepted link clusters and continue with 1 until no more links are found (or the best link is below a certain threshold)",
        "The algorithm is very simple and may miss the optimal alignment.",
        "However, it is a very efficient way of extracting links according to their association clues.",
        "Experiments, which are presented further down, show promising results.",
        "The crucial point of the algorithm is the attachment of links to existing link clusters.",
        "The algorithm restricts clusters to pairs of contiguous word sequences in order to reduce the number of malformed phrases in extracted links.",
        "A better way would be to use proper language models to do this job.",
        "Another possibility is to use the syntactic structures from a (shallow) parser as prior knowledge.",
        "A simple modification of the algorithm above would be to accept overlapping links only if they do not cross phrase borders according to the syntactic analysis."
      ]
    },
    {
      "heading": "4 Bootstrapping Clue Alignment",
      "text": [
        "In section 2.2, we pointed out that clues can be estimated from aligned training material.",
        "This allows us to infer new clues from previous links by estimating conditional probabilities.",
        "For this, we assume that previous links are correct and can be used for probability estimations.",
        "This is not true in general.",
        "However, we hope to find additional links with sufficient accuracy from these clues.",
        "In other words, we expect clues, which have been found via \"self-learning\" techniques to increase the recall with an acceptable increase of noise.",
        "Previous links point to the context from which they originated.",
        "Therefore, we can access any pair of features which is available for the context as well as for the linked items themselves.",
        "In this way, clue probabilities can be based on any combination of features of linked items and their context.",
        "A simple example is to use part-of-speech (POS) tags as a feature of lexical items.",
        "Using this feature, we can estimate the probabilities of source language items with certain POS-tags to be linked to target language items with certain other POS-tags.",
        "Consider the following example: An English/Swedish bitext has been aligned with some basic clue patterns using the clue alignment approach.",
        "Now, we assume that pairs of POS labels can give us additional clues about possible links.",
        "A new clue is, e.g., a conditional probability of a sequence of POS labels of linked items given the POS labels of the items they were linked to.",
        "Applying learned clues (such as the POS clue from above) on their own would probably be misleading in many cases.",
        "However, they add valuable information in combination with others.",
        "In our experiments, we applied the following feature patterns for learning clues: POS full: Label sequences as described above.",
        "POS coarse: Label sequences as in POS full but with a reduced tag set for Swedish (done by simply cutting the label after two characters) Phrase: Phrase type labels which have been produced by (shallow) parsers Position: The position of the translations in the target language segment relative to the position of the original in the source language segment.",
        "The following matrix was produced for the sentence pair from section 2.1 using all the learned alignment clues from above.",
        "The numbers in bold refer to the link clusters which would have been extracted using the clue alignment procedure from section 3."
      ]
    },
    {
      "heading": "5 Clue Alignment Experiments 5.1 The Setup",
      "text": [
        "We applied the \"clue aligner\" to one of our parallel corpora from the PLUG project (Sagvail Hein, 1999), a novel by Saul Bellow \"To Jerusalem and back: a personal account\" with about 170,000 words in English and Swedish.",
        "The English portion of the corpus has been tagged automatically with POS tags by the English maximum entropy tagger in the open-source software package Grok (Baldridge, 2002).",
        "The same package was used for shallow parsing of the English sentences.",
        "The Swedish portion was tagged by the Ngram-based TnT-tagger (Brants, 2000) which was trained for Swedish on the SUC corpus (Megyesi, 2001).",
        "Furthermore, we used a rule-based analyzer for syntactic parsing (Megyesi, 2002).",
        "Our basic alignment applies two association clues: the Dice coefficient and the longest common subsequence ratio (LCSR).",
        "Both clues have been weighted uniformly with a value of 0.5.",
        "The threshold for the Dice coefficient has been set to 0.3 and the minimal co-occurrence frequency to 2.",
        "The threshold of LCSR scores has been set to 0.4 and the minimal token length to 3 characters.",
        "We certainly wanted to test the ability of finding phrasal links.",
        "Therefore, both association clues have been calculated for pairs of multi-word units (MWUs).",
        "MWUs may overlap with others or may be included in other MWUs.",
        "We used two different approaches in order to select appropriate MWUs: N-grams: word bigrams and trigrams + simple language filters (stop word lists) to find common phrase borders.",
        "Chunks: phrases which have been marked by a shallow parser for English and a rule-based parser for Swedish.",
        "Both sets of MWUs can also be combined.",
        "'Weights and threshold have been chosen intuitively.",
        "Furthermore, we were interested in the ability of the algorithm of learning new clues from previously aligned links as discussed in 4.",
        "We applied all the clue patterns which where introduced at the end of section 4: POS full, POS coarse, Phrase, Position.",
        "POS clues have been normalized with a weight of 0.5.",
        "Relative position and phrase type labels bear much less information about specific words and phrases than POS tags, therefore, a lower weight of 0.1 was chosen for these two clues.",
        "For the evaluation, we used an existing gold standard which was produced within the PLUG project (Ahrenberg et al., 1999).",
        "The gold standard consists of 500 randomly sampled items which have been aligned manually according to detailed guidelines (Merkel, 1999).",
        "Results are measured using fine-grained metrics for precision and recall (Ahrenberg et al., 2000) and a balanced F-measure.",
        "The following table summarizes the results of some alignment experiments using different sets of clues (all values in %): The values in the table above show a clear improvement, mainly in recall, of the results when additional clues have been applied.",
        "The impact of POS clues follows intuitive expectations.",
        "A smaller tagset makes the clues more general and the recall value is increased while the precision drops significantly.",
        "However, the position clue changed the result beyond all expectations.",
        "Not only did recall go up significantly, even the precision was increased.",
        "This proves that relations between word positions are important in aligning Swedish and English.",
        "Position distance weights (implicitly implemented as a position clue) seem to improve the choice between competing link alternatives.",
        "The effect of similar clues on less related languages is necessary in order to evaluate their general quality.",
        "The impact of the MWU approach was investigated as well.",
        "The following table compares results of the two different approaches as well as the combined approach.",
        "The \"chunk\" approach is best in all categories.",
        "The lower values for precision for the other two approaches could be expected.",
        "However, the low recall value for the combined approach is a surprise."
      ]
    },
    {
      "heading": "6 Conclusions",
      "text": [
        "In this paper, a word alignment approach has been introduced which is based on a combination of association clues.",
        "The algorithm supports a dynamic tokenization of parallel texts which enables the alignment system to combine relations of overlapping pairs of lexical items (words and phrases).",
        "Alignment clues can be estimated from common association criteria such as co-occurrence statistics and string similarity measures.",
        "Clues can also be learned from pre-aligned training data.",
        "It has been demonstrated how self-learning techniques can be used for learning additional alignment clues from previous alignments.",
        "Clues are defined as probabilities which indicate an association between lexical items according to some of their features.",
        "This definition is very flexible as features can represent any kind of information that is available for each item and its context.",
        "An important advantage of the clue alignment algorithm is the possibility of combining association scores.",
        "In this way, any number of clues can be included in the alignment process.",
        "The alignment experiments, which were presented in this paper, demonstrate the combination of two basic clue types (based on co-occurrence and string similarity) with four additional clue types (based on POS labels, chunk labels, and relative word positions) which were learned during the alignment process.",
        "The alignment experiments on a parallel English/Swedish corpus showed significant improvements of the results when additional clues were added to the basic settings."
      ]
    }
  ]
}
