{
  "info": {
    "authors": [
      "James R. Curran",
      "Stephen Clark"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E03-1071",
    "title": "Investigating GIS and Smoothing for Maximum Entropy Taggers",
    "url": "https://aclweb.org/anthology/E03-1071",
    "year": 2003
  },
  "references": [
    "acl-A00-1031",
    "acl-J01-2002",
    "acl-J96-1002",
    "acl-P02-1002",
    "acl-P99-1069",
    "acl-W00-0729",
    "acl-W00-1308",
    "acl-W02-1001",
    "acl-W02-2018",
    "acl-W96-0213"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper investigates two elements of Maximum Entropy tagging: the use of a correction feature in the Generalised Iterative Scaling (gis) estimation algorithm, and techniques for model smoothing.",
        "We show analytically and empirically that the correction feature, assumed to be required for the correctness of gis, is unnecessary.",
        "We also explore the use of a Gaussian prior and a simple cutoff for smoothing.",
        "The experiments are performed with two tagsets: the standard Penn Treebank pos tagset and the larger set of lexical types from Combinatory Categorial Grammar."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The use of maximum entropy (me) models has become popular in Statistical nlp; some example applications include part-of-speech (pos) tagging (Ratnaparkhi, 1996), parsing (Ratnaparkhi, 1999; Johnson et al., 1999) and language modelling (Rosenfeld, 1996).",
        "Many tagging problems have been successfully modelled in the me framework, including pos tagging, with state of the art performance (van Halteren et al., 2001), \"su-pertagging\" (Clark, 2002) and chunking (Koeling, 2000).",
        "Generalised Iterative Scaling (gis) is a very simple algorithm for estimating the parameters of a me model.",
        "The original formulation of gis (Darroch and Ratcliff, 1972) required the sum of the feature values for each event to be constant.",
        "Since this is not the case for many applications, the standard method is to add a \"correction\", or \"slack\", feature to each event.",
        "Improved Iterative Scaling (us) (Berger et al., 1996; Delia Pietra et al., 1997) eliminated the correction feature to improve the convergence rate of the algorithm.",
        "However, the extra book keeping required for iis means that gis is often faster in practice (Malouf, 2002).",
        "This paper shows, by a simple adaptation of Berger's proof for the convergence of iis (Berger, 1997), that gis does not require a correction feature.",
        "We also investigate how the use of a correction feature affects the performance of me taggers.",
        "gis and lis obtain a maximum likelihood estimate (mle) of the parameters, and, like other mle methods, are susceptible to overfitting.",
        "A simple technique used to avoid overfitting is a frequency cutoff, in which only frequently occurring features are included in the model (Ratnaparkhi, 1998) .",
        "However, more sophisticated smoothing techniques exist, such as the use of a Gaussian prior on the parameters of the model (Chen and Rosenfeld, 1999).",
        "This technique has been applied to language modelling (Chen and Rosenfeld, 1999) , text classification (Nigam et al., 1999) and parsing (Johnson et al., 1999), but to our knowledge it has not been compared with the use of a feature cutoff.",
        "We explore the combination of Gaussian smoothing and a simple cutoff for two tagging tasks.",
        "The two taggers used for the experiments are a pos tagger, trained on the wsj Penn Treebank, and a \"supertagger\", which assigns tags from the much larger set of lexical types from Combinatory Categorial Grammar (CCG) (Clark, 2002).",
        "Elimination of the correction feature and use of appropriate smoothing methods result in state of the art performance for both tagging tasks."
      ]
    },
    {
      "heading": "2 Maximum Entropy Models",
      "text": [
        "A conditional ME model, also known as a log-linear model, has the following form: where the functions fi are the features of the model, the At are the parameters, or weights, and Z(x) is a normalisation constant.",
        "This form can be derived by choosing the model with maximum entropy (i.e. the most uniform model) from a set of models that satisfy a certain set of constraints.",
        "The constraints are that the expected value of each feature fi according to the model p is equal to some value Ki (Rosenfeld, 1996): Calculating the expected value according to p requires summing over all contexts x, which is not possible in practice.",
        "Therefore we use the now standard approximation (Rosenfeld, 1996): where p(x) is the relative frequency of context x in the data.",
        "This is convenient because p(x) is zero for all those events not seen in the training data.",
        "Finding the maximum entropy model that satisfies these constraints is a constrained optimisation problem, which can be solved using the method of Lagrange multipliers, and leads to the form in (1) where the A; are the Lagrange multipliers.",
        "A natural choice for K, is the empirical expected value of the feature fi: which leads to the following set of constraints: An alternative motivation for this model is that, starting with the log-linear form in (1) and deriving (conditional) MLEs, we arrive at the same solution as the ME model which satisfies the constraints in (5)."
      ]
    },
    {
      "heading": "3 Generalised Iterative Scaling",
      "text": [
        "GIS is a very simple algorithm for estimating the parameters of a ME model.",
        "The algorithm is as follows, where Epfi is the empirical expected value of fi and Epfi is the expected value according to model p: Set /l[0) equal to some arbitrary value, say: Repeat until convergence: where (t) is the iteration index and the constant C is defined as follows: In practice C is maximised over the (x, y) pairs in the training data, although in theory C can be any constant greater than or equal to the figure in (8).",
        "However, since ^ determines the rate of convergence of the algorithm, it is preferable to keep C as small as possible.",
        "The original formulation of GIS (Darroch and Ratcliff, 1972) required the sum of the feature values for each event to be constant.",
        "Since this is not the case for many applications, the standard method is to add a \"correction\", or \"slack\", feature to each event, defined as follows: For our tagging experiments, the use of a correction feature did not significantly affect the results.",
        "Moreover, we show in the Appendix, by a simple adaptation of Berger's proof for the convergence of us (Berger, 1997), that Gis converges to the maximum likelihood model without a correction feature.",
        "The proof works by introducing a correction feature with fixed weight of 0 into the IIS convergence proof.",
        "This feature does not contribute to the model and can be ignored during weight update.",
        "Introducing this null feature still satisfies Jensen's inequality, which is used to provide a lower bound on the change in likelihood between iterations, and the existing GIS weight update (7) can still be derived analytically.",
        "An advantage of GIS is that it is a very simple algorithm, made even simpler by the removal of the correction feature.",
        "This simplicity means that, although GIS requires more iterations than IIS to reach convergence, in practice it is significantly faster (Malouf, 2002)."
      ]
    },
    {
      "heading": "4 Smoothing Maximum Entropy Models",
      "text": [
        "Several methods have been proposed for smoothing ME models (see Chen and Rosenfeld (1999)).",
        "For taggers, a standard technique is to eliminate low frequency features, based on the assumption that they are unreliable or uninformative (Ratnaparkhi, 1998).",
        "Studies of infrequent features in other domains suggest this assumption may be incorrect (Daelemans et al., 1999).",
        "We test this for ME taggers by replacing the cutoff with the use of a Gaussian prior, a technique which works well for language models (Chen and Rosenfeld, 1999).",
        "When using a Gaussian prior, the objective function is no longer the likelihood, Lp(A), but has the form: Maximising this function is a form of maximum a posteriori estimation, rather than maximum likelihood estimation.",
        "The effect of the prior is to penalise models that have very large positive or negative weights.",
        "This can be thought of as relaxing the constraints in (5), so that the model fits the data 'We note that Goodman (2002) suggests that the correction feature may not be necessary for convergence.",
        "less exactly.",
        "The parameters cr,- are usually collapsed into one parameter which can be set using heldout data.",
        "The new update rule for gis with a Gaussian prior is found by solving the following equation for the A, update values (denoted by £,-), which can easily be derived from (10) by analogy with the proof in the Appendix: This equation does not have an analytic solution for 6j and can be solved using a numerical solver such as Newton-Raphson.",
        "Note that this new update rule is still significantly simpler than that required for lis."
      ]
    },
    {
      "heading": "5 Maximum Entropy Taggers",
      "text": [
        "We reimplemented Ratnaparkhi's publicly available pos tagger Mxpost (Ratnaparkhi, 1996; Ratnaparkhi, 1998) and Clark's ccg supertagger (Clark, 2002) as a starting point for our experiments.",
        "ccg supertagging is more difficult than pos tagging because the set of \"tags\" assigned by the supertagger is much larger (398 in this implementation, compared with 45 pos tags).",
        "The supertagger assigns ccg lexical categories (Steed-man, 2000) which encode subcategorisation information.",
        "Table 1 gives some examples.",
        "The features used by each tagger are binary valued, and pair a tag with various elements of the context; for example: word(x) = the is an example of what Ratnaparkhi calls a contextual predicate.",
        "The contextual predicates used by the two taggers are given in Table 2, where w, is the /th word and t[ is the",
        "transitive verb intransitive verb determiner nominal modifier adverbial modifier fth tag.",
        "We insert a special end of sentence symbol at sentence boundaries so that the features looking forwards and backwards are always defined.",
        "The supertagger uses pos tags as additional features, which Clark (2002) found improved performance significantly, and does not use the morphological features, since the pos tags provide equivalent information.",
        "For the supertagger, tt is the lexical category of the /th word.",
        "The conditional probability of a tag sequence y\\...yn given a sentence w\\...wn is approximated as follows: where x, is the context of the fth word.",
        "The tagger returns the most probable sequence for the sentence.",
        "Following Ratnaparkhi, beam search is used to retain only the 20 most probable sequences during the tagging process; we also use a \"tag dictionary\", so that words appearing 5 or more times in the data can only be assigned those tags previously seen with the word."
      ]
    },
    {
      "heading": "6 pos Tagging Experiments",
      "text": [
        "We develop and test our improved pos tagger (c&c) using the standard parser development methodology on the Penn Treebank wsj corpus.",
        "Table 3 shows the number of sentences and words in the training, development and test datasets.",
        "As well as evaluating the overall accuracy of the taggers (Acc), we also calculate the accuracy on previously unseen words (uword), previously unseen word-tag pairs (Utag) and ambiguous words (Amb), that is, those with more than one tag over the testing, training and development datasets.",
        "Note that the unseen word-tag pairs do not include the previously unseen words.",
        "We first replicated the results of the mxpost tagger.",
        "In doing so, we discovered a number of minor variations from Ratnaparkhi (1998):",
        "• Mxpost adds a default contextual predicate which is true for every context; • mxpost does not use the cutoff values described in Ratnaparkhi (1998).",
        "mxpost uses a cutoff of 1 for the current word feature and 5 for other features.",
        "However, the current word must have appeared at least 5 times with any tag for the current word feature to be included; otherwise the word is considered rare and morphological features are included instead.",
        "The rest of this section considers various combinations of feature cutoffs and Gaussian smoothing.",
        "We report optimal results with respect to the smoothing parameter a, where a = No and N is the number of training instances.",
        "We found that using a « 2 gave the most benefit to our basic tagger, improving performance by about 0.15% on the development set.",
        "This result is shown in the first row of Table 5.",
        "The remainder of Table 5 shows a minimal change in performance when the current word (w) and previous word (pw) cutoffs are varied.",
        "This led us to reduce the cutoffs for all features simultaneously.",
        "Table 6 gives results for cutoff values between 1 and 4.",
        "The best performance (in row 1) is obtained when the cutoffs are eliminated entirely.",
        "Gaussian smoothing has allowed us to retain all of the features extracted from the corpus and reduce overfitting.",
        "To get more information into the model, more features must be extracted, and so we investigated the addition of the current word feature for all words, including the rare ones.",
        "This resulted in a minor improvement, and gave the best performance on the development data: 96.83%.",
        "Table 7 shows the final performance on the test set, using the best configuration on the development data (which we call C&C), compared with mxpost.",
        "The improvement is 0.22% overall (a reduction in error rate of 7.5%) and 1.58% for unknown words (a reduction in error rate of 9.7%).",
        "The obvious cost associated with retaining all the features is the significant increase in model size, which slows down both the training and tagging and requires more memory.",
        "Table 8 shows the difference in the number of contextual predicates and features between the original and final taggers."
      ]
    },
    {
      "heading": "8 pos Tagging Validation",
      "text": [
        "To ensure the robustness of our results, we performed 10-fold cross-validation using the whole of the wsj Penn Treebank.",
        "The 24 sections were split into 10 equal components, with 9 used for training and 1 for testing.",
        "The final result is an average over the 10 different splits, given in Table 9, where cr is the standard deviation of the overall accuracy.",
        "We also performed 10-fold cross-validation using mxpost and TnT, a publicly available Markov model pos tagger (Brants, 2000).",
        "The difference between mxpost and C&C represents a reduction in error rate of 4.3%, and the"
      ]
    },
    {
      "heading": "9 Supertagging Experiments",
      "text": [
        "The lexical categories for the supertagging experiments were extracted from CCGbank, a CCG version of the Penn Treebank (Hockenmaier and Steedman, 2002).",
        "Following Clark (2002), all categories that occurred at least 10 times in the training data were used, resulting in a tagset of 398 categories.",
        "Sections 02-21, section 00, and section 23 were used for training, development and testing, as before.",
        "Our supertagger used the same configuration as our best performing POS tagger, except that the a parameter was again optimised on the development set.",
        "The results on section 00 and section 23 are given in Tables 11 and 12.",
        "C&C outperforms Clark's supertagger by 0.43% on the test set, a reduction in error rate of 4.9%.",
        "Supertagging has the potential to benefit more from Gaussian smoothing than POS tagging because the feature space is sparser by virtue of the much larger tagset.",
        "Gaussian smoothing would also allow us to incorporate rare longer range dependencies as features, without risk of overfitting.",
        "This may further boost supertagger performance."
      ]
    },
    {
      "heading": "10 Conclusion",
      "text": [
        "This paper has demonstrated, both analytically and empirically, that GIS does not require a correction feature.",
        "Eliminating the correction feature simplifies further the already very simple estimation algorithm.",
        "Although GIS is not as fast as some alternatives, such as conjugate gradient and limited memory variable metric methods (Malouf, 2002), our C&C POS tagger takes less than 10 minutes to train, and the space requirements are modest, irrespective of the size of the tagset.",
        "We have also shown that using a Gaussian prior on the parameters of the ME model improves performance over a simple frequency cutoff.",
        "The Gaussian prior effectively relaxes the constraints on the ME model, which allows the model to use low frequency features without overfitting.",
        "Achieving optimal performance with Gaussian smoothing and without cutoffs demonstrates that low frequency features can contribute to good performance."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We would like to thank Joshua Goodman, Miles Osborne, Andrew Smith, Hanna Wallach, Tara Murphy and the anonymous reviewers for their comments on drafts of this paper.",
        "This research is supported by a Commonwealth scholarship and a Sydney University Travelling scholarship to the first author, and EPSRC grant GR/M96889"
      ]
    }
  ]
}
