{
  "info": {
    "authors": [
      "Karel Oliva"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-2104",
    "title": "Syntactic Functions in GPSG",
    "url": "https://aclweb.org/anthology/C88-2104",
    "year": 1988
  },
  "references": [
    "acl-C86-1010"
  ],
  "sections": [
    {
      "text": [
        "Abstract) This paper motivates and proposes adding a. new feature of syntactic function to the feature system of GPSG.",
        "Later , it shows its necessity in number of syntactic constructs, such as passivization, extraposilion, coordination etc.",
        "Put adding such feature is not understood as a mere technicality-, and thus some implications for the explanatory power of the theory are also discussed.",
        "1.",
        "Remarks on the Notation of PP",
        "The notion of Prepositional Phrase has a firm and long standing tradition in the Anglo-Saxon linguistic framework, including GPSG.",
        "The classical Continental tradition, on the other hand., does not use this term for language description in majority of frame-worhe developed and treats prepositions predominantly as markers of nouns.",
        "In this paper, I will adhere to this approach.",
        "The most important reason for doing this is the fact that, on the assumption of existence of PP, it is impossible to generate such sentences as (1) in the GPSG context• free framework.",
        "(1) I went there with John and with Paul, who met each other before.",
        "The point is, that in (1), on the assumption of the existence of PP, we find a PP-coordination, resulting in a PP, rather than an NP one.",
        "Consequently, the relative clause must be sister of this PP rather than of an NP.",
        "Put this is (at least in my opinion) hardly an acceptable solution, both intuitively and formally.",
        "Even an attempt to cope with this nroblem by means of rightward \"Across-thePoamd\" extraposition would not make things better, since such a solution would presume phrases as \"john who met each other\" to be correct English NP's.",
        "I do not wish to pursue this further here, the problem is more thoroughly described in (Oliva,88) from both intuitive and formal viewpoints.",
        "What I really wanted to do was to motivate the decision of avoiding the term PP in this paper (and, possibly, the necessity of omitting it from the GPSG framework altogether), which will be reflected in the notation of rules.",
        "Thus, assuming otherwise the notation familiar from (Gazdar ,Klein ,Pullum and Sag ,85) , the Category PP {[ PFORM Z]} will be reca,sted as NP {[ PREP , which should.",
        "read as \"NP marked with preposition X \".",
        "As a special value of the feature PREP, the value \"nil\" ought to he introduced, with the meaning that there is no preposition marking the NP in question (i.e., the category NP{[PREP nil]} in the new notation is exactly equivalent to the simple NP in the notation of (Gazdar,Klein,Pullum and Sag,85))."
      ]
    },
    {
      "heading": "2. The Syntactic Function Feature",
      "text": [
        "In this paper, I shall try to show some of the problems connected with omitting the traditional notion of (syntactic) function in GPSG, and their possible solutions.",
        "The payoffs of the notion mentioned can he seen e.g. on the classification of adver-bials: each adverbial modifier, whether expressed by an NP {PREP} , by an adverb, by a subordinated clause or otherwise, has its more specific meaning (\"function\") in the sentence.",
        "With specific lexical units, e.g. with the verb \"put\", this is so obvious that a \"semantic\" classification was proposed even in some of the syntactical approaches, cf. (Bresnan and Grimshaw,78), and later transferred into GPSG without change, as can be seen on the presence of the feature LOC and related lexical rule introducing \"put\" (2).",
        "(2) VP > 11[6] ,NP,PP{+LOC}",
        "Further, two more such features, viz.",
        "MANNER and TEMP, were, unfortunately again with no systematic motivation, proposed as \"possible solution\" for some problems of coordination in (Sag,Gazdar,Wasow and Weisler,85).",
        "These features LOC ,MANNER ,TEMP are , of course , nothing else than function markers on adverbial modifiers (of location, of manner, of time).",
        "Now the time has come to introduce these modifiers more systematically; but I add two arguments in favour of such systemization before.",
        "First, the rule (2), explicitly stipulating the complement as PP (or, alternatively , as NP {PREPJ ), does not provide the theory with the power to generate any of (3).",
        "(3)a. I have put my spectacles somewhere, but now I cannot recall where it was.",
        "b.",
        "She put it where I wanted it.",
        "The second argument comes again from coordination; neither under the traditional \"categorial harmony\" nor under the newly proposed theory of (Sag,Gazdar,Wasow and Weisler,85), the contrast in (4) could be explained.",
        "(4) a.",
        "She was killed by her husband and by his mistress.",
        "b.",
        "She was killed by a hammer and by an axe.",
        "c. *She was killed by her husband and by a hammer.",
        "Under the \"functional\" approach , however, we find in (4)a the coordination of agents",
        "(\"deep subjects\"), in (4)b the coordination of instruments; but in (4)c an attempt to coordinate agent and instrument is involved, which makes this string ungrammatical.",
        "Thus, it seems to be advantageous to add one more item to the feature system of GPSG, namely the feature of function (let it be called FUNC, hence) of the phrase in the sentence.",
        "Its values will mark the adverbial modifiers of place (10c), direction (dir), manner (mod), instrument (instr), purpose (pure), es well as other functions of phrases, such as subject (subj), direct object (dobj), indirect object (iobj), predicative (prd), result (eff), agent of passive sentences (ag) etc., as is usual in the Prague Linguistic School.",
        "Further, the example (4) and the related discussion guides us to add FUNC to the set of Head-features.",
        "Next, we shall consider the following triads of examples, all generated by the standard GPSG grammar.",
        "(5) a. Kim gave Sandy the book.",
        "b.",
        "The book was given Sandy (by Kim).",
        "c. Sandy was given the book (by Kim).",
        "(6) a. be considered him a friend.",
        "b. he was considered a friend (by us).",
        "c.*A friend was considered him (by us).",
        "(7) a.",
        "The king made him a duke.",
        "b.",
        "Be was made a duke (by the king).",
        "c.*A duke was made him (by the king).",
        "The ters of V° even in cases these NP's were not (8) applied on rules introducing NP's as sis-problem is clear: the Passive Metarule direct objects, which was not always correct.",
        "(8) Passive Metarule",
        "Similarly, (8) can apply to the ID-rules (9)a ,(10)a introducing \"there\"-constructions and clefts, respectively, yielding (9)b, (10)b, which is again obviously wrong.",
        "V]?",
        "{[AGR DIP{there , [PLUR £]}]1",
        "One more such example can be constructed if we apply the Extraposition Metarule (11) to the rule (12)a and let the Passive Metarule (8) apply to the result, as sketched in (12)a,b,c.",
        "Note that in (12)c, \"it\" serves as a dummy subject, i.e. it is not a personal pronoun which could be replaced by the referred noun as in \"It (=the child) was bothered that Lee was elected.\"..",
        "And even if this were not the case, the presence of the optional NP {[PREP by]) would in any case rule the grammaticality of such sentences out.",
        "Thus, some strings are generated by the standard GPSG grammar that are ungrammatical while, on the other hand, such sentences as (13) cannot be generated by the grammar, sine the verb \"hope\" is introduced by an ID-rule as in (14), where the role of direct object is played by a subordinated clause rather than by an accusative NP, and thus the construction cannot undergo passivization via the Passive Metarule (8).",
        "Similar situation occurs with \"concede\" etc., cf. (15).",
        "(13) That he would sing was hoped by everybody.",
        "(14) VP > H,S{fin} (15) VP H ,00 {[ PREP to]) ) ,E4f",
        "Thus we arrive to the basic insight concerning passivization: that, generally, such verbs may be passivized which subcategorize for direct object, irrespectively to the means by which this direct object is realised Another important point in the passivization process (as viewed in transformational grammars) is that the direct object in active construction becomes the subject in the passive one.",
        "In the GPSG framework, this shift must be.",
        "reflected in the passive counterpart of the active ID-rule, otherwise the grammar will generate (16)b as the passive counterpart of (16)a, while, again, it will not be possible to generate (13), for the FSD11 , assumed in (Gazdar,Klein,Pullum and Sag ,65) and repeated here as (17), will force the [AGR NP{[NFORM norm\")) to be instantiated on the V and thus will rule out the possibility of non-NP subject occurring in 41e sentence'.",
        "(16)a.",
        "Everybody hoped that he would sing.",
        "b.",
        "*He was hoped (by everybody).",
        "(17) FSD1 : {[ V ,+] , [BAR ,o]) > {[AGR NPI[NFORNI norm]}]} To make the transition of (active) direct object to (passive) subject explicit, we first mark all the direct objects in the lexical ID-rules in the metagrammar with the feature-value pair [FUNC dobj] , and, second, augment the Passive Metarule with the requirement that the passive VP agree with the category of active direct object.",
        "Thus we arrive to the shape (18) of Passive Metarule for Direct Objects.",
        "Several remarks concerning (18): first, the \"variable\" X stands for the same category in the whole mearule, and this is also the case with Y.",
        "Second, the bracket pairs \"(\" and \")\" mark off mutually bound optionality when used around the same category - in this rule the case is that of ([AGO X]) and (X), i.e. concerning [AGO X] , either there is [AGO X] in the mother of the pattern rule and then, consequently , X {[FUNC ag]} occurs as the licensing category of optional agent complement in the target rule, or there is no [AGO X] in the pattern rule and.",
        "then just {[FUNC ag]} is the licensing category of the optional agent, all other features left to later instantiation.",
        "This is important to allow for (19)a ,b; note, however, that the verbs in this example are of different subcategorization classes V[2] and V[20] , respectively2.",
        "(19)a. Lee was bothered by Kim.",
        "h. Lee was bothered (that) Kim was elected.",
        "To prevent strings like those in (20) to be generated, we have to introduce FSD (21) which marks all categories containing [T7NC ag] as NPUREP by]} ; if this does not contradict some other principle of feature instantiation (which is not the case with \"bother\" in (19)b, because here the agent is already marked as S by the licensing rule)3.",
        "(20)a- *Lee was bothered Kim.",
        "b.",
        "*Lee was bothered after Kim, (21) FSD:",
        "{[FUNC ag]] >f[N,-F], [ V ,-] , [PREP by]} Further, to prevent (22) to be generated, it is necessary to add FOR (23) to the metagrammar.",
        "This move, however, together with examples (24) and analogs ((24)b will be of particular interest), will lead us to a profound reconsideration of the roles and mutual relations of features COMP/PREP and FUNC.",
        "The matter is that, given the metagrammar in its current shape, (24)b cannot be generated, because FUNC is considered to be a Head feature and thus, in virtue of the Head Feature Convention, [FUNC subj] will be forced on the second subject sentence; but since this will he lacking the [COMP that] specification, it will be marked as unacceptable by (23).",
        "(22)a.",
        "*For us to be elected bothers Sandy.",
        "b.",
        "*Kim was elected bothers Sandy.",
        "(23) FOR: S {[FUNC subj]} >{[COMP that]} (24) a.",
        "That Kim was elected and that Sandy was dismissed bothered Lee.",
        "b.",
        "That Kim was elected and",
        "Sandy was dismissed bothered Lee.",
        "How to solve this problem ?",
        "For inspiration, let us turn to the classical and well--known analogy between verbs with complementizers and nouns with prepositions, shown in (25),(26).",
        "(25)a.",
        "That Sandy was dismissed bothered Lee.",
        "h.*Sandy was dismissed.",
        "bothered Lee.",
        "(26)a. Kim waited for Leslie.",
        "b.",
        "*Kim waited Leslie.",
        "At first glance, there is some discrepancy between (24)b and.",
        "(25)b, in respect to the basic idea of coordination in (Gazdar,Klein, Pullum and Sag,85), namely that each member of a coordinated construction should be able to appear alone in place of the entire coordination structure.",
        "The same case will be, naturally, that of (26)b and (27).",
        "(27) Kim waited for Lee and Leslie.",
        "Of course, the matter is that in (24)b and",
        "(27) the COMP and.",
        "PREP, respectively, belong to the whole coordination, not to its first member solely, and thus extracting the second member to stand alone as shown in (25)b,(26)b is wrong - it is, in fact, not the whole second member being extracted; one its indivisible part gets lost somehow, and thus it is only natural that the resulting string is ungrammatical.",
        "The second observation to be made is by far more important in its scope: from the comparison of examples (25)a vs. (25)b and (26)a vs. (26)b, it is clear that the role of constituent having some function in the sentence can be played only by a fully specified phrase of the appropriate type (i.e. , in (25), the role of (sentential) subject by a sentence containing \"that\"-complement, in (26), the role of (prepositional) object by a noun phrase containing the concerned preposition).",
        "And the same holds also vice versa, i.e. no underspecified phrase can play the role of the constituent having the function in question.",
        "In other words, whenever the complement or preposition is expan.ded in the generation process, the \"rest\" of the phrase must not be any more marked as having the function the \"whole\" phrase has.",
        "This is just what is expressed in the COMP and PREP expansion rules (28)a,b.",
        "a.",
        "S {[FUNC d]} _A MCAT , S {[FUNC [COMP al [COMP b. NP [FUNC .9_4f[SUBCAT , Npl[FUNC"
      ]
    },
    {
      "heading": "[PREP [PREP",
      "text": [
        "Not only that these rules cope correctly with all problems which we mentioned in this respect, but (more importantly) they shed light on the mutual relations-between complementizers or prepositions and syntactic functions: that they are just mirror iMages of each other, which cannot exist separately."
      ]
    },
    {
      "heading": "3. Conclusions",
      "text": [
        "It was shown that a new feature denoting syntactic function of a phrase should probably be added to the feature system of GPSG, which will help make the theory more adequate.",
        "This feature proved to be useful not only in some technicalities, but even in the intuitive and explanatory background of the theory.",
        "The bulk of support material for this new feature was taken from passivization of constructions with direct object in this paper, but similar evidence for the new feature can be drawn also from other types of passivization (of constructions with indirect objects, prepositional complements (\"A doctor was sent for.\")",
        "or adjuncts (\"This bed has been slept in.",
        "\")), as well as from other types of extraposition (cf. the impossibility of generating sentences like \"It was hoped by everybody that he would sing.\"",
        "in the standard GPSG) and yet other sources.",
        "Adding the syntactic function feature to the GPSG (meta)grammar goes in certain aspects in parallel with the independently motivated efforts to eliminate metarules from GPSG altogether and/or to shift their work to lexical redundancy rules , e.g. (Pollard,85), (Kilbury,86).",
        "This fact only confirms the old wisdom that, given some linguistic information, the question of dividing it between grammar and lexicon may be decided rather arbitrarily.",
        "The important point is that the proposals made here do not require such radical changes in the GPSG framework as the \"lexical\" approaches do, i.e., they keep better the basic spirit of the current GPSG (while solving the problems shown at least equally well).",
        "The only points in which a really substantial change occurred in this paper was, first , the structure of PP, and , second , the stipulation that purely morphological characteristics of constituents is insufficient for the description of English syntax.",
        "But I hope that in the light of the data presented these moves appear to be fully justified.",
        "Notes: I am indebted to Eva Haji6ovh, Petr Sgall, Alexandr Rosen and an unknown Coling referee for fruitful comments on the first version of this paper, as well as to Laura Janda for a lot of the English examples.",
        "1) The status and validity of this FED is, however, somewhat unclear: it forces [AGE NP {[NFORM norm]}] to all verbal predicates which are not marked otherwise in the respective ID-rule.",
        "Consequently, such.verbs as \"bother\" must be listed in the lexicon, twice•, each time with different subcategori-' zation class, but in both cases subcategorizing for identical complements (and, hence, there have to be two almost identical lexical rules in the grammar, one for each of the classes).",
        "This, in turn, makes the (otherwise simple and clear) sentence (i) ambiguous, while on the other hand, due to this FSD none of the sentences in (ii),(iii) can be generated.",
        "On closer observation, a lot of verbs can (appropriate pragmatic conditions provided) take a sentential subject: the \"brute force\" method for coping with this fact would be to increase the size of rules and lexical entries , as performed with \"bother\" and analogs in (Gazdar,Klein,Pullum and Sag,85).",
        "More appropriate solution (at least in my opinion) would be to soften the FSD11 to the form (iv), and simultaneously to stipulate that only verbs taking exclusively sentential subject (if they exist) or exclusively nominal subject (e.g. \"believe\",\"hope\") would be marked as such.",
        "Generating (iii), however, requires further replacing the [AGR 5] specification in the mother of the pattern rule in the Extraposition Metarule withru[AGR NP] specification."
      ]
    }
  ]
}
