{
  "info": {
    "authors": [
      "Kei Yoshimoto"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-2159",
    "title": "Identifying Zero Pronouns in Japanese Dialogue",
    "url": "https://aclweb.org/anthology/C88-2159",
    "year": 1988
  },
  "references": [
    "acl-P83-1007",
    "acl-P86-1031",
    "acl-P88-1017"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Japanese dialogue containing zero pronouns is analyzed for the purpose of automatic Japanese-English conversation translation.",
        "Topic-driven Discourse Structure is formalized which identifies mainly non-human zero pronouns as a by-product.",
        "Other zero pronouns are handled using cognitive and sociolinguistic information in honorific, deictic, speech-act and mental predicates.",
        "These are integrated into the model.",
        "1.",
        "Introduction",
        "An approach is proposed to automatically analyze Japanese dialogue containing zero pronouns, the most frequent type of anaphora which corresponds in function to personal pronouns in English.",
        "Zero pronoun is defined as an obligatory case noun phrase that is not expressed in the utterance but can be understood through other utterances in the discourse, context, or out-of-context knowledge.",
        "Gaps identifiable by syntactico-semantic means, such as those in relative clauses and a certain type of subordinate verb phrase, are excluded.",
        "The input discourse is conversation carried out in Japanese by typing at computer terminals, a type of conversation which has been proved to have the fundamental characteristics common to telephone conversation (Arita et al.",
        "1987).",
        "The key idea of the model is topic, something being talked about in the discourse.",
        "This notion derives from the study of theme and rheme by the Prague School (Firbas 1966).",
        "Ia the following, it is discussed that mainly nonhuman zero pronouns can be identified by means of topic, and, to do so, a discourse structure on the basis of recursively appearing topics is formalized.",
        "Other zero pronouns, mainly human ones, are identified using cognitive and sociolinguistic information conveyed by honorific, deictic, and speech-act predicates as to how the omitted cases are related to the speaker or hearer.",
        "The co-occurence restriction between subject and predicate that expresses a mental activity is also utilized.",
        "Finally, the interaction among these different factors in zero pronoun identification is discussed, and a model integrating them is proposed.",
        "This is to constitute a part of a machine translation system being developed at the ATR which deals with Japanese-English telephone and inter-terminal dialogue."
      ]
    },
    {
      "heading": "2. Zero pronoun's role in discourse",
      "text": [
        "An investigation of simulated Japanese inter-terminal dialogues (94 sentences, 2 dialogue sequences) and their English translation has revealed that out of 53 occurrences of personal pronouns in the English translation, 51 correspond to zero pronouns in the original Japanese text.",
        "Though the size of the data is limited, this coincides well with our intuition about Japanese zero anaphora that it performs discourse-grammatical functions including those played by personal pronouns in English (for a discussion to the same effect, see Kameyama 1985).",
        "In the same Japanese dialogue data, out of 15 zero pronouns coreferent with non-human antecedents, 14 refer to one of the current topics in the discourse.",
        "Out of 74 zero pronouns corresponding to the first and second persons, 55 can be identified by means of cognitive and sociolinguistic information in honorific, deictic, speech-act, and mental predicates.",
        "The other 19 examples were either set phrases for identifying the hearer, explaining one's intention, and responding, etc., or cases understandable only in terms of the total context and situation.",
        "Besides an approach based on heuristic rules, the only possible solution to these would be one with planning and/or script.",
        "I will here concentrate on the major portion of zero anaphora cases that are identifiable by topic continuity or predicate information as to honorificity, deixis, speech act, or mental activity.",
        "N.H.",
        "Unlike Italian, Spanish, etc., in Japanese predicates grammatical information such as person, gender and number is not indicated morphologically.",
        "This is one of the reasons we must emphasize pragmatic and discourse-grammatical factors in retrieving information referred to by zero anaphora.",
        "3.",
        "Topic-based identification 3.1.",
        "PSG treatment of topic and zero pronoun",
        "The Japanese topic has the following major characteristics: (i) The topic is marked with a postposition wa and usually, but not always, preposed.",
        "(ii) More than one topic can appear in a simple sentence.",
        "(iii) With a certain type of subordinates, the subordinate predicate is controlled obligatorily by a topicalized matrix subject, but not by an untopicalized one.",
        "(iv) The topic represents what is being talked about in the discourse.",
        "In the following an intrasentential treatment of (i) to (iii), a modified version of Yoshimoto (1987) is explained.",
        "It is based on Head-driven Phrase Structure Grammar (HPSG) by Pollard & Sag (1987) and Japanese Phrase Structure Grammar (JPSG) by Gunji (1987).",
        "Topic is represented as a value in the TOPIC feature that corresponds to the semantics of topicalized NP(s).",
        "The TOPIC is a FOOT feature that derives from the lexical description of wa.",
        "To deal with multi-topic sentences, the value of TOPIC is a stack that enables embedding of topics.",
        "For the type of subordinate whose predicate is controlled by a topicalized matrix subject, the subordinate-head particle (to be more exact, ADV head) is given a feature specification to the effect that the subordinate subject unifies with a topicalized matrix subject, but not with an untopicalized one.",
        "This topic description along with other parts of the",
        "fundamental grammar of Japanese was implemented on a unification-based parser built up by my colleagues Kiyoshi Kogure and Susumu Kato (Maeda et al.",
        "1988).",
        "The anlysis of (1-1-a) is given as (1-1-b).",
        "(1-1-a) Sightseeing tour wa arimasu ka?",
        "sightseeing-tour TOP exist-POL QUEST Is there a sightseeing tour?",
        "N.B.",
        "\"?\" is a prefix for a tag-name representing a token identity of feature structures.",
        "Omitted obligatory case NPs, i.e. those which are specified in the lexical description of the predicate as SUBCAT values but are not found explicitly in the sentence, are represented as values in the SLASH, following HPSG and JPSG.",
        "The analysis result of (1-2-a) is (1-2-b).",
        "(1-2-a) arimasu.",
        "exist-Pol.",
        "There is.",
        "(1-2-b)",
        "Here the SLASH feature represents that in (1-2-a) the subject is a zero anaphora.",
        "Following JPSG, subcatego-rized-for NPs are assigned to the category P (therefore, to be more exact, they are PPs), because all (at least written) Japanese case NPs are followed by postpositions."
      ]
    },
    {
      "heading": "3.2. Topic-driven discourse structure",
      "text": [
        "Based on the intrasentential specification of topicalized sentences given in the previous section, a discourse-level topic structure is formalized, with zero anaphora being identified at the same time.",
        "In (1), the zero pronoun \"0\" in A1_2 coincides with sightseeing tour, a topic in Q1_1.",
        "However, a naive algorithm of finding the most recent topic fails because of the topics' recursive structure: the zero indirect object in Q3-1 refers to the \"higher\" topic sightseeing tour in Qi_i, not the \"lower\" one hiy6 in Q2_1.",
        "(1) Q1.1: Sightseeing tour wa arimasu ka?",
        "Is there a sightseeing tour?",
        "A1.1: Hai, A1_2: arimasu.",
        "Yes, there is.",
        "Q2-1: Hiy6 wa ikura desu ka?",
        "expense TOP how-much COP-POL QUEST How much does it cost?",
        "A2-1: 0 5, 000-en desu.",
        "6000-yen COP-POL (It costs) 5, 000 yen.",
        "43.1: Dewa, 0 sanka o m6sikomimasu.",
        "then participation cum reserve-POL Then I would like to make a reservation for the tour.",
        "TDS, a discourse model with recursively occurring topics which is based on the same unification parser as the intrasentential grammar, identifies zero pronouns as a byproduct of structuring the discourse.",
        "Syntactically, TDS is composed of the following single basic structure:",
        "(2) Co C1 Cn (n 1)",
        "The intrasentential analysis result of each sentence, except a multi-topic one, unifies with a C. Each C has a feature TOP that indicates a discourse-level topic value in distinction from TOPIC, an intrasentential topic feature.",
        "N.B.",
        "A sentence with n topics unifies with an n-time deep vertical tree in which a single C is dominated by another.",
        "The leaf node is a C whose TOP value is a stack with all the topics in the sentence, and each non-terminal node C has a TOP stack containing that of the immediately dominated C minus the first member.",
        "For example, a sentence with three topics ti, t2, t5 (in order of appearance) corresponds to the tree:",
        "In (2), the value of the TOP of each of the Ci, Cn on the right-hand side is a concatenation of its TOPIC value and the TOP value of the left-hand side C. <i TOP> = append(<i TOPIC>, <0 TOP>) ( 1 S i n) N.B.",
        "The rule is stated in an extended version of PATR-II notation.",
        "\"< >\" is used to denote a feature structure path, and \"=\" to denote a token identity relation between two feature structures.",
        "Between the first value of the TOP of Co and that of Ci a whole-part relation holds.",
        "This is stipulated by the knowledge base.",
        "The value of TOP of Ci is set as default to that of <i TOP> =d <i-1 TOP> (2 S. i n)",
        "y \"= d\" it is denoted that whenever the value of the left-hand side feature structure is unspecified, it is set to the one on the right-hand side.",
        "The TOP value of the root C unifies with any feature structure, i.e. it is T. Sentences with a SLASH value are related to TDS by the following Topic Supplementation Principle (TSP).",
        "Topic Supplementation Principle (1st Version) 1.",
        "For a C whose TOP value is a stack <ti, tm> and whose SLASH value is a set {Pi, Pn}, the SEM of each of Pi, Pn, is set to one of t,,E, without the SEM of two Ps being assigned to the same t, if the two are unifiable.",
        "If none of the pairs are unifiable, then the rule does not apply.",
        "The analysis tree of discourse example (1) is shown as Figure 1.",
        "Sentences Qi_j, A1.1, A1_2, and Q3_1 share the common topic sightseeing tour, and Q2-1 and A2_1 share hiy6 (expense).",
        "The latter is a subtopic of the former.",
        "There are two syntactic possibilities for Q3-l's location: it can be either in coordination with A14, and A1_2, or with Q2.1 and A2_1.",
        "Here the former are chosen as its coordinates because the knowledge base presents the information that Q3.a's predicate mOsihomu (reserve) is compatible with sightseeing tour, but not with hiyd (expense).",
        "Note that, while discourse (1) is being analyzed, zero pronouns in A1_2, A2_1, and Q3_1 are also identified.",
        "(The other zero pronoun in Q3.4, i.e. the subject of the sentence, is left unspecified here.",
        "Its identification needs speech act categorization of sentences.)",
        "This topic-based approach is in contrast to Kameyama's .Japanese version (Kameyarna 1985, Kameyama 1986) of focus-based approach to anaphora by Grosz et al.",
        "1983.",
        "In her framework, subjecthood and predicate deixis play the principal role, and the fact that topic provides the most important clue to anaphora identification in actual spoken Japanese discourse is not utilized explicitly.",
        ".3.1 Extension of topic introduction One of the problems with the topic-based approach is that topics referred to by zero pronouns are not always e';plicitly- marked by the topic postposition wa.",
        "Sometimes, the NPs are never found in discourse in strictly the same forms as they are recovered.",
        "To deal with all possible cases, further elaboration in the inter-field domain of semantics, pragmatics, aid discourse grammar is needed.",
        "Here I will limit my attention to cases analyzable by extending the current method.",
        "First, a certain type of series of words whose function is, like wa, to introduce topics into the discourse, such as no hti ga, ni tuite desu ga, no ken desu ga, and no koto desu ga, are handled in the same way as wa both syntactically and discourse-grammatically.",
        "Second, more complicated cases of topic introduction sentence patterns are also treated.",
        "A friend of mine wants to participate in the conference.",
        "(He ...) As illustrated in (3), the sentence pattern <NP ga VEXISTENTIAI, n/no desu ga > is employed to implicitly introduce the NP as a topic into the discourse.",
        "To meet such cases, the lexical description of the topic-introductory ADV head ga is specified so that the SEM value of the subject of the subcategorized-for existential verb unifies with the (implicit) topic of the whole sentence.",
        "4.",
        "Identification by means of predicate information 4.1.",
        "Honorific predicate Japanese has a rich grammatical system of honorifics.",
        "Among them, expressions related to the discussion here are subject-honorific and object-honorific predicates.",
        "Subject-honorific predicate is a form of predicate used to express respect to the person referred to by the subject of the predicate.",
        "Object-honorific predicate is used to express respect to the direct or indirect object of the predicate whose subject-agent is the speaker or his/her in-group member.",
        "In conversation, the omitted subject of subject-honorific predicate is typically the hearer.",
        "And, conversely, the subject of this type of predicate is usually omitted when referring to the hearer, as in (4).",
        "This is evidently in order to avoid the redundancy, in case there is no one else worth paying respect to, of the speaker being explicitly indicated as subject while at the same time the subject identity is virtually limited to the speaker by the predicate's honorific information.",
        "Likewise, the direct or indirect object of object-honorific predicates is typically the hearer and the subject is typically the speaker, and the two NPs are usually omitted when this holds, as in example (5).",
        "Inury0 de keklth desu.",
        "free.",
        "COP all right COP-rot.",
        "If you don't attend the conference, it will be free.",
        "(5) 0 0 tclzitu uketuke de sirytisya o o-watasi simasu.",
        "that day reception LOC proceedings OBJ give-OHJIIONR-POL.",
        "Proceedings will be given to you on the first day of the conference at the reception.",
        "However, Japanese honorific predicate forms do not correspond to grammatical persons as rigidly as the European languages' verb inflection.",
        "The omitted subject of (4) and the omitted indirect object of (5) may be someone else worthy of respect, and the omitted subject of (5) may be the speaker's in-group :member.",
        "A mechanism is needed which identifies the omitted subject of the subject-honorific predicate and the object of the object-honorific predicate with the hearer, and the omitted subject of the object-honorific predicate with the speaker by default, and otherwise (when specific information is given) identifies them with a person explicitly given in the context.",
        "Lexical descriptions of honorific verbs and auxiliaries must meet the condition above.",
        "For example, the lexical description of a subject-honorific auxiliary reru is as follows (the feature specification depends on that for honorifics by Maeda et al.",
        "1988)",
        "N.B.",
        "The feature structure of the verbal stem of the auxiliary is given above.",
        "Conjugational endings are specified separately and are utilized in analyzing the auxiliary, The CTYPE value in the SUBCAT specifies the conjugation type of the subcategorized V, i.e. consonant-stem-type and suru-type (Vs with other conjugation types are subcategorized-for by rareru, an allomorph of reru).",
        "The MODI, is used to impose conditions on the possibility of mutual subcategorization between different kinds of Vs.",
        "In order to meet the unorderedness of Japanese case phrases, the value of the SUBCAT feature is a set (Gunji 1987) instead of an ordered list adopted in the flPSG English grammar (Pollard & Sag 1987).",
        "The set is expressed by a rule reader into its corresponding possible ordered list descriptions.",
        "The semantic value of the subject (?X) is restricted by the PRAG feature (the feature for describing the pragmatic constraint) to be .someone being respected by the speaker.",
        "When it is not filled by the analysis dependent on explicit information, it defaults to the speaker by means of This lexical description is embedded into the total zero pronoun identification mechanism by revising TSP: Topic Supplementation Principle (2nd version)",
        "1.",
        "For a C whose TOP value is a stack <ti, tat> oud whose SLASH value is a set {Pl, Pn}, the SEM of each of P1, Pa is set to one of t,u, without the SEM of two Ps assigned to the same t, if the two are unifiable.",
        "if none of the pairs are unifiable, then the rule does not apply.",
        "2.",
        "Non-specified SEM values of obligatory case NiPs of honorific, deictic, speech-act, and mental predicates aro set to their default values, i.e. to the speaker or the hearer.",
        "Description of other subject-honorific and object-honorific auxiliaries and verbs are likewise given, and their zero pronouns are identified by means of TSP.",
        "N.B.",
        "For object-honorific auxiliaries and verbs, empathy degree is also specified.",
        "See Sections 4.2. and 5.",
        "4.2.",
        "Deictic predicate One of the major features of spoken Japanese discourse is its frequent use of deictic predicates, i.e. forms of predicates which change according to the empathic relation between the persons involved.",
        "The most easily understood examples are go and come in English.",
        "Besides their counterparts iku and hum, Japanese has a trichotomous system of donatory verbs, i.e. yarn (give), /went (give), and morau (receive).",
        "Kureeu is used when the receives' is the speaker or his/her in-group member (e.g. his/her family).",
        "Otherwise yarn is used :to express give.",
        "These forms are also employed as auxiliaries on the same deictic condition when the action expressed by the main verb involves giving or receiving of favor.",
        "They appear frequently in spoken Japanese dialogue as constituents of speech-act-related complex predicates.",
        "For example, (6) 0 0 hotel no tehai wa site harem,.",
        "no desu diet?",
        "hotel (:EN reservation TOP do-REcFAv EXPL-POL QUEST Could you reserve a hotel for me?",
        "As in (6), the subject and indirect object of the auxiliary are typically the hearer and speaker, respectively, and when this is the case, the subject and indirect object are usually omitted.",
        "However, like those in honorific predicates, the omitted subject and indirect object of deictic auxiliaries have no fixed case values.",
        "They may be sonic in-group member of the speaker or somebody other titan the hearer.",
        "For example, the subject (the person(s) th.a reserves) of (6) may be the congress office exclusive of the hearer, and its indirect object (the person that.",
        "receives favor by the reservation) may be the speaker's student.",
        "To deal with default and non-default cases of ottdtted subjects and indirect objects, the SE M values of these NPs in kureru's lexical description are restricted by the empathy values in the PRAG features, and their default values are given by means of \" di% The latter are dealt with hi connection with TSP.",
        "The ether deictic auxiliaries and verbs are similarly eared.."
      ]
    },
    {
      "heading": "4.3. Speech Act",
      "text": [
        "Another important type of information in predicates is specch act.",
        "The type of speech act found to be pervasive in Japanese dialogue is request.",
        "For all the examples in the collected data of request expressions such as NP o o-negai ,/lease (,.",
        ";;Ive me...), V siegasinusu ka?",
        "(can I ask you to.,.?)",
        "vtod 'V tc kadasai (please,...), the omitted subject was the iter mid the omitted indirect object was the hearer.",
        "'lecousit these ZT:TO pronouns can be, depending on situations, other than the first and second persons, the iult treatment adopted so far is needed.",
        "For example, in the feature structure specification of the verb negai (in NP o 0-negai sitnasu), the default value for the subject is set to the spealcer and that for the indirect object to the hearer, n.4.",
        "Mental predicate '.ithe last factor in identifying rem pronouns is the coodition in Japanese grammar that, with the sentence-conjugation iOrm (synsi-kei) of predicates indicating netts] activities such as belief, hope, desire, request, and fcabo•, only the speaker is admitted.",
        "as the referent of the omitted ,uthject, This condition is easily specified in the lexical descriptions of the constituents of the predicates.",
        "Au important related phenomenon is that, even with tmejugation forms whose subject can grammatically be ol.her than the speaker, examples in the collected data that meetioned in Section 2 were with speakers being emitted t,,ubjects with very few exceptions.",
        "For example, all ,;:.",
        ":es in the data of an auxiliary tai (want to), when followed by a complex particle no desu ga for moderating 'mhierative expression, were with speakers being their oubjcas, though the .subject of this form can be .thein'etically other than the speaker.",
        "lc'or such usages of mental predicates, default value treatment like that for honorific and deictic predicates is elfOctive"
      ]
    },
    {
      "heading": "5. Integration of the methods",
      "text": [
        "Let us see how discourse (7) with zero pronouns identifiable by either the topic or the honorific and deictic predicates are analyzed using the integrated model of TSP.",
        "Al: lie, syusyl ni wa Øsn,j o-kosi itadakernasen ga, no premier OBJ2 TOP corne-RECFAV-OBJNONR-POLNEG AOVS 00,10013n message o itadaku hot() ni natte imasu.",
        "message 0115receive-OBJFIONR be-arranged-POL No, unfortunately, the Prime Minister does not come.",
        "However, we will receive a message from him.",
        "Now, the semantic/pragmatic representation corresponding to the second half of A1 with the object-honorific and deictic verb itadaku is:"
      ]
    },
    {
      "heading": "[RESTRS ([[RELN POLITE] [AGEN ?SPEAKER] [OBJE ?HEARER]] [[RELN RESPECT] EAGER ?SPEAKER] [OBJE 7X2]] [[RELN EMPATHY-OEGREE] [MORE 7X1] [LESS 7X2]])]]]]",
      "text": [
        "Lot us see how unspecified values ?X1 and ?X2 are specified (i.e. zero pronouns are identified) while maintaining the appropriateness of the PRAG feature structure.",
        "There are two possibilities for this: (1) ?X1 is identified with the topic syusy6 (Prime Minister) according to the first rule of TSP.",
        "(2) ?X2 is identified with syusyd.",
        "Among these, only (2) can fill both ?X1 and ?X2.",
        "That is, if ?X2 unifies with syusyd and ?X1 with ?SPEAKER (this is further to be set to a global variable *ANSWERER* at the discourse representation level) by the default rule deriving from the lexical description of itadaku (see Sections 4.1 and 4.2).",
        "Here, there is nothing wrong with the PRAG features .",
        "On the other hand, if (1) is chosen and ?X1 is set to syusyd and ?X2 unifies with ?HEARER as default (as is stipulated by the lexical description of itadaku), then the PRAG has as one of its RESTRS members"
      ]
    },
    {
      "heading": "[MORE ?X][LESS ?Y]] A [[RELN EMPATHY-DEGREE][MORE ?Y][LESS ?X]]",
      "text": [
        "Likewise, the zero pronouns \"0MT\" in Qi and \"088J\" of itadakemasen in A1 are identified with the speaker.",
        "The integration of the different approaches are illustrated in Figure 2.",
        "The figure reflects the ordered relation among the three components: what intrasentential syntax cannot disambiguate is handled by the topic structure, and then the rest goes to the predicate information component.",
        "N.B.",
        "Anaphora identification (both zero and explicit anaphora) is made more effectively and widely if a model of objects appearing in the discourse with their linguistically expressed and default PRAG features is formalized.",
        "This was partly done by Maeda et al.",
        "1988 by means of Discourse Representation Theory."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "reference, was proposed on the basis of topic structure.",
        "Information carried by predicates on honorificity, deixis, speech act and mental activities is also utilized in connection with TDS.",
        "The method conforms well with the way zero anaphora actually functions in spoken Japanese discourse.",
        "Of the zero pronouns in the inter-terminal conversation data, 79.8% were cases identifiable by this approach."
      ]
    },
    {
      "heading": "Acknowledgment",
      "text": [
        "I would like to thank Dr. Akira Kurernatu, president of ATR Interpreting Telephony Research Labs, Dr. 'Fernald Aizawa, head of Natural Language Understanding Department, and my other colleagues for their encouragement and thought-provoking discussions."
      ]
    },
    {
      "heading": "Reference",
      "text": [
        "Ai: lie, syusy6 ni wa osEg o-hosi itadakemasen ga, OSBJ Oonj message o itadaku kotoni - ___ intrasentential identification based on : SYNTAX intersentential identification (TDS) based on : TOPIC STRUCTURE based on: PREDICATE INFORMATION ON HONORIFICITY, DEIXIS, etc."
      ]
    },
    {
      "heading": "UNIFICATION-BASED GRAMMAR",
      "text": []
    }
  ]
}
