{
  "info": {
    "authors": [
      "Atsushi Yamada",
      "Toyoaki Nishida",
      "Shuji Doshita"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-2156",
    "title": "Figuring Out Most Plausible Interpretation from Spatial Descriptions",
    "url": "https://aclweb.org/anthology/C88-2156",
    "year": 1988
  },
  "references": [],
  "sections": [
    {
      "text": [
        "phone: 81-75-751-2111 ext.",
        "5396 email: yamada or nishida%doshita.kuis.kyoto-ujunetNapanarelay.cs.net"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "The problem we want to handle in this paper is vagueness.",
        "A notion of space, which we basically have, plays an important part in the faculty of thinking and speech.",
        "In this paper, we concentrate on a particular class of spatial descriptions, namely descriptions about positional relations on a two-dimensional space.",
        "A theoretical device we present in this paper is called the potential model.",
        "The potential model provides a means for accumulating from fragmentary information.",
        "It is possible to derive maximally plausible interpretation from a chunk of information accumulated in the model.",
        "When new information is given, the potential model is modefied so that that new information is taken into account.",
        "As a result, the interpretations with maximal plausibility may change.",
        "A program called sPRINT(SPatial Relation IN-Terpreter) reflecting our theory is in the way of construction."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Natural language description is vague in many ways.",
        "The real world described with natural language has continuous expanse and transition, although the natural language itself is a descrete symbolic system.",
        "Vagueness plays an important role in our communication in that it allows us to transfer partial information.",
        "Suppose a situation in which a boy is looking around for his toy.",
        "Even if we cannot tell exactly where it was if we know it was somewhere around my desk, we can transfer him this partial information by telling that his toy is around my desk.",
        "It would be nice if we can communicate with our robot in the same way.",
        "We also use vague expression in the case of thinking it useless to give more detailed information to the hearer.",
        "A theoretical device we present in this paper for the interpretation of such vague information is called potential model.",
        "The potential model employs both continuous and discontinuous functions to represent spatial relations, so that the probability changes either continuously or discontinously, depending on the nature of a given description.",
        "Currently, we are concentrating on a particular dass of spatial relations, namely positional relations on a two-dimensional space, although the potential model is more general.",
        "We assume objects to be sizeless.",
        "A program called SPRINT (SPatial Relation INTerpreter) reflecting our theory is in the way of construction."
      ]
    },
    {
      "heading": "2 The Potential Model",
      "text": [
        "At the center of potential model is a potential function, which gives a value indicating the cost for accepting the relation to hold among a given set of arguments.",
        "The lower is the value provided by a potential function, the more plausible is the corresponding relation.",
        "We allow the value of potential functions to range from 0 to",
        "-I-oo.",
        "A potential function may give a minimal value for more than one combination of arguments.",
        "Such case may be taken as an existence of ambiguity.",
        "A primitive potential function is defined for each spatial relation.",
        "A potential function for overall situation is constructed by adding primitive potential functions for spatial relations involved.",
        "When a potential function is formulated from a given set of information, the system will seek for a combination of arguments which may minimize the value of potential function.",
        "We use a gradual approximation method to obtain an approximate solution.",
        "Starting from an appropriate combination of arguments, the system changes the current set of values by a small amount proportional to a virtual force obtained by differentiating the potential function.",
        "This process will be repeated until the magnitude of virtual force becomes less than a certain threshold.",
        "Figure 1 illustrates those idea.",
        "Unfortunately, using the gradual approximation may not find a combination which makes a given potential function minimum.",
        "When there are some locally minimal solutions, this method will terminate with a combination appropriately near one of them.",
        "Which minimal solution is chosen depends on the initial set of arguments.",
        "We assume there exists some heuristic which predicts a sufficiently good initial values and the above approximation process works rather as an adjustment than as a means for finding solution."
      ]
    },
    {
      "heading": "2.1 The Spring Model",
      "text": [
        "We use an imaginary, virtual mechanical spring between constrained objects to represent constraint on distance.",
        "If the distance between the two objects is equal to the natural length of the spring, the relative position is most plausible.",
        "The more extended or compressed the spring, the more (virtual) force is required to maintain the position, corresponding to the interpretation being less plausible.",
        "An integration of the force needed either to extend or compress the spring is called an elastic potential.",
        "The spring model, subclass of the potential model, takes an elastic potential as a potential function.",
        "Let the positions of two objects connected by a spring of natural length L and elastic constant K be (x0, yo) and (x1, yi), respectively.",
        "Then the potential is given by the following formula:",
        "See figure 2 for the shape of this function."
      ]
    },
    {
      "heading": "2.2 Inhibited Region and Inhibited Half Plane",
      "text": [
        "Unlike other primitive potential functions introduced so far, inhibited region and half plane pose a discontinuous constraint on the possible region of position.",
        "By inhibited region and half plane we mean a certain, region and half plane is inhibited for an object to enter, respectively.",
        "Inhibited regions and half planes are not global in the sense that each is defined only for some particular object.",
        "Inhibited region is less basic concept because it can be represented by a logical combination of inhibited half plane.",
        "An inhibited half-plane is characterized by its directed boundary line.",
        "A directed boundary line in turn is characterized by the orientation 0 (measured counter-clockwise from the orientation of x-axis) and a location (X, Y) of a point (referred to as a characteristic point) on it.",
        "The inhibited half plane is the right hand side of the directed boundary."
      ]
    },
    {
      "heading": "2.3 Directional Potential",
      "text": [
        "Suppose we want to represent a constraint that an object B is to the direction 0 of another object A (measured counter-clockwise).",
        "Let the position of A and B be (xo, yo) and (xi, yi), respectively.",
        "We use the following potential function to represent the constraint:",
        "When viewed horizontally from A, this function represents a hyperbola.",
        "If this function is cut vertically to the intended direction, this represent a parabola (upside down).",
        "See figure 3 for the shape of this function.",
        "Note that the notion of direction defined here denotes that in everyday life, which is not very rigid.",
        "Since the value of the potential function defined above P jumps from +co to – co if one proceeds for the – 0 direction.",
        "We add inhibited half planes in the – 0 direction, so that it is impossible to put the object in this region."
      ]
    },
    {
      "heading": "3 A Method of Gradual Approximation",
      "text": [
        "A maximally plausible position is obtained by revising a tentative solution repeatedly.",
        "The move A = (Az, Ay) at each step is given as follows: A = (As, Ay) = K .",
        "(aPlax,013100, where K is a positive constant.",
        "This basic move may be complicated by taking inhibited regions into account.",
        "The following subsection explain how it is done."
      ]
    },
    {
      "heading": "3.1 Avoiding to Place Objects within its Inhibited Half Plane",
      "text": [
        "An algorithm for escaping from inhibited half plane is applied when an object is placed within its inhibited half plane.",
        "If such a situation is detected, the algorithm defined below will push the object out of an inhibited half plane in n steps.",
        "At this time, any influences from other constraints are taken into account.",
        "Thus, the move d (dz,dv) of the object at each step is the sum of dy = (dv,dv,,) (a component vertical to the boundary) and dp = (dp„,dp„) (e, component in parallel to the boundary).",
        "Suppose the initial position of an object is (So, yo), then each of which is defined as follows:",
        "where,L, = 1(x0 Y) sin 0 – (yo Y) cos 01 represents the distance from the initial position to the boundary of the inhibited half plane.",
        "Note that the inhibited half plane is characterized by its directed boundary with a characteristic point (X, Y) and the orientation 0. dp.",
        "= C(f. cos 20 + fy sin 0 cos 0) dp, C(f. sin 0 cos° fysin20) where, C is a positive constant, and f = (f„, fv) is a virtual force from other constraints.",
        "Figure",
        "Once an object has been put out of an inhibited half plane, one must want it not to have it re-enter the same inhibited half plane.",
        "However, the gradual approximation algorithm may try to push the object there again.",
        "An algorithm for avoiding to push objects into it watches out for such situation.",
        "If it detects, it will recourse the gradual move.",
        "Suppose an inhibited half plane is characterized by 0 and (X, Y) on the boundary.",
        "Suppose also that the next position suggested by the gradual approximation algorithm is (x, y).",
        "If xsinO – ycos0 – Xsirt0+YcosO>0 then, the next position will be forced into the inhibited half plane.",
        "In such a case, the move is modified and the new destination becomes:",
        "See figure 5."
      ]
    },
    {
      "heading": "3.2 Dependency",
      "text": [
        "It would require a great amount of computa• Clan, if the position of all objects have to be determined at once.",
        "Fortunately, human-human communication is not so nasty as this is the case; natural language sentences contain many cues which help the hearer understand the input.",
        "For example, in normal conversations, the utterance Kyoto University is to the north of Kyoto Station is given in the context in which the speaker has already given the position of Kyoto Station, or s/he can safely assume the hearer knows that fact.",
        "If such a cue is carefully recognized, the amount of computation must be significantly reduced.",
        "Dependency is one such cue.",
        "By dependency we mean a partial order according to which position of objects are determined.",
        "SPRINT is designed so that it can take advantage of it.",
        "Instead of computing everything at once, the spatial reasoner can determine the position of objects one by one.",
        "An object whose position does not depend on any other objects is chosen as the origin of local coordinate.",
        "SPRINT determines the temporary position of objects from the root of the dependency network.",
        "The position of an object will be determined if the position of all of its predecessors is determined.",
        "Figure 6 shows how SPRINT does this.",
        "This algorithm has three problems:",
        "1. the total plausibility may not be maximal.",
        "2. in the worst case, the above may result in contradiction.",
        "3. objects may be underconstrained.",
        "Currently, we compromise with the first problem.",
        "More adequate solution may be to have an adjustment stage after initial configulation of objects are obtained.",
        "The second problem will be addressed in the next subsection.",
        "The third remains as a future problem."
      ]
    },
    {
      "heading": "3.3 Resolving Contradiction",
      "text": [
        "Adding new information may result in inconsistency.",
        "In order to focus an attention to this",
        "problem, let us temporally restrict the spatial coordinate as one-dimensional.",
        "Suppose an object is given a maximally plausible position so.",
        "Suppose also that a new inhibited region (interval I in a one dimensional world) is given as a new constraint.",
        "Then the position of the object is recomputed so as to take this new constraint into account.",
        "If the interval I accidentally involves xo, then the object may be moved out of interval I.",
        "This is the situation in which the object tends to move to the position xo but cannot due to the inhibited half space.",
        "In this case, the parent node in the dependency is tried to move in the reverse direction to resolve this situation.",
        "A situation is worse than the above if the inhibited region (or interval) is too wide to fit in a space.",
        "This problem rises especially when we",
        "GIVEN TEXT: (1) Mt.Hiei is to the north of Kyoto Station.",
        "(2) Kyoto University is to the north of Kyoto Station.",
        "(3) Shugakuin is to the north of Kyoto University.",
        "(4) Shugakuin is to the south of Mt.Hiei."
      ]
    },
    {
      "heading": "BEFORE INTERPRETATION OF (4): AFTER INTERPRETATION OF (4):",
      "text": [
        "take size into account.",
        "Suppose the position of two objects A and B are already given maximally plausible positions xo and xi(xo < xi), respectively.",
        "Suppose now the third object C with width being wider than xi xo is declared to exist between A and B.",
        "This causes a failure because there is no space to place C. The solution to this problem comprises in two stages.",
        "First, the reason of the failure is analyzed.",
        "Then, parents of the current objects are moved gradually so that the inconsistency can be removed.",
        "Figure 7 illustrates how this works."
      ]
    },
    {
      "heading": "4 Related Work",
      "text": [
        "The problem of vagueness has not been studied widely in spatial reasoning[Kui78,Lav77,",
        "Wack by Drew McDermott alid .gong few exceptions.",
        "They ad-of Npatial concept and 1V,g !01, ,e0etickil device called fuzz ,.",
        "; he ,,,rm box denotes a region in lo VOA by possibly exist.",
        "Possi-iityt elt,t:Ct a uniformly positive in a avtld ,,,;cro outside the box.",
        "ui e' .1011dP, tiliff itas a couple of drawbacks.",
        "pc of the region must be rectal', r,11}1 OK rq:k Second, Davis had to have the andaryof box sharp, due to computar 0110!.IC04 in OD S. heir 9.4proms4 has a significant dill\"`4)1 MOdankg various spatial concepts.",
        "For ,;-Tr,mhple,,hc weaning of aroundness is hard to .11,-cfpyermfil settle fuzz box, since it is still hard to draw on enact boundary to distinguish the re-wh;ch iq around something from that that ot."
      ]
    },
    {
      "heading": "AVC, Lading Remarks",
      "text": [
        "of natural language description con-foi,s of hard issues, only a fragment of yvhiObhe been addressed in this paper.",
        "Re-'4g Me language understanding process as iskr, N: 'n0 C 6ion of the described world, we have descriptions only declaring"
      ]
    },
    {
      "heading": "Oil bi Ca60",
      "text": [
        "cq,o1.011e, major problems related to this ,,giimptioned below.",
        "friethod, should be developed 4t-)ftlkfiriiK6e2: actual values of the model.",
        "Currently, we should confess that arc determined rather subjec-liVC MD that sample problems may be 1,1 Wye, we want to apply adap-ro.N.,,, kn..110.1.0K mechanism.",
        "Although the current program is forced to tgore out most plausible configura, tiou from given information, there do ex-isth which things are so undercons.IL:i.ned timt figuring out temporary con-fligumtion is useless or rather harmful.",
        "othc problems are remain un-ev9.",
        "'e,taodel should be extended as that ofpiccti, »',1. have size and shape; initial place.",
        "t ficuristic should be incorporated; etc.",
        "Those seem to be less hoxa.",
        "tit fact, fine irit;;--1 implementation of si'14.11Tr is being extesn,fer."
      ]
    }
  ]
}
