{
  "info": {
    "authors": [
      "Kôiti Hasida"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-1047",
    "title": "A Cognitive Account of Unbounded Dependency",
    "url": "https://aclweb.org/anthology/C88-1047",
    "year": 1988
  },
  "references": [],
  "sections": [
    {
      "text": [
        "A computational approach is employed here to explicate human language faculty.",
        "Some phenomena, involving unbounded dependency are thus provided with cognitive account based on the processing load imposed by relevant syntactic operations.",
        "In particular, a consideration on local structural ambiguity accounts for smemo island effect (the noun-complement cases of Complex NP Constraint) which is currently unexplained by static approaches in traditional theories of syntax.",
        "This exemplifies that some rules of syntax handle local allIbigUi(y, Suggesting insufficiency of traditional approaches to to syntax.",
        "The purpose of the present article is to account for syntactic constraints 011 sonic aspects of .unbounded dependency (10430 hereafter) phenomena, by means of a computational model.",
        "A computational model is described in terms of formal operations on formal structures.",
        "An explanation based on such a model is to ascribe the phenomenon in question to some computational properties of the model; i.e., such properties as computational complexity with regard to both space and time, accessibility to some parts of memory, and so forth.",
        "A major advantage of this sort of computational approach is that it can mention dynamic aspects of phenomena, such as temporal order of processing and structural ambiguity arising dynamically in the course of comprehending or producing utterances.",
        "Linguistics, by contrast, has paid little attention to those aspects awl has limited itself to investigation of characteristics of language which could be talked about in static terms.",
        "To say that 8-structure is derived from I) -structure, for example, does not imply that the former chronologically precedes the latter.",
        "In fact, many linguistic (especially syntactic) phenomena can be understood without referring to ambiguity, processing order, etc.",
        "This is partly why linguistics has seen its successes.",
        "Nevertheless, languages have some properties essentially stemming out of dynamic features of language promising (or maybe of a more general cognitive processor, after Piaget).",
        "Our main concern here is with such dynamic aspects of language.",
        "In what follows, we shall first touch upon seam cognitive viewpoint applied to several types of island phenomena, showing that sonic significant part of linguistic account is reducible to processing terms.",
        "Further shall we go on to demonstrate that a. dynamic approach can elucidate some phenomenon, the noun-complement case of the complex nowt-phrase constraint, which is unhkely to be explicable in static terms of traditional syntactic theories.",
        "Consider the (non-) sentences below, which involve 31) constructions; the subscripts and j indicate coindexations.",
        "( ) [s„ do 1Npyoul lvp [v believe that [;,she loves riL lifr?",
        "(2) nAlhati did you sec the girl [-S, who [vp, ate ci]f (3) *What,: do you wonder who ate ri?",
        "(4) 'Who, do you wonder what; I gave cj to ci?",
        "(5) \"Who; did a story about r, surprise!",
        "you?",
        "The grainfliatical status of these strings is understood without referring to dynamic terms such as temporal processing order, structural ambiguity, etc.",
        "IACt its see how."
      ]
    },
    {
      "heading": "2,1 Coustrairas a botti. Dislocalcd 103c:4;ue-a ix,",
      "text": [
        "''he syntactic operations of English we will pay attention to in the following discussion are what we might call complementation, specification, adjunction, binding, and passing, each of which takes place in a branching local tree.",
        "Collude nictitation is to associate an object with its head.",
        "In (1), for instance, a cornplementation takes place in the local tree constituting of VP, V, and Si; the mother, the head, and the object, respectively.",
        "Specification attaches a specifier to its head; e.g., the subject of a sentence to VP (or to IP in the recent transformational theories /Chomsky 1986/).",
        "A concrete example of complementation is the local tree expanding So in (1), where the specifier is the subject NI'.",
        "Adjunction associatOs an adjunct with its bead; e.g., an adverb with VP, wid a relative clause to NP.",
        "Binding is to bind a dislocated elenient (see next paragraph), associated with a syntactic gap, to its antecedent (e.g., a Wfl--phrase such as 'who' and 'on which day').",
        "hoe instance, the dislocated element associated with `t,: gets bound by 'Whoi' in the top local tree of (I) above.",
        "Passing is to pass a dislocated element between the mother category and some of the daughters.",
        "In the local tree expanding VP in (1), the same dislocated element is passed between the mother (VP) and the complement daughter (Si).",
        "Thus, binding and passing are both operations on dislocated elements.",
        "-By a 'dislocated element', we refer to a token in mental representation which syntactically corresponds to several positions in a sentence; Typically, there are two such positions, the filler and the gap, the former being often called the antecedent of the latter.",
        "For instance, there is a dislocated element corresponding both to `Who,' and to `c,:' in (1).",
        "Different approaches to syntax assume a dislocated element so additionally correspond to different, sets of positions between.",
        "the filler and the gap.",
        "In general, transformational graminars tend to postulate fewer such positions than do phrase-structure graf-11.",
        "nars (PSGs, hereafter, which include, among others, GPSG 'GKPS 1985/ and I-IPSO /Pollard 1984, 1985/) or LFG /Bres-ian 1982/.",
        "Also, these theories assign different status to dislo:ated elements; Transformational grammarians talk about them is if they 'move' through sentence structure, while the others issumes they are simply 'associated with' grammatical cate-;ories, via such means as the SLASH feature.",
        "Such differences among various approaches to syntax, how-wer, is irrelevant to the discussion in the rest of the papaer.",
        "Me shall exploit no hypothesis specific to any of these syntactic .heories, so that our discussion will be neutral across them.",
        "We vill borrow some useful terminology and metaphors from spe-ific grammar theories, but that is only for explanatory ease, and should not be taken to be any commitment to any of such approaches.",
        "The above description of passing, for instance, eads as if a dislocate element were part of grammatical cate-tories, and hence might well remind the reader of PSGs.",
        "This ay no means implies that we should abandon transformational accounts in favor of PSGs.",
        "Although PSGs are neutral with re-3pect to the temporal order of processing, incidentally, we shall sometimes talk about passing as the dislocated element going 'rom the mother to a daughter, reflecting the temporal order of actual sentence processing; cf. transformational grammarians talk about movement as if a dislocated element goes into the apposite direction.",
        "the extent of processing load imposed by a syntactic operation varies from one type of operation to another, and that there is an upperbound on the total processing load for constituting one branching local tree.",
        "On account of this, the reason why passing tend to be blocked under the certain sorts of circumstances would be that it is an expensive operation and thus is hard to perform together with other expensive operations such as adjunction or binding.",
        "The processing load for carrying out various syntactic operations could be further reduced to more fundamental aspects of information processing.",
        "Consider, for instance, why specification and adjunction should be harder than complementation.",
        "The reason seems to be that complementation is lexically licensed and is head-initial (the current discussion is limited to English); i.e., the occurrence of a complement licensed by the lexical entry of its head and thus is predicted from the occurrence of the preceding head.",
        "On the other hand, the occurrence of a specifier or of an adjunct is harder to predict, because the former (though lexically licensed) precedes its head and the latter is not lexically licensed by the head.",
        "Passing and binding of dislocated elements are also considered to be non-lexical operations, though there are a few exceptions involving, for example, so-called tough adjectives, as indicated by the following sentence.",
        "(8) [Which violin]; is [this sonata] [Apeasy to play m on Ed?"
      ]
    },
    {
      "heading": "2.2 Explanation",
      "text": [
        "Now let us resume solving the problem.",
        "The distribution of grammaticality over (1) through (5) is accounted for by assuming the following constraints on the syntactic structure of English.",
        "(6) Passing of a dislocated element is permitted only between the mother and the head (laughter or between the mother and the complement daughter.",
        "(7) Passing of a dislocated element and binding of another cannot take place simultaneously in one local tree.",
        "In (1), every passing obeys this constraint.",
        "For instance, passing the dislocated element bound by 'Whoi' into 81 and passing it into Si are both O.K., because Si is the complement of 'know' and Si is the complement of 'that' (whether you might employ a transformational account or such theories as GPSG, HPSG, and LEG.).",
        "However, (2) violates (6) and (7) First, the dislocated element bound by 'What,' is passed into 52, which is not a complement but an adjunct of `girl'; i.e., a violation of (6) Second, the same dislocated element is passed into VP2 where another dislocated element gets bound by 'who', ending up with a violation of (7).",
        "Similarly in (3) and (4), passing and binding co-occur at the local trees introducing 'who' and 'whati', respectively, violating (7).",
        "(5) is blocked by (7), because of the passing into the subject 'a story about 68'; i.e., the specifier of INFL (in the transformational account) or of VP (in theories like GPSG, etc.",
        ")."
      ]
    },
    {
      "heading": "2.3 Cognitive Aspects of Constraints",
      "text": [
        "The explanations about such phenomena proposed in contemporary linguistic inquiries, especially the accounts in terms of barriers /Chomsky 1986/, are roughly regarded as formalizations of the idea sketched above.",
        "This line of reasoning is in turn attributed to processing terms, when viewed from the standpoint of cognitive science.",
        "The background intuition is that The difference between (4) and (8) is that the binding of the dislocated element carrying index j is lexically licensed in the latter but not in the former.",
        "In (8), the binding in effect occurs at the local tree expanding AP, where this binding is sanctioned by the lexical entry of 'easy'.",
        "This is why (8) is grammatical despite (7); i.e., the lexically licensed binding is not an expensive operation, so that it does not play the same role as ordinary binding would play in regard of (7).",
        "Note that the processing load concerning the examples we have discussed so far is defined within a single sentence structure rather than by taking structural ambiguity into account.",
        "This is why the traditional syntactic approaches are able to capture some of such aspects of language; in principle, properties of a single structure can be characterized in static terms."
      ]
    },
    {
      "heading": "3 Dynamic Account",
      "text": [
        "However, the above static approach cannot by itself explain some UBD phenomena, especially so-called the Complex NP Constraint (originally termed by Ross /Ross 1967/) observed in the examples that follow.",
        "(9) *Who, do you believe [NPI [NI', the claim] {-S3 that [s,she loves q[][?",
        "(10) *What; did you propose a plan [vp to buy Ed?",
        "In (9), 53 is the complement of 'claim'.",
        "Hence the dislocated element bound by 'Whoi' should be permitted to be passed into 53 without violating (6).",
        "Similarly, VP (or CP, in the transformational account) in (10) is regarded as the complement of `plan', so that the dislocated element bound by `Whati' should be able to pass through, (6) and (7) being respected.",
        "Hence the static account in the previous section provides no reason why these examples should be ungrammatical.",
        "It is considered because of essentially the same sort of difficulty that Chomsky /Chomsky 1986/ leaves unexplained this type of island effect."
      ]
    },
    {
      "heading": "3d A Model of Language Processing",
      "text": [
        "Now then let us turn to dynamic aspects of language processing, and consider what kind of syntactic structures a human hearer should have built and tentatively maintains when 'that' in (9) is encountered.",
        "As a basis for this investigation, we adopt the following postulates about human language processing.",
        "(11) a.",
        "When a word is encountered, it is attached to structures previously built, giving rise to new structures.",
        "Even when several possible ways of attachment are mlnowledged, the processing is not postponed, but as many new structures corresponding to those ways o; attachment are made in parallel.",
        "b.",
        "There is a limitation on the size of the memory for storing these structures, and thus it is impossible to retain all the structures potentially sanctioned.",
        "Only structures activated strongly enough can survive the competition for seats in the limited memory.",
        "From (11) plus some minor hypotheses, a general processing model follows, which describes both sentence comprehension and generation.",
        "This model postulates that just after any word a is encountered, every maximal structure of the sentence currently hypothesized in mind should look approximately like the part enclosed within the curve in (12).",
        "Here every branching local tree is assumed to be binary, without loss of generality.",
        "11.1 and S may be identical, and the short-term memory contains the information about 111, 13; (1 < i < d), and A, plus the informatin about the configuration of these categories relative to each other.",
        "Note that, as a whole, enough information is thus retained to control the gram.",
        "maticality of the way the foregoing context fits the rest of the sentence; Those categories are the points on which the currently hypothesized structure has contacts with the still unknown part of the sentence.",
        "Strictly speaking, the picture shown in (12) should be looked upon merely as a first order approximation of the reality.",
        "That is, the part of the sentence structure enclosed in the curve might contain some variable parts, rather than being totally definite.",
        "Suppose, for instance, that a sentence begins with a noun phrase, say 'This man'.",
        "The entire tree structure of this NP should be completed as soon as 'man' is encountered, but its grammatical case would not be uniquely determined yet, because the sentence as a whole might turn out to be something like 'This men, I don't know', rather than 'This man is crazy'; The initial N P is accusative in the former sentence, and nomina-Live in the latter.",
        "In the following discussion, however, we shall merely exploit very rough properties of tile model, so that such an inaccuracy is considered irrelevant.",
        "Readers are referred to Ilasida /llasida 1985/ for how tins model is obtained and what it predicts, which the limited space of the current article fails to accommodate."
      ]
    },
    {
      "heading": "3.2 Explanation",
      "text": [
        "Let us turn back to (9).",
        "According to this model, when 'that' is encountered while (9) is being comprehended, the right-branching structure covering the string from 'Who: through 'claim' has been nearly completed and the most active structure around `that' should look like (13).",
        "Here arise two pieces of indepen",
        "the claim Comp that dent two-way ambiguity, as listed below, concerning how this structure might potentially grow.",
        "(14) a.",
        "'That' is a relative pronoun.",
        "b.",
        "`That' is a conjunction.",
        "(15) a. S3 contains a gap bound by `What;'.",
        "b. S3 does not contain a gap bound by 'What:.",
        "The combination of (14a,b) and (IMO)) gives rise to local structural ambiguity across four hyp of; hoses: (14 ak 5a) , (14 ak.15b), (ltbk15a), and (14bk151)).",
        "Since (16), an instantiation of (l4akl5b), is clearly O.K., what we have to show is that out of these four hypotheses just (14a.k15b) and (14bk151)) enter the grammar to be acquired.",
        "(16) Who; did you tell ci the fact that j he knew ci1",
        "Hence now let us consider why (11ak15a) and (14bkil5a) are rejected.",
        "We pay attention to the behavior of dislocated elements, as we did in the static approach.",
        "Two dislocated elements are relevant to the grammatical status of (9).",
        "The first one, which is bound by 'that', corresponds to the possibility (14a).",
        "Let us refer to tins as a from now on.",
        "The other, the one bound by `What;', is present if (15a) obtains.",
        "We shall call it 3.",
        "The status of (14a&15a) is parallel to (1).",
        "(7) rules out this possibility immediately, because it postulates that the local tree expanding S3 accommodates both the binding of a by 'that' and the passing of 0 into S3.",
        "As for (14b&15a), however, (7) as it is fails to work.",
        "We need some preparation before tackling why (14bkl5a) is rejected.",
        "(7) says that two distinct dislocated elements, one passed and the other bound, cannot simultaneously take part in one local tree.",
        "As mentioned above, the cognitive-scientific motivation for the constraints (6) and (7) is that the mental grammar does not admit a rule whose execution accompanies too severe processing load.",
        "On account of this motivation, (7) is naturally generalized simply by taking off the presupposition that only an operation in one local tree is talked about.",
        "That",
        "is, we hold: (17) The grammar cannot accommodate any rule which manipulates two distinct dislocated elements in two different manners, binding the one and passing the other, at the same time (irrespective of whether or not the two dislocated elements are processed in the same local tree of the same coherent structure of a sentence).",
        "The essential difference between (7) and (17) is that the latter can mention a rule which simultaneously handles several hypothetical structures of the same sentence; i.e., a rule which explicitly deals with a local structural ambiguity.",
        "That is, (17) does, but (7) does not, reject such a rule if it binds a dislocated element in a sentence structure and at the same time passes another dislocated element in another structure, the two structures corresponding to two different hypotheses.",
        "Now let us return to (14b&15a).",
        "(14a&15a) having been ruled out, we are now left with three possibilities: (14a&15b), (14b&15a) and (14b&15b).",
        "The former two give rise to a and )3, respectively, and hence these dislocated elements show up in the multiple structure representing the disjunction of these possibilities; i.e., the structure subsuming in parallel the three structures instantiating those possibilities.",
        "According to the model introduced above, these two dislocated elements are simultaneously manipulated, one bound and the other passed.",
        "That is, the local tree expanding S3 (i.e., the local tree in which the binding of a and passing of )3 are both supposed to take place) is built at the same time in all the three possible lines of processing.",
        "This is understood by comparing (13) with the next state (18).",
        "When you go from (13) to (18), the local tree expanding S3 is completed.",
        "the According to (17), therefore, the rule of syntax in charge of this case must reject the possibility of the existence of either ce or /3; otherwise these two dislocated elements would be manipulated (bound and passed) simultaneously here.",
        "Now note that a is chronologically newer than /3.",
        "What psychologists call the recency effect, consequently, tells us that a (hence (14a&15b)) should survive, defeating and thus rendering (9) ungrammatical.",
        "The account of the ungrammaticality of (10) is the same except that the potential binder, which is the counterpart of `that' in (9), is hidden in 'plan' and thus is not overt here.",
        "This time a is the dislocated element bound by this binder, and the one bound by 'What,'.",
        "Note that this explanation concerns language acquisition by children, rather than language use by adults.",
        "It must concern the acquisition stage; otherwise what we have shown would not be the ungrammaticality of (9) and (10) but merely the difficulty of processing them.",
        "In fact, the above account does apply to language acquisition, because the ambiguity pertaining to (14) and (15) occurs every time a structure like (13) is encountered, so that its disambiguation can be fixated as a part of the grammar of English to be acquired."
      ]
    },
    {
      "heading": "3.3 Rules Handling Local Ambiguity",
      "text": [
        "Further discussion are in order here about the generalized constraint (17) and its role in the above explanation.",
        "First, the above discussion postulates that the grammar rules are sensitive to structural ambiguity such as (14) and (1.5) about (9), in the sense that some rules of syntax work on multiple structures, and thus are in charge of disambiguation.",
        "Here one might worry which types of ambiguity are handled by the grammar, and which are handled metagrammatically.",
        "Not every sort of ambiguity is visible to the grammar, as is demonstrated by the following example, which is grammatical.",
        "(19) Who; did you tell the man [5ithat [solie loves ci]]?",
        "The local ambiguity arising here appears similar to that of (9).",
        "More precisely, a four-way local ambiguity arises at 'that', as a combination of two pieces of independent two-way ambiguity, one concerning whether 'that' is a relative pronoun or a conjunction, and the other whether or not S4 contains a gap bound by 'Whoi', just as in (9)., An outstanding difference between (9) and (19), however, is that the ambiguity in the latter case involves two different hypothetical constituent structures that follow.",
        "(20) [yp[vi tell [NEithe man]] [that 85]] (21) [v-2tell [Np2[Npithe man] k,that S5]]]",
        "To children learning UBD constructions, both of these constituent structures should appear ambiguous about whether or not Ss contains a gap bound by 'Whoi'.",
        "This ambiguity, unlike the one in (9), is considered invisible to the grammar, presumably because of the above difference.",
        "That is, if any single rule were sensitive to this ambiguity, (19) should be rendered ungrammatical for the same reason why (9) is so, because in (19) a dislocated element would be bound by `that' and another dislocated element would be passed into 8,1 simultaneously.",
        "To make sure that the binding and the passing should be simultaneous here, notice that the local tree expanding S5 is completed simultaneously in the two pairs of hypotheses corresponding respectively to (20) and (21).",
        "Hence the binding by 'that' and the passing into Ss must take place simultaneously.",
        "Seemingly the reason why the grammar is not sensitive to this type of local ambiguity is that the four possibilities are not coherent enough, in the sense that they are distributed across the two distinct constituent structures as mentioned above.",
        "It appears that the disambiguation of a local structural ambiguity is acquired as a part of the grammar only if the structures (or hypotheses) constituting that ambiguity are coherent enough with each other.",
        "Comparing (19) with (9) and (10), one might thus posit the following constraint.",
        "(22) A local structural ambiguity is handled within the grammar only if the parallel structures involved therein share the same constituent structure.",
        "As for (9), for instance, besides (13) there could of course be several other structural possibilities, but they are simply irrelevant to the acquisition process discussed above, rather than systematically abandoned like (14a8c15a) and (14bkl5a).",
        "We would then be able to disregard any interaction across distinct constituent structures when considering the competence grammar.",
        "There are at least two more supports to constraint (22).",
        ":First, (22) follows from the following more fundamental constraint.",
        "(23) There is a severe limit on the size of the structure which one rule of syntax can refer to at once.",
        "Alt ambiguity within one constituent structure tends to fall within this limit, because the parallel structures involved therein share roost c)f the storage with each other.",
        "An ambiguity across several constituent structures, however, would more often run out of this limit, since the rate of the shared memory is smaller.",
        "Note that (23) claims, after all, nothing more than the limitation on the complexity of mentally feasible rules.",
        "Another reason for holding (22) is based on how 'stubborn' an ambiguity is.",
        "As mentioned earlier, patterns like (9) and (10) constantly accompany the local ambiguity like (14) plus (15).",
        "In contrast, patterns like (19) are often less ambiguous, as shown in the example below.",
        "(24) Whop did you tell him [g,that she loves cd?",
        "In tins sentence, the possibility of 'that' being a relative pronoun is very implausible, the local ambiguity being greatly reduced; we are left with the ambiguity of whether or not, the dislocated element bound by `Who,' is contained in 8s.",
        "III summary, the ambiguity in (9) and (10) is robust, while that in (19) is fragile.",
        "An ambiguity within a single constituent, structure tends to be robust.",
        "In comparison, an ambiguity encompassing several different constituent structures tends to be fragile, because the relationship (as for which is more plausible than which, etc.)",
        "between those constituent structures varies from case to case, depending on the internal details of the relevant constituents context, and so on.",
        "'The corresponding relation in the former type of ambiguity, on the other hand, is more constant.",
        "Robust ambiguity is visible to the grammar, while fragile one is not; Some rules of syntax handle the former, while the latter is treated roetagrarnmatically."
      ]
    },
    {
      "heading": "3.4 German Case",
      "text": [
        "The following pair of German examples might fall out of our dynamic account on (9) and (10).",
        "(25) Weni glauben Sie, daft er liebt?",
        "(26) *Wen; glauben Sic die Behauptung, da13 er liebt?",
        "(25) and (26) are German counterparts of (1) and (9), respectively.",
        "Note that the direct translation between English and German preserves grammaticality across these pairs of examples.",
        "Since `Beha.uptung' is of the feminine gender rather than neuter, `daft' should not be confused with a relative pronoun, namely 'die' or 'der', whose antecedent is `Behauptung'; The relative pronoun pronounced the same as `d 13' is `das', which is of the neuter gender and the nominative or accusative case.",
        "So it appears that in the case of (26) children learning German should face no ambiguity like (14).",
        "Our current approach, which is essentially based on local ambiguity, hence seems unable to account for the grammatical status of (26).",
        "In reality, however, the above example does not contradict our approach; i.e., constraint (17).",
        "Ambiguity parallel to (14) arises in fact, and therefore the ungrammaticality of (26) is predicted by (17).",
        "'lb children learning IIBID construction of German, (26) accompanies the same sort of local ambiguity as (9) does, because they acquire the rough frameworl«ff UBE) construction before the gender system is properly installed into the morphology of relative pronouns.",
        "According to Mills /Mills 1986/, when children begin to use relative clauses around the age of 3, relative pronouns in the relative constructions they make are either simply ommited or lacking information about the gender (and the case, too).",
        "For example: (27) Desist ein Pfiz *rune in Wald( st. 'that is a mushroom RELPHON in wood is 'That is a mushroom which is in wood.'",
        "This means that at the beginning children cannot distinguish a relative pronoun of a gender from another relative pro noun of a different gender; e.g, between 'die' arid `dolt'.",
        "Mills reports that the use of relative pronouns is equipped with the proper system of inflection only after the age of is reached.",
        "The significance of (25) and (26) is not crystal clear, incidentally, if the nonsentence below is also taken into account.",
        "(28) *Wen glauben Sic, daft er schen wollte?",
        "Who think you that Ile see-INF want-PAST `Who do you think that he wanted to see?'",
        "Thus it might be that the migrant lnaticality of (26) is attributed to that of (28), without regard to (17).",
        "Otherwise die above pair of examples (25) and (26) should provide a further evidence supporting (17)."
      ]
    },
    {
      "heading": "4 Final Remarks",
      "text": [
        "We have accounted for some island conditions by means of computational evaluation of relevant syntactic operations; i.e., the evaluation reflected in constraints such as (6), (7), etc.",
        "These constraints are regarded as captured by the existing linguistic theories.",
        "A generalized constraint (17) applicable to dynamic aspects of language processing, especially local structural ambiguity, has been demonstrated to account for the noun-complement case of the Complex NP Constraint, which seems hard to elucidate in static terms of traditional approaches to syntax.",
        "One important aspect of our approach employed here is the hypothesis that sonic sort of local ambiguity is visible to and thus handled by the grammar.",
        "If this hypothesis finally turns out true, which we have atteuipted to demonstrate, the static approach pursued so far in the linguistic inquiries must be reconsidered.",
        "That is, an explanation on the grammaticality of sentences will have to sometimes take into account several possible structures in parallel.",
        "The explanation of the same sort of island condition by Marcus /Marcus 1980/ is comparable to ours in that it also exploits local ambiguity, postulating, rules handling them.",
        "Since Marcus pays no attention to what kind of ambiguity is visible and what kind is not, however, Isis discussion has nothing to say about the contrast between (9) and (19).",
        "Besides, a radical difference between the two approaches is that Marcus exploits a stipulation called the determinism hypothesis, whereas we employ a more humble working hypothesis of parallel processing plus memory limitation.",
        "A caution would be worthy of noting here.",
        "A success of computational explanation does not necessarily support either innatism la Chomsky, J.",
        "A. Fodor, D. Marr, etc.)",
        "or constructivism (a. la J. Piaget, etc.).",
        "If any part of human intelligence could be understood to be the outcome of a simple optimization for some computation, it should subject to two different interpretations: that this part should be a domain-specific innate endowment because such a simple optimization may well be preprogrammed in the course of evolution, or, contrariwise, that it should be generated after birth by the work of the domain-independent general intelligence because such a simple optimization could be carried out through maturation and internal experiences.",
        "Further scrutiny would thus be simply needed in order to steer our way either to innatist or constructionist disposition.",
        "Along the line of the present argument, perhaps the first point where we could face the choice between these two doctrines is the problem of how much processing load we should ascribe to various syntactic operations.",
        "The evaluation of computational load as we have exploited here should vary across languages, depending on the relative statuses of syntactic operations.",
        "For instance, the situation must be drastically different between dominantly head-initial languages like English and Spanish and head-final languages such as Japanese and Korean (and maybe German, too).",
        "Also open to further scrutiny is whether the variation is explained by the parameter setting approach of transformational theories, or by more general corn putational considerations."
      ]
    }
  ]
}
