{
  "info": {
    "authors": [
      "Jun-Ichi Nakamura",
      "Makoto Nagao"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-2098",
    "title": "Extraction of Semantic Information from an Ordinary English Dictionary and Its Evaluation",
    "url": "https://aclweb.org/anthology/C88-2098",
    "year": 1988
  },
  "references": [
    "acl-C80-1081",
    "acl-J87-3001"
  ],
  "sections": [
    {
      "heading": "Abutanct",
      "text": [
        "The itomatic extraction of seniardic information, es-peciany semantic relationships between words, from an ordinary English dictionary is described.",
        "For the extraction, the :magnetic tape version of LDOCE (Longman Dictionary of Contemporary English, 197a edition) is loaded into a relational database system.",
        "Developed extraction programs analyze a definition stridence in LDOCE with a pattern matching, based algorithm.",
        "Since this algorithm is not perfect, the result of the extraction has been compared with semantic -iiiforittation (semantic markers) which the magnetic tape session of I,DOC• contains.",
        "The result comparison is also discussed for evaluating the, reliability of such automatic extraction.",
        "liTtinlOCIlLii&SOD.. A large dictionary database is an important component of a eat-mad language processing system.",
        "We already know syntactic in-forniatiou which should be and can be stored in a large dictionary database for a practical application such as a machine translation system.",
        "However, we still need more research on semantic information which can be prepared for a large system.",
        "As a first step to construct it large scale semantic dictionary (lexical knowledge base) the authors of this paper have inspected a machine readable ordinary English dictionary ILDOCE, Longman Dictionary of Contemporary English, 1.978 edition [Procter 1987].",
        "Extracting semantic information from an ordinary dictionary is an interesting research topic.",
        "One of the aims of automatic extraction is to produce a thesaurus.",
        ".NoR, for example, proposed the idea of thesaurus production from ['DOGE in [Noel 1982].",
        "Arnsler also showed the result of automatic thesaurus production from a tedmiacal encyclopedia [Amsier 1987].",
        "Boguraev and AI-shawi have studied the utilization of LDOCE for natural language proceing reuearches in general [Alshwai 1987,lloguraey 1987].",
        "In this paper, the automatic extraction of semantic relationships between words front ',DOGE is described.",
        "For the extraction, the magnetic tape version of fiDOCE, is loaded into relational database system.",
        "Developed extraction programs analyze the definition sentence in LDOCE with a pattern matching based algorithm.",
        "Since this algorithm is not perfect, the result of the extraction has been compared with semantic information (semantic markers) which the magnetic tape version of LDOCE contains.",
        "Tim result of comparison is also discussed for evaluating the reliability of such an automatic extraction.",
        "In general, a dictionary consists of a complex data structure: various relationships between words; grammatical information; usage notes, etc.",
        "Therefore, we need a special database management system to handle dictionary data.",
        "For instance, [Nagar> 1980] shows ands a system for retrieving a Japanese dictionary.",
        "In this paper, however, the authors are mainly interested in the definition and the sample sentence parts of LDOCE, instead of complex relations among information m the dictionary.",
        "FO): the sake of efficiency (including tire cost of system dc-velopment) of -liDOCE retrieval, we have decided to tire a conventional relational database management system (IIDBM).",
        "The RDBM which we use is running on the mainframe computer of Kyoto University Data Processing Center (Fujitsu M782, OS/UV.",
        "I'`4 MSP, FACOM AIM/RDB).",
        "for loading the magnetic version of 7DOCE into this 11 E we have extracted the following fields from LDOCE:",
        "1.",
        "Head Word (IIW); 2.",
        "Part-of-Speech (PS); 3.",
        "Definition Number (DN); 4.",
        "Grammar Code (GC); 5.",
        "Box Code (BC); 6.",
        "Definition (DE); and C. Sample Sell-tence (SP).",
        "The Box Code field contains various information such as semantic restrictions, etc, which are explained in section 4.1.",
        "The fields 1 through 5 are almost the same as the original LDOCE data.",
        "(Several special characters are removed or changed into standard characters for simplicity of retrieval.",
        "syllable division mark (•) is removed.",
        "Some of the font control characters are changed into `<' and `>.') The definitions and the sample sentences are separated into a clause or a sentence.",
        "For example, definition 1 of the verb to abandon is: to leave completely and for ever; desert in the original data.",
        "This definition is transformed into two separate clauses in the RDB version:",
        "1. to leave completely and for ever 2. desert.",
        "Since every data in the RIM is represented in a tabular -form, we have made three tables for the 11DB version of LDOCE (LDOCE/IIDB, see table 1 regarding their its record format):",
        "1.",
        "Grammar Code and Box Code Table (LDB.D1).",
        "2.",
        "Definition Table (LDB.D2, see table 2).",
        "3.",
        "Sample Sentence Table (LDB.D3).",
        "3 Extraction of Semantic Information One form of semantic information useful for natural language processing is a thesaurus (or semantic network), which basically describes semantic relations between words.",
        "To automatically produce the thesaurus from LDOCE, two programs have been developed: 1.",
        "Key Verb extraction program.",
        "2.",
        "Key Noun and Function Noun extraction program.",
        "These programs and the result of extraction are discussed in this section."
      ]
    },
    {
      "heading": "3.1 Key Verb Extraction Program",
      "text": [
        "Most of the definitions of verbs in LDOCE are described as: to VERB ... Usually VERB in this pattern expresses a 'key concept' of the defined verb.",
        "Therefore, we c•11 this VERB a Key Verb.",
        "For example, the verbs semantically related to the verb to hit have the following definitions:",
        "e strike: to hit",
        "abandon 3 less or cruel way abandon 4 to give up, esp.",
        "without finishing abandon 0 to give (oneself) up completely to a tea-abandon 0 ing, desire, etc.",
        "abandoned 0 the state when one's feelings and actions are uncontrolled freedom from control given up to a life that is thought to be immoral sae also ABANDON (2,4)",
        "• beat: to hit many times, esp.",
        "with a stick • kick: to hit with the foot • knee: to hit with the knee",
        "From this pattern of definitions, we can draw figure 1 which shows the semantic hierarchy around to hit: to beat, to kick and to knee are specialized verbs of to hit.",
        "To expand this hierarchy, a program to extract the key verbs from a definition is developed.",
        "Table 3 (LDBV.D2) shows some examples of this extraction.",
        "In table 4, the frequency of key verbs is listed.",
        "Most frequently used key verb is to make.",
        "Note that to make and to cause are used to define causative and transitive verbs respectively.",
        "to make (someone, esp.",
        "oneself) have less self-respect make humble to cause to feel uncomfortable or ashamed in the presence of others (of winds, storms, disease, pain, etc.)",
        "to become less strong decrease <lit> to make less <law> to bring to an end (esp.",
        "in the phr.",
        "<abate a nuisance> )",
        "Traversing these relations between defined verb and key verb, a them/trim (network) of verbs has been obtained approximately.",
        "Most of the verbs in this thesaurus make a treelike structure shown in figure 1.",
        "However, several 'loops' are found.",
        "A 'loop' expresses a cyclic definition: to welcome is defined by to greet, and to give!",
        "is defined by to welcome.",
        "In the network, six typical cyclic definitions are: a do:.",
        "do (the verb to do does not have a key verb.)",
        "a change: change, move, come, become o go: go, leave u get: get, receive a stop:: stop, cease e let: let, allow, permit",
        "Note that there are many other cyclic definitions in the network.",
        "However, most of them have a link to another verb; at least one of the verb in a cyclic definitions is defined by another verb.",
        "Mire no reader of LDOCE can understand the meaning of these verbs only from the dictionary, these may be a kind of bug of the dictionary.",
        "However, these cyclically defined verbs seem to correspond to semantic primitives, which are first introduced to Al works by [Schank 1975].",
        "Semantic primitives_may be defined outside of linguistic words.",
        "Details of the result of extraction are discussed in [Nakainura.",
        "1986]."
      ]
    },
    {
      "heading": "302 Key Noun and Function Noun Extraction Program",
      "text": [
        "We can apply a similar algorithm to definitions of nouns, although the pattern of definitions of nouns is more complex than that of verbs.",
        "Inspecting definitions with LDOCE/RDB, most of them are classified into two forms:",
        "1.",
        "{determiner) {adjective}* Key Noun (adjective phrase}* 2.",
        "{determiner) {adjective)* Function Noun of Key Noun {adjective phrase}*",
        "The first one is a simple form and many of them express is-a relations between a defined noun and a key noun.",
        "For example, abandon: the stale when one's feelings and actions axe uncontrolled shows that abandon is-a siate.",
        "The second form expresses more complex semantic relations between nouns.",
        "abbey: the group of people living in such a building shows that abbey is-a-group-of people.",
        "A function noun, therefore, explicitly expresses the semantic relation between a head word and a key noun.",
        "With terms of a semantic network, defined nouns and key nouns are nodes in a semantic network, and function nouns (when function noun is empty, its function noun is regared an; kind) express the name of a link between nodes.",
        "The following nouns (41 nouns, in total) arc considered to be function nouns, which are manually extracted.",
        "a is-a: kind, type, ... a part-of: part, side, top, ... o member-ship: set, member, group, class, family, ... o action: act, way, action, ... o state: state, condition, ... o amount: amount, sum, measure, ... a degree: degree, quality, ... o form: form, shape, ...",
        "A program to extract key nouns and function nouns from the definitions of nouns is developed.",
        "Table 5 shows a part of the key noun and function noun table in the LDOCE/RDI-1 (LDBN.D2) generated by this program.",
        "As shown in table 6, the key noun of highest frequency is person (2174 times) and for function noun is type (1064 times) except null function noun (pattern 1).",
        "Traversing is-a relation, for example, a thesaurus has been obtained [Nakamura 1987].",
        "Table 7 shows a part of the automatically obtained thesaurus, whose 'root' word is person: actor is a-kind-of person; comedian, erica, ham, and mime are a-kind-of actor; comedienne is a-kind-of comedian."
      ]
    },
    {
      "heading": "4 Comparison between Result of Extraction and BOX Code",
      "text": [
        "The thesaurus produced from LDOCE by the key noun and key verb extraction programs is an approximate one, and, obviously, contains several errors.",
        "The key noun of abbreviation 1, for example, is shorter in table 5, because the current program ignores ing-formed words.",
        "However, it should he making.",
        "(Even if we changed the extraction algorithm, still we have a problem that making is not a simple noun, but a gerund.",
        "We need to define noun-verb semantic relations.)",
        "To evaluate the quality of the produced thesaurus, the noun part of the thesaurus has been compared with the semantic markers in LDOCE.",
        "11W DN person 0 account ant CPA 0 ace 2 actor 2 comedian 1 comedienne 0 extra 2 sundry 0 ham 3 mime 3",
        "a large church or house that was once such a building the act of making shorter a shortened form of a word, often one used in writing DF a person whose job is to keep and examine the money accounts of businesses certified public accountant infml a person of the highest class or skill in something a person who takes part in something that happens an actor who a tells jokes or does amusing things to make people laugh a female comedian (1) an actor in a cinema film who has a very small part in a crowd scene and is",
        "an actor whose acting is unnatural, esp.",
        "with improbable movements and expr an actor who performs without using words The magnetic version of LDOCE has a speciel field related to semantic markers, which is called as BOX code fields, nithengli it does not appear in the printed version of I.DOCE.",
        "Some of the BOX code field (called BOX1, for instance) express semantic restrictions for a noun governed by a verb or an adjective, sod a semantic classification of a noun.",
        "For example, the semantic restriction for a subject of the verb to travel is marked IlurnaW; the noun person is classified us `H.' This shows that to travel may govern the noun person in its subject pc)::,60:.1 The LDOCE uses 34 markers for expressing this restriction le 8).",
        "These semantic markers have a hierarchy as shown iii Sir; ure 2.",
        "For example, 'Human', 'Plane, and `Aiiimar are sub-classifications of 'animate (Q).' In the following part of this section, the comparison between semantic markers of LDOCE and the thesaurus constructed frath the definitions of nouns in LDOCE is discussed from the vic✓",
        "Nonai ) (animate) and V (plant animal) /Ed!",
        ": kicrcarchy.",
        "Especially the nous related to 'Animate', , `ebs•act' 0:,:: 4„:Y-): suss g; no.afRoAd nu 'Animate' Nouns related to the concept animate have a relatively simple of octane in the thesaurus, Rf; animate is often used as an example of thesaurus-.like system.",
        "Fasaanplui of the words marked as naiinete (Q)' and related nouns, especially marked as 'plant + reirrt :l (V)', are ShOWill in table 9.",
        "')'he prodsced thesaurus contains more than 60% of the words lfiatted.",
        "as A-titple concepts, such as 'plant' (table 10), 'animal', and loarrien (person eat definitions)', in correct positions.",
        "As shown in table 10, for example, 645 words are traversed from 'fable 10: Nouns Related to (Living) Thing and Plant (living) thing plant (P)",
        "pleat in the produced thesaurus; 370 words (62.4%) of these words are marked tts 'Plant.' However, the produced thesaurus does not capture disjunctive coacaph such as 'animal or plant (V)' correctly.",
        "In the definition of crossbna (table 0), the produced thesaurus only uses plant es a key noun, and ingores animal.",
        "This is a typical problem in the current produced thesaurus.",
        "Note that the distinction between 'animate (Q)' and 'animal or plant (VY (animate without human) seems to be difficult for the lexicogiAphers: breed is marked as Q; crossbreed, however, is :marked as V, for eemrnsple.",
        "lIoni larked m \"absl'imct' tea LDOCE, many nouns (about 40%, table 8) am marked as 'absIkaet', and they are not classified into more detailed sub-ekt:18M Ora time other hand, function nouns work as a key for .--claeeihcntiortOm in the produced thesaurus.",
        "in section 3.2, some of the function nouns are listed as action, state, amount and degree.",
        "These function nouns classify abstract nouns.",
        "For example, there are 597 nouns whose function noun is act, and 584 nouns (97%) of them are marked as `abstract; there are 398 nouns whose function noun is stale, and 391 nouns (98%) of them are `abstract.' The distinction between 'state' arid 'act', for instance, is useful for natural language processing in general."
      ]
    },
    {
      "heading": "4A Nouns Marked as 'Inanimate'",
      "text": [
        "Some 'Inanimate' nouns are correctly identified in the produced thesaurus (table 11).",
        "Especially, 39% of nouns under the noun liquid have 'Liquid' markers, and 56% of nouns under the noun gas have 'Gas' markers.",
        "However, many 'Inanimate' nouns are defined by substance in LDOCE.",
        "Sub-classification of these noun is expressed with a compound word (or an adjective) as shown in table 11: coke is a solid substance; fluorine is a non-metallic substance.",
        "Since the currect extraction program does not handle a compound word, the thesaurus cannot express these classification."
      ]
    },
    {
      "heading": "4.5 Other Typical Nouns",
      "text": [
        "Several typical nouns in the produced thesaurus are also compared with markers of LDOCE.",
        "Because the current system cannot distinguish senses of nouns, nouns which have several different senses causes a problem.",
        "A typical example is found in the definitions whose key noun is case.",
        "As shown in table 12, attache case arid lest case are both defined by case; these expresses completely different concept.",
        "In 30 nouns whose key noun is case, KN DF inirn aI a kind or class of in;inai(oi plant).-en,.",
        "developed under the influence of mail lemma a. person, riniund,orplaut of much leas Dian the LABIllal size plant an animal or flund which is a ink-tare of breeds life the very smell forms of phut and an-ixaol life that live in water :wheal a male exam' or animal animal a female person or animal mother the Whet 91./mot/ter of a person",
        "DP a gas that is a simple substance (ELEMENT), without colour or smell, that is lighter than air and that burns very easily the most common liquid, without colour, taste, or smell, which falls from the sky as rain, forms rivers, lakes, and seas, and is drunk by people and animals the solid substance that remains after gas has been removed from coal by heating",
        "16 nouns are 'movable (J)', and 14 nouns are `absTract.' Difficulity of semantic marking is also found.",
        "For example, lexicographers could not mark 'movable (J)' and 'Solid' systematically.",
        "For example, some nouns whose key noun is cloth are marked as 'Solid', and others are marked as 'movable (J)' (table 13).",
        "This is a problem in gathering of semantic information itself."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "The extraction of semantic relations between verbs and nouns from LDOCE is discussed.",
        "Data from the magnetic version of LDOCE is first loaded into a relational database system for simplicity of retrieving.",
        "For the extraction of semantic relations, programs to find key verb, key noun, and function noun have been developed.",
        "Using these programs, the thesaurus is automatically produced.",
        "To evaluate the quality of the noun part of the produced thesaurus, it is compared with the semantic markers in.",
        "LDOCE.",
        "Although the produced thesaurus has several problems such as the difficulty of expressing disjunctive concepts, the comparison between the produced thesaurus and semantic markers in LDOCE shows the possibility of sub-classification of 'abstract' nouns."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "The authors grateful to Prof. Jun-ichi Tsujii for his fruitful comments on this work.",
        "We also wish to thank Mr. Motohiro Fuji-gaki, Mr. Nobuhiro Kato, and Mr. Keiichi Sakai who inspected LDOCE data carefully."
      ]
    }
  ]
}
