{
  "info": {
    "authors": [
      "Igor A. Bolshakov"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-1014",
    "title": "Co-Ordinative Ellipsis in Russian Texts: Problems of Description and Restoration",
    "url": "https://aclweb.org/anthology/C88-1014",
    "year": 1988
  },
  "references": [],
  "sections": [
    {
      "heading": "00-ORMRATIVE ELLIPSIS IN RUSSIAN TEXTS: PROBLEMS OF DESCRIPTION AND RESTORATION Igor A.BOLSNAKOV",
      "text": [
        "ViNITI, Academy of Sciences of USSR Moscow, 125219, USSR ABSTRACT.",
        "Russian elliptic constructions are examined from the point of view of syntactic analysis.",
        "Reciprocal elements in a co-ordimtive elliptic sentence are exposed and possible types of their similarity are explored, Linear formulae of ellipsis for most textual cases are constructed and statistics of their use is discussed.",
        "As a result the main steps of ellipsis restoration algorithm are outlined.",
        "INTRODUCTION.",
        "The investigations of ellipsis (gapping) in natural language sentences with.",
        "structural methods have been car-, ried on for more than 20 years, but algorithms of automatic restoration of omitted words either in coherent Russian.",
        "texts or in sequences of Man-Machine interaction replicas have not yet been proposed, The problem is still topical.",
        "Indeed, at an average each 7th entry in Great Soviet Encyclopedia and 25th abstract in a common Soviet abstract journal contain at least one sentence eX a fol,lowing kind: nepBos oas0 AaHHEX coAepoTTcH moDopmanym HO BOOM oTpacaHm mama, BO BTopal TOALKO 110 rymaBmTapHmm Baymmo /The first database contains information on all knowledge fields, the second one - only on the BUmanities./ Conversion of such a sentence to a formalized language, e.g.for automatic updating of factographic databases, without the.",
        "ellipsis restoration is impossible.",
        "Meanwhile ellipsis in Russian sci-tech texts is very diversified and covers any part of a sentence and most frequently the predicate with adjacent words.",
        "Early.",
        "Soviet works /Leontieva, 1965/, /Paducheva et al.,1973/, /Korelskaya et al., 1973/ had.",
        "examined the phenomenon from the point of view of synthesis.",
        "But when synthetic rules transform a non-empty entity to an empty one, corresponding analytical rules are not their trivial reversion.",
        "We examine elliptic constructions in coordinative sentences with.",
        "orientation to analysis, i.e. to parsing algorithms including restoration of omitted words.",
        "Several important issues should be forced for our purpose: 1) introducing the notion of reciprocal elements in non-omitted parts of elliptic sentences; 2) defining new types of syatagmata for restoration of semi-destroyed links between words within the reciprocals; 3) exploring possible types of reciprocal similarity; 4) describing coordinative sentences with minimal number of elliptic transformation formulae; 5) collecting statistics of the formulae use, which implies a search order of a specific formula for a given sentence.",
        "Thus a base for outlining the main steps of an ellipsis restoration algorithm is formed.",
        "RECIPROCAL ELEMENTS.",
        "There are several.",
        "kinds of word omission in natural languages.",
        "Among them coordinative reduction is carried out according to the formula XQ X & X*Q or QX & QX* .> QX & X* where X and X* are different words or woregroups, Q is a recurrent group of words, and & stands for a coordinative conjunction or just a comma: (He took)Q (the bread)X (and)& (he took), (the milk)X* ..=.1> (He took) (the bread)X (and)& (the milk)X*.",
        "Coordinative ellipsis includes co•ordinative reduction as a subset.",
        "Two or more phrase segments coordinated in a single sentence have some identical parts not necessarily standing at the borders of the segments.",
        "For economy's sake the natural language omits, wholly or partially, the recurrent part of a segment, as a rule, in.",
        "the second or subsequent one.",
        "The omission may be carried.",
        "out according to the formula XQ Y X*Q, Y* => XQ,Y 30 X* - Y*, where X and X*•are a pair of soMewhat similar, but corn-paredland even semantically opposed elements referred to hereinafter as reciprocal; and Y* are another such pair; the coordinative segments are XQ Y and X* - Y*.",
        "In Russian writing ellipsis is often.",
        "accompanied with a dash.",
        "The common feature of elliptic omissions is that a connected dependence tree for a sentence cannot be built without their restoration.",
        "The parsing algorithm should take into account and properly distinguish the specific phenomena occurring in.",
        "a given sentence, e.g. ellipsis and zero copula going together.",
        "BASIC ASSUMPTIONS.",
        "We examined a coordinative ellipsis assuming the following:",
        "- A context confined to a standalone elliptic sentence is sufficient for restoration.",
        "- An ellipsis in a sentence is exolica.L, ted.",
        "with a dash (along with some implied indications), but omission may occur not where the dash is or not only there.",
        "Comparative and other constructions without a dash have not been examined, but most of our statements cover them, too.",
        "Omitted parts, after restoration and, if necessary, morphological re-agreement, exactly restore the original meaning of a given sentence as a whole.",
        "Therefore recurrent parts in different segments have had exactly the same length, linear.",
        "order, and lexical content before omission.",
        "- A dependency' tree was selected as a tool for description of links between word-forms in a sentence, and the nature of the links corresponds to those suggested in \"Meaning - Text\" model /Mel'n21, 1973/.",
        "- Co-ordinatively reduced words should be restored, along with the ellipsis proper, where +his provides-connectedness of a parse tree and saturation of obligatory valencies.",
        "- There exists an algorithm for syntactic analysis of Russian texts which can cope with parsing any ellipsis-free sentence.",
        "It can also parse, consistently and unambiguously, the complete segments ()X an elliptic",
        "sentence and tie links, even ambiguous, within word groupein incomplete segments, preparing them as disjoited \"bushes\" for a final parse tree.",
        "STATISTIC OBSERVATIONS.",
        "As many as 600 elliptic sentences were extracted from large (more than 1000 pages) corpus of texts in various fields and genres (abstracts, articles, popular science books, and brochures).",
        "The material was arranged in a minimal number of elliptic formulae.",
        "A total of 24 formulae was found, but only four of them exceeded the 4% threshold (see Table).",
        "In the Table the arrows show the direction of synthesis; Q, stands for an omitted part replaced with a-dash; Q 19 Q, are ditional omissions possible tO the left and to the right of the dash; P and P, are on-tional segments (modifiers hnd the'like), not involved in the ellipsis.",
        "Available statistics permits to conclude: - The most widely used formula (single omission between two reciprocals) has exceeded the use total of all other formulae, and four leading formulae together account for more than 80 per cent.",
        "Number N of reciprocal pairs and number N, of °Missions in a sentence usually the formula 1 N, N <9 1, since reciprocals and omissions ar6 commonly ine-terleaving each other, but it is possible to construct counterexamples.",
        "- Cases with N > 2 and/or N17 2 amount for less than two er cent.",
        "- Approximately in 7% of eases nonsym-metric (\"chiastic\") formulae occurred.",
        "For example, formula P,QXY & XeQX* et> PAK!",
        "& X* ;;e Y* may have the following realfzationA (CoBmecTHaH padoTa)p (TpedyeT )0)T meHe",
        "pa )x(paciumpeim mahmaTmtlecitoro Rpyroso-pa )y (0)& (0T maTemaTima )y (BaaAeHMI Heitompumx maTemameciumm allaHrimml)y*0 /(A joint work)p (requires)Q (from engi-neer)X (broadeniRg of his mathematical outlook) (and)86 (from mathematician)xs (the possession of some technical back-ground)ys./ - Approximately four per cent of all cases did not fit into our formulae.",
        "Either a possible formula was too complex to be practical, or the shape of the sentence was dubious and even incorrect from the point of view of a human editor.",
        "ENCLOSING SYNTAGMATA.",
        "Before searching reciprocals it is necessary to establish syntactic links within word groups in an incomplete segment.",
        "The convenient tools for describing these.links, the so-called syntagmata, are not always sufficient here, see, e.g. the word combinations: °Often-.",
        "imie nommecitHe/oTAmbHme 11130148BOACTBOH Hme(HoHasaTeam) /generalized economic/ some productional (indications)/; 17 cTa-pHilyHHTBD HOBbIMB (apex-gm-m/1nm* /by 17 old by five new (enterprises)/; Ms icanmTa-JUICTINaCKFIX/M8 coulanmmecumx (cTpaH) /from capitalist/from socialist (countries)/ wort° KmeBMaxclipmcRo BHOBL npm015peTemuix (Imo) /the number of available/ the niimber of newly bought (books)/; 80 THO.",
        "Hauti) /80,000 publicistic/200, 00 scientific (publications/.",
        "Reciprocals in the pairs above are divided with slashes, end connected nouns (derived from oomplote Fie(r,.ments) are given in parenthesee° We propose dependencies of a now type, named enclosing ssategmata (ES).",
        "These ale establiThed-dithOreei co-snboedinatea attributes, linking brother nedeo from right to left (OCOftennere-s- Oft0HOMMtieW13M or between a number and ooessabordi, nested attribute (17 OTarea) o:(2 betooen a proposition or a noun with, predicative properties and subordinate noun,o attribute 043,-Itanmamcnixiecloix, LIMN() '-.AMODIRWICCe, TMO.",
        "4-nybaxAmcnxiecno00 Several ES constitute the lieks botucen a dominating word and its indireatls solesr dinated one.",
        "Via ES the nodes moat fimports ant for reciprocal matching tarried to be within easy distance) from thmil bwihoo' roots (may be, at the very roues), Similtee links can be established in complete seta menus; too.",
        "They transform a reiovzint enb-tree to an acyclic graph, which ineilleatee matching nodes and arcs.",
        "The set of ES is subject to updatieg so far.",
        "Caution should be used however about updating.",
        "Indeed, attempts to dlrootly link words arbitrarily distant w: thin, a COAVO3li ent-dependency tree, though eliminating •;i16 very notion of ellipsis, lead to superflle-ous complexity of ES and of a global model of natural :Language, too.",
        "SIMILARITY FEATURES.",
        "Manual segmentation of all available sentences has made clear that antagonists in reciprocal prsire are not in general case mutually isomer--phicv i.e. their subtree do not quite oe4n-, cide.",
        "Therefore, the labels at the matched.",
        "nodes should be forcedly involved and these are of the following types8 Lexical.",
        "Lexemes at the roots and/ox' theiFareCt subordinates in 22 per cent Were strictly coincide gorpholo teal.",
        "In most eases lexemes at the matchii noes belonged to the same part of speech, and their wordforming characteristics were in agreements nouns and numbers expressed by words - in case; adjectives; (pronominal included) and participles - in.",
        "gender, number, and case; personal verb-forms - in gender, number, and person.",
        "Only in 30 per cent of cases the agreement has not been revealed (numbers in digits, abe, breviations, etc.",
        ")eS ntactic.eSome indicators treated in the eaning - Text\" model as syntactic, might coincide, e.g. interogativity of lexemes MA and MAW in the sentence cupccm4 nyAa MATK9 OH - OROXLKO Bpeme-as.",
        "/I ar&ed where I should go, and he asked what time it was./ Semantic.",
        "If matching labels us tub thraRIETs-mentioned failed or at once se,veral nodes in a complete segment war s similar to the node in an incomplete one, thou coincidence of even one semantic indicato is important.",
        "Vaxenomy of such indicatod is not established yet.",
        "Several facets (classification aspects) with, admiesible intersection of their scopes a.eo expected to suit well, but simple thesanrical hio-archies are not excluded, either.",
        "tic haw specifically observed.",
        ": quantitative and cardinal words (28%), synOlOmy and antoA*y (10%), hyponymy and byperonymy (loo species, part/whole) (3%), and e, hers kiyvlo Of such similarity (2%).",
        "When semantic similarity within pair s X/X* and I./Ye felled, semantic propartio",
        "lo.uarryinon.",
        "*iyatactio1iIseAtehoo by eentendo.",
        "01:2-ileg le ei-moltaneune.tff rived k:eom connecto(4.1.oes oi' the par;..e ty.",
        "'oe„",
        "tivAt),' the conteneemt:Ipuotuveo und vco-enoo cA A IYm:po coula, •2) J'a the, 0A-41.9g ia oc't the sup,",
        "tenee than algorithm :J.",
        "'ostorution starts 'ap.",
        "Li-, incompleta segmont and u dash.",
        "peeition.„) ').",
        "(1° and elemepto are exty.2ucted, They otauld.",
        "be •hwaledly LiAnked.",
        "'via convenient ani.",
        ";:, it ne- • c:',66G0J:y1) ohcAesing uyntugmata-Tho Nnd r\" tound, eals iand.",
        "Y in the eompleto segment are soached.",
        "ihtacting Zi'\"0m its bo:Pdo:pe lnway'do, The node-b-node motehing to :Jo the bpshee • starts 1(2J...0m.",
        "thei uceu all.",
        "node: bolo, vhd should be oontinod.",
        "at luwac ti-we lt../Pnotion.",
        "words hyre uncovntovod.",
        "at the 'poets, 14..) The X: an(i Y depen.deney in the complete sogment cc truced„, mainly in uscandi:T!, ordep, The :mbar aid.",
        "-location botwedA opal: and.",
        "ens wee thus reveulekL• 5) The spocitie (Tgo'kempla Is diegnosoa, and, omitted woicd grovp:o al.eciapliouted with its hclp :Lrcc: the complete segment to the; Lacomplete one,, )La-aveement Os the kesto, cOd wavds sic carried out necessacy, e.g. 1:: nolobap„ po:oson, and./or gender for a predicate, Tt ;hero 'cc more thcc two co-bOloa,.",
        "t)-c segments in the sentence, then stops ho 5 sro Iceponted every subsequent segment spplying preceding (complete ap Just ccotweed) one.",
        "AIWONiUMWBATO.",
        "Tho athor wishes to ,=pcess hio great gratitude to Ii 00 Tt,l1,Tomdlno ToG.Mitinshin,„ sccd espeoiaib' to to,D„Apresian :rap the:Lc keen weiti(lue U.0 is also thantSul to and :ifer editorial :ce f.plye,",
        "(If the temperatnye is ti-wn),(oiaemo is , milked)(4 (isotermie), (and.",
        ")-(in opposite caso)--, (noniso--twon.16)x,:,"
      ]
    }
  ]
}
