{
  "info": {
    "authors": [
      "Yuan A. Alonso"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-1004",
    "title": "A Model for Transfer Control in the Metal MT-System",
    "url": "https://aclweb.org/anthology/C88-1004",
    "year": 1988
  },
  "references": [
    "acl-C86-1025",
    "acl-C86-1050"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The present paper tries to outline a model to unhence tee transfer control within the METAL Machine Tranelatioe System.",
        "The model is being currently tested in the German-Spanish system which is under development in Barcelona and relies upon techniques belonging to the GPSG framework.",
        "The central idea is to extract from the transfer part of tho phrase structure rules currently used by METAL all the relevant generalizable information about feature traffic and control dependences, and put it in form of language-dopendent tables'.",
        "This information is then accessed and handled by a few high-level rule operators, called during the transfer process, implementing three general feature principles.",
        "The grammar writer is thereby relieved front the tedious task of controlling all the feature traffic between nodes, this resulting in a clearer, shorter and safer granular for the system.",
        "1,- Introduction.",
        "This paper presents a proposal for the application of some GP3G-based techniques on the METAL MT system with the aim of endowing the system with a stronger control in the Transfer Phase.",
        "Thep central idea upon which this Transfer Control model is based is to provide the grammar writer with a confortable and safe means foe keeping as much feature traffic as possible controlled in the Transfer Phase of the translation process in METAL.",
        "Currently, any kind of feature traffic between nodes must be explicitely stated in the rules, and the same happens with the child node transfer grocers (Control Dependences).",
        "Xt seems reasonable to think that a great deal of both this feature traffic between nodes and the control dependences within the transfer phase could be generalized sad •tate6 outside the rules, in form of language-dependent tables which would then be accessed by a few general operators called in the rules (implementing the principles proposed lalow).",
        "The grammar writer would thus be relieved ts-es this task, all this resulting in shorter, clearer and less error-prone rules.",
        "Most of the ideas conforming the model presented here have been taken from the GPSG framework [Gazdar 85].",
        "The original idea was to directly apply the GPSG principles to the system, since, basically, METAL disposes of the necessary structure for it (i.e., it is a PS-based system, and thus, it works with structural descriptions [trees] consisting of bundles of feature-value pairs [nodes]).",
        "However, the fact that the GPSG model was originally conceived for analysis (transfer being quite a different problem) and that METAL lacks mechanisms which are central to the GPSG model, like LP/ID rules, metarules, FSD and FCR, etc., showed the unpracticability of such a direct approach.",
        "This is why the idea became to adapt some of the ideas offered by the GPSG (mostly the CAP and the HFC universal feature instantiation principles) and reformulate them so that they can, be used for our purposes.",
        "2.- Funchunentals of the METAL systeka.",
        "METAL is a Chart-Parser-driven Phrase Structure based MT system, which reflects the classic MT scheme of Analysis, Transfer and Generation phases.",
        "During file Analysis Phase, METAL builds from each input source language sentence one or more structural descriptions (henceforth trees), consisting of nodes, which in turn consist of e number of Feature-Value pairs (henceforth f-v-pairs).",
        "In the Transfer Phase, the trees obtained in the analysis arc converted into equivalent trees adapted to the target language needs.",
        "After this, the Generation Phase generates the output sentence/s in the target language, using the transfer trees as input.",
        "Apart from the lexical DBs METAL has some 500 PS rules, whose form can roughly be described as follows:",
        "<RULE-IDENTIFIER>",
        "NODE-STRUCTURE <e.g. \"NP --> DET NO\"› TEST <Teats on nodes to be satisfied in order for the rule to apply> CONSTR <Analysis-Tree Construction part> ANALYSIS PART T INTEGR <Anaphora Resolution part> TRANSFER PART 1 TRANSFER <Transfer-Tree construction part>",
        "During the Analysis phase, only the analysis part of the succeeding rules apply, building the analysis tree in a bottom-up manner until a S node is reached.",
        "Once the analysis tree has been thus built, the Transfer Phase starts; the transfer part of the rules applied during analysis activates now, climbing down the tree from top to bottom until the terminal nodes are transferred.",
        "When the Transfer Process applies on a node N, with f-v-pairs F-V, the child nodes of N are also transferred (and the child nodes of these, and so on, until terminal nodes are reached).",
        "Once all the branching nodes dominated by N have been transferred, the transfer process returns control to the father of N, which now bears target-language updated f-v-pairs F-V'.",
        "Two tasks central to the Transfer Process are the Feature Traffic (i.e., which f-v-pairs need to be sent up and down in which moment, and from which node to which node/s), and the handling of Control Dependences (i.e., which child node of one analysis tree or sub-tree [henceforth local tree] must be transferred first, in order for other sibling nodes to be able to be rightly transferred).",
        "The two mentioned tasks are now handled by the Grammar writer in the Transfer part of the METAL Grammar Rules through calls to \"low level\" feature traffic operators (i.e., copy one or more f-v-pairs from the root node to a child node, from one child node to another sibling node, or from one child node to the root node).",
        "What the present Transfer Control Model proposes is to extract from the rules all which can be generalizable in this process regarding feature traffic and control dependences and carry it out through calls to a few \"high level\" operators which use information stored in the system database in form of tables stating which f-v-pairs must be present in a given node, which nodes are controllers, and which other nodes are controllees within a given local tree.",
        "3.- Basic Definitions.",
        "In this section there followa a number of definitions which will be used throughout the rest of the paper.",
        "3.1: Local tree.",
        "A local tree is a part of a structural description which is currently being dealt with by the particular rule which is under consideration.",
        "For example, given an analysis tree of the form",
        "in which the number between [] indicates (for reference) the rule which has built this particular node, the local tree when rule [2] is applied would be:",
        "whereas the local tree for rule [3] would be / \\"
      ]
    },
    {
      "heading": "NST N-FLEX",
      "text": []
    },
    {
      "heading": "3.2.- Types of nodes",
      "text": [
        "Root Node [RN]: The root [parent] node of a local tree.",
        "Head Node [RN]: • In case Control Dependences (see below) exist within the current local tree, the Head Node is the controller node.",
        "Otherwise, the Head Node must be explicitely stated for each particular tree structure, normally being the X(HAR-l) child node, in a local tree dominated by a root node X(HAR) Notice that this definition of Head Node has been tailored ad-hoc for this model and deviates considerably from the traditional notion of Head in the X-bar theory, for instance.",
        "Dependent Node [DM: • A child node of the local tree which is controlled by a HN."
      ]
    },
    {
      "heading": "Free Node [FN]:",
      "text": [
        "A child node of the local tree which is not controlled by any HN.",
        "Lexical Node [IN:",
        "• A terminal lexical node.",
        "3.3- Type3 of Features Head Features UHT",
        "A nut of f-v-pairs which must be present with the same values both in the Head Node and in the Root Node in some precise moments during the Translation Process.",
        "• A set of f-v-pairs which must be present in the Lexical Nodes nodes prior to their transference into the target language.",
        "Control Features [CF]: • A eat of f-v-pairs which must be copied from the Head Nodes, into the Dependent Node/s after the Head Node has been transferred and before the Dependent Node/s is/are transferred."
      ]
    },
    {
      "heading": "3.4.-Control Dependence Between Nodes",
      "text": [
        "A Head Node [RN] controls one or more Dependent Node/s [DN] within a local tree if in order for the DN/a to be properly transferred, it/they must have a set of f-v-pairs whose particular values are to be updated with those values borne by the RN after this node has been transferred.",
        "Basically, our notion of Control coincides with the one given by the GEPS [Cinder 85].",
        "Control is a language-dependent relationship between nodes, in which there is a controller node and one or more controllee node/s, which ultimately subsumes the concept of agreement (subject-predicate, noun-adjective, etc.).",
        "In the Transfer Process, nodes which are controllers must be transferred prior to their controllers, in order to ensure the right agreement between them in the target language.",
        "Notice that a local tree may present different types of Control lependences (see Fig. 1), with one Dependent Node (the NP[2] :rode below, dominating a local tree where the NO node controls the DET node for Gender and Number), with two Dependent Nodes (the CLS node dominating a local tree where the NP[$SOHU] controls both the PRED node for Person and Number and the ADJ node for Gender and Number), or no Dependent Nodes at all (the PP node dominating a local.",
        "tree where neither the NP node nor the PREP nodes control each other):"
      ]
    },
    {
      "heading": "3.6, Local Transfer Process",
      "text": [
        "Given a local tree, consisting of a Root Node s. one or more child nodes (including a Head Node, and possibly one or more Dependent Nodes, and one or more Free Nodes), we can split the local Transfer Process sequence of the Root Node dominating the local tree into three steps:",
        "• Transfer the Head Node.",
        "• Copying the Control Features (CFs) set from the already transferred Head Node into the Dependent Node/s (if any).",
        "• Transfer the Dependent Node/s, and the Free Node/s (if any).",
        "4.. General Information to be Supplied to the System DB",
        "Basically, three types of information must be stored into the system DB and used later on by the Transfer Process.",
        "Physically, this information is implemented in form of a LISP list, although this is purely a parochial programming decision."
      ]
    },
    {
      "heading": "4.1.- HEAD Feature List [HM]:",
      "text": [
        "It contains information stating which f-v-pairs are considered to be members of the set HEAD.",
        "The decision of which f-v-pairs must be HEAD members is crucial to the model.",
        "In a first approach, we will adopt a pragmatical criterion.",
        "This means that we will include as HEAD features those f-v-pairs which are currently percolated in the corresponding rules, and which we make sure are actually needed for the Transfer Process.",
        "However, the aim is to extrapolate from this first approach a (maybe language-dependent) theoretical hypothesis about HEAD Features which enables to state a general criterion to establish the IIF membership."
      ]
    },
    {
      "heading": "4.2.- Lexical Access Table [LAT]:",
      "text": [
        "It contains LANGUAGE-DEPENDENT information stating which sets of f-v-pairs (Lexical Access Features [LW) are needed in order for each (major) Lexical Node to be rightly transferred.",
        "In METAL, lexical nodes are transferred by calling the XLX operator in the TRANSFER part of the corresponding rules.",
        "XLX takes arguments specifying the needed target language stem retrieval information for a given category, whether an inflexion must be attached to the stem, and the retrieval information for this inflexion.",
        "Thus, the LAT table contains information about Lexical Access Features, Inflexion Attachement information (when needed) and Inflection Lexical Access Features (ILAI).",
        "In fact, this would be quite similar to the XLX table proposed by Tommy Loomis in [Loomis 811.",
        "Here is a schematic example of the Lexical Access Table:",
        "AST .",
        "Adjectival Stem DET a Determiner NST Noun Stem PEN Pronoun CA .",
        "Case CL = Inflexion Class GO a Gender MD .",
        "Mode PF Predicate Form PS a Person TN = Tense NU .",
        "Number In the case of VST, for instance, the LAT would indicate that, for Spanish, a Verb Stem (VST) Lexical Node must be accessed in the target monolingual lexicon database through the current values of the MD, NU, PF, PS and TN features as keys, that a V-FLEX inflexion must be attached to it, and that this inflexion should he accessed through the current values of CL, MD, NU, PF, PC, TN."
      ]
    },
    {
      "heading": "4.3, Control Type Table [MI]:",
      "text": [
        "This table contains LANGUAGE-DEPENDENT information stating the Control Dependences for different local trees dominated by different Root Nodes.",
        "In this table, for each possible Root Node category (RN), its corresponding Head Node (EN), Dependent Node/s (DN) and Control Features (CF), if any, are specified.",
        "Here is one example of three CTT entries, one for CLS- (with two potential Control Dependences), one for NP-(one CD) and one for PP (no CDs) dominated local trees :",
        "The first entry specifies that, given a local tree with a CLS root node, its child Head Node (H11) is the NP child node bearing the $SUBJ value for the feature ROL, whereas the PEED child node always is a dependent node.",
        "The control features (CF) relevant for this structure are EV (number) and PS (person).",
        "Moreover, a sibling ADJ node may also be a Dependent Node, with control features GD (Gender) and NU (Number).",
        "This CTT entry controls the subject-predicate, and the subject-predicative adjective (in copulative sentences) agreement requirements, respectively.",
        "The same should be stated for each grammatical category which may be a Root Node of a local tree (CLS, PEED, NO, etc.).",
        "Two things must be stressed about the CTT table: Information about particular feature values can be given to distinguish between categories with the same name (for instance, to ensure that for the subject-predicate agreement, the controller is the NP which bears the role of SUBJect, and not some other sibling NV).",
        "Each CTT entry must have at least a Head Node specified for each Root Node, and possibly one or moms Dependent Nodes, which may or may not be obligatory, with their corresponding control features.",
        "This accounts for the possibility of having different local trees dominated by the same Root Node category (the case of CLS, above).",
        "5• Basic Principles In a first approach, three Working Principles can he stated for the METAL Transfer Phase.",
        "These three principles are actually reflected in the form of three operators (implemented as LISP functions) to be called in the transfer part of the rules.",
        "Feature Update [C VO] The Read Node [AN] of a local tree gat; its head features WI instantiated to the values currently preufent in the Root Node.",
        "ITV mites the RD% and the CTT table information peee euely stored into the system DR, end should be applied peioe to the lanai Transfer Process.",
        "C locature Update [CPU] Once the head Rode of the local tree has been teeneforeed, the corresponding Control Features must ho copied into the sibling Dependent Node/s before tide/these ace in turn transferred.",
        "The MO wakes ace of information stored into the CTT and the Lk tables, and should be called after the HIV has been applied.",
        "hoot loestlure Update [RFU] * The Root Node of a local tree gets its Head Features (RI'] instantiated to the values of the RF present in the child nodes after these have already been transferred.",
        "If any fey-pair conflict arises (i.e., if for a given f-v-pair two child sons have different incompatible values) the Head Node value will be preferred.",
        "RFC uses the BFL table information, and should be applied ailefe all the local tree child nodes have been teansfetesee 11sfelef(entations nefoeu cad ato.",
        "what we have called the Transfer.",
        "P1=088 throughout this paper, there may be present one or 00k0 teeeeinemetions which alter tho original.",
        "structure of the lanai teen to yield the coeeect constituent structure for tin cueeent target language (for instance, most adjectives preceding nouns in German or English must follow them ie Spanish) eto kinds of such transformations can be eistinguished, namely \"pre-TP transformations\" and \"post-1P teoesformations\".",
        "Pomo pre-TP transfomnations may dramatically change the local lane structure in a way which is not obvious at eieet eight (deleting, inserting or changing the order of child eedee).",
        "Roth the CIT table and the CFU function must hold iete: eeeouat this feet end handle automatically every _ssiblu local tree structure for each root node category, so ehat the grammar either can be thus relieved from another efefieele.",
        "task which very often gives rise to errors in the VM:Ltda):, cesoly, the handling in the rules either of new \"lee:Leib/8\" child nodes or of old ones with a different order within the tree 7, An Example for METAL Let us see a simplified example of diet n typical METAL PS-rule TRANSFER part would look like if the operators implementing these principles were applied.",
        "Please, bear in mind that this is a simplified example, end thus, it does not take into account any extra feature traffic which might be present and cannot be generalized by the present model."
      ]
    },
    {
      "heading": "CONSTR XNTEGR SPANISH",
      "text": [
        "(PRE-XFM) ; Tree transformations previews to the IP.",
        "WU) ; Copies the RT present la NP to the he node, which, for an NP Root Node, is the HO node, ; as the CPT states.",
        "(CPU) ; Transfers the NO node (RN).",
        "Copies the Control Yeateree (eD, NU) from NO to DEle which is the Dependent Node.",
        "Transfers the DET node (DN) (a'R n); Transfers free Nodes if any.",
        "(RFU) ; Copies all the Ars present in OPT & NO to RP (POST-XFM) ; Tree transformations after the IT.",
        "----------"
      ]
    },
    {
      "heading": "8,- Conclusion",
      "text": [
        "Although the model outline here must still be eel:4 tested and parts of it reeepecified according eo the results, it seems to be a valid approach to the peoblee et the transfer control in the METAL system.",
        "A number of questions still remain open, newly: Row to deal with trees where Control Interdependences exist.",
        "This is the case of German NPs bearing different adjectival inflexions depending both upon the gender of the noun and upon the type of determiner (weak/strong adjective declension) How to deal with local trees with more than one head Node (coordinate structures, for instance).",
        "Whether some type of GPSG FOR or/and ESDelike mechanisms (see GRPS (Gazdar 05]) could be used in this model.",
        "Whether this model is generalizable to other MT systems.",
        "The outlined model may be a starting point to begin introducing some of the techniques offered by the current linguistic theories (GPSG, LFG, GB, etc.)",
        "into the tee field, and at the same time trying to bring these pure theoretical models into the practical fields of MT sehteme already under development."
      ]
    },
    {
      "heading": "9.- References",
      "text": []
    }
  ]
}
