{
  "info": {
    "authors": [
      "Mare Koit"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-1068",
    "title": "Constructing a Model of Dialog",
    "url": "https://aclweb.org/anthology/C88-1068",
    "year": 1988
  },
  "references": [
    "acl-C86-1135"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In the present paper communicative cycle (CC) is considered as a dialog arising between two partners during solving a problem.",
        "Communicative strategy (CS) is seen as a general scheme by which a dialog participant is guided in achieving his goal.",
        "CC is described in terms of the goals of the participants and CS."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Dialog is a bilateral process the participants cf which communicate each other messages concerning the surrounding world.",
        "Each participant interchangingly undertakes the role of the author or the recipient.",
        "For communication to be possible the communicants must understand each other, i.e. their knowledge of language and about the world must have a shared part.",
        "Each participant should also know something about the partner - his goals, knowledge, possibilities, etc.",
        "The task of a dialog model is a formal description of the process of communication or, in a narrower sense, description of the communicative structure of the text (speech) generated by the communicants in this process.",
        "Such description may be represented, for example, in the form of a generative grammar or graph /Robinson 1982, Metzing 1981/ and it can be realized on a computer.",
        "One of the aims of working out the dialog models is just to facilitate the communication of man with the computer, bringing it nearer to man-to-man communication.",
        "Next we consider some problems arising in simulating dialog interaction.",
        "2.",
        "Communicative cycle and communicative strategy We limit ourselves only to treating such dialogs where the communicants (let",
        "them be A and B) as cooperative partners solve some problems.",
        "The unit of simulation will be communicative cycle (CC).",
        "We define CC as dialog arising between two partners during solving a problem.",
        "CC consists of the alternate turn-takings of the communicants though not every such sequence forms a CC.",
        "The turns are built up of communicative acts (CA).",
        "The minimal combination in a CC is a couple or triplet of turn-takings of the participants (cf. /Langleben 1984/), for example A: question - B: answer, or A: question - B: answer - A: acceptance of the answer.",
        "Any CC starts with setting up a communicative goal by one of the participants (A).",
        "Let the goal of A be \"B does a deed D\".",
        "In natural communication achieving a goal requires more than one communicative turn-taking from both A and B.",
        "Typically, A has some obstacles in achieving D: e.g. B does not want to do D; B does not realize that not doing D involves negative consequences; B thinke that he is not able to do D, etc.",
        "For this reason A must, in addition to fixing the goal, also determine the resources he has at his disposal for overcoming these obstacles, and the way of using these resources - it means that A must outline the communicative strategy.",
        "Having fixed the goal G. A tries to direct the relevant intellectual and emotional processes of B (his interests, assessments, opinions) during the process of communication in such a way as to eventually lead B to a decision to do D. In doing so influencing the partner is actually directed at certain aspects of his mind: his knowledge, assumptions, assessments, wishes.",
        "These relevant aspects of the mind of the partner may be called his psychic parametres, in short P-parametres.",
        "The decision of B to perform D depends upon the concrete configuration of the values of his P-parametres.",
        "The unfavourable values are the obstacles mentioned above.",
        "The essence of applying a",
        "strategy lies in the fact that A organizes his turn-takings to B in such a way that their results will be a change in the values of fixed P-parametres in a required direction: increasing his knowledge, changing his assessments, increasing his conviction, reducing or increasing his wishes, and so on.",
        "Within a fixed strategy certain P-parametres are chosen which can be influenced, the direction and ways of influence (e.g. strategies of threatening, scaring, tempting, convincing, etc).",
        "With respect to the primary communicative goal the changing of the values of P-parametres may be called \"instrumenal goal\".",
        "The development of the theory of com-municatjve strategies thus presupposes the development of a theory of the P-parametres.",
        "It wouAd be part of a certain qualitative theory of decision-making and should, in addition to explicating the system of P-parametres, explain also the influence of P-parametres upon the decisions made by a person.",
        "The factors that must be taken into account in shaping a decision are numerous.",
        "But it tarns out that this diversity can be reduced to a limited number of primary parametres.",
        "We can bring forth the following types of P-parametres: assessments (rational evaluations and those of pleasantness); knowledge (also skills, experience); interests; requirements (wishes, needs, among them a need for communication).",
        "Thee explication of all possible P-parametres requires additional inestigations (first of all psychological).",
        "In a model of dialog the P-parametres of a communicative partner make up one part of the model of partner.",
        "During communication some of these values may undergo changes.",
        "3.",
        "Simulating the communicative cycle",
        "First of all let us describe the process of formalizing the notion of communicative strategy (CS).",
        "CS may be defined as a procedure which determines the choice of an author's communicative acts.",
        "This choice need not be unique.",
        "In this respect CS differs from strategy in the game theory or from a plan of communication.",
        "The, author A has fixed his communicative strategy if he i) has established the set of P-parametres of the partner B relevant to his communicative goal G ii) knows in case of every relevant P--para-metre whether in order to achieve the goal G it is necessary to increase or lower the required value iii) has determined among the relevant P-parametres one parametre, changing the value of which is the immediate goal G of implementing the strategy iv) knows in case of every relevant P--para-metre how to change its values either directly with the help of certain CAs, or indirectly, by changing the values of other P-parametres.",
        "Let us consider one example of CS.",
        "Let the goal of the author A of the strategy be G = \"B performs a deed D.",
        "(1) The relevant P-parametres of B: a wish to do D assessment of positive consequences of D assessment of negative consequences of D knowledge of the fulfillment of the preconditions of D, etc.",
        "(2) Let A know that B's wish to do D is lower than required for doing it.",
        "(3) Let the P-parametre A wants to change be B's wish to do D (which needs increasing).",
        "This is the immediate goal GI of the strategy.",
        "(4) P-parametres \"assessment\" and \"knowledge\" can be influenced directly by such communicative acts as \"giving information\", \"explanation\", \"substantiation\".",
        "The P-parametre \"wish to do D\" can be influenced only indirectly, through some other P-parametres, e.g. by increasing B's assessment of positive consequences of D, by lowering B's assessment of negative consequences of D, by increasing B's knowledge about the fulfillment of preconditions of D. The goal GI of applying this strategy is to increase B's wish to do D. This may proceed in different ways (by setting up some subgoals and applying corresponding substrategies): A may increase B's assessment of the positive consequence of D (by giving information of them, substantiating and explaining), i.e. to allure, cajole; A can lower B's assessment of negative consequences of D (by giving information,",
        "substantiating and explaining their bad• ness), i.e. to warn, threaten, scare; A can increase B's knowledge about the fulfillment of the preconditions of D (e.g. by informing B about the availability of resources required for doing 0, explaining it), i.e. to convince.",
        "The communicative strategy does not determine uniquely the way of achieving a goal (the sequence of communicative acts of the partners) but leaves the freedom of choice.",
        "Constructing the next turn depends among other things upon the changes which have been brought about in the partner's model by the information received during interpreting the previous turn-takings of the partner (for example, it may happen that some assumptions of the author about the partner do not hold).",
        "The communicative cycle proceeds as follows (participants A and B, A is the initiator of communication, G is the communicative goal of A).",
        "In accordance with special rules of interest /Saluveer, Oim 1986/ A finds the P-parametres of B relevant to the goal G. On the basis of the partner model A determines the necessary changes in the values of these parametres.",
        "Next, A chooses a relevant P-parametre which value needs changing.",
        "In this way he chooses his communicative strategy the goal G1 of which is changing the value of the chosen P-parametre (in such a way as is required for achieving the goal G).",
        "In case of every P-parametre A knows either the list of CAs or the list of other P-parametres through which it is possible to increase or lower the value of the chosen P-parametre.",
        "In order to achieve the goal GI A has therefore either to choose a CA from a given list or determine a new P-parametre (which, in its turn, determined a new communicative strategy which is part of the initial CS) and make up the next turn-taking.",
        "Partner B whose goal does not need coinside with the goal G determines, according to the rules of interest, the repave-metres of partner A which are relevant to his goal.",
        "On the basis of the model of A (i.e. his partner model) B determines the necessary changes in these parametres.",
        "also fixes his communicative strategy, as did A,",
        "In interpreting the turn of the parie both communicants carry out the eeeoceaey changes in their partner modole end decide whether their initial goal or at leaet sues of its subgoals have been achieved.",
        "If this is not the case then either a new subgoal i6 set up (or a former subgoal iu maietaieed) and a new turn-taking in made to acnieve it, or the initial goal is given up.",
        "Commigieation proceeds until the initiator of the communication cycle A has achieved hie goal or given it up.",
        "The model outlined above underlies the pilot human-computer dialog eyetam TARLUS /Knit, Saluveee 1986/.",
        "Thu version of the system which has been realized up to now (oe Ryad 2 and SM computers) the cyatem cae perform morphological, syntactic and 60MLaltic analysis and generation of Eetoeian texts.",
        "In addition to that the version oe the SM computer can recognize in a text the description of such criminal events ea theft, robbery, etc., and anowe• questioee about that text in the Estonien language."
      ]
    }
  ]
}
