{
  "info": {
    "authors": [
      "Jun'ichi Tsujii",
      "Yukiyoshi Muto",
      "Yuuji Ikeda",
      "Makoto Nagao"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-2141",
    "title": "How to Get Preferred Readings in Natural Language Analysis",
    "url": "https://aclweb.org/anthology/C88-2141",
    "year": 1988
  },
  "references": [
    "acl-P84-1057"
  ],
  "sections": [
    {
      "text": [
        "II\" 108Ar t;kft refeni teadiag,, Natur,j ,,a,fign age hiotalysis",
        "'ilidiiipAper describes a parsing program called.",
        "KGW-fp which is designed to ;,.ring various sorts of knowledge to get most uY iwttrial descriptions of senteuses.",
        "Tim system aco!pts not may a set of rides specifying mon-which .",
        "},1131 aCSCZ1ptio116 of sentences should satisfy, bat .fise Inel.fr,eff twins which are utilized in selecting most infefistred dem:T.400ns among possible ones.",
        "During tie ri lioPUing process, the prehuetial roles are utiliMiei tG selet, feasible parsing paths.",
        "furthermore, p is commute in the sense that it cfan generate an possible :Arne:tut:A descriptions of sentences a required.",
        "Thc, descriptions d.k4: generated in eferential order.",
        "One of of the most crucial problems in natural languageprocess-ing is Iv AV to conquer the problem of co.nbinatorial;i.x1))osioiis in ir4eateoce aim lysisrFord821[Trai jii84] if lintlx841[Peren iffirtl.",
        "tinguim tic constraints so far formulated by theoretical linguists are too weak to prevent many possible interpretations from being generated.",
        "'They have concentrated only on forroulating of syntactic con6intio.s, which are obviously insufficient for selecting single interpretations of input sentences.",
        "OP the other hand, various methods have been proposed, by tesem chers iu Artificial Intelligence and Computational ltinguim tics for dimf mting possible interpretations by referring to other sorts of knowledge such es semantic, pragmatic ones, etc.",
        "flow ever, these methods are not satisfactory either, because most of them presuppose very restricted subjeet fields and cannot deal with the openness, the essential property of natural languages' They also hwinniated semantic and pragmatic knowldge as co it-Mrainis which interpretations should satisfy.",
        "However, human readers utilize various cues as preferential.",
        "That is, there are many sorts of knowledge which seem to be better formalized in the form of rules for selecting feasible intin-pretations.",
        "to orilina reataiitf, situations, human readers cannot expect to have all int:ormation necessary for deciding interpretations.",
        "On the coritf My, they wouid have only incomplete, partial It VOWledge abont contexts and subject fields.",
        "Even so, they can_ easily fix single interpretat:ons for given sentences.",
        "'They might select one interpretatioeri for 'I saw Mary with a telescope' Based on semantic iirteinacy between 'to see' and 'a telescope'.",
        "They might also select one interpretation for 'John was given a book by /ifs uncle'.",
        "selections cannot be explained by consimeld rules, because other interpretations are also possible.",
        "fir this paper, we propose a new parser called.",
        "1(t:f WTI) ill which no 'rush itiwt rules and preferCwlail rules can be separately dcysreir bed in mod aim.",
        "forms and integrated in the paf'sing process both effectively and efficiently [ficeda86][1Viuto88:1, l'ff3lVt3to is implemented on Symbolics :3600 by using the favor",
        "Fig.i shows the organization of KGW-1 p. KGW-1 p consists or tllac separate ConiTponeitts;, the structure building component (SEC), tine preference rating component (PH,( ), and the silted tiler.",
        "The SEC accepts constriant rules in the form of Cit'C rules with feature augmentations, and applies them to generate syntactically tactically possible structures of sentences.",
        "The rules the SEC accepts are the rules in unification grammars.",
        "The SEC is a, bottom-up and breadth-first parser with top down filtering, and constructs partial parse trees (PPTs) front left to right.",
        "Without the PAC and the scheduler, tine SLIC produces all syntactic structures compatible with a given set of constraint rules.",
        "On the other hand, the FRC computes plausibility callus; (EVs) of PPTs generated by the SEC, and the scheduler loosely controls the whole parsing process based on I' Vs.",
        "The scheduler suspends less preferred parsing paths, and 1 eitittattit them ii the preferred ones ger to deadend in the later stages of processing.",
        "Though' KGW+p works at promissing parsing paths fist , it gererate, if required, all structural descriptions by 7:Miming suspended paths."
      ]
    },
    {
      "heading": "Algorithm a f the SHC",
      "text": [
        "Maximal flexibility in controlling CFG parsing can be obtained in the active chart parser [Kay80][Winograd8:1].",
        "In this algorithm schemata, a parsing process is taken as a sequence of attaching all active or inactive arc to Churl, one at each time.",
        "Though each attachment of an arc creates a set of arc;; to he attached, the chart parser in a general forth does not attach",
        "them °ffinnediately, but registers them in Agenda .",
        "A scheduler decides which arc in Agenda is to be attched next.",
        "Because no priori ordering of arc attachment is assumed, one can realize abitrary, flexible control mechanisms in this schemata.",
        "However, such a maximal flexibility is obtained at the cost of efficiency.",
        "The scheduler has to be invoked at each cycle to decide which arc to be attached.",
        "Furthermore, when arcs are created, we have to take away the arcs which exist in Agenda or in Chart, before registering them in Agenda.",
        "The same arcs may exist to the arcs only whose leftmost constituents are filled by inactive arcs.",
        "Because of the reachability condition, we also have to check applicability of rules to all the inactive arcs in the right neighbor, whenever an active arc is attached.",
        "Such repeated checkings can be avoided in more restricted algorithms.",
        "In KGW+p, we use an Agenda-like list (S-list suspending list) but unlike the Agenda in the active chart parser, it only keeps the arcs which will be tried after the preferred ones fail.",
        "The other created arcs are attached immediately.",
        "Instead of tile scheduler, the SBC has its own control scheme for building PPTs mechanically from left to right.",
        "The scheduler of KGW-I-p is more like a demon watching the SBC.",
        "When it finds less preferred PPTs (arcs) generated, it jumps out to store them in the S-list.",
        "Or when it finds the SBC goes to deadend, it decides which suspended PPTs in the S-list should be resumed.",
        "The SBC in KGW-I-p uses two data structures, one for inac, tive arcs and the other for active arcs in Chart.",
        "As in Fig. 2, the inactive arcs from vertex i to j are stored in P(i, j).and the active arcs with ending vertices i are stored in G(i).",
        "We call the arcs in P(i, j) inactive PPTs and the arcs in G(i) active PPTs.",
        "Both P(i, j) and G(i) are realized as flavor instances of each type (P-Flavor and G-Flavor).",
        "as =MI G(2) kepps the active PPTs whose waiting constituents will be filled by the Inactive PPTs in P(1.2) and P(2.",
        "1) 'ig.2 Two Data Structures in KGW+p We also realize active and inactive PPTs as instances of the PPT-flavor, each of Which keeps the following items (c-PPT in the following means the PPT which is expressed by the flavor instance) (1)starting and ending vertices of c-PPT (2)syntactic category and features of the top node of c-PPT (3)completed constituents: a list of inactive PPT-instances filling the child nodes.of c-PPT (4)remainders: a list of constituents to be filled.",
        "If c-PPT is inactive, the remainders is an empty list.",
        "We call the leftmost constituent of the remainders the waiting constituent.",
        "Note that the waiting constituents of PPTs in G(i) are to be filled by inactive PPTs with starting vertex i.",
        "(5)pairs of a larger PPT which incorporates c-PPT as the leftmost constituent and the rule which was used to create the larger PPT.",
        "Because PPT-instances keep (1) - (4) as the arcs in Chart, they can be suspended in the S-list (not immediately stored in P(i, j) or G(i )) and resumed afterwards freely.",
        "(5) is used to avoid redundant processings in the retrial phases (see Section 4).",
        "The basic cycle of parsing is implemented as a set of methods of ,P-Flavor.",
        "When P(i, j)-instance is triggered, the methods in P-Flavor perform the following operations for each PPT stored in P(i ,j).",
        "a (Extension of Active PPTs)look for active PPTs in G(i) which can incorporate the PPT as the leftmost constituent of the remainders, and create new PPTs a (New Rule Application)look for rules whose leftmost constituents in rhs can be unified with the PPT and whose nonterminals in lhs can reach to the nonterminals of the waiting constituents of active PPTs in G(i), and applies them to create new PPTs By storing newly created PPTs in the corresponding P(i', j') or G(j' ) immediately , a naive bottom-up, breadth-first and left-to-right parsing with top-down filtering can be easily realized as follows.",
        "(1)After completion of the basic cycle, P(i, j)-instance triggers the execution of the basic cycle in j)-instance (2)A trigger to P(0, j)-instance is taken as a trigger to the SBC-manager.",
        "The manager creates new PPTs by using the rules A – > aj+1 (a14.1 is the j-I-1 th words), stores them in P(j+1, j+1) and triggers P(j+1, j+1)-instance (3)Parsing is started by triggering P(0, ,•0)-intance (This leads to the triggering of P(1, 1) in (2)).",
        "The basic control scheme of the SBC is the same as the above one.",
        "however, in KGW-1p, after each basic cycle of creating new PPTs, newly created PPTs are rated by the PRC and the scheduler suspends less preferred (active or inactive) PPTs by storing them in the S-list.",
        "Only preferred ones are stored in corresponding j' ) or G(j' ) in parallel.",
        "Thus, though the scheduler loosely controls the whole process, the SBC analyzes sentences basically from left to right in a breadth-first manner by its own efficient control scheme.",
        "Note that tile basic control scheme is an extended one of the algorithm proposed by V. Pratt [Pratt75] to deal with nary rules."
      ]
    },
    {
      "heading": "Re:mining the Suspended PP",
      "text": [
        "When all et preferred paths fail, the scheduler resumes some of suspended PPTs.",
        "This can be done simply by Wail:erring them from the S-list to the corresponding P( j) or 0(j) and triggering P(j', j' ).",
        "j' is the smallest one among j of P(i, j) and G(j ) art which the resumed PPTs are transferred.",
        "Alter oistoring the suspended PPTs, the same bottom-up, left-to -rigir; and breadth-first parsing is performed from the word.",
        "However, special care is taken in KGW-hp to reuse PPTs already constructed in the preceding trials to avoid duplicated procesaillgs.",
        "We can reduce necessary processings in the n-111 retrial phase as follows.",
        "Can:-1) P(i, contains no PPTs newly creadted the aelk retrial phase, and G(1) contains »o active PPTs newly created in the n-lit retrial phase : we eau completely skip the basic cycle for P(i, j).",
        "(Cost-2 ) P(.1, j) contains no PPTs created in the nth retrial phase, but 0(i) has active PPTs newly created in the retrial phase: While we have to perform the Extension of Active PPTe operation in the basic cycle for each PPT j), we only have to consider the new active PPTs in 0(i).",
        "\"Phis operation may lead to creation of new Pins in the n-i11 retrial phase.",
        "We also have to perform the New Rule Application operation of the basic cycle, because the reachability condition may change.",
        "However, it may happen that the sz,me rules have already applied to the PPTs in the former trials.",
        "In this case, because each PPT keeps a list of pairs of the larger PPTs mid the rules (see Section 3), we can reuse the larger Pen and avoid creating new PI\"Fs in the a-lit retrial phase.",
        "in order to minimize the redundant processings in the retrial phases, P and 0-flavors provide different slots for PPTs created itt the n-111 trial and for those created in the former trials (see Eig.3).",
        "The analysis proceeds in the retrial phases in exactly the same way as in the first trail, but the duplication of operations are carefully avoided.",
        "(I) I'-flavor hew-NO.4: hoops tire inactive PPT-lee lances created le the ir,lh retrial phase.",
        "re-ppts: keeps the Inactive PPT-Instances which aro accent In the 11-01 retrial phase.",
        "hut the same PPT-Instances have been created in the farmer trial phases.",
        "old.%)pts: keeps the inactive PPT-Instences created In the former trial phases.",
        "(i) 1-flavor item-l■pts: keeps the active PPT-iestatices created In the nth retrial phase.",
        "old-pp : keeps the active PPT-Instances created In the former trial phases.",
        "In the basic cycle, for each PPP in P(i, j), the SIR; creates a set of new PPTs which incorporate the PPT.",
        "These new PPTs represent different hypotheses based on the same bottom-up evidence, the incorporated PM'.",
        "The PRO con-unites the PVs (plausibility values) of these different hypotheses by invoking a package of prefereuce rules.",
        "A rule package is defined for computing the I'Vs of larger PPTs incorprating the same inactive PPT.",
        "'Plod is, a rule package is defined for each syntactic category (nonterminal) of a PP] to .be incorporated.",
        "A set of rules for PP-attachment, for example, are defined in a package which is invoked when the incorporated p:rr is a prepositional phrase.",
        "In order to compute PVs, we can refer in preference rules to various sorts of information as follows (we use tree and TREE for the incorporated Prr and the incorprating PVT, respectively).",
        "('Who top node of tree (2)the top node of TREE (3)constituents of 'IREE already incorporated (the left brothers of tree in TREE) (4)sequence of active Prfs which eventually predict TREE (note that each PVT keeps the larger PPTs which will incorprate the PPT when it is completed - see Section 3) (5)lexical informatkm of words which appear in the right unanalyzed portion of sentences (look--ahead) (4) and (5) indicate the global nature of preference rules of HOW-f p in the sense that the PVs of TREEs are computed not only from the constituents of TREEs but also from their suroundiag contexts (Fig.4).",
        "Fig.5 shows the format of preference rules.",
        "[incompatible-Cased enumerates different relationships between tree and TREE .",
        "In the package for PP-attachment, we enumerate as incompatible cases different types of PP-attaclunents such as PPs filling one of the valences of verbs, PPs as adjuncts, etc.",
        "A set of (Independent-Evidences] is defined for each incompatible case.",
        "When a set of created PPTs with the same incorporated PPT are given, the PRO invokes a package, and for each created PI'T, it determines which exclusive case matches with it.",
        "Then, the set of independent evidences for the case is evaluated.",
        "Each independent evidence is expressed in a condition-value pair and, if the condition matches with the created PPT, it returns the specified value.",
        "The PRO gets a set of values from the independent evidences, each of which is a primitive PV based on a certain aspect of the ITT such as semantic intimacy of words, well-formedness of syntactic trees, etc.",
        "fly combining the values with a certain function (currently, we use simple addition as this",
        "function), the PRC determines the PV for the incorporation of tree into TREE.",
        "(PRULF.",
        ":CAT (one of the syntactic Categories) :TYPE Inon-head.",
        "head) Depending on mhether the category Is the maximal bar-level (head) or not.",
        "fig.5 Format of the Preference Rules The actual PV of the created PPT is deterimined by the combination of",
        "(1) PV in the above which is given to the combination of tree and TREE (2) PV of tree (3) PV of TREE : TREE has already incorporated left constituents and have accumulated their PVs (4) PV of the larger PPTs which incorporate TREE when it is completed",
        "Though one can consider any functions for integrating the above set of PVs, we use simple addition in the present experiments.",
        "And we do not use (4) (the PV from top-down) in this addition.",
        "In the present experiment, after the PRC computes the PVs of larger PPTs incorporating the same PPT, the scheduler suspends PPTs which have low PVs compared with the most preferable PPT.",
        "That is, if the difference between the highest PV and the PV of a PPT exceeds a certain (predetermined) threshold, the PRC suspends the PPT."
      ]
    },
    {
      "heading": "6 Experiments",
      "text": [
        "We conducted various experiments by using KGW-I-p.",
        "In this section, we will show the experiment of disambiguating sentences containing the word that.",
        "Thai can be taken as a pronoun, a determinner, a relative pronoun, a complementizer, a noun as an antecedent of a relative clause, a conjunction for an appositional clause or adverbial clause, an adverb, etc.",
        "The followings are examples we realize as preference rules in the experiment.",
        "(Note that, in the present experiment, the PVs given by independent evidences are classified into 5 ranks, most preferred (+2), more preferred (+1), neutral (0), less preferred (-1) and least preferred (-2)).",
        "(1) Nouns such as fact, news, etc.",
        "are often collocated with appositional clauses.",
        "When the head of a noun phrase preceding that is one of such nouns, the appositional clause interpretation is more preferred.",
        "(2) When the verb in the sentence is one of the verbs subcategorized by that-clause, the complementizer interpretation is most preferrred.",
        "(3) When the word so or such appears in the preceding part of the sentence, the adverbial phrase interpretation is most preferred.",
        "(4) PP-attachments over clauses are less preferred.",
        "(5) Omission of relative pronouns is less preferred.",
        "(6) The pronoun and determiner interpretation of that are less preferred in written texts.",
        "(7) Different usages of a verb have different preferences.",
        "The verb to tell , for example, has five usages, 'to tell sth to sb', 'to tell sth', 'to tell sb 'to tell sb that-cl' and 'to tell'.",
        "The last usage (the intransitive usage) has the least preference.",
        "etc.",
        "An example of actual preference rules is given in Fig. 6.",
        "The sentences in the following are used in the experiment.",
        "1.",
        "I told the fact that sulfuric acid dissolves the metal.",
        "2.",
        "I told the man that sulfuric acid dissolves the metal.",
        "3.",
        "I was so tired that I could not move.",
        "4.",
        "I was so surprised at the fact that John told us.",
        "5.",
        "I told the fact that sulfuric acid dissolves the metal to John.",
        "For 1 and 2, the SBC generates seven descriptions as follows.",
        ".",
        "[vp tell [upthe [n )fact[upp_dthat sulfuric ..]111] .. [vptell [upthe fact]] [that-dthat sulfuric ...]]] [vptell [upthe fact [rd_d[upthat sulfuric] ..]] [upthe metal]]] [vptell [upthe [upifact 1 ,app-cl [npthat sulfuric] ..]]]]] [vp tell [up the I fact] , [that-cl [up that sulfuric] ...11j [vptell [upthe fact [rekithat sulfuric ..]]][upthe metal]]] [vp tell [up the fact [app_dthat sulfuric ..]][upthe metal]]] (c) (g) are rated low because they contain less preferred constructions.",
        "For example, (c) contains the omrnision of a relative pronoun, the determiner interpretation of that, a PP-attachment over a clause (the phrase the metal), etc.",
        "As the result, (c) be-conies the least preferred one among the interpretations.",
        "PVs of (a) end (b) in these sentences differ by the semantic condition that the usage 'to tell sb that-er prefers human as sb and by the collocation condition that the noun fact is often collocated with an appositional that.",
        "clause but the noun man is not.",
        "For the sentences 1 and 2, KGW-lp succeeds in integrating such different 8011S of preferential cites to give the highest PVs to the interpretations most preferable for human readers.",
        "Furthermore, because the paths which lead to these interpretations have the highest PV:-; during the whole parsing process, any threshold values can be used for suspending less preferred interpretations.",
        "KCW-lp also produces the valid interpretation for the sentence 3 in a straightforward way, but it encounters certain difficulties in 4 and 5.",
        "At the time when the word that is analyzed in the sentence 4, the relative pronoun interpretation, which leads to the valid analysis, hes a lower PV than the other two haterprentaions.",
        "The adverbial clause interpretation supported by the word so, and the appositional clause interpretation supported by the word fact have higho,7 PVs.",
        "Therefore, if the threshold value is low, the valid interpretation is suspended.",
        "Furtgennore, both interpretations succe,A, though they contain such a semantically less preferred structure as Is [up John][vp [v tell][ity us]]] and the wohle interpretations are rated low.",
        "In the sentence 5, because the interpretation most preferable to human readers contains a PP-attachment over a clause, it is rated less preferable than the one which contains [up the [ypi metal [pp to John]]1.",
        "These examples, especially the sentence 4, show that we need a mechanism to notice that the selected parsing, paths become less feasible: (even though they do not fail) than the suspended paths.",
        "This mechanism requires a global method for comparing completely remote PPTs.",
        "We also have 'to devise a sophisticated method for deciding the threshold value appropriately.",
        "Tablet shows the effect of the threshold values in the analysis of the sententce 5.",
        "In the case when the threshold is 2, only a single analysis result is obtained at the first trial, but the result is not the most feasible one for human readers Threshold Values 9 7 6 A 3 '4 a Tine for Completing 16.04 15.84 15.69 15.64 11.24 10.84 10.39 6.95 the 1st frial(see) Time for the PT 5.63 5.55 5.51 5.49 4.05 3.9 3.78 2.28 Computation No.",
        "of Suspended 0 2 4 4 9 13 15 29 PPTs No.",
        "of Parse Trees 18 17 16 16 5] 4 3 fn the.",
        "1st Trial.'"
      ]
    },
    {
      "heading": "Conclusions",
      "text": [
        "In this paper, we describe the organization and the basic algorithm of KUW+p.",
        "KGW-lp allows one to prepare knowledge for natural language parsing in two separate forms.",
        "One is for the constraint type of knowledge and the other is for the preference type of knowledge.",
        "fly using tine constraint type of knowledge, the SBC (Structure Building Component) in KGW+p produces partial parse trees mechanically from left to right in a breadth-first manner.",
        "The scheduler, which is a kind of demon watching the SBC, loosely controls the whole parsing process by utilizing PVs (Plausibility Values) given by the PRC (Preference Rating Component).",
        "The PRC uses the preference type of knowledge to compute the \"'Vs.",
        "KGW-I-p prepares a framework in which we can obtain the flexibility of control, the modurarity in knowledge preparation , and the efficiency and ,compleleness of parsing at the same time.",
        "It is a. very delicate and difficult problem to decide the actual PVs of interpretations and the threshold value for suspending PPTs.",
        "Because various different sorts of factors may contribute to the PVs with different strengths, we certainly have to corn-bine conventional NLI' techniques with appropriate statistical and stochastic models.",
        "We hope that KGW-lp gives us a good starting point for such future researches."
      ]
    },
    {
      "heading": "Relcreiic",
      "text": []
    }
  ]
}
