{
  "info": {
    "authors": [
      "Lars Ahrenberg"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-1003",
    "title": "Functional Constraints in Knowledge-Based Natural Language Understanding",
    "url": "https://aclweb.org/anthology/C88-1003",
    "year": 1988
  },
  "references": [
    "acl-C86-1149",
    "acl-E87-1024",
    "acl-E87-1044",
    "acl-P81-1028",
    "acl-P84-1024"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Many knowledge-based systems of semantic interpretation rely explicitly or implicitly on an assumption of structural isornorphy between syntactic and semantic objects, handling exceptions by ad hoc measures.",
        "In this paper I argue that constraint equations of the kind used in the LFG- (or PATR-)formalisms provide a more general, and yet restricted formalism:in which not only isomorphic correspondences are expressible, but also many cases of non-isomorphic correspondences.",
        "I illustrate with treatments of idioms, speech act interpretation and discourse pragmatics.",
        "1.",
        "Background and purpose",
        "In knowledge-based natural language understanding systems the role of syntax is by no means self-evident.",
        "In the Yalean tradition /Schenk dt Riesbeck, 1981/ syntax has only played a minor role and whatever little syntactic information there is has been expressed in simple terms.",
        "Consequently, there is no grammar no I such and syntactic conditions are freely intermixed with semantic conditions in the requests that drive the system forward /Birnbaum & Selfridge, 1981/.",
        "Similarly, in frame-based systems such as /Hayes, 1984/ the syntactic information is stated in conjunction with all other information relevant for instances of a frame.",
        "A justification for this approach, apart from transparency, is that it makes sense to say that part of our knowledge of a concept is knowledge about how it is communicated.",
        "A major disadvantage of this approach is of course its lack of generality.",
        "To overcome this problem we may extract general syntactic knowledge and make use of it in a syntactic parser which works alongside with the semantic analyser.",
        "Examples of such systems are PSI-KLONE /Bobrow do Webber, 1980; Sondheimer et al., 1984/ and MOPTRANS /Lytinen, 1988; 1987/.",
        "The promise of these systems is that you get both modularity and integration, although there are many open questions about how the integration can best be achieved.",
        "Moreover, one would like to put the integration of syntax and semantics, not just syntak and semantics per se, on a principled basis, i.e. we need a theory of how syntactic and semantic objects correspond.",
        "Linguistics and philosophy offer some guidelines here, such as compositionality, and a number of different theories, but a problem is that the semantic objects considered are usually not knowledge structures.",
        "/Hirst, 1987/, though, is an attempt at a principled, modular and integrated knowledge-based system where compositionality and a principle of strong typing provide the theoretical underpinnings.",
        "These principles seem to provide a tighter straight-jacket than one would really want, however, as indicated by the many structures that Hirst shows are problematic for his system.",
        "Another, more recent approach is to capture correspondences between syntactic and semantic objects through constraints /Halvorsen, 1983; 1987; Fenstad et al., 1985; Kaplan, 1987/.",
        "An essential feature of constraints is that they simultaneously characterize properties of a structural level and account for a correspondence between those properties and properties of another level, i.e. the level to which the constraint is attached.",
        "The correspondence may be between two different levels of syntactic structure, as in LFG, or between a syntactic structure and a semantic structure or conceivably between any two structural aspects that constrain each other.",
        "So far it seems that constraints have primarily been stated in the direction from form to meaning, where meaning has been regarded as inherent in linguistic expressions and thus derivable from an expression, given a grammar and a lexicon.",
        "In a working system, however, we are not merely interested in a decontextualized meaning of an expression, but in the content communicated in an utterance of an expression, which, as we know, depend on world knowledge and context in more or less subtle ways.",
        "A rather trivial fact is that we need to have an understanding of the context in order to find a referent for a referring expression.",
        "A more interesting fact is that we often need an understanding of context in order to get at the information which is relevant for determining the referent /Moore, 1981; Ahrenberg, 1987a,b; Pulman, 1987/.",
        "In a knowledge-based system, the knowledge-base provides an encoding of general world knowledge as well as a basis for keeping track of focal information in discourse.",
        "It seems a natural move to combine a knowledge-based semantics with the descriptive elegance and power of constraints, but as far as I know, not much work has been done in this area.",
        "/Tomita Carbonell, 1986/ presents a knowledge-based machine-translation system based on functional grammar and entity-oriented parsing.",
        "In this paper I discuss the role of syntax in three general and related aspects of utterance interpretation: referent determination, classification, and role identification.",
        "A joint solution to these problems will fall out if we assume, as is often done, a simple, one-to-one structural (or categorial) correspondence between syntactic and semantic objects.",
        "This is done explicitly e.g. by /Danieli et al., 1987/ and /Hirst, 1987/ and, so far as I can judge, implicitly in many other systems.",
        "However, the assumption is much too simplified and must be amended.",
        "I will illustrate some cases where the correspondences are more involved and argue that local constraints of the kind used in the LFG-formalism /Kaplan & Bresnan, 1982/ are able to handle them in a fairly straightforward way.",
        "Thus, instead of ad hoc-solutions the isomorphic cases will in this framework fall out as particularly simple instances of the general principles."
      ]
    },
    {
      "heading": "2. A framework and a system",
      "text": [
        "I regard the process of interpretation as a process in which a given object, the utterance, is assigned a description, the analysis.",
        "The description has different aspects, primary among them being",
        "• a constituent structure, (c-structure) • a functional structure, (f-structure), • a semantic structure, (d-structure) and • a content structure.",
        "I refer to these structural levels as aspects in order to emphasize the idea that they are all part of one and the same interpretation of the utterance.",
        "The c-structure and the f-structure are roughly as in LFG /Kaplan & Bresnan, 1982/, but with some important deviations.",
        "The functional structure is strictly syntactic.",
        "There are no semantic forms and hence no grammatical notions of coherence and completeness.",
        "Instead of the PRED-attribute, there is an attribute LEX whose value is a \"lexeme\", an abstract grammatical unit which in turn is associated with semantic objects: object types, semantic attributes, and so on.",
        "The semantic structure is a descriptor structure (\"dag\") just as the functional structure, but with descriptors pertaining to the discourse referents accessed or made available by the utterance.",
        "Thus, a constituent of the semantic structure consists of a description that potentially applies to an object in the universe of discourse.",
        "The content structure differs from the semantic structure mainly in that referents for descriptions have been identified (where possible).",
        "If a c-structure, an f-structure and a d-structure apply to an expression under a given interpretation they are said to correspond.",
        "If, similarly, a sub-expression of the input is associated with constituents at all three levels, these constituents are said to correspond.",
        "Correspondences between c-structure and f-structure are defined by an LFG-style grammar and a dictionary of stems and affixes.",
        "Correspondences between f-structure and d-structure are defined by the lexeme dictionary and information in the knowledge-base.",
        "Primary among the knowledge structures are types, attributes, and instances.",
        "Every type is associated with a prototype, a frame-like structure which 'defines what attributes apply to instances of that type, as well as restrictions on their values.",
        "Prototypes are also associated with functional constraints, thus defining possible correspondences between d-structures and f-structures.",
        "For example, the attribute AGENT, beside other restrictions on its occurrence and values, may be assigned the canonical constraint (t SUBJ) = j.",
        "The arrows in this schema have the same interpretation as in the grammar rules: t points to the f-structure node corresponding to the description of which the attribute is part, 1 points to the f-structure node corresponding to its value.",
        "Semantic attributes may also be associated with contextual constraints.",
        "The context is represented by a special object, the discourse state (DS), the description of which encodes the contextual information that the system currently has available.",
        "In particular, this will include information about who is speaker and who is addressee.",
        "A simple contextual constraint can be stated as =(DS SPEAKER), which when associated with an attribute asserts, the identity between its value and the current speaker.",
        "The relations between different structural aspects and the knowledge sources that define and constrain them are illustrated in figure 1.",
        "In the process of interpretation the analysis is ideally constructed incrementally.",
        "When information is added to one structural aspect and there is a constraint associated with this information, we are justified in adding the information stated in the constraint to the structural aspect to which it relates.",
        "If this is not possible, e.g. due to the presence of contradicting information, the initial information can be rejected.",
        "The ideas presented here have been partially implemented in a system called FALIN, which is developed as a precursor to an understanding component of a dialog system (Ahrenberg, 1987a).1 The world of FALIN is a drawing-pad and its knowledge cover simple geometrical objects that the user can draw and manipulate using natural language.",
        "FALIN's parser (a chart parser) is constructing a c-structure and an f-structure in tandem, but hands f-structures over to another module which attempts to construct corresponding d-structures and content structures.",
        "The content structure is then evaluated against the knowledge-base."
      ]
    },
    {
      "heading": "3. Structural isomorphy",
      "text": [
        "The semantic aspects that this paper considers are three very basic ones: (i) referent determination; to determine the set of discourse objects (referents) that a given utterance relates to; (ii) classification; for each of these referents to determine their type, and (iii) role identification; to determine the relations they contract with the other referents.",
        "From the first task I then exclude the problem of actual identification of referents, restricting myself to the task of deciding that there is a separate entity that some part of the utterance applies to.",
        "Now, we can formulate a general and practical principle, which is commonly used in semantic interpreters and which offers a solution to all three problems at once, namely a principle of structural isomorphy between syntactic and semantic structure.",
        "The basic tenet of this principle is that there exists a level of syntactic representation (which I will call functional structure here, but which may be represented in various ways, e.g. as a dependency structure) such that (a) every referent is expressed by some major constituent of the functional structure; (b) the type of a referent is given, directly or implicitly, by (one sense of) the head of that constituent; and (c) two referents contract a role relationship iff their respective constituents contract a grammatical relation in the functional structure.",
        "These one-to-one correspondences between syntactic and semantic objects yield isomorphic syntactic and semantic structures as long as we only consider the three mentioned aspects of semantic interpretation, and hence the name \"structural isomorphism\".2 See figure 2 for a graphical illustration.",
        "FALIN can be read First Attempt at LDVIdiping Natural Language interface.",
        "Thus, no claims are made for other aspects of semantic interpretation, such as quantification or modification.",
        "S IkITAX One-to-one SEMANTICS The morph dictionary associates functional constraints with correspondences stems and affixes as in the following illustrations.",
        "Stems are also associated with lexemes, but affixes and function words are not.4 Li: ear; N, (1 LEX) !CAR, (1 NUMB) = SING",
        "1,2: sold; FV, (1 LEX) = !SELL, TENSE) = PAST L3: the; DET, , SPEC) = DEP 14: to; P, (i PCASE) = TO",
        "In the lexeme dictionary lexemes are associated with appropriate semantic objects.",
        "This association may be one-to-many, but only one of the alternatives can be involved in an analysis, thus making the correspondence between head words and types one-to•one.",
        "It may also involve object descriptions rather than objects.",
        "For instance, a proper name lexeme, such as !JIM, can have associations with known instances as well as with a description that can be used in the construction of a new instance.",
        "It should be observed that the isomorphy principle allows for both lexical and structural ambiguity, i.e. it does not require that a given word, or grammatical relation can be interpreted in only one way.",
        "What it requires is a one-to-one correspondence of syntactic and eeniantic objects of the same interpretation.",
        "Moreover, structural isomorphy is not the same as compositionality.",
        "In one sense compositionality is more restrictive since it applies to all aspects of semantic interpretation.",
        "On the other hand compositionality is less restrictive since it requires derivation trees to be isomorphic, not constituent structures, However, compositional systems too, e.g. /Hirst 1987/, often Issume structural isomorphism for the aspects of concern here.''' As an illuetration, consider (1).",
        "Here the speaker can be said to refer to four entities, a sale, a car and two male humans.",
        "The last three relate to the first as, say, Goods, Provider and Receiver, respectively.",
        "Each of the referents corresponds to a major constituent, the whole sentence for the case of the sale and Subject, direct object and indirect object for the others.",
        "Also, the head words sell, Jim, car and Englishman provide the type information as stipulated.",
        "(1) Jim sold the car to an Englishman.",
        "In the framework used here we could have the following grammar rules defining constraints on the functional structure:",
        "Finally, the association between grammatical functions and semantic roles is captured in the definition of the latter.",
        "As attributes can be differentiated in very much the same way as object types, these correspondences can be stated at an appropriate level of generality.",
        "For instance, Provider may be analysed as a differentiation of Agent and inherit its association with the Subject function from that attribute.",
        "It is also possible to have these associations stated at the level of individual action types.",
        "If we want to express the difference between sell and buy as a difference in the role-function associations of Provider and Receiver, we state the associations in the definition of the two action types.",
        "In any case the prototype of &Sell➢ will turn out to bear the following information: Here the associations are not just simply stated as a function label associated with the role attribute, but corresponding functional descriptions are explicitly represented.",
        "This is so because more than a mere function label may be involved and, as will be shown below, the correspondences may be more complex than this.",
        "The correspondences in a prototype should be read as a set of canonical correspondences.",
        "Alternative correspondences can be obtained from lexical rules just as in LFG-theory /Bresnan, 1982a; cf. also Halvorsen, 1987/.",
        "Applying the Passive lexical rule to (2) we obtain an alternative set of constraints, namely (2').",
        "Ira Hirst's system prepositions and \"pseudoprepositions\" (named SHIA OBI, IND0133) are the relevant syntactic objects instead of varranatical f unctions.",
        "4 .",
        "Lexeme labels are indicatied by an initial exclamation mark.",
        "Object types are indicated by an initial 'H'.",
        "There are some reasons for stating the role-function correspondences as functional constraints induced by the semantics rather than the other way round.",
        "For one thing, definitions of types and attributes are needed for independent reasons and the introduction of the functional constraints is merely a way of encoding knowledge that pertains to them, i.e. knowledge of how they are communicated.",
        "Moreover, subcategorization properties are semantically grounded, even if not absolutely predictable.",
        "4.",
        "Cases of non-isomorphism.",
        "4.1 Non-isomorphic constructions.",
        "There are certain",
        "linguistic construction-types that, at least on the surface, contradict the isomorphism principle, such as Equi, Raising, Longdistance dependencies and Gapping constructions.",
        "However, in most cases it seems possible to eliminate the problems posed by these constructions already in the grammar and thus have appropriate functions assigned to constituents at functional structure.",
        "4.2 Flexible idioms.",
        "For simplicity we may characterize a flexible idiom as a complex expression with a definte meaning whose parts may undergo variation and occur in non-adjacent positions.",
        "Fixed idioms, such as at once, back and forth, first of all do not pose the same problems as they can be taken care of already at the c-structure level.",
        "Most flexible idioms in English seem to involve a verb, such as make fun of, break someone's heart, or make up one's mind.",
        "Consider (3).",
        "(3) He broke their hearts completely.",
        "At the c-structure and f-structure levels it is analysed in the same way as any other sentence.",
        "In particular, each constituent will have its own LEX-descriptor:",
        "Object types for both ordinary breaking and heartbreaking are associated with !BREAK in the lexeme dictionary.",
        "The object type for heartbreaking also involve a reference to the lexeme !HEART, however.",
        "The object type &Breaksomeone's-heart carries the following information associated with the attributes of its prototype:",
        "This means that while there is a simple one-to-one correspondence between Subject and the role of Cause, the other function-role correspondences involve structural distortions.",
        "They are still expressible by local constraints, however, and this holds for any flexible verbal idiom where the fixed parts have a grammatical relation to the verb, or to some complement of the verb, i.e. for the great majority of verbal idioms in the language.",
        "In some cases a part of the idiom may play a double role.",
        "On the one hand it is part of the expression of the idiom and on the other hand it brings with it a referent of its own.",
        "Consider the following discourse:",
        "(6) A: He hasn't shown his face here for the last couple of weeks, has he?",
        "B: Who wants to see it anyway?",
        "To describe the fact that the phrase his face can express a referent we may allow for this possibility in the statement of correspondences in the protytype for the action.",
        "4.3 Constituted discourse objects.",
        "An utterance is itself a discourse object, i.e. it may be referred to in the discourse that follows.",
        "When this happens the utterance will be classified one way or the other, as in utterances of the following sort:",
        "(8) That is a difficult question to answer.",
        "(9) I think your statement needs clarification.",
        "Except for performative utterances there is no head word in the utterance that can be used to for its classification, however.",
        "Instead the classification will have to rely on other information, such as clause-structure and punctuation.",
        "Speech-act interpretation is often regarded as something entirely different from semantic interpretation proper.",
        "This, I would argue, is a mistake.",
        "Illocutionary categorization is constrained by words and world knowledge in very much the same way as categorization of other referents.",
        "The essential difference between the illocutionary act as a referent and other referents is that the illocutionary act come into being with the utterance of the words, whereas the other referents exist independently.",
        "This means that we can postulate (at least) two ways in which an uttered expression relates to discourse referents, first, it relates to referents described by the utterance, and second, to referents constituted by the utterance, in particular the illocutionary act.",
        "The analysis of an utterance would be incomplete if it does not include a classification of the utterance, as well as the discourse objects that fulfils the roles of Speaker and Addressee.",
        "(10) Show me the files.",
        "5 Similar problems arise with sentences such as The question is why he did it, The fact is that he did it, where the subjects are not interchangeable: *The fact is why he did it.",
        "Consider now how (10) may be analysed.",
        "Let us classify it by means of the object type &Directive which we assume to be a supertype for commands, orders, directions and similar speech acts.",
        "The prototype for this type may be assigned the following set of constraints (as one alternative):",
        "In order to distinguish objects being described from objects being constituted wu distinguish two modes of correspondence.",
        "The ft-arrow indicates an f-structure node corresponding in constitutive mode.° The schema associated with the Action attribute says that the f-structure node corresponding to the d-structure node for the directive in constitutive mode actually coincides with the f-structure node describing the action being directed, thus encoding the one-to-two relation between the utterance and the discourse objects it relates to.",
        "4.4 Implied referents and types.",
        "As is well known, in situated discourse we regularly do not give explicit expression of the referents being talked about as such information can be inferred from the context.",
        "Obvious illustrations are given by short answers to questions as in (12).",
        "Similarly, we may suppress head words if they are inferrable, as in (13),",
        "(12) - Who is the manager of the sales department?",
        "- Jim limith.",
        "(13) I've got many more at home.",
        "There are two ways to react in the face of such \"elliptic\" utterances.",
        "One way is to say that they require special pragmatic heuristics which are independent of the principle of structural isomorphism (and vice versa) and thus simply regard them as irrelevant.",
        "However, this makes the principle limited in application.",
        "It would be better to have more general principles of utterance interpretation that together covers both elliptical and non-elliptical utterances.",
        "Again, contextual constraints in conjunction with ordinary functional constraints can do part of the job for us.",
        "A phrase such as Jim Smith in itself does not give much information of course.",
        "However, when it is uttered in reply to a question, as in (12), it will have quite a well-defined meaning.",
        "In the definition of the utterance type &Answer, we may thus include, beside attributes for Speaker and Addressee, also an attribute indicating what question is being answered.",
        "This question can be retrieved from the discourse state, where it was put when it was raised and kept until it is answered or dropped."
      ]
    },
    {
      "heading": "5. Restrictions on proper correspondence",
      "text": [
        "It would be premature to attempt an explicit characterization of the correspondence relations between the structural aspects of an analysis, especially as important aspects of semantic interpretation have not even been considered.",
        "In this final section I therefore only summarize the general ideas, pointing out how they differ from structural isomorphism and state a few necessary conditions on the correspondence between f-structure and d-structure.",
        "The referent descriptions conveyed by an utterance are constrained by linguistic form (functional structure) as well as by conceptual knowledge (prototypes) and context-of-utterance (discourse state).",
        "A referent need be given no overt expression in the utterance if it is inferable from a prototype and/or from the context.",
        "The conetraints themselves need not be one-to-one, contrary to the principle of structural isomorphy, but they are local in the sense that they can only refer to (i) structures corresponding to either (a) the object that induces them, (b) the object of which that object is an immediate part, or (c) other dependents of that dominating object, or (ii) objects of the discourse state.",
        "To capture speech-act interpretation we recognize two modes of correspondence, one based on the relation description-described object, and the other on the relation utterance-constituted act.",
        "The f-structure is a syntactic structure, which means that it must be a minimal structure satisfying the constraints induced by the c-structure.",
        "However, it must also correspond properly with the d-structure.",
        "To account for this correspondence we must first realize that not all functional attributes need be semantically relevant e.g. those indicating grammatical gender.",
        "If 0 is an f-structure, .08 m will indicate an f-structure obtained from 0 by subtraction of semantically irrelevant paths.",
        "Thus, we get the following conditions on proper correspondence between d-structures and f-structures: (1) A d-structure, 6, and an f-structure, , are corresponding properly in descriptive mode, only if (a) 8(Type)E g(S(LEX)), where g is the function defined by the lexeme dictionary; (b) There is a prototype, H, for 6(Type) such that (i) 8 satisfies the conditions of H, and (ii) 0 is a minimal structure satisfying all functional constraindeMduced by H for the role attributes at top level of 6.",
        "(c) For any sub-structure, 6', of 6, there is a sub-structure, 0', of c8, such that 6' and 0' correspond properly in descriptive mode.",
        "(2) A d-structure, 6, and an f-structure, 0, are corresponding properly in constitutive mode, only if (a) There is an utterance-type, 11, and a prototype, //ii, for fl, such that 6 satisfies the conditions of H0.",
        "(b) 0 is a minimal structure satisfying all functional nt.",
        "constrais induced by Ho for the role attributes at top level of 6.",
        "(c) as 1(c).",
        "This use of the symbol 'fr' should not be confused with its use in"
      ]
    }
  ]
}
