{
  "info": {
    "authors": [
      "Alevtina Bemova",
      "Karel Oliva",
      "Jarmila Panevova"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-1010",
    "title": "Some Problems of Machine Translation Between Closely Related Languages",
    "url": "https://aclweb.org/anthology/C88-1010",
    "year": 1988
  },
  "references": [
    "acl-C82-1025"
  ],
  "sections": [
    {
      "heading": "Abstract:",
      "text": [
        "We describe the linguistic background of a Czech-to-Russian MT system, stressing its features resulting from the closed relatedness of the two languages, above all the possibility of a minimization of the transfer.",
        "Related linguistic problems are analyzed within the MT project, as well as in the perspective of contrastive linguistics.",
        "1.",
        "The system of Czech-to-Russian MT system called RUSLAN is conceived (;similarly as all linguistically based MT systems) as a modular system consisting (in brief) of a source language parser, a tranfer and a synthesis of the target language.",
        "The task is to translate texts from the domain of computers, in particular manuals of operating systems.",
        "Since in RUSLAN the source language is closely genetically related to the target one, some of the modules of the system could have been considerably simplified, not leaving out of consideration the theoretical linguistic framework on which the system is based (dependency and stratificational approach).",
        "The simplifications concern, first of all, the transfer phase, so that the system cannot be understood as including a complete transfer.",
        "P. The effort towards a maximally effective procedure has also resulted in simplifications in the parser.",
        "This was made possible i.e. by the similarity of cases of syntactic ambiguity in the source and the target language.",
        "For example, with sequences of the type Verb Nonni Noun2 Nouni, where each Nounj stands for a nominal or a prepositional group serving as a free modifier, the surface order can generally be preserved, which fact makes unnecessary a detailed identification whether any of the Nounj's modifies the Verb or one of the preceding Nouns.",
        "This can be illustrated by the output Russian sentence \"Vo vremja svoej raboty programma motet po-trebovat' taleAe pomoW sistemy pri obrabotke fajlov dannych.\"",
        "(Lit.",
        "\"In course of-its work program can need also help of-system in processing of-files of-data.",
        "\"), where the group \"pri obrabotke ...\" can be analyzed (in both languages) as modifying the verb \"potrebovat\" or the nouns \"pomoW\" or \"sistemy\".",
        "If the order of the nominal groups is preserved, the translation also preserves the structural ambiguity of the original.",
        "Also nominaliza-tions can be translated independently of their underlying structure (e.g., \"IndeksnoposledovateTnyje fajly neobchodimo do obrabotki preobrazovat'.\"",
        "- lit.",
        "\"Index-sequential files have-to--be before processing transfor-med.",
        "\", or \"Programmy, napisannye na jazyke Assembler v ramkach 21.24xclui621 versii, ne-obchodimo snova translirovat'.\"",
        "- lit.",
        "\"Programs written in language Assembler in frame• work-of preceding version have-to-be again compiled.\").",
        "Such an approach made it possible, at first, to minimize the transfer phase in the design of the project, and then , in the process of realization, the articulation of transfer operations into the parser and the synthesis, which may lead to'an impression that RUSLAN works completely without transfer, i.e., as a direct binary MT system.",
        "In principle , it can be said that the minimization of the transfer reflects the empirical fact that the two languages have a lot of common features.",
        "3.",
        "A great role is played in RUSLAN by the lexicon.",
        "The lexical entry contains maximum of information, which is then projected to the syntactic rules; only the most general behaviour of words is rendered purely by means of syntax.",
        "The rules of choice of lexical equivalents include different types of information.",
        "Along with the data on parts of speech and morphemics, semantic features are listed, and (esp.",
        "with verbs) also the valency (subcate-gorization) frame; the valency slots are ac• companied by information on their Czech morphemic form as well as that of the corresponding Russian items (as an example of their discrepancy might serve the pair \"-Oivat nfto(acc.)\"",
        "vs. \"porzovat'sja 6em(instr.)\"",
        "- \"to use stg.\"",
        ").",
        "Where pasivization is possible, it is indicated which of the slots (mostly, but not always expressed by accusative) is selected as the passive surface subject, expressed then by nominative.",
        "With each of the slots, the semantic features required or excluded for the filler of that slot are indicated.",
        "These features help to identify the fillers, especially in cases of ambiguity, e.g. in Czech \"VYstupni zalqzeni nastavi Mdkovhni na poMadovanou hodnotu.\"",
        "(lit.",
        "\"Output device sets line-spacing at required value.",
        "\"), the verb \"nastavit\" (\"set\") has the following valency frame: Actor (nom/nem, 411umano-Device), Objective (aos/acco-Concro-Result-of-procese,-Human), where +' denotes semantic features such that at least one of them has to be present with the filler of the respective slot, - denotes semantic features excluded with the filler, and bold-print denotes Czech/Russian morphological.",
        "forms.",
        "In this way, the ambiguity of morphemic case with \"Nidkovbni\" and \"zaPizeni\" (in both cases between nom and ace) can be solved on the basis of semantic features of the two nouns.",
        "3.1 The choice of the Russian equivalents for Czech lexical units should reflect also",
        "structural differences between the two languages.",
        "These differences concern also syn• tactic patterns; at least the following cases should be distinguished: Adj Adj Noun Adj Noun ox.",
        "dato14 Oikaz",
        "- upravljajuHij operator I. data control comand - control operator b. Noun -l:, Adj Noun ex.",
        ": pota,6 vy6islitel/naja maina lit,: computer -U, computing machine e. Verb Verb Noun • ex.",
        ": zkompilovat osuNlestvit'kompiljaciju lit.",
        ": to eompile to carry out compilation 4.",
        "Noun -1, Noun Noun",
        "ex.",
        ": pod4tek taka peresOenija lit.",
        ": beginning point of-intersection e. Adj Adj Noun Noun Noun Adj Noun ex.",
        ": vy6S1 programovaci jazyk jazyk programmirovanija Vyogego urovnja lit.",
        ": higher programming language language of-programming of•highe• level Clearly, some types are easier to implement than the others, which depends on the complexity of the respective Czech and Russian constructions.",
        "For simplification of some cases of the type d-, where the Russian equivalent includes a modifying noun in a fixed morphemic form, this is treated as an uninflected word, the syntactic relation of which is established already in the dictionary.",
        "3.2 Due to the closeness of the languages, a useful ingredient can be seen in the idea of a transducing dictionary proposed.",
        "and elaborated in the English--to--Czech MT system (cf. Firschmer,82).",
        "The transducing dictionary, based on algorithmic handling of the regular productive international affixes (with exceptions listed in the main dictionary) and of the orthographic and similar differences, can be illustrated by the following : a, with the suffixes TH (montht,\"assembly\"), Tht (agregAA,\"aggregateif), •-ent (koeficient, \"coefficient\"), Tura (kubatura,\"cubic vo-lume\"), and the lexical components of Greek or Latin origin , such as L-laaf, -skop (kar-diograf,\"cardiograph\",elektroskop,\"electro- ecope\"), the Russian equivalents differ at most in details b. with other suffixes of international use, the Russian equivalents correspond in a systematic way to the Czech ones, as with 411°01:-ornT1, -1cXk/-160RklA 0. to a certain degree also words of Slavonic origin can he handled by a procedure based on correspondences with regular segment pairs such as h/E, TraTiToroT (where T stands for an occlusive: krAtWkorotkij \"short\"); such pairs as \"brad\" (\"castle\") vs. \"gorod\" (\"town\"), where the lexical semantics differs, have to be listed in the lexicon.",
        "d. whenever a word has not been identified in the main dictionary and cannot be treated by the procedures of the types a, ,b. ,c. , at least transliteration and some of the elementary correspondences are carried out , so that if e.g. \"phepineni\" (\"overloading\") or \"disketa\" (\"floppy disc\") were not found in the dictionary, they would be transduced as \"perepolnenie\" (correctly) and, \"disketa\" (instead of \"gibkij disk\"), respectively.",
        "This procedure, and a set of similar fail-soft rules for syntax, should ensure that the output be basically understandable.",
        "4.",
        "The procedures of syntactic analysis and synthesis are based on lexical information, including the valency frames.",
        "Certain difficulties arise when filling the slots of obligatory adverbials (see Panevovh,80) with which the forms of a given adverbial type are variable, e.g. \"vrAtit se kam\" (\"to return somewhere\"): \"napravo\" (\"to the right\", ad-verb) , \"lc probl6mu\" (\"to the problem\", preposition \"k\" + dative), \"do bytu\" (\"into the flat\", preposition \"do\" + accusative) etc.",
        "Such cases are handled by the parser together with free adverbials, only it must be ensured that the obligatory modifier is identified (in a case of ellipsis , it is necessary to take into account the preceding sentence, although often the Czech deletion goes in parallel with that in the corresponding Russian sentence).",
        "4.1 One of the relevant differences between Czech and Russian syntax concerns sentences with the Czech lot person plural corresponding to the Russian reflexive forms, e.g. Czech \"Algoritmus rozmist'ovhni bloke popisujeme v 6Asti 6\" vs. Russian \"Algori.trn razmeLjdenija blokov opisyvactsja v razdeie (\"The algorithm of dislocation of blocks is described in Sect.",
        "6\").",
        "Often a modal expression is present: \"Nhzvy programn m6eme najit v knihovn6\" vs. Russian \"Nazvanija program man() najti v biblioteke\" (\"The titles of the programs can be found in the libra-ry\").",
        "The linguistic rules underlying the practical solution of these problems can have the following form:",
        "Younaoo Verbistpi Nounnom Verbrom (Nounaoo) Verbmodal ,1otpl Verbiof (Ilounnom) Nodal Verbinv",
        "(\"Modal\" stands here for such expressions as \"mOno\" (\"possible\"), \"nado\" (\"necessary\"); parentheses '(',')' denote the fact that the Objective is not always obligatory.",
        "4.2 In some cases the ambiguity of a Czech sentence corresponds to a similar ambiguity in Russian.",
        "In other cases the ambiguity in the two languages is not in such accordance.",
        "This is illustrated by the following:",
        "a. Czech:",
        "V 16t6 probehlo jednAnl.",
        "o nov6 variance 08.",
        "Russian: , Letom proNo soveileanije o novom variante OS.",
        "(In summer, the negotiations on the new variant of OS took place.)",
        "b, Czech: V fete probdhlo jednhni o prAzdninhch.",
        "Russian.",
        ":",
        "The preposition \"o\" with locative in Czech is kept also in Russian or, with nouns having the feature Time, translated as \"vo vremja\" with genitive.",
        "Differences in prepositional constructions are found also with the following pairs:",
        "c. Czech:",
        "Prate na programu pokraOuji i v tomto roce.",
        "Russian: Raboty nad programmoj prodoHajutsja (tom godu.",
        "(The works on the program continue also this year.)",
        "d. Czech:",
        "Price na fakult6 pokraduji I v torte rocs.",
        "Russian: Raboty na fakultete prodolajutsja i v atom godu.",
        "(The works at the faculty continue also this year.)",
        "These examples cannot be fully accounted for by means of lexical information, neither can they be included into the general scheme of syntactic rules.",
        "It is necessary to have a list of such differences.",
        "4-3 In translating Czech subordinate clauses introduced by such conjunctions as \"zda\",\"-li\" (\"whether\"), \"jestlie\" (\"if\"), \"kdy'i(,\" (\"when\") , \"dokud\" (\"till\"), \"dokud ne\" (\"until\"), \"pokud\" (\"as long as\"), some of which are ambiguous, the text can be treated as relatively homogenous.",
        "The functioning of a clause introduced by \"zda\" or \"-li\" as a subject can be identified on the basis of the valency of the verb in superordinated clause, where it is marked whether the verb may take a subordinated clause as its Actor or Objective.",
        "In the other cases, suitable or at least acceptable translations of the conjunctions are as follows: Czech \"zda\",\"-ii\",\"pokud.",
        "\",\"jestlie\" as Russian \"esli\"; Czech \"dokud\",\"dokud ne\" as Russian \"poka\",\"poka ne\", Czech \"kdW as Russian \"kogda\".",
        "It follows that while it is necessary to work to a certain degreewith the underlying structure, in'the majority of cases the equivalent can be chosen just in accordance with the conjunctions themselves.",
        "4.4 The Czech verb \"b:Crt\" (\"to be\") has several Russian equivalents: the copula \"bye', verbs \"est'', \"javljat'sja\", \"nachodit'sja\", \"imet'sja\".",
        "The selection of the equivalent depends on the syntactic context: if the nominal predicate in Czech is in instrumental case, then a form of the verb \"javljat'sja\" is preferred; if a local adverbial is present, then the translation \"nachodit'sja\" is at place, otherwise the appropriate form of the copula is chosen; .",
        "Of course, another point concerns the translation of \"bit\" within idioms (\"byt'v porjadke\", but \"imet'sja v ras-porjaenii\").",
        "4.5 The surface behaviour of negation is not the same in Czech and in Russian: in Czech, even partial negation is often expressed as a prefix of the verb, which gives rise to an ambiguity absent in Russian, where this distinction is always transparent.",
        "Some of the examples from our texts are:",
        "a. Czech:",
        "To ani system piesne nevi.",
        "Russian: (togo daze sistema tonic) ne znaet.",
        "(This even the system does not know exactly.)",
        "b. Czech:",
        "Tabulka neni u10,ena na peynem mists v pam6ti.",
        "Russian: Tablica pomeHaetsja ne na postojannom meste, v pamjati.",
        "(The matrix is not placed in a fixed position in the stbrage.)",
        "4.6 We assume that the surface order is substantially the same in the two languages; the differences concern only such.",
        "specific cases as, e.g., the positions of parts of the complex verb forms or those of certain pronouns and particles which have the character of clitics in Czech , but usually follow the verb in Russian:",
        "V operacionnych sistemach budem starat'sja (In the operating systems, we shall try ...) The differences described in this section do not concern the structural order, and there is no danger that ambiguity might arise.",
        "The dislocation of function words and particles can be described by general rules.",
        "4.7 In 4.1 through 4.6 we wanted to show what the problems of parsing are if the correspondences in the underlying structure, in surface syntax and in the surface order of morphemes are to be made use of, while the differences are solved; we also wanted to illustrate the narrowed, but nonetheless necessary role of transfer.",
        "5.",
        "We wanted to point out that, on the one hand, the closeness of the two languages makes it relatively easy to find a strategy for an MT system, since the most complex problems of ambiguities might be partially avoided, although, on the other hand, comparative empirical research in the domains of lexicon and of syntax is necessary also for such a pair of languages.",
        "Results of such an approach may be useful in MT, and also in the context of a contrastive comparison of cognate languages."
      ]
    },
    {
      "heading": "References:",
      "text": []
    }
  ]
}
