{
  "info": {
    "authors": [
      "Helmut Schnelle",
      "Garrison W. Cottrell",
      "Pradip Dey",
      "Peter A. Reich",
      "Lokendra Shastri"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-2124",
    "title": "Panel: Parallel Processing in Computational Linguistics",
    "url": "https://aclweb.org/anthology/C88-2124",
    "year": 1988
  },
  "references": [],
  "sections": [
    {
      "heading": "Introduction",
      "text": [
        "The topic to be discussed by the panel is new and at present very much under debate.",
        "Parallelism is developed in a large variety of approaches.",
        "The panel will make an attempt to clarify the underlying concepts, the differences of approach, the perspectives and general tendencies, and the difficulties to be expected.",
        "Some differences of approach will be illustrated with examples from the work of the panelists.",
        "The common context of our approaches is the following:Standard computational linguistics tries to solve its problems by programming a von Neumann computer.",
        "The execution of the programs is inherently sequential.",
        "This is implied by the fact that there is only one central processing unit (CPU) executing the program.",
        "In contrast to this, parallel processing defines the solution of problems in terms of sets of computational units which operate concurrently and interactively, unless sequentialized for simulation purposes.",
        "Various approaches to parallelism differ in the computational power they assume for the concurrently active units.",
        "The differences may be outlined as follows: Massively parallel systems are usually systems whose units are, intuitively speaking, purely reactive units, i.e. mathematically defined by a specific function relating the state and output of a unit to its inputs.",
        "They could also be called connectio-nist systems in the wide sense; connectionist systems in the narrow sense are those whose functions are based on weighted sums of input activities.",
        "In contrast to these systems, the units may be themselves complicated systems which compute their states and outputs depending on the messages and control signals which they receive.",
        "The units cooperate in solving the problem.",
        "In typical cases, each unit may be a central processor unit or even a complete computer.",
        "Systems with cooperative processors (computing \"agents\") are usually considered to be non-massively parallel.",
        "These distinctions suggest different metaphors used in informal talk about the systems: the neural net metaphor on the one hand and the society of minds (demons) metaphor on the other.",
        "Given this context the panelists have answered the following questions: I.",
        "How is the dynamics of your system defined?",
        "- I.",
        "(A) 1.",
        "What is the computational power of a single unit in your approach I.",
        "(A) 2.",
        "How is the interaction or the interdependency between concurrent units defined?",
        "I.",
        "(B) How do you implement your system?",
        "- I (C) Which methods are used for programming?",
        "II.",
        "What is the representational status of your system?",
        "- II.",
        "(A) Which parts of grammar or dictionary do you model with your system?",
        "II.",
        "(B) Which parts of grammar or dictionary do you model by a concurrent unit of your system?",
        "- II.",
        "(C) Is there a general method such that a grammar determines uniquely a parallel implementation or is this implementation an art?",
        "The answers given seem to be particularly appropriate as an introduction to the topic and will thus be presented in the subsequent passages.",
        "(The answers of the different panelists and the organizer are prefixed by their initials)",
        "I.",
        "How is the dynamics of your system defined?",
        "I.",
        "(A) 1.",
        "What is the computational power of a single unit in your approach (a Boolean function, a specific numerical function, a mapping of vectors, a mapping of strings or files, a mapping of trees or configurations of other types, or the power of a CPU or a complete computer)?",
        "G.C.",
        ":There are no formal limitations on the power of a unit in my system; the power is a matter of taste, and is expected to be restricted to simple functions.",
        "For example a numerical approximation to Boolean functions of the inputs, where the inputs are further broken down into functions of input sites.",
        "My implemented system has several hundred units.",
        "P.D.",
        ":Each unit has the power of a VAX11/750.The units share their memories.",
        "I'm thus currently working in a shared memory multiprocessing environment.",
        "Specifically, my algorithms run on a 30 processor (=unit) Sequent Balance 21000 machine.",
        "This is large grain parallelism.",
        "I prefer the environment of large grained shared memory multiprocessors, because they are the most popular general purpose parallel computers available today.",
        "Earlier, I developed some algorithms for a medium grained tree machine, namely the DADO parallel machine.",
        "J.D.",
        ": Each unit implements a simple numerical function, sometimes a simple combination of several functions computing input from several sites of incoming activation.",
        "P.A.R.",
        ": Each unit has the power of a finite state device (under 32 different sta-tes).There are 16 different types of units which differ in their finite state definition.",
        "They implement (sometimes only slightly) different logical functions over their input activations.",
        "The more important ones are: concatenation (logical followed by), conjunction (logical and), disjunction (exclusive or), precedence disjunction (if both possibilities are realizable, one takes precedence over the other), random disjunction (pick a choice at random),interjunction (inclusive or), intercatenation (inclusive or; if both: concatenation), zero (network dead ends producing nothing), bottom edge (network outputs something), top edge, feedback barrier.",
        "Units operate independently of one another and asynchronously.",
        "H.S.",
        ": There are two descriptive levels: large grained and small grained.",
        "On the former each unit is a (special purpose) Turing machine (not a universal one).",
        "On the small grained level, each unit implements either a simple Boolean function or a simple numerical (additive, fixed length) function.",
        "The large grained net is a partitioning of the small grained net; its Turing machines are similar to von Neumann's growing cellular automata.",
        "L.S.",
        ": Each unit implements a numerical function - the most complicated ones have the form: If input al > 0, then take the product of inputs bi,b2,...b■, else take the product of inputs ct,c2,...c..",
        "A.Y.",
        ": Each unit is a single CPU with memory.",
        "My approach involves thousands of units.",
        "I.",
        "(A) 2.",
        "How is the interaction or the interdependency between concurrent units defined?",
        "Is it strictly connectionist and thus also defined by a function?",
        "Or is it cooperative and thus defined by the messages sent, encoded and decoded by the units?",
        "Is there a distinction between data messages and control-signal messages or is it a data-flow system?",
        "G.C.",
        ": Units pass values in a strictly connectionist way.",
        "P.D.",
        ":The system is a shared memory system.",
        "All units have in principle access to the same information.",
        "Actual interaction is defined by shared variables.",
        "That is, processes communicate with each other through shared variables.",
        "J.D.",
        ": The system is strictly connectionist, i.e. there are no symbolic messages.",
        "Each unit computes the weighted sum of inputs.",
        "P.A.R.",
        ":Each unit is connected to at most three other units in the network.",
        "The connections are active or not.",
        "According to their function, three different signals may be distinguished: production signal and positive feedback, negative feedback, and anticipatory.",
        "H.S.",
        ": On the small grained level the system is connectionist, but not strictly, since not only weighted sums of inputs are allowed but also other simple functions.",
        "L.S.",
        ": The system is strictly connectionist.",
        "A.Y.",
        ": The interaction between units involves message passing.",
        "Messages carry either control information or data or both.",
        "I.",
        "(B) How do you implement your system?",
        "By simulation on a von Neumann computer or by programming on a universal parallel machine (like the connection machine) or by designing hardware (e.g. a special-purpose information processing network)?",
        "If the first, do you plan to implement it eventually by a parallel system?",
        "G.C.",
        ": The system is simulated on a VAX.",
        "P.D.",
        ":The system is being implemented on a 30- processor Sequent Balance 21000 machine.",
        "It is currently being implemented in parallel-C running under Unix.",
        "When a parallel LISP becomes available, it will be implemented in parallel LISP.",
        "J.D.",
        ": We use the Rochester Connectionist Simulator on a SUN-3 with Graphics Interface.",
        "Implementations on a Sequent (Parallel Unix Machine) are planned.",
        "P.A.R.",
        ": Simulation on a personal computer using standard programming language.",
        "H.S.",
        ": The connectionist net is defined on a spreadsheet such as LOTUS 1-2-3.",
        "Some cells of the spreadsheet are identified with the units of the net to be programmed.",
        "In each of these cells a formula for a function is entered; it determines the reactivity of this cell to the states of those neighbouring cells whose addresses are arguments of the function.",
        "Thus, the addresses of the formulas on the spreadsheet implement the connectivities between the formulas.",
        "We run the spreadsheet in the computation-mode: itera-tive,columnwise, which defines the sequential simulation.",
        "By definition the different cells of the spreadsheet could operate concurrently in each iterative step; their operation is sequentialized (and thus adapted to the simulation on PC) only through columnwise computation.",
        "L.S.",
        ":By simulation on a von Neumann computer.",
        "A.Y.",
        ":By simulation of a von Neumann computer, and also parallel computers",
        "(C) Which methods are used for programming?",
        "Parallelizing of existing non-parallel programs or independent programming?",
        "Methods of hardware design?",
        "G.C.",
        ": A network is constructed from a high-level specification such as a grammar.",
        "This is given to a network construction routine that specifies the model based on the grammar.",
        "P.D.",
        ":The computational model is MIND (multiple instruction multiple data stream).",
        "Parallel programs are developed primarily by data partitioning, although function partitioning is also used.",
        "J.D.",
        ": Independent programming.",
        "Networks are constructed by writing a C program and use of library function of the simulator.",
        "P.A.R.",
        ": The system is programmed by constructing the grammar in network form.",
        "There is an algorithm for representing the network in terms of algebraic formulas.",
        "Nodes are defined by a series of state transition rules.",
        "The grammar is tested by inserting initial input signals and running the simulation.",
        "H.S.",
        ": There is a compiler which produces automatically for any given CF-grammar a corresponding network.",
        "The processes on the network correspond to the processes defined by an Earley chart parser but, in contrast to the latter, all processes are executed concurrently whenever this is possible.",
        "In particular, all parsing paths are followed up in parallel.",
        "Hardware design of networks is planned.",
        "L.S.",
        ": A 'compiler\" is provided that translates a high level specification of a conceptual structure (semantic network) into a connectionist network.",
        "It is proved, that the network generated by the compiler solves an interset:Lng lass of inheritance and recognition problems extremely fast - in time proportional to the depth of the conceptual hierarchy.",
        "A.Y.",
        ":We designed an object-oriented concurrent language called ABCL/1 and program parsers in this language.",
        "I.",
        "(D) Is your system fixed or does it learn ?",
        "If the latter, which learning functions or learning algorithms are used?",
        "J.D.",
        ":Learning is the most important topic.",
        "Natural language descriptions of structured objects are learned.",
        "These objects are also present in a restricted visual environment.",
        "The interaction between language and vision in learning is investigated.",
        "Various forms of weight changes are used: Hebbian learning with slow weight change, fast weight change for temporary binding, modified Hebbian learning with restriction on the increase of weights.",
        "P.A.R.",
        ": A substantial number of learning rules have been developed but not yet implemented on computer.",
        "Learning involves \"ingestion\" and \"digestion\".",
        "Ingestion consists of co-occurrence rules.",
        "If two signals previously unconnected co-occur, they are connected together.",
        "Digestion makes use of equivalence relationships to simplify the network.",
        "Equivalence relationships include: associativity, commutativity, distributivity, and a number of other relationships which have no name in standard algebra.",
        "Ingestion and digestion operate more or less alternately.",
        "First a piece of new information is connected to the network, then equivalence relations are tried in a search for simplification.",
        "L.S.",
        ": Structure is fixed but weights on links can be learned using a Hebbian weight change rule.",
        "G.C.,P.D.,H.S.,A.Y.",
        ": Our systems do net learn.",
        "II.",
        "What is the representational status of your system?",
        "II.",
        "(A) Which parts of grammar or dictionary do you model with your system?",
        "G.C.",
        ":I have separate systems designed to work together to handle lexical access, case-grammar semantics, and fixed-length context free grammar.",
        "P.D.",
        ":Lexicon, grammar and semantics.",
        "The lexicon has words with their categories, subcategories, and lexical meaning.",
        "J.D.",
        ":Fixed-length context-free grammar.",
        "P.A.R.",
        ":In theory the entire system from a representation of general cognitive information through language specific \"deep\" or \"functional\" structure, through a syntax-morphology structure, and then through a phonological structure.",
        "In actuality, the syntax-morphology and phonology sections have been worked out in greatest detail, and the functional structure in bits and pieces.",
        "H.S.",
        ":Syntax and phonology as a part of a lexical access system.",
        "L.S.",
        ": Domain knowledge in terms of a hierarchy of concepts/frames - where each concept is a collection of attribute-value (or slot/filler) pairs.",
        "Such information structures are variably referred to as frame-based languages, semantic networks, inheritance hierarchies, etc.",
        "A.Y.",
        ":Syntax and some semantics.",
        "II.",
        "(B) Which parts of grammar or dictionary do you model by a concurrent unit of your system?",
        "G.C.",
        ": I use a localist approach: One unit stands for a word, a meaning, a syntactic class, and a binding between meanings and roles, syntactic and semantic.",
        "P.D.",
        ": Parts of syntax; lexical search is also parallel Localist representation, i.e. one syntactic category - one unit P.A.R.",
        ":Each category (such as noun phrase) is distributively represented by many units.",
        "H.S.",
        ":(Localist; on small grained level:) Each occurrence of a category-in-rule-context (a dotted rule in Earley's parser definition) is represented by a unit.",
        "(On the large grain level:) The set of possible small grain units of each category corresponds to a Turing machine, such that one of its units represents the current state of the \"head\" of the TM and the others its \"tape\".",
        "L.S.",
        ":(Localist:) A unit may \"represent\" a concept, an attribute, a value, a binder between (concept,attribute,value> triples, or control nodes that mediate and control the spreading of activation among these units.",
        "A.Y.",
        ":(LocalistO Each grammatical category is represented as a unit, actually each occurrence of each category in a grammar description is a unit.",
        "'II.",
        "(C) )c there a general method such that a grammar determines uniquely a parallel implementation or is this implementation an art?",
        "G.C.",
        ":Given a grammar, I have an algortihm to generate the network for that grammar.",
        "P.D.",
        ":Parsing algorithms are developed for Tree Adjoining Grammars.",
        "J.D.",
        ": Implementation is still an art.",
        "P.A.R.",
        ": To a certain extent it is an art, at this point, but the comprehension-acquisition rules, if successfully implemented, should provide the general method.",
        "H.S.",
        ": Nriting grammars as high-level specifications is an art.",
        "From there on there is a general method (same answer as LoS.)",
        ":The networks are constructed from a high-level specification of the conceptual knowledge to be encoded.",
        "The mapping between the knowledge level and the network level is precisely specified.",
        "This mapping is performed automatically by a network compiler.",
        "A.Y.",
        ": Given a grammar, we have an algorithm to make a network of units.",
        "III.A short list of papers related to your research?"
      ]
    }
  ]
}
