{
  "info": {
    "authors": [
      "Elena V. Paducheva"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-2106",
    "title": "Referential Properties of Generic Terms Denoting Things and Situations",
    "url": "https://aclweb.org/anthology/C88-2106",
    "year": 1988
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Genoric term, can be divided into two referentially different groups.",
        "Generic term of the first group is a name (or a definite description.)",
        "of the corresponding class of objecta (cf. J a .gu a r a in South America are exAinct;Tne whale isamammal).",
        "An for generic terms of the second group, we propose to treat them as general terms (in the sense of W.O.Quine): they are considered to be referentially incomplete expressions which, when constituting the theme-of a ge-cerie proposition, undergo quantification which is expressed, explicitly or implicitly, inside the verb phrase.",
        ":introduction One of the moat important aspects of language comprehension is comprehension of reference • i,e, ofacorresponden-ce between a sentence (anal some of its constituents) and reality, which.",
        "is brought about by the speaker in the speech act.",
        "As is usual for a logical approach to language, types of reference, with the exception of concrete reference, are reduced to quantification of different kinds, and quantification can be defined, with a sufficient degree of precision, by stating truth conditions for sentences with the corresponding quantifier.",
        "Meanwhile generic expressions (in particular, generic terms) constitute a pumae for a theory of reference, for any proposed.",
        "formulation of truth conditions for sentences with generic terms is easily refuted.",
        "by contradicting examples.",
        "Thus, an attempt to reduce referential meaning of the generic indefinite article in English to that of the quantifier adjective any (made in Jeapersen 1927) can be demonstrated to be futile; in fact, statement (la), for example, is usually considered to be true, while (lb) is definitely false (though any and all are synonyms):",
        "'All norwegians are tall'.",
        "An attempt to capture referential aspects of the meaning of a generic term with the help of a \"quantifier of majority\" (Parsons 1970) or a quantifier 'usually' may be, perhaps, successful for sentence (la), wnich is approximately synonymous to sentence (2): (2)horveicy oby6no vysokogo rosta 'Norwegians are usually tall; but the idea of majority has nothing to do with the meaning of such sentences as",
        "(3) Kit - mlekopitajuMee",
        "(4) A t o m sostoit iz jadra i elektronov 'A t o m consists of the nucleus and electrons'.",
        "A suggestion was made to the effect that generic terms do not refer to entities of the real world at all.",
        "Thus, according to Wierzbicka 1980, in such sentences as (1) tallness is attributed not to a norwegian (i.e. not to a real person), but to our image of.anorwegian.",
        "However, this claim, even if it is true, cannot be true for all species of generic expressions.",
        "For one thing, generic terms can occur in the context of identity sentences, cf.",
        "(5) Deti 6-to buduHie ljudi",
        "From a formal point of view, what characterizes generic noun phrases, at least in languages without articles, such as Russian, is the fact that they do not comprise any determiners or quantifier adjectives, not only in the explicite but in the implicite form as well.",
        "In other words, generic hPs evade referential characterization: no words explicitely expressing the mode o f reference of a noun phrase (of.",
        "Pa-duCeva 1985) can occur within.",
        "a generic NP; moreover, no words can be added to a generic NP to make clear its referential meaning or meanings, as is obvious from examples (1) - (5).",
        "The analysis which follows aims at providing generic NPs with such an interpretation of their referential import that would match this formal characterization.",
        "Our direct aim is to provide an analysis for generic NPs of hussian, but many of the problems discussed are semantic in nature and thus language independent.",
        "2.",
        "Generic phrases denoting situations",
        "Generic use is common not only for noun phrases denoting objects, like those in (1) - (5), but also for noun phrases with propositional meaning, cf.",
        "(6) C v e t e n i j e rdi vsegda napomi",
        "naet mne na6alo vojny 'Flowering of rye always reminds me of the begining of the war'.",
        "(7) U b i j s t v o otvratitel'no 'Assassination is abomin-able'.",
        "Moreover, generic uses are possible also for predicative denominations of situations:",
        "(8) It often happens that a y o u n g man overestimates his resource s. (9) Operation is always dangereus when the patient is more than 70.",
        "(10)8e dines always in a hurry.",
        "(11) She usually got frightened when h e",
        "brought her flower s. (12)Ryba gniet sgolovy 'A fish rots beginning with its head'.",
        "(13)John beats his wife in the yard.",
        "Study of generic reference is usually confined to one particular class of generic 502 terms - to those denoting objects.",
        "What we claim is that at least in this case broadening the object of investigation will not complicate the whole picture; just the opposite, it may contribute to its clarification.",
        "3.",
        "Generics as a grammatical problem Generic use is a problem not only for referential semantics but also for a descriptive grammar of a language.",
        "To mention just two points.",
        "a) In the context of a generic NP grammatical Number (i.e. the opposition of Singular vs. Plural) cannot retain its usual meaning.",
        "However, on the one hand, the choice of Number in generic NPs is not rigidly regulated, i.e. synonymous variation of Number is possible, of.",
        "(14) a.Logad' - umnoje kyvotnoje",
        "'A h.orse isaciever animal'.",
        "b.Lo6adi- umnyje krvotnyje 'horses are clever animals'.",
        "On the other hand, Singular and Plural in - generic NTh are not freely -intarchangeable thus, it is impossible to say (15)Unasvdome zavels'a t a r a k a n (Sg) in the meaning 'There are cockroaches in our house', if only in the context of a \"language game\", and it is absolutely impossible to use sentence",
        "(16) *Glaz u etoj ryby imeet formu .",
        "grad (P1)",
        "in order to convey the meaning 'The eye of this fish has the shape of a AD-0 a r'.",
        "There is a strong feeling that the choice of grammatical Number in generic NPs is dependent upon their referential properties; in other words, it seems that different classes of generic NPs can be delimitated with different requirements as for the choice of Number.",
        "b) Another grammatical problem connected with generic expressions, concerns the choice of Tense and Aspect of the verb in a generic proposition.",
        "In Lyons 1978 it is suggested that generic propositions lie out of the scope of the Tense opposition (i.e. that they are omnitemporal).",
        "Lyons claims that this thesis is not disproved by such examples as (17)Dinosaurs were peaceful animals , because Fast Tense in such sentences corresponds only to the fact that dinosaurs are extinct end not to the fact that they have stopped being peaceful, as would be the case if Past Tense had been used here in its usual meaning.",
        "Still for such sentence as (18)1)inosaurs died out (became extinct) it would be absurd to maintain that it is omnitemporal: in (18) Past Tense has its most common meaning.",
        "4.",
        "Generic term and generic proposition The main conclusion that can be drawn from the existing literature on generics (cf. a substantial review, in Carlson 1978) is that generic expessions are heterogeneous (NR that in Russian even less information can be got from the grammatical form of a generic term than in English, because of the lack of articles).",
        "Thus the line of analysis which we follow in this study consists in making a series of delimitations that would divide generic expressions into several different groups so that each statement would apply only to that group of generic expressions for which it :Ls true.",
        "'First of all, it is necessary to separate generic NPs when used in the context of a generic proposition (or generic statement) from their occurrences in all other contexts.",
        "We propose the following definition: A proposition is called generic if a generic noun.",
        "phrase G constitutes its notional theme (topic), i.e. if this proposition is about G. Thus, in (19) proposition is generic: (19)Professional mathematician will read the book by M.Atja with pleasure.",
        "Indeed, (19) isastatement about professional mathematicians.",
        "Meanwhile, (20) is not a generic statement: • (20) The book by M.Atja will be of interest for professional mathematicians.",
        "In fact, (20) is not about mathematicians; its theme is a concrete individualized object - a book by M.Atja.",
        "Generic NPs constituting the subject of a generic proposition are more readily submitted to semantic analysis, for in this context referential import of genericity can be represented, at least in some contexts, an a kind of quantification.",
        "Indeed, if a generic NP is a subject of a proposition, then the quantifier which bounds this NP has maximum scope: its scope is the whole sentence.",
        "And if so then the referencial import of this quantifier, and hence of the generic NP, can be revealed by means of truth conditions of the sentence a s a w h o l e. Otherwise, i.e. in cases where the generic hP does not constitute the subject of the proposition, it is altogether unclear, what proposition constitutes the scope of the supposed \"generic quantifier\".",
        "Thus, for sentences in (21) logical representation is a puzzle: (21) a. Ivan can kills bear.",
        "b. John doesn't like police-m e n. c. Ego zasadilivkameru smert-n ikov 'He was put into the cell for men sentenced to death '.",
        "But even for generic propositions there is no unique formulation of truth conditions valid for all 'the contexts.",
        "To formulate truth conditions for generic propositions exhaustively it is necessary to reveal all relevant oppositions of contexts, linguistic and extralinguistic, in which the generic subject of a generic proposition might occur (note that the subject of the proposition need not coincide with its grammatical subject, especially in Russian).",
        "5.",
        "Generic NPs as names of classes In some contexts generic terms can be successfully treated as names (or descriptions) of the corresponding class.",
        "For example, generic terms used as subjects of predicates which are meaningless unless when predicated to classes (as to be a_ mammal; to become extinct in examples (3) and (18)), are best represented as names of classes (in English such' generic terms can only be marked by a definite article; in Russian they have no special distinctive features), cf. (22) Nekogda jaguar byl rasprostra-nen po vsemu zemnomu 6aru 'Some time ago the jaguar wan spread all over the world'.",
        "In Burton-Roberts 1976 it is claimed that",
        "generic terms which are actually names of classes, even when they occupy the thematic position in.",
        "the utterance, do not form any generic propositiont 14f denoting a class and referring to a class, can be treated as a term with concrete reference and with no corresponding quantifier in the logical reprosentation.",
        "of the proposition in question.",
        "it is obvious that for generic terms that are names of classes their position in the thematic or non-thematic part of the sentence is referentially irrelevant.",
        "ames of classes in many respects resemble mass terms ( such as water, poetry, in.formation etc.",
        "): like mass terms, names of classes a) Itave scattered reference and b) cosily tolerate partitive use.",
        "Thus, sentence",
        "'There are tigers in the Far East' does not purport to mean that a 1 1 t i gers live in the Par East, exactly like t:le sentence There is water in the vicinity does not mean that all water is in the vicinity.",
        "6.",
        "Generics as general terms As tor the \"typical\" generic expressions exemplified, e.g., by (1), (2), (4), we suggest to treat them as general terms in the sense of Quine 1953 or Carnap 1959.",
        "General term is an incomplete noun phrase, lacking referential specification.",
        "It has an extension, which is determined by its linguistic meaning.",
        "Usually-, the extension of a general term is an infinite set (or at least it is a set looked upon as infinite; in other words, it is an open set); of.",
        "extensions of such general terms as norwel,ian.",
        "(that includes all norwegians who existed, exist now or will exist in future), atom, man etc.",
        "General term has no reference - unless it is used in the context of some a c t u a 1 i - z e r (the term is due to Bally 1955), that converts this general term into a singular term referring to a definite, object in some definite speech act.",
        "It is usually accepted that general terms have a twofold usage; they can be used as predicates (cf. John is a norwe_g 504 a_n); and besides, they can be used as sub stantives, but only in the context of an ac-tualizer a quantifier adjective or a. determiner (perhaps, implicite, i.e. having a zero exponent, as is often the case in article-lacking languages like Russian), We claim that general terms afford also of the third type of syntactic and reforencial uses a general.",
        "term can be used as a subject of a generic proposition on the condition that the quantification in this proposition.",
        "adverbial, Le, quantification.",
        "markers of the subject form a part of the pr dicate, i.e. of the verb phrase of the '.taute sentence.",
        "In other words, we propane to treat generic terms as referencially incomplete expressfons their reference in specified outside the noun phrase itself, In this respect generic use of a noun man in the proposition Map is mortal, can be identified, e.g., with the use of the same noun in such contexts as ever man or this man, where man 12 definitely a general term lacking refe rence)and referential characteristics of the NP is specified by some external means.",
        "The same principle works in such examples as (24) There are r v ers that dry up in S IX al 1/1 r where rivers that dry upin summer is a referencially incomplete NT: its referencial specification is contained in the verb expressing existencial quantification.",
        "Quantification in the VP of a generic sentence may be of different kinds - both with respect to its forts and with respect to its meaning.",
        "As for its form, quantification can be either implicite, a8 in example (1) or (4), or e x p 1. jolt o, an in (2); cf. also the adverb usually, explicitely expressing quantification in (25):",
        "(25) A symphony usually consists of four parts.",
        "As for its meaning, quantification may belong to the type 'usually', as in (1); to the type 'always', as in (4); and besides, there are great many other semantic types of adverbial quantification in natural languages, these types of quantification hoirJg expressed explicitely by adverbs or advor-bials with the meaning 'often', 'sometimes', 'as a rule', 'mostly', 'in a typical case', 'almost always' etc.",
        "It must be borne in mind that quantification, when implicite, often remains linguistically undefined and substantially indefinite - in this case a proposition is understood with the type of quantification that will bring it nearest to truth, of: such platitudes as Extremes meet - to sound like truth it must be understood as 'Extremes usually meet' or even 'it may be the case that extremes meet'.",
        "Thus, for \"typical\" generic propositions, such as (1), two properties are substantial: 1) they ace quantified implicitely; 2) their quantification belongs to the semantic type 'usually'.",
        "Truth conditions for a typical generic proposition can be formulated as follows: (26) A generic proposition with the subject s and the predicate P is true if and only if for any x( Es (where Es is the extension of the general term s) it is usual l y the case that P(s) is true.",
        "The meaning of usually can be described in the same way as the meaning of other words is described in lexical semantics.",
        "Thus, s is usually P 'For most x E Es it is true that P(x), and this situation is considered to be natural'.",
        "This definition gives an explanation to the following example from Carlson 1978: sentence Books are usually paperbacks sounds odd, though it is, perhaps, true that most books are now paperbacks.",
        "The fact is, that this situation is not as yet considered to be natural.",
        "Adverbial quantification In a similar way truth conditions for other types of adverbial quantification in generic propositions can be stated.",
        "What is important is the fact that there are contexts in which adverbial quantification cannot be reduced to quantification over the extension of the subject term.",
        "Take example (27) Young people usually overestimate their resources.",
        "Its meaning cannot be adequately represented by means of quantification over the set of all young people: (27) 'Most young people overestimate their resourses'.",
        "What is meat in (27) is that for most cases when a young man estimates his (or her) resourses he overestimates them .",
        "So it is clear that quantification over situations and not over objects is involved here.",
        "In the same way we can represent the meaning of sentences (8) - (13) with generic names of situations from section 2.",
        "8.",
        "Grammatical problems revisited Referential oppositions that were introduced allow us to give explanations to at least some of grammatical phenomena connected with generics, which were mentioned in section 3.",
        "Thus, (28a) and (28b) are not strictly synonymous: (28) a.Amerikanec (Sg) delovit 'An american is effective'.",
        "b.Amerikancy(P1) delovity 'Americans are efficient'.",
        "The difference in meaning may be ascribed to the fact that (28b) is a usual type of generic propositions while (28a) describes our mental image of an American (in the sense of Wierzbicka 1980).",
        "Exceptional behavior of generic terms with respect to Tense, exemplified by (18), can-be explained by the fact that sentence (18) does not express a generic proposition: NP dinosaurs is here used as a name of class.",
        "Genuine generic propositions are, in fact, omnitemporal.",
        "9.",
        "Conclusion Our investigation can be looked upon as a proof of the thesis that for typical generic noun phrases a logico-semantic interpretation can be given which strictly corresponds to their surface structure (in article-lacking languages): generic terms can be treated as referentially incomplete phrases, with quantification expressed outside the phrase itself or not expressed at all."
      ]
    }
  ]
}
