{
  "info": {
    "authors": [
      "J. Ph. Hoepelman",
      "A. J. M. Van Hoof"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-1051",
    "title": "The Success of Failure the Concept of Failure in Dialogue Logics and Its Relevance for NL-Semantics",
    "url": "https://aclweb.org/anthology/C88-1051",
    "year": 1988
  },
  "references": [],
  "sections": [
    {
      "text": [
        "Two kinds of rules determine formalized discussions.",
        "The so called strip-rules determine how statements are attacked and defended.",
        "By means of these rules the meaning of the logical connectives is determined by their use (\"meaning in use\").",
        "figure The strip-rules state the following: a sentence uttered by the speaker, N, where N is 0 or P (column -1), can be criticised by the other pady (N*) as defined in column 2. the speaker then has the right to defend his sentence with another statement, as defined in column 3, This right is called protective defense right.",
        "The second kind of rules, called the frame-rules regulate the discussion as a whole.",
        "They define rights and duties of both adversaries during a discussion, and declare when the discussion is considered over, and still more important: they tell which party has won.",
        "Changes and/or extension of these frame-rules and strip-rules give rise to various systemst with different logical strength.",
        "It is this feature that makes Dialogue Tableaux Theory of interest for the study of natural language semantics.",
        "3.",
        "Failure in dialogue tableaux Nowadays, because of the success of prolog, people are greatly interested in the logical properties of negation interpreted as procedural failure.",
        "Interpreted in this way, negation does not conform to the well known properties of classical, intuitionistic, or minimal negation.",
        "Because of its procedurality, failure has been treated as a notion of (non-) provability.",
        "In this way it can be thought of as a modality in provability logics.4 In this paper we want to present yet another interpretation of failure in terms of discussions, which to our opinion is a fairly natural one.",
        "We want to make it clear from the outset, that this new interpretation of failure is not an interpretation for negation, as is the case in prolog.",
        "We will apply dialogical failure together with standard (classical, intuitionistic) negation.",
        "This makes sense because of the fact that we do not have the Closed-WorldAssumption in DTT.",
        "Dialogical failure is handled by introducing a fail operator F into discussions.",
        "The operator, applied to a sentence A, could be interpreted as \"There is no way to win a discussion on A relative to the present concessions\", or \"Nothing in the present discussion leads to the conclusion that A\".",
        "Rules for this operator introduce the concept of role-changing: actual parties B(lack) and W(hite) who play the roles of 0 and P will, under clearly defined conditions, change roles during a discussion.",
        "Winning and losing the discussion will be defined relative to B and W. Figure 2a and 2b give an informal presentation of the way F functions.",
        "figure 2a",
        "An attack on a fail statement \"FA\" at the P-side of the tableau (figure 2a) will introduce a subdiscussion on the winnability of \"A\" relative to the concessions made at the 0-side, with the parties (B and W) changing roles (the boxed-in part of the tableau).",
        "Concessions from the main discussion arc taken over completely.",
        "The result of this subdiscussion (who wins, who loses) is transferred back to the main discussion.",
        "An attack on a fail statement at the 0-side of the tableau (figure 2b) also leads to a subdiscussion, but there is no role change.",
        "There is also an extra constraint on the concessions to be taken over from the main discussion: only those concessions uttered prior to the utterance of the fail statement are allowed to be carried over.",
        "The fail operator enables us to deal with a broad range of much debated phenomena.",
        "In what follows, we will treat the following topics, it being understood that their treatment cannot be dealt with here extensively:",
        "1. the treatment of negative questions and their answers, 2. the paradox of the small number, 3. conditionals .",
        "(Proponent of the absurd thesis) lures the innocent debater (Opponent) into conceding sentences: \"Do you admit that 1 is a small number?\" \"Yes, I grant you that.\" \"Do you admit, then, that if some number is considered to be small, the direct successor of that number also is small.\" - \"Yes, I suppose that that is correct.\" Thus a set of seeming concessions is established, from which the sophist sets out to show absurdity.",
        "The opponent is not given the opportunity to amend his second concession by making a provision like \"unless, of course, this successor is not already agreed to be not small\" - which everybody tacitly understands.",
        "It is even possible to give a range of vagueness in the definition of small number by widening the pre-check, e.g. VX(Small(X) A F(--ISmall(X+1) v...v Small(X-1-k)) Small (X+1)).",
        "One can also extend the example by adding a definition of large number in an analogous way.",
        "Starting from definitely small on the one end, and definitely large on the other end, there are several distinct results as to which numbers can be called small or large or \"neither small nor large\", this depends on the exact applications of the recursive part of the definitions, i.e. it depends on how a proponent would go about attacking these concessions."
      ]
    },
    {
      "heading": "6. Conditionals",
      "text": [
        "Looking at it in a somewhat different way the solution to the paradox of the small number rests on a modification of the conditional in the premises.",
        "Or to state it in dialogical terms: it rests on a modification of the conditional in the concessions made by the opponent.",
        "We propose to introduce a connective \">>\" that will function as a new conditional with the above mentioned pre check behaviour.",
        "In some very important respect this conditional \">>\" will differ from the standard connectives of logic: its \"meaning in use\" cannot be stated in the same way as we already did for the other connectives in figure 1.",
        "The strip-rules for the standard connectives are neutral as to the discussional role of the speaker.",
        "The strip tule for \">>\" that we will present in a moment is role specific, however.",
        "That means there is a version for the case of an opponent statetement and one for the case of a proponent statement.",
        "We will try to argue for this asymmetry.",
        "tun, 5",
        "Let us look first at the strip-rule for opponent statement5 (figure 5).",
        "The opponent has two possibilities for protective defense.",
        "One of them is stating the consequent of the conditional.",
        "So far there is no difference with the material implication (-4).",
        "But whereas this move is the only protective defense with material implication, with the new conditional, however, the opponent has an extra protective defense right: he can try to show that the negation of the consequent already follows from the concessions.",
        "This is exactly the analogon of the pre-check condition as asked for in the paradox of the small number.",
        "It is possible to give a simple translation for p>> q in terms of F and > where the formula on the opponent side is F--.q (p --> q ) .",
        "We now turn to the rule for conditional statements made by the proponent.",
        "Our job is to show why the same treatment as for opponent statements would not do.",
        "Let us suppose that the conditional can be translated as above, for a start.",
        "In which situations, then, can a proponent win a discussion on such a statement relative to a proponent that has conceded the set E of concessions?",
        "Basically there a three possibilities: i) 1p is contained in or derivable from ii) q is contained in or derivable from E together with the new concession p, and iii) is contained in or derivable from E. Cases i) and ii) present no surprise.",
        "Taken together they make up the possibilities the proponent would have if he had stated plainly p q, instead of the complexer formula.",
        "But the more complex one provides him with the extra possibility iii), which is utterly undesirable for any conditional: the possibility to prove the conditonal because the consequent does not hold, regardless whether the antecedent holds or not.",
        "The intermediate conclusion to be drawn from this is that on the proponent side >>-statements can and must be weakened to at least material implication.",
        "But we do even want to go one step further.",
        "We want to rule out the possibility that the proponent can prove a conditional statement relative to a set of concessions without the need to use the antecedent of the conditional.",
        "Such a situation obtains if the consequent is contained in or derivable from E. The way to bar such a 'proof is to provide the opponent with an extra attack move: he can try to show that the consequent is derivable already.",
        "The strip-rule for \"\" on the proponent side is then as shown in figure 6.",
        "For people who like translation lore: using material implication, conjunction and failure operator p>> q is translatable as Fq A (p q).",
        "figure 6",
        "The conditional \">>\" bears close resemblance, we think, with natural language indicative conditional if it is treated in formal dialogues in the manner indicated.",
        "On the one hand it has default characteristics, giving rise to a non-monotonic logic.",
        "The paradox of the small number is a case in point, but it can even better be exemplified by the case of the famous Tweety.",
        "Only knowing that Tweety is a bird and conceding that birds can fly, an opponent has to agree under these circumstances that Tweety can fly.",
        "But upon hearing that Tweety has no wings and it being understood that wings are an absolute necessity for flight, this same opponent can safely withdraw his consent to Tweety's flying capabilities without becoming inconsistent.",
        "He can safely claim that the new information made it necessary for him to reconsider his prior agreement.",
        "If one were to investigate the dialogue tableau for the Tweety case with additional information, one would see that the subdiscussion ensuing from the opponent's extra defense right for \"\" exactly contains the successfull arguments against Tweety flying.",
        "This agrees with the actual way people use to argue: A: \"Birds can fly.\" B: \"But tweety is a bird and cannot fly!\" A: ''Yes, but Tweety has no wings and wingless birds cannot fly.\" Antecedent strengthening, transitivity and contraposition are not universally valid anymore with this conditional , but they are assumed per default.",
        "In this way we can cover famous examples like:",
        "If I put sugar in my coffee it is drinkable (tacit premise: putting oil in coffee makes it undrinkable) If I put sugar and oil in my coffee it is drinkable *(2) If I have an affection of the lungs I will stop smoking If I stop smoking I will feel healthier (tacit premise: affection of the lungs does not make feel healthier) If I have an affection of the lungs I will feel healthier *(3) If I strike this match it will burn (tacit premise: if the match is wet or has been used already or ... then it willl not bum) If it will not burn then I did not strike it Given the tacit premises our conditional will handle all these cases correctly.",
        "It is realized that this conditional as it stands cannot do the job of so-called counterfactual conditionals.8 But we are convinced that these counterfactual conditionals can be build from \">>\" together with formal dialogue rules that take care of blatant inconsistencies that arise from the fact that the antecedent of the counterfactual may contradict explicit information in the premises."
      ]
    },
    {
      "heading": "Notes",
      "text": [
        "*.",
        "Parts of this paper will appear in the Journal of Semantics.",
        "1.",
        "See Barth 1985 and Barth & Krabbe 1982, 2.",
        "For a collection of his writing on dialogue logics see Lorenzen & Lorenz 1978.",
        "3.",
        "See e.g. Hintikka & Kulas, 1983, 4.",
        "E.g. in Gabbay 1986.",
        "5.",
        "For a collection of articles on this topic see e.g. Kiefer 1983.",
        "6.",
        "This is discussed extensively in Hoepelman 1983.",
        "In that article a four-valued logic is introduced to deal with negative question phenomena.",
        "It turns out that the analysis with fail operator in the present paper achieves the same results as the four-valued approach.",
        "The present version, however, has as additional merit it's greater elegance and naturalness.",
        "7.",
        "Probably it was this kind of pre-check behaviour that McDermott & Doyle wanted to achieve with their operator M (McDermott & Doyle 1980).",
        "They have run in some problems with that operator, however, due to a certain circularity of their operator definition.",
        "If we translate Mp as F-19, however, we achieve this pre-checking without getting their problems.",
        "8.",
        "For a collection of articles on conditionals, indicative and counterfactual, see Harper et al.",
        "1981."
      ]
    }
  ]
}
