{
  "info": {
    "authors": [
      "Hideto Tomabechi",
      "Masaru Tomita"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-2137",
    "title": "Application of the Direct Memory Access Paradigm to Natural Language Interlaces to Knowledge-Based Systems",
    "url": "https://aclweb.org/anthology/C88-2137",
    "year": 1988
  },
  "references": [],
  "sections": [
    {
      "text": [
        "that the concept which represents the request for action is directly connected to the concept that represents the action that is requested.",
        "Likewise, the direct memory access recognition of a question means that the concept which is identified by the input is directly connected to the concept that represents the answer, as long as the system knows (or potentially knows) the answer.",
        "In other words, in the DMA model, recognition of a request for action is a triggering of the action requested and recognition of a question is knowing the answer (i.e., as soon as we understand the question, either we know the answer, or we know the inferences to be performed (or functions to be evaluated) to get the answer) as long as memory contains the action and the answer.",
        "To reiterate the literature on the DMA paradigm, in this model, memory is organized in the hierarchical network of concepts which are related by links that define the concepts.",
        "Thus, as soon as we identify the input with a certain concept in the memory, we can trigger the action (if this is a concept that represents some action (or request for action)), or answer the question (if the concept represents some knowledge (or request for some knowledge)).",
        "Thus, parsing and inference are integrated in the memory search process, and no separate inferential modules are necessary.",
        "It should be understood; however, that it is not our claim that we can eliminate inference altogether.",
        "Our claim is that 1) the memory search through concept refinement itself is an inference which is normally performed by separate inference modules (such as contexual inference and discourse analyses modules) in other parsing paradigm; and 2) whenever further inference is necessary, such inference can be directly triggered after concept refinement from the result of parse (for example, as a daemon stored in the abstraction of the refined concept) and therefore, the inference is integrated in the memory activity.",
        "C. Ellispsis and anaphora In a practical natural language interface, the capacity to handle elliptic and anaphoric expressions is important.",
        "DM- COMMAND is capable of handling these phenomena, because under the DMA paradigm (which is typically called \"recognize-and-record paradigm\"), the result of each parse is not lost after each sentence, but instead remains as part of the contexual knowledge in the memory network.",
        "On the other hand, in the traditional parsing paradigm (we call it \"buildand-store\" paradigm), since the result of the parse is lost alter each sentence, the parsers can at best handle indexicality within a sentence.",
        "Specifically, 1) ellipses are handled by DM-COMMAND; since ellipses are characterized as the lack of elements in a concept sequence, and these are recoverable as long as the elements or their descendants had been activated in previous parses14; 2) anaphoric and pronoun references are 14 For example, with the input \"jgr92.gra o uchidase.",
        "waist mo.\" (Print jgr920-a.",
        "Semtst also).",
        "Second sentence has the object droped; however, resolved by utilization of both semantic knowledge (represented as restrictions on possible types of resolutions) and also by the context left from the previous parses in Inetnoly similar to the way that the elliptic expressions are handled.",
        "Finding a contexually salient NP corresponding to some NP means, in DMA, searching for a concept in memory which is previously activated and can be contexually substitute fox currently active concept sequence.",
        "D. DMA and syntax One weakness of current implementations of the DMA paradigm is that the concept sequence is the sole syntactic knowledge for parsing16.",
        "Therefore, a DMA system needs deliberate preparation of concept sequences to handle syntactically complex sentences (such as deeply embedded clauses, small causes, many types of sentential adjuncts, etc.).",
        "This does not mean that it is incapable of handling syntactically complex sentences, instead it means that concept sequences at some level of abstraction (at syntactic template level down to phrasal lexicon (Beckerl19751) level) must be prepared for each type of complex sentence.",
        "In other words, although such sentences can be handled by the combination of concept sequences, designing such sequences can be complex and less general than using external syntactic knowledge17.",
        "Thus, current reliance upon a linear sequence of concepts causes limitations on the types of sentences that can be realistically handled in DM-COMMAND.",
        "Of course, there is nothing to prevent DMA paradigm to integrate syntactic knowledge other than a linear sequence of concepts.",
        "Actually, we have already implemented two alternative schemes for integrating phrase structure rules into DMA.",
        "One method we used was having syntactic nodes as part of the memory and writing phrase structure rules as concept sequences18.",
        "Another method was to integrate the DMA memory activity into an augumented context-free grammar unification in a generalized LR parsing.",
        "Second method used in a continuous speech understanding is described in Tomabechi&Tomita[ms].",
        "We will not discuss these schemes in this paper.",
        "While handling syntactically complex sentences is rather expensive for DM-ComivtAND, since it relies solely on linear concept sequences, natural language interfaces are one appli this can be supplied since the memory activity after the first sentence is not lost and the memory can supply the missing object.",
        "cation area where the capacity to handle phenomena such as ellipsis, anaphora, pronoun resolution, and contexual disambiguation is more valuable than handling syntactically complex sentences.",
        "It seems that DMA is one ideal paradigm in this area.",
        "This is evident if we consider the fact that input to a natural language interface is normally in a form of dialog and users tend to input short, elliptic, ambiguous and even ungrammatical sentences to the interface.",
        "Our experience shows that an increase in the size and complexity of the system in order to integrate full syntactic processing, enhancing the DMA's capacity to handle syntactically complex sentences, has so far outweighed the need for such capacity.",
        "KKole semantic networks and portability DM-CommAND utilizes two types of semantic networks.",
        "One is the semantic network that is developed under the MT system as domain knowledge that DM-CommAND utilizes.",
        "The other is the network of memory which is unique to DM-COMMAND.",
        "This memory represents a hierarchy of concepts involved in commanding and question-answering necessary for the development of machine translation systems.",
        "'This memory network is written with generic concepts for development of MT systems, so that this memory we have developed at CMT should be portable to other systems20.",
        "The control mechanism (i.e., spreading activation guided marker-passing algorithm) and the actual functions for performing actions are separate (actual functions are integrated into the DM-COMMAND memory network).",
        "This separation makes the system highly portable, first because virtually no change is necessary in the control mechanism for transporting to other systems, and second because the size of the whole system can be trimmed or expanded according to the machine's available virtual memory space simply by changing the size of the DM-COMMAND memory network21.",
        "Thus, under DMA, a natural language interface can 1) directly spread markers on the target system's already existing semantic network22, utilizing the existing knowledge Although, we have seen that it is effective in parsing noisy continuous speech input (Tomabechi&Tomitahnsi).",
        "\"Of course, we will need to change the specific functions that are stored in some of the nodes and perhaps some of the specific (lower in the hierarchy) concepts need to be modified for each specific system.",
        "2' If only a basic command natural language interface is required, then we can trim the parts of memory used for advanced interface and question answering.",
        "On the other hand, if machine's memory is of no concern, we can write memory-net and concept-sequences for all the system functions of the target MT cystem.",
        "Also, note that due to the spreading activation guided marker-passing algorithm of the DM-CommAtsp recognizer, the speed of the system is minimally affected by an increase in the size of the memory for commanding and question-answering.",
        "It is because spreading activation is local to each concept and its packaged nodes under guided marker-passing that even if the size of the whole memory network increased, the amount of computation for each concept should not increase accordingly.",
        "'As long as semantic nets are implemented in a general frame language or object oriented systems.",
        "for understanding input texts; 2) utilize a command and query conceptual network developed elsewhere (such as DM- COMMAND), with minimum modifications in the functions stored in the root nodes that ;trigger the actions; 3) be ported to different systems with virtually no change in the control mechanism since it is a guided spreading activation marker passing mechanism and no system specific functions are included (those functions are included in the comand/query semantic net).",
        "V. Conclusion DM-COMMAND is the first practical application of the DMA paradigm of natural language understanding, in which parsing and tnemory-based inference is integrated.",
        "This system has been proven to be highly effective in knowledge-based MT development.",
        "It is due to the complexity of system implementations in a large scale MT project that grammar and knowledge base writers are not expected to have expertise on the internals of the translation system, whereas it is necessary for such a group of project members to access the system internal functions.",
        "DM-COMMAND makes this access possible through a natural language command and question answering interface.",
        "Since DM-CommAND uses the spreading activation guided marker-passing algorithm, in a memory access parser which directly accesses the MT system's already existing network of concepts, inference is integrated into memory activity.",
        "Since there is a separate memory network for concepts representing commanding and question-answering that are generic to MT system development, the system is highly portable.",
        "The DM-COMMAND system demonstrates the power of a direct memory access paradigm as a model for a natural language interface, since understanding in this model is a recognition of the input sentence with the existing knowledge in memory, and as soon as such understanding is done, the desired command can be directly triggered (or the question directly answered).",
        "With DMA's ability to handle extra-sentential phenomena (including ellipsis, anaphora, pronoun reference, and word sense ambiguity), which are typical in a practical natural language command/query inputs, DMA is one ideal paradigm for natural language interfaces as shown in our DM-COMMAND system.",
        "Also, DMA's integration of parsing and inference into an unified semantic memory search has proven to be highly effective in this application.",
        "Appendix: Implementation The DM-COMMAND system has been implemented on the IBM-RT23 and HP9000 AI workstations, both running 23Due to the space limitation, the actual sample output of the system is not included in this proceedings paper.",
        "The technical report from CMU665 i^i.or OK cei Valtikrlittitaii;thrik, 1.1A tooKrarkte rorietr hi the CO0C 'p ilitdt ilk, le 01errated after the pane.",
        "'fhe.",
        ": specific functions fon iggering the tiOthrtlatirik erre StOred it WirtRheIt tit tik0 Cage Of ..triktihirktt-ffatilh'i fire, fikkiCriOrk (lrAMENTrg function for thetty-thint;tig a flame object) is stated.",
        "the newly eteatert human inhetas this floc.",
        "httlik ottotilthe objed otpittiy-plitging instant:5.4:A to tee ':iliti.vit-A-ti/tIN MAO is a cub ;act: of iiettrt attyr aitti, is the Otijerit Of printing in out example jump:.",
        "With it tri [AVIAkiallirat language undettitauding petitititted ns memory search h the network et COheepiik, h/yik::6itifying input with the Sp-Nitre t)ctie Sk: ki a thot coticept9 atrii then pox-footling COitisk,iir Ott: Weirikti ititerfaCe tO the 14,SA kkodev we will only itttott toevaluatell) o.:,,Sc,, and OROS ati SOfth tIS the parse; eihkh.s:takI tal,t.i IS directly petrol-DOA ILikowiNe, the Fwajto language, inn:efface for higgering SyWaal ftliketirhis is inn44nd Itofirrriiitty :keakkeli aetiVity raider the rjilVtiti't aVaIlKiwt way, itetittC 1.1$ integrated into natural language cut;stand; ng.",
        "J(V,V,._gik:yeittreAohAr:: 11Pit/UAehtett ticiji,cohdoil o airier fri; liathrat tthiguage interface to the internals be machitte translation system to work, the into:face must het able to reeOgraitZe the hiptd based OH What it 1)toody krfirrsTh as domain specific knowledge in the area of translation and the systent's own iniplementation, When some araii0i1 ikk to htiafikikted the ifikeffaCe Moat thidellstaiad the request and respond according 6) what a itiquestehi, and therefohe a is necessary to nzognize ii, input wlthiti ilk context of the ti tie 1olow1 eitpie Chihralt, discouts, and to nigger the sraent's ith ietndl fancikota appropriately.",
        "For example, if a knovviedgebase developer inputs \"show me all the imtpping lutes on *HIP-DOWN :LINER\" in Order to debug some conceptual inig prohavviti refeandice resolution, ellipses, and some typos of anaphora (exuuples are included hi the Appendix) AlE0, rglii-COMMAnD O000agaiioit itt diaaitibigtiaie ::;ffitiO Of th0 coata.uc.11y difli Olt ;ett-ittitctig.",
        "Toth4swital[19g/h] gives at deo:kited description of this disarithigua ;ihaL ?tE.teiELE:EdE -\":of this itielitcd is that thif-, atiata; cat.",
        "00;y whot tlicy lit a pfusireCified SOklizeir1 l,Ue ii (pathhit); it,tths, lass its; iihtwork is itit itliteditauce-net, we c.all eacodu vi.Ay Ee E4XpEllee^ti which Eett lila.",
        "aytitactic tAaliplattis.",
        "ili irotample, riot: ac_c,.",
        ":':'inature'' *physical-object> (lhatorc*nritoruble) attatlien .",
        "Et et.t.",
        ":..,ept I\"OLyri,A-ObjeCt Ic gitftillia.to repte;:t3ifing aI lie 1(1101 iaalc' AI OP.",
        "Thug:,we C:flet 01COOlt atAratit Coraccitiit With -Arita skk well aS StirlarSOS Of sysSikis coats/pis that Ii as iithArriSthieri in Pir/hVhirtirr sysiCkti t the iiiggeihig Viiiich it: comparable to Juessage passing in objechoticitted spa:ans.",
        "triakkial takighar,i hat fettogniy,,i; what \"mapping rine- p,titipitt ti6V,ikrkeirgeittkiSti.",
        "11h:if:hide kr:kW-kit/diet!",
        "i1eVehkiiiiikki.6k",
        "//k.h/M whelklitar input is \"Pk o.1 Ixe.,flu: komdipavsuat cacti se-i, .nuitei-standinr 6 thisis impossittitt.",
        "tntr,..",
        ".",
        ";:tanttte input act ''n'tine d natptit to Itile Tatit:tiA;KC; t-,011aa-tact,),Ayeki-net;teat:11kta;stit",
        "iOpat wtthatteatly knows.",
        "as ditieehi edge anti !ts nook/ledge about the SykikeitiV./i1:6: Also, the result or each parse is not lot; Let aticimin thO aCitVC illernOly 10n1W0i k I I, 0.k4' riacsei.",
        "for a natural htiu_nage binnfach io needs to recognixoinput.",
        "itccoithng in witta.NI.. tent atready katews as the ii.ttowledge soattat i0 ha own hire:111th ikripirrheikikrikok is, /1, kkiiilikkokkiil 1thhket12 will 11AV:die ark eatertial infenaMat perform the tasks of conitatutti disambitteion and ittce i-tag tat skiatelhily, for the apprOpk:ithe aciion flf,in1411-111,11.",
        "dc/ill ;aiP jg-4tietilaor itittn iii awititixttuti,qtlly, the, ki61iise inert:Me anti Oat parfait must, intetaet diui-mg eeccia, aut., constraints put Oh ill() understanding of die system whine dy: (..aredext establishaal by the 8 nowita Ipu domain a ud the ysef.:,.1.,.",
        "'s implementation.",
        "llovvever, unless .inenany and 110.,[ee,r,;(-) integiated, such all interaction itt &Micahti tit total, ein, without such lineractions, parsing can he e1t1v-J1 ',nay slovy of fail irk C011itiAriairly difficult sentenees te-eht,e'e'O..: lint'dep.naleticica of concept meanings hxpiesse ii\" language 11)1ta,,..; [AVIA) system, itttni y se ii.",
        ",aotatci:h'O 19871).1, awlCfviLOpO, C011taim the downed discussions as well sf; sanqne ,c,!-;c,i 11;.iet.-:::' typessuatenta;s, ehr,y hitegrated parScr, vie krivalk it paik:Xi kink pailoiths ael ;;011a11;.Oije, analyses hi sour: hitograted mattnor.",
        "IjouTs.",
        ": ix/Rai-am which suppliod lueanitig 1t411t!",
        ";::;90:^tio,:0 reheace unalule.select filet of the tevo modules was fe it qt,,iciak, i;matme cotteopitoti ;iliallyzet;; veleIOAf, b Common _Asp.",
        "`t Tie system directly utilizes the represented domain kr:Km/ledge (currently in the area of computer manuals and doctor/patient conversations) of the CM1).-- -Ar knowledge-based largc-scale inachirkC translation system.",
        "It handles inputs in both I-Aiglish and Japanese.",
        "The current size of the DM-CoMMAND system is roughly 5,000 lines of lAsp code (this does not include the MT system functions and the Fi)Amni<Tr frame; system, parts of which must also loa(led into memory) and is not expected to increase, since the hiture variety in types of commands tind questions that the system will handle will be integrated into the network of memory that represents concepts for commanding arid question/- answering anti not ntto the system code itsel124.",
        "Compiled code on IHIVI-P,Ts and 1lP9000s is fast enough that parsing and pc:Hot-ming commanded action happens virtually in real-time.",
        "We arc expecting to iliefeaSe thecvariety in types of system functions and grammar/rule development functions; however, as noted above, since such increases will occur in the memory network, as a system implementation, DM-COMMAND is a completed systelit.",
        "A.cknowitedgments The authors would like to thank members of the Center for Machine Translation for fruitful discussions.",
        "Eric Nyberg and let uko Mitainura were especially helpful in preparing the final version of this paper."
      ]
    }
  ]
}
