{
  "info": {
    "authors": [
      "Robert E. Mercer"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C88-2086",
    "title": "Solving Some Persistent Presupposition Problems",
    "url": "https://aclweb.org/anthology/C88-2086",
    "year": 1988
  },
  "references": [],
  "sections": [
    {
      "text": [
        "(8) [KICK(Bull, ball) A Jx.KICK(x, ball) A x Bill]4.1 Soames' Approach (9) -.KICK (Bill , bail) A :dx.,K1CK (x , ball) A x BillThe method proposed in /Soaines (1982)/ is based upon the belief that the two major competing strategies for determining presuppositions (/Karttunen and Peters 1979/ and /Gazdar 1979/) succeed in those situations in which the other one fails.",
        "The proposed solution is to synthesize the two filtering strategies so that all the unwanted 'potential presuppositions are screened out.",
        "What is important for the presuppositions\" analysis is that only (8) can be a candidate for the negation test.",
        "One of the prerequisites of this test is that the supposed presuppositions\" environment is within the scope of the logical negation in the logical representation of the sentence.",
        "The logical representation of (9) does not meet this requirement.The synthesis is performed in the following manner.",
        "First the potential presuppositions of the sentence are computed.",
        "Essentially, the potential presuppositions are all of tile presuppositions of the individual clauses of the sentence if the clauses were in isolation.",
        "The remaining potential presuppositions are those potential presuppositions which are not contextually or conversationally cancelled.",
        "This step is basically Gazdar's method for generating the presuppositions of the sentence.",
        "The next step is to use these remaining potential presuppositions in the projection phase which is basically the one proposed by Karttunen and Peters."
      ]
    },
    {
      "heading": "3.2 AgainSince all of the examples that follow deal only with 'if . .. then' sentences, I will provide only the projection rule for this kind of sentence.8",
      "text": [
        "The situation for the sentential adverb, 'again', is somewhat similar to that described above for 'too'.",
        "The adverb can be inside or outside the scope of the negation.",
        "Accordingly, the adverbs found in (10) and (11) are the presup positional and non-presuppositional environments with respect to the positive sentence 'Fred called again.'.",
        "(10) is to be interpreted as: .At some time in the past Fred called and during some interval of time which is important to the context in which the sentence is uttered, Fred didn't call.",
        "(11) is to be the following interpretatioa: At some time in the past Fred didn't call and during some interval of time which is important to the context in which the sentence is uttered, Fred didn't call.If S =`If A then B', then the actual presuppositions of S are those entailed by (1.0) .FRED didn't call again.",
        "(11) FRED didn't call again.AP A (AT D BP) The representation for 'call, again' is shown in (12)5.where (/)P represents the actual presupposition of 0.",
        "(1.2) VaNyVk,.CALL-SUB.TAGAIN(x,y, z)A further aspect of this rule is that if AT BP is true only for truth conditional reasons or is a logically valid statement, then this part of the conjunct is ignored.",
        "Otherwise, the 'AT D' is dropped giving AP A BP as the presupposition of the sentence S. GALL(x y, a) A all.",
        "CALy, ti) A t1 < zThis projection method can be applied to a variety of examples.",
        "Since I am concerned only with the characteristics of the presuPpositional environment 'too' in these examples only those potential Presuppositions that are relevant will be mentioned in the analysis.",
        "(16) has the following properties.",
        "The representations for the unnegated 'FRED called again.'",
        "and the sentences (1.0) and (11) are shown in (13)-(15), respectively.",
        "As in the case of 'too', the representation of the simple negation of the sentence 'FRED called again.'",
        "is just the wide-scoped negation as shown in (14).",
        "1 have shown the right-hand side equivalents of the appropriate representations so that I can contrast the two different negations.No potential presuppositions are derived from the antecedent clause.",
        "(13) GAL 1.,(Fred , you, t) A ii .",
        "CAL L(Fred , you, t1) A t1 < tAT D BP = John kicked the ball i somebodyBill) (14) --.",
        "[CALL(.Pred, you, t) A.CALL(Ftvd, you, ti) A t5 <kicked the ball (15) -,CALL(Fred, you, t) A jti..-,CALL(Fred, you, t.t) A <Since AT D BP is logically valid it is ignored.",
        "Hence (16) has no actual presuppositions.",
        "As in the case for 'too', the only representation of 'again' that sanctions the use of presuppositions' machinery is (14)6.Similar analyses give no presupposition for (18) and the presupposition 'SomebodyJohn) kicked the ball.'",
        "for (19).",
        "4 Two Approaches to the Problem of Sentential Adverbs(18) BILL kicked the ball, too, if JOHN kicked the ball.",
        "Now I can turn to these sentential adverbs occurring in more complex situations, in particular, examples similar to those provided in /Soames 1982/.",
        "The two examples shown in (16) and (17) are the kinds of situations which prove difficult for all projection methods.",
        "(19) If JOHN kicked the ball too, then BILL kicked the ball.",
        "(16) If JOHN kicked the ball, then BILL kicked the ball, too.",
        "(17) If Fred called yesterday, then he will call again,In order to generate no presuppositions for (20), /Soames 1979/ requires an extra rule and a somewhat suspect method of interpretation.",
        "A description of the extra rule is not needed here.",
        "However, a quick look at the accompanying method of interpretation is of some importance.",
        "In order for the extra rule to work properly, the clause",
        "bl'his representation conveys only one foci of the adverb, 'again', in this case, the subject.",
        "The object of 'call', which in this case would have to be recovered from contextual cues (it would probably be 'you' as 'us', though it could be a third party) can be focussed as well.",
        "Since the discussion is similar to that given for 'too', I will omit it.B in the sentence 'DU A' must first be interpreted as an assertion.",
        "This error is undone when the 'if A' portion is heard.",
        "But what is important is the appropriate presuppositions have been cancelled by this point.",
        "However, it seems that stress patterns on the final word of B when tittered as a sentence and when uttered as the first clause of 'Rif A' differ.",
        "Hence no hearer would interpret 11 as an assertion.",
        "Without this peculiar interpretation, Soames' method cannot correctly generate the presuppositions for (20).",
        "This is of course with .cespect to the sentence represented by (13).",
        "(20) BILL kicked the ball, if JOHN kicked the ball.",
        "too.",
        "'/Mercer 1987/ shows that there are situations not covered dy the union of these two methods.",
        "'This rule is a slightly simplified version of the one given in /S oain es 1982/.",
        "It is sufficient for this discussion."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "/Soames 1979/ provides some intriguing counterexamples to the method for deriving natural language presuppositions presented in /Gazdar 1979/.",
        "A proposed modification to Gazdar's method (/Landman 1981/) which attempts to solve the problem exhibited by these counterexamples by introducing extra clausal implicatures has been effectively argued against in /Soames 1982/.",
        "Motivated by the lack of explanation for these reasonably simple counterexamples, /Soames 1982/ construtts a mechanism that derives presuppositions that is a superset of the approaches suggested by /Gazdar 1979/ and /Karttunen and Peters 1979/.",
        "/Mercer 1987/ contains methodological and empirical arguments against Soames' approach to the derivation of natural language presuppositions.",
        "This paper presents a reappraisal of some of the insightful counterexamples to Gazdar's method given in /Soaines 1982/.",
        "Given an appropriate representation of the sentences in question, the default logic approach to natural language presuppositions described in /Mercer 1987, 1988/ gives a simple and straightforward explanation for the presuppositional nature of these sentences."
      ]
    },
    {
      "heading": "2 General Background",
      "text": [
        "There has been a long history of attempts to define methods that would produce the presuppositions of a sentence.",
        "The default logic approach that is highlighted here follows the general framework set out in /Gazdar 1979/.",
        "One feature of this framework is that the speaker is governed by Grice's Principle of Cooperative Conversation.",
        "Assuming these general guidelines allows a competence model of the hearer's interpretation to generate the appropriate presuppositions of sentences with the forms 'a or b' and `if a then b'.",
        "Details of this process is given later."
      ]
    },
    {
      "heading": "2.1 Linguistic Presuppositions",
      "text": [
        "Being implied by a natural language sentence and the natural (or preferred) interpretation of its simple negation is the primary quality that qualifies an inference as a presupposition.",
        "This evaluation 'This research was partially supported by NSERC grants A7642 (to It.",
        "Reiter) and A3039 (to P. C. Gilmore).",
        "of inferences is called the negation test.",
        "Presuppositions are generated from lexical and syntactic contexts.",
        "Those contexts which pass the negation test can be termed presuppositional environments.",
        "Sentences (1)(2) demonstrate some prototypical examples of presuppositions produced by the presuppositional environments, factive verbs and definitions of words.",
        "In each of these examples the truth of the affirmative a-sentence always implies the truth of the c-sentence, and the truth of the negative b-sentence normally implies the truth of the c-sentence.",
        "(1) a. Mary is surprised that Fred left.",
        "b. Mary is not surprised that Fred left.",
        "c. Fred left.",
        "(2) a.",
        "My cousin is a bachelor.",
        "b.",
        "My cousin is not a bachelor.",
        "c. My cousin is a male adult."
      ]
    },
    {
      "heading": "2.2 Projection Rule Procedures",
      "text": [
        "The procedures for deriving presuppositions of complex sentences prior to /Mercer 1987, 1988/ that have received most attention are the ones based on the projection rule.",
        "These include /Karttunen 1973, 1974/, /Karttunen and Peters 1975, 1979/, /Gazdar 1979/, and /Soaines 1979, 1982/.",
        "The details of these theories are not important.",
        "What is of importance is the linguistic basis for these theories.",
        "Crucial to any theory, of natural language presuppositions is the concept of a presuppositional environment.",
        "These lexical or syntactic environments generate inferences, which are called presuppositions, whether they are in the scope of a negation or not.",
        "In addition to the concept of presuppositional environments, what is common to all the linguistic theories is the notion of a projection rule which projects the generated inferences as presuppositions of the sentence.",
        "The naive projection rule proposed in /Langendoen and Savin 1971/ takes all the presuppositions from all the presuppositional environments contained in the sentence and projects them as presuppositions of the sentence.",
        "Although the modifications to this simplistic rule differ (see /Karttunen 1973, 1974/, /Karttunen and Peters 1975, 1979/, /Gazdar 1979/, and /Soames 1979, 1982/), a common theme is that presuppositions are connected with surface phenomena.",
        "Although the methods differ in the importance that the semantic representation plays in the derivation of the presuppositions, without exception the potential presuppositions that are candidates for the (modified) projection rule are generated because the presuppositional environment exists in the surface form of the sentence."
      ]
    },
    {
      "heading": "2.3 A Default Logic Approach",
      "text": [
        "The approach presented in /Mercer and Reiter 1982/ and /Mercer 1987, 1988/ has a number of distinguishing features."
      ]
    },
    {
      "heading": "4.2 A Default Logic Approach",
      "text": [
        "The default rule schemata which capture the presuppositional inferences for the adverbs, 'too' and 'again', are (21) and (22), respectively.",
        "In the case of 'kick too' and 'call again' the appropriate instances of these schemata are shown in (23) and (24), respectively.",
        "-1[0(x, y) A 3z45(z, y) A x z] : 3z.0(z, y) Ax z",
        "-,CALL-SUBJ- A GAIN(x , y, t) : 3ti .CALL(x , y , ti) At' <t CALL(x , y , A t' < t Given simple statements such as those in (25) and (26) the preferred interpretations can be derived from the representation of the sentence and the appropriate default rules.",
        "I have shown the representation for (25) in (27).",
        "The preferred interpretation of (25) is shown in (28).",
        "Similar representations can be derived for the preferred interpretation of (26).",
        "(25) Bill didn't kick the ball, too.",
        "(In the sense of (5).)",
        "(26) Fred didn't call again.",
        "(In the sense of (10).)",
        "Each of the sentences (16)-(20) requires a case analysis.",
        "The representation of 'if a then b' is not equivalent to a J b.",
        "However a j b can be derived from standard representations for 'if a then b' such as Stalnaker's conditional logic representation, a > b (/Stalnaker 1968/).",
        "The theory presented in /Mercer 1987, 1988/ defines presuppositions as inferences derivable from a theory which includes the representation of the sentence.",
        "Therefore the logical form a J b will be available to the deductive machinery.",
        "For any sentence of the form 'if a then b', the KBH U {Ksu} will be {Ks(a > b),'appropriate default rules'} and since Ks(a b) is derivable from Ks(a > b) and since Ks(a b) is equivalent to Ks(--.aVb) the two cases determined by the algorithm given in section 2.3.2 are {a A b, 'appropriate default rules'} and {-,0 A -'b, 'appropriate default rules'}.",
        "The complexity arises in the case of sentential adverbs being in either the antecedent or consequent clause of the 'if ... then' sentences under investigation because the negation which appears in one of the cases can be done in two possible ways when a sentential adverb is contained in the clause being negated.",
        "If the negation of the consequent clause does not put the sentential adverb in the scope of the negation, the default rule which generates the presupposition cannot be used.",
        "The case -,cc A does not infer the presupposition.",
        "Consequently, the case analysis cannot generate the presupposition as an inference from the sentence.",
        "How is the method of negation justified?",
        "Two assumptions must be made.",
        "Firstly, the antecedent of an 'if .",
        ".. then' sentence is logically prior to the consequent.",
        "This logical assymetry can be derived from Stalnaker's analysis, or the cause and effect relationship that is conveyed by this sentence schema.",
        "Secondly, /Stalnalcer 1973/ gives an argument that 'if ... then' sentences are to be interpreted in a manner that is similar to conjunctive sentences.",
        "Stalnaker's view of conjunctions is that the second sentence is affected by the presence of the first sentence.",
        "I will loosely interpret this to include the way the sentence is represented.",
        "Therefore if there is a sentential adverb in the second conjunct, it should interact with any negations in such a way as to have the same interpretation as in the first clause.",
        "For example, (29) should have the representation given in (30).",
        "JOHN didn't kick the ball and BILL didn't kick the ball, too.",
        "(29) --,KICK (John, ball) A --,KICK (Bill, ball) A az.,KICK(z,ball) A Bill 0 z However, in (31) since the first clause does not contain any negation that would affect the interpretation of the negation in the second clause, the negation in the second clause would follow the standard clause-scoping negation rule.",
        "The representation for (31) is given in (32).",
        "This representation together with the appropriate default rule then produces the presupposition 'Somebody (0 Bill) did not kick the (30) Today is not Sunday and BILL didn't kick the ball, too.",
        "(31) -,Today is Sunday A -4KICK (Bill,ball) A 3z.KICK (z,ball) A Bill 0 z] For any sentence of the form 'if a then b', the two cases determined by the algorithm given in section 2.3.2 are a A b and A The representations for the second case for each of the sentences (16), (18), (19), and (20) are given in (33)-(36), respectively.",
        "The negation in (33) is within the scope of the adverb because the adverb occurs in the consequent and because the antecedent is logically (and conversationally) prior to the consequent.",
        "Therefore the scoping is dictated by that in the antecedent clause.",
        "Similar analyses can be given for (34) and (36).",
        "In (34) the adverb occurs in the consequent, hence the scoping is dictated by the logically prior antecedent.",
        "In (36) the adverb is in the antecedent, but because the consequent is conversationally prior to the antecedent, it dictates the scoping of the negation in the antecedent.",
        "In all of these cases the scope of the negation prevents the use of the presuppositional default rules to derive the presupposition that would be derived from the clause if it appeared in isolation.",
        "Only in (35) does the logically and conversationally prior antecedent contain the adverb.",
        "The scope of the negation is therefore determined by the normal scoping rule, hence the scope of the negation is the whole clause placing the adverb inside the scope of the negation, and giving the appropriate presupposition.",
        "(32) -,1( ICK (John, ball) A -,KICK (Bill, ball) A (z, ball) A Billz (33) -.KICK (John, ball) A ---,KICK (Bill, ball) A (z, ball) A Bill 0 z (34) -.",
        "[KICK (John, ball) k3z.KICK (z , ball) A John 0 z] A --,KICK (Bill , ball) (35) SICK (John, ball) A z.-KICK (z, ball) A John z A -KICK(Bill, ball)"
      ]
    },
    {
      "heading": "5 Conclusions",
      "text": [
        "/Soaines 1979/ provides some counterexamples to the method to derive natural language presuppositions that is presented in /Gazdar 1979/.",
        "To circumvent this problem, /Landman 1981/ introduces extra clausal implicatures into the method proposed in /Gazdar 1979/.",
        "This proposal has been effectively argued against in /Soames 1982/.",
        "/Soames 1982/ has enlarged the set of counterexamples found in /Soames 1979/.",
        "Motivated by the lack of explanation for these reasonably simple examples, he constructs a new approach which is a superset of the methods proposed by /Gazdar 1979/ and /Karttunen and Peters 1979/.",
        "This rococo approach to natural language presuppositions has been argued against on methodological and empirical lines in /Mercer 1987/.",
        "By reappraising the insightful counterexamples to Gazdar's theory given in /Soames 1982/, it is noticed that the semantic representation of 'if ... then' sentences that contain a sentential adverb in either the",
        "where al, on represent the appropriate first order statements and 451, h, represent the appropriate default rules.",
        "Since AAB and -.A A B completely determine (that is, determine the truth values of both) A and B, and since the statements Ps(A A -,B) and Ps(-.A A B) can be derived, A A -.13 and -.A A B distinguish the two cases.",
        "Note that although PsA, Ps-'A,PsB,Ps-.B are all derivable, none of A, B, are candidates for distinguishing a case because, individually, none of them completely determine the truth values of both A and B.",
        "Hence the two cases of the original theory, T, are",
        "The simple negated sentence, an example of which is presented in section 2.3.1, is just a special instance of the case analysis procedure.",
        "In the simple negated sentence, (which is represented as Ks-.X), the possibility of the only case (distinguished by -.X) can be proved using the utterance and the theorem F Ks-,X F Ps--.X.",
        "Definition 1 A sentence a is a presupposition of an utterance u, represented by the default theories 2, if and only if Au, PA a for all i and a E Th(CONSEQUENTS{D}), but Aa V a and A. VA --aa3.",
        "This definition can be loosely paraphrased as: if a is in the logical closure of the default consequents and is provable from the utterance, and all proofs require the invocation of a default rule and in the case of multiple extension default theories, a is in all extensions, then a is a presupposition of the utterance."
      ]
    },
    {
      "heading": "2.4 Important Differences",
      "text": [
        "The previous approaches which have been mentioned above rely on two ideas.",
        "Firstly, presuppositions are generated from positive and negative presuppositional environments, if these environments occur in the surface sentence.",
        "Secondly, a number of different methods, collectively called projection methods, are used to screen out those potential presuppositions which are not to be projected.",
        "A brief description of Soames' method is given in section 4.1.",
        "The default logic theory described in detail in /Mercer 1987, 1988/ approaches the problem of presupposition-generation from the level of logical representation.",
        "Presuppositions are generated from the logical representation if negated presuppositional environments occur in the logical representation of the natural language sentence or some logical form which can be derived from this representation.",
        "Many of the results that the modified projection methods achieve are just proof theoretic results in the default logic approach to natural language 'For purposes of this definition, the only defaults in each are the presupposition generating defaults.",
        "In reality the default theory would contain many other kinds of defaults.",
        "The definition would have to be changed so that the proof of a, requires the invocation of a presupposition generating default, and that a E Th(CONSEQUENTS{DM, where D' is the set of presupposition generating defaults 'All of the examples presented in this paper deal with default theories having single extensions.",
        "In those theories which have multiple extensions, some way of stating that a presupposition is in all extensions is required.",
        "Since extensions of normal default theories are orthogonal, if Au has multiple extensions then there exists a sentence /3 such that Au /3 and Au 1-c.",
        "I will call this situation being split along the /3-dimension.",
        "If the extensions do not split along the a-dimension then either a is in all extensions or a is in no extension.",
        "So if Au 1-4, a (which means that at least one extension contains a) and Au VA \"CV (which means that no extension contains na, which means that the extensions do not split on the a-dimension) then a is in all extensions.",
        "presuppositions.",
        "In addition, once the logical representation of sentential adverbs is presented, it will be shown that the solution to the problem of presuppositions derived from sentential adverbs is again obtained in the default logic approach without any modifications."
      ]
    },
    {
      "heading": "3 Sentential Adverbs",
      "text": [
        "The two sentential adverbs that will be presented are those found in the examples given in /Soames 1982/: 'too' and 'again'.",
        "Because one of the defining properties of a presuppositional environment is indicating positive to the negation test4, I will first look at each when there is a negation present.",
        "The interesting property displayed by sentential adverbs is that in addition to any interaction between negation and the underlying form, there is also an interaction between negation and the adverb.",
        "This interaction can be captured in two different logical representations.",
        "The sentential adverbs have the added complication that they can take any part of the sentence as their focus of the adverb.",
        "The focus of the adverb will be capitalized.",
        "Although the verb of the sentence can be focussed, a presentation of this particular focus would require an event-based representation.",
        "I do not discuss this focus in the following.",
        "However, it, too, would behave analogously."
      ]
    },
    {
      "heading": "3.1 Too",
      "text": [
        "The representations of 'kick too' are shown in (3) and (4).",
        "These two representations convey the different foci of the adverb, 'too', the subject and the object of 'kick', respectively.",
        "I will be only interested in the representation which focuses on the subject, that is (3).",
        "The explanation for presuppositions that arise from the adverb focussing on the object is similar to the discussion presented below.",
        "(3) xVy.KICKSUBJ-T00(x, y) KICK(x,y)A3z.KICK(x, y) A a: z (4) Vedy.KICK-OBJ-T00(x, y) E KICK(x,y)A3x.KICK(x,z)Ay0 Sentential adverbs have a most peculiar attribute when they interact with natural language negation.",
        "The adverb can be either inside or outside the scope of the negation.",
        "Sentences (5) and (6) point out the two possible interpretations in the case of 'too'.",
        "One particularly interesting phenomenon is that all of the possible scopes of the negation and the adverb may not occur in surface form.",
        "For instance, (6) would normally be uttered as 'BILL didn't kick the ball, either.'.",
        "I will use the incorrect surface form in the examples, however.",
        "The italicized portions of the sentences indicate the portion which is in the scope of 'too'.",
        "(5) is to be interpreted as: Although someone else kicked the ball, Bill didn't.",
        "(6) is to be interpreted as: Both Bill and someone else did not kick the ball.",
        "(5) BILL didn't kick the ball, too.",
        "(6) BILL didn't kick the ball, too.",
        "The representations for the unnegated 'BILL kicked the ball, too.'",
        "and the sentences (5) and (6) are shown in (7)-(9), respectively.",
        "As proposed in /Kempson 1975/, /Wilson 1975/, and implemented in /Mercer 1987/, the representation of the simple negation of the sentence 'BILL kicked the ball, too.'",
        "is just the wide-scoped negation as shown in (8).",
        "I have shown the right-hand side equivalents of the appropriate representations so that I can contrast the two different negations.",
        "(7) KICK (Bill , ball) A 3x .KICK (x , ball) Ax Bill 4A positive indication to the negation test means that a sentence, S, containing the purported presuppositional environment and the preferred interpretation of not S both have the same inferences arising from the environment in question.",
        "antecedent cc consequent clause plays an important role in determining the presuppositions of the sentence.",
        "The inferential theory for natural language presuppositions described in /Mercer 1987, 1988/ gives a simple and straightforward explanation for the presuppositional nature of these sentences."
      ]
    },
    {
      "heading": "References",
      "text": [
        "A normal default rule is a rule of inference denoted a(Z): /3(&) where ce(il ;old 0(E) are all first order formulae whose free variables are among those of :1!",
        "= a1 ,...,a,,,.",
        "Intuitively, a default rule can be interpreted as: For all individuals xi, , x,, if the prerequisite 1.0) is believed' and if BM is consistent with what is believed, then the consequent /3(E) may be conjectured.",
        "A normal default theory is a set of lirst order formulae together with a set of 'normal defaults.",
        "A fixed point of a normal default theory is the deductive closure of the set comprised of the first order formulae and some maximal set of consequents that are consistent with the fixed point.",
        "The CONSEQUENTSIDI is the set of all conscquents of the default rides in the default theory.",
        "For the purposes of tins paper, I will change slightly the interpretation of the default rule to mean: if the speaker says `ce(i)' and /30.0 is consistent with the hearer's knowledge base, KI3H, then the hearer can conjecture BM.",
        "It is not absolutely clear what the verb says means or how it should be represented.",
        "For the purposes of this Paper I only require those notions first presented in /C ice 1975/ under the title Principle of Cooperative Conversation and formalized in /Gazdar 1979/.",
        "Under Gazdar's interpretation of Grice's maxims the speaker is committed to the truth of u, the sentence that he utters.",
        "Therefore the speaker knows u.",
        "The conversational approach that I take views time contribution of a speaker's utterance u as the addition of Ksu to KBH along with other conversational information which is detailed in section 2.3.2.",
        "The meaning of tluu utterance is then a function of the inMrencing process on ABH u {Ksu}.",
        "The default rules require some extra information to guard against misuse of the default rules.",
        "This information is a conjunct in the prerequisite of the default rule.",
        "Except for this technical aspect tins extra information plays no role.",
        "Since it creates long default rules, I have left it out of all the examples.",
        "For further details see /Mercer 1.987/.",
        "Whenever the discussion concerns the default logic approach, I will assume that the speaker's utterance has undergone the first phase of the interpretation process which generates a semantic representation (logical form) of the sentence uttered.",
        "This semantic representation 'The verb believe stash!",
        "be takes to mean first order derivable or conjectured from the default theory.",
        "will be a well-formed sentence in a first order S4 modal language containing a countably infinite set of predicate symbols, constant symbols, and variable symbols, plus the logical symbols A, V, .1\"), -1, Ks, and Ps.",
        "The last two symbols, called modal operators, are to be interpreted as 'the speaker knows that' and 'for all the speaker knows, it is possible that', respectively.",
        "Although there is no general method known to generate this representation, some general rules can be followed.",
        "Any sentence with an explicit negation is translated into the widely scoped negation of its affirmative counterpart.",
        "Any compound sentence is snapped clause by clause into a logical form, each clause being treated as a sentence."
      ]
    },
    {
      "heading": "2.3.2 Deriving Presuppositions in Complex Sentences",
      "text": [
        "The concept discussed herein -- using default logic to derive presuppositions --- strongly influenced by azdar's method.",
        "I will present the representation of presuppositions in following sections with little explanation.",
        "For a complete discussion of how presuppostions are represented by default rules in a default theory together with how default logic proof theory captures Gazdar's idea, of presupposiBons being consistent with a context see /Mercer and Reiter 11982/ or /Mercer 1.987/.",
        "Another influence is the use of clausal implicatures in connection with deriving presuppositions from complex sentences.",
        "the default logic approach the clausal implicatures are used to control the division of the original theory into its first order cases.",
        "The clausal implicatures are derived from the natural language sentence according to Gazdar's formal treatment of Grice's conversational principles (/Grice 1975/).",
        "The sentence uttered by a speaker commits the speaker not only to the truth of the sentence but also to the possibility of its clauses (its parts).",
        "So in the case of the speaker uttering 'A or B' or `if A then 13', sinless there is background knowledge or there are linguistic reasons to prevent it, the speaker is committed to PsA, Ps13, and Ps,B.",
        "These implicatures will provide the means to restrict the division of the theory representing the utterance into its cases.",
        "Because default logic proof theory does not display any analogue to the law of the excluded middle (the antecedents of the default rules must be provable and there is no equivalent to the deduction theorem) and because presuppositions do arise from the clauses of complex sentences, some form of analysis by cases is required.",
        "Since a statement is provable in a case analysis only if it is provable in all cases, the choice of cases is critical.",
        "As in the case of a first order theory, too few cases would allow inappropriate statements to be proved.",
        "In addition because of the non-monotonic nature of default logic, having too many cases could prevent appropriate statements being proved.",
        "In general the choice of cases must reflect two principles.",
        "Since the case analysis is a proof theoretic analogue of the model theoretic law of the excluded middle, each case insist completely determine the truth values of each of the disjuncts found in the statement to which case analysis is being applied.",
        "Also, since the case analysis is justified solely on linguistic grounds (see /Mercer 1987/ for further discussion), the cases must reflect this linguistic situation.",
        "To justify a case, the possibility of the statement that distinguishes the case must be provable from the original default theory.",
        "Since none of the modal statements take part in the proofs, they are left out of the cases.",
        "An example should clarify these ideas."
      ]
    }
  ]
}
