{
  "info": {
    "authors": [
      "Satoshi Ikeda",
      "Kazuhide Yamamoto"
    ],
    "book": "Proceedings of the Third International Workshop on Paraphrasing (IWP2005)",
    "id": "acl-I05-5006",
    "title": "Transforming a Sentence End into News Headline Style",
    "url": "https://aclweb.org/anthology/I05-5006",
    "year": 2005
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "News on electrical bulletin boards consist of high density expressions.",
        "Many sentences end with unique expressions that consist of nouns and case particles.",
        "This paper focuses on expressions used at the end of sentences and attempts to summarize them by forming noun or case particle endings.",
        "We summarize the news sentence through pattern matching approach.",
        "Our evaluation illustrates that the summarizer reduces 2.50 characters per sentence on average; the reduction ratio is 6%.",
        "We also show that people perceive the correct meanings of the summarized sentences with 95% accuracy."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Electrical bulletin board displays the latest news headlines which each newspaper office announced.",
        "News headlines are shorter than newspapers’ news with laconicism because they are summarized to transfer in limited space.",
        "One of a characteristics of Japanese news headlines can be seen at sentence ends (Exp.1).",
        "(Countermeasure for alleged abduction is judged after the movement of administration party.)",
        "Although the end of sentence in Exp.1 is omitted, we have no difficulty to understand the meaning.",
        "We unconsciously complete the sentence by guessing what is omitted without a mistake.",
        "Without unnecessary ends, these type of sentences are short and nonredundant.",
        "The final purpose of this work is to transform news sentences into a news headline style.",
        "In Japanese, sentences end with nouns or case particles are grammatically incorrect, however, this kind of expressions are shorter than grammatically perfect sentences, and hence often used to meet the limited length.",
        "We believe many sentences have semantically redundant expressions in the end, which needs to be focused in summarization.",
        "In this paper we present a list of deletable expressions at Japanese sentence ends.",
        "We have to carefully investigate which sentence ends are deletable, and how to change into the headline style.",
        "We present the concrete expressions of deletion with examples and illustrate effects of deletion."
      ]
    },
    {
      "heading": "2 Related Works",
      "text": [
        "As the most similar work to ours, Sato et al.",
        "[6] tries to extract paraphrasing patterns of sentence end by preparing a lot of alignment pairs between news sentences and their headline versions.",
        "They compare the sentences from the ends and obtain many correspondences between the two.",
        "However, they have no proposals on how to use these one-to-N correspondences, i.e., the way to select one from many candidates.",
        "Our approach is to obtain many transformation patterns as well, but we do not use aligned corpus; we use a large collection of news headlines instead and find patterns by our thorough observation.",
        "Wakao et al.",
        "[7] compares newscast and corresponding subtitle expressions to investigate the differences of them.",
        "One of the observation targets is sentence end, and they have shown us some typical patterns of conversion into a short news.",
        "This enumerates phraseologies which are able to be cut down and investigates the frequency of use.",
        "In news subtitles nouns or case particles are used at the sentence end.",
        "This work is drew upon literature [7] while we investigated in our own right.",
        "We shaded light on the phraseologies which do not exist literature [7] such as ʮࣗट ͨ͠ͱݟΒΕΔ ˠࣗट_ ͔ (There seems to surrender.)ʯ.",
        "We examined the phraseologies which",
        "are disposed by machine.",
        "Fukushima et al.",
        "[1] cut off the unnecessary part from literature [7].",
        "There are investigations to summarize text by confining the number of characters [2,3,5].",
        "Ishizako et al.",
        "[2] cut off areas of overlap.",
        "Ohmori et al.",
        "[5] and Mikami et al.",
        "[3] summarized text altogether, but these investigations do not focus on sentence ends."
      ]
    },
    {
      "heading": "3 News Headlines and Their Sentence Ends",
      "text": [
        "There is an email service that delivers Japanese news headlines three times a day on weekdays.",
        "That is Nikkei news mail(1) provided by NIKKEI-goo.",
        "We have been collecting them since December 1999.",
        "Table1 shows the statistics we have obtained.",
        "number of mails 3365 number of stories 21127 number of sentences 40374 News headlines are more distinctive than news stories in sentence end.",
        "Therefore, we investigated part of speech on both news headlines and newspaper(Nihon Keizai Shimbun(2)).",
        "Table2 shows the comparison.",
        "In the newspaper, declinable words are responsible for the majority of sentence ends.",
        "In news headlines, there are in fact many verbal nouns in sentence ends.",
        "Japanese words are classified broadly into two types; one derived from China and another originated in Japan.",
        "News headlines contain the former more than the latter because words from China carry more information in fewer characters.",
        "We investigated news headlines and news on a paper which contained words of both Chinese and Japanese origins.",
        "The result is shown in Table3.",
        "In fact, news headlines preferably use the words of Chinese origin about three times as much as that of Japanese origin.",
        "We can imagine that a short phraseology is preferably used when the phraseology has the same information.",
        "We estimate that the news headlines are high density phraseology than newspaper."
      ]
    },
    {
      "heading": "4 Method of Summarization",
      "text": [
        "In order to transform a sentence end into a shorter one, we have conducted three kinds of procedures:",
        "(1) Deletion of target words at sentence end (2) Deletion with minor transformation after the target words (3) Transformation of sentence end",
        "More precisely, we have proposed conducting the following 10 procedures for transforming Japanese sentence ends into a news headline style:",
        "1.",
        "Cut off dictum and honorific phraseology (1) 2.",
        "Cut offʮΛࣔ ͢ (wo shimesu:show) ʯ (1) 3.",
        "Change verbal noun(2) 4.",
        "Cut offʮͳ Δ (naru)ʯ(2) 5.",
        "Cut off the part which followsʮ໌Β͔ ʹ (akirakani)ʯ (2) 6.",
        "Change words of Japanese origin(2) 7.",
        "Cut offʮͯ͠· ͏ (teshimau)ʯ(1) 8.",
        "Cut offʮཱ ͭ (tatu)ʯ(2) 9.",
        "Transform phraseology indicated the action in the future (2)",
        "10.",
        "Change to compound noun (3) Exp.3) We summarized in this order, and process 3.ʙ 9. can be switched."
      ]
    },
    {
      "heading": "4.1 Cut Off Dictum and Honorific Phraseology",
      "text": [
        "Phraseologies shown below are dictum or honorific phraseology.",
        "These phraseology in sentence end is cut off because these are not necessary to understand the meaning."
      ]
    },
    {
      "heading": "4.2 Cut Off (wo simesu:show)ʯ",
      "text": [
        "When a sentence end is ʮ Λ ࣔ ͢ (wo shimesu)ʯorʮΛࣔ͠ ͨ (wo shimeshita)ʯ, this phraseology is cut off becauseʮࣔ ͢ (shimesu)ʯ has little meaning in that sentence.",
        "The main verb of the sentence is the verbal noun before ʮΛࣔ ͢(wo shimesu)ʯ."
      ]
    },
    {
      "heading": "4.3 Change Verbal Nouns",
      "text": [
        "The expression after the verbal noun closest to the main verb of the sentence is deleted.",
        "In Japanese, we put a wordʮ͢ Δ (suru) ʯ after a verbal noun to make a verb, but in the summary it can be deleted since we can still understand the usage.",
        "When a self-sufficient word exists following a verbal noun, we do not dispose this.",
        "Step 1 The part followingʮ͢ (suru)ʯis cut.",
        "Nominalized verbal noun to cut ʮ͢Δ (suru)ʯis the verbal noun in this arrangement.",
        "(He seemed to surrender in trouble with escape fund.)",
        "Step 3 When the cut part contains a contradiction phraseologyʮͳ ͍ (nai) ʯ orʮ ͵ (nu)ʯ, tack onʮͤͣ(sezu)ʯat the sentence end and finish.",
        "When this part concurrently contains a passive phraseologyʮΕ Δ (reru)ʯ, tack on ʮ͞Ε ͣ (sarezu) ʯ and finish.",
        "Step 4 When a sentence end is ʮnounʴ Λ (wo) ʴverbal nounʯ,ʮ Λ (wo)ʯis cut to become a compound noun ʮnoun ʴ verbal nounʯ.",
        "(Starting this month, Japanese chess problems are seen in ads of each station and in trains.)",
        "(surukoto)ʯ is cut.",
        "If the (wo)ʯorʮ ͔ (ka)ʯ, this parti-ʮͷ(no)ʯ. part contains ʮ ॳ Ί ͯ (ha-jimete:first) , procedures from Step 2 is different as follows.",
        "(hajimete:first) ʯ is tacked on before verbal noun.",
        "When the part of cut contains ʮΈΒΕΔ (mirareru)ʯ, tack onʮ ͔ (ka) ʯ in sentence end and finish.",
        "Step 3 When the cut part contains ʮͯ͠ (shite)ʯ,ʮޙ ॳ (go hatsu)ʯis tacked on in the sentence end.",
        "When the term just before noun is particleʮ ͔ (ka)ʯ, this particleʮ ͔ (ka)ʯ changes into particleʮ ͷ (no)ʯ.",
        "(He first acceded the interview since Karmapa Seventeenth left China.)",
        "Step 4 .1 When a verbal noun isʮൃ ݴ (hat-sugen:delivery)ʯ orʮݴ ٴ (genkyuu:citation)ʯ, ʮॳΊͯ (hajimete:first)ʯ is tackedA verbal noun.",
        "Step 4.2 When a verbal n sugen:delivery)ʯ orʮݴٴ the term before the verbal sentence end is processed",
        "ʙverbal nounˠʙͷ ʴ verb hatsu)ʯ",
        "Step 5 When the cut part contains (mirareru)ʯ, (ka)ʯis tacked on in the sentence end."
      ]
    },
    {
      "heading": "4.4 Cut Offʮͳ Δ (naru)ʯ",
      "text": [
        "When ʮparticleʴͳ Δ (naru) ʯ exists in a sentence, this part and the following are cut off.",
        "When a self-sufficient word exists in the cut part, the meaning changes or we do not understand the meaning.",
        "Therefore, when a self-sufficient word exists ʮparticleʴͳ Δ (naru)ʯfollowing, the sentence is not disposed this arrangement.",
        "The ʮparticleʴͳ Δ (naru) ʯ and the following are cut off.",
        "When the particle isʮ ʹ (ni) ʯ or is tacked on in the sentence (The accord became the bare adoption because this arranged after three and half months of general election ballot )",
        "(Almost all detonating agents did not work because they seemed to wet)"
      ]
    },
    {
      "heading": "4.5 Cut Off the Part After ʮ໌Β͔ʹʯ",
      "text": [
        "Whenʮ໌Β͔ʹ(akirakani:out of doubt)ʯexists in a sentence, the part which followsʮ໌Β͔ ʹ (akirakani) ʯ is cut off.",
        "When the cut part contains a self-sufficient word, the meaning changes or we do not understand the meaning.",
        "Then, when a self-sufficient word exists in the sentence, the sentence is not disposed this arrangement.",
        "Step 1 The part which followsʮ໌Β͔ ʹ (akirakani) ʯ is cut off.",
        "Step 2 Research the part of cut and dispose the cut part.",
        "Contradiction phraseologyʮͳ ͍ (nai)ʯorʮ ͵ (nu)ʯ and passive phraseologyʮΕ Δ (reru) ʯ exist.",
        "ˠʮ͞Εͣ (sarezu)ʯis tacked on in the sentence end.",
        "ɾThe contradiction phraseology ʮͳ͍ (na (nu)ʯexists.",
        "Step 3 Whenʮ͢Δ͜ͱ Λ (surukoto ists beforeʮ໌Β͔ ʹ (akirakani)ʯ, ʮ (surukoto wo)ʯis cutoff.",
        "When the p the cut is ʮparticleʮ ʹ (ni)ʯʴ verba ʮʹ (ni) ʯ is changed toʮ΁ (e)ʯ. Whe before the cut part is ʮparticleʮΛ (wo bal nounʯ,ʮ Λ (wo)ʯis changed toʮ"
      ]
    },
    {
      "heading": "4.6 Change Words of Japanese Ori",
      "text": [
        "When a Japanese origin word by Tab in a sentence, the part before it is cut the Japanese origin word is replaced b one.",
        "When a self-sufficient word exists Japanese origin word, the sentence is no of this arrangement.",
        "We changed the w shows Table3.",
        "Step 1 Japanese origi cut off.",
        "Step 2 When sentence end Λ(surukoto wo)ʯ, cut off rukoto:doing)ʯ, tack on the co nese origin word, and finish the Exp.9)ʮࡂ֐޿ҬࢧԉϚχϡΞϧʯ (They have decided to start making an ‘instruction book extensive assistance for disaster’.)",
        "Step 3 When a sentence condition is follow the sentence is disposed.",
        "A sentence end is a particleʮ ͕ (ga) ʯ and Japan origin word isʮ෼͔ Δ (wakaru:understand)ʯ ˠtack onʮ൑ ໌ (hanmei:understand) ʯ and fini A sentence end is a particleʮ ͕ (ga) ʯ and Japan origin word is notʮௐ΂ Δ (siraberu:census)ʯ ˠThe particleʮ ͕ (ga)ʯis changed to a particle (wo)ʯ.",
        "A sentence end isʮ ͕ (ga) ʴ nounʴ Ͱ (de)ʯˠ (no) ʴ nounʴ Λ (wo)ʯ A sentence end is a particleʮ ͸ (ha) ʯ and Japan origin word isʮ෼͔ Δ (wakaru:understand)ʯ ˠGet the former sentence back again and finish.",
        "Japanese origin word isʮௐ΂ Δ (siraberu:censu and the cut part containsʮ͍ͯ͠ Δ (siteiru)ʯ",
        "ˠtack onʮௐࠪ த (tyousa tyu:under survey)ʯat the orʮ༧ ఆ (yotei:plan)ʯ exists in the sentence, sentence end and finish.",
        "Step 4 Chinese origin word which corresponds Japanese origin word tacked on the sentence end.",
        "the phraseology can changed toʮ ΁ (he) ʯ in Japanese.",
        "Therefore, the terms listed below are the phraseology of indicated the action in the future.",
        "Whenʮ͢ Δ (suru) ʴ this phraseologyʯ exists in the sentence, this part and following are changed toʮ ΁ (he)ʯ.",
        "(The total of 359 counterfeit coins were found.)"
      ]
    },
    {
      "heading": "4.7 Cut Offʮͯ͠· ͏ (teshimau)ʯ",
      "text": [
        "When a sentence containsʮͯ͠· ͏ (teshimau)ʯ, we feel that the sentence is negative and ʮͯ͠·͏ (teshimau) ʯ is not necessary to understand the meaning of the sentence.",
        "Thus we cut offʮͯ͠· ͏ (teshimau) ʯ in the headline.",
        "This arrangement is used not only the sentence ends but middle of the sentence.",
        "When the term after the cut part isʮ ͹ (ba)ʯ, we do not dispose it.",
        "When the sentence end is ʮͯ͠·͏ (teshimau)ʯ, change the term beforeʮͯ͠·͏ (teshimau)ʯto primitive form and finish.",
        "Whenʮͯ͠· ͏ (teshimau) ʯ exists without the sentence end,ʮͯ͠· ͏ (teshimau) ʯ and the character before this phraseology is cut off."
      ]
    },
    {
      "heading": "4.8 Cut offʮཱ ͭ (tatsu)ʯ",
      "text": [
        "When a sentence containsʮཱ ͭ (tatsu)ʯ,ʮཱ ͭ (tatsu)ʯ, the part following it is cut off.",
        "When the following part contains the self-sufficient word, the meaning changes or we do not understand the meaning.",
        "Therefore, when a self-sufficient word exists in the following part, the sentence is not disposed this arrangement.",
        "Whenʮཱ ͭ (tatsu) ʯ is apart of idiom, the sentence is not disposed of this arrangement."
      ]
    },
    {
      "heading": "4.9 Phraseology of Words Implying Future",
      "text": [
        "When a phraseology which indicate the action in the future such asʮܭ ը (keikaku:attempt)ʯ",
        "Whenʮ͢ Δ (suru) ʴ this phraseologyʯexists in a sentence and the following contains a contradiction phraseologyʮͳ ͍ (nai)ʯorʮ ͵ (nu)ʯ, the sentence is not disposed of this arrangement.",
        "When the following contains theʮͱ͍ ͏ (toiu)ʯ orʮɺʯ, the sentence is not disposed of this arrangement.",
        "ʮ͢Δ(suru) ʴ this phraseologyʯand following are cut off.",
        "when the sentence end is particle, the particle is cut off.ʮ ΁ (he) ʯ is tacked on the sentence end.",
        "4.10 Change to a Compound Noun When a sentence end is ʮnoun ʴ particle ʴ verbal nounʯ after the above arrangements, the particle cut off to become a compound noun.",
        "When the noun is neither pronoun, person name, unique noun nor postfix for Chasen(3), this arrangement is not disposed.",
        "When the particle is ʮ͔Β (kara)ʯ,ʮ Ͱ (de) ʯ orʮ ΋ (mo)ʯ, this arrangement is not disposed.",
        "We make a compound noun dictionary for The Mainichi Newspapers(4) to check the adequacy of compound nouns.",
        "When ʮnoun particle ʹ (ni) verbal nounʯ and the dictionary contains ʮnoun ʴverbal nounʯ which is cut ofʮʹʯ, ʮnoun ʴparticle ʹ (ni) ʴ verbal nounʯis changed to ʮnoun ʴ verbal nounʯ.",
        "When the particle is not ʮʹ (ni)ʯ, ʮnoun ʴ particle ʴ verbal nounʯis changed to ʮnoun ʴ verbal nounʯ."
      ]
    },
    {
      "heading": "5 Experiments",
      "text": [
        "We implemented the proposed technique with Perl programming language to measure the adequacy",
        "of proposed technique.",
        "We summary with this program.",
        "Then input sentence are all sentences seen in the newspaper corpus.",
        "The number of input sentences is 232,038, and 73,512 outputs are somehow summarized in our method."
      ]
    },
    {
      "heading": "5.1 Summarization Ratio",
      "text": [
        "We calculated a sentence ratio and number of reduced characters in a sentence.",
        "This result of experiment is shown in Table 4.",
        "The method of Table 4 shows the section number.",
        "This Table 4 shows the result which used the only one method.",
        "The summarization ratio is 94%.",
        "In fact, this method is reduced the 6% about one sentence."
      ]
    },
    {
      "heading": "5.2 Subjective Evaluation",
      "text": [
        "We also evaluated the proposed technique by human judgment.",
        "We picked up 1,000 sentences at random from summary sentences, and three examinees individually accounted them.",
        "The sentences are measured by majority decision.",
        "Assessment criterion is: (1) same meaning without context, and (2) low unnaturalness.",
        "The result is shown in Table5.",
        "The numbers in the table denote the section numbers explaining the process of transformation."
      ]
    },
    {
      "heading": "5.3 Comparison to the Human Summaries",
      "text": [
        "We compare summaries of the proposed method and by the human.",
        "We picked up 100 sentences in summary sentences at random.",
        "One ex-aminee summarized the original sentences which corresponded the pick up the summary sentences.",
        "We computed the summarization ratio about these sentences.",
        "The result is shown in Table7.",
        "Although the sentence ratio of machine summary is close to the manual summary’s one, number of reduced characters are approximately one character different.",
        "This indicates that human try to change many parts of sentence according to the change of the sentence end, while the machine does not consider such influence.",
        "Change of sentence end often requires transforming the whole syntax structure, such as change of aspect or form.",
        "We need more investigations on this issue."
      ]
    },
    {
      "heading": "6 Discussions",
      "text": []
    },
    {
      "heading": "6.1 Discussion of Erroneous Summaries",
      "text": [
        "In this section we describe some erroneous summaries by our method and discuss the reasons.",
        "(The face show the character like an annual ring.)",
        "Exp.13 is error example in arrangement ‘cut off the ʮΛࣔ͢ (wo shimesu:show)ʯ‘ When the term before ʮΛࣔ͢(wo shimesu)ʯis the noun, the sentence does not have main verb.",
        "The main verb which does not exist in the sentence is not right in Japanese.",
        "when the term before ʮΛࣔ͢(wo shimesu) ʯ is noun, this arrangement does not disposed.",
        "This kind of error is covered.",
        "But when the noun isʮߟ ͑ (kan-gae:concept)ʯ,ʮҙ ޲ (ikou:disposition)ʯorʮݟ",
        "(It is decided to caution the overuse to user.)",
        "Exp.",
        "14 is the error example ‘change the word of Japanese origin.",
        "When the cut off ʮ͢Δ͜ ͱ (surukoto:doing)ʯ, the modification relation is changed.",
        "Therefore, the modification relation is a wrong one.",
        "When the particleʮ Λ (wo) ʯ is changed to particleʮ ͷ (no)ʯ, this kind of error is covered(Exp.15).",
        "(teshimau) ʯ is cut off, the inflected forms must be congruent."
      ]
    },
    {
      "heading": "6.2 Verbalness/Nominalness of Verbal Noun",
      "text": [
        "The sentence end isʮʙ͸ ॳ (ha hatsu:first)ʯ in Section4.3.",
        "There are a big differences by humans in degree of accepting this expression.",
        "We thus change expressionʮʙ͸ ॳ (ha hatsu)ʯinto ʮʙॳΊͯ (hajimete:first)ʙʯ .",
        "The example before changed is shown in Exp.17.",
        "(It is the first time that President Putin has a talk to the tain of Arab Crown) Some people feel unnatural or wrong in example.",
        "But when the original sentence not haveʮॳΊ ͯ (hajimete:first)ʯ, the mary sentences are correct.",
        "The example is sh Exp.18 withoutʮॳΊ ͯ (hajimete:first)ʯ.",
        "This example gives us noun think the verbal noun affect this represents that indicates the kin eration of verbal noun is varied We think concretely (kaidan:meeting)ʯ of Exp First, we think that ʮձஊ (k is complemented the verbal n (kaidan suru:have a talk)ʯ. generally at sentence end in J the predicate does not exist in inclinable in human thought t term is predicate.",
        "The other that ʮ ձ ஊ (kaidan:colloquy or verbal operation in Exp.18 (kaidan:meeing)ʯ is not sent when ʮձஊ (kaidan:meeting human have unnaturalness.",
        "A (kaidan:meeting)ʯ is verbal, hu unnatural.",
        "We cite the error summary wh is noun other than verbal noun the verbal operation of noun is p sentences.",
        "And the noun of op Weexamineth emachinean dmanual sum-maries.Althoughmanysentencesar enot much different, somesentenceshavebi gdifferences for summarization.On eexamplei sshown as follows, original sentence,it smachine summary and its manual summary respectively.",
        "This is shown thatʮ͋ Δ (aru)ʯis dictum phraseology.",
        "And the sentence end isʮ ΋ (mo)ʯ .",
        "This is often seen in the news headline.",
        "But the proposed technique do not deal with them."
      ]
    },
    {
      "heading": "6.4 Summarization Failure",
      "text": [
        "We examine the sentences which are not summarized by the method.",
        "We picked up the 200 sentences at random and examine whether or not it should be summarized.",
        "This results is that 9 sentences are missing.",
        "The example is shown below with the supposed summary.",
        "(Mr. Ikemoto’s blob was found from the burned-out site.)",
        "Exp.20 is not summarized.",
        "The reason of this error is caused by an error of the morphological analysis."
      ]
    },
    {
      "heading": "7 Conclusion",
      "text": [
        "In order to generate short and smart style seen in news headlines, this paper presents a method of transforming Japanese sentence end expressions into short style.",
        "Our observation reveals that the end of sentence in the headlines are either nouns or case particles in many sentences, we thus attempt to summarize them as short as possible.",
        "We have implemented the approach and evaluated in summarization ratio and their correctness.",
        "The results illustrates that the reduction ratio is 6% against overall sentence length, and the sentence is expected to be cut off 2.50 characters per sentence.",
        "The length of automatic shortening is approximately the same as manual summarization.",
        "We also confirmed that 95% of the summaries were judged to be correct."
      ]
    },
    {
      "heading": "Acknowledgment",
      "text": []
    }
  ]
}
