{
  "info": {
    "authors": [
      "Timothy Chklovski",
      "Patrick Pantel"
    ],
    "book": "Second International Joint Conference on Natural Language Processing: Full Papers",
    "id": "acl-I05-1069",
    "title": "Global Path-Based Refinement of Noisy Graphs Applied to Verb Semantics",
    "url": "https://aclweb.org/anthology/I05-1069",
    "year": 2005
  },
  "references": [
    "acl-N04-1010",
    "acl-N04-1041",
    "acl-P99-1008",
    "acl-W04-3205"
  ],
  "sections": [
    {
      "text": [
        "Timothy Chklovski and Patrick Pantel",
        "Abstract.",
        "Recently, researchers have applied text-and web-mining algorithms to mine semantic resources.",
        "The result is often a noisy graph of relations between words.",
        "We propose a mathematically rigorous refinement framework, which uses path-based analysis, updating the likelihood of a relation between a pair of nodes using evidence provided by multiple indirect paths between the nodes.",
        "Evaluation on refining temporal verb relations in a semantic resource called VerbOcean showed a 16.1% error reduction after refinement."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Increasingly, researchers are creating broad-coverage semantic resources by mining text corpora [1][5] and the Web [2][6].",
        "These resources typically consist of a noisy collection of relations between words.",
        "The data is typically extracted on a per link basis (i.e., the relation between two nodes is determined without regard to other nodes).",
        "Yet, little work has taken a global view of the graph of relations, which may provide additional information to refine local decisions by identifying inconsistencies, updating confidences in specific edges (relations), and suggesting relations between additional pairs of nodes.",
        "For example, observing the temporal verb relations \"discover happens-before refine\" and \"refine happens-before exploit\" provides evidence for the relation \"discover happens-before exploit,\" because the happens-before relation is transitive.",
        "We conceptualize a semantic resource encoding relations between words as a graph where words are nodes and binary relations between words are edges.",
        "In this paper, we investigate the refinement of such graphs by updating the confidence in edges using a global analysis relying on link semantics.",
        "Our approach is based on the observation that some paths (chains of relations) between a pair of nodes x and Xj imply the presence or absence of a particular direct relation between x and Xj.",
        "Despite each individual path being noisy, multiple indirect paths can provide sufficient evidence for adding, removing, or altering a relation between two nodes.",
        "As illustrated by the earlier example, inferring a relation based on the presence of an indirect path relies on the semantics of the links that make up the path, like transitivity or equivalence classes.",
        "As an evaluation and a sample practical application, we apply our refinement framework to the task of refining the temporal precedence relations in VerbOcean, a broad-coverage noisy network of semantic relations between verbs extracted by mining the Web [2].",
        "Examples of new edges discovered (added) by applying the",
        "Global Path-Based Refinement of Noisy Graphs Applied to Verb Semantics 793 framework include: \"ascertain happens-before evaluate\", \"approve happens-before back\", \"coat happens-before bake\", \"plan happens-before complete\", and \"interrogate happens-before extradite\".",
        "Examples of edges that are removed by applying our framework include: \"induce happens-before treat\", \"warm happens-before heat\", \"halve happens-before slice\", and \"fly happens-before operate\".",
        "Experiments show that our framework is particularly good at filtering out the incorrect temporal relations in VerbOcean.",
        "Removing incorrect relations is particularly important for inference systems."
      ]
    },
    {
      "heading": "2. VerbOcean",
      "text": [
        "We apply our path-based refinement framework to VerbOcean [2], a web-extracted lexical semantics resource with potential applications to a variety of natural language tasks such as question answering, information retrieval, document summarization, and machine translation.",
        "VerbOcean is a graph of semantic relations between verbs, with 3,477 verbs (nodes) and 22,306 relations (edges).",
        "Although the framework applies whenever some paths through the graph imply presence or absence of a relation, for the evaluation we focus on the temporal precedence relation in VerbOcean, and, in an ancillary role, on the similarity relation.",
        "Senses are not discriminated and an edge indicates that the relation is believed to hold between some senses of the verbs in this relation.",
        "The five semantic relations present in VerbOcean are presented in Table 1.",
        "Temporal precedence (happens-before) is a transitive asymmetric temporal relation between verbs.",
        "Similarity is a relation that suggests two nodes are likely to be in the same equivalence class, although polysemy makes it only weakly transitive.",
        "Table 1.",
        "Types, examples and frequencies of 22,306 semantic relations in VerbOcean",
        "In VerbOcean, asymmetric relations between two nodes are enforced to be unidirectional (i.e., presence of an edge xi happens-before xj guarantees absence of an edge %j happens-before x).",
        "Larger, inconsistent loops are possible, however, as extraction is strictly local.",
        "Taking advantage of the global picture to refine the edges of the graph can improve quality of the resource, helping performance of any algorithms or applications that rely on the resource.",
        "Semantic Relation",
        "Example",
        "Transitive",
        "Symmetric",
        "# in VerbOcean",
        "temporal precedence",
        "marry :: divorce",
        "Y",
        "N",
        "4,205",
        "similarity",
        "produce :: create",
        "Y",
        "Y",
        "11,515",
        "strength",
        "wound :: kill",
        "Y",
        "N",
        "4,220",
        "antonymy",
        "open :: close",
        "N",
        "Y",
        "1,973",
        "enablement",
        "fight :: win",
        "Y",
        "N",
        "393"
      ]
    },
    {
      "heading": "3. Global Refinement",
      "text": [
        "Our approach relies on a global view of the graph to refine a relation between a given pair of nodes xi and xj, based on multiple indirect paths between the two nodes.",
        "The analysis processes triples <xi, r, x> for the relation r to output r, its opposite (which we will denote q), or neither.",
        "The opposite of happens-before is the same relation in the reverse direction (happens-after).",
        "The refinement is based on evidence provided by indirect paths, over a probabilistic representation of the graph.",
        "Section 3.1 introduces the steps of the refinement, Section 3.2 details which paths are used as evidence, and Section 3.3 derives the statistical model used for combining evidence from multiple unreliable paths.",
        "We first introduce some notation.",
        "Let Ry denote the event that the relation r is present between nodes xi and Xj in the original graph - i.e., the graph indicates (perhaps spuriously) the presence of the relation r between xi and xj.",
        "Let ri,j denote the relation r actually holding between xi and xj.",
        "Let if/ij denote an acyclic path from xi to xj of (possibly distinct) relations [Rii+1 „ Rj-1j}.",
        "For example, the path \"x1 similar x2 happens-before x3\" can be denoted f 1,3.",
        "If the edges of f i,j indicate the relation r between the nodes xi and xj, we say that fy indicates rij.",
        "Given a triple <xi, r, xj>, we identify the set W/u\" of all paths such that indicates rtj and fjs sequence of relations [Riii+1 „ Rj-\\j} matches one of the allowed sequences.",
        "That is, we only consider certain path types.",
        "The restriction on types of paths considered is introduced because identifying and processing all possible paths indicating ri,j is too demanding computationally in a large non-sparse graph.",
        "The path types considered are detailed in Section 3.2.",
        "Note that the intermediate nodes of paths can range over the entire graph.",
        "For each fij in the above set Wrfu\", we compute the estimated probability that riJholds given the observation of (relations that make up) fy.",
        "Each edge in the input graph is treated as a probabilistic one, with probabilities P(ry) and P(ryiRy) estimated from human judgments on a representative sample.",
        "Generally, longer paths and paths made up of less reliable edges will have lower probabilities.",
        "Section 3.3 presents the full model for estimating these probabilities.",
        "Next, we form the set Wr by selecting from w/uU only the paths which have no common intermediate nodes.",
        "This is done greedily, processing all paths in Wrfu\" in order of decreasing score, placing each in Wr iff it does not share any intermediate nodes with any path already in Wr.",
        "This is done to avoid double-counting the available evidence in our framework, which operates assuming conditional independence of paths.",
        "Next, we compute P(rij i Wr), the probability of rij given the evidence provided by the paths in Wr.",
        "The model for computing this is described in Section 3.3.",
        "Similarly, Wq and P(qij i Wq) are computed for qij, the opposite of rij.",
        "Next, the evidence for r and q are reconciled by computing P(rij i Wr, Wq) and, similarly, P(qij i Wr, Wq).",
        "Finally, the more probable of the two relations ri,j and qi,j is output if its probability exceeds a threshold value Pmin (i.e., rtj is output if P(rtj i Wr, Wq) > P(qtj i Wr, Wq) and P(rtj i <Pr, Wq) > Pmin.",
        "In Section 4.2, we experiment with varying values of Pmin.",
        "The enabling observation behind our approach is that in a graph in which edges have certain properties such as transitivity, some paths Wtj indicate the presence of a relation between the first node xi and the last node xj.",
        "In the paths we consider, we rely on two kinds of inferences: transitivity and equivalence.",
        "Also, we do not consider very long paths, as they tend to become unreliable due to accumulation of chance of false detection of each edge and sense drift in each intermediate node.",
        "The set of paths to consider was not rigorously motivated.",
        "Rather, we aimed to cover some common cases.",
        "Refining the sets of paths is a possible fruitful direction for future work.",
        "For the presence of happens-before, a transitive asymmetric relation, we considered all 11 path types of length 3 or less which imply happens-before between the end nodes based on transitivity and equivalence:",
        "\"happens-before\" \"similar, similar, happens-before\" \"happens-before, similar\" \"happens-before, happens-before, similar\" \"similar, happens-before\" \"similar, happens-before, happens-before\" \"happens-before, happens-before\" \"happens-before, similar, happens-before\" \"happens-before, similar, similar\" \"happens-before, happens-before, happens-before\" \"similar, happens-before, similar\"",
        "This section presents a rigorous derivation of the probabilistic model for computing and combining probabilities with which indirect paths indicate a given edge.",
        "We first derive probability of r1n given single path f 1n:",
        "If n is 2, i.e. f1n has only one edge R12, we have simply the probability that the edge actually holds given its presence in the graph:",
        "Otherwise, f1n has intermediate nodes, in which case P(r^n i can be estimated as follows:",
        "Because r1n is conditionally independent from Rii+1 given rii+1 or -rii+1, we can simplify:",
        "Assuming independence of a given relation ri,i+1 from all edges in f1,n except for the edge Ri,i+1 yields:",
        "Let Pmatch denote the probability that there is no significant shift in meaning at a given intermediate node.",
        "Then, assume that path r1>2,..., rn-1n indicates r1n iff the meanings at n - 2 intermediate nodes match:",
        "Also, when one or more of the relations rii+1 do not hold, nothing is generally implied about r1n, thus",
        "Plugging these in, we have: which can be rewritten as:",
        "where the prior P(r1n) and the conditional P(rii+1 I Rii+1) can be estimated empirically by manually tagging the relations Rirj in a graph as correct or incorrect: P(r1>n) is the probability that an edge will be labeled with relation r by a human judge, and P(rti i+1 I Rit is the precision with which the system could identify R. While Pmatchcan be estimated empirically we have not done so.",
        "We experimentally set Pmatch = 0.9.",
        "In this subsection we derive an estimate of the validity of inferring r1n given the set Wr of m paths y^, y^, w\":",
        "In the case of zero paths, we use simply P(r1n n)=P(r), the probability of observing r between a pair of nodes from a sample set with no additional evidence.",
        "The case of one path has been treated in the previous section.",
        "In the case of multiple paths, we derive the expression as follows (omitting for convenience subscripts on paths, and distinguishing them by their superscripts).",
        "We assume conditional independence of any two paths and if/ given r or -r. Using Bayes' rule yields:",
        "The above denominator can be rewritten as:",
        "Using Bayes' rule again, the expressions in the above products can be rewritten as follows:",
        "Substituting into Eq.",
        "5 the Eqs.",
        "6 and 7 yields:",
        "(II=1..mP(vk).",
        "Using the above for the denominator of Eq.",
        "4, using Eq.",
        "6 in the numerator of Eq.",
        "4, and simplifying, we have:",
        "where P(r I /k) is as in Eq.",
        "2 and P(r) can be estimated empirically.",
        "3.3.3 Estimating from Supporting and Opposing Paths",
        "Recall that q denotes the opposite of r. The previous section has shown how to compute P(r I Yr) and, similarly, P(q I Yq).",
        "We now derive how to estimate r given both Y Y :",
        "We assume that r and q are disjoint, P(r,q)= P(rIq)= P(qIr)=0.",
        "We also assume that q is conditionally independent from Yr given -r, i.e.,",
        "We proceed by deriving the following, each consequent relying on the previous result:",
        "Lemma 3: P(r | -q, Yr) and P(q | -r, Yq), in Eqs.",
        "13 and 14 Theorem 1: P(r I Yr, Yq), in Eq.",
        "18.",
        "Solving for P(q I -r), we obtain:",
        "And thus Theorem 3 P(r I Yr, Yq) can be derived using the above Lemmas, as follows:",
        "Expanding and simplifying, we establish our Theorem 1 :"
      ]
    },
    {
      "heading": "4. Experimental Results",
      "text": [
        "In this section, we evaluate our refinement framework on the temporal precedence relations discovered by VERBOCEAN, and present some observations on applying the refinement to other VerbOcean relations.",
        "Following Chklovski and Pantel [2], we studied 29,165 pairs of verbs obtained from a paraphrasing algorithm called DIRT [4].",
        "We applied VerbOcean to the 29,165 verb pairs, which tagged each pair with the semantic tag happens-before, happens-after and no temporal precedence\\",
        "For our experiments, we randomly sampled 1000 of these verb pairs, and presented them to two human judges (without revealing the VerbOcean tag).",
        "The judges were asked to classify each pair among the following tags:",
        "Happens-before with entailment Happens-before without entailment Happens-after with entailment Happens-after without entailment Another semantic relation No semantic relation",
        "For the purposes of our evaluation, tags a and b align with VerbOcean's happens-before tag, tags c and d align with the happens-after tag, and tags e and f align with the no temporal relation tag.",
        "The Kappa statistic [7] for the task was k = 0.78.",
        "Table 2 shows the overall accuracy of VerbOcean tags on the 1000 verb pairs randomly sampled from DIRT.",
        "Each row represents a different refinement.",
        "The number in parentheses is Pmin, the threshold value for the strength of the relation from Section 3.1.",
        "As the threshold is increased, the refinement algorithm requires greater evidence (more supporting paths and absence of opposing evidence) to trigger a temporal relation between a pair of verbs.",
        "Table 2.",
        "Accuracy (95% confidence) of VerbOcean on a random sample of 1000 verb pairs tagged by two judges * Combo combines the no temporal relation from the 0.5 and the happens-before and happens-after from the and 0.95 refinements, where the reported accuracy is computed on the subset of 716 verb pairs for which the algorithm is most confident.",
        "Table 3 shows the reassignments due to refinement.",
        "At the 0.5 level, the refinement left 76 of 81 relations unchanged, revising 3 to happens-after and 2 to no temporal relation.",
        "Similarly, only two of the original happens-after relations were changed with refinement.",
        "However, of the 849 originally tagged no temporal relation, the Table 3.",
        "Allocation change between semantic tags due to refinement Fig. 1.",
        "Refinement precision on each semantic Fig. 2.",
        "Refinement recall on each semantic tag tag",
        "Judge1",
        "Accuracy Judge2",
        "Total",
        "Unrefined",
        "80.7%",
        "74.8%",
        "77.7% ± 2.0%",
        "Refined (0.5)",
        "66.0%",
        "63.7%",
        "64.8% ± 2.6%",
        "Refined (0.66)",
        "75.4%",
        "71.7%",
        "73.5% ± 2.4%",
        "Refined (0.9)",
        "83.1%",
        "77.2%",
        "80.2% ± 2.1%",
        "Refined (0.95)",
        "84.5%",
        "78.0%",
        "81.3% ± 1.9%",
        "Refined (Combo)*",
        "86.8%",
        "81.3%",
        "84.0% ± 2.4%",
        "Hence, at the 0.5 level, pairs classified as no temporal relation were improved while at the 0.95 level, pairs classified as a temporal relation were improved.",
        "To leverage benefits of the two, we applied both the 0.5 and 0.95 level refinements and kept happens-before and happens-after classifications from the 0.95 level, and kept the no temporal relation classification from the 0.5 level.",
        "284 verb pairs were left unclassified.",
        "On the 716 classified verb pairs, refinement improved accuracy by 6.3%.",
        "Fig.",
        "3.",
        "Refinement precision on all 1000 verb pairs vs. on the 819 verb pairs on which the annotators agree on tag",
        "This combination is guaranteed to be free of conflicts in classification because it is impossible for a relation to be classified as temporal at the 0.95 threshold level while being classified as non-temporal at the 0.5 level.",
        "refinement moved 113 to happens-before and 109 to happens-after.",
        "The precision of the 0.5 refinement on the no temporal relation tag increased by 4%; however, the precision on the temporal relations decreased by 5.7%.",
        "At the 0.95 refinement level, 54 of the 81 relations originally tagged happens-before and 45 of the 70 relations originally tagged happens-after were changed to no temporal relation.",
        "Only 34 of the 849 no temporal relations were changed.",
        "At this level, the precision of no temporal relation tag decreased by 0.8% and the temporal relations' precision increased by 4%.",
        "Happens-Before",
        "Happens-After",
        "No Temporal Relation",
        "Unrefined",
        "81",
        "70",
        "849",
        "Refined (0.5)",
        "190",
        "180",
        "630",
        "Refined (0.66)",
        "118",
        "124",
        "758",
        "Refined (0.9)",
        "53",
        "66",
        "881",
        "Refined (0.95)",
        "40",
        "46",
        "914",
        "Figures 1 and 2 illustrate the refinement precision and recall for each semantic tag.",
        "Both annotators have agreed on 819 verb pairs, and we examined performance on these.",
        "Figure 3 shows a higher precision on these pairs as compared to the overall set, illustrating that what is easier for the annotators is easier for the system.",
        "We have briefly investigated refining other semantic relations in VerbOcean.",
        "The extent of the evaluation was limited by availability of human judgments.",
        "We randomly sampled 100 pairs from DIRT and presented the classifications to three human judges for evaluation [2].",
        "Of the 100 pairs, 66 were identified to have a relation.",
        "We applied our refinement algorithm to VerbOcean and inspected the output.",
        "On the 37 relations that VerbOcean got wrong, our system identified six of them.",
        "On the remaining 29 that VerbOcean got correct, only one was identified as incorrect (false positive).",
        "Hence, on the task of identifying incorrect relations in VerbOcean, our system has a precision of 85.7%, where precision is defined as the percentage of correctly identified erroneous relations.",
        "However, it only achieved a recall of 16.2%, where recall is the percentage of erroneous relations that our system identified.",
        "Table 4 presents the relations that were refined by our system.",
        "The first two columns show the verb pair while the next two columns show the original relation in VerbOcean.",
        "Table 4.",
        "Seven relations in VerbOcean refined by a small test run on other relations * only revision of relation to its opposite or \"none\" was attempted here",
        "Our evaluation focused on the presence or absence of relations after refinement, without exploiting the fact that our framework also updates confidences in a given relation.",
        "The additional information about confidence can benefit probabilistic inference approaches (e.g., [3]).",
        "Possible extensions to the algorithm include a more elaborate inference from graph structure, for example treating the absence of certain paths as counter-evidence.",
        "Suppose that relations A happens-before B and A similar A' were detected, but the relation A' happens-before B was not.",
        "Then, the absence of a path",
        "Verb 1",
        "Verb 2",
        "VerbOcean Relation",
        "Refinement Relation",
        "Judge 1 Relation",
        "Judge 2 Relation",
        "Judge 3 Relation",
        "attach",
        "use",
        "happens-before similar",
        "similar",
        "none",
        "none",
        "none",
        "bounce",
        "get",
        "weaker than",
        "stronger than",
        "none",
        "none",
        "none",
        "dispatch",
        "defeat",
        "opposite",
        "none",
        "none",
        "none",
        "happens-before",
        "doom",
        "complicate",
        "opposite",
        "similar*",
        "none",
        "stronger-than",
        "stronger-than",
        "flatten",
        "level",
        "stronger than",
        "no relation*",
        "similar",
        "similar",
        "similar",
        "outlaw",
        "codify",
        "similar",
        "opposite",
        "none",
        "none",
        "opposition",
        "privatize",
        "improve",
        "happens-before",
        "none",
        "happens-before",
        "happens-before",
        "happens-before",
        "Global Path-Based Refinement of Noisy Graphs Applied to Verb Semantics 803",
        "A similar A' happens-before B suggests the absence of A happens-before B.",
        "Other important avenues of future work include applying our framework to other relations (e.g., strength in VerbOcean) and to better characterize the refinement thresholds."
      ]
    },
    {
      "heading": "5. Conclusions",
      "text": [
        "We presented a method for refining edges in graphs by leveraging the semantics of multiple noisy paths.",
        "We re-estimated the presence of an edge between a pair of nodes from the evidence provided by multiple indirect paths between the nodes.",
        "Our approach applies to a variety of relation types: transitive symmetric, transitive asymmetric, and relations inducing equivalence classes.",
        "We applied our model to refining temporal verb relations in a semantic resource called VerbOcean.",
        "Experiments showed a 16.1% error reduction after refinement.",
        "On the 72% refinement decisions that it was most confident, the error reduction was 28.3%.",
        "The usefulness of a semantic resource is highly dependent on its quality, which is often poor in automatically mined resources.",
        "With graph refinement frameworks such as the one presented here, many of these resources may be improved automatically."
      ]
    }
  ]
}
