{
  "info": {
    "authors": [
      "Shingo Kato",
      "Shigeki Matsubara",
      "Yukiko Yamaguchi",
      "Nobuo Kawaguchi"
    ],
    "book": "Proceedings of the Fifth Workshop on Asian Language Resources (ALR-05) and First Symposium on Asian Language Resources Network (ALRN)",
    "id": "acl-I05-4006",
    "title": "Construction of Structurally Annotated Spoken Dialogue Corpus",
    "url": "https://aclweb.org/anthology/I05-4006",
    "year": 2005
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes the structural annotation of a spoken dialogue corpus.",
        "By statistically dealing with the corpus, the automatic acquisition of dialogue-structural rules is achieved.",
        "The dialogue structure is expressed as a binary tree and 789 dialogues consisting of 8150 utterances in the CIAIR speech corpus are annotated.",
        "To evaluate the scalability of the corpus for creating dialogue-structural rules, a dialogue parsing experiment was conducted."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "With the improvement of speech processing technologies, spoken dialogue systems that appropriately respond to a user’s spontaneous utterances and cooperatively execute a dialogue are desired.",
        "It is important for cooperative spoken dialogue systems to understand the intentions of a user’s utterances, the purpose of the dialogue, and its achievement state (Litman, 1990).",
        "To solve this issue, several approaches have been so far proposed.",
        "One of them is an approach in which the system expresses the knowledge of the dialogue with a frame and executes the dialogue according to that frame (Goddeau, 1996; Niimi, 2001; Oku, 2004).",
        "However, it is difficult to make a frame that totally defines the content of the dialogue.",
        "Additionally, there is a tendency for the dialogue style to be greatly affected by the frame.",
        "In this paper, we describe the construction of a structurally annotated spoken dialogue corpus.",
        "By statistically dealing with the corpus, we can achieve the automatic acquisition of dialogue-structural rules.",
        "We suppose that the system can figure out the state of the dialogue through the incremental building of the dialogue structure.",
        "We use the CIAIR in-car spoken dialogue corpus (Kawaguchi, 2004; Kawaguchi, 2005), and describe the dialogue structure as a binary tree.",
        "The tree expresses the purpose of partial dialogues and the relations between utterances or partial dialogues.",
        "The speaker’s intention tags were provided in the transcription of the corpus.",
        "We annotated 789 dialogues consisting of 8150 utterances.",
        "Due to the advantages of the dialogue",
        "structural rules being represented by context free grammars, we were able to use an existing technique for natural language processing to reduce the annotation burden.",
        "In section 2, we explain the CIAIR in-car spoken dialogue corpus and the speaker’s intention tags.",
        "In sections 3 and 4, we discuss the design policy of a structurally annotated spoken dialogue corpus and the construction of the corpus.",
        "In section 5, we evaluate the corpus."
      ]
    },
    {
      "heading": "2 Spoken Dialogue Corpus with Layered Intention Tags",
      "text": [
        "The Center for Integrated Acoustic Information Research (CIAIR), Nagoya University, has been compiling a database of in-car speech and dialogue since 1999, in order to achieve robust spoken dialogue systems in actual usage environments (Kawaguchi, 2004; Kawaguchi, 2005) This corpus has been recorded using more than 800 subjects.",
        "Each subject had conversations with three types of dialogue system: a human operator, the Wizard of OZ system, and the conversational system.",
        "In this project, a system was specially built in a Data Collection Vehicle (DCV), shown in Figure 1, and was used for the synchronous recording of multichannel audio data, multichannel video data, and vehicle related data.",
        "All dialogue data were transcribed according to transcription standards in compliance with CSJ (Corpus of Spontaneous Japanese) (Maekawa, 2000) and were assigned discourse tags such as fillers, hesitations, and slips.",
        "An example of a transcript is shown in Figure 2.",
        "Utterances were divided into utterance units by a pause of 200 ms or more.",
        "These dialogues are annotated by speech act tags called Layered Intention Tags (LIT) (Irie, 2004(a)), which indicate the intentions of the speaker’s utterances.",
        "LIT consists of four layers: “Discourse act”, “Action”, “Object”, and “Argument”.",
        "Figure 3 shows a part of the organization of LIT.",
        "As Figure 3 shows, the lower layered intention tag depends on the upper layered one.",
        "In principle, one LIT is given to one utterance unit.",
        "35,421 utterance units have been tagged by hand (Irie, 2004(a)).",
        "In this research, we use parts of the restaurant guide dialogues between a driver and a human operator.",
        "An example of the dialogue corpus with LIT is shown in Table 1.",
        "In the column called Speaker, “D” means a driver’s utterance and “O” means an operator’s one.",
        "We used the Discourse act, Action, and Object layers and extended them with speaker symbols such as “D+Request+Search+Shop”.",
        "There are 41 types of extended LIT.",
        "Because the “Argument” layer is too detailed to express the dialogue structure, we omitted it."
      ]
    },
    {
      "heading": "3 Description of Dialogue Structure",
      "text": []
    },
    {
      "heading": "3.1 Dialogue structure",
      "text": [
        "In this research, we assume that the fundamental unit of a dialogue is an utterance to which one LIT is given.",
        "To make the structural analysis of the dialogue more efficient, we express the dialogue structure as a binary tree.",
        "We defined a category called POD (Part-Of-Dialogue), according to the observations of the restaurant guide task, that was especially focused on what subject was dealt with.",
        "As a result of this, 11 types of POD were built (Table 2).",
        "Each node of a structural tree is labeled with a POD or LIT.",
        "The dialogue structural tree of Table 1 is shown in Figure 4."
      ]
    },
    {
      "heading": "3.2 The design policy of dialogue structure",
      "text": [
        "To consider a dialogue as an LIT sequence, LIT providing process (Irie, 2004(b)) usually should be done.",
        "Furthermore, repairs and corrections are eliminated because they do not provide LIT.",
        "In this research, we used an LIT sequence provided in the corpus.",
        "After that, the annotation of the dialogue structure was done in the following way.",
        "Merging utterances: When two adjoining utterances such as request and answer, they seem to be able to pair up and merge with an",
        "appropriate POD.",
        "In Table 1, for example, the utterance “Should I make a reservation?” (#286) is a request and the answer to #286 is “No, a reservation is not necessary”(#287).",
        "In this way, utterances are combined with the POD “SINFO”.",
        "When the LIT’s of two adjacent utterances are corresponding, these utterances are supposed to be paired and merged with the same LIT.",
        "Utterance “Fresh and roe” (#280) and “I want to have Hotpot” (#281) are related to choosing the style of restaurant and are provided with the same LIT.",
        "Therefore they are combined with the LIT “D+Statement+Select+Genre”.",
        "Merging partial dialogues: When two adjoining partial dialogues (i.e. a partial tree) are composing another partial dialogue, they are merged with a proper POD.",
        "In Table 1, for example, a search dialogue (from #277 to #285, SRCH) and a shop information dialogue helping search (from #286 to #287, SINFO) are combined and labeled as the POD “SLCT”.",
        "When the POD’s of two adjacent partial dialogues are corresponding, these dialogues are merged with the same POD.",
        "Two search dialogues (one is from #277 to #282, other is from #283 to #285) are combined with the same POD “SRCH”.",
        "The root of the tree: The POD of the root of the tree is “GUIDE”, because the domain of the corpus is restaurant guide task."
      ]
    },
    {
      "heading": "4 Construction of Structurally Annotated Spoken Dialogue Corpus",
      "text": []
    },
    {
      "heading": "4.1 Work environment and procedures",
      "text": [
        "We made a dialogue parser as a supportive environment for annotating dialogue structures.",
        "Applying the dialogue-structural rules, which are obtained from annotated structural trees (like Figure 4.",
        "), the parser analyzes the inputs of the LIT sequences and the outputs off all available dialogue-structural trees.",
        "An annotator then chooses the correct tree from the outputs.",
        "When the outputs don’t include the correct tree, the annotator should rectify the wrong tree rewriting the list form of the tree.",
        "In this way, we make the annotation more efficient.",
        "The dialogue parser was implemented using the bottom-up chart parsing (Kay, 1980).",
        "The structural rules were extracted from all annotated dialogues.",
        "In the environment outlined above, we have worked at bootstrap building.",
        "That is, we",
        "1. outputed the dialogue structures through the parser.",
        "2. chose and rectified the dialogue structure using an annotator.",
        "3. extracted some structural rules from some dialogue-structural trees.",
        "We repeated these procedures and increased the structural rules incrementally, so that the dialogue parser improved it’s operational performance."
      ]
    },
    {
      "heading": "4.2 Structurally annotated dialogue corpus",
      "text": [
        "We built a structurally annotated dialogue corpus in the environment described in Section 4.1, using the restaurant guide dialogues in the CIAIR corpus.",
        "The corpus includes 789 dialogues consisting of 8150 utterances.",
        "One dialogue is composed of 11.61 utterances.",
        "Table 3 shows them in detail.",
        "number of dialogues 789 number of utterances 8150 number of structural rules 297 utterances per one dialogue 11.61 number of dialogue-structural tree types 659 number of LIT sequence types 657"
      ]
    },
    {
      "heading": "5 Evaluation of Structurally Annotated",
      "text": []
    },
    {
      "heading": "Dialogue Corpus",
      "text": [
        "To evaluate the scalability of the corpus for creating dialogue-structural rules, a dialogue parsing experiment was conducted.",
        "In the experiment, all 789 dialogues were divided into two data sets.",
        "One of them is the test data consists of 100 dialogues and the other is the training data consists of 689 dialogues.",
        "Furthermore, the training data were divided into 10 training sets.",
        "By increasing the training data sets, we extracted the probabilistic structural-rules from each data.",
        "We then parsed the test data using the rules and ranked their results by probability.",
        "In the evaluation, the coverage rate, the correct rate, and the N-best correct rate were used.",
        "= Number of the dialogues which can be parsed Test = Number of the dialogues which include the correct tree in their parse trees best = Number of the dialogues which include the correct tree in their n-best parse trees Dtest = Number of the dialogues in the test data The results of the evaluation of the coverage rate and the correct rate are shown in Figure 5.",
        "The correct rates for each of the training sets, ranked from 1-best to 10-best, are shown in Figure 6.",
        "In Figure 5, both the coverage rate and the correct rate improved as the training data was increased.",
        "The coverage rate of the training set consisting of 689 dialogues was 92%.",
        "This means",
        "that the rules that were from the training set enabled the parsing of a wide variety dialogues.",
        "The fact the correct rate was 86% shows that, using the rules, the correct structures can be built for a large number of dialogues.",
        "Three in eight failure dialogues had continued after a guidance for a restaurant.",
        "Therefore, we assume that offering guidance to a restaurant is a termination of the dialogue, in which case they couldn’t be analyzed.",
        "Another three dialogues couldn’t be analyzed because they included some LIT which rarely appeared in the training data.",
        "The cause of failure in the other two dialogues is that an utterance that should be combined with its adjoining utterance is abbreviated.",
        "the training set consisting of 689 dialogues was 80%.",
        "Therefore the correct rate is 86%, and approximately 93% (80/86) of the dialogues that can be correctly analyzed include the correct tree in their top-10.",
        "According to Figure 5, the number of average parse trees increased with the growth of the training data.",
        "However, most of the dialogues that can be analyzed correctly are supposed to include the correct tree in their top-10.",
        "Therefore, it is enough to refer to the top-10 in a situation where the correct one should be chosen from the set of candidates, such as in the speech prediction and the dialogue control.",
        "As a result, the high-speed processing is achieved."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "In this paper, we described the construction of a structurally annotated spoken dialogue corpus.",
        "From observating the restaurant guide dialogues, we designed the policy of the dialogue structure and annotated 789 dialogues consisting of 8150 utterances.",
        "Furthermore, we have evaluated the scalability of the corpus for creating dialogue-structural rules.",
        "We now introduce the application field of the structurally annotated dialogue corpus.",
        "Discourse analysis: Using a POD labeled information for each partial structure of the dialogue, we can obtain information such as the structure of the domain, the user’s tasks, the dialogue formats, etc.",
        "Speech prediction and dialogue control: A system builds the structure of an input up to date and extracts the dialogue example that is most similar to the structure of the input from the corpus.",
        "If the next utterance or LIT of the extracted dialogue is the user’s, the system waits for the user’s utterance and predicts its meaning and intention.",
        "If the system’s utterance is next, the system uses the utterance or LIT to control the dialogue.",
        "At the present time, we have run up the data of the corpus and built probabilistic dialogue-structural trees.",
        "Next, we will apply the trees to some components of the spoken dialogue systems such as speech prediction and dialogue control."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The authors would like to thank Ms. Yuki Irie for her valuable comments about the design of the dialogue structure.",
        "This research was partially supported by the Grant-in-Aid for Scientific Research (No.",
        "15300045) of JSPS."
      ]
    }
  ]
}
