{
  "info": {
    "authors": [
      "Yi Hu",
      "Jianyong Duan",
      "Xiaoming Chen",
      "Bingzhen Pei",
      "Ruzhan Lu"
    ],
    "book": "Second International Joint Conference on Natural Language Processing: Full Papers",
    "id": "acl-I05-1001",
    "title": "A New Method for Sentiment Classification in Text Retrieval",
    "url": "https://aclweb.org/anthology/I05-1001",
    "year": 2005
  },
  "references": [
    "acl-C00-1044",
    "acl-P02-1053",
    "acl-P04-1035",
    "acl-P97-1023",
    "acl-W02-1011"
  ],
  "sections": [
    {
      "text": [
        "Yi Hu, Jianyong Duan, Xiaoming Chen', Bingzhen Pei', and Ruzhan Lu",
        "Abstract.",
        "Traditional text categorization is usually a topic-based task, but a subtle demand on information retrieval is to distinguish between positive and negative view on text topic.",
        "In this paper, a new method is explored to solve this problem.",
        "Firstly, a batch of Concerned Concepts in the researched domain is predefined.",
        "Secondly, the special knowledge representing the positive or negative context of these concepts within sentences is built up.",
        "At last, an evaluating function based on the knowledge is defined for sentiment classification of free text.",
        "We introduce some linguistic knowledge in these procedures to make our method effective.",
        "As a result, the new method proves better compared with SVM when experimenting on Chinese texts about a certain topic."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Classical technology in text categorization pays much attention to determining whether a text is related to a given topic [1], such as sports and finance.",
        "However, as research goes on, a subtle problem focuses on how to classify the semantic orientation of the text.",
        "For instance, texts can be for or against \"racism\", and not all the texts are bad.",
        "There exist two possible semantic orientations: positive and negative (the neutral view is not considered in this paper).",
        "Labeling texts by their semantic orientation would provide readers succinct summaries and be great useful in intelligent retrieval of information system.",
        "Traditional text categorization algorithms, including Naïve Bayes, ANN, SVM, etc, depend on a feature vector representing a text.",
        "They usually utilize words or n-grams as features and construct the weightiness according to their presence/absence or frequencies.",
        "It is a convenient way to formalize the text for calculation.",
        "On the other hand, employing one vector may be unsuitable for sentiment classification.",
        "See the following simple sentence in English:",
        "Seen from the history, the great segregation is a pioneering work.",
        "Here, \"segregation\" is very helpful to determine that the text is about the topic of racism, but the terms \"great\" and \"pioneering work\" may just be the important hints for semantic orientation (support the racism).",
        "These two terms probably contribute less to sentiment classification if they are dispersed into the text vector because the relations between them and \"segregation\" are lost.",
        "Intuitively, these terms can provide more contribution if they are considered as a whole within the sentence.",
        "We explore a new idea for sentiment classification by focusing on sentences rather than entire text.",
        "\"Segregation\" is called as Concerned Concept in our work.",
        "These Concerned Concepts are always the sensitive nouns or noun phrases in the researched domain such as \"race riot\", \"color line\" and \"government\".",
        "If the sentiment classifying knowledge about how to comment on these concepts can be acquired, it will be helpful for sentiment classification when meeting these concepts in free texts again.",
        "In other words, the task of sentiment classification of entire text has changed into recognizing the semantic orientation of the context of all Concerned Concepts.",
        "We attempt to build up this kind of knowledge to describe different sentiment context by integrating extended part of speech (EPOS), modified triggered bi-grams and position information within sentences.",
        "At last, we experiment on Chinese texts about \"racism\" and draw some conclusions."
      ]
    },
    {
      "heading": "2. Previous Work",
      "text": [
        "A lot of past work has been done about text categorization besides topic-based classification.",
        "Biber [2] concentrated on sorting texts in terms of their source or source style with stylistic variation such as author, publisher, and native-language background.",
        "Some other related work focused on classifying the semantic orientation of individual words or phrases by employing linguistic heuristics [3][4].",
        "Hatzivassiloglou et al. worked on predicting the semantic orientation of adjectives rather than phrases containing adjectives and they noted that there are linguistic constraints on these orientations of adjectives in conjunctions.",
        "Past work on sentiment-based categorization of entire texts often involved using cognitive linguistics [5] [11] or manually constructing discriminated lexicons [7][12].",
        "All these work enlightened us on the research on Concerned Concepts in given domain.",
        "Turney's work [9] applied an unsupervised learning algorithm based on the mutual information between phrases and the both words \"excellent\" and \"poor\".",
        "The mutual information was computed using statistics gathered by a search engine and simple to be dealt with, which encourage further work with sentiment classification.",
        "Pang et al. [10] utilized several prior-knowledge-free supervised machine learning methods in the sentiment classification task in the domain of movie review, and they also analyzed the problem to understand better how difficult it is.",
        "They experimented with three standard algorithms: Naïve Bayes, Maximum Entropy and Support Vector Machines, then compared the results.",
        "Their work showed that, generally, these algorithms were not able to achieve accuracies on the sentiment classification problem comparable to those reported for standard topic-based categorization."
      ]
    },
    {
      "heading": "3. Our Work",
      "text": [
        "As mentioned above, terms in a text vector are usually separated from the Concerned Concepts (CC for short), which means no relations between these terms and CCs.",
        "To avoid the coarse granularity of text vector to sentiment classification, the context of each CC is researched on.",
        "We attempt to determine the semantic orientation of a free text by evaluating context of CCs contained in sentences.",
        "Our work is based on the two following hypothesizes:",
        "♦ H1.",
        "A sentence holds its own sentiment context and it is the processing unit for sentiment classification.",
        "♦ H2.",
        "A sentence with obvious semantic orientation contains at least one Concerned Concept.",
        "H1 allows us to research the classification task within sentences and H2 means that a sentence with the value of being learnt or evaluated should contain at least one described CC.",
        "A sentence can be formed as:",
        "word_mword_(m_iy..word_lCCiwordv..word(n_l) wordn",
        "CC (given as an example in this paper) is a noun or noun phrase occupying the position 0 in sentence that is automatically tagged with extended part of speech (EPOS for short)(see section 3.2).",
        "A word and its tagged EPOS combine to make a 2-tuple, and all these 2-tuples on both sides of CQ can form a sequence as follows:",
        "All the words and corresponding EPOSes are divided into two parts: m 2-tuples on the left side of CQ (from m to -1) and n 2-tuples on the right (from 1 to n).",
        "These 2-tuples construct the context of the Concerned Concept CC,.",
        "The sentiment classifying knowledge (see sections 3.3 and 3.4) is the contribution of all the 2-tuples to sentiment classification.",
        "That is to say, if a 2-tuple often co-occurs with CC, in training corpus with positive view, it contributes more to positive orientation than negative one.",
        "On the other hand, if the 2-tuple often co-occurs with CC, in training corpus with negative view, it contributes more to negative orientation.",
        "This kind of knowledge can be acquired by statistic technology from corpus.",
        "When judging a free text, the context of CCt met in a sentence is respectively compared with the positive and negative sentiment classifying knowledge of the same CC, trained from corpus.",
        "Thus, an evaluating function E (see section 3.5) is defined to evaluate the semantic orientation of the free text.",
        "Usual part of speech (POS) carries less sentiment information, so it cannot distinguish the semantic orientation between positive and negative.",
        "For example, \"hearty\" and \"felonious\" are both tagged as \"adjective\", but for the sentiment classification, only the tag \"adjective\" cannot classify their sentiment.",
        "This means different adjective has different effect on sentiment classification.",
        "So we try to extend words' POS (EPOS) according to its semantic orientation.",
        "~W°rd_m '",
        "Word-(m-1)",
        "word-1",
        "CC,",
        "word1",
        "Word",
        "'Wordn '",
        "_ epos-m _",
        "_ epoS-(m-l) _",
        "epos-1",
        "epos1",
        "_ epos(„-1) _",
        "_ epoSn _",
        "Generally speaking, empty words only have structural function without sentiment meaning.",
        "Therefore, we just consider substantives in context, which mainly include nouns/noun phrases, verbs, adjectives and adverbs.",
        "We give a subtler manner to define EPOS of substantives.",
        "Their EPOSes are classified to be positive orientation (PosO) or negative orientation (NegO).",
        "Thus, \"hearty\" is labeled with \"pos-adj\", which means PosO of adjective; \"felonious\" is labeled with \"neg-adje\", which means NegO of adjective.",
        "Similarly, nouns, verbs and adverbs tagged with their EPOS construct a new word list.",
        "In our work, 12,743 Chinese entries in machine readable dictionary are extended by the following principles:",
        "♦ To nouns, their PosO or NegO is labeled according to their semantic orientation to the entities or events they denote (pos-n or neg-n).",
        "♦ To adjectives, their common syntax structure is {Adj.+Noun*}.",
        "If adjectives are favor of or oppose to their headwords (Noun*), they will be defined as PosO or NegO (pos-adj or neg-adj).",
        "♦ To adverbs, their common syntax structure is {Adv.+Verb*/Adj*.",
        "}, and Verb*/Adj*.",
        "is headword.",
        "Their PosO or NegO are analyzed in the same way of adjective (pos-adv or neg-adv).",
        "♦ To transitive verb, their common syntax structure is {TVerb+Object*}, and Object* is headword.",
        "Their PosO or NegO are analyzed in the same way of adjective (pos-tv or neg-tv).",
        "♦ To intransitive verb, their common syntax structure is {Sub-ject*+InTVerb}, and Subject* is headword.",
        "Their PosO or NegO are analyzed in the same way of adjective (pos-iv or neg-iv).",
        "Sentiment classifying knowledge is defined as the importance of all 2-tuples <word, epos> that compose the context of CQ (given as an example) to sentiment classification and every Concerned Concept like CC, has its own positive and negative sentiment classifying knowledge that can be formalized as a 3-tuple K:",
        "To CC,, its S,pos has concrete form that is described as a set of 5-tuples:",
        "Where S pos represents the positive sentiment classifying knowledge of CC , and it is a data set about all 2-tuples <word, epos> appearing in the sentences containing CQ in training texts with positive view.",
        "In contrast, S,neg is acquired from the training texts with negative view.",
        "In other words, S,pos and Stnes respectively reserve the features for positive and negative classification to CC, in corpus.",
        "In terms of Spos, the importance of < wordp epos^> is divided into wordvaf and",
        "eposvalp (see section 4.1) which is estimated by modified triggered bi-grams to fit the",
        "long distance dependence.",
        "If < word.",
        ", eposp > appears on the left side of CCi, the \"side\" adjusting factor is af ; if it appears on the right, the \"side\" adjusting factor is aright.",
        "We also define another factor ß (see section 4.3) that denotes dynamic \"positional\" adjusting information during processing a sentence in free text.",
        "If a <word, epos> often co-occurs with CCi in sentences in training corpus with positive view, which may means it contribute more to positive orientation than negative one, and if it often co-occurs with CC in negative corpus, it may contribute more to negative orientation.",
        "We modify the classical bi-grams language model to introduce long distance triggered mechanism of CC, – < word, epos >.",
        "Generally to describe, the contribution c of each 2-tuple in a positive or negative context (denoted by Pos_Neg) is calculated by (5).",
        "This is an analyzing measure of using multi-feature resources.",
        "The value represents the contribution of <word, epos> to sentiment classification in the sentence containing CC.",
        "Obviously, when a and ß are fixed, the bigger Pr(<word, epos>\\CCi, Pos_Neg>) is, the bigger contribution c of the 2-tuple <word, epos> to the semantic orientation Pos_Neg (one of {positive, negative} view) is.",
        "It has been mentioned that a andß are adjusting factor to the sentiment contribution of pair <word, epos>.",
        "a rectifies the effect of the 2-tuple according to its appearance on which side of CC , and ß rectifies the effect of the 2-tuple according to its distance from CC .",
        "They embody the effect of \"side\" and \"position\".",
        "Thus, it can be inferred that even the same <word, epos> will contribute differently because of its side and position.",
        "We propose a function E (equation (6)) to evaluate a free text by comparing the context of every appearing CC with the two sorts of sentiment context of the same CC trained from corpus respectively.",
        "N is the number of total Concerned Concepts in the free text, and i denotes certain CC.",
        "E is the semantic orientation of the whole text.",
        "Obviously, if E > 0, the text is to be regarded as positive, otherwise, negative.",
        "To clearly explain the function E, we just give the similarity between the context of CCi (Si ) in free text and the positive sentiment context of the same CCi trained from corpus.",
        "The function Sim is defined as follows:",
        "tt efißeft 1 (-m P (< d >lCC v ) 1 is the positive orientation of the left",
        "\\\\ aj ßj I expl 2 Pr(< word*, epos^>\\CCi, positive) I r",
        "context of CC,, and nghlßnSh, 1 ,nn .,.",
        "xj is the right one.",
        "\\\\\\a7h ß'r I expl 2 Pr(< wordf, eposf>l CC,, positive) I",
        "Equation (7) means that the sentiment contribution c of each <word, epos> calculated by (5) in the context of CC; within a sentence in free text, which is S; , construct the overall semantic orientation of the sentence together.",
        "On the other hand, s,m(s'i, sneg ) can be thought about in the same way.",
        "4 Parameter Estimation",
        "In terms of CC;, its sentiment classifying knowledge is depicted by (3) and (4), and the parameters wordval and eposval need to be leant from corpus.",
        "Every calculation of Pr(<word, epos>lCCi, Pos_Neg) is divided into two parts like (8) according to statistic theory:",
        "eposval :=Pr(eposj l CC,,Pos_Neg) and wordval :=Pr(wordj l CC,,Pos_Neg,epos*).",
        "The \"eposval' is the probability of epos appearing on both sides of the CC; and is estimated by Maximum Likelihood Estimation (MLE).",
        "Thus,",
        "The numerator in (9) is the co-occurring frequency between epos and CC; within sentence in training texts with Pos_Neg (certain one of {positive, negative}) view and the denominator is the frequency of co-occurrence between all EPOSes appearing in CCi s context with Pos_Neg view.",
        "The \"wordvaf'is the conditional probability of word, given CC, and epos which can also be estimated by MLE:",
        "The numerator in (10) is the frequency of co-occurrence between < word*, epos > and CCi , and the denominator is the frequency of co-occurrence between all possible words corresponding to ep0s appearing in CCi 's context with Pos_Neg view.",
        "For smoothing, we adopt add-one method in (9) and (10).",
        "4.2 Estimating a",
        "The a* is the adjusting factor representing the different effect of the < word*,epos* > to CCi in texts with Pos_Neg view according to the side it appears, which means different side has different contribution.",
        "So, it includes a*\" and a*igh' :",
        "# of < word*, epos* > appearing on the left side of CCi (ii)",
        "# of < word*, epos* > appearing on both sides of CCi dght # of < word*,epos* > appearing on the right side of CCi* # of < word*,epos* > appearing on both sides of CCi",
        "ß is positional adjusting factor, which means different position to some CC will be assigned different weight.",
        "This is based on the linguistic hypothesis that the further a word get away from a researched word, the looser their relation is.",
        "That is to say, ß ought to satisfy an inverse proportion relationship with position.",
        "Unlike wordval, eposval and a which are all private knowledge to some CC, ß is a dynamic positional factor which is independent of semantic orientation of training texts and it is only depend on the position from CC.",
        "To the example CCi, ß of < wordf epos^> occupying the fh position on its left side is ßff', which can be defined as:",
        "ß of < wordv,eposv >occupying the v'hposition on the right side of CCi is ß^\", which can be defined as:"
      ]
    },
    {
      "heading": "5. Test and Conclusions",
      "text": [
        "Our research topic is about \"Racism\" in Chinese texts.",
        "The training corpus is built up from Chinese web pages and emails.",
        "As mentioned above, all these extracted texts in corpus have obvious semantic orientations to racism: be favor of or oppose to.",
        "There are 1137 texts with positive view and 1085 texts with negative view.",
        "All the Chinese texts are segmented and tagged with defined EPOS in advance.",
        "They are also marked positive/negative for supervised learning.",
        "The two sorts of texts with different view are respectively divided into 10 folds.",
        "9 of them are trained and the left one is used for test.",
        "For the special domain, there is no relative result that can be consulted.",
        "So, we compare the new method with a traditional classification algorithm, i.e. the popular SVM that uses bi-grams as features.",
        "Our experiment includes two parts: a part experiments on the relatively \"long\" texts that contain more than 15 sentences and the other part experiments on the \"short\" texts that contain less than 15 sentences.",
        "We choose \"15\" as the threshold to distinguish long or short texts because it is the mathematic expectation of \"length\" variable of text in our testing corpus.",
        "The recall, precision and F1-score are listed in the following Experiment Result Table.",
        "Table.",
        "Experiment Result",
        "The experiment shows that our method is useful for sentiment classification especially for short texts.",
        "Seen from the table, when evaluating texts that have more than 15 sentences, for enough features, SVM has better result, while ours is averagely close to it.",
        "However, when evaluating the texts containing less than 15 sentences, our method is obviously superior to SVM in either positive or negative view.",
        "That means our method has more potential value to sentiment classification of short texts, such as emails, short news, etc.",
        "The better result owes to the fine description within sentences and introducing linguistic knowledge to sentiment classification (such as EPOS, a and ß), which proved the two hypothesizes may be reasonable.",
        "We use modified triggered bi-grams to describe the importance among features ({<word, epos>}) and Concerned Concepts, then construct sentiment classifying knowledge rather than depend on statistic algorithm only.",
        "To sum up, we draw the following conclusions from our work:",
        "♦ Introducing more linguistic knowledge is helpful for improving statistic sentiment classification.",
        "Texts with Positive View (more than 15 sentences)",
        "Texts with Negative View (more than 15 sentences)",
        "SVM",
        "Our Method",
        "SVM",
        "Our Method",
        "Recall(%)",
        "80.6",
        "73.2",
        "68.4",
        "76.1",
        "Precision(%)",
        "74.1",
        "75.3",
        "75.6",
        "73.8",
        "F1-score(%)",
        "77.2",
        "74.2",
        "71.82",
        "74.9",
        "Texts with Positive View (less than 15 sentences)",
        "Texts with Negative View (less than 15 sentences)",
        "SVM",
        "Our Method",
        "SVM",
        "Our Method",
        "Recall(%)",
        "62.1",
        "63.0",
        "62.1",
        "69.5",
        "Precision(%)",
        "65.1",
        "70.1",
        "59.0",
        "62.3",
        "F1-score(%)",
        "63.6",
        "66.4",
        "60.5",
        "65.7",
        "♦ Sentiment classification is a hard task, and it needs subtly describing capability of language model.",
        "Maybe the intensional logic of words will be helpful in this field in future.",
        "♦ Chinese is a language of concept combination and the usage of words is more flexible than Indo-European language, which makes it more difficult to acquire statistic information than English [10].",
        "♦ We assume an independent condition among sentences yet.",
        "We should introduce a suitable mathematic model to group the close sentences.",
        "Our experiment also shows that the algorithm will become weak when no CC appears in sentences, but this method is still deserved to explore further.",
        "In future, we will integrate more linguistic knowledge and expand our method to a suitable sentence group to improve its performance.",
        "Constructing a larger sentiment area may balance the capability of our method between long and short text sentiment classification.",
        "Acknowledgement.",
        "This work is supported by NSFC Major Research Program 60496326: Basic Theory and Core Techniques of Non Canonical Knowledge and also supported by National 863 Project (No.",
        "2001AA114210-11)."
      ]
    }
  ]
}
