{
  "info": {
    "authors": [
      "Donghui Feng",
      "Eduard Hovy"
    ],
    "book": "Human Language Technology Conference and Empirical Methods in Natural Language Processing",
    "id": "acl-H05-1075",
    "title": "Handling Biographical Questions With Implicature",
    "url": "https://aclweb.org/anthology/H05-1075",
    "year": 2005
  },
  "references": [
    "acl-C02-1042",
    "acl-N03-1004",
    "acl-N03-1022",
    "acl-N04-1008",
    "acl-P00-1071",
    "acl-P01-1059",
    "acl-P02-1006",
    "acl-P02-1038",
    "acl-P03-1001",
    "acl-P03-1003",
    "acl-P04-1072",
    "acl-P04-1073",
    "acl-P05-1060",
    "acl-W04-3215",
    "acl-W04-3251",
    "acl-W04-3256"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Traditional question answering systems adopt the following framework: parsing questions, searching for relevant documents, and identifying/generating answers.",
        "However, this framework does not work well for questions with hidden assumptions and implicatures.",
        "In this paper, we describe a novel idea, a cascading guidance strategy, which can not only identify potential traps in questions but further guide the answer extraction procedure by recognizing whether there are multiple answers for a question.",
        "This is the first attempt to solve implicature problem for complex QA in a cascading fashion using N-gram language models as features.",
        "We here investigate questions with implicatures related to biography facts in a web-based QA system, Power-Bio.",
        "We compare the performances of Decision Tree, Naïve Bayes, SVM (Support Vector Machine), and ME (Maximum Entropy) classification methods.",
        "The integration of the cascading guidance strategy can help extract answers for questions with implicatures and produce satisfactory results in our experiments."
      ]
    },
    {
      "heading": "1 Motivation",
      "text": [
        "Question Answering has emerged as a key area in natural language processing (NLP) to apply question parsing, information extraction, summarization, and language generation techniques (Clark et al., 2004; Fleischman et al., 2003; Echihabi et al., 2003; Yang et al., 2003; Hermjakob et al., 2002; Dumais et al., 2002).",
        "Traditional question answering systems adopt the framework of parsing questions, searching for relevant documents, and then pinpointing and generating answers.",
        "However, this framework includes potential dangers.",
        "For example, to answer the question “when did Beethoven get married?”, a typical QA system would identify the question target to be a “Date” and would apply techniques to identify the date Beethoven got married.",
        "Since Beethoven never married, this direct approach is likely to deliver wrong answers.",
        "The trick in the question is the implicature that Beethoven got married.",
        "In the main task of QA track of TREC 2003, the performances of most systems on providing “NIL” when no answer is possible range from only 10% to 30% (Voorhees, 2003).",
        "Just as some questions have no answer, others may have multiple answers.",
        "For instance, with “who was Ronald Reagan’s wife?”, a QA system may give only “Nancy Davis” as the answer.",
        "However, there is another correct answer: Jane Wyman.",
        "The problem here is the implicature in the question that Reagan only got married once.",
        "An implicature is anything that is inferred from an utterance but that is not a condition for the truth of the utterance (Gazdar, 1979; Levinson, 1983).",
        "Implicatures in questions either waste computational effort or impair the performance of a QA system or both.",
        "Therefore, when answering questions, it is prudent to identify the questions with implicatures before processing starts.",
        "In this paper, we describe a novel idea to solve the problem: a strategy of cascading guidance.",
        "This is the first attempt to solve implicature problem for complex QA in a cascading fashion using N-gram",
        "language models as features.",
        "The cascading guidance part is designed to be inserted immediately before the search procedure to handle questions with implicatures.",
        "It can not only first identify the potential “no answer” traps but also identify whether multiple answers for this question are likely.",
        "To investigate the performance of the cascading guidance strategy, we here study two types of questions related to biography facts in a web-based biography QA system, PowerBio.",
        "This web-based QA system extracts biographical facts from the web obtained by querying a web search engine (Google in our case).",
        "Figure 1 provides the two types of questions we selected, which we refer to as SPOUSE_QUESTION and CHIL-D_QUESTION.",
        "Both types of questions have implicatures to justify the use of the cascading guidance strategy.",
        "Intuitively, to answer these questions, we have two issues related to implicatures to clarify:",
        "• Does the person have a spouse/child?",
        "• What's the number of answers for this question?",
        "(One or many?)",
        "We therefore create two successive classification engines in the cascading classifier.",
        "For learning, our approach queries the search engine with every person listed in the training set, extracts related features from the documents, and trains the cascading classifiers.",
        "For application, when a new question is given, the cascading classifier is applied before activation of the search subsystem.",
        "We compare the performances of four popular classification approaches in the cascading classifier, namely Decision Tree, Naïve Bayes, SVM (Support Vector Machine), and ME (Maximum Entropy) classifications.",
        "The paper is structured as follows: related work is discussed in Section 2.",
        "We introduce our cascading guidance technique in Section 3, including Decision Tree, Naïve Bayes and SVM (Support Vector Machine) and ME (Maximum Entropy) classifications.",
        "The experimental results are presented in Section 4.",
        "We discuss related issues and future work in Section 5."
      ]
    },
    {
      "heading": "2 Related Work",
      "text": [
        "Question Answering has attracted much attention from the areas of Natural Language Processing, Information Retrieval and Data Mining (Fleischman et al., 2003; Echihabi et al., 2003; Yang et al., 2003; Hermjakob et al., 2002; Dumais et al., 2002; Hermjakob et al., 2000).",
        "It is tested in several venues, including the TREC and CLEF Question Answering tracks (Voorhees, 2003; Magnini et al., 2003).",
        "Most research efforts in the Question Answering community have focused on factoid questions and successful Question Answering systems tend to have similar underlying pipelines structures (Prager et al., 2004; Xu et al., 2003; Hovy et al., 2000; Moldovan et al., 2000).",
        "Recently more techniques for answer extraction, answer selection, and answer validation have been proposed (Lita et al., 2004; Soricut and Brill, 2004; Clark et al., 2004).",
        "Prager et al.",
        "(2004) proposed applying constraint satisfaction obtained by asking auxiliary questions to improve system performance.",
        "This approach requires the creation of auxiliary questions, which may be complex to automate.",
        "Ravichandran and Hovy (2002) proposed automatically learning surface text patterns for answer extraction.",
        "However, this approach will not work if no explicit answers exist in the source.",
        "The first reason is that in that situation the anchors to learn the patterns cannot be determined.",
        "Secondly, most of the facts without explicit values are not expressed with long patterns including anchors.",
        "For example, the phrase “the childless marriage” gives enough information that a person has no child.",
        "But it is almost impossible to learn such surface text patterns following (Ravichandran and Hovy, 2002).",
        "Reported work on question processing focuses mainly on the problems of parsing questions, determining the question target for search subsystem",
        "(Paşca and Harabagiu, 2001; Hermjakob et al., 2000).",
        "Saquete et al.",
        "(2004) decompose complex temporal questions into simpler ones based on the temporal relationships in the question.",
        "To date, there has been little published work on handling implicatures in questions.",
        "Just-In-Time Information Seeking Agents (JITISA) was proposed by Harabagiu (2001) to process questions in dialogue and implicatures.",
        "The agents are created based on pragmatic knowledge.",
        "Traditional answer extraction and answer fusion approaches assume the question is always correct and explicit answers do exist in the corpus.",
        "Reported work attempts to rank the candidate answer list to boost the correct one into top position.",
        "This is not enough when there may not be an answer for the question posed.",
        "For biographical fact extraction and generation, Zhou et al.",
        "(2004) and Schiffman et al.",
        "(2001) use summarization techniques to generate human biographies.",
        "Mann and Yarowsky (2005) propose fusing the extracted information across documents to return a consensus answer.",
        "In their approach, they did not consider multiple values or no values for biography facts, although multiple facts are common for some biography attributes, such as multiple occupations, children, books, places of residence, etc.",
        "In these cases a consensus answer is not adequate.",
        "Our work differs from theirs because we are not only working on information/answer extraction; the focus in this paper is the guidance for answer extraction of questions (or IE task for values) with implicatures.",
        "This work can be of great help for immediate biographical information extraction.",
        "We describe details of the cascading guidance technique and investigate how it will help for question answering in Section 3."
      ]
    },
    {
      "heading": "3 Cascading Guidance Technique",
      "text": [
        "We turn to the Web by querying a web search engine (Google in our case) to find evidence to create guidance for answer extraction."
      ]
    },
    {
      "heading": "3.1 Classification Procedure",
      "text": [
        "The cascading classifier is applied after the name of the person and the answer types are identified.",
        "Figure 2 gives the pipeline of the classification procedure.",
        "With the identified person name, we query the search engine (Google) to obtain the top N web pages/documents.",
        "A simple data cleaning program only keeps the content texts in the web page, which is broken up into separate sentences.",
        "Following that, topic sentences are identified with the keyword topic identification technique.",
        "For each topic we provide a list of possible related keywords and any sentences containing both the person’s name (or reference) and at least one of the keywords will be selected.",
        "The required features are extracted from the topic sentences and passed to the cascading classifier as supporting evidence to generate guidance for answer extraction."
      ]
    },
    {
      "heading": "Classification Results",
      "text": []
    },
    {
      "heading": "3.2 Feature Extraction",
      "text": [
        "Intuitively, sentences elaborating a biographical fact in a given topic should have similar styles (short patterns) of organizing words and phrases.",
        "Here, topic means an aspect of biographical facts, e.g., marriage, children, birthplace, and so on.",
        "Inspired by this, we consider taking N-grams in sentences as our features.",
        "However, N-gram features not closely related to the topic will bring more noise into the system.",
        "Therefore, we only take the N-grams within a fixed-length window around the topic keywords for features calculation, and pass them as evidence to cascading classifier.",
        "For N-grams, instead of using the multiplication of conditional probabilities of each word in the N-gram, we only consider the last conditional probability (see below).",
        "The reason is that the last conditional probability is a strong sign of the pattern’s importance and how this sequence of words is organized.",
        "Simply multiplying all the conditional probabilities will decrease the value and require normalization.",
        "Realizing that in a set of documents the frequency of each N-gram is very important information, we combine the last conditional probability with the frequency.",
        "The computation for each feature of unigram, bigram and trigram are defined as the following formulas:",
        "We here investigate four kinds of classifiers, namely Decision Tree, Naïve Bayes, Support Vector Machine (SVM), and Maximum Entropy (ME)."
      ]
    },
    {
      "heading": "3.3 Classification Approaches",
      "text": [
        "The cascading classifier is composed of two successive parts.",
        "Given the set of extracted features, the classification result could lead to different responses to the question, either answering with “no value” with strong confidence or directing the answer extraction model how many answers should be sought.",
        "For text classification, there are several well-studied classifiers in the machine learning and natural language processing communities."
      ]
    },
    {
      "heading": "Decision Tree Classification",
      "text": [
        "The Decision Tree classifier is simple and matches human intuitions perfectly while it has been proved efficient in many application systems.",
        "The basic idea is to break up the classification decision into a union of a set of simpler decisions based on N-gram features.",
        "Due to the large feature set, we use C5.0, the decision tree software package developed by RuleQuest Research (Quinlan, 1993), instead of C4.5."
      ]
    },
    {
      "heading": "Naïve Bayes Classification",
      "text": [
        "The Naïve Bayes classifier utilizes Bayes' rule as follows.",
        "Supposing we have the feature set F ={f1, f2,..., fn }, the probability that person p belongs to a class c is given as:",
        "This was used for both successive classifiers of the cascading engine."
      ]
    },
    {
      "heading": "SVM Classification",
      "text": [
        "SVM (Support Vector Machines) has attracted much attention since it was introduced in (Boser et al., 1992).",
        "As a special and effective approach for kernel based methods, SVM creates non-linear classifiers by applying the kernel trick to maximum-margin hyperplanes.",
        "Suppose pi, i = 1,..., n represent the training set of persons, and the classes for classifications are C = {c1 , c2 } (for simplicity, we represent the classes with C = {−1,1} ).",
        "Then the classification task requires the solution of the following optimization problem (Hsu et al., 2003):",
        "We use the SVM classification package LIB SVM (Chang and Lin, 2001) in our problem."
      ]
    },
    {
      "heading": "ME Classification",
      "text": [
        "ME (Maximum Entropy) classification is used here to directly estimate the posterior probability for classification.",
        "Suppose p represents the person and the classes for classifications are C = {c1, c2 }, we have M feature functions hm (c, p), m =1,..., M .",
        "For each feature function, we have a model parameter λm, m =1,..., M .",
        "The classification with",
        "maximum likelihood estimation can be defined as follows (Och and Ney, 2002):",
        "The decision rule to choose the most probable class is (Och and Ney, 2002):",
        "We use the published package YASMET 1 to conduct parameters training and classification.",
        "YASMET requires supervised learning for the training of maximum entropy model.",
        "The four classification approaches are assembled in a cascading fashion.",
        "We discuss their performance next."
      ]
    },
    {
      "heading": "4 Experiments and Results",
      "text": []
    },
    {
      "heading": "4.1 Experimental Setup",
      "text": [
        "We download from infoplease.com2 and biogra-phy.com 3 two corpora of people’s biographies, which include 24,975 and 24,345 bios respectively.",
        "We scan each whole corpus and extract people having spouse information.",
        "To create the data set, we manually check and categorize each person as having multiple spouses, only one spouse, or no spouse.",
        "Similarly, we obtained another list of persons having multiple children, only one child, and no child.",
        "The sizes of data extracted are given in",
        "For the cascading classification, in the first step, when classifying whether a person has a spouse/child or not, we merge the last two subsets",
        "with one value and multiple values into one.",
        "Table 2 presents the data used for each level of classification.",
        "To investigate the performances of our cascading classifiers, we divided the two sets into training set and testing set, with half of them in the training set and half in the testing set."
      ]
    },
    {
      "heading": "4.2 Empirical Results",
      "text": [
        "For each situation of the two questions, when the answer type has been determined to be the child or spouse of a person, we send the person’s name to Google and collect the top N documents.",
        "As described in Figure 2, topic sentences in each document are selected by keyword matching.",
        "A window with the length of w is applied to the sentence.",
        "All word sequences in the window are selected for feature calculation.",
        "We take all the three N-gram language models (unigram, bigram, and trigram) in the window for feature computation.",
        "Table 3 gives the sizes of the bigram feature sets for first-level classification as we take more and more documents into the system.",
        "As described in Section 3, the feature values are applied in the classifiers.",
        "Tables 4 and 5 give the best performances of the 4 classifiers in the two situations when we select the top N articles using N-gram probability for feature computation.",
        "Due to the large size of the feature set, C5.0, SVM, and ME packages will not work at some",
        "point as more documents are encountered.",
        "The Naïve Bayes classification is more scalable as we use intermediate file to store probability tables.",
        "The feature set has a large number of features.",
        "However, not all of them will be used for each person.",
        "We studied the number of times features are identified/used in the training and testing sets and their probabilities.",
        "Table 6 presents a list of some trigram features for second-level classification (one or multiple values) for Spouse.",
        "Obviously, indicating features have a large probability as expected.",
        "The second column gives the number of times the feature is used out of the training and testing set (75 persons in total).",
        "Will more complex N-gram features work better?",
        "Intuitively, being less ambiguous, more complex N-gram features carry more precise information and therefore should work better than simple ones.",
        "We studied the performances for different N-gram language model features.",
        "Below are the results of Naïve Bayes first-level classification for Child, using different N-gram features.",
        "From Table 7, we can infer that bigram features work better than unigram features, and trigram features work better than bigrams when we select different numbers of top N documents.",
        "Trigram features actually bring enough evidence in classification.",
        "However, when we investigated 4-grams language features in the collected data, most of them are very sparse in the feature space of all the cases.",
        "Applying 4-grams or higher may not help in our task.",
        "Will more data/documents help?",
        "The performance of corpus-based statistical approaches usually depends on the size of corpus.",
        "A traditional view for most NLP problems is that more data will help to improve the system’s performance.",
        "However, for data collected from a search engine, this may not be the case, since web data is usually ambiguous and noisy.",
        "We therefore investigate the data size’s effect on system performance.",
        "Figure 3 gives the precision curves of the Naïve Bayes classifier for the first-level classification for Child.",
        "Except for the case of top 1, where the top document alone may not contain too much useful information on selected topics, precision scores only have slight variations for increasing numbers of documents.",
        "For bigram features, over the top 50 and his wife her husband , and her husband was married to with his wife her second husband her marriage to ex - wife ex - husband her first husband second husband , his first wife first husband , second wife , his first marriage s second wife",
        "through top 70 documents, the precision scores even get a little worse."
      ]
    },
    {
      "heading": "4.3 Examples",
      "text": [
        "Equipped with the cascading guiding strategy, we are able to handle questions containing implicatures.",
        "In our system, when we can determine the answer type is child or spouse, the cascading guiding system will help the answer extraction part to extract answers from the designated corpus.",
        "Figure 4 gives two examples of the strategy.",
        "For the first question, the classifier recognizes there is no spouse for the target person and returns information for the answer generation.",
        "The features used here are the first-level classification result for SPOUSE_QUESTION.",
        "For the second question, the classifier recognizes the target person has a child first, followed by recognizing that the answer has multiple values.",
        "In this way, the strategy integrated to the question answering system can improve the system’s performance by handling questions with implicatures."
      ]
    },
    {
      "heading": "5 Discussion and Future Work",
      "text": [
        "Questions may have implicatures due to the flexibility of human language and conversation.",
        "In real question-answering systems, failure to handle them may either waste huge computation cost or impair system’s performance.",
        "The traditional QA framework does not work well for questions containing implicatures.",
        "We describe a novel idea in this paper to identify potential traps in biographical questions and recognize whether there are multiple answers for a question.",
        "Question-Answering systems, even when focused upon biographies, have to handle many facts, such as birth date, birth place, parents, training, accomplishments, etc.",
        "These values can be extracted using typical text harvesting approaches.",
        "However, when there are no values for some biographical information, the task becomes much more difficult because text seldom explicitly states a negative.",
        "For example, the following two questions require schools attended:",
        "• Where did <person> graduate from?",
        "• What university did <person> attend?",
        "Our program scanned the two corpora of bios and found only 2 out 49320 bios explicitly stating that the subject never attended any school.",
        "Therefore, for some types of information, it will be much harder to identify null values through evidence from text.",
        "Some more complicated reasoning and inference may be required.",
        "Classifiers for some biographical facts may need to incorporate extra knowledge from other resources.",
        "The inherent relations between biography facts can also be used to validate each other.",
        "For example, the relations of marriage and child, birth place and childhood home, etc.",
        "may provide clues for cross-validation.",
        "We plan to investigate these problems in the future."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We wish to thank the anonymous reviewers for their helpful feedback and corrections.",
        "Also we thank Lei Ding, Feng Pan, and Deepak Ravichandran for their valuable comments on this work."
      ]
    }
  ]
}
