{
  "info": {
    "authors": [
      "Ryu Iida",
      "Kentaro Inui",
      "Yuji Matsumoto"
    ],
    "book": "International Conference on Computational Linguistics and Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P06-1079",
    "title": "Exploiting Syntactic Patterns as Clues in Zero-Anaphora Resolution",
    "url": "https://aclweb.org/anthology/P06-1079",
    "year": 2006
  },
  "references": [
    "acl-C02-1078",
    "acl-C96-2137",
    "acl-C96-2147",
    "acl-J01-4004",
    "acl-J02-3001",
    "acl-J94-4002",
    "acl-J95-2003",
    "acl-P02-1014",
    "acl-P03-1005",
    "acl-P03-1022",
    "acl-P03-1023",
    "acl-P04-1020",
    "acl-P86-1031",
    "acl-W04-0707",
    "acl-W04-3239",
    "acl-W05-0620",
    "acl-W97-1303"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We approach the zero-anaphora resolution problem by decomposing it into intra-sentential and inter-sentential zero-anaphora resolution.",
        "For the former problem, syntactic patterns of the appearance of zero-pronouns and their antecedents are useful clues.",
        "Taking Japanese as a target language, we empirically demonstrate that incorporating rich syntactic pattern features in a state-of-the-art learning-based anaphora resolution model dramatically improves the accuracy of intra-sentential zero-anaphora, which consequently improves the overall performance of zero-anaphora resolution."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Zero-anaphora is a gap in a sentence that has an anaphoric function similar to a pro-form (e.g. pronoun) and is often described as “referring back” to an expression that supplies the information necessary for interpreting the sentence.",
        "For example, in the sentence “There are two roads to eternity, a straight and narrow, and a broad and crooked,” the gaps in “a straight and narrow (gap)” and “a broad and crooked (gap)” have a zero-anaphoric relationship to “two roads to eternity.” The task of identifying zero-anaphoric relations in a given discourse, zero-anaphora resolution, is essential in a wide range of NLP applications.",
        "This is the case particularly in such a language as Japanese, where even obligatory arguments of a predicate are often omitted when they are inferable from the context.",
        "In fact, in our Japanese newspaper corpus, for example, 45.5% of the nominative arguments of verbs are omitted.",
        "Since such gaps can not be interpreted only by shallow syntactic parsing, a model specialized for zero-anaphora resolution needs to be devised on the top of shallow syntactic and semantic processing.",
        "Recent work on zero-anaphora resolution can be located in two different research contexts.",
        "First, zero-anaphora resolution is studied in the context of anaphora resolution (AR), in which zero-anaphora is regarded as a subclass of anaphora.",
        "In AR, the research trend has been shifting from rule-based approaches (Baldwin, 1995; Lappin and Le-ass, 1994; Mitkov, 1997, etc.)",
        "to empirical, or corpus-based, approaches (McCarthy and Lehnert, 1995; Ng and Cardie, 2002a; Soon et al., 2001; Strube and M¨uller, 2003; Yang et al., 2003) because the latter are shown to be a cost-efficient solution achieving a performance that is comparable to best performing rule-based systems (see the Coreference task in MUC1 and the Entity Detection and Tracking task in the ACE program2).",
        "The same trend is observed also in Japanese zero-anaphora resolution, where the findings made in rule-based or theory-oriented work (Kameyama, 1986; Nakaiwa and Shirai, 1996; Okumura and Tamura, 1996, etc.)",
        "have been successfully incorporated in machine learning-based frameworks (Seki et al., 2002; Iida et al., 2003).",
        "Second, the task of zero-anaphora resolution has some overlap with Propbank3-style semantic role labeling (SRL), which has been intensively studied, for example, in the context of the CoNLL SRL task4.",
        "In this task, given a sentence “To attract younger listeners, Radio Free Europe intersperses the latest in Western rock groups”, an SRL",
        "model is asked to identify the NP Radio Free Europe as the A0 (Agent) argument of the verb attract.",
        "This can be seen as the task of finding the zero-anaphoric relationship between a nominal gap (the A0 argument of attract) and its antecedent (Radio Free Europe) under the condition that the gap and its antecedent appear in the same sentence.",
        "In spite of this overlap between AR and SRL, there are some important findings that are yet to be exchanged between them, partly because the two fields have been evolving somewhat independently.",
        "The AR community has recently made two important findings:",
        "• A model that identifies the antecedent of an anaphor by a series of comparisons between candidate antecedents has a remarkable advantage over a model that estimates the absolute likelihood of each candidate independently of other candidates (Iida et al., 2003; Yang et al., 2003).",
        "• An AR model that carries out antecedent identification before anaphoricity determination, the decision whether a given NP is anaphoric or not (i.e. discourse-new), significantly outperforms a model that executes those subtasks in the reverse order or simultaneously (Poesio et al., 2004; Iida et al., 2005).",
        "To our best knowledge, however, existing SRL models do not exploit these advantages.",
        "In SRL, on the other hand, it is common to use syntactic features derived from the parse tree of a given input sentence for argument identification.",
        "A typical syntactic feature is the path on a parse tree from a target predicate to a noun phrase in question (Gildea and Jurafsky, 2002; Carreras and Marquez, 2005).",
        "However, existing AR models deal with intra and inter-sentential anaphoric relations in a uniform manner; that is, they do not use as rich syntactic features as state-of-the-art SRL models do, even in finding intra-sentential anaphoric relations.",
        "We believe that the AR and SRL communities can learn more from each other.",
        "Given this background, in this paper, we show that combining the aforementioned techniques derived from each research trend makes significant impact on zero-anaphora resolution, taking Japanese as a target language.",
        "More specifically, we demonstrate the following:",
        "• Incorporating rich syntactic features in a state-of-the-art AR model dramatically improves the accuracy of intra-sentential zero-anaphora resolution, which consequently improves the overall performance of zero-anaphora resolution.",
        "This is to be considered as a contribution to AR research.",
        "• Analogously to inter-sentential anaphora, de",
        "composing the antecedent identification task into a series of comparisons between candidate antecedents works remarkably well also in intra-sentential zero-anaphora resolution.",
        "We hope this finding to be adopted in SRL.",
        "The rest of the paper is organized as follows.",
        "Section 2 describes the task definition of zero-anaphora resolution in Japanese.",
        "In Section 3, we review previous approaches to AR.",
        "Section 4 described how the proposed model incorporates effectively syntactic features into the machine learning-based approach.",
        "We then report the results of our experiments on Japanese zero-anaphora resolution in Section 5 and conclude in Section 6."
      ]
    },
    {
      "heading": "2 Zero-anaphora resolution",
      "text": [
        "In this paper, we consider only zero-pronouns that function as an obligatory argument of a predicate for two reasons:",
        "• Providing a clear definition of zero-pronouns appearing in adjunctive argument positions involves awkward problems, which we believe should be postponed until obligatory zero-anaphora is well studied.",
        "• Resolving obligatory zero-anaphora tends to be more important than adjunctive zero-pronouns in actual applications.",
        "A zero-pronoun may have its antecedent in the discourse; in this case, we say the zero-pronoun is anaphoric.",
        "On the other hand, a zero-pronoun whose referent does not explicitly appear in the discourse is called a non-anaphoric zero-pronoun.",
        "A zero-pronoun may be non-anaphoric typically when it refers to an extralinguistic entity (e.g. the first or second person) or its referent is unspecified in the context.",
        "The following are Japanese examples.",
        "In sentence (1), zero-pronoun Oi is anaphoric as its antecedent, ‘shusho (prime minister)’, appears in the same sentence.",
        "In sentence (2), on the other hand, Oj is considered non-anaphoric if its referent (i.e. the first person) does not appear in the discourse.",
        "The prime minister visited the united states and unveiled the plan to push diplomacy between the two countries.",
        "(2) (Oj-ga) ie-ni kaeri-tai .",
        "(Oj-NOM) home-DAT want to go back PUNC (I) want to go home.",
        "Given this distinction, we consider the task of zero-anaphora resolution as the combination of two sub-problems, antecedent identification and anaphoricity determination, which is analogous to NP-anaphora resolution: For each zero-pronoun in a given discourse, find its antecedent if it is anaphoric; otherwise, conclude it to be non-anaphoric."
      ]
    },
    {
      "heading": "3 Previous work",
      "text": []
    },
    {
      "heading": "3.1 Antecedent identification",
      "text": [
        "Previous machine learning-based approaches to antecedent identification can be classified as either the candidate-wise classification approach or the preference-based approach.",
        "In the former approach (Soon et al., 2001; Ng and Cardie, 2002a, etc.",
        "), given a target anaphor, TA, the model estimates the absolute likelihood of each of the candidate antecedents (i.e. the NPs preceding TA), and selects the best-scored candidate.",
        "If all the candidates are classified negative, TA is judged non-anaphoric.",
        "In contrast, the preference-based approach (Yang et al., 2003; Iida et al., 2003) decomposes the task into comparisons of the preference between candidates and selects the most preferred one as the antecedent.",
        "For example, Iida et al.",
        "(2003) proposes a method called the tournament model.",
        "This model conducts a tournament consisting of a series of matches in which candidate antecedents compete with each other for a given anaphor.",
        "While the candidate-wise classification model computes the score of each single candidate independently of others, the tournament model learns the relative preference between candidates, which is empirically proved to be a significant advantage over candidate-wise classification (Iida et al., 2003)."
      ]
    },
    {
      "heading": "3.2 Anaphoricity determination",
      "text": [
        "There are two alternative ways for anaphoricity determination: the single-step model and the two-step model.",
        "The single-step model (Soon et al., 2001; Ng and Cardie, 2002a) determines the anaphoricity of a given anaphor indirectly as a by-product of the search for its antecedent.",
        "If an appropriate candidate antecedent is found, the anaphor is classified as anaphoric; otherwise, it is classified as non-anaphoric.",
        "One disadvantage of this model is that it cannot employ the preference-based model because the preference-based model is not capable of identifying non-anaphoric cases.",
        "The two-step model (Ng, 2004; Poesio et al., 2004; Iida et al., 2005), on the other hand, carries out anaphoricity determination in a separate step from antecedent identification.",
        "Poesio et al.",
        "(2004) and Iida et al.",
        "(2005) claim that the latter subtask should be done before the former.",
        "For example, given a target anaphor (TA), Iida et al.’s selection-then-classification model:",
        "1. selects the most likely candidate antecedent (CA) of TA using the tournament model, 2. classifies TA paired with CA as either anaphoric or non-anaphoric using an anaphoricity determination model.",
        "If the CA-TA pair is classified as anaphoric, CA is identified as the antecedent of TA; otherwise, TA is conclude to be non-anaphoric.",
        "The anaphoricity determination model learns the non-anaphoric class directly from non-anaphoric training instances whereas the single-step model cannot not use non-anaphoric cases in training."
      ]
    },
    {
      "heading": "4 Proposal",
      "text": []
    },
    {
      "heading": "4.1 Task decomposition",
      "text": [
        "We approach the zero-anaphora resolution problem by decomposing it into two subtasks: intra-sentential and inter-sentential zero-anaphora resolution.",
        "For the former problem, syntactic patterns in which zero-pronouns and their antecedents appear may well be useful clues, which, however, does not apply to the latter problem.",
        "We therefore build a separate component for each subtask, adopting Iida et al.",
        "(2005)’s selection-then-classification model for each component: 1.Intra-sentential antecedent identification: For a given zero-pronoun ZP in a given sentence S, select the most-likely candidate antecedent C1 from the candidates appearing in S by the intra-sentential tournament model",
        "2.",
        "Intra-sentential anaphoricity determination: Estimate plausibility pi that Ci is the true antecedent, and return Ci if pi > Gintea (Bintra is a preselected threshold) or go to 3 otherwise 3.",
        "Inter-sentential antecedent identification: Select the most-likely candidate antecedent C2 from the candidates appearing outside of S by the inter-sentential tournament model.",
        "4.",
        "Inter-sentential anaphoricity determination: Estimate plausibility p2 that C2 is the true antecedent, and return C2 if p2 > Ginter (Ginter is a preselected threshold) or return non-anaphoric otherwise."
      ]
    },
    {
      "heading": "4.2 Representation of syntactic patterns",
      "text": [
        "In the first two of the above four steps, we use syntactic pattern features.",
        "Analogously to SRL, we extract the parse path between a zero-pronoun to its antecedent to capture the syntactic pattern of their occurrence.",
        "Among many alternative ways of representing a path, in the experiments reported in the next section, we adopted a method as we describe below, leaving the exploration of other alternatives as future work.",
        "Given a sentence, we first use a standard dependency parser to obtain the dependency parse tree, in which words are structured according to the dependency relation between them.",
        "Figure 1(a), for example, shows the dependency tree of sentence (1) given in Section 2.",
        "We then extract the path between a zero-pronoun and its antecedent as in Figure 1(b).",
        "Finally, to encode the order of siblings and reduce data sparseness, we further transform the extracted path as in Figure 1(c):",
        "• A path is represented by a subtree consisting of backbone nodes: 0 (zero-pronoun), Ant (antecedent), Node (the lowest common ancestor), LeftNode (left-branch node) and RightNode.",
        "• Each backbone node has daughter nodes, each corresponding to a function word associated with it.",
        "• Content words are deleted.",
        "This way of encoding syntactic patterns is used in intra-sentential anaphoricity determination.",
        "In antecedent identification, on the other hand, the tournament model allows us to incorporate three paths, a path for each pair of a zero-pronoun and left and right candidate antecedents, as shown in"
      ]
    },
    {
      "heading": "4.3 Learning algorithm",
      "text": [
        "As noted in Section 1, the use of zero-pronouns in Japanese is relatively less constrained by syntax compared, for example, with English.",
        "This forces the above way of encoding path information to produce an explosive number of different paths, which inevitably leads to serious data sparseness.",
        "This issue can be addressed in several ways.",
        "The SRL community has devised a range of variants of the standard path representation to reduce the complexity (Carreras and Marquez, 2005).",
        "Applying Kernel methods such as Tree kernels (Collins and Duffy, 2001) and Hierarchical DAG kernels (Suzuki et al., 2003) is another strong option.",
        "The Boosting-based algorithm pro",
        "Leaving the question of selecting learning algorithms open, in our experiments, we have so far examined Kudo and Matsumoto (2004)’s algorithm, which is implemented as the BACT system6.",
        "Given a set of training instances, each of which is represented as a tree labeled either positive or negative, the BACT system learns a list of weighted decision stumps with a Boosting algorithm.",
        "Each decision stump is associated with tuple (t, 1, w), where t is a subtree appearing in the training set, l a label, and w a weight, indicating that if a given input includes t, it gives w votes to 1.",
        "The strength of this algorithm is that it deals with structured feature and allows us to analyze the utility of features.",
        "In antecedent identification, we train the tournament model by providing a set of labeled trees as a training set, where a label is either left or right.",
        "Each labeled tree has (i) path trees TL, TR and TI (as given in Figure 2) and (ii) a set nodes corresponding to the binary features summarized in Table 3, each of which is linked to the root node as illustrated in Figure 4.",
        "This way of organizing a labeled tree allows the model to learn, for example, the combination of a subtree of TL and some of the binary features.",
        "Analogously, for anaphoricity determination, we use trees (TC, fl, ... , fn), where TC denotes a path subtree as in Figure 1(c)."
      ]
    },
    {
      "heading": "5 Experiments",
      "text": [
        "We conducted an evaluation of our method using Japanese newspaper articles.",
        "The following four models were compared:",
        "1.",
        "BM: Ng and Cardie (2002a)’s model, which identify antecedents by the candidate-wise classification model, and determine anaphoricity using the one-step model.",
        "2.",
        "BMSTR: BM with the syntactic features such as those in Figure 1(c).",
        "3.",
        "SCM: The selection-then-classification model explained in Section 3.",
        "4.",
        "SCMSTR: SCM with all types of syntactic features shown in Figure 2."
      ]
    },
    {
      "heading": "5.1 Setting",
      "text": [
        "We created an anaphoric relation-tagged corpus consisting of 197 newspaper articles (1,803 sentences), 137 articles annotated by two annotators and 60 by one.",
        "The agreement ratio between two annotators on the 197 articles was 84.6%, which indicated that the annotation was sufficiently reliable.",
        "In the experiments, we removed from the above data set the zero-pronouns to which the two annotators did not agree.",
        "Consequently, the data set contained 995 intra-sentential anaphoric zero-pronouns, 754 inter-sentential anaphoric zero-pronouns, and 603 non-anaphoric zero-pronouns (2,352 zero-pronouns in total), with each anaphoric zero-pronoun annotated to be linked to its antecedent.",
        "For each of the following experiments, we conducted fivefold cross-validation over 2,352 zero-pronouns so that the set of the zero-pronouns from a single text was not divided into the training and test sets.",
        "In the experiments, all the features were automatically acquired with the help of the following NLP tools: the Japanese morphological analyzer ChaSen7 and the Japanese dependency structure analyzer CaboCha8, which also carried out named-entity chunking."
      ]
    },
    {
      "heading": "5.2 Results on intra-sentential zero-anaphora resolution",
      "text": [
        "In both intra-anaphoricity determination and antecedent identification, we investigated the effect of introducing the syntactic features for improving the performance.",
        "First, the results of antecedent identification are shown in Table 1.",
        "The comparison between BM (SCM) with BMSTR (SCMSTR) indicates that introducing the structural information effectively contributes to this task.",
        "In addition, the large improvement from BMSTR to SCMSTR indicates that the use of the preference-based model has significant impact on intra-sentential antecedent identification.",
        "This",
        "finding may well contribute to semantic role labeling because these two tasks have a large overlap as discussed in Section 1.",
        "Second, to evaluate the performance of intra-sentential zero-anaphora resolution, we plotted recall-precision curves altering threshold parameter and BZnter for intra-anaphoricity determination as shown in Figure 5, where recall R and precision P were calculated by:",
        "# of detected antecedents correctly # of anaphoric zero-pronouns P _ # of detected antecedents correctly # of zero-pronouns classified as anaphoric'",
        "The curves indicate the upperbound of the performance of these models; in practical settings, the parameters have to be trained beforehand.",
        "Figure 5 shows that BMSTR (SCMSTR) outperforms BM (SCM), which indicates that incorporating syntactic pattern features works remarkably well for intra-sentential zero-anaphora",
        "resolution.",
        "Futhermore, SCMSTR is significantly better than BMSTR.",
        "This result supports that the former has an advantage of learning non-anaphoric zero-pronouns (181 instances) as negative training instances in intra-sentential anaphoricity determination, which enables it to reject non-anaphoric zero-pronouns more accurately than the others."
      ]
    },
    {
      "heading": "5.3 Discussion",
      "text": [
        "Our error analysis reveals that a majority of errors can be attributed to the current way of handling quoted phrases and sentences.",
        "Figure 6 shows the difference in resolution accuracy between zero-pronouns appearing in a quotation",
        "(262 zero-pronouns) and the rest (733 zero-pronouns), where “IN Q” denotes the former (in-quote zero-pronouns) and “OUTQ” the latter.",
        "The accuracy on the INQ problems is considerably lower than that on the OUTQ cases, which indicates that we should deal with in-quote cases with a separate model so that it can take into account the nested structure of discourse segments introduced by quotations."
      ]
    },
    {
      "heading": "5.4 Impact on overall zero-anaphora resolution",
      "text": [
        "We next evaluated the effects of introducing the proposed model on overall zero-anaphora resolution including inter-sentential cases.",
        "As a baseline model, we implemented the original SCM, designed to resolve intra-sentential zero-anaphora and inter-sentential zero-anaphora simultaneously with no syntactic pattern features.",
        "Here, we adopted Support Vector Machines (Vap-nik, 1998) to train the classifier on the baseline",
        "model and the inter-sentential zero-anaphora resolution in the SCM using structural information.",
        "For the proposed model, we plotted several recall-precision curves by selecting different value for threshold parameters Bintra and Bintrr.",
        "The results are shown in Figure 7, which indicates that the proposed model significantly outperforms the original SCM if Bintra is appropriately chosen.",
        "We then investigated the feasibility of parameter selection for Bintra by plotting the AUC values for different Bintra values.",
        "Here, each AUC value is the area under a recall-precision curve.",
        "The results are shown in Figure 8.",
        "Since the original SCM does not use Bintra, the AUC value of it is constant, depicted by the SCM.",
        "As shown in the Figure 8, the AUC-value curve of the proposed model is not peaky, which indicates the selection of parameter Bintra is not difficult."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "In intra-sentential zero-anaphora resolution, syntactic patterns of the appearance of zero-pronouns and their antecedents are useful clues.",
        "Taking Japanese as a target language, we have empirically demonstrated that incorporating rich syntactic pattern features in a state-of-the-art learning-based anaphora resolution model dramatically improves the accuracy of intra-sentential zero-anaphora, which consequently improves the overall performance of zero-anaphora resolution.",
        "In our next step, we are going to address the issue of how to find zero-pronouns, which requires us to design a broader framework that allows zero-anaphora resolution to interact with predicate-argument structure analysis.",
        "Another important issue is how to find a globally optimal solution to the set of zero-anaphora resolution problems in a given discourse, which leads us to explore methods as discussed by McCallum and Well-ner (2003)."
      ]
    }
  ]
}
