{
  "info": {
    "authors": [
      "Dominique Beroule"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E83-1007",
    "title": "Vocal Interface for a Man-Machine Dialog",
    "url": "https://aclweb.org/anthology/E83-1007",
    "year": 1983
  },
  "references": [
    "acl-C82-1035"
  ],
  "sections": [
    {
      "heading": "VOCAL INTERFACE FOR A MAN-MACHINE DIALOG",
      "text": [
        "Dominique HERCULE LIMSI (CNRS), B.P.",
        "30, 91406 ORSAY CEDEX, FRANCE ABSTRACT We describe a dialogue-handling module used as an interface between a vocal terminal and a task-oriented device (for instance : a robot manipulating blocks).",
        "This module has been specially designed to be implanted on a single board using microprocessor, and inserted into the vocal terminal which already comprises a speech recognition board and a synthesis board.",
        "The entire vocal system is at present capable of conducting a real time spoken dialogue with its user."
      ]
    },
    {
      "heading": "I INTRODUCTION",
      "text": [
        "A great deal of interest is actually being shown in providing computer interfaces through dialog processing systems using speech input and output (Levinson and Shipley, 1979).",
        "In the same time, the amelioration of the microprocessor technology has allowed the implantation of word recognition and text-to-speech synthesis systems on single boards (Lignard and Mariani, 1982 ; Gauvain, 1983 ; Asta and Lignard, 1979) ; in our laboratory, such modules have been integrated into a compact unit that forms an autonomous vocal processor which has applications in a number of varied domains : vocal command of cars, of planes, office automation and computer-aided learning (Mel et al., 1982).",
        "Whereas most of the present language understanding systems require large computational resources, our goal has been to implement a dialoghandling board in the LIMSI's Vocal Terminal.",
        "The use of micro-systems introduces memory size and real-time constraints which have incited us to limit ourselves in the use of presently available computational linguistic techniques.",
        "Therefore, we have taken inspiration from a simple model of semantic network ; for the same reasons, the initial parser based on an Augmented Transition Network (Woods, 1970) and implemented on an IBM 370 (Memmi and Mariani, 1982) was replaced by another less time and memory-consuming one.",
        "The work presented herein extends possible application fields by allowing an interactive vocal relation between the machine and its user for the execution of a specific task : the application that we have chosen is a man-machine communication with a robot manipulating blocks and using a Plan Generating System."
      ]
    },
    {
      "heading": "II SYNTACTIC PROCESSING A. Prediction Device",
      "text": [
        "Once the acoustic processing of the speech signal is performed by the 250 word-based recognition board, syntactic analysis is carried out.",
        "It may be noted that response time and word confusions increase with the vocabulary size of word recognition systems.",
        "To limit the degradation of performance, syntactic information is used : words that can possibly follow a given word may be predicted at each step of the recognition process with the intention of reducing vocabulary."
      ]
    },
    {
      "heading": "B. Parameters Transfer",
      "text": [
        "In order to build a representation of the deep structure of an input sentence, parameters requested by the semantic procedures must be filled with the correct values.",
        "The parsing method that we de-velopped considers the naturel language utterances as a set of noun phrases connected with function words (prepositions, verbs ...) which specify their relationships.",
        "At the present time, the set of noun phrases is obtained by segmenting the utterance at each function word."
      ]
    },
    {
      "heading": "III SEMANTIC PROCESSING",
      "text": []
    },
    {
      "heading": "A. System knowledge data",
      "text": [
        "The computational semantic memory is inspired by the Collins and Quillian model, a hierarchical network in which each node represents a concept.",
        "Properties can be assigned to each node, which also inherits those of its ancestors.",
        "Our choice has been influenced by the desire to design a system which would be able to easily learn new concepts ; that is, to complete or to modify its knowledge according to information coming from a vocal input/ output system.",
        "Each noun of the vocabulary is represented by a node in such a tree structure.",
        "The meaning of any given verb is provided by rules that indicate the type of objects that can be related.",
        "As far as adjectives are concerned, they are arranged in exclusive property groups.",
        "The knowledge-based data (which may be enlarged by information provided by the vocal channel) is complemented by temporary data which chronologically contain, in abbreviated form, events evoked during the dialogue.",
        "B.",
        "Assertion processing The small amount of data representing a given universe allows us to approach the computational treatment of these two complementary and contrary components of dialogue:learning and contestation.",
        "Every time an assertion is proposed by the user a procedure parses its semantic validity by answering the question \"Does this sentence fit with the current state of the knowledge data ?\".",
        "If a contradiction is detected, it is pointed out to the user who must justify his proposal.",
        "If the user persists in his declaration, the machine may then modify its universe knowledge, otherwise the utterance is not taken into account.",
        "When no contradiction is encountered, the program enters into a learning process adding to the temporary data or knowledge-based data.",
        "U : Qu'est-ce qu'un poisson ?",
        "(What is a fish ?)",
        "S : C'est un animal qui possede des 6cailles (It is an animal which has got scales)"
      ]
    },
    {
      "heading": "1. Teaching utterances",
      "text": [
        "These assertions, characterized by the presence of a non-action verb, permit both the complete construction of the semantic network and of the concept relation rules specifying the possible entities that can serve as arguments for a predicate.",
        "Although most of our knowledge results from long nurturing and frequent interactions with the outside world, it is possible to give an approximate meaning to concrete objects and verbs by using an elementary syntax.",
        "A new concept may be taught by filling in its position within the semantic network and possibly associating it with properties that will differenciate it from its brother nodes.",
        "Concept relation rules can be learned, too."
      ]
    },
    {
      "heading": "2. Descriptive utterances",
      "text": [
        "Sentences involving an action verb are translated into an unambiguous representation which condenses and organizes information into the very same form as that of the concept relation rules from knowledge data.",
        "Therefore, semantic validity can be easily tested by a pattern-matching process.",
        "A semantic event reduced to a nested-triplet structure and considered as valid is then inserted in the dynamic-events memory, and can be requested later on by the question-answering process.",
        "Although the language is limited to a small subset of natural French, several equivalent syntactic structures are allowed to express a given event ; in order to avoid storing multiple representations of the same event, paraphrases of a given utterance are reduced to a single standard form.",
        "One of the task effected by a language understanding system consists of recognizing the concepts that are evoked inside the input utterances.",
        "As soon as ambiguities are detected, they are resolved through interaction with the user.",
        "U : Je prends le cube 1 (I am taking the cube 1) S : S'agit-il du petit cube I ?",
        "(Is the small cube I in question ?)",
        "U : Oui (Yes it is) S : O.K.",
        "Relative clauses are not represented in the canonical form of the utterance in which they appear, but they are only used to determine which concept is in question.",
        "article 1 - Nun 1 - Adjective 1 - Verb - article 2 - Adjec.",
        "2 - Nun 2 abbreviated form : (V (( NI Al )( N2 A2 ))) = semantic event E",
        "relation rule n° i :",
        "saisis les cubes 2 et 5 (grasp cubes 2 and 5) prends le cube 2 et le 5 (take hold of the cube 2 and the 5 one) attrape le cube 2 et saisis le cube 5 (lay hold of the cube 2 and grasp the cube 5)",
        "canonical form : (ASK((YOU)((TAKE((I)(CUBE(2))&(CUBE(5)))))))"
      ]
    },
    {
      "heading": "3. Orders",
      "text": [
        "Input utterances beginning with an action verb specify an order that the machine connected to the vocal interface is supposed to execute ; in addition to the deep structure of this natural language message, a formal command language message is built and then sent to the machine.",
        "The task universe memory is modified in order to reflect the execution of a user's command.",
        "User : Prends la pyramide qui est sur la table et pose.",
        "la sur le gros cube (grasp the pyramid which is on the table and put it on the big cube)",
        "The program is allowed to express its knowledge at the user's request, for instance, on concept meanings, or the systems abilities."
      ]
    },
    {
      "heading": "2. Research in dynamic-events data",
      "text": [
        "The abbreviated semantic events list is closely examined, from recent to older data, until the question-pattern approximately matches one of the memorized events.",
        "Possible analogy between a memorized event and one evoked by the question is then analysed.",
        "Coincidences rarely happen, so the system must be able to ask for full specifications about the event that interests the user ; at that time there is a vocal discussion aimed at leading the system to that event in a stepwise manner.",
        "So, when one part of a given sentence has not been recognized, because of mispronunciation or background noise, the system produces a suitable question bringing the user to repeat the unrecognized word within his answer."
      ]
    },
    {
      "heading": "Two cases can occur :",
      "text": [
        "if the word is again unrecognized, the system assumes that the entity is not in the prescribed vocabulary (containing the acoustic features of the words).",
        "An explanatory message is then produced through the synthesis module.",
        "if the lexical entity is well recognized this time, it is added to the previous utterance and computed in the same manner as the others.",
        "When a certain amount of acoustical components in a sentence have not been recognized, the system asks for the user to repeat his assertion.",
        "E. Sentence production I.",
        "Translation of a deep structure into an output sentence This process consists of inserting semantic entities into the suitable syntactic diagram which depends on the computational procedure that is activated (question answering, contradiction, learning, asking for specifications ...).",
        "Since each syntactic variation of a word corresponds to a single semantic representation, sentence generation makes use of verb conjugation procedures and concordance procedures.",
        "In order to improve the natural quality of speech, different types of sentences expressing one same idea may be generated in a pseudo-random manner.",
        "The same question asked to the system several times can thus induce different formulated responses.",
        "2.",
        "Text-to-speech transcription ambiguities A module of the synthesis process takes any French text and determines the elements necessary for the diphone synthesis, with the help of a dic-tionnary containing pronunciation rules and their exceptions (Prouts, 1979).",
        "However, some ambiguities concerning text-to-speech transcription can still remain and cannot be resolved without syn-tactico-semantic information ; for instance : \"Les poules du couvent couvent\" (the convent hens are sitting on their eggs) is pronounced by the synthesizer : /lepuldykuv5kuvg/ (the convent hens convent).",
        "To deal with that problem, we may send the synthesizer the phonetic form of the words.",
        "IV CONCLUSION The dialog experiment is presently running on a PDP 11/23 MINC and on an INTEL development system with a VLISP interpreter in real-time and using a series interface with the vocal terminal.",
        "The isolated word, recognition board we are using for the moment makes the user pause for approximately half a second between each word he pronounces.",
        "In the near future we plan to replace this module by a connected word system which will make the dialog more natural.",
        "It may be noted that the compactness of the understanding program allows its implantation on a microprocessor board which is to be inserted in the vocal terminal.",
        "At present we apply ourselves to make the dialog-handling module easily adaptable to various domains of application."
      ]
    },
    {
      "heading": "MULT IBUS RECOGNITION DIALOG SYNTHESIS BOARD BOARD BOARD",
      "text": []
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We are particulary grateful to Daniel MEMMI, Jean-Luc GAUVAIN and Joseph MARIANI for their precious help during the course of this work.",
        "Special thanks to Maxine ESKENAZI, Francoise NEEL and Michele CHASTAGNER."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
