{
  "info": {
    "authors": [
      "Giovanni Guida",
      "Carlo Tasso"
    ],
    "book": "Applied Natural Language Processing Conference",
    "id": "acl-A83-1005",
    "title": "IR-NLI : An Expert Natural Language Interface to Online Data Bases",
    "url": "https://aclweb.org/anthology/A83-1005",
    "year": 1983
  },
  "references": [
    "acl-C82-1066"
  ],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "Constructing natural language interfaces to computer systems often requires achievment of advanced reasoning and expert capabilities in addition to basic natural language understanding.",
        "In this paper the above issues are faced in the frame of an actual application concerning the design of a natural language interface for the access to online information retrieval systems.",
        "After a short discussion of the peculiarities of this application, which requires both natural language understanding and reasoning capabilities, the general architecture and fundamental design criteria of a system presently being developed at the University of Udine are then presented.",
        "The system, named IR-NLI, is aimed at allowing non-technical users to directly access through natural language the services offered by online data bases.",
        "Attention is later focused on the basic functions of IR-NLI, namely, understanding and dialogue, strategy generation, and reasoning.",
        "Knowledge represenetation methods and u.lgorithms adopted are also illustarted.",
        "A short example of interaction with IR-NLI is presented.",
        "Perspectives and directions for future research are also discussed."
      ]
    },
    {
      "heading": "I INTRODUCTION",
      "text": [
        "Natural language processing has developed in the last years in several directions that often go far beyond the original goal of mapping natural language expressions into formal internal representations.",
        "Problems concerned with discourse modeling, reasoning about beliefs, knowledge and wants of speaker and hearer, expiicitely dealing with goals, plans, and speech acts are only a few of the topics of current interest in the field.",
        "This paper is concerned with one aspect of natural language processing that we name here reasoning.",
        "It is intended as a basic activity in natural language comprehension that is aimed at capturing speaker's goals and intentions that often lie behind the mere literal meaning of the utterance.",
        "In this work we explore the main implications of reasoning in the frame of an actual application which is concerned with the natural language acces to online information retrieval services (Politt,1981; Waterman,1978).",
        "In particular, we shall present the detailed design of a system, named IR-NLI (Information Retrieval Natural Language Interface), that is being developed at the University of Udine and we shall discuss its main original features.",
        "The topic of natural language reasoning is first shortly illustrated from a conceptual point of view and compared to related proposals.",
        "The main features of the chosen application domain are then described and the specifications of IR-NLI are stated.",
        "We later turn to the architecture of the system and we go further into a detailed account of the structure of its knowledge bases and of its mode of operation.",
        "Particular attention id devoted to the three fundamental modules STARTEGY GENERATOR, REASONING, and UNDERSATBDING AND DIALOGUE.",
        "A sample search session with IR-NIS concludes the illustarion of the project.",
        "A critical evaluation of the work is then presented, and main lines of the future development of the project are outlined with particular attention to original research issues."
      ]
    },
    {
      "heading": "II NATURAL LANGUAGE UNDERSTANDING AND REASONING",
      "text": [
        "Research in natural langage processing has come in the last years a highly multidisciplinary topic, in which artificial intelligence, computational linguistic, cognitive science, psychology, and logic share a wide set of common intrests.",
        "In this frame, reasoning is not a new issue.",
        "The meaning that we attach to this term in the context of this work is, nevertheless original.",
        "We distinguish in the natural language comprehension activity between a surface comprehension that only aims at representing the literal content of a natural language expression into a formal internal representation, and a seep comprehension that moves beyond surface meaning to capture the goals and intentions which lie behind the utterance (Grosz,1979; Hobbs,1979; Allen, Perrault,1980).",
        "The process that brings from surface to deep comprehension is just what we name here reasoning activity.",
        "Differntly from Winograd (1980), reasoning is not , in our model, something that takes place after understanding is completed and aims at developing deductions on facts and concepts acquired.",
        "Reasoning is a basic part of deep comprehension and involves not only linguistic capabilities lunderstanding and dialogue) but also deduction, induction, analogy, generalization, etc., on common sense and domain specific knowledge.",
        "Figure 1 presents a graphic representation of the basic relationships between understanding and reasoning, and clearly shows how reasoning moves the internal representation of an utterance from a first point, corresoonding to surface coprehension, to a second one that represents seep comprehension.",
        "In the application of online information retrieval that we face in this work, the above concepts are considered in the frame of man-machine communication, and reasoning will mostly be concerned with terminology, as we shall further explore in the next section."
      ]
    },
    {
      "heading": "III A SAMPLE APPLICATION : ONLINE INFORMATION RETRIEVAL",
      "text": [
        "In this section we present an application domain where the topic of natural language reasoning plays a fundamental role, namely, natural language access to online information retrieval services.",
        "As it is well known, online services allow interested users solve information problems by selecting and retrieving relevant doLuments stored in very large bibliographic or factual data bases.",
        "Generaily end-users are unwilling or unable to serach personally and directly access these large files, but they often rely on the assistance of a skilful information professional, the intermediary, who H.ws how to select appropriate data bases and how to design good search startegies for the retrieval of the desired information, and how to implement them in a suitable formal query language.",
        "'usually, the interaction between end;er and intermediary begins with a presearch inter-1',/ aimed at precisely clarifying the content and t'.e objectives of the information need.",
        "On tha base of the information gathered, the interemdiary chooses the most suitable data bases and, with the help seraching referral aids such as thesauri, directories, etc., he devises the search strategy to be executed by the information retrieval system.",
        "the output of the search is then evaluated by the end-user, who may propose a refinement and an interaction of the search for better matching his requests.",
        "We claim that the intermediary's task represents a good example of the issues of natural language reasoning, particularly for what concerns the ability understanding natural language user's requests and if reasoning on their linguistic and semantic nuances in order to fully 2apture user's neeas and goals.",
        "Besides, it has to be stressed that the intermediary should also posses other important skills, tnt expertise and precise knowledge about data base contents, organization, and indexing criteria, about availability and use of searching referral aids, _..t system query languages and access procedures, and last about how to plot and construct an adequate search strategy.",
        "The above illustrated motivate the design of a natural language expert system for interfacing online data bases.",
        "In fact, the IR-NLI project has among its long term goals the implementation of a system to be interposed between the end-user and the information retrieval system, capable of fully substituting the intermediary's role."
      ]
    },
    {
      "heading": "IV THE IR-NLI SYSTEM",
      "text": [
        "IR-NLI is conceived as an interactive interface to online information retrieval system supporting English language interaction.",
        "It should be able to manage a dialogue with the user on his information needs and to construct an appropiate search strategy.",
        "More precisely, IR-NLI is aimed at meeting the needs of non-technical users who are not acquainted with on line searching.",
        "For this purpose three different capabilities are requested.",
        "First, the system has to be an expert of online searching,i.e.",
        "it must embed knowledge of the intermediary's professional skill.",
        "Second, it must be able of understanding natural language and of carrying on the dialogue with the user.",
        "Third, it has to be capable of reasoning on language in order to capture the information needs of the user and to formulate them with appropriate terms in a given formal query language.",
        "In the current first phase of the project we have considered a set of working hypotheses for IR-NLI:",
        "- it operates on just one data base; - it utilizes only one query language; - it refers to only one subject domain;",
        "- it is conceived only for off-line use without interaction with the data base during the search session.",
        "fire suitable sequences of understanding, dialogue, and reasoning functions until the internal representation of the user's requests is completely expanded and validated.",
        "The UNDERSTANDING AND DIALOGUE module is devoted to perform activities mostly of linguistic concern.",
        "First, it has to translate the natural language user's requests into a basic formal internal representation (IR).",
        "Second, it manages the dialogue with the user by generating appropriate queries and by translating his replays,thus expanding the IR with new information.",
        "The UNDERSTANDING AND DIALOGUE module utilizes for its operation a base of linguistic knowledge (LK).",
        "The REASONING module is aimed at reasoning on IR in order to enlarge its content with all the information required to generate an appropiate search strategy.",
        "It utilizes for this task a base 3f domain specific knowledge (DSK).",
        "The FORMALIZER module, after the STRATEGY GENERATOR has completed its activity, constructs from the IR the output search strategy to be executed fcr accessing the online data base.",
        "The FORMALIZER utilizes for its operation knowledge about the formal Ian guage needed to interrogate the online data base and operates through a simple syntax-directed schema.",
        "it is conceived as a parametric translator capable of producing search strategies in several languages for accessing online services, such as SDC ORBIT, Euronet DIANE, Lockheed DIALOG, etc."
      ]
    },
    {
      "heading": "SYSTEM ARCHITECTURE",
      "text": [
        "The general architecture designed for the IR-NLI system is shown in Figure 2.",
        "The kernel of the system is constituted by the 6TNA11:(1i GENERATOR, which is devoted to devise the top-level choices concerning the overall operation of the system and to control their execution.",
        "It utilizes for its acti-7i:y a base of expert knowledge (5K) which concerns the evaluation of user's requests, the management L:f the presearch interview, the selection of a suitable approach for generation of the search strategy, and ouheduling of the activities of the lower Level modules UNDERSTANDING AND DIALOGUE, REASONING, and FORMALIZER.",
        "The operation of the STRATEGY GENERATOR is organized around a basic sequence of steps, each taking into account a differnt subset of expert rules, that apply to different situations and"
      ]
    },
    {
      "heading": "VI KNOWLEDGE BASES",
      "text": [
        "In this section we shall illustrate the main features of the three knowledge bases utilized by the IR-NLI system.",
        "Let us begin with DSK.",
        "The purpose of this know ledge base is to store information about the domain covered by the online data base to which IR-NLI refers.",
        "This information presents two aspects : a semantic facet concerning what concepts are in the data base and how they relate to each other, and a linguistic one concerning how the concepts are currently expressed through appropriate terms.",
        "The structure of DSK proposed reflects and generalizes to some extent that of classical searching referral aids (in particular, thesauri and subject classifications).",
        "At a logical level, it is constituted by a labelled directed network in which nodes represent concepts and directed arcs represent relations between concepts.",
        "Each node contains a term, a flag denoting whether the term is controlled or not, a field that stores the posting count, i.e. the number of items in the data base in which the term appear, and a level number which represents the degree of specificity of the term in a hirar-:hicai subject classification.",
        "Arcs g-2nerally denote the usual cross-reference relationships utilized for structuring thesauri; e.g., BT (broader term), NT (narrower term), RT (related term), OF (used for).",
        ":n addition, arcs of type next are provided that allow, in connection with the level numbers of nodes, a sequential scanning of the knowledge base accor-iing to the currently utilized hierarchical subject •Lassification.",
        "This structure is conceived to be directly obtained (possibly in a partially automatic way through appropriate data conversion programs) from available searching referral aids and online thesauri.",
        "Let us turn now to LK.",
        "This knowledge base is aimed at supplying all information concerning natural language that is needed to understand user's re-luests.",
        "According to the mode of operation of the =DERSTANDING AND DIALOGUE module (see section IX), it contains the lexicon of the application domain which is currently considered.",
        "Each record of the Lexicon contains a word of the language, its sem'rtyrA concept, connective, function, and its meaning.",
        "The semantic type denotes the role 2f a ford in a sentence; namely: - denoting a term of the data base; - iefining a particular relation betw•cen different concept in user's requests; - specifying a particular function that the user desires to obtain from the information retrieval zystem.",
        "the meaning of a word may be expressed as a pointer to a term of the DSK in the case of a word of type concept, as a special purpose procedure in the case of a connective or a function.",
        "Let us note that,in order to avoid unilseful duplication of information in the DSK and LK, a shared directory of entry words may be utilized f:r both bases.",
        "The purpose of EK is to contain information that concerns the professional expertise of the intermediary on how to manage a search session in order to appropriately satisfy the information needs of the end-user.",
        "Its content is made up zf several classes of rules concerning the different kinds of activities performed during a search session.",
        "711e general structure of the rules is of the classics.",
        ": type IF-THEN."
      ]
    },
    {
      "heading": "VII STRATEGY GENERATOR",
      "text": [
        "The task of the STRATEGY GENERATOR can be considered from two different points of view :",
        "- an external one, that concerns performing intermediary's activity; - an internal one, that relates to management and control of REASONING and UNDERSTANDING AND D:ALOGUE modules.",
        "On the base of these specifications, it must embed expert capabilities and behave as a consultation system for information retrieval Politt,1927 The basic mode of operation of this module is crganized around the following four main steps that reflect the usual practice of online information searching (Lancaster,1979; Meadow, Cochrane,1981:.",
        "1. perform presearch interview 2. select approach 3. devise search startegy 4. construct search startegy.",
        "The IR adopted is unique throughout the whole operation of the system and it is constituted by a frame, initialized by the UNDERSTANDING AND TIALZGUE module,and then further refined and expanded cy the reasoning module.",
        "This frame is .",
        ";tructured into frames in such a way to contain, classzfiei under different headings, any information that is relevant for searching an online lath base, andtc a--:w an effective pattern-matching for the selection of search approaches and tactics.",
        "More specifioally, :R encompasses terminology about concepts and facets present in user's requests, z1-.,:-ifioations about search constraints and output format, and figures about search objectives such as recall and precision (Meadow, Cochr.,ne,!",
        "?81!.",
        "To go further in our description, let us introduce precise definitions of two technical terms above used in an informal way : search approach : the abstract way of facing a search problem, reasoning on it, analyzing its facets, and devising a general mode of operation for having access to desired information stored in an online data base; search tactic : a move, a single step or action, in the execution of a search approach.",
        "Let us recall that a search strategy is a program, written in an appropriate formal query language, for obtaining desired information from an online system; taking into account the two above definitions a search strategy can be viewed as the result ..f the execution of a search approach through application of appropriate search tactics.",
        "Within IR-NLI, a search approach is represented as an algorithm that defines which tactics to utilize, among the available ones, and how to use them in the construction of a strategy.",
        "An approach is not however a fixed procedure, since it does not specify at each step which particular tactic to execute, but only suggests a set of candidate tactics, whose execution may or may not be fired.",
        "Tactics are represented at two different levels of abstraction - an high-level representation <name, objectives> provided for use by the STRATEGY GENERATOR; - a low-level representation <name,reasoning actions> supplied for use by the REASONING module.",
        "About 15 tactics are considered, taken from the very rich discussion by Bates (1979) : CORRECT, CUT, SELECT, EXHAUST, REDUCE, PARALLEL, PINPOINT, BLOCK, SUPER, SUB, RELATE, NEIGHBOUR, FIX, RESPELL, RESPA-II, etc.",
        "The operation of the STRATEGY GENERATOR is basically pattern-directed; namely, the particular activities to be performed and the way in which UN-DE:ZTANDING AND DIALOGUE and REASONING modules are activated are determined by the content of the current :R 'or of some parts of it), which is matched with an appropriate subset of the expert rules.",
        "In :his way its mode of operation is not strictly determinate : some activities may or may not be fired .r may be performed in different ways according to the results of the pattern-matching algorithm.",
        "-The ..ctivity of the STRATEGY GENERATOR can now ce repr-,sented in a more detailed way through the following high-level program :",
        "devise search strategy <pattern-matching between the current IR and tactics involved in the selected approach> <firing of appropriate tactics>",
        "As already mentioned in section IV, in the first version of IR-NLI the off-line operation if the system lead us to consider only the building block approach; future versions of the system will encompass also other classical and commonly utilized approaches such as successive fraction, citation pearl growing, most specific facet first, etc.",
        "iMeadow, Cochrane,1981), that are more suitable fir an on-line operation of the system in which iiract interaction with the data base luring the search session is allowed."
      ]
    },
    {
      "heading": "VIII REASONING",
      "text": [
        "The REASONING module operates on the IR and is aimed at precisely capturing user's goals and heeds through deductive and inferential processes.",
        ":ore specifically, the REASONING i,odule has the main task of executing the tactics fired by the STRATEGY GENERATOR.",
        "Hence, from this point of view, it represents the actuator of the reasoning process devised by the STRATEGY GENERATOR.",
        ":t utilizes the low-level representation of the tactics, which specifies suitable reasoning actions expressed in terms of : - accessing DSK; - updating the IR with the new information.",
        "Among the basic capabilitis of the RESONING module we consider generalization to broader terms, extension to related concepts, particularization to narrower terms, analysis of synonymi and homo-nymi, etc.",
        "Its operation is based on special-purpose procedures that correspond to the reasoning actions involved in the tactics.",
        "Furthermore, when an action has to be performed on IR for extending its content, validation may be requested from the user in order to ensure a correct matching betwwen his wants and system proposals.",
        "This is done through the UNDERSTANDING AND DIALOGUE module which has to gather user's agreement about the new terms to be introduced in the IR.",
        "For what concerns the dialogue function, it relies on two strictly connected activities : - generation of a query, according to some requests from the STRATEGY GENERATOR or SEASONING modules, through assembly and completing of parametric text fragments stored in the UNDERSTANDING AND DIALOGUE module; - understanding of the user's answer and refinement, i.e. validation, updating or completing, of the current IR.",
        "Let us stress that, according to the basic goal-oriented conception of the parsing mechanism of UNDERSTANDING AND DIALOGUE module, the understanding activity performed in the frame of the dialogue function is strongly directed by knowledge of the query that the system has asked the user and, therefore, of expected information to be captured in the answer."
      ]
    },
    {
      "heading": "X A SAMPLE SEARCH SESSION",
      "text": []
    },
    {
      "heading": "IX UNDERSTANDING AND DIALOGUE",
      "text": [
        "The purpose of the UNDERSTANDING AND DIALOGUE module is twofold : - to translate users requests into IR; - to generate queries to the user and to understand :1Ls answers, i.e. to manage a bounded scope dialogue.",
        "The conception of this module strongly relies, for what concerns •:1e understanding function, (sn the experience previously developed by the authors with :ILL project, and is organized around the concepts of semantics-directed and goal-oriented parsing 'Guida,Tasso,1982a).",
        ":ts mode of operation is mainly rule-based : a main parsing algorithm performs the most elementary steps of the analysis search in the lexicon, construction of a basic tentative internal representation, validation of basic internal ::_presentation), and manages a ;-ittsrn-directed invocation of heuristic rules for 2so...ttion of critical events 'e.g., ambiguities, silispes, anaphoric refsrences, indirect speech, s-:c. ...An important feature of the understanding function id the ability to solve critical situations by engaging the user in a clarification dialogue activated by some of the above mentioned heuristic rules, to gather additional information which is necessary to correctly understand the input natural language requests.",
        "In this section we present a short exammle of the basic mode of operation of IR-NLI.",
        "Figure 3 shows a sample session in which, in addition to the user-system dialogue, parts of the IR and the search strategy generated (in Euronet DAN EURO-LANGUAGE) are reported.",
        "The example refers to the domain of computer science."
      ]
    },
    {
      "heading": "XI CONCLUSION",
      "text": [
        "In the paper the main features of the IR-NLI system have been presented.",
        "The Project is now entering the experimental phase that will be carried on on a VAX 11:7520 system.",
        "The design activity so far developed (Guida, Tasso,1982t,1962c) has reached, in our mind, a quite assessed point so that future work on this topic will be mainly concerned with removal of the restrictions and working hypotheses considered in the current first phase and with refinement of implementation details.",
        "The authors also plan to implement in the next future a complete prototype version of the system to be connected to a real online system in the frame of a strictly application oriented interest.",
        "The research activity will be focused, on the other hand, on several issues that deserve further"
      ]
    },
    {
      "heading": "SELECT PARALLEL RELATE RESPELL RESPACE > THE CONCEPT \"ONLINE INFORMATION RETRIEVAL\" COULD BE SPLITTED INTO : - ONLINE - INFORMATION RETRIEVAL PLEASE VALIDATE ! * yes > THE FOLLOWING ADDITIONAL TERMINOLOGY IS PROPOSED FOR THE CONCEPT \"ONLINE\" : INTERACTIVE, REALTIME PLEASE VALIDATE ! * ok",
      "text": [
        "investigation.",
        "Among these we mention : - the development of more flexible and robust dialogue capabilities, including limited justification of the mode of operation of the system (Webber,1982); - the study of advanced representations of tactics through generalized rule structures that will allow more refined matching and firing mechanisms (Winston,1982); - the design of new tactics (e.g., PATTERN, RECORD, BIBBLE (Bates,1979)) and reasoning actions, that enable the system to keep track of previous search sessions and to analogize from experience in de-•rising and executing a search approach.",
        "XII REFERENCES"
      ]
    }
  ]
}
