{
  "info": {
    "authors": [
      "Christine A. Montgomery"
    ],
    "book": "Applied Natural Language Processing Conference",
    "id": "acl-A83-1009",
    "title": "Distinguishing Fact from Opinion and Events from Meta-Events",
    "url": "https://aclweb.org/anthology/A83-1009",
    "year": 1983
  },
  "references": [],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "A major problem In automatically analyzing the text of military messages In order to synthesize data base elements is separating fact from opinion, i.e., identifying factual statements versus evaluative commentary such as degree of belief or confidence in the parameters of a particular event, comparative evaluations of entitles and events, predictions of future events, Ste.",
        "This paper describes a model which accounts for the range of factual to evaluative Information In the message traffic, and discusses a means for representing such Information In the context of an experimental system for automated data base generation."
      ]
    },
    {
      "heading": "1.0 BACKGROUND",
      "text": [
        "For several years, with some Interruptions, • research and development effort has been In process In the Operating Systems Division of Logicon (and its predecessor company, Operating Systems, Inc.) aimed at the automated creation of data bass elements from the text •cif electronically transmitted military messages.1 [Kuhns and Montgomery 1973, Kuhns 1974, Kuhns et al. 1975, Silva and Montgomery 1977, Silva et al. 1979a, 1979b, Dwiggins and Silva 1981.]",
        "The objective of this research has been to provide an automated capability to supplement the presently largely manual, labor-Intensive task of maintaining the currency of data bases which derive their Information elements from the text of military messages.",
        "Although some effort has been devoted to primarily Interactive approaches to the problem, and to messages which have highly predictable columnar summary formats, the majority of the research and development work has concentrated on the more difficult task of analyzing unformatted narrative text with user Interaction limited to occasional assistance to the automated system.",
        "A teethed system called MATRES has been constructed In Prolog to run under the UNIX operating system on the POP 11/70.",
        "MATRES Is a knowledge based system for understanding the natural language text of event-oriented messages in the domains of air activities and space/missile (S&M) activities.",
        "The knowledge structures In MATRES, called \"templates\", are essentially frames or scripts describing entities and events, which answer the military user's basic questions about these phenomena, as Illustrated In the simplified view of an event template presented In Figure 1.",
        "The templates are hierarchically organized; lower level templates deal with objects or times, mid level with events containing objects and times, higher level with activities composed of events.",
        "The slots In the templates contain procedures which operate upon the output of the Definite Clause Grammar (DCG) to Instantiate the templates.",
        "We are currently using a corpus of approximately 125 messages in the S&M domain as• a basis for developing a scenario for evaluation of the extended MATRES testbed, as well as a teethed for a related knowledge based system, the Active/Introspective Information System [described In Montgomery and Ruspini 1981, and Ruspinl 1982] for which MATRES serves as a front end.",
        "The scenario Involves two simulated nations, the Delta Confederation of the Atlantic States and the Epsilon Republic.",
        "Both nations have space programs, and each Is Interested In monitoring the technological progress of the other, using their own satellite and sensor resources and those of other friendly nations.",
        "The set of messages to be analyzed by MATRES are mainly reports of space and satellite launches and orbital activities of the Delta Confederation, which are being monitored and evaluated by the Epsilon Republic.",
        "The text of messages used In the scenario has the structure and format of actual messages reporting on S&M activities, although the lexicon Is substantially different.",
        "As discussed in several previous technical reports prepared under earlier contracts with RAOC ([Kuhns and Montgomery 1973], [Silva at al 1979a], [Silva et al. 1979b]), the subset of the English language on which the text of intelligence messages Is based la essentially a specialized language for reporting events.",
        "Intermixed with factual statements reporting on entitles and events, however, Is much evaluative commentary.",
        "Moreover, press announcements of the Delta Confederation are Included In the reports, and evaluative comments are made both about the events reported In the press announcements and the announcements themselves.",
        "In synthesizing data base elements from these messages, It is crucial to sort out these different levels of information.",
        "This paper defines an approach to Identifying and labeling these types of Information so that they can be exploited In the context of MATRES and the data base systems which It serves."
      ]
    },
    {
      "heading": "INFORMATION PARAMETERS OF A PROTOTYPE TEMPLATE QUESTION PROTOTYPE EVENT PROTOTYPE OF EXAMPLE SPECIFIC EVENT WHAT EVENT TYPE AIRSPACE VIOLATION AIRSPACE VIOLATION WHO AGENT (OR OBJECT PLUS AIRCRAFT OWNED A UGANDAN FIGHTER OWNER) BY COUNTRY C AIRCRAFT WHEN TIME OF THE TIME AT WHICH VIO- AT ABOUT 0200 HOURS EVENT LATION OCCURRED ON 25 APRIL 1978 WHERE LOCATION AT WHICH LOCATION AT WHICH 8 MILES FROM THE KENYA EVENT TOOK PLACE VIOLATION OCCURRED BORDER NEAR SUAM TO WHOM PATIENT, OR ENTITY AF OWNER OF VIO- KENYA FECTED BY THE EVENT LATED AIRSPACE WHY INTERPRETATION OF THE PROBABLE REASON FOR PROBABLE RECONNAISSANCE EVENT VIOLATION EVENT MISSION",
      "text": [
        "2.0 THE RESEARCH PROBLEM As noted above, the sublanguage of the message corpora for the air activities and S&M domains Is essentially a vehicle for reporting events.",
        "Kuhns and Montgomery [1973] presented a detailed methodology for classifying the various types at events described In the messages, which is shown in Figure 2, and summarized below.",
        "Before describing the event classification, however, It Is enlightening to review briefly some example messages In order to understand the motivation for this rather complex model.",
        "Some messages – for example, those encountered In our previous research on the air activities domain -- may report only primitive events.",
        "However, as noted above and Illustrated In Figure 3, a message may in fact be a report of a report that is, It may Include a report of an event by some other source than the originator of the message.",
        "The \"announcement\" Is thus a report of a \"launch\" event, which Is the basic or primitive event being reported.",
        "The \"announcement\" Is an event, but It Is clearly not on the same level as the primitive event.",
        "Rather, It 13 a report about the launch, a meta-event that Incidentally Introduces a new Information source of different credibility than the originator of the message.",
        "However, this distinction alone 13 not sufficient to account for the difference between the Initial two sentences of the example message and the third sentence, which contains an evaluation of the announcement, stating that It was characterized by \"routine\" wording.",
        "It Is thus an evaluative commentary on the press announcement of the launch event.",
        "Since the announcement has been defined as a meta-event, the comment represents another meta-level.",
        "In fact, In reviewing additional examples of the message traffic In this scenario, It Is clear that, in order to accurately distill and represent Information contained in the text of these messages, the analytical methodology must Identify and uniquely label the following types of information: Meta-events Non-meta-events Observational events Primitive events Attributive events Relational events World point events (location events) World point qualification events (location event qualifications) Non-world point events, or events involving two or more objects or locations",
        "NYT ANNOUNCES LAUNCH OF TERREX 558 AND TERREX AT lean, NYT-THE DELTA NEWS AGENCY-ANNOUNCED THE LAUNCH OP TERREX 585 AND TERREX 5511, THE MAN RELATED SPACECRAFT LAUNCHED FROM THE BOGOTA MISSILE TEST RANGE AT 0800Z ON 17 NOVEMBER.",
        "THE ANNOUNCEMENT CONTAINED ROUTINE WORDING AND STATED THE ESV'S WERE PLACED IN",
        "• \"factual statements about events made by Epsilon Republic reporters, • degrees of belief In those statements, • evaluations of events and predictions of future events, • degrees of belief In those statements, • factual statements about events made by the Delta Press, • degrees of belief of the Epsilon Republic reporters In such statements, • predictions of future events In the press announcement, • evaluations of events reported and predictions made by the Epsilon Republic reporters."
      ]
    },
    {
      "heading": "3.0 ANALYTICAL METHODOLOGY",
      "text": [
        "This analytical methodology la based on a model of the reel world situation which underlies the scenario.",
        "Part of the model derives from the event classification schema mentioned above, and Illustrated In Figure 2, which was developed to account for the levels of content occuring In the event-oriented message discourse.",
        "In this classification, there are two major types of events, rest* events and non-meta events.",
        "Of the latter, events may be observational, or primitive.",
        "An observational event Is a direct perception of an event, which may be a visual perception (e.g., \"observe\", \"sight\"), or In the case of a sensor, an electronic measurement of the emitted energy characterizing the event.",
        "A primitive event is thus a physical event of some kind which does not Involve an observation or perception.",
        "Primitive events may be attributive or relational.",
        "An attributive event describes a situation In which a particular entity has a particular attribute at a certain time or during a particular time Interval (other than the attribute location, which Is covered under relational events), for example: \"Terrex 534 operates In the high density mode\".",
        "A relational event Involves entities which stand In an nary relation with each other at a certain time or during a fixed time Period.",
        "The Importance of the subclasses of world point and world point qualification events la In defining the world line of an entity, say the track of a ship or submarine.",
        "Of these distinctions, the most relevant for this discussion are those Involving meta-events and non-meta events, and of the latter, primitive versus observational events.",
        "In terms of the scenario described above, a primitive event may occur, say, a satellite launch by the Delta Confederation, as Illustrated In Figure 4.",
        "This event, like any other event, Involves the emission of energy.",
        "Such an emission is perceived by a sensing device of the Epsilon Republic.",
        "The device generates (down arrow) a report of the given event, In terms of the particular attributes of the event It is designed to measure.",
        "This sensor report le an observational event, entailing an observation of a primitive event.",
        "An SAM analyst for the Epsilon Republic accesses (up arrow) this report, which contains digitized Information generated by the sensor, interprets this Information as a launch event, and Issues his own report about that event.",
        "His report, which Is an Interpretation of the primitive event based on the observational event, Is a zeroth order meta-want: the common denominator of the message traffic.",
        "At the same time, the Deltas may release en internal report about the launch, which would also constitute a zeroth order meta-event.",
        "Based on that report, the Delta press agency, fin may Issue an announcement of the primitive event, the announcement thus constitutes a first-order meta-event An Epsilon Republic reporter may then make an Interpretation of.",
        "that announcement.",
        "In the form of a report, which – being a report of a first-order meta-event -- is therefore a second order meta-event Corrections or other changes made by Epsilon reporters to these messages constitute a third meta level of reporting event, since they may reference reports of reports of events.",
        "The model thus far accounts for the event reporting structure which underlies the Delta/Epsilon scenario, but we must also account for the reporter's comments about the event – La., his Interpretation or evaluation of the event -- which can occur at any of these levels.",
        "The reporter's goal is to Identify and describe all the relevant parameters of an event (exemplified by the slots In the template for a launch event, shown In the center of Figure 5) based on the observational report produced by the sensor and any other Information he may have (e.g., knowledge that a replacement of a non-functioning communications satellite Is likely within a given time frame).",
        "However, If the reporter's Information Is Incomplete or Imprecise, he cannot exactly describe the parameters of an event, but will give his best Interpretation of the event based on what he knows.",
        "Thus he may report a launch of \"an unidentified satel-lite\", \"a Probable television support satellite\".",
        "\"a Possible CE satellite\".",
        "In some cases, he may have enough Information to make a comparative evaluation with launch events which have occurred In the past: \"a new ESV\", \"the second CE satellite to be successfully orbited by the Deltas this year\".",
        "Still another type of meta Infor",
        "mation Is exemplified by the last sentence in the sample message presented above: the assignment of an Men-tificaUon number to a space object.",
        "If a repartees Information is good, Le., complete and precise, the following type of launch report la produced: the source Is the actual originator of the message.",
        "Thus, in the case of the \"designate\" meta template, the linfosource\" of the designation information (Le., that the particular satellite launched from that site at that date and time has been designated a space object called MSG.",
        "04 -096 VARIABLE DENSITY CE AGSAT LAUNCH, 20 SEPTEMBER 1983 A VARIABLE DENSITY CROP ENHANCEMENT AGRICULTURAL SATELLITE"
      ]
    },
    {
      "heading": "WAS LAUNCHED FROM THE HARRISBURG MISSILE AND SPACE COMPLEX (HMSC) AT 16062 ON 20 SEPTEMBER 1983. THE BRO2 LAUNCH SYSTEM WAS USED TO PLACE THE SATELLITE INTO A 3 DEGREE ORBIT. WSJ OBJECT NUMBER 8018 HAS BEEN ASSIGNED TO THE PAYLOAD.",
      "text": [
        "However, when his Information Is Imprecise and his knowledge can add Me to It, he must resort to the qualified or meta-commented types of messages described above.",
        "In order to accommodate such qualified and meta-commentary types of Information, each event template may have associated with It one or more meta templates containing interpretive or evaluative Information.",
        "Thus, as represented In Figure 6, an Instantiated launch template produced from an observational event and a primitive event (a zeroth order reporting event, as Illustrated In Figure 4) may have several additional qualifications (exemplified by, but not limited to, the meta templates Illustrated In the figure).",
        "So, for example, a meta evaluative template2 associated with a launch template expresses the Epsilon reporter's degree of belief or confidence In the launch parameters he reports: the object In the event template Is believed by the Epsilon reporter to be a CE (or Crop Enhancement) satellite from the Information presented In the observational report by the sensor, and from his own knowledge of past occurrences of CE satellite launches, as well as expectations of possible replacement launches, etc., during particular time Intervals.",
        "All or none of the listed parameters for a launch event may be qualified In this way.",
        "Thus, In Figure 5, the Epsilon reporter believes that, to the best of his knowledge, the space object Involved In the major launch event Is a \"probable\" CE or crop enhancement satellite, and that the time of launch Is \"approximately\" 11302.",
        "Each meta template has fields which Identify the source, as well as the time and date of the Interpretive Information.",
        "As opposed to the \"Infosource° parameter of these meta templates -- which shows the ultimate source of the Information contained In the Instantiated template – 2.",
        "The template and mete template structures shown In this figure are Intended to be Illustrative only: for example, the object, date/time group, and deorbit Information constitute embedded templates linked to the main \"launch\" event template by pointers.",
        "In addition, there are several alternatives for more economical Internal representation of meta template Information, which are currently under review for the actual design and implementation of this information within MATRES and within the Active/introspective Information System (a knowledge-based Intelligent assistant, as mentioned above), which MATRES feeds.",
        "\"Temut 534\") is NYT, the news agency of the Delta Confederation, Indicating that this Information came from an NYT press announcement quoted (and Interpreted) by in Epsilon reporter.",
        "This distinguishes such Information from that represented by the \"assign\" meta template, where the Epsilon Republic reporting staff assign an Identification number of their own to the satellite payload for future reference.",
        "Another significant analytical tool of the Epsilon reporter In this scenario Is the comparative evaluation, Illustrated by the \"compare\" meta template.",
        "These comparisons Involve events which have taken place before, In this case, launch events, and/or objects Involved In such launches.",
        "As In the example shown In Figure 6, the comparison may specify an event Involving the continuation of a satellite in an active status, where other such satellites are now Inactive (implied comparison): e.g., \"Terrex 834 la the only first generation crop enhancement satellite which la currently active.\"",
        "An Important function of meta templates Is to represent predictive Information: i.e., descriptions of events expected In the future, based on other events which have occurred In the past, or are currently In process.",
        "The \"expect\" template In Figure 5 expresses the presumable or expected parameters of mission duration, and consequently, the deorbit event which Is anticipated for October 26.",
        "To summarize, the function of the meta templates Is to Identify and delimit evaluative commentary, which Isolates the factual Information presented In most zeroth order meta event reports, and Identifies Information pertaining to credibility of the event occurrence, comparability with other similar entities and events, predictions of future related events, etc.",
        "On the other hand, In addition to distinguishing the various levels of event occurrence, observation, and reporting, the function of the meta event structure Illustrated In Figures 2 and 4 Is to clearly demarcate the \"Delta versus Epsilon\" (In terms of the scenario described above) aspects of the messages.",
        "The reporters of the Epsilon Republic \"assign\" \"Spacoid\" and \"WSJ\" Identification numbers for space object Inventory purposes; the Deltas \"designate\" their own space objects with particular classes of object names, e.g., \"Terrex 559\".",
        "They \"launch\", \"put Into orbit\", \"deorbit\", \"recover\", etc., while the Epsilon reporters \"assess\", determine \"active\" vs. \"Inactive\" status, attribute satellite",
        "•programs• and \"maintenance\" of such programs, etc., to the Deltas.",
        "Although the detailed Implementation of some of those notions remains to be worked out – In particular, the Interfaces with the Active/Introspective Information System – we expect that the essentials of the analytical approach discussed In this paper will be demonstrable on the MATRES teethed toward the end of 1983."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
