{
  "info": {
    "authors": [
      "Frank Schilder"
    ],
    "book": "COLING-ACL",
    "id": "acl-P98-2194",
    "title": "An Underspecified Segmented Discourse Representation Theory (USDRT)",
    "url": "https://aclweb.org/anthology/P98-2194",
    "year": 1998
  },
  "references": [
    "acl-E95-1001",
    "acl-J92-4004"
  ],
  "sections": [
    {
      "heading": "1 Introduction",
      "text": [
        "A theory of discourse interpretation has to deal with a set of problems including anaphora resolution and the hierarchical ordering of discourse structure:",
        "There are two conceivable readings for (1).",
        "Either (a) it refers to the party or (b) Peter only disliked the food.",
        "Discourse grammars like Segmented Discourse Representation Theory (SDRT) offer an explanation for this phenomenon.",
        "SDRT – an extension of DRT (Kamp and Reyle, 1993) – describes a complex propositional structure of Discourse Representation Structures (DRSs) connected via discourse relations.",
        "The hierarchical ordering imposed by relations like narration or elaboration can be used to make predictions about possible attachment sites within the already processed discourse as well as suitable antecedents of anaphora.",
        "The next section discusses the question of whether the SDRT formalisation used for discourse structure should also capture the ambiguities, as expressed in (1), for instance, via an underspecified representation.",
        "Section 3 introduces a tree logic proposed by Kallmeyer called TDG.",
        "Following Schilder (1997), this formalism is employed for the representation of the discourse structure.",
        "Section 4 presents the conjoined version of SDRT and TDG.",
        "This is a novel combination of the discourse grammar and a tree logic indicating the hierarchical discourse structure.",
        "Finally, a USDRT formalisation of the discourse example discussed is given."
      ]
    },
    {
      "heading": "2 From DRT to SDRT",
      "text": [
        "One obvious shortcoming DRT is that it lacks the rhetorical information that structures the text.",
        "This rhetorical information, expressed by discourse relations such as narration or background, has a crucial effect on anaphora resolution, lexical disambiguation, and spatial-temporal information.",
        "SDRT extends DRT in order to amend this insufficiency.",
        "Following Asher (1996) DRSs and SDRSs will be labelled ({Ki , , Kr}).",
        "Formally, an SDRS is recursively defined as a pair of sets containing labelled DRSs or SDRSs, and the discourse relations holding between them.",
        "For the basic case (i.e. (K, 0)) K labels a DRS representing the semantic context of a sentence.",
        "A discourse relation introduces furthermore a hierarchical ordering indicated by a graph representation.",
        "The nodes represent the labelled SDRSs and the edges are discourse relations.",
        "Apart from the discourse relations, which impose a hierarchical ordering, 'topic' relations add more structure to this graph.",
        "If a sentence a is the topic of another sentence 0, this is formalised as a 4).",
        "0•1 This symbol also occurs in the graph, indicating a further SDRS condition.",
        "The graph representation illustrates the hierarchical structure of the discourse and in particular the open attachment site for newly processed sentences.",
        "Basically the constituents on the so-called 'right frontier' of the discourse structure are assumed to be available for further attachment (Webber, 1991).",
        "Assuming a current label (i.e. the one added after processing the last clause/sentence), a notion of A further SDRS condition is Focus Background Pair (FBP) which is introduced by background.",
        "D-Subordination is defined by Asher (1996, P. 24).",
        "Generally speaking, all constituents which dominate the current label are open.",
        "A further restriction is introduced by the term D-Freedom which applies to all labels which are directly dominated by a topic, unless the label assigns the current node.",
        "Formally speaking, this can be phrased as: a label",
        "Note that this in (k5) can refer back either to (a) the entire Shuttle voyage or (b) the launch of the TDRS satellite in (k4).",
        "It can also be shown that this cannot be linked to the start of the shuttle described in (k2).",
        "The hierachical structure of the two first sentences is established by an elaboration relation.",
        "As a consequence, the SDRS labelled by K1 is the topic of K2",
        "K2 } ).",
        "The next sentence (k3) is a comment to the situation described in the preceding sentence.",
        "However, a new constituent K1 has to be introduced into the discourse structure.",
        "This SDRS labelled by Ki subsumes the two DRS s in K2 and K3.",
        "As a side effect, the label K2 within the discourse relation elaboration(Ki, K2) is changed to the newly introduced label K1 and a further edge is introduced between this SDRS and K3.",
        "It has to",
        "ploits discourse relations to establish a hierachical ordering of discourse segments.",
        "A constituent graph indicates the dependencies between the segment, especially highlighting the open attachment points.",
        "How the discourse relations such as narration or elaboration are derived is left to an axiomatic theory called DICE (DIscourse in Commonsense Entailment) that uses a non-montonic logic.",
        "Taking the reader's world knowledge and Gricean-style pragmatic maxims into account, DICE provides a formal theory of discourse attachment.",
        "The main ingredients are defaults describing laws that encode the knowledge we have about the discourse relation and discourse processing.",
        "The following discourse which is similar to example (1) exemplifies how SDRT deals with anaphora resolution within a sequence of sentences (Asher, 1996):",
        "(2) (k 1) After thirty months, America is back in space.",
        "(k2) The shuttle Discovery roared off the pad from Cape Kennedy at 10:38 this morning.",
        "(k3) The craft and crew performed flawlessly.",
        "(k4) Later in the day the TDRS shuttle communication satellite was sucessfully deployed.",
        "(k5) This has given a much needed boost to NASA morale.",
        "2Formally, this is expressed by means of the Comonsense Entailment (CE) (Asher and Morreau, 1991).",
        "be pointed out that this modification of the entire SDRS involves an overwriting of the structure derived so far.",
        "The SDRT update function has to be designed such that these changes are accordingly incorporated.",
        "Note furthermore that the introduction of an additional edge from Ki to K3 is not assigned with a discourse relation.",
        "In order to proceed with the SDRS construction, we have to consider which constituents are available for further attachment.",
        "According to the definition of D-Freedom and D-Subordination, the SDRS labelled by K1, K2 and K3 are still available.3 We derive using DICE that the next sentence (k4) is connected to (k2) via narration.",
        "The resulting constituent graph is shown in figure 3.",
        "A common topic as demanded by Asher (1996, p. 28) does not occur in the graph representation.",
        "Finally, only two attachment sites are left, namely K1 and K4.",
        "The discourse relation result can connect both",
        "SDRSs with the SDRS derived for (k5).",
        "Consequently, two antecedents for the anaphora this can be resolved and the theory predicts two conceivable derivations: One SDRS contains the SDRS labelled by K5 attached to K1, whereas the second conceivable SDRS exhibits K5 connected to K4.",
        "Summing up, the formalism includes the following shortcomings: (a) The representation of an underspecified discourse is not possible in SDRT.",
        "All readings have to be generated.",
        "(b) The formalism is not monotonic.",
        "Updates may overwrite preceed-ing constituents.",
        "As it can be seen from figure 2 a new SDRS K1 substituted K2.4 (c) The constituent graph contains a set of different SDRS conditions (i.e. discourse relations, 4, and FBP).",
        "It is not clear how these different conditions interact and it seems difficult to predict their effect on the discourse structure.",
        "Note that the update on narration requires a common topic which connects the two SDRSs according to the axioms stipulated within SDRT.",
        "However the 4. relation is not shown in the constituent graph.",
        "I will develop further ideas introduced by underspecified semantic formalisms which have been proposed in recent years (e.g. (Reyle, 1995)) in order to provide an underspecified representation for discourse structure.",
        "I will employ a first order tree logic by Kallmeyer (1996) to define an underspecified SDRT, in the following sections."
      ]
    },
    {
      "heading": "3 Tree Descriptions",
      "text": [
        "Tree Description Grammars (TDGs) were inspired by so-called quasi-trees (Vijay-Shanker, 1992).",
        "The grammar formalism is described as a constraint-based TAG-like grammar by Kallmeyer (1996).",
        "The logic used for TDGs is a quantifier-free first order",
        "logic consisting of variables for the nodes, four binary relations and the logical connectives A, V.5",
        "The tree descriptions are formulae in TDGs reflecting the dominance relations between subtrees.",
        "Such formulae have to be negation-free and at least one k E K must dominate all other k' E K. In order to combine two tree descriptions an adjunction operation is used which simply conjoins the two tree descriptions.",
        "Graphically, this operation can take place at the dotted lines indicating the dominance relation (i.e. <s).The straight line describes the parent relation (i).",
        "No adjunction can take place here.",
        "Figure 4 illustrates how the labels 1(1/6 and K;-, and s2 and K/R2 are set to equal respectively.",
        "We are now able to use this tree logic to describe the hierachical ordering within SDRT.",
        "This extends",
        "the original approach, as we are also able to describe ambiguous structures."
      ]
    },
    {
      "heading": "4 Underspecified SDRT (USDRT)",
      "text": [
        "Similar to proposals on underspecified semantic formalisms, the SDRSs are labelled and dominance relations hold between these labels.",
        "Note that also a precedence relation is used to specify the ordering between daughter nodes.",
        "Generally speaking, a discourse relation P provides the link between DRSs or SDRSs.",
        "Similar to the standard SDRT account, this relation has to be derived by considering world knowledge as well as additional discourse knowledge, and is derived within DICE.",
        "I do not consider any changes of the standard theory in this respect.",
        "The structural information, however, is encoded by the tree descriptions as introduced in section 3.",
        "The most general case describing two situations connected by a (not yet known) discourse relation is formalised as shown in figure 5.6 The description formula for",
        "Comparing this representation with the SDRT constituent graph, the following similarities and differences can be observed.",
        "First of all, the question of where the open attachment sites are found is easily observable in the structural restriction given by the",
        "tree description.",
        "Graphically, the open nodes are indicated by the dotted lines.",
        "Secondly, a topic node is introduced, immediately dominating the discourse segment.",
        "No distinction between D-Subordination and D-Freedom has to be made, because the topic is open for further attachment as well.",
        "This is the main change to the discourse structure proposed by Schilder (1997).",
        "This account encodes the topic information in an additional feature called PROMI.",
        "However, it gives no formal definition of this term.",
        "I stick therefore to the topic definition Asher gives.",
        "But instead a uniform treatment of the hierarchical ordering can be given by the tree logic used.",
        "Thirdly, the discourse segment is dominated by the discourse relation that possesses two daughter nodes.",
        "The structure is flexible enough to allow further attachment here.",
        "No overwriting of a derived structure, as for the SDRT account, is necessary.",
        "If a discourse relation is derived, further constraints are imposed on the discourse structure.",
        "Basically, two cases can be distinguished: (a) A subordinating structure is triggered by discourse relations like narration or result.",
        "Consequently, the second situation becomes the topic (i.e. 4-1 : 0) and the precedence relation between 41 and 41 is introduced.",
        "In addition, the open attachment site on the right frontier gets closed (i.e. 41 P.,- K2).",
        "(b) A subordinated structure which comes with discourse relations like elaboration or background contains the first situation as a topic (i.e. K7?-1 : a).",
        "For this structure a precedence relation between K'in.",
        "and Kiln also holds, but instead of the right frontier, the left frontier is closed (i.e. 41 Kr).",
        "Generally speaking, the analysis proposed for (2) follows the SDRT account, especially regarding the derivation of the discourse relations.",
        "The first two sentences are connected via elaboration.",
        "However, the analysis differs with respect to the obtained discourse structure.",
        "Since sentence (kl) (i.e. the semantic content a) is the topic of this text segment",
        "(i.e. (kl) and (k2)), a copy of a ends up in 4-1.",
        "The resulting tree description contains two node pairs where the dominance relation holds, indicated by the dotted line in the graphical representation.",
        "Hence there are two possible attachment sites.",
        "The construction of the discourse sequence continues in the same way until sentence (k5).",
        "The ambiguity for this can be expressed as illustrated in figure 6.",
        "Sentence (k5) (i.e. .95 : E) is connected via result with either KL.",
        ": a (i.e. this refers to the entire voyage in (kl)) or ICL3 (i.e. only the launch of the satellite is referred to by this).",
        "Note furthermore that the latter reading requires that (k5) is an elaboration of (kl).",
        "Thus the USDRT analysis provides an underspecified representation of the discourse structure which covers the two possible readings of (2)."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "I have shown how the SDRT account can be extended by tree descriptions to represent the discourse structure.",
        "The formalism proposed has the following advantages over previous approaches: a uniform description of the hierarchical discourse structure, the ability to express ambiguities within this structure, and the dominance relation specifying the open nodes for further attachment."
      ]
    }
  ]
}
