{
  "info": {
    "authors": [
      "Walter Daelemans"
    ],
    "book": "Workshop on New Methods in Language Processing and Computational Natural Language Learning",
    "id": "acl-W98-1201",
    "title": "Abstraction Is Harmful in Language Learning",
    "url": "https://aclweb.org/anthology/W98-1201",
    "year": 1998
  },
  "references": [
    "acl-P97-1008",
    "acl-W95-0103",
    "acl-W98-1201"
  ],
  "sections": [
    {
      "heading": "CNTS (Center for Dutch Language and Speech) Linguistics",
      "text": []
    },
    {
      "heading": "1. Abstract",
      "text": [
        "The usual approach to learning language processing tasks such as tagging, parsing, grapheme-to-phoneme conversion, pp-attachment, etc., is to extract regularities from training data in the form of decision trees, rules, probabilities or other abstractions.",
        "These representations of regularities are then used to solve new cases of the task.",
        "The individual training examples on which the abstractions were based are discarded (forgotten).",
        "While this approach seems to work well for other application areas of Machine Learning, I will show that there is evidence that it is not the best way to learn language processing tasks.",
        "I will briefly review empirical work in our groups in Antwerp and Tilburg on may language learning.",
        "In this approach (also called, instance-based, case-based, memory-based, and example-based learning), generalization happens at processing time by means of extrapolation from the most similar items in memory to the new item being processed.",
        "Lazy Learning with a simple similarity metric based on information entropy (IB1-IG, Daelemans & van den Bosch, 1992, 1997) consistently outperforms abstracting (greedy) learning techniques such as C5.0 or backprop learning on a broad selection of natural language processing tasks ranging from phonology to semantics.",
        "Our intuitive explanation for this result is that lazy learning techniques keep all training items, whereas greedy approaches lose useful information by forgetting low-frequency or exceptional instances of the task, not covered by the extracted rules or models (Daelemans, 1996).",
        "Apart from the empirical work in Tilburg and Antwerp, a number of recent studies on statistical natural language processing (e.g. Dagan & Lee, 1997; Collins & Brooks, 1995) also suggest that, contrary to common wisdom, forgetting specific training items, even when they represent extremely low-frequency events, is harmful to generalization accuracy.",
        "After reviewing this empirical work briefly, I will report on new results (work in progress in collaboration with van den Bosch and Zavrel), systematically comparing greedy and lazy learning techniques on a number of benchmark natural language processing tasks: tagging, grapheme-to-phoneme conversion, and pp-attachment.",
        "The results show that forgetting individual training items, however 'improbable' they may be, is indeed harmful.",
        "Furthermore, they show that combining lazy learning with training set editing techniques (based on typicality and other regularity criteria) also leads to worse generalization results.",
        "I will conclude that forgetting, either by abstracting from the training data or by editing exceptional training items in lazy learning is harmful to generalization accuracy, and will attempt to provide an explanation for these unexpected results."
      ]
    },
    {
      "heading": "2. References",
      "text": []
    }
  ]
}
