{
  "info": {
    "authors": [
      "Kengo Sato",
      "Masakazu Nakanishi"
    ],
    "book": "COLING-ACL",
    "id": "acl-P98-2191",
    "title": "Maximum Entropy Model Learning of the Translation Rules",
    "url": "https://aclweb.org/anthology/P98-2191",
    "year": 1998
  },
  "references": [
    "acl-A97-1004",
    "acl-C96-1006",
    "acl-J93-1006",
    "acl-J96-1002",
    "acl-W97-0123",
    "acl-W97-0301"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper proposes a learning method of translation rules from parallel corpora.",
        "This method applies the maximum entropy principle to a probabilistic model of translation rules.",
        "First, we define feature functions which express statistical properties of this model.",
        "Next, in order to optimize the model, the system iterates following steps: (1) selects a feature function which maximizes log-likelihood, and (2) adds this function to the model incrementally.",
        "As computational cost associated with this model is too expensive, we propose several methods to suppress the overhead in order to realize the system.",
        "The result shows that it attained 69.54% recall rate."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "A statistical natural language modeling can be viewed as estimating a combinational distribution X x Y 4 [0, 1] using training data yi), • • • , (xT, YT) E X. x Y observed in corpora.",
        "For this topic, Baum (1972) proposed EM algorithm, which was basis of Forward-Backward algorithm for the hidden Markov model (HMM) and Inside-Outside algorithm (Lafferty, 1993) for the probabilistic context free grammar (PCFG).",
        "However, these methods have problems such as increasing optimization costs which is due to a lot of parameters.",
        "Therefore, estimating a natural language model based on the maximum entropy (ME) method (Pietra et al., 1995; Berger et al., 1996) has been highlighted recently.",
        "On the other hand, dictionaries for multilingual natural language processing such as the machine translation has been made by human hand usually.",
        "However, since this work requires a great deal of labor and it is difficult to keep description of dictionaries consistent, the researches of automatical dictionaries making for machine translation (translation rules) from corpora become active recently (Kay and R8schesen, 1993; Kaji and Aizono, 1996).",
        "In this paper, we notice that estimating a language model based on ME method is suitable for learning the translation rules, and propose several methods to resolve problems in adapting ME method to learning the translation rules."
      ]
    },
    {
      "heading": "2 Problem Setting",
      "text": [
        "If there exist (x1, y1), (XT, YT) EX xY such that each xi is translated into yi in the parallel corpora X, Y, then its empirical probability distribution 13 obtained from observed training data is defined by:",
        "where c(x, y) is the number of times that x is translated into y in the training data.",
        "However, since it is difficult to observe translating between words actually, c(x, y) is approximated with equation (2) for sentence aligned parallel corpora.",
        "where Xi is i-th sentence in X.",
        "We denote that sentence Xi is translated into sentence Yi in aligned parallel corpora.",
        "And cii(x, y)",
        "is the number of times that x and y appear in the i-th sentence.",
        "Our task is to learn the translation rules by estimating probability distribution p(y1x) that x E X is translated into y E Y from f)(x, y) given above."
      ]
    },
    {
      "heading": "3 Maximum Entropy Method",
      "text": []
    },
    {
      "heading": "3.1 Feature Function",
      "text": [
        "We define binary-valued indicator function f :X xY {0,1} which divide X x Y into two subsets.",
        "This is called feature function, which expresses statistical properties of a language model.",
        "The expected value of f with respected to",
        "Thus training data are summarized as the expected value of feature function f. The expected value of a feature function f with respected to p(y1x) which we would like to estimate is defined such as:",
        "where 23(x) is the empirical probability distribution on X.",
        "Then, the model which we would like to estimate is under constraint to satisfy an equation such as:"
      ]
    },
    {
      "heading": "3.2 Maximum Entropy Principle",
      "text": [
        "When there are feature functions fi(i E {1,2, , n}) which are important to modeling processes, the distribution p we estimate should be included in a set of distributions defined such as:",
        "where P is a set of all possible distributions on X x Y.",
        "For the distribution p, there is no assumption except equation (6), so it is reasonable that the most uniform distribution is the most suitable for the training corpora.",
        "The conditional entropy defined in equation (7) is used as the mathematical measure of the uniformity of a conditional probability",
        "That is, the model p* which maximizes the entropy H should be selected from C.",
        "This heuristic is called the maximum entropy principle."
      ]
    },
    {
      "heading": "3.3 Parameter Estimation",
      "text": [
        "In simple cases, we can find the solution to the equation (8) analytically.",
        "Unfortunately, there is no analytical solution in general cases, and we need a numerical algorithm to find the solution.",
        "By applying the Lagrange multiplier to equation (7), we can introduce the parametric form of p.",
        "where each Ai is the parameter for the feature ft. pA is known as Gibbs distribution.",
        "Then, to solve p* C in equation (8) is equivalent to solve A* that maximize the log-likelihood:",
        "Such A* can be solved by one of the numerical algorithm called the Improved Iterative Scaling Algorithm (Berger et al., 1996).",
        "1.",
        "Start with Ai = 0 for all i E {1,2, , n} 2.",
        "Do for each i E {1,2, , n}: (9)",
        "where f*(x,y)=E'L fi(x,y)",
        "(b) Update the value of Ai according to: 3.",
        "Go to step 2 if not all the Ai have converged",
        "To solve LA i in the step (2a), the Newton's method is applied to equation (11)."
      ]
    },
    {
      "heading": "3.4 Feature Selection",
      "text": [
        "In general cases, there exist a large collection of candidate features, and because of the limit of machine resources, we cannot expect to obtain all PM estimated in real-life.",
        "However, the Maximum Entropy Principle does not explicitly state how to select those particular constraints.",
        "We build a subset S C .F incrementally by iterating to adjoin a feature f E .7 which maximizes log-likelihood of the model to S. This algorithm is called the Basic Feature Selection (Berger et al., 1996).",
        "1.",
        "Start with S = 0 2.",
        "Do for each candidate feature f E Compute the model psuf using Improve Iterative Scaling Algorithm and the gain in the log-likelihood from adding this feature 3.",
        "Check the termination condition 4.",
        "Select the feature f with maximal gain 5.",
        "Adjoin f to S 6.",
        "Compute Ps using Improve Iterative Algorithm 7.",
        "Go to Step 2"
      ]
    },
    {
      "heading": "4 Maximum Entropy Model",
      "text": []
    },
    {
      "heading": "Learning of the Translation Rules",
      "text": [
        "The art of modeling with the maximum entropy method is to define an informative set of computationally feasible feature functions.",
        "In this section, we define two models of feature functions for learning the translation rules."
      ]
    },
    {
      "heading": "Model 1: Co-occurrence Information",
      "text": [
        "The first model is defined with co-occurrence information between words appeared in the corpus X.",
        "where W(d,w) is a set of words which appeared within d words from w E X (in our experiments, d = 5).",
        "fw(x, y) expresses the information on w for predicting that x is translated into y (Figure 1).",
        "The second model is defined with morphological information such as part-of-speech.",
        "where POS(x) is a part-of-speech tag for x. ft,u(x, y) expresses the information on part-of-speech t, s for predicting that x is translated into y (Figure 2).",
        "If part-of-speech tag",
        "gers for each language work extremely accurate, then these feature functions can be generated automatically."
      ]
    },
    {
      "heading": "5 Implementation",
      "text": [
        "Computational cost associated with the model described above is too expensive to realize the system for learning the translation rules.",
        "We propose several methods to suppress the overhead.",
        "An estimated probability pA(y1x) for a pair of (x, y) E X x Y which has not been observed as the sample data in the parallel corpora X, Y should be kept lower.",
        "According to equation (9), we can allow to let fi(x, y) = 0 (for all i E {1, , n}) for non-observed (x, y).",
        "Therefore, we will accept observed (x, y) only instead of all possible (x, y) in summation in equation (11), so that pA(y1x) can be calculated much more efficiently.",
        "Suppose that a set of (x, y) such that each member activates a feature function f is defined by:",
        "Shirai et al.",
        "(1996) showed that if D(f2) and D(f3) were exclusive to each other, that is D(f2) n D(fi) = 0, then Ai and Ai could be estimated independently.",
        "Therefore, we can split a set of candidate feature functions .F into several exclusive subsets, and calculate pA(ylx) more efficiently by estimating on each subset independently."
      ]
    },
    {
      "heading": "6 Experiments and Results",
      "text": [
        "As the training corpora, we used 6,057 pairs of sentences included in Kodansya Japanese-English Dictionary, a machine-readable dictionary made by the Electrotechnical Laboratory.",
        "By applying morphological analysis for the corpora, each word was transformed to the infinitive form.",
        "We excluded words which appeared below 3 times or over 1,000 times from the target of learning.",
        "Consequently, our target for the experiments included 1,375 English words and 1,195 Japanese words, and we prepared 1,375 feature functions for model 1 and 2,744 for model 2 (56 part-of-speech for English and 49 part-of-speech for Japanese).",
        "We tried to learn the translation rules from English to Japanese.",
        "We had two experiments: one of model 1 as the set of feature functions, and one of model 1 + 2.",
        "For each experiment, 500 feature functions were selected according to the feature selection algorithm described in section 3.4, and we calculated p(y1x) in equation (9), that is, the probability that English word x is translated into Japanese word y.",
        "For each English word, all Japanese word were ordered by estimated probability p(y1x), and we evaluated the recall rates by comparing the dictionary.",
        "Table 1 shows the recall rates for each experiment.",
        "The numbers for 13(x, y) are the 1st , 3rd •-- 10th ii(x, y) 44.55% 53.47% 58.42% model 1 41.58% 63.37% 76.24% model 1 + 2 58.29% 69.54% 80.13% recall rates when the empirical probability defined by equation (1) was used instead of the estimated probability.",
        "It is showed that the model 1 + 2 attains higher recall rates than the model 1 and .73(x, y).",
        "Figure 3 shows the log-likelihood for each model plotted by the number of feature functions in the feature selection algorithm.",
        "Notice that the log-likelihood for the model 1+2 is always higher than the model 1.",
        "Thus, the model 1 + 2 is more effective than the model 1 for learning the translation rules.",
        "However, the result shows that the recall",
        "rates of the '1st' for all models are not favorable.",
        "We consider that it is the reason for this to assume word-to-word translation rules implicitly."
      ]
    },
    {
      "heading": "7 Conclusions",
      "text": [
        "We have described an approach to learn the translation rules from parallel corpora based on the maximum entropy method.",
        "As feature functions, we have defined two models, one with co-occurrence information and the other with morphological information.",
        "As computational cost associated with this method is too expensive, we have proposed several methods to suppress the overhead in order to realize the system.",
        "We had experiments for each model of features, and the result showed the effectiveness of this method, especially for the model of features with co-occurrence and morphological information."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We would like to thank the Electrotechni-cal Laboratory for giving us the machine-readable dictionary which was used as the training data."
      ]
    }
  ]
}
