{
  "info": {
    "authors": [
      "Nerea Ezeiza",
      "Iñaki Alegria",
      "Jose Maria Arriola",
      "Ruben Urizar",
      "Itziar Aduriz"
    ],
    "book": "COLING-ACL",
    "id": "acl-P98-1062",
    "title": "Combining Stochastic and Rule-Based Methods for Disambiguation in Agglutinative Languages",
    "url": "https://aclweb.org/anthology/P98-1062",
    "year": 1998
  },
  "references": [],
  "sections": [
    {
      "heading": "Laburpena",
      "text": [
        "Artilculu honetan metodo estokastiko eta erregeletan oinarritutako metodoen arteko konbinaketa euskarari aplikatzearen emaitzak aurkeztuko ditugu.Desanbiguazioan erabilitako metodoak Murrizpen Gramatika (CG) eta MULTEXT proiektuak garatutako 1--IMMn oinarritutako etiketatzailea dira.",
        "Euskara hizkuntza eranskaria izaki, hitz balcoitzari dagozkion irakurketa guztiak esleitzeko analizatzaile morfologikoa beharrezkoa da.",
        "Ondoren, CO erregelak informazio morfologiko guztiari aplikatzen zaizkio eta prozesu honek testuen anbiguotasuna gutxitzen du.",
        "Azkenik, geratutako etilceten artean balcarra hautatzeko MULTEXT proiektuko tresnak erabiltzen dira.",
        "Metodo estokastikoa soilik erabiltzean, errore-tasa %14 ingurukoa da, baina etiketatzailearen doitasuna hitz ezezagunekin lexikoa aberastuz gero %2 hobe daitekeen arren.",
        "Metodo biak konbinatzen direnean, berriz, prozesu osoaren errore-tasa %3.5ekoa da.",
        "Ikasketarako corpusa nahikoa txikia dela, HMM eredua lehenengo mailalcoa eta euskararako Murrizpen Gramatika oraindik ere garapen prozesuan dagoela kontuan izanik, gure ustez metodo konbinatu hau erabilita emaitza onak lor daitezke eta beste hizkuntza eranskarietarako bereziki egokia izan daiteke."
      ]
    },
    {
      "heading": "Resum",
      "text": [
        "En aquest article presentem els resultats de la combinaci6 de mêtodes estocastics i basats en regles aplicats a la desambiguaciO morfosintâctica de l'euskara.",
        "Els metodes utilitzats per a la desambiguaciO son: les Gramatiques de Restriccions (CG) i l'etiquetador basat en HMM del projecte MULTEXT.",
        "El caracter aglutinant de l'euskara fa necessari la utilitzaci6 d'un analitzador morfolOgic per assignar a cada paraula totes les seves interpretacions.",
        "Les regles de CO s'apliquen utilitzant la informaci6 morfolOgica completa i aquest proces redueix parcialment l'ambigiiitat dels textos.",
        "A continuaciO, s'apliquen les eines de MULTEXT per escollir una Unica etiqueta.",
        "Utilitzant nomes el mêtode estocistic la taxa d'error es aproximadament del 14%, encara que la precisi6 de l'etiquetador es pot incrementar en un 2% utilitzant les paraules desconegudes per enriquir el lêxic.",
        "En canvi, la combinaci6 d'ambdOs mêtodes permet reduir l'error fins al 3.5%.",
        "Tenint en compte que el corpus d'aprenentatge es bastant petit, que el model HMM es de primer ordre i que la Gramkica de Restriccions de l'euskara esti encara en fase de desenvolupament, creiem que els resultats del mêtode combinat son bons i que la combinaci6 de mêtodes es especialment adequada per a llengiies aglutinants."
      ]
    },
    {
      "heading": "Resumen",
      "text": [
        "En este articulo presentamos los resultados de la combinaciOn de metodos estocisticos y basados en reglas aplicados al euskara.",
        "Los mdtodos utilizados para la desambiguaciOn son las Gramaticas de Restricciones (CG) y el etiquetador basado en HMM del proyecto MULTEXT.",
        "Siendo el euskara una lengua aglutinante, seri necesario un analizador morfolOgico para asignar a cada palabra todas sus interpretaciones.",
        "A continuaciOn se aplican las reglas de CG utilizando toda la informaci6n morfolOgica y este proceso disminuye la ambigiiedad de los textos.",
        "Por Ultimo, las herramientas de MULTEXT escogerin una Unica etiqueta.",
        "Utilizando Unicamente el metodo estocistico la tasa de error es de alrededor del 14%, aunque la precision del etiquetador puede incrementarse en un 2% utilizando las palabras desconocidas para enriquecer el lexico.",
        "En cambio, combinando ambos metodos la tasa de error del proceso completo es del 3.5%.",
        "Teniendo en cuenta que el corpus de aprendizaje es bastante pequefio, que el modelo HMM es de primer orden y que la Gramitica de RestricciOn del euskara esti dm en fase de desarrollo, creemos el mêtodo combinado obtiene buenos resultados y puede ser adecuado para otras lenguas aglutinantes."
      ]
    }
  ]
}
