{
  "info": {
    "authors": [
      "Huifeng Li",
      "Jong-Hyeok Lee",
      "Gary Geunbae Lee"
    ],
    "book": "COLING-ACL",
    "id": "acl-P98-2125",
    "title": "Identifying Syntactic Role of Antecedent in Korean Relative Clause using Corpus and Thesaurus Informationes",
    "url": "https://aclweb.org/anthology/P98-2125",
    "year": 1998
  },
  "references": [
    "acl-J93-1007"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper describes an approach to identifying the syntactic role of an antecedent in a Korean relative clause, which is essential to structural disambiguation and semantic analysis.",
        "In a learning phase, linguistic knowledge such as conceptual co-occurrence patterns and syntactic role distribution of antecedents is extracted from a large-scale corpus.",
        "Then, in an application phase, the extracted knowledge is applied in determining the correct syntactic role of an antecedent in relative clauses.",
        "Unlike previous research based on co-occurrence patterns at the lexical level, we represent co-occurrence patterns with concept types in a thesaurus.",
        "In an experiment, the proposed method showed a high accuracy rate of 90.4% in resolving ambiguities of syntactic role determination of antecedents."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "A relative clause is the one that modifies an antecedent in a sentence.",
        "To determine the syntactic role of the antecedent in a verb argument structure of relative clause is important in parsing and structural disambiguation(Li et al., 1998).",
        "While applying case frames of a verb for structural disambiguation, identifying the role of antecedent will affect the correctness of structural disambiguation impressively.",
        "In this paper, we will describe a method of identifying the syntactic role of antecedents, which consists of two phases.",
        "First, in the learning phase, conceptual patterns (CPs) and syntactic role distribution of antecedents are extracted from a corpus of 6 million words, the Korean Language Information Base (KLIB).",
        "The conceptual patterns reflect the possible case restriction of a verb with concept types, while the syntactic role distribution shows the preference of syntactic role of antecedents of a verb.",
        "Second, in the application phase, the syntactic role of an antecedent is decided using CPs and the syntactic role distribution.",
        "In regards to the rest of this paper, Section 2 will review the problems and related work.",
        "Section 3 will describe a statistical approach of conceptual pattern extraction from a large corpus as knowledge for determining syntactic roles.",
        "Section 4 will describe how to identify syntactic roles using conceptual patterns and syntactic role distribution of antecedents in the corpus.",
        "Section 5 will then present an experimental evaluation of the method.",
        "The last section makes a conclusion with some discussion.",
        "The Yale Romanization is used to represent Korean expressions."
      ]
    },
    {
      "heading": "2 Problems and Related Work",
      "text": [
        "In English, it is possible to recognize the syntactic role of antecedents by their position (trace) in relative clauses and the valency information of verbs.",
        "For example, the syntactic role of an antecedent man can be recognized as subject of the relative clause in a sentence \"He is the man who lives next door\" and as object in a sentence \"He is the man whom I met.\" The relative pronouns such as who, whom, that, whose, and which can also be used in identifying the role of antecedents in relative clauses.",
        "However, it is not a trivial work to identify the syntactic role of antecedents in Korean relative clauses.",
        "Korean is such a head final language that the antecedent comes after the relative clause.",
        "The rest of this section will describe three main characteristics of Korean relative clauses that make it difficult to determine the syntactic role of their antecedents.",
        "The first characteristic is that unlike English, Korean lacks relative words corresponding to English",
        "relative pronouns.",
        "Instead, an adnominal verb ending follows its verb stem of a relative clause modifying an antecedent.",
        "The adnominal verb ending does not provide any information about the syntactic role of antecedent.",
        "For example, the relative clause kang-eyse hulu- (flow in a river) in sentence (1) modifies the antecedent mtvu/- (water), while adnominal verb ending - nun provides no clue about the syntactic role of the antecedent mw.u/ (water).",
        "Figure 1 shows the syntactic dependency tree (SDT) of sentence (1).",
        "We need to decide the syntactic role of the antecedent mwu/- (water) in the argument structure of the verb hulu- (flow) when applying case frames of the verb for structural disambiguation.",
        "The dependency parser (Lee, 1995) only gives the syntactic relation mod between them, which should be regarded as subject in the relative clause.",
        "As the second characteristic, the syntactic role of an antecedent cannot be determined by word order.",
        "This is because Korean is a relatively free word-order language like Japanese, Russian, or Finnish, and also because some arguments of a verb may be frequently omitted.",
        "In sentence (2), for example, the verb of relative clause nolay-lul pwulless-ten (where [I] sang a song [at the place]) have two arguments [I] and [place] omitted.",
        "Thus, the antecedent kos-(place) might be identified as subject or adverbial in the relative clause.",
        "(2) nolay-lul pwulless-ten kos-ey na-nun kass-ta.",
        "(I went to the place where [I] sang a song [at the place].)",
        "The third characteristic of Korean relative clauses is that the case particle of an antecedent, that indicates the syntactic role in the relative clause, is omitted during relativization.",
        "In fact, in a relatively free-word order language, the case particles are very important to the syntactic role determination.",
        "Due to lack of syntactic clues, it is very difficult to construct general rules for identifying the syntactic role of antecendents.",
        "Thus, the corpus-based method has been prefered to the rule-based one in solving the problem of syntactic role determination in Korean relative clauses.",
        "Yang and Kim (1993) proposed a corpus-based method, where, for each noun/verb pair, its word co-occurrence and sub-categorization scores are extracted at lexical level.",
        "Park and Kim (1997) described a method of semantic role determination of antecedents using verbal patterns and statistic information from a corpus.",
        "These word co-occurrence patterns are all at lexical-level, so we have to construct a large amount of word co-occurrence patterns and statistical information before applying to a real large-scale problem.",
        "Actually, the system performance mainly relies on the domain of application, the number of word co-occurrence patterns extracted, and the size of corpus.",
        "In the following sections, we will describe an approach to acquiring statistical information at conceptual level rather than at lexical level from a corpus using conceptual hierarchy in the Kadokawa thesaurus titled New Synonym Dictionary (Ohno and Hamanishi, 1981), and also describe a method of syntactic role determination using the extracted knowledge.",
        "The system architecture is shown in Figure 2."
      ]
    },
    {
      "heading": "3 Extraction of Statistic Information from Corpus",
      "text": [
        "First, for each of 100 verbs selected by order of frequency in the KLIB (Korean Language Information Base) corpus of 6 million words, its syntactic relational patterns (SRPs) of the form (Noun, Syntactic relation, Verb) are extracted from the corpus.",
        "Then, the nominal words in the SRPs are substituted with their corresponding concept codes at level 4 of the Kadokawa thesaurus.",
        "A nominal word may have multiple meanings such as C1, C2, ..., C. However, since we cannot determine which meaning of the nominal word is used in a SRP, we uniformly add to the frequency of each concept code.",
        "Through this processing, the syntactic relational pattern (SRP) changes into the conceptual frequency pattern (CFP), ({ < C1, Ii > , < C2,12 >, •••,< Cm, fm >}, SRJ,Vk), where C, represents a concept code at level four of the Kadokawa thesaurus, ft indicates the frequency of the code C, and SR3 shows a syntactic relation between these concept codes and verb Vk.",
        "These patterns are then generalized by a concept type filter into more abstract conceptual patterns (CPs), MCI, C2, ..., SR3, Vk)11 < j < 5, 1 < k < 1001.",
        "Unlike in CFPs, the concept code in the more generalized CPs may be not only at level four (denoted as L4), but also at level three (L3) and two (L2).",
        "In addition to the CPs, we also extract the syntactic role distributiion of antecedents."
      ]
    },
    {
      "heading": "3.1 Retrieving Syntactic Relational Patterns from Corpus",
      "text": [
        "Unlike the conventional parsing problem whose main goal is to completely analyze a whole sentence, the extraction of syntactic relational patterns (SRPs) aims to partially analyze sentences and thus to get the syntactic relations between nominals and verbs.",
        "For this, we designed a partial parser, the analysis result of which is obviously not as precise as that of a full-parser.",
        "However, it can provide much useful information.",
        "For the set of 100 verbs, a total of 282,216 syntactic relational patterns (SRPs) was extracted from the KLIB corpus.",
        "During the generalization step, the problematic patterns are filtered out.",
        "In Korean, the syntactic relation of nominal words toward a verb is mainly determined by case particles.",
        "During the extraction of SRPs (Ni, SR3, Vk), we only consider the syntactic relation SR3s determined by 5 types of case particles: nominative (-i/ka/kkeyse), accusative (-u///u/), and three adverbial (-ey/eynun, - se/eyse/eysenun, -lo/ulo/ulonun)."
      ]
    },
    {
      "heading": "3.2 Conceptual Pattern Extraction 3.2.1 Thesaurus Hierarchy",
      "text": [
        "For the purpose of type generalization of nominal words in SRPs, the Kadokawa thesaurus titled New Synonym Dictionary (Ohno and Hamanishi, 1981) is used, which has a four-level hierarchy with about 1,000 semantic classes.",
        "Each class of upper three levels is further divided into 10 subclasses, and is encoded with a unique number.",
        "For example, the class 'stationary' at level three is encoded with the number 96 and classified into ten subclasses, Figure 3 shows the structure of the Kadokawa thesaurus.",
        "To assign the concept code of Kadokawa thesaurus to Korean words, we take advantage of the existing Japanese-Korean bilingual dictionary (JKBD) that was developed for a Japanese-Korean MT system called COBALT-J/K.",
        "The bilingual dictionary contains more than 120,000 words, the meaning of which is encoded with the concept codes that are at level four in the Kadokawa thesaurus.",
        "Thus, Korean words in the SRPs are automatically assigned their corresponding concept codes of level four through JKBD."
      ]
    },
    {
      "heading": "3.2.2 Principle of Generalization",
      "text": [
        "We encoded the nouns in SRPs extracted by the parser with concept codes from the Kadokawa thesaurus, and examined histograms of the frequency of concept codes.",
        "We observed that the frequency of codes for different syntactic relations of a verb showed very different distribution shapes.",
        "This means that we could use the distribution of concept codes, together with their frequencies as clues for conceptual pattern ex",
        "traction.",
        "From the histograms of codes of both subject and object relational patterns for the verb ttena-ta (leave), we observed that concept codes about human (codes from 500 to 599) appear most frequently in the role of subject, and codes of position (from 100 to 109), codes of place (from 700 to 709) and codes of building (from 940 to 949) appear most often in the role of object.",
        "For each verb Vk, we first analyzed the co-occurrence frequencies f, of concept codes Ci of noun N, and then computed an average frequency fave,t and standard deviation at around f avert) at level t (denoted as Lt) of the concept hierarchy.",
        "We then replaced fi with its associated z-score kf,t.",
        "kf,t is the strength of code frequency f at Lt, and represents the standard deviation above the average of frequency f J ave,E • Referring to Smadja's definition (Smadja, 1993), the standard deviation at at Li and strength kf,t of the code frequencies are defined as shown in formulas 1 and 2.",
        "where fi,t is the frequency of concept code C, at Lt of Kadokawa thesaurus, f ., aye,/ is the average frequency of codes at Lt, nt is the number of concept codes at Li."
      ]
    },
    {
      "heading": "3.2.3 Code Generalization",
      "text": [
        "The standard deviation at at Lt characterizes the shape of the distribution of code frequen",
        "cies.",
        "If at is small, then the shape of the histogram will tend to be flat, which means that each concept code can be used equally as an argument of a verb with syntactic role SR,.",
        "If at is large, it means that there is one or more codes that tend to be peaks in the histogram, and the corresponding nouns for these concept codes are likely to be used as arguments of a verb.",
        "The filter in our system selects the patterns that have a variation larger than threshold ao,t, and pulls out the concept codes that have a strength of frequency larger than threshold ko,t.",
        "If the value of the variation is small, than we can assume there is no peak frequency for the nouns.",
        "The patterns that are produced by the filter should represent the concept types of extracted words that appear most frequently as syntactic role SR, with verb Vk.",
        "We later analyzed the distribution of frequency f, in CFP.is to produce an average frequency avef,t and standard deviation J at.",
        "Through experimentation, we decided the threshold of standard deviation a-0,t and strength of frequency kore as shown in Table 1.",
        "The lower the value of threshold ko,t is assigned, the more concept codes can be extracted as conceptual patterns from the CFPs.",
        "We maintained a balance between extracting conceptual codes at low levels of the conceptual hierarchy for the specific usage of concept type and extracting general concept types for enhancing overall system performance.",
        "These values may be variable in different application.",
        "In Table 2, we enlist the concept types that have more than 5 appearances in the CFP of verb ttena-ta (leave).",
        "The strength of frequencies for generalization is calculated with formula 2.",
        "• No.",
        "of codes: 04 = 932 • Average freq.",
        "fave,4 = 932/1000 = 0.932 • Standard deviation: at = 2.821530 * 'other' in the table means the total freq.",
        "of nouns less than 5 • The numbers in brackets are the frequencies of code appearance",
        "Since the value of k0,4 is set at 4.0, as shown in Table 1, the concept codes with frequencies of more than 13, as the equation for k14,4 shows, are selected as generalized concept types at L4.",
        "After abstraction at L4, the system performs generalization at L3.",
        "It removes selected frequencies, such as frequency 14 of code 411 in Table 2, and sums up the frequencies of the remaining concept codes to form the frequency of higher level group.",
        "For example, the system removes the frequency for code 411 from the group {410(12), 411(14), 412(3), 413(0), 414(0), 415(0), 416(1), 417(0), 418(0), 419(0)}, then sums up the frequencies of the remaining codes for a more abstract code of 41.",
        "The frequency of code 41 then becomes 16.",
        "Through this process, the system performs a generalization at L3 for the more abstract types of the concept.",
        "The system calculates at and strength Kf,t, selects the most promising codes, and stores conceptual patterns ({Ci, C2, C3, ...}, S Rj,Vk) as the knowledge source for syntactic role determination in real texts, where concept type C, is created by the generalization procedure.",
        "After generalization of the CFP patterns for the subject role of the verb ttena-ta (leave), the produced conceptual patterns are: (1411, 430, 500, ..., 06, 11, ..., 99, 11, subj, ttena-ta)."
      ]
    },
    {
      "heading": "3.3 Syntactic Role Distribution of Antecedents",
      "text": [
        "In (Yang et al., 1993), they defined subcatego-rization score (SS) of a verb considering the verb argument structure in a corpus.",
        "They asserted that the SS of a verb represents how likely a verb might have a specific grammatical complement.",
        "We observed from analyzing the corpus that we cannot infer the syntactic roles of antecedents from subcategorization scores since the syntactic role distribution of verb arguments in a corpus is so different from the syntactic role distribution of antecedents due to the property of free word language.",
        "In Korean, an argument of a verb could be omitted, and so the subcat-egorization score don't provide possible trend of the role of antecedent in many cases.",
        "For example, 26.8% of arguments of the verb ttena-ta (leave) are used as subjects, and 54.4% are used as objects, but 74.41% of antecedents of the verb are of subject role, and 6.9% are of object role.",
        "Although the distribution of antecedents is necessary to our task, we cannot automatically retrieve the syntactic role distribution of them from the corpus.",
        "We extracted relative clauses for specific verbs from the corpus, and then counted the number of syntactic roles of the antecedents manually by language trained people.",
        "Since there are about 200 to 500 relative clauses for each verb in the corpus, it is possible to check this information.",
        "This information is represented by relative score RSk(SRi) of syntactic role SRi for antecedents of verb Vk as is shown bellow and is used in syntactic role determination as described in section 4:",
        "where freq(Vk) are the frequency of verb Vk of relative clauses, and freqk(SRi) is the frequency of syntactic role SRi of antecedents in relative clauses including verb Vk in the corpus."
      ]
    },
    {
      "heading": "4 Identifying Deep Syntactic Relation",
      "text": [
        "While determining syntactic relation for antecedents of relative clauses, the system checks the argument structure of the verb in a relative clause first, and then records the empty (or omitted) arguments of the verb in relative",
        "clause referring to the verb valency information.",
        "The antecedent that the verb phrase is modifying can be one of these empty arguments.",
        "An antecedent (a noun) usually has one or more meanings, which causes ambiguity in determining the correct syntactic relation between the antecedent and a verb.",
        "We assume that an antecedent has meanings C1, C2, C3, ..., C,, and that CPi is a conceptual pattern ({Pi, P2, ..., Pm},SRi,Vk) corresponding to syntactic relation SR, of verb Vk.",
        "The evaluation score S/Mi(Np, Vk) of an antecedent Np that can be syntactic role SRi with verb Vk is defined as formula 4, and conceptual similarity Csim(C, Pi) between concept C„ and Pi as formula 5.",
        "where MSCA(C,,,,P3) in Csim(C„, Pi) represents the most specific common ancestor (MSCA) of concepts C„ and Pi in the Kadokawa concept hierarchy.",
        "Level(C) refers to the depth of concept Cw from the root node in the concept hierarchy.",
        "Is_a Penalty is a weight factor reflecting that C„ as a descendant of Pi is preferable to other cases.",
        "Conceptual similarity computation with formula 5 is shown in Figure 4.",
        "Based on these definitions, the syntactic relation SRi between antecedent Np and verb Vk can be calculated as follows:",
        "1.",
        "Let R = ISRilSRi is a syntactic relation of an empty (or omitted) argument in the relative clause of Vk, 1 < i < 51.",
        "2.",
        "For each conceptual pattern CPi of verb Vk of which SRi is in R, and for each concept code Pi in CPi, compute S/Mi(Np, Vk)• 3.",
        "Determine the syntactic relation of antecedent Np to SRi on the condition that S/Mi(Np, Vk) has the largest value in {SIM2(Np,Vk)11 < i < 5} and SRi in R.",
        "If two or more S/Mi(Np, Vk) have the same value, decide syntactic role referring to the higher relative score RSk(SRi) of the syntactic role of the verb Vk• Here, syntactic relation can be one of subj, obj, advl, adv2, and adv3.",
        "The symbols adv1, adv2, and adv3 represent adverbs with case particles -ey, -eyse, and -lo, respectively."
      ]
    },
    {
      "heading": "5 Experimental Evaluation",
      "text": [
        "An informal way to evaluate the correctness of syntactic relation determination is to have an expert examine the test patterns and source sentences that the patterns appears, and give his/her judgment about the correctness of the results produced by the system.",
        "In our experiment, the correctness of syntactic and conceptual relation determination was evaluated manually by humans who were well trained in dependency syntax.",
        "As a test set, we extracted 1,772 sentences that included relative clauses for the 100 verbs from 1.5 million word corpora of integrated Korean information base and test books of primary school.",
        "The distribution of syntactic relation of antecedents among them and the test results were shown in Table 3.",
        "There were 1,087 antecedents (61.34%) that were of subject role.",
        "The baseline accuracy of the problem is 61.34%.",
        "That is, if we always select subject role for antecedents, the accuracy will reach 61.34%.",
        "Our system showed 90.4% of accuracy on average in syntactic relation identification, which shows that the conceptual patterns and relative score of syntactic relation produced in the first phase can be a good source for determining the syntactic relation of an antecedent.",
        "Through experiment, we observed several factors that affect the performance of the system.",
        "First, the multiple meanings of a noun will affect the frequency distribution of concept codes.",
        "In our system, we cope with this problem by adjusting the threshold of standard deviation and strength value.",
        "The second problem is the sparseness of corpus domain.",
        "If the corpus for learning is specified as a certain domain, it will greatly increase the validity of conceptual patterns.",
        "If we use a sense tagged corpus in the learning stage, we can achieve high accuracy in syntactic relation determination."
      ]
    },
    {
      "heading": "6 Concluding Remarks",
      "text": [
        "This paper describes an approach for syntactic role determination between an antecedent and a verb in relative clause for semantic analysis.",
        "This method consists of two phases.",
        "In the first phase, the system extracts conceptual patterns and syntactic role distribution of antecedents from a large corpus.",
        "In the second phase, the system applies the extracted conceptual patterns as knowledge in determining correct syntactic relations for structural disambiguation and semantic analysis in MT system for CG generation.",
        "Unlike previous research that calculates statistical information at a lexical level for every pair of words, which may require a lot of space to store resulting patterns, we represent those co-occurrence patterns with concept types of Kadokawa thesaurus.",
        "The problematic concept types are filtered out by the type generalization procedure.",
        "We used a corpus of 6 million words for conceptual pattern extraction.",
        "Our method can cope with the general scope of texts.",
        "In the experiment evaluation, the proposed method showed a high accuracy rate of 90.4% in identifying the syntactic role of antecedents.",
        "The method described in this paper can be used in resolving syntactic role of antecedents in relative clauses of other free word order languages, and can also be used in generating selectional restrictions of case frames of verbs."
      ]
    }
  ]
}
