{
  "info": {
    "authors": [
      "Alistair Knott"
    ],
    "book": "Workshop on Discourse Relations and Discourse Markers",
    "id": "acl-W98-0309",
    "title": "Similarity and Contrast Relations and Inductive Rules",
    "url": "https://aclweb.org/anthology/W98-0309",
    "year": 1998
  },
  "references": [],
  "sections": [
    {
      "heading": "1 Comparisons as coherence relations",
      "text": [
        "This paper considers how comparison relations can be integrated within an RST-like model of discourse.",
        "NVe will consider two relations, SIMILARITY (prototypically signalled by connectives like &so and too) and CONTRAST (prototypically signalled by connectives like whereas and while).",
        "On the face of it.",
        "such relations should be easy to fit within an account like RST's. However, they each exhibit certain id-iosyncracies.",
        "For instance, the CONTRAST relation in RST is unusual in having a multinucleaz structure, rather than the typical nucleus-satellite structure (Mann and Thompson, 1988).",
        "SIMILARITY is unusual in that its associated connectives can apparently violate structural constraints of RST, linking the span in which they appear to structurally inaccessible spans, as in the following text:",
        "(1) I have two brothers.",
        "John is a student: he",
        "majors zn history.",
        "He likes water polo, and he plays the drums.",
        "Bill is at high school.",
        "His main interest is drama.",
        "He also studies history, but he doesn't like it much.",
        "Our suggestion for integrating comparison relations within a model of discourse relations derives from a method of defining relations in terms of presupposed defeasible rules.",
        "This method will be outlined for causal/inferential relations, and then adapted to comparative relations."
      ]
    },
    {
      "heading": "2 Coherence relations and defeasible rules",
      "text": [
        "Several researchers have used defea.sible rules in relation definitions.",
        "In (Oversteegen, 1995) and (Grote et al., 1995), defeasible rules are used for representing the CONCESSION relation.",
        "In (Knott, 1996; Knott and Mellish.",
        "1996), they are used more widely, in the definitions of a whole family of causal and argumentative coherence relations.",
        "We will begin by outlining some aspects of this latter account.",
        "In Knott's account of coherence relations, all relations with a causal or inferential component presuppose a defeasible rule.",
        "For instance, consider the following case: (2) John was tired, so he went to bed.",
        "What information does the coherence relation signalled by so contribute to the text?",
        "It is implausible to suggest that it informs the hearer of a new rule of inference; in fact it seems necessary that the hearer already have the necessary rule to make sense of the text.",
        "A better analysis is that the hearer is being told that this rule of inference succeeds in the situation described.",
        "We can summarise this idea by proposing that a relation of the form P, so Q presupposes a defeasible rule that has P as part of its left-hand side, and Q on its right.",
        "The general framework for presupposed riles is given in Figure 1.. For the present, we interpret the connective – ■ as the defeasible implication > in (Asher and Morreau.",
        "1991)s logic of commonsense entailment.",
        "Note that we have abstracted away from The relation holds between two propositions.",
        "X and Y, It presupposes the existence of a defeasible rule of the form X A P a C.",
        "the simple correspondence between relation and rule assumed above: the mapping between Y, P and C is determined by the values of two further parameters, as explained in Sections 2.1 and 2.2."
      ]
    },
    {
      "heading": "2.1 POSITIVE and NEGATIVE POLARITY",
      "text": [
        "relations One of the parameters we need to specify concerns whether the defeasible rule succeeds or is defeated.",
        "In Example 2, the rule succeeds, as we have seen; but there are also similar cases where a defeasible rule should be analysed as being defeated.",
        "For instance:",
        "(3) John was tired, but he stayed awake.",
        "(We can call this relation a CONCESSION.)",
        "If we treat the success or failure of the presupposed rule",
        "as a parameter to be specified, we can use the same framework to represent both examples.",
        "The parameter can be called POLARITY; The relevant values are given in Figure 2.",
        "The POLARITY parameter maps Y onto a new variable Y'.",
        "In Examples 2 and 3, Y' should be identified with the conclusion C of the presupposed rule, to give the right interpretation.",
        "A case where Y' needs a different binding is given in the next section."
      ]
    },
    {
      "heading": "2.2 UNILATERAL and BILATERAL relations",
      "text": [
        "The final parameter we will consider is called PATTERN OF INSTANTIATION.",
        "This feature is motivated by examples such as the following: (4) John was tired, but there was work to do.",
        "Clearly we do not want to say that this example presupposes a rule allowing inference from John being tired to there being no work to do.",
        "It is preferable to envisage a rule with two conditions in its left-hand side, saying that if John is tired and there is no work to do, he will go to bed.",
        "We can then associate the 1\" value with the second premise.",
        "rather than with the conclusion.",
        "The parameter determining the binding for Y' is given in Figure 3.",
        "Example 4 is then analysed as NEGATIVE POLARITY UNILATERAL, while Example 3 is analysed as NEGATIVE POLARITY BILATERAL.",
        "See (Knott.",
        "1996; Knott and Mellish, 1996) for a more detailed presentation of this framework, along with definitions of several more independent parameters."
      ]
    },
    {
      "heading": "3 Comparisons and expectations",
      "text": [
        "Why might we assume that there is a defeasible rule underlying relations of SIMILARITY and CONTRAST?",
        "An initial piece of evidence comes from contexts such as the following, in which a similarity between two objects in one respect apparently gives rise to an expectation of similarities in other respects.",
        "(5) [JO was made by Richard Page.]",
        "...",
        "This brooch was also made by Richard Page.",
        "But whereas JO was made in 1985, this brooch was made in 1990.",
        "This compare-and-contrast pattern is common in descriptive texts.",
        "We seem to have here a CONCESSION relation (signalled by but), whose satellite is a complex span comprising a SIMILARITY relation, and whose nucleus is a complex span comprising a CONTRAST relation: see Figure 4.",
        "The question is, why",
        "do we have a CONCESSION relation between these two complex spans?",
        "According to the analysis of CONCESSION relations in Section 2.1, the relation must presuppose the existence of a defeasible rule which is being defeated at this point.",
        "What could the rule be in this case?",
        "We would not want to suppose a rule that if an object is made by Page, it is likely to he made in 1990.",
        "Rather, we need a rule that states that if two objects are similar in some respect, they are also similar in other respects."
      ]
    },
    {
      "heading": "4 Comparisons and inductive rules",
      "text": [
        "We propose that a similarity relation should be represented as triggering such a rule.",
        "We suggest that similarity, like other relations, presupposes a defeasible rule; but that the rule in question is inductive in form.",
        "In brief, we suggest that a similarity relation between two propositions be thought of as permitting an inductive rule to fire, while a contrast relation be thought of as preventing an inductive rule from firing.",
        "In Section 4.1 we outline a mechanism for inductive rules, and in Section 4.2 we frame a definition for comparison relations with respect to this mechanism."
      ]
    },
    {
      "heading": "4.1 A meta-level system of inductive rules",
      "text": [
        "We will represent inductive rules as operating at a meta-level on a defeasible first-order logic based on commonsense entailment.",
        "We envisage inductive rules applying as second-order rules, whose conclusions are first-order defeasible rules; when an inductive rule fires.",
        "it results in the addition or alteration of defeasible rules within the first-order system."
      ]
    },
    {
      "heading": "CONCESSION",
      "text": [
        "For the moment, we do not want so describe the workings of this second-order system in any detail; our concern here is really just to consider whether inductive rules might have a role in explaining certain structural properties of comparisons.",
        "Nevertheless, we will propose a rudimentary model of meta-level rules.",
        "The first-order system we propose is identical to commonsense entailment, except that each first-order defeasible rule is associated with a strength, represented by a pair of values sit, where t is the number of times the rule has been triggered and s is the number of times it has succeeded.",
        "A rule only becomes part of the set used in first-order defeasible reasoning if its values for t and sit each reach a certain threshold.",
        "However, rules with values below the threshold can still be used as the preconditions for discourse relations.",
        "We then define a second-order defeasible connective >> to model inductive rules.",
        "An inductive rule has the general form given below:",
        "(6) VP, a,b P(a) A P(b)(A ...) >> (;)",
        "where c evaluates to one or more first-order defea.sible rules.",
        "When a rule is triggered, the t and s values of each of the right-hand side rules are incremented.",
        "We will be using just two inductive rules, which are given in Figure .5.",
        "Rule 7 says that given two objects in class c which are both P. we can increment the strength of the rule that asserts that objects in class c are typically P. Rule 8 says that if two objects have one property P in common, we should increment the strength of all rules that allow us to infer properties of one object on the basis of knowing properties of the other.",
        "4.2 Inductive rules in relation definitions How might we analyse also as presupposing an inductive rule?",
        "The first thing we need is a new parameter for specifying what sort of rule is being presupposed; this is given in Figure 6.",
        "RULE TYPE 1ST-ORDER INDUCTIVE In the presupposed rule, interpreted as >.",
        "In the presupposed rule, is interpreted as >>.",
        "We can then define also as signalling a POSITIVE POLARITY, UNILATERAL and INDUCTIVE relation between the propositions it links.",
        "Here is an example: (9) Brooch B1 is ornate.",
        "(... ) Brooch B2 is also ornate.",
        "According to our model, one of the effects of this relation is to cause the inductive rule 7 to fire, which in turn has the effect of increasing the strength of the generalisation that brooches of the class to which B1 and B2 belong are typically ornate.",
        "This seems a plausible effect, particularly in a descriptive context where a reader/hearer is being informed about objects in an unfamiliar domain.",
        "Now consider a contrast relation, of the kind signalled by whereas.",
        "On our model, this relation would be NEGATIVE POLARITY, UNILATERAL and INDUCTIVE.",
        "Here is an example of such a relation: (10) Brooch B1 is ornate, whereas Brooch 82 is simple.",
        "According to the model, the effect of this relation Is simply to leave the s and t values of the generalisation that 'all brooches of the relevant class are ornate' unchanged.",
        "This is not particularly satisfactory; we might want to make it have a more significant effect, perhaps by increasing only the t value (thereby reducing sit); but as things are currently formulated, changes to the strengths of first-order rules are only possible when an inductive rule fires.",
        "PATTERN OF INSTANTIATION for INDUCTIVE relations We have seen that the POLARITY parameter appears to do useful work for INDUCTIVE relations.",
        "We should now consider whether the PATTEF.N OF INSTANTIATION parameter is productive for INDUCTIVE relations.",
        "Those we have seen so far have all been UNILATERAL.",
        "What might an INDUCTIVE BILATERAL relation look like?",
        "Such a relation would have to hold between two propositions.",
        "one being an individual proposition, and the other being a generalisation for which the individual proposition provided inductive support.",
        "One possibility is that this class of relations are those which can be signalled by the connective indeed.",
        "Consider the following example: (1.1) This jewel is elaborate.",
        "Indeed, most Art-Deco jewels are elaborate.",
        "If we assume that the proposition most Art-Deco jewels are elaborate takes as its semantic value a first-order defeasible rule of the form Vi isa(z.art_deco) > elaborate(x), then it seems that we can describe the relation signalled by indeed as POSITIVE POLARITY.",
        "INDUCTIVE and BILATERA L.1"
      ]
    },
    {
      "heading": "5 Structural consequences of . inductive rules",
      "text": [
        "We will now consider whether the proposed account of comparison relations can help us in accounting for some of their unusual structural characteristics."
      ]
    },
    {
      "heading": "5.1 Compare-and-contrast structures",
      "text": [
        "Firstly.",
        "consider again Example 5.",
        "To recap: what we have here is a pair of comparison relations, apparently linked by a CONCESSION relation, and the difficulty is to explain why the CONCESSION relation applies.",
        "'We can begin to account for this effect by noting that the initial similarity relation between the first two sentences causes Rule 8 to fire as well as Rule 7.",
        "The effect of Rule 8 firing is to add/increment the strength of a whole set of first-order rules allowing inference from JO's possession of a given property to the brooch's possession of that property (and vice versa).",
        "One of these rules allows an inference from the date of manufacture of one Object to that of the other.",
        "The contrast relation in the second sentence provides information that explicitly states that this inference is not permitted.",
        "and must result in the newly-added rule being defeated if consistency is to be preserved.",
        "If we can take this to be a case where Rule S is defeated.",
        "which seems plausible, then we can consider the high-level relation signalled by but to be NEGATIVE POLARITY.",
        "BILATERAL and INDUCTIVE.",
        "thereby subsuming it within a very general account of the contexts where this connective is applicable."
      ]
    },
    {
      "heading": "5.2 Violations of adjacency",
      "text": [
        "Finally, we can consider whether the account of comparisons as presupposing inductive rules pros-ides any way of explaining the violation of adjacency which the similarity relation signalled by also appears to permit.",
        "Our suggestion here is that since the rules presupposed by comparison relations are of a different sort from those presupposed by causal/inferential relations.",
        "it is possible that the theorem-proving systems which search for the inferences that can be drawn from the incoming facts in a discourse are different for the two kinds of rules.",
        "It is uncontroversial that there should be methods for constraining the search for inferences to be drawn.",
        "for both types of rule; in any large system of facts and rules there is an explosion of possible inferences to make.",
        "For causal/inferential relations, we could postulate that the search for inferences is constrained by the compositional structure of the discourse.",
        "and thus influenced by the nucleus-satellite structure of its relations: and that it.",
        "is this which leads to the criterion of adjacency being enforced.",
        "For comparison relations, on the other hand, we could imagine different criteria for constraining the search space: for instance, we could suggest that the search does not take structural prominence into account, but is simply limited to the previous n propositions.",
        "There is no space here to explore this possibility in any detail: however, it seems an interesting one to consider."
      ]
    }
  ]
}
