{
  "info": {
    "authors": [
      "Elke Teich"
    ],
    "book": "Workshop on Processing of Dependency-Based Grammars",
    "id": "acl-W98-0505",
    "title": "Types of Syntagmatic Grammatical Relations and Their Representation",
    "url": "https://aclweb.org/anthology/W98-0505",
    "year": 1998
  },
  "references": [
    "acl-C86-1045",
    "acl-C88-1063",
    "acl-C92-3138",
    "acl-J92-2001",
    "acl-W94-0318"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The paper reviews the kinds of representation of syntagmatic grammatical relations typically employed in grammar models used in computational linguistics.",
        "Exemplars of dependency-only, constituency-only and hybrid constituency-dependency approaches will be considered.",
        "In a move away from the much discussed question 'Constituency or dependency?",
        "', the purpose of the paper is to ask more radically: 'Are constituency and dependency sufficient at all to represent the kinds of syntagmatic patterning we find in language?'",
        "Discussing three problem cases for representation with constituency/dependency - coordinate structure, information structure and agreement, I argue for a more diversified view of syntagmatic structure."
      ]
    },
    {
      "heading": "1 Introduction: the goals of this paper",
      "text": [
        "The paper reviews the kinds of syntagmatic grammatical relations typically acknowledged in grammar models used in computational linguistics and the kinds of means employed for their representation.",
        "The kinds of representation of syntagmatic structure can be broadly classified into three types: dependency, constituency and hybrid constituency/dependency approaches.",
        "Here, the following are considered in particular as representatives of these three types: Word Grammar (Hudson, 1984) (henceforth wc) as an example of dependency approaches, Categorial Grammar (cc) (e.g., (Steed-man, 1985; Steedman, 1987; Uszkoreit, 1986) as an example of constituency approaches, and Head-driven Phrase Structure Grammar (HFsG) (Pollard and Sag, 1987; Pollard and Sag, 1994) as an example of hybrid approaches.",
        "Moving away from the much discussed question 'Constituency or dependency?",
        "', the purpose of the paper is to ask more radically: 'Are constituency and dependency sufficient for representing all the kinds of syntagmatic patterning we find in language?'",
        "Focusing on three problem cases for representation with constituency/dependency – coordinate structure, information structure and syntactic agreement, I argue for a more diversified view of syntagmatic structure.",
        "The paper is organized as follows.",
        "Section 2 reviews some of the main issues in the 'constituency or dependency' debate based on the two positions brought forward in (Zwicky, 1985) and (Hudson, 1987).",
        "Section 3 then asks more generally about the limits of dependency, constituency and hybrid models, discussing coordinate structure as a problem case for dependency approaches and information structure as a problem case for traditional constituency approaches, and presenting agreement as yet another kind of problem case.",
        "Section 4 introduces the view on representating syntagmatic relations subscribed to Systemic Functional Grammar (sFG; cf. (Halliday, 1979; Halliday, 1985; Matthiessen, 1995)), reflected in the 'modes of ex-pression' hypothesis.",
        "I will show that with a functionally diversified model of syntagmatic relations such as the one employed in SFG some of the representational problems of dependency and constituency approaches do not arise.",
        "Section 5 concludes the paper with a summary and some implications for computational representation and processing."
      ]
    },
    {
      "heading": "2 'Constituency or dependency or constituency and dependency?' – A brief revisit",
      "text": [
        "It was shown already quite early in the discussion of constituency vs. dependency that dependency representations and constituency representations are at least wealdy equivalent (Hays, 1964; Gaifman, 1965; Robinson, 1970).",
        "However, the discussion has come up again and again bringing forward a number of arguments for and against dependency-only/ constituency-only and for and against hybrid approaches.",
        "Dependency-only approaches.",
        "Dependency-only approaches (Tesniere, 1959) maintain that it is sufficient to account for the relation between words for a syntactic description to be adequate, the word being the only syntactic unit acknowledged.",
        "Fig",
        "ure 1 shows an example of a syntactic structure resulting from a dependency analysis.",
        "The early arguments put forward against the dependency-only approach in the areas of linear sequencing (e.g., (Baumgartner, 1970)), features and categorization of higher nodes, and headless constructions could be largely dismissed.",
        "Linear order was considered a problem for dependency grammars at a time in the development of grammar theory when in constituency-based grammars sequence was reflected in the surface-syntactic tree.",
        "With removing linear ordering from tree representations and formulating sequencing rules separately, this was no longer considered a problem for dependency grammars (cf. (Matthews, 1981)).",
        "Moreover, higher nodes as domains for rule application have been shown not to be necessary because they can equally well be formulated on words, e.g., gapping rules can be formulated on verbs (Hudson, 1989).",
        "Furthermore, headless constructions can be circumvented, if the notion of category is broadened so that there will be no headless constructions; see e.g., (Hudson, 1980.",
        "194-195).",
        "Characteristic of current dependency approaches like Meaning-Text Models (Nam's; (Mel\"tuk.",
        "1988)) or Word Grammar (Hudson, 1984) is the notion of lexicalization: the descriptive burden is in the lexicon, which carries information that acts as constraint on syntactic structure.",
        "In particular, the notion of valence is often combined with that of dependency by associating valence with heads, whose properties thus become major constraining factors on syntactic structure.",
        "Constituency-only approaches.",
        "At the other extreme is the constituency-only position arguing for heads not being necessary for syntactic description, if constituency relations are accounted for.",
        "For an example of a traditional constituency structure see Figure 2.",
        "Strong arguments for the constituency-only position are brought forward for instance in (Zwicky, 1985).",
        "Zwicky mainly discusses five candidates for the concept of head: the subcategorizand, the semantic argument, the morphosyntactic locus, the determinant of concord, and the constituent determining government.",
        "These notions have to be included in any grammar model, if it is to interface with semantics, the lexicon, and morphology.",
        "However, it should not be necessary to introduce a separate category 'head', unless it can be shown that the head-like notions can be generalized into one category that one could then call 'head'.",
        "Analyzing six syntactic constructions (Det + N, V + NP, Aux + VP, P + NP, NP + VP, and Comp + S), Zwicky shows that the various head-like notions represent different, actually competing, analyses of syntactic structure.",
        "There is identity only between the semantic functor, which he has not listed as a head candidate, the subcategorizand and the governor.",
        "Also, the three additional head-like notions that are considered – two of which are often quoted as providing operational criteria for headship, the distributional equivalent and the obligatory element, the other one representing the head concept of ruler used in dependency grammar – are completely new concepts that do not harmonize with the other five.",
        "In conclusion, a head is not only superfluous, but it would be a completely different additional category whose use for a grammar model is doubtful.",
        "Hybrid constituency/ dependency approaches.",
        "In a reply to (Zwicky, 1985), (Hudson, 1987) arrives at the opposite conclusion.",
        "He argues for a different analysis of Zwicky's sample constructions which reveals that 'head' can be considered a unifying category of most of the head-like notions brought forth by Zwicky.",
        "As an additional head-like notion Hudson puts forward the semantic functor – rather than the semantic argument – because it is the semantic functor, in his view, that must be taken as 'semantically characterizing' (Hudson, 1987, 115).",
        "The semantic argument is thus taken away from the list of candidate heads; and also the determinant of concord is removed because there is no dependency involved in concord, as Hudson maintains.",
        "On the basis of these a priori alterations, Hudson argues that if all the remaining head-like notions were either identical with the semantic functor or not applying, then one could claim that most of the head-like notions are the same category, and that therefore, a generalizing super-category 'head' could be established that embraces them all.",
        "The critical points in (Zwicky, 1985) are removed by Hudson's analysis with no contradictions remaining and he concludes that 'head' is a grammatical category on a par with grammatical functions but more general, allowing generalizations that can oth",
        "erwise not be made (cf. (Hudson, 1987, 131)).",
        "What (Zwicky.",
        "1985) does not realize with his starting point and 'analysis results is that the convergence of semantic functor, subcategorizand, and governor can already be of advantage.",
        "Creating the super-category of head for these converging notions can provide a general category which can actually be used as an anchor for both valence (subcategoriza-tion) and government, as well as for semantic role assignment, thus providing a straightforward way of interfacing semantics and syntax.",
        "The identity of semantic functor, subcategorizand and governor is actually what underlies the notion of head both in NITNI'S as proposed by Meaning Text Theory (NiTT) (Nlel'Clik.",
        "1988).",
        "a dependency model.",
        "and HPSG (Pollard and Sag, 1987), a hybrid model.",
        "In NITNI'S.",
        "government patterns are associated with lexemes that are considered heads in the syntactic zone of the lexicon, covering subcategorization and case government, and act as constraint on syntactic structure.",
        "Similarly, in HPSG, SUBCAT lists are associated with lexemes that are heads and the subcategorization principle takes care of the 'projection' of that information in a phrasal unit.",
        "The concepts of head and dependency had actually been taken up already in early Transformational Grammar, e.g., by (Hays, 1964; Robinson, 1970; Anderson, 1971), and incorporated in the deep structure representation.",
        "Most clearly, however, a concept of head received a special status in X-bar syntax (Chomsky, 1970: Jackendoff, 1977), which has become the phrase structure model underlying many current grammar aproaches.",
        "For example, in Government and Binding (GB) theory, X-bar theory is a subtheory on a par with Binding Theory, Theta Theory, etc., in LFG, c-structure representations are based on X-bar, and also HPsG's syntactic structure representations conform to the X-bar scheme.",
        "For a sample X-bar structure see Figure 3.",
        "Similar to dependency grammars.",
        "X-bar goes together with a strong notion of lexicalization, where syntactic constraints are primarily associated with lexemes or lexical classes and projected to syntactic structure.",
        "Subcategorization and government are surely two essential aspects of a grammatical description on the syntagmatic plane.",
        "There are other aspects to cover, however; two other kinds of syntagmatic patterning that need to be considered in an exhaustive treatment of syntagmatic relations are agreement and word order.",
        "Also, what has not been considered in the Zwicky-Hudson debate are complex syntactic units, such as for example coordinate structures.",
        "These potentially present problems for hierarchical representations such as dependency and constituency, as we will see below in Section 3.",
        "Coordinate structures are in fact a notorious problem for both dependency and constituency approaches, and there are numerous proposals of how to treat them.",
        "Word order, in particular word order variation attributed to information distribution is another notorious problem.",
        "Agreement, while being a well-understood phenomenon, can be a problem for a dependency-only analysis.",
        "Looking at the variety of treatments suggested in these areas, it seems that constituency is hard pressed to accommodate information structure, that the representation of coordinate structure is problematic for both constituency and dependency, and that agreement cannot be described as involving a dependency relation in the strict sense (see Section 3 below).",
        "In the next section these observations are illustrated discussing coordinate structure in Word Grammar (wG) (Hudson, 1984), information structure in Combinatory Categorial Grammar (ccG) (Steedman, 1991) and agreement in Head-Driven Phrase Structure Grammar (HPsG) (Pollard and Sag, 1994)."
      ]
    },
    {
      "heading": "3 Limits of dependency and constituency: Coordinate",
      "text": []
    },
    {
      "heading": "structure, information structure and agreement",
      "text": [
        "In this section I illustrate the problematic nature of hierarchical representations.",
        "such as constituency and dependency, for the representation of coordinate structure, information structure and syntactic agreement.",
        "N lore particularly.",
        "I discuss",
        "• why coordinate structure is a problem for a dependency grammar like WG (Section 3.1), • why CCG.",
        "as an example of constituency-only approaches, works quite well with information structure (Section 3.2), and • why HPSG, a hybrid model, works well for agree-inent (Section 3.3)."
      ]
    },
    {
      "heading": "3.1 Coordinate structure: the limit of dependency in WG",
      "text": [
        "Word grammar (Hudson.",
        "1984; Fraser and Hudson, 1992) strives to account for all grammatical relations by head-dependent relations.",
        "However, there is one type of construction where Hudson concedes the necessity of constituency: this is the coordinate structure, including incomplete conjuncts' as in gapping, reduced conjunct and right-node raising constructions.",
        "While the problem for the majority of constituency-based approaches is how to accommodate the conjunction in the phrase structure representation and how to deal with phrasally incomplete conjuncts, in a dependency grammar the IA conjunct is a component part of a coordinate structure (Hudson, 1984).",
        "problem is that there is no unit acknowledged with which a coordinate structure can be referred to, since conjuncts (and, but, etc) cannot be considered the heads (or dependents) of these constructions.",
        "For coordinate structures, constituency has to be introduced to WG, so that bracketings such as I like ((red apples) and (green plums)) become possible (cf. (Hudson, 1984, 218)).",
        "Hudson thus has to single out the representation of coordinate structure from the rest of the representational apparatus: Dependency is not a possible kind of representation."
      ]
    },
    {
      "heading": "3.2 Information structure in CCG",
      "text": [
        "Information structuring is a problem for traditional constituency approaches because units of information structure often do not coincide with the units established by phrase structure.",
        "For example, a traditional phrase structure for Fred ate the beans would reflect the following bracketing: (Fred) (ate the beans).",
        "which coincides only with one possible information structuring, where Fred is the Given element, but not with an information structure where Fred ate is the Given element (cf. (Steedman, 1991, 274-275)).",
        "The definition of 'Given' used here is that of (Halliday, 1985).",
        "It is that element in clause structure that represents the cotextually or contextually known information.2 See Figure 4 illustrating these two kinds of information structuring.",
        "Fred ate the beans.",
        "(1) What about the beans?",
        "Who ate them?",
        "(Fred) (ate the beans) (2) What about Fred?",
        "What did he eat?",
        "(Fred ate) (the beans)",
        "As (Steedman, 1991) points out, proposals for intonation structure, which is the reflex of information distribution in spoken mode, that try to deal with this divergence either come up with very complex derivations of intonational structure from a surface syntactic structure or they stipulate two autonomous levels of representation.",
        "These have to communicate, however, and the representation is",
        "thus considerably complicated (cf. (Steedman, 1991, 261)).",
        "In Categorial Grammar, constituency groupings other than the ones of traditional PS-markers are possible - including those that are coexistent with information structuring, as shown in the proposal of (Steedman, 1991) using Combinatory Categorial Grammar (ccG).",
        "In CCG a constituent grouping of Fred ate the beans as (Fred ate) (the beans) is thus possible.",
        "opening up the possibility of a unified treatment of information structure and syntactic structure.",
        "Traditional constituency inhibits a formulation of information structuring, in which information structure, and consequently.",
        "intonation structure, and syntactic structure are isomorphic, because it subscribes to one particular kind of constituent grouping."
      ]
    },
    {
      "heading": "3.3 Syntactic agreement in HPSG",
      "text": [
        "Syntactic agreement can be described as involving the sharing of grammatical features across some of the component parts of a syntactic unit.",
        "While for syntactic agreement the domains of agreement are often coexistent with head-dependent domains, it is not necessarily the case that the head is the determinant of concord, nor is it true that it is one set of features that is 'shared' across all the component parts.",
        "Thus, heads cannot simply be equated with determinants of concord.",
        "However, as just pointed out, the domain of agreement is often coexistent with head-dependent groupings.",
        "and agreement can be described based on head-dependent structures.",
        "One such proposal for the German nominal group is made in (Pollard and Sag, 1994).",
        "In terms of agreement relations, the German nominal group (NG) can be briefly characterized as follows: German nouns carry grammatical gender, number and case.",
        "Adjectives are said to carry these features, too, and exhibit three inflectional patterns: weak, strong and mixed.",
        "The choice of inflectional class depends on whether the nominal group contains a definite determiner, a nonspecific or zero determiner, or an indefinite determiner.",
        "Determiners are roughly either definite or indefinite, and they reflect gender, number and case as well.",
        "Agreement is therefore not attributable to the head noun as the source of agreement constraints, but rather, there are several determinants of agreement that affect different grammatical features.",
        "In (Pollard and Sag, 1994), agreement in the German NG is described in the following way.",
        "Case agreement is accounted for by feature (or structure) sharing between a head (the noun, of which CASE is an attribute) and its dependents.",
        "Here, the determinant of concord is coexistent with the head.",
        "This is specified by structure sharing of the CASE attribute between head and dependents, e.g., between the head noun and the determiner: [HEADnoun noun [CASE #1] SUBCAT <DetP[CASE #1]>) Adjectives are described as having GENDER and NUMBER attributes in the CONTENTIINDEX slot and they are structure-shared with the index of the noun that the adjective modifies.",
        "This is accounted for by the general scheme for head-adjunct structures, where the adjunct's MOD value is shared with the head's SYNSENI value.",
        "Furthermore, adjectives, or more precisely adjectival forms, are described as imposing restrictions on the kind of determiner, they can combine with, e.g., forms belonging to the weak inflectional class restrict the determiners they combine with to be of type strong whereas adjectival forms of the strong class require the determiner in the nominal group to be weak or absent.",
        "The sign representing kluge Miidchen (smart girl)",
        "(cf. (Pollard and Sag, 1994, 87)) can thus only combine with the determiner das (definite determiner), but not with em n (indefinite determiner).",
        "This description of agreement in the German nominal group acknowledges several determinants of concord, which conforms to the linguistic observations made about the phenomenon.",
        "The determinant of concord for case is the head noun, for gender and number it is also the head noun, and agreement between adjective and determiner (the relation between selection of type of determiner and type of adjectival form) is interpreted as the type of inflectional class of the adjective selecting the type of determiner, i.e., the adjective is taken as determinant of concord."
      ]
    },
    {
      "heading": "4 A diversified view of syntagmatic relations: SFG",
      "text": [
        "In the preceding section I have tried to illustrate that some kinds of syntagmatic patternings are hard to fit into dependency and constituency representations.",
        "The approaches that do work - like CCG for information structure, and HPSG for agreement, make use of an untraditional notion of phrase structure and a rather flexible notion of dependency, respectively.",
        "Abstracting away from the particular representational means that have been discussed here, constituency and dependency, I now want to point to another way of looking at syntagmatic relations that is not a priori committed to a strict notion of dependency or a traditional notion of phrase structure and is therefore unlikely to encounter the problems dicussed in the preceding section.",
        "This is Systemic Functional Grammar (SF:; (Halliday, 1973: Halliday, 1985)) which is known in computational linguistics foretnostly by application in Natural Language Generation (NLG) (e.g., (Matthiessen and Bateman, 1991; Fawcett • and Tucker, 1989; Bateman et al., 1991; Teich and Bateman, 1994)).",
        "The representational aspect.",
        "of sFC that is most prominent is the system network.",
        "System networks are descriptions of paradigmatic grammatical relations intended as declarative statements of grammatical features and the coocurrence constraints between them.",
        "System networks are like the type hierarchies used in LING in this regard (cf. also (Bateman, 1991: Bateman et al., 1992; Henschel, 1995; Teich, in press)): the grammatical types in SFG, however, are functionally rather than surface-syntactically motivated.",
        "Also.",
        "constraints on syntactic structure are tied to grammatical types, so that one could speak of a 'grammaticized grammar – as opposed to lexi-calized grammars.",
        "In SFG, it is not lexical, but grammatical classes that exhibit constraints on syntactic structure.",
        "Because syntactic structure is one of the less prominent topics in NLG and because sFG is primarily a classification-based approach to grammar.",
        "sFo's representation of syntagmatic structure is less known.",
        "SFG maintains that there are four different kinds of syntagmatic patterning (Halliday, 1979).",
        "Prosodic structure.",
        "Agreement is a syntagmatic phenomenon that is prosodic in nature, in the sense that a particular realizational effect spreads over more than one constituent.",
        "similar to prosodic features that are strung throughout an intonational unit (see Figure 5 displaying Subject-Finite agreement).",
        "Periodic structure.",
        "Information structure belongs to a class of structure that is said to be periodic.",
        "It reflects one of the points of prominence we find in clauses: informational prominence, which shows in the distribution of Given and New, where in spoken mode.",
        "the intonation focus, which falls into the New part of the utterance, marks the informational prominence by carrying the major pitch change.",
        "Another point of prominence is thematic prominence: the structuring of a clause in theme and theme (see Figure 6).",
        "Interdependency structure.",
        "Coordinate structures belong to a class of structure called in-Given New Theme Rheme She left the possum on the deck",
        "terdependency structure.",
        "Coordinate structures are paratactic structures and are opposed to hypotac-tic, i.e.. subordinate, structures.",
        "While a dependency representation can handle the latter because there is an identifiable head element, there is no head element in paratactic structures: its elements are rather mutually dependent.",
        "The term interdependency is used to cover both hypotactically and paratactically related syntactic units.3 For an example see Figure 7.",
        "In SFG, the notation for the elements of paratactic structures is 1, 2, etc.",
        "and for those of hypotactic stuctures it is a, 0, etc.",
        "Paratactic structures are said not to have heads, whereas in hypotactic structures.",
        "a is considered the head.",
        "The additional labeling (Extender, Extension, Enhanced, Enhancement) marks the semantic-rhetorical relation between the elements of the structure: In (1) in Figure 7 the 1 element is said to be extended (by the 2 element); in (2), the a element is said to be enhanced by the 3 element.",
        "Constituency structure.",
        "The fourth kind of syntagmatic patterning SFG finds is one that has unique elements such as Subject, Object, Predicate or Actor, Goal, Process.'",
        "Here, constituency is considered an appropriate means of representation.",
        "The categorial values (S, NP, PP etc) are simply attributes associated with these functional constituents.",
        "See Figure 8 for an example.",
        "A unified view: the function structure.",
        "A representation of syntagmatic structure in SFG comprises all of these aspects.",
        "The distinction of syntagmatic patterning into these four aspects stems from the conception of function in SFG.",
        "The functional motivation of categories in the system network, i.e., the grammatical type hierarchy, is fourfold: paradigmatic grammatical types are experientially, logically, interpersonally or textually motivated.",
        "Each of these describes the grammar of a language from a different angle and goes together with a particular mode of expression in syntagmatic structure.",
        "The experiential aspect of syntagmatic structuring is elemental, reflecting part-whole relations – this aspect can be suitably represented by constituency: the logical aspect can be represented by a special kind of dependency structure, the interdependency structure, which represents part-part relations; the interpersonal and the textual aspects, however, prosodic and periodic structure, are difficult to press into these schemes because they can cut across constituency boundaries or may contradict constituency groupings.",
        "Therefore, if all of these aspects of syntagmatic patterning are to be uniformly described in one representation, the constituency representation part should be as little committed to a particular kind of grouping as possible.",
        "so as to avoid conflicts with other groupings as required for instance by information distribution.",
        "In fact.",
        "the kind of constituency SFG subscribes to is a multiple-branching structure, where the nodes are functionally annotated, reflecting a minimal bracketing strategy (see below).",
        "A syntagmatic representation at clause level of Fred ate the beans.",
        "for example, where in terms of information structure Fred is Given would look as follows:3",
        "And for the interpretation with Fred ate as Given, 'Given' can be conflated with both Actor and Process (Subject and Finite):",
        "Here.",
        "a constituent is codescribed from several perspectives, taking into account the different aspects of syntagmatic patterning sketched above, each creating a separate \"layer\" in the representation.",
        "or in other words, each coming with a particular set of attributes, like Theme and Rheme/Given and New for the textual mode, Actor, Process, Goal for the experiential mode and Subject, Finite, Object for the interpersonal mode.6 A function structure like this implies a very flat constituency, where the constituent boundaries do not necessarily match one-to-one.",
        "Thus, both of the interpretations of information distribution of Fred ate the beans are compatible with the rest of the structure.",
        "The representation of coordinate structure in SFG benefits similarly from the minimal bracketing strategy: The coordinating conjunction itself is an immediate constituent of a coordinate structure, e.g., for red apples and green plums, the function structure implies a bracketing as (red apples) (and) (green plums): 1 2 Extended Coordinator Extension red apples and green plums Here, none of the elements has to be attributed head status and the conjunction itself is a constituent.",
        "In terms of agreement interpreted as prosodic structure.",
        "the HPSG representation of agreement in the German nominal group by structure sharing is actually a possible realization of this view.",
        "However, with the current representational means employed in computational implementations of SFG, such as the NIGEL grammar in KPIAL (Bateman, 1997), such a formulation is not readily possible.",
        "This has two reasons, one being of a theoretical nature, the other one being a matter of computational representation.",
        "The theoretical problem is that features in the grammatical system network have to be unique and feature sharing among constituents is thus not allowed.",
        "As a consequence, there is no mechanism in the °There are no logical attributes here, because logical structuring only pertains to complex syntactic units, such as paratact ic and hypotactic structures.",
        "KPNIL implementation for feature sharing.",
        "In unification and constraint-based feature structure representations of NIGEL (Kasper, 1987; Henschel, 1994: Henschel, 1995), feature sharing is possible, but still the feature uniqueness postulate would have to be relaxed in order to make use of this mechanism."
      ]
    },
    {
      "heading": "5 Conclusions",
      "text": [
        "In this paper I have tried to raise the often discussed question of constituency vs. dependency for syntactic representation to a more general level asking whether constituency and dependency are sufficient at all for the representation of syntagmatic relations.",
        "After reviewing some of the main issues in the discussion 'constituency vs. dependency', I have presented some kinds of syntagmatic pattemings that call be problematic for dependency/constituency representations: coordinate structure, information structure and syntactic agreement: also, I have given further evidence of these observations by presenting examples of grammar models that do work for some of the problems discussed, if a more unconventional approach is pursued.",
        "such as e.g., CCG for information strcture.",
        "I have then questioned the primacy of constituency and dependency for the representation of syntactic structure and sketched the more diversified.",
        "functionally-based view of Systemic Functional Grammar.",
        "in which only minimal constituent groupings are used and some of the representational problems encountered with true dependency approaches and traditional constituency approaches do not arise.",
        "There are two caveats in place here, one concerning the SFG approach to syntagmatic structure itself, the other one concerning sFG's computational application more generally.",
        "The sFG view of syntagmatic structure inextricably goes together with a classification-based approach to grammar in which grammatical classes are finictionally motivated.",
        "The kernel of an SFG is the gramma t ical classification hierarchy, representing the paradigmatic relations that characterize the grammar of a language.",
        "It is important to note that the SFG approach to the representation of syntagmatic structure by itself is therefore not a full model of grammar – just like would not be a full model of grammar without its hierarchy of lexical and phrasal types.",
        "However, the insight that SFG has to offer is the acknowledgment of the diversity of syntagmatic patterning and pointing to the limits of the part-whole (constituency) and part-part (dependency) representations commonly employed in syntactic modeling.",
        "Recent developments in constraint-based formulations of SFG (Henschel, 1994: Henschel, 1995) may introduce new methods of representation to SFG (such as feature or structure sharing; cf.",
        "Section 4).",
        "However, the typed feature structures Henschel has experimented with all show particular weaknesses when faced with large classification hierarchies, as they are commonly employed ill implementations of Systemic Functional Grammar, such as the KPAIL system.",
        "The second caveat concerns the computational processing of sFG's in Natural Language Understanding.",
        "SFG is widely used in Natural Language Generation and has inspired a number of generation grammars.",
        "However, SFG is hardly used in parsing.",
        "For XL generation, the major attraction of SFG lies in the centrality of functional grammatical classification, which draws distinctions that are relevant for generation.",
        "SFG's flat structures work fine for generation, where the functional labeling and the annotation with interpersonal and textual information is anchored in the functional, paradigmatic description.",
        "i.e.. the grammatical system network.",
        "The few attempts that have been made in parsing with SFG, notably (Kasper, 1988).",
        "have shown that SFG functional structures are just not informative enough.",
        "Kasper had to add a set of phrase structure rules, so that possible patterns for each major constituent category could be more easily recognized.",
        "The suitability of a model of syntactic structure for computational application can thus also depend on the kind of computational application – NL understanding or XL generation."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The author would like to thank Erich Steiner and the reviewers of this paper for comments and suggestions for improvements."
      ]
    }
  ]
}
