{
  "info": {
    "authors": [
      "Nigel Collier",
      "Kenji Ono",
      "Hideki Hirakawa"
    ],
    "book": "COLING-ACL",
    "id": "acl-P98-1042",
    "title": "An Experiment in Hybrid Dictionary and Statistical Sentence Alignment",
    "url": "https://aclweb.org/anthology/P98-1042",
    "year": 1998
  },
  "references": [
    "acl-C94-2175",
    "acl-J93-1004",
    "acl-J93-1006",
    "acl-P91-1022",
    "acl-P91-1023",
    "acl-P93-1001",
    "acl-P93-1002",
    "acl-P94-1012",
    "acl-P98-1041"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "The task of aligning sentences in parallel corpora of two languages has been well studied using pure statistical or linguistic models.",
        "We developed a linguistic method based on lexical matching with a bilingual dictionary and two statistical methods based on sentence length ratios and sentence offset probabilities.",
        "This paper seeks to further our knowledge of the alignment task by comparing the performance of the alignment models when used separately and together, i.e. as a hybrid system.",
        "Our results show that for our English-Japanese corpus of newspaper articles, the hybrid system using lexical matching and sentence length ratios outperforms the pure methods."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "There have been many approaches proposed to solve the problem of aligning corresponding sentences in parallel corpora.",
        "With a few notable exceptions however, much of this work has focussed on either corpora containing European language pairs or clean-parallel corpora where there is little reformatting.",
        "In our work we have focussed on developing a method for robust matching of English-Japanese sentences, based primarily on lexical matching.",
        "The method combines statistical information from byte length ratios.",
        "We show in this paper that this hybrid model is more effective than its constituent parts used separately.",
        "The task of sentence alignment is a critical first step in many automatic applications involving the analysis of bilingual texts such as extraction of bilingual vocabulary, extraction of translation templates, word sense disambiguation, word and phrase alignment, and extraction of parameters for statistical translation models.",
        "Many software products which aid human translators now contain sentence alignment tools as an aid to speeding up editing and terminology searching.",
        "Various methods have been developed for sentence alignment which we can categorise as either lexical such as (Chen, 1993), based on a large-scale bilingual lexicon; statistical such as (Brown et al., 1991) (Church, 1993)(Gale and Church, 1993)(Kay and Riishcheisen, 1993), based on distributional regularities of words or byte-length ratios and possibly inducing a bilingual lexicon as a by-product, or hybrid such as (Utsuro et al., 1994) (Wu, 1994), based on some combination of the other two.",
        "Neither of the pure approaches is entirely satisfactory for the following reasons:",
        "• Text volume limits the usefulness of statistical approaches.",
        "We would often like to be able to align small amounts of text, or texts from various domains which do not share the same statistical properties.",
        "• Bilingual dictionary coverage limitations mean that we will often encounter problems establishing a correspondence in non-general domains.",
        "• Dictionary-based approaches are founded on an assumption of lexical correspondence between language pairs.",
        "We cannot always rely on this for non-cognate language pairs, such as English and Japanese.",
        "• Texts are often heavily reformatted in translation, so we cannot assume that the corpus will be clean, i.e. contain many one-to-one sentence mappings.",
        "In this case statistical methods which rely on structure correspondence such as byte-length ratios may not perform well.",
        "These factors suggest that some hybrid method may give us the best combination of coverage and accuracy when we have a variety of text domains, text sizes and language pairs.",
        "In this paper we seek to fill a gap in our understanding and to show how the various components of the hybrid method influence the quality of sentence alignment for Japanese and English newspaper articles."
      ]
    },
    {
      "heading": "2 Bilingual Sentence Alignment",
      "text": [
        "The task of sentence alignment is to match corresponding sentences in a text from one language to sentences in a translation of that text in another language.",
        "Of particular interest to us is the application to Asian language pairs.",
        "Previous studies such as (Fung and Wu, 1994) have commented",
        "that methods developed for Indo-European language pairs using alphabetic characters have not addressed important issues which occur with European-Asian language pairs.",
        "For example, the language pairs are unlikely to be cognates, and they may place sentence boundaries at different points in the text.",
        "It has also been suggested by (Wu, 1994) that sentence length ratio correlations may arise partly out of historic cognate-based relationships between Indo-European languages.",
        "Methods which perform well for Indo-European language pairs have therefore been found to be less effective for non-Indo-European language pairs.",
        "In our experiments the languages we use are English (source) and Japanese (translation).",
        "Although in our corpus (described below) we observe that, in general, sentences correspond one-to-one we must also consider multiple sentence correspondences as well as one-to-zero correspondences.",
        "These cases are summarised below.",
        "1.",
        "1:1 The sentences match one-to-one.",
        "2.",
        "1:n One English sentence matches to more than one Japanese sentence.",
        "3. m:1 More than one English sentence matches ot one Japanese sentence.",
        "4. m:n More than one English sentence matches to more than one Japanese sentence.",
        "5. m:0 The English sentence/s have no corresponding Japanese sentence.",
        "6.",
        "0:n The Japanese sentence/s have no corresponding English sentence.",
        "In the case of 1:n, m:1 and m:n correspondences, translation has involved some reformatting and the meaning correspondence is no longer solely at the sentence level.",
        "Ideally we would like smaller units of text to match because it is easier later on to establish word alignment correspondences.",
        "In the worst case of multiple correspondence, the translation is spread across multiple non-consecutive sentences."
      ]
    },
    {
      "heading": "3 Corpus",
      "text": [
        "Our primarily motivation is knowledge acquisition for machine translation and consequently we are interested to acquire vocabulary and other bilingual knowledge which will be useful for users of such systems.",
        "Recently there has been a move towards Internet page translation and we consider that one interesting domain for users is international news.",
        "The bilingual corpus we use in our experiments is made from Reuter news articles which were translated by the Gakken translation agency from English into Japanesel .",
        "The translations are quite literal and the contents cover international news for I The corpus was generously made available to us by special arrangement with Gakken the period February 1995 to December 1996.",
        "We currently have over 20,000 articles (approximately 47 Mb).",
        "From this corpus we randomly chose 50 article pairs and aligned them by hand using a human bilingual checker to form a judgement set.",
        "The judgement set consists of 380 English sentences and 453 Japanese sentences.",
        "On average each English article has 8 lines and each Japanese article 9 lines.",
        "The articles themselves form a boundary within which to align constituent sentences.",
        "The corpus is quite well behaved.",
        "We observe many 1:1 correspondences, but also a large proportion of 1:2 and 1:3 correspondences as well as reorderings.",
        "Omissions seem to be quite rare, so we didn't see many m:0 or 0:n correspondences.",
        "An example news article is shown in Figure 1 which highlights several interesting points.",
        "Although the news article texts are clean and in machine-tractable format we still found that it was a significant challenge to reliably identify sentence boundaries.",
        "A simple illustration of this is shown by the first Japanese line J1 which usually corresponds to the first two English lines El and E2.",
        "This is a result of our general-purpose sentence segmentation algorithm which has difficulty separating the Japanese title from the first sentence.",
        "Sentences usually corresponded linearly in our corpus, with few reorderings, so the major challenge was to identify multiple correspondences and zero correspondences.",
        "We can see an example of a zero correspondence as E5 has no translation in the Japanese text.",
        "A 1:n correspondence is shown by E7 aligning to both J5 and J6."
      ]
    },
    {
      "heading": "4 Alignment Models",
      "text": [
        "In our investigation we examined the performance of three different matching models (lexical matching, byte-length ratios and offset probabilities).",
        "The basic models incorporate dynamic programming to find the least cost alignment path over the set of English and Japanese sentences.",
        "Cost being determined by the model's scores.",
        "The alignment space includes all possible combinations of multiple matches upto and including 3:3 alignments.",
        "The basic models are now outlined below."
      ]
    },
    {
      "heading": "4.1 Model 1: Lexical vector matching",
      "text": [
        "The lexical approach is perhaps the most robust for aligning texts in cognate language pairs, or where there is a large amount of reformatting in translation.",
        "It has also been shown to be particularly successful within the vector space model in multilingual information retrieval tasks, e.g. (Collier et al., 1998a),(Collier et al., 1998b), for aligning texts in non-cognate languages at the article level.",
        "The major limitation with lexical matching is clearly the assumption of lexical correspondence -",
        "El.",
        "Taiwan ruling party sees power struggle in China E2.",
        "TAIPEI , Feb 9 ( Reuter ) - Taiwan's ruling Nationalist Party said a struggle to succeed Deng Xiaoping as China's most powerful man may have already begun.",
        "E3.",
        "\"Once Deng Xiaoping dies, a high tier power struggle among the Chinese communists is in-evitable,\" a Nationalist Party report said.",
        "E4.",
        "China and Taiwan have been rivals since the Nationalists lost the Chinese civil war in 1949 and fled to Taiwan.",
        "E5.",
        "Both Beijing and Taipei sometimes portray each other in an unfavourable light.",
        "E6.",
        "The report said that the position of Deng's chosen successor, President Jiang Zemin, may have been subtly undermined of late.",
        "E7.",
        "It based its opinion on the fact that two heavyweight political figures have recently used the phrase the \"solid central collective leadership and its core\" instead of the accepted \"collective leadership centred on Jiang Zemin\" to describe the current leadership structure.",
        "E8.",
        "\"Such a sensitive statement should not be an unintentional mistake ... E9.",
        "Does this mean the power struggle has gradually surfaced while Deng Xiaoping is still alive ?,\" said the report , distributed to journalists.",
        "E10.",
        "\"At least the information sends a warning signal that the 'core of Jiang' has encountered some subtle changes,\" it added .",
        "which is particularly weak for English and Asian language pairs where structural and semantic differences mean that transfer often occurs at a level above the lexicon.",
        "This is a motivation for incorporating statistics into the alignment process, but in the initial stage we wanted to treat pure lexical matching as our baseline performance.",
        "We translated each Japanese sentence into English using dictionary term lookup.",
        "Each Japanese content word was assigned a list of possible English translations and these were used to match against the normalised English words in the English sentences.",
        "For an English text segment E and the English term list produced from a Japanese text segment J, which we considered to be a possible unit of correspondence, we calculated similarity using Dice's coefficient score shown in Equation 1.",
        "This rather simple measure captures frequency, but not positional information.",
        "The weights of words are their frequencies inside a sentence.",
        "where fEj is the nun iber of lexical items which match in E and J, fE is the number of lexical items in E and fj is the number of lexical items in J.",
        "The translation lists for each Japanese word are used disjunctively, so if one word in the list matches then we do not consider the other terms in the list.",
        "In this way we maintain term independence.",
        "Our transfer dictionary contained some 79,000 English words in full form together with the list of translations in Japanese.",
        "Of these English words some 14,000 were proper nouns which were directly relevant to the vocabulary typically found in international news stories.",
        "Additionally we perform lexical normalisation before calculating the matching score and remove function words with a stop list."
      ]
    },
    {
      "heading": "4.2 Model 2: Byte-length ratios",
      "text": [
        "For Asian language pairs we cannot rely entirely on dictionary term matching.",
        "Moreover, algorithms which rely on matching cognates cannot be applied easily to English and some Asian language.",
        "We were motivated by statistical alignment models such as (Gale and Church, 1991) to investigate whether byte-length probabilities could improve or replace the lexical matching based method.",
        "The underlying assumption is that characters in an English sentence are responsible for generating some fraction of each character in the corresponding Japanese sentence.",
        "We derived a probability density function by making the assumption that English and Japanese sentence length ratios are normally distributed.",
        "The parameters required for the model are the mean, p and variance, a, which we calculated from a training set of 450 hand-aligned sentences.",
        "These are then entered into Equation 2 to find the probability of any two sentences (or combinations of sentences for multiple alignments) being in an alignment relation given that they have a length ratio of x.",
        "The byte length ratios were calculated as the length of the Japanese text segment divided by the length of the English text segment.",
        "So in this way we can incorporate multiple sentence correspondences into our model.",
        "Byte lengths for English sentences are calculated according to the number of non-white space characters, with a weighting of 1 for each valid character including punctuation.",
        "For the Japanese text we counted 2 for each non-white space character.",
        "White spaces were treated as having length 0.",
        "The ratios for the training set are shown as a histogram in Figure 2 and seem to support the assumption of a normal distribution.",
        "The resulting normal curve with a = 0.33 and p = 0.76 is given in Figure 3, and this can then be used to provide a probability score for any English and Japanese sentence being aligned in the Reuters' corpus.",
        "Clearly it is not enough simply to assume that our sentence pair lengths follow the normal distribution.",
        "We tested this assumption using a standard test, by plotting the ordered ratio scores against the values calculated for the normal curve in Figure 3.",
        "If the",
        "distribution is indeed noi mai then we would expect the plot in Figure 4 to yi,,ld a straight line.",
        "We can see that this is the case f..r most, although not all, of the observed scores.",
        "Although the curve in Figure 4 shows that our training set deviated from the normal distribution at",
        "the extremes we nevertheless proceeded to continue with our simulations using this model considering that the deviations occured at the extreme ends of the distribution where relatively few samples were found.",
        "The weakness of this assumption however does add extra evidence to doubts which have been raised, e.g. (Wu, 1994), about whether the byte-length model by itself can perform well."
      ]
    },
    {
      "heading": "4.3 Model 3: Offset ratios",
      "text": [
        "We calculated the offsets in the sentence indexes for English and Japanese sentences in an alignment relation in the hand-aligned training set.",
        "An offset difference was calculated as the Japanese sentence index minus the English sentence index within a bilingual news article pair.",
        "The values are shown as a histogram in Figure 5.",
        "As with the byte-length ratio model, we started from an assumption that sentence correspondence offsets were normally distributed.",
        "We then calculated the mean and variance for our sample set shown in Figure 5 and used this to form a normal probability density function (where a = 0.50 and p = 1.45) shown in Figure 6.",
        "The test for normality of the distribution is the same as for byte-length ratios and is given in Figure 7.",
        "We can see that the assumption of normality is particularly weak for the offset distribution, but we are motivated to see whether such a noisy probability model can improve alignment results."
      ]
    },
    {
      "heading": "5 Experiments",
      "text": [
        "In this section we present the results of using different combinations of the three basic methods.",
        "We combined the basic methods to make hybrid models simply by taking the product of the scores for the models given above.",
        "Although this is simplistic we felt that in the first stage of our investigation it was better to give equal weight to each method.",
        "The seven methods we tested are coded as follows:",
        "ment using sentence length ratios; OFFSET: sentence alignment using offsct probabilities.",
        "We performed sentence alignment on our test set of 380 English sentences and 453 Japanese sentences.",
        "The results are shown as recall and precision which we define in the usual way as follows: #correctly matched sentences retrieved",
        "#correctly matched sentences retrieved precision – # matched sentences retrieved The results are shown in Table 1.",
        "We see that the baseline method using lexical matching with a bilingual lexicon, DICE, performs better than either of the two statistical methods LEN or OFFSET used separately.",
        "Offset probabilities in particular performed poorly showing that we cannot expect the correctly matching sentence to appear constantly in",
        "Considering the hybrid methods, we see significantly that DICE+LEN provides a clearly better result for both recall and precision to either DICE or LEN used separately.",
        "On inspection we found that DICE by itself could not distinguish clearly between many candidate sentences.",
        "This occured for two reasons.",
        "1.",
        "As a result of the limited domain in which news articles report, there was a strong lexical overlap between candidate sentences in a news article.",
        "2.",
        "Secondly, where the lexical overlap was poor between the English sentence and the Japanese translation, this leads to low DICE scores.",
        "The second reason can be attributed to low coverage in the bilingual lexicon with the domain of the news articles.",
        "If we had set a minimum threshold limit for overlap frequency then we would have ruled out many correct matches which were found.",
        "In both cases LEN provides a decisive clue and enables us to find the correct result more reliably.",
        "Furthermore, we found that LEN was particularly effective at identifying multi-sentence correspondences compared to DICE, possibly because some sentences are very small and provide weak evidence for lexical matching, whereas when they are combined with neighbours they provide significant evidence for the LEN model.",
        "Using all methods together however in DICE+LEN+OFFSET seems less promising and we believe that the offset probabilities are not a reliable model.",
        "Possibly this is due to lack of data in the training stage when we calculated a and u, or the data set may not in fact be normally distributed as indicated by Figure 7.",
        "Finally, we noticed that a consistent factor in the English and Japanese text pairs was that the first two lines of the English were always matched to the first line of the Japanese.",
        "This was because the English text separated the title and first line, whereas our sentence segmenter could not do this for the Japanese.",
        "This factor was consistent for all the 50 article pairs in our test collection and may have led to a small deterioration in the results, so the figures we present are the minimum of what we can expect when sentence segmentation is performed correctly."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "The assumption that a partial alignment at the word level from lexical correspondences can clearly indicate full sentence alignment is flawed when the texts contain many sentences with similar vocabulary.",
        "This is the case with the news stories used in our experiments and even technical vocabulary and proper nouns are not adequate to clearly discriminate between alternative alignment choices because the vocabulary range inside the news article is not large.",
        "Moreover, the basic assumption of the lexical approach, that the coverage of the bilingual dictionary is adequate, cannot be relied on if we require robustness.",
        "This has shown the need for some hybrid model.",
        "For our corpus of newspaper articles, the hybrid model has been shown to clearly improve sentence alignment results compared with the pure models used separately.",
        "In the future we would like to make extensions to the lexical model by incorporating term weighting methods from information retrieval such as inverse document frequency which may help to identify more important terms for matching.",
        "In order to test the generalisability of our method we also want to extend our investigation to parallel corpora in other domains."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We would like to thank Reuters and Gakken for allowing us to use the corpus of news stories in our work.",
        "We are grateful to Miwako Shimazu for hand aligning the judgement set used in the experiments and to Akira Kumano and Satoshi Kinoshita for useful discussions.",
        "Finally we would also like express our appreciation to the anonymous reviewers for their helpful comments."
      ]
    }
  ]
}
