{
  "info": {
    "authors": [
      "Yves Lepage"
    ],
    "book": "COLING-ACL",
    "id": "acl-P98-1121",
    "title": "Solving analogies on words: an algorithm",
    "url": "https://aclweb.org/anthology/P98-1121",
    "year": 1998
  },
  "references": [
    "acl-C90-3101",
    "acl-C94-1037",
    "acl-C96-1046",
    "acl-C96-2121"
  ],
  "sections": [
    {
      "heading": "UN ALGORITHME POUR LA ALGORYTM DO ROZSTRZYGANIA RESOLUTION DES ANALOGIES ANALOGII POMMDZY SLOWAMI ENTRE MOTS Yves LEPAGE Yves LEPAGE",
      "text": [
        "Resume Un rappel de travaux precedents sur ranalogie en psychologie, en intelligence artificielle et en traitement automatique des langues precede la presentation d'un algorithme de resolution, au nivea,u morphologique, d'analogies entre mots.",
        "Cet algorithme cree un quatrieme mot a partir de trois mots donnes, quand c'est possible.",
        "Par exemple, etant donnes fable, fabuleux et miracle, l'algorithme cree bien nziraculeux.",
        "Des cas Men plus difficiles sont correctement resolus par ralgorithme, en particulier, les cas d'infixation multiple, necessaires pour rendre compte de la morphologie des langues semitiques.",
        "Nous don-nons les caracteristiques de l'algorithme et men-tionnons quelques applications possibles."
      ]
    },
    {
      "heading": "EIN ALGORITHMUS ZUR L6SUNG VON WORT-ANALOGIEN Yves LEPAGE",
      "text": []
    },
    {
      "heading": "Streszczenie",
      "text": [
        "Po opisaniu poprzednich prac nad zagadnie-niem analogii w ramach psychologii, sztucznej inteligencji oraz lingwistyki komputeroNvej, pokazujemy algorytm do rozwiazania analogii pomicdzy slowami na poziomie morfo-logicznym.",
        "Algorytm ten tworzy, kiedy jest to moiliwe, czwarty termin na podstawie trzech innych termin6w.",
        "Na przyklad, jeieli podamy ipiewaczka i dzialaé, algorytm slusznie stworzy dzialoczka.",
        "Algorytm ten rozwiazuje bardziej skomplikowane problemy analogii, jak w przypadku morfologii jczykenv semitycznych, gdzie w grodku slew moie pojawiC sic kilka przy-rostkOw jednoczegnie.",
        "Opisujemy algorytm i jego moiliwe zastosowania."
      ]
    },
    {
      "heading": "Yves LEPAGE ()141 – a)",
      "text": [
        "Zusammenfassung Nach einer Beschreibung friiherer Werke iiber Analogie im Rahmen von Psycholo-gie, kiinstlicher Intelligenz und maschineller Spra.chverarbeitung, wird em n Algorithmus zur LOsung von Wort-Analogien auf morphologi-scher Ebene vorgeschlagen.",
        "Dieser Algorithmus erzeugt, wenn mOglich, em n viertes Wort aus drei gegebenen WOrtern.",
        "Zum Beispiel, aussilhest wird a,us nehnzen, ausniihmest und schen abgeleitet.",
        "Auch komplexere Fälle wer-den korrekt behandelt, selbst in der Morph°logie semitischer Sprachen, in denen parallele Infixung vorkommt.",
        "Der Algorithmus wird beschrieben und mögliche Anwendungen wer-den aufgezeigt."
      ]
    }
  ]
}
