{
  "info": {
    "authors": [
      "Yves Lepage",
      "Shinichi Ando",
      "Susumu Akamine",
      "Hitoshi Iida"
    ],
    "book": "Workshop on Processing of Dependency-Based Grammars",
    "id": "acl-W98-0513",
    "title": "An Annotated Corpus in Japanese Using Tesniere's Structural Syntax",
    "url": "https://aclweb.org/anthology/W98-0513",
    "year": 1998
  },
  "references": [
    "acl-C88-1013"
  ],
  "sections": [
    {
      "text": [
        "§ATR Interpreting Telecommunications Research Labs, Kyoto, Japan flepage, iidaleitl.atr.co.jp NEC, tC&C Media and tHuman Media Research Labs, Kanagawa, Japan andoeccra.",
        "cl .nec .",
        "co .",
        "jp, akamineOhml cl .nec .",
        "co .",
        "jp"
      ]
    },
    {
      "heading": "INTRODUCTION",
      "text": [
        "Tesniere's attention to covering a maximal number of syntactic phenomena explains the impressive number of languages – \"timeo hominem unius linguae\" – cited in the Elements de syn-taxe structurale.",
        "Although Japanese is correctly classified as a strongly centripetal language according to linear survey (releve liniaire, p. 33), no examples of Japanese are cited.",
        "Consequently, we have endeavored to apply Tesniere's ideas to Japanese by manually constructing the linguistic structures for more than six thousand sentences of a corpus of hotel reservation conversations.",
        "In fact, Tesniere's grammatical ideas, and among them, the most.",
        "original ones, fit well to Japanese as they give simple and insightful descriptions of some usually controversial grammatical phenomena (ergative constructions, naadjectives).",
        "After describing the different types and categories of words, we will focus on the three phenomena to which, according to Tesniere, all syntactical phenomena reduce: connection, junction and transference.",
        "From the representational point of view, we will introduce correspondence intervals to code which part of the surface text corresponds to which nodes or sub-trees."
      ]
    },
    {
      "heading": "1 WORDS",
      "text": [
        "We have taken the character (kana or kanji), which is the physical unit of a Japanese text, as the unit of measure of the length of a section of text.",
        "With the convention of starting at position 0, we locate any piece of text, and hence words, using an interval notation.",
        "Note that there is no word separator (or blank spaces) in Japanese.",
        "In the following sentencel, the word OE is located by the interval [3_51 and the word i..1\" by [6_9].",
        "This notation will be used in correspondences (Section 2.2)."
      ]
    },
    {
      "heading": "1.1 Species and Categories of Words",
      "text": [
        "The differentiation between: content words, which are associated with a concept, and function words, which express syntactical information was not difficult to apply to Japanese."
      ]
    },
    {
      "heading": "1.1.1 Content Words",
      "text": [
        "Some examples of content words include Tt (yoyaku, reservation), fitt.L (okureru, to be late), 741,1 (takai, expensive), VI (tyokusetu, directly).",
        "Tesniere distinguishes between two categories of content words: processes and substances, which are, for explanation purposes, usually exemplified by verbs and nouns, respectively, in Indo-European languages.",
        "This is also consistent with Japanese.",
        "These two categories are in turn divided into: concrete and abstract categories, which opposes the concrete notion of processes and substances to their abstract attributes, and gives rise to the following categorisation for content words (see also (Starosta 88), Tesniere's notations is shown in capitals)."
      ]
    },
    {
      "heading": "substances processes concrete substantive verbal 0 I abstract adjectival adverbial A E",
      "text": [
        "'Except when mentioned, examples are from he treebank.",
        "It is to be noted that, in the case of Japanese, two categories of words are variable in relation to aspect and negation: abstract substances (A) and concrete processes (I), which are respectively (i-)adjectives and verbs in terms of Japanese grammars.",
        "Now, some classes of words, which pose problems in Japanese grammar books written in English, such as the so-called na-adjectives (sizuka, quiet)), and the Sino-Japanese nouns-verbs formed in conjunction with use of the Japanese verb t (suru, to do), can easily be categorised as nouns (0).",
        "This is consistent with what is taught in Japanese schools, (see Appendix B), their syntactical behaviour being prefectly described by transference (see Section 4)."
      ]
    },
    {
      "heading": "1.1.2 Function Words",
      "text": [
        "Grammatical tools, the role of which is to either make explicit, or change the category of a content word, or to define relationships between words, are called function words.",
        "These words will appear in extenso in structural representations.",
        "In Japanese, many can be easily identified, such as, h.'.",
        "(ga, nominative case post-particule), O (no, 4.1*ItiA, genitive case post-particle), \"C. (node,10 aft ,34, equivalent to subordinate conjunction), 75 (ka, allti51, end of interrogative sentence particle), t (sum, it ni-f4, support verb for Sino-Japanese nouns), etc.",
        "Of course, some function words can also be content words in a different context.",
        "For instance, the verb t (suru), is either the support verb for Sino-Japanese nouns, (a function word in that case), or the verb \"to do\" (a content word)."
      ]
    },
    {
      "heading": "2 CONNECTION",
      "text": [
        "Tesniere speaks of connection to describe the relations between words in a sentence in terms of their subordination relations.",
        "This concept includes predicate-argument or governor-modifier relations as well as predicate-circumstantial relations (Elements, p. 14).",
        "The study of sentences, which is the proper object of structural syntax is essentially the study of its structure, i.e. the hierarchy of its connections."
      ]
    },
    {
      "heading": "2.1 Tree Representation: Stemmas",
      "text": [
        "Tesniere was the first to propose, in 1934, to systematically use graphical representations2 which he called stemmas, for representing this hierarchy (Tesniere 34).",
        "However, these stemmas were more than simple trees.",
        "Although, we will show that the introduction of correspondence makes it possible to encode Tesniere's representations using just trees.",
        "Basic connections are those which link concrete notions with their abstract attributes (Figure 1).",
        "By replacing content words with their class (0, I, A, E) \"virtual\" stemmas (on the right) can be derived from the \"real\" ones (on the left)."
      ]
    },
    {
      "heading": "2.2 Correspondences",
      "text": [
        "To explicitly indicate which word, or more specifically, especially in the case of Japanese, which chunk of text corresponds to which node in the stemma, we adopted the use of correspondences (Boitet and Zaharin 88).",
        "We note two kinds of correspondence:",
        "• words-to-node, and • sentence parts-to-complete subtree, or substring-to-subtree.",
        "Constraints Correspondences are noted by intervals, as introduced above, and are governed by three constraints (Lepage 94).",
        "• global correspondence: an entire tree corresponds to an entire sentence;",
        "2He acknowledged that two Russian linguists used trees in 1930 to explain some syntactic phenomenon, but, unlike Tesniere, the use of trees was not pivotal in their explanations.",
        ")1, < 7 6 I t yasui hoteru hayaku tukimasu cheap hotel quickly arrive",
        "• inclusion: a subtree which is part of another subtree T, must correspond to a substring in the substring corresponding to T; • membership: a node in a subtree T, must correspond to words members of the substring corresponding to T."
      ]
    },
    {
      "heading": "11 I:",
      "text": []
    },
    {
      "heading": "2.3/0_3 6_7/3_7",
      "text": [
        "name).",
        "Because the honorific prefix 13 + (o+) can only be applied to a noun, obtained by attaching the suffix + (+0 (transference, see Section 4), the subtree dominated by the verbal root corresponds to a non-connex substring [0_4)+[5..6) in the surface form: 13V1111- ...",
        "In Figure 2, on each node of the stemma, two intervals stand for the words-node and the substring-subtree correspondences, in that order.",
        "The entire sentence3 extends from 0 to 11, as indicated by the root.",
        "This root is a verb, denoted as I, and is located in position 7 to 11: tt (narimasu).",
        "Similarly, the node labelled (ni) corresponds as a word to the case-maker which extends from 6 to 7 in the sentence.",
        "The entire subtree dominated by the node corresponds to the phrase 31.111-1:: (beturyoukin iii) which extends from 3 to 7.",
        "Discontinuous Intervals Discontinuous intervals are possible.",
        "In Figure 3, the deverbative noun WI (negai, request) from iii\") (negau, to ask for) takes an accusative argument extending from 0 to 4, 13ZA1 (o+namae wo, your 'Refer to Table A in Appendix for notations used in glosses.",
        "What is your name, please?"
      ]
    },
    {
      "heading": "2.3 Predicate-Argument Structures",
      "text": [
        "Free-Order – Subject A main feature of dependency structures, to which Tesniere's representations pertains, is that they do not provide any preferred position to the subject (see Fourquet's foreword to (Grecian° and Schumacher 96), and (Zemb 78), p. 393, for a discussion).",
        "This corresponds particularly well with our data because the free ordering of case-marked phrases (not words) is a property of Japanese, which makes dependency grammars more adequate in its description'.",
        "For exam-4(Mel'euk 88) and (Starosta 88), among others have already commented that constituency structures are English-oriented representations into which some linguists try desperately to cast other languages.",
        "An illustration is (Gunji 87).",
        "After a ten-page discussion, and despite an honest acknowledgment that there is absolutely no basis for this, he draws the conclusion that a preferred position for the subject, as a left sister of the",
        "pie, the two following propositions are equally valid, where location and subject have been exchanged.",
        "rokunin ga hitoheya ni ireru '6-people' NOM '1-room' LOC 'can-enter'",
        "Omission Moreover, in Japanese, the omission of any of the case-marked phrases is possible.",
        "One can perfectly imagine a situation where a traveler first announces that he is in a group of 6 people, and then merely utters the following sentence: am iz Aft Z hitoheya ni ireru 'one-room' LOC 'can-enter' a room that can accommodate 6 people This sentence has no subject., and yet it is unambiguously understood as a request for a room which can accommodate 6 people altogether.",
        "Ergat ive Constructions Moreover, the search for the \"real subject\", as opposed to the syntactical subject, is meaningless in dependency representations of ergative constructions.",
        "Such constructions exist in Japanese5 with a range of adjectives, such as, Ø 1,1,1 (hosii) (20 occurrences in our corpus), or verbal forms in - (tai) (around 310 occurrences in the corpus), or the so-called \"passive\" or \"medio-passive\" verbs, such as, Ai.",
        "(mieru, cf. Fr.",
        "se voir).",
        "verb, has to be postulated for Japanese, because...it is so in English.",
        "'However, the ergative case does not exist in Japanese, and it would be difficult to call Japanese an ergative language (see (Mel'Euk 88), p. 250-253, for definitions concerning ergativity).",
        "Auxiliary Verbs In an original and interesting discussion, Tesniere advocates that the subject and the object of a French passé composi of a transitive verb, do not both link to the past participle.",
        "He shows that some clues indicate that the subject links to the auxiliary, while the object should be linked with the past participle.",
        "Similar analysis seems particularly well adapted to some Japanese constructions too, not because of the agreement in gender-number, but because of case semantics.",
        "For instance, in the following sentence, the subject, postal code, cannot be considered the subject of the verb, to write6."
      ]
    },
    {
      "heading": "6 Z",
      "text": [
        "yuubinbangou ga kaite aru 'postal code' NOM 'write' 'is' The postal code is written (e.g. on an envelope) However, changing the auxiliary, 6 (aru) into VI (iru) implies a change in the case of postal code.",
        "*Mt yuubinbangou wo kaite iru 'postal code' ACC 'write' 'is' The postal code is being written (e.g. by Lucien) = Somebody is writing the postal code.",
        "This convinced us to adopt Tesniere's analysis, where the subject is linked with the auxiliary (Figure 5)."
      ]
    },
    {
      "heading": "3 JUNCTION",
      "text": [
        "Junction gathers the facts of coordination, and factorisation.",
        "Junction words in Japanese include words such as (to, and for nouns), -'t\" (ya, or for nouns), L (si, or for verbs), lt (kedo, but).",
        "We propose to represent them with one node bearing a special label: we prefix and suffix by – the function word.",
        "Accordingly, we can easily represent cap junctions as in Figure 6.",
        "On the other hand, in cup cases, the same dependent shares several governors.",
        "A tree can be \"factored\" by using a special node, V, bearing",
        "Because of junctions, a structure representing a sentence may be a forest.",
        "This is a significant difference to constituency representations, but conforms with Tesniere's description (e.g. p. 649).",
        "Figure 7 is such an example."
      ]
    },
    {
      "heading": "4 TRANSFERENCE",
      "text": [
        "Transference7 , in essence, consists in transferring to a content word of a given category the function or role of another category.",
        "According to Tesniere, it is precisely this transference which allows a speaker of any language to never be stopped by the fact that a needed concept does not fit, by category, into the role required at a given point in an utterance.",
        "Transferer Transference applies to a content word, called the transferee.",
        "It is performed by a transferer, which may be:",
        "• a function word 17) (no, of), r (iii, to), t (suru, to do), etc.",
        "?Here, we follow the recommendation of Tesniere himself to render the French word translation with this English term especially coined for the meaning here.",
        "• some morphological device + < (ku, adverbial form of adjectives), + C (te, pending form of verbs), etc.",
        "• no mark at all (the so-called \"relatives\" of",
        "Japanese are in fact transferences: a verb is transferred into an adjective without any marker).",
        "In this case, we indicate the transferer node by 0.",
        "As a result of transference, the category of the content word has been transformed into another category so that it can play the role of the resulting category.",
        "For instance: hoteru hoteru no hotel of the hotel Representation Depending on the position of the transferer, left and right transferences have to be distinguished.",
        "In Japanese, the transferer is predominantly on the right of the transferee.",
        "We represent the transference with the help of a 3-node subtree to render Tesniere's capital T notation:",
        "• the mother node bears the target category, followed (or preceded) by T if the transferer is on the right of the transferee in the sentence, (usual case in Japanese), or on the left; • the left (or right) daughter bears the transferee, represented by its category; • the other daughter bears the transferer,",
        "the function word in extenso.",
        "A mother mode does not correspond to any word in the surface text so it bears an empty interval (denoted as [n_n], with any n).",
        "However, as the root of a subtree, it represents the sum of the intervals of all its subtrees.",
        "Na-Adjectives A class of Sino-Japanese nouns exists in Japanese, extended in contem-poranean Japanese by a full range of English-Japanese nouns (Sells 96) (yuniikuna, unique), 7 1, .",
        ":*/ a (huressyu-na, fresh)), which could be semantically interpreted as adjectives, but follow a specific syntactical behaviour, different from standard adjectives end-' ing in vl (i) (Appendix C).",
        "They are the so-called na-adjectives in Japanese grammar books",
        "written in English, although in Japanese terminology they are described as noun-adjectives.",
        "In attributive positions, these words require a special function word, fx (na).",
        "We analysed as a transferer of nouns (0) into adjectives (A).",
        "This view meets that of (Kuwae 89), vol 1, p. 185, who considers that, \"ti (da) is the only variable word in Japanese for which there exists a determinative form, 7.'t (na), distinct from the conclusive form.\""
      ]
    },
    {
      "heading": "CONCLUSION",
      "text": [
        "We have presented a treebank of 6553 sentences of Japanese conversations in the domain of hotel reservations, which uses Tesniere's structural syntax framework.",
        "Correspondences between surface texts and trees are ensured by means of intervals.",
        "It has long been felt in the NLP Japanese community that a dependency approach fits well to the description of Japanese.",
        "The privileged place for the subject in constituency descriptions generates artificial problems, whereas, dependency allows simple and direct description of phenomena like, for instance, ergative constructions.",
        "Moreover, Tesniere's original ideas give a clear insight to some area.",
        "For instance, the attachment of arguments under auxiliaries better renders case semantics.",
        "Also, transference permits a simple analysis of \"na-adjectives\", which respects the feeling of native speakers of Japanese."
      ]
    },
    {
      "heading": "C I-Adjectives and \"Na-Adjectives\"",
      "text": [
        "predicative familiar attributive polite iei we 1 Ao AtogiET/-takai desu takai takai heya desu it is expensive (it's) erpen- it is an expensive sive TOM Ohs-CI- Ph.t..f Ph% t.teGaTt sizuka desu sizuka da sizuka na heya desu it is quiet (it's) quiet it is a quiet room"
      ]
    }
  ]
}
