{
  "info": {
    "authors": [
      "Susanne Gahl"
    ],
    "book": "COLING-ACL",
    "id": "acl-P98-1071",
    "title": "Automatic Extraction of Subcorpora based on Subcategorization Frames from a Part-ofSpeech Tagged Corpus",
    "url": "https://aclweb.org/anthology/P98-1071",
    "year": 1998
  },
  "references": [
    "acl-P93-1032",
    "acl-P98-1013"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper presents a method for extracting subcorpora documenting different subcategorization frames for verbs, nouns, and adjectives in the 100 mio.",
        "word British National Corpus.",
        "The extraction tool consists of a set of batch files for use with the Corpus Query Processor (CQP), which is part of the IMS corpus workbench (cf. Christ 1994a,b).",
        "A macroprocessor has been developed that allows the user to specify in a simple input file which subcorpora are to be created for a given lemma.",
        "The resulting subcorpora can be used (1) to provide evidence for the subcategorization properties of a given lemma, and to facilitate the selection of corpus lines for lexicographic research, and (2) to determine the frequencies of different syntactic contexts of each lemma."
      ]
    },
    {
      "heading": "Introduction",
      "text": [
        "A number of resources are available for obtaining subcategorization information, i.e. information on the types of syntactic complements associated with valence-bearing predicators (which include verbs, nouns, and adjectives).",
        "This information, also referred to as valence information is available both in machine-readable form, as in the COMLEX database (Macleod et al.",
        "1995), and in human-readable dictionaries (e.g. Hornby 1989, Procter 1978, Sinclair 1987).",
        "Increasingly, tools are also becoming available for acquiring subcategorization information from corpora, i.e. for inferring the subcategorization frames of a given lemma (e.g. Manning 1993).",
        "None of these resources provide immediate access to corpus evidence, nor do they provide information on the relative frequency of the patterns that are listed for a given lemma.",
        "There is a need for a tool that can (1) find evidence for subcategorization patterns and (2) determine their frequencies in large corpora:",
        "1.",
        "Statistical approaches to NLP rely on information not just on the range of combinatory possibilities of words, but also the relative frequencies of the expected patterns.",
        "2.",
        "Dictionaries that list subcategorization",
        "frames often list expected patterns, rather than actual ones.",
        "Lexicographers and lexicologist need access to the evidence for this information.",
        "3.",
        "Frequency information has come to be the focus of much psycholinguistic research on sentence processing (see for example MacDonald 1997).",
        "While information on word frequency is readily available (e.g. Francis and Kucera (1982)), there is as yet no easy way of obtaining information from large corpora on the relative frequency of complementation patterns.",
        "None of these points argue against the usefulness of the available resources, but they show that there is a gap in the available information.",
        "To address this need, we have developed a tool for extracting evidence for subcategorization patterns from the 100 mio.",
        "word British National Corpus (BNC).",
        "The tool is used as part of the lexicon-building process in the FrameNet project, an NSF-funded project aimed at creating a lexical database based on the principles of Frame Semantics (Fillmore 1982)."
      ]
    },
    {
      "heading": "1 Infrastructure",
      "text": []
    },
    {
      "heading": "1.1 Tools",
      "text": [
        "We are using the 100 mio.",
        "word British National Corpus, with the following corpus query tools: .",
        "CQP (Corpus Query Processor, Christ (1994)), a general corpus query processor for complex queries with any number and combination of annotated information types, including part-of-speech tags, morphosyntactic tags, lemmas and sentence boundarie S.",
        "• A macroprocessor for use with CQP that allows the user to specify which subcorpora are to be created for a given lemma.",
        "The corpus queries are written in the CQP corpus query language, which uses regular expressions over part-of-speech tags, lemmas, morphosyntactic tags, and sentence boundaries.",
        "For details, see Christ (1994a).",
        "The queries essentially simulate a chunk parser, using a regular grammar."
      ]
    },
    {
      "heading": "1.2 Coverage",
      "text": [
        "A list of the verb frames that are currently searchable is given in figure 1 below, along with an example of each pattern.",
        "The categories we are using are roughly based on those used in the COMLEX syntactic dictionary (Macleod et al.",
        "1995).",
        "In our queries for nouns and adjectives as targets, we are able to extract prepositional, clausal, infinitival, and gerundial complements.",
        "In addition, the tool accomodates searches for compounds and for possessor phrases Om nei.hbor's addiction to cake,tax milk allergy).",
        "El.i though these categories are not tied to the syntactic subcategorization frames of the target lemmas, they often instantiate semantic arguments, or, more specifically, Frame elements (Fillmore 1982, Baker et al.",
        "forthcoming)."
      ]
    },
    {
      "heading": "1.3 Method 1.3.1 Overview",
      "text": [
        "We start by creating a subcorpus containing all concordance lines for a given lemma.",
        "We call this subcorpus a lemma-subcorpus.",
        "The extraction of smaller subcorpora from the lemma subcorpus then proceeds in two stages.",
        "During the first stage, syntactic patterns involving 'displaced' arguments (i.e. 'left isolation' or 'movement' phenomena) are extracted, such as passives, tough movement and constructions involving WH-extraction.",
        "The result of this procedure is a set of subcorpora that are homogeneous with respect to major constituent order.",
        "Following this, the remainder of the lemma-subcorpus is partitioned into subcorpora based on the subcategorization properties of the lemma in question.",
        "intransitive np np_np np_pp np_Pvping np_pwh np_vpto np_vping np_sfin np_wh np_ap np_sbrst ap 'worms wiggle' 'kiss me' 'brought her flowers' 'replaced it with a new one' 'prevented him from leaving' 'asked her about what it all meant' 'advised her to go' 'kept them laughing' 'told them (that) he was back' 'asked him where the money was'",
        "'no, said he', \"no\", 'he said', 'he said: \"no\" 'behave badly'",
        "For the extraction of certain subcategorization patterns, it is not necessary to simulate a parse of all of the constituents.",
        "Where an explicit context cue exists, a partial parse suffices.",
        "For example, the query given in figure 2 below is used to find [_ NP VPing] patterns (e.g. kept them laughing).",
        "Note that the query does not positively identify a noun phrase in the osition following the target verb.",
        "Applying queries like the one for [NP VPing] \"blindly\", i.e. in the absence of any information on the target lemma, would produce many false hits, since the query also matches gerunds that are not subcategorized.",
        "However, the information that the target verb subcategorizes for a gerund dramatically reduces the number of such errors.",
        "The same mechanism is used for addressing the problems associated with prepositional phrase attachment.",
        "The general principle is that prepositional phrases in certain contexts are considered to be embedded in a preceding noun phrase , unless the user specifies that a given preposition is subcategorized for by the target lemma.",
        "For example, the of-phrase in a sequence Verb - NP - of - NP is interpreted as part of the first NP (as in met the president of the company), unless we are dealing with a verb that has a [_NP PPoi] subcategorization frame, e.g. cured the president of his asthma.",
        "The result of each query is subtracted from the lemma subcorpus and the remainder submitted to the next set of queries.",
        "As a result, earlier queries preempt later queries.",
        "For example, concordance lines matching the queries for passives, e.g. he was cured of his asthma are filtered out early on in the process, so as to avoid getting matched by the queries dealing with (active intransitive) verb + prepositional phrase complements, such as he boasted of his achievements.",
        "Another example of this type of preemption concerns the interaction of the query for ditransitive frames (brought her flowers) with later queries for NP complements.",
        "A proper name immediately followed by another proper name (e.g. Henry James) is interpreted as a single noun phrase except when the target lemma subcategorizes for a ditransitive frame'.",
        "An analogous strategy is used for identifying noun compounds.",
        "For ditransitives, strings that represent two consecutive noun phrases are queried for first.",
        "Note that this method crucially relies on the fact that the subcategorization properties of the target lemma are given as the input to the query process."
      ]
    },
    {
      "heading": "2 Examples 2.1 NPs",
      "text": [
        "An example of a complex query expression of the kind we are using is given in figure 3.",
        "The expression matches noun phrases like \"the three kittens\", \"poor Mr. Smith\", \"all three\", \"blue flowers\", \"an unusually large hat\", etc.",
        "([pos = \"ATOICRDIDPSIDTOIORDICJTDTOICRD-PNI\"]* [pos = \"AVOIAJOAVO\"]* [pos = \"AJOIAJCI AJS IAJOAVOI AJO-NN1 IAJO-VVG\"] * [pos=\"NNO INNIINN2IAJO-NN1INN1-NPOINN1"
      ]
    },
    {
      "heading": "2.2 Coordinated passives",
      "text": [
        "As an example of a query matching a 'movement' structure, consider the query for coordinated passives, given in figure 3 below.",
        "The leftmost column gives the query expression itself, while the other columns show Inevitably, this strategy fails in some cases, such as \"I'm reading Henry James now\" (vs. \"I read Henry stories.\""
      ]
    },
    {
      "heading": "3 The macroprocessor",
      "text": [
        "A macroprocessor has been developed' that allows the user to specify in a simple input file which subcorpora are to be created for a given lemma.",
        "The macroprocessor reads the the number of matches for each subcategorization pattern into an output file.",
        "A sample input file for the lemma insist is given in figure 5 below.",
        "4 Output format figure 5 Input form for macroporcessor sorted, usually by the head of the first complement following the target lemma.",
        "The subcorpora can be saved as binary files for further processing in CQP or XKWIC, an interactive corpus query tool (Christ 1994) and as text files.",
        "The text files are"
      ]
    },
    {
      "heading": "5 Limitations of the approach",
      "text": [
        "Our tool relies on subcategorization information as its input.",
        "Hence it is not capable of automatically learning subcategorization frames, e.g. ones that are missing in diction",
        "aries or omitted in the input file.",
        "The tool facilitates the (manual) discovery of evidence for new subcategorization frames, however, as potential complement patterns are saved in separate subcorpora.",
        "Indeed, this is one of the ways in which the tool is being used in the context of the FrameNet project.",
        "Some of the technical limitations of the existing tools result from the fact that we are working with an unparsed corpus.",
        "Thus, many types of 'null' or 'empty' constituents' are not recognized by the queries.",
        "Ambiguities in prepositional phrase attachment are another major source of errors.",
        "For instance, of the concordance lines supposedly instantiating a [_NP PPwith] frame for the verb heal, several in fact contained embedded PPs (e.g. LNP], as in heal [children with asthma], rather than [_NP PPwith], as in healing [arthritis] [with a crystal ball]), Finally, the search results can only be as accurate as the part-of-speech tags and other annotations in the corpus."
      ]
    },
    {
      "heading": "7 Future directions",
      "text": [
        "Future versions of the tool will include searches for predicative (vs. attributive) uses for adjectives and nouns.",
        "For verbs, the searches will be expanded to cover the entire set of complementation patterns described in the COMLEX syntactic dictionary."
      ]
    },
    {
      "heading": "Conclusion",
      "text": [
        "We have presented an overview of a set of tools for extracting corpus lines illustrating subcategorization patterns of nouns, verbs, and adjectives, and for determining the frequency of these patterns.",
        "The tools are currently used as part of the FrameNet project.",
        "An overview of the whole project can be found at: http://www.icsi.berkeley.edu/ – framenet."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "This work grew out of an extremely enjoyable collaborative effort with Dr. Ulrich Heid of IMS Stuttgart and Dan Jurafsky of the University of Boulder, Colorado.",
        "I would like to thank Doug Roland and especially the untiring Collin Baker for their work on the macroprocessor.",
        "I would also like to thank the 3 Our system is able to identify passive structures, tough-movement, and a number of common left isolation constructions, i.e. constructions involving 'traces' or movement sites.",
        "members of the FrameNet project for their comments and suggestions.",
        "I thank Judith Eckle-Kohler of IMS-Stuttgart, JB Lowe of ICSI-Berkeley and Dan Jurafsky for comments on an earlier draft of this paper."
      ]
    }
  ]
}
