{
  "info": {
    "authors": [
      "Maosong Sun",
      "Dayang Shen",
      "Benjamin K. T'sou"
    ],
    "book": "COLING-ACL",
    "id": "acl-P98-2206",
    "title": "Chinese Word Segmentation without Using Lexicon and Hand-crafted Training Data",
    "url": "https://aclweb.org/anthology/P98-2206",
    "year": 1998
  },
  "references": [
    "acl-A97-1018",
    "acl-C92-1019",
    "acl-P94-1010",
    "acl-P97-1041"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "Chinese word segmentation is the first step in any Chinese NLP system.",
        "This paper presents a new algorithm for segmenting Chinese texts without making use of any lexicon and hand-crafted linguistic resource.",
        "The statistical data required by the algorithm, that is, mutual information and the difference of t-score between characters, is derived automatically from raw Chinese corpora.",
        "The preliminary experiment shows that the segmentation accuracy of our algorithm is acceptable.",
        "We hope the gaining of this approach will be beneficial to improving the performance(especially in ability to cope with unknown words and ability to adapt to various domains) of the existing segmenters, though the algorithm itself can also be utilized as a standalone segmenter in some NLP applications."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Any Chinese word is composed of either single or multiple characters.",
        "Chinese texts are explicitly concatenations of characters, words are not delimited by spaces as that in English.",
        "Chinese word segmentation is therefore the first step for any Chinese information processing system[1].",
        "Almost all methods for Chinese word segmentation developed so far, both statistical and rule-based, exploited two kinds of important resources, i.e., lexicon and hand-crafted linguistic resources(manually segmented and tagged corpus, knowledge for unknown words, and linguistic This work was supported in part by the National Natural Science Foundation of China under grant No.",
        "69433010. rules)[1,2,3,5,6,8,9,10].",
        "Lexicon is usually used as the means for finding segmentation candidates for input sentences, while linguistic resources for solving segmentation ambiguities.",
        "Preparation of these resources (well-defined lexicon, widely accepted tag set, consistent annotated corpus etc.)",
        "is very hard due to particularity of Chinese, and time consuming.",
        "Furthermore, even the lexicon is large enough, and the corpus annotated is balanced and huge in size, the word segmenter will still face the problem of data incompleteness, sparseness and bias as it is utilized in different domains.",
        "An important issue in designing Chinese segmenters is thus how to reduce the effort of human supervision as much as possible.",
        "Palmer(1997) conducted a Chinese segmenter which merely made use of a manually segmented corpus(without referring to any lexicon).",
        "A transformation-based algorithm was then explored to learn segmentation rules automatically from the segmented corpus.",
        "Sproat and Shih(1993) further proposed a method using neither lexicon nor segmented corpus: for input texts, simply grouping character pairs with high value of mutual information into words.",
        "Although this strategy is very simple and has many limitations(e.g., it can only treat bi-character words) , the characteristic of it is that it is fully automatic -- the mutual information between characters can be trained from raw Chinese corpus directly.",
        "Following the line of Sproat and Shih, here we present a new algorithm for segmenting Chinese texts which depends upon neither lexicon nor any hand-crafted resource.",
        "All data necessary for our system is derived from the raw corpus.",
        "The system may be viewed as a standalone segmenter in some applications (preliminary experiments show that its",
        "accuracy is acceptable); nevertheless, our main purpose is to study how and how well the work can be done by machine at the extreme conditions, say, without any assistance of human.",
        "We believe the performance of the existing Chinese segmenters, that is, the ability to deal with segmentation ambiguities and unknown words as well as the ability to adapt to new domains, will be improved in some degree if the gaining of this approach is incorporated into systems properly."
      ]
    },
    {
      "heading": "2. Principle",
      "text": []
    },
    {
      "heading": "2.1. Mutual information and difference of t-score between characters",
      "text": [
        "Mutual information and t-score, two important concepts in information theory and statistics, have been exploited to measure the degree of association between two words in an English corpus[4].",
        "We adopt these measures almost completely here, with one major modification: the variables in two relevant formulae are no longer words but Chinese characters.",
        "Definition 1 Given a Chinese character string txy', the mutual information between characters x and y(or equally, the mutual information of the location between x and y) is defined as:",
        "The distribution of mi(x:y) for sentence (1) is illustrated in Fig. 1(where \"*\" denotes x, y should be combined and \"IV be separated in terms of human judgment.",
        "This convention will be effective throughout the paper).",
        "The correct segmentation for (1) can be achieved when we decide that every location between x and y in the sentence be treated as 'combined' or 'separated' accordingly if its ml value is greater than or below a threshold(suppose the threshold is 3.0 for this example):",
        "for current world economy trend",
        "of an appropriate answer (Economic cooperation will be an appropriate answer to the trend of economics in current world) It is evident that x and y are to be strongly combined together if mi(x:y)>>0 and to be separated if mi(x:y)<<0.",
        "But if mi(x:y) 0, the association of x and y becomes uncertain.",
        "In the region of 2.0 mi <4.0, there exist",
        "some confusions: we have mi(ik A9=mi( )5> mi0f: 0), mi(7T:11)> mi( 4`)> mi( ffl), and mi(71-: E)>if), however, \"3:/z.",
        ";'\":",
        "E\"should be separated and \"/z..;.",
        ": be combined by human judgment -- the power of mi is somewhat weak in P(x)P(Y) where p(x,y) is the co-occurrence probability of x and y, and p(x), p(y) are the independent probabilities of x and y respectively.",
        "As claimed by Church(1991), the larger the mutual information between x and y, the higher the possibility of x and y being combined together.",
        "For example:",
        "ft gf fr i',1 gf – h gf fi 44 A RI 1=1 n t 57- .t1 gf – 1:1 Fig.I The distribution of mi(sentence I) Character pairs in sentence",
        "where p(yjx) is the conditional probability of y given x, and p(zly), of z given y, and var(p(y1x)), var(p(zly)) are variances of p(ylx) and of p(zly) respectively.",
        "Also as pointed out by Church(1991), tsz, (y) indicates the binding tendency of y in the context of x and z:",
        "A distinct feature of ts is that it is context-dependent (a relative measure), along with certain degree of flexibility to the context, whereas ml is context-independent (an absolute measure).",
        "Its drawback is it attaches to a character rather than to the location between two adjacent characters.",
        "This may cause some inconvenience if we want to unify it with mi.",
        "We initially introduce a new measure dts instead of ts: Definition 3 Given a Chinese character string ivxywi, the difference oft-score between characters x and y is defined as:",
        "between x and y, just like m (x: y) .",
        "And the context of dts(x: y) becomes 4 characters, 1 character larger than that of tsx,,(y) .",
        "The value of dts(x: y) reflects the competition results among four adjacent characters v, x, y and w:",
        "(x tends to combine with y, and y tends to combine with x) ==> dts(x:y)> 0 In this case, x and y attract each other.",
        "The location between x and y should be bound.",
        "(2) tsy (x) < 0 tsx,.",
        "(y)> 0",
        "(x tends to combine with v, and y tends to combine with w) ==> dts(x:y)< 0 0 ® --3-* In this case, x and y repel each other.",
        "The location between x and y should be separated.",
        "(x tends to combine with v, whereas y tends to combine with x) 0 In cases of (3a) and (3b), the status of the location between x and y is determined by the competition of tsv,), (x) and ts(y) :",
        "if dts(x:y)< 0 then it tends to be separated the 'intermediate' range of its value.",
        "To solve this problem, we need to seek other ways additionally.",
        "Definition 2 Given a Chinese character string ixyzi.",
        "the t-score of the character y relevant to characters x and z is defined as:",
        "The general rule governing dts is similar as that governing ml: the higher the difference of t-score between x and y, the stronger the combination strength between them, and vice versa.",
        "But the role of dts is somewhat different from that of ml: it is capable of complementing the 'blind area of ml on some occasions.",
        "Consider sentence (2) again.",
        "The distribution of (its for it is shown in Fig. 3.",
        "Return to the character pairs whose ml values fall into the region of 2.0 ml < 4.0 in Fig. 2, compare their dts values accordingly: dts(A: 17)> dts(g: > dts(.2TF: cits(g:)> dts(X:7)> dts(0.: 4‘) , and dts(Ij•: JD> E) -- the conclusion drawn from these comparisons is very close to the human judgment."
      ]
    },
    {
      "heading": "2.2. Local maximum and local minimum of dts",
      "text": [
        "Most of the character pairs in sentence (2) have got satisfactory explanations by their ml and dts so far. \"",
        "g : \"F:\" are two of few exceptions.",
        "We have mi(.0.",
        "> Ini(3f:4) and dts(g: > dts( JT: 0), however, the human judgment is the former should be separated and the latter be bound.",
        "Aiming at this, we further proposed two new concepts, that is, local maximum and local minimum of dts.",
        "Definition 4 Given 'vxyw' a Chinese character string, dts(x:y) is said to be a local maximum if dts(x.y)> dts(v:x) and dts(x:y)> dts(y:w).",
        "And, the height of the local maximum dts(x:y) is defined as:",
        "Definition 5 Given 'vxyw' a Chinese character string, dts(x:y) is said to be a local minimum if dts(x:y)< dts(v:x) and dts(x:y) < dts(y:w).",
        "And, the depth of the local minimum dts(x:y) is defined as:",
        "Two basic hypotheses can be easily made as the consequence of context-dependability of dts(note: mi has not such property): Hypothesis 1 x and y tends to be bound if dts(x:y) is a local maximum, regardless of the value of dts(x:y)(even it is low).",
        "Hypothesis 2 x and y tends to be separated if dts(x:y) is a local minimum, regardless of the value of dts(x:y)(even it is high).",
        "In Fig. 3, dts(g: A) is a local minimum whereas dts(fi: 02 isn't.",
        "At least we can say that \"4:\" is likely to be separated, as suggested by the hypothesis 2(though we still can say nothing more about \"TF:4\")."
      ]
    },
    {
      "heading": "2.3. The second local maximum and the second local minimum of dts",
      "text": [
        "We continue to define other four related concepts: Definition 6 Suppose 'vxyzw' is a Chinese character string, and dts(x:y) is a local maximum.",
        "Then dts(y:z) is said to be the right second local maximum of dts(x:y) if dts(y:z)> dts(v:x) and dts(y:z)> dts(z:w).And, the distance between the local maximum and the second local maximum is defined as:",
        "character string, and dts(xsy) is a local minimum.",
        "Then dts(y:z) is said to be the right second local minimum of dts(x:y) if dts(y:z)< dts(v:x) and dts(y:z)< dts(z:w).",
        "And, the distance between the local minimum and the second local minimum is defined as:",
        "The left second local maximum and the left second local minimum of dts(x:y) can be defined similarly.",
        "Refer to Fig. 3.",
        "By definition, clis(if: A is the left second local minimum of dts(0: 4), and dts(X: A) is the right second local maximum of dts( : ) meanwhile the left second local minimum of dts(A?",
        "E).",
        "These four measures are designed to deal with two common construction types in Chinese word formation: \"2 characters + 1 character\" and \"1 character + 2 characters\".",
        "We will skip the discussion about this due to the limited volume of the paper."
      ]
    },
    {
      "heading": "3. Algorithm",
      "text": [
        "The basic idea is to try to integrate all of the measures introduced in section 2 together into an algorithm, making best use of the advantages and bypassing the disadvantages of them under different conditions.",
        "Given an input sentence S, let pm,: the mean of ml of all locations in S; : the standard deviation of mi of all locations in S; P dr.,: the mean of dts of all locations in S; (in fact, iid„.",
        "0) o-dis : the standard deviation of dts of all locations in S we divide the distribution graphs of ml and dts of S into several regions(4 regions for each graph)",
        "The algorithm scans the input sentence S from left to right two times: The first round for S For any location (x:y) in S, do",
        "1. in cases that <dts(x:y), mi(x:y)> falls into: 1.1 Aa or Ba or Ca or Da or Ab mark (x:y) 'bound'",
        "2.",
        "For (x:y) unmarked so far, mark it as except that:",
        "if dts(x:y) is the second local maximum then if dis(locmax, x:y) <",
        "then mark (x:y) if (x:y) is the right second local max or if (x:y) is the left second local max if dts(x:y) is the second local minimum then if dis(locmin, x:y) < 0.5 X lrmin(loc,x:y) then mark (x:y) – ' if (x:y) is the right second local minor if (x:y) is the left second local min The second round for S if (x:y) is marked \"?'",
        "then if mi(x:y)...?- 0 then mark (x:y) 'bound' else 'separated' if (x:y) is marked then the status of (x:y) follows that of the adjacent location on the left side if (x:y) is marked then the status of (x:y) follows that of the adjacent location on the right side (The constants 81,are",
        "and 0 =2.5) Generally speaking, the lower the <dts(x:y), mi(x:y)> in distribution graphs, the more restrictive the constraints.",
        "Take 'bound' operation as example: there is not any additional condition in case 1.1; in case 1.6 however, the existence of a local maximum is needed; in case 1.3, a requirement for the height of local maximum is added; in case 1.4, the height required becomes even higher; and in case 1.5, which is the worst case for 'bound' operation, the height must be high enough.",
        "Case 2 says if the second local maximum is pretty near to the local maximum corresponded, then its status ('bound' or 'separated') would be likely to be consistent with that of the local maximum.",
        "So does the second local minimum.",
        "Finally, for locations marked \"?'",
        "with which we have no more means to cope, simply make decisions by the value of mi(1,ve set it to 2.5, same as that in the system of Sproat and Shih(1993)).",
        "Recall sentence (2).",
        "The character pair \"-R: .",
        "{.±\" is regarded as 'separated' successfully by following E.\"(local minimum) with the rule in case 2 although its mi value is rather high(3.4).",
        "\"}f: is marked 'T in the first round and treated properly by 0 in the second round.",
        "The algorithm outputs the correct segmentation for sentence (2) at last:",
        "Note that there exist two ambiguous fragments \"/L;TF\"(\"/L3f I 1r or \"ii.3=M\") and or \"k ffa I 4\"), as well as two proper nouns \"France\" and \"Paris\" in sentence (2)."
      ]
    },
    {
      "heading": "4. Experimental results",
      "text": [
        "We select 100 Chinese sentences, consisting of 1588 characters (or 1587 locations between character pairs) randomly as testing texts.",
        "The statistical data required by calculating ml and dts, in fact it is character bigram, is automatically derived from a news corpus of about 20M Chinese characters.",
        "The testing texts and training corpus are mutually excluded.",
        "Out of 1587 locations in the testing texts, 1456 are correctly marked by our algorithm.",
        "We define the accuracy of segmentation as: of locations being correctly marked # of locations in texts Then, the accuracy for testing texts is 1456/1587 = 91.75%.",
        "The distribution of local maximum, local minimum and other types of dts value(involving the second local maximum and the second local minimum) of the testing texts over <dts, mi> regions is summarized in Fig. 4 (Fig.",
        "5 is the same distribution in percentage representation).",
        "This would be helpful for readers to understand our algorithm.",
        "Future work includes: (1) enlarging the size of",
        "experiments; (2) refining the algorithm by studying the relationship between mi and dts in depth; and (3) integrating it as a module with the existing Chinese segmenters so as to improve their performance (especially in ability to cope with unknown words and ability to adapt to various domains).",
        "-- it is indeed the ultimate goal of our research here."
      ]
    },
    {
      "heading": "5. Acknowledgments",
      "text": [
        "This work benefited a lot from discussions with Professor Huang Changning of Tsinghua University, Bejing, China.",
        "We would also like to thank anonymous COLING-ACL'98 reviewers for their helpful comments."
      ]
    }
  ]
}
