{
  "info": {
    "authors": [
      "Jan Hajič",
      "Barbora Hladká"
    ],
    "book": "COLING-ACL",
    "id": "acl-P98-1080",
    "title": "Tagging Inlective Languages: Prediction of Morphological Categories for a Rich Structured Tagset",
    "url": "https://aclweb.org/anthology/P98-1080",
    "year": 1998
  },
  "references": [
    "acl-A88-1019",
    "acl-H93-1047",
    "acl-J94-2001",
    "acl-J96-1002",
    "acl-P93-1035",
    "acl-P98-1080"
  ],
  "sections": [
    {
      "heading": "Abstrakt (éesky)",
      "text": [
        "{This short abstract is in Czech.",
        "For illustration purposes, it has been tagged by our tagger; errors are printed underlined and corrections are shown.}"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "The major obstacle in morphological (sometimes called morpho-syntactic, or extended POS) tagging of highly inflective languages, such as Czech or Russian, is – given the resources possibly available – the tagset size.",
        "Typically, it is in the order of thousands.",
        "Our method uses an exponential probabilistic model based on automatically selected features.",
        "The parameters of the model are computed using simple estimates (which makes training much faster than when one uses Maximum Entropy) to directly minimize the error rate on training data.",
        "The results obtained so far not only show good performance on disambiguation of most of the individual morphological categories, but they also show a significant improvement on the overall prediction of the resulting combined tag over a HMM-based tag n-gram model, using even substantially less training data."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": []
    },
    {
      "heading": "1.1 Orthogonality of morphological categories of inflective languages",
      "text": [
        "The major obstacle in morphologicall tagging of highly inflective languages, such as Czech or Russian, is – given the resources possibly available – the tagset size.",
        "Typically, it is in the order of thousands.",
        "This is due to the (partial) \"orthogonality\"2 of simple morphological categories, which then multiply when creating a \"flat\" list of tags.",
        "However, the individual categories contain only a very small number of different values; e.g., number has five (Sg, Pl, Dual, Any, and \"not applicable\"), case nine etc.",
        "The \"orthogonality\" should not be taken to mean complete independence, though.",
        "Inflectional languages (as opposed to agglutinative languages such as Finnish or Hungarian) typically combine several certain categories into one morpheme (suffix or ending).",
        "At the same time, the morphemes display a high degree of ambiguity, even across major POS categories.",
        "For example, most of the Czech nouns can form singular and plural forms in all seven cases, most adjectives can (at least potentially) form all (4) genders, both numbers, all (7) cases, all (3) degrees of comparison, and can be either of positive or negative polarity.",
        "That gives 336 possibilities (for adjectives), many of them homonymous on the surface.",
        "On the other hand, pronouns and numerals do",
        "not display such an orthogonality, and even adjectives are not fully orthogonal – an ancient \"dual\" number, happily living in modern Czech in the feminine, plural and instrumental case adds another 6 sub-orthogonal possibilities to almost every adjective.",
        "Together, we employ 3127 plausible combinations (including style and diachronic variants)."
      ]
    },
    {
      "heading": "1.2 The individual categories",
      "text": [
        "There are 13 morphological categories currently used for morphological tagging of Czech: part of speech, detailed POS (called \"subpart of speech\"), gender, number, case, possessor's gender, possessor's number, person, tense, degree of comparison, negativeness (affirmative/negative), voice (active/passive), and variant/register.",
        "The POS category contains only the major part of speech values (noun (N), verb (V), adjective (A), pronoun (P), verb (V), adjective (A), adverb (D), numeral (C), preposition (R), conjunction (J), interjection (I), particle (T), punctuation (Z), and \"undefined\" (X)).",
        "The \"subpart of speech\" (SUBPOS) contains details about the major category and has 75 different values.",
        "For example, verbs (POS: V) are divided into simple finite form in present or future tense (B), conditional (c), infinitive (f), imperative (i), etc.3 All the categories vary in their size as well as in their unigram entropy (see Table 1) computed using the standard entropy definition",
        "where p is the unigram distribution estimate based on the training data, and Y is the set of possible values of the category in question.",
        "This formula can be rewritten as",
        "where p is the unigram distribution, D is the data and IDI its size, and yi is the value of the category in question at the i – th event (or position) in the data.",
        "The form (2) is usually used for cross-entropy computation on data (such as test data) different from those used for estimating p. The base of the log function is always taken to be 2."
      ]
    },
    {
      "heading": "1.3 The morphological analyzer",
      "text": [
        "Given the nature of inflectional languages, which can generate many (sometimes thousands of) forms for a given lemma (or \"dictionary entry\"), it is necessary to employ morphological analysis before the tagging proper.",
        "In Czech, there are as many as 5 different lemmas (not counting underlying derivations nor",
        "word senses) and up to 108 different tags for an input word form.",
        "The morphological analyzer used for this purpose (Hajit, in prep.",
        "), (Hajit, 1994) covers about 98% of running unrestricted text (newspaper, magazines, novels, etc.).",
        "It is based on a lexicon containing about 228,000 lemmas and it can analyze about 20,000,000 word forms."
      ]
    },
    {
      "heading": "2 The Training Data",
      "text": [
        "Our training data consists of about 130,000 tokens of newspaper and magazine text, manually double-tagged and then corrected by a single judge.",
        "Our training data consists of about 130,000 tokens of newspaper and magazine text, manually tagged using a special-purpose tool which allows for easy disambiguation of morphological output.",
        "The data has been tagged twice, with manual resolution of discrepancies (the discrepancy rate being about 5%, most of them being simple tagging errors rather than opinion differences).",
        "One data item contains several fields: the input word form (token), the disambiguated tag, the set of all possible tags for the input word form, the disambiguated lemma, and the set of all possible lemmas with links to their possible tags.",
        "Out of these, we are currently interested in the form, its possible tags and the disambiguated tag.",
        "The lemmas are ignored for tagging purposes.",
        "The tag from the \"disambiguated tag\" field as well as the tags from the \"possible tags\" field are further divided into so called subtags (by morphological category).",
        "In the set \"possible tags field\", 41n fact, tagging helps in most cases to disambiguate the lemmas.",
        "Lemma disambiguation is a separate process following tagging.",
        "The lemma disambiguation is a much simpler problem – the average number of different lemmas per token (as output by the morphological analyzer) is only 1.15.",
        "We do not cover the lemma disambiguation procedure here.",
        "the ambiguity on the level of full (combined) tags is mapped onto so called \"ambiguity classes\" (AC-s) of subtags.",
        "This mapping is generally not reversible, which means that the links across categories might not be preserved.",
        "For example, the word form jen for which the morphology generates three possible tags, namely, TT (particle \"only\"), and NNIS1 A and NNIS4 A (noun, masc.",
        "inanimate, singular, nominative (1) or accusative (4) case; \"yen\" (the Japanese currency)), will be assigned six ambiguous ambiguity classes (NT, NT, -I, -S, -14, -A, for POS, subpart of speech, gender, number, case, and negation) and 7 unambiguous ambiguity classes (all -).",
        "An example of the training data is presented in Fig. 1.",
        "It contains three columns, separated by the vertical bar (I):",
        "1. the \"truth\" (the correct tag, i.e. a sequence of 13 subtags, each represented by a single character, which is the true value for each individual category in the order defined in Fig. 1 (1st column: POS, 2nd: SUBPOS, etc.)",
        "2. the 13-tuple of ambiguity classes, separated by a slash (/), in the same order; each ambiguity class is named using the single character subtags used for all the possible values of that category; 3. the original word form.",
        "Please note that it is customary to number the seven grammatical cases in Czech: (instead of naming them): \"nominative\" gets 1, \"genitive\" 2, etc.",
        "There are four genders, as the Czech masculine gender is divided into masculine animate (M) and inanimate (I).",
        "Fig.",
        "1 is a typical example of the ambiguities encountered in a running text: little POS ambiguity, but a lot of gender, number and case ambiguity (columns 3 to 5)."
      ]
    },
    {
      "heading": "3 The Model",
      "text": [
        "Instead of employing the source-channel paradigm for tagging (more or less explicitly present e.g. in (Merialdo, 1992), (Church, 1988), (Hajit., Hladka, 1997)) used in the past (notwithstanding some exceptions, such as Maximum Entropy and rule-based taggers), we are using here a \"direct\" approach to modeling, for which we have chosen an exponential probabilistic model.",
        "Such model (when predicting an event5 y E Y in a context x) has the general form",
        "where A(y , x) is the set (of size n) of binary-valued (yes/no) features of the event value being predicted and its context, Ai is a \"weigth\" (in the exponential sense) of the feature A, and the normalization factor",
        "We use a separate model for each ambiguity class AC (which actually appeared in the training data) of each of the 13 morphological categories6.",
        "The final PAC (Yix) distribution is further smoothed using unigram distributions on subtags (again, separately for each category).",
        "Such smoothing takes care of any unseen context; for ambiguity classes not seen in the training data, for which there is no model, we use unigram probabilities of subtags, one distribution per category.",
        "In the general case, features can operate on any imaginable context (such as the speed of the wind over Mt.",
        "Washington, the last word of yesterday TV news, or the absence of a noun in the next 1000 words, etc.).",
        "In practice, we view the context as a set of attribute-value pairs with a discrete range of values (from now on, we will use the word \"context\" for such a set).",
        "Every feature can thus be represented by a set of contexts, in which it is positive.",
        "There is, of course, also a distinguished attribute for the value of the variable being predicted (y); the rest of the attributes is denoted by x as expected.",
        "Values of attributes will be denoted by an overstrike (y,1).",
        "The pool of contexts of prospective features is for the purpose of morphological tagging defined as a",
        "full crossproduct of the category being predicted (y) and of the x specified as a combination of: 1. an ambiguity class of a single category, which may be different from the category being predicted, or 2. a word form and 1. the current position, or 2. immediately preceding (following) position in text, or 3. closest preceding (following) position (up to",
        "four positions away) having a certain ambiguity class in the POS category Let now",
        "where Cat E Categories and CatAc is the ambiguity class AC (such as AN, for adjective/noun ambiguity of the part of speech category) of a morphological category Cat (such as POS).",
        "For example, the function f POS AN ,A,7 is well-defined (A E {A,N}), whereas the function fc As is not (6 ft {1, 4, 5}).",
        "We will introduce the notation of the context part in the examples of feature value computation below.",
        "The indexes may be omitted if it is clear what category, ambiguity class, the value of the category being predicted and/or the context the feature belongs to.",
        "The value of a well-defined feature function f c at Ac ,v,7(Y 7x) is determined by",
        "This definition excludes features which are positive for more than one y in any context x.",
        "This property will be used later in the feature selection algorithm.",
        "As an example of a feature, let's assume we are predicting the category CASE from the ambiguity class 145, i.e. the morphology gives us the possibility to assign nominative (1), accusative (4) or vocative (5) case.",
        "A feature then is e.g.",
        "The resulting case is nominative (1) and the following word form is pracuj e (lit.",
        "(it) works)",
        "denoted as icAsE145,1,(FoRm+i=pracuje), or The resulting case is accusative (4) and the closest preceding preposition's case has the ambiguity class 46 denoted as .fcA sE145,4, (C A S E_ pos=R=46)• The feature fposNv,N,(POS-1=--A,CASE_1=145) will be positive in the context of Fig. 2, but not in the context of Fig. 3.",
        "The full crossproduct of all the possibilities outlined above is again restricted to those features which have actually appeared in the training data more than a certain number of times.",
        "Using ambiguity classes instead of unique values of morphological categories for evaluating the (context part of the) features has the advantage of giving us the possibility to avoid Viterbi search during tagging.",
        "This then allows to easily add loolcahead (right) context.",
        "There is no \"forced relationship\" among categories of the same tag.",
        "Instead, the model is allowed to learn also from the same-position \"context\" of the subtag being predicted.",
        "However, when using the model for tagging one can choose between two modes of operation: separate, which is the same mode used when training as described herein, and VTC (Valid Tag Combinations) method, which does not allow for impossible combinations of categories.",
        "See Sect.",
        "5 for more details and for the impact on the tagging accuracy."
      ]
    },
    {
      "heading": "4 Training",
      "text": []
    },
    {
      "heading": "4.1 Feature Weights",
      "text": [
        "The usual method for computing the feature weights (the Ai parameters) is Maximum Entropy (Berger 8It remains to be seen whether using the unique values - at least for the left context - and employing Viterbi would help.",
        "The results obtained so far suggest that probably not much, and if yes, then it would restrict the number of features selected rather than increase tagging accuracy.",
        "Sz al., 1996).",
        "This method is generally slow, as it requires lot of computing power.",
        "Based on our experience with tagging as well as with other projects involving statistical modeling, we assume that actually the weights are much less important than the features themselves.",
        "We therefore employ very simple weight estimation.",
        "It is based on the ratio of conditional probability of y in the context defined by the feature .6;7 and the uniform distribution for the ambiguity class AC."
      ]
    },
    {
      "heading": "4.2 Feature Selection",
      "text": [
        "The usual guiding principle for selecting features of exponential models is the Maximum Likelihood principle, i.e. the probability of the training data is being maximized.",
        "(or the cross-entropy of the model and the training data is being minimized, which is the same thing).",
        "Even though we are eventually interested in the final error rate of the resulting model, this might be the only solution in the usual source-channel setting where two independent models (a language model and a \"translation\" model of some sort – acoustic, real translation etc.)",
        "are being used.",
        "The improvement of one model influences the error rate of the combined model only indirectly.",
        "This is not the case of tagging.",
        "Tagging can be seen as a \"final application\" problem for which we assume to have enough data at hand to train and use just one model, abandoning the source-channel paradigm.",
        "We have therefore used the error rate directly as the objective function which we try to minimize when selecting the model's features.",
        "This idea is not new, but as far as we know it has been implemented in rule-based taggers and parsers, such as (Brill, 1993a), (Brill, 1993b), (Brill, 1993c) and (Ribarov, 1996), but not in models based on probability distributions.",
        "Let's define the set of contexts of a set of features:",
        "where F is some set of features of interest.",
        "The features can therefore be grouped together based on the context they operate on.",
        "In the current implementation, we actually add features in \"batches\".",
        "A \"batch\" of features is defined as a set of features which share the same context 7 (see the definition below).",
        "Computationaly, adding features in batches is relatively cheap both time and space-wise.",
        "For example, the features",
        "share the context (POS_i = A,CASE_i = 145).",
        "Let further",
        "• FAG, be the pool of features available for selection.",
        "• SAC be the set of features selected so far for a model for ambiguity class AC, • PsAc(Yid) the probability, using model (3-5) with features SAC, of subtag y in a context defined by position d in the training data, and • FAc,,y be the set (\"batch\") of features sharing the same context X', i.e.",
        "Note that the size of AC is equal to the size of any batch of features (fACI = IFAc,71 for any T).",
        "The selection process then proceeds as follows:",
        "1.",
        "For all contexts Y E X(FAc) do the following: 2.",
        "For all features f = fy,y E FAc,2- compute their associated weights )f using the formula:",
        "3.",
        "Compute the error rate of the training data by going through it and at each position d selecting the best subtag by maximizing PSAC UFA c ,7 (Y I d) over all y E AC.",
        "4.",
        "Select such a feature set FAcvi which results in the maximal improvement in the error rate of the training data and add all f E FAC,Y Permanently to SAC; with SAC now extended, start from the beginning (unless the termination condition is met), 5.",
        "Termination condition: improvement in error rate smaller than a preset minimum.",
        "The probability defined by the formula (11) can easily be computed despite its ugly general form, as the denominator is in fact the number of (positive) occurrences of all the features from the batch defined by the context 7 in the training data.",
        "It also helps if the underlying ambiguity class AC is found only in a fraction of the training data, which is typically the case.",
        "Also, the size of the batch (equal to IACI) is usually very small.",
        "On top of rather roughly estimating the Af parameters, we use another implementation shortcut here: we do not necessarily compute the best batch of features in each iteration, but rather add all (batches of) features which improve the error rate by more than a threshold 6.",
        "This threshold is set to half the number of data items which contain the ambiguity class AC at the beginning of the loop, and then is cut in half at every iteration.",
        "The positive consequence of this shortcut (which certainly adds some unnecessary features) is that the number of iterations is much smaller than if the maximum is regularly computed at each iteration."
      ]
    },
    {
      "heading": "5 Results",
      "text": [
        "We have used 130,000 words as the training set and a test set of 1000 words.",
        "There have been 378 different ambiguity classes (of subtags) across all categories.",
        "We have used two evaluation metrics: one which evaluates each category separately and one \"flatlist\" error rate which is used for comparison with other methods which do not predict the morphological categories separately.",
        "We compare the new method with results obtained on Czech previously, as reported in (Hladka, 1994) and (Hajit, Hladka,, 1997).",
        "The apparently high baseline when compared to previously reported experiments is undoubtedly due to the introduction of multiple models based on ambiguity classes.",
        "In all cases, since the percentage of text tokens which are at least two-way ambiguous is about 55%, the error rate should be almost doubled if one wants to know the error rate based on ambiguous words only.",
        "The baseline, or \"smoothing-only\" error rate was at 20.7% in the test data and 22.18 % in the training data.",
        "Table 2 presents the initial error rates for the individual categories computed using only the smoothing part of the model (n = 0 in equation 3).",
        "Training took slightly under 20 hours on a Linux-powered Pentium 90, with feature adding threshold set to 4 (which means that a feature batch was not added if it improved the absolute error rate on training data by 4 errors or less).",
        "840 (batches) of features (which corresponds to about 2000 fully specified features) have been learned.",
        "The tagging itself is (contrary to training) very fast.",
        "The average speed is about 300 words/sec.",
        "on morphologically prepared data on the same machine The results are summarized in Table 3.",
        "There is no apparent overtraining yet.",
        "However, it does appear when the threshold is lowered (we have tested that on a smaller set of training data consisting of 35,000 words: overtraining started to occur when the threshold was down to 2-3).",
        "achieved with the previous experiments on Czech tagging (Haji'd, Hladka, 1997).",
        "It shows that we got more than 50% improvement on the best error rate achieved so far.",
        "Also the amount of training data used was lower than needed for the HMM experiments.",
        "We have also performed an experiment using 35,000 training words which yielded by about 4% worse results (88% combined tag accuracy).",
        "Finally, Table 5 compares results (given differ",
        "ent training thresholds9) obtained on larger training data using the \"separate\" prediction method discussed so far with results obtained through a modification, the key point of which is that it considers only \"Valid (sub)Tag Combinations (VTC)\".",
        "The probability of a tag is computed as a simple product of subtag probabilities (normalized), thus assuming subtag independence.",
        "The \"winner\" is presented in boldface.",
        "As expected, the overall error rate is always better using the VTC method, but some of the subtags are (sometimes) better predicted using the \"separate\" prediction method19.",
        "This could have important practical consequences - if, for example, the POS or SUBPOS is all that's interesting."
      ]
    },
    {
      "heading": "6 Conclusion and Further Research",
      "text": [
        "The combined error rate results are still far below the results reported for English, but we believe that there is still room for improvement.",
        "Moreover, splitting the tags into subtags showed that \"pure\" part of speech (as well as the even more detailed \"subpart\" of speech) tagging gives actually better results than those for English.",
        "We see several ways how to proceed to possibly improve the performance of the tagger (we are still talking here about the \"single best tag\" approach; the n-best case will be explored separately): • Disambiguated tags (in the left context) plus Viterbi search.",
        "Some errors might be eliminated if features asking questions about the disambiguated context are being used.",
        "The disambiguated tags concentrate - or transfer - information about the more distant context.",
        "It would avoid \"repeated\" learning of the same or similar features for different but related disambiguation problems.",
        "The final effect on the overall accuracy is yet to be seen.",
        "Moreover, the transition function assumed by the Viterbi algorithm must be reasonably defined (approximated).",
        "• Final re-estimation using maximum entropy.",
        "Let's imagine that after selecting all the features using the training method described here we recompute the feature weights using the usual maximum entropy objective function.",
        "This will produce better (read: more principled) weight estimates for the features already selected, but it might help as well as hurt the performance.",
        "• Improved feature pool.",
        "This is, according to our opinion, the source of major improvement.",
        "The error analysis shows that in many cases the",
        "context to be used for disambiguation has not been used by the tagger simply because more sophisticated features have not been considered for selection.",
        "An example of such a feature, which would possibly help to solve the very hard and relatively frequent problem of disambiguating between nominative and accusative cases of certain nouns, would be a question \"Is there a noun in nominative case only in the same clause?\"",
        "- every clause may usually have only one noun phrase in nominative, constituting its subject.",
        "For such feature to work we will have to correctly determine or at least approximate the clause boundaries, which is obviously a nontrivial task by itself."
      ]
    },
    {
      "heading": "7 Acknowledgements",
      "text": [
        "Various parts of this work has been supported by the following grants: Open Foundation RSS/HESP 195/1995, Grant Agency of the Czech Republic (GAR) 405/96/K214, and Ministry of Education Project No.",
        "VS96151.",
        "The authors would also like to thank Fred Jelinek of CLSP JHU Baltimore for valuable comments and suggestions which helped to improve this paper a lot."
      ]
    }
  ]
}
