{
  "info": {
    "authors": [
      "Kenneth R. Beesley"
    ],
    "book": "COLING-ACL",
    "id": "acl-P98-1018",
    "title": "Consonant Spreading in Arabic Stems",
    "url": "https://aclweb.org/anthology/P98-1018",
    "year": 1998
  },
  "references": [
    "acl-C88-1064",
    "acl-C92-1025",
    "acl-C94-1029",
    "acl-C96-1017",
    "acl-C96-2112",
    "acl-E87-1002",
    "acl-E91-1016",
    "acl-J94-3001",
    "acl-P84-1038"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper examines the phenomenon of consonant spreading in Arabic sterns.",
        "Each spreading involves a local surface copying of an underlying consonant, and, in certain phonological contexts, spreading alternates productively with consonant lengthening (or gemination).",
        "The morphophonemic triggers of spreading lie in the patterns or even in the roots themselves, and the combination of a spreading root and a spreading pattern causes a consonant to be copied multiple times.",
        "The interdigitation of Arabic stems and the realization of consonant spreading are formalized using finite-state mor-photactics and variation rules, and this approach has been successfully implemented in a large-scale Arabic morphological analyzer which is available for testing on the Internet."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Most formal analyses of Semitic languages, including Arabic, defend the reality of abstract, unpronounceable morphemes called ROOTS, consisting usually of three, but sometimes two or four, consonants called RADICALS.",
        "The classic examples include ktb a1)', appearing in a number of words having to do with writing, books, schools, etc.",
        "; and drs .",
        ")), appearing in words having to do with studying, learning, teaching, etc.",
        "Roots combine non-concatenatively with PATTERNS to form STEMS, a process known informally as INTERDIGITA-TION or INTERCALATION.",
        "We shall look first at Arabic stems in general before examining GEMINATION and SPREADING, related phenomena wherein a single underlying radical is real",
        "ized multiple times in a surface string.",
        "Semitic morphology, including stem interdigitation and spreading, is adequately and elegantly formaliz-able using finite-state rules and operations."
      ]
    },
    {
      "heading": "1.1 Arabic Stems",
      "text": [
        "The stems in Figure 12 share the drs root morpheme, and indeed they are traditionally organized under a drs heading in printed lexicons like the authoritative Dictionary of Modern Written Arabic of Hans VVehr (1979).",
        "A root morpheme like drs interdigitates with a pattern morpheme, or, in some analyses.",
        "with a pattern and a separate vocalization morpheme, to form abstract stems.",
        "Because interdigitation involves pattern elements being inserted between the radicals of the root morpheme, Semitic stem formation is a classic example of non-concatenative morphotactics.",
        "Separating and identifying the component morphemes of words is of course the core task of morphological analysis for any language, and analyzing Semitic stems is a classic challenge",
        "for any morphological analyzer."
      ]
    },
    {
      "heading": "1.2 Interdigitation as Intersection",
      "text": [
        "Finite-state morphology is based on the claim that both morphotactics and phonological/orthographical variation rules, i.e. the relation of underlying forms to surface forms, can be formalized using finite-state automata (Kaplan and Nay, 1981; Karttunen, 1991; Kaplan and Nay, 1994).",
        "Although the most accessible computer implementations (Koskenniemi, 1983; Antworth, 1990; Karttunen, 1993) of finite-state morphotactics have been limited to building words via the concatenation of morphemes, the theory itself does not have this limitation.",
        "In Semitic morphotactics, root and pattern morphemes (and, according to one's theory, perhaps separate vocalization morphemes) are naturally formalized as regular languages, and stems are formed by the intersection, rather than the concatenation, of these regular languages.",
        "Such analyses have been laid out elsewhere (Kataja and Koskenniemi, 1988; Beesley, 1998a; Beesley, 1998b) and cannot be repeated here.",
        "For present purposes, it will suffice to view morphophonemic (underlying) stems as being formed from the intersection of a root and a pattern, where patterns contain vowels and C slots into which root radicals are, intuitively speaking, \"plugged\", as in the following Form I perfect active and passive verb examples.",
        "Prefixes and suffixes concatenate onto the stems in the usual way to form complete, but still morphophonemic, words; and finite-state variation rules are then applied to map the morphophonemic strings into strings of surface phonemes or orthographical characters.",
        "For an overview of this approach, see Karttunen, Kaplan and Zae-nen (1992).",
        "Following Harris (1941) and Hudson (1986), and unlike McCarthy (1981), we also allow the patterns to contain non-radical consonants as in the following perfect active Form VII, Form VIII and Form X examples.",
        "In this formalization, noun patterns work exactly like verb patterns, as in the following examples:",
        "Where such straightforward intersection of roots and patterns into stems would appear to break down is in cases of gemination and spreading, where a single root radical appears multiple times in a surface stem."
      ]
    },
    {
      "heading": "2 Arabic Consonant Gemination and Spreading",
      "text": []
    },
    {
      "heading": "2.1 Gemination in Forms II and V",
      "text": [
        "Some verb and noun stems exhibit a double realization (a copying) of an underlying radical, resulting in gemination3 or spreading at the surface level.",
        "Looking at gemination first, it is best known from verb stems known in the European tradition as Forms II and V, where the middle radical is doubled.",
        "Kay's (1987) pattern notation uses a G symbol before the C slot that needs to be doubled.' 3 Gemination in Arabic words can alternatively be analyzed as consonant lengthening, as in Harris (1941) and as implied by Holes (1995).",
        "This solution is very attractive if the goal is to generate fully-voweled orthographical surface strings of Arabic, but for the phonological examples in this paper we adopt the gemination representation as used by phonologists like McCarthy (1981).",
        "4 Kay's stem-building mechanism, using a multi-tape transducer implemented in Prolog, sees G on the pattern tape and writes a copy of the middle radical on the stern tape without consuming it.",
        "Then the following C does the same but consumes the radical symbol in the usual way.",
        "Kay's analysis in fact abstracts out the vocaliza",
        "In the same spirit, but with a different mechanism, our Form II and Form V patterns contain an X symbol that appears after the consonant slot to be copied.",
        "As in all cases, the stem is formed by straightforward intersection, resulting in abstract stems like darXas.",
        "The X symbol is subsequently realized via finite-state variation rules as a copy of the preceding consonant in a phonological grammar (/darras/) or, in an orthographical system such as ours, as an optionally written shadda diacritic (0...:5S).",
        "Finite-state rules to effect such"
      ]
    },
    {
      "heading": "limited local copying are trivially written.5 2.2 Gemination/Spreading in Form IX",
      "text": [
        "Spreading, which appears to involve consonant copying over intervening phonemes, is not so different from gemination; and indeed it is common in \"spreading\" verb stems for the spreading to alternate productively with gemination.",
        "The best known example of Arabic consonant spreading is the verbal stem known as Form IX (the same behavior is also seen in Form XI, Form XIV, Form QIV and in several noun forms).",
        "A typical example is the root dhm (r a which in Form IX has the meaning \"become black\".",
        "Spreading is not terribly common in Modern Standard Arabic, but it occurs in enough verb and noun forms to deserve, in our opinion, full treatment.",
        "In our lexicon of about 4930 roots, tion, placing it on a separate transducer tape, but this difference is not important here.",
        "For extensions of this multi-tape approach see Kiraz (1994; 1996).",
        "The current approach differs from the multi-tape approaches in formalizing roots, patterns and vocalizations as regular languages and by computing (\"linearizing\") the stems at compile time via intersection of these regular languages (Beesley, 1998a; Beesley, 1998b).",
        "5See, for example, the rules of Antworth (1990) for handling the limited reduplication seen in Tagalog.",
        "20 have Form IX possibilities (see Figure 2).",
        "Most of them (but not all) share the general meaning of being or becoming a certain color.",
        "McCarthy (1981) and others (Kay, 1987; Kiraz, 1994; Bird and Blackburn, 1991) postulate an underlying Form IX stem for dhm that looks like dhamam, with a spreading of the final m radical; other writers like Beeston (1968) list the stem as dhamm, with a geminated or lengthened final radical.",
        "In fact, both forms do occur in full surface words as shown in Figure 3, and the difference is productively and straightforwardly phonological.",
        "For perfect endings like +a ('he') and +at ('she'), the final consonant is geminated (or \"lengthened\", depending on your formal point of view).",
        "If, however, the suffix begins with a consonant, as in -Eta ( 'I') or +ta ('you, masc.",
        "sg.'), then the separated or true spreading occurs.",
        "From a phonological view, and reflecting the",
        "notation of Beeston, it is tempting to formalize the underlying Form IX perfect active pattern as CCaCX so that it intersects with root dhm to form dhamX.",
        "When followed by a suffix beginning with a vowel such as +a or +at, phonologically oriented variation rules would realize the X as a copy of the preceding consonant (/dhamm/).",
        "Arabic abhors consonant clusters, and it resorts to various \"cluster busting\" techniques to eliminate them.",
        "The final phonological realization would include an epenthetical /2i/ on the front, to break up the dh cluster, and would treat the copied m as the onset of a syllable that includes the suffix: /?id-ham-ma/, or, orthographically, PeSI.",
        "When followed by a suffix beginning with a consonant, as in dhamX+tu, the three-consonant cluster would need to be broken up by another epenthetic vowel as in /?id-ha-mam-tu/, or, orthographically, However, However, for reasons to become clearer below when we look at bilit-eral roots, we defined an underlying Form IX perfect active pattern CCaCaX leading to abstract stems like dhamaX."
      ]
    },
    {
      "heading": "2.3 Other Cases of Final Radical Gemination/Spreading",
      "text": [
        "Other verb forms where the final radical is copied include the rare Forms XI and XIV.",
        "Root lhj ( r o j) intersects with the Form XI perfect active pattern CCaaCaX to form the abstract stem lhaajaX ( \"curdle\" / \"coagulate\" ), leading to surface forms like /7il-haaj-ja/ (LW) and flil-haa-jaj-tu/ (Lt) that vary exactly as in Form IX.",
        "The same holds for root shb o ,p), which takes both Form IX (shabaX) and Form XI (shaabaX), both meaning \"become reddish\".",
        "In our lexicon, one root Os („7, 3) takes form XIV, with patterns like the perfect active CCanCaX and imperfect active CCanCiX (-be pigeon-breasted\").",
        "Other similar Form XIV examples probably exist but are not reflected in the current dictionary.",
        "Aside from the verbal nouns and participles of Forms IX, XI and XIV, other noun-like patterns also involve the spreading of the final radical.",
        "These include CiCCiiX and Ca-CaaCiiX, taken by roots nhr ( 3), meaning \"skilled/experienced\", and rCd meaning \"coward/cowardly\".",
        "The CaCaaCiiX pattern also serves as the broken (i.e. irregular) plural for CuCCuuX stems for the roots zit- L.:,) meaning \"ill-tempered\", stir ü c 00) meaning \"thrush/blackbird\", lyd J) meaning \"chin\", and thr ( c Jo) and txr .10), both meaning \"cloud\".",
        "When an X appears after a long vowel as in tuxruuX, it is always realized as a full copy of the previous consonant as in /tuxruur/ ( j_52..10), no matter what follows."
      ]
    },
    {
      "heading": "2.4 Middle Radical Gemination/Spreading",
      "text": [
        "Just as Forms II and V involve gemination of the middle radical, other forms including Form XII involve the separated spreading of the middle radical.",
        "A preceding diphthong, like a preceding long vowel, causes X to be realized as a full copy of the preceding consonant, as shown in the following examples.",
        "A number of nouns have broken plurals that also involve spreading of the middle radical, contrasting with gemination in the singular.",
        "A few other patterns show the same behavior.",
        "While not especially common, there are more roots that take middle-radical-spreading noun patterns than take the better-known Form IX verb patterns."
      ]
    },
    {
      "heading": "3 Biliteral Roots",
      "text": [
        "As pointed out in McCarthy (1981, p. 396- 7), the gemination vs. spreading behavior of Form IX stems is closely paralleled by Form I stems involving traditionally analyzed \"biliteral\" or \"geminating\" roots such as tm (also characterized as tmm) and sm (possibly smm) and many others of the same ilk.",
        "As shown in Figure 4, these roots show Form I gemination with suffixes beginning with a vowel vs. full spreading when the suffix begins with a consonant.",
        "However Form IX is handled, these parallels strongly suggest that the exact same underlying forms and variations rules should also handle the form I of biliteral roots.",
        "However, the Form I perfect active pattern, in the current notation, is simply CaCaC (or",
        "idiosyncratically for some roots, CaCuC or CaCiC).",
        "As shown in Figure 5, there is no evidence, for normal triliteral roots like ktb, that any kind of copying is specified by the Form I pattern itself.",
        "Keeping CaCaC as the Form I perfect active pattern, the behavior of biliteral roots falls out effortlessly if they are formalized not as sm and tm, nor as smm and tmm, but as smX and tmX, with the copying-trigger X as the third radical of the root itself.",
        "Such roots intersect in the normal way with triliteral patterns as in Figure 6, and they are mapped to appropriate surface strings using the same rules that realize Form IX stems."
      ]
    },
    {
      "heading": "4 Rules",
      "text": [
        "The TWOLC rule (Karttunen and Beesley, 1992) that maps an X, coming either from roots like tmX or from patterns like Form IX CCaCaX.",
        "into a copy of the previous consonant is the following, where Cons is a grammar-level variable ranging freely over consonants, LongVowel is a grammar-level variable ranging freely over long vowels and diphthongs, and C is an indexed local variable ranging over the enumerated set of consonants.",
        "where C in ( b t o jhxd 6 rz I q a t 6 iif qk 1 m n h w y ) ;",
        "The rule, which in fact compiles into 27 rules, one for each enumerated consonant, realizes underlying X as surface C if and only if one of the following cases applies:6",
        "• First Context: X is preceded by a surface C and one or more non-consonants, and is followed by a suffix beginning with a consonant.",
        "This context matches lexical dhamaX+tu, realizing X as m (ultimately written 1;111), but not dhamaX+a, which is written r • Second Context: X is preceded by a surface C and a long vowel or diphthong, no matter what follows.",
        "This maps lexical dabaaXiir to dabaabiir • Third Context: X is preceded by a surface C, another X and any symbol, no matter what follows.",
        "This matches the second X in samXaX+tu and samXaX-Fa to produce samXam-Ftu and samXam+a respectively, with ultimate orthographical realizations such as LS and",
        "In the current system, where the goal is to recognize and generate orthographical words of Modern Standard Arabic, as represented in 1508859-6, UNICODE or an equivalent encoding.",
        "the default or \"elsewhere\" case is for X to be realized optionally as a shadda diacritic."
      ]
    },
    {
      "heading": "5 Multiple Copies of Radicals",
      "text": [
        "When a biliteral root like smX intersects with the Form II pattern CaCXaC, the abstract result is the stem samXaX.",
        "The radical m gets geminated (or lengthened) once and spread once to form surface phonological phonological strings like /sammama/ and /sammamtu/, which become orthographical and ,L=..'Itc.",
        "; respectively.",
        "And if both roots and patterns can contain X, then the possibility exists that a copying root could combine with a copying pattern, requiring a full double spreading of a radical in the surface string.",
        "This in fact happens in a single example (in the present lexicon) with",
        "the root mkX, which combines legally with the noun pattern CaCaaXiiC as in Figure 7.",
        "In the surface string makaakiik (\"shuttles\"), orthographically the middle radical k is spread twice.",
        "The variation rules handle this and the smX examples without difficulty."
      ]
    },
    {
      "heading": "6 System Status",
      "text": [
        "The current morphological analyzer is based on dictionaries and rules licensed from an earlier project at ALPNET (Beesley, 1990), rebuilt completely using Xerox finite-state technology (Beesley, 1996; Beesley, 1998a).",
        "The current dictionaries contain 4930 roots, each one hand-coded to indicate the subset of patterns with which it legally combines (Buck-walter, 1990).",
        "Roots and patterns are intersected (Beesley, 1998b) at compile time to yield 90,000 stems.",
        "Various combinations of prefixes and suffixes, concatenated to the stems, yield over 72,000,000 abstract words.",
        "Sixty-six finite-state variation rules map these abstract strings into fully-voweled orthographical strings, and additional trivial rules are then applied to optionally delete short vowels and other diacritics, allowing the system to analyze unvoweled, partially voweled, and fully-voweled orthographical strings.",
        "The full system, including a Java interface that displays both input and output in Arabic script, is available for testing on the Internet"
      ]
    }
  ]
}
