{
  "info": {
    "authors": [
      "Bonnie Glover Stalls",
      "Kevin Knight"
    ],
    "book": "Workshop on Computational Approaches to Semitic Languages",
    "id": "acl-W98-1005",
    "title": "Translating Names and Technical Terms in Arabic Text",
    "url": "https://aclweb.org/anthology/W98-1005",
    "year": 1998
  },
  "references": [
    "acl-P97-1017"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "It is challenging to translate names and technical terms from English into Arabic.",
        "Translation is usually done phonetically: different alphabets and sound inventories force various compromises.",
        "For example, Peter Streams may come out as :A.A.. bytr strymz.",
        "This process is called transliteration.",
        "We address here the reverse problem: given a foreign name or loanword in Arabic text, we want to recover the original in Roman script.",
        "For example, an input like :AIL...A.2 bytr strymz should yield an output like Peter Streams.",
        "Arabic presents special challenges due to unwritten vowels and phonetic-context effects.",
        "We present results and examples of use in an Arabic-to-English machine translator."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Translators must deal with many problems, and one of the most frequent is translating proper names and technical terms.",
        "For language pairs like Spanish/English, this presents no great challenge: a phrase like Antonio Gil usually gets translated as Antonio Gil.",
        "However, the situation is more complicated for language pairs that employ very different alphabets and sound systems, such as Japanese/English and Arabic/English.",
        "Phonetic translation across these pairs is called transliteration.",
        "(Knight and Graehl, 1997) present a computational treatment of Japanese/English transliteration, which we adapt here to the case in Arabic.",
        "Arabic text, like Japanese, frequently contains foreign names and technical terms that are translated phonetically.",
        "Here are some examples from newspaper text:1",
        "Apache helicopter 4..).1511' A11-4 (hlykwbtr !b!tshy) (m!yk m!kwry) AJI (Pwbk) j (!ntrnt !ksblwrr) (Answers appear later in this paper).",
        "'The romanization of Arabic orthography used here consists of the following consonants: !",
        "(alif ), b, t, th, j, H, x, d, dh, r, z, s, sh, S, D, T, Z, (Oczyn), G (Gayn), f, q, k, 1, m, n, =h, w, y, (hamza).",
        "!",
        ", w, and y also indicate long vowels.",
        "!'",
        "and !+ indicate hamza over alif and hamza under alif, respectively.",
        "It is not trivial to write an algorithm for turning English letter sequences into Arabic letter sequences, and indeed, two human translators will often produce different Arabic versions of the same English phrase.",
        "There are many complexity-inducing factors.",
        "Some English vowels are dropped in Arabic writing (but not all).",
        "Arabic and English vowel inventories are also quite different – Arabic has three vowel qualities (a, i, u) each of which has short and long variants, plus two diphthongs (ay, aw), whereas English has a much larger inventory of as many as fifteen vowels and no length contrast.",
        "Consonants like English D are sometimes dropped.",
        "An English S sound frequently turns into an Arabic s, but sometimes into z. English P and B collapse into Arabic b; F and V also collapse to f. Several English consonants have more than one possible Arabic rendering – K may be Arabic k or q, t may be Arabic t or T (T is pharyngealized t, a separate letter in Arabic).",
        "Human translators accomplish this task with relative ease, however, and spelling variations are for the most part acceptable.",
        "In this paper, we will be concerned with a more difficult problem – given an Arabic name or term that has been translated from a foreign language, what is the transliteration source?",
        "This task challenges even good human translators:",
        "Among other things, a human or machine translator must imagine sequences of dropped English vowels and must keep an open mind about Arabic letters like b and f. We call this task back-transliteration.",
        "Automating it has great practical importance in Arabic-to-English machine translation, as borrowed terms are the largest source of text phrases that do not appear in bilingual dictionaries.",
        "Even if an English term is listed, all of its possible Arabic variants typically are not.",
        "Automation is also important for machine-assisted translation, in which the computer may suggest several translations that a human translator has not imagined."
      ]
    },
    {
      "heading": "2 Previous Work",
      "text": [
        "(Arbabi et al., 1994) developed an algorithm at IBM for the automatic forward transliteration of Arabic personal names into the Roman alphabet.",
        "Using a hybrid neural network and knowledge-based system approach, this program first inserts the appropriate missing vowels into the Arabic name, then converts the name into a phonetic representation, and maps this representation into one or more possible Roman spellings of the name.",
        "The Roman spellings may also vary across languages (Shari!",
        "in English corresponds to Cherife in French).",
        "However, they do not deal with back-transliteration.",
        "(Knight and Graehl, 1997) describe a back-transliteration system for Japanese.",
        "It comprises a generative model of how an English phrase becomes Japanese:",
        "1.",
        "An English phrase is written.",
        "2.",
        "A translator pronounces it in English.",
        "3.",
        "The pronunciation is modified to fit the Japanese sound inventory.",
        "4.",
        "The sounds are converted into the Japanese katakana alphabet.",
        "5.",
        "Katakana is written.",
        "They build statistical models for each of these five processes.",
        "A given model describes a mapping between sequences of type A and sequences of type B.",
        "The model assigns a numerical score to any particular sequence pair a and b, also called the probability of 6 given a, or P(bla).",
        "The result is a bidirectional translator: given a particular Japanese string, they compute the n most likely English translations.",
        "Fortunately, there are techniques for coordinating solutions to sub-problems like the five above, and for using generative models in the reverse direction.",
        "These techniques rely on probabilities and Bayes' Rule.",
        "For a rough idea of how this works, suppose we built an English phrase generator that produces word sequences according to some probability distribution P(w).",
        "And suppose we built an English pronouncer that takes a word sequence and assigns it a set of pronunciations, again probabilistically, according to some P(elw).",
        "Given a pronunciation e, we may want to search for the word sequence w that maximizes P(wle).",
        "Bayes' Rule lets us equivalently maximize P(w) • P(ejw), exactly the two distributions just modeled.",
        "Extending this notion, (Knight and Graehl, 1997) built five probability distributions:",
        "1.",
        "P(w) – generates written English word sequences.",
        "2.",
        "P(elw) – pronounces English word sequences.",
        "3.",
        "P(jje) – converts English sounds into Japanese sounds.",
        "4.",
        "P(Id j) – converts Japanese sounds to katakana writing.",
        "5.",
        "P(olk) – introduces misspellings caused by optical character recognition (OCR).",
        "Given a Japanese string o they can find the English word sequence w that maximizes the sum over all e, j, and k, of",
        "These models were constructed automatically from data like text corpora and dictionaries.",
        "The most interesting model is P(jje), which turns English sound sequences into Japanese sound sequences, e.g., S AH K ER (soccer) into s a kk a a.",
        "Following (Pereira and Riley, 1997), P(w) is implemented in a weighted finite-state acceptor (WFSA) and the other distributions in weighted finite-state transducers (WFSTs).",
        "A WFSA is a state/transition diagram with weights and symbols on the transitions, making some output sequences more likely than others.",
        "A WFST is a WFSA with a pair of symbols on each transition, one input and one output.",
        "Inputs and outputs may include the empty string.",
        "Also following (Pereira and Riley, 1997), there is a general composition algorithm for constructing an integrated model P(xlz) from models P(xly) and P(y1z).",
        "They use this to combine an observed Japanese string with each of the models in turn.",
        "The result is a large WFSA containing all possible English translations, the best of which can be extracted by graph-search algorithms."
      ]
    },
    {
      "heading": "3 Adapting to Arabic",
      "text": [
        "There are many interesting differences between Arabic and Japanese transliteration.",
        "One is that Japanese uses a special alphabet for borrowed foreign names and borrowed terms.",
        "With Arabic, there are no such obvious clues, and it is difficult to determine even whether to attempt a back-transliteration, to say nothing of computing an accurate one.",
        "We will not address this problem directly here, but we will try to avoid inappropriate transliterations.",
        "While the Japanese system is robust – everything gets some transliteration – we will build a deliberately more brittle Arabic system, whose failure signals that transliteration may not be the correct option.",
        "While Japanese borrows almost exclusively from English, Arabic borrows from a wider variety of languages, including many European ones.",
        "Fortunately, our pronunciation dictionary includes many non-English names, but we should expect to fail more often on transliterations from, say, French or Russian.",
        "Japanese katakana writing seems perfectly phonetic, but there is actually some uncertainty in how phonetic sequences are rendered orthographically.",
        "Arabic is even less deterministically phonetic; short vowels do not usually appear in written text.",
        "Long vowels, which are normally written in Arabic, often but not always correspond to English stressed vowels; they are also sometimes inserted in foreign words to help disambiguate pronunciation.",
        "Because true pronunciation is hidden, we should expect that it will be harder to establish phonetic correspondences between English and Arabic.",
        "Japanese and Arabic have similar consonant-conflation problems.",
        "A Japanese r sound may have an English r or 1 source, while an Arabic b may come from p or b.",
        "This is what makes back-transliteration hard.",
        "However, a striking difference is that while Japanese writing adds extra vowels, Arabic writing deletes vowels.",
        "For example:2 Henri ette --+HEHNRIY EH T (English) henorie tt o (Japanese) 4 =h nryt (Arabic) This means potentially much more ambiguity; we have to figure out which Japanese vowels shouldn't",
        "be there (deletion), but we have to figure out which Arabic vowels should be there (addition).",
        "For cases where Arabic has two potential mappings for one English consonant, the ambiguity does not matter.",
        "Resolving that ambiguity is bonus when going in the backwards direction – English T, for example, can be safely posited for Arabic t or T without losing any information."
      ]
    },
    {
      "heading": "4 New Model for Arabic",
      "text": [
        "Fortunately, the first two models of (Knight and Graehl, 1997) deal with English only, so we can reuse them directly for Arabic/English transliteration.",
        "These are P(w), the probability of a particular English word sequence and P(elw), the probability of an English sound sequence given a word sequence.",
        "For example, P(Peter) may be 0.00035 and P(P IY T ERIPeter) may be 1.0 (if Peter has only one pronunciation).",
        "To follow the Japanese system, we would next propose a new model P(qle) for generating Arabic phoneme sequences from English ones, and another model P(alq) for Arabic orthography.",
        "We would then attempt to find data resources for estimating these probabilities.",
        "This is hard, because true Arabic pronunciations are hidden and no databases are available for directly estimating probabilities involving them.",
        "Instead, we will build only one new model, P(ale), which converts English phoneme sequences directly into Arabic writing.",
        "We might expect the model to include probabilities that look like:",
        "The next problem is to estimate these numbers empirically from data.",
        "We did not have a large bilingual dictionary of names and terms for Arabic/English, so we built a small 150-word dictionary by hand.",
        "We looked up English word pronunciations in a phonetic dictionary, generating the English-phoneme-to-Arabic-writing training data shown in Figure 1.",
        "We applied the EM learning algorithm described in (Knight and Graehl, 1997) on this data, with one variation.",
        "They required that each English sound",
        "produce at least one Japanese sound.",
        "This worked because Japanese sound sequences are always longer than English ones, due to extra Japanese vowels.",
        "Arabic letter sequences, on the other hand, may be shorter than their English counterparts, so we allow each English sound the option of producing no Arabic letters at all.",
        "This puts an extra computational strain on the learning algorithm, but is otherwise not difficult.",
        "Initial results were satisfactory.",
        "The program learned to map English sounds onto Arabic letter sequences, e.g.: Nicholas onto ,..r`i‹..) nykwl!",
        "s and Williams onto )43 We applied our three probabilistic models to previously unseen Arabic strings and obtained the top n English back-transliteration for each, e.g.,",
        "We then detected several systematic problems with our results, which we turn to next."
      ]
    },
    {
      "heading": "5 Problems Specific to Arabic",
      "text": [
        "One problem was the production of many wrong English phrases, all containing the sound D. For example, the Arabic sequence Ot2:) frym!n yielded two possible English sources, Freeman and Friedman.",
        "The latter is incorrect.",
        "The problem proved to be that, like several vowels, an English D sound sometimes produces no Arabic letters.",
        "This happens in cases like )1331 Edward !",
        "'dw!r and 0.3.c., Raymond rymwn.",
        "Inspection showed that D should only be dropped in word-final position, however, and not in the middle of a word like Friedman.",
        "This brings into question the entire shape of our P(ale) model, which is based on a substitution of Arabic letters for an English sound, independent of that sound's context.",
        "Fortunately, we could incorporate an only-drop-final-D constraint by extending the model's transducer format.",
        "The old transducer looked like this: While the new transducer looks like this: Whenever D produces no letters, the transducer finds itself in a final state with no further transitions.",
        "It can consume no further English sound input, so it has, by definition, come to the end of the word.",
        "We noticed a similar effect with English vowels at the end of words.",
        "For example, the system suggested both Manuel and Man uela as possible sources for 1JL m!nwyl.",
        "Manue/a is incorrect; we eliminated this frequent error with a technique like the one described above.",
        "A third problem also concerned English vowels.",
        "For Arabic \"tit:S:3i !",
        "'wkt !fyw, the system produced both Octavio and Octavio as potential sources, though the latter is wrong.",
        "While it is possible for the English vowel AH (final in Octavio) to produce Arabic w in some contexts (e.g., rwjr/Roger), it cannot do so at the end of a word.",
        "EH and AA have the same property.",
        "Furthermore, none of those three vowels can produce the letter y when in word-final position.",
        "Other vowels like IY may of course do so.",
        "We pursued a general solution, replacing each in-((AE N T OW N II OW) ((AE N T AN N IT) ((AA N W AA R)",
        "stance of an English vowel in our training data with one of three symbols, depending on its position in the word.",
        "For example, an AH in word-initial position was replaced by AH-S; word-final AM was replaced by AH-F; word-medial was AIL This increases our vowel sound inventory by a factor of three, and even though AH might be pronounced the same in any position, the three distinct AK symbols can acquire different mappings to Arabic.",
        "In the case of AM, learning revealed:",
        "We can see that word-final AM can never be dropped.",
        "We can also see that word-initial AM can be dropped; this goes beyond the constraints we originally envisioned.",
        "Figure 2 shows the complete table of sound-letter mappings.",
        "We introduced just enough context in our sound mappings to achieve reasonable results.",
        "We could, of course, introduce left and right context for every sound symbol, but this would fragment our data; it is difficult to learn general rules from a handful of examples.",
        "Linguistic guidance helped us overcome these problems."
      ]
    },
    {
      "heading": "6 EXAMPLE",
      "text": [
        "Here we show the internal workings of the system through an example.",
        "Suppose we observe the Arabic string br !nstn.",
        "First, we pass it though the P(ale) model from Figure 2, producing the network of possible English sound sequences shown in Figure 3.",
        "Each sequence ei could produce (or \"explain\") br!nstn and is scored with P(br !nstni ei).",
        "For example, P(br!nstnIBRAENSTN) = 0.54.",
        "Next, we pass this network through the P(elw) model to produce a new network of English phrases.",
        "Finally, we re-score this network with the P(w) model.",
        "This marks a preference for common English words/names over uncommon ones.",
        "Here are"
      ]
    },
    {
      "heading": "7 Results and Discussion",
      "text": [
        "We supplied a list of 2800 test names in Arabic to our program and received translations for 900 of them.",
        "Those not translated were frequently not foreign names at all, so the program is right to fail in many such cases.",
        "Sample results are shown in Figure 4.",
        "The program offers many good translations but still makes errors of omission and commission.",
        "Some of these errors show evidence of lexical or orthographic influence or of interference from other languages (such as French).",
        "English G is incorrectly produced from its voiceless counterpart in Arabic, k. For example, krys comes out correctly as Chris and Kris but also, incorrectly, as Grace.",
        "The source of the G-k correspondence in the training data is the English name AE L AR G Z AE N D ER Alexander, which is !lksndr in our training corpus.",
        "A voiced fricative G is available in Arabic, which in other contexts corresponds to the English voiced stop G, although it, too, is only an approximation.",
        "It appears that orthographic English X is perceived to correspond to Arabic ks, perhaps due partly to French influence.",
        "Another possible influence is the existing Arabic name jx..‹...1 !",
        "skndr (which has k), from the same Greek source as the English name Alexander, but with metathesis of k and s. Sometimes an Arabic version of a foreign name is not strictly a transliteration, but rather a translation or lexicalized borrowing which has been adapted to Arabic phonological patterns.",
        "For example, the name Edward is found in our data as .513;i !",
        "du!rd, j1p1 !",
        "'dw!r, and JIA !+dw !r.",
        "The last version, an Arabicization of the original Anglo-Saxon name, is pronounced Idwar.",
        "The approach taken here is flexible enought to find such matches.",
        "Allowing the English sound D to have a zero match word-finally (also a possible French influence) proves to be too strong an assumption, leading to matches such as: !",
        "'lfr Oliver Alfred.",
        "A revised rule would allow the D to drop word-finally only when immediately preceded by another consonant (which consonant could further be limited to a sonorant).",
        "Another anomaly which is the source of error is the mapping of English CH to Arabic x, which carries equal weight (0.5) to the mapping of CH to Arabic tsh (0.5).",
        "This derives from the name Koch, which in Arabic is t\"..(kwx, as in the German pronunciation of the name, as opposed to the English pronunciation.",
        "This kind of language interference can be minimized by enlarging the training data set."
      ]
    },
    {
      "heading": "ANTOINETTE ANTOINETTE ANTON ANTOON ANTOINE ANTONY ANTONI ANTONE ANTONIA ANTONIO ANTONIU ANDREW ANDREU ANDREA ANDREA ANDRIA",
      "text": [
        "English orthography appears to have skewed the training data in the English name Frederick, pronounced F R EH D R IH K. In Arabic we have 13...0) frdyrk as well as frydryk, frdyryk and frdryk for this name.",
        "The English spelling has three vowels, but the English phonemic representation lacks the middle vowel.",
        "But some Arabic versions have a (long) \"vowel\" (y) in the middle vowel position, leading in the training data to the incorrect mapping English R to Arabic y.",
        "This results in incorrect translations, such as Racine for ysyn.",
        "As might be expected when the sound system of one language is being reinterpreted in another, Arabic transliteration is not always attuned to the subtleties of English phonotactic variation, especially when the variants are not reflected in English orthography.",
        "An example is the assimilation in voicing of English fricatives to an immediately preceding stop consonant.",
        "In James, pronounced JH EY 11 Z, the final consonant is a voiced Z although it is spelled with the voiceless variant, s. In this case, Arabic follows the English orthography rather than pronunciation, transliterating it jyms.",
        "Similarly, Horowitz is pronounced HH AO Ft OW IH T S in English, with a final devoiced S rather than the voiced variant z present in the spelling, whereas the Arabic transliteration follows the English spelling, =hwrwwytz.",
        "The present version of the program applies these variant correspondences indiscriminately, such that s !",
        "ymwn is translated as Simon or Zyman.",
        "Separating out these correspondences according to their positions in the word, as was done with the vowels, would help to rectify this, by reducing the probability of an S – z correspondence in less likely positions (e.g., initial position).",
        "Some Arabic transliterations carry the imprint of English spelling even when it departs even farther from the pronunciation.",
        "For example, (.14).",
        "Gr!=h!m is an Arabic transliteration for the English name Graham, pronounced G R AE M. (an alternative is the Arabic riAGr!m).",
        "These mappings were not found by the program (even though they might be readily evident to a human).",
        "This kind of spelling-transliteration lies outside of the phonemic correspondences to Arabic orthography that the program has learned.",
        "Vowels are still a problem, even when they are distinguished by their position in the word.",
        "In the test cases given in the Introduction, (answers are Mike McCurry, OPEC, and Internet Explorer), the quality of the Arabic vowels, when present, matches the English vowels fairly well.",
        "However, as can be seen from names like Frederick, the decision as to whether or not to insert vowel is arbitrary and somewhat dependent on English orthography, which influences the quality as well as position of the Arabic vowel.",
        "Medial English AR, for example, is normally !",
        "(a/if but can also be found in Arabic as w or y (e.g, English Jeremy, pronounced JH EH R AR 14 IT is written in Arabic as jyrymy).",
        "This results in incorrect translations, such as Amman for Arabic !",
        "'myn.",
        "In this initial model, English vowel stress was not represented.",
        "Because long vowels in Arabic are usually stressed, one might expect that English stressed vowels would be equated with Arabic long vowels for purposes of transliteration.",
        "However, our data suggest that English stress does not have a strong correlation with Arabic long vowel placement in transliterated names.",
        "For example, Kevin mapped to olis kyfyn and Cilirkfyn, but not clilkyfn.",
        "If stress were a factor here and were interpreted as a long vowel, craikyfn would be predicted as a preferred transliteration based on the phonemic representation of Kevin as K EH1 V IH N (where \"1\" indicates primary stress).",
        "Similarly, ..‹....3 fyktwr and fktwr were found for Victor but not the expected fyktr.",
        ",L...1....rkynth is found, but so are kynyth, and ,t.4:5-knyth.",
        "In syllable-final position at least, it appears that stress does not outweigh other factors in Arabic vowel placement.",
        "However, the relation of English stress to Arabic vowel placement in other positions might be used to rule out unlikely translations (such as Camille with final stress for Arabic jirk!ml) and deserves further study.",
        "All of these observations point to places where the system can be improved.",
        "A larger training data set, more selected contextual mappings, and refinement of linguistic rules are all potential ways to capture these improvements within the finite-state framework, and we hope to study them in the near future."
      ]
    }
  ]
}
