{
  "info": {
    "authors": [
      "Takaki Makino",
      "Minoru Yoshida",
      "Kentaro Torisawa",
      "Jun'ichi Tsujii"
    ],
    "book": "COLING-ACL",
    "id": "acl-P98-2132",
    "title": "LiLFeS - Towards a Practical HPSG Parser",
    "url": "https://aclweb.org/anthology/P98-2132",
    "year": 1998
  },
  "references": [
    "acl-C94-1027",
    "acl-H90-1055",
    "acl-J94-2001",
    "acl-W96-0102"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper presents a multi-neuro tagger that uses variable lengths of contexts and weighted inputs (with information gains) for part of speech tagging.",
        "Computer experiments show that it has a correct rate of over 94% for tagging ambiguous words when a small Thai corpus with 22,311 ambiguous words is used for training.",
        "This result is better than any of the results obtained using the single-neuro taggers with fixed but different lengths of contexts, which indicates that the multi-neuro tagger can dynamically find a suitable length of contexts in tagging."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Words are often ambiguous in terms of their part of speech (POS).",
        "POS tagging disambiguates them, i.e., it assigns to each word the correct POS in the context of the sentence.",
        "Several kinds of POS taggers using rule-based (e.g., Brill et al., 1990), statistical (e.g., Meri-aldo, 1994), memory-based (e.g., Daelemans, 1996), and neural network (e.g., Schmid, 1994) models have been proposed for some languages.",
        "The correct rate of tagging of these models has reached 95%, in part by using a very large amount of training data (e.g., 1,000,000 words in Schmid, 1994).",
        "For many other languages (e.g., Thai, which we deal with in this paper), however, the corpora have not been prepared and there is not a large amount of training data available.",
        "It is therefore important to construct a practical tagger using as few training data as possible.",
        "In most of the statistical and neural network models proposed so far, the length of the contexts used for tagging is fixed and has to be selected empirically.",
        "In addition, all words in the input are regarded to have the same relevance in tagging.",
        "An ideal model would be one in which the length of the contexts can be automatically selected as needed in tagging and the words used in tagging can be given different relevances.",
        "A simple but effective solution is to introduce a multi-module tagger composed of multiple modules (basic taggers) with fixed but different lengths of contexts in the input and a selector (a selecting rule) to obtain the final answer.",
        "The tagger should also have a set of weights reflecting the different relevances of the input elements.",
        "If we construct such a multi-module tagger with statistical methods (e.g., n-gram models), however, the size of the n-gram table would be extremely large, as mentioned in Sec. 4.4.",
        "On the other hand, in memory-based models such as IGtree (Daelemans, 1996), the number of features used in tagging is actually variable, within the maximum length (i.e., the number of features spanning the tree), and the different relevances of the different features are taken into account in tagging.",
        "Tagging by this approach, however, may be computationally expensive if the maximum length is large.",
        "Actually, the maximum length was set at 4 in Daelemans's model, which can therefore be regarded as one using fixed length of contexts.",
        "This paper presents a multi-neuro tagger that is constructed using multiple neural networks, all of which can be regarded as single-neuro taggers with fixed but different lengths of contexts in inputs.",
        "The tagger performs POS tagging in different lengths of contexts based on longest context priority.",
        "Given that the target word is more relevant than any of the words in its context and that the words in context may have different relevances in tagging, each",
        "element of the input is weighted with information gains, i.e., numbers expressing the average amount of reduction of training set information entropy when the POSs of the element are known (Quinlan 1993).",
        "By using the trained results (weights) of the single-neuro taggers with short inputs as initial weights of those with long inputs, the training time for the latter ones can be greatly reduced and the cost to train a multi-neuro tagger is almost the same as that to train a single-neuro tagger."
      ]
    },
    {
      "heading": "2 POS Tagging Problems",
      "text": [
        "Since each input Thai text can be segmented into individual words that can be further tagged with all possible POSs using an electronic Thai dictionary, the POS tagging tasks can be regarded as a kind of POS disambiguation problem using contexts as follows:",
        "where ipt _t is the element related to the possible POSs of the target word, • • ,ipt_li) and , • • - ,ipt_rr) are the elements related to the contexts, i.e., the POSs of the words to the left and right of the target word, respectively, and PO S _t is the correct POS of the target word in the contexts."
      ]
    },
    {
      "heading": "3 Information Gain",
      "text": [
        "Suppose each element, ipt_x (x = li,t, or ri), in (1) has a weight, w_x, which can be obtained using information theory as follows.",
        "Let S be the training set and Ci be the ith class, i.e., the ith POS (i = 1, , n, where n is the total number of POSs).",
        "The entropy of the set S, i.e., the average amount of information needed to identify the class (the POS) of an example in 5, is",
        "(2) where ISI is the number of examples in S and f reg(Ci, S) is the number of examples belonging to class C. When S has been partitioned to h subset Si (i = 1,•,h) according to the element ipt_x , the new entropy can be found as the weighted sum over these subsets, or",
        "Thus, the quantity of information gained by this partitioning, or by knowing the POSs of element ipt.x, can be obtained by"
      ]
    },
    {
      "heading": "4 Multi-Neuro Tagger",
      "text": []
    },
    {
      "heading": "4.1 Single-Neuro Tagger",
      "text": [
        "Figure 1 shows a single-neuro tagger (SNT) which consists of a 3-layer feedforward neural network.",
        "The SNT can disambiguate the POS of each word using a fixed length of the context by training it in a supervised manner with a well-known error back-propagation algorithm (for details see e.g., Haykin, 1994).",
        "When word x is given in position y (y = t, or ri), element ipt_y of input I PT is a weighted pattern defined as",
        "where w_y is the weight obtained in (5), n is the total number of POSs defined in Thai, and",
        "Here the Prob(POSilx) is the prior probability of POSi that the word x can be and is estimated from the training data as",
        "where IPOSi,s1 is the number of times both POSi and x appear and lx1 is the number of times x appears in all the training data.",
        "If x is an unknown word, i.e., it does not appear in the training data, each bit ex.i is obtained as follows:",
        "where nx is the number of POSs that the word x can be (this number can be simply obtained from an electronic Thai dictionary).",
        "The OPT is a pattern defined as follows:",
        "The OPT is decoded to obtain a final result RST for the POS of the target word as follows: RST ={POSi, if Oi = 1 Oi = 0 for j",
        "There is more information available for constructing the input for the words on the left because they have already been tagged.",
        "In the tagging phase, instead of using (6)-(9), the input may be constructed simply as follows:",
        "where t is the position of the target word in a sentence and i = 1,2, • • • ,l for t – i > 0.",
        "However, in the training process the output of the tagger is not correct and cannot be fed back to the inputs directly.",
        "Instead, a weighted average of the actual output and the desired output is used as follows:",
        "and WopT and WDEs are respectively defined as",
        "where EcoEj and EAcT are the objective and actual errors, respectively.",
        "Thus, the weighting of the desired output is large at the beginning of the training, and decreases to zero during training."
      ]
    },
    {
      "heading": "4.2 Multi-Neuro Tagger",
      "text": [
        "When a sequence of words (word_li, • • •, word_li, word_t, word_ri, • • word_rr), which has a target word word_t in the center and a maximum length /(/PTrn ), is inputed, its subsequence of words, which also has the target word word_t in the center and length 1(IPTi), will be encoded into IPTi in the same way as described in the previous section.",
        "The outputs OPTS (for",
        "i = 1, • , m) of the single-neuro taggers are decoded into RSTi by (11).",
        "The RSTi are next inputed into the longest-context-priority selector which obtains the final result as follows:",
        "This means that the output of the single-neuro tagger that gives a result being not unknown and has the largest length of input is regarded as a final answer."
      ]
    },
    {
      "heading": "4.3 Training",
      "text": [
        "If we use the weights trained by the single-neuro taggers with short inputs as the initial values of those with long inputs, the training time for the latter ones can be greatly reduced and the cost to train multi-neuro taggers would be almost the same as that to train the single-neuro taggers.",
        "Figure 3 shows an example of training a tagger with four input elements.",
        "The trained weights, w1 and w2, of the tagger with three input elements are copied to the corresponding part of the tagger and used as initial values for its training."
      ]
    },
    {
      "heading": "4.4 Features",
      "text": [
        "Suppose that at most seven elements are adopted in the inputs for tagging and that there are 50 POSs.",
        "The n-gram models must estimate 507 = 7.8e + 11 n-grams, while the single-neuro tagger with the longest input uses only 70,000 weights, which can be calculated nipt, by nipt• nhid nh where id • nopt nhid, and nopt are, respectively, the number of units in the input, the hidden, and the output layers, and nhid is set to be n2pt/2.",
        "That neuro models require few parameters may offer another advantage: their performance is less affected by a small amount of training data than that of the statistical methods (Schmid, 1994).",
        "Neuro taggers also offer fast tagging compared to other models, although its training stage is longer."
      ]
    },
    {
      "heading": "5 Experimental Results",
      "text": [
        "The Thai corpus used in the computer experiments contains 10,452 sentences that are randomly divided into two sets: one with 8,322 sentences for training and another with 2,130 sentences for testing.",
        "The training and testing sets contain, respectively, 22,311 and 6,717 ambiguous words that serve as more than one POS and were used for training and testing.",
        "Because there are 47 types of POSs in Thai (Charoenporn et al., 1997), n in (6), (10), and (14) was set at 47.",
        "The single neuro-taggers are 3-layer neural networks whose input length, 1(IPT) (.1+ 1+ r), is set to 3-7 and whose size is p x x n, where p = n x 1(I PT).",
        "The multi-neuro tagger is constructed by five (i.e., m = 5) single-neuro taggers, SNTi (i = 1, • • • ,5), in which 1(IPTi) = 2 I i.",
        "Table 1 shows that no matter whether the information gain (IG) was used or not, the multi-neuro tagger has a correct rate of over 94%, which is higher than that of any of the single-neuro taggers.",
        "This indicates that by using the multi-neuro tagger the length of the context need not be chosen empirically; it can be selected dynamically instead.",
        "If we focus on the single-neuro taggers with inputs greater than four, we can see that the taggers with information gain are superior to those without information gain.",
        "Note that the correct rates shown in the table were obtained when only counting the ambiguous words in the testing set.",
        "The correct rate of the multi-neuro tagger is 98.9% if all the words in the testing set (the ratio of ambiguous words was 0.19) are counted.",
        "Moreover, although the overall performance is not improved",
        "much by adopting the information gains, the training can be greatly speeded up.",
        "It takes 1024 steps to train the first tagger, SNTI, when the information gains are not, used and only 664 steps to train the same tagger when the information gains are used.",
        "Figure 4 shows learning (training) curves in different cases for the single-neuro tagger with six input elements.",
        "Thick line shows the case in which the tagger is trained by using trained weights of the tagger with five input elements as initial values.",
        "The thin line shows the case in which the tagger is trained independently.",
        "The dashed line shows the case in which the tagger is trained independently and does not use the information gain.",
        "From this figure, we know that the training time can be greatly reduced by using the previous result and the information gain."
      ]
    },
    {
      "heading": "6 Conclusion",
      "text": [
        "This paper described a multi-neuro tagger that uses variable lengths of contexts and weighted inputs for part of speech tagging.",
        "Computer experiments showed that the multi-neuro tagger has a correct rate of over 94% for tagging ambiguous words when a small Thai corpus with 22,311 ambiguous words is used for training.",
        "This result is better than any of the results ob-tamed by the single-neuro taggers, which indicates that that the multi-neuro tagger can dynamically find suitable lengths of contexts for tagging.",
        "The cost to train a multi-neuro tagger was almost the same as that to train a single-neuro tagger using new learning methods in which the trained results (weights) of the previous taggers are used as initial weights for the latter ones.",
        "It was also shown that while the performance of tagging can be improved only slightly, the training time can be greatly reduced by using information gain to weight input elements."
      ]
    }
  ]
}
