{
  "info": {
    "authors": [
      "Sanda M. Harabagiu"
    ],
    "book": "Workshop on Usage of WordNet in Natural Language Processing Systems",
    "id": "acl-W98-0720",
    "title": "Deriving Metonymic Coercions from WordNet",
    "url": "https://aclweb.org/anthology/W98-0720",
    "year": 1998
  },
  "references": [
    "acl-A88-1032",
    "acl-H86-1003",
    "acl-H91-1033",
    "acl-H92-1003",
    "acl-J91-1003",
    "acl-J95-2003",
    "acl-M93-1019",
    "acl-P93-1012",
    "acl-P96-1051"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "This paper presents a method for deriving metonymic coercions from the knowledge available in WordNet.",
        "Two different classes of metonymies are inferred by using (1) lexico-semantic connections between concepts or (2) morphological cues and logical formulae defining lexical concepts.",
        "In both cases the derivation of metonymic paths is based on approximations of sortal constraints retrieved from WordNet.",
        "This novel method of inferring coercions validates the related knowledge through coreference links.",
        "As a result, metonymic coercions are potentially useful for the recognition of coreferring entities in information extraction systems."
      ]
    },
    {
      "heading": "1 Problem description",
      "text": [
        "The pervasive phenomenon of metonymy raises a problem for the interpretation of real-world texts.",
        "Metonymies are figures of speech in which, according to the literature definition from (Lakoff and Johnson, 1990), one entity is used to refer to another, that is related to it'.",
        "Characteristic of a metonymic reading of a textual expression is the fact that the satisfaction of sortal constraints guides the coercion to related knowledge.",
        "The comprehensive account of the semantics of meaning transfers presented in (Nunberg, 1995) indicates that coercions need to be embedded in a conceptual and lexico-semantic space, ideally provided by a linguistic knowledge base.",
        "Nunberg also notes that coercions are licensed by pragmatic circumstances, specifically pertaining to the Gricean principles (Grice, 1975).",
        "In this paper, we revisit the notion of metonymy and address the computational aspects of its resolution in the context of the relational semantics provided by the recently released WordNet 1.6 lexical database (www.cogsci.princeton.edur wn ).",
        "Following the lessons learned from the WordNet-based inference of Gricean implicatures.",
        "reported in (Harabagiu et al., 1996), a novel methodology of producing metonymic paths was devised.",
        "The coercions combine WordNet relations with semantic information derived from conceptual definitions.",
        "In WordNet (Miller, 1995) synonym words are structured in synsets, underlying a linguistic concept.",
        "Every synset is associated with a gloss, representing a textual definition, that can be translated in a logical form following the notation introduced in (Hobbs, 1986-1).",
        "This formalism, used in the implementation of TACITUS (Hobbs, 1986-2), accommodates a large variety of discourse inferences and, moreover, provides an elegant manner of localizing ambiguities, as was shown in (Bear and Hobbs, 1988).",
        "Conceptual support from linguistic knowledge bases was already considered in the implementation of several metonymy resolution systems (e.g. (Mark-ert and Hahn, 1997), (Fass, 1991) (Hobbs.",
        "1986-2)), but none of these systems provided with more inferential flexibility than the typical coercion classes formulated by Lakoff (Lakoff and Johnson.",
        "1990).",
        "We propose here a metonymy resolution approach that accounts for an open class of coercions.",
        "Similarly to Nunberg (Nunberg, 1995) and more recently to Markert and Hahn (Marken and Hahn.",
        "1997), we find metonymy and nominal reference resolution to be two interacting processes; therefore.",
        "the proposed computational model validates metonymies through coreference links."
      ]
    },
    {
      "heading": "2 Classes of metonymic coercions",
      "text": [
        "Stallard proposed in (Stallard.",
        "1993) a distinction between two kinds of metonymy: (1) referential metonymy, in which the referent of a nominal predicate argument requires coercion and (2) predicative metonymy, featuring the coercion of the predicate usually corresponding to a verbal lexicalization.",
        "In his study, Stallard focuses on metonymic inferences required by a specific performative context, characterized by wh-questions and imperatives.",
        "His formalization of referential and predicative metonymies is based on the logical form readings of utterances from the DARPA ATIS (Air Travel Information Service) domain (NIADCOW.",
        "1992).",
        "a question-answering database about commercial air flights.",
        "comprising questions of the form:",
        "(Q1) Which wide-body jets serve dinner?",
        "(Q2) Which airlines fly from Boston to Denver?",
        "The ATIS domain is characterized by a pre-established formal system of categories and relations onto which the utterances must be mapped.",
        "In this domain it is known that only flights fly or serve meals; thus, both (Q1) and (Q2) can only be understood metonymically.",
        "The interpretation of the ATIS utterances is performed in the logical language imposed by the implementation in the DELPHI system (Bobrow et al., 1991).",
        "In this framework, a question is translated into a LISP-expression:"
      ]
    },
    {
      "heading": "(wh x S (and (Pi x) (P2 x))",
      "text": [
        "interpreted as a query for all members of S (the semantic class of the wh-NP) that satisfy both P1 (defined as the modifiers of the wh-NP) and P2 (the predicate of the clause).",
        "For exemplification, (QLF1) and (QLF2) represent the logical form translations of (Q1) and (Q2)1:"
      ]
    },
    {
      "heading": "orig-of Boston dest-of Denver))))",
      "text": [
        "In the case of (QLF1), the coercion relation aircraft-of maps between flights and the aircrafts they are on, whereas in the case of (QLF2), the coercion relation airline-of translates the connection between airlines and flights.",
        "Although both (CILF1) and (QLF2) have an interpolated quantifier for flights, which is not specified in the utterance, the difference comes from the position of the variable: in the case of (QLF1), the interpolated variable x is the wh-variable.",
        "whereas in the case of (QLF2), the interpolated variable y is part of the description that should be returned by the query.",
        "Stallard notes that this is the crux of the referential/predicative distinction of metonymies.",
        "In (QLF1), the NP-argument jets does not represent the domain of the wh-variable, but flight does, thus indicating a metonymic reference and deriving a referential metonymy reading.",
        "In contrast, in (QLF2) the domain of the wh-variable coincides with the semantic type from the utterance (i.e., airlines), but the subject-argument of the fly predicate is replaced by the coercion flights.",
        "This prompts Stallard to state that \"predicative I (Q1).",
        "(Q2), (QLF1) and (QLF2) are borrowed from (Stallard, 1993) metonymy can be loosely thought of as coercion of a predicate place, rather than that of the argument NP itself\".",
        "We argue that this definition is dependent on two factors: (1) the specific logical transformation imposed by the DELPHI implementation, which does not cover forms of utterances other than wh-questions, and (2) the availability of thematic role relations and coercions tailored specifically for the ATIS domain.",
        "This characterization of referential/predicative metonymies is not applicable when processing different genres of text, operating in different domains and, thus needing a different knowledge representation.",
        "An example of a metonymy resolution system using a more general representation is reported (Markert and Hahn, 1997).",
        "In their model of metonymy inference, Markert and Hahn employ a two-tiered conceptual and semantic test: conceptual checks identify well-formed role chains between a pair of syntactically linked concepts, and then semantic checks distinguish whether these chains mirror literal or metonymic relationships.",
        "To perform these checks, they use (1) a concept hierarchy C with a taxonomic relation isac and (2) a set of relation names TZ, containing labels of all conceptual roles of the elements from C, hierarchically organized by isaR.",
        "For the ATIS domain.",
        "we can assume C = {AIRLINE, JET, MEAL, PASSENGER, PILOT, ...} and 7Z = {has-aircraft, has-flight, property-of, serves, fly-from.",
        "fly-to, ...}.",
        "To be able to parse texts, Nlarkert and Hahn devised a system that grants a syntactic link between two concepts z and y if there is an acyclic path of relations ri E 7Z and concepts ci E C such that each ri is a conceptual role of CI_ t, with range(r,)= ci and co = A (c„ isac.",
        "y V y isac• en ).",
        "Following established classifications (Lakoff and Johnson, 1990), Markert and Hahn predefine some of the relations from 72. as metonymic.",
        "These relations are {has-part, part-of, produced-by, contained-in.",
        "made-on.",
        "Thus, a metonymy is recognized whenever one of the relations ri from a path is metonymic.",
        "In this framework, the interpretation of the relation between .r =airline and y =dinner in (Q1) is rendered by the Path-1: co=company (with x=airline-isa-+company), r1 =has-part, et= employee (with flight-attendant-isa---f employee and range (serve, SUBJECT) . flight-attendant), r2=serve, c3=meal (with y=dinner-isa-+meal).",
        "Similarly, the interpretation of the conceptual relatedness between x=airline and g-----Boston in (Q2) is rendered by the Path-2: co=airline, rt=hasflight, c1=scheduled-flight, r2=arrive-at, c3=city (with y=Boston-isa-city).",
        "The presence of ri=has-part in Path-1 and of rt=has-flight in Path-2 indicates that the two",
        "paths correspond to metonymic readings.",
        "Relation has-flight is not among the predefined metonymic relations considered by Markert and Hahn, but clearly would need to be so, to classify Path-2 as metonymic.",
        "Moreover, as a distinction on the predicate coercions, Path-1 contains the relation r2=serve, identical to the wh-predicate of (Q1), indicating that it is not a predicative metonymy.",
        "The referential metonymy from Path-1 is determined by the metonymic relation ri=has-part, coercing airline to flight attendants.",
        "In contrast, Path2 has relation r2 – arrive-at that coerces the wh-predicate fly-to from (Q2).",
        "Markert and Hahn do not analyze the semantics of the metonymic paths, but instead distinguish referential and predicative metonymies only in the anaphoric cases.",
        "Considering that expression A is a metonymic coercion of the concept B, they assume that in the predicative case A should be available for reference resolution, whereas in the referential case, only B should be so.",
        "To be able to assess the availability for reference resolution, they search for the presence of A and B in the list of forward-looking centers of the previous sentences (thus using the functional centering framework defined in (Grosz et al., 1995)).",
        "A similar path-finding methodology for deriving metonymies was used by the met* system (Fass, 1991), in which connections between the sense frames of textual concepts are retrieved from a lexicon of the size of 500 word senses.",
        "These paths are then classified against a small set of predefined metonymic inference rules, and form the grounds for the figurative interpretation of textual expressions.",
        "In met* there is no support for distinctions between predicative and referential metonymies, since coercions are possible from any concept in a text.",
        "The appeal of this implementation stems from the fact that it uses word sense frames, inspired by the structure of dictionary entries and shows that the paths retrieved from such a knowledge representation can be used to identify classical forms of metonymy.",
        "This indicates that metonymy resolution can be performed by processing knowledge from lexical dictionaries, and therefore WordNet 1.6 is a suitable candidate.",
        "A different methodology of deriving coercions was implemented in TACITUS (Hobbs et al.. 1993).",
        "Whenever sortal constraints are violated, explicit arguments are replaced with coercion variables, related to the explicit arguments by generic relations.",
        "The coercion is devised when the generic relation subsumes some predicate that is brought forward by the abductive interpretation of the text.",
        "In the case of (Q1), argument jets is replaced with a coercion variable k which is expected to satisfy the subject-constraints of the verb serve.",
        "The abductive interpretation of (Q1) brings forward a reasoning path showing that variable k may be coerced to any sub-sumer of concept person.",
        "Such a subsumer is synset {steward, flight attendant], having the gloss (an attendant on an airplane).",
        "This gloss translates the generic relation between jets (a hyponym of airplanes) and variable k to the predicate on, cued by the prepositional relation attendant – on--'airplane.",
        "The interpretation of this prepositional relation is produced when it is matched against WordNet-based classes of prepositional attachments collected from large treebanks, following the methodology described in (Harabagiu, 1996).",
        "For this case, the on-prepositional relation attaches the place of work to the worker, thus giving meaning to the coercion of jets into flight attendants.",
        "Although the coercions derived in TACITUS do not distinguish the predicative or referential cases, they present a different method of building metonymic paths.",
        "By incorporating this unification-based mechanism of producing coercions with a lexical pathfinder working on WordNet, a novel way of deriving metonymies is made possible.",
        "It has the advantage that it relies only on approximations of sortal knowledge, as indirectly available from the WordNet database, and it does not need full-fledged abductions to be able to return metonymic paths."
      ]
    },
    {
      "heading": "3 Metonymic paths",
      "text": [
        "The process of deriving metonymic paths from WordNet consists of three distinct phases: (1) the identification of sortal constraints that need to be satisfied during the interpretation of nominal expressions, (2) the retrieval of related knowledge that complies with the sortal restrictions, and (3) the validation of coercions against anaphoric expressions from the sentences following the processed sentence.",
        "The first two phases rely on access to semantic information available in (1) the relational semantic encoded in WordNet (e.g., hypernyms, is_part, is_member, is_stuff, entail or pertaymym) spanning synsets or words encoded in the database and (2) the semantic of the synset definitions (known as glosses).",
        "To be able to have computational access to the gloss semantic, synset definitions have been translated into logical formulae inspired by notation proposed in (Hobbs, 1986-1) and implemented in TACITUS.",
        "Based on the davidsonian treatment of action sentences, in which events are treated as individuals, every gloss is transformed in a first-order predicate formula for which (1) verbs are mapped in predicates cerb(e,x,y) with the convention that variable e represents the eventuality of that action or event to take place, represents the subject of the action, and y represents its object (in the case of intransitive verbs.",
        "y is not attached to a predicate.",
        "whereas in, the case of bitransitive verbs, y is assumed to range over both the direct and indirect object); (b) nouns are mapped into their lexicalized predicates and (c) modifiers have the same argument as the predicate they modify.",
        "Prepositional attachments are indicated by preposition-predicates ranging over the pair of arguments of the predicates they attach.",
        "For example, the gloss of synset {airline, airline business, airway} is (a commercial enterprise that provides scheduled flights for passengers) and has the following logical form transformation (LFT): (enterprise (x) &commercial (x) &provide (a , x , y) & &f light (y)Scscheduled(y)&for(e,p)&passangar (p)3 Characteristic of LFTs is the fact that the gloss genus is always the first predicate, rendering the LFT a formula of the form [genus (x)&differentia(y)].",
        "Gloss geni are accessed repeatedly during the derivation of metonymic paths, and thus they need to be easily accessible.",
        "The first two phases of the metonymic inference relies also upon lexico-semantic relations determined by derivational morphology, specifically the links between verbs and their nominalizations.",
        "Relations between verb and noun synsets that have elements with common morphological roots have been added to the database, classifying them as (a) the action nominal-ization; (b) the result (or object) of the action or (c) the agent (or subject) of the action.",
        "For example, verb propose and noun proposal refer to the same action.",
        "A nominalization(act) link was established between verb synset {propose, project} and the sense of proposal glossed as (the act of making a proposal).",
        "A second nominalization(result) link was established between the same verb synset and the sense of proposal glossed as (something proposed).",
        "Phase Approximation of the sortal constraints.",
        "A nominal N is interpreted as literal or figurative depending on whether its sortal constraints to syntactically linked verb V are satisfied or not.",
        "Sortal information can be found in:",
        "• (i) the LFT(g), where g stands for the gloss of any sense i of V (hence Vi) or any of its hypernyms; • (ii) LFT(e), where • represents an example from g; • (iii) LFT(c).",
        "where c represent those glosses where",
        "N and V co-occur (and the sense of V is unknown).",
        "To access the sortal constraints of V implicitly encoded in WordNet, we collect all expressions from LFT(g) or LFT(e) such that:",
        "(1) they contain a predicate verb,(el, , „c.f.\"), representing either (a) Vi or (b) one of its hypernyms or (c) one of the gem from the LFTs of V. or its hypernyms; (2) they also contain any predicate that is (a) a subject, (b) an object and/or (c) a prepositional attachment to verb, in the same LFT.",
        "When all predicates are conceptualized in the respective LFTs.",
        "such expressions have the form:",
        "The sortal information for subjects and objects of Vi is:",
        "semantic sense k of V in 5,, is selected as a result of the fact that the similarity measure between 5„,' and the collection {.5;} is maximal when i k. The similarity measure between two expressions is defined as:",
        "where for role E Isubject,object,{prepi}} we have:",
        "(i) S im(role.",
        "S,, Si) = 1 if the conceptualizations of role(S;,) and role(Si) belong to the same hierarchy (ii) Sim(role.",
        "S.,.",
        "Si) = 0 when either rote(S0 role(Si) are not defined or iii) Sim(role.",
        "S, Si) = – 1 otherwise.",
        "Finally, considering the set operator: • Eph 52 =le I e E Si U S2 and there is no other",
        "where subjec4 is the subject from some S:„ in which the sense of v is i; O Object_Sorti(V)=Objecti(v) Lir, object:7.",
        "„ where object, is the object from some S„ in which the sense of V is i; O Prep_Sorti(V,prep)=,Vouni(V,prep) eh lig„ nounwhere noun,, attaches to the sense i of V through prep in some S.",
        "ercions.",
        "Sorts satisfaction amounts to (1) the recognition of the sense of V in the text and (2) a search for any element from Role_Sorti(V) across all concepts semantically related to all WordNet senses of N (given that N has the same role in the text).",
        "The recognition of sense i of V is based also on the maximal value of similarity between S,, the expression retrieved from the LFT of the text, and {Sort, (V)}.",
        "where Sort,(V) is defined as:",
        "The satisfaction of Role_Sorti(V) is a search for any element from this set along (1) all synonyms, (2) all hypernyms and (3) all LFT geni for each WordNet sense of N. If this search is successful, we rule that N had a literal reading.",
        "Otherwise, we need to build metonymic paths to be able to access the related knowledge.",
        "Two distinct ways of deriving metonymic paths have been developed.",
        "Lexico-semantic paths.",
        "The codification of meronymic relations in WordNet determines the consideration of lexico-semantic paths composed of isa and at least one is_part, is_member, or is_stuff relations (or their reverses) as a means of deriving coercions.",
        "Implementing 22.29% of the semantic connections between noun concepts as meronyms, WordNet 1.6 sets an acceptable level of granularity for a knowledge representation needed to derive metonymic information.",
        "Lexico-semantic metonymies retrieve concepts E Role_Sorti(V) that (1) are linked through a meronymic relation to any WordNet sense of N (or one of its hypernyms or geni); (2) morphologically or idiomatically indicate meronymic relations to N, or (3) represent predicates from the LFT of N (or its hypernyms) having thematic roles for the same verb that is the genus of the LFT.",
        "The general form of the lexico-semantic paths is determined to be PathLs = (C0=N,r1,Chr2,...,C„,), with at least for one i, ri is a WordNet meronymic relation.",
        "The case when a triplet (CI_ ,Ci) is part of an LFT extends the classical metonymies object-for-agent and product-for-producer.",
        "The WordNet concepts that morphologically cue meronymic relations are those synsets containing collocations of such lexemes as unit (e.g., administrative unit, army unit), system (e.g., exhaust system.",
        "file system), part (e.g. body part, academic department), group (e.g., jazz group, pressure group), or other words that form the same hierarchies as part to member.",
        "Similarly, concepts containing in their glosses idioms like \"a group of'' or 'part of'' cue meronymic relations to the gloss genus.",
        "Morphological paths.",
        "Frequently, N is a nominalization of a Vv, and thus LFT(VN) brings forward related semantic information.",
        "Moreover, the nominalization relations indicate the role of N in the LFT(VN): a nominalization(result) link corresponds to an object role, whereas a nominalization(agent) link relates to a subject role of N in the LFT( VN).",
        "This entails the interchangeability of the genus of LFT(N) with verb(e..rb.r2)&noun(z.1) (with i=1 if role=subject and i=2 if role=object) when verb is the predicate representing Va and noun is the predicate for N or any of its geni (in the hierarchies of the sense of N morphologically related to VN).",
        "The resulting logical form transformations are denoted as LFT'(N).",
        "In this case, we can compute the Similar-ity(Text,LFT' (N)) and pick the Role(s) for which it is maximal and incorporate the corresponding LFTs in the most similar LFT' (N), producing the final coercion.",
        "Morphological paths are sequences of three kinds of steps: (1) relatedness based on morphological relations (i.e., N – nominalizat ion-4 VN), (2) ad-hoc weighted abduction based on similarity between text roles and the logical forms of the hypernyms of N (i.e. LFT' (N) – Similarity(text)kLFT(Roles)), and (3) unification of similar logical expression (i.e., LFT' (VN) – unification(LFT(text)--+Nc.",
        "Morphologic paths exploit morphological links and overlaps in the LFTs and resolve predicative metonymies (by bringing into play additional verbal predicates).",
        "In contrast, lexico-semantic paths resolve referential metonyies.",
        "paths produce the expected coerced knowledge if they bring forward concepts that corefer with nominals from the successive sentences.",
        "There are three tests for the validation of coercions through anaphora.",
        "They determine whether there is a concept in a lexico-semantic path or a predicate in a morphological path that (1) is identical, (2) is a hypernym, or (3) is a genus of one of the nominal expressions from the following sentences."
      ]
    },
    {
      "heading": "4 A case study",
      "text": [
        "The processing associated with the derivation of metonymic paths is exemplified on a text presented in the manual defining the coreference task for the DARPA-sponsored ML1C 7 competition (Hirshman and Chinchor, 1997): (Si) The White House sent its health care proposal to the Congress yesterday.",
        "(S2) Senator Dole said the administration's bill had little chance of passing.",
        "The approximation of the sortal constraints of V=send from (Si) determines:"
      ]
    },
    {
      "heading": "o (a) the selection of sense i=2 from the eight senses",
      "text": [
        "encoded for verb send in WordNet 1.6. due to greater similarity between its sorts and the roles from (Si).",
        "o (b) Sub ject2(send)={{PersonindividuaLsomeone}}:",
        "The search space for the sortal constraints is determined by the LFT of (Si):",
        "across the synonyms, hypernyms and geni of both WordNet senses of 'White House, the three senses of noun proposal and proper noun Congress respectively.",
        "The WordNet search for the satisfaction of sortal constraint identifies communication as the hypernym of sense 1 and 2 of proposal and person as the genus of {legislature , law_makers}, the hypernym of Congress, thus indicating that in (Si), proposal and Congress have literal meaning.",
        "Noun proposal as a nominalization is a candidate for morph-logic path derivations as well.",
        "The search for sortal constraints for the role of subject is not successful, requiring the inference of metonymic paths.",
        "A lexico-semantic path is derived, linking sense 1 of White House to person, the genus of synset administration: Path!",
        ": White.House- isa-governinant _department - -isa-).administ rat ive_unit -morphological_rue-+ --+administrat ion-genus-4person The meronymic morphological cue from Pathl is consistent with the meronyms encoded in WordNet 1.6, because we have:"
      ]
    },
    {
      "heading": "as a semantic relation encoded in WordNet 1.6",
      "text": [
        "Moreover, the anaphoric validation of Pathl is possible because nominal administration is present in (S2).",
        "In the case of Object2(send) a morphological path accounts for the coerced knowledge.",
        "Nominalization proposal is the result of the action expressed by synset V'={ propose,project}.",
        "Integrating predicate proposal as an object in the LFT(V` ) we obtain: LFT'(proposal)=present(e2, YI Y2 )&proposal(y2 )84 Scfor(es , ys )8,cconsideration(y3 ) When computing the similarity with (Si), we obtain Prep_Sort2(send,to) as the role candidate to be incorporated in LFT' (proposal).",
        "This is enforced by the LFT of synset {motion.question}.",
        "a hyponym of sense 1 of proposal.",
        "The gloss of Intotion,question} is (a proposal for action made to a deliberative assembly for discussion and vote), producing the LFT: LFT(motion)=proposal(p)&for(p,d)&discussion(x)Sc &vote( x )&ao( p,a)8cassembly( a) in which present(e2, yi, y2)&proposal(y2) may substitute proposal(p)whereas discussion can be replaced by its hypernym consideration.",
        "Furthermore.",
        "since Congress is a hyponym of assembly and the filler of Prep_Sort2(send.to) in (Si).",
        "we can unify LFT(motion), LFT ' (proposal) and LFT(legislature) and obtain the final coercion as:",
        "Path2 is shown in its entirety in Figure 1.",
        "The anaphoric validation is shown to link bill from (S2) to law, since law is a genus of the first WordNet sense of bill.",
        "Paths brings forward two new actions (indicated by e2 and e3), which accounts for its classification as a predicative metonymy.",
        "The usage of the LFT of a hyponym of proposal is a consequence of modeling Gricean principles via lexical chains from WordNet.",
        "The relevance maxim is enforced whenever as many lexical chains as possible can be retrieved between previously activated concepts and novel information.",
        "When we process the sort satisfaction of the object role, concept legislature is already activated and it satisfies the Prep_sort2(sencl.to) constraints.",
        "The same thematic role is represented in the LFT of not ion, thus enlarging the number of lexical paths between proposal",
        "and legislature and increasing the relevance of legislature in the context of coercing knowledge for the object proposal.",
        "The final unification reinforces the relevance of legislatures congruent with the coreferential link between bill and law."
      ]
    },
    {
      "heading": "5 Conclusions",
      "text": [
        "This paper proposes a method of deriving metonymic coercions by using the information available in WordNet 1.6.",
        "The method does not presuppose the availability of sortal constraints, but rather builds approximations of sortal information from the knowledge implemented in WordNet.",
        "It uses two distinct approaches for knowledge coercion: one that relies on le:dco-semantic information, another based on morphological links and unifying logic formulae (LFTs) inferred from conceptual definitions.",
        "To evaluate this methodology of deriving metonymic coercions, a test set of 20 New York Times articles were parsed by FASTUS (Appelt et al., 1993) and used in conjunction with their coreference keys, as provided by the MUC test data.",
        "There were 1261 nominal expressions, distributed in four classes as illustrated in Table 1.",
        "A percentage of 23% nominals were anaphoric, out of which almost 74% had literal meaning.",
        "In approximating the sortal constraints, sorts for 68.2% of nominals were returned.",
        "When the sorts were not satisfied by searches through WordNet, metonymic paths were derived.",
        "As Table 1 indicates, 68.9% of these paths were lexico-semantic (denoted with r=referential metonymies) and 31.1% were morphological (denoted with p=predicative metonymies).",
        "The evaluation of path-validating anaphorae against coreference keys resulted in a precision rate of 76% and a recall of 83%.",
        "These results indicate that we need to experiment with different similarity measures.",
        "We also found that the metonymies have a significant contribution as knowledge sources for coreference resolution.",
        "43% of the coreference keys were accounted by mere string matches.",
        "3.1% by synonyms encoded in WordNet.",
        "3.7% by hypernyms and 16.3% by links made possible through coercions."
      ]
    }
  ]
}
