{
  "info": {
    "authors": [
      "Thierry Declerck",
      "Peter Wittenburg",
      "Hamish Cunningham"
    ],
    "book": "Workshop on Human Language Technology and Knowledge Management",
    "id": "acl-W01-1017",
    "title": "The Automatic Generation of Formal Annotations in a Multimedia Indexing and Searching Environment",
    "url": "https://aclweb.org/anthology/W01-1017",
    "year": 2001
  },
  "references": [
    "acl-A00-1033",
    "acl-A97-1031",
    "acl-C94-2144",
    "acl-C96-1021",
    "acl-C96-2116",
    "acl-M98-1007",
    "acl-P98-2143"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We describe in this paper the MU-MIS Project (Multimedia Indexing and Searching Environment)1, which is concerned with the development and integration of base technologies, demonstrated within a laboratory prototype, to support automated multimedia indexing and to facilitate search and retrieval from multimedia databases.",
        "We stress the role linguistically motivated annotations, coupled with domain-specific information, can play within this environment.",
        "The project will demonstrate that innovative technology components can operate on multilingual, multisource, and multimedia information and create a meaningful and queryable database."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "MUMIS develops and integrates basic technologies, which will be demonstrated within a laboratory prototype, for the automatic indexing of multimedia programme material.",
        "Various technology components operating offline will generate formal annotations of events in the data material processed.",
        "These formal annotations will form the basis for the integral online part of the MUMIS project, consisting of a user interface allowing the querying of videos.",
        "The indexing of the video material with relevant events will be done along the",
        "line of time codes extracted from the various documents.",
        "For this purpose the project makes use of data from different media sources (textual documents, radio and television broadcasts) in different languages (Dutch, English and German) to build a specialized set of lexicons and an ontology for the selected domain (soccer).",
        "It also digitizes non-text data and applies speech recognition techniques to extract text for the purpose of annotation.",
        "The core linguistic processing for the annotation of the multimedia material consists of advanced information extraction techniques for identifying, collecting and normalizing significant text elements (such as the names of players in a team, goals scored, time points or sequences etc.)",
        "which are critical for the appropriate annotation of the multimedia material in the case of soccer.",
        "Due to the fact that the project is accessing and processing distinct media in distinct languages, there is a need for a novel type of merging tool in order to combine the semantically related annotations generated from those different data sources, and to detect inconsistencies and/or redundancies within the combined annotations.",
        "The merged annotations will be stored in a database, where they will be combined with relevant metadata.2 Finally the project will develop a user interface to enable professional users to query the database, by selecting from menus based on structured an2 We see in this process of merging extracted informations and their combination with metadata a fruitful base for the identification and classification of content or knowledge from distinct types of documents.",
        "notations and metadata, and to view video fragments retrieved to satisfy the query, offering thus a tool to formulate queries about multimedia programmes and directly get interactive access to the multimedia contents.",
        "This tool constitutes the online component of the MUMIS environment."
      ]
    },
    {
      "heading": "2 State of the Art",
      "text": [
        "MUMIS differs in many significant ways from existing technologies and already achieved or advanced projects 3.",
        "Most closely related to the thematic focus of MUMIS are the HLT projects Pop-Eye [POP] and OLIVE [OLI].",
        "Pop-Eye used subtitles to index video streams and offered timestamped texts to satisfy a user query, on request displaying a storyboard or video fragment corresponding to the text hit.",
        "OLIVE used automatic speech recognition to generate transcriptions of the sound tracks of news reports, which were then indexed and used in ways similar to the Pop-Eye project; both projects used fuzzy matching IR algorithms to search and retrieve text, offering limited multilingual access to texts.",
        "Instead of using IR methods to index and search the transcriptions, MUMIS will create formal annotations to the information, and will fuse information annotations from different media sources.",
        "The fusion result is then used to direct retrieval, through interface techniques such as pop-up menus, keyword lists, and so on.",
        "Search takes the user direct to the storyboard and video clippings.",
        "The Informedia project at Carnegie-Mellon-University [INF] has a similar conceptual baseline to MUMIS.",
        "The innovative contribution of MUMIS is that it uses a variety of multilingual information sources and fuses them on the basis of formal domain-specific annotations.",
        "Where Informedia primarily focuses on special applications, MUMIS aims at the advancement and in-tegratibility of HLT-enhanced modules to enable information filtering beyond the textual domain.",
        "Therefore, MUMIS can be seen as complementary to Informedia with extensions typical for Europe.",
        "The THISL project [THI] is about spoken document retrieval, i.e., automatic speech recognition",
        "is used to auto-transcribe news reports and then information retrieval is carried out on this information.",
        "One main focus of THISL is to improve speech recognition.",
        "Compared to MUMIS it lacks the strong language processing aspects, the fusion of multilingual sources, and the multimedia delivery.",
        "Columbia university is running a project [COL] to use textual annotations of video streams to indicate moments of interest, in order to limit the scope of the video processing task which requires extreme CPU capacities.",
        "So the focus is on finding strategies to limit video processing.",
        "The University of Massachusetts (Amherst) is also running projects about video indexing [UMA], but these focus on the combination of text and images.",
        "Associated text is used to facilitate indexing of video content.",
        "Both projects are funded under the NSF Stimulate programme [NSF].",
        "Much work has been done on video and image processing (Virage [VIR], the EUROMEDIA project [EUR], Surfimage [SUR], the ISIS project [ISI], IBM's Media Miner, projects funded under the NSF Stimulate program [NSF], and many others).",
        "Although this technology in general is in its infancy, there is reliable technology to indicate, for example, scene changes using very low-level cues and to extract key frames at those instances to form a storyboard for easy video access.",
        "Some institutions are running projects to detect subtitles in the video scene and create a textual annotation.",
        "This task is very difficult, given a sequence of real scenes with moving backgrounds and so on.",
        "Even more ambitious tasks such as finding real patterns in real movies (tracing the course of the ball in a soccer match, for example) are still far from being achieved.4"
      ]
    },
    {
      "heading": "3 Formal Annotations for the Soccer Domain",
      "text": [
        "Soccer has been chosen as the domain to test and apply the algorithms to be developed.",
        "There are a number of reasons for this choice: availability of people willing to help in analyzing user requirements, existence of many information sources in",
        "several languages 5, and great economic and public interest.",
        "The prototype will also be tested by TV professionals and sport journalists, who will report on its practicability for the creation and management of their programme and information material.",
        "The principles and methods derived from this domain can be applied to other as well.",
        "This has been shown already in the context of text-based Information Extraction (IE), for which methodologies for a fast adaptation to new domains have been developed (see the MUC conferences and (Neumann et al., 2000)).",
        "And generally speaking the use of IE for automatic annotation of multimedia document has the advantage of providing, besides the results of the (shallow) syntactic processing, accurate semantic (or content/conceptual) information (and thus potential annotation) for specific predefined domains, since a mapping from the linguistically analyzed relevant text parts can be mapped onto an unambiguous conceptual description 6.",
        "Thus in a sense it can be assumed that IE is supporting the word sense disambiguation task.",
        "It is also commonly assumed (see among others (Cunningham, 1999)) that IE occupies an intermediate place between Information Retrieval (with few linguistic knowledge involved) and Text Understanding (involving the full deep linguistic analysis and being still not realized for the time being.).",
        "IE being robust but offering only a partial (but mostly accurate) syntactic and content analysis, it can be said that this language technology is actually filling the gap between available low-level annotated/indexed documents and corpora and the desirable full content annotation of those documents and corpora.",
        "This is the reason why MUMIS has chosen this technology for providing automatic annotation (at distinct linguistic and domain-specific levels) of multimedia material, allowing thus to add queryable “content in",
        "formationf ” to this material."
      ]
    },
    {
      "heading": "4 The Multimedia Material in MUMIS",
      "text": [
        "The MUMIS project is about automatic indexing of videos of soccer matches with formal annotations and querying that information to get immediate access to interesting video fragments.",
        "For this purpose the project chose the European Football Championships 2000 in Belgium and the Netherlands as its main database.",
        "A major project goal is to merge the formal annotations extracted from textual and audio material (including the audio part of videos) on the EURO 2000 in three languages: English, German, Dutch.",
        "The material MUMIS has to process can be classified in the following way:",
        "1.",
        "Reports from Newspapers (reports about specific games, general reports) which is classified as free texts (FrT) 2.",
        "Tickers, close captions, Action-Databases which are classified as semi-formal texts (SFT) 3.",
        "Formal descriptions about specific games which are classified as formal texts (FoT) 4.",
        "Audio material recorded from radio and TV broadcasts 5.",
        "Video material recorded from TV broadcasts",
        "1-4 will be used for automatically generating formal annotations in order to index 5.",
        "MUMIS is investigating the precise contribution of each source of information for the overall goal of the project.",
        "Since the information contained in formal texts can be considered as a database of true facts, they play an important role within MUMIS.",
        "But nevertheless they contain only few information about a game: the goals, the substitutions and some other few events (penalties, yellow and red cards).",
        "So there are only few time points available for indexing videos.",
        "Semi-formal texts (SFT), like live tickers on the web, are offering much more time points sequences, related with a higher diversity the distributed information of an enterprise and thus support the sharing and access to companies expertise and knowhow.",
        "of events (goals scenes, fouls etc,) and seem to offer the best textual source for our purposes.",
        "Nevertheless the quality of the texts of online tickers is often quite poor.",
        "Free texts, like newspapers articles, have a high quality but the extraction of time points and their associated events in text is more difficult.",
        "Those texts also offer more background information which might be interesting for the users (age of the players, the clubs they are normally playing for, etc.).",
        "Figures 1 and 2 in section 8 show examples of (German) formal and semi-formal texts on one and the same game."
      ]
    },
    {
      "heading": "5 Processing Steps in MUMIS",
      "text": []
    },
    {
      "heading": "5.1 Media Pre-Processing",
      "text": [
        "Media material has been delivered in various formats (AudioDAT, AudioCassettes, Hi-8 video cassettes, DV video cassettes etc) and qualities.",
        "All audio signals (also those which are part of the video recordings) are digitized and stored in an audio archive.",
        "Audio digitization is done with 20 kHz sample frequency, the format generated is according to the de-facto wav standard.",
        "For digitization any available tool can be used such as SoundForge.",
        "Video information (including the audio component) of selected games have been digitized into MPEG1 streams first.",
        "Later it will be encoded in MPEG2 streams.",
        "While the quality of MPEG1 is certainly not satisfying to the end-user, its bandwidth and CPU requirements are moderate for current computer and network technology.",
        "The mean bit rate for MPEG1 streams is about 1.5 Mbps.",
        "Current state-of-the-art computers can render MPEG1 streams in real time and many network connections (Intranet and even Internet) can support MPEG1.",
        "MPEG2 is specified for about 3 to 5 Mbps.",
        "Currently the top-end personal computers can render MPEG2, but MPEG2 is not yet supported for the most relevant player APIs such as JavaMediaFramework or Quicktime.",
        "When this support is given the MUMIS project will also offer MPEG2 quality.",
        "For all separate audio recordings as for example from radio stations it has to be checked whether the time base is synchronous to that one of the corresponding video recordings.",
        "In case of larger deviations a time base correction factor has to be estimated and stored for later use.",
        "Given that the annotations cannot be created with too high accuracy a certain time base deviation will be accepted.",
        "For part of the audio signals manual transcriptions have to be generated to train the speech recognizers.",
        "These transcripts will be delivered in XML-structured files.",
        "Since keyframes will be needed in the user interface, the MUMIS project will develop software that easily can generate such keyframes around a set of predefined time marks.",
        "Time marks will be the result of information extraction processes, since the corresponding formal annotations is referring to to specific moments in time.",
        "The software to be written has to extract the set of time marks from the XML-structured formal annotation file and extract a set of keyframes from the MPEG streams around those time marks.",
        "A set of keyframes will be extracted around the indicated moments in time, since the estimated times will not be exact and since the video scenes at such decisive moments are changing rapidly.",
        "There is a chance to miss the interesting scene by using keyframes and just see for example spectators.",
        "Taking a number of keyframes increases the chance to grab meaningful frames."
      ]
    },
    {
      "heading": "5.2 Multilingual Automatic Speech Recognition",
      "text": [
        "Domain specific language models will be trained.",
        "The training can be bootstrapped from written reports of soccer matches, but substantial amounts of transcribed recordings of commentaries on matches are also required.",
        "Novel techniques will be developed to interpolate the baseline language models of the Automatic Speech Recognition (ASR) systems and the domain specific models.",
        "Moreover, techniques must be developed to adapt the vocabularies and the language models to reflect the specific conditions of a match (e.g., the names players have to be added to the vocabulary, with the proper bias in the language model).",
        "In addition, the acoustic models must be adapted to cope with the background noise present in most recordings.",
        "Automatic speech recognition of the sound tracks of television and (especially) radio programmes will make use of closed caption subtitle texts and information extracted from formal texts to help in finding interesting sequences and automatically transcribing them.",
        "Further, the domain lexicons will help with keyword and topic spotting.",
        "Around such text islands ASR will be used to transcribe the spoken soundtrack.",
        "The ASR system will then be enriched with lexica containing more keywords, to increase the number of sequence types that can be identified and automatically transcribed."
      ]
    },
    {
      "heading": "5.3 Multilingual Domain Lexicon Building",
      "text": [
        "All the collected textual data for the soccer domain are used for building the multilingual domain lexicons.",
        "This data can be in XML, HTML, plain text format, etc.",
        "A number of automatic processes are used for the lexicon building, first on a monolingual and secondly on a multilingual level.",
        "Manual browsing and editing is taking place, mainly in order to provide the semantic links to the terms, but also for the fine-tuning of the lexicon according to the domain knowledge.",
        "Domain lexicons are built for four languages, namely English, German, Dutch and Swedish.",
        "The lexicons will be delivered in a fully structured, XML-compliant, TMX-format (Translation Memory eXchange format).",
        "For more information about the TMX format see http://www.lisa.org/tmx/tmx.htm.",
        "We will also investigate how far EUROWORDNET resources (see http://www.hum.uva.nl/ ewn/) can be of use for the organization of the domain-specific terminology."
      ]
    },
    {
      "heading": "5.4 Building of Domain Ontology and Event Table",
      "text": [
        "The project is currently building an ontology for the soccer domain, taking into consideration the requirements of the information extraction and merging components, as well as users requirements.",
        "The ontology will be delivered in an XML format'.",
        "'There are still ongoing discussions within the project consortium wrt the best possible encoding format for the domain ontology, the alternative being reduced probably to RDFS, OIL and IFF, see respectively, and among others, http://www.w3.org/TR/rdfschema/, http://www.oasis-open.org/cover/oil.html and http://www.ontologos.org/IFF/The%20IFF%20Language.",
        "html In parallel to building the ontology an event table is being described.",
        "It contains the major event types that can occur in soccer games and their attributes.",
        "This content of the table is matching with the content of the ontology.",
        "The event table is a flat structure and guides the information extraction processes to generate the formal event annotations.",
        "The formal event annotations build the basis for answering user queries.",
        "The event table is specified as an XML schema to constrain the possibilities of annotation to what has been agreed within the project consortium."
      ]
    },
    {
      "heading": "5.5 Generation of Formal Annotations",
      "text": [
        "The formal annotations are generated by the IE technology and are reflecting the typical output of IE systems, i.e.instantiated domain-specific templates or event tables.",
        "The slots to be filled by the systems are basically entities (player, teams etc.",
        "), relations (player of, opponents etc.)",
        "and events (goal, substitution etc.",
        "), which are all derived from the current version of the domain ontology and can be queried for in the online component of the MUMIS prototype.",
        "All the templates associated with an event are including a time slot to be filled if the corresponding information is available in a least one of the sources consulted during the IE procedure.",
        "This time information is necessary for the indexing of the video material.",
        "The IE systems are applying to distinct sources (FoT, FrT etc.)",
        "but they are not concerned with achieving consistency in the IE result on distinct sources about the same event (game): this is the task of the merging tools, described below.",
        "Since the distinct textual sources are differently structured, from “formal” to “free” texts, the IE systems involved have adopted a modular approach: regular expressions for the detection of Named Entities in the case of formal texts, full shallow parsing for the free texts.",
        "On the base of the factual information extracted from the formal texts, the IE systems are also building dynamic databases on certain entities (like name and age of the players, the clubs they are normally playing for, etc.)",
        "or certain metadata (final score), which can be used at the next level of processing."
      ]
    },
    {
      "heading": "5.6 The Merging Tool",
      "text": [
        "The distinct formal annotations generated are passed to a merging component, which is responsible for avoiding both inconsistencies and redundancies in the annotations generated on one event (in our case a soccer game).",
        "In a sense one can consider this merging component as an extension of the so-called co-reference task of IE systems to a cross-document (and cross-lingual) reference resolution task.",
        "The database generated during the IE process will help here for operating reference resolution for more “verbose” types of texts, which in the context of soccer are quite “poetic” with respect to the naming of agents (the “Kaiser” for Beckenbauer, the “Bomber” for Mueller etc...), which would be quite difficult to achieve within the sole referential information available within the boundary of one document.",
        "The project will also investigate here the use of inferential mechanisms for supporting reference resolution.",
        "So for example, “knowing” from the formal texts the final score of a game and the names of the scorers, following formulation can be resolved form this kind of formulation in a free text (in any language): “With his decisive goal, the “Bomber” gave the victory to his team.”, whereas the special naming “Bomber” can be further added to the entry “Mueller” The merging tools used in MUMIS will also take into consideration some general representation of the domain-knowledge in order to filter out some annotations generated in the former phases.",
        "The use of general representations9 (like domain frames), combined with inference mechanisms, might also support a better sequential organization of some event templates in larger scenarios.",
        "It will also allow to induce some events which are not explicitly mentioned in the sources under consideration (or which the IE systems might not have detected)."
      ]
    },
    {
      "heading": "5.7 User Interface Building",
      "text": [
        "The user first will interact with a web-portal to start a MUMIS query session.",
        "An applet will be",
        "down-line loaded in case of showing the MUMIS demonstration.",
        "This applet mainly offers a query interface.",
        "The user then will enter a query that either refers to metadata, formal annotations, or both.",
        "The MUMIS on-line system will search for all formal annotations that meet the criteria of the query.",
        "In doing so it will find the appropriate meta-information and/or moments in some media recording.",
        "In case of meta-information it will simply offer the information in scrollable text widgets.",
        "This will be done in a structured way such that different type of information can easily be detected by the user.",
        "In case that scenes of games are the result of queries about formal annotations the user interface will first present selected video keyframes as thumbnails with a direct indication of the corresponding metadata.",
        "The user can then ask for more metadata about the corresponding game or for more media data.",
        "It has still to be decided within the project whether several layers of media data zooming in and out are useful to satisfy the user or whether the step directly to the corresponding video fragment is offered.",
        "All can be invoked by simple user interactions such as clicking on the presented screen object.",
        "Playing the media means playing the video and corresponding audio fragment in streaming mode requested from a media server."
      ]
    },
    {
      "heading": "6 Standards for Multimedia Content",
      "text": [
        "MUMIS is looking for a compliance with existing standards in the context of the processing of multimedia content on the computer and so will adhere to emerging standards such as MPEG4, which defines how different media objects will be decoded and integrated at the receiving station, and MPEG7, which is about defining standards for annotations which can be seen as multimedia objects.",
        "Further, MUMIS will also maintain awareness of international discussions and developments in the aerea of multimedia streaming (RTP, RTSP, JMF... ), and will follow the discussions within the W3C consortium and the EBU which are also about standardizing descriptions of media content."
      ]
    },
    {
      "heading": "7 Role of MUMIS for the Annotation of Multimedia Content",
      "text": [
        "To conclude, we would like to list the points where we think MUMIS will, directly or indirectly, contribute to extract and access multimedia content: uses multimedia (MM) and multilingual information sources; carries out multimedia indexing by applying information extraction to a well-delineated domain and using already existing information as constraints; uses and extends advanced language technology to automatically create formal annotations for MM content; merges information from many sources to improve the quality of the annotation database; application of IE to the output of ASR and the combination of this with already existing knowledge; definition of a complex information annotation structure, which is stored in a standard document type definition (DTD); integration of new methods into a query interface which is guided by domain knowledge (ontology and multilingual lexica).",
        "So in a sense MUMIS is contributing in defining semantic structures of multimedia contents, at the level proposed by domain-specific IE analysis.",
        "The full machinery of IE, combined with ASR (and in the future with Image Analysis) can be used for multimedia contents development and so efficiently support cross-media (and cross-lingual) information retrieval and effective navigation within multimedia information interfaces.",
        "There seems thus that this technolgy can play a highly relevant role for the purposes of knowledge detection and management.",
        "This is probably specially valid for the merging component, which is eliminating redundancies in the annotations generated from sets of documents and establishing complex reference resolutions, thus simplyfying the access to content (and knowledge) distributed over multiple documents and media."
      ]
    },
    {
      "heading": "References",
      "text": []
    },
    {
      "heading": "8 Annex",
      "text": []
    }
  ]
}
