{
  "info": {
    "authors": [
      "Udo Hahn",
      "Martin Romacker"
    ],
    "book": "Human Language Technology Conference",
    "id": "acl-H01-1067",
    "title": "The SynDiKATe Text Knowledge Base Generator",
    "url": "https://aclweb.org/anthology/H01-1067",
    "year": 2001
  },
  "references": [
    "acl-A00-2043",
    "acl-J95-2003",
    "acl-J99-3001"
  ],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "SYNDIKATE comprises a family of text understanding systems for automatically acquiring knowledge from real-world texts, viz. information technology test reports and medical finding reports.",
        "Their content is transformed to formal representation structures which constitute corresponding text knowledge bases.",
        "SYNDIKATE's architecture integrates requirements from the analysis of single sentences, as well as those of referentially linked sentences forming cohesive texts.",
        "Besides centering-based discourse analysis mechanisms for pronominal, nominal and bridging anaphora, SYNDIKATE is supplied with a learning module for automatically bootstrapping its domain knowledge as text analysis proceeds."
      ]
    },
    {
      "heading": "1. INTRODUCTION",
      "text": [
        "The SYNDIKATE system belongs to the broad family of information extraction (IE) systems [1].",
        "Significant progress has been made already, as current IE systems provide robust shallow text processing such that frame-style templates are filled with factual information about particular entities (locations, persons, event types, etc.)",
        "from the analyzed documents.",
        "Nevertheless, typical MUC-style systems are also limited in several ways.",
        "They provide no inferencing capabilities which allow substantial reasoning about the template fillers (hence, their understanding depth is low), and their potential to deal with textual phenomena is highly constrained, if it is available at all.",
        "Also novel and unexpected though potentially relevant information which does not match given template structures is hard to account for, since system designers commit to a fixed collection of domain knowledge templates (i.e., they have no concept learning facilities).",
        "With SYNDIKATE, we are addressing these shortcomings and aim at a more sophisticated level of knowledge acquisition from real-world texts.",
        "The documents we deal with are technical narratives in German language taken from two domains, viz. test reports from the information technology (IT) domain as processed by the ITSYNDIKATE system [8], and finding reports from a medical subdomain (MED), the framework of the MEDSYNDIKATE system [10, 9].",
        "Our first goal is to extract conceptually and inferentially richer forms of knowledge than those captured by standard IE systems such as evaluative assertions and comparisons [25, 24], temporal [26] and spatial information [22].",
        "Second, we also want to dynamically enhance the set of knowledge templates through incremental taxonomy learning devices [12] so that the information extraction capability of the system is increased in a bootstrapping manner.",
        "Third, SYNDIKATE is particularly sensitive to the treatment of textual reference relations [27, 6, 14].",
        "The capability to properly deal with various forms of anaphora is a prerequisite for the soundness and validity of the knowledge bases we create as a result of the text understanding process and likewise for the feasibility of sophisticated retrieval and question answering applications based on the acquired text knowledge."
      ]
    },
    {
      "heading": "2. SYSTEM ARCHITECTURE",
      "text": [
        "The overall architecture of SYNDIKATE, an acronym which stands for \"SYNthesis of DIstributed Knowledge Acquired from TExts\", is summarized in Figure 1.",
        "Incoming texts, Ti, are mapped into corresponding text knowledge bases, TKBi, which contain a representation of Ti's content.",
        "This knowledge base platform may feed various information services, such as inferentially supported question answering (fact retrieval), text passage retrieval or text summarization [7]."
      ]
    },
    {
      "heading": "2.1 Sentence-Level Understanding",
      "text": [
        "Conceptual knowledge about the different domains is expressed in a KL-ONE-like description logic language [28].",
        "Corresponding to the division at the lexical level, the ontologies we provide are split up between one that is used by all applications, the Upper Ontology, while several dedicated ontologies account for the conceptual requirements of particular domains, e.g., IT (HARDDISK, COLORPRINTER, etc.)",
        "or MED (GASTRITIS, SURFAGEMUGUS, etc.).",
        "Semantic knowledge accounts for emerging conceptual relations between conceptual items according to those dependency relations that are established between their corresponding lexical items.",
        "Semantic interpretation schemata mediate between both levels in a way as abstract and general as possible [20].",
        "These schemata are applied to semantically interpretable subgraphs which are, from a semantic point of view, \"minimal\" subgraphs of the incrementally built dependency graph.",
        "Their bounding nodes contain content words (i.e., nouns, verbs, and adjectives, all of which have a conceptual correlate in the domain ontologies), while all possibly intervening nodes (zero up to four) contain only noncontent words (such as prepositions, articles, auxiliaries, etc., all of which have no conceptual correlates).",
        "Semantic interpretation schemata are fully embedded in the knowledge representation model and system (cf.",
        "Figure 1).",
        "The PARSETALK system, which comprises the lexicalized grammar and associated dependency parser, is embedded in an object-oriented computation model.",
        "So, the dependency relations are computed by lexical objects, so-called word actors, through strictly local message passing, only involving the lexical items they represent.",
        "To illustrate how a dependency relation is established computationally, we give a sketch of the basic protocol for incremental parsing [5]: After a word has been read from textual input by the WordScanner (step A1 in Figure 1), its associated lexeme (specified in the Lexicon) is identified (step A2) and a corresponding word actor gets initialized (step B1).",
        "As all content words are directly linked to the conceptual system, each lexical item w that has a conceptual correlate C in the domain knowledge base (step A3) gets instantiated in the text knowledge base (step B2).",
        "The lexical item Festplatte (hard disk) with the conceptual correlate HARD-DISK is instantiated, e.g., by HARD-DISK.3, the particular item being talked about in a given text.1 For integration in the parse tree, the newly created word actor searches its head (alternatively, its modifier) by sending parallel requests for dependential government to its left context (step C).",
        "The search space is restricted, since these requests are propagated upwards only along the `right shoulder' of the dependency graph constructed so far.",
        "All word actors addressed this way check, in parallel, whether their valency restrictions, i.e., grammatical and conceptual constraints, are met by the requesting word actor.",
        "Step D simulates a conceptual check in the text knowledge base, step E illustrates a test in the discourse memory.",
        "If all required constraints are fulfilled by one of the targeted word actors, an immediate semantic interpretation is performed.",
        "This usually alters the conceptual representation structures by way of slot filling (step F).",
        "Semantic interpretation consists of finding a relational link between the conceptual correlates of the two content words bounding the associated semantically interpretable subgraph.",
        "The linkage may either be constrained by dependency relations (e.g., the subject: relation of a transitive verb such as \"sell\" may only be interpreted conceptually in terms of AgENT or PATIENT roles), by intervening lexical material (e.g., some prepositions impose special role constraints, such as mit (with) does in terms of hAS-PART or INSTRUmENT roles), or it may be constrained by conceptual criteria only (as with the genitive: dependency relation, which unlike subject: imposes no additional selective conceptual constraints for interpretation).",
        "The corresponding knowledge about these language-specific constraints is densely encoded in the Lexicon class hierarchy, an approach which heavily relies on the property inheritance mechanisms inherent to the object-oriented paradigm."
      ]
    },
    {
      "heading": "2.2 Text-Level Understanding 2.2.1 Referential Text Phenomena",
      "text": [
        "The textual phenomena we deal with in SYNDIKATE establish referential links between consecutive utterances in a coherent text such as illustrated by three possible continuations of sentence (1), with three different forms of extrasentential anaphora:",
        "(1) Compaq verkauft ein Notebook mit einer Festplatte, die von Seagate hergestellt wird.",
        "(Compaq sells a notebook with a hard disk that is manufactured by Seagate.)",
        "(2) Pronominal Anaphora: Es ist mit einer Pentium-III-CPU ausgestattet.",
        "(It comes with a Pentium-III CPU.)",
        "(3) Nominal Anaphora: Der Rechnerist mit einer Pentium-III-CPU ausgestattet.",
        "(The machine comes with a Pentium-III CPU.)",
        "(4) Functional Anaphora:",
        "The results of sentence-level analysis for sentence (1) are given in Figure 2, which contains a syntactic dependency graph (together with five configurations of semantically interpretable subgraphs), and Figure 3, which displays its conceptual representation.",
        "For text-level analysis, pronominal anaphora still heavily depend on grammatical conditions the agreement of the antecedent (\"Notebook\") and the pronoun (\"Es\" (it)) in gender and number; also conceptual criteria apply insofar as a potential antecedent must fit the conceptual role (or case frame) restrictions when it is integrated in governing structures, say, the head verb of the clause.",
        "In general, however, the influence of grammatical criteria gradually diminishes for other types of text phenomena, while the influence of conceptual criteria increases.",
        "For nominal anaphora, number constraints are still valid, while a generalization relation between the anaphoric noun ( \"Rechner\" (machine)) and its proper antecedent (\"Notebook\") must hold, in addition.",
        "In the case of functional anaphora, no grammar constraints at all apply, while quite sophisticated conceptual role path conditions come into play, e.g., \"Arbeitsspeicher\" (main memory) being a constituent physical part of \"Notebook\".",
        "The problems text phenomena cause are of vital importance for the adequacy of the representation structures resulting from text processing, and are centered around the notions of incomplete, invalid and incoherent knowledge bases.",
        "In order to avoid the emergence of incomplete, invalid and incoherent text knowledge bases we consider discourse entities for establishing reference relations with upcoming items from the textual input at a local [27] and at a global level [14] of cohesion.",
        "To preserve adequate text representation structures a centering mechanism is used.",
        "The discourse entities which occur in an utterance Ui constitute its set of forward-looking centers, Cf (Ui).",
        "The elements in Cf (Ui) are ordered to reflect relative prominence in Ui in the sense that the most highly ranked element of Cf (Ui) is the most likely antecedent of an anaphoric expression in Ui+1, while the remaining elements are ordered according to decreasing preference for establishing referential links.",
        "While it is usually assumed (for the English language, in particular) that grammatical roles are the major determinant for the ranking on the Cf [4], we claim that for German a language with relatively free word order it is the functional information structure of the sentence [27].",
        "Accordingly, the constraints on the ordering of entries in Cf (Ui) prefer hearer-old (either evoked or unused) elements in an utterance (i.e., those that can be related to previously introduced discourse elements or generally accessible world knowledge) over mediated (inferrable) ones, while these are preferred over hearer-new (brand-new) elements for anaphora resolution.",
        "If two elements belong to the same category, then preference is defined in terms of linear precedence of the discourse units in the source text.",
        "When we apply these criteria to sentence (1), Table 1 depicts the resulting order of forward-looking centers in Cf (S1).",
        "Since we have no discourse-bound elements in the first sentence, textual precedence applies exclusively to the ordering of the center list items.",
        "Only nouns and their conceptual correlates are taken into consideration.",
        "The tuple notation takes the conceptual correlate of the lexical item in the text knowledge base in the first place, while the lexical surface form appears in the second place.",
        "(1) Cf: [COMPAq: Compaq, NOTEBOOK.2: Notebook, HARD-DISK.3: Festplatte, SEAgATE: Seagate]"
      ]
    },
    {
      "heading": "Hypothesis space-p Hypothesis space-q 2.3 Textual Learning",
      "text": [
        "The approach to learning new concepts as a result of text understanding builds on two different sources of evidence the prior knowledge of the domain the texts are about, and grammatical constructions in which unknown lexical items occur in the texts.",
        "The architecture of SyNDIKATE's concept learning component is depicted in Figure 9.",
        "The PARSETALK system generates dependency parse graphs.",
        "The kinds of syntactic constructions (e.g., genitive, appositive, comparative), in which unknown lexical items appear, are recorded and later assessed relative to the credit they lend to a particular concept hypothesis, e.g., high for appositives ( \"the notebook X\"), lower for genitives (\"Compaq's X\").",
        "The conceptual interpretation of parse trees involving unknown lexical items in the text knowledge base leads to the deduction of concept hypotheses.",
        "These are further enriched by conceptual annotations which reflect structural patterns of consistency, mutual justification, analogy, etc.",
        "relative to already available concept descriptions in the text knowledge base or other hypothesis spaces.",
        "Both kinds of evidence, in particular their predictive `goodness' for the learning task, are represented by corresponding sets of linguistic and conceptual quality labels.",
        "Alternative concept hypotheses for each unknown lexical item are organized in terms of corresponding hypothesis spaces, each of which holds a different conceptual reading.",
        "An inference engine embedded in the terminological system, the so-called quality machine, determines the overall credibility of single concept hypotheses by taking the available set of quality labels for each hypothesis into account.",
        "The qualifier, a terminological classifier extended by an evaluation metric for quality classes, computes a preference ranking of those hypotheses which remain valid after the text has been processed completely (cf. [12] for details)."
      ]
    },
    {
      "heading": "3. COVERAGE AND EVALUATION",
      "text": [
        "SyNDIKATE's coverage varies considerably depending on the target domain.",
        "The generic lexicon currently includes 3,000 entries, the IT lexicon adds 5,000, while the MED lexicon contributes 70,000 entries each.",
        "The Upper Ontology contains 1,200 concepts and roles, to which the IT ontology adds 3,000 and the MED ontology contributes 240,000 items.",
        "The IT domain was chosen as a testbed that can be extended on demand.",
        "The MED domain, however, is subject to ontology engineering efforts on a larger scale.",
        "In order to cope with the enormous knowledge engineering requirements, we semi-automatically transformed large portions of a semantically weak, yet high-volume medical terminology (UMLS) to a very large terminological knowledge base [21].",
        "Admittedly, SyNDIKATE has not yet undergone a thorough empirical evaluation in one of the envisaged application dimensions.",
        "We have, however, carefully evaluated its subcomponents.",
        "The results can be summarized as follows: Sentence Parsing.",
        "We compared a standard active chart parser with full backtracking capabilities with the parser of SyNDIKATE, which is characterized by limited memoization and restricted backtracking capabilities, using the same grammar specifications.",
        "On average, SyNDIKATE's parser exhibits a linear time complexity the factor of which is dependent on ambiguity rates of input sentences.",
        "The active chart parser runs into exponential time complexity whenever it encounters extragrammatical or ungrammatical input, since then it conducts an exhaustive search of the entire parse space.",
        "The loss of structural descriptions due to the parser's incompleteness amounts to 10% compared with the complete, though intractable parser [5].",
        "Text Parsing.",
        "While with respect to resolution capacity (effectiveness) no significant differences could be determined, the functional centering model we propose outperforms the best-known centering algorithms by a rate of 50% with respect to a measure of computation costs which considers \"cheap\" and \"expensive\" transitional moves between utterances to assess a text's coherency.",
        "Hence, the procedure we propose is more efficient [27].",
        "Semantic Interpretation.",
        "Our group has been pioneering work on the empirical evaluation of meaning representations.",
        "We assessed the quality and coverage of semantic interpretation for randomly sampled texts in the two domains we consider.",
        "While recall was rather low (57% for MED, 31% for IT), precision peaked at 97% and 94%, respectively [19].",
        "\"Heavy\" Semantics.",
        "We can deal with intricate semantic phenomena for which we have provided the first empirical evaluation data available at all.",
        "This relates to the resolution of metonymies, where we have determined a gain in effectiveness that amounts to 16% compared with the best procedures known so far [16], as well as it relates to comparatives and evaluative assertions, where gains in effectiveness were almost tripled [25].",
        "Concept Learning.",
        "The performance of the concept learning component has been compared to standard learning mechanisms based on the terminological classifier available in any sort of description logics systems.",
        "Our data indicate an increase of performance of 8% (87% accuracy, while that of standard classifiers is on the order of 79%) [12].",
        "Evaluating a text knowledge acquisition rather than an IE system poses hard methodological problems [2].",
        "The main reason being that a gold standard for comparison what constitutes a canonical, commonly agreed upon interpretation of the content of a text?",
        "is hard to establish, even for technical texts.",
        "A follow-up problem is constituted by the lack of a significant amount of annotated text knowledge bases on which comparative analyses might be assessed.",
        "MUC-style evaluation metrics, e.g., have already been qualified not to adequately reflect the functionality of less constrained text understanders [29]."
      ]
    },
    {
      "heading": "4. CONCLUSIONS",
      "text": [
        "A major hypothesis underlying the design of SyNDIKATE is that ignoring the referential relations between adjacent utterances will lead to referentially incomplete, invalid, or incoherent text knowledge bases.",
        "We determine plausible discourse units for reference resolution using the centering model.",
        "This allows us to deal with various forms of pronominal, nominal and functional anaphora in a uniform way.",
        "In order to establish local coherence at the text representation level, single discourse entities related by anaphoric expressions have to be conceptually linked.",
        "We claim that only sophisticated knowledge representation languages with powerful terminological reasoning capabilities, such as those from the KL-ONE family, are able to deal with the full range of challenges of referentially adequate text understanding, in particular considering nominal and functional anaphora.",
        "These two types of anaphora pose an enormous burden on the availability of rich domain knowledge.",
        "We respond to this challenge in two ways.",
        "In a large-scale knowledge engineering effort, we semi-automatically transform a semantically weak though huge thesaurus-style medical knowledge source into a terminological knowledge base.",
        "If such a human-made resource is missing, we turn to a purely automatic approach of bootstrapping a given domain knowledge base as part of ongoing text understanding processes.",
        "The depth of understanding we provide comes closest to systems such as SCISOR [18], TACITUS [15] or PUNdIT/KERNEl [17], but SYNDIKATE's knowledge acquisition strategies or learning capabilities have no counterpart there.",
        "Text understanders which incorporate learning components are even rarer but systems such as SNOWY [3] or WRAP-UP [23] either have a very narrow domain theory and lack robustness for dealing with unseen input effectively, or fail to account for a wide range of referential text phenomena, respectively."
      ]
    },
    {
      "heading": "5. ACKNOWLEDGMENTS",
      "text": [
        "The development of the SyNDrKATE system has been supported by various grants from Deutsche Forschungsgemeinschaft under Ha 2097/*.",
        "SyNDrKATE would not have come to existence without the exciting contributions and enthusiasm of current and former members of the group, in particular, Steffen Staab, Katja Markert, Michael Strube, Martin Romacker, Stefan Schulz, Klemens Schnattinger, Norbert Br^oker, Peter Neuhaus, Susanne Schacht, Manfred Klenner, and Holger Schauer."
      ]
    },
    {
      "heading": "6 REFERENCES",
      "text": []
    }
  ]
}
