{
  "info": {
    "authors": [
      "Eiichiro Sumita"
    ],
    "book": "Workshop on Data-Driven Methods in Machine Translation",
    "id": "acl-W01-1401",
    "title": "Example-Based Machine Translation Using DP-Matching Between Work Sequences",
    "url": "https://aclweb.org/anthology/W01-1401",
    "year": 2001
  },
  "references": [
    "acl-C00-1019",
    "acl-C90-3044",
    "acl-J90-2002",
    "acl-P91-1024"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "We propose a new approach under the example-based machine translation paradigm.",
        "First, the proposed approach retrieves the most similar example by carrying out DP-matching of the input sentence and example sentences while measuring the semantic distance of the words.",
        "Second, the approach adjusts the gap between the input and the most similar example by using a bilingual dictionary.",
        "We show the results of a computational experiment."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Knowledge acquisition from corpora is viable for machine translation.",
        "The background is as follows:",
        "• Demands have been increasing for machine translation systems to handle a wider range of languages and domains.",
        "• MT requires bulk knowledge consisting of rules and dictionaries.",
        "• Building knowledge consumes considerable time and money.",
        "• Bilingual/multilingual translations have become widely available.",
        "There are two approaches in corpus-based translation:",
        "1.",
        "Statistical Machine Translation (SMT): SMT learns models for translation from corpora and dictionaries and searches for the best translation according to the models in runtime (Brown et al., 1990; Knight, 1997; Ney et al., 2000).",
        "2.",
        "Example-Based Machine Translation (EBMT): EBMT uses the corpus directly.",
        "EBMT retrieves the translation examples that are best matched to an input expression and adjusts the examples to obtain the translation (Nagao, 1981; Sadler 1989; Sato and Nagao, 1990; Sumita and Iida, 1991; Kitano, 1993; Furuse et al., 1994; Watanabe and Maruyama, 1994; Cranias et al., 1994; Jones, 1996; Veale and Way, 1997; Carl, 1999, Andriamanankasina et al., 1999; Brown, 2000).",
        "This paper pursues EBMT and proposes a new approach by using the distance between word sequences.",
        "The following sections show the algorithm, experimental results, and implications and prospects."
      ]
    },
    {
      "heading": "2 The proposed method 2.1 Configuration",
      "text": [
        "As shown in Figure 1, our resources are (1) a bilingual corpus, in which sentences are aligned beforehand; (2) a bilingual dictionary, which is used for word alignment and translation; and (3) thesauri of both languages, which are used for aiding word alignment and incorporating the semantic distance between words into the word sequence distance."
      ]
    },
    {
      "heading": "2.2 Algorithm",
      "text": [
        "The translation process consists of four steps:1 I. Retrieve the most similar translation pair; II.",
        "Generate translation patterns; III.",
        "Select the best translation pattern; IV.",
        "Substitute target words for source words.",
        "Here, we illustrate the algorithm using translation from Japanese to English step by step."
      ]
    },
    {
      "heading": "2.2.1 Retrieval - Step I",
      "text": [
        "This step scans the source parts of all example sentences in the bilingual corpus.",
        "By measuring the distance (dist shown below) between the word sequences of the input and example sentences, it retrieves the examples with the minimum distance, provided the distance is smaller than the given threshold.",
        "Otherwise, the whole translation fails with no output.",
        "According to equation (1), dist is calculated as follows: The counts of the Insertion (I), Deletion (D), and Substitution (S) operations are summed up and the total is normalized by the sum of the length of the source and example sequences.",
        "Substitution (S) considers the semantic distance between two substituted words and is called SEMDIST.",
        "SEMDIST is defined as the division of K (the level of the least common abstraction in the thesaurus of two words) by N (the height of the thesaurus) according to equation (2) (Sumita and Iida, 1991).",
        "It ranges from 0 to 1.",
        "Let’s observe the following two sentences,2 (1 -j) the input and (2-j) the source sentence of the translation example, where the hatched parts represent the differences between the two sentences.",
        "Because “iro” and “dezain” are completely dissimilar in the thesauri used in the experiment, SEMDIST is 1, and therefore, the dist between them is (0+0+2*1) / (6+6) = 0.167.",
        "The dist is calculated efficiently by a standard dynamic programming technique (Cormen 1989).",
        "This step is an application of the so-called DP-matching, which is often used in speech recognition research.",
        "First, the step stores the hatched parts of the input sentence in memory for the following translation.",
        "Second, the step aligns the hatched parts of source sentence (2-j) to corresponding target sentence (2-e) of the translation example by using lexical resources.",
        "3 We do not align non-hatched parts word by word.",
        "We assume that non-hatched parts correspond together as a whole.",
        "This keeps most parts of the example unchanged in order to avoid mixing errors or unnaturalness in the translation.",
        "(2-j) dezain/ga/ki/ni/iri/masen (2-e) I do not like the design.",
        "We obtain the following translation pattern, where the variable X is used to connect source (2 -j-p) and target (2-e-p) and store instance (1 -j-b) in the input sentence.",
        "We may retrieve more than one example, and, moreover, translation patterns can differ.",
        "We have to select the most suitable one from among these translation patterns.",
        "We use a heuristic rule for this purpose.",
        "1.",
        "Maximize the frequency of the translation pattern.",
        "2.",
        "If this cannot be determined, maximize the sum of the frequency of words in the generated translation patterns.",
        "3.",
        "If this cannot be determined, select one randomly as a last resort.",
        "This step is straightforward.",
        "By translating the source word of the variable using the bilingual dictionary, and instantiating the variable within the target part of the selected translation pattern by target word (1 -e-b), we finally get target sentence (1-e)."
      ]
    },
    {
      "heading": "3 Experiment",
      "text": [
        "To see whether this rough approach works or not, we conducted a computational experiment using a large-scale bilingual corpus.",
        "In this section, we show the experimental conditions, performance, and error analysis."
      ]
    },
    {
      "heading": "Sentences",
      "text": []
    },
    {
      "heading": "Bilingual Corpus",
      "text": [
        "We built a collection of Japanese sentences and their English translations, which are usually found in phrasebooks for foreign tourists.",
        "Because the translations were made sentence by sentence, the corpus was sentence-aligned by birth.",
        "We lemmatized and POS-tagged both the Japanese and English sentences using our morphological analysis programs.",
        "The total sentence count was about 200 K. 4 The statistics are summarized in Table 1."
      ]
    },
    {
      "heading": "Test set",
      "text": [
        "A quality evaluation was done for 500 sentences selected randomly from the above-mentioned corpus and the remaining sentences were used as translation examples for the experiment."
      ]
    },
    {
      "heading": "Bilingual Dictionary",
      "text": [
        "We also used a bilingual dictionary previously developed for another MT system in the travel domain (Sumita et al.",
        "1999)."
      ]
    },
    {
      "heading": "Thesaurus",
      "text": [
        "We used thesauri whose hierarchies are based on the Kadokawa Ruigo-shin -jiten (Ohno 1984) for distance calculation and word alignment."
      ]
    },
    {
      "heading": "3.2 Results",
      "text": [
        "Here, we show coverage and accuracy results as evidence that our proposed machine translation system works."
      ]
    },
    {
      "heading": "3.2.1 Coverage",
      "text": [
        "Our approach does not produce any translation when there is no example whose dist is within the given threshold, which was 1/3 in the experiment.",
        "Our approach covers about 90% of 500 randomly selected sentences.",
        "As shown in Table 2, one half of 90% is matched exactly and the other half is matched approximately (dist < 1/3).",
        "Sentence Length Words Vocabulary 4 We call a sequence of sentences uttered by a single speaker an utterance.",
        "Our corpus is in fact aligned utterance by utterance.",
        "Strictly speaking, ‘sentence’ in this paper should be replaced by ‘utterance.’"
      ]
    },
    {
      "heading": "3.1 Experimental Conditions",
      "text": [
        "The characteristics of no output sentences are clearly explained by the average length.",
        "Our approach is not good with longer sentences because our algorithm has no explicit step of decomposing an input sentence into sub-sentences and because the longer the sentence, the smaller the possibility that there exists a similar sentence in the example database.",
        "We assume that a coverage of 90% is important because this means that if 200 K sentences were input into the system, the system would produce a translation 90% of the time.",
        "In other words, the system would help the user 90% of the time to communicate with foreign people (assuming the user to be in a foreign country)."
      ]
    },
    {
      "heading": "3.2.2 Accuracy Quality Ranking",
      "text": [
        "Each translation is graded into one of four ranks5 (described below) by a bilingual human translator who is a native speaker of the target language, American English:",
        "(A) Perfect: no problems in either information or grammar; (B) Fair: easy-to-understand with some unimportant information missing or flawed grammar; (C) Acceptable: broken but understandable with effort; (D) Nonsense: important information has been translated incorrectly."
      ]
    },
    {
      "heading": "Result",
      "text": [
        "As shown in Table 3, our proposal achieved a high accuracy of about 80% (A, B, C ranks in total).",
        "The remaining 20% are divided into ranks D and F (No output)."
      ]
    },
    {
      "heading": "Long Sentence Problem",
      "text": [
        "Figure 2 shows6 that the accuracy clearly decreases as the dist increases.",
        "This implies two points: (1) dist can indicate the quality of the produced translation, in contrast with the fact that MT systems usually do not provide any confidence factor on their results.",
        "The user is safe if he/she confines himself/herself to using translations with a small dist value; (2) The current algorithm has a problem in handling distant examples, which usually relate to the long sentence problem.",
        "As shown in the previous two subsections, the most dominant problem is in dealing with relatively longer sentences.",
        "We point out here that even for shorter sentences there are problems, although they are less frequent, as follows:"
      ]
    },
    {
      "heading": "• Idioms or collocations",
      "text": [
        "Even when the dist between the two sentences is small, i.e., they are quite similar in the source language, the meanings of the sentences can vary and the translation can be different in the target language.",
        "This case is not so frequent, but is possible by idioms or collocations as exemplified in the following sample.",
        "5 This ranking was developed for evaluation in spoken language translation.",
        "For more details, see (Sumita et al., 1999).",
        "The replaceability between “kata” and “seki” does not hold for these two similar sentences.",
        "To avoid this problem, a feedback mechanism of erroneous translations built into the system is one possible solution.",
        "• Noise in data",
        "The proposed approach accepts the translation example blindly.",
        "If the translation is wrong or inappropriate, the output is directly made defective.",
        "The next two translations show contextual inappropriateness.",
        "The source parts of the two examples are exactly the same, but the target part of the first example is neutral and that of the second example is specific, i.e., valid only in a special situation.",
        "Preventing this requires cleaning the example database, preferably by machine, or collecting sufficiently large-scale data to suppress the influence of noisy examples.",
        "1. hai/ari/masu = Yes, we do.",
        "[yes/exist/POLITE] 2. hai/ari/masu = Yes, we have a shuttle bus.",
        "[yes/exist/POLITE]"
      ]
    },
    {
      "heading": "4 Discussion",
      "text": [
        "Here, we explain the implications of the experimental results and discuss the future extension."
      ]
    },
    {
      "heading": "4.1 Limitations",
      "text": [
        "Our proposal has the limitations listed below, but we would like to note that we have obtained high coverage and accuracy for the phrasebook task.",
        "• Database limitation: If a nearest neighbor within the threshold does not exist in the example database, we cannot perform translation.",
        "One positive note is that we were able to build the necessary example database for the phrasebook task, which is not a toy.",
        "• Context limitation: We cannot translate context-dependent words, because contexts are often hard to embed in an example database.",
        "For example, Japanese ‘konnichiwa’ corresponds to ‘Good morning’ or ‘Good afternoon’ in English depending on the time of utterance.",
        "It is in general difficult to embed such kinds of situational information into the example database.",
        "• Implementation limitation: We have no method",
        "for dividing an input into chunks (such as clauses) at present, so long sentences cannot be dealt with.",
        "In addition, no investigation has been made on robustness with respect to recognition errors yet.",
        "However, DP-matching is expected to be effective."
      ]
    },
    {
      "heading": "4.2 Generality vs. Quality",
      "text": [
        "There is no commercial system that can translate phrasebook sentences at this level of accuracy.",
        "Figure 3 shows a comparison of our proposal and a commercial machine translation system that accepts travel conversations.",
        "Table 4 shows sample translations by the above two systems.",
        "The upper translation was produced by our proposed system and the lower translation was produced by the commercial system.",
        "The reason behind the performance difference for this task is that the commercial one was built as a general-purpose system and phrasebook sentences are not easy to translate into high-quality results by using such a general-purpose architecture.",
        "However, we must admit that general-purpose architectures are effective and we do not mean to",
        "criticize them by using this comparison.",
        "It is reasonable to suggest that general-purpose architectures are not the most suitable option for achieving high-quality translations in restricted domains."
      ]
    },
    {
      "heading": "4.3 Development Cost and Its Reduction in the Future",
      "text": [
        "We do not need grammars and transfer rules but we do need a bilingual corpus and lexical resources.",
        "The adaptability of our approach to multilingual translation is promising.",
        "Because we have already succeeded in J-to-E, one of the most difficult translation pairs, we have little concern about other pairs.",
        "If we can create an n lingual corpus, we can make n(n-1) MT systems.",
        "To enable such a dream within a shorter timeframe, we have to reduce the necessary resources such as bilingual dictionaries and thesauri by automating the construction of lexical knowledge.",
        "We are aiming at such additional cost reduction.",
        "We also want to eliminate restrictions, e.g., sentence-aligned and morphologically tagged example database.",
        "By doing so, the applicability of our approach can be increased.",
        "This is another important challenge.",
        "A further challenging goal is to establish technology enabling the use of a small-scale corpus."
      ]
    },
    {
      "heading": "4.4 Related Research",
      "text": [
        "Here, we would like to compare our proposal and related research in four points: level of knowledge, application of dynamic programming, the use of thesauri, and the task."
      ]
    },
    {
      "heading": "Knowledge of EBMT",
      "text": [
        "Many EBMT studies (Sato and Nagao, 1990; Sato, 1991; Furuse et al., 1994; Sadler, 1989) assume the existence of a bank of aligned bilingual trees or a set of translation patterns.",
        "However, building such knowledge is done by humans and is very expensive.",
        "Methods for automating knowledge building are still being developed.",
        "In contrast, our proposal does not rely on such a high-level analysis of the corpus and requires only word-level knowledge, i.e., morphological tags and dictionaries."
      ]
    },
    {
      "heading": "Dynamic programming",
      "text": [
        "Dynamic programming has been used within the EBMT paradigm (1) for technical term translation (Sato, 1993), and (2) for translation support (Cranias et al., 1994).",
        "Sato translates technical terms, which are usually compound nouns, while we translate sentences.",
        "He uses a corpus in which translation units of a pair of technical terms are aligned, while we do not require the alignment of translation units.",
        "He defines the matching score and we define the distance between word sequences, which are different.",
        "However, both are computed by a standard dynamic programming technique.",
        "Based on surface structures and content words, Cranias defined a similarity score between texts and introduced the idea of clustering the translation memory to speed up the retrieval of similar translation examples.",
        "The score is again computed by a standard dynamic programming technique, but Cranias provides not a translation but only a retrieval."
      ]
    },
    {
      "heading": "Thesaurus",
      "text": [
        "Brown (2000) uses equivalence classes to successfully improve the coverage of EBMT.",
        "He proposed a method of automatically generating equivalence classes using clustering techniques, while we use hand-coded thesauri (in the experiment).",
        "Such automation is very attractive, and the author is planning to follow in Brown’s line, in spite of a fear that low frequent words will not be dealt with effectively by clustering techniques.",
        "Brown uses a hard condition, i.e., whether a word is included in an equivalence class or not, while we provide the relative distance between two words.",
        "It is unknown which method is better for EBMT.",
        "We do not plan on sticking with the current implementation using hand-coded thesauri, as we realize that further research on these open problems is indispensable."
      ]
    },
    {
      "heading": "Phrasebook task",
      "text": [
        "The phrasebook task was first advocated for the task of speech translation by (Stentiford and Steer, 1987).",
        "They pointed out that when communicating within a limited domain such as international telephone communications, it is nearly possible to specify all of the required message concepts.",
        "They used a keyword-based approach to access concepts to overcome speech recognition errors.",
        "On the other hand, we use DP-matching techniques for this end.",
        "The scalability of the keyword-based approach has raised questions because enlarging a corpus directly increases the chances of conflict in identifying the concepts to be conveyed."
      ]
    },
    {
      "heading": "5 Concluding Remarks",
      "text": [
        "We proposed a new approach using DP-matching for retrieving examples within EBMT and demonstrated its coverage and accuracy through a computational experiment for a restricted domain, i.e., a phrasebook task for foreign tourists.",
        "There is much room for our translation method to improve: (1) decomposing input sentences will improve the coverage, and (2) indexing or clustering the example database will drastically improve the efficiency of the current naïve implementation."
      ]
    },
    {
      "heading": "Acknowledgement",
      "text": [
        "First, the author thanks anonymous reviewers for their useful comments.",
        "The author’s heartfelt thanks go to Kadokawa-Shoten for providing the Ruigo-Shin-Jiten.",
        "Thanks also go to Dr. Seiichi",
        "YAMAMOTO, President and Mr. Satoshi SHIRAI, Department Head, for providing the author with the chance to pursue this research."
      ]
    }
  ]
}
