{
  "info": {
    "authors": [
      "Laurence Danlos",
      "Bertrand Gaiffe",
      "Laurent Roussarie"
    ],
    "book": "Workshop on Natural Language Generation EWNLG",
    "id": "acl-W01-0803",
    "title": "Document Structuring a La SDRT",
    "url": "https://aclweb.org/anthology/W01-0803",
    "year": 2001
  },
  "references": [
    "acl-W00-1403",
    "acl-W00-1426"
  ],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper, the issue of document structuring is addressed.",
        "To achieve this task, we advocate that Segmented Discourse Representation Theory (SDRT) is a most expressive discourse framework.",
        "Then we sketch a discourse planning mechanism which aims at producing as many paraphrastic document structures as possible from a set of factual data encoded into a logical form."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Using the terms of (Reiter and Dale, 2000), we consider that the Document Planner architecture is pipelined: first the content determination task does its work, and then the document structuring task takes the result and build a document plan.",
        "Following the work of (Roussarie, 2000), we adopt SDRT (Asher, 1993; Asher and Lascarides, 1998), which was designed first for text understanding, for the document structuring task1.",
        "The input to the document structuring component is a set of factual data encoded into a logical form, as in (1).",
        "This level of representation is supposed to be language independent, although we use English-like predicates for the sake of simplification.",
        "(1)",
        "includes a conceptual (language independent) relation, i.e. cause, between the events and .",
        "A document plan is a SDRS.",
        "Our goal is to produce a wide range of paraphrases from the same factual data.",
        "For example, from the logical form in (1), we want to produce at least all the texts in (2).",
        "These texts have different communicative structures and so correspond to different communicative goals.",
        "However, these issues will not be addressed here.",
        "(2) a. Fred left.",
        "Therefore, Mary burst into a fit of tears.",
        "b. Mary burst into a fit of tears because Fred left.",
        "c. Fred left.",
        "His leaving brought Mary into a fit of tears.",
        "d. Mary burst into a fit of tears.",
        "This is due to Fred’s leaving.",
        "To produce paraphrases, we start by producing several document plans (i.e. SDRSs) from the same factual data.",
        "The SDRS underlying (2a) is in (3a) in which the discourse relation Result between and expresses the predicate cause .",
        "The SDRS underlying (2b) is similar to (3a) except that Explanation is involved instead of Result .",
        "The SDRS underlying (2c) is in (3b).",
        "It includes the discourse relation Commentary2 defined in (Asher, 1993).",
        "To ensure the cohesion of texts, we add the following constraint to his definition: Commentary requires that one element in is coreferent with one element in , as it is the case in (3b) with .",
        "In (3b), the causal relation has been reified as the discourse referent f (see section 5).",
        "This discourse referent is ex2 The discourse relation in (2c) is not Result since the second sentence denotes both the cause and the effect.",
        "When provided as input to a “tactical component” (microplanner and surface realizer), a given SDRS leads to zero, one or several texts.",
        "It leads to nothing when there is a lexical (or syntactic) gap in the target language.",
        "For example, if there is no verbal predicate semantically equivalent to be due to in the target language, the SDRS underlying (2d) leads to nothing.",
        "Similarly, if a SDRS includes a discourse relation which cannot be realized in the target language (e.g. volitional-Result proposed in (Mann and Thompson, 1987) cannot be linguistically realized in French (Danlos, 2001)), it leads to nothing4.",
        "A given SDRS leads to several texts when there are several lexi-calizations for at least one predicate.",
        "Thanks to the use of SDRT, we are able to give a formal background to the following assump",
        "tions generally used in bottom-up document-structuring approaches: “The content determination mechanism has produced a set of messages which are required to be included in the final document plan” (Reiter and Dale, 2000, p. 114).",
        "In formal terms, it translates as follows: a SDRS built from a logical form LF is such that the logical form derived from is logically equivalent to LF.",
        "For example, the logical forms derived from the SDRSs in (3a) and (3b) are equivalent to that in (1) modulo axioms which will be presented in section 4.",
        "“The NLG system has a means of determining what discourse relation (if any) can be used to link two particular messages or component document plans” (Reiter and Dale, 2000, p. 114).",
        "Our formal approach is based on reversing the SDRT conditions to establish discourse relations.",
        "As an illustration, in SDRT for text understanding, there is the Axiom in (4) for Narration.",
        "This axiom states that if Narration holds between two SDRSs and , then the main event (me) of happens before the main event of .",
        "For text generation, this axiom is reversed in the rule in (5) which is domain and language independent.",
        "(5) is taken from (Roussarie, 2000, p. 154).",
        "(5) If and are DRS the main eventuali",
        "ties of which are not states, and if the main event of occurs before the main event of , then Narration is a valid relation, where and respectively label and .",
        "This paper is organized as follows.",
        "Section 2 gives a crash course in SDRT.",
        "Section 3 compares our approach to document structuring to those based on RST.",
        "Section 4 explains the axioms needed to lay down the logical equivalence of SDRSs such that (3a) and (3b).",
        "Section 5 explains the process for building SDRSs.",
        "Section 6 sketches how to generate a text from a SDRS.",
        "Section 7 illustrates the document structuring strategy on examples.",
        "meaning of the discourse in a truth-conditional semantics fashion.",
        "For instance, the DRS representing the sentence (7a) is given in (7b).",
        "SDRT (Segmented Discourse Representation Theory) was introduced in (Asher, 1993) as an extension of DRT (Discourse Representation Theory, (Kamp and Reyle, 1993)) in order to account for specific properties of discourse structure.",
        "The original motivation for developing SDRT can be found in Asher’s study of the reference to abstract objects in discourse.",
        "Asher argues that a sound discourse theory has to cope with some anaphora whose antecedents turn out to be text segments larger than a clause or a sentence.",
        "Moreover, it is necessary to reveal a hierarchical discourse structure which makes appear the sites available for anaphora–antecedent binding.",
        "Consider the example in (6) taken from (Asher, 1993, p. 318):",
        "The pronoun this (6.5) can only refer to the whole trip or (possibly) to the last mentioned event (TDRS launch).",
        "Consequently, the structure of (6) must be such that : i) there exists a constituent which semantically encompasses the whole story (6.1–4), and ii) neither (6.2) nor (6.3) correspond to available constituents for the anaphora resolution when computing the attachment of (6.5) in the context.",
        "Avaibility (or openness) of constituents is a formal property that can be accounted for by the use of discourse relations."
      ]
    },
    {
      "heading": "2.2 DRSs as formal discourse units",
      "text": [
        "SDRT can be viewed as a super-layer on DRT whose expressiveness is enhanced by the use of discourse relations.",
        "Thus the DRT structures (Discourse Representation Structures or DRS) are handled as basic discourse units in SDRT.",
        "Formally, a DRS is a couple of sets U,Con .",
        "U (the universe) is the set of discourse referents.",
        "Con is a set of conditions which describe the",
        "Note that in addition to individual referents ( ), U includes event referents ( ).",
        "DRT adopts a Davidsonian approach (Davidson, 1967): it considers that events have to be denoted by singular terms in the logical form of sentences.",
        "In the semantic model, events are handled as world immanent entities, and event referents ( ) can occur in argumental slots of certain predicates (like f-cause in (3b)).",
        "The statement – leave is a predicative notational variant and stands for “ is a leaving of ”.",
        "DRSs do not correspond to linguistic categories but are formal units: from the SDRT point of view, one should see them as (intensional) meaning structures.",
        "This is why some discourse abstract objects (such as facts, situations, propositions...) can be referred to by discourse referents (we will say that they are reified) and semantically characterized by (sub-)DRS.",
        "(8) is an example of a fact reading, where is the characterization predicate (Asher, 1993, p. 145).",
        "(8) a.",
        "The fact that Fred left abruptly upset Mary.",
        "b. f"
      ]
    },
    {
      "heading": "Fred 2.3 Discourse Relations and SDRSs",
      "text": [
        "A SDRS is a couple of sets U,Con .",
        "U is a set of labels of DRS or SDRS which may be viewed as “speech act discourse referents” (Asher and Lascarides, 1998).",
        "Con is a set of conditions on labels of the form: , where is a label from U and is a (S)DRS (labelling);",
        "The set of SDRT relations includes Narration (for temporal sequence), Background (for temporal overlap), Elaboration (for whole-part or topic-development), Explanation and Result (for causation), Commentary (for gloss).",
        "According to (Asher, 1993, p. 319), (9) sketches the SDR-theoretic analysis of (6) where each stands for the DRS representing the content of the th sentence in (6).",
        "SDRSs are built by means of non monotonic rules that encodes discourse properties and world knowledge.",
        "For instance, one rule states that if a discourse constituent may be connected to a discourse constituent in the context, then normally the relation Narration holds.",
        "Another rule states that if may be connected to and if the main event of , i.e. me , is known as a cause of me , then normally the relation Explanation holds."
      ]
    },
    {
      "heading": "3 Comparison with RST",
      "text": [
        "As nearly everybody in the NLG community uses RST (Rhetorical Structure Theory, (Mann and Thompson, 1987)) as a discourse framework, it is generally considered that the task of document structuring is to produce a tree in the RST style.",
        "Since RST is a descriptive theory without any formal background, there exists a wide range of interpretations and several notions of Rhetorical Structure.",
        "For some authors, e.g. (Marcu et al., 2000), the Rhetorical Structure is very surfacic: it is an ordered tree isomorphic to the linearized structure of the text and a rhetorical relation can be viewed as a nickname for a small set of cue phrases.",
        "For other authors, the rhetorical structure is more abstract: it aims at representing meaning.",
        "For example, in (RAGS Project, 1999; Bouayad-Agha et al., 2000), the Rhetorical Structure is an unordered tree in which terminal nodes represent elementary propositions, while non terminal nodes represent rhetorical relations which are abstract relations such as cause.",
        "This rhetorical representation is mapped into a Document Representation which is an ordered tree reflecting the surfacic structure of the text.",
        "Our approach is closer to the RAGS’one if we consider our logical form as equivalent to their Rhetorical Structures.",
        "However, we differ basically on the following point: their Rhetorical Structure is a tree, while our logical form, when graphically represented, is a (connex) graph and not a tree.",
        "Let us justify our position by considering the discourses in (10).",
        "(10) a. Fred run the vacuum cleaner while Sue was sleeping in order to bother her .",
        "b. Fred run the vacuum cleaner while Sue was sleeping in order to please her .",
        "They can be given various meanings, however we focus on the following: for (10a), running the vacuum cleaner is supposed to be noisy and Fred attempts to bother Sue by making something noisy exactly when she is sleeping, for (1 0b), running the vacuum cleaner is supposed to be an awful chore and Fred attempts to please Sue by relieving her of a chore.",
        "It just happens that he run the vacuum cleaner while she was sleeping.",
        "In RST, both (10a) and (10b) are given the tree representation in (11), in which CIRC abbreviates",
        "The semantic interpretation of a rhetorical tree is given by the “nuclearity principle” (Marcu, 1996): whenever two large spans are connected through a rhetorical relation, that rhetorical relation holds also between the most important parts of the constituent spans.",
        "In (11), the nuclearity principle amounts to saying that there is only",
        "one interpretation, namely that in which the nucleus argument of PURPOSE is , which is the nucleus argument of CIRCUMSTANCE.",
        "This is the right interpretation for (10b).",
        "However, (11) cannot represent the meaning of (10a) for which the first (nucleus) argument of PURPOSE is the subtree rooted at CIRCUMSTANCE.",
        "In conclusion, a RST tree structure is too poor: it cannot account for the expressiveness of texts.",
        "This can be accounted for by the use of representations which correspond graphically to (connex) graphs.",
        "The graphical representations of (10a) and (10b) and their equivalent in pseudo logical forms are respectively shown in (12a) and (12b)5.",
        "(12a) is a tree in which the first argument of PURPOSE is , the sub-tree rooted at CIRCUMSTANCE.",
        "It is the interpretation of the RST tree in (11) without the nuclearity principle.",
        "(12b) is a graph in which is part of two relations6.",
        "This graph corresponds to the interpretation of the RST tree in (11) given by the nuclearity principle.",
        "This principle makes that is part of both the relation PURPOSE with and the relation CIRCUMSTANCE with its satellite .",
        "The SDRSs underlying (10a) and (10b) are shown respectively in (13a) and (13b) (the notation stands for the DRS representing and so on).",
        "Here we replace CIRCUMSTANCE by the SDRT relation Background for temporal overlap7.",
        "5 The arguments of a binary semantic predicate are noted as 1 and 2 after the fashion of MTT (Meaning to Text Theory, (Mel’ˇcuk, 1988)) and not as Nucleus and Satellite in the RST tradition.",
        "In (13a), the first argument of Purpose is which groups and which are linked through Background.",
        "In (13b), is part of two discourse relations.",
        "The graphical representations of (13a) and (13b) (in which R is represented as a tree rooted at R) have the same topology as (12a) and (12b) respectively.",
        "In summary, in document structuring approaches based on RST, a rhetorical structure is always a tree, whenever understood as abstract representation or a more surfacic one.",
        "This cannot be maintained.",
        "First, if the rhetorical structure is an abstract conceptual representation closed to a logical form, its graphical representation is a connex graph (and not always a tree).",
        "Second, if the rhetorical structure is a discourse representation, as it is the case for SDRS, its graphical representation is also a connex graph.",
        "This criticism is not the only one against RST.",
        "This discourse framework has already been criticized in the generation community (de Smedt et al., 1996).",
        "So we advocate the use of SDRT.",
        "This theory presents the following advantages : it is a formalized theory which benefits of all the progress in formal semantics most often realized in the understanding perspective around DRT or SDRT.",
        "adopting SDRT for text generation by “reversing” the rules (see (4) reversed in (5)) allows us to have reversible systems: the same linguistic data can be used for both text understanding and generation.",
        "as it will be shown in section 5, the document structuring component à la SDRT gives hint on referring expressions: it indicates when a pan the Background-related constituents.",
        "See (Asher and Lascarides, 1998) for details.",
        "discourse referent should be expressed as an anaphoric NP.",
        "a SDRS (i.e. a document plan) can be given to existing microplanners and surface realizers with perhaps some modifications (see section 6).",
        "For example, a SDRS can be given as input to G-TAG (Danlos, 2000) implemented in CLEF (Meunier and Reyes, 1999) provided small fits are realized.",
        "In conclusion, we think that SDRT is a better discourse framework than RST (for both text generation and understanding)."
      ]
    },
    {
      "heading": "4 Equivalence between logical forms",
      "text": [
        "Recall that we want to compute both the SDRS in (3a) with Result and the SDRS in (3b) with Commentary from the logical form in (1).",
        "Let us show that the logical forms derived from these SDRSs are equivalent.",
        "In SDRT, there is an axiom for Result from which one can entail the rule in (14), which is similar to the axiom in (4) for Narration.",
        "Therefore, the logical form derived from (3a) is (1) repeated in (15) without the temporal information.",
        "The discourse relation Commentary per se does not add information.",
        "Therefore, the logical form derived from (3b) is (16).",
        "(16) f –leave –fit-of-tears f–cause Fred Mary The difference between (15) and (16) consists in considering the causal relation between the two events either as only a predicate or as a variable plus a predicate.",
        "However, the axioms in (17a) and (17b) can be laid down.",
        "With these axioms, (15) and (16) are equivalent since they are both equivalent to (18), in which the causal relation gets represented twice.",
        "In other words, we have the following logical entailments: (15), (17a) (18), and (16), (17b) (18).",
        "Let us underline that the content determination task may arbitrarily result in (15), (16) or even (18).",
        "Therefore, the document structuring task has to produce SDRS such as (3a) and (3b) from one of these logical forms.",
        "There is a an important difference between SDRSs and logical forms.",
        "SDRSs represent discourses and their variables are discourse referents.",
        "Logical forms represent meanings and their variables are pure logical variables.",
        "To compute a SDRS from a logical form, one has to decide which variables from the logical form become discourse referents, as explained in the next section."
      ]
    },
    {
      "heading": "5 Building SDRSs",
      "text": []
    },
    {
      "heading": "5.1 Basic principles",
      "text": [
        "To get a recursive process, first, we translate the logical form into a DRS8.",
        "In case of a purely existential formula such as those we have been dealing with so far, this just amounts to putting all the variables into the universe of the DRS and split the formula into elementary conjoined conditions9.",
        "The document structuring task amounts then in building a SDRS from a DRS.",
        "The simplest way to do that is simply to transform: into More complex structures are obtained by splitting the DRS into sub-DRSs as illustrated below.",
        "condition means that the discourse relation to be established between and must have condition among its consequences: no other element is in charge of expressing condition .",
        "In SDRT for text understanding, the conditions are not ordered.",
        "However, in text generation, a document plan indicates the order of its components.",
        "As a consequence, when a document plan is a SDRS, its components (labelled ) have to be ordered.",
        "In the pseudo SDRS above, it is supposed that precedes which precedes .",
        "Let us examine the principles governing the splitting of the conditions and the universes.",
        "For the splitting of the conditions, the whole content of the factual database has to be verbalized.",
        "Therefore all the conditions in the DRS have to be expressed in the SDRS.",
        "Two cases appear: either a condition in the DRS appears as a condition in one of the sub-DRS; that is the case for in the DRS labelled ; or it is expressed through a discourse relation; that is the case for .",
        "One of the criteria for choosing an appropriate discourse relation is that its consequences have to contain the condition involved.",
        "For example, the condition cause can be expressed through Result when and label the sub-DRSs that contain the descriptions of and respectively.",
        "Let us now look on how to determine the universes of the sub-DRSs, i.e. the discourse referents.",
        "First, there are technical constraints, namely: the arguments of any condition in a sub-DRS must appear in the universe of this DRS; the universes of all the sub-DRSs have to be disjoint.",
        "This constraint is the counterpart of the following constraint in understanding: “partial DRSs introduce new discourse referents” (Asher, 1993, p. 71).",
        "These two constraints are not independent.",
        "Assuming that the first constraint is respected, the second one can be respected with the following mechanism: if a variable already appears in a preceding sub-DRS labelled , then a brand new variable is created in the universe of the current sub-DRS labelled and the condition is added into the conditions of .",
        "The discourse referent will be generated as an anaphora if is available to (see section 2.1), otherwise it will be generated as a definite or demonstrative NP.",
        "Secondly, as mentioned in section 4, it has to be decided which variables become discourse referents.",
        "When we have for instance f f – cause , we can decide to apply axiom (17b), and then remove the variable f and every condition having f as an argument (in particular the condition f – cause ).",
        "In order for such an operation to be valid, we have to ensure that no information is lost.",
        "In practice, this supposes that no other condition than f – cause has f as an argument.",
        "We call this operation de-reification.",
        "Conversely from such a formula as cause , we can apply axiom (17a), and then remove the condition cause .",
        "We call this operation reification.",
        "Contrarily to de-reification, no information can be lost.",
        "These two operation are a mix between something which is pure logic (that adds information) and a discourse operation that deals with discourse referents.",
        "As our objective is to build as much dicourse plans as possible, reification and de-reification are systematically performed whenever possible.",
        "The process is recursive: once all this is done (splitting the conditions, universes determination (including reification and de-reification) and choice of discourse relations), the process can apply recursively on each of the embedded DRSs (this is the reason why the logical form is first translated into a DRS)."
      ]
    },
    {
      "heading": "5.2 Algorithm",
      "text": [
        "A naive solution to implement these principles will be first described.",
        "Next some refinements will be proposed.",
        "The naive solution amounts to considering all the possible splittings of the set of conditions.",
        "If there are conditions, the number of sub-SDRSs ranks from to .",
        "In the hypothesis of a splitting into sub-SDRSs, each condition may be put in any of the sub-SDRSs or in any of the sets of conditions to be expressed by a discourse relation10.",
        "Next the universes of the sub-SDRSs are built according to the principles described above.",
        "This leads to availability constraints (e.g. is available to ) to be checked later on.",
        "In the next step, the possible discourse relations are computed according to their consequences.",
        "At this step, a lot of hypotheses are ruled out.",
        "For example, any hypothesis assuming that a condition such as – leave is to be expressed through a discourse relation will be ruled out.",
        "Finally, the availability constraints have to be checked using the same rules as in understanding.",
        "With this naive solution, a lot of document plans will be rejected by the linguistic component.",
        "As an illustration, each sub-SDRS has to be verbalized as a clause (see section 6).",
        "Therefore, any sub-SDRS that does not include an eventuality or a fact will be rejected by the linguistic component.",
        "This naive solution is theoretically valid, however it is not usable in practice.",
        "A lot of possible failures can be foreseen.",
        "For example, the conditions that can be expressed through a discourse relation, e.g. cause , should be considered first.",
        "If it is decided that such a condition is indeed expressed by a discourse relation, e.g.",
        "Result , then the sub-SDRSs and are created with the conditions concerning and respectively.",
        "To sum up, the process of splitting the conditions should not be blind.",
        "The content of the conditions has to be taken into account in order to guide the splitting and avoid thereby failures that can be foreseen.",
        "However, the details of this optimization will not be presented here.",
        "10 In SDRT, any element in the universe of a SDRS must be linked to another element.",
        "Therefore, a SDRS with sub-SDRSs must include (at least) discourse relations."
      ]
    },
    {
      "heading": "6 Generating a text from a SDRS",
      "text": [
        "A SDRS, i.e. a document plan, is given to a micro-planner and surface realizer which computes one or several texts.",
        "It is the topic of another paper to explain in detail this process.",
        "Here we will only give the basic principles which guide the choices to be made in the tactical component.",
        "The process to generate a text from a SDRS U,Con is basically recursive: an element in U has to be generated as a clause if labels a DRS and recursively as a text (possibly a complex sentence) if labels a SDRS.",
        "a condition R in Con has to be generated as a text “ ” or as a complex sentence “ ”, where generates ,, and is a cue phrase lexicaliz-ing R ( may be empty).",
        "a condition in Con where is a DRS U,Con has to generated as a clause according to the following constraints: – in analysis, a discourse referent is the trace of either a determiner or an inflexion mark.",
        "Therefore, in generation, a discourse referent has to be generated as an NP or a tensed verb (noted V).",
        "Such an information is noted as e.g. :NP/V; – the conditions guide the lexical choices.",
        "The conditions Fred correspond to proper names which is noted as :PN[Fred].",
        "The equality conditions between discourse referents (e.g. ) give rise to (pronominal or nominal) anaphora which is noted as :ANA[ ].",
        "The other conditions are associated to lexical predicates.",
        "With these constraints, an element which is reified, e.g. f – cause , gives rise to an NP or a verb (a cause of, provoke) and an element which is not reified, e.g. cause gives rise to a modifier on or with and generated either as verbs or NPs.",
        "This process results in a list such as:",
        "Such a list guides the lexical choices and syntactic realization performed by the micro-planner."
      ]
    },
    {
      "heading": "7 Illustration on examples",
      "text": [
        "Let us show how to compute the SDRSs in (3a) and (3b) from the logical form in (1).",
        "First, this formula is translated in the DRS in (19), in which the conditions are numbered for the sake of convenience.",
        "From (19), one possibility is to express cond through Result in which and label the sub-DRSs grouping the conditions on and respectively.",
        "Therefore, has to group cond and cond .",
        "As cond introduces the variable , cond➧has to figure also in 11.",
        "The universe of the DRS labelled by is .",
        "Similarly for , its universe is , its conditions are cond✟, cond➭and cond .",
        "All the conditions of (19) are therefore expressed in (3a) which is a well-formed document plan.",
        "Following the rules sketched in section 6, (3a) will be generated in (2a) by the linguistic component, if Result is lex-icalized as the cue phrase therefore which links two sentences.",
        "From (19), another possibility is to split all the conditions into two sub-DRSs: the first one labelled grouping the conditions on (as in the previous possibility), the second one labelled grouping all the other conditions.",
        "cond in has as argument.",
        "This variable already appears in .Therefore a brand new variable is created in the universe of and the condition 11 This is an optimization: if cond were not included in , the surface realizer would fail on and the hypothesis would be ruled out.",
        "is added in .",
        "As all the conditions are split into the sub-DRSs, and have to be linked with a discourse relation which adds no information (i.e. which has no consequence).",
        "Commentary is such a discourse relation, and it is valid here since its constraint (one element in has to be coreferent with one element in , see section 1) is respected with the coreference relation .",
        "At this step, the SDRS in (20) has been built.",
        "From (20), one possibility is to transmit this SDRS as it is to the tactical component.",
        "If Commentary is lexicalized as an empty cue phrase linking two sentences, (20) will be generated in (21) where cause , which is not reified, is expressed through the modifier because of.",
        "(20) (21) Fred left.",
        "Mary burst into a fit of tears because of that.",
        "In text understanding, (21) is likely to be analyzed with the discourse relation Narration , which has for consequence .",
        "This condition is compatible with those in since cause with implies .",
        "So, there is no conflict between the understanding and the generation of (21).",
        "From (20), another possibility is to reify cause in .",
        "The SDRS in (20) becomes that in (3b).",
        "If f–cause is lexicalized as bring in to (a colloquial variant of cause when the second argument is a fit of tears), (2c) will be generated."
      ]
    },
    {
      "heading": "8 Conclusion",
      "text": [
        "We have dealt with the document structuring task, considering that it should be able to produce several outputs so that it can cope, among other things, with real lexical gaps in the target language (and also actual gaps in a realistic surface",
        "realizer).",
        "We therefore aim at producing as much document plans as possible.",
        "We suppose that the content determination component provides a logical form encoding the factual data to be linguistically verbalized.",
        "Axioms may apply on this logical form which enable reifications and de-reifications.",
        "As a consequence, some predicates may be realized either as a verb, an NP or a modifier.",
        "The document structuring component is based on SDRT, a formalized discourse framework which can account for the expressiveness of texts, contrarily to RST.",
        "A document plan is a SDRS.",
        "This level of representation is likely to be language and domain independent and can be provided to existing surface realizers.",
        "Building SDRSs from a logical form is a recursive process for which a basic strategy has been presented and exemplified.",
        "No implementation has been realized yet, however we foresee to do it and to interface it with the tactical component CLEF (Meunier and Reyes, 1999)."
      ]
    }
  ]
}
