{
  "info": {
    "authors": [
      "Daisuke Kawahara",
      "Sadao Kurohashi"
    ],
    "book": "Human Language Technology Conference",
    "id": "acl-H01-1043",
    "title": "Japanese Case Frame Construction by Coupling the Verb and Its Closest Case Component",
    "url": "https://aclweb.org/anthology/H01-1043",
    "year": 2001
  },
  "references": [
    "acl-A97-1052",
    "acl-J94-4001",
    "acl-P93-1032",
    "acl-W97-0123"
  ],
  "sections": [
    {
      "heading": "ABSTRACT",
      "text": [
        "This paper describes a method to construct a case frame dictionary automatically from a raw corpus.",
        "The main problem is how to handle the diversity of verb usages.",
        "We collect predicate-argument examples, which are distinguished by the verb and its closest case component in order to deal with verb usages, from parsed results of a corpus.",
        "Since these couples multiply to millions of combinations, it is difficult to make a wide-coverage case frame dictionary from a small corpus like an analyzed corpus.",
        "We, however, use a raw corpus, so that this problem can be addressed.",
        "Furthermore, we cluster and merge predicate-argument examples which does not have different usages but belong to different case frames because of different closest case components.",
        "We also report on an experimental result of case structure analysis using the constructed case frame dictionary."
      ]
    },
    {
      "heading": "1. INTRODUCTION",
      "text": [
        "Syntactic analysis or parsing has been a main objective in Natural Language Processing.",
        "In case of Japanese, however, syntactic analysis cannot clarify relations between words in sentences because of several troublesome characteristics of Japanese such as scrambling, omission of case components, and disappearance of case markers.",
        "Therefore, in Japanese sentence analysis, case structure analysis is an important issue, and a case frame dictionary is necessary for the analysis.",
        "Some research institutes have constructed Japanese case frame dictionaries manually [2, 3].",
        "However, it is quite expensive, or almost impossible to construct a wide-coverage case frame dictionary by hand.",
        "Others have tried to construct a case frame dictionary automatically from analyzed corpora.",
        "However, existing syntactically analyzed corpora are too small to learn a dictionary, since case frame information consists of relations between nouns and verbs, which multiplies to millions of combinations.",
        "Based on such a consideration, we took the unsupervised learning strategy to Japanese case frame construction' .",
        "To construct a case frame dictionary from a raw corpus, we parse a raw corpus first, but parse errors are problematic in this case.",
        "However, if we use only reliable modifier-head relations to construct a case frame dictionary, this problem can be addressed.",
        "Verb sense ambiguity is rather problematic.",
        "Since verbs can have different cases and case components depending on their meanings, verbs which have different meanings should have different case frames.",
        "To deal with this problem, we collect predicate-argument examples, which are distinguished by the verb and its closest case component, and cluster them.",
        "That is, examples are not distinguished by verbs such as naru make, become and tsumu load, accumulate, but by couples such as tomodachi ni naru make a friend, byouki ni naru become sick,nimotsu wo tsumu load baggage, and keiken wo tsumu accumulate experience.",
        "Since these couples multiply to millions of combinations, it is difficult to make a wide-coverage case frame dictionary from a small corpus like an analyzed corpus.",
        "We, however, use a raw corpus, so that this problem can be addressed.",
        "The clustering process is to merge examples which does not have different usages but belong to different case frames because of different closest case components."
      ]
    },
    {
      "heading": "2. VARIOUS METHODS FOR CASE FRAME CONSTRUCTION",
      "text": [
        "We employ the following procedure of case frame construction from raw corpus (Figure 1):",
        "supply, and keiken experience are case examples, and {nimotsu baggage, busshi supply} (of wo case marker in the first example case frame of tsumu load, accumulate) is a case example group.",
        "A case component therefore consists of a case example and a case marker (CM).",
        "Let us now discuss several methods of case frame construction as shown in Figure 1.",
        "First, examples (I of Figure 1) can be used individually, but this method cannot solve the sparse data problem.",
        "For example,",
        "(1) kuruma ni nimotsu wotsumu car dat-CM baggage acc-CM load (load baggage onto the car) (2) truck nibusshi wotsumu truck dat-CM supply acc-CM load (load supply onto the truck) even if these two examples occur in a corpus, it cannot be judged whether the expression kuruma ni busshi wo tsumu (load supply onto the car) is allowed or not.",
        "Secondly, examples can be decomposed into binomial relations (II of Figure 1).",
        "These co-occurrences are utilized by statistical parsers, and can address the sparse data problem.",
        "In this case, however, verb sense ambiguity becomes a serious problem.",
        "For example, (3) kuruma ni nimotsu wotsumu car dat-CM baggage acc-CM load (load baggage onto the car) (4) keiken wotsumu",
        "experience acc-CM accumulate (accumulate experience) from these two examples, three co-occurrences (kuruma ni tsumu, nimotsu wo tsumu, and keiken wo tsumu) are extracted.",
        "They, however, allow the incorrect expression kuruma ni keiken wo tsumu (load experience onto the car, accumulate experience onto the car).",
        "Thirdly, examples can be simply merged into one frame (III of Figure 1).",
        "However, information quantity of this is equivalent to that of the co-occurrences (II of Figure 1), so verb sense ambiguity becomes a problem as well.",
        "We distinguish examples by the verb and its closest case component.",
        "Our method can address the two problems above: verb sense ambiguity and sparse data.",
        "On the other hand, semantic markers can be used as case components instead of case examples.",
        "These we call semantic case frames (IV of Figure 1).",
        "Constructing semantic case frames by hand leads to the problem mentioned in Section 1.",
        "Utsuro et al.",
        "constructed semantic case frames from a corpus [8].",
        "There are three main differences to our approach: they use an annotated corpus, depend deeply on a thesaurus, and did not resolve verb sense ambiguity."
      ]
    },
    {
      "heading": "3. COLLECTING EXAMPLES",
      "text": [
        "This section explains how to collect examples shown in Figure 1.",
        "In order to improve the quality of collected examples, reliable modifier-head relations are extracted from the parsed corpus."
      ]
    },
    {
      "heading": "3.1 Conditions of case components",
      "text": [
        "When examples are collected, case markers, case examples, and case components must satisfy the following conditions.",
        "Conditions of case markers Case components which have the following case markers (CMs) are collected: ga (nominative), wo (accusative), ni (dative), to (with, that), de (optional), kara (from), yori (from), he (to), and made (to).",
        "We also handle compound case markers such as ni-tsuite in terms of, wo-megutte concerning, and others.",
        "In addition to these cases, we introduce time case marker.",
        "Case components which belong to the class <time>(see below) and contain a ni, kara, or made CM are merged into time CM.",
        "This is because it is important whether a verb deeply relates to time or not, but not to distinguish between surface CMs.",
        "Generalization of case examples Case examples which have definite meanings are generalized.",
        "We introduce the following three classes, and use these classes instead of words as case examples.",
        "<time> nouns which mean time e.g. asa morning, haru spring, rainen next year case examples which contain a unit of time e.g. 1999nen year, 12gatsu month, 9ji oclock words which are followed by the suffix mae before, tyu during, or go after and do not have the semantic marker <place> on the thesaurus e.g. kaku mae before write, kaigi go after the meeting <quantity> numerals e.g. ichi one, ni two, juu ten numerals followed by a numeral classifier2 such as tsu, ko, and nin.",
        "They are expressed with pairs of the class <quantity> and a numeral classifier: <quantity>tsu, <quantity>ko, and <quantity>nin.",
        "e.g. 1tsu ^ <quantity>tsu 2ko ^ <quantity>ko <clause> quotations ( to that ) and expressions which function as quotations ( koto wo that ).",
        "e.g. kaku to that write, kaita koto wo that wrote Exclusion of ambiguous case components We do not use the following case components: Since case components which contain topic markers (TMs) and clausal modifiers do not have surface case markers, we do not use them.",
        "For example, sono giinwa wo teian-shita.",
        "the assemblyman TM acc-CM proposed wa is a topic marker and giin wa assemblyman TM depends on teian-shita proposed, but there is no case marker for giin assemblyman in relation to teianshita proposed.",
        "wo teian-shiteiru giin ga acc-CM proposingassemblyman wo teian-shiteiru is a clausal modifier and teianshiteiru proposing depends on giin assemblyman, but there is no case marker for giin assemblyman in relation to teian-shiteiru proposing.",
        "Case components which contain a ni or de case marker are sometimes used adverbially.",
        "Since they have the optional relation to their verbs, we do not use them.",
        "e.g. tame ni because of, mujouken ni unconditionally, ue de in addition to",
        "(On 30th the prime minister gave awards to those two people.)",
        "from this sentence, the following example is acquired."
      ]
    },
    {
      "heading": "3.2 Conditions of verbs",
      "text": [
        "We collect examples not only for verbs, but also for adjectives and noun+copulas3.",
        "However, when a verb is followed by a causative auxiliary or a passive auxiliary, we do not collect examples, since the case pattern is changed."
      ]
    },
    {
      "heading": "3.3 Extraction of reliable examples",
      "text": [
        "When examples are extracted from automatically parsed results, the problem is that the parsed results inevitably contain errors.",
        "Then, to decrease influences of such errors, we discard modifier-head relations whose parse accuracies are low and use only reliable relations.",
        "KNP employs the following heuristic rules to determine a head of a modifier: HR1 KNP narrows the scope of a head by finding a clear boundary of clauses in a sentence.",
        "When there is only one candidate verb in the scope, KNP determines this verb as the head of the modifier.",
        "HR2 Among the candidate verbs, verbs which rarely take case components are excluded.",
        "HR3 KNP determines the head according to the preference: a modifier which is not followed by a comma depends on the nearest candidate, and a modifier with a comma depends on the second nearest candidate.",
        "Our approach trusts HR1 but not HR2 and HR3.",
        "That is, modifier-head relations which are decided in HR1 (there is only one candidate of the head in the scope) are extracted as examples, but relations which HR2 and HR3 are applied to are not extracted.",
        "The following examples illustrate the application of these rules.",
        "(5) kare wa kai-taihon wo he TM want to buy book acc-CM takusan mitsuketa node, a lotfoundbecause Tokyo he okutta.",
        "Tokyo to sent (Because he found a lot of books which he wants to buy, he sent them to Tokyo.)",
        "In this example, an example which can be extracted without ambiguity is Tokyo he okutta sent ^ to Tokyo at the end of the sentence.",
        "In addition, since node because is analyzed as a clear boundary of clauses, the head candidate of hon wo book acc-CM is only mitsuketa find, and this is also extracted.",
        "Verbs excluded from head candidates by HR2 possibly become heads, so we do not use the examples which HR2 is applied to.",
        "For example, when there is a strong verb right 3 In this paper, we use verb instead of verb/adjective or noun+copula for simplicity.",
        "after an adjective, this adjective tends not to be a head of a case component, so it is excluded from head candidates.",
        "(6) Hi no mawari gahayaku fire of spread nom-CM rapidly sukuidase-nakatta.",
        "could not save (The fire spread rapidly, so ^1 could not save ^2.)",
        "In this example, the correct head of mawari ga spread is hayaku rapidly.",
        "However, since hayaku rapidly is excluded from the head candidates, the head of mawari ga spread is analyzed incorrectly.",
        "We show an example of the process HR3: (7) kare gashitsumon ni he nom-CM question acc-CM sentou wokitte kotaeta.",
        "leadacc-CM take answered (He took the lead to answer the question.)",
        "In this example, head candidates of shitsumon ni question acc-CM are kitte take and kotaeta answered.",
        "According to the preference modify the nearer head, KNP incorrectly decides the head is kitte take.",
        "Like this example, when there are many head candidates, the decided head is not reliable, so we do not use examples in this case.",
        "We extracted reliable examples from Kyoto University Corpus[6], that is a syntactically analyzed corpus, and evaluated the accuracy of them.",
        "The accuracy of all the case examples which have the target cases was 90.9%, and the accuracy of the reliable examples was 97.2%.",
        "Accordingly, this process is very effective."
      ]
    },
    {
      "heading": "4. CONSTRUCTION OF EXAMPLE CASE FRAMES",
      "text": [
        "As shown in Section 2, when examples whose verbs have different meanings are merged, a case frame which allows an incorrect expression is created.",
        "So, for verbs with different meanings, different case frames should be acquired.",
        "In most cases, an important case component which decides the sense of a verb is the closest one to the verb, that is, the verb sense ambiguity can be resolved by coupling the verb and its closest case component.",
        "Accordingly, we distinguish examples by the verb and its closest case component.",
        "We call the case marker of the closest case component closest case marker.",
        "The number of example patterns which one verb has is equal to that of the closest case components.",
        "That is, example patterns which have almost the same meaning are individually handled as follows:"
      ]
    },
    {
      "heading": "4.1 Similarity between example patterns",
      "text": [
        "The clustering of example patterns is performed by using the similarity between example patterns.",
        "This similarity is based on the similarities between case examples and the ratio of common cases.",
        "Figure 2 shows an example of calculating the similarity between example patterns.",
        "First, the similarity between two examples e1, e2 is calculated using the NTT thesaurus as follows:",
        "where x, y are semantic markers, and s1, s2 are sets of semantic markers of e1, e2 respectively4.",
        "lx, lr are the depths of x, y in the thesaurus, and the depth of their lowest (most specific) common node is L. If x and y are in the same node of the thesaurus, the similarity is 1.0, the maximum score based on this criterion.",
        "Next, the similarity between the two case example groups E1, E2 is the normalized sum of the similarities of case examples as follows:",
        "where Ie1I , Ie2I represent the frequencies of e1, e2 respectively.",
        "The ratio of common cases of example patterns F1, F2 is",
        "calculated as follows: the cases of example pattern F2 are c21, c22, , c2m, and the common cases of F1 and F2 is cc1, cc2, , ccn.",
        "E1.., is the case example group of cci in F1.",
        "E2..,, E1.1,, and E2.2, are defined in the same way.",
        "The square root in this equation decreases influences of the frequencies.",
        "The similarity between F1 and F2 is the product of the ratio of common cases and the similarities between case example groups of common cases of F1 and F2 as follows:",
        "where wi is the weight of the similarities between case example groups."
      ]
    },
    {
      "heading": "4.2 Selection of semantic markers of example patterns",
      "text": [
        "The similarities between example patterns are deeply influenced by semantic markers of the closest case components.",
        "So, when the closest case components have semantic ambiguities, a problem arises.",
        "For example, when clustering example patterns of awaseru join, adjust, the pair of example patterns (te hand, kao, face)5 is created with the common semantic marker <part of an animal>, and (te method, syouten focus) is created with the common semantic marker <logic, meaning>.",
        "From these two pairs, the pair (te hand, kao face, syouten focus) is created, though <part of an animal> is not similar to <logic, meaning> at all.",
        "To address this problem, we select one semantic marker of the closest case component of each example pattern in order of the similarity between example patterns as follows:",
        "1.",
        "In order of the similarity of a pair, (p, q), of two example patterns, we select semantic markers of the closest case components, nz,, n9 of p, q.",
        "The selected semantic markers sz,, s9 maximize the similarity between nz, and n9.",
        "2.",
        "The similarities of example patterns related to p, q are recalculated.",
        "3.",
        "These two processes are iterated while there are pairs of two example patterns, of which the similarity is higher than a threshold."
      ]
    },
    {
      "heading": "4.3 Clustering procedure",
      "text": [
        "The following is the clustering procedure:",
        "where the cases of example pattern F1 are c11, c12, ,c1l,",
        "2.",
        "Clustering of example patterns which have the same closest CM (a) Similarities between pairs of two example patterns which have the same closest CM are calculated, and semantic markers of closest case components are selected.",
        "These two processes are iterated as mentioned in 4.2.",
        "(b) Each example pattern pair whose similarity is higher than some threshold is merged.",
        "3.",
        "Clustering of all the example patterns",
        "The example patterns which are output by 2 are clustered.",
        "In this phase, it is not considered whether the closest CMs are the same or not.",
        "The following example patterns have almost the same meaning, but they are not merged by 2 because of the different closest CM.",
        "This clustering can merge these example patterns."
      ]
    },
    {
      "heading": "5. SELECTION OF OBLIGATORY CASE MARKERS",
      "text": [
        "If a CM whose frequency is lower than other CMs, it might be collected because of parsing errors, or has little relation to its verb.",
        "So, we set the threshold for the CM frequency as 2^m f , where m f means the frequency of the most found CM.",
        "If the frequency of a CM is less than the threshold, it is discarded.",
        "For example, suppose the most frequent CM for a verb is wo, 100 times, and the frequency of ni CM for the verb is 16, ni CM is discarded (since it is less than the threshold, 20).",
        "However, since we can say that all the verbs have ga (nominative) CMs, ga CMs are not discarded.",
        "Furthermore, if an example case frame do not have a ga CM, we supplement its ga case with semantic marker <person>."
      ]
    },
    {
      "heading": "6. CONSTRUCTED CASE FRAME DICTIONARY",
      "text": [
        "We applied the above procedure to Mainichi Newspaper Corpus (9 years, 4,600,000 sentences).",
        "We set the threshold of the clustering 0.80.",
        "The criterion for setting this threshold is that case frames which have different case patterns or different meanings should not be merged into one case frame.",
        "Table1 shows examples of constructed example case frames.",
        "From the corpus, example case frames of 71,000 verbs are constructed; the average number of example case frames of a verb is 1.9; the average number of case slots of a verb is 1.7; the average number of example nouns in a case slot is 4.3.",
        "The clustering led a decrease in the number of example case frames of 47%.",
        "destock, land, dollar, ticket shop, station, yen kau2ga wo*treatment, welfare, postcard anger, disgust, antipathy",
        "(These industries have the characteristic of strong political voice.)",
        "Analysis errors are mainly caused by two phenomena.",
        "The first is clausal modifiers which have no case relation to the modifees such as wo mitomeru houshin policy of consenting (t above).",
        "The Second is verbs which take two ga nominative case markers (one is wa superficially) such as gyokai wa toiu tokutyo ga aru industries have the characteristic of (t above).",
        "Handling these phenomena is an area of future work."
      ]
    },
    {
      "heading": "8. CONCLUSION",
      "text": [
        "We proposed an unsupervised method to construct a case frame dictionary by coupling the verb and its closest case component.",
        "We obtained a large case frame dictionary, which consists of 71,000 verbs.",
        "Using this dictionary, we can detect ambiguous case components accurately.",
        "We plan to exploit this dictionary in anaphora resolution in the future."
      ]
    },
    {
      "heading": "9. ACKNOWLEDGMENTS",
      "text": [
        "The research described in this paper was supported in part by JSPS-RFTF96P00502 (The Japan Society for the Promotion of Science, Research for the Future Program)."
      ]
    },
    {
      "heading": "10. REFERENCES",
      "text": []
    }
  ]
}
