{
  "info": {
    "authors": [
      "Klaus Ries",
      "Alex Waibel"
    ],
    "book": "Human Language Technology Conference",
    "id": "acl-H01-1001",
    "title": "Activity Detection for Information Access to Oral Communication",
    "url": "https://aclweb.org/anthology/H01-1001",
    "year": 2001
  },
  "references": [
    "acl-H94-1049",
    "acl-J00-3003",
    "acl-J97-1002",
    "acl-P97-1005"
  ],
  "sections": [
    {
      "text": [
        "Activity detection for information access to oral communication Klaus Ries and Alex Waibel*"
      ]
    },
    {
      "heading": "ABSTRACT",
      "text": [
        "Oral communication is ubiquitous and carries important information yet it is also time consuming to document.",
        "Given the development of storage media and networks one could just record and store a conversation for documentation.",
        "The question is, however, how an interesting information piece would be found in a large database.",
        "Traditional information retrieval techniques use a histogram of keywords as the document representation but oral communication may offer additional indices such as the time and place of the rejoinder and the attendance.",
        "An alternative index could be the activity such as discussing, planning, informing, story-telling, etc.",
        "This paper addresses the problem of the automatic detection of those activities in meeting situation and everyday rejoinders.",
        "Several extensions of this basic idea are being discussed and/or evaluated: Similar to activities one can define subsets of larger database and detect those automatically which is shown on a large database of TV shows.",
        "Emotions and other indices such as the dominance distribution of speakers might be available on the surface and could be used directly.",
        "Despite the small size of the databases used some results about the effectiveness of these indices can be obtained."
      ]
    },
    {
      "heading": "Keywords",
      "text": [
        "activity, dialogue processing, oral communication, speech, information access *We would like to thank our lab, especially Klaus Zechner, Alon Lavie and Lori Levin for their discussions and support.",
        "We would also like to thank our sponsors at DARPA.",
        "Any opinions, findings and conclusions expressed in this material are those of the authors and may not reflect the views of DARPA, or any other party."
      ]
    },
    {
      "heading": "1. INTRODUCTION",
      "text": [
        "Information access to oral communication is becoming an interesting research area since recording, storing and transmitting large amounts of audio (and video) data is feasible today.",
        "While written information is often available electronically (especially since it is typically entered on computers) oral communication is usually only documented by constructing a new document in written form such as a transcript (court proceedings) or minutes (meetings).",
        "Oral communications are therefore a large untapped resource, especially if no corresponding written documents are available and the cost of documentation using traditional techniques is considered high: Tutorial introductions by a senior staff member might be worthwhile to attend by many newcomers, office meetings may contain informations relevant for others and should be reproducable, informal and formal group meetings may be interesting but not fully documented.",
        "In essence the written form is already a reinterpretation of the original rejoinder.",
        "Such a reinterpretation are used to extract and condense information add or delete information change the meaning cite the rejoinder relate rejoinders to each other Reinterpretation is a time consuming, expensive and optional step and written documentation is combining reinterpretation and documentation step in one 1.",
        "If however reinterpretation is not necessary or unwanted a system which is producing audiovisual records is superior.",
        "If reinterpretation is wanted or needed a system using audiovisual records may be used to improve the reinterpretation by adding all audiovisual data and the option to go back to the unaltered original.",
        "Whether reinterpretation is done or not it is crucial to be able to navigate effectively within an audiovisual document and to find a specific document.",
        "While keywords are commonly used in information access to written information the use of other indices such as style is still uncommon (but see Kessler et al.",
        "(1997); van Bretan et al.",
        "(1998)).",
        "Oral communication is richer than written communication since it is an interactive real time accomplishment between participants, may involve speech gestures such as the display of emotion and is situated in space and time.",
        "Bahktin (1986) characterizes a conversation by topic, situation and style.",
        "Information access to oral communication can therefore make use of indices that pertain to the oral nature of the discourse (Fig.",
        "2).",
        "Indices other than topic (represented by keywords) increase in importance since browsing audio documents is cumbersome which makes the common interactive retrieval strategy query, browse, reformulate less effective.",
        "Finally the topic may not be known at all or may not be that relevant for the query formulation, for example if one just wants to be reminded what was being discussed last time a person was met.",
        "Activities are suggested as an alternative index and are a description of the type of interaction.",
        "It is common to use action-verbs such as story-telling, discussing, planning, informing, etc.",
        "to describe activities 2.",
        "Items similar to activities have been shown to be directly retrievable from autobiographic memory (Herrmann, 1993) and are therefore indices that are available to participants of the conversation.",
        "Other indices may be very effective but not available: The frequency of the word I in the conversation, the histogram of word lengths or the histogram of pitch per participant.",
        "In Fig. 1 the information access hierarchy is being introduced which allows to understand the problem of information access to oral communication at different levels.",
        "In Ries (1999) we have shown that the detection of general di2 The definition of activities such as planning may vary vastly across general dialogue genres, for example compare a military combat situation with a mother child interaction.",
        "However it is often possible to develop activities and dialogue typologies for a specific dialogue genre.",
        "The related problem of general typologies of dialogues is still far from being settled and action-verbs are just one potential categorization (Fritz and Hundschnur, 1994)."
      ]
    },
    {
      "heading": "2. ACTIVITY DETECTION",
      "text": [
        "We are interested in the detection of activities that are described by action verbs and have annotated those in two databases: meetings have been collected at Interactive Systems Labs at CMU (Waibel et al., 1998) and a subset of 8 meetings has been annotated.",
        "Most of the meetings are by the data annotation group itself and are fairly informal in style.",
        "The participants are often well acquainted and meet each other a lot besides their meetings.",
        "Santa Barbara (SBC) is a corpus released by the LDC and 7 out of 12 rejoinders have been annotated.",
        "The annotator has been instructed to segment the rejoinders into units that are coherent with respect to their topic",
        "the error function.",
        "The network connects the input directly to the output units.",
        "Hidden units have not been used since they did not yield improvements on this task.",
        "The network was trained using RPROP with momentum (Riedmiller and Braun, 1993) and corresponds to an exponential model (Nigam et al., 1999).",
        "The momentum term can be interpreted as a Gaussian prior with zero mean on the network weights.",
        "It is the same architecture that we used previously (Ries et al., 2000) for the detection of activities on CallHome Spanish.",
        "Although some feature sets could be trained using the iterative scaling algorithm if no hidden units are being used the training times werent high enough to justify the use of the less flexible iterative scaling algorithm.",
        "The features used for classification are words the 50 most frequent words / part of speech pairs are used directly, all other pairs are replaced by their part of speech 4. stylistic features adapted from Biber (1988) and contain mostly syntactic constructions and some word classes.",
        "Wordnet a total of 40 verb and noun classes (so called lexicographers classes (Fellbaum, 1998)) are defined and a word is replaced by the most frequent class over all possible meanings of the word.",
        "dialogue acts such as statements, questions, backchannels, ... are detected using a language model based detector trained on Switchboard similar to Stolcke et al.",
        "(2000) 5",
        "dominance is described as the distribution of the speaker dominance in a conversation.",
        "The distribution is represented as a histogram and speaker dominance is measured as the average dominance of the dialogue acts (Linell et al., 1988) of each speaker.",
        "The dialogue acts are detected and the dominance is a numeric value assigned for each dialogue act type.",
        "Dialogue act types that restrict the options of the conversation partners have high dominance (questions), dialogue acts that signal understanding (backchannels) carry low dominance.",
        "First author The activities used for classification are those of the semi-naive coder.",
        "The first author column describes the accuracy of the first author with respect to the naive coder.",
        "The detection of interactive activities works fairly well using the dominance feature on SBC which is also natural since the relative dominance of speakers should describe what kind of interaction is exhibited.",
        "The dialogue act distribution on the other hand works fairly well on the more homogeneous meeting database were there is a better chance to see generalizations from more specific dialogue based information.",
        "Overall the combination of more than one feature is really important since word level, Wordnet and stylistic information, while sometimes successful, seem to be able to improve the result while they dont provide good features by themselves.",
        "The meeting data is also more difficult which might be due to its informal style."
      ]
    },
    {
      "heading": "3. INFORMATION ACCESS ASSESSMENT",
      "text": [
        "Assuming a probabilistic information retrieval model a query r in our example an activity predicts a document d with the probability q(dIr) = q(*Jd)q(d) .",
        "Let p(d, r) q(*) be the real probability mass distribution of these quantities.",
        "The probability mass function q(rId) is estimated on a separate training set by a neural network based classifier 6.",
        "The quantity we are interested in is the reduction in expected coding length of the document using the neural network based detector 7:",
        "Another option is to assume that the labels of one coder are part of D. If the query by the other coder is R we are interested in the reduction of the document entropy given the query.",
        "If we furthermore assume that H(RID) = H(RIR') where R' is the activity label embedded in D: H(D) H(DIR) = H(R) H(RID) = MI(R, R') Tab.",
        "2 shows that the labels of the semi-naive coder and the first author only inform each other by 0.25 0.65 bits.",
        "However, since all constraints are important to apply, it might be important to include manual annotations to be matched by a query or in a graphical presentation of the output results.",
        "Another interesting question to consider is whether the activity is correlated with the rejoinder or not.",
        "This question is important since a correlation of the activity with the rejoinder would mean that the indexing performance of activities needs to be compared to other indices that apply to rejoinders such as attendance, time and place (for results on the correlation with rejoinders see Waibel et al.",
        "(2001)).",
        "The correlation can be measured using the mutual information between the activity and the meeting identity.",
        "The mutual information is moderate for SBC (Pz~ 0.67 bit) and much lower for the meetings (Pz~ 0.20 bit).",
        "This also corresponds to our intuition since some of the rejoinders in SBC belong to very distinct dialogue genre while the meeting database is homogeneous.",
        "The conclusion is that activities are useful for navigation in a rejoinder if the database is homogeneous and they might be useful for finding conversations in a more heterogeneous database."
      ]
    },
    {
      "heading": "4. DETECTION OF SUB-DATABASES",
      "text": [
        "We set up an environment for TV shows that records the subtitles with timestamps continuously from one TV channel and the channel was switched every other day.",
        "At the same time the TV program was downloaded from http: //tv.yahoo.com/ to obtain programming information including the genre of the show.",
        "Yahoo assigns primary and secondary show types and unless the combination of primary/secondary show-type is frequent enough the primary showtype is used (Tab.",
        "4).",
        "The TV show database has the advantage that we were able to collect a large and varied database with little effort.",
        "The same classifier as in Sec. 2 has been used however dialogue acts have not been detected since the data contains a lot of noise, is not necessarily conversational and speaker identities cant be determined easily.",
        "Detection results for TV shows can be seen in Tab.",
        "5.",
        "It may be noted that adding a lot of keywords does improve the detection result but not so much the entropy.",
        "It may therefore be assume that there is a limited dependence between topic and genre which isnt really a surprise since there are many shows with weekly sequels and there may be some true repeats."
      ]
    },
    {
      "heading": "6. CONCLUSION AND FUTURE WORK",
      "text": [
        "It has been shown that activities can be detected and that they may be efficient indices for access to oral communication.",
        "Overall it is easy to make high level distinctions with automated methods while fine-grained distinctions are even hard to make for humans on the other hand automatic methods are still able to model some aspect of it (Fig.",
        "3).",
        "To obtain an reduction in entropy a relatively large database such as CallHome Spanish is required (120 dialogues).",
        "Alternatives to activities might be emotional and dominance distributions that are easier to detect and that may be natural to understand for users.",
        "If activities are only used for local navigation support within a rejoinder one could also visualize by displaying the dialogue act patterns for each channel on a time line.",
        "The author has also observed that topic clusters and activities are largely independent in the meeting domain resulting in orthogonal indices.",
        "Since activities have intuitions for naive users and they may be remembered it can be assumed that users would be able to make use of these constraints.",
        "Ongoing work includes the use of speaker activity for dialogue segmentation and further assessment of features for information access.",
        "Overall the methods presented here and the ongoing work are improving the ability to index oral communication.",
        "It should be noted that some of the techniques presented lend themselves to implementations that dont require (full) speech recognition: Speaker identification and dialogue act identification may be done without an LVCSR system which would allow to lower the computational requirements as well as to a more robust system."
      ]
    },
    {
      "heading": "5. EMOTION AND DOMINANCE",
      "text": [
        "Emotions are displayed in a variety of gestures, some of which are oral and may be detected via automated methods from the audio channel (Polzin, 1999).",
        "Using only verbal information the emotions happy, excited and neutral can be detected on the meeting database with 88.1% accuracy while always picking neutral yields 83.6%.",
        "This result can be improved to 88.6% by adding pitch and power information.",
        "While these experiments were conducted at the utterance level emotions can be extended to topical segments.",
        "For that purpose the emotions of the individual utterances are entered in a histogram over the segment and the vectors are clustered automatically.",
        "The resulting clusters roughly correspond to a neutral, a little happy and somewhat excited segment.",
        "Using the classifier for emotions on the word level the segment can be classified automatically into categories with a 83.3% accuracy while the baseline is 68.9%.",
        "The entropy reduction by automatically detected emotional activities is ^ 0.3bit a.",
        "A similar attempt can be made for dominance (Linell et al., 1988) distributions: Dominance is easy to understand for the user of an information access system and it can be determined automatically with high accuracy."
      ]
    }
  ]
}
