{
  "info": {
    "authors": [
      "Jin-Seok Lee",
      "Byeongchang Kim",
      "Gary Geunbae Lee"
    ],
    "book": "SIGDAT Conference on Empirical Methods in Natural Language Processing",
    "id": "acl-W01-0517",
    "title": "Automatic Corpus-Based Tone Prediction Using K-ToBI Representation",
    "url": "https://aclweb.org/anthology/W01-0517",
    "year": 2001
  },
  "references": [],
  "sections": [
    {
      "heading": "Abstract",
      "text": [
        "In this paper, we present a prosody generation architecture based on K-ToBI (Korean Tone and Break Index) representation.",
        "ToBI is a multi-tier representation system based on linguistic knowledge to transcribe events in an utterance.",
        "The TTS system which adopts ToBI as an intermediate representation is known to exhibit higher flexibility, modularity and domain/task portability compared with the direct prosody generation TTS systems.",
        "However, the cost of corpus preparation is very expensive for practical-level performance because the ToBI labeled corpus has been manually constructed by many prosody experts and normally requires large amount of data for statistical prosody modeling.",
        "Contrary to previous ToBI-based systems, this paper proposes a new method which transcribes the K-ToBI labels completely automatically in Korean speech.",
        "We developed automatic corpus-based K-TOBI labeling tools and prediction methods based on several lexico-syntactic linguistic features for decision-tree induction.",
        "We demonstrated the performance of FO generation from automatically predicted K-ToBI labels, and confirmed that the performance is reasonably comparable with state-of-the-art direct prosody generation methods and previous TOBI-based methods."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "For the past few years, a great deal of interests have arisen in high quality text-to-speech (TTS) systems (van Santen et al., 1997).",
        "One of the essential problems in developing high quality TTS",
        "systems is to generate prosody from texts.",
        "The prosody in the TTS system increases intelligibility and naturalness of synthesized speech.",
        "In general, prosody refers to certain properties of the speech signal, such as audible changes in pitch, loudness and syllable length.",
        "Its physical features are related to prosodic phrasing, fundamental frequency, segmental duration and energy of synthesized speech.",
        "In TTS systems especially, prosodic phrasing and fundamental frequency contour generation are the most important tasks to produce natural speech.",
        "In order to produce high quality speech, several methods have been devised so far.",
        "We can classify fundamental frequency (FO) contour generation according to level of representation in prosodic phenomena; that is, acoustic level, perceptual level and linguistic level (Du-toit, 1997).",
        "This paper is related to a model using linguistic knowledge.",
        "Specifically, we deal with prosodic phrasing and FO contour generation among several prosodic features using K-ToBI labeling system.",
        "K-ToBI (Beckman and",
        "sign goals: 1) The changes of intonation in Korean language are very weak, so the K-ToBI labeling system must be simpler than the other language ToBI systems.",
        "2)K-ToBI, as an intermediate representation, normally increases system-level modularity, flexibility and domain/task portability, but should be implemented with no performance degradation.",
        "3) Labeling ToBI on speech corpus is normally very laborious and time-consuming .",
        "However, large portion of Korean speech is mainly monotonous in intonation.",
        "Therefore, we can",
        "obtained RMSE (Root Mean Squared Error) of 34.8Hz and 0.62 correlation coefficient when compared with originals on the test data, which is a significant improvement compared to previous rule-driven methods.",
        "They applied the same technique to J-ToBI (Japanese ToBI) and obtained RMSE of 20.9Hz and 0.70 correlation coefficient (Black and Hunt, 1996).",
        "However, these methods require massive amounts of manually constructed ToBI labeled corpus.",
        "In this paper we propose an automatic K-ToBI tone label prediction method without using manually constructed ToBI corpus while achieving same level of performance.",
        "(Ross, 1995) proposed a model that predicts the ToBI label and fundamental frequency using CART-based probability tree with Markov sequence assumption.",
        "The method predicted ToBI labels including accent location, symbolic tones and relative prominence level from a text tagged with part-of-speech (POS) labels and marked for the prosodic constituent structure, and showed an accuracy of prediction about 80% at the pitch accent type and about 67% at the boundary tone type.",
        "For fundamental frequency and energy generation, they obtained RMSE of 34.74% and 3.48% respectively.",
        "The merit of this approach was that the parameters can be automatically estimated from labeled speech, but the system only predicted the abstract prosodic label instead of the original ToBI label.",
        "Furthermore, because the training data was so small, the results could not be extended to general cases.",
        "We will predict tone labels using not only linguistic knowledge but also pitch values extracted from large amount of speech and transcription files.",
        "(Lee et al., 1998) proposed a method of K-ToBI labeling from POS tagged texts and generated an fundamental frequency contour from the K-ToBI-labeled corpus using the method similar to (Black and Hunt, 1996).",
        "They showed accuracy of 77.2% for IP boundary and 72% for AP boundary prediction, and obtained RMSE of 23.5Hz and 0.55 correlation coefficient for fundamental frequency contour generation.",
        "(Lee, 2000) proposed a tree-based prosody modeling by appling bootstrap aggregating and born again tree techniques proposed in the statistics community to predict the prosodic components more accurately.",
        "He applied not only morphological knowledge but also syntax-based features to predict K-ToBI tone label and generating fundamental frequency contour.",
        "The performance was RMSE of 35.65Hz and 0.729 correlation coefficient.",
        "However all the previous approaches still suffer from data sparseness problem due to manual labeling of prosody data.",
        "We try to avoid such problem by using a more general and simplified method of prosodic phrasing and fundamental frequency generation using a large sized, but automatically K-ToBI-labeled corpus."
      ]
    },
    {
      "heading": "3 Tone Label Prediction using K-ToBI",
      "text": []
    },
    {
      "heading": "3.1 Automatic K-ToBI tone labeling",
      "text": [
        "Because K-ToBI tone implies a variety of linguistic knowledge and changes in intonation, such as the fundamental frequency contour, it is an important part of TTS systems.",
        "However, constructing the K-ToBI labeled corpora is very difficult and time consuming because they are usually constructed by some experts who have phonological knowledge by referring to pitch contours while hearing a speech corpus.",
        "In addition, such manually constructed corpora can lack consistency due to the differences between annotators.",
        "However, predicting K-ToBI tone labels using a statistical method inevitably requires a large corpus.",
        "Alternatively, in this section, we propose an automatic method of building and refining large corpus for K-ToBI labeling.",
        "Figure 2 shows the whole flow of our automatic K-ToBI tone labeling process.",
        "First, we extract pitches from a speech data and align the speech with its phone scripts that have been manually corrected.",
        "Second, we align the phone scripts with the extracted pitches.",
        "Third, the phone sequence that has been aligned with the pitches is segmented into phrases by comparing with the phrase indices.",
        "Using the above sequences, we can obtain a corpus that was aligned with time and segmented into prosodic phrases.",
        "Finally, we calculate the max, min and average values of pitch sequences in each prosodic phrase, which would become criteria that assign the `L' tone or the `H' tone.",
        "Since humans have a limited perception of changes in intonation, when we specify ToBI symbols into syllable or IP boundary, ambiguous regions naturally occur.",
        "We specify the",
        "prosody are assigned to each syllable.",
        "Therefore, we predict the K-ToBI tone label as `H' tone or `L' tone per syllable.",
        "We obtained 265,726 items of L tone and 121,322 items of `H' tone automatically from the K-ToBI tone labeled corpus.",
        "We also used the same tree-based method as IP tone prediction, but features for the decision-tree are newly designed for best AP label prediction as follows:",
        "• NucleusPOS, CodaPOS: the POS of the nucleus and coda respectively.",
        "Usually, the",
        "POS of onset is the same as that of the nucleus in Korean.",
        "Therefore, only two POS's are used.",
        "The intonation of syllable is presumed to be related to the POS of the syllable.",
        "• SylType: the configuration type of each syllable.",
        "• LocinPhr: location of the current syllable in a prosodic phrase.",
        "Usually, changes in the `H' or `L' tone are more active at the second syllable in the prosodic phrase.",
        "We assigned `First', `Second' and `Others' to this feature.",
        "• LengthPhr: the length of the current prosodic phrase.",
        "The short prosodic phrase tends to be pronounced with `H' tone.",
        "• SylPhrb, SylPhre: the distance from the current syllable to the beginning or from the end of current prosodic phrase.",
        "If some absolute patterns exist in a prosodic phrase, these features have some influence on the decision of tones.",
        "• RatioSylPhrb: the ratio of SylPhrb over the length of the current phrase.",
        "This feature is useful for the decision of tones, if there is a regular pattern in a prosodic phrase."
      ]
    },
    {
      "heading": "3.4 Fundamental frequency contour",
      "text": [
        "generation In most synthesizers, the task of generating a prosodic tone using ToBI label system consists of two sub-tasks: the prediction of intonation labels (AP tone and IP boundary tone in ToBI) from input text (previously described), and the generation of a fundamental frequency contour from those labels and other information.",
        "We used popular linear regression method to generate fundamental frequency from K-ToBI labels (Black and Hunt, 1996).",
        "This method does not require any other rules for label types, and is general enough for many other languages.",
        "Our prediction formula is as follows: target = wi fi + w 2 f 2 + • • • + wn fn + I where f2 are the features that contribute to the fundamental frequency, and we can decide the weight wl – wn and I through simple linear regression.",
        "We applied the above formula to every syllable and obtained a target value of the fundamental frequency.",
        "We prepared pitch values extracted from a speech file, divided them into five sections, and predicted the fundamental frequency at every point.",
        "The following features overlap somewhat with features we developed for boundary and non-boundary tone prediction, except some more features that, we anticipate, would generate pitches.",
        "• SylStr: onset, nucleus, coda of pronunciation form at current syllable.",
        "• LocinPhr: the location of the current syllable in the prosodic phrase.",
        "• Phrbndry: the type of boundary tone at the preceding phrase.",
        "The pitch of the current syllable is affected by the preceding phrase boundary tone type.",
        "• Toneseq: three preceding tones, one current tone, and three following tones.",
        "If some patterns of intonation of the prosodic phrase exist, these features are useful.",
        "• LengthPhr: the length of current prosodic phrase.",
        "• SylPhrb, SylPhre: the distance from the current syllable to the beginning or to the end of current prosodic phrases.",
        "• RatioSylPhrb: the ratio of SylPhrb over the length of the current phrase."
      ]
    },
    {
      "heading": "4 Experimental Results",
      "text": []
    },
    {
      "heading": "4.1 Corpus analysis",
      "text": [
        "The experiments are performed on a Korean news story database, called MBCNEWSDB, of spoken Korean directly recorded from broadcast",
        "dictable from the surface patterns, and consists of a rising contour `LHa' and ending IP tone `T%'.",
        "The phonetic tone tier represents a surface tonal pattern and is principally assigned with an `L' or `H' tone for each syllable.",
        "Therefore, this result shows prediction of surface tonal pattern in the phonetic tone tier.",
        "Through this experiment, we obtained total 70% of accuracy.",
        "In the tree, the first node makes a decision if the ratio of the distance from beginning of the current prosodic phrase to the current syllable over the length of the current prosodic phrase (`RatioSylPhrb' feature) is larger than 0.2."
      ]
    },
    {
      "heading": "4.3 Fundamental frequency generation",
      "text": [
        "We predicted five pitch values for each syllable and generate fundamental frequency with interpolated methods based on the predicted values.",
        "We detected pitch values per 16ms from speech with SFS tool (Huckvale, 1996).",
        "For training and test, we extracted a feature set from an automatically created file that is aligned with pitch sequences and phone sequences.",
        "Further, we eliminate items with `0' for pitch value as a noise for the constructing model.",
        "As described before, we used ten category and four real value features to construct a linear regression model.",
        "Since we extracted five pitches from each syllable, we construct a linear regression model for each pitch, and obtained a total of five models.",
        "Since the predicted response is a vector, we compute the RMSE and correlation coefficients for each element of the vectors and averaged them.",
        "Table 6 shows the result of our generation model with ToBI and its comparision with direct generation without ToBI representation.",
        "The table shows that ToBI-based generation is surely competitive to the direct generation.",
        "The result suggests that we can overcome the performance deficiency caused by ToBI with automatically labeled large corpus for training especially for light tonal change languages, such as Korean.",
        "To compare with previous ToBI-based results, we used a relative measure called `Relative-MSE (mean squared error)', dividing the previous RMSE by the standard deviation of corpus.",
        "This relative measure can overcome the differences between the features of the corpus used in the model.",
        "According to the table, (Black and Hunt, 1996)'s original results of 34.8Hz RMSE using linear regression model is worse than our 22.2 Hz of RMSE results.",
        "According to the new measure, (Ross and Os-tendorf, 1999) obtained an RMSE of 34.74Hz, with the standard deviation of corpus of 42.8Hz, which gives 0.66 Relative-MSE similar to ours.",
        "But their corpus was as short as 48 minutes compared with our 1100 minutes.",
        "For the Korean language, (Lee, 2000) obtained an RMSE of 35.65Hz and the deviation of the corpus is 50.74Hz.",
        "He obtained 0.49 Relative-MSE, which was better than our 0.66.",
        "However, he used a small manually transcribed K-ToBI corpus compared with our large automatically labeled corpus."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "This paper presents a prosody generation method based on the K-ToBI system for Korean.",
        "Our main contributions include adopting",
        "tion.",
        "As a result, the architecture of the TTS system can have more flexibility and portability by using the ToBI system, and the TTS system can also be modularized.",
        "Another contribution involves the automatic ToBI tone labeling techniques used to construct a large size consistent training and test corpora.",
        "Therefore, we solved the problem that a ToBI-labeled corpus must be manually constructed.",
        "As shown in our results, the performance of prosody generation using the K-ToBI system is competitive to those without the ToBI system, and also competitive to the previous state-of-the-art prosody generation researches.",
        "In the future, we have to automatically construct dialog style ToBI labeled corpus to verify our prediction model more thoroughly since current MBCNEWSDB has biased tone labels because it is a reading corpus for broadcast news scripts.",
        "A new algorithm from machine learning community especially to handle skewed and biased training data will also be greatly helpful to enhance the prediciton accuracy."
      ]
    }
  ]
}
