{
  "info": {
    "authors": [
      "Brian Roark",
      "Richard Sproat"
    ],
    "book": "ACL",
    "id": "acl-P14-2060",
    "title": "Hippocratic Abbreviation Expansion",
    "url": "https://aclweb.org/anthology/P14-2060",
    "year": 2014
  },
  "references": [
    "acl-C08-1056",
    "acl-D13-1007",
    "acl-J93-1003",
    "acl-P06-1125",
    "acl-P10-1079",
    "acl-P11-2013",
    "acl-P12-1055",
    "acl-P12-1109",
    "acl-P12-3006",
    "acl-P12-3011",
    "acl-P13-1155"
  ],
  "sections": [
    {
      "text": [
        "Abstract",
        "Incorrect normalization of text can be particularly damaging for applications like text-to-speech synthesis (TTS) or typing auto-correction, where the resulting normalization is directly presented to the user, versus feeding downstream applications.",
        "In this paper, we focus on abbreviation expansion for TTS, which requires a ?do no harm?, high precision approach yielding few expansion errors at the cost of leaving relatively many abbreviations unexpanded.",
        "In the context of a large-scale, real-world TTS scenario, we present methods for training classifiers to establish whether a particular expansion is apt.",
        "We achieve a large increase in correct abbreviation expansion when combined with the baseline text normalization component of the TTS system, together with a substantial reduction in incorrect expansions."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Text normalization (Sproat et al., 2001) is an important initial phase for many natural language and speech applications.",
        "The basic task of text normalization is to convert non-standard words (NSWs) ?",
        "numbers, abbreviations, dates, etc.",
        "?",
        "into standard words, though depending on the task and the domain a greater or lesser number of these NSWs may need to be normalized.",
        "Perhaps the most demanding such application is text-to-speech synthesis (TTS) since, while for parsing, machine translation and information retrieval it may be acceptable to leave such things as numbers and abbreviations unexpanded, for TTS all tokens need to be read, and for that it is necessary to know how to pronounce them.",
        "Which normalizations are required depends very much on the application.",
        "What is also very application-dependent is the cost of errors in normalization.",
        "For some applica-tions, where the normalized string is an intermediate stage in a larger application such as translation or information retrieval, overgeneration of normalized alternatives is often a beneficial strat-egy, to the extent that it may improve the accuracy of what is eventually being presented to the user.",
        "In other applications, such as TTS or typing auto-correction, the resulting normalized string itself is directly presented to the user; hence errors in normalization can have a very high cost relative to leaving tokens unnormalized.",
        "In this paper we concentrate on abbreviations, which we define as alphabetic NSWs that it would be normal to pronounce as their expansion.",
        "This class of NSWs is particularly common in personal ads, product reviews, and so forth.",
        "For example: home health care svcs stat home health llc osceola aquatic ctr stars rating write audi vw repair ser quality and customer Each of the examples above contains an abbreviation that, unlike, e.g., conventionalized state abbreviations such as ca for California, is either only slightly standard (ctr for center) or not standard at all (ser for service).",
        "An important principle in text normalization for TTS is do no harm.",
        "If a system is unable to reliably predict the correct reading for a string, it is better to leave the string alone and have it default to, say, a character-by-character reading, than to expand it to something wrong.",
        "This is particularly true in accessibility applications for users who rely on TTS for most or all of their information needs.",
        "Ideally a navigation system should read turn on 30N correctly as turn on thirty north; but if it cannot resolve the ambiguity in 30N, it is far better to read it as thirty N than as thirty Newtons, since listeners can more easily recover from the first kind of error than the second.",
        "We present methods for learning abbreviation expansion models that favor high precision (incor- rect expansions < 2%).",
        "Unannotated data is used to collect evidence for contextual disambiguation and to train an abbreviation model.",
        "Then a small amount of annotated data is used to build models to determine whether to accept a candidate expan-364 sion of an abbreviation based on these features.",
        "The data we report on are taken from Google Maps TM and web pages associated with its map en-tries, but the methods can be applied to any data source that is relatively abbreviation rich.",
        "We note in passing that similar issues arise in automatic spelling correction work (Wilcox- O?Hearn et al., 2008), where it is better to leave a word alone than to ?correct?",
        "it wrongly.",
        "2 Related work There has been a lot of interest in recent years on ?normalization?",
        "of social media such as Twitter, but that work defines normalization much more broadly than we do here (Xia et al., 2006; Choud-hury et al., 2007; Kobus et al., 2008; Beaufort et al., 2010; Kaufmann, 2010; Liu et al., 2011; Pen-nell and Liu, 2011; Aw and Lee, 2012; Liu et al., 2012a; Liu et al., 2012b; Hassan and Menezes, 2013; Yang and Eisenstein, 2013).",
        "There is a good reason for us to focus more narrowly.",
        "For Twit-ter, much of the normalization task involves non-standard language such as ur website suxx brah (from Yang and Eisenstein (2013)).",
        "Expanding the latter to your website sucks, brother certainly normalizes it to standard English, but one could argue that in so doing one is losing information that the writer is trying to convey using an informal style.",
        "On the other hand, someone who writes svc ctr for service center in a product review is probably merely trying to save time and so expanding the abbreviations in that case is neutral with respect to preserving the intent of the original text.",
        "One other difference between the work we report from much of the recent work cited above is that that work focuses on getting high F scores, whereas we are most concerned with getting high precision.",
        "While this may seem like a trivial trade off between precision and recall, our goal motivates developing measures that minimize the ?risk?",
        "of expanding a term, something that is important in an application such as TTS, where one cannot correct a misexpansion after it is spoken.",
        "3 Methods Since our target application is text-to-speech, we define the task in terms of an existing TTS lexicon.",
        "If a word is already in the lexicon, it is left unprocessed, since there is an existing pronunciation for it; if a word is out-of-vocabulary (OOV), we consider expanding it to a word in the lexicon.",
        "We consider a possible expansion for an abbreviation to be any word in the lexicon from which the abbreviation can be derived by only deletion of letters.",
        "1 For present purposes we use the Google English text-to-speech lexicon, consisting of over 430 thousand words.",
        "Given an OOV item (possi- ble abbreviation) in context, we make use of features of the context and of the OOV item itself to enumerate and score candidate expansions.",
        "Our data consists of 15.1 billion words of text data from Google Maps TM , lower-cased and tokenized to remove punctuation symbols.",
        "We used this data in several ways.",
        "First, we used it to bootstrap a model for assigning a probability of an ab-breviation/expansion pair.",
        "Second, we used it to extract contextual n-gram features for predicting possible expansions.",
        "Finally, we sampled just over 14 thousand OOV items in context and had them manually labeled with a number of categories, including ?abbreviation?.",
        "OOVs labeled as abbreviations were also labeled with the correct expansion.",
        "We present each of these uses in turn.",
        "3.1 Abbreviation modeling We collect potential abbreviation/full-word pairs by looking for terms that could be abbreviations of full words that occur in the same context.",
        "Thus: the svc/service center heating clng/cooling system dry clng/cleaning system contributes evidence that svc is an abbreviation of service.",
        "Similarly instances of clng in contexts that can contain cooling or cleaning are evidence that clng could be an abbreviation of either of these words.",
        "(The same contextual information of course is used later on to disambiguate which of the expansions is appropriate for the context.)",
        "To compute the initial guess as to what can be a possible abbreviation, a Thrax grammar (Roark et al., 2012) is used that, among other things, specifies that: the abbreviation must start with the same letter as the full word; if a vowel is deleted, all adjacent vowels should also be deleted; consonants may be deleted in a cluster, but not the last one; and a (string) suffix may be deleted.",
        "2 We count a pair of words as ?co-occurring?",
        "if they are observed in the same context.",
        "For a given context C, e.g., the center, letW C be the set of words found in that context.",
        "Then, for any pair of words u, v, we can assign a pair count based on the count of contexts where both occur: c(u, v) = |{C : u ?W C and v ?W C }| 1 We do not deal here with phonetic spellings in abbreviations such as 4get, or cases where letters have been transposed due to typographical errors (scv).",
        "2 This Thrax grammar can be found at http://openfst.cs.nyu.edu/twiki/bin/ view/Contrib/ThraxContrib 365 blvd boulevard rd road yrs years ca california fl florida ctr center mins minutes def definitely ste suite Table 1: Examples of automatically mined abbrevia-tion/expansion pairs.",
        "Let c(u) be defined as ?",
        "v c(u, v).",
        "From these counts, we can define a 2?2 table and calculate statistics such as the log likelihood statistic (Dun- ning, 1993), which we use to rank possible abbre-viation/expansion pairs.",
        "Scores derived from these type (rather than token) counts highly rank pairs of in-vocabulary words and OOV possible abbreviations that are substitutable in many contexts.",
        "We further filter the potential abbreviations by removing ones that have a lot of potential expan-sions, where we set the cutoff at 10.",
        "This removes mostly short abbreviations that are highly ambiguous.",
        "The resulting ranked list of abbreviation expansion pairs is then thresholded before building the abbreviation model (see below) to provide a smaller but more confident training set.",
        "For this paper, we used 5-gram contexts (two words on either side) to extract abbreviations and their expansions.",
        "See Table 1 for some examples.",
        "Our abbreviation model is a pair character language model (LM), also known as a joint multi-gram model (Bisani and Ney, 2008), whereby aligned symbols are treated as a single token and a smoothed n-gram model is estimated.",
        "This defines a joint distribution over input and output sequences, and can be efficiently encoded as a weighted finite-state transducer.",
        "The extracted abbreviation/expansion pairs are character-aligned and a 7-gram pair character LM is built over the alignments using the OpenGrm n-gram library (Roark et al., 2012).",
        "For example: c:c \u000f:e \u000f:n t:t \u000f:e r:r Note that, as we?ve defined it, the alignments from abbreviation to expansion allow only identity and insertion, no deletions or substitutions.",
        "The cost from this LM, normalized by the length of the ex-pansion, serves as a score for the quality of a putative expansion for an abbreviation.",
        "For a small set of frequent, conventionalized abbreviations (e.g., ca for California ?",
        "63 pairs in total ?",
        "mainly state abbreviations and similar items), we assign an fixed pair LM score, since these examples are in effect irregular cases, where the regularities of the productive abbreviation process do not capture their true cost.",
        "3.2 Contextual features To predict the expansion given the context, we extract n-gram observations for full words in the TTS lexicon.",
        "We do this in two ways.",
        "First, we simply train a smoothed n-gram LM from the data.",
        "Because of the size of the data set, this is heavily pruned using relative entropy pruning (Stolcke, 1998).",
        "Second, we use log likelihood and log odds ratios (this time using standardly defined n-gram counts) to extract reliable bigram and trigram contexts for words.",
        "Space precludes a detailed treatment of these two statistics, but, briefly, both can be derived from contingency table values calculated from the frequencies of (1) the word in the particular context; (2) the word in any context; (3) the context with any word; and (4) all words in the corpus.",
        "See Agresti (2002), Dunning (1993) and Monroe et al. (2008) for useful overviews of how to calculate these and other statistics to derive reliable associations.",
        "In our case, we use them to derive associations between contexts and words occuring in those contexts.",
        "The contexts include trigrams with the target word in any of the three positions, and bigrams with the target word in either position.",
        "We filter the set of n-grams based on both their log likelihood and log odds ratios, and provide those scores as features.",
        "3.3 Manual annotations We randomly selected 14,434 OOVs in their full context, and had them manually annotated as falling within one of 8 categories, along with the expansion if the category was ?abbreviation?.",
        "Note that these are relatively lightweight annotations that do not require extensive linguistics expertise.",
        "The abbreviation class is defined as cases where pronouncing as the expansion would be normal.",
        "Other categories included letter sequence (expan- sion would not be normal, e.g., TV); partial letter sequence (e.g., PurePictureTV); misspelling; leave as is (part of a URL or pronounced as a word, e.g., NATO); foreign; don't know; and junk.",
        "Abbreviations accounted for nearly 23% of the cases, and about 3/5 of these abbreviations were instances from the set of 63 conventional abbrevi-ation/expansion pairs mentioned in Section 3.1.",
        "3.4 Abbreviation expansion systems We have three base systems that we compare here.",
        "The first is the hand-built TTS normalization system.",
        "This system includes some manually built patterns and an address parser to find common abbreviations that occur in a recognizable context.",
        "For example, the grammar covers several hundred city-state combinations, such as Fairbanks AK, yielding good performance on such cases.",
        "The other two systems were built using data extracted as described above.",
        "Both systems make use of the pair LM outlined in Section 3.1, but differ in how they model context.",
        "The first sys-366 tem, which we call ?N-gram?, uses a pruned Katz (1987) smoothed trigram model.",
        "The second sys-tem, which we call ?SVM?, uses a Support Vector Machine (Cortes and Vapnik, 1995) to classify candidate expansions as being correct or not.",
        "For both systems, for any given input OOV, the possible expansion with the highest score is output, along with the decision of whether to expand.",
        "For the ?N-gram?",
        "system, n-gram negative log probabilities are extracted as follows.",
        "Let w i be the position of the target expansion.",
        "We extract the part of the n-gram probability of the string that is not constant across all competing expansions, and normalize by the number of words in that window.",
        "Thus the score of the word is: S(w i ) = ?",
        "1 k + 1 i+k ?",
        "j=i log P(w j | w j?1 w j?2 ) In our experiments, k = 2 since we have a trigram model, though in cases where the target word is the last word in the string, k = 1, because there only the end-of-string symbol must be predicted in addition to the expansion.",
        "We then take the Bayesian fusion of this model with the pair LM, by adding them in the log space, to get prediction from both the context and abbreviation model.",
        "For the ?SVM?",
        "model, we extract features from the log likelihood and log odds scores associated with contextual n-grams, as well as from the pair LM probability and characteristics of the abbreviation itself.",
        "We train a linear model on a subset of the annotated data (see section 4).",
        "Multiple contextual n-grams may be observed, and we take the maximum log likelihood and log odds scores for each candidate expansion in the observed context.",
        "We then quantize these scores down into 16 bins, using the histogram in the training data to define bin thresholds so as to partition the training instances evenly.",
        "We also create 16 bins for the pair LM score.",
        "A binary feature is defined for each bin that is set to 1 if the current candidate's score is less than the threshold of that bin, otherwise 0.",
        "Thus multiple bin features can be active for a given candidate expansion of the abbreviation.",
        "We also have features that fire for each type of contextual feature (e.g., trigram with expansion as middle word, etc.",
        "), including ?no context?, where none of the trigrams or bigrams from the current example that include the candidate expansion are present in our list.",
        "Further, we have features for the length of the abbreviation (shorter abbreviations have more ambiguity, hence are more risky to expand); membership in the list of frequent, conventionalized abbreviations mentioned earlier; and some combinations of these, along with bias features.",
        "We train the model using standard options with Google internal SVM training tools.",
        "Note that the number of n-grams in the two models differs.",
        "The N-gram system has around 200M n-grams after pruning; while the SVM model uses around a quarter of that.",
        "We also tried a more heavily pruned n-gram model, and the results are only very slightly worse, certainly acceptable for a low-resource scenario.",
        "4 Experimental Results We split the 3,209 labeled abbreviations into a training set of 2,209 examples and a held aside development set of 1,000 examples.",
        "We first evaluate on the development set, then perform a final 10- fold cross validation over the entire set of labeled examples.",
        "We evaluate in terms of the percentage of abbreviations that were correctly expanded (true positives, TP) and that were incorrectly expanded (false positives, FP).",
        "Results are shown in Table 2.",
        "The first two rows show the baseline TTS system and SVM model.",
        "On the development set, both systems have a false positive rate near 3%, i.e., three abbreviations are expanded incorrectly for every 100 examples; and over 50% true positive rate, i.e., more than half of the abbreviations are expanded correctly.",
        "To report true and false positive rates for the N-gram system we would need to select an arbitrary decision threshold operating point, unlike the deterministic TTS baseline and the SVM model with its decision threshold of 0.",
        "Rather than tune such a meta-parameter to the development set, we instead present an ROC curve comparison of the N-gram and SVM models, and then propose a method for ?intersecting?",
        "their output without requiring a tuned decision threshold.",
        "Figure 1 presents an ROC curve for the N-gram and SVM systems, and for the simple Bayesian fusion (sum in log space) of their scores.",
        "We can see that the SVM model has very high precision for its highest ranked examples, yielding nearly 20% of the correct expansions without any incorrect expansions.",
        "However the N-gram system achieves higher true positive rates when the false Percent of abbreviations dev set full set System TP FP TP FP TTS baseline 55.0 3.1 40.0 3.0 SVM model 52.6 3.3 53.3 2.6 SVM ?",
        "N-gram 50.6 1.1 50.3 0.9 SVM ?",
        "N-gram, then TTS 73.5 1.9 74.5 1.5 Table 2: Results on held-out labeled data, and with final 10-fold cross-validation over the entire labeled set.",
        "Percentage of abbreviations expanded correctly (TP) and percentage expanded incorrectly (FP) are reported for each system.",
        "367 C o r r e c t e x p a n s i o n p e r c e n t a g e ( T P ) 0 1 2 3 4 0 10 20 30 40 50 60 N-?gram SVM SVM ?+ ?N-?gram SVM ?intersect ?N-?gram Incorrect ?expansion ?percentage ?",
        "(FP) C o r r e c t ?",
        "e x p a n s i o n ?",
        "p e r c e n t a g e ?",
        "( T P ) F i g u r e 1 : R O C c u r v e p l o t t i n g t r u e p o s i t i v e ( c o r r e c t e x p a n s i o n ) p e r c e n t a g e s v e r s u s f a l s e p o s i t i v e ( i n c o r r e c t e x p a n s i o n ) p e r c e n t a g e s f o r s e v e r a l s y s t e m s o n t h e d e v e l o p m e n t s e t .",
        "a t t h e S V M ?",
        "s d e c i s i o n t h r e s h o l d c o r r e s p o n d i n g t o a r o u n d 3 .",
        "3 % f a l s e p o s i t i v e r a t e .",
        "T h e s i m p l e c o m b i n a t i o n o f t h e i r s c o r e s a c h i e v e s s t r o n g i m p r o v e m e n t s o v e r e i t h e r m o d e l , w i t h a n o p e r a t i n g p o i n t a s s o c i a t e d w i t h t h e S V M d e c i s i o n b o u n d a r y t h a t y i e l d s a c o u p l e o f p o i n t s i m p r o v e m e n t i n t r u e p o s i t i v e s a n d a f u l l 1 % r e d u c t i o n i n f a l s e p o s i t i v e r a t e .",
        "O n e s i m p l e w a y t o c o m b i n e t h e s e t w o s y s t e m o u t p u t s i n a w a y t h a t d o e s n o t r e q u i r e t u n i n g a d e c i s i o n t h r e s h o l d i s t o e x p a n d t h e a b b r e v i a t i o n i f a n d o n l y i f ( 1 ) b o t h t h e S V M m o d e l a n d t h e N g r a m m o d e l a g r e e o n t h e b e s t e x p a n s i o n ; a n d ( 2 ) t h e S V M m o d e l s c o r e i s g r e a t e r t h a n z e r o .",
        "I n a s l i g h t a b u s e o f t h e t e r m ?",
        "i n t e r s e c t i o n ?",
        ", w e c a l l t h i s c o m b i n a t i o n ?",
        "S V M i n t e r s e c t N g r a m ?",
        "( o r ?",
        "S V M \\ N g r a m ?",
        "i n T a b l e 2 ) .",
        "U s i n g t h i s a p p r o a c h , o u r t r u e p o s i t i v e r a t e o n t h e d e v s e t d e c l i n e s a b i t t o j u s t o v e r 5 0 % , b u t o u r f a l s e p o s i t i v e r a t e d e c l i n e s o v e r t w o f u l l p e r c e n t a g e p o i n t s t o 1 .",
        "1 % , y i e l d i n g a v e r y h i g h p r e c i s i o n s y s t e m .",
        "T a k i n g t h i s v e r y h i g h p r e c i s i o n s y s t e m c o m b i n a t i o n o f t h e N g r a m a n d S V M m o d e l s , w e t h e n c o m b i n e w i t h t h e b a s e l i n e T T S s y s t e m a s f o l l o w s .",
        "F i r s t w e a p p l y o u r s y s t e m , a n d e x p a n d t h e i t e m i f i t s c o r e s a b o v e t h r e s h o l d ; f o r t h o s e i t e m s l e f t u n e x p a n d e d , w e l e t t h e T T S s y s t e m p r o c e s s i t i n i t s o w n w a y .",
        "I n t h i s w a y , w e a c t u a l l y r e d u c e t h e f a l s e p o s i t i v e r a t e o n t h e d e v s e t o v e r t h e b a s e l i n e T T S s y s t e m b y o v e r 1 % a b s o l u t e t o l e s s t h a n 2 % , w h i l e a l s o i n c r e a s i n g t h e t r u e p o s i t i v e r a t e t o 7 3 .",
        "5 % , a n i n c r e a s e o f 1 8 .",
        "5 % a b s o l u t e .",
        "O f c o u r s e , a t t e s t t i m e , w e w i l l n o t k n o w w h e t h e r a n O O V i s a n a b b r e v i a t i o n o r n o t , s o w e a l s o l o o k e d a t t h e p e r f o r m a n c e o n t h e r e s t o f t h e c o l l e c t e d d a t a , t o s e e h o w o f t e n i t e r r o n e o u s l y s u g g e s t s a n e x p a n s i o n f r o m t h a t s e t .",
        "O f t h e 1 1 , 1 5 7 e x a m p l e s t h a t w e r e h a n d l a b e l e d a s n o n a b b r e v i a t i o n s , o u r S V M \\ N g r a m s y s t e m e x p a n d e d 4 5 i t e m s , w h i c h i s a f a l s e p o s i t i v e r a t e o f 0 .",
        "4 % u n d e r t h e a s s u m p t i o n t h a t n o n e o f t h e m s h o u l d b e e x p a n d e d .",
        "I n f a c t , m a n u a l i n s p e c t i o n f o u n d t h a t 2 0 % o f t h e s e w e r e c o r r e c t e x p a n s i o n s o f a b b r e v i a t i o n s t h a t h a d b e e n m i s l a b e l e d .",
        "D u r i n g s y s t e m d e v e l o p m e n t , w e a l s o e x p e r i m e n t e d w i t h a n u m b e r o f a l t e r n a t i v e h i g h p r e c i s i o n a p p r o a c h e s t h a t s p a c e p r e c l u d e s o u r p r e s e n t i n g i n d e t a i l h e r e , i n c l u d i n g : p r u n i n g t h e n u m b e r o f e x p a n s i o n c a n d i d a t e s b a s e d o n t h e p a i r l a n g u a g e m o d e l s c o r e ; o n l y a l l o w i n g a b b r e v i a t i o n e x p a n s i o n w h e n a t l e a s t o n e e x t r a c t e d n g r a m c o n t e x t i s p r e s e n t f o r t h a t e x p a n s i o n i n t h a t c o n t e x t ; a n d C A R T t r e e ( B r e i m a n e t a l .",
        ", 1 9 8 4 ) t r a i n i n g w i t h r e a l v a l u e d s c o r e s .",
        "S o m e o f t h e s e y i e l d e d v e r y h i g h p r e c i s i o n s y s t e m s , t h o u g h a t t h e c o s t o f l e a v i n g m a n y m o r e a b b r e v i a t i o n s u n e x p a n d e d .",
        "W e f o u n d t h a t , f o r u s e i n c o m b i n a t i o n w i t h t h e b a s e l i n e T T S s y s t e m , l a r g e o v e r a l l r e d u c t i o n s i n f a l s e p o s i t i v e r a t e w e r e a c h i e v e d b y u s i n g a n i n i t i a l s y s t e m w i t h s u b s t a n t i a l l y h i g h e r T P a n d s o m e w h a t h i g h e r F P r a t e s , s i n c e f a r f e w e r a b b r e v i a t i o n s w e r e t h e n p a s s e d a l o n g u n e x p a n d e d t o t h e b a s e l i n e s y s t e m , w i t h i t s r e l a t i v e l y h i g h 3 % F P r a t e .",
        "T o e n s u r e t h a t w e h a d n o t o v e r t u n e d o u r s y s t e m s t o t h e d e v s e t t h r o u g h e x p e r i m e n t a t i o n , w e p e r f o r m e d 1 0 f o l d c r o s s v a l i d a t i o n o v e r t h e f u l l s e t o f a b b r e v i a t i o n s , a n d t h e r e s u l t s a r e p r e s e n t e d i n T a b l e 2 .",
        "M o s t n o t a b l y , t h e T T S b a s e l i n e s y s t e m h a s a m u c h l o w e r t r u e p o s i t i v e r a t e ; y e t w e fi n d o u r s y s t e m s a c h i e v e p e r f o r m a n c e v e r y c l o s e t o t h a t f o r t h e d e v e l o p m e n t s e t , s o t h a t o u r fi n a l c o m b i n a t i o n w i t h t h e T T S b a s e l i n e w a s a c t u a l l y s l i g h l y b e t t e r t h a n t h e n u m b e r s o n t h e d e v e l o p m e n t s e t .",
        "5 C o n c l u s i o n s N o t e s f o r i n t e r n a l r e v i e w e r s ?",
        "M a y b e m o r e t e c h n i c a l e x p l a n a t i o n o f l o g l i k e l i h o o d a n d l o g o d d s s c o r e s ?",
        "R e v a m p e d i n t r o , b a c k g r o u n d , c o n c l u s i o n a n d e x p a n d e d r e f s .",
        "?",
        "A n o n y m i z a t i o n f o r s u b m i s s i o n .",
        "Incorrect expansion percentage (FP) Figure 1: ROC curve plotting true positive (correct expan-sion) percentages versus false positive (incorrect expansion) percentages for several systems on the development set.",
        "positive rate falls between 1 and 3 percent, though both systems reach roughly the same performance at the SVM's decision threshold corresponding to around 3.3% false positive rate.",
        "The simple combination of their scores achieves strong improvements over either model, with an operating point associated with the SVM decision boundary that yields a couple of points improvement in true positives and a full 1% reduction in false positive rate.",
        "One simple way to combine these two system outputs in a way that does not require tuning a decision threshold is to expand the abbreviation if and only if (1) both the SVM model and the N-gram model agree on the best expansion; and (2) the SVM model score is greater than zero.",
        "In a slight abuse of the term ?intersection?, we call this combination ?SVM intersect N-gram?",
        "(or ?SVM ?",
        "N-gram?",
        "in Table 2).",
        "Using this approach, our true positive rate on the development set declines a bit to just over 50%, but our false positive rate declines over two full percentage points to 1.1%, yielding a very high precision system.",
        "Taking this very high precision system combination of the N-gram and SVM models, we then combine with the baseline TTS system as follows.",
        "First we apply our system, and expand the item if it scores above threshold; for those items left un-expanded, we let the TTS system process it in its own way.",
        "In this way, we actually reduce the false positive rate on the development set over the baseline TTS system by over 1% absolute to less than 2%, while also increasing the true positive rate to 73.5%, an increase of 18.5% absolute.",
        "Of course, at test time, we will not know whether an OOV is an abbreviation or not, so we also looked at the performance on the rest of the collected data, to see how often it erroneously suggests an expansion from that set.",
        "Of the 11,157 examples that were hand-labeled as non-abbreviations, our SVM ?N-gram system expanded 45 i ems, which is a false positive rate of 0.4% under the assumption that none of them should be expanded.",
        "In fact, m nual inspection found that 20% of these were correct expansions of abbreviations that had been mis-labeled.",
        "We also experimented with a umber of alternative hig precision approaches tha space p e-cludes our presenting in detail here, including: pruning the number of expansion candidates based on the pair LM score; only allowing abbreviation expansion when at least one extracted n-gram context is present for that expansion in that context; and CART tree (Breiman et al., 1984) training with real valued scores.",
        "Some of these yielded very high precision systems, though at the cost of leaving many more abbreviations unexpanded.",
        "We found that, for use in combination with the baseline TTS system, large overall reductions in FP rate were achieved by using an initial system with substantially higher TP and somewhat higher FP rates, since far fewer abbreviations were then passed along unexpanded to the baseline system, with its relatively high 3% FP rate.",
        "To ensure that we did not overtune our systems to the development set through experimentation, we performed 10-fold cross validation over the full set of abbreviations.",
        "These results are presented in Table 2.",
        "Most notably, the TTS baseline system has a much lower true positive rate; yet we find our systems achieve performance very close to that for the development set, so that our final combination with the TTS baseline was actually slighly better than the numbers on the development set.",
        "5 Conclusions In this paper we have presented methods for high precision abbreviation expansion for a TTS application.",
        "The methods are largely self-organizing, using in-domain unannotated data, and depend on only a small amount of annotated data.",
        "Since the SVM features relate to general properties of ab-breviations, expansions and contexts, the classifier parameters will likely carry over to new (En- glish) domains.",
        "We demonstrate that in combination with a hand-built TTS baseline, the methods afford dramatic improvement in the TP rate (to about 74% from a starting point of about 40%) and a reduction of FP to below our goal of 2%.",
        "Acknowledgments We would like to thank Daan van Esch and the Google Speech Data Operations team for their work on preparing the annotated data.",
        "We also thank the reviewers for their comments.",
        "368 References"
      ]
    }
  ]
}
