{
  "info": {
    "authors": [
      "Yuan Cao",
      "Sanjeev Khudanpur"
    ],
    "book": "ACL",
    "id": "acl-P14-1063",
    "title": "Online Learning in Tensor Space",
    "url": "https://aclweb.org/anthology/P14-1063",
    "year": 2014
  },
  "references": [
    "acl-D08-1024",
    "acl-D11-1125",
    "acl-N12-1023",
    "acl-N13-1052",
    "acl-N13-1134",
    "acl-P05-1012",
    "acl-P05-1022",
    "acl-W02-1001"
  ],
  "sections": [
    {
      "text": [
        "Abstract",
        "We propose an online learning algorithm based on tensor-space models.",
        "A tensor-space model represents data in a compact way, and via rank-1 approximation the weight tensor can be made highly struc-tured, resulting in a significantly smaller number of free parameters to be estimated than in comparable vector-space models.",
        "This regularizes the model complexity and makes the tensor model highly effective in situations where a large feature set is defined but very limited resources are available for training.",
        "We apply with the proposed algorithm to a parsing task, and show that even with very little training data the learning algorithm based on a tensor model performs well, and gives significantly better results than standard learning algorithms based on traditional vector-space models."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Many NLP applications use models that try to incorporate a large number of linguistic features so that as much human knowledge of language can be brought to bear on the (prediction) task as possible.",
        "This also makes training the model parameters a challenging problem, since the amount of labeled training data is usually small compared to the size of feature sets: the feature weights cannot be estimated reliably.",
        "Most traditional models are linear models, in the sense that both the features of the data and model parameters are represented as vectors in a vector space.",
        "Many learning algorithms applied to NLP problems, such as the Perceptron (Collins, 2002), MIRA (Crammer et al., 2006; McDonald et al., 2005; Chiang et al., 2008), PRO (Hop- kins and May, 2011), RAMPION (Gimpel and Smith, 2012) etc., are based on vector-space models.",
        "Such models require learning individual feature weights directly, so that the number of parameters to be estimated is identical to the size of the feature set.",
        "When millions of features are used but the amount of labeled data is limited, it can be difficult to precisely estimate each feature weight.",
        "In this paper, we shift the model from vector-space to tensor-space.",
        "Data can be represented in a compact and structured way using tensors as containers.",
        "Tensor representations have been applied to computer vision problems (Hazan et al., 2005; Shashua and Hazan, 2005) and information retrieval (Cai et al., 2006a) a long time ago.",
        "More recently, it has also been applied to parsing (Cohen and Collins, 2012; Cohen and Satta, 2013) and semantic analysis (Van de Cruys et al., 2013).",
        "A linear tensor model represents both features and weights in tensor-space, hence the weight tensor can be factorized and approximated by a linear sum of rank-1 tensors.",
        "This low-rank approximation imposes structural constraints on the feature weights and can be regarded as a form of regularization.",
        "With this representation, we no longer need to estimate individual feature weights directly but only a small number of ?bases?",
        "instead.",
        "This property makes the the tensor model very effective when training a large number of feature weights in a low-resource environment.",
        "On the other hand, tensor models have many more degrees of ?design freedom?",
        "than vector space models.",
        "While this makes them very flexible, it also creates much difficulty in designing an optimal tensor structure for a given training set.",
        "We give detailed description of the tensor space 666 model in Section 2.",
        "Several issues that come with the tensor model construction are addressed in Section 3.",
        "A tensor weight learning algorithm is then proposed in 4.",
        "Finally we give our experimental results on a parsing task and analysis in Section 5.",
        "2 Tensor Space Representation Most of the learning algorithms for NLP problems are based on vector space models, which represent data as vectors ?",
        "?",
        "R n , and try to learn feature weight vectors w ?",
        "R n such that a linear model y = w ?",
        "?",
        "is able to discriminate between, say, good and bad hypotheses.",
        "While this is a natural way of representing data, it is not the only choice.",
        "Below, we reformulate the model from vector to tensor space.",
        "2.1 Tensor Space Model A tensor is a multidimensional array, and is a generalization of commonly used algebraic objects such as vectors and matrices.",
        "Specifically, a vector is a 1 st order tensor, a matrix is a 2 nd order tensor, and data organized as a rectangular cuboid is a 3 rd order tensor etc.",
        "In general, a D th order tensor is represented as T ?",
        "R n 1 ?n 2 ?...n D , and an entry in T is denoted by T i 1 ,i 2 ,...,i D .",
        "Different dimensions of a tensor 1, 2, .",
        ".",
        ".",
        ", D are named modes of the tensor.",
        "Using a D th order tensor as container, we can assign each feature of the task a D-dimensional index in the tensor and represent the data as tensors.",
        "Of course, shifting from a vector to a tensor representation entails several additional degrees of freedom, e.g., the order D of the tensor and the sizes {n d } D d=1 of the modes, which must be addressed when selecting a tensor model.",
        "This will be done in Section 3.",
        "2.2 Tensor Decomposition Just as a matrix can be decomposed as a linear combination of several rank-1 matrices via SVD, tensors also admit decompositions 1 into linear combinations of ?rank-1?",
        "tensors.",
        "A D th order tensor A ?",
        "R n 1 ?n 2 ?...n D is rank-1 if it can be 1 The form of tensor decomposition defined here is named as CANDECOMP/PARAFAC(CP) decomposition (Kolda and Bader, 2009).",
        "Another popular form of tensor decomposition is called Tucker decomposition, which decomposes a tensor into a core tensor multiplied by a matrix along each mode.",
        "We focus only on the CP decomposition in this paper.",
        "written as the outer product of D vectors, i.e. A = a 1 ?",
        "a 2 ?, .",
        ".",
        ".",
        ",?a D , where a i ?",
        "R n d , 1 ?",
        "d ?",
        "D. A D th order tensor T ?",
        "R n 1 ?n 2 ?...n D can be factorized into a sum of component rank-1 tensors as T = R ?",
        "r=1 A r = R ?",
        "r=1 a 1 r ?",
        "a 2 r ?, .",
        ".",
        ".",
        ",?a D r where R, called the rank of the tensor, is the minimum number of rank-1 tensors whose sum equals T .",
        "Via decomposition, one may approximate a tensor by the sum of H major rank-1 tensors with H ?",
        "R. 2.3 Linear Tensor Model In tensor space, a linear model may be written (ig- noring a bias term) as f(W ) = W ?",
        "?, where ?",
        "?",
        "R n 1 ?n 2 ?...n D is the feature tensor, W is the corresponding weight tensor, and ?",
        "denotes the Hadamard product.",
        "If W is further decomposed as the sum of H major component rank-1 tensors, i.e. W ?",
        "?",
        "H h=1 w 1 h ?w 2 h ?, .",
        ".",
        ".",
        ",?w D h , then f(w 1 1 , .",
        ".",
        ".",
        ",w D 1 , .",
        ".",
        ".",
        ",w 1 h , .",
        ".",
        ".",
        ",w D h ) = H ?",
        "h=1 ??",
        "1 w 1 h ?",
        "2 w 2 h .",
        ".",
        ".?",
        "D w D h , (1) where ?",
        "l is the l-mode product operator between a D th order tensor T and a vector a of dimension n d , yielding a (D ?",
        "1) th order tensor such that (T ?",
        "l a) i 1 ,...,i l?1 ,i l+1 ,...,i D = n d ?",
        "i l =1 T i 1 ,...,i l?1 ,i l ,i l+1 ,...,i D ?",
        "a i l .",
        "The linear tensor model is illustrated in Figure 1.",
        "2.4 Why Learning in Tensor Space?",
        "So what is the advantage of learning with a tensor model instead of a vector model?",
        "Consider the case where we have defined 1,000,000 features for our task.",
        "A vector space linear model requires estimating 1,000,000 free parameters.",
        "However if we use a 2 nd order tensor model, organize the features into a 1000 ?",
        "1000 matrix ?, and use just 667 Figure 1: A 3 rd order linear tensor model.",
        "The feature weight tensor W can be decomposed as the sum of a sequence of rank-1 component tensors.",
        "one rank-1 matrix to approximate the weight ten-sor, then the linear model becomes f(w 1 ,w 2 ) = w T 1 ?w 2 , where w 1 ,w 2 ?",
        "R 1000 .",
        "That is to say, now we only need to estimate 2000 parameters!",
        "In general, if V features are defined for a learning problem, and we (i) organize the feature set as a tensor ?",
        "?",
        "R n 1 ?n 2 ?...n D and (ii) use H component rank-1 tensors to approximate the corresponding target weight tensor.",
        "Then the total number of parameters to be learned for this tensor model is H ?",
        "D d=1 n d , which is usually much smaller than V = ?",
        "D d=1 n d for a traditional vector space model.",
        "Therefore we expect the tensor model to be more effective in a low-resource training environment.",
        "Specifically, a vector space model assumes each feature weight to be a ?free?",
        "parameter, and estimating them reliably could therefore be hard when training data are not sufficient or the feature set is huge.",
        "By contrast, a linear tensor model only needs to learn H ?",
        "D d=1 n d ?bases?",
        "of the m feature weights instead of individual weights directly.",
        "The weight corresponding to the feature ?",
        "i 1 ,i 2 ,...,i D in the tensor model is expressed as w i 1 ,i 2 ,...,i D = H ?",
        "h=1 w 1 h,i 1 w 2 h,i 2 .",
        ".",
        ".",
        "w D h,i D , (2) where w j h,i j is the i th j element in the vector w j h .",
        "In other words, a true feature weight is now approximated by a set of bases.",
        "This reminds us of the well-known low-rank matrix approximation of images via SVD, and we are applying similar techniques to approximate target feature weights, which is made possible only after we shift from vector to tensor space models.",
        "This approximation can be treated as a form of model regularization, since the weight tensor is represented in a constrained form and made highly structured via the rank-1 tensor approximation.",
        "Of course, as we reduce the model complexity, e.g. by choosing a smaller and smaller H , the model's expressive ability is weakened at the same time.",
        "We will elaborate on this point in Section 3.1.",
        "3 Tensor Model Construction To apply a tensor model, we first need to convert the feature vector into a tensor ?.",
        "Once the structure of ?",
        "is determined, the structure of W is fixed as well.",
        "As mentioned in Section 2.1, a tensor model has many more degrees of ?design freedom?",
        "than a vector model, which makes the problem of finding a good tensor structure a non-trivial one.",
        "3.1 Tensor Order The order of a tensor affects the model in two ways: the expressiveness of the model and the number of parameters to be estimated.",
        "We assume H = 1 in the analysis below, noting that one can always add as many rank-1 component tensors as needed to approximate a tensor with arbitrary precision.",
        "Obviously, the 1 st order tensor (vector) model is the most expressive, since it is structureless and any arbitrary set of numbers can always be represented exactly as a vector.",
        "The 2 nd order rank-1 tensor (rank-1 matrix) is less expressive because not every set of numbers can be organized into a rank-1 matrix.",
        "In general, a D th order rank-1 tensor is more expressive than a (D + 1) th order rank-1 tensor, as a lower-order tensor imposes less structural constraints on the set of numbers it can express.",
        "We formally state this fact as follows: Theorem 1.",
        "A set of real numbers that can be represented by a (D + 1) th order tensor Q can also be represented by a D th order tensor P , provided P andQ have the same volume.",
        "But the reverse is not true.",
        "Proof.",
        "See appendix.",
        "On the other hand, tensor order also affects the number of parameters to be trained.",
        "Assuming that a D th order has equal size on each mode (we will elaborate on this point in Section 3.2) and the volume (number of entries) of the tensor is fixed as V , then the total number of parameters 668 of the model is DV 1 D .",
        "This is a convex function of D, and the minimum 2 is reached at either D ?",
        "= blnV c or D ?",
        "= dlnV e. Therefore, as D increases from 1 to D ?",
        ", we lose more and more of the expressive power of the model but reduce the number of parameters to be trained.",
        "However it would be a bad idea to choose aD beyondD ?",
        ".",
        "The optimal tensor order depends on the nature of the actual problem, and we tune this hyper-parameter on a held-out set.",
        "3.2 Mode Size The size n d of each tensor mode, d = 1, .",
        ".",
        ".",
        ", D, determines the structure of feature weights a tensor model can precisely represent, as well as the number of parameters to estimate (we also assume H = 1 in the analysis below).",
        "For exam-ple, if the tensor order is 2 and the volume V is 12, then we can either choose n 1 = 3, n 2 = 4 or n 1 = 2, n 2 = 6.",
        "For n 1 = 3, n 2 = 4, the numbers that can be precisely represented are divided into 3 groups, each having 4 numbers, that are scaled versions of one another.",
        "Similarly for n 1 = 2, n 2 = 6, the numbers can be divided into 2 groups with different scales.",
        "Obviously, the two possible choices of (n 1 , n 2 ) also lead to different numbers of free parameters (7 vs. 8).",
        "GivenD and V , there are many possible combinations of n d , d = 1, .",
        ".",
        ".",
        ", D, and the optimal combination should indeed be determined by the structure of target features weights.",
        "However it is hard to know the structure of target feature weights before learning, and it would be impractical to try every possible combination of mode sizes, therefore we choose the criterion of determining the mode sizes as minimization of the total number of pa-rameters, namely we solve the problem: min n 1 ,...,n D D ?",
        "d=1 n d s.t D ?",
        "d=1 n d = V The optimal solution is reached when n 1 = n 2 = .",
        ".",
        ".",
        "= n D = V 1 D .",
        "Of course it is not guaranteed that V 1 D is an integer, therefore we choose n d = bV 1 D c or dV 1 D e, d = 1, .",
        ".",
        ".",
        ", D such that ?",
        "D d=1 n d ?",
        "V and [ ?",
        "D d=1 n d ] ?",
        "V is minimized.",
        "The [ ?",
        "D d=1 n d ] ?",
        "V extra entries of the tensor correspond to no features and are used just for 2 The optimal integer solution can be determined simply by comparing the two function values.",
        "padding.",
        "Since for each n d there are only two possible values to choose, we can simply enumerate all the possible 2 D (which is usually a small number) combinations of values and pick the one that matches the conditions given above.",
        "This way n 1 , .",
        ".",
        ".",
        ", n D are fully determined.",
        "Here we are only following the principle of minimizing the parameter number.",
        "While this strategy might work well with small amount of training data, it is not guaranteed to be the best strategy in all cases, especially when more data is available we might want to increase the number of pa-rameters, making the model more complex so that the data can be more precisely modeled.",
        "Ideally the mode size needs to be adaptive to the amount of training data as well as the property of target weights.",
        "A theoretically guaranteed optimal approach to determining the mode sizes remains an open problem, and will be explored in our future work.",
        "3.3 Number of Rank-1 Tensors The impact of using H > 1 rank-1 tensors is ob-vious: a larger H increases the model complexity and makes the model more expressive, since we are able to approximate target weight tensor with smaller error.",
        "As a trade-off, the number of parameters and training complexity will be increased.",
        "To find out the optimal value of H for a given prob-lem, we tune this hyper-parameter too on a held-out set.",
        "3.4 Vector to Tensor Mapping Finally, we need to find a way to map the original feature vector to a tensor, i.e. to associate each feature with an index in the tensor.",
        "Assuming the tensor volume V is the same as the number of features, then there are in all V !",
        "ways of map-ping, which is an intractable number of possibilities even for modest sized feature sets, making it impractical to carry out a brute force search.",
        "However while we are doing the mapping, we hope to arrange the features in a way such that the corresponding target weight tensor has approximately a low-rank structure, this way it can be well approximated by very few component rank-1 tensors.",
        "Unfortunately we have no knowledge about the target weights in advance, since that is what we need to learn after all.",
        "As a way out, we first run a simple vector-model based learning algorithm (say the Perceptron) on the training data and estimate a weight vector, which serves as a ?surro- 669 gate?",
        "weight vector.",
        "We then use this surrogate vector to guide the design of the mapping.",
        "Ideally we hope to find a permutation of the surrogate weights to map to a tensor in such a way that the tensor has a rank as low as possible.",
        "However matrix rank minimization is in general a hard problem (Fazel, 2002).",
        "Therefore, we follow an approximate algorithm given in Figure 2a, whose main idea is illustrated via an example in Figure 2b.",
        "Basically, what the algorithm does is to divide the surrogate weights into hierarchical groups such that groups on the same level are approximately proportional to each other.",
        "Using these groups as units we are able to ?fill?",
        "the tensor in a hierarchical way.",
        "The resulting tensor will have an approximate low-rank structure, provided that the sorted feature weights have roughly group-wise proportional relations.",
        "For comparison, we also experimented a trivial solution which maps each entry of the feature tensor to the tensor just in sequential order, namely ?",
        "0 is mapped to ?",
        "0,0,...,0 , ?",
        "1 is mapped to ?",
        "0,0,...,1 etc.",
        "This of course ignores correlation between features since the original feature order in the vector could be totally meaningless, and this strategy is not expected to be a good solution for vector to tensor mapping.",
        "4 Online Learning Algorithm We now turn to the problem of learning the feature weight tensor.",
        "Here we propose an online learning algorithm similar to MIRA but modified to accommodate tensor models.",
        "Let the model be f(T ) = T ?",
        "?",
        "(x, y), where T = ?",
        "H h=1 w 1 h ?",
        "w 2 h ?, .",
        ".",
        ".",
        ",?w D h is the weight tensor, ?",
        "(x, y) is the feature tensor for an input-output pair (x, y).",
        "Training samples (x i , y i ), i = 1, .",
        ".",
        ".",
        ",m, where x i is the input and y i is the reference or oracle hypothesis, are fed to the weight learning algorithm in sequential order.",
        "A prediction z t is made by the model T t at time t from a set of candidatesZ(x t ), and the model updates the weight tensor by solving the following problem: min T?Rn1?n2?...nD 1 2 ?T ?",
        "T t ?",
        "2 + C?",
        "(3) s.t.",
        "L t ?",
        "?, ?",
        "?",
        "0 where T is a decomposed weight tensor and L t = T ??",
        "(x t , z t )?",
        "T ??",
        "(x t , y t ) + ?",
        "(y t , z t ) Input: Tensor order D, tensor volume V , mode size n d , d = 1, .",
        ".",
        ".",
        ", D, surrogate weight vector v Let v + = [v + 1 , .",
        ".",
        ".",
        ", v + p ] be the non-negative part of v v ?",
        "= [v ?",
        "1 , .",
        ".",
        ".",
        ", v ?",
        "q ] be the negative part of v Algorithm: ?",
        "v + = sort(v + ) in descending order ?",
        "v ?",
        "= sort(v ? )",
        "in ascending order u = V/n D e = p?mod(p, u), f = q ?mod(q, u) Construct vector X = [v?",
        "+ 1 , .",
        ".",
        ".",
        ", v?",
        "+ e , v?",
        "?",
        "1 , .",
        ".",
        ".",
        ", v?",
        "?",
        "f , v?",
        "+ e+1 , .",
        ".",
        ".",
        ", v?",
        "+ p , v?",
        "?",
        "f+1 , .",
        ".",
        ".",
        ", v?",
        "?",
        "q ] Map X a , a = 1, .",
        ".",
        ".",
        ", p + q to the tensor entry T i 1 ,...,i D , such that a = D ?",
        "d=1 (i d ?",
        "1)l d?1 + 1 where l d = l d?1 n d , and l 0 = 1 (a) Mapping a surrogate weight vector to a tensor (b) Illustration of the algorithm Figure 2: Algorithm for mapping a surrogate weight vector X to a tensor.",
        "(2a) provides the al-gorithm; (2b) illustrates it by mapping a vector of length V = 12 to a (n 1 , n 2 , n 3 ) = (2, 2, 3) tensor.",
        "The bars X i represent the surrogate weights ?",
        "after separately sorting the positive and negative parts ?",
        "and the labels along a path of the tree correspond to the tensor-index of the weight represented by the leaf resulting from the mapping.",
        "670 is the structured hinge loss.",
        "This problem setting follows the same ?passive- aggressive?",
        "strategy as in the original MIRA.",
        "To optimize the vectors w d h , h = 1, .",
        ".",
        ".",
        ",H, d = 1, .",
        ".",
        ".",
        ", D, we use a similar iterative strategy as proposed in (Cai et al., 2006b).",
        "Basically, the idea is that instead of optimizing w d h all together, we optimize w 1 1 ,w 2 1 , .",
        ".",
        ".",
        ",w D H in turn.",
        "While we are updating one vector, the rest are fixed.",
        "For the problem setting given above, each of the sub-problems that need to be solved is convex, and according to (Cai et al., 2006b) the objective function value will decrease after each individual weight update and eventually this procedure will converge.",
        "We now give this procedure in more detail.",
        "Denote the weight vector of the d th mode of the h th tensor at time t as w d h,t .",
        "We will update the vectors in turn in the following order: w 1 1,t , .",
        ".",
        ".",
        ",w D 1,t ,w 1 2,t , .",
        ".",
        ".",
        ",w D 2,t , .",
        ".",
        ".",
        ",w 1 H,t , .",
        ".",
        ".",
        ",w D H,t .",
        "Once a vector has been updated, it is fixed for future updates.",
        "By way of notation, define W d h,t = w 1 h,t+1 ?, .",
        ".",
        ".",
        ",?w d?1 h,t+1 ?w d h,t ?, .",
        ".",
        ".",
        ",?w D h,t (and letW D+1 h,t , w 1 h,t+1 ?, .",
        ".",
        ".",
        ",?w D h,t+1 ), ?",
        "W d h,t = w 1 h,t+1 ?, .",
        ".",
        ".",
        ",?w d?1 h,t+1 ?w d ?, .",
        ".",
        ".",
        ",?w D h,t (where w d ?",
        "R n d ), T d h,t = h?1 ?",
        "h ?",
        "=1 W D+1 h ?",
        ",t +W d h,t + H ?",
        "h ?",
        "=h+1 W 1 h ?",
        ",t (4) ?",
        "T d h,t = h?1 ?",
        "h ?",
        "=1 W D+1 h ?",
        ",t + ?",
        "W d h,t + H ?",
        "h ?",
        "=h+1 W 1 h ?",
        ",t ?",
        "d h,t (x, y) = ?",
        "(x, y)?",
        "2 w 2 h,t+1 .",
        ".",
        ".?",
        "d?1 w d?1 h,t+1 ?",
        "d+1 w d+1 h,t .",
        ".",
        ".?",
        "D w D h,t (5) In order to update from w d h,t to get w d h,t+1 , the sub-problem to solve is: min wd?Rnd 1 2 ?",
        "?",
        "T d h,t ?",
        "T d h,t ?",
        "2 + C?",
        "= min wd?Rnd 1 2 ?",
        "?",
        "W d h,t ?W d h,t ?",
        "2 + C?",
        "= min wd?Rnd 1 2 ?",
        "1 h,t+1 .",
        ".",
        ".",
        "?",
        "d?1 h,t+1 ?",
        "d+1 h,t .",
        ".",
        ".",
        "?",
        "D h,t ?w d ?w d h,t ?",
        "2 + C?",
        "s.t.",
        "L d h,t ?",
        "?, ?",
        "?",
        "0. where ?",
        "d h,t = ?w d h,t ?",
        "2 L d h,t = ?",
        "T d h,t ??",
        "(x t , z t )?",
        "?",
        "T d h,t ??",
        "(x t , y t ) +?",
        "(y t , z t ) = w d ?",
        "( ?",
        "d h,t (x t , z t )?",
        "?",
        "d h,t (x t , y t ) ) ?",
        "( h?1 ?",
        "h ?",
        "=1 W D+1 h ?",
        ",t + H ?",
        "h ?",
        "=h+1 W 1 h ?",
        ",t ) ?",
        "(?",
        "(x t , y t )??",
        "(x t , z t )) +?",
        "(y t , z t ) Letting ??",
        "d h,t , ?",
        "d h,t (x t , y t )?",
        "?",
        "d h,t (x t , z t ) and s d h,t , ( h?1 ?",
        "h ?",
        "=1 W D+1 h ?",
        ",t + H ?",
        "h ?",
        "=h+1 W 1 h ?",
        ",t ) ?",
        "(?",
        "(x t , y t )??",
        "(x t , z t )) we may compactly write L d h,t = ?",
        "(y t , z t )?",
        "s d h,t ?w d ???",
        "d h,t .",
        "This convex optimization problem is just like the original MIRA and may be solved in a similar way.",
        "The updating strategy for w d h,t is derived as w d h,t+1 = w d h,t + ???",
        "d h,t ?",
        "= (6) min { C, ?",
        "(y t , z t )?",
        "T d h,t ?",
        "(?",
        "(x t , y t )??",
        "(x t , z t )) ???",
        "d h,t ?",
        "2 } The initial vectors w i h,1 cannot be made all zero, since otherwise the l-mode product in Equation (5) would yield all zero ?",
        "d h,t (x, y) and the model would never get a chance to be updated.",
        "There-fore, we initialize the entries of w i h,1 uniformly such that the Frobenius-norm of the weight tensor W is unity.",
        "We call the algorithm above ?Tensor-MIRA?",
        "and abbreviate it as T-MIRA.",
        "671 5 Experiments In this section we shows empirical results of the training algorithm on a parsing task.",
        "We used the Charniak parser (Charniak et al., 2005) for our ex-periment, and we used the proposed algorithm to train the reranking feature weights.",
        "For compari-son, we also investigated training the reranker with Perceptron and MIRA.",
        "5.1 Experimental Settings To simulate a low-resource training environment, our training sets were selected from sections 2-9 of the Penn WSJ treebank, section 24 was used as the held-out set and section 23 as the evaluation set.",
        "We applied the default settings of the parser.",
        "There are around V = 1.33 million features in all defined for reranking, and the n-best size for reranking is set to 50.",
        "We selected the parse with the highest f -score from the 50-best list as the oracle.",
        "We would like to observe from the experiments how the amount of training data as well as different settings of the tensor degrees of freedom affects the algorithm performance.",
        "Therefore we tried all combinations of the following experimental parameters: Parameters Settings Training data (m) Sec.",
        "2, 2-3, 2-5, 2-9 Tensor order (D) 2, 3, 4 # rank-1 tensors (H) 1, 2, 3 Vec.",
        "to tensor mapping approximate, sequential Here ?approximate?",
        "and ?sequential?",
        "means us-ing, respectively, the algorithm given in Figure 2 and the sequential mapping mentioned in Section 3.4.",
        "According to the strategy given in 3.2, once the tensor order and number of features are fixed, the sizes of modes and total number of parameters to estimate are fixed as well, as shown in the tables below: D Size of modes Number of parameters 2 1155?",
        "1155 2310 3 110?",
        "110?",
        "111 331 4 34?",
        "34?",
        "34?",
        "34 136 5.2 Results and Analysis The f -scores of the held-out and evaluation set given by T-MIRA as well as the Perceptron and MIRA baseline are given in Table 1.",
        "From the re-sults, we have the following observations: 1.",
        "When very few labeled data are available for training (compared with the number of fea-tures), T-MIRA performs much better than the vector-based models MIRA and Percep-tron.",
        "However as the amount of training data increases, the advantage of T-MIRA fades away, and vector-based models catch up.",
        "This is because the weight tensors learned by T-MIRA are highly structured, which significantly reduces model/training complexity and makes the learning process very effective in a low-resource environment, but as the amount of data increases, the more complex and expressive vector-based models adapt to the data better, whereas further improvements from the tensor model is impeded by its structural constraints, making it insensitive to the increase of training data.",
        "2.",
        "To further contrast the behavior of T-MIRA, MIRA and Perceptron, we plot the f -scores on both the training and held-out sets given by these algorithms after each training epoch in Figure 3.",
        "The plots are for the experimental setting with mapping=surrogate, # rank-1 tensors=2, tensor order=2, training data=sections 2-3.",
        "It is clearly seen that both MIRA and Perceptron do much better than T-MIRA on the training set.",
        "Nevertheless, with a huge number of parameters to fit a limited amount of data, they tend to over-fit and give much worse results on the held-out set than T-MIRA does.",
        "As an aside, observe that MIRA consistently outperformed Perceptron, as expected.",
        "3.",
        "Properties of linear tensor model: The heuristic vector-to-tensor mapping strategy given by Figure 2 gives consistently better results than the sequential mapping strategy, as expected.",
        "To make further comparison of the two strate-gies, in Figure 4 we plot the 20 largest singular values of the matrices which the surrogate weights (given by the Perceptron after running for 1 epoch) are mapped to by both strategies (from the experiment with training data sections 2-5).",
        "From the contrast between the largest and the 2 nd -largest singular val-ues, it can be seen that the matrix generated 672 by the first strategy approximates a low-rank structure much better than the second strategy.",
        "Therefore, the performance of T-MIRA is influenced significantly by the way features are mapped to the tensor.",
        "If the corresponding target weight tensor has internal structure that makes it approximately low-rank, the learning procedure becomes more effective.",
        "The best results are consistently given by 2 nd order tensor models, and the differences between the 3 rd and 4 th order tensors are not significant.",
        "As discussed in Section 3.1, although 3 rd and 4 th order tensors have less pa-rameters, the benefit of reduced training complexity does not compensate for the loss of expressiveness.",
        "A 2 nd order tensor has already reduced the number of parameters from the original 1.33 million to only 2310, and it does not help to further reduce the number of parameters using higher order tensors.",
        "4.",
        "As the amount of training data increases, there is a trend that the best results come from models with more rank-1 component tensors.",
        "Adding more rank-1 tensors increases the model's complexity and ability of expression, making the model more adaptive to larger data sets.",
        "6 Conclusion and Future Work In this paper, we reformulated the traditional linear vector-space models as tensor-space models, and proposed an online learning algorithm named Tensor-MIRA.",
        "A tensor-space model is a compact representation of data, and via rank-1 tensor approximation, the weight tensor can be made highly structured hence the number of parameters to be trained is significantly reduced.",
        "This can be regarded as a form of model regular-ization.Therefore, compared with the traditional vector-space models, learning in the tensor space is very effective when a large feature set is defined, but only small amount of training data is available.",
        "Our experimental results corroborated this argument.",
        "As mentioned in Section 3.2, one interesting problem that merits further investigation is how to determine optimal mode sizes.",
        "The challenge of applying a tensor model comes from finding a proper tensor structure for a given problem, and 95.5 96 96.5 97 97.5 98 98.5 99 1 2 3 4 5 6 7 8 9 10 f-score Iteratio ns Trainin g set f-score T-MI RA MIRA Percep tron (a) Training set 87 87.5 88 88.5 89 89.5 90 1 2 3 4 5 6 7 8 9 10 f-score Iteratio ns Trainin g set f-score T-MI RA MIRA Percep tron (b) Held-out set Figure 3: f -scores given by three algorithms on training and held-out set (see text for the setting).",
        "the key to solving this problem is to find a balance between the model complexity (indicated by the order and sizes of modes) and the number of parameters.",
        "Developing a theoretically guaranteed approach of finding the optimal structure for a given task will make the tensor model not only perform well in low-resource environments, but adaptive to larger data sets.",
        "7 Acknowledgements This work was partially supported by IBM via DARPA/BOLT contract number HR0011-12-C-0015 and by the National Science Foundation via award number IIS-0963898.",
        "References"
      ]
    }
  ]
}
