{
  "info": {
    "authors": [
      "Guangyou Zhou",
      "Yubo Chen",
      "Daojian Zeng",
      "Jun Zhao"
    ],
    "book": "COLING",
    "id": "acl-C14-1010",
    "title": "Group Non-negative Matrix Factorization with Natural Categories for Question Retrieval in Community Question Answer Archives",
    "url": "https://aclweb.org/anthology/C14-1010",
    "year": 2014
  },
  "references": [
    "acl-D08-1043",
    "acl-D12-1116",
    "acl-P07-1059",
    "acl-P08-1019",
    "acl-P09-1082",
    "acl-P11-1066",
    "acl-P13-1084"
  ],
  "sections": [
    {
      "text": [
        "Group Non-negative Matrix Factorization with Natural Categories for Question Retrieval in Community Question Answer Archives Guangyou Zhou, Yubo Chen, Daojian Zeng, and Jun Zhao National Laboratory of Pattern Recognition Institute of Automation, Chinese Academy of Sciences 95 Zhongguancun East Road, Beijing 100190, China {gyzhou,yubo.chen,djzeng,jzhao}@nlpr.ia.ac.cn",
        "Abstract",
        "Community question answering (CQA) has become an important service due to the popularity of CQA archives on the web.",
        "A distinctive feature is that CQA services usually organize questions into a hierarchy of natural categories.",
        "In this paper, we focus on the problem of question retrieval and propose a novel approach, called group non-negative matrix factorization with natural categories (GNMFNC).",
        "This is achieved by learning the category-specific topics for each category as well as shared topics across all categories via a group non-negative matrix factorization framework.",
        "We derive an efficient algorithm for learning the factorization, analyze its complex-ity, and provide proof of convergence.",
        "Experiments are carried out on a real world CQA data set from Yahoo!",
        "Answers.",
        "The results show that our proposed approach significantly outperforms various baseline methods and achieves the state-of-the-art performance for question retrieval."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Community question answering (CQA) such as Yahoo!",
        "Answers 1 and Quora 2 , has become an important service due to the popularity of CQA archives on the web.",
        "To make use of the large-scale questions and their answers, it is critical to have functionality of helping users to retrieve previous answers (Duan et al., 2008).",
        "Typically, such functionality is achieved by first retrieving the historical questions that best match a user's queried question, and then using answers of these returned questions to answer the queried question.",
        "This is what we called question retrieval in this paper.",
        "The major challenge for question retrieval, as for most information retrieval tasks, is the lexical gap between the queried questions and the historical questions in the archives.",
        "For example, if a queried question contains the word ?company?",
        "but a relevant historical question instead contains the word ?firm?, then there is a mismatch and the historical question may not be easily distinguished from an irrelevant one.",
        "To solve the lexical gap problem, most researchers focused on translation-based approaches since the relationships between words (or phrases) can be explicitly modeled through word-to-word (or phrases) translation probabilities (Jeon et al., 2005; Riezler et al., 2007; Xue et al., 2008; Lee et al., 2008; Bernhard and Gurevych, 2009; Zhou et al., 2011; Singh, 2012).",
        "However, these existing methods model the relevance ranking without considering the category-specific and shared topics with natural categories, it is not clear whether this information is useful for question retrieval.",
        "A distinctive feature of question-answer pairs in CQA is that CQA services usually organize questions into a hierarchy of natural categories.",
        "For example, Yahoo!",
        "Answers contains a hierarchy of 26 categories at the first level and more than 1262 subcategories at the leaf level.",
        "When a user asks a question, the user is typically required to choose a category label for the question from a predefined hierarchy.",
        "Questions in the predefined hierarchy usually share certain generic topics while questions in different categories have their specific topics.",
        "For example, questions in categories ?Arts & Humanities?",
        "and ?Beauty & Style?",
        "may share the generic topic of ?dance?",
        "but they also have the category-specific topics of ?poem?",
        "and ?wearing?, respectively.",
        "Licence details: http:// creativecommons.org/licenses/by/4.0/ 1 http://answers.yahoo.com/ 2 http://www.quora.com/ 89 Inspired by the above observation, we propose a novel approach, called group non-negative matrix factorization with natural categories (GNMFNC).",
        "GNMFNC assumes that there exists a set of category-specific topics for each of the category, and there also exists a set of shared topics for all of the categories.",
        "Each question in CQA is specified by its category label, category-specific topics, as well as shared topics.",
        "In this way, the large-scale question retrieval problem can be decomposed into small-scale subproblems.",
        "In GNMFNC, questions in each category are represented as a term-question matrix.",
        "The term-question matrix is then approximated as the product of two matrices: one matrix represents the category-specific topics as well as the shared topics, and the other matrix denotes the question representation based on topics.",
        "An objective function is defined to measure the goodness of prediction of the data with the model.",
        "Optimization of the objective function leads to the automatic discovery of topics as well as the topic representation of questions.",
        "Finally, we calculate the relevance ranking between the queried questions and the historical questions in the latent topic space.",
        "Past studies by (Cao et al., 2009; Cao et al., 2010; Ming et al., 2010; Cai et al., 2011; Ji et al., 2012; Zhou et al., 2013) confirmed a significant retrieval improvement by adding the natural categories into various existing retrieval models.",
        "However, all these previous work regarded natural categories individually without considering the relationships among them.",
        "On the contrary, this paper can effectively capture the relationships between the shared aspects and the category-specific individual aspects with natural categories via a group non-negative matrix factorization framework.",
        "Also, our work models the relevance ranking in the latent topic space rather than using the existing retrieval models.",
        "To date, no attempts have been made regarding group non-negative matrix factorization in studies of question retrieval, which remains an under-explored area.",
        "The remainder of this paper is organized as follows.",
        "Section 2 describes our proposed group nonnegative matrix factorization with natural categories for question retrieval.",
        "Section 3 presents the experimental results.",
        "In Section 4, we conclude with ideas for future research.",
        "2 Group Non-negative Matrix Factorization with Natural Categories 2.1 Problem Formulation In CQA, all questions are usually organized into a hierarchy of categories.",
        "When a user asks a question, the user is typically required to choose a category label for the question from a predefined hierarchy of categories.",
        "Hence, each question in CQA has a category label.",
        "Suppose that we are given a question collection D in CQA archive with size N , containing terms from a vocabulary V with size M .",
        "A question d is represented as a vector d ?",
        "R M where each entry denotes the weight of the corresponding term, for example tf-idf is used in this paper.",
        "Let C = {c 1 , c 2 , ?",
        "?",
        "?",
        ", c P } denote the set of categories (subcat- egories) of question collection D, where P is the number of categories (subcategories).",
        "The question collection D is organized into P groups according to their category labels and can be represented as D = {D 1 ,D 2 , ?",
        "?",
        "?",
        ",D P }.",
        "D p = {d (p) 1 , ?",
        "?",
        "?",
        ",d (p) N p } ?",
        "R M?N p is the term-question matrix corresponding to category c p , in which each row stands for a term and each column stands for a question.",
        "N p is the number of questions in category c p such that ?",
        "P p=1 N p = N .",
        "LetU ?",
        "p = [U s ,U p ] ?",
        "R M?",
        "(K s +K p ) be the term-topic matrix corresponding to category c p , where K s is the number of shared topics, K p is the number of category-specific topics corresponding to category c p , and p ?",
        "[1, P ].",
        "Term-topic matrix U s can be represented as U s = [u (s) 1 , ?",
        "?",
        "?",
        ",u (s) K s ] ?",
        "R M?K s , in which each column corresponds to a shared topic.",
        "While the term-topic matrix U p can be represented as U p = [u (p) 1 , ?",
        "?",
        "?",
        ",u (p) K p ] ?",
        "R M?K p .",
        "The total number of topics in the question collection D is K = K s + PK p .",
        "Let V p = [v (p) 1 , ?",
        "?",
        "?",
        ",v (p) N p ] ?",
        "R (K s +K p )?N p be the topic-question matrix corresponding to category c p , in which each column denotes the question representation in the topic space.",
        "We also denote V T p = [H T p ,W T p ], where H p ?",
        "R K s ?N p and W p ?",
        "R K p ?N p correspond to the coefficients of shared topicsU s and category-specific topicsU p , respectively.",
        "Thus, given a question collection D = {D 1 ,D 2 , ?",
        "?",
        "?",
        ",D P } together with the category labels C = {c 1 , c 2 , ?",
        "?",
        "?",
        ", c P }, our proposed GNMFNC amounts to modeling the question collection D with P group 90 simultaneously, arriving at the following objective function: O = P ?",
        "p=1 { ?",
        "p ?",
        "?",
        "D p ?",
        "[U s ,U p ]V p ?",
        "?",
        "2 F + R(U s ,U p ) } (1) where ?",
        "p , ?D p ?",
        "?2 F .",
        "R(U s ,U p ) is a regularization term used to penalize the ?similarity?",
        "between the shared topics and category-specific topics throughU s andU p .",
        "In this paper, we aim to ensure that matrix U s captures only shared topics and matrix U p captures only the category-specific topics.",
        "For example, if matricesU s andU p are mutually orthogonal, we have U T s U p = 0.",
        "To impose this constraint, we attempt to minimize the sum-of-squares of entries of the matrix U T s U p (e.g., ?U T s U p ?",
        "2 F which uniformly optimizes each entry of U T s U p ).",
        "With this choice, the regularization term of R(U s ,U p ) is given by R(U s ,U p ) = P ?",
        "p=1 ?",
        "p ?",
        "?",
        "U T s U p ?",
        "?",
        "2 F + P ?",
        "l=1,l?=p ?",
        "l ?",
        "?",
        "U T p U l ?",
        "?",
        "2 F (2) where ?",
        "p and ?",
        "l are the regularization parameters, ?p ?",
        "[1, P ], ?l ?",
        "[1, P ].",
        "Learning the objective function in equation (1) involves the following optimization problem: min U s ,U p ,V p ?0 L = O + ?",
        "1 ?",
        "?",
        "U T s 1 M ?",
        "1 K s ?",
        "?",
        "2 F + ?",
        "2 ?",
        "?",
        "U T p 1 M ?",
        "1 K p ?",
        "?",
        "2 F + ?",
        "3 ?",
        "?",
        "V p 1 N p ?",
        "1 K s +K p ?",
        "?",
        "2 F (3) where ?",
        "1 , ?",
        "2 and ?",
        "3 are the shrinkage regularization parameters.",
        "Based on the shrinkage methodology, we can approximately satisfy the normalization constraints for each column of [U s ,U p ] and V T p by guaranteeing the optimization converges to a stationary point.",
        "2.2 Learning Algorithm We present the solution to the GNMFNC optimization problem in equation (3) as the following theorem.",
        "The theoretical aspects of the optimization are presented in the next subsection.",
        "Theorem 2.1.",
        "UpdatingU s ,U p andV p using equations (4)?",
        "(6) corresponds to category c p will monotonically decrease the objective function in equation (3) until convergence.",
        "U s ?",
        "U s ?",
        "[ ?",
        "P p=1 ?",
        "p D p H T p ] [ ?",
        "P p=1 ?",
        "p [U s ,U p ]V p H T p + ?",
        "p U p U T p U s ] (4) U p ?",
        "U p ?",
        "[ ?",
        "p D p W T p ] [ ?",
        "p [U s ,U p ]V p W T p + ?",
        "p U s U T s U p + ?",
        "P l=1,l?=p ?",
        "l U l U T l U p ] (5) V p ?",
        "V p ?",
        "[ ?",
        "p D T p [U s ,U p ] ] [ ?",
        "p V T p [U s ,U p ] T [U s ,U p ] ] (6) where operator ?",
        "is element-wise product and [?]",
        "[?]",
        "is element-wise division.",
        "Based on Theorem 2.1, we note that multiplicative update rules given by equations (4)?",
        "(6) are obtained by extending the updates of standard NMF (Lee and Seung, 2001).",
        "A number of techniques can be used here to optimize the objective function in equation (3), such as alternating least squares (Kim and Park, 2008), the active set method (Kim and Park, 2008), and the projected gradients approach (Lin, 2007).",
        "Nonetheless, the multiplicative updates derived in this paper have reasonably fast convergence behavior as shown empirically in the experiments.",
        "2.3 Theoretical Analysis In this subsection, we give the theoretical analysis of the optimization, convergence and computational complexity.",
        "91 Without loss of generality, we only show the optimization ofU s and formulate the Lagrange function with constraints as follows: L(U s ) = O + ?",
        "1 ?",
        "?",
        "U T s 1 M ?",
        "1 K s ?",
        "?",
        "2 F + Tr(?",
        "s U T s ) (7) where Tr(?)",
        "denotes the trace of a matrix, ?",
        "s ?",
        "R K s ?K s is the Lagrange multiplier for the nonnegative constraintU s ?",
        "0.",
        "The partial derivative of L(U s ) w.r.t.",
        "U s is ?",
        "U s L(U s ) = ?2 P ?",
        "p=1 ?",
        "p D p H T p + 2 P ?",
        "p=1 ?",
        "p [U s ,U p ]V p H T p + 2 P ?",
        "p=1 ?",
        "p U p U T p U s + 2?",
        "1 U s ?",
        "2?",
        "1 + ?",
        "s (8) Using the Karush-Kuhn-Tucker (KKT) (Boyd and Vandenberghe, 2004) condition ?",
        "s ?U s = 0, we obtain ?",
        "U s L(U s ) ?U s = { ?",
        "?",
        "P p=1 ?",
        "p D p H T p + ?",
        "P p=1 ?",
        "p [U s ,U p ]V p H T p + ?",
        "P p=1 ?",
        "p U p U T p U s + ?",
        "1 U s ?",
        "?",
        "1 } ?U s = 0 (9) After normalization ofU s , the terms ?",
        "1 U s and ?",
        "1 are in fact equal.",
        "They can be safely ignored from the above formula without influencing convergence.",
        "This leads to the updating rule for U s in equation (4).",
        "Following the similar derivations as shown above, we can obtain the updating rules for the rest variablesU p andV p in GNMFNC optimization, as shown in equations (5) and (6).",
        "2.3.1 Convergence Analysis In this subsection, we prove the convergence of multiplicative updates given by equations (4)?(6).",
        "We first introduce the definition of auxiliary function as follows.",
        "Definition 2.1.",
        "F(X,X ? )",
        "is an auxiliary function for L(X) if L(X) ?",
        "F(X,X ? )",
        "and equality holds if and only if L(X) = F(X,X).",
        "Lemma 2.1.",
        "(Lee and Seung, 2001) If F is an auxiliary function for L, L is non-increasing under the update X (t+1) = argmin X F(X,X (t) ) Proof.",
        "By Definition 2.1, L(X (t+1) ) ?",
        "F(X (t+1) ,X (t) ) ?",
        "F(X (t) ,X (t) ) = L(X (t) ) Theorem 2.2.",
        "Let L(U (t+1) s ) denote the sum of all terms in L that containU (t+1) s , the following function is an auxiliary function for L(U (t+1) s ) F(U (t+1) s ,U (t) s ) = L(U (t) s ) + (U (t+1) s ?U (t) s )?",
        "U (t) s L(U (t) s ) + 1 2 (U (t+1) s ?U (t) s ) 2 P(U (t) s ) (10) P(U (t) s ) = ?",
        "ij [ ?",
        "P p=1 ?",
        "p [U (t) s ,U p ]V p W T p + ?",
        "p U p U T p U (t) s + ?",
        "1 U (t) s ] ij ?",
        "ij [U (t) s ] ij where ?",
        "U (t) s L(U (t) s ) is the first-order derivative of L(U (t) s ) with respect toU (t) s .",
        "Theorem 2.2 can be proved similarly to (Lee and Seung, 2001) by validating L(U (t+1) s ) ?",
        "F(U (t+1) s ,U (t) s ), L(U (t+1) s ) = F(U (t+1) s ,U (t+1) s ), and the Hessian matrix ??",
        "U (t+1) s F(U (t+1) s ,U (t) s ) ?",
        "0.",
        "Due to limited space, we omit the details of the validation.",
        "92 addition multiplication division overall GNMFNC:U s P (3MN p K s +MN p K p +MK 2 s ) P (3MN p K s +MN p K p +MK 2 s ) MK s O(PMN p K max ) GNMFNC:U p 3MN p K p +MN p K s + PM 2 K ?",
        "3MN p K p +MN p K s + PM 2 K ?",
        "MK p O(PMRK ? )",
        "GNMFNC:V p 3MN p K ?",
        "3MN p K ?",
        "N p K ?",
        "O(MN p K ? )",
        "Table 1: Computational operation counts for each iteration in GNMFNC.",
        "Based on Theorem 2.2, we can fixU (t) s and minimize F(U (t+1) s ,U (t) s ) with respect toU (t+1) s .",
        "When setting ?",
        "U (t+1) s F(U (t+1) s ,U (t) s ) = 0, we get the following updating rule U (t+1) s ?",
        "U (t) s ?",
        "[ ?",
        "P p=1 ?",
        "p D p H T p + ?",
        "1 ] [ ?",
        "P p=1 ?",
        "p [U (t) s ,U p ]V p W T p + ?",
        "p U p U T p U (t) s + ?",
        "1 U (t) s ] (11) which is consistent with the updating rule derived from the KKT conditions aforementioned.",
        "By Lemma 2.1 and Theorem 2.2, we have L(U (0) s ) = F(U (0) s ,U (0) s ) ?",
        "F(U (1) s ,U (0) s ) ?",
        "F(U (1) s ,U (1) s ) = L(U (1) s ) ?",
        "?",
        "?",
        "?",
        "?",
        "L(U (Iter) s ), where Iter is the number of iterations.",
        "Therefore, U s is monotonically decreasing.",
        "Since the objective function L is lower bounded by 0, the correctness and convergence of Theorem 2.1 is validated.",
        "2.3.2 Computational Complexity In this subsection, we discuss the time computational complexity of the proposed algorithm GNMFNC.",
        "Besides expressing the complexity of the algorithm using big O notation, we also count the number of arithmetic operations to provide more details about running time.",
        "We show the results in Table 1, where K max = max{K s ,K p }, K ?",
        "= K s + K p and R = max{M,N p }.",
        "Suppose the multiplicative updates stop after Iter iterations, the time cost of multiplicative updates then becomes O(Iter ?",
        "PMRK ?",
        ").",
        "We set Iter = 100 empirically in rest of the paper.",
        "Therefore, the overall running time of GNMFNC is linear with respect to the size of word vocabulary, the number of questions and categories.",
        "2.4 Relevance Ranking The motivation of incorporating matrix factorization into relevance ranking is to learn the word relationships and reduce the ?lexical gap?",
        "(Zhou et al., 2013a).",
        "To do so, given a queried question q with category label c p from Yahoo!",
        "Answers, we first represent it in the latent topic space as v q , v q = argmin v?0 ?q?",
        "[U s ,U p ]v?",
        "2 2 (12) where vector q is the tf-idf representation of queried question q in the term space.",
        "For each historical question d (indexed by r) in question collection D, with representation v d = r-th column ofV, we compute its similarity with queried question v q as following s topic (q, d) = < v q ,v d > ?v q ?",
        "2 ?",
        "?v d ?",
        "2 (13) The latent topic space score s topic (q, d) is combined with the conventional term matching score s term (q, d) for final relevance ranking.",
        "There are several ways to conduct the combination.",
        "Linear combination is a simple and effective way.",
        "The final relevance ranking score s(q, d) is: s(q, d) = 's topic (q, d) + (1?",
        "?",
        ")s term (q, d) (14) where ?",
        "?",
        "[0, 1] is the parameter which controls the relative importance of the latent topic space score and term matching score.",
        "s term (q, d) can be calculated with any of the conventional relevance models such as BM25 (Robertson et al., 1994) and LM (Zhai and Lafferty, 2001).",
        "93 3 Experiments 3.1 Data Set and Evaluation Metrics We collect the data set from Yahoo!",
        "Answers and use the getByCategory function provided in Yahoo!",
        "Answers API 3 to obtain CQA threads from the Yahoo!",
        "site.",
        "More specifically, we utilize the resolved questions and the resulting question repository that we use for question retrieval contains 2,288,607 questions.",
        "Each resolved question consists of four parts: ?question title?, ?question description?, ?question answers?",
        "and ?question category?.",
        "We only use the ?question title?",
        "and ?question category?",
        "parts, which have been widely used in the literature for question retrieval (Cao et al., 2009; Cao et al., 2010).",
        "There are 26 first-level categories in the predefined natural hierarchy, i.e., each historical question is categorized into one of the 26 categories.",
        "The categories include ?Arts & Humanities?, ?Beauty & Style?, ?Business & Finance?, etc.",
        "In order to evaluate our approach, we randomly select 2,000 questions as queried questions from the above data collection to construct the validation/test sets, and the remaining data collection as training set.",
        "Note that we select the queried questions in proportion to the number of questions and categories against the whole distribution to have a better control over a possible imbalance.",
        "To obtain the ground-truth, we employ the Vector Space Model (VSM) (Salton et al., 1975) to retrieve the top 10 results and obtain manual judgements.",
        "The top 10 results don't include the queried question itself.",
        "Given a returned result by VSM, an annotator is asked to label it with ?relevant?",
        "or ?irrelevant?.",
        "If a returned result is considered semantically equivalent to the queried question, the annotator will label it as ?relevant?",
        "; otherwise, the annotator will label it as ?irrelevant?.",
        "Two annotators are involved in the annotation process.",
        "If a conflict happens, a third person will make judgement for the final result.",
        "In the process of manually judging questions, the annotators are presented only the questions.",
        "As a result, there are in total 20,000 judged question pairs.",
        "We randomly split the 2,000 queried questions into validation/test sets, each has 1,000/1,000 queried questions.",
        "We use the validation set for parameter tuning and the test set for evaluation.",
        "Evaluation Metrics: We evaluate the performance of question retrieval using the following metrics: Mean Average Precision (MAP) and Precision@N (P@N).",
        "MAP rewards methods that return relevant questions early and also rewards correct ranking of the results.",
        "P@N reports the fraction of the top-N questions retrieved that are relevant.",
        "We perform a significant test, i.e., a t-test with a default significant level of 0.05.",
        "There are several parameters used in the paper, we tune these parameters on the validation set.",
        "Specifically, we set the number of category-specific topics per category and the number of shared topics in GNMFNC as (K s ,K p ) = {(5, 2), (10, 4), (20, 8), (40, 16), (80, 32)}, resulting in K = {57, 114, 228, 456, 912} total number of topics.",
        "(Note that the total number of topics in GNMFNC is K s + 26 ?K p , where 26 is the number of categories in the first-level predefined natural hierarchy 4 ).",
        "Finally, we set (K s ,K p ) = (20, 8) and K = 228 empirically as this setting yields the best performance.",
        "For regularization parameters ?",
        "p and ?",
        "l , it is difficult to directly tune on the validation set, we present an alternative way by adding a common factor a to look at the objective function of optimization problem in equation (3) on the training data.",
        "In other words, we set ?",
        "p = a K s ?K p and ?",
        "l = a K p ?K l .",
        "Therefore, we tune the parameters ?",
        "p and ?",
        "l by alternatively adjusting the common factor a via grid search.",
        "As a result, we set a = 100, resulting in ?",
        "p = ?",
        "l = 0.625 in the following experiments.",
        "The trade-off parameter ?",
        "in the linear combination is set from 0 to 1 in steps of 0.1 for all methods.",
        "We set ?",
        "= 0.6 empirically.",
        "For shrinkage regularization parameters, we empirically set ?",
        "1 = ?",
        "2 = ?",
        "3 = 1.",
        "3.2 Question Retrieval Results In this experiment, we present the experimental results for question retrieval on the test data set.",
        "Specif-ically, for our proposed GNMFNC, we combine the latent topic matching scores with the term matching scores given by BM25 and LM, denoted as ?BM25+GNMFNC?",
        "and ?LM+GNMFNC?.",
        "Table 2 shows 3 http://developer.yahoo.com/answers 4 Here we do not use the leaf categories because we find that it is not possible to run GNMFNC with such large number of topics on the current machines, and we will leave it for future work.",
        "94 Table 2: Comparison with different methods for question retrieval.",
        "# Methods MAP P@10 1 BM25 0.243 0.225 2 LM 0.286 0.232 3 (Jeon et al., 2005) 0.327 0.235 4 (Xue et al., 2008) 0.341 0.238 5 (Zhou et al., 2011) 0.365 0.243 6 (Singh, 2012) 0.354 0.240 7 (Cao et al., 2010) 0.358 0.242 8 (Cai et al., 2011) 0.331 0.236 9 BM25+GNMFNC 0.369 0.248 10 LM+GNMFNC 0.374 0.251 Table 3: Comparison of matrix factorizations for question retrieval.",
        "# Methods MAP P@10 1 BM25 0.243 0.225 2 BM25+NMF 0.325 0.235 3 BM25+CNMF 0.344 0.239 4 BM25+GNMF 0.361 0.242 5 BM25+GNMFNC 0.369 0.248 6 LM 0.286 0.232 7 LM+NMF 0.337 0.237 8 LM+CNMF 0.352 0.240 9 LM+GNMF 0.365 0.243 10 LM+GNMFNC 0.374 0.251 the main retrieval performances under the evaluation metrics MAP, P@1 and P@10.",
        "Row 1 and row 2 are the baseline systems, which model the relevance ranking using BM25 (Robertson et al., 1994) and language model (LM) (Zhai and Lafferty, 2001) in the term space.",
        "Row 3 is word-based translation model (Jeon et al., 2005), and row 4 is word-based translation language model (TRLM) (Xue et al., 2008).",
        "Row 5 is phrase-based translation model (Zhou et al., 2011), and row 6 is the entity-based translation model (Singh, 2012).",
        "Row 7 to row 11 explore the natural categories for question retrieval.",
        "In row 7, Cao et al. (2010) employed the natural categories to compute the local and global relevance with different model combination, here we use the combination VSM + TRLM for comparison because this combination obtains the superior performance than others.",
        "In row 8, Cai et al. (2011) proposed a category-enhanced TRLM for question retrieval.",
        "There are some clear trends in the results of Table 2: (1) BM25+GNMFNC and LM+GNMFNC perform significantly better than BM25 and LM respectively (t-test, p-value < 0.05, row 1 vs. row 9; row 2 vs. row 10), indicating the effective of GNMFNC.",
        "(2) BM25+GNMFNC and LM+GNMFNC perform better than translation methods, some improvements are statistical significant (t-test, p-value < 0.05, row 3 and row 4 vs. row 9 and row 10).",
        "The reason may be that GNMFNC models the relevance ranking in the latent topic space, which can also effectively solve the the lexical gap problem.",
        "(3) Capturing the shared aspects and the category-specific individual aspects with natural categories in the group modeling framework can significantly improve the performance of question retrieval (t-test, p-value < 0.05, row 7 and row 8 vs. row 9 and row 10).",
        "(4) Natural categories are useful and effectiveness for question retrieval, no matter in the group modeling framework or existing retrieval models (row 3?",
        "row 6 vs. row 7?row 10).",
        "3.3 Comparison of Matrix Factorizations We note that our proposed GNMFNC is related to non-negative matrix factorization (NMF) (Lee and Seung, 2001) and its variants, we introduce three baselines.",
        "The first baseline is NMF, which is trained on the whole training data.",
        "The second baseline is CNMF, which is trained on each category without considering the shared topics.",
        "The third baseline is GNMF (Lee and Choi, 2009; Wang et al., 2012), which is similar to our GNMFNC but there are no constraints on the category-specific topics to prevent them from capturing the information from the shared topics.",
        "NMF and GNMF are trained on the training data with the same parameter settings in section 4.1 for fair comparison.",
        "For CNMF, we also train the model on the training data with the same parameter settings in section 4.1, except parameter K s , as there exists no shared topics in CNMF.",
        "Table 3 shows the question retrieval performance of NMF families on the test set, obtained with the best parameter settings determined by the validation set.",
        "From the results, we draw the following obser-vations: (1) All of these methods can significantly improve the performance in comparison to the baseline BM25 and LM (t-test, p-value < 0.05).",
        "(2) GNMF and GNMFNC perform significantly better than NMF and CNMF respectively (t-test, p-value < 0.05), indicating the effectiveness of group matrix factorization framework, especially the use of shared topics.",
        "95 0 20 40 60 80 1000.41 0.42 0.43 0.44 0.45 0.46 0.47 0.48 0.49 0.5 Iteration number Obje ctive funct ion v alue Figure 1: Convergence curve of GNMFNC.",
        "-4 -3 -2 -1 0 1 2 3 40.414 0.416 0.418 0.42 0.422 0.424 0.426 0.428 0.43 Log10a Conv erged obje ctive funct ion v alue Figure 2: Objective function value vs. factor a.",
        "(3) GNMFNC performs significantly better than GNMF (t-test, p-value < 0.05, row 4 vs. row 5; row 9 vs. row 10), indicating the effectiveness of the regularization term on the category-specific topics to prevent them from capturing the information from the shared topics.",
        "From the experimental results reported above, we can conclude that our proposed GNMFNC is useful for question retrieval with high accuracies.",
        "To the best of our knowledge, it is the first time to investigate the group matrix factorization for question retrieval.",
        "3.4 Convergence Behavior In subsection 2.3.1, we have shown that the multiplicative updates given by equations (4)?",
        "(6) are convergent.",
        "Here, we empirically show the convergence behavior of GNMFNC.",
        "Figure 1 shows the convergence curve of GNMFNC on the training data set.",
        "From the figure, y-axis is the value of objective function and x-axis denotes the iteration number.",
        "We can see that the multiplicative updates for GNMFNC converge very fast, usually within 80 iterations.",
        "3.5 Regularization Parameters Selection One success of this paper is to use regularized constrains on the category-specific topics to prevent them from capturing the information from the shared topics.",
        "It is necessary to give an in-depth analysis of the regularization parameters used in the paper.",
        "Consider the regularization term used in equation (2), each element in U T s U p and U T p U l has a value between 0 and 1 as each column of U s , U p and U l is normalized.",
        "Therefore, it is appropriate to normalize the term having ?U T s U p ?",
        "2 F by K s K p since there are K s ?K p elements inU T s U p .",
        "Similarly, ?U T p U l ?",
        "2 F is normalized by K l K p .",
        "Note that K l = K p and l ?= p. As discussed in subsection 4.1, we present an alternative way by adding a common factor a and set ?",
        "p = a K s ?K p and ?",
        "l = a K p ?K l .",
        "The common factor a is used to adjust a trade-off between the matrix factorization errors and the mutual orthogonality, which cannot directly tune on the validation set.",
        "Thus, we look at the objective function of optimization problem in equation (3) on the training data and find the optimum value for a.",
        "Figure 2 shows the objective function value vs. common factor a, where y-axis denotes the converged objective function value, and x-axis denotes Log 10 a .",
        "We can see that the optimum value of a is 100.",
        "Therefore, the common factor a can be fixed at 100 for our data set used in the paper, resulting in ?",
        "p = ?",
        "l = 0.625.",
        "Note that the optimum value of (K s ,K p ) are set as (20, 8) in subsection 4.1.",
        "Due to limited space, we do not give an in-depth analysis for other parameters.",
        "4 Conclusion and Future Work In this paper, we propose a novel approach, called group non-negative matrix factorization with natural categories (GNMFNC).",
        "The proposed method is achieved by learning the category-specific topics for each category as well as shared topics across all categories via a group non-negative matrix factorization framework.",
        "We derive an efficient algorithm for learning the factorization, analyze its complexity, and 96 provide proof of convergence.",
        "Experiments show that our proposed approach significantly outperforms various baseline methods and achieves state-of-the-art performance for question retrieval.",
        "There are some ways in which this research could be continued.",
        "First, the optimization of GNMFNC can be decomposed into many sub-optimization problems, a natural avenue for future research is to reduce the running time by executing the optimization in a distributed computing environment (e.g., MapReduce (Dean et al., 2004)).",
        "Second, another combination approach will be used to incorporate the latent topic match score as a feature in a learning to rank model, e.g., LambdaRank (Burges et al., 2007).",
        "Third, we will try to investigate the use of the proposed approach for other kinds of data sets with larger categories, such as categorized documents from ODP project.",
        "5 Acknowledgments This work was supported by the National Natural Science Foundation of China (No.",
        "61333018 and No.",
        "61303180), the Beijing Natural Science Foundation (No.",
        "4144087), CCF Opening Project of Chinese Information Processing, and also Sponsored by CCF-Tencent Open Research Fund.",
        "We thank the anonymous reviewers for their insightful comments.",
        "References"
      ]
    }
  ]
}
