{
  "info": {
    "authors": [
      "Martin Cmejrek"
    ],
    "book": "EMNLP",
    "id": "acl-D14-1029",
    "title": "Reordering Model for Forest-to-String Machine Translation",
    "url": "https://aclweb.org/anthology/D14-1029",
    "year": 2014
  },
  "references": [
    "acl-C10-1050",
    "acl-D08-1022",
    "acl-D09-1108",
    "acl-D13-1052",
    "acl-H05-1012",
    "acl-N03-1017",
    "acl-N04-1035",
    "acl-N04-4026",
    "acl-N07-1051",
    "acl-P02-1040",
    "acl-P03-1021",
    "acl-P05-1033",
    "acl-P06-1077",
    "acl-P06-1121",
    "acl-P08-1023"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 227?232, October 25-29, 2014, Doha, Qatar.",
        "c?2014 Association for Computational Linguistics Reordering Model for Forest-to-String Machine Translation Martin ?",
        "Abstract",
        "In this paper, we present a novel extension of a forest-to-string machine translation system with a reordering model.",
        "We predict reordering probabilities for every pair of source words with a model using features observed from the input parse forest.",
        "Our approach naturally deals with the ambiguity present in the input parse forest, but, at the same time, takes into account only the parts of the input forest used by the current translation hypothesis.",
        "The method provides improvement from 0.6 up to 1.0 point measured by (Ter ?",
        "Bleu)/2 metric."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Various commonly adopted statistical machine translation (SMT) approaches differ in the amount of linguistic knowledge present in the rules they employ.",
        "Phrase-based (Koehn et al., 2003) models are strong in lexical coverage in local contexts, and use external models to score reordering options (Tillman, 2004; Koehn et al., 2005).",
        "Hierarchical models (Chiang, 2005) use lexi-calized synchronous context-free grammar rules to produce local reorderings.",
        "The grammaticality of their output can be improved by additional reordering models scoring permutations of the source words.",
        "Reordering model can be either used for source pre-ordering (Tromble and Eisner, ), integrated into decoding via translation rules extension (Hayashi et al., 2010), additional lexical features (He et al., ), or using external sources of information, such as source syntactic features observed from a parse tree (Huang et al., 2013).",
        "Tree-to-string (T2S) models (Liu et al., 2006; Galley et al., 2006) use rules with syntactic struc-tures, aiming at even more grammatically appropriate reorderings.",
        "Forest-to-string (F2S) systems (Mi et al., 2008; Mi and Huang, 2008) use source syntactic forest as the input to overcome parsing errors, and to alleviate sparseness of translation rules.",
        "The parse forest may often represent several meanings for an ambiguous input that may need to be transtated differently using different word orderings.",
        "The following example of an ambiguous Chinese sentence with ambiguous part-of-speech labeling motivates our interest in the reordering model for the F2S translation.",
        "S. t?aol`un (0) SSS.",
        "h`ui (1) SSS z?enmey`ang (2) discussion/NN SS meeting/NN how/VV discuss/VV SSSSSwill/VV There are several possible meanings based on the different POS tagging sequences.",
        "We present translations for two of them, together with the indices to their original source words: (a) NN NN VV: How 2 was 2 the 0 discussion 0 meeting 1 ?",
        "(b) VV VV VV: Discuss 0 what 2 will 1 happen 1 .",
        "A T2S system starts from a single parse corresponding to one of the possible POS sequences, the same tree can be used to predict word reorder-ings.",
        "On the other hand, a F2S system deals with the ambiguity through exploring translation hypotheses for all competing parses representing the different meanings.",
        "As our example suggests, different meanings also tend to reorder differently 227 id rule r 1 NP(t?aol`un/NN) ?",
        "discussion r 2 NP(h`ui/NN) ?",
        "meeting r 3 NP(x 1 :NP x 2 :NP) ?",
        "the x 1 x 2 r 4 IP(x 1 :NP z?enmey`ang/VV) ?",
        "how was x 1 r 5 IP(h`ui/VV z?enmey`ang/VV) ?",
        "what will happen r 6 IP(t?aol`un/VV x 1 :IP) ?",
        "discuss x 1 Table 1: Tree-to-string translation rules (without internal structures).",
        "during translation.",
        "First, the reordering model suitable for F2S translation should allow for translation of all meanings present in the input.",
        "Sec-ond, as the process of deriving a partial translation hypothesis rules out some of the meanings, the reordering model should restrict itself to features originating in the relevant parts of the input forest.",
        "Our work presents a novel technique satisfying both these requirements, while leaving the disambuiguation decision up to the model using global features.",
        "The paper is organized as follows: We briefly overview the F2S and Hiero translation models in Section 2, present the proposed forest reordering model in Section 3, describe our experiment and present results in Section 4.",
        "2 Translation Models Forest-to-string translation (Mi et al., 2008) is an extension of the tree-to-string model (Liu et al., 2006; Huang et al., 2006) allowing it to use a packed parse forest as the input instead of a single parse tree.",
        "Figure 1 shows a tree-to-string translation rule (Huang et al., 2006), which is a tuple ?lhs(r), rhs(r), ?",
        "(r)?, where lhs(r) is the source-side tree fragment, whose internal nodes are labeled by nonterminal symbols (like NP), and whose frontier nodes are labeled by source-language words (like ?z?enmey`ang?)",
        "or variables from a finite set X = {x 1 , x 2 , .",
        ".",
        ".",
        "}; rhs(r) is the target-side string expressed in target-language words (like ?how was?)",
        "and variables; and ?",
        "(r) is a mapping from X to nonterminals.",
        "Each variable x i ?",
        "X occurs exactly once in lhs(r) and exactly once in rhs(r).",
        "The Table 1 lists all rules necessary to derive translations (a) and (b), with their internal structure removed for simplicity.",
        "Typically, an F2S system translates in two steps (shown in Figure 2): parsing and decoding.",
        "In the IP x 1 :NP VP VV z?enmey`ang ?",
        "how was x 1 Figure 1: Tree-to-string rule r 4 .",
        "parsing step, the source language input is converted into a parse forest (A).",
        "In the decoding step, we first convert the parse forest into a translation forest F t in (B) by using the fast pattern-matching technique (Zhang et al., 2009).",
        "Then the decoder uses dynamic programing with beam search and cube pruning to find the approximation to the best scoring derivation in the translation forest, and outputs the target string.",
        "3 Forest Reordering Model In this section, we describe the process of applying the reordering model scores.",
        "We score pairwise translation reorderings for every pair of source words similarly as described by Huang et al. (2013).",
        "In their approach, an external model of ordering distributions of sibling constituent pairs predicts the reordering of word pairs.",
        "Our approach deals with parse forests rather than with single trees, thus we have to model the scores differently.",
        "We model ordering distributions for every pair of close relatives?nodes in the parse forest that may occur together as frontier nodes of a single matching rule.",
        "We further condition the distribution on a third node?a common ancestor of the node pair that corresponds to the root node of the matching rule.",
        "This way our external model takes into acount the syntactic context of the hypothesis.",
        "For example, nodes NP 0, 1 and NP 1, 2 are close relatives, NP 0, 2 and IP 0, 3 are their common ances-tors; NP 0, 1 and VV 2, 3 are close relatives, IP 0, 3 is their common ancestor; NP 0, 1 and VV 1, 2 are not close relatives.",
        "More formally, let us have an input sentence (w 0 , ...,w n ) and its translation hypothesis h. For every i and j such that 0 ?",
        "i < j ?",
        "n we assume that the translations of w i and w j are in the hypothesis h either in the same or inverted ordering o i j ?",
        "{Inorder,Reorder}, with a probability P order (o i j |h).",
        "Conditioning on h signifies that the probabilistic model takes the current hypothesis as a parameter.",
        "The reordering score of the entire hy-228 (A) IP 0, 3 NP 0, 2 NP 0, 1 t?aol`un VV 0, 1 NP 1, 2 h`ui VV 1, 2 IP 1, 3 z?enmey`ang VV 2, 3 R t ?",
        "(B) e 4 e 6 e 3 e 1 t?aol`un e 2 h`ui e 5 z?enmey`ang Figure 2: Parse and translation hypergraphs.",
        "(A) The parse forest of the example sentence.",
        "Solid hyperedges denote the best parse, dashed hyperedges denote the second best parse.",
        "Unary edges were collapsed.",
        "(B) The corresponding translation forest F t after applying the tree-to-string translation rule set R t .",
        "Each translation hyperedge (e.g. e 4 ) has the same index as the corresponding rule (r 4 ).",
        "The forest-to-string system can produce the example translation (a) (solid derivation: r 1 , r 2 , r 3 , and r 4 ) and (b) (dashed derivation: r 5 , r 6 ).",
        "pothesis f order (h) is then computed as f order = ?",
        "0?i< j?n ?",
        "log P order (o i j = o h i j | h), (1) where o h i j denotes the actual ordering used in h. The score f order can be computed recursively by dynamic programing during the decoding.",
        "As an example, we show in Table 2 reordering probabilities retrieved in decoding of our sample sentence.",
        "(a) If h is a hypothesis formed by a single translation rule r with no frontier nonterminals, we evaluate all word pairs w i and w j covered by h such that i < j.",
        "For each such pair we find the frontier nodes x and y matched by r such that x spans exactly w i and y spans exactly w j .",
        "(In this case, x and y match preterminal nodes, each spanning one position).",
        "We also find the node z matching the root of r. Then we directly use the Equation 1 to compute the score using an external model P order (o i j |xyz) to estimate the probability of reordering the relative nodes.",
        "For example, when applying rule r 5 , we use the ordering distribution P order (o 1,2 |VV 1, 2 ,VV 2, 3 , IP 1, 3 ) to score reorderings of h`ui and z?enmey`ang.",
        "(b) If h is a hypothesis formed by a T2S rule with one or more frontier nonterminals, we evaluate all word pairs as follows: If both w i and w j are spanned by the same frontier nonterminal (e.g., t?aol`un and h`ui when applying the rule r 4 ), the score f order had been already computed for the underlying subhypothesis, and therefore was already included in the total score.",
        "Otherwise, we compute the word pair ordering cost.",
        "We find the close relatives x and y representing each w i and w j .",
        "If w i is matched by a terminal in r, we select x as the node matching r and spanning exactly w i .",
        "If w i is spanned by a frontier nonterminal in r (meaning that it was translated in a subhypothesis), we select x as the node matching that nonterminal.",
        "We proceed identically for w j and y.",
        "For example, when applying the rule r 4 , the word z?enmey`ang will be represented by the node VV 2, 3 , while t?aol`un and h`ui will be represented by the node NP 0, 2 .",
        "Note that the ordering o h i j cannot be determined in some cases, sometimes a source word does not produce any translation, or the translation of one word is entirely surrounded by the translations of another word.",
        "A weight corresponding to the binary discount feature f o unknown is added to the score for each such case.",
        "The external model P order (o i j |xyz) is implemented as a maximum entropy model.",
        "Features of the model are observed from paths connecting node z with nodes x and y as follows: First, we pick paths z ?",
        "x and z ?",
        "y.",
        "Let z ?",
        "be the last node shared by both paths (the closest common ancestor of x and y).",
        "Then we distinguish three types of path: (1) The common prefix z ?",
        "z ?",
        "(it may have zero length), the left path z ?",
        "x, and the right path z ?",
        "y.",
        "We observe the following features on each path: the syntactic labels of the nodes, the production rules, the spans of nodes, a list of stop words immediately preceding and following the span of the node.",
        "We merge the features observed from different paths z ?",
        "x and z ?",
        "y.",
        "This approach 229 rule word pair order probability a) how 2 was 2 the discussion 0 meeting 1 r 3 (t?aol`un,h`ui) Inorder P order ( o 0,1 |NP 0, 1 ,NP 1, 2 ,NP 0, 2 ) r 4 (t?aol`un,z?enmey`ang) Reorder P order ( o 0,2 |NP 0, 2 ,VV 2, 3 , IP 0, 3 ) (h`ui,z?enmey`ang) Reorder P order ( o 1,2 |NP 0, 2 ,VV 2, 3 , IP 0, 3 ) b) discuss 0 what 2 will 1 happen 1 r 5 (h`ui, z?enmey`ang) Reorder P order ( o 1,2 |VV 1, 2 ,VV 2, 3 , IP 1, 3 ) r 6 (t?aol`un, h`ui) Inorder P order ( o 0,1 |VV 0, 1 , IP 1, 3 , IP 0, 3 ) (t?aol`un, z?enmey`ang Inorder P order ( o 0,2 |VV 0, 1 , IP 1, 3 , IP 0, 3 ) Table 2: Example of reordering scores computed for derivations (a) and (b).",
        "ignores the internal structure of each rule 1 , relying on frontier node annotation.",
        "On the other hand it is still feasible to precompute the reordering probabilities for all combinations of xyz.",
        "4 Experiment In this section we describe the setup of the exper-iment, and present results.",
        "Finally, we propose future directions of research.",
        "4.1 Setup Our baseline is a strong F2S system ( ?",
        "Cmejrek et al., 2013) built on large data with the full set of model features including rule translation prob-abilities, general lexical and provenance translation probabilities, language model, and a variety of sparse features.",
        "We build it as follows.",
        "The training corpus consists of 16 million sentence pairs available within the DARPA BOLT Chinese-English task.",
        "The corpus includes a mix of newswire, broadcast news, webblog data coming from various sources such as LDC, HK Law, HK Hansard and UN data.",
        "The Chinese text is segmented with a segmenter trained on CTB data using conditional random fields (CRF).",
        "Bilingual word alignments are trained and combined from two sources: GIZA (Och, 2003) and maximum entropy word aligner (Ittycheriah and Roukos, 2005).",
        "Language models are trained on the English side of the parallel corpus, and on monolingual corpora, such as Gigaword (LDC2011T07) and Google News, altogether comprising around 10 billion words.",
        "We parse the Chinese part of the training data with a modified version of the Berkeley parser 1 Only to some extent, the rule still has to match the input forest, but the reordering model decides based on the sum of paths observed between the root and frontier nodes.",
        "(Petrov and Klein, 2007), then prune the obtained parse forests for each training sentence with the marginal probability-based inside-outside algorithm to contain only 3n CFG nodes, where n is the sentence length.",
        "We extract tree-to-string translation rules from forest-string sentence pairs using the forest-based GHKM algorithm (Mi and Huang, 2008; Galley et al., 2004).",
        "In the decoding step, we use larger input parse forests than in training, we prune them to contain 10n nodes.",
        "Then we use fast pattern-matching (Zhang et al., 2009) to convert the parse forest into the translation forest.",
        "The proposed reordering model is trained on 100, 000 automatically aligned forest-string sentence pairs from the parallel training data.",
        "These sentences provide 110M reordering events that are used by megam (Daum?e III, 2004) to train the maximum entropy model.",
        "The current implementation of the reordering model requires offline preprocessing of the input hypergraphs to precompute reordering probabilities for applicable triples of nodes (x, y, z).",
        "Since the number of levels in the syntactic trees in T2S rules is limited to 4, we only need to consider such triples, where z is up to 4 levels above x or y.",
        "We tune on 1275 sentences, each with 4 refer-ences, from the LDC2010E30 corpus, initially released under the DARPA GALE program.",
        "We combine two evaluation metrics for tuning and testing: Bleu (Papineni et al., 2002) and Ter (Snover et al., 2006).",
        "Both the baseline and the reordering experiments are optimized with MIRA (Crammer et al., 2006) to maximize (Ter- Bleu)/2.",
        "We test on three different test sets: GALE Web test set from LDC2010E30 corpus (1239 sentences, 4 references), NIST MT08 Newswire 230 System GALE Web MT08 Newswire MT08 Web Ter?Bleu 2 Bleu Ter Ter?Bleu 2 Bleu Ter Ter?Bleu 2 Bleu Ter F2S 8.8 36.1 53.7 5.6 40.6 51.8 12.0 31.3 55.3 +Reordering 8.2 36.4 52.7 4.8 41.7 50.5 11.0 31.7 53.7 ?",
        "-0.6 +0.3 -1.0 -0.8 +1.1 -1.3 -1.0 +0.4 -1.6 Table 3: Results.",
        "portion (691 sentences, 4 references), and NIST MT08 Web portion (666 sentences, 4 references).",
        "4.2 Results Table 3 shows all results of the baseline and the system extended with the forest reordering model.",
        "The (Ter ?",
        "Bleu)/2 score of the baseline system is 12.0 on MT08 Newswire, showing that it is a strong baseline.",
        "The system with the proposed reordering model significantly improves the baseline by 0.6, 0.8, and 1.0 (Ter ?",
        "Bleu)/2 points on GALE Web, MT08 Newswire, and MT08 Web.",
        "The current approach relies on frontier node annotations, ignoring to some extent the internal structure of the T2S rules.",
        "As part of future re-search, we would like to compare this approach with the one that takes into accout the internal structure as well.",
        "5 Conclusion We have presented a novel reordering model for the forest-to-string MT system.",
        "The model deals with the ambiguity of the input forests, but also predicts specifically to the current parse followed by the translation hypothesis.",
        "The reordering probabilities can be precomputed by an offline pro-cess, allowing for efficient scoring in runtime.",
        "The method provides improvement from 0.6 up to 1.0 point measured by (Ter ?",
        "Bleu)/2 metrics.",
        "Acknowledgments We thank Ji?r??",
        "Havelka for proofreading and helpful suggestions.",
        "We would like to acknowledge the support of DARPA under Grant HR0011-12-C-0015 for funding part of this work.",
        "The views, opinions, and/or findings contained in this article are those of the author and should not be interpreted as representing the official views or poli-cies, either expressed or implied, of the DARPA.",
        "References"
      ]
    }
  ]
}
