{
  "info": {
    "authors": [
      "Tomer Cagan",
      "Stefan L. Frank",
      "Reut Tsarfaty"
    ],
    "book": "Joint Workshop on Social Dynamics and Personal Attributes in Social Media",
    "id": "acl-W14-2708",
    "title": "Generating Subjective Responses to Opinionated Articles in Social Media: An Agenda-Driven Architecture and a Turing-Like Test",
    "url": "https://aclweb.org/anthology/W14-2708",
    "year": 2014
  },
  "references": [
    "acl-C10-2028",
    "acl-D11-1054",
    "acl-W09-0613"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the Joint Workshop on Social Dynamics and Personal Attributes in Social Media, pages 58?67, Baltimore, Maryland USA, 27 June 2014. c ?2014 Association for Computational Linguistics Generating Subjective Responses to Opinionated Articles in Social Media: An Agenda-Driven Architecture and a Turing-Like Test Tomer Cagan School of Computer Science The Interdisciplinary Center Herzeliya, Israel cagan.tomer@idc.ac.il Stefan L. Frank Centre for Language Studies Radboud University Nijmegen, The Netherlands s.frank@let.ru.nl Reut Tsarfaty Mathematics and Computer Science Weizmann Institute of Science Rehovot, Israel tsarfaty@weizmann.ac.il",
        "Abstract",
        "Natural language traffic in social media (blogs, microblogs, talkbacks) enjoys vast monitoring and analysis efforts.",
        "How-ever, the question whether computer systems can generate such content in order to effectively interact with humans has been only sparsely attended to.",
        "This paper presents an architecture for generating subjective responses to opinionated articles based on users?",
        "agenda, docu-ments?",
        "topics, sentiments and a knowledge graph.",
        "We present an empirical evaluation method for quantifying the human-likeness and relevance of the generated responses.",
        "We show that responses generated using world knowledge in the input are regarded as more human-like than those that rely on topic, sentiment and agenda only, whereas the use of world knowledge does not affect perceived relevance."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Digital media, user-generated content and social networks enable effective human interaction; so much so that much of our day-to-day interaction is conducted online (Viswanath et al., 2009).",
        "Interaction in social media fundamentally changes the way businesses and consumers behave (Qual- man, 2012), can be instrumental to the success of individuals and businesses (Haenlein and Ka-plan, 2009), and even affects the stability of political regimes (Howard et al., 2011; Lamer, 2012).",
        "These facts force organizations (businesses, gov-ernments, and non-profit organizations) to be constantly involved in the monitoring of, and the interaction with, human agents in digital environments (Langheinrich and Karjoth, 2011).",
        "Automatic analysis of user-generated online content benefits from extensive research and commercial opportunities.",
        "In natural language pro-cessing, there is ample research on the analysis of subjectivity and sentiment of content in social media.",
        "The development of tools for sentiment analysis (Davidov et al., 2010), mood aggregation (Agichtein et al., 2008), opinion mining (Mishne, 2006), and many more, now enjoys wide interest and exposure, as is also evident by the many workshops and dedicated tracks at ACL venues.",
        "1 Methods are also developed for the analysis of political texts (O?Connor et al., 2010; O?Connor et al., 2013) and for text-driven forecasting based on these data (Yano et al., 2009).",
        "A related strand of research uses computational methods to find out what kind of published utterances are influ-ential, and how they affect linguistic communities (Danescu-Niculescu-Mizil et al., 2009).",
        "Such work complements, and contributes to, studies from sociology and sociolinguistics that aim to delineate the process of generating meaningful responses (e.g., Amabile (1981)).",
        "In contrast to these analysis efforts, the topic of generating responses to content in social media is only sparsely explored.",
        "Commercially, there is movement towards online response automation (Owyang, 2012; Mah, 2012).",
        "2 Research on user interfaces is trying to move away from script-based interaction towards the development of chat bots that attempt natural human-like interaction (Mori et al., 2003; Feng et al., 2006).",
        "However, these chat bots are typically designed to provide an automated one-size-fits-all type of interaction.",
        "A study by Ritter et al. (2011) addresses the generation of responses to natural language tweets in a data-driven setup.",
        "It applies a machine-translation approach to response gener-ation, where moods and sentiments already ex-1 E.g., the ACL series LASM http://tinyurl.com/ ludyrkz; WASSA http://tinyurl.com/kjjdhax.",
        "2 There is a general debate on the efficiency of automated tools (Nall, 2013) and whether such tools are desirable in social media (McConnell (2012); responses to Owyang (2012)).",
        "58 pressed in the past are replicated or reused.",
        "A recent study by Hasegawa et al. (2013) modifies Rit-ter's approach to produce responses that elicit an emotion from the addressee.",
        "Yet, these responses do not target particular topics and are not driven by a user agenda.",
        "The present paper addresses the problem of generating novel, subjective, responses to online opinionated articles.",
        "We formally define the document-to-response mapping problem and suggest an end-to-end system to solve it.",
        "Our system integrates a range of NLP and NLG technologies (including topic models, sentiment analysis, and the integration of a knowledge graph) to design a flexible generation mechanism that allows us to vary the information in the input to the generation procedure.",
        "We then use a Turing-inspired test to study the different factors that contribute to the perceived human-likeness and relevance of the generated responses, and show how the perception of responses depends on external knowledge and the expressed sentiment.",
        "The remainder of this paper is organized as follows.",
        "The next section presents our proposal: Section 2.1 describes our approach, Section 2.2 formalizes the proposal, and Section 2.3 presents our end-to-end architecture.",
        "This is followed by our evaluation method and empirical results in Section 3.",
        "We discuss related and future work in Section 4, and in Section 5 we conclude.",
        "2 The Proposal: Generating Subjective Responses 2.1 Our Approach Natural language is, above all, a communicative device that we employ to achieve certain goals.",
        "In social media, the driving force behind generating responses is a responder's disposition towards some topic.",
        "This topic could be a political campaign or a candidate, a product, or some abstract idea, which the responder has a motive to promote.",
        "Let us call this goal our user's agenda.",
        "User response generation, like any other natural language utterance generation, is triggered by a certain event that is related to the communicative goal.",
        "In a social media setting, this event is often a new online document.",
        "The document and the agenda thus form the input to our generation system.",
        "Each document and each agenda contain (possibly many) topics, each of which is associated with a (positive or negative) sentiment.",
        "Document sentiments are attributed to the author, whereas agenda sentiments are attributed to the user (henceforth: the responder).",
        "For each non-empty intersection of the topics in the document and in the agenda, our response-generation system aims to generate utterances that are fluent, human-like, and effectively engage readers.",
        "The generation is based on three assump-tions, roughly reflecting the Gricean maxims of cooperative interaction (Grice, 1967).",
        "Online user responses should then be: ?",
        "Economic (Maxim of Quantity): Responses are brief and concise; ?",
        "Relevant (Maxim of Relation): Responses directly address the documents?",
        "content.",
        "?",
        "Opinionated (Maxim of Quality): Responses express responders beliefs, sentiments, or dispositions towards the topic(s).",
        "2.2 The Formal Model Let D be a set of documents and let A be a set of user agendas as we define shortly.",
        "Let S be a set of English sentences over a finite vocabulary S = ?",
        "?",
        ".",
        "Our system implements a function that maps each ?document, agenda?",
        "pair to a natural language response sentence s ?",
        "S. f response : D ?A?",
        "S Response generation takes place in two phases, roughly corresponding to macro and micro planning in Reiter and Dale (1997): ?",
        "Macro Planning (below, the analysis phase): What are we going to talk about?",
        "?",
        "Micro Planning (below, the generation phase): How are we going to say it?",
        "The analysis function p : D ?",
        "C maps a document to a subjective representation of its content.",
        "3 The generation function g : C ?",
        "A ?",
        "S intersects the content elements in the document and in the user agenda, and generates a response based on the content of the intersection.",
        "All in all, our system implements a composition of the analysis and the generation functions: f response (d, a) = g(p(d), a) = s 3 A content element may conceivably encompass a topic, its sentiment, its objectivity, its evidentiality, its perceived truthfulness, and so on.",
        "In this paper we focus on topic and sentiment, and leave the rest for future research.",
        "59 Each content element c ?",
        "C or an agenda item a ?",
        "A is composed of a topic t associated with a sentiment value sentiment t ?",
        "[?n..n] that signifies the (negative or positive) disposition of the document's author (if c ?",
        "C) or the user's agenda (if a ?",
        "A) towards the topic.",
        "We assume here that a topic is simply a bag of words from our vocabulary ?.",
        "Thus, we have the following: A,C ?",
        "P(?)?",
        "[?n..n] Our generation component accepts the result of the intersection as input and relies on a template-based grammar and a set of functions for generating referring expressions in order to construct the output.",
        "To make the responses economic, we limit the content of a response to one statement about the document or its author, followed by a statement on the relevant topic.",
        "To make the response relevant, the templates that generate the response make use of topics in the intersection of the document and the agenda.",
        "To make the response opin-ionated, the sentiment of the response depends on the (mis)match between the sentiment values for the topic in the document and in the agenda.",
        "Con-cretely, the response is positive if the sentiments for the topic in the document and agenda are the same (both positive or both negative) and it is negative otherwise.",
        "We suggest two variants of the generation function g. The basic variant implements the baseline function defined above: g base (c, a) = s c ?",
        "C, a ?",
        "A, s ?",
        "?",
        "?",
        "For the other variant we define a knowledge base (KB) as a directed graph in which words w ?",
        "?",
        "from the topic models correspond to nodes in the graph, and relations r ?",
        "R between the words are predicates that hold in the real world.",
        "Our second generation function now becomes: g kb (c, a,KB) = s KB ?",
        "{(w i , r, w j )|w i , w j ?",
        "?, r ?",
        "R} with c ?",
        "C, a ?",
        "A, s ?",
        "?",
        "?",
        "as defined in g base above.",
        "2.3 The Architecture The system architecture from a bird's eye view is presented in Figure 1.",
        "In a nutshell, a document enters the analysis phase, where topic inference and sentiment scoring take place, resulting in ?topic, sentiment?-pairs.",
        "During the subsequent generation phase, these are intersected with the ?topic, sentiment?-pairs in the user agenda.",
        "This intersection, possibly augmented with a knowledge graph, forms the input for a template-based generation component.",
        "Analysis phase For the task of inferring the topics of the document we use topic modeling: a probabilistic generative modeling technique that allows for the discovery of abstract topics over a large body of documents (Papadimitriou et al., 1998; Hofmann, 1999; Blei et al., 2003).",
        "Specif-ically, we use topic modeling based on Latent Dirichlet Allocation (LDA) (Blei et al., 2003; Blei, 2012).",
        "Given a new document and a trained model, the inference method provides a weighted mix of topics for that document, where each topic is represented as a vector containing keywords associated with probabilities.",
        "For training the topic model and inferring the topics in new documents we use Gensim (Rehurek and Sojka, 2010), a fast and easy-to-use implementation of LDA.",
        "Next, we wish to infer the sentiment that is expressed in the text with relation to the topic(s) identified in the document.",
        "We use the seman-tic/lexical method as implemented in Kathuria (2012).",
        "We rely on a WSD sentiment classifier that uses the SentiWordNet (Baccianella et al., 2010) database and calculates the positivity and negativity scores of a document based on the positivity and negativity of individual words.",
        "The result of the sentiment analysis is a pair of values, indicating the positive and negative sentiments of the document-based scores for individual words.",
        "We use the larger of these two values as the sentiment value for the whole document.",
        "4 Generation phase Our generation function first intersects the set of topics in the document and the set of topics in the agenda in order to discover relevant topics to which the system would generate responses.",
        "A response may in principle integrate content from a range of topics in the topic model distribution, but, for the sake of generating concise responses, in the current implementation we focus on the single most prevalent, topic.",
        "We pick the highest scoring word of the highest scoring topic, and intersect it with topics in the agenda.",
        "The system generates a response based on the identified 4 Clearly, this is a simplifying assumption.",
        "We discuss this assumption further in Section 4.",
        "60 Figure 1: The system architecture from a bird's eye view.",
        "Components on gray background are executed offline.",
        "topic, the sentiment for the topic in the document, and the sentiment for that topic in the user agenda.",
        "The generation component relies on a template-based approach similar to Reiter and Dale (1997) and Van Deemter et al. (2005).",
        "Templates are essentially subtrees with leaves that are place-holders for other templates or for functions generating referring expressions (Theune et al., 2001).",
        "These functions receive (relevant parts of) the input and emit the sequence of fine-grained part-of-speech (POS) tags that realizes the relevant referring expression.",
        "The POS tags in the resulting sequences are ultimately place holders for words from a lexicon ?.",
        "In order to generate a variety of expression forms ?",
        "nouns, adjectives and verbs ?",
        "these items are selected randomly from a fine-grained lexicon we defined.",
        "The sentiment (posi- tive or negative) is expressed in a similar fashion via templates and randomly selected lexical entries for the POS slots, after calculating the overall sentiment for the intersection as stated above.",
        "Our generation implementation is based on Sim-pleNLG (Gatt and Reiter, 2009) which is a surface realizer API that allows us to create the desired templates and functions, and aggregates content into coherent sentences.",
        "The templates and functions that we defined are depicted in Figure 2.",
        "In addition, we handcrafted a simple knowledge graph (termed here KB) containing the words in a set of pre-defined user agendas.",
        "Table 1 shows a snippet of the constructed knowledge graph.",
        "The knowledge graph can be used to expand the response in the following fashion: The topic of the response is a node in the KB.",
        "We randomly select one of its outgoing edges for creating a related Source Relation Target Apple CompetesWith Samsung Apple CompetesWith Google Apple Creates iOS Table 1: A knowledge graph snippet.",
        "statement that has the target node of this relation as its subject.",
        "The related sentence generation uses the same template-based mechanism as before.",
        "In principle, this process may be repeated any number of times and express larger parts of the KB.",
        "Here we only add one single knowledge-base relation per response, to keep the responses concise.",
        "3 Evaluation We set out to evaluate how computer-generated responses compare to human responses in their perceived human-likeness and relevance.",
        "More in particular, we compare different system variants in order to investigate what makes responses seem more human-like or relevant.",
        "3.1 Materials Our empirical evaluation is restricted to topics related to mobile telephones, specifically Apple's iPhone and devices based on the Android operating system.",
        "We collected 300 articles from leading technology sites in the domain to train the topic models on, settling on 10 topics models.",
        "Next, we generated a set of user agendas referring to the same 10 topics.",
        "Each agenda is represented by a single keyword from a topic model distribution and a sentiment value sentiment t ?",
        "{?8,?4, 0, 4, 8}.",
        "Finally, we selected 10 new articles from similar sites and generated a pool of 61 Sresponse NP I VP V?",
        "belief SBAR that (S response ) S response S article S item (S relation ) S item NP?",
        "itemRef VP?",
        "senti i S article NP?",
        "articleRef VP?",
        "senti a S relation NP?",
        "relationRef VP?",
        "senti r articleRef ?",
        "ExpressArticle(...) itemRef ?",
        "ExpressItem(...) relationRef ?",
        "ExpressRelation(...) sentiment a ?",
        "ExpressArticleSentiment(...) sentiment i ?",
        "ExpressItemSentiment(...) sentiment r ?",
        "ExpressRelationSentiment(...) belief ?",
        "ExpressBelief(...) Figure 2: Template-based response generation.",
        "The templates are on the left.",
        "The Express* functions on the right uses regular expressions over the arguments and vocabulary items from a closed lexicon.",
        "1000 responses for each, comprising 100 unique responses for each combination of sentiment t and system variant (i.e., with or without a knowledge base).",
        "Table 2 presents an example response for each such combination.",
        "In addition, we randomly collected 5 to 10 real, short or medium-length, online human responses for each article.",
        "3.2 Surveys We collected evaluation data via two online surveys on Amazon Mechanical Turk (www.",
        "mturk.com).",
        "In Survey 1, participants judged whether responses to articles were written by human or computer, akin to (a simplified version of) the Turing test (Turing, 1950).",
        "In Survey 2, responses were rated on their relevance to the ar-ticle, in effect testing whether they abide by the Gricean Maxim of Relation.",
        "This is comparable to the study by Ritter et al. (2011) where people judged which of two responses was ?best?.",
        "Each survey comprises 10 randomly ordered tri-als, corresponding to the 10 selected articles.",
        "First, the participant was presented with a snippet from the article.",
        "When clicking a button, the text was removed and its presentation duration recorded.",
        "Next, a multiple-choice question asked about the snippet's topic.",
        "Data on a trial was discarded from analysis if the participant answered incorrectly or if the snippet was presented for less than 10 msec per character; we took these to be cases where the snippet was not properly read.",
        "Next, the participant was shown a randomly ordered list of responses to the article.",
        "In Survey 1, four responses were presented for each article: three randomly selected from the pool of human responses to that article and one generated by our system.",
        "The task was to categorize each response on a 7-point scale with labels ?Certainly human/computer?, ?Probably hu-man/computer?, ?Maybe human/computer?",
        "and ?Unsure?.",
        "In Survey 2, five responses were pre-sented: three human responses and two computer-generated.",
        "The task was to rate the responses?",
        "relevance on a 7-point scale labeled ?Completely (not) relevant?, ?Mostly (not) relevant?, ?Some- what (not) relevant?, and ?Unsure?.",
        "As a control condition, one of the human responses and one of the computer responses were actually taken from another article than the one just presented.",
        "In both surveys, the computer-generated responses presented to each participant were balanced across sentiment levels and generation functions (g base and g kb ).",
        "After completing the 10 trials, participants provided basic demographic information, including native language.",
        "Data from non-native English speakers was discarded.",
        "Surveys 1 and 2 were completed by 62 and 60 native speakers, respectively.",
        "3.3 Analysis and Results Survey 1: Computer-Likeness Rating.",
        "Table 3 shows the mean ?computer-likeness?-ratings from 1 (?Certainly human?)",
        "to 7 (?Certainly computer?)",
        "for each response category.",
        "Clearly, the human responses are rated as more human-like than the computer-generated ones: our model did not generally mislead the participants.",
        "This may be due to the template-based response structure: over the course of the survey, human raters are likely to notice this structure and infer that such responses are computer-generated.",
        "To investigate whether such learning indeed occurs, a linear mixed-effects model was fitted, with predictor variables IS COMP (+1:computer-generated, ?1:human re-sponses), POS (position of the trial in the survey, 0 to 9), and the interaction between the two.",
        "Table 4 62 Sent.",
        "KB Response ?8 No Android is horrendous so I think that the writer is completely correct!!!",
        "Yes Apple is horrendous so I feel that the author is not really right!!!",
        "iOS is horrendous as well.",
        "?4 No I think that the writer is mistaken because apple actually is unexceptional.",
        "Yes I think that the author is wrong because Nokia is mediocre.",
        "Apple on the other hand is pretty good ... 0 No The text is accurate.",
        "Apple is okay.",
        "Yes Galaxy is okay so I think that the content is accurate.",
        "All-in-all samsung makes fantastic gadgets.",
        "4 No Android is pretty good so I feel that the author is right.",
        "Yes Nokia is nice.",
        "The article is precise.",
        "Samsung on the other hand is fabulous... 8 No Galaxy is great!!!",
        "The text is completely precise.",
        "Yes Galaxy is awesome!!!",
        "The author is not completely correct.",
        "In fact I think that samsung makes awesome products.",
        "Table 2: Responses generated by the system with or without a knowledge-base (KB), with different sentiment levels.",
        "Response Type Mean and CI Human 3.33 ?",
        "0.08 Computer (all) 4.49 ?",
        "0.15 Computer (?KB) 4.66 ?",
        "0.20 Computer (+KB) 4.32 ?",
        "0.22 Table 3: Mean and 95% confidence interval of computer-likeness rating per response category.",
        "?KB indicates whether g base or g kb was used.",
        "Factor b t P (b < 0) (intercept) 3.590 IS COMP 0.193 2.11 0.015 POS 0.069 4.76 0.000 IS COMP ?",
        "POS 0.085 6.27 0.000 Table 4: Computer-likeness rating regression re-sults, comparing human to computer responses.",
        "presents, for each factor in the regression analysis, the coefficient b and its t-statistic.",
        "The coefficient equals the increase in computer-likeness rating for each unit increase in the predictor variable.",
        "The t-statistic is indicative of how much variance in the ratings is accounted for by the predictor.",
        "We also obtained a probability distribution over each coefficient by Markov Chain Monte Carlo sampling using the R package lme4 version 0.99 (Bates, 2005).",
        "From each coefficient's distribution, we estimate the posterior probability that b is negative, which quantifies the reliability of the effect.",
        "The positive b value for POS shows that responses drift towards the ?computer?-end of the scale.",
        "More importantly, a positive interaction with IS COMP indicates that the difference between human and computer responses becomes more noticeable as the survey progresses ?",
        "the participants did learn to identify computer-generated responses.",
        "However, the positive coefficient for IS COMP means that even at the very first trial, computer responses are considered to be more computer-like than human responses.",
        "Factors Affecting Human-Likeness.",
        "Our finding that the identifiability of computer-generated responses cannot be fully attributed to their repet-itiveness, raises the question: What makes a such a response more human-like?",
        "The results provide several insights into this matter.",
        "First, the mean scores in Table 3 suggest that including a knowledge base increases the responses?",
        "human-likeness.",
        "To further investigate this, we performed a separate regression analysis, using only the data on computer-generated responses.",
        "This analysis also included predictors KB (+1: knowledge base included, ?1: otherwise), SENT (sentiment t , from ?8 to +8), absolute value of SENT, and the interaction between KB and POS.",
        "As can be seen in Table 5, there is no reliable interaction between KB and POS: the effect of including the KB on the human-likeness of responses remained constant over the course of the survey.",
        "Furthermore, we see evidence that responses with a more positive sentiment are considered more computer-like.",
        "The (only weakly reliable) negative effect of the absolute value of sentiment suggests that more extreme sentiments are considered more human-like.",
        "Apparently, people count on computer responses to be mildly positive, whereas human responses are expected to be more extreme, and extremely negative in particular.",
        "Survey 2: Relevance Rating.",
        "The mean relevance scores in Table 6 reveal that a response is rated as more relevant to a snippet if it was actually a response to that snippet, rather than to a different snippet.",
        "This reinforces our design choice 63 Factor b t P (b < 0) (intercept) 4.022 KB ?0.240 ?2.13 0.987 POS 0.144 5.82 0.000 SENT 0.035 2.98 0.002 abs(SENT) ?0.041 ?1.97 0.967 KB ?",
        "POS 0.023 1.03 0.121 Table 5: Computer-likeness rating regression re-sults, comparing systems with and without KB.",
        "Response Type Source Mean and CI Human this 4.85 ?",
        "0.11 other 3.56 ?",
        "0.18 Computer (all) this 4.52 ?",
        "0.16 other 2.52 ?",
        "0.15 Computer (?KB) this 4.53 ?",
        "0.23 other 2.46 ?",
        "0.21 Computer (+KB) this 4.51 ?",
        "0.23 other 2.58 ?",
        "0.22 Table 6: Mean and 95% confidence interval of relevance rating per response category.",
        "?Source?",
        "indicates whether the response is from the presented text snippet or a random other snippet.",
        "?KB indicates whether g base or g kb was used.",
        "Factor b t P (b < 0) (intercept) 3.861 IS COMP ?0.339 ?7.10 1.000 SOURCE 0.824 16.80 0.000 IS COMP ?",
        "PRES 0.179 5.03 0.000 Table 7: Relevance ratings regression results, comparing human to computer responses.",
        "Factor b t P (b < 0) (intercept) 3.603 KB 0.026 0.49 0.322 SOURCE 1.003 15.90 0.000 SENT 0.023 1.94 0.029 abs(SENT) ?0.017 ?0.93 0.819 KB ?",
        "SOURCE ?0.032 ?0.61 0.731 Table 8: Relevance ratings regression results, comparing systems with and without KB.",
        "to include input items referring specifically to the topic and sentiment of the author.",
        "However, human responses are considered more relevant than the computer-generated ones.",
        "This is confirmed by a reliably negative regression coefficient for IS COMP (see regression results in Table 7).",
        "The analysis included the binary factor SOURCE (+1 if the response came from the presented snip-pet, ?1 if it came from a random article).",
        "We see a positive interaction between SOURCE and IS COMP, indicating that presenting a response from a random article is more detrimental to relevance of computer-generated responses than that of the human responses.",
        "This is not surprising, as the computer-generated responses (unlike the human responses) always includes the article's topic.",
        "When analyzing only data on computer-generated responses, and including predictors for agenda sentiment and for presence of the knowledge base, we see that including the KB does not affect response relevance (see Table 8).",
        "Also, there is no interaction between KB and SOURCE, that is, the effect of presenting a response from a different article does not differ between the models with and without the knowledge base.",
        "Possibly, responses are considered as more relevant if they have more positive sentiment, but the evidence for this is fairly weak.",
        "4 Related and Future Work In contrast to the vast amount of research on sentiment and topic analysis, as well as generation tasks in which the input is artificial or pre-defined, our system implements a full end-to-end cycle from natural language analysis to natural language generation with applications in social media and automated interaction in real-world settings.",
        "The only two other studies on response generation in social media we know of are Ritter et al. (2011) and Hasegawa et al. (2013).",
        "Ritter's and Hasegawa's approaches differ from ours in their objective and their approach to generation.",
        "Specif-ically, Ritter's approach is based on machine trans-lation, creating responses by directly re-using previous content.",
        "Their data-driven approach generates relevant, but not opinionated responses.",
        "In addition, both Ritter's and Hasegawa's systems respond to tweets, while our system analyzes and responds to complete articles.",
        "Hasegawa's approach is closer to ours in that it generates responses that are intended to elicit a specific emotion from the addressee.",
        "However, it still differs considerably in settings (dialogues versus online posting) and in the goal itself (eliciting emotion versus expressing opinion).",
        "Thus, we see these studies as complementary to ours in the realm of response generation in social media.",
        "64 A natural contact point of our work with existing work in social media analysis is the investigation of how a change in the implementation of individual components (e.g., topic inference or sentiment scoring) would affect the result of the overall generation.",
        "In particular, it would be interesting to test whether a novel mechanism for joint inference of topic/sentiment distributions could lead to improvement in the human-likeness of the generated responses.",
        "The syntactic and semantic means of expression that we use are based on bare bone templates and fine-grained POS tags (Theune et al., 2001).",
        "These may potentially be expanded with different ways to express subject/object relations, relations between phrases, polarity of sentences, and so on.",
        "Additional approaches to generation can factor in such aspects, e.g., the template-based methods in Becker (2002) and Narayan et al. (2011), or grammar based methods, as in DeVault et al. (2008).",
        "Using more sophisticated generation methods with a rich grammatical backbone may combat the sensitivity to computer-generated response patterns as acquired by our human raters over time.",
        "Furthermore, our result concerning the human-likeness of g kb clearly demonstrates that semantic knowledge must be brought in to support better, and more human-like, response generation.",
        "Large-scale knowledge graphs such as Freebase support many semantic tasks (Jacobs, 1985), and can be used for providing richer context for automatically generating human-like responses.",
        "From a theoretical viewpoint, the system will clearly benefit from rigorous analysis of human interaction in online media.",
        "Responses to user-generated content on the Internet share some linguistic characteristics in structure, length and manner of expression.",
        "Studying these features theoretically and then examining them empirically using a Turing-like evaluation as presented here can take us a big step in the direction of better gen-eration, and also better understanding of the processes underlying human response generation.",
        "This latter understanding may be complemented with insights into the causes, motivations and intricacies of human interaction in such environ-ments, as studied by sociologists and psychologists.",
        "In particular, our preliminary interaction with colleagues from communication studies suggests that the present endeavor nicely complements that of ?persuasive computing?",
        "(Fogg, 1998; Fogg, 2002), and we hope that this collaboration will lead to valuable synergies.",
        "Finally, bridging the gap between the technical and the theoretical, it would be fascinating to test the responses in the context for which they are generated ?",
        "social media.",
        "Generated texts may be posted as a response to the original article, or shared with a link of the original article, followed by measuring the responses to, and shares of, that response.",
        "Such real-world evaluation could indicate that generated responses are indeed believable and engaging, and may better simulate a Turing-like test in which machine-generated responses cannot be distinguished from human responses.",
        "5 Conclusion We presented a system for generating responses that are directly tied to responders?",
        "agendas and document content.",
        "To the best of our knowledge, this is the first system to generate subjective responses directly reflecting users?",
        "agendas.",
        "Our response generation architecture provides an easy-to-use and easy-to-extend solution encompassing a range of NLP and NLG techniques.",
        "We evaluated both the human-likeness and the relevance of the generated content, thereby empirically quantifying the efficacy of computer-generated responses compared head-to-head against human responses.",
        "Generating concise, relevant, and opinionated responses that are also human-like is hard ?",
        "it requires the integration of text-understanding and sentiment analysis, and it is also contingent on the expression of the agents?",
        "prior knowledge, reasons and motives.",
        "We suggest our architecture and evaluation method as a baseline for future research on generated content that would effectively pass a Turing-like test, and successfully convince humans of the authenticity of generated responses.",
        "5 Acknowledgments We thank Yoav Francis for his contribution in the early stages of this research.",
        "We further thank our anonymous reviewers for their insightful comments on an earlier draft.",
        "5 Our code, training data, experimental data (computer and human responses) and analysis scripts are publicly available via www.tsarfaty.com/nlg-sd/.",
        "65 References"
      ]
    }
  ]
}
