{
  "info": {
    "authors": [
      "Bruno Wueest",
      "Gerold Schneider",
      "Michael Amsler"
    ],
    "book": "LTCSS",
    "id": "acl-W14-2512",
    "title": "Measuring the Public Accountability of New Modes of Governance",
    "url": "https://aclweb.org/anthology/W14-2512",
    "year": 2014
  },
  "references": [
    "acl-W11-1912"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the ACL 2014 Workshop on Language Technologies and Computational Social Science, pages 38?43, Baltimore, Maryland, USA, June 26, 2014. c?2014 Association for Computational Linguistics Measuring the Public Accountability of New Modes of Governance Bruno Wueest Institute of Political Science University of Zurich wueest@ipz.uzh.ch Gerold Schneider Institute of Computational Linguistics University of Zurich gschneid@ifi.uzh.ch Michael Amsler Institute of Computational Linguistics University of Zurich mamsler@ifi.uzh.ch",
        "Abstract",
        "We present an encompassing research endeavour on the public accountability of new modes of governance in Europe.",
        "The aim of this project is to measure the salience, tonality and framing of regulatory bodies and public interest organisations in newspaper coverage and parliamentary debates over the last 15 years.",
        "In order to achieve this, we use language technology which is still underused in political science text analyses.",
        "Institution-ally, the project has emerged from a collaboration between a computational linguistics and a political science department."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "The institutionalization of the regulatory state in Europe entailed new modes of governance such as transgovernmental networks between officials and non-state authorities or the involvement of private corporations (e.g. rating agencies) in the policy processes (Gilardi, 2005; Abbott and Snidal, 2008).",
        "At the subnational level, the emergence of regulatory agencies and public-private partnerships spreading across metropolitan regions have come to challenge traditional state institutions (Kelleher and Lowery, 2009).",
        "Since these new modes of governance organize political authority along functional rather than territorial lines, many observers are worried about their potential ?demo- cratic deficit?",
        "(Dahl, 1994; Follesdal and Hix, 2006; Keohane et al., 2009).",
        "In response to these considerations, scholars usually point to the administrative and professional accountability mechanisms of governmental and parliamentary oversight as well as judicial review (Majone, 2000; Lodge, 2002; Busuioc, 2009).",
        "Other, more informal accountability mechanisms such as media coverage and public involvement, in contrast, have been either neglected, dismissed as scarcely relevant or dealt with only in comparative case studies (Maggetti, 2012).",
        "This is surprising, given that public communication plays an ever more decisive role for setting the political agenda and establishing transparency of policy making in modern democratic societies (Walgrave et al., 2008; Koop-mans and Statham, 2010; M?uller, forthcoming).",
        "With respect to the public accountability of new modes of governance, the media can thus be expected to constitute a key intermediary variable for the progressive formalization and institutionalization of voluntary private rules through reputational mechanisms (Gentzkow and Shapiro, 2006).",
        "This paper is structured as follows.",
        "In section 2 we present our core research question, in section 3 we summarize our research methods, and in section 4 we briefly present a pilot study.",
        "2 Research Question It is important to ask whether and to what extent public communication systematically exposes new modes of governance to public accountability.",
        "More precisely, the project's ambition is to determine how much attention the media and parliamentary debates dedicate to survey the regulatory bodies and public interest organizations under scrutiny, whether they watch these actors crit-ically, and whether they report on these actors in terms of frames which are conductive to their public accountability, e.g. norm and rule compliance, transparency, efficiency or responsiveness to public demands.",
        "38 3 Methodology To answer these questions, the project implements approaches developed in computational linguistics and web automation in order to collect and classify big text data at the European level (European and internationally relevant newspapers), the domestic level in four countries (newspapers in the U.K., France, Germany and Switzerland), and the subnational level in eight metropolitan areas (parlia- mentary debates and newspapers relevant for Lon-don, Birmingham, Paris, Lyon, Berlin, Stuttgart, Berne and Zurich).",
        "The project (1) starts from an encompassing gazetteer of actors involved in the new modes of governance in the areas and countries mentioned above, (2) uses application programming interfaces (API) and webscraping techniques to establish a large representative text corpus in English, French and German, (3) calculates the salience of the actors of interest by means of named entity recognition, coreference resolution and keyword detection, (4) applies sentiment detection and opinion mining to estimate the tonality of these actors, (5) uses relation mining methods (Schneider et al., 2009) to detect interactions and types of interactions between the entities of inter-est, and (6) intends to automate the recognition of media frames used in the context of these actors by identifying hidden topics via latent semantic analysis (LSA) (McFarlane, 2011; Odijk et al., 2014).",
        "As points 3-6 provide key research challenges, we will discuss them in more detail in the following subsections.",
        "Before that, we present an overview of our current pipeline.",
        "3.1 Pipeline The pipeline consists of several components chained together in a modular way (see Figure 1).",
        "This provides us with the possibility to exchange components on demand.",
        "First, data acquisition is done via the use of an API to the media content database (e.g. LexisNexis).",
        "This allows us to fully automate the retrieval and storage of the media documents.",
        "At a second stage, we employ a full natural language processing chain which includes morphological analysis, tagging, lemmatizing, and dependency parsing.",
        "On this basis, we then conduct several more layers of analysis.",
        "On the one hand, we use the result of the preprocessing chain for coreference resolution and sentiment analysis as well as relation mining.",
        "On the other hand, we also integrate further tools such as named entity recognition and LSA which can be applied on the full text or corpus level.",
        "The thus enriched data is then aggregated and stored in a database.",
        "Figure 1: Scheme of pipeline Finally, the actual data analysis can be conducted by querying the database, based on the already available information or an adapted setting suitable to the requirements of the media content analysis.",
        "3.2 Salience, Named Entities and Coreferences One of the main metrics of interest is the salience of the entities.",
        "Therefore, a reliable detection of the entities in the articles is a pivotal task.",
        "Furthermore it is crucial to find those occurences of entities in the text which are not directly detectable by using a gazetter, since journalists often use references to the entities in the same article.",
        "Hence, we will integrate coreference resolution (Klenner and Tuggener, 2011) into our pipeline.",
        "In addi-tion, we will also create a resource which will allow us to integrate external information on the entities, thus increasing the performance of the coreference resolution.",
        "For example, politicians are often mentioned with their name, their function (e.g. National Council), their party affiliation, their age, or a combination of such attributes.",
        "Together with the metadata of the media documents (media source, and time of publication) it is then possible to calculate these attributes and possible combinations and include them in the coreference resolution module in order to increase both precision and recall.",
        "3.3 From Sentiment Detection to Opinion Mining Sentiment analysis and opinion mining are research areas in computational linguistics which have received growing attention in the last decade (Pang and Lee, 2008; Liu and Zhang, 2012).",
        "In order to detect the tonality in the media coverage to-39 wards the actors under scrutiny, we use a lexicon-based compositional sentiment analysis system component similar to Taboada et al. (2011).",
        "How-ever, our approach is additionally based on the output of the full dependency parse and the results of the named entity recognition and coreference resolution.",
        "This will provide us with the ability to perform target-specific tonality calculation.",
        "In addition to the mere calculation of sentiment or tonality over a whole article, our task includes the detection of sentiment on the sentence level and in respect to certain targets (i.e. entities).",
        "An additional challenge is to detect quotations including their sources and targets, since they may reveal the actors?",
        "most opinionated stances towards each other (Balahur et al., 2009).",
        "From this perspec-tive, opinion mining can be seen as a sister discipline to sentiment analysis, which we can employ to map utterances of actors towards other actors, or towards specific political topics, stepping from classical sentiment detection to relation and opinion mining.",
        "We will focus on high precision assignment of the source of the statement.",
        "It is important to note that the detection and determination of sentiment and opinion in media documents is a challenging endeavour since it differs in many ways from the task of previous research which has mostly considered reviews and other clearly opinionated text (Balahur et al., 2010).",
        "It will therefore also be necessary to adapt the sentiment analysis system to the domain of (political) news text and to use advanced techniques to match fine-grained targets and the entity to which they belong.",
        "For example, it should be possible to assign statements of a spokesperson to the institution he or she represents.",
        "However, we can build on existing research, since such a mapping can be considered similar to aspect-based opinion mining (Zhang and Liu, 2014).",
        "3.4 Relation Mining In well-resourced areas such as biomedical relation mining, the detection of interactions between entities such as genes and proteins or drugs and diseases is an established research focus.",
        "Training resources are abundant, and several systems have been evaluated in competitive challenges.",
        "Political science texts are typically less richly annotated.",
        "However, it is also possible to learn patterns expressing interactions from lean document-level annotation, by using distance-learning methods.",
        "If a document is annotated as containing the key actors A and B, then all syntactic connections found in that document between A and B can be assumed to provide patterns typically expressing interactions.",
        "Such approaches have been used in biomedicine (Rinaldi et al., 2012) and can be ported to the political domain.",
        "3.5 Media Frames Associative Framing (van Atteveldt et al., 2008) is based on measuring co-occurrence in large context windows.",
        "His suggested association measure is also different, he uses the conditional probability of seeing concept 1 (c1) in the context of concept 2 (c2), p(c1|c2).",
        "Sahlgren (2006) describes how short context windows tend to detect syntag-matic relations like collocations, while large context windows detect paradigmatic relations.",
        "In van Atteveldt et al. (2008), concepts are basically key-words, while we will use vector space models, which allow one to automatically detect concepts.",
        "In vector space model approaches, each word is defined by the sum of its contexts, and words which have very similar contexts are clustered into a concept.",
        "There are many variants of this ap-proach: in singular-value decomposition (SVD) or latent semantic analysis (LSA) approaches (Deer- wester et al., 1990), the original very high dimensional space is reduced to fewer dimensions.",
        "In Word Space (Sch?utze, 1998) each word is defined recursively, by the contexts of its contexts, using an observation window of up to 100 words before and after the target word.",
        "Rothenh?ausler and Sch?utze (2009) have shown that approaches using syntactic relations instead of large context windows can even perform better.",
        "In the political communication literature, the definition of frames is contested.",
        "Matthes and Kohring (2008) thus suggest a bottom-up, data-driven and interactive method which on the one hand offers the possibility to correct and guide automatic approaches as has been exemplified by Hu et al. (2011), on the other hand the rigid consistency of automatic approaches can also add new insights for data interpretation.",
        "4 Pilot Study As a short glimpse at the potential of our research we present first data from a small pilot study.",
        "The depth of the analysis is still limited due to the not yet fully functional pipeline.",
        "In a first step, we col-40 lected 4445 articles from the last ten years in three large German print and online news sources.",
        "The institutions under scrutiny are (private) associations for technical inspection in Germany.",
        "In this area, the T ?",
        "UV (Technischer ?",
        "Uberwachungsverein, i.e., Technical Inspection Association) and its subcompanies almost exert a regulatory monopoly.",
        "As a first goal, we want to investigate the difference in the tonality in the media coverage towards the institutions in this area.",
        "We therefore chose to investigate a public scandal revolving on defective breast implants that have been tested and certified by a T ?",
        "UV subcompany.",
        "Table 1 reports the results.",
        "Institution Articles Tonality Name n negative ambivalent neutral positive T ?",
        "UV 57 47 5 3 2 T ?",
        "UV subcompanies 45 39 3 2 1 Other institutions 10 6 2 0 2 Table 1: Absolute counts of articles about breast implants and tonality per institution A first interesting finding is that we only found articles about breast implants in the last 3 years.",
        "Considering the sentiment analysis results for these articles, we see a clearly negative aggregated result.",
        "82.1% of the articles were of negative tonality, compared to only 4.5% positive tonality.",
        "The remaining articles were of neutral (4.5%) or ambivalent (8.9%) tonality.",
        "The percentage of negative articles is even larger if only articles containing mentions of T ?",
        "UV and its subcompanies are considered (84.3%), while the percentage of positive articles drops to 2.9%.",
        "Furthermore, these findings are in line with the increase in negative articles on T ?",
        "UV subcompanies during these years (see Figure 2).",
        "In fact, from all negative articles about the T ?",
        "UV subcom-panies, 28.8% in 2012 and even 38.2% in 2013 contained mentions of breast implants.",
        "The scandal itself was therefore responsible for the increase in negative articles in this period.",
        "This development can be interpreted as an indication for the accountability of such institutions in the public media, although it remains an open question which aspects were dominant in the public discourse considering the scandal about the breast implants.",
        "In sum, this pilot study increases our confidence to be able to successfully collect the necessary data for our main purpose, i.e. to answer the question whether new forms of governance are held accountable in the media.",
        "In the near future, we Figure 2: Percentage and raw counts of negative (breast implant) articles for T ?",
        "UV subcompanies plan to implement approaches that allow us to inductively detect the issues brought forward in the context of an actor in a selection of texts.",
        "More precisely, we are planning to describe and detect the dynamics of the debate in articles as well as the tonality inside them.",
        "5 Conclusions We have introduced a project measuring media coverage and applying opinion and relation mining to the question of accountability of new modes of governance in Europe.",
        "To answer how public communication exposes them to public account-ability, we apply computational linguistics methods ranging from named entity recognition, dependency parsing and coreference resolution to opinion and relation mining and ultimately framing.",
        "We have given a pilot study on a public scandal involving defective breast implants that have been tested and certified by a T ?",
        "UV subcompany in Germany.",
        "We find, on the one hand, that most of the articles on breast implants during the period are of negative tonality, and on the other hand, that a corresponding proportion of negative articles on T ?",
        "UV mentions breast implants, explaining the spike in negativity.",
        "In future research, we will detect such spikes in a data-driven fashion and with the help of targeted opinion and relation mining approaches.",
        "Acknowledgments This research is supported by the Swiss National Science Foundation project NCCR democracy 1 .",
        "1 http://www.nccr-democracy.uzh.ch 41 References"
      ]
    }
  ]
}
