{
  "info": {
    "authors": [
      "Zhenghua Li",
      "Min Zhang",
      "Wenliang Chen"
    ],
    "book": "COLING",
    "id": "acl-C14-1075",
    "title": "Soft Cross-lingual Syntax Projection for Dependency Parsing",
    "url": "https://aclweb.org/anthology/C14-1075",
    "year": 2014
  },
  "references": [
    "acl-C10-1011",
    "acl-D07-1098",
    "acl-D07-1101",
    "acl-D08-1092",
    "acl-D09-1086",
    "acl-D09-1127",
    "acl-D11-1005",
    "acl-D11-1006",
    "acl-D11-1007",
    "acl-E06-1011",
    "acl-I08-3008",
    "acl-N01-1026",
    "acl-N06-1014",
    "acl-N12-1052",
    "acl-N13-1006",
    "acl-N13-1126",
    "acl-P05-1012",
    "acl-P08-1109",
    "acl-P09-1042",
    "acl-P10-1001",
    "acl-P10-1002",
    "acl-P10-1003",
    "acl-P10-1065",
    "acl-P11-1061",
    "acl-P11-2033",
    "acl-P11-2120",
    "acl-P12-1066",
    "acl-P13-1105",
    "acl-P13-1106",
    "acl-W09-1104",
    "acl-W10-2906"
  ],
  "sections": [
    {
      "text": [
        "Abstract",
        "This paper proposes a simple yet effective framework of soft cross-lingual syntax projection to transfer syntactic structures from source language to target language using monolingual treebanks and large-scale bilingual parallel text.",
        "Here, soft means that we only project reliable dependencies to compose high-quality target structures.",
        "The projected instances are then used as additional training data to improve the performance of supervised parsers.",
        "The major issues for this idea are 1) errors from the source-language parser and unsupervised word aligner; 2) intrinsic syntactic non-isomorphism between languages; 3) incomplete parse trees after projection.",
        "To handle the first two issues, we propose to use a probabilistic dependency parser trained on the target-language treebank, and prune out unlikely projected dependencies that have low marginal probabilities.",
        "To make use of the incomplete projected syntactic structures, we adopt a new learning technique based on ambiguous labelings.",
        "For a word that has no head words after projection, we enrich the projected structure with all other words as its candidate heads as long as the newly-added dependency does not cross any projected dependencies.",
        "In this way, the syntactic structure of a sentence becomes a parse forest (ambiguous labels) instead of a single parse tree.",
        "During training, the objective is to maximize the mixed likelihood of manually labeled instances and projected instances with ambiguous labelings.",
        "Experimental results on benchmark data show that our method significantly outperforms a strong baseline supervised parser and previous syntax projection methods."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "During the past decade, supervised dependency parsing has made great progress.",
        "However, due to the limitation of scale and genre coverage of labeled data, it is very difficult to further improve the performance of supervised parsers.",
        "On the other hand, it is very time-consuming and labor-intensive to manually construct treebanks.",
        "Therefore, lots of recent work has been devoted to get help from bilingual constraints.",
        "The motivation behind are two-fold.",
        "First, a difficult syntactic ambiguity in one language may be very easy to resolve in another language.",
        "Second, a more accurate parser on one language may help an inferior parser on another language, where the performance difference may be due to the intrinsic complexity of languages or the scale of accessible labeled resources.",
        "Following the above research line, much effort has been done recently to explore bilingual constraints for parsing.",
        "Burkett and Klein (2008) propose a reranking based method for joint constituent parsing of bitext, which can make use of structural correspondence features in both languages.",
        "Their method needs bilingual treebanks with manually labeled syntactic trees on both sides for training.",
        "Huang et al. (2009) compose useful parsing features based on word reordering information in source-language sentences.",
        "Chen et al. (2010a) derive bilingual subtree constraints with auto-parsed source-language sentences.",
        "During training, both Huang et al. (2009) and Chen et al. (2010a) require bilingual text with target-language gold-standard dependency trees.",
        "All above work shows significant performance gain ?Correspondence author This work is licenced under a Creative Commons Attribution 4.0 International License.",
        "783 over monolingual counterparts.",
        "However, one potential disadvantage is that bilingual treebanks and bitext with one-side annotation are difficult to obtain.",
        "Therefore, They usually conduct experiments on treebanks with a few thousand sentences.",
        "To break this constraint, Chen et al. (2011) extend their work in Chen et al. (2010a) and translate text of monolingual treebanks to obtain bilingual treebanks with a statistical machine translation system.",
        "This paper explores another line of research and aims to boost the state-of-the-art parsing accuracy via syntax projection.",
        "Syntax projection typically works as follows.",
        "First, we train a parser on source-language treebank, called a source parser.",
        "Then, we use the source parser to produce automatic syntactic structures on the source side of bitext.",
        "Next, with the help of automatic word alignments, we project the source-side syntactic structures into the target side.",
        "Finally, the target-side structures are used as gold-standard to train new parsing models of target language.",
        "Previous work on syntax projection mostly focuses on unsupervised grammar induction where no labeled data exists for target language (Hwa et al., 2005; Spreyer and Kuhn, 2009; Ganchev et al., 2009; Liu et al., 2013).",
        "Smith and Eisner (2009) propose quasi-synchronous grammar for cross-lingual parser projection and assume the existence of hundreds of target language annotated sentences.",
        "Similar to our work in this paper, Jiang et al. (2010) try to explore projected structures to further improve the performance of statistical parsers trained on full-scale monolingual treebanks (see Section 4.4 for performance comparison).",
        "The major issues for syntax projection are 1) errors from the source-language parser and unsupervised word aligner; 2) intrinsic syntactic non-isomorphism between languages; 3) incomplete parse trees after projection.",
        "Hwa et al. (2005) propose a simple projection algorithm based on the direct correspondence assumption (DCA).",
        "They apply post-editing to the projected structures with a set of hand-crafted heuristic rules, in order to handle some typical cross-lingual syntactic divergences.",
        "Similarly, Ganchev et al. (2009) manually design several language-specific constrains during projection, and use projected partial structures as soft supervision during training based on posterior regularization (Ganchev et al., 2010).",
        "To make use of projected instances with incomplete trees, Spreyer and Kuhn (2009) propose a heuristic method to adapt training procedures of dependency parsing.",
        "Instead of directly using incomplete trees to train dependency parsers, Jiang et al. (2010) train a local dependency/non-dependency classifier on projected syntactic structures, and use outputs of the classifier as auxiliary features to help supervised parsers.",
        "One potential common drawback of above work is the lack of a systematic way to handle projection errors and incomplete trees.",
        "Different from previous work, this paper proposes a simple yet effective framework of soft syntax projection for dependency parsing, and provides a more elegant and systematic way to handle the above issues.",
        "First, we propose to use a probabilistic parser trained on target-language treebank, and prune unlikely projected dependencies which have very low marginal probabilities.",
        "Second, we adopt a new learning technique based on ambiguous labelings to make use of projected incomplete trees for training.",
        "For a word that has no head words after projection, we enrich the projected structure by adding all possible words as its heads as long as the newly-added dependency does not cross any projected dependencies.",
        "In this way, the syntactic structure of a sentence becomes a parse forest (ambiguous labelings) instead of a single parse tree.",
        "During training, the objective is to maximize the mixed likelihood of manually labeled instances and projected instances with ambiguous labelings.",
        "Experimental results on benchmark data show that our method significantly outperforms a strong baseline supervised parser and previous syntactic projection methods.",
        "2 Syntax Projection Given an input sentence x = w 0 w 1 ...w n , a dependency tree is d = {(h,m) : 0 ?",
        "h ?",
        "n, 0 < m ?",
        "n}, where (h,m) indicates a directed arc from the head word w h to the modifier w m , and w 0 is an artificial node linking to the root of the sentence.",
        "Syntax projection aims to project the dependency tree ds of a source-language sentence xs into the dependency structure of its target-language translation x via word alignments a, where a word alignment a i = z means the target-side word w i is aligned into the source-side word ws z , as depicted in Figure 1(a) and Figure 1(b).",
        "For simplicity, we avoid one-to-many alignments by keeping the one with highest 784 w0 things 1 I 2 did 3 w 0 \u0011 1 Z 2 ?",
        "3 ?",
        "4 ?",
        "5 (a) Source tree and word alignments w 0 \u0011 1 Z 2 ?",
        "3 ?",
        "4 ?",
        "5 (b) Projected incomplete tree w 0 \u0011 1 Z 2 ?",
        "3 ?",
        "4 ?",
        "5 (c) Forest (ambiguous labelings) Figure 1: Illustration of syntax projection from English to Chinese with a sentence fragment.",
        "The two Chinese auxiliary words, ??",
        "3 ?",
        "(past tense marker) and ??",
        "4 ?",
        "(relative clause marker), are not aligned to any English words.",
        "marginal probability when the target word is aligned to multiple source words.",
        "We first introduce a simple syntax projection approach based on DCA (Hwa et al., 2005), and then propose two extensions to handle parsing and aligning errors and cross-lingual syntactic divergences.",
        "Projection with DCA.",
        "If two target words w i and w j are aligned to two different source words ws a i and w s a j , and the two words compose a dependency in the source tree (a i , a j ) ?",
        "d s , then add a dependency (i, j) into the projected syntactic structure.",
        "For example, as shown in Figure 1(a), the two Chinese words ?Z 2 ?",
        "and ??",
        "5 ?",
        "are aligned to the two English words ?did 3 ?",
        "and ?things 1 ?, and the dependency ?things 1 ydid 3 ?",
        "is included in the source tree.",
        "Therefore, we project the dependency into the target side and add a dependency ?Z 2 x?",
        "5 ?",
        "into the projected structure, as shown in Figure 1(b).",
        "An obvious drawback of DCA is that it may produce many wrong dependencies due to the errors in the automatic source-language parse trees and word alignments.",
        "Even with manual parse trees and word alignments, syntactic divergences between languages can also lead to projection errors.",
        "Pruned with target-side marginals.",
        "To overcome the weakness of DCA, we propose to use target-side marginal probabilities to constrain the projection process and prune obviously bad projections.",
        "We train a probabilistic parser on an existing target-side treebank.",
        "For each projected dependency, we compute its marginal probability with the target parser, and prune it off the projected structure if the probability is below a pruning threshold ?",
        "p .",
        "Our study shows that dependencies with very low marginal probabilities are mostly wrong (Figure 2).",
        "Supplemented with target-side marginals.",
        "To further improve the quality of projected structures, we add dependencies with high marginal probabilities according to the target parser.",
        "Specifically, if a target word w j obtain a head word w i after projection, and if another word w k has higher marginal probability than a supplement threshold ?",
        "s to be the head word of w j , then we also add the dependency (k, j) into the projected structure.",
        "In other words, we allow one word to have multiple heads so that the projected structure can cover more correct dependencies.",
        "From incomplete tree to forest.",
        "Some words in the target sentence may not obtain any head words after projection due to incomplete word alignments or the pruning process, which leads to incomplete parse trees after projection.",
        "Also, some words may have multiple head words resulting from the supplement process.",
        "To handle these issues, we first convert the projected structures into parse forests, and then propose a generalized training technique based on ambiguous labelings to make use of the projected instances.",
        "Specifically, if a word does not have head words after projection, we simply add into the projected structure all possible words as its candidate heads as long as the newly-added dependency does not cross any projected dependencies, as illustrated in Figure 1(c).",
        "We introduce three new dependencies to compose candidate heads for the unattached word ??",
        "3 ?.",
        "Note that it is illegal to add the dependency ?\u0011 1 y?",
        "3 ?",
        "since it would cross the projected dependency ?Z 2 x?",
        "5 ?.",
        "785 3 Dependency Parsing with Ambiguous Labelings In parsing community, two mainstream methods tackle the dependency parsing problem from different perspectives but achieve comparable accuracy on a variety of languages.",
        "Graph-based methods view the problem as finding an optimal tree from a fully-connected directed graph (McDonald et al., 2005; McDonald and Pereira, 2006; Carreras, 2007; Koo and Collins, 2010), while transition-based methods try to find a highest-scoring transition sequence that leads to a legal dependency tree (Yamada and Matsumoto, 2003; Nivre, 2003; Zhang and Nivre, 2011).",
        "3.1 Graph-based Dependency Parser (GParser) We adopt the graph-based paradigm because it allows us to elegantly derive our CRF-based probabilistic parser, which is required to compute the marginal probabilities of dependencies and likelihood of both manually labeled data and unannotated bitext with ambiguous labelings.",
        "The graph-based method factors the score of a dependency tree into scores of small subtrees p. Score(x,d;w) = w ?",
        "f(x,d) = ?",
        "p?d Score(x,p;w) (1) We adopt the second-order model of McDonald and Pereira (2006) as our core parsing algorithm,1 which defines the score of a dependency tree as: Score(x,d;w) = ?",
        "{(h,m)}?d w dep ?",
        "f dep (x, h,m) + ?",
        "{(h,s),(h,m)}?d w sib ?",
        "f sib (x, h, s,m) (2) where f dep (x, h,m) and f sib (x, h, s,m) are feature vectors corresponding to two kinds of subtree; w dep/sib are the feature weight vectors; the dot product gives the scores contributed by the corresponding subtrees.",
        "We adopt the state-of-the-art syntactic features proposed in Bohnet (2010).",
        "3.2 Probabilistic CRF-based GParser Previous work on dependency parsing mostly adopts linear models and online perceptron training, which lack probabilistic explanations of dependency trees and likelihood of the training data.",
        "Instead, we build a log-linear CRF-based probabilistic dependency parser, which defines the probability of a dependency tree as: p(d|x;w) = exp{Score(x,d;w)} Z(x;w) ; Z(x;w) = ?",
        "d ?",
        "?Y(x) exp{Score(x,d ?",
        ";w)} (3) where Z(x) is the normalization factor and Y(x) is the set of all legal dependency trees for x.",
        "3.3 Likelihood and Gradient of Training Data with Ambiguous Labelings Traditional CRF models assume one gold-standard label for each training instance, which means each sentence is labeled with a single parse tree in the case of parsing.",
        "To make use of projected instances with ambiguous labelings, we propose to use a generalized training framework which allows a sentence to have multiple parse trees (forest) as its gold-standard reference (Ta?ckstro?m et al., 2013).",
        "The goal of the training procedure is to maximize the likelihood of the training data, and the model is updated to improve the probabilities of parse forests, instead of single parse trees.",
        "In other words, the model has the flexibility to distribute the probability mass among the parse trees inside the forest, as long as the probability of the forest improves.",
        "In this generalized framework, a traditional instance labeled with a single parse tree can be regarded as a special case that the forest contains only one parse tree.",
        "The probability of a sentence x with ambiguous labelings F is defined as the sum of probabilities of all parse tree d contained in the forest F : p(F|x;w) = ?",
        "d?F p(d|x;w) (4) 1Higher-order models of Carreras (2007) and Koo and Collins (2010) can achieve a little bit higher accuracy, but suffer from higher time cost of O(n4) and system complexity.",
        "Our method is applicable to the third-order model.",
        "786 Train Dev Test PTB 39,832 1,346 2416 CTB5 16,091 803 1,910 CTB5X 18,104 352 348 Bitext 0.9M ?",
        "?",
        "Table 1: Data sets (in sentence number).",
        "Suppose the training data set is D = {(x i ,F i )} N i=1 .",
        "Then the log likelihood of D is: L(D;w) = N ?",
        "i=1 log p(F i |x i ;w) (5) Then we can derive the partial derivative of the log likelihood with respect to w: ?L(D;w) ?w = N ?",
        "i=1 ( ?",
        "d?F i p?",
        "(d|x i ,F i ;w)f(x i ,d) ?",
        "?",
        "d?Y(x i ) p(d|x i ;w)f(x i ,d) ) (6) where p?",
        "(d|x i ,F i ;w) is the probability of d under the space constrained by the parse forest F i : p?",
        "(d|x i ,F i ;w) = exp{Score(x i ,d;w)} Z(x i ,F i ;w) ; Z(x i ,F i ;w) = ?",
        "d?F i exp{Score(x i ,d;w)} (7) The first term in Eq. (6) is the model expectations in the search space constrained by F i , and the second term is the model expectations in the complete search space Y(x i ).",
        "Since Y(x i ) contains exponentially many legal dependency trees, direct calculation of the second term is prohibitive.",
        "Instead, we can use the classic Inside-Outside algorithm to efficiently compute the second term within O(n3) time complexity, where n is the length of the input sentence.",
        "Similarly, the first term can be solved by running the Inside-Outside algorithm in the constrained search space F i .",
        "3.4 Stochastic Gradient Descent (SGD) Training With the likelihood gradients, we apply L2-norm regularized SGD training to iteratively learn the feature weights w for our CRF-based baseline and bitext-enhanced parsers.",
        "We follow the implementation in CRFsuite.2 At each step, the algorithm approximates a gradient with a small subset of training examples, and then updates the feature weights.",
        "Finkel et al. (2008) show that SGD achieves optimal test performance with far fewer iterations than other optimization routines such as L-BFGS.",
        "Moreover, it is very convenient to parallel SGD since computation among examples in the same batch is mutually independent.",
        "Once the feature weights w are learnt, we can parse the test data and try to find the optimal parse tree with the Viterbi decoding algorithm in O(n3) parsing time (Eisner, 2000; McDonald and Pereira, 2006).",
        "d ?",
        "= arg max d?Y(x) p(d|x;w) (8) 4 Experiments and Analysis To verify the effectiveness of our proposed method, we carry out experiments on English-to-Chinese syntax projection, and aim to enhance our baseline Chinese parser with additional training instances projected from automatic English parse trees on bitext.",
        "For monolingual treebanks, we use Penn English Treebank (PTB) and Penn Chinese Treebank 5.1 (CTB5).",
        "For English, we follow the standard practice to split the data into training (sec 02-21), development (sec 22), and test (sec 23).",
        "For CTB5, we adopt the data split of (Duan et al., 2007).",
        "We convert the original bracketed structures into dependency 2http://www.chokkan.org/software/crfsuite/ 787 0 10 20 30 40 50 60 70 80 90 100 0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1 UA S & Pe rc en t (% ) Marginal Probability Interval Percent UAS Figure 2: Distribution (Percent) and accuracy (UAS) of dependencies under different marginal probability interval for Chinese baseline parser on CTB5 development set.",
        "For example, 0.8 at x-axis means the interval [0.8, 0.9).",
        "structures using Penn2Malt with its default head-finding rules.",
        "We build a CRF-based bigram part-of-speech (POS) tagger with the features described in (Li et al., 2012b), and produce POS tags for all train/development/test datasets and bitext (10-way jackknifing for training datasets).",
        "The tagging accuracy on test sets is 97.3% on English and 94.0% on Chinese.",
        "To compare with the recent work on syntax projection of Jiang et al. (2010) who use a smaller test dataset, we follow their data split of CTB5 and use gold-standard POS tags during training and test.",
        "We refer to this setting as CTB5X.",
        "For bitext, we collect a parallel corpus from FBIS news (LDC03E14, 0.25M sentence pairs), United Nations (LDC04E12, 0.62M), IWSLT2008 (0.04M), and PKU-863 (0.2M).",
        "After corpus cleaning, we obtain a large-scale bilingual parallel corpus containing 0.9M sentence pairs.",
        "We run the unsupervised BerkeleyAligner3 (Liang et al., 2006) for 4 iterations to obtain word alignments.",
        "Besides hard alignments, we also make use of posterior probabilities to simplify one-to-many alignments to one-to-one as discussed in Section 2.",
        "Table 1 shows the data statistics.",
        "For training both the baseline and bitext-enhanced parsers, we set the batch size to 100 and run SGD until a maximum iteration number of 50 is met or the change on likelihood of training data becomes too small.",
        "Since the number of projected sentences is much more than that of manually labeled instances (0.9M vs. 16K), it is likely that the projected data may overwhelm manually labeled data during training.",
        "Therefore, we adopt a simple corpus-weighting strategy.",
        "Before each iteration, we randomly sample 50K projected sentences and 15K manually labeled sentences from all training data, and run SGD to train feature weights using the sampled data.",
        "To speed up training, we adopt multi-thread implementation of gradient computations in the same batch.",
        "It takes about 1 day to train our bitext-enhanced parser for one iteration using a single CPU core, while using 24 CPU cores only needs about 2 hours.",
        "We measure parsing performance using unlabeled attachment score (UAS, percent of words with correct heads), excluding punctuation marks.",
        "For significance test, we adopt Dan Bikel's randomized parsing evaluation comparator (Noreen, 1989).4 4.1 Analysis on Marginal Probabilities In order to gain insights for parameter settings of syntax projection, we analyse the distribution and accuracy of dependencies under different marginal probability interval.",
        "We train the baseline Chinese parser on CTB5 train set, and use the parser to produce the marginal probabilities of all dependencies for sentences in CTB5 development set.",
        "We discard all dependencies that have a marginal probability less than 0.0001 for better illustration.",
        "Figure 2 shows the results, where we can see that UAS is roughly proportional to marginal probabilities.",
        "In other word, dependencies with higher marginal probabilities are more accurate.",
        "For example, dependencies with probabilities under interval [0.8, 0.9) has a 80% chance to be correct.",
        "From another aspect, we can see that 50% of dependencies fall in probability 3http://code.google.com/p/berkeleyaligner/ 4http://www.cis.upenn.edu/ ?",
        "dbikel/software.html 788 77 78 79 80 81 82 83 84 1 6 11 16 21 26 31 36 41 46 UA S (% ) Iteration Number Supervised DCA (0.0 1.0) DCA Pruned (0.1 1.0) DCA Pruned (0.5 1.0) (a) Parameters for DCA and DCA Pruned 77 78 79 80 81 82 83 84 1 6 11 16 21 26 31 36 41 46 UA S (% ) Iteration Number Supervised (0.1 0.5) (0.1 0.6) (0.1 0.8) (b) Parameters for DCA Pruned & Supplemented Figure 3: Performance with different parameter settings of (?",
        "p ?",
        "s ) on CTB5 development set.",
        "interval [0, 0.1), and such dependencies have very low accuracy (4%).",
        "These observations are helpful for our parameter selection and methodology study during syntax projection.",
        "4.2 Results of Syntax Projection on Development Dataset We apply the syntax projection methods described in Section 2 to the bilingual text, and use the projected sentences with ambiguous labelings as additional training instances to train new Chinese parsers based on the framework described in Section 3.",
        "Figure 3 shows the UAS curves on development set with different parameters settings.",
        "The pruning threshold ?",
        "p (see Section 2) balances the quality and coverage of projection.",
        "Larger ?",
        "p leads to more accurate but fewer projections.",
        "The supplement threshold ?",
        "s (see Section 2) balances the size and oracle score of the projected forest.",
        "Smaller ?",
        "s can increase the oracle score of the forest by adding more dependencies with lower marginal probabilities, but takes the risk of making the resulted forest too ambiguous and weak to properly supervise the model during training.",
        "5 The DCA method corresponds to the results with ?",
        "p = 0.0 and ?",
        "s = 1.0.",
        "We can see that DCA largely decreases UAS compared with the baseline CRF-based parser.",
        "The reason is that although DCA projects many source-language dependencies to the target side (44% of target-language words obtain head words), it also introduces a lot of noise during projection.",
        "DCA pruned with target-side marginals corresponds to the results with ?",
        "p > 0.0 and ?",
        "s = 1.0.",
        "Pruning with target-side marginals can clearly improve the projection quality by pruning out bad projections.",
        "When ?",
        "p = 0.1, 31% of target-language words obtain head words, and the model outperforms the baseline parser by 0.6% at peak UAS.",
        "When ?",
        "p = 0.5, the projection ratio decreases to 26% and the improvement is 0.3%.",
        "Based on the results, we choose ?",
        "p = 0.1 in later experiments.",
        "Figure 3(b) presents the results of DCA pruned & supplemented with different ?",
        "s .",
        "The supplement process adds a small amount of dependencies of high probabilities into the projected forest and therefore increases the oracle score, which provides the model with flexibility to distribute the probability mass to more preferable parse trees.",
        "We can see that although the peak UAS does not increase much, the training curve is more smooth and stable than that without supplement.",
        "Based on the results, we choose ?",
        "s = 0.6 in later experiments.",
        "4.3 Final Results and Comparisons on Test Dataset Table 2 presents the final results on CTB5 test set.",
        "For each parser, we choose the parameters corresponding to the iteration number with highest UAS on development set.",
        "To further verify the usefulness of syntax projection, we also conduct experiments with self-training, which is known as a typical semi-supervised method.",
        "For the standard self-training, we use Chinese-side bitext with self-predicted parse trees produced by the baseline parser as additional training instances, which turns out to be hurtful to parsing performance.",
        "This is consistent with earlier results (Spreyer and Kuhn, 2009).",
        "5Please note when ?",
        "p +?",
        "s >= 1, ?",
        "s becomes useless.",
        "The reason is that if the probability of a projected dependency (i, j) is larger ?",
        "p , then no other word beside w i can have a probability larger than ?",
        "s of being the head word of w j .",
        "789 UAS Baseline Supervised Parser 81.04 Standard Self-training 80.51 (-0.53) Self-training with Ambiguous Labelings 81.09 (+0.05) DCA 78.70 (-2.34) DCA Pruned 81.46 (+0.42 ?)",
        "DCA Pruned & Supplemented 81.71 (+0.67 ?)",
        "Table 2: UAS on CTB5 test set.",
        "?",
        "indicate statistical significance at confidence level of p < 0.01.",
        "Supervised Bitext-enhanced Jiang et al. (2010) 87.15 87.65 (+0.50) This work 89.62 90.50 (+0.88 ?)",
        "Table 3: UAS on CTB5X test set.",
        "?",
        "indicate statistical significance at confidence level of p < 0.01.",
        "Then, we try a variant of self-training with ambiguous labelings following the practice in Ta?ckstro?m et al. (2013), and use a parse forest composed of dependencies of high probabilities as the syntactic structure of an instance.",
        "We can see that ambiguous labelings help traditional self-training, but still have no significant improvement over the baseline parser.",
        "Results in Table 2 indicate that our syntax projection method is able to project useful knowledge from source-language parse trees to the target-side forest, and then helps the target parser to learn effective features.",
        "4.4 Comparisons with Previous Results on Syntax Projection on CTB5X To make comparison with the recent work of Jiang et al. (2010), We rerun the process of syntax projection with CTB5X as the target treebank with the DCA pruned & supplemented method (?",
        "p = 0.1 and ?",
        "s = 0.6).6 Table 3 shows the results.",
        "Jiang et al. (2010) employ the second-order MSTParser of McDonald and Pereira (2006) with a basic feature set as their base parser.",
        "We can see that our baseline parser is much stronger than theirs.",
        "Even though, our approach leads to larger UAS improvement.",
        "This work is different from theirs in a few aspects.",
        "First, the purpose of syntax projection in their work is to produce dependency/non-dependency instances which are used to train local classifiers to produce auxiliary features for MSTParser.",
        "In contrast, the outputs of syntax projection in our work are partial trees/forests where only reliable dependencies are kept and some words may receive more than one candidate heads.",
        "We directly use these partial structures as extra training data to learn model parameters.",
        "Second, their work measures the reliability of a projected dependencies only from the perspective of alignment probability, while we adopt a probabilistic parsing model and use target-side marginal probabilities to throw away bad projections, which turns out effective in handling syntactic non-isomorphism and errors in word alignments and source-side parses.",
        "5 Related work Cross-lingual annotation projection has been applied to many different NLP tasks to help processing resource-poor languages, such as POS tagging (Yarowsky and Ngai, 2001; Naseem et al., 2009; Das and Petrov, 2011) and named entity recognition (NER) (Fu et al., 2011).",
        "In another direction, much previous work explores bitext to improve monolingual NER performance based on bilingual constraints (Chen et al., 2010b; Burkett et al., 2010; Li et al., 2012a; Che et al., 2013; Wang et al., 2013).",
        "Based on a universal POS tag set (Petrov et al., 2011), McDonald et al. (2011) propose to train delexicalized parsers on resource-rich language for parsing resource-poor language without use of bitext (Zeman and Resnik, 2008; Cohen et al., 2011; S?gaard, 2011).",
        "Ta?ckstro?m et al. (2012) derive cross-lingual clusters from bitext to help delexicalized parser transfer.",
        "Naseem et al. (2012) propose selectively sharing to better explore multi-source transfer information.",
        "6In the previous draft of this paper, we directly use the projected data with in previous subsection for simplicity, and find that UAS can reach 91.39% (+1.77).",
        "The reason is that the CTB5X test is overlapped with CTB5 train.",
        "We correct this mistake in this version.",
        "790 Our idea of training with ambiguous labelings is originally inspired by the work of Ta?ckstro?m et al. (2013) on multilingual parser transfer for unsupervised dependency parsing.",
        "They use a delexicalized parser trained on source-language treebank to obtain parse forests for target-language sentences, and retrain a lexicalized target parser using the sentences with ambiguous labelings.",
        "Similar ideas of learning with ambiguous labelings are previously explored for classification (Jin and Ghahramani, 2002) and sequence labeling problems (Dredze et al., 2009).",
        "6 Conclusions This paper proposes a simple yet effective framework of soft cross-lingual syntax projection.",
        "We make use of large-scale projected structures as additional training instances to boost performance of supervised parsing models trained on full-set manually labeled treebank.",
        "Compared with previous work, we make two innovative contributions: 1) using the marginal probabilities of a target-side supervised parser to control the projection quality with the existence of parsing and aligning errors and cross-lingual syntax divergences; 2) adopting a new learning technique based ambiguous labelings to make use of projected incomplete dependency trees for model training.",
        "Experimental results on two Chinese datasets demonstrate the effectiveness of the proposed framework, and show that the bitext-enhanced parser significantly outperforms all baselines, including supervised parsers, semi-supervised parsers based on self-training, and previous syntax projection methods.",
        "Our anonymous reviewers present many great comments, especially on the experimental section.",
        "We will improve this work accordingly and release an extended version of this paper at the homepage of the first author.",
        "Such extensions include: 1) further exploring source-language parsing probabilities and alignment probabilities to help syntax projection; 2) studying the effect of the scale of source/target treebank and bilingual text.",
        "Acknowledgments The authors would like to thank Wanxiang Che and Jiang Guo for sharing their bilingual data, and our anonymous reviewers for their critical and insightful comments, which will certainly help our future work.",
        "This work was supported by National Natural Science Foundation of China (Grant No.",
        "61373095, 61203314, 61373097).",
        "References"
      ]
    }
  ]
}
