{
  "info": {
    "authors": [
      "Heather Graves",
      "Roger Graves",
      "Robert Mercer",
      "Mahzereen Akter"
    ],
    "book": "Workshop on Argumentation Mining",
    "id": "acl-W14-2113",
    "title": "Titles That Announce Argumentative Claims in Biomedical Research Articles",
    "url": "https://aclweb.org/anthology/W14-2113",
    "year": 2014
  },
  "references": [
    "acl-J02-4002"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the First Workshop on Argumentation Mining, pages 98?99, Baltimore, Maryland USA, June 26, 2014. c?2014 Association for Computational Linguistics Titles That Announce Argumentative Claims in Biomedical Research Articles Heather Graves Roger Graves Department of English and Film Studies The University of Alberta Edmonton, Alberta, Canada graves1,hgraves@ualberta.ca Robert E. Mercer Mahzereen Akter Department of Computer Science The University of Western Ontario London, Ontario, Canada mercer@csd.uwo.ca",
        "Abstract",
        "In the experimental sciences authors use the scientific article to express their findings by making an argumentative claim.",
        "While past studies have located the claim in the Abstract, the Introduction, and in the Discussion section, in this paper we focus on the article title as a potential source of the claim.",
        "Our investigation has suggested that titles which contain a tensed verb almost certainly announce the argument claim while titles which do not contain a tensed verb have varied announcements.",
        "Another observation that we have confirmed in our dataset is that the frequency of verbs in titles of experimental research articles has increased over time."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In this paper we are interested in determining what is being claimed in articles in experimental (not clinical) biomedical literature, in particular.",
        "Claims have been studied in the argumentation literature from many different standpoints (White, 2009).",
        "Rhetorical structure theory was developed from systemic functional linguistics to map connections among texts (Mann and Thomp-son, 1987); Argumentative zoning was developed from Swales?",
        "CARS model of moves made in research articles (Teufel, 1999; Teufel and Moens, 1999; Teufel and Moens, 2002).",
        "Toulmin-based analysis has also been used to map the argumentative structure of articles (Toulmin, 1958 2003; Jenicek, 2006; Reed and Rowe, 2006; Graves et al., 2013; Graves, 2013).",
        "With these models of argument in mind, we view the claim of a scientific argument as the conclusion that the authors infer from known information and new information (results from an experiment or other forms of observations).",
        "Past studies locate the claim in the",
        "Abstract",
        "(Kanoksilapatham, 2013), at the end of the Introduction (Swales, 1990; Swales and Najjar, 1987; Kanoksilapatham, 2005; Kanoksilapatham, 2012), and in the Discussion section (Kanoksilap- atham, 2005).",
        "Our observations of changes in the genre of the research article have led us to perform a preliminary investigation of titles with the outcome being a provisional typology.",
        "2 Method The Genia Tagger uses the Penn Treebank Tagset.",
        "In the following we mention the verb tags from this tagset: VB ?",
        "base form, VBD ?",
        "past tense, VBG ?",
        "gerund, VBN ?",
        "past participle, VBP ?",
        "present tense non-3rd person singular, VBZ ?",
        "present tense 3rd person singular.",
        "We applied these tags to the dataset of biomedical article titles and abstracts used in this preliminary study has been taken from MEDLINE, the well-known biomedical bibliographic repository that contains over 19 million citations and abstracts for about 81% of these citations from approximately 5600 journals (NLM, 2013 accessed 3 February 2014).",
        "We have curated a small database using biotextEngine and some locally developed tools.",
        "3 Analysis For each title we collect the following: ?",
        "cumulative frequency of all verb categories ?",
        "whether the title contains a VBP, VBZ, or passive verb ?",
        "whether the title contains a nominalization 4 Findings Our analysis so far has identified three typologies.",
        "The articles can be categorized according to genre, purpose and structure.",
        "For titles with verbs the claim of the title is repeated several times: in the 98 5Our ?analysis ?so ?far ?has ?identified ?three ?typologies.",
        "?The ?articles ?can ?be ?categorized ?",
        "according ?to ?genre, ?purpose -- and ?structure.",
        "?A ?typology ?based ?on ?genre ?distinguishes among ?review ?articles, ?methodological ?articles, -- and ?experimental ?research ?articles.",
        "?",
        "Experimental ?research ?articles ?are ?divided ?into ?those ?that ?report ?clinical ?advances -- and ?",
        "those ?that ?report ?new ?contributions ?to ?knowledge.",
        "?A ?second ?typology ?divides ?articles ?by ?",
        "purpose: ?some ?articles ?summarize ?the ?state ?of ?knowledge -- in ?a ?specialty ?area ?while ?others ?",
        "present ?an ?argument -- for ?the ?results ?they ?report.",
        "?A ?third ?typology ?distinguishes ?among ?",
        "articles ?based ?on ?the ?structure ?of ?their ?titles.",
        "?Some ?contain ?nouns -- and ?noun ?phrases ?that ?",
        "describe ?the ?paper ?topic;?",
        "?others ?contain ?verbs -- and ?verb-?like ?structures ?to ?indicate ?the ?",
        "authors?",
        "?stance ?towards ?the ?topic.",
        "?",
        "To ?highlight ?connections ?between ?these ?typologies, ?we ?conducted ?some ?theoretical ?",
        "sampling ?",
        "(Eisenhardt ?& ?Graebner ?2007, ?Eisenhardt ?1989) ?by ?analyzing ?the ?argument ?",
        "structure -- in ?the ?titles -- and ?abstracts ?of ?about ?10 ?sample ?articles.",
        "?These ?samples ?provided ?",
        "cases -- for ?use ?to ?test -- and ?inductively ?develop ?theoretical ?concepts ?to ?begin ?to ?account -- for ?",
        "the ?relationships ?between ?the ?article ?genres, ?their ?purposes, -- and ?the ?title ?structure.",
        "?This ?",
        "analysis ?suggested ?several ?points ?of ?connection.",
        "?For ?example, ?articles ?that ?summarize ?",
        "knowledge ?use ?nouns -- and ?noun ?phrases;?",
        "?review ?articles ?summarize ?knowledge ?to ?inform ?",
        "readers, -- and ?their ?titles ?describe ?the ?topic.",
        "?Experimental ?research ?articles ?that ?make ?a ?",
        "contribution ?to ?knowledge ?present ?an ?argument;?",
        "?their ?titles ?can ?contain ?verbs ?or ?verb-?like ?",
        "structures ?that ?explicitly ?state ?the ?major ?claim.",
        "?",
        "Figure 1: Genre ty ology Abstract, Introduc on, and Dis sion sections.",
        "For articles without verbs, the claim does not appear in the title or introduction (it does appear in t e b tract and discussion sections).",
        "A third find-i g: the frequency of verbs in titles of experi en-tal research articles has increased over time.",
        "5 Discussion We believe that our methods for identifying titles could lead to better literature search techniques.",
        "If researchers are able to identify the claim of an article from a search of titles alone, they will be able to evaluate the relevance of each article more efficiently.",
        "We suspect that the increase in titles with verbs and claims in them is an emerging trend, possibly the result of explicit editorial policy.",
        "One side effect of including claims in titles may be higher quality writing by the authors.",
        "Another result from using verbs in titles could be the automation of claim extraction.",
        "Finally, having research scientists use clear language to state their claim can have the added benefit of making knowledge translation more effective by lessening the difficulty of reading scientific texts.",
        "This, in turn, might afford greater access to the research outcomes by clinical practitioners (one of the main readerships of biomedical research).",
        "References"
      ]
    }
  ]
}
