{
  "info": {
    "authors": [
      "Luz Rello",
      "Horacio Saggion",
      "Ricardo Baeza-Yates"
    ],
    "book": "Workshop on Predicting and Improving Text Readability for target reader populations",
    "id": "acl-W14-1204",
    "title": "Keyword Highlighting Improves Comprehension for People with Dyslexia",
    "url": "https://aclweb.org/anthology/W14-1204",
    "year": 2014
  },
  "references": [
    "acl-S10-1004",
    "acl-W04-3252"
  ],
  "sections": [
    {
      "text": [
        "Abstract",
        "The use of certain font types and sizes improve the reading performance of people with dyslexia.",
        "However, the impact of combining such features with the semantics of the text has not yet been studied.",
        "In this eye-tracking study with 62 people (31 with dyslexia), we explore whether highlighting the main ideas of the text in boldface has an impact on readability and comprehensibility.",
        "We found that highlighting keywords improved the comprehension of participants with dyslexia.",
        "To the best of our knowledge, this is the first result of this kind for people with dyslexia."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Dyslexia is a neurological reading disability which is characterized by difficulties with accurate and/or fluent word recognition as well as by poor spelling and decoding abilities.",
        "These difficulties typically result from a deficit in the phonological component of language that is often unrelated to other cognitive disabilities.",
        "Secondary consequences include problems in reading comprehension and reduced reading experience that can impede vocabulary growth and background knowledge (International Dyslexia Association, 2011).",
        "From 10 to 17.5% of the population in the U.S.A. (Interagency Commission on Learning Disabilities, 1987) and from 8.6 to 11% of the Spanish speaking population (Carrillo et al., 2011; Jim?enez et al., 2009) have dyslexia.",
        "Even if dyslexia is also popularly identified with brilliant famous people, the most frequent way to detect a child with dyslexia is by low-performance in school (Carrillo et al., 2011).",
        "In Spain, it is estimated that four out of six cases of school failure are related to dyslexia.",
        "1 The prevalence of 1 The percentage of school failure is calculated by the dyslexia and its impact in school failure are the main motivations of our work.",
        "Previous eye-tracking studies with people with dyslexia have shown that their reading performance can improve when the presentation of the text contains certain font types (Rello and Baeza-Yates, 2013) or font sizes (O?Brien et al., 2005; Dickinson et al., 2002; Rello et al., 2013c).",
        "Keywords ?",
        "or key-phrases 2 ?",
        "are words that capture the main ideas of a text.",
        "Highlighting keywords in the text is a well known strategy to support reading tasks (Weinstein and Mayer, 1986).",
        "In fact, highlighting keywords is recommended to students with dyslexia (Hargreaves, 2007), as well as to teachers for making texts more accessible for this target group (Peer and Reid, 2001).",
        "Here, we present the first study which explores the modification of the text presentation in relationship with its semantics, by highlighting keywords.",
        "We measure the impact of highlighting the text on the reading performance (readability and comprehensibility) of people with dyslexia using eye-tracking.",
        "Our hypotheses are: ?",
        "H1: The presence of highlighted keywords in the text increases readability for people with dyslexia.",
        "?",
        "H2: The presence of highlighted keywords in the text increases comprehensibility for people with dyslexia.",
        "Next section reviews related work, while Section 3 explains the experimental methodology.",
        "Section 4 presents the results, which are discussed in Section 5.",
        "In Section 6 we draw the conclusions and we mention future lines of research.",
        "number or students who drop school before finishing secondary education (high school).",
        "While the average of school failure in the European Union is around 15%, Spain has around 25-30% of school failure, 31% in 2010 (Enguita et al., 2010).",
        "2 We use ?keywords?, meaning also ?key-phrase?, to refer to both single words or phrases that are highlighted.",
        "30 2 Related Work Related work to ours can be found in: (1) natural language processing (NLP) literature about key-phrase and keyword extraction (Section 2.1), and (2) accessibility literature about dyslexia and keywords (Section 2.2).",
        "2.1 Key-phrase and Keyword Extraction There is a vast amount of NLP literature on key-phrase extraction (Kim et al., 2010; Witten et al., 1999; Frank et al., 1999).",
        "The semantic data provided by key-phrase extraction can be used as metadata for refining NLP applications, such as summarization (D?Avanzo and Magnini, 2005; Lawrie et al., 2001), text ranking (Mihalcea and Tarau, 2004), indexing (Medelyan and Witten, 2006), query expansion (Song et al., 2006), or document management and topic search (Gutwin et al., 1999).",
        "The closest work to ours is (Turney, 1999) because they highlight key-phrases in the text to facilitate its skimming.",
        "They compare the highlighting outputs of two different systems, Search 97 and GenEx, using six corpora belonging to different genre.",
        "2.2 Accessibility In accessibility and education literature, highlighting keywords is a broadly recommended learning strategy (Weinstein and Mayer, 1986).",
        "Regarding students with dyslexia, teachers are encouraged to highlight keywords to make texts more accessible (Peer and Reid, 2001; Hargreaves, 2007).",
        "These recommendations are based on qualitative analysis and direct observations with students.",
        "In the applications for people with dyslexia highlighting is used not for keywords or main ideas but to help users for tracking their position when reading such as in ScreenRuler (ClaroSoft- ware, 2012).",
        "Sometimes highlighting is used simultaneously with text-to-speech technology (Kanvinde et al., 2012; ClaroSoftware, 2012).",
        "In the SeeWord tool for MS Word (Dickinson et al., 2002; Gregor et al., 2003), highlighting is used on the letters where people with dyslexia normally make mistakes in order to attract the user's attention.",
        "Previous studies similar to ours have used eye-tracking to show how people with dyslexia can read significantly faster as using certain font types (Rello and Baeza-Yates, 2013) or font sizes (O?Brien et al., 2005; Dickinson et al., 2002; Rello et al., 2013c).",
        "2.3 What is Missing?",
        "First, we did not find any study that measured objectively the impact of highlighting keywords in a text on the readability and comprehensibility for people with dyslexia.",
        "Second, to the best of our knowledge, there are no studies in assistive technology that uses an NLP based engine to highlight keywords for people with dyslexia.",
        "In this work we address the first issue, taking the second one into consideration.",
        "Hence, we emulated in the experiment the output that a potential NLP tool would give for highlighting the main ideas in the text.",
        "3 Methodology To study the effect of keywords on readability and comprehensibility of texts on the screen, we conducted an experiment where 62 participants (31 with dyslexia) had to read two texts on a screen, where one of them had the main ideas highlighted using boldface.",
        "Readability and comprehensibility were measured via eye-tracking and comprehension tests, respectively.",
        "The participants?",
        "preferences were gathered via a subjective ratings questionnaire.",
        "3.1 Design In the experiment there was one condition, Key-words, with two levels: [+keywords] denotes the condition where main ideas of the text were highlighted in boldface and [?keywords] denotes the condition where the presentation of the text was not modified.",
        "The experiments followed a within-subjects de-sign, so every participant contributed to each of the levels of the condition.",
        "The order of the conditions was counter-balanced to cancel out sequence effects.",
        "When measuring the reading performance of people with dyslexia we need to separate readability 3 from comprehensibility 4 because they are not necessarily related.",
        "In the case of dyslexia, texts that might seen not readable for the general popu-lation, such as texts with errors, can be better understood by people with dyslexia, and vice versa, 3 The ease with which a text can be read.",
        "4 The ease with which a text can be understood.",
        "31 people with dyslexia find difficulties with standard texts (Rello and Baeza-Yates, 2012).",
        "To measure readability we consider two dependent variables derived from the eye-tracking data: Reading Time and Fixation Duration.",
        "To measure comprehensibility we used a comprehension score as dependent variable.",
        "?",
        "Fixation Duration.",
        "When reading a text, the eye does not move contiguously over the text, but alternates saccades and visual fixations, that is, jumps in short steps and rests on parts of the text.",
        "Fixation duration denotes how long the eye rests on a single place of the text.",
        "Fixation duration has been shown to be a valid indicator of readability.",
        "According to (Rayner and Duffy, 1986; Hy?on?a and Olson, 1995), shorter fixations are associated with better readability, while longer fixations can indicate that the processing load is greater.",
        "On the other hand, it is not directly proportional to reading time as some people may fixate more often in or near the same piece of text (re-reading).",
        "Hence, we used fixation duration average as an objective approximation of readability.",
        "?",
        "Reading Time.",
        "The total time it takes a participant to completely read one text.",
        "Shorter reading durations are preferred to longer ones, since faster reading is related to more readable texts (Williams et al., 2003).",
        "There-fore, we use Reading Time, that is, the time it takes a participant to completely read one text, as a measure of readability, in addition to Fixation Duration.",
        "?",
        "Comprehension Score.",
        "To measure text comprehensibility we used inferential items, that is, questions that require a deep understanding of the content of the text.",
        "We used multiple-choice questions with three possible choices, one correct, and two wrong.",
        "We compute the text comprehension score as the number of correct answers divided by the total number of questions.",
        "?",
        "Subjective Ratings.",
        "In addition, we asked the participants to rate on a five-point Likert scale their personal preferences and perception about how helpful the highlighted keywords were.",
        "3.2 Participants We had 62 native Spanish speakers, 31 with a confirmed diagnosis of dyslexia.",
        "5 The ages of the participants with dyslexia ranged from 13 to 37, with a mean age of 21.09 years (s = 8.18).",
        "The ages of the control group ranged from 13 to 40, with a mean age of 23.03 years (s = 7.10).",
        "Regarding the group with dyslexia, three of them were also diagnosed with attention deficit disorder.",
        "Fifteen people were studying or already finished university degrees, fourteen were attending school or high school, and two had no higher education.",
        "All participants were frequent readers and the level of education was similar for the control group.",
        "3.3 Materials In this section we describe how we designed the texts and keywords that were used as study mate-rial, as well as the comprehension and subjective ratings questionnaires.",
        "Base Texts.",
        "We picked two similar texts from the Spanish corpus Simplext (Bott and Saggion, 2012).",
        "To meet the comparability requirements among the texts belonging to the same experiment, we adapted the texts maintaining as much as possible the original text.",
        "We matched the readability of the texts by making sure that the parameters commonly used to compute readability (Drndare- vic and Saggion, 2012), had the same or similar values.",
        "Both texts: (a) are written in the same genre (news); (b) are about similar topics (culture); (c) have the same number of words (158 words): (d) have a similar word length average (4.83 and 5.61 letters); (e) are accessible news, readable for the general public so they contained no rare or technical words, which present an extra difficulty for people with dyslexia (Rello et al., 2013a).",
        "(f) have the same number of proper names (one per text); 5 All of them presented official clinical results to prove that dyslexia was diagnosed in an authorized center or hospital.",
        "The Catalonian protocol of dyslexia diagnosis (Speech Therapy Association of Catalonia, 2011) does not consider different kinds of dyslexia.",
        "32 The Museo Picasso M?laga includes new works of the artist in its permanent collection The Andalusian Minister of Culture, Paulino Plata, presented a new reorganization of the permanent collection of the Picasso Museum that, coinciding with the birth anniversary of the painter, incorporates a wide selection of works by Pablo Picasso provided by the Almine and Bernard Ruiz-Picasso Foundation for Art.",
        "Paintings, sculptures and ceramics from different periods and styles compose this set of 43 pieces given for 15 years by the mentioned foundation.",
        "The incorporation of these creations assumes, according to the Andalusian Council, a valuable contribution to the permanent collection of the Museum Picasso M?laga.",
        "In this way, a visitor can now contemplate paintings and sculptures that, for the first time, are exposed in the gallery.",
        "Siguiente Figure 1: Example slide used in the experiment.",
        "(g) have the same number of sentences (five per text) and similar sentence complexity (three sentences per text contain relative clauses); (h) one text has two numerical expressions (Rello et al., 2013b) and the other has two foreign words (Cuetos and Valle, 1988), both being elements of similar difficulty; and (i) have the same number of highlighted key-phrases.",
        "An example of a text used (translation from Spanish 6 ) is given in Figure 1.",
        "Keywords.",
        "For creating the keywords we highlighted using boldface the words which contained the main semantic meaning (focus) of the sentence.",
        "This focus normally corresponds with the direct object and contains the new and most relevant information of the sentence (Sperber and Wil-son, 1986).",
        "We only focused on the main sen-tences; subordinate or relative clauses were dismissed.",
        "For the syntactic analysis of the sentences we used Connexor's Machinese Syntax (Connexor Oy, 2006), a statistical syntactic parser that employes a functional dependency grammar (Tapanainen and J?arvinen, 1997).",
        "We took direct objects parsed by Connexor without correcting the output.",
        "Comprehension Questionnaires.",
        "For each text we manually create three inferential items.",
        "The order of the correct answer was counterbalanced and all questions have similar difficulty.",
        "An example question is given in Figure 2.",
        "Subjective Questionnaire.",
        "The participants rated how much did the keywords helped their reading, 6 www.luzrello.com/picasso El texto habla de: ?The text is about:?",
        "?",
        "Sobre la obra del pintor y escultor Picasso.",
        "?The work of the painter and sculptor Picasso.?",
        "?",
        "Sobre la Fundaci?on Almine y Bernard Ruiz-Picasso para el Arte.",
        "?The Almine and Bernard Ruiz-Picasso Foundation for Arts.?",
        "?",
        "Sobre incorporaci?on de nuevas obras en el museo Picasso de M?alaga.",
        "?About incorporation of new works in the Picasso Museum of Malaga.?",
        "Figure 2: Comprehension questionnaire item.",
        "their ease to remember the text, and to which extent would they like to find keywords in texts.",
        "Text Presentation.",
        "The presentation of the text has an effect on reading speed of people with dyslexia (Kurniawan and Conroy, 2006; Gregor and Newell, 2000).",
        "Therefore, we used a text layout that follows the recommendations of previous research.",
        "As font type, we chose Arial, sans serif, as recommended in (Rello and Baeza-Yates, 2013).",
        "The text was left-justified, as recommended by the British Association of Dyslexia (British Dyslexia Association, 2012).",
        "Each line did not exceeded 62 characters/column, the font size was 20 point, and the colors used were black font with creme background, 7 as recommended in (Rello et al., 2012).",
        "3.4 Equipment The eye-tracker used was the Tobii T50 that has a 17-inch TFT monitor with a resolution of 1024?768 pixels.",
        "It was calibrated for each participant and the light focus was always in the same position.",
        "The time measurements of the eye-tracker have a precision of 0.02 seconds.",
        "The dis-7 The CYMK are creme (FAFAC8) and black (000000).",
        "Color difference: 700.",
        "Brightness difference: 244.",
        "33 tance between the participant and the eye-tracker was constant (approximately 60 cm.",
        "or 24 in.)",
        "and controlled by using a fixed chair.",
        "3.5 Procedure The sessions were conducted at Universitat Pompeu Fabra in a quiet room and lasted from 20 to 30 minutes.",
        "First, we began with a questionnaire to collect demographic information.",
        "Then, we conducted the experiment using eye-tracking.",
        "The participants were asked to read the texts in silence and to complete the comprehension tests after each text read.",
        "Finally, we carried out the subjective ratings questionnaire.",
        "4 Results None of the datasets were normally distributed (Shapiro-Wilk test) and neither of them had an homogeneous variance (Levene test).",
        "Hence, to study the effect of Keywords on readability and comprehensibility we used the Wilcoxon non-parametric test for repeated measures.",
        "4.1 Differences between Groups We found a significant difference between the groups regarding Reading Time (W = 2578.5, p < 0.001), Fixation Duration (W = 2953, p < 0.001) and Comprehension Score (W = 1544, p = 0.040).",
        "Participants with dyslexia had lower comprehension scores and longer reading times and fixations than participants from the control group (see Table 1).",
        "4.2 Readability We did not find a significant effect of Keywords on Reading Time for the participants with dyslexia (W = 210, p = 0.688) and for the participants without dyslexia (W = 702.5, p = 0.351).",
        "Similarly, there were found no significant effects of Keywords on Fixation Duration for the participants with dyslexia (W = 259.5, p = 0.688) or without dyslexia (W = 862, p = 0.552).",
        "4.3 Comprehension For the participants with dyslexia, we found a significant effect on the Comprehension Score (W = 178.5, p = 0.022).",
        "Text with highlighted keywords led to significantly higher comprehension scores in this target group.",
        "For the control group we did not find an effect on the Comprehension Score (W = 740, p = 0.155).",
        "4.4 Subjective Ratings The debate of what analyses are admissible for Likert scales ?",
        "parametric or non-parametric tests?",
        "is pretty contentious (Carifio and Perla, 2008).",
        "A Shapiro-Wilk test showed that the datasets were not normally distributed.",
        "Hence, we also used the Wilcoxon non-parametric test.",
        "?",
        "Readability.",
        "We found no significant differences between the groups regarding how much highlighting keywords helped them reading the text (W = 504.5, p = 0.316).",
        "Both groups found that keywords can slightly help their reading (x?",
        "= 3, x?",
        "= 3.0, s = 1.155) 8 for the participants with dyslexia, and (x?",
        "= 3, x?",
        "= 2.8, s = 0.966) for the control group.",
        "?",
        "Memorability.",
        "We found no significant differences between the groups regarding if highlighting keywords help to memorize the text (W = 484, p = 0.493).",
        "Both agree that keywords help them to remember the text moderately (x?",
        "= 4, x?",
        "= 3.636, s = 1.002) for the participants with dyslexia and (x?",
        "= 4, x?",
        "= 3.450, s = 1.085) for the control group.",
        "?",
        "Preferences.",
        "Also, no differences between groups were found regarding their preferences in finding highlighted keywords in the texts (W = 463, p = 0.727).",
        "Participants with dyslexia would like to find texts including highlighted keywords (x?",
        "= 4, x?",
        "= 3.636, s = 1.136), as well as in the control group (x?",
        "= 4, x?",
        "= 3.600, s = 1.057).",
        "5 Discussion Regarding the differences between the groups, our results are consistent with other eye-tracking studies to diagnose dyslexia that found statistical differences (Eden et al., 1994).",
        "8 We use x?",
        "for the median, and s for the standard deviation.",
        "34 Dependent Variable [+Keywords] [?Keywords ] (?",
        "?",
        "s) Group with Dyslexia Reading Time (s) 59.98 ?",
        "25.32 53.71 ?",
        "18.42 Fixation Duration (s) 0.22 ?",
        "0.06 0.23 ?",
        "0.060 Comprehension Score (%) 100 ?",
        "0 77.27 ?",
        "42.89 Control Group Reading Time (s) 36.31 ?",
        "15.17 33.81 ?",
        "12.82 Fixation Duration (s) 0.18 ?",
        "0.04 0.19 ?",
        "0.04 Comprehension Score (%) 100 ?",
        "0 94.87 ?",
        "22.35 Table 1: Results of the Keywords experiment.",
        "5.1 Hypothesis 1 Shorter reading times and fixation durations are associated with better readability (Just and Car-penter, 1980).",
        "Since Keywords had no significant effect on readability, we cannot confirm H.1: The presence of highlighted keywords in the text increases readability for people with dyslexia.",
        "One possible reason for this is that text presentation might only have an impact on readability when the whole text is modified, not only portions of it.",
        "Most probably, if one text was presented all in boldface or italics and the other one in roman, significant differences could have been found as in (Rello and Baeza-Yates, 2013) where the effect of different font styles was evaluated.",
        "Another explanation could be that the text might look different to what the participants were used to see and participants might need some time to get used to highlighted keywords in the text before testing readability effects.",
        "From the content point of view, the fact that the readability did not change as expected, since the content of the text is not modified in any of the conditions.",
        "5.2 Hypothesis 2 Because participants with dyslexia had a significantly increase in text comprehension with texts having highlighted keywords, our findings support H.2: The presence of highlighted keywords in the text increases comprehensibility for people with dyslexia.",
        "This improvement might be due to the possibility that keywords might help to remember the text better.",
        "This is consistent with the pedagogic literature that recommends this strategy for learning and retaining text content (Weinstein and Mayer, 1986).",
        "5.3 Subjective Perception of Keywords The fact that using keywords for learning is a shared strategy for both groups (Weinstein and Mayer, 1986), may explain that no significant differences between groups were found regarding their preference and perception of keywords on readability and memorability.",
        "Also, highlighted keywords in bold are found in general school books, not only in materials for people with dyslexia, so both groups were familiar with the conditions.",
        "5.4 Limitations This study has at least two limitations.",
        "First, the study was performed with a manually annotated dataset.",
        "These annotations were based on the output of the Connexor parser.",
        "We have not found any evaluation of Connexor's accuracy when parsing syntactic constituents.",
        "Nevertheless, it has been observed that the accuracy for direct objects in Spanish achieves results that varies from 85.7% to 93.1%, depending on the test set (Padr?o et al., 2013).",
        "Second, the participants read only two texts because we did not wanted to fatigue participants with dyslexia.",
        "Now that we have observed that they could have read more texts, we will carry out further studies with more texts that will incorporate automatic keyword extraction.",
        "6 Conclusions and Future Work Our main conclusion is that highlighted keywords in the text increases the comprehension by people with dyslexia.",
        "For the control group no effects were found.",
        "Our results support previous educational recommendations by adding the analysis of the impact of highlighting keywords using objective measures.",
        "35 These results can have impact on systems that rely on text as the main information medium.",
        "By applying keyword extraction automatically and highlighting them, digital texts could become easier to understand by people with dyslexia.",
        "Future work include the integration of automatic keyword extraction and its evaluation using a larger number of texts.",
        "Also, different strategies to select keywords will be explored and the comprehension questionnaires will be enriched combining inferential and literal questions.",
        "Future work also includes testing memorability using objective measures in addition to the subjective responses of the participants.",
        "Acknowledgements We are grateful to the three anonymous reviewers for their comments and suggestions.",
        "We acknowledge the support from grant TIN2012-38584-C06-03 (SKATER-UPF-TALN) from Min-isterio de Econom?",
        "?a y Competitividad, Secretar?",
        "?a de Estado de Investigaci?on, Desarrollo e Inno-vaci?on, Spain.",
        "References"
      ]
    }
  ]
}
