{
  "info": {
    "authors": [
      "Xiaolin Wang",
      "Masao Utiyama",
      "Andrew Finch",
      "Eiichiro Sumita"
    ],
    "book": "ACL",
    "id": "acl-P14-2122",
    "title": "Empirical Study of Unsupervised Chinese Word Segmentation Methods for SMT on Large-scale Corpora",
    "url": "https://aclweb.org/anthology/P14-2122",
    "year": 2014
  },
  "references": [
    "acl-C08-1128",
    "acl-C10-1092",
    "acl-D09-1075",
    "acl-I05-3017",
    "acl-I05-3027",
    "acl-I08-1002",
    "acl-J01-3002",
    "acl-J03-1002",
    "acl-J93-2003",
    "acl-P02-1040",
    "acl-P03-1021",
    "acl-P06-1085",
    "acl-P06-1124",
    "acl-P07-2045",
    "acl-P09-1012",
    "acl-W08-0336"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the 52nd Annual Meeting of the Association for Computational Linguistics (Short Papers), pages 752?758, Baltimore, Maryland, USA, June 23-25 2014. c?2014 Association for Computational Linguistics Empirical Study of Unsupervised Chinese Word Segmentation Methods for SMT on Large-scale Corpora Xiaolin Wang Masao Utiyama Andrew Finch Eiichiro Sumita National Institute of Information and Communications Technology {xiaolin.wang,mutiyama,andrew.finch,eiichiro.sumita}@nict.go.jp",
        "Abstract",
        "Unsupervised word segmentation (UWS) can provide domain-adaptive segmentation for statistical machine translation (SMT) without annotated data, and bilingual UWS can even optimize segmentation for alignment.",
        "Monolingual UWS approaches of explicitly modeling the probabilities of words through Dirichlet process (DP) models or Pitman-Yor process (PYP) models have achieved high accuracy, but their bilingual counterparts have only been carried out on small corpora such as basic travel expression corpus (BTEC) due to the computational complexity.",
        "This paper proposes an efficient unified PYP-based monolingual and bilingual UWS method.",
        "Experimental results show that the proposed method is comparable to supervised segmenters on the in-domain NIST OpenMT corpus, and yields a 0.96 BLEU relative increase on NTCIR PatentMT corpus which is out-of-domain."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Many languages, especially Asian languages such as Chinese, Japanese and Myanmar, have no explicit word boundaries, thus word segmentation (WS), that is, segmenting the continuous texts of these languages into isolated words, is a prerequisite for many natural language processing applications including SMT.",
        "Though supervised-learning approaches which involve training segmenters on manually segmented corpora are widely used (Chang et al., 2008), yet the criteria for manually annotating words are arbitrary, and the available annotated corpora are limited in both quantity and genre variety.",
        "For example, in machine transla-tion, there are various parallel corpora such as BTEC for tourism-related dialogues (Paul, 2008) and PatentMT in the patent domain (Goto et al., 2011)1, but researchers working on Chinese-related tasks often use the Stanford Chinese segmenter (Tseng et al., 2005) which is trained on a small amount of annotated news text.",
        "In contrast, UWS, spurred by the findings that infants are able to use statistical cues to determine word boundaries (Saffran et al., 1996), relies on statistical criteria instead of manually crafted standards.",
        "UWS learns from unsegmented raw text, which are available in large quantities, and thus it has the potential to provide more accurate and adaptive segmentation than supervised approaches with less development effort being required.",
        "The approaches of explicitly modeling the probability of words(Brent, 1999; Venkataraman, 2001; Goldwater et al., 2006; Goldwater et al., 2009; Mochihashi et al., 2009) significantly outperformed a heuristic approach (Zhao and Kit, 2008) on the monolingual Chinese SIGHAN-MSR corpus (Emerson, 2005), which inspired the work of this paper.",
        "However, bilingual approaches that model word probabilities suffer from computational complexity.",
        "Xu et al. (2008) proposed a bilingual method by adding alignment into the generative model, but was only able to test it on small-scale BTEC data.",
        "Nguyen et al. (2010) used the local best alignment to increase the speed of the Gibbs sampling in training but the impact on accuracy was not explored.",
        "This paper is dedicated to bilingual UWS on large-scale corpora to support SMT.",
        "To this end, we model bilingual UWS under a similar framework with monolingual UWS in order to improve efficiency, and replace Gibbs sampling with expectation maximization (EM) in training.",
        "We aware that variational bayes (VB) may be used for speeding up the training of DP-based 1http://ntcir.nii.ac.jp/PatentMT 752 or PYP-based bilingual UWS.",
        "However, VB requires formulating the m expectations of (m?1)- dimensional marginal distributions, where m is the number of hidden variables.",
        "For UWS, the hidden variables are indicators that identify sub-strings of sentences in the corpus as words.",
        "These variables are large in number and it is not clear how to apply VB to UWS, and as far the authors aware there is no previous work related to the application of VB to monolingual UWS.",
        "Therefore, we have not explored VB methods in this paper, but we do show that our method is superior to the existing methods.",
        "The contributions of this paper include, ?",
        "state-of-the-art accuracy in monolingual UWS; ?",
        "the first bilingual UWS method practical for large corpora; ?",
        "improvement of BLEU scores compared to supervised Stanford Chinese word seg-menter.",
        "2 Methods This section describes our unified monolingual and bilingual UWS scheme.",
        "Table 1 lists the main notation.",
        "The set F is chosen to represent an unsegmented foreign language sentence (a sequence of characters), because an unsegmented sentence can be seen as the set of all possible segmentations of the sentence denoted F , i.e. F ?",
        "F .",
        "Notation Meaning F an unsegmented foreign sentence F k ?",
        "k unsegmented substring of the underlying string of F from k to k?",
        "F a segmented foreign sentence f j the j-th foreign word M monolingual segmentation model P M (x) probability of x being a word according to M E a tokenized English sentence e i the i-th English word (F ,E) a bilingual sentence pair B bilingual segmentation model P B (x|e i ) probability of x being a word according to B given e i Table 1: Main Notation.",
        "Monolingual and bilingual WS can be formulated as follows, respectively, ?",
        "F (F) = argmax F?F P (F |F ,M), (1) ?",
        "F (F , E) = argmax F?F ?",
        "a P (F, a|F , E,B), (2) where a is an alignment between F and E. The English sentence E is used in the generation of a segmented sentence F .",
        "UWS learns models by maximizing the likelihood of the unsegmented corpus, formulated as, ?",
        "M = argmax M ?",
        "F?F ( ?",
        "F?F P (F |M) ) , (3) ?",
        "B = argmax B ?",
        "(F ,E)?B ( ?",
        "F?F ?",
        "a P (F, a|F , E,B) ) .",
        "(4) Our method of learning M and B proceeds in a similar manner to the EM algorithm.",
        "The following two operations are performed iteratively for each sentence (pair).",
        "?",
        "Exclude the previous expected counts of the current sentence (pair) from the model, and then derive the current sentence in all possible ways, calculating the new expected counts for the words (see Section 2.1), that is, we calculate the expected probabilities of the Fk?",
        "k being words given the data excluding F , i.e. E F/{F} (P (F k ?",
        "k |F)) = P (F k ?",
        "k |F ,M) in a similar manner to the marginalization in the Gibbs sampling process which we are re-placing; ?",
        "Update the respective model M or B according to these expectations (see Section2.2).",
        "2.1 Expectation 2.1.1 Monolingual Expectation P (F k ?",
        "k |F ,M) is the marginal probability of all the possible F ?",
        "F that contain Fk?",
        "k as a word, which can be calculated efficiently through dynamic programming (the process is similar to the foreward-backward algorithm in training a hidden Markov model (HMM) (Rabiner, 1989)): P a (k) = U ?",
        "u=1 P a (k ?",
        "u)P M (F k k?u ) P b (k ? )",
        "= U ?",
        "u=1 P b (k ?",
        "+ u)P M (F k ?",
        "+u k ? )",
        "P (F k ?",
        "k |F ,M) = P a (k)P M (F k ?",
        "k )P b (k ?",
        "), (5) 753 where U is the predefined maximum length of foreign language words, P a (k) and P b (k ? )",
        "are the forward and backward probabilities, respectively.",
        "This section uses a unigram model for description convenience, but the method can be extended to n-gram models.",
        "2.1.2 Bilingual Expectation P (F k ?",
        "k |F , E,B) is the marginal probability of all the possible F ?",
        "F that contain Fk?",
        "k as a word and are aligned with E, formulated as: P (F k ?",
        "k |F , E,B) = ?",
        "F?F F k ?",
        "k ?F ?",
        "a P (F, a|E,B) ?",
        "?",
        "F?F F j k =F k ?",
        "k ?",
        "a J ?",
        "j=1 P (a j |j, I, J)P B (f j |e a j ) = ?",
        "F?F f j k =F k ?",
        "k J ?",
        "j=1 ?",
        "a P (a j |j, I, J)P B (f j |e a j ), (6) where J and I are the number of foreign and English words, respectively, and a j is the position of the English word that is aligned to f j in the alignment a.",
        "For the alignment we employ an approximation to IBM model 2 (Brown et al., 1993; Och and Ney, 2003) described below.",
        "We define the conditional probability of f j given the corresponding English sentence E and the model B as: P B (f j |E) = ?",
        "a P (a j |j, I, J)P B (f j |e a j ) (7) Then, the previous dynamic programming method can be extended to the bilingual expectation P a (k|E) = U ?",
        "u=1 P a (k ?",
        "u|E)P B (F k k?u |E) P b (k ?",
        "|E) = U ?",
        "u=1 P b (k ?",
        "+ u|E)P B (F k ?",
        "+u k ?",
        "|E) P (F k ?",
        "k |F , E,B) = P a (k|E)P B (F k ?",
        "k |E)P b (k ?",
        "|E).",
        "(8) Eq. 7 can be rewritten (as in IBM model 2): P B (f j |E) = I ?",
        "i=1 P ?",
        "(i|j, I, J)P B (f j |e i ) (9) P ?",
        "(i|j, I, J) = ?",
        "a:a j =i P (a j |, j, I, J) In order to maintain both speed and accuracy, the following window function is adopted P ?",
        "(i|j, I, J) ?",
        "P ?",
        "(i|k, I,K) = ?",
        "?",
        "?",
        "e ?|i?kI/K| /?",
        "|i?",
        "kI/K| 6 ?",
        "b /2 ?",
        "?",
        "e i is empty word 0 otherwise (10) where K is the number of characters in F , and the k-th character is the start of the word f j , since j and J are unknown during the computation of dynamic programming.",
        "?",
        "b is the window size, ?",
        "?",
        "is the prior probability of an empty English word, and ?",
        "ensures all the items sum to 1.",
        "2.2 Maximization Inspired by (Teh, 2006; Mochihashi et al., 2009; Neubig et al., 2010; Teh and Jordan, 2010), we employ a Pitman-Yor process model to build the segmentation model M or B. The monolingual model M is P M (f j ) = max ( n(f j )?",
        "d, 0 ) + (?",
        "+ d ?",
        "n M )G 0 (f j ) ?",
        "f ?",
        "j n(f ?",
        "j ) + ?",
        "n M = ?",
        "?",
        "{f j |n(f j ) > d} ?",
        "?",
        ", (11) where f j is a foreign language word, and n(f j ) is the observed counts of f j , ?",
        "is named the strength parameter, G 0 (f j ) is named the base distribution of f j , and d is the discount.",
        "The bilingual model is P B (f j |e i ) = max ( n(f j , e i )?",
        "d, 0 ) + (?",
        "+ d ?",
        "n e i )G 0 (f j |e i ) ?",
        "f ?",
        "j n(f ?",
        "j , e i ) + ?",
        "n e i = ?",
        "?",
        "{x |n(x, e i ) > d} ?",
        "?",
        ".",
        "(12) In Eqs.",
        "11 and 12, n(f j ) = ?",
        "F?F P (f j |F ,M) (13) n(f j , e i ) = ?",
        "(F ,E)?B P (f j |F , E,B) P ?",
        "(i|j, I, J)P B (f j |e i ) ?",
        "I i ?",
        "=1 P ?",
        "(i ?",
        "|j, I, J)P B (f j |e i ? )",
        ".",
        "(14) 754 3 Complexity Analysis The computational complexity of our method is linear in the number of iterations, the size of the corpus, and the complexity of calculating the expectations on each sentence or sentence pair.",
        "In practical applications, the size of the corpus is fixed, and we found empirically that the number of iterations required by the proposed method for convergence is usually small (less than five itera-tions).",
        "We now look in more detail at the complexity of the expectation calculation in monolingual and bilingual models.",
        "The monolingual expectation is calculated according to Eq. 5; the complexity is linear in the length of sentences and the square of the predefined maximum length of words.",
        "Thus its overall complexity is O unigram monoling = O(Ni|F|KU 2 ), (15) where Ni is the number of iterations, K is the average number of characters per sentence, and U is the predefined maximum length of words.",
        "For the monolingual bigram model, the number of states in the HMM is U times more than that of the monolingual unigram model, as the states at specific position of F are not only related to the length of the current word, but also related to the length of the word before it.",
        "Thus its complexity is U2 times the unigram model's complexity: O bigram monoling = O(Ni|F|KU 4 ).",
        "(16) The bilingual expectation is given by Eq. 8, whose complexity is the same as the monolingual case.",
        "However, the complexity of calculating the transition probability, in Eqs.",
        "9 and 10, is O(?",
        "b ).",
        "Thus its overall complexity is: O unigram biling = O(Ni|F|KU 2 ?",
        "b ).",
        "(17) 4 Experiments In this section, the proposed method is first validated on monolingual segmentation tasks, and then evaluated in the context of SMT to study whether the translation quality, measured by BLEU, can be improved.",
        "4.1 Experimental Settings 4.1.1 Experimental Corpora Two monolingual corpora and two bilingual corpora are used (Table 2).",
        "CHILDES (MacWhin- ney and Snow, 1985) is the most common test Corpus Type # Sentences # Characters CHILDES Mono.",
        "9,790 95,809 SIGHAN-MSR Mono.",
        "90,903 4,234,824 OpenMT06 Biling.",
        "437,004 19,692,605 PatentMT9 Biling.",
        "1,004,000 63,130,757 Table 2: Experimental Corpora corpus for UWS methods.",
        "The SIGHAN-MSR corpus (Emerson, 2005) consists of manually segmented simplified Chinese news text, released in the SIGHAN bakeoff 2005 shared tasks.",
        "The first bilingual corpus: OpenMT06 was used in the NIST open machine translation 2006 Evaluation 2.",
        "We removed the United Nations corpus and the traditional Chinese data sets from the constraint training resources.",
        "The data sets of NIST Eval 2002 to 2005 were used as the development for MERT tuning (Och, 2003).",
        "This data set mainly consists of news text 3.",
        "PatentMT9 is from the shared task of NTCIR-9 patent machine translation .",
        "The training set consists of 1 million parallel sentences extracted from patent documents, and the development set and test set both consist of 2000 sentences.",
        "4.1.2 Performance Measurement and Baseline Methods For the monolingual tasks, the F 1 score against the gold annotation is adopted to measure the accuracy.",
        "The results reported in related papers are listed for comparison.",
        "For the bilingual tasks, the publicly available system of Moses (Koehn et al., 2007) with default settings is employed to perform machine transla-tion, and BLEU (Papineni et al., 2002) was used to evaluate the quality.",
        "Character-based segmen-tation, LDC segmenter and Stanford Chinese segmenters were used as the baseline methods.",
        "4.1.3 Parameter settings The parameters are tuned on held-out data sets.",
        "The maximum length of foreign language words is set to 4.",
        "For the PYP model, the base distribution adopts the formula in (Chung and Gildea, 2009), and the strength parameter is set to 1.0, and the discount is set to 1.0?",
        "10?6.",
        "For bilingual segmentation,the size of the alignment window is set to 6; the probability ?",
        "?",
        "of foreign language words being generated by an empty 2http://www.itl.nist.gov/iad/mig/ /tests/mt/2006/ 3It also contains a small number of web blogs 755 Method Accuracy Time CHILD.",
        "MSR CHILD.",
        "MSR NPY(bigram)a 0.750 0.802 17 m ?",
        "NPY(trigram)a 0.757 0.807 ?",
        "?",
        "HDP(bigram)b 0.723 ?",
        "10 h ?",
        "Fitnessc ?",
        "0.667 ?",
        "?",
        "Prop.",
        "(unigram) 0.729 0.804 3 s 50 s Prop.",
        "(bigram) 0.774 0.806 15 s 2530 s a by (Mochihashi et al.,2009); b by (Goldwater et al.,2009); c by (Zhao and Kit, 2008).",
        "Table 3: Results on Monolingual Corpora.",
        "English word, was set to 0.3.",
        "The training was started from assuming that there was no previous segmentations on each sentence (pair), and the number of iterations was fixed.",
        "It was set to 3 for the monolingual unigram model, and 2 for the bilingual unigram model, which provided slightly higher BLEU scores on the development set than the other settings.",
        "The monolingual bigram model, however, was slower to converge, so we started it from the segmentations of the unigram model, and using 10 iterations.",
        "4.2 Monolingual Segmentation Results In monolingual segmentation, the proposed methods with both unigram and bigram models were tested.",
        "Experimental results show that they are competitive to state-of-the-art baselines in both accuracy and speed (Table 3).",
        "Note that the comparison of speed is only for reference because the times are obtained from their respective papers.",
        "4.3 Bilingual Segmentation Results Table 4 presents the BLEU scores for Moses using different segmentation methods.",
        "Each experiment was performed three times.",
        "The proposed method with monolingual bigram model performed poorly on the Chinese monolingual segmentation task; thus, it was not tested.",
        "We intended to test (Mochi- hashi et al., 2009), but found it impracticable on large-scale corpora.",
        "The experimental results show that the proposed UWS methods are comparable to the Stanford segmenters on the OpenMT06 corpus, while achieves a 0.96 BLEU increase on the PatentMT9 corpus.",
        "This is because this corpus is out-of-domain for the supervised segmenters.",
        "The CTB and PKU Stanford segmenter were both trained on annotated news text, which was the major domain of OpenMT06.",
        "Method BLEU OpenMT06 PatentMT9 Character 29.50 ?",
        "0.03 28.36 ?",
        "0.09 LDC 31.33 ?",
        "0.10 30.22 ?",
        "0.14 Stanford(CTB) 31.68 ?",
        "0.25 30.77 ?",
        "0.13 Stanford(PKU) 31.54 ?",
        "0.13 30.86 ?",
        "0.04 Prop.(mono.)",
        "31.47 ?",
        "0.18 31.62 ?",
        "0.06 Prop.(biling.)",
        "31.61 ?",
        "0.14 31.73 ?",
        "0.05 Table 4: Results on Bilingual Corpora.",
        "Method Time OpenMT06 PatentMT9 Prop.(mono.)",
        "28 m 1 h 01 m Prop.(biling.)",
        "2 h 25 m 5 h 02 m Table 5: Time Costs on Bilingual Corpora.",
        "Table 5 presents the run times of the proposed methods on the bilingual corpora.",
        "The program is single threaded and implemented in C++.",
        "The time cost of the bilingual models is about 5 times that of the monolingual model, which is consistent with the complexity analysis in Section 3.",
        "5 Conclusion This paper is devoted to large-scale Chinese UWS for SMT.",
        "An efficient unified monolingual and bilingual UWS method is proposed and applied to large-scale bilingual corpora.",
        "Complexity analysis shows that our method is capable of scaling to large-scale corpora.",
        "This was verified by experiments on a corpus of 1-million sentence pairs on which traditional MCMC approaches would struggle (Xu et al., 2008).",
        "The proposed method does not require any annotated data, but the SMT system with it can achieve comparable performance compared to state-of-the-art supervised word segmenters trained on precious annotated data.",
        "Moreover, the proposed method yields 0.96 BLEU improvement relative to supervised word segmenters on an out-of-domain corpus.",
        "Thus, we believe that the proposed method would benefit SMT related to low-resource languages where annotated data are scare, and would also find application in domains that differ too greatly from the domains on which supervised word segmenters were trained.",
        "In future research, we plan to improve the bilingual UWS through applying VB and integrating more accurate alignment models such as HMM models and IBM model 4.",
        "756 References"
      ]
    }
  ]
}
