{
  "info": {
    "authors": [
      "Akira Shimazu",
      "Shozo Naito",
      "Hirosato Nomura"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P87-1018",
    "title": "Semantic Structure Analysis of Japanese Noun Phrases With Adnominal Particles",
    "url": "https://aclweb.org/anthology/P87-1018",
    "year": 1987
  },
  "references": [
    "acl-C86-1045",
    "acl-C86-1147",
    "acl-P83-1007",
    "acl-P84-1109",
    "acl-P85-1004",
    "acl-P85-1025"
  ],
  "sections": [
    {
      "heading": "SEMANTIC STRUCTURE ANALYSIS OF JAPANESE NOUN PHRASES WITH ADNOMINAL PARTICLES Akira SHIMAZU, Show NAITO, and Hirosato NOMURA Basic Research Laboratories, N.T.T. 3-9-11, Midori-cho, Musashino-shi, Tokyo 180, Japan",
      "text": [
        "Abstract Japanese has many noun phrase patterns of the type A no B consisting of two nouns A and B with an adnominal particle no.",
        "As the semantic relations between the two nouns in the noun phrase are not made explicit, the interpretation of the phrases depends mainly on the semantic characteristics of the nouns.",
        "This paper describes the semantic diversity of A no B and a method of semantic analysis for such phrases based on feature unification."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Japanese has many noun phrase patterns of the type A no B.",
        "The noun phrase pattern, which consists of two nouns A and B with an adnominal particle no, and which has at least the same ambiguity as B of A (and some additional ambiguities not found with the equivalent English construction), does not express any explicit semantic relations between the two nouns.",
        "Consequently, its interpretation depends mainly on the semantic characteristics of the nouns.",
        "Furthermore, phrase patterns N1 no N2 no ... no Nn often appear.",
        "Because the number of possible dependencies between the constituents is 21'4 (2n-3)!!",
        "/ n!, semantic analysis of such phrases is necessary to resolve the ambiguities.",
        "To date, there have been no adequate analyses for this linguistic phenomenon, nor have there been any clear methodological proposals for its semantic analysis.",
        "This paper describes a) the semantic diversity of A no B, b) the analysis of the semantic structure for A no B by a unification-based method of semantic function application, c) typical semantic structures of A no B, d) the possibility of paraphrasing A no B as a noun phrase with a relative clause by the addition of a verb, and e) the resolution of ambiguities using contextual information from the viewpoint of relation between A no B and its corresponding relative clause.",
        "Although A no B is a simple form, it is interesting in two respects.",
        "First, A no B represents a general linguistic problem for semantic processing.",
        "The reason is that, in some cases, A or B is a noun form derived from a verb or adjective, thus necessitating the semantic processing of verbs and adjectives.",
        "Second, A no B can be paraphrased as a noun phrase with a relative clause, in just the same way as some English complex nominals 13' 51• Putting it another way, as information is condensed into a simple expression, there are ambiguities as to the semantic relations between the two nouns.",
        "Consequently, contextual analysis plays a crucial part in the resolution of the ambiguities."
      ]
    },
    {
      "heading": "2. Semantic Diversity of A no B",
      "text": [
        "A no B is frequently found in Japanese sentences.",
        "An examination of scientific and newspaper articles showed that the occurrence of A no B accounts for about half the total number of noun phrases in a text The other occurrences are noun phrases with relative clauses, and coordinated noun phrases.",
        "In constructions of the type A no B, A or B can represent either a simple noun, as in Taroo no ie (\"Taro's house\"), NP of the same A no B pattern, as in kariforunta no shuto no jinko (\"the population of the capital of California\"), or NP with a relative clause, as in Watashi ga atta hito no na (\"the name of the person who I met\").",
        "There is also a fourth pattern involving an additional particle such as kara, made, de and so on, as in Tookyoo kara no densha (\"the train from Tokyo\").",
        "This paper deals mainly with constructions of the first type, though the method presented here is also applicable recursively to patterns of the second and third types: this is possible because in such constructions, the semantic features of A (i.e. X no Y, or SY) derive from its head (Y).",
        "In the fourth type, analysis is slightly less straightforward, because the particle does provide some additional useful information.",
        "A no modifies a head B to restrict or clarify the reference\".21 of B.",
        "In the example Sutanfoodo daigaku no kyooju.",
        "(\"professor at Stanford University\"), Satan-foodo daigaku (\"Stanford University\") restricts and clarifies the range of reference for kyooju (\"professor\").",
        "Such A no B constructions can be classified semantically into five main groups according to the characteristics of A and B, as shown in Table 1.",
        "The five main groups can be further classified into a total of about 80 semantic relations.",
        "In the study mentioned above\", the authors examined about ten thousand examples of A no B occurrences, and checked the semantic relations.",
        "The appendix shows the semantic relations together with examples.",
        "It is necessary to analyze these seman",
        "From a different viewpoint, this is a generalization of the method of case frame analysis in which the analysis of the semantic structure of a verb-plus-noun phrase is based on the case-frame of the verb.",
        "That is, when a verb as a functor is applied to a noun phrase as its argument, if the noun phrase and a slot of the case-frame unify, the semantic structure is obtained as a result of assigning the relevant information from the noun phrase to the slot.",
        "So, the analysis is a kind of semantic treatment using the unification-based method.",
        "In this view, the case frames correspond to subcategorization frames, and the analysis corresponds to unifications applied to a subcategorization frame 18.",
        "91.",
        "Characteristics of the function-based analysis are mainly to express input-output relations clearly, and to put stress on a lexical-based method.",
        "As the meaning of A no B depends on the individual A and B, it follows that each lexical entry must have information regarding its \"functionality\".",
        "This is also the method adopted in CUG.",
        "Furthermore, these functors, arguments, and resulting semantic structures are represented as sets of attribute-value pairs, again as in CUG.",
        "This is also similar to frame representations found in Al.",
        "The set of attribute-value pairs associated with a functor noun and an argument noun are generally represented as in Figure 1, and will be called a \"semantic structure\".",
        "The characteristics of these structures are described in Section 3.3.",
        "In the representation, the attributes left and right indicate an argument for a functor word and a position (direction), and the values represent conditions imposed on the argument.",
        "Syncat, semcat and sense indicate syntactic, semantic and head word meaning respectively.",
        "Marker indicates the case particle found as a post-position with the noun phrase.",
        "Fred gives semantic conditions which restrict and clarify the relation between A"
      ]
    },
    {
      "heading": "... value of an object's attribute location",
      "text": [
        "tic relations in such detail in order to produce good quality machine translation from Japanese into English among other tasks.",
        "To date, linguistic processing has not entailed such a detailed classification.",
        "The semantic structure of A no B is generally a function of the meanings of A and B, but the processing is not just a simple computation based on the semantic contents of A and B.",
        "For instance, when B functions as a predicate semantically, there is a case relation between A and B.",
        "However, there are no syntactic clues such as a case particle, unlike in full sentences.",
        "Hence, it is necessary to consider the semantic characteristics of A and B in order to analyze the semantic structure.",
        "Processing of context 1121 is generally necessary to determine the correct semantic structure of A no B uniquely, as A no B is often ambiguous if considered out of context.",
        "For instance, in the case of Furansujin no hanashi (\"speech of a Frenchman\"), there are two possible semantic relations for Furansujin (\"Frenchman\"): i.e. as agent or content of hanashi (\"speech\")."
      ]
    },
    {
      "heading": "3. Semantic Structure Analysis of A no B 3.1 Analysis by Function Application",
      "text": [
        "The semantic structure of A no B is generally analyzed from A and B by \"semantic function application\", which is similar to the idea of function application in the CUG framework (categorial grammar) [4, 131, unification viewing either A or B as a functor, and the other as its argument.",
        "(functor left!",
        "right) = (argument) (functor result) = (semantic-structure)",
        "and B.",
        "Result shows sets of attribute-value pairs obtained by the semantic function application.",
        "In the representation, words in parentheses such as (syncat) and (right pred) are path notations and are used to point to a value in the manner of an index notation191."
      ]
    },
    {
      "heading": "3.2 Semantic Structure Analysis of A no B",
      "text": [
        "The noun phrase A no B is regarded as a composition of A no and B.",
        "Therefore, A no B is composed of A no and B by the function role of either A no or B.",
        "Which of A no or B has a function role depends on syntactic and semantic characteristic as described in section 3.3.",
        "Then A no is regarded as being constructed from A and no.",
        "Accordingly, the semantic structure of A no B is analyzed as follows: First, the functor no gets argument A, and makes a noun phrase A no with the semantic characteristics inherited from A. Secondly, the functor A no or B gets an argument B or A no respectively and makes a noun phrase A no B with the semantic characteristics inherited from B.",
        "The analysis process is shown as follows.",
        "(1) functor: no, argument: A, result: Ano (2) functor: A no, argument: B, result: AnoB, or functor: B, argument: A no, result: AnoB",
        "In the case of A p no B (where p is an additional particle), A and p are combined first.",
        "The semantic structure of A p is almost the same as that of A no except for the additional information derived from the marker p. After this, the final semantic structure is composed in the same way as for A no B.",
        "This paper focuses mainly on the analysis process after constituents of A no B have been found, and does not pay specific attention to the method of how constituents are found, for which purpose the active chart parsing method is used.",
        "With regard to the composition of A no, we take the choice giving no the functor role from the viewpoint of generality, although it is possible to view A as having this role.",
        "No has a functor role that shifts characteristics and functions of A to the semantic structure of A no, and adds a marker feature to the semantic structure of A no.",
        "The representation of no is shown in Figure 2.",
        "In the analysis of A no B, the semantic characteristics and functions of A and B weigh heavily, because although there is an adnominal case particle no, it is semantically rather neutral compared with other case particles.",
        "To put it another way, case particles usually function as explicit indicators of the preferred semantic interpretation.",
        "This fact suggests the significance of studying the method of analysis of A no B.",
        "When A no has a functor role, the functor must get B as its argument and extract a semantic relation between A and B.",
        "For example, in guruupu no shuukaz (\"meeting of a group\"), guruupu no modifies an action nominal and makes a result semantic structure indicating the semantic relation (agent) as in Figure 3.",
        "In the representation > pred indicates a constraint that an argument must have a pred feature.",
        "The main semantic category of A no B is generally taken from the head B of A no B.",
        "However, in some cases the semantics of B are different from those of A no B, and it is necessary to change the semantic cate",
        "gories.",
        "For example, heitai (\"soldier\") is animate, but °mocha no heitai (\"toy soldier\") is not.",
        "Therefore omocha no has the function of changing the semantic category of the head which it modifies.",
        "Such a function is obtained by a kind of overwriting unification (91."
      ]
    },
    {
      "heading": "3.3 Semantic Structures in Five Main Groups",
      "text": [
        "The characteristics of the semantic structures in the five main groups are as follows.",
        "(Case 1) In this case, B, which is the nominal form of a predicate (a verb or an adjective), functions as an argument, and A, which is a semantic case argument of B, functions as a functor.",
        "Notice that when B functions semantically as a predicate, there are two alternatives for the assignment of the functor role.",
        "The first is that the predicate word functions as the functor.",
        "The second is the reverse(41.",
        "This paper adopts the latter way mainly because of the characteristic of free word order in a Japanese sentence.",
        "The semantic structure of A and A no is almost the same except for a marker feature, and has the following functor role: when A no is an obligatory case (argument) of the predicate B, A no unifies with the argument feature of B.",
        "When A no is an optional case (adjunct), the semantic structure of A no is added to that of B as an optional case by unification.",
        "The functor role is added to A by a kind of lexical rule.",
        "Examples are shown in Figures 3 and 4.",
        "(Case 2 and Case 3] In these cases, B represents a kind of case role or attribute respectively, which functions as a predicate.",
        "So, functionality is given to A in the same way as described above.",
        "Examples are shown in Figures 5 and 6.",
        "[Case 4] The reverse case of Case 1, that is, A is the nominal form of a predicate, and B is the semantic case element of the predicate.",
        "So B is a functor and A no is its argument in the reverse way.",
        "The example is shown in Figure 7.",
        "Kooen (\"park\") in the example gets an argument in the opposite direction to that of example 4.",
        "The phrase in this case corresponds to a noun phrase with a relative clause.",
        "So, a feature embedded is used in the representation, that is, it means that the pred feature is introduced from the complement.",
        "(Case 5] Semantic relations in this case are classified mainly into three types : a) relational restriction such as a human relation, b) attributive restriction such as a kind relation and c) situational restriction such as a location relation.",
        "(a) relational restriction: This case includes the relationships between humans, organizations, and whole-part relations.",
        "Generally a predicate role is given to B and a functor role is given to A in the same way as Case 1.",
        "An example is shown in Figure 8.",
        "In the example, sensei (\"teacher\") has a pred feature and is an argument of the functor watashi (\"r).",
        "(b) attributive restriction: A has attributive characteristics such as quantity, kind, degree, and property, and B is generally a thing.",
        "As A functions as a kind of predicate, a predicate feature is assigned to A.",
        "An example is shown in Figure 9 with kooshijima no nuno (\"checkered-pattern cloth\"), where kooshtjuma has a pred feature and is an argument of the functor nuno (\"cloth\").",
        "(c) situational restriction: A has situational meanings such as location, time, source, destination, purpose, and method, and restricts B by the situation.",
        "Like the relational restriction case, B is assigned a predicate feature, and A a functor role as shown in Figure 10.",
        "In the example, doozoo (\"bronze statue\") has a pred feature and is an argument of the functor kooen (\"park\")."
      ]
    },
    {
      "heading": "3.4 Organization of Lexical Information",
      "text": [
        "To assign an appropriate semantic structure to a noun, the following characteristics must be considered: a) A or B which works as a predicate in some cases works as a modifier (argument or adjunct) of a predicate in the other cases, as with kenkyuu (\"research\", \"study\") in the example gengo no kenkyuu (\"study of language\") and kenkyuu no kaishi (\"start of the research\").",
        "Therefore, A or B generally has both roles of a predicate and a modifier.",
        "A no B no C, there are several possibilities as to the word dependency structure.",
        "There are two principal",
        "possibilities: ((Ano B) no C) as in, for example, jiyuu no megami no shashin (\"photograph of the Statue of Liberty\"), and (Ano (Bno C)) as Kariforunia-san no jooshitsu no kome (\"rice of fine qaulaity from California\").",
        "Thus, the middle noun (B) may relate to the words on either side (A and C), or to only the right-hand word (C).",
        "In the first case, the middle noun may be an argument of the predicate on both sides.",
        "In the latter case, the rightmost word C may be an argument of each predicate to the left, the number of which is not in general restricted.",
        "C) There are two cases of (A no (B no C)).",
        "When C is a nominal predicate, A and B might be separate arguments as in Kinoo no Taroo no Sanpo (\"Taro's walk of yesterday\").",
        "When C is an ordinary noun, however, the analysis is further complicated by the fact that implicit predicates such as location, possession, attribution etc., are involved.",
        "For example, in Tookyoo no NTT no biru (\"NTT's building in Tokyo\"), the inner predicate structure for NTT no biru (\"NTT has a building\") is attached to the appropriate argument of the outer predicate Tookyoo no biru (\"building is in Tokyo\").",
        "From the characteristics described above and the method for assigning a functor role to an argument of a predicate, we adopt the method that a functor role is added to a constituent by a kind of lexical rule before function application.",
        "In general, several candidate constituents are made by the feature structure pre-formation.",
        "For example, at the stage of AnoB Ano B, when B is a functor and has a meaning such as location, time and so on, two solutions for B are offered as candidates: one as an argument of Ano, which works as a predicate, and the other as an adjunct."
      ]
    },
    {
      "heading": "4 Correspondence between A no 13 and the Sentence",
      "text": []
    },
    {
      "heading": "4.1 Paraphrase of A no B as a Noun Phrase with a Relative Clause",
      "text": [
        "The expression A no B can be paraphrased into A p V B or A' B, adding an appropriate particle p and verb / adjective V, or reforming A to a verbal form A' if appropriate.",
        "Both A p V and A' are relative clauses.",
        "The paraphrased expression is more informative and some of the ambiguity is resolved.",
        "Paraphrases of A no B in Case 1 - Case 4 are rather easy, as added verbs/ adjectives do not depend so much on context as compared with Case 5.",
        "Noun phrases with a relative clause for each case in the A no B classification are shown in Table 2.",
        "Such paraphrases are obtained by a change from a verb-centered to a noun-centered view.",
        "A no B is generally related to some event or state in a discourse, and the event or state is represented by an appropriate predicate: pred(A, B).",
        "By taking a noun-centered view, the representation is transferred into a representation A [pred(A(•), B)], that is, A in pred(A, B).",
        "The expression that gives the corresponding predicate is taken from the value of the pred attribute in the semantic structure.",
        "A noun phrase paraphrased with a relative clause is generally constructed as follows: 1) the head B is put first, 2) a verb is chosen based on the rel attribute, and put to the left of B, 3) a noun phrase corresponding to the appropriate case role as given by the argument structure of the predicate, is constructed from A and the particle indicated by a default-marker, and put to the left of the verb.",
        "For instance, in zoo no omosa (\"weight of an elephant\"), first, the head omosa is taken; second, verb rnotsu (\"have\") is taken from a value of rel, and put to the left of omosa; third, the agent zoo ga (\"elephant\") is put to the left of omosa.",
        "In this way, the desired complex noun phrase zoo ga motsu omosa (\"weight that an elephant has\") is arrived at."
      ]
    },
    {
      "heading": "4.2 On Disambiguation by Contextual Information",
      "text": [
        "Although A no B is semantically ambiguous, it can generally be disambiguated by contextual information.",
        "Although inferences including association and analogy are generally necessary, this paper briefly mentions the possibility of the disambiguation method by unification",
        "kooen no doozoo (\"statue in a park\") – ■ kooen ni aru doozoo (\"statue which is in a park\") between a predicate structure in A no B semantic structure and the related event structure in the discourse.",
        "A sequence of related events is described in a discourse.",
        "On the other hand, the semantic structure is represented by an appropriate predicate feature.",
        "From these, the correct structure can be obtained by unifying an event semantic structure with a predicate feature in A no B as follows.",
        "event-semantic-structure-in-context = pred-structure-in-semantic-structure-of-A no B Here, \"=\" means that the left hand side unifies with the right hand side.",
        "(sl) Hanako wa kyonen e o kaita.",
        "(\"Hanako painted a picture last year.\")",
        "the following semantic structure is obtained.",
        "This representation is simplified, showing only the information needed for the explanation.",
        "pred: [rel: paint agent: Hanako object: picture] This semantic structure can be obtained also from the noun-centered semantic structure as follows.",
        "picture [pred: rel: paint agent: Hanako object: picture(\")] Next, let us assume that the sentence (s2) occurs in the context of (sl)."
      ]
    },
    {
      "heading": "5. Remarks",
      "text": [
        "This research concerns semantic structures, especially those of noun phrases, and was conducted as part of a series of research efforts in the LUTE (Language Understander, Translator, & Editor) project 16,7.1°, \"1.",
        "To date, ten thousand examples of A no B have been collected from scientific and newspaper articles, and the appropriateness of the classification of A no B investigated.",
        "In addition, as a preliminary experiment, a semantic relation analysis was tried with about a thousand examples, with rather satisfactory results.",
        "The meaning of A no B is generally ambiguous, and contextual information is needed to resolve the ambiguities.",
        "There seems to be variety of such ambiguities relating to contextual information, but in principle such ambiguities are considered to be resolved by assuming appropriate predicates as described in this paper.",
        "Acknowledgment The authors wish to thank Dr. Harold Somers for some helpful suggestions."
      ]
    },
    {
      "heading": "References",
      "text": []
    },
    {
      "heading": "Appendix",
      "text": [
        "Semantic relations between A and 8 in A no 8 [Case].)",
        "1. agent ... senmonka no chyoosa (\"study by experts\"), 2. objects ... amamori no hoshuu (\"repairs of roof leaks\"), 3. coagent gaikokujin to no fureai (\"contact with foreigners\"), 4. donor ... kare no purezento (\"his present\"), 5. receiver ... hate no meiwaku (\"inconvenience to others\"), 6. method ... densha no tsuugaku (\"attending school by train\"), 7. instrument eigo no toi (\"the English question\"), 8. material ... sakana no ryoori (\"cooking of fish\"), 9. reason ... issankatanso no yogore (\"carbon monoxide contamination\"), 10. time ... haru no yakyuu-kenbutsu (\"watching baseball in the spring\"), 11. location ... kooen no deeto (\"date in a park\"), 12. source ... kuukoo kara no shuppatsu (\"departure from an airport\"), 13. destination ... jiyuu e no kikyuu (\"desire for freedom\"), 14. goal ... iruka no hogo no tame no seitai-choosa (\"ecological research to protect dolphins\"), 15. situation ... warui tenki no ryokoo (\"trip in bad weather\"), 16. content ... kokkai seijooka no hanashiai (\"talks for Diet normalization\"), 17. role ... haha toshite no hataraki (\"role as a mother\"), 18. manner ... gutszen no itchi (\"simple coincidence\"), 19. frequency ... nijukkai no chuusita (\"20 injections\"), 20. ratio ... son wart no dageki (\"batting at .300\"), 21. degree ... ooguchi no kenkin (\"large contributions\"),",
        "method ... kaiketsu no shucian (\"way to solve it\"), 4. instrument ... seikai-koosaku no buki (\"weapon for political transactions\"), 5. material ... shoosetsu no zairyoo (\"data for a novel\"), 6. reason ... jiko no gen'in (\"cause of an accident\") ,7. location chuushet no basho (\"parking space\"), 8. time ... tsuki-chakuriku no asa (\"morning of the lunar module landing on the moon\"), 9. source ... shuppatsu no kuukoo (\"airport of departure\"), 10. destination ... hinan no yaomote (\"target of criticism\"), II.",
        "direction ... Izassha no hookoo (\"launching direction\"), 12. goal ... kaitei no nerai (\"aim of the revision\"), 13. frequency ... shigeki no kaisuu (\"the number of times of stimulation\"), 14. manner ... kyoodooseikatsu no tanoshisa (\"enjoyment of community living\"), 15. degree ... un'e i no ntuzukashisa (\"difficulties of the operation\"), 16. ratio ... daigaku-sotsu no wariai (\"the percentage of college graduates\"), 17. number shishutsu no gaku (\"the sum of the expenses\").",
        "[Case5] 1. possesion taroo no hon (\"Taro's book\"), 2. belong-to ... stanfoodo-daigaku no Ityooju (\"professor at Stanford University\"), 3. human-relation ... seito no chichioya (\"father of a student\"), 4.. whole-part ... hoteru no heya (\"a room of a hotel\"), 5. part-whole ... fulatsuai no hako (\"box with a lid\"), 6. number ... shichinin no shinshi (\"seven gentlemen\"), 7. age ... juunisai no musume san (\"12-years old girl\"), 8. order ... sal go no hitori (\"the last one\"), 9. kind ... tennen no shiba (\"natural turf), 10. role ... puroyakyuu no senshu (\"professional baseball players\"), 11. degree ... jutsuu no hito (\"an average person\"), 12. characteristics ... yakoosei no mushi (\"nocturnal insects\"), 13. material ... enkabiniiru sei no shibafu (\"vinyl chloride turf), 14. reason ... tabako no gal (\"effects of smoking\"), 15. producer ... GM no jidoosha (\"GM car\"), 16. location ... gaikoku no tomodachi (\"friends in a foreign country\"), 17. time ... mukashi no hitobito (\"men of old times\"), 18. source ... yuujin kara no tegami (\"letter from a friend\"), 19. destination ... kagaku e no netsui (\"enthusiasm for sciences\"), 20. situation ... aremoyoo no hibi (\"days of stormy weather\"), 21. goal ... koonyuu no tame no gal/co (\"foreign exchange needed to purchase ... \"), 22. content ... haiku no hon (\"a book of haiku\"), 23. reference ... sorera no mond,ai (\"problems of this kind\", 24. specification ... tokutei no mise (\"particular stores\")."
      ]
    }
  ]
}
