{
  "info": {
    "authors": [
      "Erik Colban",
      "Jens Erik Fenstad"
    ],
    "book": "Conference of the European Association for Computational Linguistics",
    "id": "acl-E87-1041",
    "title": "Situations and Prepositional Phrases",
    "url": "https://aclweb.org/anthology/E87-1041",
    "year": 1987
  },
  "references": [],
  "sections": [
    {
      "heading": "SITUATIONS AND PREPOSITIONAL PHRASES",
      "text": []
    },
    {
      "heading": "ABSTRACT",
      "text": [
        "This paper presents a format for representing the linguistic form of utterances, called situation schemata, which is rooted in the situation semantics of Barwise and Perry.",
        "A treatment of locative prepositional phrases is given, thus illustrating the generation of the situation schemata and their interpretation in situation semantics."
      ]
    },
    {
      "heading": "Introduction",
      "text": [
        "A natural language system aims to provide an overall framework for relating the linguistic form of utterances and their semantic interpretation.",
        "And the relation between the two must be algorithmic.",
        "In this paper we pursue an approach which is based on an algorithm for converting linguistic form to a format which we call a situation schema.",
        "A situation schema has a well-defined formal structure, suggestive of logical form.",
        "This is a structure which is different from the standard model-theoretic one; we will argue that it is a structure better adapted for the analysis of the meaning relation in natural languages.",
        "A situation schema is effectively calculable from the linguistic form and we believe that it provides a format usefull for further processing, e.g. in the construction of a natural language interface with a data system and also in connection with mechanical translation systems.",
        "The general structure of situation schemata We begin by explaining the general structure of the situation schemata and how they are rooted in the situation semantics of Barwise and Perry (Barwise and Perry 83).",
        "Situation semantics is grounded in a set of",
        "the first expresses that at the location 1 in L the relation r in R holds of the individuals al,...,an in D; the second expresses that it does not hold.",
        "A situation s in S determines a set of facts of the form",
        "in s:at 1:r,a1 ..... an; 0.",
        "We can think of a situation s as a kind of restricted, partial model (data base) which classifies certain basic facts.",
        "The set of primitives <S,L,R,D> may come with some internal structure, e.g. the set L of locations is or represents connected regions of space time and thus could be endowed with a rich geometric structure.",
        "We shall see how this can be exploited in our analysis of locative prepositional phrases.",
        "A situation schema is a complex feature-value structure computable from the linguistic form of the utterance and with a choise of features matching the primitives of situation semantics:"
      ]
    },
    {
      "heading": "REL - ARG1 - ARGn LOC - POL",
      "text": [
        "Here the features REL., ARG1 ..... ARGn, and LOC correspond to the primitives: relation, individuals,",
        "location.",
        "POL, abbreviating polarity, takes either the value 1 or 0.",
        "The values in the schemata can either be atomic or complex feature-value structures.",
        "The value of the LOC feature is always complex.",
        "The interpretation of a situation schema is relative to an utterance situation u and a described situation s. The utterence situation decomposes into two parts d discourse situation c the speaker's connections The discourse situation contains information about who the speaker is, who the addressee is, the sentence uttered, and the discourse location.",
        "The latter information is necessary to account for the tense of a sentence.",
        "The speakers connections is a map determining the speaker's meaning of lexical items.",
        "The meaning of a sentence 01 is a relation between the utterance situation u (=d,c) and a described situation s. We write this relation d,c [ SIT.4011 s , where SIT.",
        "Oldenotes the situation schema of titi .",
        "Remark.",
        "In other works, e.g. (Fenstad et.",
        "al.",
        "87), we have developed the mathematical study of the structures <S,L,R,D>; in particular, several axiomatization theorems have been proved, providing a complete inference mechanism for a multi-sorted logic based on a semantics of partial information.",
        "Since the model theory of these structures seems to be a natural formalism for a (relational) data base theory, it would be interesting to build a PROLOG-style system based on the proof-theory which we have developed.",
        "Oblique objects and adjuncts In the next section the general theory will be illustrated by the analysis of a couple of sentences that contain locative prepositional phrases.",
        "In this section we make some preliminary remarks.",
        "See (Colban 85) or (Fenstad et.",
        "al.",
        "87) for more details.",
        "The PP's we consider here are all attached to a verb (not a noun phrase), and will be divided into two classes: oblique objects and adjuncts (Kaplan and Bresnan 82).",
        "An oblique object fills one of the argument slots of the verb if one considers the verb to be a relation with a fixed number of arguments.",
        "In e.g. the sentence 'Tom handed the book to Anne\" the verb handed is a ternary relation with arguments Tom, the book and, one migth say, Anne .",
        "However, we will consider the third argument to be something that has to be in the relation to to Anne.",
        "An oblique object is thus a constraint on an (unexpressed) argument of the verb.",
        "This way a verb may have several oblique objects without the number of arguments necessarely increasing.",
        "In the sentence \"Tom sent a letter from Norway to France\" both from Norway and to France are constraints on the same argument.",
        "Adjuncts function normally by restricting or modifying the relation expressed by the verb.",
        "Examples are: \"Tom played with Anne \" and \"Tom ate in a hurry.",
        "\" Sometimes the location where the relation takes place is modified and not the relation itself.",
        "In e.g. \"Tom ran to the car\" the location will be restricted to be in the relation to to the car.",
        "This relation will hold if the location is a curve tracing the trajectory in space-time that ends at the (location of) the car.",
        "The situation schemata in the examples below have been produced by a parser for LFG-grammars.",
        "Usually, f-structures are produced by such a parser, but we have written a grammar that causes situation schemata to be produced instead.",
        "The PP is here taken as an adjunct since ran is a unary relation.",
        "The values of the ARGi in the schemata can either be direct references to individuals (e.g. Peter) or indeterminates with or without associated constraints (e.g. 10, IND1, IND2).",
        "The indeterminates have to be anchored to individuals or locations in such a way that the constraints hold in the described situation.",
        "The ARG2 in the second constraint of SIT.",
        "4) 1 .LOC.COND is:"
      ]
    },
    {
      "heading": "IND IND1 COND REL car ARG1 IND1 POL 1 SPEC THE",
      "text": [
        "This schema tells us that IND1 has to be anchored to an individual a that must be a car.",
        "The SPEC feature can either be used to pick out the unique car in the described situation or to make a generalized quantifier out of ARG2.",
        "The situation schemata are hence open to several interpretations.",
        "The LOC feature in this schema has the structure: [IND IND2 i"
      ]
    },
    {
      "heading": "COND {---)",
      "text": [
        "The location is tied to a location indeterminate IND2.",
        "The COND feature is a set (notice the set brackets) of constraints on IND2.",
        "The first one expresses that IND2 must be anchored to a location 1 that temporally precedes the location that 10 gets anchored to.",
        "By convention 10 is always anchored to the discourse location Id.",
        "This constraint accounts for the past tense of ran.",
        "In the second constraint the semantics of to tells us that 1 must be a curve in space-time that ends at the location of a.",
        "The head-relation net in SIT.4) 1 asserts that the individual named Peter is in the state of running along the trajectory 1.",
        "An interesting project would be to furnish the domain L of locations with a set of \"primitive\" relations which could be used to spell out the meaning of the different prepositions.",
        "For the moment the only primitive relation on L that has been accounted for in the axiomatization of the structure <S,L,R,D> is \"<\", the relation \"temporally precedes.\" The relation d,c [S1T.01] s holds if and only if there exists an anchor g on SlT.41.LOC, i.e.",
        "and an extension f of g that anchors IND1 such that f(IND1) is the unique individual such that ins: c(car),f(IND1); 1 such that",
        "Note that relations between locations can easily be extended to include individuals among their arguments.",
        "This is done by introducing a function loc.of from D to L mapping individuals on their locations.",
        "A relation r between locations is extended to a relation r' where some of the arguments are individuals by letting:",
        "The PP gets here two readings; one as an adjunct and one as an oblique object, but we have omitted the adjunct reading since it isn't natural.",
        "The relation lie takes two arguments: ARG1 and ARG3.",
        "The indeterminate IND2 must be anchored to a location that temporally precedes the discourse location .",
        "INDI.",
        "must be anchored to an individual al which is the unique book in the discourse situation, and IND4 must be anchored to an indivildual a2 which is the unique table in the discourse situation.",
        "SIT.02.ARG3.COND forces INDS to be anchored to an individual a3 such that the relation on holds between a3 and a2.",
        "The relation lie will hold between al and a3 if al is lying and the locations of al and a3 are the same.",
        "A precise interpretation is: The relation d,c [SIT.02] s holds if and only if there exists an anchor g on SIT.02.LOC, i.e.",
        "and an extension f of g that anchors IND1, IND4 and INDS such that f(IND ) is the unique individual such that ins: c(book),JfINDI); 1 and J(IND4) is the unique individual such that ins: c(table),RIND4); 1 such that"
      ]
    },
    {
      "heading": "Final remarks",
      "text": [
        "This analysis has been implemented on a XEROX 1109/1186.",
        "Other fragments have been implemented using the D-PATR format.",
        "In a study of direct questions (E. Vestre) it turned out to be advantageous to use a DCG-grammar and a PROLOG-implementation.",
        "The spirit of the algorithms are however the same, unification and constraint propagation (see (Shieber 86) for a general discussion).",
        "We are now studying the problem of text generation based on situation schemata augmented by certain pattern information."
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
