{
  "info": {
    "authors": [
      "Morris Salkoff"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C80-1007",
    "title": "A Context-Free Grammar of French",
    "url": "https://aclweb.org/anthology/C80-1007",
    "year": 1980
  },
  "references": [],
  "sections": [
    {
      "heading": "A CONTEXT-FREE GRAMMAR OF FRENCH*",
      "text": []
    },
    {
      "heading": "Morris Salkoff",
      "text": [
        "Universite de Paris 7, L.A.D.L."
      ]
    },
    {
      "heading": "2 Place Jussieu, Paris 5, FRANCE",
      "text": [
        "Summary.",
        "I present here a method that allows one to construct a CF grammar of a natural language that correctly accounts for verbal selection rules.",
        "This goes contrary to the prevailing opinion, following Chomsky5, that such a construction is impossible.",
        "My method consists essentially in separating the semantic function of a selection rule, namely, the exclusion of certain noun sub-classes, from the syntactic relation between the elements (verb, subject, object) linked by this relation of selection.",
        "When the verb and object (subject) are separated by intervening levels of complement construction, the selection can still be satisfied by a double classification of verbs: according to the kind of subject they take, and also according to the type of verb that can follow them (in the complement construction).",
        "Conjunctions and sentences with respectively can also be treated within the framework of the CF approximation proposed here."
      ]
    },
    {
      "heading": "60. Introduction",
      "text": [
        "It is now quite generally supposed that a natural language cannot be adequately described by a CF grammar.",
        "This opinion was first advanced by Chomsky5 who discussed this problem from the point of view of phrase structure grammars.",
        "He presents there a fragment of a CF phrase structure grammar in terms of noun phrases NP, verb phrases, VP, etc., which are familiar from immediate constituent analysis.",
        "These rules cannot treat verbal selection rules properly; Chomsky4 (ch.",
        "8) had already tried himself to correct this defect within the framework of a CF phrase structure grammar, but the difficulties he encountered seem to have persuaded him that only a transformational grammar could handle such a problem.",
        "Harman13 proposed another solution to the problem of treating verbal selection rules in a CF grammar; he added a set of subscripts to the CF rules used in Chomsky5, which were chosen so that only those subjects and objects which satisfied the selection rules could appear with a given type of verb.",
        "Chomsky8 showed that this method would not suffice if the sentences sub scripted as Harman had suggested were themselves embedded in complement constructions.",
        "Thus, where Harman's system will not generate such aberrant sentences as *Bill elapsed, it will not be able to exclude the generation of such a sequence when it is embedded in a complement construction, as in *John persuaded Bill to elapse.",
        "Further arguments for the inadequacy of a CF grammar were adduced from the fact that sentences containing respectively cannot be assigned an appropriate structure in the framework of a CF grammar.",
        "This was noted by Chomsky5 (64.2) in his discussion of the algebraic language w w; the relation between this language and sentences containing respectively was discussed by BarHillel & Shamirl, and then taken up again by Chomsky5 together with examples taken from the comparative construction in English.",
        "Later, Posta122 exhibited a construction in Mohawk which is similar to the one with respectively, and like the latter, is recursively extendable to sentences of theoretically unbounded length.",
        "As a result of these considerations, Chomsky8 concluded that a coherent description of recursively embedded sentences or of verbal selection rules could not be obtained in a natural way by any CF grammar, and that consequently no CF grammar could adequately describe a natural language.",
        "However, it turns out that this question is not so easily disposed of as it would appear, and recent work by Joshi & Levy18 shows that a CS grammar containing rich context-dependent rules can be used to analyze trees that describe a CF language.",
        "They did this by an extension of a theorem of Peters & Ritchie21 , who showed that CS rules of a certain type can be used not to generate sentences, i.e., not to characterize them, but only to verify their well-formedness, by applying the context-dependent parts of these rules as constraints on the set of trees that schematize these sentences.",
        "In this case, the language described by these trees is a CF language.",
        "some CF language.",
        "Now the string grammar proposed by HarrisiS and which analyzes English (Sager23) and French (Salkoff2\"25) can be shown to be of just the form described by Joshi & Levy.",
        "It contains CS rules of the type described by them, and is used to analyze a tree, rather than to generate it.",
        "It would thus appear that English or French can be described by some CF language, although the string grammar gives no clear clue as to what its form would be.",
        "I shall show here that such a CF grammar can be written for French, and that it can treat, in a linguistically appropriate fashion, the problem of the expression of verbal selection rules in nested complement constructions.",
        "I have chosen French because systematic data giving a wide coverage of the French lexicon are available (Gross12, Boons et al.3); however, the very nature of this construction makes quite plausible its extension to other natural languages.",
        "Only the method used will be outlined in this brief article, and an example of its application to embedded complement constructions; for more details, consult Salkoff25 (chap.",
        "3).",
        "I now construct CF rules that correctly describe sentences in which related pairs like verb-subject, verb-object, etc., that are linked by a relation of selection, may be separated by constructions of unbounded length.",
        "Each such CF rule is the expansion of a sentence schema S. The verbal selection rules are accounted for in this method by separating the semantic function of a selection rule, namely, the exclusion of certain noun sub-classes, from the syntactic relation between the pairs carrying this function (generally, a verb and a noun phrase).",
        "Each selection rule is decomposed into two independent parts: one part is the choice of a noun not classified in certain noun sub-classes, in such a way as to express the semantics of that selection rule; the second part is the use of the noun phrase containing this N for the subject or object of a given verb in a rule schema, which amounts to satisfying the complete verbal selection rule.",
        "Conjunctional sequences, including sentences containing respectivement can be handled by this method, but not within the strict mathematical framework of a CF language.",
        "The resulting CF grammar of French can be compared with a transformational grammar, and it is seen that the two are more similar than has been thought.",
        "1.",
        "The base rules In order to set forth the selection rules as clearly as possible, I shall begin by using In the rules developing S, noun phrases bearing three subscripts, i.e., complex symbols: (1) NPx,y,z ; where x is a function F: subject s, object o, or indirect object io; y is the morphology M: singular, plural,...; and z is a semantic subclass S. these sets have no elements in common.",
        "With this notation, typical rules for S will have the following form: (2)a S 4 NPt V. NP s,y,z1o,y,z b SNPt V. P NP.",
        "s,y,zjio,y,z c SNPt V NPP NP., etc.",
        "s,y,zko,y,zio,y,z The verb is subscripted according to the complements it takes.",
        "In this notation, the CF rules no longer constitute a strict constituent grammar of the type discussed by Chomsky503.",
        "My notation brings out the grammatical relations between the elements of the sentence schemata, which is not possible in a direct way in a phrase structure grammar.",
        "The complex symbols are useful in order to explain clearly the process of sentence embedding; they will be eliminated in a second step and replaced by the noun phrases without subscripts used in the verbal selection rules.",
        "Main rule schema.",
        "For clarity, I shall use only the subscript K 2., or lo) in the rules for S. Only an abbreviated list of these rules can be given here; for a complete list, cf. Salkoff25.",
        "A first subgroup of rules contains non-sentential objects:",
        ".",
        ".",
        ".",
        "etc.",
        "Here, the symbol o (0s ) is a dummy element standing for the noun phrase, carrying the same subscripts, at the head of NP'.",
        "It is marked by the same selectional features as oNP, and will be used to 'transmit' this selection through embedded sentences.",
        "Such dummy elements come close to certain pronouns found in relative clauses without antecedent, like ce in: J'ai achete ce que Max a sculpte.",
        "A second type of relative clause is this: (7) Npr2-NYo qua S(4e livre que... pro Spro 4 NPs t V2 (0)0... Paul lit) NPs t V4 (0)0 P NP.o .PauZ fait de .",
        ".",
        ".ces articles)",
        "when the direct (indirect) object is GNj, (Gni!).",
        "Lexicographical work shows that there are about 40 different prepositions appearing in the objects P N and N P N. Since the double verb classification must be carried out for each value of Pi, this amounts to a triple classification of verbs.",
        "3.",
        "Elimination of the complex symbols",
        "The schema (12) generates only acceptable sentences; each verb in the lexicon is classified according to which of the subclasses defined by (12) it belongs to; hence no verb will ever appear in a schema of type (12) unless it is acceptable there.",
        "Then, since the process defined by (10) is such that only acceptable nouns can be chosen for the noun phrases GN (= N') in these schemata, each schema must in fact give rise to an acceptable sentence.",
        "The situation is quite different, howeverr for the rules containing oNPs, NP0 or NPio.",
        "These cannot be developed as written, for two reasons: (1) only noun phrases of the type N' are available, so that verbal selection rules can be satisfied; (2) the syntactic functions expressed by the subscripts on these noun phrases can be obtained only by a sub-classification of the verbs appearing with them.",
        "Thus, in order for 0NP5 (in 4) to be an acceptable object of the verb Va that precedes, and also an acceptable subject for the verb Vb of the embedded sentence containing it, the verb Vb must be subclassified according to type of subject, and Va has to be sub-classified according to the type of Vb that may follow.",
        "An even more complex classification is needed to handle relative clauses like (7), which begin with NPo.",
        "This noun phrase must be an acceptable object for the last verb, say V,, in the which follows; however, S can contain an pro pro unbounded number of embedded verbs before V c appears.",
        "Hence, V, is not known at the moment when the lexical entry is chosen for the N which represents NPo.",
        "The problem, then, is to 'transmit' the selectional characteristics of the noun in NP0 to the rule that will later develop V,, by using the embedded verbs as carriers for the selectional information.",
        "This transmission of selectional information necessitates a sub-classification both of embedded verbs and of the schemata of the type S.",
        "pro,] + NI de V3I S21330-:11 (31 times, as above, once each for the subjectsN'31) The typical rule for NPr2 is the following: (19) Npr2 'que N: t V30 30 pro,j Once more, acceptability is guaranteed by choosing a verb V30 in the subclass (NI, Si).",
        "Next, the symbol SW:If , representing a possibly embedded sentence, can be developed by the rules: (20)a S1.1,k 4 N de V32 S31,k, pro,]jpro,] b S110( 4 1\\1' de V2 (0) pro,]jk If rule 11 is chosen, sentence embedding terminates; then, choosing a V2 in the subclass taking an object of type Ni; (as indicated by 0k) guarantees that Ni in (18) is an acceptable object for that V2.",
        "If rule a is chosen, sentence embedding continues; a verb V32 is chosen, in the subclass (Ni, S3 ) until a rule of type b is chosen.",
        "The reader will notice two features of this method of using the selection rules to generate relative clauses.",
        "(1) The subdivision of Sl into a set of Si rule schemata does not increase the number of rules in S. The same number of rules would be obtained by inserting the noun phrases Nic into S (or SI), and this must be done in any case in order to express the verbal selection rules (in whatever fashion).",
        "In the decompositions of SI,..., used above, the point was only to present the original schemata so as to make the subject or object of the verb in the schema stand out, for further reference.",
        "(2) The two kinds of selection made explicit in these schemata, the one between verbs, and the other (better known) between verb and object (or subject), appear only once in the grammar.",
        "Both types of selection are used in each step of sentence embedding, but in no case does this entail rewriting the two kinds of selection in the grammar each time a deeper level of embedding is attained.",
        "4.",
        "Conjunction; respectively",
        "It has been shown by Chomsky5 that conjunctions can be described in a CF grammar only by using an infinite number of rules, represented by rule schemata; if one restricts oneself to strict CF grammar, one introduces an excessive structuring of the conjoined forms.",
        "An approximate solution can nevertheless be given to this problem, in the framework of a finite CF grammar, in the following way.",
        "I construct a sequence of conjoined noun phrases: (21)a GNI 4 N' ;b GN2 4 N' et N' c GN3 4 N' et N' et N' d GNi 4 N' et N' ... et N' (i times)",
        "by Glf the CF grammar containing the rules GNi, GN1-1,GNI, I can.set up the series of grammars Clef, G2cf, Glcf, each representing a better approximation to the infinite grammar G f, which contains a noun phrase of unbounded c length.",
        "For any practical purpose, such as generation (or analysis) of sentences, it is clear that one of the qf will be large enough to yield the desired precision.",
        "However, another approximation is available which is less costly, from the viewpoint of the number of rules required, and which yields the same result for Gio-f.",
        "This is the rule schema proposed by Chomsky & SchUtzenberger9 for handling conjunction in a CF grammar.",
        "For the case of noun phrase conjunction, this schema is as follows: (22)a GN N'; b GN N (et N')* The star indicates that the group (et N') can be iterated as many times as is necessary.",
        "This schema is therefore an abbreviation for an infinite number of rules.",
        "With such a rule schema in it, my grammar is no longer strictly CF; however, it is clearly faithful to the spirit of the approximation for Glcf outlined above, since the language described by my grammar is the same as that reached asymptotically by the series of grammars qf, Gidf obtained with (21).",
        "The rule schema (225 can be compared to an algorithm for generating any one of the grammars Gic-f by choosing the number of iterations.",
        "There exists a set of structures in natural language which cannot be described by the methods developed until now, namely those containing either respectivement, or the distributives qui or selon quo: (23)a Les rats des groupes A et B r4uss1.ssent et 4chouent dans les labyrinthes La et Lb' respectivement.",
        "b Les reporteurs ont parig qui aux ministres, qui aux d474gu4s, qui aux deput4s.",
        "c Solon quo tu es pauvre, bourgeois ou aristocrate, tu seras ouvrier, commercant ou patron.",
        "Although these strings cannot be generated by a CF grammars , a procedure is nevertheless avail-The applicability of this argument to the linguistic case is not quite as simple as this brief formulation of the argument might lead one to suppose, in the way it is generally used in discussing sentences with respectivement.",
        "It is only the language containing just the sentences (23), and only those, that cannot be generated by a CF grammar.",
        "However, in order for this conclusion to apply to the generation of the entire French language by a CF grammar, it must be shown that there exists no sublanguage of French containing these sentences in respectivement as a subset that can be generated by a CF grammar.",
        "Cf. Grossll (8.1) for this argument.",
        "able for including this type of sentence in the CF approximation under discussion here.",
        "Thus, I am interpreting (25) as a sentence conjunction: N1, VI N(Is at N; V2 N(23 et ..., as required by the aaverb respectivement."
      ]
    },
    {
      "heading": "5. Conclusions",
      "text": [
        "The methods I have sketched here can certainly be applied to other natural languages and will account in a natural way for the general phenomena of verbal selection rules in embedded sentences.",
        "One may wonder why this work has not been carried out before.",
        "Historically, attacks against the adequacy of CF grammar for describing natural language arose at a moment when it was necessary to explore the nature of the transformational grammar just proposed.",
        "This new style of grammar seemed so much better adapted than CF phrase structure grammars to explaining sentence relations that any more effort towards developing a detailed CF grammar seemed fruitless.",
        "To discourage such efforts, Chomsky5 (chap.",
        "5) declared that \"any grammar that can be constructed in terms of this theory [CF phrase structure grammar] will be extremely complex, ad hoc and 'unrevealing\".",
        "These remarks were reaffirmed (Chomsky8) and bolstered by an argumentation based on the inherent inadequacy of CF grammar for describing verbal selection rules.",
        "A second criticism arose from the analysis of constructions, like respectivement, whose description could not be obtained within the strict framework of a CF grammar.",
        "We have seen above that such a statement is at best unclear.",
        "It may be correct that a mathematically rigorous description of this construction is not possible in a ---43-strict CF grammar; even so, we are under no obligation to transfer this observation bodily to the domain of linguistics.",
        "The type of description that I elaborated above, in which a rule of interpretation is added to a rule generating the form of sentences containing respectivement, is now used in recent work in generative semantics.",
        "Moreover, it can be seen that the CF grammar presented here is but a short step removed from a transformational grammar.",
        "In all transformational theories, a transformation includes (among other things) a relation between sentences.",
        "Most authors also include operations that deform one sentence into another, or which modify an abstract structure so as to derive sentences from it.",
        "The CF grammar I have proposed contains the information that establishes relationships between sentences, but it does not contain the operations or the metalinguistic assertions that make the transformation explicit.",
        "By a small extension of the CF framework I can also obtain the equivalent of a transformation, as follows.",
        "As an example, I consider the passive transformation.",
        "The passive transformation consists in matching an active phrase with its passive counterpart.",
        "The statement of the transformation can stop there, as does Harris'14, or one can add the specification of the computer operations needed to create the active and passive trees, as in generative grammar.",
        "In the CF grammar presented here, I have two independent rules, one for the active form, and another for the passive of the first:",
        "In this formulation, the selection rules are no longer duplicated; moreover, we can interpret the separator p between the members of the equivalence class as indicating a relation between the sentence schemas so separated.",
        "The factorization of the selection rules, together with the introduction of the separator can be read as the definition of a transformational rule between the sentence schemata.",
        "Of course, rule (29) is no longer CF, but it represents a rather natural extension of the CF framework which makes the latter much more similar to a transformational grammar than one might have thought possible up til now.",
        "However, the reader will note that the concept of a transformation is indispensable as a tool for the construction of this CF grammar, and then for its extension towards a transformational grammar by means of the factorization of selection rules.",
        "Furthermore, this CF grammar does not generate the sentences of the language 'weakly', in the meaning given this word by Chomsky; in fact, it provides them an 'adequate' grammatical structure as well as a linguistically justifiable relationship to other sentences of the language.",
        "Finally, let us note that although the entire set of rules of the CF grammar proposed here is large (of the order of 109 rules), it is nonetheless finite.",
        "Furthermore, the size of the grammar is of no theoretical consequence, since it could be stored quite handily, not in some static memory (e.g., a pile of discs), but in a dynamic form (that is, in the form of schemata) where each rule is generated at the moment when the program of syntactic analysis (or generation) requires it.",
        "In this way, the set of rules would be reduced to a series of sub-programs that can generate either one rule, or a subset of rules, or all the rules.",
        "During analysis or generation, a call for rules would activate their synthesis by the appropriate sub-program.",
        "Such a program of analysis by synthesis reduces the number of rules to a smaller number of sub-programs, but a string grammar reduces them still more, down to a set of about 150 strings (the rewrite rules) together with about 200 restrictions (the CS portions attached to the CF rules).",
        "The size of the CF grammar required to describe selection rules adequately also explains why all attempts at automatic syntactic analysis by means of strictly CF grammars undertaken until now have failed.",
        "The authors of these CF grammars limited their effort to including some rudimentary linguistic facts; the average size of this sort of CF grammar was of the order of several thousand rules (cf. Kuno19 ,20).",
        "Under these conditions, there was no question of providing only linguistically acceptable analyses.",
        "However, in the last few years, other CS variants of a CF grammar have been proposed, and partly worked out.",
        "In particular, the augmented transition network grammar of Bobrow & Fraser2, especially in the form given it by Woods26, has predicates associated with the transitions, predicates that are so many context-sensitive tests.",
        "This kind of grammar is then quite similar to string grammar, i.e., to a CF grammar together with CS conditions on the rules.",
        "Unfortunately, none of the grammars based on the ideas of Bobrow and Woods has been worked out in sufficient detail to make a linguistic comparison with string grammar possible."
      ]
    },
    {
      "heading": "BIBLIOGRAPHY",
      "text": []
    }
  ]
}
