{
  "info": {
    "authors": [
      "Jerry R. Hobbs"
    ],
    "book": "Annual Meeting of the Association for Computational Linguistics",
    "id": "acl-P80-1017",
    "title": "Interactive Discourse: Influence of the Social Context Panel Chair's Introduction",
    "url": "https://aclweb.org/anthology/P80-1017",
    "year": 1980
  },
  "references": [],
  "sections": [
    {
      "heading": "Jerry R. Hobbs SRI International",
      "text": [
        "Progress on natural language interfaces can perhaps be stimulated or directed by imagining the ideal natural language system of the future.",
        "What features (or even design philosophies) should such a system have in order to become an integral part of our work environments?",
        "What scaled-down versions of these features might be possible in the near nature in \"simple service systems\" [27?",
        "These issues can be broken down into the following four questions:",
        "1.",
        "What are the significant features of the environment in which the system will reside?",
        "The system will be one participant in an intricate information network, depending on a continually reinforced shared complex of knowledge [9].",
        "To be an integral part of this environment, the system must possess some of the shared knowledge and perhaps must participate in its reinforcement, e.g. via explanations, [9], [2].",
        "2.",
        "Investigations of person-person communication should tell us what person-system communication ought to be like.",
        "Face-to-face conversation is extraordinarily rich in the information that is conveyed by various means, such as gesture, body position, gaze direction [4], [8].",
        "In addition to conveying propositional content or information, what are the principal functions that moves in conversation perform?",
        "a.",
        "Organization of the interaction, regulation of turns [7], Cl].",
        "In the natural language dialog systems of today, each turn consists of a sentence or less.",
        "In experiments done at SRI on instruction dialogs between people over computer terminals, the instructor's turns usually involve long texts.",
        "It was discovered that the student needs a way of interrupting.",
        "That is, some sort of turn-taking mechanisms are required.",
        "What can we learn from the turn-taking mechanisms people use?",
        "b. Orientation of the participants toward each other, including recognition [6], expressions of solidarity and indications of agreement and disagreement [3], meta-comments on the direction of the conversation [a] or the reasons for certain utterances ([9] on discourse explanations).",
        "c. Maintenance of the channel of communication, implicit acknowledgment or verification of information conveyed [2].",
        "Recovery from mistakes and breakdowns in communication [8]., e.g. via flexibility in parsing and interpretation [2]; via explicit indications of incomprehension [2] and repairs [5].",
        "In natural language systems of today, when the user makes a mistake and the system fails to interpret the input, the user must usually begin over again.",
        "The system cannot use whatever it did get from the mistake to aid in the interpretation of the repair.",
        "People are more efficient.",
        "What are the principal means of repair that people use, and how can they be carried over to natural language systems?",
        "d. Building and reinforcing the mutual knowledge base, i.e. the knowledge the participants share and know they share, etc.",
        "[9].",
        "Linking new or out-of-the-ordinary information to shared knowledge via explanations [9], [2].",
        "e. Inferring others goals, knowledge, abilities, focus of attention [8], [2], [4].",
        "The system should have a model of the user and of the communication situation [a].",
        "f. Communicating one's own goals, knowledge, abilities, focus of attention [8], [2].",
        "Establishing and main-taming one's role, e.g. as a competent, cooperative participant (cf. [8]; [9]; Cl] for the role of speech style; [4] for defense of competence).",
        "In addition to the system having a model of the user, the user will have a model of the system, determined by the nature of his interaction with it.",
        "The system should thus be tailored to convey an accurate image of what the system can do.",
        "For example, superficial politeness or fluency (\"Good morning, Jerry.",
        "What can I do for you today?\") is more likely to mislead the user about the system's capabilities than to ease the interaction.",
        "What the system does, via lexical choice, indirect speech acts, polite forms, etc., to maintain its role in the interaction should arise out of a coherent view of what the role is.",
        "The linguistic competence of the system is an important element of the image it conveys to the user r2].",
        "3.",
        "When we move from face-to-face conversations to dialogs over computer terminals, the communication is purely verbal.",
        "The work done non-verbally now has to be realized verbally.",
        "How are the realizations of the above functions altered over the change of channels",
        "[8]?",
        "We know, for example, that there are more utterances showing solidarity and asking for opinions, because this is work done non-verbally face-to-face [3].",
        "Some things that occur face-to-face (e.g. tension release, jokes) seem to be expendable over computer terminals, where each utterance costs the speaker more.",
        "The messages take longer to produce, are less transitory, and can be absorbed more carefully, so there is less asking for orientation, elaboration, and correction [3].",
        "What devices are likely to be borrowed from related but more familiar communication frames [1]?",
        "Possible frames are letters or telephone conversations.",
        "4.",
        "Should and how can these functions be incorporated into the ideal natural language systems of the far future and the simple service systems of the near future [2], [8]?"
      ]
    },
    {
      "heading": "REFERENCES",
      "text": []
    }
  ]
}
