{
  "info": {
    "authors": [
      "Toyoaki Nishida",
      "Shuji Doshita"
    ],
    "book": "International Conference on Computational Linguistics",
    "id": "acl-C80-1013",
    "title": "Hierarchical Meaning Representation and Analysis of Natural Language Documents",
    "url": "https://aclweb.org/anthology/C80-1013",
    "year": 1980
  },
  "references": [],
  "sections": [
    {
      "heading": "HIERARCHICAL MEANING REPRESENTATION AND ANALYSIS OF NATURAL LANGUAGE DOCUMENTS",
      "text": []
    },
    {
      "heading": "Abstract",
      "text": [
        "This paper attempts to systematize natural language analysis process by (1) use of a partitioned semantic network formalism as the meaning representation and (2) stepwise translation based on Montague Grammar.",
        "The meaning representation is obtained in two steps.",
        "The first step translates natural language into logical expression.",
        "The second step interprets logical expression to generate network structure.",
        "We have implemented set of programs which performs the stepwise translation.",
        "Experiments are in progressfor machine translation and question answering."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Conventional Al systems dealing with natural languages paid much efforts on the problem, how to translate natural language input into the internal knowledge structure such as micro PLANNER statements[14], semantic networks[6], frames[1], etc.",
        "Most of these systems directly translate input sentences into task oriented internal structure.",
        "The architecture of these systems will be much simplified if systematic meaning representation and analysis method based on a formal theory is incorpolated.",
        "This paper proposes a stepwise translation system based on Montague Grammar (MG for short)[31.",
        "Partitioned semantic network[6] is employed as a meaning representatin.",
        "Input sentence is firstly translated into logical expression and then semantic network is generated by interpreting it.",
        "Semantic network is the output of the natural language analyzer.",
        "This will be further compiled into task oriented representations to be used by a task oriented problem solver.",
        "This paper concentrates on the natural language analyzer.",
        "The following is a summary of our approach:"
      ]
    },
    {
      "heading": "NATURAL LANGUAGE ANALYZER",
      "text": [
        "NL --0.",
        "LE --01.PSN -C> task oriented ---,N.. representations where NL: natural language, LE: logical expression, PSN: partitioned semantic network, T: translation mapping, I: interpretation mapping.",
        "We have developed natural language analyzers for English and Japanese respectively.",
        "This paper describes the one for English.",
        "The experiments are in progress with these systems.",
        "The applicability of the proposed approach is discussed briefly.",
        "2.",
        "Overview of the approach This section gives the readers an overview of the system by illustrating an example.",
        "Before illustration we shall present the formalisms of LE and PSN.",
        "LE -- logical expression The notion of LE is based on Cresswell's X-categorial language[2].",
        "The following is the syntax of LE: the set of syntactic categories (Syn): two basic categories areused, i.e., 0 of sentence and 1 of name.Given categories T,G1, ,on, then <T,GI, ,Crt> is the category of a mapping that makes an expression of category T out of expressions of category al, ... ,ah, respectively.",
        "-the set of symbols (F): F= 4mFo, where Fa is a finite set of symbols, and if criOcr2 then FainFa2=4.",
        "-the set of variables (X): X=6.Xa, where Xu is a set of variables such that if al#a2 then XcinX(52.4, and that intersection of F and X is empty.",
        "-the set of expressions (E): E= ,ssy,Ea, where Ea fills the following properties:",
        "Overview of the meaning analysis process Now we illustrate an example.",
        "Consider the following simple sentence: (EX-1) Every man loves a woman.",
        "(STEP 1) Morphological analysis Input sentence is analyzed by consulting dictionary in whichLE expression and grammatical category are assigned to each word.",
        "For the given sentence (EX-1), we obtain: Every: cat=DET, sem=EVERY man: cat=NOUN, sem=MAN loves: cat=VT, sem=LOVE, (form=+S) a: cat=DET, sem=A woman: cat=NOUN, sem=WOMAN (STEP 2) Syntax analysis and generation of LE Morphologically analyzed sentence is further analyzed by a set of grammar rules.",
        "Each grammar rule consists of syntactic generation part and semantic composition part.",
        "For the sake of illustration, let the grammar rules be:"
      ]
    },
    {
      "heading": "SENTENCE --> NG+VP,",
      "text": [
        "The syntax analysis and semantic composition are done in parallel.",
        "If one of them detects anomaly, the application of the rule is aborted.",
        "Fig.",
        "3 illustrates the result of the syntax analysis and semantic composition for our example.",
        "The syntax tree shows the phrase structure of the sentence.",
        "The semantic tree shows the history of semantic composition.",
        "The root node of the semantic tree is the LE (in LISP notation) obtained from the sentence.",
        "it is plausible to treat scope ambiguities in the interpretation process as shown in the above example.",
        "3.",
        "Implementation of translation mapping_ (T)",
        "This sectiontreatsthe translation mapping T. Firstly, we show how we associate LE with each phrase of English.",
        "Then we describe the rule based parser.",
        "The association of LE with English phrases (1) Simple sentence Simple sentence is composed of a subject and a verb phrase.",
        "Subject is a noun phrase.",
        "The LE for a noun phrase is in category <0,<0,1>>.",
        "The LE for a verb phrase is in category <0,1.",
        "The LE for a sentence is a functional composition of an NG and a VP.",
        "See the following illustration:",
        "(4) to replace the OBJECT slot of LOVE by its extension Since the verb \"love\" is an extensional verb, the OBJECT slot is extensioned, i.e., is replaced by an existentially quantified variable.",
        "In our system new individual node is generated in the sense of Skolem constant.",
        "We treat scope ambiguity at this time; if this Skolemization is to be done in a local world, scope ambiguity is announced.",
        "In this case three ambiguities are detected as for where the Skolemized node is placed, i.e., (i) the innermost space w3: V?X.",
        "[MAN(n) -037Y[LOVE(M,?Y)]1, (ii) the middle space w2:",
        "an.V?X[MAN(?X)LOVE(?X,?Y)].",
        "Since the reading (i) and (ii) are logically equivalent, there are essentially two ambiguities.",
        "If the reading (i) is selected, the final network structure is: Comments on scope ambiguity One of the interesting feature of MG is the treatment of scope ambiguity of quantification.",
        "In MG, scope ambiguities are captured as ambiguities of semantic composition.",
        "However, considering the following two points: - how to filter out redundancies; sometimes this redundancy isreduced in the",
        "We treat different mood of a sentence uniformly.",
        "-Declarative is default.",
        "-Interrogative is denoted with a symbol #QUES.",
        "#QUES may be paraphrased as: Ap[I(Axl((you(Ayi[pazi[ask(x,y,z)])]))])] ask you \" EE<O,<0,<0,1>>> Indirect questions and direct questions are treated uniformly.",
        "For YES-NO questions, a symbol (whether) is used which maps a sentence into a noun clause.",
        "For example, \"Does he run?\" =4#QUES(whether(he(run))) cE0 For WE-questions, see the following example: \"Who runs?\" =4#QUES(who(#ante(run))) LEO where, the symbol (who) maps a sentence into a noun clause.",
        "The <sem> section is a semantic composition program which will construct LE for the node from decendant nodes.",
        "In implementing programs, the use of semantic markers is effective.",
        "A semantic marker conveys some auxiliary information approximately describing semantic constraints.",
        "The LE and semantic markers for a node are packed into a data structure, called a word frame, and manipulated by <sem> section programs.",
        "The <score> section determines the priority of the rule.",
        "A rule with the highest priority will be tried first.",
        "The grammar system has a feature that allows a user to write elimination rules directly.",
        "For example, the following is a rule for a relative clause: NPNP+(CLAUSE-NP) This means that a relative clause is a clause with just one NP eliminated.",
        "The semantic coupling of the antecedent and the eliminated noun phrase is described in the <sem> section of the rule.",
        "Now we shall go into the detail of the parser, called EASY (for the English Analysis SYstem).",
        "The organization of EASY is summarized in the following diagram:",
        "This reads that a DET will grow up to be an NG if a NOUN follows it, and the NG will, in turn, grow up to be a SENTENCE if a VP follows it.",
        "The rule interpreter analyzes input sentence with this compiled rules and a dictionary.",
        "EASY is a top-down parser and reads input sentences from the left to the right.",
        "EASY starts parsing by expecting the node SENTENCE.",
        "The main loop of the rule interpreter is: test if the current word has an expectation path to the expected node, if the path is found, select the path with the highest priority and save other paths, if no path is found, try the following two rules: (1) try a left recursive rule since this type of rule is not compiled in the pre-compile phase, and (2) test if the expected node is eliminated via antecedent elimination rule, if both of them fail, memorize the failure and backtrack.",
        "4.",
        "Implementation of interpretation mapping (I) The interpretation mapping Igenerates a partitioned network structure as a denotation of the meaning of a sentence.",
        "We don'tusethe truth-conditional formalism.",
        "If complete knowledge about the world is given, a computer program can simulate the model to compute the truth value as in [4] or [7].",
        "However in the actual situation of natural language understanding process, complete knowlegde cannot be given, but only partial knowledge is available.",
        "Accordingly, it is plausible that new knowledge is acquired from a given sentence in the context of old knowledge structure.",
        "For this purpose, Montague's truth conditional approach is indirect and more direct a programming language.",
        "In what follows we try a direct approach.",
        "The style of generating networks resembles Scott-Strachey's semantic function [13] which generates a denotation from a statement of programming language.",
        "In order to generate network structure, we use a system which consists of a supervisor function GEN plus dictionary.",
        "The arguments of the supervisor are: (LE, space#, environment, message).",
        "LE is alogical expression.The space# specifies the space in which LE is interpreted.",
        "The environment specifies the denotation of each variable by a list of variable-denotation pairs.",
        "The message is used for communication between network generating word specialists.",
        "A dictionary entity for each lexicon of LE contains a case pattern or an embedded word",
        "specialist program.",
        "Interpretation of the LE for each category In what follows we use linear notation of PSN beacuse of the space limitation, and we refer to the LE for each category simply by the category name.",
        "(1) Interpretation of a sentence The meaning of a simple sentence is governed by the meaning of the verb.",
        "A dictionary entity for a verb includes a case pattern for the verb.",
        "According to the verb type, the case pattern looks like: intransitive verb: ((SUBJ, EXT,)), extensional transitive verb: ((ACTOR, EXT,) (OBJ, EXT,)), intensional transitive verb: ((ACTOR, EXT,) (OBJ, INT,)), where, the first element of a case slot is a case label which is used only for distinguishing the slot, and the second element of a case slot indicates extensionality of the slot.",
        "If the slot indicates extensionality, the filler will be replaced by its extension.",
        "This manipulation will be treated later in this section.",
        "(2) Interpretation of a noun phrase Most significant noun phrase may be in the form, DET+NOUN.",
        "The formula is interpreted as follows: (a/an)+noun: A?P[?P(INDEF[?X; noun*(?X)])], the+noun: X?P[?P(DEF[?X; noun*(?X)])], every+noun: A?P[ANY[?X; noun*(?X)-o?P(?X)]], no+noun: X?P[ANY[?X;noun*(?X)-0...?P(?X)]], where p* means the denotation of p. Personal pronouns is interpreted as follows: I: the SPEAKER attribute, you: the HEARER attribute, he: paraphrased as the male, she: paraphrased as the female.",
        "Proper name is interpreted as follows: results in: Thus the word specialist can handle de dicto readings of adjectives.",
        "For example, small(lion) =4 A?X[LION(?X)&LESS-THAN(DEF[?Y; SIZE(?X,?Y)], average-size-of-lion)].",
        "(4) Interpretation of a postmodification A relative clause (in restrictive use) maps the head noun into a modified noun, as follows: (which(sentence))(noun).",
        "A distinguished symbol 'which' announces the occurence of a relative clause and sends the denotation of the antecedent as a message.",
        "The argument of 'which' is a sentence including the eliminated noun phrase '1/ante' which will receive the message andsubstitutethe denotation.",
        "See the following example: the((which(I(Ax[iiante(Ay[attack(x,y)])]))) (problem)) \"the problem which I attack\" Interpreting the formula is:",
        "An adjective prepositional phrase also modifies a noun.",
        "An attributive noun or a de-verbal noun is treated as a noun which is a one-place predicate in LE, but which takes two or more arguments in PSN level.",
        "Adjective prepositional phrases supply these arguments to the head noun.",
        "For example, interpreting the LE: theaY [(the(car))(Ax[(((*ap(of))(x))(color))(y)])]), \"the color of the car\",",
        "proper-name: DEF[?X; NAME('proper-name,?X)].",
        "(3) Interpretation of an adjective",
        "An adjective maps a noun into another noun.",
        "Here we treat those that plays this role.",
        "Interpretation of plural is: *pl(noun): A?X[SUBSET(?X,SETOF[?Y; noun*(?Y)])] i.e., *pl(noun) denotes a predicate which is true iff the argument is a subset of {xl noun*(x)}.",
        "Adjectives areinterpretedby word specialists embedded in the dictionary.",
        "A word specialist for an adjective examines the argument (a noun) and maps it into another noun.",
        "Thus in the interpretation process, the message communications between specialists play a significant role.",
        "(5) Interpretation of a noun clause A space is used to denote the interpretation of a noun clause.",
        "A noun clause is interpreted as follows: --90-fun(sentence)DEF[?X; fun*(?X,w1)], where T(wl,sentence*), where 'fun' stands for a symbol such as 'that', 'whether' ... etc, that maps a sentence into a noun clause.Fun* is an appropriate PSN predicate.T(w,p) is a meta.",
        "predicate that means the object formula p is true in the possible world (or space) denoted by w. For example, interpreting the LE: why(not((the(program))(Xx[work(x)]))), \"why the program does not work\" results in DEF[?X; REASON(?X,w2)], where T(w2,NOT(WORK(the-program*))).",
        "In this case, fun=why and fun*=REASON.",
        "The resuting denotation roughly reads \"the reason of the situation w2 and in w2 the object referred to by the expression the(program) does not work.\"",
        "(6) Interpretation of other features - Possessive form is treated as a compound determiner.",
        "See the following example:",
        "where, *psubjsends as a message the denotation of the deep subject, and *en receives the message to supply the OBJECT slot of the internal verb ACCEPT.",
        "Extensioning intensional structures An intensional PSN structure for a noun phrase is extensioned if the PSN structure is put into a case slot which indicates extensionality.",
        "An INDEF type PSN structure is replaced by an I-unit (which denotes an individual constant).",
        "For example, I(Xx[(a(book))(Xy[possess(x,y)])]), \"I have a book.\" The intermediate PSN structure is: POSSESS(\"I\",INDEF[?X; BOOK(?X)]).",
        "Since the OBJECT slot of the predicate POSSESS indicates extensionality, this becomes AND(POSSESS(\"I\",C),BOOK(C)), where C is a Skolem constant.",
        "For DEF type structure, since the denotation refers some uniquely determined object, a referent search program is activated.",
        "The program searches local contextual memory by matching each candidate against the given intensional PSN structure.",
        "The pattern matching operation in PSN corresponds to deduction on meta language, that is, the defintion of match is: PSN, matches PSN, iff meta(PSN1) Implies meta(PSN2) In order to find the referent, various kinds of knowledge will be needed [5].",
        "However, this topic is beyond the scope of this paper.",
        "The intensional PSN structure is replaced by a PSN structure found.",
        "For example, consider the following two sentences: This paper describes a system.... (1) The system analyzes programs.... (2) After the interpretation of the sentence (1), the local memory contains: DESCRIBE(A,B)&PAPER(A)&SYSTEM(B).",
        "For the sentence (2), the intermediate structure is: ANALYZE(DEF[?X; SYSTEM(?X)],programs*).",
        "After the referentsearch procedure, the structure becomes: ANALYZE(B,programs*).",
        "Since the denotation DEF[?X; SYSTEM(?X)] matches the node B (for, SYSTEM(B) holds), it is replaced by the node B."
      ]
    },
    {
      "heading": "5. Discussion",
      "text": [
        "All the mechanisms presented so far has been implemented as LISP programs and are working on the personal LISP system in our laboratory.",
        "Now experiments and improvements are in progress.",
        "As stated in the first section, advantages of our method can be shown if it is applied to wide applications.",
        "Experiments are in progress as for machine translation and question answering.",
        "91--Machine translation [12] Asthe firststeptothe machine translation, we are implementing a program which generates Japanese from the LE obtained by analyzing English.The generator program evaluates LE justthe same way as, the interpretation program does.This approach investigatesthe linguistic phenomenain analyzing and generating natural language.",
        "Question answering [9], [10] Another application is to answer questions about the integrated network structure.",
        "In order to make conversation with a user, the input sentence should be further evaluated.",
        "For example, for user's question actual question/answering process must be invoked.",
        "Thus a pattern directed procedure is used.",
        "This approach investigates meaning representation and deduction.",
        "Extension to other languages [11] The meaning representation is, in principle, independent of which language is used.",
        "To show this, we must analyze more than one languages.",
        "Although in this paper, the object language is English, we have implemented a Japanese parser and are in the course of implementation of Japanese to English machine translation program.",
        "Further work The important problems to be solved are: the problem of discourse, especially, how to treat focus attention or ellipsis in our formalism, the semantics of PSN; the semantics of PSN may be defined either by associating each network structure with a logic-oriented meta language or by defining inference rules on PSN explicitly; the semantics must explicate implications andsynonyms among PSN structures; furthermore the semantics must be extended to treat the concepts such as action or event, accommodation of transformational aspects; it seems that the transformational theory further decomposes the translation mapping T; theintroduction of transformational aspect will increase the feasibility of the system."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "We have shown a logico-linguistic approach to the analysis of natural language by computer.",
        "AT techniques are combined with Montague-type grammar.",
        "The main features of the approach are shown for the fundamental subset of English.",
        "The promising applications may be semantic based machine translation and deductive question answering on natural language."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "We would like to thank the other members of Prof. Doshita's laboratory, and in particular, Mr. Masaki KIYONO both for his participations of numerous discussions and for his assistance."
      ]
    }
  ]
}
