{
  "info": {
    "authors": [
      "Maxim Khalilov",
      "Khalil Sima'an"
    ],
    "book": "Proceedings of the 4th Workshop on Syntax and Structure in Statistical Translation",
    "id": "acl-W10-3812",
    "title": "A Discriminative Syntactic Model for Source Permutation via Tree Transduction",
    "url": "https://aclweb.org/anthology/W10-3812",
    "year": 2010
  },
  "references": [
    "acl-C04-1073",
    "acl-D07-1077",
    "acl-D08-1089",
    "acl-D09-1105",
    "acl-E99-1010",
    "acl-J03-1005",
    "acl-J04-4002",
    "acl-N03-1017",
    "acl-N04-4026",
    "acl-N10-3010",
    "acl-P02-1038",
    "acl-P02-1040",
    "acl-P03-1019",
    "acl-P03-1021",
    "acl-P03-1054",
    "acl-P05-1033",
    "acl-P05-1066",
    "acl-P06-1066",
    "acl-P06-1121",
    "acl-P98-2230",
    "acl-W04-3250",
    "acl-W06-1609",
    "acl-W06-3119"
  ],
  "sections": [
    {
      "text": [
        "A Discriminative Syntactic Model for Source Permutation",
        "via Tree Transduction",
        "Maxim Khalilov and Khalil Sima'an",
        "Institute for Logic, Language and Computation University of Amsterdam",
        "{m.khalilov,k.simaan}@uva.nl",
        "A major challenge in statistical machine translation is mitigating the word order differences between source and target strings.",
        "While reordering and lexical translation choices are often conducted in tandem, source string permutation prior to translation is attractive for studying reordering using hierarchical and syntactic structure.",
        "This work contributes an approach for learning source string permutation via transfer of the source syntax tree.",
        "We present a novel discriminative, probabilistic tree transduction model, and contribute a set of empirical upperbounds on translation performance for English-to-Dutch source string permutation under sequence and parse tree constraints.",
        "Finally, the translation performance of our learning model is shown to outperform the state-of-the-art phrase-based system significantly."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "From its beginnings, statistical machine translation (SMT) has faced a word reordering challenge that has a major impact on translation quality.",
        "While standard mechanisms embedded in phrase-based SMT systems, e.g. (Och and Ney, 2004), deal efficiently with word reordering within a limited window of words, they are still not expected to handle all possible reorderings that involve words beyond this relatively narrow window, e.g., (Tillmann and Ney, 2003; Zens and Ney, 2003; Tillman, 2004).",
        "More recent work handles word order differences between source and target languages using hierarchical methods that draw on Inversion Transduction Grammar (ITG), e.g., (Wu and Wong, 1998; Chiang, 2005).",
        "In principle, the latter approach explores reordering defined by the choice of swapping the order of sibling subtrees under each node in a binary parse-tree of the source/target sentence.",
        "An alternative approach aims at minimizing the need for reordering during translation by permuting the source sentence as a pre-translation step, e.g., (Collins et al., 2005; Xia and McCord, 2004; Wang et al., 2007; Khalilov, 2009).",
        "In effect, the translation process works with a model for source permutation (s – s ) followed by translation model (s – t), where s and t are source and target strings and s is the target-like permuted source string.",
        "In how far can source permutation reduce the need for reordering in conjunction with translation is an empirical question.",
        "In this paper we define source permutation as the problem of learning how to transfer a given source parse-tree into a parse-tree that minimizes the divergence from target word-order.",
        "We model the tree transfer ts – ts/ as a sequence of local, independent transduction operations, each transforming the current intermediate tree t / into the next intermediate tree t / , with tso = ts and",
        "t / = t / .",
        "A transduction operation merely permutes the sequence of n > 1 children of a single node in an intermediate tree, i.e., unlike previous work, we do not binarize the trees.",
        "The number of permutations is factorial in n, and learning a sequence of transductions for explaining a source permutation can be computationally rather challenging (see (Tromble and Eisner, 2009)).",
        "Yet,",
        "from the limited perspective of source string permutation (s – s ), another challenge is to integrate a figure of merit that measures in how far s resembles a plausible target word-order.",
        "We contribute solutions to these challenging problems.",
        "Firstly, we learn the transduction operations using a discriminative estimate of P(n(ax) | Nx, ax, contextx), where Nx is the label of node (address) x, Nx – axis the context-free production under x, n(ax) is a permutation of ax and contextx represents a surrounding syntactic context.",
        "As a result, this constrains {n(ax)} only to those found in the training data, and it conditions the transduction application probability on its specific contexts.",
        "Secondly, in every sequence s0 = s,... ,sn = s resulting from a tree transductions, we prefer those local transductions on t / that lead to source string permutation that are closer to target word order than s^_ 1; we employ s language model probability ratios as a measure of word order improvement.",
        "In how far does the assumption of source permutation provide any window for improvement over a phrase-based translation system?",
        "We conduct experiments on translating from English into Dutch, two languages which are characterized by a number of systematic divergences between them.",
        "Initially, we conduct oracle experiments with varying constraints on source permutation to set upperbounds on performance relative to a state-of-the-art system.",
        "Translating the oracle source string permutation (obtained by untangling the crossing alignments) offers a large margin of improvement, whereas the oracle parse tree permutation provides a far smaller improvement.",
        "A minor change to the latter to also permute constituents that include words aligned with NULL, offers further improvement, yet lags bahind bare string permutation.",
        "Subsequently, we present translation results using our learning approach, and exhibit a significant improvement in BLEU score over the state-of-the-art baseline system.",
        "Our analysis shows that syntactic structure can provide important clues for reordering in translation, especially for dealing with long distance cases found in, e.g., English and Dutch.",
        "Yet, tree transduction by merely permuting the order of sister subtrees might turn out insufficient."
      ]
    },
    {
      "heading": "2. Baseline: Phrase-based SMT",
      "text": [
        "Given a word-aligned parallel corpus, phrase-based systems (Och and Ney, 2002; Koehn et al., 2003) work with (in principle) arbitrarily large phrase pairs (also called blocks) acquired from word-aligned parallel data under a simple definition of translational equivalence (Zens et al., 2002).",
        "The conditional probabilities of one phrase given its counterpart are interpolated log-linearly together with a set of other model estimates:",
        "where a feature function hm refer to a system model, and the corresponding Am refers to the relative weight given to this model.",
        "A phrase-based system employs feature functions for a phrase pair translation model, a language model, a reordering model, and a model to score translation hypothesis according to length.",
        "The weights Am are usually optimized for system performance (Och, 2003) as measured by BLEU (Papineni et al., 2002).",
        "Two reordering methods are widely used in phrase-based systems.",
        "Distance-based A simple distance-based reordering model default for Moses system is the first reordering technique under consideration.",
        "This model provides the decoder with a cost linear to the distance between words that should be reordered.",
        "MSD A lexicalized block-oriented data-driven reordering model (Tillman, 2004) considers three different orientations: monotone (M), swap (S), and discontinuous (D).",
        "The reordering probabilities are conditioned on the lexical context of each phrase pair, and decoding works with a block sequence generation process with the possibility of swapping a pair of blocks."
      ]
    },
    {
      "heading": "3. Related Work on Source Permutation",
      "text": [
        "The integration of linguistic syntax into SMT systems offers a potential solution to reordering problem.",
        "For example, syntax is successfully integrated into hierarchical SMT (Zollmann and",
        "Venugopal, 2006).",
        "Similarly, the tree-to-string syntax-based transduction approach offers a complete translation framework (Galley et al., 2006).",
        "The idea of augmenting SMT by a reordering step prior to translation has often been shown to improve translation quality.",
        "Clause restructuring performed with hand-crafted reordering rules for German-to-English and Chinese-to-English tasks are presented in (Collins et al., 2005) and (Wang et al., 2007), respectively.",
        "In (Xia and McCord, 2004; Khalilov, 2009) word reordering is addressed by exploiting syntactic representations of source and target texts.",
        "Other reordering models operate provide the decoder with multiple word orders.",
        "For example, the MaxEnt reordering model described in (Xiong et al., 2006) provides a hierarchical phrasal reordering system integrated within a CKY-style decoder.",
        "In (Galley and Manning, 2008) the authors present an extension of the famous MSD model (Tillman, 2004) able to handle long-distance word-block permutations.",
        "Coming up-to-date, in (PVS, 2010) an effective application of data mining techniques to syntax-driven source reordering for MT is presented.",
        "Recently, Tromble and Eisner (2009) define source permutation as learning source permutations; the model works with a preference matrix for word pairs, expressing preference for their two alternative orders, and a corresponding weight matrix that is fit to the parallel data.",
        "The huge space of permutations is then structured using a binary synchronous context-free grammar (Binary ITG) with O(n) parsing complexity, and the permutation score is calculated recursively over the tree at every node as the accumulation of the relative differences between the word-pair scores taken from the preference matrix.",
        "Application to German-to-English translation exhibits some performance improvement.",
        "Our work is in the general learning direction taken in (Tromble and Eisner, 2009) but differs both in defining the space of permutations, using local probabilistic tree transductions, as well as in the learning objective aiming at scoring permutations based on a log-linear interpolation of a local syntax-based model with a global string-based (language) model."
      ]
    },
    {
      "heading": "4. Pre-Translation Source Permutation",
      "text": [
        "Given a word-aligned parallel corpus, we define the source string permutation as the task of learning to unfold the crossing alignments between sentence pairs in the parallel corpus.",
        "Let be given a source-target sentence pair s – t with word alignment set a between their words.",
        "Unfolding the crossing instances in a should lead to as monotone an alignment a as possible between a permutation s of s and the target string t. Conducting such a \"monotonization\" on the parallel corpus gives two parallel corpora: (1) a source-to-permutation parallel corpus (s – s ) and (2) a source permutation-to-target parallel corpus (s – t).",
        "The latter corpus is word-aligned automatically again and used for training a phrase-based translation system, while the former corpus is used for training our model for pre-translation source permutation via parse tree transductions.",
        "that PRP VBP",
        "In itself, the problem of permuting the source string to unfold the crossing alignments is computationally intractable (see (Tromble and Eisner, 2009)).",
        "However, different kinds of constraints can be made on unfolding the crossing alignments in a.",
        "A common approach in hierarchical SMT is to assume that the source string has a binary parse tree, and the set of eligible permutations is defined by binary ITG transductions on this tree.",
        "This defines permutations that can be obtained only by at most inverting pairs of children under nodes of the source tree.",
        "Figure 1 exhibits a long distance reordering of the verb in English-to-Dutch translation: inverting the order of the children under the VP node would unfold the crossing alignment.",
        "As has been shown in the literature (Costa-jussà and Fonollosa, 2006; Khalilov and Sima'an, 2010; Wang et al., 2007), source and target texts mono-tonization leads to a significant improvement in terms of translation quality.",
        "However it is not known how many alignment crossings can be unfolded under different parse tree conditions.",
        "In order to gauge the impact of corpus monotonization on translation system performance, we trained a set of oracle translation systems, which create target sentences that follow the source language word order using the word alignment links and various constraints.",
        "do so gladly",
        "graag doen",
        "(a) Word alignment.",
        "do : so gladly j",
        "o gladly",
        "(c) Word alignment and ADJP span.",
        "(b) Parse tree and corresponding alignment.",
        "The set-up of our experiments and corpus characteristics are detailed in Section 5.",
        "Table 1 reports translation scores of the oracle systems.",
        "Notice that all the numbers are calculated on the realigned corpora.",
        "Baseline results are provided for informative purposes.",
        "String permutation The first oracle system under consideration is created by traversing the string from left to right and unfolding all crossing alignment links (we call this system oracle-string).",
        "For example in Figure 2(a), the oracle-string system generates a string \"do so gladly\" swapping the words \"do\" and \"gladly\" without considering the parse tree.",
        "The first line of the table shows the performance of the oracle-string system with monotone source and target portions of the corpus.",
        "Oracle under tree constraint We use a syntactic parser for parsing the English source sentences that provide nary constituency parses.",
        "Now we constrain unfolding crossing alignments only to those alignment links which agree with the structure of the source-side parse tree and consider the constituents which include aligned tokens only.",
        "Unfolding a crossing alignment is modeled as permuting the children of a node in the parse tree.",
        "We refer to this oracle system as oracle-tree.",
        "For example provided in Figure 2(b), there is no way to construct a monotonized version of the sentence since the word \"so\" is aligned to NULL and impedes swapping the order of VB and ADJP under the VP.",
        "Oracle under relaxed tree constraint The oracle-tree system does not permute the words which are both (1) not found in the alignment and (2) are spanned by the sub-trees sibling to the reordering constituents.",
        "Now we introduce a relaxed version of the parse tree constraint: the order of the children of a node is permuted when the node covers the reordering constituents and also when the frontier contains leaf nodes aligned with NULL (oracle-span).",
        "For example, in Figure 2(c) the English word \"so\" is not aligned, but according to the relaxed version, must move together with the word \"gladly\" since they share a parent node (ADJP).",
        "The main conclusion which can be drawn from the oracle results is that there is a possibility for relatively big («3 BLEU points) improvement with complete unfolding of crossing alignments and very limited («0.05 BLEU points) with the same done under the parse tree constraint.",
        "A tree-based system that allows for permuting unaligned words that are covered by a dominating parent node shows more improvement in terms of BLEU and NIST scores («0.9 BLEU points).",
        "The gap between oracle-string and oracle-tree performance is due to alignment crossings which cannot be unfolded under trees (illustrated in Figure 3), but possibly also due to parse and alignment errors.",
        "Source",
        "BLEU",
        "NIST",
        "baseline dist",
        "24.04",
        "6.29",
        "baseline MSD",
        "24.04",
        "6.28",
        "oracle – string",
        "27.02",
        "6.51",
        "oracle – tree",
        "24.09",
        "6.30",
        "oracle – span",
        "24.95",
        "6.37",
        "Given a parallel corpus with string pairs s – t with word alignment a, we create a source permuted parallel corpus s – s by unfolding the crossing alignments in a: this is done by scanning the string s from left to right and moving words involved in crossing alignments to positions where the crossing alignments are unfolded).",
        "The source strings s are parsed, leading to a single parse tree Ts per source string.",
        "Our model aims at learning from the source permuted parallel corpus s – s a probabilistic optimization argmaxn(s) P(n(s) | s,Ts).",
        "We assume that the set of permutations {n(s)} is defined through a finite set of local transductions over the tree ts.",
        "Hence, we view the permutations leading from s to s as a sequence of local tree transductions t / – ... – tj , where s0 = s and sn = s , and each transduction t / – t / is defined using a tree transduction operation that at most permutes the children of a single node in t I as defined next.",
        "A local transduction t i – t i is modelled by an operation that applies to a single node with address x in t i , labeled Nx, and may permute the ordered sequence of children ax dominated by node x.",
        "This constitutes a direct generalization of the ITG binary inversion transduction operation.",
        "We assign a conditional probability to each such local transduction:",
        "where n(ax) is a permutation of ax (the ordered sequence of node labels under x) and Cx is a local tree context of node x in tree T i .",
        "One wrinkle in this definition is that the number of possible permutations of axis factorial in the length of ax.",
        "Fortunately, the source permuted training data exhibits only a fraction of possible permutations even for longer ax sequences.",
        "Furthermore, by conditioning the probability on local context, the general applicability of the permutation is restrained.",
        "Given this definition, we define the probability of the sequence of local tree transductions Tsi – .",
        ".",
        ".",
        " – Tsi as",
        "The problem of calculating the most likely permutation under this transduction model is made difficult by the fact that different transduction sequences may lead to the same permutation, which demands summing over these sequences.",
        "Furthermore, because every local transduction conditions on local context of an intermediate tree, this quickly risks becoming intractable (even when we use packed forests).",
        "In practice we take a pragmatic approach and greedily select at every intermediate point Tsi – Tsi the single most likely local transduction that can be conducted on any node of the current intermediate tree Tsi using an interpolation of the term in Equation 2 with string probability ratios as follows:",
        "The rationale behind this log-linear interpolation is that our source permutation approach aims at finding the optimal permutation s of s that can serve as input for a subsequent translation model.",
        "Hence, we aim at tree transductions that are syntactically motivated that also lead to improved string permutation.",
        "In this sense, the tree trans-duction definitions can be seen as an efficient and syntactically informed way to define the space of possible permutations.",
        "We estimate the string probabilities P(si) using 5-gram language models trained on the s side of the source permuted parallel corpus s – s .",
        "We estimate the conditional probability P(n(ax) | Nx – ax,Cx) using a Maximum-Entropy framework, where feature functions are defined to capture the permutation as a class, the node label Nx and its head POS tag, the child sequence ax together with the corresponding sequence of head POS tags and other features corresponding to different contextual information.",
        "We were particularly interested in those linguistic features that motivate reordering phenomena from the syntactic and linguistic perspective.",
        "The features that were used for training the permutation system are extracted for every internal node of the source tree that has more than one child:",
        "• Local tree topology.",
        "Sub-tree instances that include parent node and the ordered sequence of child node labels.",
        "• Dependency features.",
        "Features that determine the POS tag of the head word of the current node, together with the sequence of POS tags of the head words of its child nodes.",
        "• Syntactic features.",
        "Three binary features from this class describe: (1) whether the parent node is a child of the node annotated with the same syntactic category, (2) whether the parent node is a descendant of the node annotated with the same syntactic category, and (3) if the current subtree is embedded into a \"SENT-SBAR\" sub-tree.",
        "The latter feature intends to model the divergence in word order in relative clauses between Dutch and English which is illustrated in Figure 1.",
        "In initial experiments we piled up all feature functions into a single model.",
        "Preliminary results showed that the system performance increases if the set of patterns is split into partial classes conditioned on the current node label.",
        "Hence, we trained four separate MaxEnt models for the categories with potentially high number of crossing alignments, namely VP, NP, SENT, and SBAR.",
        "For combinatory models we use the following notations: M4 = J2i£[ NP, VP, SENT, SBAR] Mi and m2 = Xyi£[VP, SENT] Mi."
      ]
    },
    {
      "heading": "5. Experiments and results",
      "text": [
        "The SMT system used in the experiments was implemented within the open-source MOSES toolkit (Koehn et al., 2007).",
        "Standard training and weight tuning procedures which were used to build our system are explained in details on the MOSES web page.",
        "The MSD model was used together with a distance-based reordering model.",
        "Word alignment was estimated with GIZA++ tool (Och, 2003), coupled with mk-cls (Och, 1999), which allows for statistical word clustering for better generalization.",
        "An 5-gram target language model was estimated using the SRI LM toolkit (Stolcke, 2002) and smoothed with modified Kneser-Ney discounting.",
        "We use the Stanford parser (Klein and Manning, 2003) as a source-side parsing engine.",
        "The parser was trained on the English treebank set provided with 14 syntactic categories and 48 POS tags.",
        "The evaluation conditions were case-sensitive and included punctuation marks.",
        "For Maximum Entropy modeling we used the maxent toolkit.",
        "Data The experiment results were obtained using the English-Dutch corpus of the European Parliament Plenary Session transcription (EuroParl).",
        "Training corpus statistics can be found in Table 2.",
        "The development and test datasets were randomly chosen from the corpus and consisted of 500 and 1,000 sentences, respectively.",
        "Both were provided with one reference translation.",
        "Dutch",
        "English",
        "Sentences",
        "1.2M",
        "1.2M",
        "Words",
        "32.9 M",
        "33.0 M",
        "Average sentence length",
        "27.20",
        "27.28",
        "Vocabulary",
        "228 K",
        "104 K",
        "Results Evaluation of the system performance is twofold.",
        "In the first step, we analyze the quality of reordering method itself.",
        "In the next step we look at the automatic translation scores and evaluate the impact which the choice of reordering strategy has on the translation quality.",
        "In both stages of evaluation, the results are contrasted with the performance shown by the standard phrase-based SMT system (baseline) and with oracle results.",
        "Source reordering analysis Table 3 shows the parameters of the reordered system allowing to assess the effectiveness of reordering permutations, namely: (1) a total number of crossings found in the word alignment (#C), (2) the size of the resulting phrase table (PT), (3) BLEU, NIST, and WER scores obtained using monotonized parallel corpus (oracle) as a reference.",
        "All the numbers are calculated on the realigned corpora.",
        "Calculations are done on the basis of the 100,000 line extraction from the corpus and corresponding alignment matrix.",
        "The baseline rows show the number of alignment crossings found in the original (unmonotonized) corpus.",
        "Translation scores The evaluation results for the development and test corpora are reported in Table 4.",
        "They include two baseline configurations (dist and MSD), oracle results and contrasts them with the performance shown by different combinations of single-category tree-based reordering models.",
        "Best scores within each experimental section are placed in cells filled with grey.",
        "Analysis The number of crossings found in word alignment intersection and BLEU/NIST/WER scores estimated on reordered data vs. monotonized data report the reordering algorithm effectiveness.",
        "A big gap between number of crossings and total number of reorderings per corpus found in oracle-string system and baseline systems demonstrates the possible reduction of system's non-monotonicity.",
        "The difference in number of crossings and BLEU/NIST/WER scores between the oracle-span and the best performing MaxEnt models (namely, M2) shows the level of performance of the prediction module.",
        "A number of distinct phrase translation pairs in the translation table implicitly reveals the generalization capabilities of the translation system since it simplifies the translation task.",
        "From the other hand, increased number of shorter phrases can add noise in the reordered data and makes decoding more complex.",
        "Hence, the size of phrase table itself can not be considered as a robust indicator of its translation potential.",
        "System",
        "Dev",
        "Test",
        "BLEU",
        "BLEU",
        "NIST",
        "baseline dist",
        "23.88",
        "24.04",
        "6.29",
        "baseline MSD",
        "(24.07",
        "24.04",
        "6.28",
        "oracle-string",
        "26.28",
        "27.02",
        "6.50",
        "oracle-tree",
        "23.84",
        "24.09",
        "6.30",
        "oracle-span",
        "24.79",
        "24.95",
        "6.35",
        "Mnp",
        "23.79",
        "23.81",
        "6.27",
        "Mvp",
        "24.16",
        "24.55",
        "6.29",
        "Msent",
        "24.27",
        "24.56",
        "6.32",
        "Msbar",
        "23.99",
        "24.12",
        "6.27",
        "Ma",
        "23.50",
        "23.86",
        "6.29",
        "M2",
        "J24.28",
        "24.64",
        "6.33",
        "System",
        "#C",
        "PT",
        "Scores",
        "BLEU",
        "NIST",
        "WER",
        "Oracle",
        "string",
        "54.6K",
        "48.4M",
        "-",
        "-",
        "-",
        "tree",
        "187.3K",
        "30.3M",
        "71.73",
        "17.01",
        "16.77",
        "span",
        "146.9K",
        "33.0M",
        "73.41",
        "17.11",
        "15.73",
        "Baselines",
        "baselines",
        "187.0K",
        "29.8M",
        "71.70",
        "17.07",
        "16.55",
        "Category models",
        "Mnp",
        "188.9K",
        "29.7M",
        "71.63",
        "17.07",
        "16.52",
        "Mvp",
        "168.1K",
        "29.8M",
        "73.17",
        "17.16",
        "15.99",
        "Msent",
        "171.0K",
        "29.8M",
        "73.08",
        "17.08",
        "16.10",
        "Ms bar",
        "188.6K",
        "29.8M",
        "72.89",
        "16.90",
        "16.41",
        "Combinatory models",
        "Ma",
        "193.2K",
        "29.1M",
        "70.98",
        "16.85",
        "16.78",
        "M2",
        "165.4K",
        "29.9M",
        "73.07",
        "16.92",
        "15.88",
        "Table 4 shows that three of six MaxEnt reordering systems outperform baseline systems by about 0.5-0.6 BLEU points, that is statistically significant.",
        "The combination of NP, NP, SENT, and SBAR models do not show good performance possibly due to increased sparseness of reordering patterns.",
        "However, the system that consider only the MVP and Msent models achieves 0.62 BLEU score gain over the baseline configurations.",
        "The main conclusion which can be drawn from analysis of Tables 3 and 4 is that there is an evident correlation between characteristics of reordering system and performance demonstrated by the translation system trained on the corpus with reordered source part.",
        "Example Figure 4 exemplifies the sentences that presumably benefits from the monotonization of the source part of the parallel corpus.",
        "The example demonstrates a pervading syntactic distinction between English and Dutch: the reordering of verb-phrase subconstituents VP NP PP within the relative clause into PP NP VP."
      ]
    },
    {
      "heading": "6. Conclusions and future work",
      "text": [
        "We introduced a tree-based reordering model that aims at monotonizing the word order of source and target languages as a pre-translation step.",
        "Our model avoids complete generalization of reordering instances by using tree contexts and limiting the permutations to data instances.",
        "From a learning perspective, our work shows that navigating a large space of intermediate tree transformations can be conducted effectively using both the source-side syntactic tree and a language model of the idealized (target-like) source-permuted language.",
        "We have shown the potential for translation quality improvement when target sentences are created following the source language word order («3 BLEU points over the standard phrase-based SMT) and under parse tree constraint («0.9 BLEU points).",
        "As can be seen from these results, our model exhibits competitive translation performance scores compared with the standard distance-based and lexical reordering.",
        "The gap between the oracle and our system's results leaves room for improvement.",
        "We intend to study extensions of the current tree transfer model to narrow this performance gap.",
        "As a first step we are combining isolated models for concrete syntactic categories and aggregating more features into the MaxEnt model.",
        "Algorithmic improvements, such as beam-search and chart parsing, could allow us to apply our method to full parse-forests as opposed to a single parse tree.",
        "(a) Original parse tree.",
        "(b) Reordered parse tree.",
        "Src: that... to lead the Commission during the next five-year term Ref.",
        ": dat... om de komende vijfjaar de Commissie te leiden Baseline MSD: dat... om het voortouw te nemen in de Commissie tijdens de komende vijfjaar Rrd src: that... during the next five-year term the Commission to lead M2 : dat... om de Commissie tijdens de komende vijfjaar te leiden (c) Translations."
      ]
    }
  ]
}
