{
  "info": {
    "authors": [
      "Atsushi Fujita",
      "Shuhei Kato",
      "Naoki Kato",
      "Satoshi Sato"
    ],
    "book": "ACL-PASCAL Workshop on Textual Entailment and Paraphrasing",
    "id": "acl-W07-1425",
    "title": "A Compositional Approach toward Dynamic Phrasal Thesaurus",
    "url": "https://aclweb.org/anthology/W07-1425",
    "year": 2007
  },
  "references": [
    "acl-I05-5001",
    "acl-I05-5004",
    "acl-N03-1003",
    "acl-N06-1008",
    "acl-N07-1071",
    "acl-P02-1028",
    "acl-P98-1116",
    "acl-W04-3205",
    "acl-W04-3206",
    "acl-W05-1202"
  ],
  "sections": [
    {
      "text": [
        "Atsushi Fujita Shuhei Kato Naoki Kato Satoshi Sato",
        "To enhance the technology for computing semantic equivalence, we introduce the notion of phrasal thesaurus which is a natural extension of conventional word-based thesaurus.",
        "Among a variety of phrases that conveys the same meaning, i.e., paraphrases, we focus on syntactic variants that are compositionally explainable using a small number of atomic knowledge, and develop a system which dynamically generates such variants.",
        "This paper describes the proposed system and three sorts of knowledge developed for dynamic phrasal thesaurus in Japanese: (i) transformation pattern, (ii) generation function, and (iii) lexical function."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Linguistic expressions that convey the same meaning are called paraphrases.",
        "Handling paraphrases is one of the key issues in a broad range of natural language processing tasks, including machine translation, information retrieval, information extraction, question answering, summarization, text mining, and natural language generation.",
        "Conventional approaches to computing semantic equivalence between two expressions are five-fold.",
        "The first approximates it based on the similarities between their constituent words.",
        "If two words belong to closer nodes in a thesaurus or semantic network, they are considered more likely to be similar.",
        "The second uses the family of tree kernels (Collins and Duffy, 2001; Takahashi, 2005).",
        "The degree of equivalence of two trees (sentences) is defined as the number of common subtrees included in both trees.",
        "The third estimates the equivalence based on word alignment composed using templates or translation probabilities derived from a set of parallel text (Barzilay and Lee, 2003; Brockett and Dolan, 2005).",
        "The fourth espouses the distributional hypothesis (Harris, 1968): given two words are likely to be equivalent if distributions of their surrounding words are similar (Lin and Pantel, 2001; Weeds et al., 2005).",
        "The final regards two expressions equiva-lentifthey can be associated by using a setoflexico-syntactic paraphrase patterns (Mel'cuk, 1996; Dras, 1999; Yoshikane et al., 1999; Takahashi, 2005).",
        "Despite the results previous work has achieved, no system that robustly recognizes and generates paraphrases is established.",
        "We are not convinced of a hypothesis underlying the word-based approaches because the structure of words also conveys some meaning.",
        "Even tree kernels, which take structures into account, do not have a mechanism for identifying typical equivalents: e.g., dative alternation and passivization, and abilities to generate paraphrases.",
        "Contrary to the theoretical basis, the two lines of corpus-based approaches have problems in practice, i.e., data sparseness and computation cost.",
        "The pattern-based approaches seem steadiest.",
        "Yet no complete resource or methodology for handling a wide variety of paraphrases has been developed.",
        "On the basis of this recognition, we introduce the notion of phrasal thesaurus to directly compute semantic equivalence of phrases such as follows.",
        "b. its reproducibility / if it is reproducible c. decrease sharply / show a sharp decrease",
        "d. investigate the cause of a fire / investigate why there was a fire / investigate what started a fire / make an investigation into the cause of a fire",
        "Phrasal thesaurus is a natural extension ofconven-tional word-based thesaurus.",
        "It is thus promised that it will bring us the following benefits: Enhancement of NLP applications: As conventional thesauri, phrasal thesaurus must be useful to handle paraphrases having different structures in a wide range of NLP applications.",
        "Reading and writing aids: Showing more appropriate alternative phrases must be a powerful aid at certain situations such as writing text.",
        "Controlling readability of text by altering phrases must also be beneficial to readers.",
        "Our aim is to develop resources and mechanisms for computing semantic equivalence on the working hypothesis that phrase is the appropriate unit for that purpose.",
        "This paper describes the first version of our paraphrase generation system and reports on our ongoing work on constructing resources for realizing phrasal thesaurus.",
        "The following sections describe the range of phenomena we treat (Section 2), the overall architecture of our paraphrase generation system which functions as phrasal thesaurus (Section 3), the implementation of knowledge bases (Section 4) followed by discussion (Section 5), and conclusion (Section 6)."
      ]
    },
    {
      "heading": "2. Dynamic phrasal thesaurus 2.1 Issue",
      "text": [
        "Toward realizing phrasal thesaurus, the following two issues should be discussed.",
        "• What sorts of phrases should be treated",
        "• How to cope with a variety of expressions Although technologies of shallow parsing have",
        "been dramatically improved in the last decade, it is still difficult to represent arbitrary expression in logical form.",
        "We therefore think it is reasonable to define the range relying on lexico-syntactic structure instead of using particular semantic representation.",
        "According to the work of (Chklovski and Pan-tel, 2004; Torisawa, 2006), predicate phrase (simple sentence) is a reasonable unit because it approximately corresponds to the meaning of single event.",
        "Combination of words and a variety of construction coerce us into handling an enormous number of expressions than word-based approaches.",
        "One may think taking phrase is like treading a thorny path because one of the arguments in Section 1 is about coverage.",
        "On this issue, we speculate that one of the feasible approach to realize a robust system is to divide phenomena into compositional and non-compositional (idiosyncratic) ones, and separately develop resources to handle them as described in (Fujita and Inui, 2005).",
        "To compute semantic equivalence of idiosyncratic paraphrases, pairs or groups of paraphrases have to be statically compiled into a dictionary as word-based thesaurus.",
        "The corpus-based approach is valuable for that purpose, although they are not guaranteed to collect all idiosyncratic paraphrases.",
        "On the other hand, compositional paraphrases can be captured by a relatively small number of rules.",
        "Thus it seems tolerable approach to generate them dynamically by applying such rules.",
        "Our work is targeted at compositional paraphrases and the system can be called dynamic phrasal thesaurus.",
        "Hereafter, we refer to paraphrases that are likely to be explained compositionally as syntactic variants.",
        "While the discussion above does not depend on particular language, our implementation of dynamic phrasal thesaurus is targeted at Japanese.",
        "Several methods for paraphrasing Japanese predicate phrases have been proposed (Kondo et al., 1999; Kondo et al., 2001; Kaji et al., 2002; Fujita et al., 2005).",
        "The range they treat is, however, relatively narrow because they tend to focus on particular paraphrase phenomena or to rely on existing resources.",
        "On the other hand, we define the range of phenomena from a top-down viewpoint.",
        "As a concrete definition of predicate phrase in Japanese,",
        "noun phrase + case marker + predicate is employed which is hereafter referred to \"phrase.\"",
        "Noun phrase and predicate in Japanese themselves subcategorize various syntactic variants as shown in Figure 1 and paraphrase phenomena for above phrase also involve those focused on their interaction.",
        "Thus the range of phenomena is not so narrow, and intriguing ones, such as shown in examples (2) and (3), are included.",
        "(2) Head switching s. kakunin-o isogu.",
        "checking-acc to hurry-pres",
        "We hurry checking it.",
        "t. isoide kakunin-suru.",
        "in a hurry to check-pres",
        "We check it in a hurry.",
        "(3) Noun phrase o sub-clause",
        "s. kekka-no saigensei-o kenshou-suru.",
        "result-gen reproducibility-acc to validate-pres We validate its reproducibility.",
        "t. [ kekka-o saigen-dekiru ]",
        "result-acc to reproduce-to be able ka-douka-o kenshou-suru.",
        "[N]-whether-acc to validate-pres We validate whether it is reproducible.",
        "We focus on syntactic variants at least one side of which is subcategorized into the definition of phrase above.",
        "For the sake of simplicity, we hereafter represent those expressions using part-of-speech (POS) patterns.",
        "For instance, (2s) is called N : C : V type, and (3s) is N : no : N2 : C : V type."
      ]
    },
    {
      "heading": "3. Paraphrase generation system",
      "text": [
        "Given a phrase, the proposed system generates its syntactic variants in the following four steps:"
      ]
    },
    {
      "heading": "1.. Morphological analysis",
      "text": []
    },
    {
      "heading": "2.. Syntactic transformation",
      "text": []
    },
    {
      "heading": "3.. Surface generation with lexical choice",
      "text": []
    },
    {
      "heading": "4.. SLM-based filtering",
      "text": [
        "where no particular domain, occasion, and media is assumed.",
        "Candidates of syntactic variants are first over-generated in step 2 and then anomalies among them are filtered out in steps 3 and 4 using rule-based lexical choice and statistical language model.",
        "The rest of this section elaborates on each component in turn.",
        "Technologies of morphological analysis in Japanese have matured by introducing machine learning techniques and large-scale annotated corpus, and there are freely available tools.",
        "Since the structure of input phrase is assumed to be quite simple, employment of dependency analyzer was put off.",
        "We simply use a morphological analyzer MeCab.",
        "formal noun noun phrase < single word compound modified predicate < verb phrase N + suffixes Adjectival verb + N clause + N compound",
        "Our system has a post-analysis processing.",
        "If either of Sino-Japanese verbal nouns (e.g., \"kenshou (validation)\" and \"kandou (impression)\") or transliteration of verbs in foreign language (e.g., \"doraibu (to drive)\" and \"shifuto (to shift)\") is immediately followed by \"suru (to do)\" or \"dekiru (to be able),\" these adjacent two morphemes are joined into a single morpheme to avoid incorrect transformation.",
        "The second step over-generates syntactic variants using the following three sorts of knowledge:",
        "(i) Transformation pattern: It gives skeletons of syntactic variants.",
        "Each variant is represented by POS symbols designating the input constituents and triggers of the generation function and lexical function below.",
        "(ii) Generation function: It enumerates different expressions that are constituted with the same set of words and subcategorized into the required syntactic category.",
        "Some of generation functions handle base phrases, while the rest generates functional words.",
        "Base phrases the former generates are smaller than that transformation patterns treat.",
        "Since some functional words are disjunctive, the latter generates all candidates with a separator \"/\" and leaves the selection to the following step.",
        "original verb Sino-Japanese verb single word ^ lexical compound light verb Adv + \"suru\" original + original Sino + original",
        "Knowledge type",
        "Grammar Example Instantiation",
        "(i) Transformation pattern",
        "Ni : genCaseQ",
        "(b) kekka : no : saigensei : o : kenshou-suru result gen reproducibility acc to validate-pres kekka : genCase () : vp (saigensei) : ka-douka result case marker vp(reproducibility) [N]-whether",
        ": o : kenshou-suru acc to validate-pres",
        "(ii) Generation function",
        "verbal suffix for voice verbal suffix for tense",
        "(b) np (shukka, gen-in) np (starting fire, reason) vp (starting fire) wh (reason) vp (starting fire) [N]",
        "(iii) Lexical",
        "(a) adv (isogu) adv(to hurry) isoide in a hurry (given by a verb-adverb dictionary) } (given by a noun-interrogative dictionary)",
        "(iii) Lexical function: It generates different lexical items in certain semantic relations, such as derivative form, from a given lexical item.",
        "The back-end of this knowledge is a set of pre-compiled dictionaries as described in Section 4.2.",
        "Table 1 gives a summary of grammar in Backus-Naur form, examples, and instantiations of each knowledge.",
        "Figure 2 illustrates an example of knowledge application flow for transforming (4s) into (4t), where \":\" denotes delimiter of constituents.",
        "t. \"isoide: {kakunin-suru:",
        "First, transformation patterns that match to the given input are applied.",
        "Then, the skeletons of syntactic variants given by the pattern are lexicalized by consecutively invoking generation functions and lexical functions.",
        "Plural number of expressions that generation function and lexical function generate are enumerated within curly brackets.",
        "Transformation is ended when the skeletons are fully lexicalized.",
        "In fact, knowledge design for realizing the transformation is not really new, because we have been inspired by the previous pattern-based approaches.",
        "Transformation pattern is thus alike that in the Meaning-Text Theory (MTT) (Mel'oik, 1996), Synchronous Tree Adjoining Grammar (STAG) (Dras, 1999), meta-rule for Fastr (Yoshikane et al., 1999),",
        "advilsogu): vpjkakumn) \\",
        "Lex.",
        "Func.",
        "adv(V) Gen. Func.",
        "Isolde J {v(fyikimln): genVolceQ : gg/?",
        "?CT.vgQjJ",
        "Lex.",
        "Func.",
        "v(AO",
        "genVolceQ genTenseQ",
        "and transfer pattern for KURA (Takahashi et al., 2001).",
        "Lexical function is also alike that in MTT.",
        "However, our aim in this research is beyond the design.",
        "In other words, as described in Section 1, we are aiming at the following two: to develop resources for handling syntactic variants in Japanese, and to confirm if phrasal thesaurus really contribute to computing semantic equivalence.",
        "The input of the third component is a bunch of candidate phrases such as shown in (4t).",
        "This component does the following three processes in turn: Step 1.",
        "Unfolding: All word sequences are generated by removing curly brackets one by one.",
        "Step 2.",
        "Lexical choice: Disjunctive words are concatenated with \" \" (e.g., \"reru rareru\"in(4t)).",
        "One of them is selected based on POS and conjugation types of the preceding word.",
        "Step 3.",
        "Conjugation: In the transformation step, conjugative words are moved to different positions and some of them are newly generated.",
        "Inappropriate conjugation forms are corrected.",
        "In the final step, we assess the correctness of each candidate of syntactic variants using a statistical language model.",
        "Our model simply rejects candidate phrases that never appear in a large size of raw text corpus consisting of 15 years of newspaper articles (Mainichi 1991-2005, approximately 1.8GB).",
        "Although it is said that Japanese language has a degree of freedom in word ordering, current implementation does not yet employ structured language models because phrases we handle are simple."
      ]
    },
    {
      "heading": "4. Knowledge implementation",
      "text": [
        "An issue of developing resources is how to ensure their coverage.",
        "Our approach to this issue is to describe transformation patterns by extending those for simpler phrases.",
        "We first described following three patterns for N : C : V type phrases which we consider the simplest according to Figure 1.",
        "While the pattern (5c) is induced from example (2), the patterns (5a-b) are derived from examples (6) and (7), respectively.",
        "inspiration-acc to receive to receive an inspiration t. shigeki-sareru to inspire-pass to be inspired",
        "(7) s. hada-o shigeki-suru",
        "skin-acc to stimulate to stimulate skin t. hada-ni shigeki-o ataeru skin-dat stimulus-acc to give to give skin a stimulus Regarding the patterns in (8) as the entire set of compositional paraphrases for N : C : V type phrases, we then extended them to a bit more complex phrases as in Figure 3.",
        "For instance, 10 patterns",
        "for N1 : N2 : C : V type phrases shown in (8) have been described based on patterns in (5), mainly focusing on interactions between newly introduced N1and other constituents.",
        "np(N1,N): C : V (new) The number of transformation patterns we have so far developed is shown in Table 2.",
        "Generation functions shown in Table 3 are developed along with creating transformation patterns.",
        "Although this is the heart of the proposed model, two problems are remained: (i) the granularity of each generation function is determined according to our linguistic intuition, and (ii) they do not ensure of generating all possible phrases.",
        "Therefore, we have to establish the methodology to create this knowledge more precisely.",
        "Except wh(N), which generates interrogatives as shown in the bottom line of Table 1, the relations we have so far implemented are lexical derivations.",
        "These roughly correspond to S, V, A,andAdv in MTT.",
        "The back-end of these lexical functions is a set of dictionaries built by the following two steps: Step 1.",
        "Automatic candidate collection: Most derivatives in Japanese share the beginning of words and are characterized by the correspondences of their suffixes.",
        "For example, \"amai (be sweet)\" and \"amami (sweetness)\" has a typical suffix correspondence \"*-i:*-mi\" of adjective-noun derivation.",
        "Using this clue, candidates are collected by two methods.",
        "• From dictionary: Retrieve all word pairs from the given set of words those satisfying the following four conditions: (i) beginning with kanji character, (ii) having different POSs, (iii) sharing at least the first character and the first sound, and (iv) having a suffix pattern which corresponds to at least two pairs.",
        "• Using dictionary and corpus: Generate candidates from a set of words by applying a set of typical suffix patterns, and then check if each candidate is an actual word using corpus.",
        "This is based on (Langkilde and Knight, 1998).",
        "Step 2.",
        "Manual selection: The set of word pairs collected in the previous step includes those do not have particular semantic relationship.",
        "This step involves human to discard noises.",
        "ID POS-pair",
        "\\D\\",
        "ET",
        "\\DUC\\",
        "\\J\\",
        "(a) noun-verb",
        "3,431",
        "-",
        "3,431 2",
        "S.431",
        "(b) noun-adjective",
        "308",
        "667",
        "906",
        "475 f",
        "(c) noun-adjectival verb",
        "1,579",
        "-",
        "1,579 1,579",
        "(d) noun-adverb",
        "271",
        "-",
        "271",
        "271",
        "(e) verb-adjective",
        "252",
        "-",
        "252",
        "192 f",
        "(f) verb-adjectival verb",
        "74",
        "-",
        "74",
        "68 f",
        "(g) verb-adverb",
        "74",
        "-",
        "74",
        "64 f",
        "(h) adjective-adjectival verb",
        "66",
        "95",
        "159",
        "146 f",
        "(i) adjective-adverb",
        "33",
        "-",
        "33",
        "26 f",
        "(j) adjectival verb-adverb",
        "70",
        "-",
        "70",
        "70",
        "Total",
        "6,158",
        "762",
        "6,849 6,322",
        "Target phrase",
        "# of patterns",
        "N : C :V",
        "3",
        "/Vi : 7V2 : C : V",
        "10",
        "N : C : Vi : V2",
        "10",
        "N : C : Adv : V",
        "7",
        "Adj : N : C : V",
        "4",
        "N : C : Adj",
        "3",
        "Total",
        "37",
        "Definition",
        "Syntactic category",
        "# of returned value",
        "np(N1,N2)",
        "noun phrase",
        "9",
        "vp (N)",
        "verb phrase",
        "1",
        "vp (Ni,N2)",
        "verb phrase",
        "2",
        "vp (Vi.VO",
        "verb phrase",
        "3",
        "lvc(V)",
        "light verb construction",
        "1",
        "genCase ()",
        "case marker",
        "4",
        "genVoice ()",
        "verbal suffixfor voice",
        "3",
        "genTense ()",
        "verbal suffix for tense",
        "2",
        "genAspectQ verbal suffix for aspect",
        "2",
        "Table 4 shows the size of 10 dictionaries, where each column denotes the number of word pairs retrieved from IPADIC (\\D\\), those using IPADIC, seven patterns and the same corpus as in Section 3.4 (\\C\\), their union (\\D U C\\), and those manually judged correct (\\J\\), respectively.",
        "The sets of word pairs J are used as bidirectional lexical functions, although manual screening for four dictionaries without dagger (f) are still in process."
      ]
    },
    {
      "heading": "5. Discussion",
      "text": [
        "The working hypothesis underlying our work is that phrase is the appropriate unit for computing semantic equivalence.",
        "In addition to the arguments in Section 1, the hypothesis is supported by what is done in practice.",
        "Let us see two related fields.",
        "The first is the task of word sense disambiguation (WSD).",
        "State-of-the-art WSD techniques refer to context as a clue.",
        "However, the range of context is usually not so wide: words and their POSs within small window centered the target word and content words within the same sentence of the target word.",
        "The task therefore can be viewed as determining the meaning of phrase based on its constituent words and surrounding content words.",
        "Statistical language model (SLM) is another field.",
        "SLMs usually deal with various things within word sequence (or structure) at the same time.",
        "However, relations within a phrase should be differentiated from that between phrases, because checking the former is for grammaticality, while the latter for cohesion.",
        "We think SLMs should take the phrase to determine boundaries for assessing the correctness of generated expressions more accurately.",
        "We examined how large part of manually created paraphrases could be generated in our compositional approach.",
        "First, a set of paraphrase examples were created in the following procedure:",
        "Step 1.",
        "Most frequent 400 phrases typed N1 : N2 : C : V were sampled from one year of newspaper articles (Mainichi 1991).",
        "Step 2.",
        "An annotator produced paraphrases for each phrase.",
        "We allowed to record more than one paraphrase for a given phrase and to give up producing paraphrases.",
        "As a result, we obtained 211 paraphrases for 170 input phrases.",
        "Manual classification revealed that 42% (88/211) of paraphrases could be compositionally explainable, and the (theoretical) coverage increases to 86% (182 / 211) if we have a synonym dictionary.",
        "This ratio is enough high to give these phenomena preference as the research target, although we cannot reject a possibility that data has been biased.",
        "In our system, transformation patterns and generation functions offer necessary conditions for generating syntactic variants for given input.",
        "However, we have no sufficient condition to control the application of such a knowledge.",
        "It has not been thoroughly clarified what clue can be sufficient condition to ensure semantic equivalence, even in a number of previous work.",
        "Though, at least, roles of participants in the event have to be preserved by some means, such as the way presented in (Pantel et al., 2007).",
        "Kaji et al.",
        "(2002) introduced a method of case frame alignment in paraphrase generation.",
        "In the model, arguments of main verb in the source are taken over by that of the target according to the similarities between arguments of the source and target.",
        "Fujita et al.",
        "(2005) employed a semantic representation of verb to realize the alignment of the role of participants governed by the source and target verbs.",
        "According to an empirical experiment in (Fujita et al., 2005), statistical language models do not contribute to calculating semantic equivalence, but to filtering out anomalies.",
        "We therefore plan to incorporate above alignment-based models into our system, for example, within or after the syntactic transformation step (Figure 2).",
        "The knowledge and system presented in Section 3 are quite simple.",
        "Thus the following features should be incorporated to improve the system in addition to the one described in Section 5.3.",
        "• Dependency structure: To enable flexible matching, such as Adv : N : C : V type input and transformation pattern for N : C : Adv : V type phrases.",
        "• Sophisticated SLM: The generation phase should also take the structure into account to",
        "evaluate generated expressions flexibly.",
        "• Knowledge development: Although we have not done intrinsic evaluation of knowledge, we are aware of its incompleteness.",
        "We are continuing manual screening for the dictionaries and planning to enhance the methodology of knowledge development.",
        "6Conclusion",
        "To enhance the technology for computing semantic equivalence, we have introduced the notion of phrasal thesaurus, which is a natural extension of conventional word-based thesaurus.",
        "Plausibility of taking phrase as the unit of processing has been discussed from several viewpoints.",
        "On the basis of that, we have been developing a system to dynamically generate syntactic variants in Japanese predicate phrases which utilizes three sorts of knowledge that are inspired by MTT, STAG, Fastr, and KURA.",
        "Future work includes implementing more precise features and larger resources to compute semantic equivalence.",
        "We also plan to conduct an empirical evaluation of the resources and the overall system."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work was supported in part by MEXT Grants-in-Aid for Young Scientists (B) 18700143, and for Scientific Research (A) 16200009, Japan."
      ]
    }
  ]
}
