{
  "info": {
    "authors": [
      "Noah A. Smith",
      "Mark Johnson"
    ],
    "book": "Computational Linguistics",
    "id": "acl-J07-4003",
    "title": "Weighted and Probabilistic Context-Free Grammars Are Equally Expressive",
    "url": "https://aclweb.org/anthology/J07-4003",
    "year": 2007
  },
  "references": [
    "acl-J95-2002",
    "acl-J99-1004",
    "acl-P01-1042",
    "acl-P04-1069",
    "acl-P05-1044",
    "acl-P98-1035",
    "acl-P99-1069",
    "acl-P99-1070",
    "acl-W02-1002",
    "acl-W04-3201"
  ],
  "sections": [
    {
      "text": [
        "Mark Johnson**",
        "Brown University",
        "This article studies the relationship between weighted context-free grammars (WCFGs), where each production is associated with a positive real-valued weight, and probabilistic context-free grammars (PCFGs), where the weights of the productions associated with a nonterminal are constrained to sum to one.",
        "Because the class of WCFGs properly includes the PCFGs, one might expect that WCFGs can describe distributions that PCFGs cannot.",
        "However, Z. Chi (1999, Computational Linguistics, 25(1):131-160) and S. P. Abney, D. A. McAllester, and P. Pereira (1999, In Proceedings of the 37th Annual Meeting of the Association for Computational Linguistics, pages 542-549, College Park, MD) proved that every WCFG distribution is equivalent to some PCFG distribution.",
        "We extend their results to conditional distributions, and show that every WCFG conditional distribution ofparses given strings is also the conditional distribution defined by some PCFG, even when the WCFG's partition function diverges.",
        "This shows that any parsing or labeling accuracy improvement from conditional estimation of WCFGs or conditional random fields (CRFs) over joint estimation of PCFGs or hidden Markov models (HMMs) is due to the estimation procedure rather than the change in model class, because PCFGs and HMMs are exactly as expressive as WCFGs and chain-structured CRFs, respectively."
      ]
    },
    {
      "heading": "1.. Introduction",
      "text": [
        "In recent years the field of computational linguistics has turned to machine learning to aid in the development of accurate tools for language processing.",
        "A widely used example, applied to parsing and tagging tasks of various kinds, is a weighted grammar.",
        "Adding weights to a formal grammar allows disambiguation (more generally, ranking of analyses) and can lead to more efficient parsing.",
        "Machine learning comes in when we wish to choose those weights empirically.",
        "The predominant approach for many years was to select a probabilistic model – such as a hidden Markov model (HMM) or probabilistic context-free grammar (PCFG) – that defined a distribution over the structures allowed by a grammar.",
        "Given a",
        "* School of Computer Science, Carnegie Mellon University, Pittsburgh, PA 15217, USA.",
        "E-mail: nasmith@cs.cmu.edu.",
        "** Department of Cognitive and Linguistic Sciences, Brown University, Providence, RI 02912, USA.",
        "E-mail: MarkJohnson@brown.edu.",
        "Submission received: 30 November 2005; revised submission received: 11 January 2007; accepted for publication: 30 March 2007.",
        "treebank, maximum likelihood estimation can be applied to learn the probability values in the model.",
        "More recently, new machine learning methods have been developed or extended to handle models of grammatical structure.",
        "Notably, conditional estimation (Ratnaparkhi, Roukos, and Ward 1994; Johnson et al.",
        "1999; Lafferty, McCallum, and Pereira 2001), maximum margin estimation (Taskar et al.",
        "2004), and unsupervised contrastive estimation (Smith and Eisner 2005) have been applied to structured models.",
        "Weighted grammars learned in this way differ in two important ways from traditional, generative models.",
        "First, the weights can be any positive value; they need not sum to one.",
        "Second, features can \"overlap,\" and it can be difficult to design a generative model that uses such features.",
        "The benefits of new features and discriminative training methods are widely documented and recognized.",
        "This article focuses specifically on the first of these differences.",
        "It compares the expressive power of weighted context-free grammars (WCFGs), where each rule is associated with a positive weight, to that of the corresponding PCFGs, that is, with the same rules but where the weights of the rules expanding a nonterminal must sum to one.",
        "One might expect that because normalization removes one or more degrees of freedom, unnormalized models should be more expressive than normalized, probabilistic models.",
        "Perhaps counterintuitively, previous work has shown that the classes of probability distributions defined by WCFGs and PCFGs are the same (Abney, McAllester, and Pereira 1999; Chi 1999).",
        "However, this result does not completely settle the question about the expressive power of WCFGs and PCFGs.",
        "As we show herein, a WCFG can define a conditional distribution from strings to trees even if it does not define a probability distribution over trees.",
        "Because these conditional distributions are what are used in classification tasks and related tasks such as parsing, we need to know the relationship between the classes of conditional distributions defined by WCFGs and PCFGs.",
        "In fact we extend the results of Chi and of Abney et al., and show that WCFGs and PCFGs both define the same class of conditional distribution.",
        "Moreover, we present an algorithm for converting an arbitrary WCFG that defines a conditional distribution over trees given strings but possibly without a finite partition function into a PCFG with the same rules as the WCFG and that defines the same conditional distribution over trees given strings.",
        "This means that maximum conditional likelihood WCFGs are non-identifiable, because there are an infinite number of rule weights all of which maximize the conditional likelihood."
      ]
    },
    {
      "heading": "2.. Weighted CFGs",
      "text": [
        "ACFG G is a tuple (N, S, X, R) where N is a finite set of nonterminal symbols, S G N is the start symbol, X is a finite set of terminal symbols (disjoint from N), and R is a set of production rules of the form X – a where X G N and a G (N U £)*.",
        "A WCFG associates a positive number called the weight with each rule in R. We denote by QX^a the weight attached to the rule X – a, and the vector of rule weights by G = {QA^a : A – a G R}.",
        "A weighted grammar is the pair Ge = (G, G).",
        "1 Assigning a weight of zero to a rule equates to excluding it from R.",
        "Unless otherwise specified, we assume a fixed underlying context-free grammar G. Let fi(G) be the set of (finite) trees that G generates.",
        "For any t g 0(G), the score se(x)of t is defined as follows:",
        "where f (X – a; t) is the number of times X – a is used in the derivation of the tree t. The partition function Z(G) is the sum of the scores of the trees in fi(G).",
        "Because we have imposed no constraints on G, the partition function need not equal one; indeed, as we show subsequently the partition function need not even exist.",
        "If Z(G) is finite then we say that the WCFG is convergent, and we can define a Gibbs probability distribution over Q(G) by dividing by Z(G):",
        "A probabilistic CFG, or PCFG, is a WCFG in which the sum of the weights of the rules expanding each nonterminal is one:",
        "It is easy to show that if Ge is a PCFG then Z(G) < 1.",
        "A tight PCFG is a PCFG Gefor which Z(G) = 1.",
        "Necessary conditions and sufficient conditions for a PCFG to be tight are given in several places, including Booth and Thompson (1973) and Wetherell (1980).",
        "We now describe the results of Chi (1999) and Abney, McAllester, and Pereira (1999).",
        "Let G = {Ge} denote the set of the WCFGs based on the CFG G (i.e., the WCFGs in G all have the same underlying grammar G but differ in their rule weight vectors G).",
        "Let GZ<oo be the subset of G for which the partition function Z(G) is finite, and let GZ=oc = G\\ GZ<oo be the subset of G with an infinite partition function.",
        "Further let GPCFGdenote the set of PCFGs based on G. In general, Gpcfg is a proper subset of GZ<o ,that is, every PCFG is also a WCFG, but because there are weight vectors G that don't obey Equation 2, not all WCFGs are PCFGs.",
        "However, this does not mean that WCFGs are more expressive than PCFGs.",
        "As noted above, the WCFGs GZ<oc, define Gibbs distributions.",
        "Again, for a fixed G,let PZ<o be the probability distributions over the trees Q(G) defined by the WCFGs GZ<oc, and let PPCFG be the probability distributions defined by the PCFGs GPCFG.",
        "Chi (Proposition 4) and Abney, McAllester, and Pereira (Lemma 5) showed that PZ<o = PPCFG, namely, that every WCFG probability distribution is in fact generated by some PCFG.",
        "There is no \"Vz=o\" because there is no finite normalizing term Z(G) for such WCFGs.",
        "Chi (1999) describes an algorithm for converting a WCFG to an equivalent PCFG.",
        "Let Ge be a WCFG in Gz«x>.If X G N is a nonterminal, let QX(G) be the set of trees rooted in X that can be built using G. Then define:",
        "For simplicity, let Zt(G) = 1 for all t G S. Chi demonstrated that Ge G GZ<oc implies that ZX (G)isfinite forall X G N U S. For every rule X – a in R define:",
        "where a( is the ith element of a and \\a\\ is the length of a. Chi proved that Ge> is a PCFG and that Pe/ (t) = se(t)/Z(G) for all trees t g 0(G).",
        "Chi did not describe how to compute the nonterminal-specific partition functions ZX(G).",
        "The ZX(G) are related by equations of the form which constitute a set of nonlinear polynomial equations in ZX(G).",
        "Although a numerical solver might be employed to find the ZX(G), we have found that in practice iterative propagation of weights following the method described by Stolcke (1995, Section 4.7.1) converges quickly when Z(G)isfinite."
      ]
    },
    {
      "heading": "3.. Classifiers and Conditional Distributions",
      "text": [
        "A common application of weighted grammars is parsing.",
        "One way to select a parse tree for a sentence x is to choose the maximum weighted parse that is consistent with the observation x:",
        "where y(T) is the yield of t. Other decision criteria exist, including minimum-loss decoding and re-ranked n-best decoding.",
        "All of these classifiers use some kind of dynamic programming algorithm to optimize over trees, and they also exploit the conditional distribution of trees given sentence observations.",
        "A WCFG defines such a conditional distribution as follows:",
        "where Zx(G) is the sum of scores for all parses of x.",
        "Note that Equation (4) will be ill-defined when Zx(G) diverges.",
        "Because Zx(G) is constant for a given x, solving Equation (3) is equivalent to choosing t to maximize Pe (t | x).",
        "We turn now to classes of these conditional distribution families.",
        "Let CZ<00 (CPCFG) be the class of conditional distribution families that can be expressed by grammars in Gz«x> (GPCFG, respectively).",
        "It should be clear that, because Vz«00 = PPCFG, Cz«00 = CPCFGsince a conditional family is derived by normalizing a joint distribution by its marginals.",
        "We now define another subset of G.Let GZn<00 contain every WCFG Ge = (G, G) such that, for all n > 0, (Note that, to be fully rigorous, we should quantify n in GZn<0, writing \"GynZn(e)«x>.\"",
        "We use the abbreviated form to keep the notation crisp.)",
        "For any Ge £ GZn<0,italso follows that, for any x £ L(G), Zx(G) < oo; the converse holds as well.",
        "It follows that any WCFG in GZn«00 can be used to construct a conditional distribution of trees given the sentence, for any sentence x £ L(G).",
        "To do so, we only need to normalize se (t)by Zx(G) (Equation (4)).",
        "Let GZn=00 contain the WCFGs where some Zn(G) diverge; this is a subset of GZ=0.",
        "To see that GZ=0 n GZn<00 = 0, consider Example 1.",
        "Example 1",
        "This grammar produces binary structures over strings in a+.",
        "Every such tree receives score 1.",
        "Because there are infinitely many trees, Z(G) diverges.",
        "But for any fixed string an, the number of parse trees is finite.",
        "This grammar defines a uniform conditional distribution over all binary trees, given the string.",
        "For a grammar Ge to be in Gzn<0, it is sufficient that, for every nonterminal X £ N, the sum of scores of all cyclic derivations X =>+ X be finite.",
        "Conservatively, this can be forced by eliminating epsilon rules and unary rules or cycles altogether, or by requiring the sum of cyclic derivations for every nonterminal X to sum to strictly less than one.",
        "Example 2 gives a grammar in GZn=0 with a unary cyclic derivation that does not \"dampen.\"",
        "Example 2",
        "For any given an, there are infinitely many equally weighted parse trees, so even the set of trees for an cannot be normalized into a distribution (Zn(G) = oo).",
        "Generally speaking, if there exists a string x £ L(G) such that the set of trees that derive x is not 2 Here, full rigor would require quantification of n, writing \"G^nzn(e)=0.\"",
        "finite (i.e., there is no finite bound on the number of derivations for strings in L(G); the grammar in Example 2 is a simple example), then Gzn<oo and Gz<oo are separable.",
        "For a given CFG G, a conditional distribution over trees given strings is a function X* – (0(G) – [0,1]).",
        "Our notation for the set of conditional distributions that can be expressed by Gzn<oo is CZn<o.",
        "Note that there is no \"CZn=OQ\" because an infinite Zn(G) implies an infinite Z(x) for some sentence x and therefore an ill-formed conditional family.",
        "Indeed, it is difficult to imagine a scenario in computational linguistics in which non-dampening cyclic derivations (WCFGs in GZn=oc) are desirable, because no linguistic explanations depend crucially on arbitrary lengthening of cyclic derivations.",
        "We now state our main theorem.",
        "Theorem 1",
        "For a given CFG G, Czn<o = Cz<o.",
        "Proof",
        "Suppose we are given weights G for G such that Ge € GZn<o0.",
        "We will show that the sequence Z1(G),Z2(G),... is bounded by an exponential function of n, then describe a transformation on G resulting in a new grammar Ge> that is in Gz<oo and defines the same family of conditional distributions (i.e., Vt € 0(G),Vx € L(G), Pe (t | x) = Pe' (t I x)).",
        "First we prove that for all n > 1 there exists some c such that Zn (G) < cn .Given Ge, we construct Ge in CNF that preserves the total score for any x € L(G).",
        "The existence of Ge was demonstrated by Goodman (1998, Section 2.6), who gives an algorithm for constructing the value-preserving weighted grammar Ge from Ge.",
        "Note that G = (N, S, X, R), containing possibly more nonterminals and rules than G. The set of (finite) trees 0 (G) is different from 0(G); the new trees must be binary and may include new nonterminals.",
        "Next, collapse the nonterminals in N into one nonterminal, S. The resulting grammar is Ge = (({S}, S, X, R), G).",
        "R contains the rule S – SS and rules of the form S – a for a € X.",
        "The weights of these rules are",
        "The grammar Ge will allow every tree allowed by Ge (modulo labels on nonterminal nodes, which are now all S).",
        "It may allow some additional trees.",
        "The score of a tree under Ge will be at least as great as the sum of scores of all structurally equivalent trees under Ge, because p and u are defined to be large enough to absorb all such scores.",
        "It follows that, for all x € L(G):",
        "3 We are grateful to an anonymous reviewer for pointing this out, and an even stronger point: for a given G, G and Gzn<o have a nonempty set-difference if and only if G has infinite ambiguity (some x € L(G) has infinitely many parse trees).",
        "Summing over all trees of any given yield length n, we have",
        "G generates all possible binary trees (with internal nodes undifferentiated) over a given sentence x in L(G).",
        "Every tree generated by G with yield length n will have the same score: pn-1un, because every binary tree with n terminals has exactly n – 1 nonterminals.",
        "Each tree corresponds to a way of bracketing n items, so the total number of parse trees generated by G for a string of length n is the number of different ways of bracketing a sequence of n items.",
        "The total number of unlabeled binary bracketings of an n-length sequence is the nth Catalan number Cn (Graham, Knuth, and Patashnik 1994), which in turn is bounded above by 4n (Vardi 1991).",
        "The total number of strings of length n is | X| n. Therefore",
        "We now transform the original weights G as follows.",
        "For every rule (X – a) € R, where f(a) is the number of X symbols appearing in a.",
        "This transformation results in every n-length sentence having its score divided by (8| X| pu)n. The relative scores of trees with the same yield are unaffected, because they are all scaled equally.",
        "Therefore Ge' defines the same conditional distribution over trees given sentences as Ge, which implies that Ge and Ge' have the same highest scoring parses.",
        "Note that any sufficiently large value could stand in for 8| X| pu to both (a) preserve the conditional distribution and (b) force Zn(G) to converge.",
        "We have not found the minimum such value, but 8|X| pu is sufficiently large.",
        "The sequence of Zn(G) now converges:",
        "Given a CFG G, Czn<o = Cpcfg.",
        "By Theorem 1, CZn<oc = Cz<oo.",
        "We know that Pz<o = PPCFG, from which it follows that CZ<OQ = CPCFG.",
        "Hence CZn<o = CPCFG.",
        "To convert a WCFG in CZn<o into a PCFG, first apply the transformation in the proof of Theorem 1 to get a convergent WCFG, then apply Chi's method (our Section 2.1).",
        "■ Figure 1",
        "A graphical depiction of the primary result of this article.",
        "Given a fixed set of productions, G is the set of WCFGs with exactly those productions (i.e., they vary only in the production weights), Gz<o is the subset of G that defines (joint) probability distributions over trees (i.e., that have a finite partition function Z)and Pz<o is the set of probability distributions defined by grammars in Gz<o. Chi (1999) and Abney, McAllester, and Pereira (1999) proved that Pz<o is the same as PPCFG, the set of probability distributions defined by the PCFG GPCFG with the same productions as G. Thus even though the set of WCFGs properly includes the set of PCFGs, WCFGs define exactly the same probability distributions over trees as PCFGs.",
        "This article extends these results to conditional distributions over trees conditioned on their strings.",
        "Even though the set GZn<OG of WCFGs that define conditional distributions may be larger than Gz<oand properly includes GPCFG, the set of conditional distributions CZn<OQ defined by GZn<O is equal to the set of conditional distributions CPCFG defined by PCFGs.",
        "Our proof is constructive: we give an algorithm which takes as input a WCFG G € GZn<O and returns a PCFG which defines the same conditional distribution over trees given strings as G."
      ]
    },
    {
      "heading": "4.. HMMs and Related Models",
      "text": [
        "Hidden Markov models (HMMs) are a special case of PCFGs.",
        "The structures they produce are labeled sequences, which are equivalent to right-branching trees.",
        "We can write an HMM as a PCFG with restricted types of rules.",
        "We will refer to the unweighted, finite-state grammars that HMMs stochasticize as \"right-linear grammars.\"",
        "Rather than using the production rule notation of PCFGs, we will use more traditional HMM notation and refer to states (interchangeable with nonterminals) and paths (interchangeable with parse trees).",
        "In the rest of the article we distinguish between HMMs, which are probabilistic finite-state automata locally normalized just like a PCFG, and chain-structured Markov random fields (MRFs; Section 4.1), in which moves or transitions are associated with positive weights and which are globally normalized like a WCFG.",
        "We also distinguish two different types of dependency structures in these automata.",
        "Abusing the standard terminology somewhat, in a Mealy automaton arcs are labeled with output or terminal symbols, whereas in a Moore automaton the states emit terminal symbols.",
        "4 We admit that these names are somewhat misleading, because as we will show, chain-structured MRFs also have the Markov property and define the same joint and conditional distributions as HMMs.",
        "5 In formal language theory both Mealy and Moore machines are finite-state transducers (Mealy 1955; Moore 1956); we ignore the input symbols here.",
        "A Mealy HMM defines a probability distribution over pairs (x, n), where x is a length-n sequence (x\\,x2,xn)e Sn and tt = (n0,n\\,n2,nn)e Nn+1 is a state (or nonterminal) path.",
        "The distribution is given by n0 is assumed, for simplicity, to be constant and known; we also assume that every state transition emits a symbol (no e arcs), an assumption made in typical tagging and chunking applications of HMMs.",
        "We can convert a Mealy HMM to a PCFG by including, for every tuple (x, n, (x e S and n, $ e N) such that p(x, n | ^) > 0, the rule n – x ^, with the same probability as the corresponding HMM transition.",
        "For every n such that p(STOP I n), we include the rule n – e, with probability p(STOP | n).",
        "A Moore HMM factors the distribution p(x, n | ^)into p(x | n) • p(n | ^).",
        "A Moore HMM can be converted to a PCFG by adding a new nonterminal n for every state n and including the rules – n (with probability p(n | ^)) and n – x n (with probability p(x | n)).",
        "Stop probabilities are added as in the Mealy case.",
        "For a fixed number of states, Moore HMMs are less probabilistically expressive than Mealy HMMs, though we can convert between the two with a change in the number of states.",
        "We consider Mealy HMMs primarily from here on.",
        "If we wish to define the distribution over paths given words, we conditionalize",
        "This is how scores are assigned when selecting the best path given a sequence.",
        "For a grammar G that is right-linear, we can therefore talk about the set of HMM (right-linear) grammars GHMM, the set of probability distributions PHMM defined by those grammars, and CHMM, the set of conditional distributions over state paths (trees) that they define.",
        "When the probabilities in Mealy HMMs are replaced by arbitrary positive weights, the production rules can be seen as features in a Gibbs distribution.",
        "The resulting model is a type of MRF with a chain structure; these have recently become popular in natural language processing (Lafferty, McCallum, and Pereira 2001).",
        "Lafferty et al.",
        "'s formulation defined a conditional distribution over paths given sequences by normalizing for each sequence x:",
        "Qni_i'Xi'Tx)j",
        "6 Of course, the right-linear grammar is a CFG, so we could also use the notation GPCFG, PPCFG,and CPCFG.",
        "Using a single normalizing term Z(G), we can also define a joint distribution over states and paths:",
        "Let G = {Ge} denote the set of weighted grammars based on the unweighted right-linear grammar G. We call these weighted grammars \"Mealy MRFs.\"",
        "As in the WCFG case, we can add the constraint Zn(Q) < oo (for all n), giving the class Gzn«x>.",
        "Recall that, in the WCFG case, the move from G to GZn«oc, had to do with cyclic derivations.",
        "The analogous move in the right-linear grammar case involves e emissions (production rules of the form X – Y).",
        "If, as in typical applications of finite-state models to natural language processing, there are no rules of the form X – Y, then GZn«o is empty and GZn«o = G. Our formulae, in fact, assume that there are no e emissions.",
        "Because Mealy MRFs are a special case of WCFGs, Theorem 1 applies to them.",
        "This means that any random field using Mealy HMM features (Mealy MRF) such that Vn, Zn(Q) < oo can be transformed into a Mealy HMM that defines the same conditional distribution of tags given words.",
        "Corollary 2",
        "For a given right-linear grammar G, Chmm = Cz«oo = Czn«o.",
        "Lafferty, McCallum, and Pereira's conditional random fields are typically trained to optimize a different objective function than HMMs (conditional likelihood and joint likelihood, respectively).",
        "Our result shows that optimizing either objective on the set of Mealy HMMs as opposed to Mealy MRFs will achieve the same result, modulo imperfections in the numerical search for parameter values.",
        "While HMMs and chain MRFs represent the same set of conditional distributions, we can show that the maximum-entropy Markov models (MEMMs) of McCallum, Freitag, and Pereira (2000) represent a strictly smaller class of distributions.",
        "An MEMM is a similar model with a different event structure.",
        "It deines the distribution over paths given words as:",
        "Unlike an HMM, the MEMM does not define a distribution over output sequences x.",
        "The name \"maximum entropy Markov model\" comes from the fact that the conditional",
        "7 What if we allow additional features?",
        "It can be shown that, as long as the vocabulary £ is finite and known, we can convert any such MRF with potential functions on state transitions and emissions into an HMM functioning equivalently as a classifier.",
        "If £ is not fully known, then we cannot sum over all emissions from each state, and we cannot use Chi's method (Section 2.1) to convert to a PCFG (HMM).",
        "distributions n, x) typically have a log-linear form, rather than a multinomial form, and are trained to maximize entropy.",
        "For every MEMM, there is a Mealy MRF that represents the same conditional distribution over paths given symbols.",
        "By definition, the features of the MRF include triples x,, n).",
        "Assign to the weight Qn./Xj/nk the value PMEMM(ni | n^, xj).",
        "Assign to O^stop the value 1.",
        "In computing PCMRF(n I x) (Equation (15)), the normalizing term for each x will be equal to 1.",
        "■",
        "MEMMs, like HMMs, are deined by locally normalized conditional multinomial distributions.",
        "This has computational advantages (no potentially ininite Z(Q) terms to compute).",
        "However, the set of conditional distributions of labels given terminals that can be expressed by MEMMs is strictly smaller than those expressible by HMMs (and by extension, Mealy MRFs).",
        "Theorem 2",
        "For a given right-linear grammar G, CMEMM C CHMM.",
        "Proof",
        "We give an example of a Mealy HMM whose conditional distribution over paths (trees) given sentences cannot be represented by an MEMM.",
        "We thank Michael Collins for pointing out to us the existence of examples like this one.",
        "Define a Mealy HMM with three states named 0,1, and 2, over an alphabet {a,b,c},asfollows.State Oisthe start state.",
        "Example 3",
        "This implies that",
        "But it is impossible for p(1 | 0, a) = p(2 | 0, a) = 1.",
        "This holds regardless of the form of the distribution n,x) (e.g., multinomial or log-linear).",
        "Because P(0,1,1 | a,b) = P(0,2,2 | a,c) cannot be met by any MEMM, there are distributions in the family allowed by HMMs that cannot be expressed as MEMMs, and the latter are less expressive.",
        "■",
        "It is important to note that this result applies to Mealy HMMs; our result compares models with the same dependencies among random variables.",
        "If the HMM's distribution p(x;, 7t, | ni_1) is factored into p(x, | n) • p(7t, | ni_1) (i.e., it is a Moore HMM), then there may exist an MEMM with the same number of states that can represent some distributions that the Moore HMM cannot.",
        "One can also imagine MEMMs in which | n,_1, x,,...) is conditioned on more surrounding context (xi_1 or xi+1, or the entire sequence x, for example).",
        "Conditioning on more context can be done by increasing the order of the Markov model – all of our models so far have been first-order, with a memory of only the previous state.",
        "Our result can be extended to include higher-order MEMMs.",
        "Suppose we allow the MEMM to \"look ahead\" n words, factoring its distribution into p(n, | x,, xi+1, Corollary 3",
        "A first-order Mealy HMM can represent some classifiers that no MEMM with finite lookahead can represent.",
        "Consider again Example 3.",
        "Note that, for all m > 1, it sets",
        "Suppose we wish to capture this in an MEMM with n symbols of look-ahead.",
        "Letting m = n + 1,",
        "8 The HMM shown in Example 3 can be factored into a Moore HMM without any change to the distribution.",
        "MEMM to \"look back\" and condition on earlier symbols (or states), it cannot represent the distribution in Example 3.",
        "■",
        "Generally speaking, this limitation of MEMMs has nothing to do with the estimation procedure (we have committed to no estimation procedure in particular) but rather with the conditional structure of the model.",
        "That some model structures work better than others at real NLP tasks was discussed by Johnson (2001) and Klein and Manning (2002).",
        "Our result – that the class of distributions allowed by MEMMs is a strict subset of those allowed by Mealy HMMs – makes this unsurprising."
      ]
    },
    {
      "heading": "5.. Practical Implications",
      "text": [
        "Our result is that weighted generalizations of classical probabilistic grammars (PCFGs and HMMs) are no more powerful than the probabilistic models.",
        "This means that, insofar as log-linear models for NLP tasks like tagging and parsing are more successful than their probabilistic cousins, it is due to either (a) additional features added to the model, (b) improved estimation procedures (e.g., maximum conditional likelihood estimation or contrastive estimation), or both.",
        "(Note that the choice of estimation procedure (b) is in principle orthogonal to the choice of model, and conditional estimation should not be conflated with log-linear modeling.)",
        "For a given estimation criterion, weighted CFGs, and Mealy MRFs, in particular, cannot be expected to behave any differently than PCFGs and HMMs, respectively, unless they are augmented with more features."
      ]
    },
    {
      "heading": "6.. Related Work",
      "text": [
        "Abney, McAllester, and Pereira (1999) addressed the relationship between PCFGs and probabilistic models based on push-down automaton operations (e.g., the structured language model of Chelba and Jelinek, 1998).",
        "They proved that, although the conversion may not be simple (indeed, a blow-up in the automaton's size may be incurred), given G, PPCFG and the set of distributions expressible by shift-reduce probabilistic push-down automata are weakly equivalent.",
        "Importantly, the standard conversion of a CFG into a shift-reduce PDA, when applied in the stochastic case, does not always preserve the probability distribution over trees.",
        "Our Theorem 2 bears a resemblance to that result.",
        "Further work on the relationship between weighted CFGs and weighted PDAs is described in Nederhof and Satta (2004).",
        "MacKay (1996) proved that linear Boltzmann chains (a class of weighted models that is essentially the same as Moore MRFs) express the same set of distributions as Moore HMMs, under the condition that the Boltzmann chain has a single specific end state.",
        "MacKay avoided the divergence problem by defining the Boltzmann chain always to condition on the length of the sequence; he tacitly requires all of his models to be in Gzn«x>.",
        "We have suggested a more applicable notion of model equivalence (equivalence of the conditional distribution) and our Theorem 1 generalizes to context-free models."
      ]
    },
    {
      "heading": "7.. Conclusion",
      "text": [
        "We have shown that weighted CFGs that define finite scores for all sentences in their languages have no greater expressivity than PCFGs, when used to define distributions over trees given sentences.",
        "This implies that the standard Mealy MRF formalism is no more powerful than Mealy HMMs, for instance.",
        "We have also related \"maximum entropy Markov models\" to Mealy Markov random fields, showing that the former is a strictly less expressive weighted formalism."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This work was supported by a Fannie and John Hertz Foundation fellowship to N. Smith at Johns Hopkins University.",
        "The views expressed are not necessarily endorsed by the sponsors.",
        "We are grateful to three anonymous reviewers for feedback that improved the article, to Michael Collins for encouraging exploration of this matter and helpful comments on a draft, and to Jason Eisner and Dan Klein for insightful conversations.",
        "Any errors are the sole responsibility of the authors."
      ]
    }
  ]
}
