{
  "info": {
    "authors": [
      "Yuk Wah Wong",
      "Raymond J. Mooney"
    ],
    "book": "Human Language Technologies 2007: the Conference of the North American Chapter of the Association for Computational Linguistics; Proceedings of the Main Conference",
    "id": "acl-N07-1022",
    "title": "Generation by Inverting a Semantic Parser that Uses Statistical Machine Translation",
    "url": "https://aclweb.org/anthology/N07-1022",
    "year": 2007
  },
  "references": [
    "acl-C88-2128",
    "acl-C92-2117",
    "acl-E06-1040",
    "acl-J03-1002",
    "acl-J85-4002",
    "acl-J93-1008",
    "acl-J93-2003",
    "acl-N03-1010",
    "acl-N03-1017",
    "acl-N06-1056",
    "acl-P02-1040",
    "acl-P03-1021",
    "acl-P05-1033",
    "acl-P95-1034",
    "acl-P96-1027",
    "acl-T75-1004",
    "acl-W00-1401",
    "acl-W05-1510",
    "acl-W06-3114"
  ],
  "sections": [
    {
      "text": [
        "Generation by Inverting a Semantic Parser That Uses Statistical Machine Translation",
        "Yuk Wah Wong and Raymond J. Mooney",
        "This paper explores the use of statistical machine translation (SMT) methods for tactical natural language generation.",
        "We present results on using phrase-based SMT for learning to map meaning representations to natural language.",
        "Improved results are obtained by inverting a semantic parser that uses SMT methods to map sentences into meaning representations.",
        "Finally, we show that hybridizing these two approaches results in still more accurate generation systems.",
        "Automatic and human evaluation of generated sentences are presented across two domains and four languages."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "This paper explores the use of statistical machine translation (SMT) methods in natural language generation (NLG), specifically the task of mapping statements in a formal meaning representation language (MRL) into a natural language (NL), i.e. tactical generation.",
        "Given a corpus of NL sentences each paired with a formal meaning representation (MR), it is easy to use SMT to construct a tactical generator, i.e. a statistical model that translates MRL to NL.",
        "However, there has been little, if any, research on exploiting recent SMT methods for NLG.",
        "In this paper we present results on using a recent phrase-based SMT system, Pharaoh (Koehn et al., 2003), for NLG.",
        "Although moderately effective, the inability of PHARAOH to exploit the formal structure and grammar of the MRL limits its accuracy.",
        "Unlike natural languages, MRLs typically have a simple, formal syntax to support effective automated processing and inference.",
        "This MRL structure can also be used to improve language generation.",
        "Tactical generation can also be seen as the inverse of semantic parsing, the task of mapping NL sentences to MRs.",
        "In this paper, we show how to \"invert\" a recent SMT-based semantic parser, Wasp (Wong and Mooney, 2006), in order to produce a more effective generation system.",
        "WASP exploits the formal syntax of the MRL by learning a translator (based on a statistical synchronous context-free grammar) that maps an NL sentence to a linearized parse-tree of its MR rather than to a flat MR string.",
        "In addition to exploiting the formal MRL grammar, our approach also allows the same learned grammar to be used for both parsing and generation, an elegant property that has been widely advocated (Kay, 1975; Jacobs, 1985; Shieber, 1988).",
        "We present experimental results in two domains previously used to test WASP's semantic parsing ability: mapping NL queries to a formal database query language, and mapping NL soccer coaching instructions to a formal robot command language.",
        "WASP-1is shown to produce a more accurate NL generator than Pharaoh.",
        "We also show how the idea of generating from linearized parse-trees rather than flat MRs, used effectively in WASP-1, can also be exploited in Pharaoh.",
        "A version of Pharaoh that exploits this approach is experimentally shown to produce more accurate generators that are more competitive with WASP-1 's.",
        "Finally, we also show how If our player 4 has the ball, then our player 6 should stay in the left side ofour half.",
        "(a) CLang",
        "answer(state(traversal(riverid('ohio'))))",
        "What states does the Ohio run through?",
        "(b) Geoquery",
        "aspects of Pharaoh's phrase-based model can be used to improve Wasp-1, resulting in a hybrid system whose overall performance is the best."
      ]
    },
    {
      "heading": "2. MRLs and Test Domains",
      "text": [
        "In this work, we consider input MRs with a hierarchical structure similar to Moore (2002).",
        "The only restriction on the MRL is that it be defined by an available unambiguous context-free grammar (CFG), which is true for almost all computer languages.",
        "We also assume that the order in which MR predicates appear is relevant, i.e. the order can affect the meaning of the MR.",
        "Note that the order in which predicates appear need not be the same as the word order of the target NL, and therefore, the content planner need not know about the target NL grammar (Shieber, 1993).",
        "To ground our discussion, we consider two application domains which were originally used to demonstrate semantic parsing.",
        "The first domain is RoboCup.",
        "In the RoboCup Coach Competition (www.robocup.org), teams of agents compete in a simulated soccer game and receive coach advice written in a formal language called CLang (Chen et al., 2003).",
        "The task is to build a system that translates this formal advice into English.",
        "Figure 1(a) shows a piece of sample advice.",
        "The second domain is Geoquery, where a functional, variable-free query language is used for querying a small database on U.S. geography (Kate et al., 2005).",
        "The task is to translate formal queries into NL.",
        "Figure 1(b) shows a sample query."
      ]
    },
    {
      "heading": "3. Generation using SMT Methods",
      "text": [
        "In this section, we show how SMT methods can be used to construct a tactical generator.",
        "This is in contrast to existing work that focuses on the use of NLG in interlingual MT (Whitelock, 1992), in which the roles of NLG and MT are switched.",
        "We first consider using a phrase-based SMT system, Pharaoh, for NLG.",
        "Then we show how to invert an SMT-based semantic parser, Wasp, to produce a more effective generation system.",
        "Pharaoh (Koehn et al., 2003) is an SMT system that uses phrases as basic translation units.",
        "During decoding, the source sentence is segmented into a sequence of phrases.",
        "These phrases are then reordered and translated into phrases in the target language, which are joined together to form the output sentence.",
        "Compared to earlier word-based methods such as IBM Models (Brown et al., 1993), phrase-based methods such as Pharaoh are much more effective in producing idiomatic translations, and are currently the best performing methods in SMT (Koehn and Monz, 2006).",
        "To use Pharaoh for NLG, we simply treat the source MRL as an NL, so that phrases in the MRL are sequences of MR tokens.",
        "Note that the grammaticality of MRs is not an issue here, as they are given as input.",
        "Before showing how generation can be performed by inverting a semantic parser, we present a brief overview of Wasp (Wong and Mooney, 2006), the SMT-based semantic parser on which this work is based.",
        "To describe Wasp, it is best to start with an example.",
        "Consider the task of translating the English sentence in Figure 1(a) into CLang.",
        "To do this, we may first generate a parse tree of the input sentence.",
        "The meaning of the sentence is then obtained by combining the meanings of the phrases.",
        "This process can be formalized using a synchronous context-free grammar (SCFG), originally developed as a grammar formalism that combines syntax analysis and code generation in compilers (Aho and Ull-man, 1972).",
        "It has been used in syntax-based SMT to model the translation of one NL to another (Chiang, 2005).",
        "A derivation for a SCFG gives rise to multiple isomorphic parse trees.",
        "Figure 2 shows a partial parse of the sample sentence and its corre-",
        "Rule Rule",
        "Team player Unum has the ball (bowner Team { Unum }) (a) English (b) CLang",
        "sponding CLANG parse from which an MR is constructed.",
        "Note that the two parse trees are isomorphic (ignoring terminals).",
        "Each SCFG rule consists of a non-terminal, X, on the left-hand side (LHS), and a pair of strings, (a,f3), on the right-hand side (RHS).",
        "The nonterminals in (3 are a permutation of the non-terminals in a (indices are used to show their correspondence).",
        "In Wasp, a denotes an NL phrase, and X – (3 is a production of the MRL grammar.",
        "Below are the sCFG rules that generate the parses in Figure 2:",
        "Rule – (if Conditioni , Directive^ .",
        ", (Conditioni Directive^ )) Condition – (Team^ player Unum^ has the ball , (bowner TEAM[jj {UNUM^}) )",
        "All derivations start with a pair of co-indexed start symbols of the MRL grammar, (Sjjj, SJjj), and each step involves the rewriting of a pair of co-indexed non-terminals (by a and (3, respectively).",
        "Given an input sentence, e, the task of semantic parsing is to find a derivation that yields (e, f), so that f is an MR translation of e.",
        "Parsing with WASP requires a set of SCFG rules.",
        "These rules are learned using a word alignment model, which finds an optimal mapping from words to MR predicates given a set of training sentences and their correct MRs. Word alignment models have been widely used for lexical acquisition in SMT (Brown et al., 1993; Koehn et al., 2003).",
        "To use a word alignment model in the semantic parsing scenario, we can treat the MRL simply as an NL, and MR tokens as words, but this often leads to poor results.",
        "First, not all MR tokens carry specific meanings.",
        "For example, in CLANG, parentheses and braces are delimiters that are semantically vacuous.",
        "Such tokens can easily confuse the word alignment model.",
        "Second, MR tokens may exhibit polysemy.",
        "For example, the CLang predicate pt has three meanings based on the types of arguments it is given (Chen et al., 2003).",
        "Judging from the pt token alone, the word alignment model would not be able to identify its exact meaning.",
        "A simple, principled way to avoid these difficulties is to represent an MR using a list of productions used to generate it.",
        "This list is used in lieu of the MR in a word alignment.",
        "Figure 3 shows an example.",
        "Here the list of productions corresponds to the top-down, leftmost derivation of an MR. For each MR there is a unique linearized parse-tree, since the MRL grammar is unambiguous.",
        "Note that the structure of the parse tree is preserved through linearization.",
        "This allows us to extract SCFG rules in a bottom-up manner, assuming the alignment is n-to-1 (each word is linked to at most one production).",
        "Extraction starts with productions whose RHS is all terminals, followed by those with non-terminals.",
        "(Details can be found in Wong and Mooney (2006).)",
        "The rules extracted from Figure 3 would be almost the same as those used in Figure 2, except the one for",
        "bowner: Condition – (Team[jj player Unum^ has (1) ball, (bowner Team[jj {Unum^})).",
        "The token (1) denotes a word gap of size 1, due to the unaligned word the that comes between has and ball.",
        "it can be seen as a non-terminal that expands to at most one word, allowing for some flexibility in pattern matching.",
        "In Wasp, Giza++ (Och and Ney, 2003) is used to obtain the best alignments from the training examples.",
        "Then SCFG rules are extracted from these alignments.",
        "The resulting SCFG, however, can be",
        "player 4 has the ball",
        "Rule – (Condition Directive) Condition – (bowner team {Unum}) team – our ambiguous.",
        "Therefore, a maximum-entropy model that defines the conditional probability of derivations (d) given an input sentence (e) is used for disambiguation:",
        "The feature functions, /j, are the number of times each rule is used in a derivation.",
        "Z\\(e) is the normalizing factor.",
        "The model parameters, Aj, are trained using L-BFGS (Nocedal, 1980) to maximize the conditional log-likelihood of the training examples (with a Gaussian prior).",
        "The decoding task is thus to find a derivation d* that maximizes PrA(d*|e), and the output MR translation, f*, is the yield of d*.",
        "This can be done in cubic time with respect to the length of e using an Earley chart parser.",
        "Now we show how to invert Wasp to produce Wasp-1, and use it for NLG.",
        "We can use the same grammar for both parsing and generation, a particularly appealing aspect of using Wasp.",
        "Since an sCFG is fully symmetric with respect to both generated strings, the same chart used for parsing can be easily adapted for efficient generation (Shieber, 1988; Kay, 1996).",
        "Given an input MR, f, Wasp-1 finds a sentence e that maximizes Pr(e|f).",
        "It is difficult to directly model Pr(e|f), however, because it has to assign low probabilities to output sentences that are not grammatical.",
        "There is no such requirement for parsing, because the use of the MRL grammar ensures the grammaticality of all output MRs. For generation, we need an NL grammar to ensure grammaticality, but this is not available a priori.",
        "This motivates the noisy-channel model for Wasp-1, where Pr(e|f) is divided into two smaller components:",
        "Pr(e) is the language model, and Pr(f|e) is the parsing model.",
        "The generation task is to find a sentence e such that (1) e is a good sentence a priori, and (2) its meaning is the same as the input MR. For the language model, we use an n-gram model, which is remarkably useful in ranking candidate generated sentences (Knight and Hatzivassiloglou, 1995; Bangalore et al., 2000; Langkilde-Geary, 2002).",
        "For the parsing model, we reuse the one from Wasp (Equation 1).",
        "Hence computing (2) means maximizing the following:",
        "where D(f) is the set of derivations that are consistent with f, and e(d) is the output sentence that a derivation d yields.",
        "Compared to most existing work on generation, Wasp-1 has the following characteristics:",
        "1.",
        "It does not require any lexical information in the input MR, so lexical selection is an integral part of the decoding algorithm.",
        "2.",
        "Each predicate is translated to a phrase.",
        "Moreover, it need not be a contiguous phrase (consider the SCFG rule for bowner in Section 3.2).",
        "For decoding, we use an Earley chart generator that scans the input MR from left to right.",
        "This implies that each chart item covers a certain substring of the input MR, not a subsequence in general.",
        "It requires the order in which MR predicates appear to be fixed, i.e. the order determines the meaning of the MR.",
        "Since the order need not be identical to the word order of the target NL, there is no need for the content planner to know the target NL grammar, which is learned from the training data.",
        "Overall, the noisy-channel model is a weighted SCFG, obtained by intersecting the NL side of the Wasp SCFG with the n-gram language model.",
        "The chart generator is very similar to the chart parser, except for the following:",
        "1.",
        "To facilitate the calculation of Pr(e(d)), chart items now include a list of (n – 1)-grams that encode the context in which output NL phrases appear.",
        "The size of the list is 2N + 2, where N is the number of non-terminals to be rewritten in the dotted rule.",
        "2.",
        "Words are generated from word gaps through special rules (g) – (a, 0), where the word gap, (g), is treated as a non-terminal, and a is the NL string that fills the gap (|a| < g).",
        "The empty set symbol indicates that the NL string does not carry any meaning.",
        "There are similar constructs in Carroll et al.",
        "(1999) that generate function words.",
        "Furthermore, to improve efficiency, our generator only considers gap fillers that have been observed during training.",
        "3.",
        "The normalizing factor in (3), ZA(e(d)), is not a constant and varies across the output string, e(d).",
        "(Note that Z\\(e) is fixed for parsing.)",
        "This is unfortunate because the calculation of ZA(e(d)) is expensive, and it is not easy to incorporate it into the chart generation algorithm.",
        "Normalization is done as follows.",
        "First, compute the k-best candidate output strings based on the unnormalized version of(3), Pr(e(d)) • exp ^i Aj/j(d).",
        "Then re-rank the list by normalizing the scores using ZA(e(d)), which is obtained by running the inside-outside algorithm on each output string.",
        "This results in a decoding algorithm that is approximate – the best output string might not be in the k-best list – and takes cubic time with respect to the length of each of the k candidate output strings (k = 100 in our experiments).",
        "Learning in Wasp-1 involves two steps.",
        "First, a back-off n-gram language model with Good-Turing discounting and no lexical classes is built from all training sentences using the Srilm Toolkit (Stolcke, 2002).",
        "We use n = 2 since higher values seemed to cause overfitting in our domains.",
        "Next, the parsing model is trained as described in Section 3.2."
      ]
    },
    {
      "heading": "4. Improving the SMT-based Generators",
      "text": [
        "The SMT-based generation algorithms, Pharaoh and Wasp-1, while reasonably effective, can be substantially improved by borrowing ideas from each other.",
        "A major weakness of Pharaoh as an NLG system is its inability to exploit the formal structure of the MRL.",
        "Like Wasp-1 , the phrase extraction algorithm of Pharaoh is based on the output of a word alignment model such as Giza++ (Koehn et al., 2003), which performs poorly when applied directly to MRLs (Section 3.2).",
        "We can improve the Pharaoh-based generator by supplying linearized parse-trees as input rather than flat MRs. As a result, the basic translation units are sequences of MRL productions, rather than sequences of MR tokens.",
        "This way Pharaoh can exploit the formal grammar of the MRL to produce high-quality phrase pairs.",
        "The same idea is used in Wasp-1 to produce high-quality SCFG rules.",
        "We call the resulting hybrid NLG system Pharaoh++.",
        "There are several aspects of Pharaoh that can be used to improve Wasp-1.",
        "First, the probabilistic model of Wasp-1 is less than ideal as it requires an extra re-ranking step for normalization, which is expensive and prone to over-pruning.",
        "To remedy this situation, we can borrow the probabilistic model of Pharaoh, and define the parsing model as:",
        "which is the product of the weights of the rules used in a derivation d. The rule weight, w(X – (a, //)), is in turn defined as:",
        "where P(//|a) and P(a|//) are the relative frequencies of // and a, and Pw(//|a) and Pw(a|//) are the lexical weights (Koehn et al., 2003).",
        "The word penalty, exp( – |a|), allows some control over the output sentence length.",
        "Together with the language model, the new formulation of Pr(e| f) is a loglinear model with Ai as parameters.",
        "The advantage of this model is that maximization requires no normalization and can be done exactly and efficiently.",
        "The model parameters are trained using minimum error-rate training (Och, 2003).",
        "Following the phrase extraction phase in Pharaoh, we eliminate word gaps by incorporating unaligned words as part of the extracted NL phrases (Koehn et al., 2003).",
        "The reason is that while word gaps are useful in dealing with unknown phrases during semantic parsing, for generation, using known phrases generally leads to better fluency.",
        "For the same reason, we also allow the extraction of longer phrases that correspond to multiple predicates (but no more than 5).",
        "We call the resulting hybrid system Wasp-1++.",
        "It is similar to the syntax-based SMT system of Chiang (2005), which uses both SCFG and Pharaoh's probabilistic model.",
        "The main difference is that we use the MRL grammar to constrain rule extraction, so that significantly fewer rules are extracted, making it possible to do exact inference."
      ]
    },
    {
      "heading": "5. Experiments",
      "text": [
        "We evaluated all four SMT-based NLG systems introduced in this paper: Pharaoh, Wasp-1, and the hybrid systems, Pharaoh++ and Wasp-1 ++.",
        "We used the RoboCup and Geoquery corpora in our experiments.",
        "The RoboCup corpus consists of 300 pieces of coach advice taken from the log files of the 2003 RoboCup Coach Competition.",
        "The advice was written in CLang and manually translated to English (Kuhlmann et al., 2004).",
        "The average MR length is 29.47 tokens, or 12.82 nodes for linearized parse-trees.",
        "The average sentence length is 22.52.",
        "The Geoquery corpus consists of 880 English questions gathered from various sources.",
        "The questions were manually translated to the functional Geoquery language (Kate et al., 2005).",
        "The average MR length is 17.55 tokens, or 5.55 nodes for linearized parse-trees.",
        "The average sentence length is 7.57.",
        "Reference: If our player 2, 3, 7 or 5 has the ball and the ball is close to our goal line ... Pharaoh++: If player 3 has the ball is in 2 5 the ball is in the area near our goal line ... Wasp-1++: If players 2, 3, 7 and 5 has the ball and the ball is near our goal line ...",
        "Table 1: Results of automatic evaluation; bold type indicates the best performing system (or systems) for a given domain-metric pair (p < 0.05)",
        "We performed 4 runs of 10-fold cross validation, and measured the performance of the learned generators using the Bleu score (Papineni et al., 2002) and the Nist score (Doddington, 2002).",
        "Both MT metrics measure the precision of a translation in terms of the proportion of n-grams that it shares with the reference translations, with the Nist score focusing more on n-grams that are less frequent and more informative.",
        "Both metrics have recently been used to evaluate generators (Langkilde-Geary, 2002; Nakanishi et al., 2005; Belz and Reiter, 2006).",
        "All systems were able to generate sentences for more than 97% of the input.",
        "Figure 4 shows some sample output of the systems.",
        "Table 1 shows the automatic evaluation results.",
        "Paired t-tests were used to measure statistical significance.",
        "A few observations can be made.",
        "First, Wasp-1 produced a more accurate generator than Pharaoh.",
        "Second, Pharaoh++ significantly outperformed Pharaoh, showing the importance of exploiting the formal structure of the MRL.",
        "Third, Wasp-1++ significantly outperformed Wasp-1.",
        "Most of the gain came from Pharaoh's probabilistic model.",
        "Decoding was also 4-11 times faster, despite exact inference and a larger grammar due to extraction of longer phrases.",
        "Lastly, Wasp-1++ significantly outperformed Pharaoh++ in the RoboCup domain.",
        "This is because Wasp-1++ allows discontiguous NL phrases and Pharaoh++ does not.",
        "Such phrases are commonly used in RoboCup for constructions like: players 2 , 3 , 7 and 5; 26.96% of the phrases generated during testing were discontiguous.",
        "When faced with such predicates, Pharaoh++ would consistently omit some of the words: e.g. players 2 3 7 5, or not learn any phrases for those predicates at all.",
        "On the other hand, only 4.47% of the phrases generated during testing for Geoquery were discontiguous, so the advantage of Wasp-1++ over Pharaoh++ was not as obvious.",
        "RoboCup",
        "Geoquery",
        "Bleu",
        "Nist",
        "Bleu",
        "Nist",
        "Pharaoh",
        "0.3247",
        "5.0263",
        "0.2070",
        "3.1478",
        "Wasp-1",
        "0.4357",
        "5.4486",
        "0.4582",
        "5.9900",
        "Pharaoh++",
        "0.4336",
        "5.9185",
        "0.5354",
        "6.3637",
        "Wasp-1++",
        "0.6022",
        "6.8976",
        "0.5370",
        "6.4808",
        "Our Bleu scores are not as high as those reported in Langkilde-Geary (2002) and Nakanishi et al.",
        "(2005), which are around 0.7-0.9.",
        "However, their work involves the regeneration of automatically parsed text, and the MRs that they use, which are essentially dependency parses, contain extensive lexical information of the target NL.",
        "Automatic evaluation is only an imperfect substitute for human assessment.",
        "While it is found that Bleu and Nist correlate quite well with human judgments in evaluating NLG systems (Belz and Reiter, 2006), it is best to support these figures with human evaluation, which we did on a small scale.",
        "We recruited 4 native speakers of English with no previous experience with the RoboCup and Geoquery domains.",
        "Each subject was given the same 20 sentences for each domain, randomly chosen from the test sets.",
        "For each sentence, the subjects were asked to judge the output of Pharaoh++ and Wasp-1++ in terms of fluency and adequacy.",
        "They were presented with the following definition, adapted from Koehn and Score Fluency Adequacy"
      ]
    },
    {
      "heading": "5. Flawless English All meaning",
      "text": []
    },
    {
      "heading": "4. Good English Most meaning",
      "text": []
    },
    {
      "heading": "3. Non-native English Some meaning",
      "text": [
        "For each generated sentence, we computed the average of the 4 human judges' scores.",
        "No score normalization was performed.",
        "Then we compared the two systems using a paired t-test.",
        "Table 2 shows that Wasp-1++ produced better generators than Pharaoh++ in the RoboCup domain, consistent with the results of automatic evaluation.",
        "Lastly, we describe our experiments on the multilingual Geoquery data set.",
        "The 250-example data set is a subset of the larger Geoquery corpus.",
        "All English questions in this data set were manually translated into Spanish, Japanese and Turkish, while the corresponding MRs remain unchanged.",
        "Table 3 shows the results, which are similar to previous results on the larger Geoquery corpus.",
        "Wasp-1++ outperformed Pharaoh++ for some language-metric pairs, but otherwise performed comparably."
      ]
    },
    {
      "heading": "6. Related Work",
      "text": [
        "Numerous efforts have been made to unify the tasks of semantic parsing and tactical generation.",
        "One of the earliest espousals of the notion of grammar re-versability can be found in Kay (1975).",
        "shieber (1988) further noted that not only a single grammar can be used for parsing and generation, but the same language-processing architecture can be used for both tasks.",
        "Kay (1996) identified parsing charts as such an architecture, which led to the development of various chart generation algorithms: Carroll et al.",
        "(1999) for HPsG, Bangalore et al.",
        "(2000) for LTAG, Moore (2002) for unification grammars,",
        "RoboCup",
        "Geoquery",
        "Flu.",
        "Ade.",
        "Flu.",
        "Ade.",
        "pharaoh++",
        "2.5",
        "2.9",
        "4.3",
        "4.7",
        "Wasp_1++",
        "3.6",
        "4.0",
        "4.1",
        "4.7",
        "Pharaoh++",
        "Wasp-1++",
        "Bleu Nist",
        "Bleu",
        "Nist",
        "English",
        "0.5344 5.3289",
        "0.6035",
        "5.7133",
        "Spanish",
        "0.6042 5.6321",
        "0.6175",
        "5.7293",
        "Japanese",
        "0.6171 4.5357",
        "0.6585",
        "4.6648",
        "Turkish",
        "0.4562 4.2220",
        "0.4824",
        "4.3283",
        "Score",
        "Fluency",
        "Adequacy",
        "2",
        "Disfluent English",
        "Little meaning",
        "1",
        "Incomprehensible",
        "No meaning",
        "White and Baldridge (2003) for CCG.",
        "More recently, statistical chart generators have emerged, including White (2004) for CCG, Carroll and Oepen (2005) and Nakanishi et al.",
        "(2005) for HPSG.",
        "Many of these systems, however, focus on the task of surface realization – inflecting and ordering words – which ignores the problem of lexical selection.",
        "In contrast, our sMT-based methods integrate lexical selection and realization in an elegant framework and automatically learn all of their linguistic knowledge from an annotated corpus."
      ]
    },
    {
      "heading": "7. Conclusion",
      "text": [
        "We have presented four tactical generation systems based on various sMT-based methods.",
        "In particular, the hybrid system produced by inverting the Wasp semantic parser shows the best overall results across different application domains."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "We would like to thank Kevin Knight, Jason Baldridge, Razvan Bunescu, and the anonymous reviewers for their valuable comments.",
        "We also sincerely thank the four annotators who helped us evaluate the sMT-based generators.",
        "This research was supported by DARPA under grant HR0011-04-1-0007 and a gift from Google Inc."
      ]
    }
  ]
}
