{
  "info": {
    "authors": [
      "Jesús Giménez",
      "Lluís Màrquez"
    ],
    "book": "Workshop on Statistical Machine Translation",
    "id": "acl-W07-0738",
    "title": "Linguistic Features for Automatic Evaluation of Heterogenous MT Systems",
    "url": "https://aclweb.org/anthology/W07-0738",
    "year": 2007
  },
  "references": [
    "acl-C04-1072",
    "acl-E06-1032",
    "acl-H05-1081",
    "acl-J93-2004",
    "acl-N03-2021",
    "acl-P04-1077",
    "acl-P05-1022",
    "acl-P06-2003",
    "acl-W05-0904",
    "acl-W05-0909",
    "acl-W06-3114"
  ],
  "sections": [
    {
      "text": [
        "Jesus Gimenez and Lluis Märquez",
        "Evaluation results recently reported by Callison-Burch et al.",
        "(2006) and Koehn and Monz (2006), revealed that, in certain cases, the bleu metric may not be a reliable MT quality indicator.",
        "This happens, for instance, when the systems under evaluation are based on different paradigms, and therefore, do not share the same lexicon.",
        "The reason is that, while MT quality aspects are diverse, bleu limits its scope to the lexical dimension.",
        "In this work, we suggest using metrics which take into account linguistic features at more abstract levels.",
        "We provide experimental results showing that metrics based on deeper linguistic information (syntactic/shallow-semantic) are able to produce more reliable system rankings than metrics based on lexical matching alone, specially when the systems under evaluation are of a different nature."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Most metrics used in the context of Automatic Machine Translation (MT) Evaluation are based on the assumption that 'acceptable' translations tend to share the lexicon (i.e., word forms) in a predefined set of manual reference translations.",
        "This assumption works well in many cases.",
        "However, several results in recent MT evaluation campaigns have cast some doubts on its general validity.",
        "For instance, Callison-Burch et al.",
        "(2006) and Koehn and Monz (2006) reported and analyzed several cases ofstrong disagreement between system rankings provided by human assessors and those produced by the bleu metric (Papineni et al., 2001).",
        "In particular, they noted that when the systems under evaluation are of a different nature (e.g., rule-based vs. statistical, human-aided vs. fully automatical, etc.)",
        "bleu may not be a reliable MT quality indicator.",
        "The reason is that bleu favours MT systems which share the expected reference lexicon (e.g., statistical systems), and penalizes those which use a different one.",
        "Indeed, the underlying cause is much simpler.",
        "In general, lexical similarity is nor a sufficient neither a necessary condition so that two sentences convey the same meaning.",
        "On the contrary, natural languages are expressive and ambiguous at different levels.",
        "Consequently, the similarity between two sentences may involve different dimensions.",
        "In this work, we hypothesize that, in order to 'fairly' evaluate MT systems based on different paradigms, similarities at more abstract linguistic levels must be analyzed.",
        "For that purpose, we have compiled a rich set of metrics operating at the lexical, syntactic and shallow-semantic levels (see Section 2).",
        "We present a comparative study on the behavior of several metric representatives from each linguistic level in the context of some of the cases reported by Koehn and",
        "Section 3).",
        "We show that metrics based on deeper linguistic information (syntactic/shallow-semantic) are able to produce more reliable system rankings than those produced by metrics which limit their scope to the lexical dimension, specially when the systems under evaluation are of a different nature."
      ]
    },
    {
      "heading": "2. A Heterogeneous Metric Set",
      "text": [
        "For our experiments, we have compiled a representative set of metrics at different linguistic levels.",
        "We have resorted to several existing metrics, and we have also developed new ones.",
        "Below, we group them according to the level at which they operate.",
        "Most of the current metrics operate at the lexical level.",
        "We have selected 7 representatives from different families which have been shown to obtain high levels of correlation with human assessments:",
        "BLEU We use the default accumulated score up to the level of 4-grams (Papineni et al., 2001).",
        "NIST We use the default accumulated score up to the level of 5-grams (Doddington, 2002).",
        "GTM We set to 1 the value of the e parameter (Melamed et al., 2003).",
        "METEOR We run all modules: 'exact', 'porter-_stem', 'wn_stem' and 'wn_synonymy', in that order (Banerjee and Lavie, 2005).",
        "ROUGE We used the ROUGE-S* variant (skip bi-grams with no max-gap-length).",
        "Stemming is enabled (Lin and Och, 2004a).",
        "mWER We use 1 - mWER (NieBen et al., 2000).",
        "mPER We use 1 - mPER (Tillmann et al., 1997).",
        "Let us note that rouge and meteor may consider stemming (i.e., morphological variations).",
        "Additionally, METEOR may perform a lookup for synonyms in WordNet (Fellbaum, 1998).",
        "Modeling linguistic features at levels further than the lexical level requires the usage of more complex linguistic structures.",
        "We have defined what we call 'linguistic elements' (LEs).",
        "LEs are linguistic units, structures, or relationships, such that a sentence may be partially seen as a 'bag' of LEs.",
        "Possible kinds of LEs are: word forms, parts-of-speech, dependency relationships, syntactic phrases, named entities, semantic roles, etc.",
        "Each",
        "LE may consist, in its turn, of one or more LEs, which we call 'items' inside the LE.",
        "For instance, a 'phrase' LE may consist of 'phrase' items, 'part-of-speech' (PoS) items, 'word form' items, etc.",
        "Items may be also combinations of LEs.",
        "For instance, a 'phrase' LE may be seen as a sequence of 'word-form:PoS' items.",
        "We are interested in comparing linguistic structures, and linguistic units.",
        "LEs allow for comparisons at different granularity levels, and from different viewpoints.",
        "For instance, we might compare the semantic structure of two sentences (i.e., which actions, semantic arguments and adjuncts exist) or we might compare lexical units according to the semantic role they play inside the sentence.",
        "For that purpose, we use two very simple kinds of similarity measures over LEs: 'Overlapping' and 'Matching'.",
        "We provide a general definition:",
        "Overlapping between items inside LEs, according to their type.",
        "Formally:",
        "ieitemst(hyp)",
        "y countref (i,t)",
        "where t is the LE type, itemst(s) refers to the set of items occurring inside LEs of type t in sentence s, countref (i,t) denotes the number of times item i appears in the reference translation inside a LE of type t, and count'hyp(i, t) denotes the number of times i appears in the candidate translation inside a LE oftype t, limited by the number of times i appears in the reference translation inside a LE of type t. Thus, 'Overlapping' provides a rough measure of the proportion of items inside elements of a certain type which have been 'successfully' translated.",
        "We also introduce a coarser metric, 'Over-lapping(*)', which considers the uniformly averaged 'overlapping' over all types:",
        "Overlapping(*) = Overlapping (i)",
        "where T is the set of types.",
        "Matching between items inside LEs, according to their type.",
        "Its definition is analogous to the 'Overlapping' definition, but in this case the relative order of the items is important.",
        "All items inside the same element are considered as a single unit (i.e., a sequence in left-to-right order).",
        "In other words, we are computing the proportion of 'fully translated elements, according to their type.",
        "We also introduce a coarser metric, 'Matching(*)', which considers the uniformly averaged 'Matching over all types.",
        "• 'Overlapping' and 'Matching' operate on the assumption of a single reference translation.",
        "The extension to the multi-reference setting is computed by assigning the maximum value attained over all human references individually.",
        "• 'Overlapping and 'Matching are general metrics.",
        "We may apply them to specific scenarios by defining the class of linguistic elements and items to be used.",
        "Below, we instantiate these measures over several particular cases.",
        "Metrics based on shallow parsing ('SP') analyze similarities at the level of PoS-tagging, lemmati-zation, and base phrase chunking.",
        "Outputs and references are automatically annotated using state-of-the-art tools.",
        "PoS-tagging and lemmatization are provided by the svmtooI package (Gimenez and Marquez, 2004), and base phrase chunking is provided by the Phreco software (Carreras et al., 2005).",
        "Tag sets for English are derived from the Penn Treebank (Marcus et al., 1993).",
        "We instantiate 'Overlapping over parts-of-speech and chunk types.",
        "The goal is to capture the proportion of lexical items correctly translated, according to their shallow syntactic realization:",
        "SP-Op-t Lexical overlapping according to the part-of-speech't'.",
        "For instance, 'SP-Op-NN' roughly reflects the proportion of correctly translated singular nouns.",
        "We also introduce a coarser metric, 'SP-Op-*' which computes average overlapping over all parts-of-speech.",
        "SP-Oc-t Lexical overlapping according to the chunk type T. For instance, 'SP-Oc-NP'roughly reflects the successfully translated proportion of noun phrases.",
        "We also introduce a coarser metric, 'SP-Oc-*' which considers the average overlapping over all chunk types.",
        "At a more abstract level, we use the NIST metric (Doddington, 2002) to compute accumulated/individual scores over sequences of:",
        "Lemmas - SP-NIST(i)i-n Parts-of-speech - SP-NlST(i)p-n Base phrase chunks - SP-NlST(i)c-n",
        "For instance, 'SP-NlSTi-5' corresponds to the accumulated NIST score for lemma n-grams up to length 5, whereas 'SP-NISTip-5' corresponds to the individual NIST score for PoS 5-grams.",
        "We have incorporated, with minor modifications, some of the syntactic metrics described by Liu and Gildea (2005) and Amigo et al.",
        "(2006) based on dependency and constituency parsing.",
        "'DP' metrics capture similarities between dependency trees associated to automatic and reference translations.",
        "Dependency trees are provided by the MINIPAR dependency parser (Lin, 1998).",
        "Similarities are captured from different viewpoints:",
        "DP-HWC(i)-Z This metric corresponds to the HWC metric presented by Liu and Gildea (2005).",
        "All headword chains are retrieved.",
        "The fraction of matching headword chains of a given length, T, is computed.",
        "We have slightly modified this metric in order to distinguish three different variants according to the type ofitems headword chains may consist of:",
        "Lexical forms - DP-HWC(i)„-l Grammatical categories - DP-HWC(i)c-l Grammatical relationships - DP-HWC(i)r-l",
        "Average accumulated scores up to a given chain length may be used as well.",
        "For instance, 'DP-HWCiw-4' retrieves the proportion of matching length-4 word-chains, whereas 'DP-HWCw-4' retrieves average accumulated proportion of matching word-chains up to length-4.",
        "Analogously, 'DP-HWCc-4', and 'DP-HWC,-4' compute average accumulated proportion of category/relationship chains up to length-4.",
        "DP-Oj|Oc|Or These metrics correspond exactly to the LEvEL, GRAM and TREE metrics introduced by Amigo et al.",
        "(2006).",
        "DP-Oj-Z Overlapping between words hanging at level T, or deeper.",
        "DP-Oc-t Overlapping between words directly hanging from terminal nodes (i.e. grammatical categories) of type T.",
        "DP-Or-t Overlapping between words ruled by non-terminal nodes (i.e. grammatical relationships) of type T.",
        "Node types are determined by grammatical categories and relationships defined by minipar.",
        "For instance, 'DP-CV-s' reflects lexical overlapping between subtrees of type's' (subject).",
        "'DP-Oc-A' reflects lexical overlapping between terminal nodes of type 'A' (Adjective/Adverbs).",
        "'DP-O;-4' reflects lexical overlapping between nodes hanging at level 4 or deeper.",
        "Additionally, we consider three coarser metrics ('DP-oi-*', 'DP-oc-*' and 'DP-or-*') which correspond to the uniformly averaged values over all levels, categories, and relationships, respectively.",
        "'CP' metrics capture similarities between constituency parse trees associated to automatic and reference translations.",
        "Constituency trees are provided by the Charniak-Johnson's Max-Ent reranking parser (Charniak and Johnson, 2005).",
        "CP-STM(i)-Z This metric corresponds to the STM metric presented by Liu and Gildea (2005).",
        "All syntactic subpaths in the candidate and the reference trees are retrieved.",
        "The fraction of matching subpaths of a given length, T, is computed.",
        "For instance, 'CP-STMi-5 retrieves the proportion of length-5 matching subpaths.",
        "Average accumulated scores may be computed as well.",
        "For instance, 'CP-STM-9' retrieves average accumulated proportion of matching sub-paths up to length-9.",
        "We have designed two new families of metrics, 'NE' and 'SR , which are intended to capture similarities over Named Entities (NEs) and Semantic Roles (SRs), respectively.",
        "'NE' metrics analyze similarities between automatic and reference translations by comparing the NEs which occur in them.",
        "Sentences are automatically annotated using the BIOS package (Surdeanu et al., 2005).",
        "BIOS requires at the input shallow parsed text, which is obtained as described in Section 2.3.",
        "See the list of NE types in Table 1.",
        "We define two types of metrics:",
        "NE-Oe-t Lexical overlapping between NEs according to their type t. For instance, 'NE-Oe-PER' reflects lexical overlapping between NEs of type 'PER (i.e., person), which provides a rough estimate of the successfully translated proportion of person names.",
        "The 'NE-oe-*' metric considers the average lexical overlapping over all NE types.",
        "This metric includes the NE type 'O (i.e., Not-a-NE).",
        "We introduce another variant, 'NE-oe-**', which considers only actual NEs.",
        "NE-Mg-t Lexical matching between NEs according to their type t. For instance, 'NE-Me-LOC' reflects the proportion of fully translated NEs of type 'LOC' (i.e., location).",
        "The 'NE-me-*' metric considers the average lexical matching over all NE types, this time excluding type 'O .",
        "Type",
        "Description",
        "ORG",
        "Organization",
        "PER",
        "Person",
        "LOC",
        "Location",
        "MISC",
        "Miscellaneous",
        "O",
        "Not-a-NE",
        "DATE",
        "Temporal expressions",
        "NUM",
        "Numerical expressions",
        "ANGLE.QUANTITY",
        "DISTANCE_QUANTITY",
        "SIZE.QUANTITY",
        "Quantities",
        "SPEED .QUANTITY",
        "TEMPERATURE_QUANTITY",
        "WEIGHT .QUANTITY",
        "METHOD",
        "MONEY",
        "LANGUAGE",
        "Other",
        "PERCENT",
        "PROJECT",
        "SYSTEM",
        "Other authors have measured MT quality over NEs in the recent literature.",
        "In particular, the 'NE-Me-*' metric is similar to the 'NEE' metric defined by Reeder et al.",
        "(2001).",
        "'SR' metrics analyze similarities between automatic and reference translations by comparing the SRs (i.e., arguments and adjuncts) which occur in them.",
        "Sentences are automatically annotated using the SwiRL package (Marquez et al., 2005).",
        "This package requires at the input shallow parsed text enriched with NEs, which is obtained as described in Section 2.5.1.",
        "See the list of SR types in Table 2.",
        "We define three types of metrics:",
        "SR-Or-t Lexical overlapping between SRs according to their type t. For instance, 'SR-Or-A0 reflects lexical overlapping between 'A0' arguments.",
        "'SR-Or-*' considers the average lexical overlapping over all SR types.",
        "SR-Mr-t Lexical matching between SRs according to their type t. For instance, the metric 'SR-Mr-AM-MOD' reflects the proportion of fully translated modal adjuncts.",
        "The 'SR-Mr-*' metric considers the average lexical matching over all SR types.",
        "SR-Or This metric reflects 'role overlapping', i.e.. overlapping between semantic roles independently from their lexical realization.",
        "Note that in the same sentence several verbs, with their respective SRs, may co-occur.",
        "However, the metrics described above do not distinguish between SRs associated to different verbs.",
        "In order to account for such a distinction we introduce a more restrictive version of these metrics ('SR-M„,-t', 'SR-O„,-t', 'SR-M™'SR-Orvand 'SR-Orv'), which require SRs to be associated to the same verb."
      ]
    },
    {
      "heading": "3. Experimental Work",
      "text": [
        "In this section, we study the behavior of some of the metrics described in Section 2, according to the linguistic level at which they operate.",
        "We have selected a set of coarse-grained metric variants (i.e., accumulated/average scores over linguistic units and structures of different kinds) .",
        "We analyze some of the cases reported by Koehn and Monz (2006) and Callison-Burch et al.",
        "(2006).",
        "We distinguish different evaluation contexts.",
        "In Section 3.1, we study the case of a single reference translation being available.",
        "In principle, this scenario should diminish the reliability of metrics based on lexical matching alone, and favour metrics based on deeper linguistic features.",
        "In Section 3.2, we study the case of several reference translations available.",
        "This scenario should alleviate the deficiencies caused by the shallowness of metrics based on lexical matching.",
        "We also analyze separately the case of 'homogeneous' systems (i.e., all systems being of the same nature), and the case of 'heterogenous' systems (i.e., there exist systems based on different paradigms).",
        "As to the metric meta-evaluation criterion, the two most prominent criteria are: Human Acceptability Metrics are evaluated on the basis of correlation with human evaluators.",
        "Human Likeness Metrics are evaluated in terms of descriptive power, i.e., their ability to distinguish between human and automatic translations (Lin and Och, 2004b; Amigo et al., 2005).",
        "In our case, metrics are evaluated on the basis of 'Human Acceptability'.",
        "Specifically, we use Pearson correlation coefficients between metric scores and the average sum of adequacy and fluency assessments at the document level.",
        "The reason is that meta-evaluation based on 'Human Likeness' requires the availability of heterogenous test beds (i.e., representative sets of automatic outputs and human references), which, unfortunately, is not the case of all the tasks under study.",
        "First, because most translation systems are statistical.",
        "Second, because in most cases only one reference translation is available.",
        "Type",
        "Description",
        "AO",
        "Al",
        "A2",
        "arguments associated with a verb predicate,",
        "A3",
        "defined in the PropBank Frames scheme.",
        "A4",
        "A5",
        "AA",
        "Causative agent",
        "AM-ADV",
        "Adverbial (general-purpose) adjunct",
        "AM-CAU",
        "Causal adjunct",
        "AM-DIR",
        "Directional adjunct",
        "AM-DIS",
        "Discourse marker",
        "AM-EXT",
        "Extent adjunct",
        "AM-LOC",
        "Locative adjunct",
        "AM-MNR",
        "Manner adjunct",
        "AM-MOD",
        "Modal adjunct",
        "AM-NEG",
        "Negation marker",
        "AM-PNC",
        "Purpose and reason adjunct",
        "AM-PRD",
        "Predication adjunct",
        "AM-REC",
        "Reciprocal adjunct",
        "AM-TMP",
        "Temporal adjunct",
        "We use some of the test beds corresponding to the \"NAACL 2006 Workshop on Statistical Machine Translation \" (WMT2006) (Koehn and Monz, 2006).",
        "Since linguistic features described in Section 2 are so far implemented only for the case of English being the target language, among the 12 translation tasks available, we studied only the 6 tasks corresponding to the Foreign-to-English direction.",
        "A single reference translation is available.",
        "System outputs consist of 2000 and 1064 sentences for the 'indomain and 'out-of-domain test beds, respectively.",
        "In each case, human assessments on adequacy and fluency are available for a subset of systems and sentences.",
        "Table 3 shows the number of sentences assessed in each case.",
        "Each sentence was evaluated by two different human judges.",
        "System scores have been obtained by averaging over all sentence scores.",
        "show the number of sentences assessed for the 'indomain and 'out-of-domain subtasks.",
        "The 'sys column shows the number of systems counting on human assessments with respect to the total number of systems which presented to each task.",
        "Evaluation of Heterogeneous Systems",
        "In four of the six translation tasks under study, all the systems are statistical except 'Systran' , which is rule-based.",
        "This is the case of the German/French-to-English in-domain/out-of-domain tasks.",
        "Table 4 shows correlation with human assessments for some metric representatives at different linguistic levels.",
        "Table 4: WMT 2006.",
        "Evaluation of Heterogeneous Systems.",
        "French-to-English (fr2en) / German-to-English (de2en), in-domain and out-of-domain.",
        "Although the four cases are different, we have identified several regularities.",
        "For instance, bleu and, in general, all metrics based on lexical matching alone, except METEOR, obtain significantly lower levels of correlation than metrics based on deeper linguistic similarities.",
        "The problem with lexical metrics is that they are unable to capture the actual quality of the 'Systran system.",
        "Interestingly, METEOR obtains a higher correlation, which, in the case of French-to-English, rivals the top-scoring metrics based on deeper linguistic features.",
        "The reason, however, does not seem to be related to its additional linguistic operations (i.e., stemming or synonymy lookup), but rather to the METEOR matching strategy itself (unigram precision/recall).",
        "Metrics at the shallow syntactic level are in the same range of lexical metrics.",
        "At the properly syntactic level, metrics obtain in most cases high correlation coefficients.",
        "However, the 'DP-HWCw-4' metric, which, although from the viewpoint of dependency relationships, still considers only lexical matching, obtains a lower level of correlation.",
        "This reinforces the idea that metrics based on rewarding long n-grams matchings may not be a reliable quality indicator in these cases.",
        "fr2en",
        "de2en",
        "Level",
        "Metric",
        "in",
        "out",
        "in",
        "out",
        "1-PER",
        "0.73",
        "0.64",
        "0.57",
        "0.46",
        "1-WER",
        "0.73",
        "0.73",
        "0.32",
        "0.38",
        "BLEU",
        "0.71",
        "0.87",
        "0.60",
        "0.67",
        "Lexical",
        "NIST",
        "0.74",
        "0.82",
        "0.56",
        "0.63",
        "GTM",
        "0.84",
        "0.86",
        "0.12",
        "0.70",
        "METEOR",
        "0.92",
        "0.95",
        "0.76",
        "0.81",
        "ROUGE",
        "0.85",
        "0.89",
        "0.65",
        "0.79",
        "SP-Op-*",
        "0.81",
        "0.88",
        "0.64",
        "0.71",
        "SP-Oc-*",
        "0.81",
        "0.89",
        "0.65",
        "0.75",
        "Shallow",
        "SP-NIST;-5",
        "0.75",
        "0.81",
        "0.56",
        "0.64",
        "Syntactic",
        "SP-NISTp-5",
        "0.75",
        "0.91",
        "0.77",
        "0.77",
        "SP-NISTc-5",
        "0.73",
        "0.88",
        "0.71",
        "0.54",
        "DP-HWCro-4",
        "0.76",
        "0.88",
        "0.64",
        "0.74",
        "DP-HWCc-4",
        "0.93",
        "0.97",
        "0.88",
        "0.72",
        "DP-HWCr-4",
        "0.92",
        "0.96",
        "0.91",
        "0.76",
        "Syntactic",
        "DP-O;-*",
        "0.87",
        "0.94",
        "0.84",
        "0.84",
        "DP-Oc-*",
        "0.91",
        "0.95",
        "0.88",
        "0.87",
        "DP-Or-*",
        "0.87",
        "0.97",
        "0.91",
        "0.88",
        "CP-STM-9",
        "0.93",
        "0.95",
        "0.93",
        "0.87",
        "NE-Me-*",
        "0.80",
        "0.79",
        "0.93",
        "0.63",
        "NE-Oe-*",
        "0.79",
        "0.76",
        "0.91",
        "0.59",
        "NE-Oe-**",
        "0.81",
        "0.87",
        "0.63",
        "0.70",
        "SR-Mr-*",
        "0.83",
        "0.95",
        "0.92",
        "0.84",
        "Shallow",
        "SR-Or-*",
        "0.89",
        "0.95",
        "0.88",
        "0.90",
        "Semantic",
        "SR-Or",
        "0.95",
        "0.85",
        "0.80",
        "0.75",
        "SR-M™-*",
        "0.77",
        "0.92",
        "0.72",
        "0.85",
        "SR-O™-*",
        "0.81",
        "0.93",
        "0.76",
        "0.94",
        "SR-Or^",
        "0.84",
        "0.93",
        "0.81",
        "0.92",
        "in",
        "out",
        "sys",
        "French-to-English",
        "2,247",
        "1,274",
        "11/14",
        "German-to-English",
        "2,401",
        "1,535",
        "10/12",
        "Spanish-to-English",
        "1,944",
        "1,070",
        "11/15",
        "At the level of shallow semantics, while 'NE' metrics are not equally useful in all cases, 'SR' metrics prove very effective.",
        "For instance, correlation attained by 'SR-Or-*' reveals that it is important to translate lexical items according to the semantic role they play inside the sentence.",
        "Moreover, correlation attained by the 'SR-Mr-*' metric is a clear indication that in order to achieve a high quality, it is important to 'fully' translate 'whole' semantic structures (i.e., arguments/adjuncts).",
        "The existence of all the semantic structures ('SR-Or'), specially associated to the same verb ('SR-Orv'), is also important.",
        "Evaluation of Homogeneous Systems",
        "In the two remaining tasks, Spanish-to-English in-domain/out-of-domain, all the systems are statistical.",
        "Table 5 shows correlation with human assessments for some metric representatives.",
        "In this case, BLEU proves very effective, both in-domain and out-of-domain.",
        "Indeed, all metrics based on lexical matching obtain high levels of correlation with human assessments.",
        "However, still metrics based on deeper linguistic analysis attain in most cases higher correlation coefficients, although not as significantly higher as in the case of heterogeneous systems.",
        "We study the case reported by Callison-Burch et al.",
        "(2006) in the context of the Arabic-to-English exercise of the \"2005 NIST MT Evaluation Campaign \" (Le and Przybocki, 2005).",
        "In this case all systems are statistical but 'LinearB' , a human-aided MT system (Callison-Burch, 2005).",
        "Five reference translations are available.",
        "System outputs consist of 1056 sentences.",
        "We obtained permission to use 7 system outputs.",
        "For six of these systems we counted",
        "Table 5: WMT 2006.",
        "Evaluation of Homogeneous Systems.",
        "Spanish-to-English (es2en), in-domain and out-of-domain.",
        "on a subjective manual evaluation based on adequacy and fluency for a subset of 266 sentences (i.e., 1596 sentences were assessed).",
        "Each sentence was evaluated by two different human judges.",
        "System scores have been obtained by averaging over all sentence scores.",
        "Table 6 shows the level of correlation with human assessments for some metric representatives (see 'ALL' column).",
        "In this case, lexical metrics obtain extremely low levels of correlation.",
        "Again, the problem is that lexical metrics are unable to capture the actual quality of 'LinearB'.",
        "At the shallow syntactic level, only metrics which do not consider any lexical information ('SP-NISTp-5' and 'SP-NISTc-5') attain a significantly higher quality.",
        "At the properly syntactic level, all metrics attain a higher correlation.",
        "At the shallow semantic level, again, while 'NE' metrics are not specially useful, 'SR' metrics prove very effective.",
        "On the other hand, if we remove 'LinearB' (see",
        "es2en",
        "Level",
        "Metric",
        "in",
        "out",
        "1-PER",
        "0.82",
        "0.78",
        "1-WER",
        "0.88",
        "0.83",
        "BLEU",
        "0.89",
        "0.87",
        "Lexical",
        "NIST",
        "0.88",
        "0.84",
        "GTM",
        "0.86",
        "0.80",
        "METEOR",
        "0.84",
        "0.81",
        "ROUGE",
        "0.89",
        "0.83",
        "SP- Op-*",
        "0.88",
        "0.80",
        "SP-Oc-*",
        "0.89",
        "0.84",
        "Shallow",
        "SP-NIST;-5",
        "0.88",
        "0.85",
        "Syntactic",
        "SP-NISTp-5",
        "0.85",
        "0.86",
        "SP-NISTc-5",
        "0.84",
        "0.83",
        "DP-HWCro-4",
        "0.94",
        "0.83",
        "DP-HWCc-4",
        "0.91",
        "0.87",
        "DP-HWCr-4",
        "0.91",
        "0.88",
        "Syntactic",
        "DP-O;-*",
        "0.91",
        "0.84",
        "DP-Oc-*",
        "0.88",
        "0.83",
        "DP-Or-*",
        "0.88",
        "0.84",
        "CP-STM-9",
        "0.89",
        "0.86",
        "NE-Me-*",
        "0.75",
        "0.76",
        "NE-Oe-*",
        "0.71",
        "0.71",
        "NE-Oe-**",
        "0.88",
        "0.80",
        "SR-Mr-*",
        "0.86",
        "0.82",
        "Shallow",
        "SR-Or-*",
        "0.92",
        "0.92",
        "Semantic",
        "SR-Or",
        "0.91",
        "0.92",
        "SR-M™-*",
        "0.89",
        "0.88",
        "SR-OrtJ-*",
        "0.91",
        "0.92",
        "SR-Or^",
        "0.91",
        "0.91",
        "Table 6: NIST 2005.",
        "Arabic-to-English (ar2en) exercise.",
        "'ALL' refers to the evaluation ofall systems.",
        "'SMT' refers to the evaluation of statistical systems alone (i.e., removing 'LinearB').",
        "'SMT' column), lexical metrics attain a much higher correlation, in the same range of metrics based on deeper linguistic information.",
        "However, still metrics based on syntactic parsing, and semantic roles, exhibit a slightly higher quality."
      ]
    },
    {
      "heading": "4. Conclusions",
      "text": [
        "We have presented a comparative study on the behavior of a wide set of metrics for automatic MT evaluation at different linguistic levels (lexical, shallow-syntactic, syntactic, and shallow-semantic) under different scenarios.",
        "We have shown, through empirical evidence, that linguistic features at more abstract levels may provide more reliable system rankings, specially when the systems under evaluation do not share the same lexicon.",
        "We strongly believe that future MT evaluation campaigns should benefit from these results, by including metrics at different linguistic levels.",
        "For instance, the following set could be used:",
        "All these metrics are among the top-scoring in all the translation tasks studied.",
        "However, none ofthese metrics provides, in isolation, a 'global' measure of quality.",
        "Indeed, all these metrics focus on 'partial' aspects of quality.",
        "We believe that, in order to perform 'global' evaluations, different quality dimensions should be integrated into a single measure of quality.",
        "With that purpose, we are currently exploring several metric combination strategies.",
        "Preliminary results, based on the QUEEN measure inside the QARLA Framework (Amigo et al., 2005), indicate that metrics at different linguistic levels may be robustly combined.",
        "Experimental results also show that metrics requiring linguistic analysis seem very robust against parsing errors committed by automatic linguistic processors, at least at the document level.",
        "That is very interesting, taking into account that, while reference translations are supposedly well formed, that is not always the case of automatic translations.",
        "However, it remains pending to test the behaviour at the sentence level, which could be very useful for error analysis.",
        "Moreover, relying on automatic processors implies two other important limitations.",
        "First, these tools are not available for all languages.",
        "Second, usually they are too slow to allow for massive evaluations, as required, for instance, in the case of system development.",
        "In the future, we plan to incorporate more accurate, and possibly faster, linguistic processors, also for languages other than English, as they become publicly available."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "This research has been funded by the Spanish Ministry of Education and Science, projects OpenMT (TIN2006-15307-C03-02) and TRANGRAM (TIN2004-07925-C03-02).",
        "We are recognized as a Quality Research Group (2005 SGR-00130) by DURSI, the Research Department of the Catalan Government.",
        "Authors are thankful to the WMT organizers for providing such valuable test beds.",
        "Authors are also thankful to Audrey Le (from",
        "NIST), and to the 2005 NIST MT Evaluation Campaign participants who agreed to share their system outputs and human assessments for the purpose of this research.",
        "ar2en",
        "Level",
        "Metric",
        "ALL",
        "SMT",
        "1-PER",
        "-0.35",
        "0.75",
        "1-WER",
        "-0.50",
        "0.69",
        "BLEU",
        "0.06",
        "0.83",
        "Lexical",
        "NIST",
        "0.04",
        "0.81",
        "GTM",
        "0.03",
        "0.92",
        "ROUGE",
        "-0.17",
        "0.81",
        "METEOR",
        "0.05",
        "0.86",
        "SP- Op-*",
        "0.05",
        "0.84",
        "SP-Oc-*",
        "0.12",
        "0.89",
        "Shallow",
        "SP-NIST;-5",
        "0.04",
        "0.82",
        "Syntactic",
        "SP-NISTp-5",
        "0.42",
        "0.89",
        "SP-NISTc-5",
        "0.44",
        "0.68",
        "DP-HWCTO-4",
        "0.52",
        "0.86",
        "DP-HWCc-4",
        "0.80",
        "0.75",
        "DP-HWCr-4",
        "0.88",
        "0.86",
        "Syntactic",
        "DP-O;-*",
        "0.51",
        "0.94",
        "DP-Oc-*",
        "0.53",
        "0.91",
        "DP-Or-*",
        "0.72",
        "0.93",
        "CP-STM-9",
        "0.74",
        "0.95",
        "NE-Me-*",
        "0.33",
        "0.78",
        "NE-Oe-*",
        "0.24",
        "0.82",
        "NE-Oe-**",
        "0.04",
        "0.81",
        "SR-Mr-*",
        "0.72",
        "0.96",
        "Shallow",
        "SR-Or-*",
        "0.61",
        "0.87",
        "Semantic",
        "SR-Or",
        "0.66",
        "0.75",
        "SR-Mrv-*",
        "0.68",
        "0.97",
        "SR-Orv-*",
        "0.47",
        "0.84",
        "SR-Or^",
        "0.46",
        "0.81"
      ]
    }
  ]
}
