{
  "info": {
    "authors": [
      "Daniele Pighin",
      "Alessandro Moschitti",
      "Roberto Basili"
    ],
    "book": "Fourth International Workshop on Semantic Evaluations (SemEval-2007)",
    "id": "acl-W07-2062",
    "title": "RTV: Tree Kernels for Thematic Role Classification",
    "url": "https://aclweb.org/anthology/W07-2062",
    "year": 2007
  },
  "references": [
    "acl-J02-3001",
    "acl-P02-1034",
    "acl-P04-1043",
    "acl-W04-3212",
    "acl-W04-3213",
    "acl-W06-2607",
    "acl-W06-2909"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the 4th International Workshop on Semantic Evaluations (SemEval-2007), pages 288?291, Prague, June 2007. c?2007 Association for Computational Linguistics RTV: Tree Kernels for Thematic Role Classification"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "We present a simple, two-steps supervised strategy for the identification and classification of thematic roles in natural language texts.",
        "We employ no external source of information but automatic parse trees of the input sentences.",
        "We use a few attribute-value features and tree kernel functions applied to specialized structured features.",
        "The resulting system has an F1 of 75.44 on the SemEval2007 closed task on semantic role la-beling."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "In this paper we present a system for the labeling of semantic roles that produces VerbNet (Kipper et al., 2000) like annotations of free text sentences using only full syntactic parses of the input sentences.",
        "The labeling process is modeled as a cascade of two distinct classification steps: (1) boundary detection (BD), in which the word sequences that encode a thematic role for a given predicate are recognized, and (2) role classification (RC), in which the type of thematic role with respect to the predicate is assigned.",
        "After role classification, a set of simple heuristics are applied in order to ensure that only well formed annotations are output.",
        "We designed our system on a per-predicate basis, training one boundary classifier and a battery of role classifiers for each predicate word.",
        "We clustered all the senses of the same verb together and ended up with 50 distinct boundary classifiers (one for each target predicate word) and 619 role classifiers to recognize the 47 distinct role labels that appear in the training set.",
        "The remainder of this paper is structured as follows: Section 2 describes in some detail the architecture of our labeling system; Section 3 describes the features that we use to represent the classifier examples; Section 4 describes the experimental setting and reports the accuracy of the system on the SemEval2007 semantic role labeling closed task; finally, Section 5 discusses the results and presents our conclusions."
      ]
    },
    {
      "heading": "2 System Description",
      "text": [
        "Given a target predicate word in a natural language sentence, a SRL system is meant to correctly identify all the arguments of the predicate.",
        "This problem is usually divided in two sub-tasks: (a) the detection of the boundaries (i. e. the word span) of each argument and (b) the classification of the argument type, e.g. Arg0 or ArgM in PropBank or Agent and Goal in FrameNet or VerbNet.",
        "The standard approach to learn both the detection and the classification of predicate arguments is summarized by the following steps:",
        "words of one argument of p, put Fp,a in T+ (positive examples), otherwise put it in T?",
        "(negative examples).",
        "For instance, in Figure 1.a, for each combination of the predicate approve with any other tree node a",
        "that does not overlap with the predicate, a classifier example Fapprove,a is generated.",
        "If a exactly covers one of the predicate arguments (in this case: ?The charter?, ?by the EC Commission?",
        "or ?on Sept.",
        "21?)",
        "it is regarded as a positive instance, otherwise it will be a negative one, e. g. Fapprove,(NN charter).",
        "The T+ and T?",
        "sets are used to train the boundary classifier.",
        "To train the role multi-class classifier, T+ can be reorganized as positive T+argi and negative T?argi examples for each argument i.",
        "In this way, an individual ONE-vs-ALL classifier for each argument i can be trained.",
        "We adopted this solution, according to (Pradhan et al., 2005), since it is simple and effective.",
        "In the classification phase, given an unseen sentence, all its Fp,a are generated and classified by each individual role classifier.",
        "The role label associated with the maximum among the scores provided by the individual classifiers is eventually selected.",
        "To make the annotations consistent with the underlying linguistic model, we employ a few simple heuristics to resolve the overlap situations that may occur, e. g. both ?charter?",
        "and ?the charter?",
        "in Figure 1 may be assigned a role: ?",
        "if more than two nodes are involved, i. e. a node d and two or more of its descendants ni are classified as arguments, then assume that d is not an argument.",
        "This choice is justified by previous studies (Moschitti et al., 2006b) showing that the accuracy of classification is higher for lower nodes; ?",
        "if only two nodes are involved, i. e. they dominate each other, then keep the one with the highest classification score."
      ]
    },
    {
      "heading": "3 Features for Semantic Role Labeling",
      "text": [
        "We explicitly represent as attribute-value pairs the following features of each Fp,a pair:",
        "?",
        "Phrase Type, Predicate Word, Head Word, Position and Voice as defined in (Gildea and Jurasfky, 2002); ?",
        "Partial Path, No Direction Path, Head Word POS, First and Last Word/POS in Constituent and SubCategorization as proposed in (Pradhan",
        "annotations (Props); number of candidate argument nodes (T ); positive (T+) and negative (T?)",
        "boundary classifier examples.",
        "?",
        "Syntactic Frame as designed in (Xue and",
        "Palmer, 2004).",
        "We also employ structured features derived by the full parses in an attempt to capture relevant aspects that may not be emphasized by the explicit feature representation.",
        "(Moschitti et al., 2006a) and (Moschitti et al., 2006b) defined several classes of structured features that were successfully employed with tree kernels for the different stages of an SRL process.",
        "Figure 1 shows an example of the ASTm1 structures that we used for both the boundary detection and the role classification stages."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": [
        "In this section we discuss the setup and the results of the experiments carried out on the dataset of the SemEval2007 closed task on SRL.",
        "ary detection (BD) and the complete SRL task (BD+RC) using the polynomial kernel alone (poly) or combined with a tree kernel function (poly + TK)."
      ]
    },
    {
      "heading": "4.1 Setup",
      "text": [
        "The training set comprises 15,8381 training annotations organized on a per-verb basis.",
        "In order to build a development set (Dev), we sampled about one tenth, i. e. 1,606 annotations, of the original training set.",
        "For the final evaluation on the test set (Test), consisting of 3,094 annotations, we trained our classifiers on the whole training data.",
        "Statistics on the dataset composition are shown in Table 1.",
        "The evaluations were carried out with the SVM-Light-TK2 software (Moschitti, 2004) which extends the SVM-Light package (Joachims, 1999) with tree kernel functions.",
        "We used the default polynomial kernel (degree=3) for the linear features and a SubSet Tree (SST) kernel (Collins and Duffy, 2002) for the comparison of ASTm1 structured features.",
        "The kernels are normalized and summed by assigning a weight of 0.3 to the TK contribution.",
        "Training all the 50 boundary classifiers and the 619 role classifiers on the whole dataset took about 4 hours on a 64 bits machine (2.2GHz, 1GB RAM)3."
      ]
    },
    {
      "heading": "4.2 Evaluation",
      "text": [
        "All the evaluations were carried out using the CoNLL2005 evaluator tool available at http://www.lsi.upc.es/?srlconll/soft.html.",
        "Table 2 shows the aggregate results on boundary detection (BD) and the complete SRL task (BD+RC) on the development set using the polynomial kernel alone (poly) or in conjunction with the tree kernels and structured features (poly+TK).",
        "For both tasks, tree kernel functions do trigger automatic feature se",
        "say.",
        "The accuracy on this relation is still very high, as we measured an overall F1 of 87.18 on the development set and of 85.13 on the test set.",
        "the SemEval2007 - Task 17 test set using the poly + TK kernel.",
        "Column #TI reports the number of instances of each role label in the test set.",
        "Rows Ov(BD) and Ov(BD + RC) show the overall accuracy on the boundary detection and the complete SRL task, respectively.",
        "lection and improve the polynomial kernel by 2.46 and 1.39 F1 points, respectively.",
        "The SRL accuracy for each one of the 47 distinct role labels is shown in Table 3.",
        "Column 2 lists",
        "the number of instances of each role in the test set.",
        "Many roles have very few positive examples both in the training and the test sets, and therefore have little or no impact on the overall accuracy which is dominated by the few roles which are very frequent, such as Theme, Agent, Topic and ARGM-TMP which account for almost 80% of all the test roles."
      ]
    },
    {
      "heading": "5 Final Remarks",
      "text": [
        "In this paper we presented a system that employs tree kernels and a basic set of flat features for the classification of thematic roles.",
        "We adopted a very simple approach that is meant to be as general and fast as possible.",
        "The issue of generality is addressed by training the boundary and role classifiers on a per-predicate basis and by employing tree kernel and structured features in the learning algorithm.",
        "The resulting architecture can indeed be used to learn the classification of roles of non-verbal predicates as well, and the automatic feature selection triggered by the tree kernel should compensate for the lack of ad-hoc, well established explicit features for some classes of non-verbal predicates, e. g. adverbs or prepositions.",
        "Splitting the learning problem also has the clear advantage of noticeably improving the efficiency of the classifiers, thus reducing training and classification time.",
        "On the other hand, this split results in some classifiers having too few training instances and therefore being very inaccurate.",
        "This is especially true for the boundary classifiers, which conversely need to be very accurate in order to positively support the following stages of the SRL process.",
        "The solution of a monolithic boundary classifier that we previously employed (Moschitti et al., 2006b) is noticeably more accurate though much less efficient, especially for training.",
        "Indeed, after the SemEval2007 evaluation period was over, we ran another experiment using a monolithic boundary classifier.",
        "On the test set, we measured F1 values of 82.09 vs 79.40 and 77.17 vs 75.44 for the boundary detection and the complete SRL tasks, respectively.",
        "Although it was provided as part of both the training and test data, we chose not to use the verb sense information.",
        "This choice is motivated by our intention to depend on as less external resources as possible in order to be able to port our SRL system to other linguistic models and languages, for which such resources may not exist.",
        "Still, identifying the predicate sense is a key issue especially for role classification, as the argument structure of a predicate is largely determined by its sense.",
        "In the near feature we plan to use larger structured features, i. e. spanning all the potential arguments of a predicate, to improve the accuracy of our role classifiers."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "The development of the SRL system was carried out at the University of Rome Tor Vergata and financed by the EU project PrestoSpace4 (FP6-507336)."
      ]
    }
  ]
}
