{
  "info": {
    "authors": [
      "Chien-Cheng Wu",
      "Jason S. Chang"
    ],
    "book": "Human Language Technologies: the Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL-HLT)",
    "id": "acl-N07-4011",
    "title": "Learning to Find Transliteration on the Web",
    "url": "https://aclweb.org/anthology/N07-4011",
    "year": 2007
  },
  "references": [
    "acl-C02-1011",
    "acl-P03-1040",
    "acl-P97-1017",
    "acl-W01-1413"
  ],
  "sections": [
    {
      "text": [
        "Learning to find transliteration on the Web",
        "This prototype demonstrate a novel method for learning to find transliterations of proper nouns on the Web based on query expansion aimed at maximizing the probability of retrieving transliterations from existing search engines.",
        "Since the method we used involves learning the morphological relationships between names and their transliterations, we refer to this IR-based approach as morphological query expansion for machine transliteration.",
        "The morphological query expansion approach is general in scope and can be applied to translation and transliteration, but we focus on transliteration in this paper.",
        "Many texts containing proper names (e.g., \"The cities of Mesopotamia prospered under Parthian and Sassanian rule.\")",
        "are submitted to machine translation services on the Web every day, and there are also service on the Web specifically target transliteration of proper names, including CHINET (Kwok et al.",
        "2005) ad Livetrans (Lu, Chien, and Lee 2004).",
        "Machine translation systems on the Web such as Yahoo Translate (babelfish.yahoo.com) and Google Translate (translate.google.com/translate_t.g) typically use a bilingual dictionary that is either manually compiled or learned from a parallel corpus.",
        "However, such dictionaries often have insufficient coverage of proper names and technical terms, leading to poor translation due to out of vocabulary problem.",
        "The OOV problems of machine translation or cross language information retrieval can be handled more effectively by learning to find transliteration on the Web.",
        "Consider Sentence 1 containing three place names.",
        "1.",
        "The cities of Mesopotamia prospered under Parthian and Sassanian rule."
      ]
    },
    {
      "heading": "2.. Mrf j W0 l ~F parthian M/fcSS * sassanian^",
      "text": [
        "Google Translate produce Sentence 2, leaving \"Parthian\" and \"Sassanian\" not translated.",
        "A good response might be a translation like Sentence 3 where all place names have appropriate transliterations (underlined).",
        "These transliterations can be more effectively retrieved from mixed code Web pages by extend each of the place names into a query (e.g., \"Parthian NEAR E\").",
        "Intuitively by requiring one of likely prefix transliteration morphemes (e.g., \"E\" or \"ft\" for \"par-\" names), we can bias the search engine towards retrieving the correct transliterations (e.g., \"ElBSl\" and \"fti!",
        "55\") in snippets of many top-ranked documents.",
        "The method involves pairing up the prefixing morphemes between name and transliteration in a set of train data, calculating the statistical association for these pair, and selecting pairs with a high degree of statistical association.",
        "The results of this training stage are morphological relationships between prefixes and postfixes of names and transliterations.",
        "At run time, a given name is automatically extended into a query with relevant prefixing morphemes, then the query is submit to some search engine.",
        "After retrieving snippets from a search engine, the system extract transliterations from the snippets based on redundancy, proximity between name and transliteration, and cross language morphological relationships of prefix and postfix.",
        "We present a new machine transliteration system based on information retrieval and morphological query expansion.",
        "The system automatically learns to extend the proper names into a query expected to retrieve and extract transliterations of the proper names.",
        "Consider the case of transliteration of \"Parthian.\"",
        "The system looks at possible prefixes of the given name, including p-, pa-, par-, and part-, and determine determines the best n query expansions (e.g., \"Parthian E,\" \"Parthian ft \").",
        "These effective expansions automatically during training by analyzing a collection of 23,615 place names and transliterations pairs.",
        "We evaluated the prototype system using a list of 500 proper names.",
        "The results show that 60% of the time there are sufficient relevant data on the Web to carry out effective machine transliteration based on IR and morphological query expansion.",
        "Of many results returned by the system, the top 1, two and three results are 0.88, 0.93, and 0.94.",
        "By performing query expansion, the system improves the recall rate from 0.48 to 0.60.",
        "The results indicate that most names and transliteration counterparts can often be found on the Web and the proposed method are very effective in retrieving and extracting transliterations based on a statistical machine transliteration model trained on a bilingual name list.",
        "Our demonstration prototype shows alternative transliterations in use on the Web and snippets of such usage, so that the user can easily validate these transliterations.",
        "The prototype supports:",
        "• Searching and extracting transliterations of a given term",
        "• Listing alternative transliterations on the",
        "• Listing alternative transliteration in a local dictionary",
        "• Browsing of snippets containing for each alterative transliteration",
        "• Saving transliterations in a local dictionary",
        "• Selecting and saving transliteration in snippets to a local dictionary",
        "The method explored here can be extended as an alterative way to support such MT subtasks as back transliteration (Knight and Graehl 1998) and noun phrase translation (Koehn and Knight 2003).",
        "Finally, for more challenging tasks, such as handling sentences, the improvement of translation quality probably will also be achieved by combining this IR-based approach and statistical machine translation.",
        "For example, a preprocessing unit may replace the proper names in a sentence with transliterations (e.g., mixed code text such as Sentence 4) on the fly or by looking up a local dictionary before sending it off to MT for finally translation.",
        "4.",
        "The cities of §t3l?^Fil^55 prospered under R)Ec55 and MM rule.",
        "Morphological query expansion represents an innovative way to capture cross-linguistic relations in name transliteration.",
        "The method is independent of the bilingual lexicon content making it easy to adopt to other proper names such person, product, or organization names.",
        "This approach is useful in a number of machine translation subtasks, including name transliteration, back transliteration, named entity translation, and terminology translation.",
        "Ngram |Char |Map_no |Ngramno",
        "Prob",
        "alla",
        "2 11",
        "0.1818",
        "alla",
        "M",
        "9 11",
        "0.8182",
        "anti",
        "1 11",
        "0.0909",
        "anti",
        "10 11",
        "0.9091",
        "bart",
        "E",
        "11 11",
        "1.0000",
        "bata",
        "A",
        "1 11",
        "0.0909",
        "bata",
        "E",
        "10 11",
        "0.9091",
        "belo",
        "tt",
        "2 11",
        "0.1818",
        "belo",
        "M",
        "9 11",
        "0.8182",
        "beth",
        "fâ",
        "1 11",
        "0.0909",
        "beth",
        "m",
        "10 11",
        "0.9091",
        "buch",
        "E",
        "2 11 0.1818",
        "Ngram",
        "Char",
        "Map_no Ngramno",
        "Prob",
        "ague",
        "4 11",
        "0.3636",
        "ague",
        "6 11",
        "0.5455",
        "ague",
        "H",
        "1 11",
        "0.0909",
        "alen",
        "Û",
        "1 11",
        "0.0909",
        "alen",
        "ft",
        "2 11",
        "0.1818",
        "alen",
        "8 11",
        "0.7273",
        "andi",
        "1 11",
        "0.0909",
        "andi",
        "m",
        "7 11",
        "0.6364",
        "andi",
        "%",
        "2 11",
        "0.1818",
        "andi",
        "m",
        "1 11 0.0909",
        "Cluster",
        "Morpheme",
        "Phonetic symbol",
        "A",
        "A",
        "A",
        "E",
        "A",
        "?E",
        "A",
        "m",
        "A",
        "M",
        "A",
        "m",
        "a",
        "a",
        "a",
        "s",
        "a",
        "a",
        "a",
        ">a",
        "a",
        "^",
        "a",
        "a",
        "s?",
        "a",
        "m",
        "a",
        "m",
        "a",
        "a",
        "a",
        "s",
        "a",
        "f¥",
        "<7?7"
      ]
    }
  ]
}
