{
  "info": {
    "authors": [
      "Olivia Sanchez-Graillet",
      "Massimo Poesio"
    ],
    "book": "Biological, translational, and clinical language processing",
    "id": "acl-W07-1029",
    "title": "Discovering contradicting protein-protein interactions in text",
    "url": "https://aclweb.org/anthology/W07-1029",
    "year": 2007
  },
  "references": [],
  "sections": [
    {
      "heading": "1. Introduction",
      "text": [
        "In biomedical texts, contradictions about protein-protein interactions (PPIs) occur when an author reports observing a given PPI whereas another author argues that very same interaction does not take place: e.g., when author X argues that \"protein A interacts with protein B\" whereas author Y claims that \"protein A does not interact with B\".",
        "Of course, merely discovering a potential contradiction does not mean the argument is closed as other factors may have caused the proteins to behave in different ways.",
        "We present preliminary work towards the automatic detection of potential contradictions between PPIs from text and an agreement experimental evaluation of our method."
      ]
    },
    {
      "heading": "2. Method",
      "text": [
        "Our method consists of the following steps: i) extract positive and negative cases of PPIs and map them to a semantic structure; ii) compare the pairs of PPIs structures that contain similar canonical protein names iii) apply an inference method to the selected pair of PPIs.",
        "We extract positive and negative cases of PPIs by applying our system (Sanchez & Poesio, submitted).",
        "Our system considers proteins only as well as events where only one protein participates (e.g. \"PI-3Kactivity\").",
        "The system produces the semantic interpretation shown in Table 1.",
        "We manually corrected some of the information extracted in order to compare exclusively our inference method with human annotators.",
        "The decision to determine if a C-PPI holds is given by the context.",
        "This context is formed by the combination of semantic components such as PPI polarity, verb direction, and manner polarity.",
        "Cue-word Semantic Relation Polarity Direction Manner Polarity",
        "Canonical name of the first participant protein Canonical name of the second participant protein.",
        "Word (verbs or their nominalizations) expressing a PPI (e.g. interact, interaction, activate, activation, etc.).",
        "Categories in which cue-words are grouped according to their similar effect in an interaction.",
        "(See Table 2).",
        "Whether the PPI is positive or negative Direction of a relation according to the effect that a protein causes on other molecules in the interaction.",
        "Modality expressed by adverbs or adjectives (e.g. directly, weakly, strong, etc.)",
        "Polarity assigned to manner according to the influence they have on the cue-word (see Table 4) Semantic Relation Verbs/nouns examples",
        "Activate Inactivate",
        "Activat (e, ed,es,or,ion), transactivat (e,ed,es,ion) decreas (e,ed,es), down-regulat(e,ed,es,ion)",
        "Manner polarity is neutral (2) if the manner word is not included in the manner polarity table or if no manner word affects the cue-word.",
        "The method first obtains what we call \"PPI state\" of each PPI.",
        "The PPI state is obtained in two steps that follow decision tables: a) the values for",
        "Some decision tables are omitted due to space reasons.",
        "+",
        "- Neutral",
        "Activate, Attach Inactivate Substitute, React Create bond Break bond Modify, Cause Generate Release Signal, Associate",
        "Table 3.",
        "Directions of semantic relations",
        "Polarity",
        "Word",
        "(+) 1",
        "(-) o",
        "strong(ly), direct(ly), potential(y), rapid(ly) hardly, indirect(ly), negative(e,ly)",
        "the combination of the verb direction and the manner polarity (DM) of each PPI; b) then, the DM value and the polarity of the corresponding PPI are evaluated.",
        "Second, the method compares the PPI states of both PPIs as shown in Table 5.",
        "The following example illustrates our method.",
        "The table below shows two sentences taken from different documents.",
        "Document 1 Document 2",
        "Cells treated with hyperosmolar stress, UV-C, IR, or a cell-permeable form of ceramide, C2 ceramide, rapidly down-regulated PI(3)K activity to 10%-30% of the activity found in serum-stimulated control cells...",
        "And fourth, C2-ceramide did not affect the amount of PI 3-kinase activity in anti-IRS-1 precipitates.",
        "The semantic structures corresponding to these sentences are shown in the next table.",
        "The decision tables produced for this example are the following.",
        "Result values: contradiction (C), no contradiction (NC) and unsure (U).",
        "The values included in the tables are: positive=1, nega-tive=0, neutral=2, unsure=3, and negative-neutral=4.",
        "The result obtained is \"Contradiction\"."
      ]
    },
    {
      "heading": "3. Agreement experiment",
      "text": [
        "As a way of evaluation, we compared agreement between our method and human annotators by using the kappa measure (Siegel and Castellan, 1998).",
        "We elaborated a test containing only of 31 pairs of sentences (JBC articles) since this task can be tiring for human annotators.",
        "The test consisted on classifying the pairs of sentences into three categories: contradiction (C), no contradiction (NC) and unsure (U).",
        "The values of kappa obtained are presented in the following table.",
        "Biologists mainly justified their answers based on biological knowledge (e.g. methodology, organisms, etc.)",
        "while non-biologists based their answers on syntax."
      ]
    },
    {
      "heading": "4. Conclusions",
      "text": [
        "We have presented a simple method to detect potential contradictions of PPIs by using context expressed by semantics and linguistics constituents (e.g. modals, verbs, adverbs, etc).",
        "Our method showed to perform similarly to biologists and better than non-biologists.",
        "Interestingly, biologists concluded that C-PPIs are rarely found; nevertheless, the cases found may be highly significant.",
        "Continuing with our work, we will try our system in a larger set of data.",
        "PPIA state",
        "PPIB state",
        "Result",
        "-(o)",
        "NN (4)",
        "Contradiction",
        "Statel",
        "Sstate2",
        "Result",
        "Statel",
        "State2",
        "Result",
        "o",
        "o",
        "NC",
        "3",
        "3",
        "U",
        "o",
        "l",
        "C",
        "o",
        "4",
        "C",
        "o",
        "3",
        "U",
        "1",
        "4",
        "C",
        "1",
        "l",
        "NC",
        "3",
        "4",
        "C",
        "1",
        "3",
        "U",
        "Groups",
        "Kappa",
        "Biologists only",
        "o.37",
        "Biologists and our method",
        "o.37",
        "Non-biologists only",
        "o.22",
        "Non-biologists and our method",
        "o.l9",
        "DocA",
        "DocB",
        "P1",
        "C2-ceramide",
        "C2-ceramide",
        "P2",
        "PI-3K",
        "PI-3K",
        "Cue",
        "down-regulate",
        "affect",
        "Semantic relation",
        "Inactivate",
        "Cause",
        "Polarity",
        "positive",
        "negative",
        "Direction",
        "negative",
        "neutral",
        "Manner",
        "rapidly",
        "--",
        "Manner polarity",
        "positive",
        "neutral",
        "PPI",
        "Direction",
        "Manner",
        "DM",
        "A",
        "B",
        "- (o)",
        "N (2)",
        "+ (1)",
        "N (2)",
        "- (o)",
        "U (3)",
        "PPI",
        "Polarity",
        "DM",
        "State",
        "A B",
        "+ (1)",
        "- (o)",
        "- (o)",
        "U(3)",
        "- (o)",
        "NN (4)"
      ]
    }
  ]
}
