{
  "info": {
    "authors": [
      "Marc B. Vilain",
      "Jennifer Su",
      "Suzi Lubar"
    ],
    "book": "Human Language Technologies 2007: the Conference of the North American Chapter of the Association for Computational Linguistics; Companion Volume, Short Papers",
    "id": "acl-N07-2046",
    "title": "Entity Extraction is a Boring Solved Problem---Or is it?",
    "url": "https://aclweb.org/anthology/N07-2046",
    "year": 2007
  },
  "references": [
    "acl-E99-1001",
    "acl-P05-1045",
    "acl-P05-1051",
    "acl-P05-3015",
    "acl-W03-0425"
  ],
  "sections": [
    {
      "text": [
        "Entity Extraction is a Boring Solved Problem - or is it?",
        "Marc Vilain",
        "The MITRE Corporation",
        "Burlington Rd Bedford MA G173G USA",
        "mbv@mitre.org",
        "The MITRE Corporation and Cornell University Ithaca NY 14853 USA",
        "Burlington Rd",
        "Bedford MA G173G USA",
        "slubar@mitre.org",
        "This paper presents empirical results that contradict the prevailing opinion that entity extraction is a boring solved problem.",
        "In particular, we consider data sets that resemble familiar muc/ace data, and report surprisingly poor performance for both commercial and research systems.",
        "We then give an error analysis that suggests research challenges for entity extraction that are neither boring nor solved."
      ]
    },
    {
      "heading": "1. Background",
      "text": [
        "Entity extraction or named entity recognition, as it is sometimes called, is a known and familiar problem.",
        "Named entity (ne) tagging has been the subject of numerous shared-task evaluations, including the seminal muc 6, muc 7 and met evaluations, the conll shared task, the sighan bake-offs, and the ace evaluations.",
        "With this track record, and with commercial vendors now selling named-entity tagging for a fee, many naturally consider entity extraction to be an essentially solved problem.",
        "The present paper challenges this view.",
        "The main issue, as we see it, is transfer: ne taggers developed for a specific corpus tend not to perform well on other data sets.",
        "Kosseim and Poibeau (2001), for one, show that the informal language of email or speech transcriptions befuddles taggers built for journalistic text.",
        "Minkov et al. (2005) further explore the systematic differences between journalistic and informal texts, training separate taggers for each text source of interest.",
        "Because named entity taggers are so strongly based on surface features, it isn't surprising to observe poor tagger transfer across texts with significantly different styles or with unrelated content.",
        "In this paper, we report on the more surprising result that transfer issues arise even for texts with closely aligned content or closely aligned styles.",
        "In particular, we consider a range of primarily business-related texts that are, on the face of it, close in style and/or substance to the journalistic stories in existing ne data sets, muc 6 in particular.",
        "We thus would have expected these texts to support good transfer performance from taggers configured to the muc task.",
        "Instead, we found the same kinds of performance drops as Kosseim and Poibeau had noted for informal texts.",
        "Our aim here is to shed light on the how and why of this."
      ]
    },
    {
      "heading": "2. Scope of the present study",
      "text": [
        "We begin with a disclaimer.",
        "Our goal is not so much to present new technical solutions tone recognition, as to draw attention to those aspects of the problem that remain unsolved.",
        "We cover two main thrusts: (i) a black-box evaluation of several ne taggers (commercial and research systems); and (ii) an error analysis of system performance.",
        "Our evaluation data set contains three distinct sections.",
        "The largest component consists of publicly-available financial reports filed with the Securities and Exchange Commission (sec), in particular the 2003 forms 10-K filed by eight Fortune 500 companies.",
        "These corporate annual reports share the same subject matter as much business news: sales, profits, acquisitions, business strategies and the like.",
        "They take, however, a more technical slant and are rich in accounting jargon.",
        "They are also longer, ranging in our study from 22 to 54 pages.",
        "Table 1: system pseudonyms.",
        "Preliminary exploration with our own MUC 6 tagger showed these SEC filings to be particularly hard to tag.",
        "Because their sheer length and technical emphasis seemed implicated in this poor performance, we assembled a second corpus of forty Web-hosted business stories from such news providers as MS-NBC, CNN Money, and Motley Fool.",
        "These stories focus on the same eight companies as our 10-K data set, but are shorter and less technical, thus allowing us to isolate length and technicality as factors in tagging business texts.",
        "The final portion of our test set consists of ten news stories that were selected to closely match the kind of data used in past MUC evaluations.",
        "They were drawn from the New York Times (NYT) and Wall Street Journal (wsj) on-line editions, and focus on current events, thus providing one more comparable dimension of evaluation.",
        "Five systems participated in our study, representing a range of commercial tools and research prototypes.",
        "Two of these are state-of-the-art hand-built systems based on rule/pattern interpreters.",
        "Two are open-source statistical systems, one based on HMMs, and the other on CRFs; both were trained on the MUC 6 data set.",
        "The final system is our own legacy MUC-style tagger, noted as Ariel in Table 1.",
        "Except as noted below, all the systems were run out of the box, with no adaptation to the data.",
        "License and privacy concerns prevent us from identifying all the systems; instead this paper reports most results anonymously, using the names of Disney heroines as system pseudonyms.",
        "We have, however exposed the identity of our own system out of fairness, as it benefited somewhat from earlier tuning to SEC forms 10-K.",
        "We attempted to replicate the procedure used in the MUC evaluations, extending it only as required by the characteristics of the taggers.",
        "The test data were formatted as in muc 6, and where SGML markup ran afoul of system I/O characteristics, we remapped the data manually, resolving, e.g., crossing tags that may have strayed into the output.",
        "To provide scores that could be compared with the MUC evaluations, we created MUC6-compliant answer keys (Sundheim, 1995), and remapped system output to this standard.",
        "We removed system responses that were considered non-taggable in MUC (e.g., URLs) and conflated fine-grained distinctions not made in MUC (e.g., remapping country tags to location).",
        "Scores were assessed with the venerable MUC scorer, which provides partial credit for system responses that match the key in type but not extent, or vice-versa.",
        "The scorer also provides a full error analysis, separately characterizing each error in a system response."
      ]
    },
    {
      "heading": "3. Findings",
      "text": [
        "Table 2, overleaf, presents our overall findings, aggregated across the three primary entity types: person, organization, and location (the ENAMEX types in the muc standard).",
        "We generally did not measure the MUC TIMEX (dates, times) and NUMEX types (moneys, percents) because: (i) neither of the statistical systems generate them; (ii) those systems that do generate them tend to do well; (iii) they are overwhelmingly more frequent in the SEC data than in news, thus skewing results.",
        "For completeness' sake, however, Table 2 does provide all-entity news scores in parentheses for those systems that happened to generate the full set of MUC-6 entities.",
        "Turning now to actual performance measurements, Table 2 does not present an especially pretty picture.",
        "Aside from two systems' runs on the MUC-like current events, all the scores are substantially below those obtained by competitive MUC systems, which typically reached F scores in the mid-90s, with a high of F=96 at MUC-6.",
        "SEC.",
        "The worst performances were turned in for SEC filings, as shown in the first block of rows in Table 2.",
        "While precision is generally poor, recall is even worse.",
        "One reason for this is the very frequent rightwards shortenings of company names (e.g., from 3MCorporation to the Corporation), in contrast to the leftwards shortening (e.g., 3M) favored in news texts.",
        "Ariel had been tuned to tag all these cases, but the other systems only tagged a scattershot fraction.",
        "To isolate the contribution of Table 2: aggregated extraction scores, enamex only, unless parenthesized (in parens = all entities).",
        "Pocahontas",
        "Rule-based",
        "Belle",
        "Rule-based",
        "Jasmine",
        "Statistical, HMM, MUC-trained",
        "Mulan",
        "Statistical, CRF, MUC-trained",
        "Ariel",
        "Rule-based, 10-K tuning",
        "these cases to system recall error, we recalculated the scores by making the cases optional.",
        "The scorer removes missing optional responses from the recall denominator, and as expected recall improved; see the second block in Table 2.",
        "Business news.",
        "The most consistent performance across systems was achieved with business news, with scores ranging in F=69-80.",
        "This is a huge improvement over the gaping F=36-75 range we saw with sec filings (F=43-75 with optional short names).",
        "This confirms that length and financial jargon are implicated in the poor performance on forms 10-K.",
        "Nonetheless, these improved scores are still 15-20 points lower than the better muc scores.",
        "Is business language just hard to tag?",
        "MUC-like news.",
        "Our attempt to replicate the muc evaluation data yields an equivocal answer.",
        "Two systems (Pocahontas and Ariel) achieved muc6-level scores; it may not be coincidental that both are next-generation versions of systems that participated at muc.",
        "Of the other systems, muc-trained Mulan also showed substantial improvement going from business news to current events.",
        "While it is good news that three of the systems that were explicitly trained on muc (manually or statistically) did well on muc-like data, it is disquieting to see how poorly this training generalized to other news texts."
      ]
    },
    {
      "heading": "4. Factors affecting performance",
      "text": [
        "A finer analysis of our three data sets helps triangulate the factors leading to the systematic performance differences shown in Table 2.",
        "Prevalence of organizations.",
        "One factor especially stands out: as Table 3 shows, organizations are twice as prevalent in the business sources as in the muc-like data.",
        "As organization scores generally trail scores for persons and locations (Table 4), this partly explains why business texts are hard.",
        "Kinds of organizations.",
        "But that does not explain it all.",
        "The profiles in Figure 1 show that current events favor government/quasi-government names (e.g., \"Congress, \" \"Hamas\").",
        "They are less linguistically productive than the corporate and quasi-corporate names in business texts, and so are more amenable to being explicitly listed in name gazetteers.",
        "Florian et al. (2003) note the effectiveness of gazetteers for tagging the conll corpus.",
        "Editorial standards.",
        "Our business news data reflect a growing portion of Web-hosted texts that relax the journalistic editorial rules of traditional news sources such as the nyt or wsj.",
        "For instance, our data show the same frequent omission of corporate designators (e.g. \"inc. \") that Kosseim noted in informal text.",
        "Whereas news sources of record will generally mention a company's designator at least once in a story, our business data frequently fail to do so at all, thus removing a key name-tagging cue.",
        "By tracing the Ariel rule base, we found that the absence of any designator was implicated in 81% of the system's recall error for organization names.",
        "Length.",
        "Name taggers often overcome this kind of missing evidence by second-passing a text, propagating name mentions identified in the first Table 3: Relative distribution of entity types",
        "Pocahontas Belle Jasmine Mulan Ariel",
        "SEC filings",
        "R=58",
        "R=28",
        "R=5G",
        "R=5G",
        "R=71",
        "P=65",
        "P=52",
        "P=43",
        "P=56",
        "P=79",
        "F=61.1",
        "F=36.4",
        "F=42.7",
        "F=52.6",
        "F=74.5",
        "SEC filings, \"the Corp. \" optional",
        "R=71",
        "R=36",
        "R=55",
        "R=6G",
        "R=71",
        "P=65",
        "P=52",
        "P=4G",
        "P=56",
        "P=79",
        "F=68.G",
        "F=42.8",
        "F=46.2",
        "F=57.9",
        "F=74.7",
        "Business news",
        "R=8G (82)",
        "R=64 (69)",
        "R=76",
        "R=65",
        "R=71 (75)",
        "P=8G (79)",
        "P=86 (83)",
        "P=63",
        "P=74",
        "P=74 (75)",
        "F=8G.1 (81)",
        "F=73.5 (75)",
        "F=69.1",
        "F=69.2",
        "F=72.3 (75)",
        "Current",
        "events",
        "(MUC-like)",
        "R=94 (94)",
        "R=59 (63)",
        "R=79",
        "R=79",
        "R=89 (91)",
        "P=94 (93)",
        "P=82 (8G)",
        "P=7G",
        "P=92",
        "P=91 (92)",
        "F=94.3 (94)",
        "F=68.5 (71)",
        "F=74.5",
        "F=84.9",
        "F=9G.4 (92)",
        "sec",
        "Business",
        "muc",
        "Org",
        "7G%",
        "65%",
        "29%",
        "Per",
        "9%",
        "23%",
        "35%",
        "Loc",
        "21%",
        "12%",
        "36%",
        "S org opt S per S loc Borg B. per B. loc M org M per M loc",
        "Table 4: Type",
        "Jasm.",
        "Mul.",
        "Ariel",
        "pass to matching but undetected mentions (Mik-heev, 1999).",
        "This strategy runs foul, though, when the first pass produces precision errors, as these too can get propagated.",
        "Document length is implicated in this through the greater cumulative likelihood of making an error on the first pass and of finding a mention that matches the error on the second pass.",
        "Quasi-names and non-names.",
        "A final factor that especially afflicts the Forms 10-K is the similarity of names and non-names.",
        "Non-taggable product names (\"AMD Athlon \") often look like legitimate subsidiaries, while valid operating divisions (\"Health Care \") are often hard to distinguish from generic designations of market segments.",
        "5 Implications for further research.",
        "What surprised us most in conducting this study was to find so obvious a transfer gap among what appear to be very similar text sources.",
        "We were also surprised by the involvement in this of relaxed editorial standards around seeming trivia (like the keyword \"inc. \") This suggests, for one, that current techniques remain too dependent on skin-deep word co-occurrence features.",
        "It also suggests that the editorially pristine news texts used in so much NE research may be atypically easy to tag.",
        "While name-tagging programs may struggle with editorially informal texts, the absence of surFigure 1.",
        "Kinds of organization face contextual cues poses no noticeable challenge to human readers.",
        "What cues are left, and there are many, are semantic in nature: predicate-argument structure, selectional restrictions, organization of the lexicon, etc.",
        "Recent efforts to create common propositional banks and lexical ontologies may thus have much to offer.",
        "Indeed, current research in these areas is just beginning to trickle down to the name-tagging problem (Mohit & Hwa, 2005).",
        "Another key issue is ensuring tagging coherency at the whole-document level.",
        "This might help alleviate the kind of error propagation with dualpass strategies that particularly afflicts long documents.",
        "Recent applications of statistical co-reference models are beginning to show promise (Finkel et al., 2005; Ji & Grishman, 2005).",
        "Lastly, we can see this whole study as a particular challenge case for transfer learning, and indeed such work as Sutton and McCallum's (2005) has looked at the name-tagging task from a transfer learning standpoint.",
        "It may thus be that today's exciting emerging work in \"unsolved\" areas - semantics, reference, and learning - could come to play a key role in what is sometimes maligned as yesterday's boring solved problem."
      ]
    }
  ]
}
