{
  "info": {
    "authors": [
      "Nicola Ehling",
      "Richard Zens",
      "Hermann Ney"
    ],
    "book": "45th Annual Meeting of the Association for Computational Linguistics Companion Volume Proceedings of the Demo and Poster Sessions",
    "id": "acl-P07-2026",
    "title": "Minimum Bayes Risk Decoding for BLEU",
    "url": "https://aclweb.org/anthology/P07-2026",
    "year": 2007
  },
  "references": [
    "acl-J90-2002",
    "acl-N04-1022",
    "acl-P02-1038",
    "acl-P02-1040",
    "acl-P03-1021"
  ],
  "sections": [
    {
      "text": [
        "We present a Minimum Bayes Risk (MBR) decoder for statistical machine translation.",
        "The approach aims to minimize the expected loss of translation errors with regard to the BLEU score.",
        "We show that MBR decoding on N-best lists leads to an improvement of translation quality.",
        "We report the performance of the MBR decoder on four different tasks: the TC-STAR EPPS Spanish-English task 2006, the NIST Chinese-English task 2005 and the GALE Arabic-English and Chinese-English task 2006.",
        "The absolute improvement of the BLEU score is between 0.2% for the TC-STAR task and 1.1% for the GALE Chinese-English task."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In recent years, statistical machine translation (SMT) systems have achieved substantial progress regarding their perfomance in international translation tasks (TC-STAR, NIST, GALE).",
        "Statistical approaches to machine translation were proposed at the beginning of the nineties and found widespread use in the last years.",
        "The \"standard\" version of the Bayes decision rule, which aims at a minimization of the sentence error rate is used in virtually all approaches to statistical machine translation.",
        "However, most translation systems are judged by their ability to minimize the error rate on the word level or n-gram level.",
        "Common error measures are the Word Error Rate (WER) and the Position Independent Word Error Rate (PER) as well as evaluation metric on the n-gram level like the BLEU and NIST score that measure precision and fluency of a given translation hypothesis.",
        "The remaining part of this paper is structured as follows: after a short overview of related work in Sec. 2, we describe the MBR decoder in Sec. 3.",
        "We present the experimental results in Sec. 4 and conclude in Sec. 5."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "MBR decoder for automatic speech recognition (ASR) have been reported to yield improvement over the widely used maximum a-posteriori probability (MAP) decoder (Goel and Byrne, 2003; Mangu et al., 2000; Stolcke et al., 1997).",
        "For MT, MBR decoding was introduced in (Kumar and Byrne, 2004).",
        "It was shown that MBR is preferable over MAP decoding for different evaluation criteria.",
        "Here, we focus on the performance of MBR decoding for the BLEU score on various translation tasks.",
        "3 Implementation of Minimum Bayes Risk Decoding for the BLEU Score",
        "In statistical machine translation, we are given a source language sentence f J = f... fj ... fj, which is to be translated into a target language sentence e{ = e\\... e ... ej.",
        "Statistical decision theory tells us that among all possible target language sentences, we should choose the sentence which minimizes the Bayes risk:",
        "= argmin",
        "Here, L(-, denotes the loss function under consideration.",
        "In the following, we will call this decision rule the MBR rule (Kumar and Byrne, 2004).",
        "Although it is well known that this decision rule is optimal, most SMT systems do not use it.",
        "The most common approach is to use the MAP decision rule.",
        "Thus, we select the hypothesis which maximizes the posterior probability Pr(e{|/J):",
        "e1 = argmax",
        "This decision rule is equivalent to the MBR criterion under a 0-1 loss function:",
        "Hence, the MAP decision rule is optimal for the sentence or string error rate.",
        "It is not necessarily optimal for other evaluation metrics as for example the BLEU score.",
        "One reason for the popularity of the MAP decision rule might be that, compared to the MBR rule, its computation is simpler.",
        "The posterior probability Pr(ef |/J) is modeled directly using a log-linear combination of several models (Och and Ney, 2002):",
        "The BLEU score (Papineni et al., 2002) measures the agreement between a hypothesis e{ generated by the MT system and a reference translation e{.",
        "It is the geometric mean of n-gram precisions Precn(, •) in combination with a brevity penalty BP( •, •) for too short translation hypotheses.",
        "This approach is a generalization of the source-channel approach (Brown et al., 1990).",
        "It has the advantage that additional models h( ) can be easily integrated into the overall system.",
        "The denominator represents a normalization factor that depends only on the source sentence f1j.",
        "Therefore, we can omit it in case of the MAP decision rule during the search process.",
        "Note that the denominator affects the results of the MBR decision rule and, thus, cannot be omitted in that case.",
        "We use a state-of-the-art phrase-based translation system similar to (Matusov et al., 2006) including the following models: an n-gram language model, a phrase translation model and a word-based lexicon model.",
        "The latter two models are used for both directions: p(f |e) and p(e|f).",
        "Additionally, we use a word penalty, phrase penalty and a distortion penalty.",
        "The model scaling factors AM are optimized with respect to the BLEU score as described in (Och, 2003).",
        "Here, C (w^lej) denotes the number of occurrences of an n-gram w^ in a sentence e{.",
        "The denominator of the n-gram precisions evaluate to the number of n-grams in the hypothesis, i.e. / – n + 1.",
        "As loss function for the MBR decoder, we use:",
        "L[e{,e{ ] = 1 – BLEU(e{,e{ ).",
        "While the original BLEU score was intended to be used only for aggregate counts over a whole test set, we use the BLEU score at the sentence-level during the selection of the MBR hypotheses.",
        "Note that we will use this sentence-level BLEU score only during decoding.",
        "The translation results that we will report later are computed using the standard BLEU score.",
        "We select the MBR hypothesis among the N best translation candidates of the MAP system.",
        "For each entry, we have to compute its expected BLEU score, i.e. the weighted sum over all entries in the N-best list.",
        "Therefore, finding the MBR hypothesis has a quadratic complexity in the size of the N-best list.",
        "To reduce this large work load, we stop the summation over the translation candidates as soon as the risk of the regarded hypothesis exceeds the current minimum risk, i.e. the risk of the current best hypothesis.",
        "Additionally, the hypotheses are processed according to the posterior probabilities.",
        "Thus, we can hope to find a good candidate soon.",
        "This allows for an early stopping of the computation for each of the remaining candidates.",
        "During the translation process, the different submodels ) get different weights Am.",
        "These scaling factors are optimized with regard to a specific evaluation criteria, here: BLEU.",
        "This optimization describes the relation between the different models but does not define the absolute values for the scaling factors.",
        "Because search is performed using the maximum approximation, these absolute values are not needed during the translation process.",
        "In contrast to this, using the MBR decision rule, we perform a summation over all sentence probabilities contained in the N-best list.",
        "Therefore, we use a global scaling factor Ao > 0 to modify the individual scaling factors Am:",
        "A'm = Ao • Am ,m = 1, ...,M.",
        "For the MBR decision rule the modified scaling factors Am are used instead of the original model scaling factors Am to compute the sentence probabilities as in Eq.",
        "1.",
        "The global scaling factor Ao is tuned on the development set.",
        "Note that under the MAP decision rule any global scaling factor Ao > 0 yields the same result.",
        "Similar tests were reported by (Mangu et al., 2000; Goel and Byrne, 2003) for ASR."
      ]
    },
    {
      "heading": "4. Experimental Results 4.1 Corpus Statistics",
      "text": [
        "We tested the MBR decoder on four translation tasks: the TC-STAR EPPS Spanish-English task of 2006, the NIST Chinese-English evaluation test set of 2005 and the GALE Arabic-English and Chinese-",
        "English evaluation test set of 2006.",
        "The TC-STAR",
        "EPPS corpus is a spoken language translation corpus containing the verbatim transcriptions of speeches of the European Parliament.",
        "The NIST Chinese-English test sets consists of news stories.",
        "The GALE project text track consists of two parts: newswire (\"news\") and newsgroups (\"ng\").",
        "The newswire part is similar to the NIST task.",
        "The newsgroups part covers posts to electronic bulletin boards, Usenet newsgroups, discussion groups and similar forums.",
        "The corpus statistics of the training corpora are shown in Tab.",
        "1 to Tab.",
        "3.",
        "To measure the translation quality, we use the BLEU score.",
        "With exception of the TC-STAR EPPS task, all scores are computed case-insensitive.",
        "As BLEU measures accuracy, higher scores are better.",
        "The translation results for all tasks are presented in Tab.",
        "4.",
        "For each translation task, we tested the decoder on N-best lists of size N=10000, i.e. the 10 000 best translation candidates.",
        "Note that in some cases the list is smaller because the translation system did not produce more candidates.",
        "To analyze the improvement that can be gained through rescor-ing with MBR, we start from a system that has already been rescored with additional models like an n-gram language model, HMM, IBM-1 and IBM-4.",
        "It turned out that the use of 1 000 best candidates for the MBR decoding is sufficient, and leads to exactly the same results as the use of 10 000 best lists.",
        "Similar experiences were reported by (Mangu et al., 2000; Stolcke et al., 1997) for ASR.",
        "We observe that the improvement is larger for",
        "Chinese English",
        "Train",
        "Sentences",
        "9M",
        "Words",
        "232 M",
        "250 M",
        "Vocabulary",
        "238 K",
        "412K",
        "NIST 02",
        "Sentences",
        "878",
        "Words",
        "26431 24 352",
        "NIST 05",
        "Sentences",
        "1082",
        "Words",
        "34908 36 027",
        "GALE 06 news",
        "Sentences",
        "460",
        "Words",
        "9 979 11493",
        "GALE 06",
        "Sentences",
        "461",
        "Words",
        "9 606 11689",
        "Spanish English",
        "Train",
        "Sentences",
        "1.2M",
        "Words",
        "35 M",
        "33 M",
        "Vocabulary",
        "159 K",
        "110K",
        "Dev",
        "Sentences",
        "1452",
        "Words",
        "51982 54 857",
        "Test",
        "Sentences",
        "1780",
        "Words",
        "56515 58295",
        "Arabic English",
        "Train",
        "Sentences",
        "4M",
        "Words",
        "125 M",
        "124 M",
        "Vocabulary",
        "421 K",
        "337 K",
        "news",
        "Sentences",
        "566",
        "Words",
        "14 160 15 320",
        "Sentences",
        "615",
        "Words",
        "11 195 14493",
        "Table 4: Translation results BLEU [%] for the NIST task, GALE task and TC-STAR task (S-E: Spanish-English; C-E: Chinese-English; A-E: Arabic-English).",
        "low-scoring translations, as can be seen in the GALE task.",
        "For an ASR task, similar results were reported by (Stolcke et al., 1997).",
        "Some translation examples for the GALE Arabic-English newswire task are shown in Tab.",
        "5.",
        "The differences between the MAP and the MBR hypotheses are set in italics."
      ]
    },
    {
      "heading": "5. Conclusions",
      "text": [
        "We have shown that Minimum Bayes Risk decoding on N-best lists improves the BLEU score considerably.",
        "The achieved results are promising.",
        "The improvements were consistent among several evaluation sets.",
        "Even if the improvement is sometimes small, e.g. TC-STAR, it is statistically significant: the absolute improvement of the BLEU score is between 0.2% for the TC-STAR task and 1.1% for the GALE Chinese-English task.",
        "Note, that MBR decoding is never worse than MAP decoding, and is therefore promising for SMT.",
        "It is easy to integrate and can improve even well-trained systems by tuning them for a particular evaluation criterion."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "This material is partly based upon work supported by the Defense Advanced Research Projects Agency and was partly funded by the European Union under the integrated project TC-STAR (Technology and Corpora for Speech to Speech Translation, IST-2002-FP6-506738, http://www.tc-star.org).",
        "TC-STAR S-E",
        "NIST C-E",
        "GALE A-E",
        "GALE C-E",
        "decision rule",
        "test",
        "2002 (dev)",
        "2005",
        "news",
        "news",
        "MAP",
        "52.6",
        "32.8",
        "31.2",
        "23.6",
        "12.2",
        "14.6",
        "9.4",
        "MBR",
        "52.8",
        "33.3",
        "31.9",
        "24.2",
        "13.3",
        "15.4",
        "10.5",
        "Reference",
        "MAP-Hyp MBR-Hyp",
        "the saudi interior ministry announced in a report the implementation of the death penalty today, tuesday, in the area of medina (west) of a saudi citizen convicted of murdering a fellow citizen.",
        "saudi interior ministry in a statement to carry out the death sentence today in the area of medina (west) in saudi citizen found guilty of killing one of its citizens.",
        "the saudi interior ministry announced in a statement to carry out the death sentence today in the area of medina (west) in saudi citizen was killed one of its citizens.",
        "Reference MAP-Hyp MBR-Hyp",
        "faruq al-shar'a takes the constitutional oath of office before the syrian president",
        "farouk al-shara leads sworn in by the syrian president",
        "farouk al-shara lead the constitutional oath before the syrian president"
      ]
    }
  ]
}
