{
  "info": {
    "authors": [
      "Daniel G. Bobrow",
      "Richard Crouch",
      "Tracy Holloway King",
      "Cleo Condoravdi",
      "Lauri Karttunen",
      "Rowan Nairn",
      "Valeria De Paiva",
      "Annie Zaenen"
    ],
    "book": "ACL-PASCAL Workshop on Textual Entailment and Paraphrasing",
    "id": "acl-W07-1403",
    "title": "Precision-focused Textual Inference",
    "url": "https://aclweb.org/anthology/W07-1403",
    "year": 2007
  },
  "references": [
    "acl-P02-1035"
  ],
  "sections": [
    {
      "text": [
        "D. G. Bobrow, C. Condoravdi, R. Crouch, V. de Paiva, L. Karttunen, T. H. King, R. Nairn, L. Price, A. Zaenen",
        "Palo Alto Research Center",
        "This paper describes our system as used in the RTE3 task.",
        "The system maps premise and hypothesis pairs into an abstract knowledge representation (AKR) and then performs entailment and contradiction detection (ecd) on the resulting AKRs.",
        "Two versions of ECD were used in RTE3, one with strict ECD and one with looser ECD."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "In the RTE textual entailment challenge, one is given a source text T and a hypothesis H, and the task is to decide whether H can be inferred from T. Our system interprets inference in a strict way.",
        "Given the knowledge of the language embedded in the system, does the hypothesis logically follow from the information embedded in the text?",
        "Thus we are emphasizing precision, particularly in question-answering.",
        "This was reflected in our results in the RTE3 challenge.",
        "We responded correctly with yes to relatively few of the examples, but on the QA-type examples, we achieved 90-95% average precision.",
        "The methodology employed is to use the linguistic information to map T and H onto a logical form in AKR, our Abstract Knowledge Representation.",
        "The AKR is designed to capture the propositions the author of a statement is committed to.",
        "For the sake of ECD, the representation of T may include elements that are not directly expressed in the text.",
        "For example, in the AKR of John bought a car includes the fact that the car was sold.",
        "The AKR of John forgot to buy milk includes the fact that John did not buy milk.",
        "Our reasoning algorithm tries to determine whether the AKR of H is subsumed by the AKR of T and detect cases when they are in conflict.",
        "The Entailment and Contradiction Detection (ECD) algorithm makes a distinction that is not part of the basic RTE challenge.",
        "If T entails the negation of H, we answer NO (Contradiction).",
        "On the other",
        "Text-Breaking Named-entity recognition Morphological Analysis LFG Parsing semantic processing",
        "AKR rules",
        "Delimited sentences Type-marked Entities Word stems plus features Functional Structure Scope, Predicate-argument structure Conceptual, Contextual, Temporal Structure hand, if there is no direct entailment we answer UNKNOWN.",
        "We do not try to construct a likely scenario that would link T and H. Nor have we tried to collect data on phrases that would tend to indicate such likely associations between T and H. That approach is clearly very useful (e.g. (Hickl et al., 2006)), and could be used as a backup strategy with our more formal entailment approach.",
        "We have chosen to focus on strict structural and lexical entailments.",
        "This paper describes the processing pipeline for mapping to AKR, the ECD algorithm, the challenges we faced in processing the RTE data and a summary of our results on RTE3."
      ]
    },
    {
      "heading": "2. Process Pipeline",
      "text": [
        "Figure 1 shows the processing pipeline for mapping texts to AKR.",
        "The input is a text of one or more sentences.",
        "All components of the system are \"ambiguity enabled\" (Maxwell and Kaplan, 1991).",
        "This allows each component to accept ambiguous input in a \"packed\" format, process it without unpacking the ambiguities, and then pass packed input to the next stage.",
        "The syntactic component, LFG Parsing, also has a stochastic disambiguation system which allows us to pass the n-best on to the semantics (Rie-zler et al., 2002); for the RTE3 challenge, we used n=50.",
        "The parser takes the output of the morphology (i.e. a series of lemmata with their tags) and produces a tree (constituent-structure) and a dependency structure (functional-structure) represented as an attribute-value matrix.",
        "The functional-structure is of primary importance for the semantics and akr.",
        "In particular, it encodes predicate-argument relations, including long-distance dependencies, and provides other syntactic features (e.g. number, tense, noun type).",
        "The output of the syntax is input for the semantics that is produced by an ambiguity enabled packed rewriting system.",
        "The semantics is described in detail in (Crouch and King, 2006).",
        "semantic processing assigns scope to scope-bearing elements such as negation and normalizes the output of the syntax.",
        "This normalization includes reformulating syntactic passives as actives (e.g.",
        "The cake was eaten by Mary.",
        "/ Mary ate the cake.",
        "), resolving many null pronouns (e.g.",
        "Laughing, John entered the room / Johni laughing, John entered the room.",
        "), and canonicalizing measure phrases, comparatives, and dates.",
        "More complex normalizations involve converting nominal deverbals into the equivalent verbal form, identifying arguments of the verb from the arguments of the nominal (Gurevich et al., 2006).",
        "For example, the semantic representation of Iraq's destruction of its wmd is similar to the representation of Iraq destroyed its wmd.",
        "The final main task of the semantics rules is to convert words into concepts and syntactic grammatical functions into roles.",
        "The mapping onto concepts uses WordNet (Fellbaum, 1998) to map words into lists of synsets.",
        "The named entity types provided by the morphology and syntax are used to create more accurate mapping of proper nouns since these are not systematically represented in WordNet.",
        "The semantic rules use the grammatical function subcat-egorization information from the verb and the role information found in extended VerbNet (Kipper et al., 2000) to map syntactic subjects, objects, and obliques into more abstract thematic roles such as Agent, Theme, and Goal (Crouch and King, 2005).",
        "This mapping into thematic-style roles allows the system to correctly align the arguments in pairs like (1) and (2), something which is impossible using just syntactic functions.",
        "In the first, the object and subject have a common thematic role in the alternation between transitive and intransitive; while in the second, the common role is shared by the subjects.",
        "(1) John broke the vasesyn:object ,sem:patient.",
        "The vasesyn:subject,sem:patient broke.",
        "(2) Johnsyn:subject,sem:agent ate the cake.Johnsyn:subject,sem:agent ate.",
        "The goal of these semantic normalizations is to abstract away from the syntactic representation so that sentences with similar meaning have similar semantic representations.",
        "However, the semantics is still fundamentally a linguistic level of representation; further abstraction towards the meaning is done in the mapping from semantics to akr.",
        "The akr is the level of representation that is used to determine entailment and contradiction in our rte3 system.",
        "A preliminary description of its logic was provided in (Bobrow et al., 2005).",
        "The akr mapping converts grammatical tense and temporal modifiers into temporal relations, identifies anaphoric referents and makes explicit the implied relation between complement clauses and the main verb (e.g. for manage, fail) (Nairn et al., 2006).",
        "akr also deals with standard phrases that are equivalent to simple vocabulary terms.",
        "For example, take a flight to New York is equivalent to fly to New York.",
        "These uses of \"light\" verbs (e.g. take, give) are not included in synonyms found in WordNet.",
        "Another class of phrasal synonyms involve inchoatives (e.g. take a turn for the worse/worsen).",
        "We included a special set of transformation rules for phrasal synonyms: some of the rules are part of the mapping from semantics to akr while others are part of the ecd module.",
        "The mapping to akr is done using the same ambiguity-enabled ordered rewriting system that the semantics uses, allowing the akr mapping system to efficiently process the packed output of the semantics.",
        "The akr for a sentence like Bush claimed that Iraq possessed wmds in Figure 2 introduces two contexts: a top level context t, representing the commitments of the speaker of sentence, and an embedded context claim_cx:37 representing the state of affairs according to Bush's claim.",
        "The two contexts are related via the Topic role of the claim event.",
        "The representation contains terms like claim:37 or Conceptual Structure subconcept(Bush:1,[person-1]) role(cardinality_restriction,Bush:1,sg) subconcept(possess:24,[possess-1,own-1,possess-3]) role(Destination,possess:24,wmd:34) subconcept(Iraq:19,[location-1,location-4]) role(cardinality_restriction,Iraq:19,sg) subconcept(wmd:34,",
        "[weapon_of_mass_destruction-1]) role(cardinalityjestriction,wmd:34,pl) Contextual Structure context(t) context(claim_cx:37) context jelation(t,claimxx:37,crel(Topic,claim:37)) instantiable(Bush:1,t) instantiable(Iraq:19,t) instantiable(claim:37,t) instantiable(Iraq:19,claim_cx:37) instantiable(possess:24,claim_cx:37) instantiable(wmd:34,claim_cx:37)",
        "Temporal Structure temporalRel(After,Now,claim:37) temporalRel(After,claim:37,possess:24)",
        "Figure 2: AKR for Bush claimed that Iraq possessed",
        "WMDs.",
        "Bush:1 which refer to the kinds of object that the sentence is talking about.",
        "The subconcept facts explicitly link these terms to their concepts in WordNet.",
        "Thus claim:37 is stated to be some subkind of the type claim-1, etc., and wmd:34 to be some subkind of the type weapon_of_mass_destruction-1.",
        "Terms like claim:37 and wmd:34 do not refer to individuals, but to concepts (or types or kinds).",
        "saying that there is some subconcept of the kind weapon_of_mass_destruction-1, where this subconcept is further restricted to be a kind of wmd possessed by Iraq, does not commit you to saying that there are any instances of this subconcept.",
        "The instantiable assertions capture the commitments about the existence of the kinds of object described.",
        "In the top-level context t, there is a commitment to an instance of Bush and of a claim:37 event made by him.",
        "However, there is no top-level commitment to any instances of wmd:34 possessed by Iraq:19.",
        "These commitments are only made in the embedded claim_cx:37 context.",
        "It is left open whether these embedded commitments correspond, or not, to the beliefs of the speaker.",
        "Two distinct levels of structure can thus be discerned in AKR: a conceptual structure and a contextual structure.",
        "The conceptual structure, through use of subconcept and role assertions, indicates the subject matter.",
        "The contextual structure indicates commitments as to the existence of the subject matter via instantiability assertions linking concepts to contexts, and via context relations linking contexts to contexts.",
        "In addition, there is a temporal structure that situates the events described with respect to the time of utterance and temporally relates them to one another."
      ]
    },
    {
      "heading": "3. Entailment and Contradiction Detection",
      "text": [
        "ecd is implemented as another set of rewrite rules, running on the same packed rewrite system used to generate the AKR representations.",
        "The rules (i) align concept and context terms in text (T) and hypothesis (H) AKRs, (ii) calculate concept subsumption orderings between aligned T and H terms, and (iii) check instantiability and uninstantiability claims in the light of subsumption orderings to determine whether T entails H, T contradicts H, or T neither entails not contradicts H. For the purposes of RTE3, both contradiction and neither contradiction nor entailment are collapsed into a NO (does not follow) judgment.",
        "One of the novel features of this approach is that T and H representations do not need to be disambiguated before checking for entailment or contradiction.",
        "The approach is able to detect if there is one reading of T that entails (or contradicts) one reading of H. The T and H passages can in effect mutually disambiguate one another through the ecd.",
        "For example, although plane and level both have multiple readings, they can both refer to a horizontal surface, and in that sense The plane is dry entails The level is dry, and vice versa.",
        "The first phase of ecd aligns concepts and context terms in the T and H AKRs.",
        "Concepts are represented as lists of WordNet hypernym lists, in WordNet sense order.",
        "Two concept terms can be aligned if a sense synset of one term (i.e. the first element of one of the term's hypernym lists) is contained in a hypernym list of the other term.",
        "The alignment can be weighted according to word sense; so a concept overlap on the first senses of a t and h term counts for more than a concept overlap on the n and mth senses.",
        "However, no weightings were used in rte3.",
        "For named entities, alignment demands not only a concept overlap, but also an intersection in the \"alias\" forms of the proper nouns.",
        "For exam-ple,\"George Bush\" may be aligned with \"George\" or with \"Bush\".",
        "Context alignment relies on associating each context with an indexing concept, usually the concept for the main verb in the clause heading the context.",
        "Contexts are then aligned on the basis of these concept indices.",
        "Typically, an h term can align with more than one t term.",
        "In such cases all possible alignments are proposed, but the alignment rules put the alternative alignments in different parts of the choice space.",
        "Having aligned t and h terms, rules are applied to determine concept specificity and subsumption relations between aligned terms.",
        "Preliminary judgments of specificity are made by looking for hypernym inclusion.",
        "For example, an h term denoting the concept \"person\" is less specific than a t term denoting \"woman\".",
        "These preliminary judgments need to be revised in the light of role restrictions modifying the terms: a \"tall person\" is neither more nor less specific than a \"woman\".",
        "Revisions to specificity judgments also take into account cardinality modifiers: while \"person\" is less specific than \"woman\", \"all persons\" is judged to be more specific than \"all women\".",
        "With judgments of concept specificity in place, it is possible to determine entailment relations on the basis of (un)instantiability claims in the t and h akrs.",
        "For example, suppose the t and h akrs contain the facts in (3).",
        "(3) t: instantiable(C_t, Ctx_t) h: instantiable(C_h, Ctx_h) where concept C_t is aligned with C_h, C_t is judged to be more specific than C_h, and context Ctx_t is aligned with context Ctx_h.",
        "In this case, the hypothesis instantiability claim is entailed by the text instantiability claim (existence of something more specific entails existence of something more general).",
        "This being so, the h instantiability claim can be deleted without loss of information.",
        "If instead we had the (un)instantiability claims in (4) for the same alignments and specificity relations, (4) t: instantiable(C_t, Ctx_t)",
        "h: uninstantiable(C_h, Ctx_h)",
        "we would have a contradiction: the text says that there is something of the more specific type C_t, whereas the hypothesis says there are no things of the more general type C_h.",
        "In this case, the rules explicitly flag a contradiction.",
        "Once all (un)instantiability claims have been compared, it is possible to judge whether the text entails or contradicts the hypothesis.",
        "Entailed hypothesis (un)instantiability assertions are deleted from the representation.",
        "Consequently, if there is one t and h akr readings and one set of alignments under which all the h (un)instantiability assertions have been removed, then there is an entailment of h by t. If there is a pair of readings and a set of alignments under which a contradiction is flagged, then there is a contradiction.",
        "If there is no pair of readings or set of alignments under which there is either an entailment or a contradiction, then t and h are merely consistent with one another.",
        "There are exceptional cases such as (5) where one reading of t entails h and another reading contradicts it.",
        "(5) t: John did not wait to call for help.",
        "h: John called for help.",
        "Our ecd rules detect such cases.",
        "WordNet often misses synonyms needed for the alignment in the ecd.",
        "In particular, the hierarchy and synsets for verbs are one of WordNet's least developed parts.",
        "To test the impact of the missing synonyms, we developed a variation on the ecd algorithm that allows loose matching.",
        "First, in concept alignment, if a verb concept in h does not align with any verb concept in t, then we permit it to (separately) align with all the text verb concepts.",
        "We do not permit the same loose alignment for noun concepts, since we judge WordNet information to be more reliable for nouns.",
        "This free alignment of verbs might sound risky, but in general these alignments will not lead to useful concept specificity judgments unless the t and h verbs have very similar arguments / role restrictions.",
        "When such a loose verb alignment is made, we explicitly record this fact in a justification term included in the alignment fact.",
        "Similarly, when judging concept speciicity, each rule that applies adds a term to a list of justiications recorded as part of the fact indicating the speciicity relation.",
        "This means that when the inal speciicity judgments are determined, each judgment has a record of the sequence of decisions made to reach it.",
        "(Un)instantiability comparisons are made as in strict matching.",
        "However, the criteria for detecting an entailment are selectively loosened.",
        "If no contradiction is flagged, and there is a pairing of readings and alignments under which just a single h instantiability assertion is left standing, then this is allowed through as a loose entailment.",
        "However, further rules are applied to block those loose entailments that are deemed inappropriate.",
        "These blocking rules look at the form of the justiication terms gathered based on speciicity judgments.",
        "These blocking rules are manually selected.",
        "First, a loose matching run is made without any blocking rules.",
        "Results are dumped for each t-h pair, recording the expected logical relation and the jus-tiications collected.",
        "Blocking rules are created by detecting patterns of justiication that are associated with labeled non-entailments.",
        "One such blocking rule says that if you have just a single h instantia-bility left, but the speciicity justiications leading to this have been shown to be reliable on training data, then the instantiability should not be eliminated as a loose entailment."
      ]
    },
    {
      "heading": "4. Challenges in Processing the rte Data",
      "text": [
        "The rte3 data set contains inconsistencies in spelling and punctuation between the text and the hypothesis.",
        "To handle these, we did an automatic prepass where we compared the strings in the passage text to those in the hypothesis.",
        "Some of the special cases that we handled include:",
        "• Normalize capitalization and spacing",
        "• Identify acronyms and shorten names",
        "• Title identiication",
        "• Spelling correction",
        "Role names in VerbNet are in part intended to capture the relation of the argument to the event being described by the verb.",
        "For example, an object playing an Agent role is causally involved in the event, while an object playing a Theme or Patient role is only supposed to be affected.",
        "This allows participants in an action to be identiied regardless of the syntactic frame chosen to represent the verb; this was seen in (1) and (2).",
        "Sometimes the roles from VerbNet are not assigned in such a way as to allow such transparent identiication across frames or related verbs.",
        "Consider an example.",
        "In Ed travels/goes to Boston VerbNet identifies Ed as playing a Theme role.",
        "However, in Ed flies to Boston VerbNet assigns Ed an Agent role; this difference can make determining contradiction and entailment between t and h dificult.",
        "We have tried to compensate in our ecd, by using a backoff strategy where fewer role names are used (by projecting down role names to the smaller set).",
        "As we develop the system further, we continue to experiment with which set of roles works best for which tasks.",
        "Another open issue involves identifying alternative ways vague relations among objects appear in text.",
        "We do not match the expression the Boston team with the team from Boston.",
        "To improve our recall, we are considering loose matching techniques."
      ]
    },
    {
      "heading": "5. Summary of our results on rte 3",
      "text": [
        "We participated in the rte challenge as a way to understand what our particular techniques could do with respect to a more general version of textual entailment.",
        "The overall experiment was quite enlightening.",
        "Tables 1 and 2 summarize how we did on the rte3 challenge.",
        "System 1 is our standard system with strict ecd.",
        "System 2 used the looser set of ecd rules.",
        "Table 1: System 1 with Strict ecd",
        "Gold",
        "yes",
        "Sys",
        "yes",
        "Correct",
        "R",
        "P",
        "F",
        "ie",
        "105",
        "6",
        "5",
        "0.048",
        "0.83",
        "0.20",
        "ir",
        "87",
        "4",
        "4",
        "0.046",
        "1.00",
        "0.21",
        "qa",
        "106",
        "10",
        "9",
        "0.085",
        "0.90",
        "0.28",
        "sum",
        "112",
        "11",
        "7",
        "0.063",
        "0.64",
        "0.20",
        "Total",
        "410",
        "31",
        "25",
        "0.060",
        "0.84",
        "0.22",
        "Gold Sys Cor- R P F yes yes rect paid is weighted towards a generic reading: most if not all experts get a good salary.",
        "These examples are indicative of the subtlety of analysis necessary for high precision textual inference.",
        "ie",
        "105",
        "15",
        "10",
        "0.095",
        "0.67",
        "0.25",
        "ir",
        "87",
        "6",
        "4",
        "0.046",
        "0.67",
        "0.18",
        "qa",
        "106",
        "14",
        "13",
        "0.12",
        "0.93",
        "0.34",
        "sum",
        "112",
        "17",
        "10",
        "0.089",
        "0.59",
        "0.23",
        "Total",
        "410",
        "52",
        "37",
        "0.088",
        "0.71",
        "0.25"
      ]
    }
  ]
}
