{
  "info": {
    "authors": [
      "Eiji Aramaki",
      "Takeshi Imai",
      "Kengo Miyo",
      "Kazuhiko Ohe"
    ],
    "book": "Fourth International Workshop on Semantic Evaluations (SemEval-2007)",
    "id": "acl-W07-2103",
    "title": "UTH: SVM-based Semantic Relation Classification using Physical Sizes",
    "url": "https://aclweb.org/anthology/W07-2103",
    "year": 2007
  },
  "references": [
    "acl-C92-2082",
    "acl-P06-2064",
    "acl-P99-1008",
    "acl-W04-2609"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the 4th International Workshop on Semantic Evaluations (SemEval-2007), pages 464?467, Prague, June 2007. c?2007 Association for Computational Linguistics"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "Although researchers have shown increasing interest in extracting/classifying semantic relations, most previous studies have basically relied on lexical patterns between terms.",
        "This paper proposes a novel way to accomplish the task: a system that captures a physical size of an entity.",
        "Experimental results revealed that our proposed method is feasible and prevents the problems inherent in other methods."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Classification of semantic relations is important to NLP as it would benefit many NLP applications, such as machine translation and information retrieval.",
        "Researchers have already proposed various schemes.",
        "For example, Hearst (1992) manually designed lexico-syntactic patterns for extracting is-a relations.",
        "Berland and Charniak (1999) proposed a similar method for part-whole relations.",
        "Brin (1998) employed a bootstrapping algorithm for more specific relations (author-book relations).",
        "Kim and Baldwin (2006) and Moldovan et al(2004) focused on nominal relations in compound nouns.",
        "Turney (2005) measured relation similarity between two words.",
        "While these methods differ, they all utilize lexical patterns between two entities.",
        "Within this context, our goal was to utilize information specific to an entity.",
        "Although entities contain many types of information, we focused on the physical size of an entity.",
        "Here, physical size refers to the typical width/height of an entity.",
        "For example, we consider book to have a physical size of 20?25 cm, and book to have a size of 10?10 m, etc.",
        "We chose to use physical size for the following reasons:",
        "1.",
        "Most entities (except abstract entities) have a physical size.",
        "2.",
        "Several semantic relations are sensitive to phys",
        "ical size.",
        "For example, a content-container relation (e1 content-container e2) naturally means that e1 has a smaller size than e2.",
        "A book is also smaller than its container, library.",
        "A part-whole relation has a similar constraint.",
        "Our next problem was how to determine physical sizes.",
        "First, we used Google to conduct Web searches using queries such as ?book (*cm x*cm)?",
        "and ?library (*m x*m)?.",
        "Next, we extracted numeric expressions from the search results and used the average value as the physical size.",
        "Experimental results revealed that our proposed approach is feasible and prevents the problems inherent in other methods."
      ]
    },
    {
      "heading": "2 Corpus",
      "text": [
        "We used a corpus provided by SemEval2007 Task #4 training set.",
        "This corpus consisted of 980 annotated sentences (140 sentences?7 relations).",
        "Table 1 presents an example.",
        "Although the corpus contained a large quantity of information such as WordNet sense keys, comments, etc., we used only the most pertinent information: entity1 (e1), entity2 (e2), and its relation (true/false)",
        "The <e1>library</e1> contained <e2>books </e2> of guidance on the processes.",
        ".",
        "For example, we extracted a triple example (library, book, true from Table 1."
      ]
    },
    {
      "heading": "3 Method",
      "text": [
        "We applied support vector machine (SVM)-based learning (Vapnik, 1999) using three types of features: (1) basic pattern features (Section 3.1), (2) selected pattern features (Section 3.2), and (3) physical size features (Section 3.3).",
        "Figure 1 presents some examples of these features."
      ]
    },
    {
      "heading": "3.1 Basic Pattern Features",
      "text": [
        "First, the system finds lexical patterns that co-occur with semantic relations between two entities (e1 and e2).",
        "It does so by conducting searches using two queries ?e1 * e2?",
        "and ?e2 * e1?.",
        "For example, two queries, ?library * book?",
        "and ?book * library?, are generated from Table 1.",
        "Then, the system extracts the word (or word sequences) between two entities from the snippets in the top 1,000 search results.",
        "We considered the extracted word sequences to be basic patterns.",
        "For example, given ?...library contains the book...?, the basic pattern is ?",
        "(e1) contains the (e2)?",
        "2.",
        "We gathered basic patterns for each relation, and identified if each pattern had been obtained as a SVM feature or not (1 or 0).",
        "We refer to these features as basic pattern features."
      ]
    },
    {
      "heading": "3.2 Selected Pattern Features",
      "text": [
        "Because basic pattern features are generated only from snippets, precise co-occurrence statistics are not available.",
        "Therefore, the system searches again with more specific queries, such as ?library contains the book?.",
        "However, this second search is a heavy burden for a search engine, requiring huge numbers of queries (# of samples ?",
        "# of basic patterns).",
        "We thus selected the most informative n patterns (STEP1) and conducted specific searches (# of samples ?",
        "n basic patterns)(STEP2) as follows: STEP1: To select the most informative patterns, we applied a decision tree (C4.5)(Quinlan, 1987) and selected the basic patterns located in the top n branches 3.",
        "STEP2: Then, the system searched again using the selected patterns.",
        "We considered log weighted hits (log",
        "|hits|) to be selected pattern features.",
        "For example, if ?library contains the book?",
        "produced 120,000 hits in Google, it yields the value log"
      ]
    },
    {
      "heading": "3.3 Physical Size Features",
      "text": [
        "As noted in Section 1, we theorized that an entity's size could be a strong clue for some semantic relations.",
        "We estimated entity size using the following queries:",
        "1.",
        "?< entity > (* cm x * cm)?, 2.",
        "?< entity > (* x * cm)?, 3.",
        "?< entity > (* m x * m)?, 4.",
        "?< entity > (* x * m)?.",
        "In these queries, < entity > indicates a slot for each entity, such as ?book?, ?library?, etc.",
        "Then, the system examines the search results for the numerous expressions located in ?*?",
        "and considers the average value to be the size.",
        "?",
        "(e1) contains THE (e2)?",
        "and ?",
        "(e1) contains (e2)?",
        "are different patterns.",
        "When results of size expressions were insufficient (numbers < 10), we considered the entity to be non-physical, i.e., to have no size.",
        "By applying the obtained sizes, the system generates a size feature, consisting of six flags:",
        "1.",
        "LARGE-e1: (e1's X > e2's X) and (e1's Y > e2's Y) 2.",
        "LARGE-e2: (e1's X < e2's X) and (e1's Y < e2's Y) 3.",
        "NOSIZE-e1: only e1 has no size.",
        "4.",
        "NOSIZE-e2: only e2 has no size.",
        "5.",
        "NOSIZE-BOTH: Both e1 and e2 have no size.",
        "6.",
        "OTHER: Other."
      ]
    },
    {
      "heading": "4 Experiments",
      "text": []
    },
    {
      "heading": "4.1 Experimental Set-up",
      "text": [
        "To evaluate the performance of our system, we used a SemEval-Task No#4 training set.",
        "We compared the following methods using a tenfold cross",
        "validation test: 1.",
        "BASELINE: with only basic pattern features.",
        "2.",
        "+SIZE: BASELINE with size features.",
        "3.",
        "+SEL: BASELINE with selected pattern features.",
        "4.",
        "PROPOSED: BASELINE with both size and selected pattern features.",
        "For SVM learning, we used TinySVM with a linear kernel4."
      ]
    },
    {
      "heading": "4.2 Results",
      "text": [
        "Table 2 presents the results.",
        "PROPOSED was the most accurate, demonstrating the basic feasibility of our approach.",
        "Table 3 presents more detailed results.",
        "+SIZE made a contribution to some relations (REL2 and",
        "Cox, 1989); p = 0.05).",
        "However, contrary to our expectations, size features were disappointing for part-whole relations (REL6) and content-container relations (REL7).",
        "The reason for this was mainly the difficulty in estimating size.",
        "Table 4 lists the sizes of several entities, revealing some strange results, such as a library sized 12.1 ?",
        "8.4 cm, a house sized 53 ?",
        "38 cm, and a car sized 39 ?",
        "25 cm.",
        "These sizes are unusually small for the following reasons:",
        "car?",
        "frequently appear with a size.",
        "Figure 2 presents the size distribution of ?car.?",
        "Few instances appeared of real cars sized approximately 500 ?",
        "400 cm, while very small cars smaller than 100 ?",
        "100 cm appeared frequently.",
        "Our current method of calculating average size is ineffective under this type of situation.",
        "In the future, using physical size as a clue for determining a semantic relation will require resolving this problem."
      ]
    },
    {
      "heading": "5 Conclusion",
      "text": [
        "We briefly presented a method for obtaining the size of an entity and proposed a method for classifying semantic relations using entity size.",
        "Experimental results revealed that the proposed approach yielded slightly higher performance than a baseline, demonstrating its feasibility.",
        "If we are able to estimate en",
        "?#?",
        "indicates the number of obtained size expressions.",
        "?-?",
        "indicates a ?NO-SIZE?",
        "entity.",
        "tity sizes more precisely in the future, the system will become much more accurate."
      ]
    }
  ]
}
