{
  "info": {
    "authors": [
      "Adam Przepiórkowski"
    ],
    "book": "Workshop on Balto-Slavonic Natural Language Processing",
    "id": "acl-W07-1701",
    "title": "Slavic Information Extraction and Partial Parsing",
    "url": "https://aclweb.org/anthology/W07-1701",
    "year": 2007
  },
  "references": [
    "acl-A97-1017",
    "acl-C02-1027",
    "acl-P02-1022",
    "acl-P06-2062",
    "acl-P07-2022",
    "acl-P07-3003",
    "acl-P99-1065",
    "acl-W04-0403"
  ],
  "sections": [
    {
      "text": [
        "Slavonic Information Extraction and Partial Parsing",
        "Adam Przepiorkowski",
        "Insitute of Computer Science Polish Academy of Sciences Ordona 21, 01-237 Warsaw, Poland adamp@ipipan.waw.pl",
        "Information Extraction (IE) often involves some amount of partial syntactic processing.",
        "This is clear in cases of interesting highlevel IE tasks, such as finding information about who did what to whom (when, where, how and why), but it is also true in case of simpler IE tasks, such as finding company names in texts.",
        "The aim of this paper is to give an overview of Slavonic phenomena which pose particular problems for IE and partial parsing, and some phenomena which seem easier to treat in Slavonic than in Germanic or Romance; I also mention various tools which have been used for the partial processing of Slavonic."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The aim of this paper is to give a general but rather biased overview of the problems of Information Extraction (IE) in Slavonic.",
        "In particular, I discuss linguistic phenomena which make IE in Slavonic harder than in Germanic or Romance, §2, but also those which seem to make it easier, §3.",
        "We will also look at various general tools which have been used in IE tasks in the context of Slavonic languages, especially at tools for partial (or shallow) parsing, §4.",
        "I deal mainly with Polish, as a good representative of the Slavonic family: although Polish is a relatively large language, with about 44 million native speakers worldwide (over 38 million in Poland), the availability of linguistic resources and tools for this language does not reflect this fact: it compares unfavourably with Czech, and probably favourably with, say, Ukrainian."
      ]
    },
    {
      "heading": "2. Slavonic is Hard",
      "text": [
        "There are various characteristics of Slavonic languages that make them more difficult for automatic processing, whether shallow or deep, than Germanic and Romance languages.",
        "The two of them which are most conspicuous, and identified as most problematic, e.g., in (Collins et al., 1999), are rich nominal inflection (§2.1) and free word order (§2.6).",
        "Others, causing problems to varying extents, include: idiosyncratic inflection of Slavonic proper names (§2.2); unstable inflection of some foreign names (§2.3); high degree of trans- and, especially, intra-paradigmatic syncretisms (§2.4); and, on the more syntactic level, the infamous quirkiness of numeral phrases (NumPs; §2.5).",
        "The rich nominal inflection of Slavonic makes already the most basic IE task, namely Named Entity Recognition (NER), more difficult than in Germanic or Romance.",
        "Slavonic nouns, apart from inflecting for number (singular and plural; in Slovenian and Sorbian also dual), famously inflect for about 6 (e.g., Russian, Slovenian) or 7 (e.g., Czech, Croatian, Polish, Ukrainian) cases: the exact number of cases cited in the literature for any particular language often depends on the granularity of description, so Belorussian and Slovak have either 6 or 7 cases, depending on the inclusion in the description the rare vocative forms, among the 7 Serbian cases, dative and locative are sometimes conflated because they \"only\" differ in accent, the Polish case system may be extended to 8 cases by postulating the distributive case (Gruszczyriski, 1989, p. 89), while the number of Russian cases may also be reasonably increased to 8 by adding a second genitive and a second locative case (Jakobson, 1958).",
        "While for many European languages a dictionary of lemmata of proper names is sufficient for the task of NER, (Steinberger and Pouliquen, 2007, §3.3) note that \"a minimum of morphological treatment\" is required for languages with rich nominal inflection, such as Balto-Slavonic or Finno-Ugric languages.",
        "Unfortunately, for the majority of Slavonic languages, there are no (freely) publicly available resources that could provide such \"minimum morphological treatment\" of proper names.",
        "For example, the only large free (but not open source) morphological analyser for Polish, Morfeusz (Wolinski, 2006), contains very few proper names.",
        "Moreover, the NE content of commercial analysers is often rather low, so that simple resource-light heuristics sometimes give better results (Urbanska and Mykowiecka, 2005, p. 214).",
        "Such heuristics usually involve the creation of inflected forms by adding typical suffixes (Popov et al., 2004; Urbanska and Mykowiecka, 2005; Steinberger and Pouliquen, 2007), where the suffix addition/substitution rules are either hand-generated (Urbanska and Mykowiecka, 2005) or automatically acquired (Steinberger and Pouliquen, 2007).",
        "As mentioned in (Piskorski, 2005) and discussed at length in (Piskorski et al., 2007b), many Polish surnames have the same base forms as common names, for example, GRZYB (lit.",
        "'mushroom'), GotAB (lit.",
        "'pigeon') or Kowalski (lit.",
        "an adjective from 'smith').",
        "This is a problem in itself in recognising proper names, but it is further exacerbated by the fact that such proper nouns may have different gender values, and different inflectional paradigms, than the corresponding common nouns.",
        "For example, while the common nouns GRZYB and GotAB are, respectively, inanimate masculine and animate masculine (cf. fn.",
        "5), the corresponding surnames are virile or feminine, depending on the denotation; in case of singular feminine names, they would not overtly inflect at all, while in case of singular masculine or plural uses, the forms are often different than corresponding common forms, e.g., the accusative singular and plural forms of GotAB would be golebia and golebie, when used as a common noun, and Golaba and Golabow, when used as a surname, etc.",
        "obviously, once properly described, such inflectional differences may actually help in",
        "NER.",
        "A problem relatively minor in comparison to other problems discussed here is the inflection of foreign names: although it is governed by strict prescriptive rules, native speakers are often unaware of them and different variants of the same form may be encountered in text; for example, while in Polish the correct spelling of the singular instrumental form of Linux is Linuksem, the variant Linuxem is at least as common, and the starkly wrong Linux'em and Linux-em are also quite frequent.",
        "Similarly, probably few Poles realise that the correct locative forms of Brandt and Peirce are Brandcie and Peirsie, and not, say, Brandtcie and Peirce'ie, and that although the locative of Remarque is Remarque'u, the instrumental is Remarkiem.",
        "A comprehensive NER should be able to deal with various incorrect forms of foreign NE occurring in Slavonic texts.",
        "On the other hand, the inflection of proper names depends on their pronunciation, i.e., on their origin.",
        "For example, the genitive of CHARLES is either Charlesa or Charles'a, depending on whether it is an English name or a French name.",
        "Another example, from (Piskorski et al., 2007b), is Wilde, whose genitive form is either Wilde'a (English) or Wildego (German).",
        "This feature, when properly encoded, may actually help distinguish between entities in NER.",
        "A rich inflection system also implies that the size of the tagset is very large.",
        "For example, given that a Polish nominal form may have one of 2 numbers, one of 7 cases and one of 5 genders, there are 70 possible nominal tags, not counting gerundial and pronominal forms.",
        "In fact, there are 4179 possible tags in the IPI PAN Tagset of Polish (Przepiorkowski and Wolmski, 2003a; Przepiorkowski and Wolinski, 2003b), of which around 1150 occur in nature (Przepiorkowski, 2006b).",
        "Similarly, sizes of Czech tagsets range from 1171 (Hajic and Hladka, 1997), through 1631 (Pala et al., 1998), to theoretically 4257, but \"only\" about 1100 actually used (Mirovsky et al., 2002).",
        "Such detailed tagsets make it difficult to reach high accuracy, which – on the assumption that syntactic parsing is preceded by full morphosyntactic disambiguation – has negative influence on syntactic processing.",
        "Another problem connected to the rich inflection system of Slavonic languages is the large number of syncretisms.",
        "For example, a typical Polish adjective may have 11 textually different forms (e.g., for BlAtY 'white': biali, biala, biala, biale, bialego, bi-alej, bialemu, bialy, bialych, bialym, bialymi), but as many as 70 different tags (2 numbers x 7 cases x 5 genders).",
        "There are also various systematic nominal syncretisms which to some extent annul the advantages that rich case system presents for the identification of grammatical roles.",
        "For example, in plural, Polish non-virile (non-human-masculine) nouns have the same form in the nominative and in the accusative, while in the singular, inanimate masculine and neuter forms do.",
        "Similarly, virile and animate masculine nouns have the same singular accusative and singular genitive forms.",
        "So, for example, in the rather artificial sentence Samochody dwie minuty wyprzedzaja autobusy '(The) cars (for) two minutes are overtaking (the) buses', each of samo-chody, dwie minuty and autobusy may be interpreted as either nominative or accusative, i.e., as the subject (nominative), the object (accusative) or a temporal adjunct (accusative).",
        "An area of Slavonic syntax very well-known in theoretical linguistics is the syntactic behaviour of NumPs (Corbett, 1978; Franks, 1995); numerals also turn out to be awkward for automatic processing in various ways.",
        "First, the case of the noun (phrase) within an NumP depends on the numeral and on the position of the whole NumP in the sentence.",
        "For example, for NumPs in the subject position, the noun is in the nominative case, roughly, if the numeral is or ends in 2, 3 or 4 (with the exception of 12, 13 and 14), and it is genitive otherwise.",
        "This means that the shallow processor should recognise as a possible currency quantity the sequence 152 dolary and 155 dolarow, but not *152 dolarow or *155 dolary.",
        "Second, in case of \"typical\" numerals (not ending in 2, 3 or 4), the Polish NumP in subject position does not agree with the verb; instead, the verb occurs in the default 3rd person singular neuter form, which may make discovering the subject-verb relation more difficult.",
        "Finally, and rather marginally, \"typical\" NumPs in copular constructions trigger very atypical agreement with the predicative adjective, e.g.: 40 glosow bylo niewaZnych/niewaZne '40 votes be-3rd.sg.neut invalid-pl.gen/acc'.",
        "It is easy to overlook such constructions when developing a shallow grammar, and – since they are rare – it is difficult to learn them automatically from corpora.",
        "Last but certainly not least, the relatively free word order makes the discovering of who did what to whom (when, where, how and why) much more difficult than finding the relative order of NPs and PPs in the sentence.",
        "It may seem that the rich case system may help here, as – with active forms of verbs – subjects are usually nominative and objects are often accusative, but matters are much more complicated because of the widespread syncretisms mentioned in §2.4, esp.",
        "the systematic nominative-accusative and accusative-genitive syncretisms, and because both complements and adjuncts may be expressed by the same cases (e.g., accusative temporal adjuncts may look like objects of transitive verbs).",
        "While the relatively free word order is seriously felt in deep parsers and leads to the multiplication of analyses, to the best of our knowledge most IE work in Slavonic to date has concentrated on lower-level tasks such as NER and, hence, has not yet tried to systematically deal with this problem."
      ]
    },
    {
      "heading": "3. Slavonic is Easy",
      "text": [
        "On a more positive note, the rich Slavonic inflectional system may help at the higher levels of processing.",
        "There are various linguistic phenomena where overt case, gender and number agreement allows to differentiate between interpretations and, hence, to extract the information about who did what to whom.",
        "To give two trivial constructed examples: the English sentence I saw him drunk is ambiguous in ways that are necessarily disambiguated by the two Polish translations of that sentence: Widzi-alem go pijany '(I) saw him drunk-nom' and Widzi-alem go pijanego '(I) saw him drunk-acc'.",
        "Perhaps more interestingly, the lexical aspect of Slavonic verbs may make conspicuous the meanings which are only implicit in other languages, as in the Polish Skoczyl na stol '(He) jumped-perf on (the) table-acc' versus Skakal na stole '(He) jumped-imperf on (the) table-loc', both translated into the English He jumped on the table.",
        "One phenomenon important for high level IE where the rich inflectional system plays a positive role, however, is coordination.",
        "Coordination is infamous both in theoretical linguistics and in Natural Language Processing (NLP); in fact, while recent years witnessed an increase of theoretical linguistic works on various aspects of coordination, it seems that NLP lags behind in addressing this phenomenon head on.",
        "One of the exceptions is (Dale and Mazur, 2007), which deals with the problem of identifying the number of Named Entities (NEs) in expressions of the form \"x and Y\", where x and Y are sequences of capitalised words, e.g.: \"Victorian Casino and Gaming Authority\" (single entity) or \"American Express and Visa International\" (two entities).",
        "(Dale and Mazur, 2007) note that the problem is statistically non-negligible, as around 5.7% of sequences of capitalised words with an optional conjunction (i.e., candidates for NEs) actually contain a conjunction.",
        "Similarly, (Rus et al., 2007, p. 229) discuss the bracketing problem in phrases such as \"[soccer and tennis] player\" and \"navy and [marine corps]\", noting that \"[p]arsing base Noun Phrases ... is not handled by current state-of-the-art syntactic parsers\".",
        "Another kind of coordination ambiguity is considered in (Steiner, 2006), namely, the \"NP and NP\" sequence as either an NP-coordination, or a part of sentential coordination (where the first NP is an object of the preceding verb and the second NP is the subject of the following verb).",
        "Slavonic rich inflection makes the processing of such potentially coordinate structures easier.",
        "For example, case disagreement between two apparently coordinated NPs is a strong clue that they in fact belong to separate coordinated clauses, while agreement is a (perhaps weaker) clue that they form an actually coordinated NP.",
        "Similarly, (dis)agreement in case, number and gender may help decide whether two apparently coordinated adjectival forms actually form a coordinate structure."
      ]
    },
    {
      "heading": "4. Slavonic is Processable",
      "text": [
        "After discussing ways in which Slavonic languages seem to be hard or easy for Information Extraction, let us look at practical attempts at Slavonic IE, especially those involving partial parsing.",
        "It seems that there have been relatively few attempts at applying shallow (or partial; cf. fn.",
        "2) grammars to particular practical tasks.",
        "In some of these attempts no particular dedicated language processing system was used to implement shallow grammars: apparently they were coded directly in the host programming language.",
        "One example is (Sharoff, 2004), where shallow parsing is used for the identification of prepositional Multi Word Expressions in Russian, with the following explanation of reasons for performing some language-dependent processing: \"Given that the word order in Russian (and other Slavonic languages) is relatively free and a typical word (i.e. lemma) has many forms (typically from 9 for nouns to 50 for verbs), the sequences of exact N-grams are much less frequent than in English, thus rendering purely statistical approaches useless.\"",
        "For Polish, simple shallow grammars were implemented for the tasks of question answering (Piechocmski and Mykowiecka, 2005) and automatic valence acquisition (Fast and Przepiorkowski, 2005; Przepiorkowski and Fast, 2005); in the latter case a grammar was implemented as a cascade of Perl regular expressions.",
        "Similarly, (Zeman, 2001) describes a Perl regular expression implementation of a shallow preprocessor for a deep statistical parser.",
        "Much earlier, (Nenadic and Vitas, 1998; Ne-nadic, 2000) developed shallow grammars of Serbo-Croatian for the recognition of noun phrases (NPs) and certain kinds of coordinate structures.",
        "See also (Bekavac and Tadic, 2007) on the recognition of Croatian NEs with regular grammars.",
        "Moreover, for Bulgarian a more general integrated system was developed, called LINGUA (Tanev and Mitkov, 2002), which – apart from modules for tokenisation, morphosyntactic analysis and disambiguation, and anaphora resolution – includes an NP extractor and a bottom-up grammar of Bulgarian.",
        "This system, together with a set of shallow patterns for identifying definition patterns, has been employed in a Question Answering prototype system (Tanev, 2004).",
        "Bulgarian pattern-matching grammars are also employed in (Koeva, 2007).",
        "Apart from these language-specific implementations, there exist tools and toolboxes which facilitate various IE tasks, including shallow parsing.",
        "Probably the best known such a general system is GATE (Cunningham et al., 1995; Cunningham et al., 2002), which contains some NE resources for Bulgarian and Russian (Humphreys et al., 2002; Popov et al., 2004) and allows to write shallow (regular) grammars in the JAPE subsystem (Cunningham et al., 2000).",
        "A system similar in scope is SProUT (Becker et al., 2002), whose shallow parsing language allows to write regular grammars over HPSG-style (Pollard and Sag, 1994) typed feature structures and which includes the operation of unification.",
        "Preliminary work on adapting SProUT to the processing of Baltic and Slavonic languages is presented in (Drozdzynski et al., 2003), with much subsequent work devoted to the processing of Polish, especially, in the area of Information Extraction from medical texts (Piskorski et al., 2004; Piskorski, 2004a; Pisko-rski, 2004b; Marciniak et al., 2005; Mykowiecka et al., 2005a; Mykowiecka et al., 2005b; Marciniak and",
        "Mykowiecka, 2007).",
        "Although GATE and SProUT may be adapted to the processing of XML documents, they are perhaps not the most natural choice for the further processing of morphosyntactically annotated documents in, for example, the XCES (XML Corpus Encoding Standard; (Ide et al., 2000)) format, as assumed, e.g., in the IPI PAN Corpus of Polish (Przepiorkowski, 2004a), in the Slovak National Corpus (Garabfk and Gianitsova-Olostiakova, 2005), or in the LT4eL project (http://www.lt4el.eu/).",
        "Specialised XML-aware tools exist for such tasks.",
        "One of the earliest collections of XML processing tools is the LT XML library (Brew et al., 2000), whose second edition, LT-XML2 is currently under preparation.",
        "One of the tools in that new edition, lxtransduce (Tobin, 2005), is an efficient program to add mark-up to XML files via regular grammars over XML elements; this tool is currently used for implementing definition-extraction grammars for Bulgarian, Czech and Polish (Przepiorkowski et al., 2007).",
        "A system well-known in Slavonic NLP is CLaRK (Simov et al., 2001; Simov et al., 2002); it implements various XML mechanism and proposes a language for developing shallow grammars over XML documents; such grammars have been implemented for Bulgarian, as reported in (Simov et al., 2004; Simov and Osenova, 2004).",
        "Finally, a new system, SPADE (Shallow Parsing and Disambiguation Engine), abbreviated to \"4\" (Unicode character 0x2660), has recently been developed at the Institute of Computer Science, Polish Academy of Sciences (Przepiorkowski, 2007b; Buczynnski, 2007).",
        "This tool, unlike many other shallow parsing tools, accepts a possibly mor-phosyntactically ambiguous (XCES-encoded) input and performs simultaneous morphosyntactic disambiguation and shallow parsing.",
        "For example, the rule below, called P + co/kto, will match a possible preposition followed by a possible form of one of the pronouns CO 'what' or KTO 'who', it will try to unify the selected case of the preposition with the case of the pronoun and, if that succeeds, it will mark any non-unified interpretations as rejected and it will mark the two words as a prepositional group with the preposition (cf. 1 below) as its syntactic head and the pronoun (cf. 2) as its semantic head.Moreover, any non-prepositional interpretations of the first segment of the match and any non-nominal interpretations of the second segment will be marked as incorrect.",
        "The language for specification of segments is based on the query syntax of the Poliqarp corpus search engine (Przepiorkowski et al., 2004; Janus and Przepiorkowski, 2007), in turn based on CQP (Christ, 1994).",
        "SPADE is currently employed for the shallow processing of the IPI PAN Corpus of Polish."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "While the relatively free word order of Slavonic languages makes the processing of Slavonic unambiguously harder, I claim that the effects of the rich nominal inflection are mixed: rich inflection dramatically increases the complexity of low-level IE tasks such as NER, but it is beneficial for high-level IE tasks which involve filling scenario templates, as it facilitates identifying grammatical roles, parsing coordination, etc.",
        "Moreover, as becomes clear on the basis of the overview of practical work on Slavonic IE in the last decade, recent years have witnessed substantially increased interest and activity in the area.",
        "I am convinced that the Balto-Slavonic Natural Language Processing workshop at ACL 2007 will further catalyse the development of this field."
      ]
    },
    {
      "heading": "Acknowledgments",
      "text": [
        "I am grateful to Jakub Piskorski, Bruno Pouliquen, Ralf Steinberger and Hristo Tanev for their generous invitation to the BSNLP workshop, and to the European Commission's Joint Research Centre in Ispra, Italy, for financial support.",
        "This paper was written during my stay at the University ofRegensburg, Germany, within the DAAD-MNiSW cooperation programme Automatic methods of extracting linguistic knowledge from corpora (2006-2007).",
        "Many thanks to Qba Piskorski and Roland Meyer for comments on the (as it turned out, pre-) final versions of the paper."
      ]
    }
  ]
}
