{
  "info": {
    "authors": [
      "Ramon Ferrer i Cancho",
      "Alexander Mehler",
      "Olga Pustylnikov",
      "Albert Diaz-Guilera"
    ],
    "book": "Workshop on TextGraphs: Graph-Based Algorithms for Natural Language Processing",
    "id": "acl-W07-0210",
    "title": "Correlations in the Organization of Large-Scale Syntactic Dependency Networks",
    "url": "https://aclweb.org/anthology/W07-0210",
    "year": 2007
  },
  "references": [
    "acl-W06-2801"
  ],
  "sections": [
    {
      "text": [
        "Correlations in the organization of large-scale syntactic dependency networks",
        "Departement de Ffsica Fonamental Universität de Barcelona Marti i Franques 1, 08028 Barcelona, Spain.",
        "Alexander.Mehler@uni-bielefeld.de",
        "Olga.Pustylnikov.",
        "@uni-bielefeld.de",
        "Departament de Ffsica Fonamental Universitat de Barcelona Marti i Franques 1, 08028 Barcelona, Spain.",
        "We study the correlations in the connectivity patterns of large scale syntactic dependency networks.",
        "These networks are induced from treebanks: their vertices denote word forms which occur as nuclei of dependency trees.",
        "Their edges connect pairs of vertices if at least two instance nuclei of these vertices are linked in the dependency structure of a sentence.",
        "We examine the syntactic dependency networks of seven languages.",
        "In all these cases, we consistently obtain three findings.",
        "Firstly, clustering, i.e., the probability that two vertices which are linked to a common vertex are linked on their part, is much higher than expected by chance.",
        "Secondly, the mean clustering of vertices decreases with their degree – this finding suggests the presence of a hierarchical network organization.",
        "Thirdly, the mean degree of the nearest neighbors of a vertex x tends to decrease as the degree of x grows – this finding indicates disassor-tative mixing in the sense that links tend to connect vertices of dissimilar degrees.",
        "Our results indicate the existence of common patterns in the large scale organization of syntactic dependency networks."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "During the last decade, the study of the statistical properties of networks as different as technical, biological and social networks has grown tremendously.",
        "See (Barabasi and Albert, 2002; Dorogovt-sev and Mendes, 2002; Newman, 2003) for a review.",
        "Among them many kinds of linguistic networks have been studied: e.g., free word association networks (Steyvers and Tenenbaum, 2005), syllable networks (Soares et al., 2005), thesaurus networks (Sigman and Cecchi, 2002), and document networks (Mehler, 2006).",
        "See (Mehler, 2007a) for a review of linguistic network studies.",
        "Here we focus on the so called global syntactic dependency networks (GSDN) (Ferrer i Cancho et al., 2004; Ferrer i Cancho, 2005).",
        "A GSDN is induced from a dependency treebank in two steps:",
        "1.",
        "The vertices of the network are obtained from the word forms appearing as nuclei in the input treebank and from punctuation marks as far as they have been annotated and mapped onto dependency trees.",
        "The notion of a nucleus is adapted from Lucien Tesniere: a nucleus is a node of a dependency tree.",
        "Note that multipart nuclei may also occur.",
        "We use the term type in order to denote word forms and punctuation marks.",
        "The reason that we induce vertices from types, but not from lexemes, is that not all corpora are lemmatized.",
        "Thus, the type level is the least common denominator which allows comparing the different networks.",
        "Note also that a systematization of the corpora with respect to the inclusion of punctuation marks is needed.",
        "2.",
        "Two vertices (i.e. types) of a GSDN are connected if there is at least one dependency tree in which their corresponding instance nuclei are linked.",
        "When it comes to applying the apparatus of complex network theory, the arc direction is generally disregarded (Newman, 2003).",
        "Thus, GSDNs are simple undirected graphs without loops or multiple edges.",
        "The attribute 'global' distinguishes macroscopic syntactic dependency networks from their microscopic counterparts in the form of syntactic dependency structures of single sentences.",
        "The latter are the usual object of dependency grammars and related formalisms.",
        "The goal of this article is to shed light on the large-scale organization of syntactic dependency structures.",
        "In terms of theoretical linguistics, we aim to determine the statistical properties that are common to all languages (if they exist), the ones that are not and to explain our findings.",
        "To achieve this goal, we must overcome the limits of many studies of linguistic networks.",
        "Firstly, by using GSDNs we intend to solve the problems of cooccurrence networks in which words are linked if they (a) are adjacent, (b) co-occur within a short window (Ferrer i Cancho and Sole, 2001; Milo et al., 2004; Antiqueira et al., 2006; Masucci and Rodgers, 2006) or (c) appear in the same sentence (Caldeira et al., 2006).",
        "This approach is problematic: with a couple of exceptions (Bordag et al., 2003; Ferrer i Cancho and Sole, 2001), no attempt is made to filter out statistically insignificant co-occurrences.",
        "Unfortunately the filter used in (Ferrer i Cancho and Sole, 2001) is not well-defined because it does not consider fluctuations of the frequencies of word co-occurrences.",
        "(Bordag et al., 2003) implement a collocation measure based on the Poisson distribution and, thus, induce collocation instead of cooccurrence networks.",
        "However, the notion of a sentence window and related notions are problematic as the probability that two words depend syntactically decays exponentially with the number of intermediate words (Ferrer i Cancho, 2004).",
        "Further, (Ferrer i Cancho et al., 2004) shows that the proportion of syntactically wrong links captured from a sentence by linking adjacent words is about 0.3 while this proportion is about 0.5 when linking a word to its 1st and 2nd neighbors.",
        "Thus, dependency treebanks offer connections between words that are linguistically precise according to a dependency grammar formalism.",
        "Secondly, the majority of linguistic network studies is performed on English only – with some exceptions (Soares et al., 2005; Ferrer i Cancho et al., 2004; Mehler, 2006).",
        "Concerning GS-DNs, (Ferrer i Cancho et al., 2004) considers three languages but the syntactic dependency information of sentences is systematically incomplete in two of them.",
        "Here we aim to use complete treebanks and analyze more (i.e. seven) languages so that we can obtain stronger conclusions about the common statistical patterns of GSDNs than in (Ferrer i Cancho et al., 2004).",
        "Therefore, this article is about statistical regularities of the organization of GSDNs.",
        "These networks are analyzed with the help of complex network theory and, thus by means of quantitative graph theory.",
        "We hypothesize that GSDNs are homogeneous in terms of their network characteristics while they differ from non-syntactic networks.",
        "The long-term objective to analyze such distinctive features is to explore quality criteria of dependency treebanks which allow separating high quality annotations from erroneous ones.",
        "The remainder of this article is organized as follows: Section 2 introduces the statistical measures that will be used for studying GSDNs of seven languages.",
        "Section 3 presents the treebanks and their unified representations from which we induce these networks.",
        "Section 4 shows the results and Section 5 discusses them."
      ]
    },
    {
      "heading": "2. The statistical measures",
      "text": [
        "Two essential properties of a network are N, the number of vertices (i.e. the number of types), and k the mean vertex degree (Barabasi and Albert, 2002).",
        "The literature about distinctive indices and distributions of complex networks is huge.",
        "Here we focus on correlations in the network structure (Serrano et al., 2006).",
        "The reason is that correlation analysis provides a deeper understanding of network organization compared to classical aggregative \"small-world\" indices.",
        "For instance, two networks may have the same degree distribution (whose similarity is measured by the exponent of power laws fitted to them) while they differ in the degree correlation of the vertices forming a link.",
        "Correlation analysis is performed as follows: We define p(k) as the proportion of vertices with degree k. Here we study three measures of correlation (Serrano et al., 2006):",
        "• knn(k) is the average degree of the nearest neighbors of the vertices with degree k (Pastor-Satorras et al., 2001).",
        "If knn(k) tends to grow as k grows the network is said to exhibit assor-tative mixing.",
        "In this case, edges tend to connect vertices of similar degree.",
        "If in contrast to this knn(k) tends to shrink as k grows, the network is said to exhibit disassortative mixing.",
        "In this case, edges tend to connect vertices of dissimilar degree.",
        "If there are no correlations, then knn(k) = k with k = (k) / (k); (k) = k is the 1st and (k) the 2nd moment of the degree distribution, namely",
        "In order to enable comparisons of different networks, knn(k) is normalized using k and replaced by knn(k)/k.",
        "• c(k) is the mean clustering coefficient of vertices of degree k. The clustering coefficient of a vertex is defined as the proportion of pairs of adjacent vertices (u, v) such that u and v are linked.",
        "• c is the mean clustering coefficient defined as",
        "In order to test the significance of c, we calculate cunom = k/(N – 1), the expected clustering coefficient in a control binomial graph.",
        "In a binomial graph, two vertices are linked with probability p. p = k/(N – 1) is chosen so that the expected number of links of the binomial graphs is nk/2 as in the original network.",
        "Assortative mixing is known to be characteristic for social-semiotic, but not for technical networks (Newman, 2003).",
        "Recently, (Mehler, 2006) has shown that this characteristic varies a lot for different document networks and thus allows distinguishing linguistic networks which are homogeneously called 'small-worlds'.",
        "We have excluded on purpose the Pearson correlation coefficient of the degrees at the endpoints of edges that has been used in previous studies (Ferrer i Cancho et al., 2004) due to the statistical problems that this measure has in large networks with power degree distributions (Serrano et al., 2006)."
      ]
    },
    {
      "heading": "3. The treebanks",
      "text": [
        "We analyze seven treebanks each from a different language.",
        "Their features are summarized in Table 1.",
        "A comprehensive description of these and related banks is given by (Kakkonen, 2005).",
        "As explained by Kakkonen, one generally faces the problem of the heterogeneity not only of the annotation schemes, but also of the serialization formats used by them.",
        "Thus, we unified the various formats in order to get a single interface to the analysis of syntactic dependency networks derived thereof.",
        "Although there exists a representation format for syntactic annotations (i.e. TIGER-XML – cf. (Mengel andLez-ius, 2000)) we decided to use the Graph eXchange Language (GXL) in order to solve the heterogeneity problem.",
        "The GXL has been proposed as a uniform format for data interchange (Holt et al., 2006).",
        "It allows representing attributed, directed, undirected, mixed, ordered, hierarchical graphs as well as hyper-graphs.",
        "Its application-dependent attribution model concerns vertices, edges and graphs.",
        "Because of its expressiveness it was utilized in modeling constituency structures (Pustylnikov, 2006) as well as nonlinear document structures (Mehler, 2007b).",
        "We utilize it to map syntactic dependency structures.",
        "Our GXL binding is schematically explained as follows: corpora are mapped onto graphs which serialize graph models of sentence-related dependency structures.",
        "Each of these structures is mapped as a forest whose directed edges are mapped by means of the GXL's edge model.",
        "This model preserves the orientation of the input dependency relations.",
        "Figure 1 visualizes a sample dependency tree of the Slovene dependency treebank (Dzeroski et al., 2006).",
        "Figure 1: Visualization of a sample sentence of the Slovene dependency treebank (Dzeroski et al., 2006) based on its reconstruction in terms of the GXL."
      ]
    },
    {
      "heading": "4. Results",
      "text": [
        "A summary of the network measures obtained on the seven corpora is shown in Table 2.",
        "We find that c » cbinom indicating a clear tendency of vertices connected to be connected if they are linked to the same vertex.",
        "Since the Italian and the Romanian corpus are Romanic languages and the size of their networks is similar, they are paired in the figures.",
        "Figure 2 shows that the clustering c(k) decreases as k increases.",
        "Figure 3 shows that knn(k) decreases as k increases, indicating the presence ofdisassortative mixing when forming links, i.e. links tend to combine vertices of dissimilar degrees.",
        "For sufficiently large k the curves suggest a power-law behavior, i.e.",
        "knn(k) ~ k-n."
      ]
    },
    {
      "heading": "5. Discussion",
      "text": [
        "We have found that the behavior of knn(k) suggests knn(k) ~ kn for sufficiently large k. A power-law behavior has been found in technical systems (Serrano et al., 2006).",
        "In a linguistic context, a power-law like behavior with two regimes has been found in the word adjacency network examined in (Ma-succi and Rodgers, 2006).",
        "A decreasing knn(k) for growing k (an indicator of dissortative mixing) has been found in biological and social systems (Serrano et al., 2006).",
        "A decreasing c(k) for growing k has been found in many non-linguistic systems (e.g. the Internet map at the autonomous system level), and also in a preliminary study of Czech and German syntactic dependency networks (Ferrer i Cancho et al., 2004).",
        "(Ravasz and Barabasi, 2003) suggest that this behavior indicates the existence of a hierarchical network organization (Ravasz and Barabasi, 2003).",
        "In our case this may indicate the existence of a core vocabulary surrounded by more and more special vocabularies.",
        "This observation is in accordance with a multipart organization of the rank frequency distribution of the lexical units involved.",
        "But this stratification is not simply due to the words' collocation patterns, but to their behavior in syntactic dependency structures.",
        "We have also found that c ~> curiam, which is a common feature of non-linguistic (Newman, 2003) and linguistic networks (Mehler, 2007a) and, thus, is not very informative.",
        "In sum, we have seen that GSDNs follow a common pattern of statistical correlations regardless of the heterogeneity of the languages and annotation criteria used.",
        "This suggests that the structure of GSDNs may originate from language independent principles.",
        "Since the correlational properties of GS-DNs are not unique to these networks, our findings suggest that these principles may also be common to certain non-linguistic systems.",
        "Thus, in order to make GSDNs distinguishable in terms of their characteristics, finding more expressive network coeffi-",
        "Figure 3: knn (k)/k, the normalized mean degree of the nearest neighbors of vertices of degree k. (a) Danish, (b) Dutch, (c) Russian, (d) Slovene, (e) Swedish and (f) Italian (black) and Romanian (gray).",
        "Table 1: Summary of the features of the treebanks used in this study.",
        "Besides the name, language and version of the corpus we indicate its size in terms of the number of nuclei tokens in the treebank.",
        "We also indicate if punctuation marks are treated as vertices of the syntactic structure of sentencess or not.",
        "Table 2: Summary of the properties of the GSDNs analyzed.",
        "N is the number of vertices, k is the mean degree, c is the mean clustering coefficient, cbiraom is the clustering coefficient of the control binomial graph.",
        "cients is needed.",
        "A possible track could be considering the weight of a link, which is known to provide a more accurate description of the architecture of complex networks (Barrat et al., 2004).",
        "Acknowledgement",
        "We are grateful to Tomaz Erjavec for the opportunity to analyze a sample of the Slovene Dependency Treebank (http://nl.ijs.si/sdt/).",
        "ADG and RFC's work was funded by the projects FIS2006-13321-C02 and BFM2003-08258-C02-02 of the Spanish Ministry of Education and Science.",
        "AM and OP's work is supported by the SFB 673 Alignment in Communication (http:// ariadne.coli.uni-bielefeld.de/sfb/) funded by the German Research Foundation (DFG).",
        "Treebank",
        "Language",
        "Size (#nuclei)",
        "Marks included",
        "Reference",
        "Alpino Treebank v. 1.2",
        "Dutch",
        "195.069",
        "yes",
        "(van der Beek et al., 2002)",
        "Danish Dependency Treebank v. 1.0",
        "Danish",
        "100.008",
        "yes",
        "(Kromann, 2003)",
        "Sample of sentences of the Dependency Grammar Annotator",
        "Romanian",
        "36.150",
        "no",
        "http://www.phobos.ro/ roric/DGA/dga.html",
        "Russian National Corpus",
        "Russian",
        "253.734",
        "no",
        "(Boguslavsky et al., 2002)",
        "A sample of the Slovene Dependency Treebank v. 0.4",
        "Slovene",
        "36.554",
        "yes",
        "(Dzeroski et al., 2006)",
        "Talkbanken05 v. 1.1",
        "Swedish",
        "342.170",
        "yes",
        "(Nivre et al., 2006)",
        "Turin University Treebank v. 0.1",
        "Italian",
        "44.721",
        "no",
        "(Bosco et al., 2000)",
        "Language",
        "N",
        "k",
        "c",
        "Cbinom",
        "Alpino Treebank v. 1.2",
        "28491",
        "8.1",
        "0.24",
        "0.00028",
        "Danish Dependency Treebank v. 1.0",
        "19136",
        "5.7",
        "0.20",
        "0.00030",
        "Dependency Grammar Annotator",
        "8867",
        "5.3",
        "0.093",
        "0.00060",
        "Russian National Corpus",
        "58285",
        "6.1",
        "0.088",
        "0.00010",
        "Slovene Dependency Treebank v. 0.4",
        "8354",
        "5.3",
        "0.12",
        "0.00064",
        "Talkbanken05 v. 1.1",
        "25037",
        "10.5",
        "0.27",
        "0.00042",
        "Turin University Treebank v. 0.1",
        "8001",
        "6.9",
        "0.18",
        "0.00086"
      ]
    }
  ]
}
