{
  "info": {
    "authors": [
      "Pengyuan Liu",
      "Tiejun Zhao",
      "Muyun Yang"
    ],
    "book": "Fourth International Workshop on Semantic Evaluations (SemEval-2007)",
    "id": "acl-W07-2035",
    "title": "HIT-WSD: Using Search Engine for Multilingual Chinese-English Lexical Sample Task",
    "url": "https://aclweb.org/anthology/W07-2035",
    "year": 2007
  },
  "references": [
    "acl-J03-3006",
    "acl-P06-1057",
    "acl-W02-0816"
  ],
  "sections": [
    {
      "text": [
        "Proceedings of the 4th International Workshop on Semantic Evaluations (SemEval-2007), pages 169?172, Prague, June 2007. c?2007 Association for Computational Linguistics HIT-WSD: Using Search Engine for Multilingual Chinese-English"
      ]
    },
    {
      "heading": "Abstract",
      "text": [
        "We have participated in the Multilingual Chinese-English Lexical Sample Task of SemEval-2007.",
        "Our system disambiguates senses of Chinese words and finds the correct translation in English by using the web as WSD knowledge source.",
        "Since all the statistic data is obtained from search engine, the method is considered to be unsupervised and does not require any sense-tagged corpus."
      ]
    },
    {
      "heading": "1 Introduction",
      "text": [
        "Due to the lack of sense tagged corpora (and the difficulty of manually creating them), the unsupervised method tries to avoid, or at least to reduce, the knowledge acquisition problem, which the supervised methods have to deal with.",
        "In order to tackle the problem of the knowledge acquisition bottleneck, we adopted an unsupervised approach based on search engine, which does not require any sense tagged corpus.",
        "The majority of methods using the Web often try to automatically generate sense tagged corpora (Agirre and Martinez 2000;Agirre and Martinez 2004;Gonzalo et al. 2003; Mihalcea and Moldovan 1999;Santamaria et al. 2003).",
        "In this paper, we experiment with our initial attempt on another research trend that uses the Web not for extracting training samples but helping disambiguate directly during the translation selection process.",
        "The approach we present here is inspired by (Mihalcea and Moldovan 1999;Brill 2003; Rosso et al. 2005; Dagan et al. 2006; McCarthy 2002).",
        "Suppose that source ambiguous words are apt to appear with its target translation on bilingual web pages either parallel or non-parallel.",
        "Instead of searching the source language or target language respectively on web, we try to let the search engine think in a bilingual style.",
        "First, our system gets the co-occurrence information of Chinese context and its corresponding English context.",
        "Then it computes association measurements of Chinese context and English context in 4 kinds of way.",
        "Finally, it selects the correct English translation by computing the association measurements.",
        "In view that this is the first international standard evaluation to predict the correct English translation for ambiguous Chinese word, we built HIT-WSD system as our first attempt on disambiguation by using bilingual web search and just want to testify validity of our method."
      ]
    },
    {
      "heading": "2 HIT-WSD System 2.1 Disambiguation Process",
      "text": [
        "HIT-WSD system disambiguates senses of Chinese target ambiguous word and finds the correct translation in English by searching bilingual information on the web.",
        "Figure 1 gives the flowchart of our proposed approach.",
        "Given an ambiguous word with a Chinese sentence, we easily create its Chinese context.",
        "English context can be acquired from a Chinese-English dictionary and the translation mapping set(offered by the"
      ]
    },
    {
      "heading": "Multilingual Chinese-English Lexical Sample",
      "text": [
        "Task).",
        "System puts Chinese context and English context as queries on search engine individually and collectively.",
        "After this step, frequency and co-occurrence frequency of Chinese context and English",
        "context will be found.",
        "Finally, our system selects the most probable English translation by computing association measurements.",
        "Figure 2 gives an example of how the proposed approach selects English translations of the Chinese ambiguous word ???/dongyao?",
        "given the sentence and its translation mapping set.",
        "This instance comes from the training data of Multilingual Chinese-English Lexical Sample Task of Semeval2007.",
        "According to the translation mapping set, Chinese target word ???",
        "/dongyao?",
        "has two English Translations: shake and vacillate.",
        "English Context Candidates set is the translations set of the Chinese context.",
        "System uses translation mapping set to translate Chinese target ambiguous word and uses an Chinese-English dictionary to translate other words in Chinese context.",
        "English Context Candidates set could be any combination of translations and each combination could be selected as the English context.",
        "After getting the Chinese context and English context, we put them as queries to search engine and extract page counts (which can be considered as frequency) which search engine returned.",
        "We not only search Chinese context and English context individually, but also put them together to search engine.",
        "Association measurements: the Dice coefficient, point-wise mutual information, Log Likelihood score and?",
        "P2 P score are computed in the third phase while we got all kinds of statistic results from search engine.",
        "Finally, we determine the translation by simply computing the association measurements",
        "Shake, shake is, not shake, line shake?/vacillate, not vacillate, vacillate is, line vacillate?"
      ]
    },
    {
      "heading": "2.2 Experiment Settings",
      "text": [
        "Although the Chinese context can be represented with local features, topic features, parts of speech and so on, we use sentence segment as Chinese context in our experiment system.",
        "The sentence segment is a window size ?",
        "n segment of the sentence including the ambiguous words.",
        "English Context Candidates set could be any combination of the translation of words appearing in Chinese context.",
        "In our experiment system, we just choose the translation of the Chinese target ambiguous words in the translation mapping set as English context.",
        "We choose googleTP 1 PT and baiduTP 2 PT as our search engine, for they are both most widely used for English and Chinese language respectively.",
        "Putting Chinese context and English context as queries to the search engine, we will get corresponding page counts it returned as figure 2 shows.",
        "Four statistical measurements were used in order to measure the degree of association of Chinese"
      ]
    },
    {
      "heading": "Lexical Sample Task",
      "text": [
        "a: all counts of the web pages which include Both CC and EC.",
        "b: all counts of the web pages which include CC, do not include EC.",
        "c: all counts of the web pages which include EC, do not include CC.",
        "d: all counts of the web pages which include neither CC and EC.",
        "n= a+ b+ c + d We applied our method to the training data of"
      ]
    },
    {
      "heading": "Multilingual Chinese-English Lexical Sample Task.",
      "text": [
        "The results are as showed in Table 1.",
        "Since only one test result can be uploaded for one system, our system selects the settings of one of the best results.",
        "The final settings of our system is: window size is [-1, +2], the search engine is baidu and the association measurement is Point-wise mutual information."
      ]
    },
    {
      "heading": "3 Official Results",
      "text": [
        "In multilingual Chinese-English lexical sample task of SemEval-2007, there are 2686 instances in training data for 40 Chinese ambiguous words.",
        "All these ambiguous words are either nouns or verbs.",
        "Test data consist of 935 untagged instances of the same target words.",
        "The official result of our system in multilingual Chinese-English lexical sample task is reported as in Table 2."
      ]
    },
    {
      "heading": "4 Conclusions",
      "text": [
        "In SemEval-2007, we participated in Multilingual Chinese-English Lexical Sample Task with a fully unsupervised system based on bilingual web search.",
        "Our initial experiment result shows that our system fails to reach MFS (Most Familiar Sense) baseline due to our method is too simple where search queries are formed (just uses simple context window and English target translation).",
        "Our approach is the first attempt so far as we know on using bilingual web search for translation selection directly.",
        "The system is very simple but seemed to achieve a not bad performance when considered the performance of fully unsupervised systems in SENSEVAL-2, SENSEVAL 3 English tasks.",
        "For future research, we will investigate the dependency of bilingual documents, optimize the search queries, filter out potential noises and combine the different results in order to devise an improved method that can utilize bilingual web search better."
      ]
    }
  ]
}
