{
  "info": {
    "authors": [
      "Peter Clark",
      "Philip Harrison",
      "John Thompson",
      "William R. Murray",
      "Jerry R. Hobbs",
      "Christiane Fellbaum"
    ],
    "book": "ACL-PASCAL Workshop on Textual Entailment and Paraphrasing",
    "id": "acl-W07-1409",
    "title": "On the Role of Lexical and World Knowledge in RTE3",
    "url": "https://aclweb.org/anthology/W07-1409",
    "year": 2007
  },
  "references": [
    "acl-J91-1003",
    "acl-P98-1013"
  ],
  "sections": [
    {
      "text": [
        "Peter Clark, William R. Murray, John Thompson, Phil Harrison, Jerry Hobbs, Christiane Fellbaum",
        "To score well in RTE3, and even more so to create good justifications for entailments, substantial lexical and world knowledge is needed.",
        "With this in mind, we present an analysis of a sample of the RTE3 positive entailment pairs, to identify where and what kinds of world knowledge are needed to fully identify and justify the entailment, and discuss several existing resources and their capacity for supplying that knowledge.",
        "We also briefly sketch the path we are following to build an RTE system (Our implementation is very preliminary, scoring 50.9% at the time of RTE).",
        "The contribution of this paper is thus a framework for discussing the knowledge requirements posed by RTE and some exploration of how these requirements can be met."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The Pascal RTE site defines entailment between two texts T and H as holding \"if, typically, a human reading T would infer that H is most likely true\" assuming \"common human understanding of language as well as common background knowledge.\"",
        "While a few RTE3 entailments can be recognized using simple syntactic matching, the majority rely on significant amounts of this \"common human understanding\" of lexical and world knowledge.",
        "Our goal in this paper is to analyze what that knowledge is, create a preliminary framework for it, and explore a few available sources for it.",
        "In the short term, such knowledge can be (and has been) used to drive semantic matching of the T and H dependency/parse trees and their semantic representations, as many prior RTE systems perform, e.g., (Hickl et al., 2006).",
        "In the long term, computers should be able to perform deep language understanding to build a computational model of the scenario being described in T, to reason about the entailment, answer further questions, and create meaningful justifications.",
        "With this longer term goal in mind, it is useful to explore the types of knowledge required.",
        "It also gives a snapshot of the kinds of challenges that RTE3 poses.",
        "The scope of this paper is to examine the underlying lexical/world knowledge requirements of RTE, rather than the more syntactic/grammatical issues of parsing, coreference resolution, named entity recognition, punctuation, coordination, typographical errors, etc.",
        "Although there is a somewhat blurry line between the two, this separation is useful for bounding the analysis.",
        "It should be noted that the more syntactic issues are themselves vast in RTE, but here we will not delve into them.",
        "Instead, we will perform a thought experiment in which they have been handled correctly."
      ]
    },
    {
      "heading": "2. Analysis",
      "text": [
        "Based on an analysis of 100 (25%) of the positive entailments in the RTE3 test set, we have divided the knowledge requirements into several rough categories, which we now present.",
        "We then summarize the frequency with which examples in this sample fell into these categories.",
        "The examples below are fragments of the original test questions, abbreviated and occasionally simplified.",
        "In a few cases, entailment can be identified by syntactic matching of T and H, for example:",
        "Other examples include 299, 489, and 456.",
        "In some cases, the syntactic matching can be very complex, e.g., examples 152, 724.",
        "Synonymy is often needed to recognize entailment,",
        "Other examples include 286 (\"dismiss\"/\"throw out\"), 37 (\"begin\"/\"start\"), 236 (\"wildfire\"/\"bush fire\"), and, arguably, 462 (\"revenue\"/\"proceeds\").",
        "Similarly, subsumption (generalization) relationships between word senses need to be recognized (whether or not a fixed set of senses are used), eg.",
        "Others include 178 (\"succumbed\" as a kind of \"killed\"), and 453 (\"take over\" as a kind of \"buy\").",
        "Sometimes a noun in a compound can be dropped:",
        "Other examples include 269 (\"increasing prevalence of\" – \"increasing\"), 604 (\"mini-mill process\" – \"mini-mill\"), and (at the phrase level) 668 (\"all segments of the public\" – \"the public\").",
        "Often derivationally related nouns and verbs occur in the pairs.",
        "To identify and justify the entailment, the relationship and its nature is needed, as in:",
        "Other examples include 286 (\"pirated\", \"piracy\"), and 75 (\"invent\", \"invention\").",
        "In some cases, the deverbal noun denotes the verb's event, in other cases it denotes one of the verb's arguments (e.g., \"winner\" as the subject/agent of a \"win\" event).",
        "Some examples require inferring the semantic relation between nouns in a compound, e.g., 168 \"Sirius CEO Karmazin\" – \"Karmazin is an executive of Sirius\" 583 \"physicist Hawking\" – \"Hawking is a physicist\"",
        "In some cases this is straightforward, others require more detailed knowledge of the entities involved.",
        "Although there is somewhat of a fuzzy boundary between word and world knowledge, we draw this distinction here.",
        "Some examples of RTE pairs which require knowing word meanings are:",
        "The second example is particularly interesting as many readers (and computers) will not have encountered the word \"coeliacs\" before, yet a person can reasonably infer its meaning on the fly from context and morphology - something challenging for a machine to do.",
        "Definitions of compound nouns are also sometimes needed, e.g., \"family planning\" (612) and \"cough syrup\" (80).",
        "A large number of RTE pairs require non-definitional knowledge about the way the world (usually) is, e.g.,:",
        "273 \"bears kill people\" – \"bears attack people\"",
        "People recognize this entailment as they know (have heard about) how people might be killed by a bear, and hence can justify why the entailment is valid.",
        "(They know that the first step in the bear killing a person is for the bear to attack that person.)",
        "Some other examples are:",
        "705 \"under a contract with\" – \"cooperates with\" 721 \"worked on the law\" – \"discussed the law\" 731 \"cut tracts of forest\" – \"cut trees in the forest\" 732 \"establishing tree farms\"",
        " – \"trees were planted\" 639 \"Xs plans for reorganizing\" – \"X intends to reorganize\"",
        "328 \"the diets must be followed by <person>\" – \"the diets are for <person>\" 722 X and Y vote for Z – X and Y agree to Z.",
        "All these cases appeal to a person's world knowledge concerning the situation being described.",
        "In addition to this more specific knowledge of the world, some RTE examples appeal to more general, fundamental knowledge (e.g., space, time, plans, goals).",
        "For example appeals to a basic rule of set inclusion, and 10 (a negative entailment: \"unsuccessfully sought election\" – not elected) appeals to core notions of goals and achievement.",
        "Several examples appeal to core spatial knowledge, e.g.:",
        "491 appeals to regional inclusion (if X location Y, and Y is in Z, then X location Z), and 178 appeals to colocation (if X is at Y, and X physically interacts with Z, then Z is at Y).",
        "Other spatial examples include 236 (\"around Sydney\" – \"near Sydney\"), and 129 (\"invasion of\" – \"arrived in\").",
        "Although loosely delineated, another category of world knowledge concerns stereotypical places, situations and the events which occur in them, with various representational schemes proposed in the AI literature, e.g., Frames (Minsky 1985), Scripts (Schank 1983).",
        "Some RTE examples require recognizing the implicit scenario (\"frame\", \"script\", etc.)",
        "which T describes to confirm the new facts or relationships introduced in H are valid.",
        "A first example is:",
        "A person recognizes H as entailed by T because he/she knows the \"script\" for letter bombing, which includes sending the bomb in the mail.",
        "Thus a person could also recognize alternative verbs in 358.H as valid (e.g., \"mailed\", \"delivered\") or invalid (e.g., \"thrown at\", \"dropped on\"), even though these verbs are all strongly associated with words in T. For a computer to fully explain the entailment, it would need similar knowledge.",
        "As a second example, consider:",
        "Again, this requires knowing about trials: That they involve charges, a defendant, an accusation, etc., in order to validate H as an entailed expansion of T. In this example, there is also a second twist to it as the noun phrase in 538.T equally supports the hypothesis \"O. J. Simpson was murdered.\"",
        "(e.g., consider replacing \"O.",
        "J.\"",
        "with \"Nicole\").",
        "It is only a reference elsewhere in the T sentence to \"Simpson's attorneys\" that suggests Simpson is still alive, and hence couldn't have been the victim, and hence must be the accused, that clarifies 538.H as being correct, a highly complex chain of reasoning.",
        "As a third example, consider: 736.T \"In a security fraud case, Milken was sentenced to 10 years in prison.\"",
        "736.H \"Milken was imprisoned for security fraud.\"",
        "This example is particularly interesting, as one needs to recognize security fraud as Milken's crime, a connection which not stated in T. A human reader will recognize the notion of sentencing, and thus expect to see a convict and his/her crime, and hence can align these expectations with T, validating H. Thus again, deep knowledge of sentencing is needed to understand and justify the entailment.",
        "Some other examples requiring world knowledge to validate their expansions, include 623 (\"narcotics-sniffing dogs\" – \"dogs are used to sniff out narcotics\"), and 11 (\"the Nintendo release of the game\" – \"the game is produced by Nintendo\").",
        "Some RTE3 examples contain complement-taking verbs that make an implication (either positive or negative) about the complement.",
        "For example:",
        "In the first 3 the implication is positive, but in the last the implication is negative.",
        "(Nairn et al., 2006) provide a detailed analysis of this type of behavior.",
        "In fact, this notion of implicature (one part of a sentence making an implication about another part) extends beyond single verbs, and there are some more complex examples in RTE3, e.g.:",
        "In this last example the implication behavior is quite complex: (loosely) If X reassures Y of Z, then Y is concerned about not-Z.",
        "In some cases, language allows us to replace a word (sense) with a closely related word (sense):",
        "Rules for metonymic transfer, e.g., (Fass 2000), can be used to define which transfers are allowed.",
        "Another example is 723 \".pursue its drive towards X\" – \".pursue X\".",
        "Finally, some RTE pairs rely on understanding idioms, slang, or special protocols used in language, for example:",
        "The phrases in these examples all have special meaning which cannot be easily derived compositionally from their words, and thus require special handling within an entailment system.",
        "Table 1 shows the number of positive entailments in our sample of 100 that fell into the different categories (some fell into several).",
        "While there is a certain subjectivity in the boundaries of the categoTable 1: Frequency of different entailment phenomena from a sample of 100 RTE3 pairs.",
        "ries, the most significant observation is that very few entailments depend purely on syntactic manipulation and simple lexical knowledge (synonyms, hypernyms), and that the vast majority of entailments require significant world knowledge, highlighting one of the biggest challenges of RTE.",
        "In addition, the category of general world knowledge -- small, non-definitional facts about the way the world (usually) is -- is the largest, suggesting that harvesting and using this kind of knowledge should continue to be a priority for improving performance on RTE-style tasks."
      ]
    },
    {
      "heading": "3. Sources of World Knowledge",
      "text": [
        "While there are many potential sources of the knowledge that we have identified, we describe three in a bit more detail and how they relate to the earlier analysis.",
        "WordNet (Fellbaum, 1998) is one of the most extensively used resources in RTE already and in computational linguistics in general.",
        "Despite some well-known problems, it provides broad coverage of several key relationships between word senses (and words), in particular for synonyms, hy-pernyms (generalizations), meronyms (parts), and semantically (\"morphosemantically\") related forms.",
        "From the preceding analysis, WordNet does contain the synonyms {\"procedure\",\"process\"}, {\"dismiss\",\"throw out\"}, {\"begin\",\"start\"}, but does not contain the compound \"wild fire\" and (strictly correctly) does not contain {\"reve-nue\",\"proceeds\"} as synonyms.",
        "In addition, the three hypernyms mentioned in the earlier analysis are in WordNet.",
        "WordNet also links (via the \"mor-phosemantic\" link) the 3 noun-verb pairs mentioned earlier (win/winner, pirated/piracy, invent/invention) - however it does not currently distinguish the nature of that link (e.g., agent, result, event).",
        "WordNet is currently being expanded to include this information, as part of the AQUAINT program.",
        "Two independently developed versions of the WordNet glosses expressed in logic are also available: Extended WordNet (Moldovan and Rus, 2001) and a version about to be released with WordNet3.0 (again developed under AQUAINT).",
        "These in principle can help with definitional knowledge.",
        "From our earlier analysis, it turns out \"convicted\" is conveniently defined in WordNet as \"pronounced or proved guilty\" potentially bridging the gap for pair 667, although there are problems with the logical interpretation of this particular gloss in both resources mentioned.",
        "WordNet does have \"coeliac\", but not in the sense of a person with coeliac disease.",
        "In addition, several existing \"core theories\" (e.g., TimeML, IKRIS) that can supply some of the fundamental knowledge mentioned earlier (e.g., space, time, goals) are being connected to WordNet under the AQUAINT program.",
        "Paraphrases have been used successfully by several RTE systems (e.g., Hickl et al., 2005).",
        "With respect to our earlier analysis, we examined Lin and Pantel's (2001) paraphrase database built with their system DIRT, containing 12 million entries.",
        "While there is of course noise in the database, it contains a remarkable amount of sensible world knowledge as well as syntactic rewrites, albeit encoded as shallow rules lacking word senses.",
        "Looking at the examples from our earlier analysis of general world knowledge, we find that three are supported by paraphrase rules in the database:",
        "And one that could be is not, namely:",
        "705: X is under a contract with Y – X cooperates with Y (not in the database)",
        "Other examples are outside the scope of DIRT's approach (i.e., \"X pattern: Y\" – \"X pattern2 Y\"), but nonetheless the coverage is encouraging.",
        "In our earlier analysis, we identified knowledge about stereotypical situations and their events as important for RTE.",
        "FrameNet (Baker et al., 1998) attempts to encode this knowledge.",
        "FrameNet was used with some success in RTE2 by Burchardt and Frank (2005).",
        "FrameNet's basic unit - a Frame - is a script-like conceptual schema that refers to a situation, object, or event along with its participants (Frame Elements), identified independent of their syntactic configuration.",
        "We earlier discussed how 538.T \"...the O. J. Simpson murder trial...\" might entail 538.H \"O. J. Simpson was accused of murder.\"",
        "This case applies to FrameNet's Trial frame, which includes the Frame Elements Defendant and Charges, with Charges being defined as \"The legal label for the crime that the Defendant is accused of.",
        "\", thus stating the relationship between the defendant and the charges, unstated in T but made explicit in H, validating the entailment.",
        "However, the lexical units instantiating the Frame Elements are not yet disambiguated against a lexical database, limiting full semantic understanding.",
        "Moreover, FrameNet's world knowledge is stated informally in English descriptions, though it may be possible to convert these to a more machine-processable form either manually or automatically.",
        "We have drawn attention to these three resources as they provide some answers to the requirements identified earlier.",
        "Several other publicly available resources could also be of use, including VerbNet (Univ Colorado at Boulder), the Component Library (Univ Texas at Austin), OpenCyc (Cycorp), SUMO, Stanford's additions to WordNet, and the Tuple Database (Boeing, following Schubert's 2002 approach), to name but a few."
      ]
    },
    {
      "heading": "4. Sketch of our RTE System",
      "text": [
        "Although not the primary purpose of this paper, we briefly sketch the path we are following to build an RTE system able to exploit the above resources.",
        "Our implementation is very preliminary, scoring 50.9% at the time of RTE and 52.6% now (55.0% on the 525 examples it is able to analyze, guessing \"no entailment\" for the remainder).",
        "Nevertheless, the following shows the direction we are moving in",
        "Like several other groups, our basic approach is to generate logic for the T and H sentences, and then explore the application of inference rules to elaborate T, or transform H, until H matches T. Parsing is done using a broad coverage chart parser.",
        "Subsequently, an abstracted form of the parse tree is converted into a logical form, for example:",
        "299.H \"Tropical storms cause severe damage.\"",
        "sobject(_Cause1, _Damage1) input-word(_Storm1, \"storm\", noun) [same for other words]",
        "Entailment is determined if every clause in the semantic representation of H semantically matches (subsumes) some clause in T. Two variables in a clause match if their input words are the same, or some WordNet sense of one is the same as or a hypernym of the other.",
        "In addition, the system searches for DIRT paraphrase rules that can transform the sentences into a form which can then match.",
        "The explicit use of WordNet and DIRT results in comprehensible, machine-generated justifications when entailments are found, , e.g.,:",
        "We are continuing to develop our system and expand the number of knowledge sources it uses."
      ]
    },
    {
      "heading": "5. Summary",
      "text": [
        "To recognize and justify textual entailments, and ultimately understand language, considerable lexical and world knowledge is needed.",
        "We have presented an analysis of some of the knowledge requirements of RTE3, and commented on some available sources of that knowledge.",
        "The analysis serves to highlight the depth and variety of knowledge demanded by RTE3, and contributes a rough framework for organizing these requirements.",
        "Ultimately, to fully understand language, extensive knowledge of the world (either manually or automatically acquired) is needed.",
        "From this analysis, RTE3 is clearly providing a powerful driving force for research in this direction."
      ]
    },
    {
      "heading": "Acknowledgements",
      "text": [
        "This work was performed under the DTO AQUAINT program, contract N61339-06-C-0160."
      ]
    }
  ]
}
