{
  "info": {
    "authors": [
      "Qin Iris Wang"
    ],
    "book": "NAACL-HLT 2007 Doctoral Consortium",
    "id": "acl-N07-3002",
    "title": "Learning Structured Classifiers for Statistical Dependency Parsing",
    "url": "https://aclweb.org/anthology/N07-3002",
    "year": 2007
  },
  "references": [
    "acl-A00-2018",
    "acl-C96-1058",
    "acl-E06-1011",
    "acl-J04-4004",
    "acl-N06-1021",
    "acl-P05-1012",
    "acl-P93-1024",
    "acl-P95-1037",
    "acl-P97-1003",
    "acl-P98-2127",
    "acl-W04-3201",
    "acl-W04-3202",
    "acl-W05-1516",
    "acl-W06-1615",
    "acl-W06-2904"
  ],
  "sections": [
    {
      "text": [
        "Learning Structured Classiiers for Statistical Dependency Parsing",
        "wqin@cs.ualberta.",
        "ca",
        "My research is focused on developing machine learning algorithms for inferring dependency parsers from language data.",
        "By investigating several approaches I have developed a unifying perspective that allows me to share advances between both probabilistic and non-probabilistic methods.",
        "First, I describe a generative technique that uses a strictly lexicalised parsing model, where all the parameters are based on words and do not use any part-of-speech (POS) tags nor grammatical categories.",
        "Then, I incorporate two ideas from probabilistic parsing – word similarity smoothing and local estimation – to improve the large margin approach.",
        "Finally, I present a simpler and more efficient approach to training dependency parsers by applying a boosting-like procedure to standard training methods."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Over the past decade, there has been tremendous progress on learning parsing models from treebank data (Magerman, 1995; Collins, 1999; Charniak, 1997; Ratnaparkhi, 1999; Charniak, 2000; Wang et al., 2005; McDonald et al., 2005).",
        "Most of the early work in this area was based on postulating generative probability models of language that included parse structures (Magerman, 1995; Collins, 1997; Charniak, 1997).",
        "Learning in this context consisted of estimating the parameters of the model with simple likelihood based techniques, but incorporating various smoothing and back-off estimation tricks to cope with the sparse data problems (Collins, 1997; Bikel, 2004).",
        "Subsequent research began to focus more on conditional models of parse structure given the input sentence, which allowed discriminative training techniques such as maximum conditional likelihood (i.e. \"maximum entropy\") to be applied (Ratnaparkhi, 1999; Charniak, 2000).",
        "Currently, the work on conditional parsing models appears to have culminated in large margin training approaches (Taskar et al., 2004; McDonald et al., 2005), which demonstrates the state of the art performance in English dependency parsing.",
        "Despite the realization that maximum margin training is closely related to maximum conditional likelihood for conditional models (McDonald et al., 2005), a sufficiently unified view has not yet been achieved that permits the easy exchange of improvements between the probabilistic and non-probabilistic approaches.",
        "For example, smoothing methods have played a central role in probabilistic approaches (Collins, 1997; Wang et al., 2005), and yet they are not being used in current large margin training algorithms.",
        "Another unexploited connection is that probabilistic approaches pay closer attention to the individual errors made by each component of a parse, whereas the training error minimized in the large margin approach – the \"structured margin loss\" (McDonald et al., 2005) – is a coarse measure that only assesses the total error of an entire parse rather than focusing on the error of any particular component.",
        "I have addressed both of these issues, as well as others in my work."
      ]
    },
    {
      "heading": "2. Dependency Parsing Model",
      "text": [
        "Given a sentence W = (wi,w„), I consider the problem of computing an accurate directed dependency tree, T, over W. Note that T consists of ordered pairs of words in such that each word appears in at least one pair and each word has in-degree at most one.",
        "Dependency trees are usually assumed to be projective (no crossing arcs), which means that if there is an arc , then is an ancestor of all the words between to, and Wj.",
        "Let denote the set of all the directed, projective trees that span .",
        "From an input sentence , one would like to be able to compute the best parse; that is, a projective tree, T € $(W), that obtains the highest \"score\".",
        "In particular, I follow Eisner (1996) and McDonald et al.",
        "(2005) and assume that the score of a complete spanning tree for a given sentence, whether probabilistically motivated or not, can be decomposed as a sum of local scores for each link (a word pair).",
        "In which case, the parsing problem reduces to where the score s(w« --> Wj) can depend on any measurable property of and within the tree T. This formulation is sufficiently general to capture most dependency parsing models, including probabilistic dependency models (Wang et al., 2005; Eisner, 1996) as well as non-probabilistic models (McDonald et al., 2005; Wang et al., 2006).",
        "For the purpose of learning, the score of each link can be expressed as a weighted linear combination of features where are the weight parameters to be estimated during training."
      ]
    },
    {
      "heading": "3. Lexicalised Dependency Parsing",
      "text": [
        "To learn an accurate dependency parser from data, the first approach I investigated is based on a strictly lexical parsing model where all the parameters are based on words (Wang et al., 2005).",
        "The advantage of this approach is that it does not rely on part-of-speech tags nor grammatical categories.",
        "Furthermore, I based training on maximizing the conditional probability of a parse tree given a sentence, unlike most previous generative models (Magerman, 1995; Collins, 1997; Charniak, 1997), which focus on maximizing the joint probability of the parse tree and the sentence.",
        "An efficient training algorithm can be achieved by maximizing the conditional probability of each parsing decision, hence minimizing a loss based on each local link decision independently.",
        "Importantly, interdependence between links can still be accommodated by exploiting dynamic features in training – features that take into account the labels of (some) of the surrounding components when predicting the label of a target component.",
        "To cope with the sparse data problem, I use distributional word similarity (Pereira et al., 1993; Grefenstette, 1994; Lin, 1998) to generalize the observed frequency counts in the training corpus.",
        "The experimental results on the Chinese Treebank 4.0 show that the accuracy of the conditional model is 13.6% higher than corresponding joint models, while similarity smoothing also allows the strictly lexicalised approach to outperform corresponding models based on part-of-speech tags."
      ]
    },
    {
      "heading": "4. Extensions to Large Margin Parsing",
      "text": [
        "The approach presented above has a limitation: it uses a local scoring function instead of a global scoring function to compute the score for a candidate tree.",
        "The structured large margin approach, on the other hand, uses a global scoring function by minimizing a training loss – the \"structured margin loss\" (McDonald et al., 2005) – which is directly coordinated with the global tree.",
        "However, the training error minimized in the large margin approach is a coarse measure that only assesses the total error of an entire parse rather than focusing on the error of any particular component.",
        "Also, smoothing methods, which have been widely used in probabilistic approaches, are not currently being used in large margin training algorithms.",
        "In the second approach, I improve structured large margin training for parsing in two ways (Wang et al., 2006).",
        "First, I incorporate local constraints that enforce the correctness of each individual link, rather than just scoring the global parse tree.",
        "Second, to cope with sparse data and generalize to unseen words, I smooth the lexical parameters according to their underlying word similarities.",
        "To smooth parameters in the large margin framework, I introduce the technique of Laplacian regularization in large margin parsing.",
        "Finally, to demonstrate the benefits of my approach, I reconsider the problem of parsing Chinese treebank data using only lexical features, as in Section 3.",
        "My results improve current large margin approaches and show that similarity smoothing combined with local constraint enforcement leads to state of the art performance, while only requiring word-based features that do not rely on part-of-speech tags nor grammatical categories in any way."
      ]
    },
    {
      "heading": "5. Training via Structured Boosting",
      "text": [
        "Finally, I have recently demonstrated the somewhat surprising result that state of the art dependency parsing performance can be achieved through the use of conventional, local classification methods.",
        "In particular, I show how a simple form of structured boosting can be used to improve the training of standard local classification methods, in the context of structured predictions, without modifying the underlying training method (Wang et al., 2007).",
        "The advantage of this approach is that one can use off-the-shelf classification techniques, such as support vector machines or logistic regression, to achieve competitive parsing results with little additional effort.",
        "The idea behind structured boosting is very simple.",
        "To produce an accurate parsing model, one combines the local predictions of multiple weak predictors to obtain a score for each link, which a parser can then use to compute the maximum score tree for a given sentence.",
        "Structured boosting proceeds in rounds.",
        "On each round a local \"link predictor\" is trained merely to predict the existence and orientation of a link between two words given input features encoding context – without worrying about coordinating the predictions in a coherent global parse.",
        "Once a weak predictor is learned, it is added to the ensemble of weak hypotheses, the training corpus is re-parsed using the new predictor, and the local training contexts are re-weighted based on errors made by the parser's output.",
        "Thus, a wrapper approach is used to successively modify the training data so that the training algorithm is encouraged to facilitate improved global parsing accuracy.",
        "* Obtained with Chinese Treebank 4.0 using the data split reported in Wang et al.",
        "(2005).",
        "i Obtained with Chinese Treebank 5.0 using the data split reported in Corston-Olivr et al.",
        "(2006)."
      ]
    },
    {
      "heading": "6. Current Results",
      "text": [
        "Table 1 compares my results with those obtained by other researchers, on both English and Chinese data.",
        "The English results are obtained using the same standard training and test set splits from English Penn Treebank 3.0.",
        "The results on Chinese are obtained on two different data sets, Chinese Treebank 4.0 and Chinese Treebank 5.0 as noted.",
        "Table 1 shows that the results I am able to achieve on English are competitive with the state of the art, but are still behind the best results of (McDonald and Pereira, 2006).",
        "However, perhaps surprisingly, Table 1 also shows that the structured boosting approach actually surpasses state of the art accuracy on Chinese parsing for both treebank collections."
      ]
    },
    {
      "heading": "7. Future Work",
      "text": [
        "Although the three pieces of my work above look very different superficially, they are actually closely related by the \"scoring\" formulation and, more specifically, by the equations introduced in Section 2.",
        "In other words, they all compute a linear classifier.",
        "The only differences among them are: (1) What features are used?",
        "(2) How are the parameters 0 estimated?",
        "Model",
        "Chinese",
        "English",
        "Yamada&Matsumoto 03",
        "-",
        "90.3",
        "Nivre&Scholz 04",
        "-",
        "87.3",
        "Wang et al.",
        "05 (Sec.",
        "3)",
        "79.9*",
        "-",
        "McDonald et al.",
        "05",
        "-",
        "90.9",
        "McDonald&Pereira 06",
        "82.5*",
        "91.5",
        "Corston-Oliver et al.",
        "06",
        "73.3f",
        "90.8",
        "Structured",
        "86.6*",
        "89.3",
        "Boosting (Sec.",
        "5)",
        "77.6f",
        "A general perspective I bring to my investigation is the desire to delineate the effects of domain engineering (choosing good features for representing and learning parsing models) from the general machine learning principles (training criteria, regularization and smoothing techniques) that permit good results.",
        "In fact, combined features have been proved to be useful in dependency parsing with support vector machines (Yamada and Matsumoto, 2003), and I have already obtained some preliminary results on generating useful feature combinations via boosting.",
        "Therefore, I will consider combining all the projects I presented above.",
        "That is, I plan to incorporate all the useful features, the morphological features and the combined features as discussed above, into the training algorithms presented in Section 4 or Section 5, to train a dependency parser globally.",
        "Then I am going to augment the training with the existing smoothing and regularization techniques (as described in Section 4), or new developed ones.",
        "I expect the resulting parser to have better performance than those I have presented above.",
        "There are a lot of other ideas which can be explored in my future work.",
        "First and most important, I plan to investigate new advanced machine learning methods (e.g., structured boosting or unsupervised / semi-supervised algorithms (Xu et al., 2006)) and apply them to the dependency parsing problem generally, since the goal of my research is to learn natural language parsers in an elegant and principled manner.",
        "Next, I am going to apply my approaches to parse other languages, such as Czech, German, Spanish and French, and analyze the performance of my parsers on these different languages.",
        "Furthermore, I plan to apply my parsers in other domains (e.g., biomedical data) (Blitzer et al., 2006) besides treebank data, to investigate the effectiveness and generality of my approaches."
      ]
    }
  ]
}
