{
  "info": {
    "authors": [
      "Kepa Joseba Rodriguez",
      "Stefanie Dipper",
      "Michael Götze",
      "Massimo Poesio",
      "Giuseppe Riccardi",
      "Christian Raymond",
      "Joanna Rabiega-Wisniewska"
    ],
    "book": "Linguistic Annotation Workshop",
    "id": "acl-W07-1524",
    "title": "Standoff Coordination for Multi-Tool Annotation in a Dialogue Corpus",
    "url": "https://aclweb.org/anthology/W07-1524",
    "year": 2007
  },
  "references": [
    "acl-J93-2004",
    "acl-N03-4009",
    "acl-P98-1013",
    "acl-W03-0804",
    "acl-W06-2711"
  ],
  "sections": [
    {
      "text": [
        "Kepa Joseba Rodriguez*, Stefanie Dipper*, Michael Götze*, Massimo PoesioA, Giuseppe Riccardi^, Christian Raymond^, Joanna Wisniewska*",
        "*Piedmont Consortium for Information Systems (CSI-Piemonte) KepaJoseba.Rodriguez@csi .",
        "it * Department of Linguistics.",
        "{dipper jgoetze}@ling .",
        "uni -potsdam.",
        "de ACenter for Mind/Brain Sciences.",
        "massimo.poesioOunitn.it * Department of Information and Communication Technology.",
        "{chri stian.",
        "raymondjriccardi}@dit .unitn.it * Institute of Computer Science.",
        "Polish Academy of Science.",
        "j wi sniewska@poczta.uw.edu.pl",
        "The LUNA corpus is a multi-lingual, multi-domain spoken dialogue corpus currently under development that will be used to develop a robust natural spoken language understanding toolkit for multilingual dialogue services.",
        "The luna corpus will be annotated at multiple levels to include annotations of syntactic, semantic, and discourse information; specialized annotation tools will be used for the annotation at each of these levels.",
        "In order to synchronize these multiple layers of annotation, the Paula standoff exchange format will be used.",
        "In this paper, we present the corpus and its PAULA-based architecture."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "xml standoff markup (Thompson and McKelvie, 1997; Dybkjaer et al., 1998) is emerging as the cleanest way to organize multilevel annotations of corpora.",
        "In many of the current annotation efforts based on standoff a single multi-purpose tool such as the NITE XML Toolkit (Carletta et al., 2003) or Word-Freak (Morton and LaCivita, 2003) is used to annotate as well as maintain all annotation levels (cf. the SAMMIE annotation effort (Kruijff-Korbayova et al., 2006b)).",
        "However, it is often the case that specialized tools are developed to facilitate the annotation of particular levels: examples include tools for segmentation and transcription of the speech signal like PR A AT (Boersma and Weenink, 2005) and Transcriber (Barras et al., 1998), the salsa tools for FrameNet-style annotation (Burchardt et al., 2006), and mm ax (MUller and Strube, 2003) for coreference annotation.",
        "Even in these cases, however, it may still be useful, or even necessary, to be able to visualize more than one level at once, or to 'knit' togethermultiple levels to create a file that can be used to train a model for a particular type of annotation.",
        "The Linguistic Annotation Framework by (Ide et al., 2003) was proposed as a unifying markup format to be used to synchronize heterogeneous markup formats for such purposes.",
        "In this paper, we discuss how the paula representation format, a standoff format inspired by the Linguistic Annotation Framework, is being used to synchronize multiple levels of annotation in the luna corpus, a corpus of spoken dialogues in multiple languages and multiple domains that is being created to support the development of robust spoken language understanding models for multilingual dialogue services.",
        "The corpus is richly annotated with linguistic information that is considered relevant for research on dialogue, including chunks, named entities, argument structure, coreference, and dialogue acts.",
        "We chose to adopt specialized tools for each level: e.g., transcription using Transcriber, coreference using mmax, attributes using Semantizer, etc.",
        "To synchronize the annotation and allow cross-layer operations, the annotations are mapped to a common representation format, paula.",
        "The structure of the paper is as follows.",
        "In Section 2, we present the luna project and the luna corpus with its main annotation levels.",
        "In Section 3, we introduce the paula exchange format, focusing on the representation of time alignment and dialogue phenomena.",
        "Finally we show how paula is used in the luna corpus and discuss alternative formats."
      ]
    },
    {
      "heading": "2. The LUNA project",
      "text": [
        "The aim of the luna project is to advance the state of the art in understanding conversational speech in Spoken Dialogue Systems (Gupta et al., 2005), (Bimbot etal., 2006).",
        "Three aspects of Spoken Language Understanding (SLU) are of particular concern in luna: generation of semantic concept tags, semantic composition into conceptual structures and context sensitive validation using information provided by the dialogue manager.",
        "in order to train and evaluate SLu models, we will create an annotated corpus of spoken dialogues in multiple domains and multiple languages: French, Italian, and Polish.",
        "The luna corpus is currently being collected, with a target to collect 8100 human-machine dialogues and 1000 human-human dialogues in Polish, Italian and French.",
        "The dialogues are collected in the following application domains: stock exchange, hotel reservation and tourism inquiries, customer support service/help-desk and public transportation.",
        "Semantic interpretation involves a number of sub-tasks, ranging from identifying the meaning of individual words to understanding which objects are being referred to up to recovering the relation between different semantic objects in the utterance and discourse level to, finally, understanding the communicative force of an utterance.",
        "In some annotation efforts-e.g., in the annotation of the French media Corpus (Bonneau-Maynard and Rosset, 2003)- information about the meaning of semantic chunks, contextual information about coreference, and information about dialogue acts are all kept in a single file.",
        "This approach however suffers from a number of problems, including the fact that errors introduced during the annotation at one level may make other levels of annotation unusable as well, and that it is not possible for two annotators to work on different types of annotation for the same file at the same time.",
        "Most current annotation efforts, therefore, tend to adopt the 'multilevel' approach pioneered during the development of the maptask corpus and then developed as part of work on the EU-funded mate project (McKelvie et al., 2001), in which each aspect of interpretation is annotated in a separate level, independently maintained.",
        "This approach is being followed, for instance, in the OntoNotes project (Hovy et al., 2006) and the sammie project (Kruijff-Korbayova etal., 2006a).",
        "For the annotation of the luna corpus, we decided to follow the multilevel approach as well.",
        "That allows us to achieve more granularity in the annotation of each of the levels and to investigate more easily dependencies between features that belong to different levels.",
        "Furthermore, we can use different specialized off-the-shelf annotation tools, splitting up the annotation task and thus facilitating consistent annotation.",
        "The luna corpus will contain different types of information.",
        "The first levels are necessary to prepare the corpus for subsequent semantic annotation, and include segmentation of the corpus in dialogue turns, transcription of the speech signal, and syntactic preprocessing with POS-tagging and shallow parsing.",
        "The next level consists of the annotation of domain information using attribute-value pairs.",
        "This annotation will be performed on all dialogues in the corpus.",
        "The other levels of the annotation scheme are not mandatory, but at least a part of the dialogues will be annotated in order to investigate contextual aspects of the semantic interpretation.",
        "These levels include the predicate structure, the relations between referring expressions, and the annotation of dialogue acts.",
        "Before transcription and annotation can begin, it is necessary to segment the speech signal into dialogue turns and annotate them with speaker identity and mark where speaker overlap occurs.",
        "The goal of this segmentation is to be able to perform a transcription and annotation of the dialogue turns with or without dialogue context.",
        "While dialogue context is preferable for semantic annotation, it slows down the annotation process.",
        "The tool we will use for the segmentation and transcription of the speech signal is the open source tool Transcriber (Barras et al., 1998).",
        "The next step is the transcription of the speech signal, using conventions for the orthographic transcription and for the annotation of non-linguistic acoustic events.",
        "The transcribed material will be annotated with POS-tags, morphosyntactic information like agreement features, and segmented based on syntactic constituency.",
        "For the POS-tags and morphosyntactic features, we will follow the recommendations made in eagles (EAGLES, 1996), which allows us to have a unified representation format for the corpus, independently of the tools used for each language.",
        "At this level, semantic segments will be annotated following an approach used for the annotation for the French media dialogue corpus (Bonneau-Maynard and Rosset, 2003).",
        "We specify the domain knowledge in domain ontologies.",
        "These are used to build domain-specific dictionaries.",
        "Each dictionary contains:",
        "• Concepts corresponding to classes of the ontology and attributes of the annotation.",
        "• Values corresponding to the individuals of the domain.",
        "• constraints on the admissible values for each concept.",
        "The concept dictionaries are used to annotate semantic segments with attribute-value pairs.",
        "The semantic segments are produced by concatenation of the chunks produced by the shallow parser.",
        "A semantic segment is a unit that corresponds unambiguously to a concept of the dictionary.",
        "(1) buongiorno lei [puo iscriversi]concept1 [agli esami]coraCept2 [oppure] concepts [ottenere delle informazioni]concept4 come la posso aiutare",
        "<concept1 action:inscription> <concept2 objectDB:examen> <concept3 conjunctor:alternative> <concept4 action:obtain_info>",
        "The annotation of predicate structure facilitates the interpretation ofthe relation between entities and events occurring in the dialogue.",
        "There are different approaches to annotate predicate structure.",
        "Some of them are based upon syntactic structure, with PropBank (Kingsbury and Palmer, 2003) being one of the most relevant, building the annotation upon the syntactic representation of the TreeBank corpus (Marcus et al., 1993).",
        "An alternative to syntax-driven approaches is the annotation using semantic roles as in FrameNet (Baker et al., 1998).",
        "For the annotation of predicate structure in the luna corpus, we decided to use a FrameNet-like approach, rather than a syntax-based approach:",
        "1.",
        "Annotation of dialogue interaction has to deal with disfluencies, non-complete sentences, ungrammaticality, etc., which complicates the use of deep syntactic representations.",
        "2.",
        "If we start from a syntactic representation, we have to follow a long way to achieve the semantic interpretation.",
        "Syntactic constituents must be mapped to #-roles, and then to semantic roles.",
        "FrameNet offers the possibility of annotating using directly semantic criteria.",
        "For each domain, we define a set of frames.",
        "These frames are defined based on the domain ontology, with the named entities providing the frame elements.",
        "For all the frames we introduce the negation as a default frame element.",
        "For the annotation, first of all we annotate the entities with a frame and a frame element.",
        "Then if the target is overtly realized we make a pointer from the frame elements to the target.",
        "The next step is putting the frame elements and the target (if overtly realized) in a set.",
        "(2) buongiorno [lei] fe1 [puo iscriversi] fe2[agli esami]fe3 oppure [ottenere delle informazioni] f e4 come la posso aiutare setl = {id1, id2, id3} frame: inscription frame-elements:{student, examen, date} frame = info-request frame-elements:{student, addressee, topic}",
        "<fe1 frame=\"inscription\"",
        "FE=\"student\" member=\"set1\" <fe2 frame=\"inscription\" <fe3 frame=\"inscription\"",
        "FE=\"examen\" member=\"set1\" <fe4 frame=\"information\"",
        "To annotate anaphoric relations we will use an annotation scheme close to the one used in the arrau project (Artstein and Poesio, 2006).",
        "This scheme has been extensively tested with dialogue corpora and includes instructions for annotating a variety of anaphoric relations, including bridging relations.",
        "A further reason is the robustness of the scheme that doesn't require one single interpretation in the annotation.",
        "The first step is the annotation of the information status of the markables with the tags given and new.",
        "If the markables are annotated with given, the annotator will select the most recent occurrence of the object and add a pointer to it.",
        "If the markable is annotated with new, we distinguish between markables that are related to a previously mentioned object (associative reference) or don't have such a relation.",
        "If there are alternative interpretations, which of a list of candidates can be the antecedent, the annotator can annotate the markable as ambiguous and add a pointer to each of the possible antecedents.",
        "(3) Wizard: buongiorno [lei]cr1 [puo iscriversi]cr2 [agli esami]cr3 oppure ottenere [delle informazioni] cr4 come la posso aiutare Caller: [iscrizione]cr5 [esami]cr6",
        "<cr5 inf_status = \"given\" single_phrase_antecedent=\" cr2\" ambiguity=\"unambiguous\" > <cr6 inf_status = \"given\" single_phrase_antecedent=\" cr3\" ambiguity=\"unambiguous\" >",
        "In order to associate the intentions of the speaker with the propositional content of the utterances, the segmentation of the dialogue turns in utterances is based on the annotation of predicate structure.",
        "Each set of frame elements will correspond to an utterance.",
        "Each utterance will be annotated using a multidimensional annotation scheme partially based on the damsl scheme (Allen and Core, 1997) and on the proposals of icsi-mrda (Dhillon et al., 2004).",
        "We have selected nine dialogue acts from the damsl scheme as initial tagset, that can be extended for the different application domains.",
        "Each utterance will be annotated with as many tags as applicable.",
        "(4) Wizard: [buongiorno]utt1 [lei puo iscriversi agli esami]utt2 oppure [ottenere delle informzaioni]wtt3 [come la posso aiutare]utt4",
        "<uttl d-act=\"opening/closing\"> <utt2 d-act=\"statement\" link-frame=\"setl\"> <utt3 d-act=\"statement\"",
        "Caller: [iscrizione esami]utt5",
        "<utt5 d-act=\"answer;statement\" link-frame=\"set3\" >"
      ]
    },
    {
      "heading": "3. PAULA - a Linguistic Standoff Exchange Format",
      "text": [
        "PAULA stands for Potsdamer Austauschformat fur linguistische Annotation (\"Potsdam Interchange Format for Linguistic Annotation\") and has been developed for the representation of data annotated at multiple layers.",
        "The application scenario is sketched in Fig 1 : researchers use multiple, specialized off-the-shelf annotation tools, such as Exmaralda or MMAX, to enrich data with linguistic information.",
        "The tools store the data in tool-specific formats and, hence, it is not straightforward to combine information from different sources and, e.g., to search for correlations across multiple annotation layers.",
        "This is where PAULA comes in: PAULA maps the tool-specific formats to a common format and serves as an interchange format between these tools.",
        "Moreover, the annotations from the different sources are merged into one single representation.",
        "PAULA makes this data available for further applications, such as searching the data by means of the tool annis, or to feed statistical applications like Weka.",
        "PAULA is an XML-based standoff format for linguistic annotations, inspired by the \"dump format\"",
        "Figure 1: PAULA annotation scenario of the Linguistic Annotation Framework (Ide et al., 2003).",
        "With PAULA, not only is the primary data separated from its annotations, but individual annotation layers (such as parts of speech and dialogue acts) are separated from each other as well.",
        "The standoff approach allows us to mark overlapping segments in a straightforward way: by distributing annotations over different files (XML as such does not easily account for overlapping segments, since its object model is a hierarchical, treelike structure).",
        "Moreover, new annotation layers can be added easily.",
        "PAuLA assumes that a representation of the primary data is stored in a file that optionally specifies a header with meta information, followed by a tag <body>, which contains a representation of the primary data.",
        "In Fig. 2, the first box displays the transcription, with all contributions from the first speaker coming first, and the contributions from the other speaker(s) following (put in italics in the Figure).",
        "The basic type of \"annotation\" are markables, encoded by the XML element <mark> .",
        "Markables specify \"anchors\", i.e., locations or ranges that can be annotated by linguistic information.",
        "The locations and ranges are positions or spans in the source text or timeline, which are referenced by means of XLinks and XPointer expressions.",
        "For instance, the \"Token\" markables in Fig. 2 define spans that cor-",
        "buongiornolei puö iscriversi agli esan*oppure ottenere delle infor^Azioni come la posso aiutarS mi dicaaquale esame-intende iscriversi ...",
        "xml:base=\"227.text.xml\"> <m/rfid=\"tok1 \"xiiink:href= '#xpointer(string-range(",
        "Figure 2: Paula sample annotation respond to words.",
        "The first markable, with the ID tok1, specifies the span that starts at character position 1 and is of length 10: buongiorno.",
        "Similarly, the speakers' individual turns are specified by the \"Turn\" markables.",
        "Here, the first markable (ID turn1) specifies the entire dialogue turn of the first speaker (which corresponds to the part marked in light grey within the text file).",
        "Additionally, the markable encodes the time range that is occupied by that turn: it starts at time point 21.098, and ends at time point 29.272.",
        "Markables represent a special kind of annotation: they mark linguistic units.",
        "The actual annotation, though, specifies properties of these units, such as part of speech or dialogue acts.",
        "For the encoding of these properties, paula provides <feat> elements, which point to <mark> elements by referencing their IDs.",
        "Token markables are annotated by \"Morph\" and \"POS\" features.",
        "The name of the annotated feature is specified by the attribute type of the <featList> element; the value of the feature is given by the attribute value ofthe <feat> elements.",
        "For instance, the token with ID tok15 is annotated with morph=\"1.comm.sing\" and pos=\"PR\".",
        "Similarly, the Turn markables are specified for the speakers uttering the turns (\"Speaker\" features), and details of the dialogue acts (\"Action\") are given.",
        "The file with the dialogue act annotations specify multiple features within one tag <feat>, rather than distributing the features over several files, as we do in the case of morphology and POS annotations.",
        "This way, we explicitely encode the fact that the individual annotations (action=\" inscriptioruobtain- info\" and objectDB=\"examen\") jointly form one complex annotation.",
        "paula markables can also refer to points or areas within pictures or videos (by referring to coordinates) or point to other markables (Fig.",
        "2 does not illustrate these options).",
        "Moreover, for the encoding of hierarchical structures like graphs, paula provides <struct > (structure) elements (see Fig. 3 below for an example).",
        "The paula standoff format is a generic format that does not necessarily prescribe in detail how to represent annotations.",
        "Often there is more than one way to represent the data in paula standoff format.",
        "In the next section, we present the way we intend to represent dialogue data, which involve possibly overlapping contributions by several speakers, and often include time-alignment information."
      ]
    },
    {
      "heading": "4. Representing LUNA Dialogue Annotations in PAULA",
      "text": [
        "In this section, we illustrate the use of paula for the luna corpus with a more elaborated example, focusing on the representation of frame annotation.",
        "In Fig. 3, the top elements represent the dialogue turns and the semantic units underlying the frame annotations, which are defined on the base of the dialogue turns.",
        "\"FrameUnit\" markables define the scope or extension of the frames, and roughly correspond to a sentence or turn.",
        "\"FrameP\" markables specify the frame participants, i.e., all elements that receive a semantic role within some frame.",
        "/ Morph",
        "\\",
        "<featList type=\"morph\"",
        "xml:base=\"227.tok.xml\">",
        "\\",
        "<feat xlink:href=\"#tok15\" value=\"1.comm.sina\"/>",
        "POS",
        "<feat xlink:href value=\"1.sin <!-- dica -->",
        "<feat xlink:hre value=\" invar <!-- a -->",
        "<featl_ist type=\"pos\"",
        "xml:base=\"227.tok.xmr>",
        "<feat xlink:href=\"#tok15\" value=\"PR\"/> <!- mi: pronoun ->",
        "<feat xlink:href=\"#tok16\" value=\"VerFin\"/> <!- dica: finite verb ->",
        "<feat xlink:href=\"#tok17\" value=\"P\"/>",
        "<!- a: preposition^** – '",
        "The annotations at the bottom contain information about individual frames.",
        "The frames are encoded as <struct> elements, constituting complex objects that group semantic units to form frames instances.",
        "In Fig. 3, the frame with ID frame_1 consists of the frame unit, the lexical unit and the frame participants.",
        "The \"FrameAnno\" box encodes the name of the frame: \"inscription\".",
        "The frames can be defined by external \"Framesets\", such as FrameNet (Baker et al., 1998), which in our example is stored in an external XML-resource called frameSet.",
        "xml."
      ]
    },
    {
      "heading": "5. Alternative Formats",
      "text": [
        "For richly annotated dialogue corpora, alternative representation formats have been proposed.",
        "Two of the most prominent ones are the nite-xml and the elan format.",
        "Similar to paula, nite-xml focuses on richly annotated corpus data.",
        "It comes with a rich data model and employs a rich meta specification, which determines – based upon the individual corpus characteristics – the concrete linearization of the respective XML representation.",
        "Furthermore, it is accompanied by a JAVA API and a query tool, forming a valuable toolkit for corpus engineers who can adapt available resources to their specific needs.",
        "The elan format is used by a family of tools developed primarily for language documentation, of which the most advanced one is elan, a robust, ready-to-use tool for multilevel annotation of video.",
        "Its underlying data model is the Abstract Corpus Model (ACM) (Brugman and Russel, 2004).",
        "paula aims at an application scenario different from both of these formats.",
        "First, it builds upon the usage of specialized off-the-shelf annotation tools for the variety of annotation tasks.",
        "Both the nite-xml and elan approaches require additional effort and skills from the user, to add the required functionality, which paula aims to avoid.",
        "Second, paula takes care of merging the annotations from different sources, which is not in focus of elan or nite."
      ]
    },
    {
      "heading": "6. Discussion and Future Directions",
      "text": [
        "We presented the luna dialogue corpus and its representation format, the standoff exchange format paula.",
        "In contrast to other formats, paula focuses on an application scenario in which different annotations come in their own specific format and are to be merged into one corpus representation.",
        "This includes, for instance, the use of specialized off-the-shelf annotation tools for specific annotation tasks, as well as distributed and incremental annotation.",
        "The creation of the luna dialogue corpus is a prototypical example for this scenario.",
        "However, the usefulness of a format also depends on its interoperability and the available tools.",
        "With its import filters, paula already serves the needs of linguists of different linguistic communities, while more export functionality is still to be integrated.",
        "With the export to Weka, a first step in this direction is done.",
        "Furthermore, annis a web-based tool for visualizing and searching complex multilevel annotations-is available and will be developed further.",
        "In our next steps, we will focus on a deliberate extension of the paula format for further and more complex dialogue annotations, which will enable the use of paula as an exchange format also in this domain."
      ]
    }
  ]
}
