{
  "info": {
    "authors": [
      "Eric Smith"
    ],
    "book": "Ninth Meeting of the ACL Special Interest Group in Computational Morphology and Phonology",
    "id": "acl-W07-1308",
    "title": "Phonological Reconstruction of a Dead Language Using the Gradual Learning Algorithm",
    "url": "https://aclweb.org/anthology/W07-1308",
    "year": 2007
  },
  "references": [
    "acl-A00-2038",
    "acl-W06-1107"
  ],
  "sections": [
    {
      "text": [
        "Eric J. M. Smith",
        "M5S 3H1 Canada",
        "eric.smith@utoronto.ca",
        "This paper discusses the reconstruction of the Elamite language's phonology from its orthography using the Gradual Learning Algorithm, which was re-purposed to \"learn\" underlying phonological forms from surface orthography.",
        "Practical issues are raised regarding the difficulty of mapping between orthography and phonology, and Optimality Theory's neglected Lexicon Optimization module is highlighted."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The purpose of this paper is to reconstruct the phonology of Elamite, an extinct language known only from written sources, whose phonology is currently poorly understood.",
        "Given that the mechanisms provided by Optimality Theory are powerful enough for a language learner to acquire a natural language given only overt forms, it should be possible to apply the same mechanisms to \"learn\" Elamite phonology given only its orthography.",
        "The research described here was carried out with the aid of a piece of software, nicknamed Grote-fend, which was developed as part of a larger research project into Elamite.",
        "The data used in this paper consisted of the contents of the Elamisches Worterbuch (Hinz and Koch, 1987) marked up as XML with attributes such as morphology, cognates, semantics, corpus frequency, and chronology.",
        "The Wörterbuch was used because it is the only source that incorporates Elamite data from all historical periods.",
        "It also has the virtue of containing every single attested form known to the authors, which is particularly useful for this project, since we have special interest in alternative spellings of given words."
      ]
    },
    {
      "heading": "2. Elamite Language",
      "text": [
        "Elamite is an extinct language spoken in what is now southwestern and central Iran.",
        "Elamite-language texts dating from 2400 BCE until 360 BCE are attested, written in the cuneiform script borrowed from the Sumerians and Akkadians.",
        "Elamite has no known linguistic affiliations, although a connection to the Dravidian family has been proposed by McAlpin (1982) and others.",
        "Since both the language and scribal practices are certain to have changed over such a long time-span, this study will restrict itself to text from a single era.",
        "The Achaemenid Elamite period (539 BCE to 360 BCE) was chosen, because this period contains the largest volume of texts, and also because those texts are particularly rich in Old Persian names and loanwords that provide a useful starting point for estimating the phonology.",
        "As part of their adaptation of cuneiform, the Elamites abandoned most of the logographic elements found in Sumerian and Akkadian usage, moving to an almost completely phonetic system, which would be a \"core syllabary\" in Sproat's (2000) typology.",
        "That is, each grapheme represents a syllable, but the system lacks graphemes to represent all of the language's syllables.",
        "This is particularly the case for many (CVC) graphemes, which must be written using \"syllable telescoping\", where a (CV-VC) combination is written, with the internal vowel being repeated.",
        "For example, lacking a (lan) grapheme, the syllable /lan/ would have to be written (la-an).",
        "Even when the ( CVC) grapheme does exist, the ( CV-VC) writing is often preferred.",
        "The strategy of this research is to use the techniques of Optimality Theory to reconstruct the language's phonology.",
        "We will take the various hypotheses presented by earlier authors and attempt to encapsulate each in the form of an OT constraint.",
        "Altogether 30 separate hypotheses were evaluated, arranged into 11 major groupings.",
        "Within each grouping, the sub-hypotheses (which may or may not be mutually exclusive) refer to a related context or related orthographic phenomenon.",
        "This paper will largely restrict its discussion to only two of the groupings: H3 (Geminate consonants) and H4 (Nasal vowels).",
        "H3 Geminate consonants H3a Geminate orthographies represent underlying geminate phonologies.",
        "H3b Geminate orthographies indicate voicelessness (Reiner, 1969).",
        "H3c Certain geminate spellings indicate a distinction other than voicing, such as retroflex/alveolar (McAlpin, 1982).",
        "H4 Nasal vowels H4a Alternations in the writing of nasals indicate",
        "), but since the readership of this paper is unlikely to be familiar with cuneiform, all graphemes will be presented in the traditional transliterated form used in Assyriology.",
        "the presence of nasal vowels (e.g. /huban/ – (hu-um-ban), (hu-ban)).",
        "H4b Alternations in the writing of nasals can be explained by underlying nasal consonants (e.g. /humban/ – (hu-um-ban), (hu-ban))."
      ]
    },
    {
      "heading": "3. Theory of Writing Systems",
      "text": [
        "The discussion of Elamite orthography will be framed within the theory of writing systems proposed by Sproat (2000), whose core claim that \"particular (sets of) linguistic elements license the occurrence of (sets of) orthographic elements\".",
        "The details of which linguistic elements license which orthographic ones are specific to any given combination of spoken language and writing system.",
        "The licensing is implemented by a mapping function, MORL – r, whose input is the Orthographically Relevant Level (ORL), and whose output is the orthography(r).",
        "In the case of Elamite, the relevant level is the surface phonology after the application of phonological processes such as assimilation and cluster simplification, so in Sproat's schema, Elamite is classified as having a \"shallow\" ORL."
      ]
    },
    {
      "heading": "4. Applying OT to Orthography",
      "text": [
        "In the normal application of Optimality Theory, the input and the output are both the same type of linguistic entity.",
        "However, in the problem dealt with here, the relationship is between an input that is phonological and an output that is orthographic.",
        "The comparison of phonological apples to orthographic oranges leads to complications that will be discussed in §6.1.",
        "All the modules of Optimality Theory must be adapted for use with orthography.",
        "As originally formulated, Optimality Theory can be considered as a set of three interconnected modules: Gen, H-Eval, and Lexicon Optimization (Prince and Smolensky, 1993).",
        "Together Gen and H-Eval comprise the grammar proper.",
        "For any given input, Gen generates a set of output candidates, and these candidates are then evaluated against a set of constraints by the H-Eval module.",
        "Lexicon Optimization is not part of the grammar, but it provides a mechanism by which language learners can use that grammar to determine underlying forms based on the overt forms that are presented to them.",
        "Optimality Theory can be seen as a model for how a language learner acquires a natural language, presented only with overt forms (Tesar and Smolensky, 2000).",
        "At first, the learner's constraint rankings and underlying forms will be inaccurate, but as more information is presented the estimates of the underlying forms become more accurate, which in turn improves the constraint rankings, which further improves the estimates of the underlying forms, and so on.",
        "In this study, the \"learner\" is the Grotefend software, which is presented with surface orthography and attempts to deduce the phonology.",
        "The Gen module must be adapted to generate plausible overt forms (i.e. rival orthographies).",
        "The general strategy for Gen is described in §5, with the specific details given in §5.2.",
        "The constraints are used by a ranking algorithm (§4.3) that compares the rival orthographies from Gen against underlying phonological forms in order to determine the number of constraint violations.",
        "In order to start the process, those underlying forms have to be seeded with reasonable initial estimates.",
        "If the word is a loanword, the initial estimate is based on the Old Persian or Akkadian phonology.",
        "If there is no available loanword phonology, the initial estimate is a direct transcription of the grapheme values as if the word were being read in Akkadian.",
        "Once the constraints have been ranked, Lexical Optimization takes the orthographic forms and the newly-ranked constraints, and calculates an estimated phonology for each of the forms.",
        "At this point, the process can stop, or else it can proceed through another iteration of the ranking algorithm, using the new improved estimated phonologies as underlying forms.",
        "The Gradual Learning Algorithm (Boersma, 1997; Boersma and Hayes, 2001) is an evolution of the Constraint Demotion algorithm (Tesar, 1995), but avoids the infinite-looping which can arise in Constraint Demotion if underlying forms have more than one overt form.",
        "This limitation of Constraint Demotion is a serious one given the data from Elamite orthography; not only are the orthographic forms subject to considerable variation, but also this variation is a key piece of information in attempting to reconstruct the phonology.",
        "In the GLA, constraints each have a numeric ranking value associated with them.",
        "It is no longer the case that Constraint A consistently outranks Constraint B; whenever a constraint is evaluated, a random \"noise\" factor is added to each of the ranking values, and an instantaneous constraint ordering is determined based on these adjusted values.",
        "If the ranking values for two constraints are far apart, the noise is unlikely to alter the ordering, and the results will be effectively the same as ordinary OT.",
        "If the ranking values for two constraints are close together, the noise could put either constraint on top, but ties are avoided.",
        "In the GLA implementation within Grotefend, all constraints start with ranking values of 100.00.",
        "With each iteration of the algorithm, one of the observed forms is selected as an exemplar, and rivals (produced by Gen) are compared against the observed exemplar form.",
        "Whenever a rival beats the exemplar form, the constraint ranking values must be adjusted: all constraints that picked the wrong winner are penalized (adjusted downwards), and all constraints that picked the right winner are rewarded (adjusted upwards).",
        "The size of this adjustment is determined by a variable called \"plasticity\", which starts at 2.00 and is reduced gradually to 0.002 as the algorithm proceeds through its iterations."
      ]
    },
    {
      "heading": "5. Implementation of Gen",
      "text": [
        "The purpose of Gen is to generate a set of plausible overt forms consisting of the real form and a set of rivals which will lose out to the real form.",
        "In this problem the overt forms are orthographies, so for any underlying form the challenge is to generate orthographic strings that compete with the real orthography, but which are \"wrong\" with respect to one or more of the constraints.",
        "There have been a number of computational implementations of Gen, but the most promising one for our purposes was that of Heiberg (1999).",
        "Heiberg's algorithm proceeds by choosing a starting point and then adding constraints to the system.",
        "As each constraint is added, new candidates are generated using what she calls \"relevant\" Gen operations.",
        "A Gen operation is considered to be relevant for the current constraint if the operation could affect a candidate's harmony relative to that constraint.",
        "So for instance, if the constraint being added evaluates the [+back] feature, the only Gen operations that are relevant are those which affect [+back] or its associations.",
        "The candidates at each stage of the algorithm are not fully formed, and are slowly refined as the constraints are added to the system.",
        "One advantage of Heiberg's algorithm is that it functions even if the relative rankings of the constraints are not known.",
        "If the constraint rankings are known, the algorithm can operate more efficiently, by culling known losers, but knowing the rankings is not essential.",
        "Generating all \"plausible\" orthographic candidates for a given form is computationally prohibitive.So, borrowing Heiberg's notion of \"relevant\" operations, our approach is to generate candidates that specifically exercise one of the constraints in the constraint system.",
        "Each of the hypothesis groups described in §2.3 refers to a particular orthographic context, and each context has a miniature version of Gen to generate appropriately test-worthy rivals.",
        "For example, the mini-Gen function for context H3 is as follows:",
        "Gen H3 (Geminate consonants) Rule Whenever a geminate consonant is found in the orthography, generate a rival with the non-geminate equivalent.",
        "Example (hu-ut-ta) – { (hu-ta) }"
      ]
    },
    {
      "heading": "6. Implementation of H-Eval",
      "text": [
        "The H-Eval module is responsible for the actual evaluations of the various candidates.",
        "It takes any output candidate produced by Gen, and counts the violation marks for each of the constraints.",
        "Each constraint is implemented as a function which takes two inputs (an underlying form and a surface form), and produces as an output the number of violations incurred by the comparing the two inputs.",
        "For full generality, both inputs are annotation graphs (Bird and Liberman, 1999; Sproat, 2000) such as the one shown in Figure 1.",
        "As implemented in Grotefend, the comparison involves only the Phon tier of the underlying form's graph and the Orth tier of the surface form's graph.",
        "Constraints were written to test each of the hypotheses described in §2.3.",
        "Since there is no prior art in the area of constraints involving orthography and phonology, they were developed in the most straightforward way possible.",
        "The implementation of these functions is described in §6.2.",
        "In order to count violations, the two inputs must be properly aligned.",
        "For an annotation graph to be \"aligned\", every grapheme must be licensed by some part of the phonology, and every phoneme must be represented in the orthography.",
        "Without such a licensing relationship, it is impossible to make the comparisons needed to count constraint violations.",
        "There is considerable previous work in the area of alignment, most recently summarized by Kondrak and Sherif (2006).",
        "The algorithm used in this study is a similarity-based approach, not unlike ALINE (Kondrak, 2000).",
        "It differs in some significant respects, notably the use of binary features.",
        "Determining the eligibility of two phonemes for matching requires a distance function.",
        "The approach taken was to assign a weight to each phonological feature, and to calculate the distance as the sum of the weights of all features that differ between the two phonemes.",
        "The full listing of feature weights is shown in Table 1.",
        "The weighting values were determined empirically, selecting the weightings that did the best job of aligning the orthography for the Old Persian loanwords given by Hinz and Koch (1987).",
        "For the actual alignment, several approaches were tried, but the most effective one was simply to line up the consonants and let the vowels fall where they may.",
        "For instance, the licensing of (du-ri-um-mas-da) in Figure 1 used the Old Persian phonology as the best available initial estimate for the Elamite phonology, and proceeded as follows:",
        "( d) is the divine determinative, and is licensed by the semantic tier of the annotation graph, so it does not need to be anchored to the phonology.",
        "( u) is anchored at the left edge of the phonology.",
        "( ri) starts at /r/, but has no clear right edge.",
        "The anchoring of /r/ sets a right boundary on the (u), which must therefore be licensed by the initial /ahu/ of /ahuramazdah/.",
        "(um) right edge at phoneme /m/; since the (um) has no clear left edge, the second /a/ of /ahuramazdah/ is left floating between the (ri) and the (um).",
        "Since there is no clear choice between the two locations, the /a/ will be shared by (ri) and (um).",
        "(mas) starts at /m/ and ends at /z/, which is sufficiently similar to match s. The /m/ will be shared by (um) and (mas).",
        "(da) starts at /d/; since (da) is the last grapheme, it must be licensed by the remainder of the phonology.",
        "The general strategy of aligning consonants proved to be an effective one.",
        "In the working dataset of Achaemenid Elamite words, there were 3045 that used Old Persian or Akkadian data to provide an initial estimate of the underlying phonology.",
        "The algorithm successfully aligned 2902 of those words, for a success rate of over 95%.",
        "Once the orthography has been successfully aligned with the underlying phonology, it is possible to evaluate the forms for violations against all the constraints in the system.",
        "In terms of the tiers shown in annotation graphs like Figure 1, the constraints are performing comparisons between the underlying forms in the Phon tier and overt forms in the Orth tier.",
        "For example, the rules for calculating constraint violations for H3 are as follows:",
        "H3a Geminate spellings indicate geminate pronunciations.",
        "Rule Count a violation if the orthography contains a geminate consonant not matched by a geminate in the phonology.",
        "H3b Geminate spellings indicate voicelessness.",
        "Rule Count a violation if 1) the orthography contains an intervocalic geminate stop not matched by a voiceless stop in the phonology, or 2) the orthography contains an intervocalic non-geminate stop not matched by a voiced stop in the phonology, or 3) the phonology contains an intervocalic voiceless stop not matched by a geminate in the orthography, or 4) the phonology contains an intervocalic voiced stop not matched by a non-geminate in the orthography.Violations /duba:la/ – (du-ib-ba-la), /garmapada/ – ( dkar-ma-ba-tass) H3c Certain geminate spellings indicate a distinction other than voicing, such as retroflex/alveolar.",
        "Rule Count a violation if 1) the orthography contains a (Vl-lV) or (Vr-rV) sequence not matched by a retroflex in the phonology, or 2) the phonology contains a /[/ or /r/ not matched by a (Vl-lV) or ( Vr-rV) in the orthography.",
        "Phonological Feature",
        "Weight",
        "delayed release, voice, labiodental,",
        "1",
        "anterior, distributed, strident",
        "approximant, continuant, nasal, lateral,",
        "2",
        "round, low, pharyngeal",
        "syllabic, consonantal, constricted glot-",
        "4",
        "tis, spread glottis, high, front, back",
        "sonorant, place of articulation",
        "8",
        "Non-violation /talu/ – (ta-al-lu)"
      ]
    },
    {
      "heading": "7. Implementation of Lexicon Optimization",
      "text": [
        "Given the set of constraints provided in §6.2 and rankings determined by the Gradual Learning Algorithm (§4.3), it is now possible to move on to the final stage of the \"learning\" process: Lexicon Optimization, which is responsible for choosing the most harmonic input form for any given output form.",
        "There has been surprisingly little literature devoted to Lexicon Optimization, and discussions of how it might be implemented have been restricted to toy algorithms such as Ito et al's (1995) \"tableau des tableaux\".",
        "Hence, a novel approach was devised, based on the observation that Lexicon Optimization is a sort of mirror image of H-EVAL.",
        "For H-EVAL, there exists a separate GEN module whose task is to generate the possible output candidates.",
        "Clearly, Lexicon Optimization needs an equivalent module, but one that would generate a range of rival input forms.",
        "Since the GEN algorithm described in §5.2 uses a constraint-driven technique for generating output candidates, it seems appropriate to also use a constraint-driven technique for generating input candidates.",
        "Accordingly, this anti-GEN is implemented as a set of miniature anti-GENs, each of which is responsible for generating \"relevant\" input candidates for one of the hypothesis groupings.",
        "For example, the anti-GEN function for H3 is as follows:",
        "Anti-GEN H3 (Geminate consonants) Rule Whenever a geminate consonant is found in the orthography, create input candidates with the geminate phonology and the equivalent nongeminate phonology.",
        "If the geminate orthography is a (Vl-lV) or (Vr-rV), also create an input candidate with a \"retroflex\" phonology."
      ]
    },
    {
      "heading": "8. Results and Discussion",
      "text": [
        "We ran 40000 iterations of the Gradual Learning Algorithm against the Achamenid Elamite forms found in the Elamisches Worterbuch.",
        "The final constraint rankings for hypothesis groups H3 and H4 are shown in Table 2.",
        "The combination of constraints, GEN, and anti-GEN functions used by Grotefend tends to penalize constraints much more often than it rewards them.",
        "The absolute ranking values are not significant; what matters is their relative values.",
        "The results for H3 strongly support the hypothesis (Reiner, 1969) that geminate orthographies are an attempt to indicate voicelessness; the opposing hypothesis (Grillot-Susini and Roche, 1988) that geminate orthographies represent geminate phonologies ended up being very heavily penalized.",
        "What was surprising was that hypothesis H3c, that (Vl-lV) and (Vr-rV) geminates represent a separate phoneme from the non-geminate orthographies, ranked so poorly.",
        "The problem here is a side-effect of the process for generating input candidates.",
        "Consider the Akkadian name NabU-kudurri-usur; the ( ur-ri) sequence that occurs in the various spellings of this name would appear to be an ideal context for evaluating H3c.",
        "However, when generating input candidates for Nabui-kudurri-ussur, the various anti-GEN functions create 238 permutations (mostly permutations of voicing), but only four of those input candidates contain an /r/ phoneme, with the rest having an /rr/ or an /r/.",
        "Since the anti-GEN function produces so few /r/ input candidates for the ( ur-ri) orthography, it is likely that the software will find an /r/ in the underlying phonology, and will count a violation against this constraint.",
        "The prejudice against /l/ and /r/ highlights the importance of having a fair and balanced anti-GEN",
        "Hypo-",
        "Constraint",
        "Ranking",
        "thesis",
        "Value",
        "H4b",
        "NasalConsonants",
        "-136.93",
        "H3b",
        "(Geminate)=/Voiceless/",
        "-283.70",
        "H4a",
        "NasalVowels",
        "-1434.?",
        "?",
        "H3c",
        "(Geminate)=/Retroflex/",
        "-1629.74",
        "H3a",
        "(Geminate)=/Geminate/",
        "-3189.11"
      ]
    },
    {
      "heading": "0. H4a (nasal vowel) violations",
      "text": []
    },
    {
      "heading": "1. H4b (nasal consonant) violation",
      "text": [
        "function.",
        "The proposal to be discussed in §8.3 for cross-permuting the results of the constraint-specific anti-Gen functions would probably also improve the results for this hypothesis.",
        "The effectiveness of the constraints for evaluating nasals was undermined by choices made in the alignment algorithm.",
        "Although constraint H4b (Nasal-Consonants) is ranked significantly higher than H4a (NasalVowels), this may be merely a side-effect of the alignment algorithm.",
        "Consider the word for 'Indian', which shows up as (hi-du-is), (hi-in-du-is), or (in-du-is).",
        "It is not unreasonable to postulate an underlying phonology of /hlduj/, based both on the range of written forms, and on the Old Persian phonology.",
        "However, when the alignment algorithm attempts to determine which phoneme sequences are licensing which graphemes, it has a difficult choice to make for the (in) grapheme.",
        "Licensing the vowel portion of (in) is straightforward, but what should be done for the consonant?",
        "If the software assumes that the most salient features are [+consonantal] and [ – syllabic], we get the first annotation graph shown in Figure 2, but if the most salient features are [+nasal] and [+sonorant], we get the second graph.",
        "The choice of how to license the ( in) grapheme makes a difference for how the H4a and H4b constraints are evaluated.",
        "Using the weightings given in Table 1, the software will align (in) with /id/, because the distance between /n/ and /d/ is less than that between /n/ and Hence, the alignment algorithm chooses the first of the two annotation graphs given in Figure 2.",
        "This has the result of prejudicing the learning algorithm in favour of H4b instead of H4a.",
        "Ideally, the alignment algorithm should be neutral with respect to the various constraints.",
        "The licensing of the (in) sign in this example is one case of several where it appears that using phonological segments as the basis for licensing may be the wrong thing to do.",
        "It would be better to think of the second portion of the (in) sign in (hi-in-du-iss) as being licensed by a [+nasal] feature, without attempting to tie the feature down to either the /i/ or the /d/ segment.",
        "The generation of useful input candidates is limited by the information that is available to us.",
        "For all we know, Elamite had an /ra/ vowel, and Grotefend could even generate input candidates that contained an /a/.",
        "However, none of the constraints would weigh either for or against it, so there is no point in generating such an input candidate.",
        "Consequently, the correct underlying form may well be inaccessible to Lexicon Optimization.",
        "At best, Lexicon Optimization can produce an estimated underlying form that leaves as underspecified any features that cannot be verified by a corresponding constraint.",
        "This is a limitation of Lexicon Optimization in general, not just of the implementation in Grotefend.",
        "One problem specific to our constraint-based generation of input candidates is that the anti-Gen functions work in isolation from each other.",
        "For example, when processing (da-is), the H1 (broken-vowel) anti-Gen produces /daij/, /dajj/, /dej/, and /daj/.",
        "Separately, the H6 (sibilant) anti-Gen will produce /dais/, /daij/, /daiz/, /daitj/, and /daits/.",
        "Since the two functions operate independently, the software fails to generate a whole range of candidates.",
        "If the actual underlying phonology were /detj/, Grotefend would never find it, since that particular phonology will never be generated and presented to Lexicon Optimization as a possible input candidate.",
        "A more sophisticated anti-Gen implementation would allow for the input candidates produced by one constraint's anti-Gen function to be further permuted by the anti-Gen function of another constraint.",
        "9 Conclusions",
        "This project represented an expedition into three largely unexplored territories: the application ofOp-timality Theory to orthography, the implementation of Lexicon Optimization in software, and the mass analysis of Elamite phonology.",
        "All three presented unanticipated challenges.",
        "The problem of implementing Gen algorithmically appears to be at an early stage even in the processing of phonological data.",
        "The constraint-driven Gen adopted from Heiberg (1999) does appear to be a useful starting point for working with orthography.",
        "The determination of the mapping between phonology and orthography can have unexpected consequences for the evaluation ofconstraints.",
        "Even when properly aligned, implementing meaningful constraints to evaluate the mismatches between phonology and orthography proved to be surprisingly complex.",
        "An alternative representation, licensing graphemes based on bundles of features rather than phonemes, might be more effective.",
        "The whole area of Lexicon Optimization has received surprisingly little mention in the literature of Optimality Theory.",
        "The notion that there must be some form of anti-Gen module to produce suitable input candidates appears never to have been raised at all.",
        "The existence of anti-Gen is hardly specific to the study of orthography, but would seem to be an omission from Optimality Theory in general.",
        "The constraint-driven implementation of the antiGen function does seem like a promising strategy, although the details need work.",
        "In particular, there is a need for the outputs of the various constraint-specific anti-Gens to be permuted together in order to produce all plausible input candidates.",
        "Elamite has always been problematic both due to its status as an isolate and because the available clues end up being obscured by the writing system.",
        "So far, we can claim that this computational analysis of the body of Elamite vocabulary has succeeded in duplicating some of the tentative conclusions drawn from a century of hard work \"by hand\"."
      ]
    }
  ]
}
