{
  "info": {
    "authors": [
      "Liang-Chih Yu",
      "Chung-Hsien Wu",
      "Chin-Yew Lin",
      "Eduard Hovy",
      "Chia-Ling Lin"
    ],
    "book": "45th Annual Meeting of the Association of Computational Linguistics",
    "id": "acl-P07-1129",
    "title": "Topic Analysis for Psychiatric Document Retrieval",
    "url": "https://aclweb.org/anthology/P07-1129",
    "year": 2007
  },
  "references": [
    "acl-C04-1164",
    "acl-H05-1121"
  ],
  "sections": [
    {
      "text": [
        "Psychiatric document retrieval attempts to help people to efficiently and effectively locate the consultation documents relevant to their depressive problems.",
        "Individuals can understand how to alleviate their symptoms according to recommendations in the relevant documents.",
        "This work proposes the use of high-level topic information extracted from consultation documents to improve the precision of retrieval results.",
        "The topic information adopted herein includes negative life events, depressive symptoms and semantic relations between symptoms, which are beneficial for better understanding of users' queries.",
        "Experimental results show that the proposed approach achieves higher precision than the word-based retrieval models, namely the vector space model (VSM) and Okapi model, adopting word-level information alone."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Individuals may suffer from negative or stressful life events, such as death of a family member, argument with a spouse and loss of a job.",
        "Such events play an important role in triggering depressive symptoms, such as depressed moods, suicide attempts and anxiety.",
        "Individuals under these circumstances can consult health professionals using message boards and other services.",
        "Health professionals respond with suggestions as soon as possible.",
        "However, the response time is generally several days, depending on both the processing time required by health professionals and the number of problems to be processed.",
        "Such a long response time is unacceptable, especially for patients suffering from psychiatric emergencies such as suicide attempts.",
        "A potential solution considers the problems that have been processed and the corresponding suggestions, called consultation documents, as the psychiatry web resources.",
        "These resources generally contain thousands of consultation documents (problem-response pairs), making them a useful information resource for mental health care and prevention.",
        "By referring to the relevant documents, individuals can become aware that they are not alone because many people have suffered from the same or similar problems.",
        "Additionally, they can understand how to alleviate their symptoms according to recommendations.",
        "However, browsing and searching all consultation documents to identify the relevant documents is time consuming and tends to become overwhelming.",
        "Individuals need to be able to retrieve the relevant consultation documents efficiently and effectively.",
        "Therefore, this work presents a novel mechanism to automatically retrieve the relevant consultation documents with respect to users' problems.",
        "Traditional information retrieval systems represent queries and documents using a bag-of-words approach.",
        "Retrieval models, such as the vector space model (VSM) (Baeza-Yates and Ribeiro-Neto, 1999) and Okapi model (Robertson et al., 1995; Robertson et al., 1996; Okabe et al., 2005), are then adopted to estimate the relevance between queries and documents.",
        "The VSM represents each query and document as a vector of words, and adopts the cosine measure to estimate their relevance.",
        "The Okapi model, which has been used on the Text REtrieval Conference (TREC) collections, developed a family of word-weighting functions",
        "Consultation Document",
        "I broke up with my boyfriend.",
        "I often felt like crying and felt pain every day.",
        "So, I tried to kill myself several times.",
        "After that, it took me a long time to fall asleep at night.",
        "( <Insomnia> )",
        "In recent months, I often lose my temper for no reason.",
        "( <Anxiety> ) Recommendation:",
        "It's normal to feel this way when going through these kinds of struggles, but over time your emotions should level out.",
        "Suicide doesn't solve anything; think about how it would affect your family........There are a few things you can try to help you get to sleep at night, like drinking warm milk, listening to relaxing music.......",
        "Figure i.",
        "Example of a consultation document.",
        "The bold arrowed lines denote cause-effect relations; arrowed lines denote temporal relations; dashed lines denote temporal boundaries, and angle brackets denote depressive symptoms for relevance estimation.",
        "These functions consider word frequencies and document lengths for word weighting.",
        "Both the VSM and Okapi models estimate the relevance by matching the words in a query with the words in a document.",
        "Additionally, query words can further be expanded by the concept hierarchy within general-purpose ontologies such as WordNet (Fellbaum, 1998), or automatically constructed ontologies (Yeh et al., 2004).",
        "However, such word-based approaches only consider the word-level information in queries and documents, ignoring the high-level topic information that can help improve understanding of users' queries.",
        "Consider the example consultation document in Figure 1.",
        "A consultation document comprises two parts: the query part and recommendation part.",
        "The query part is a natural language text, containing rich topic information related to users' depressive problems.",
        "The topic information includes negative life events, depressive symptoms, and semantic relations between symptoms.",
        "As indicated in Figure 1, the subject suffered from a love-related event, and several depressive symptoms, such as <Depressed>, <Suicide>, <Insomnia> and <Anxiety>.",
        "Moreover, there is a cause-effect relation holding between <Depressed> and <Suicide>, and a temporal relation holding between <Depressed> and <Insomnia>.",
        "Different topics may lead to different suggestions decided by experts.",
        "Therefore, an ideal retrieval system for consultation documents should consider such topic information so as to improve the retrieval precision.",
        "Natural language processing (NLP) techniques can be used to extract more precise information from natural language texts (Wu et al., 2005a; Wu et al., 2005b; Wu et al., 2006; Yu et al., 2007).",
        "This work adopts the methodology presented in (Wu et al.",
        "2005a) to extract depressive symptoms and their relations, and adopts the pattern-based method presented in (Yu et al., 2007) to extract negative life events from both queries and consultation documents.",
        "This work also proposes a retrieval model to calculate the similarity between a query and a document by combining the similarities of the extracted topic information.",
        "The rest of this work is organized as follows.",
        "Section 2 briefly describes the extraction of topic information.",
        "Section 3 presents the retrieval model.",
        "Section 4 summarizes the experimental results.",
        "Conclusions are finally drawn in Section 5."
      ]
    },
    {
      "heading": "2. Framework of Consultation Document Retrieval",
      "text": [
        "Figure 2 shows the framework of consultation document retrieval.",
        "The retrieval process begins with receiving a user's query about his depressive problems in natural language.",
        "The example query is shown in Figure 1.",
        "The topic information is then extracted from the query, as shown in the center of Figure 2.",
        "The extracted topic information is repre-",
        "<Depressed>",
        "cause-effectif temporal ' ( <Suicide> )",
        "Query (Figure i)",
        "Topic Analysis",
        "Topic Information",
        "Negative Life Event Identification",
        "Symptom Identification",
        "Relation Identification",
        "Figure 2.",
        "Framework of consultation document retrieval.",
        "The rectangle denotes a negative life event related to love relation.",
        "Each circle denotes a symptom.",
        "D: Depressed, S: Suicide, I: Insomnia, A: Anxiety.",
        "Cause-Effect",
        "sented by the sets of negative life events, depressive symptoms, and semantic relations.",
        "Each element in the event set and symptom set denotes an individual event and symptom, respectively, while each element in the relation set denotes a symptom chain to retain the order of symptoms.",
        "Similarly, the query parts of consultation documents are represented in the same manner.",
        "The relevance estimation then calculates the similarity between the input query and the query part of each consultation document by combining the similarities of the sets of events, symptoms, and relations within them.",
        "Finally, a list of consultation documents ranked in the descending order of similarities is returned to the user.",
        "In the following, the extraction of topic information is described briefly.",
        "The detailed process is described in (Wu et al.",
        "2005a) for symptom and relation identification, and in (Yu et al., 2007) for event identification.",
        "1) Symptom identification: A total of 17 symptoms are defined based on the Hamilton Depression Rating Scale (HDRS) (Hamilton, 1960).",
        "The identification of symptoms is sentence-based.",
        "For each sentence, its structure is first analyzed by a probabilistic context free grammar (PCFG), built from the Sinica Treebank corpus developed by Academia Sinica, Taiwan (http://treebank.sinica.edu.tw), to generate a set of dependencies between word tokens.",
        "Each dependency has the format (modifier, head, relmodifier.head).",
        "For instance, the dependency (matters, worry about, goal) means that \"matters\" is the goal to the head of the sen-",
        "tence \"worry about\".",
        "Each sentence can then be associated with a symptom based on the probabilities that dependencies occur in all symptoms, which are obtained from a set of training sentences.",
        "2) Relation Identification: The semantic relations of interest include cause-effect and temporal relations.",
        "After the symptoms are obtained, the relations holding between symptoms (sentences) are identified by a set of discourse markers.",
        "For instance, the discourse markers \"because\" and \"therefore\" may signal cause-effect relations, and \"before\" and \"after\" may signal temporal relations.",
        "3) Negative life event identification: A total of 5",
        "types of events, namely <Family>, <Love>, <School>, <Work> and <Social> are defined based on Pagano et al's (2004) research.",
        "The identification of events is a pattern-based approach.",
        "A pattern denotes a semantically plausible combination of words, such as <parents, divorce> and <exam, fail>.",
        "First, a set of patterns is acquired from psychiatry web corpora by using an evolutionary inference algorithm.",
        "The event of each sentence is then identified by using an SVM classifier with the acquired patterns as features."
      ]
    },
    {
      "heading": "3. Retrieval Model",
      "text": [
        "The similarity between a query and a document, Sim(q, d), is calculated by combining the similarities of the sets of events, symptoms and relations within them, as shown in (1).",
        "denote the similarities of the sets of events, symptoms and relations, respectively, between a query and a document, and a and ( denote the combination factors.",
        "The similarities of the sets of events and symptoms are calculated in the same method.",
        "The similarity of the event set (or symptom set) is calculated by comparing the events (or symptoms) in a query with those in a document.",
        "Additionally, only the events (or symptoms) with the same type are considered.",
        "The events (or symptoms) with different types are considered as irrelevant, i.e., no similarity.",
        "For instance, the event <Love> is considered as irrelevant to <Work>.",
        "The similarity of the event set is calculated by",
        "SimEvn (q, d )",
        "where Evnq and Evnd denote the event set in a query and a document, respectively; eq anded denote the events; N(Evn u Evnd) denotes the cardinality of the union of Evnq and Evnd as a normalization factor, and Type(eq, ed) denotes an identity function to check whether two events have the same type, defined as [0 otherwise",
        "The cos(eq,ed) denotes the cosine angle between two vectors of words representing eq anded , as shown below.",
        "COS(eq, ed ) where w denotes a word in a vector, and T denotes the dimensionality of vectors.",
        "Accordingly, when two events have the same type, their similarity is given as cos(eq,ed) plus a constant, const.. Additionally, cos(eq, ed) and const.",
        "can be considered as the word-level and topic-level similarities, respectively.",
        "The optimal setting of const.",
        "is determined empirically.",
        "When calculating the similarity of relations, only the relations with the same type are considered.",
        "That is, the cause-effect (or temporal) relations in a query are only compared with the cause-effect (or temporal) relations in a document.",
        "Therefore, the similarity of relation sets can be calculated as where rq and rd denote the relations in a query and a document, respectively; Z denotes the normalization factor for the number of relations; Type(eq,ed) denotes an identity function similar to (3), and NC (•) and NT (•) denote the numbers of cause-effect and temporal relations.",
        "Both cause-effect and temporal relations are represented by symptom chains.",
        "Hence, the similarity of relations is measured by the similarity of symptom chains.",
        "The main characteristic of a symptom chain is that it retains the cause-effect or temporal order of the symptoms within it.",
        "Therefore, the order of the symptoms must be considered when calculating the similarity of two symptom chains.",
        "Accordingly, a sequence kernel function (Lodhi et al., 2002; Cancedda et al., 2003) is adopted to calculate the similarity of two symptom chains.",
        "A sequence kernel compares two sequences of symbols (e.g., characters, words) based on the subsequences within them, but not individual symbols.",
        "Thereby, the order of the symptoms can be incorporated into the comparison process.",
        "The sequence kernel calculates the similarity of two symptom chains by comparing their subsymptom chains at different lengths.",
        "An increasing number of common sub-symptom chains indicates a greater similarity between two symptom chains.",
        "For instance, both the two symptom chains s1s2 s3s4 and s3 s2 s1 contain the same symptoms s1, s2 and s3 , but in different orders.",
        "To calculate the similarity between these two symptom chains, the sequence kernel first calculates their similarities at length 2 and 3, and then averages the similarities at the two lengths.",
        "To calculate the similarity at",
        "{^*1^2' S1S3, ^l^P S2S3 , S2S4,> S3S4} and \"{$3S2,) S3S1, S2S1} .",
        "Similarly, their similarity at length 3 is calculated by comparing their sub-symptom chains of length 3, i.e., $2S3, ^1^2S4, ^1^3$4, $2S3S4} and {S3$2$1} .",
        "Obviously, no similarity exists between s1 S2S3S4and S3S2S1, since no sub-symptom chains are matched at both lengths.",
        "In this example, the subsymptom chains of length 1, i.e., individual symptoms, do not have to be compared because they contain no information about the order of symptoms.",
        "Additionally, the sub-symptom chains of length 4 do not have to be compared, because the two symptom chains share no sub-symptom chains at this length.",
        "Hence, for any two symptom chains, the length of the sub-symptom chains to be compared ranges from two to the minimum length of the two symptom chains.",
        "The similarity of two symptom chains can be formally denoted as where sc^ and Scdf denote the symptom chains corresponding to rq and rd , respectively; N1 and N2 denote the length of ScqN1 and ScdN2 , respectively; K ( • , • ) denotes the sequence kernel for calculating the similarity between two symptom chains; Kn ( • , • ) denotes the sequence kernel for calculating the similarity between two symptom chains at length n, and N is the minimum length of the two symptom chains, i.e., N = min(N1, N2) .",
        "The sequence kernel Kn (scn , scNl ) is defined as",
        "Given the two symptom chains, sys2s3 and s}s2s5s4Their similarity is calculated as K(sls2s3,sls2s3s4) = – yJKn(sls2s3,sls2s3s4).",
        "yl(3 + 2A+r)(2 + A) ' Similarly, K^s^s^s J = 0.5.",
        "denotes a mapping that transforms a given symptom chain into a vector of the sub-symptom chains of length n; <fiu (•) denotes an element of the vector, representing the weight of a sub-symptom chain u, and SCn denotes the set of all possible subsymptom chains of length n. The weight of a subsymptom chain, i.e., <<u (•), is defined as",
        "u is a contiguous sub-symptom chain of scfu is a non-contiguous sub-symptom chain (9)with 6 skipped symptoms u does not appear in scn ,",
        "where Kn (scf, scNl) is the normalized inner product of vectors On (scf) and On (scNl); On (•) where He [0,1] denotes a decay factor that is adopted to penalize the non-contiguous subsymptom chains occurred in a symptom chain based on the skipped symptoms.",
        "For instance, are considered as contiguous in S1S2S3 , and",
        "<ss (s1s2s3) = Al since s1 s3 is a non-contiguous",
        "sub-symptom chain with one skipped symptom.",
        "The decay factor is adopted because a contiguous sub-symptom chain is preferable to a noncontiguous chain when comparing two symptom chains.",
        "The setting of the decay factor is domain dependent.",
        "If A = 1, then no penalty is applied for skipping symptoms, and the cause-effect and temporal relations are transitive.",
        "The optimal setting of denotes the Robertson-Sparck Jones weight of t (without relevance feedback), defined as A is determined empirically.",
        "Figure 3 presents an example to summarize the computation of the similarity between two symptom chains."
      ]
    },
    {
      "heading": "4. Experimental Results 4.1 Experiment setup",
      "text": [
        "1) Corpus: The consultation documents were collected from the mental health website of the John Tung Foundation (http://www.jtf.org.tw) and the PsychPark (http://www.psychpark.org), a virtual psychiatric clinic, maintained by a group of volunteer professionals of Taiwan Association of Mental Health Informatics (Bai et al.",
        "2001).",
        "Both of the web sites provide various kinds of free psychiatric services and update the consultation documents periodically.",
        "For privacy consideration, all personal information has been removed.",
        "A total of 3,650 consultation documents were collected for evaluating the retrieval model, of which 20 documents were randomly selected as the test query set, 100 documents were randomly selected as the tuning set to obtain the optimal parameter settings of involved retrieval models, and the remaining 3,530 documents were the reference set to be retrieved.",
        "Table 1 shows the average number of events, symptoms and relations in the test query set.",
        "2) Baselines: The proposed method, denoted as Topic, was compared to two word-based retrieval models: the VSM and Okapi BM25 models.",
        "The VSM was implemented in terms of the standard TF-IDF weight.",
        "The Okapi BM25 model is defined as",
        "avdl +dl where t denotes a word in a query Q; qtf and tf denote the word frequencies occurring in a query and a document, respectively, and w(1) where N denotes the total number of documents, and n denotes the number of documents containing t. In (10), K is defined as where dl and avdl denote the length and average length of a document, respectively.",
        "The default values of k1 , k2 , k3 and b are describe in (Robertson et al., 1996), where k1 ranges from 1.0 to 2.0; k2 is set to 0; k3 is set to 8, and b ranges from 0.6 to 0.75.",
        "Additionally, BM25 can be considered as BM15 and BM11 when b is set to 1 and 0, respectively.",
        "3) Evaluation metric: To evaluate the retrieval models, a multilevel relevance criterion was adopted.",
        "The relevance criterion was divided into four levels, as described below.",
        "• Level 0: No topics are matched between a query and a document.",
        "• Level 1: At least one topic is partially matched between a query and a document.",
        "• Level 2: All of the three topics are partially matched between a query and a document.",
        "• Level 3: All of the three topics are partially matched, and at least one topic is exactly matched between a query and a document.",
        "To deal with the multilevel relevance, the diScounted cumulative gain (DCG) (Jarvelin and Kekalainen, 2000) was adopted as the evaluation metric, defined as where i denotes the i-th document in the retrieved list; G[i] denotes the gain value, i.e., relevance levels, of the i-th document, and c denotes the parameter to penalize a retrieved document in a lower rank.",
        "That is, the DCG simultaneously considers the relevance levels, and the ranks in the retrieved list to measure the retrieval precision.",
        "For instance, let <3,2,3,0,0> denotes the retrieved list of five documents with their relevance levels.",
        "If no penalization is used, then the DCG values for the retrieved list are <3,5,8,8,8>, and thus DCG[5]=8.",
        "Conversely, if c=2, then the documents retrieved at ranks lower than two are penalized.",
        "Hence, the DCG values for the retrieved list are <3,5,6.89,6.89,6.89>, and DCG[5]=6.89.",
        "Topic",
        "Avg.",
        "Number",
        "Negative Life Event",
        "1.45",
        "Depressive Symptom",
        "4.40",
        "Semantic Relation",
        "3.35",
        "The relevance judgment was performed by three experienced physicians.",
        "First, the pooling method (Voorhees, 2000) was adopted to generate the candidate relevant documents for each test query by taking the top 50 ranked documents retrieved by each of the involved retrieval models, namely the VSM, BM25 and Topic.",
        "Two physicians then judged each candidate document based on the multilevel relevance criterion.",
        "Finally, the documents with disagreements between the two physicians were judged by the third physician.",
        "Table 2 shows the average number of relevant documents for the test query set.",
        "4) Optimal parameter setting: The parameter settings of BM25 and Topic were evaluated using the tuning set.",
        "The optimal setting of BM25 were k1 =1 and b=0.6.",
        "The other two parameters were set to the default values, i.e., k2 = 0 and k3 = 8 .",
        "For the Topic model, the parameters required to be evaluated include the combination factors, a and ( , described in",
        "(1); the constant conSt.",
        "described in (2), and the decay factor, A, described in (9).",
        "The optimal settings were a = 0.3 ; (= 0.5 ; const.",
        "=0.6 and A = 0.8 .",
        "The results are divided into two groups: the precision and efficiency.",
        "The retrieval precision was measured by DCG values.",
        "Additionally, a paired, two-tailed t-teSt was used to determine whether the performance difference was statistically significant.",
        "The retrieval efficiency was measure by the query processing time, i.e., the time for processing all the queries in the test query set.",
        "Table 3 shows the comparative results of retrieval precision.",
        "The two variants of BM25, namely BM11 and BM15, are also considered in comparison.",
        "For the word-based retrieval models, both BM25 and BM11 outperformed the VSM, and",
        "BM15 performed worst.",
        "The Topic model achieved higher DCG values than both the BM-series models and VSM.",
        "The reasons are three-fold.",
        "First, a negative life event and a symptom can each be expressed by different words with the same or similar meaning.",
        "Therefore, the word-based models often failed to retrieve the relevant documents when different words were used in the input query.",
        "Second, a word may relate to different events and symptoms.",
        "For instance, the term \"worry about\" is a good indicator for both the symptoms <Anxiety> and <Hypochondriasis>.",
        "This may result in ambiguity for the word-based models.",
        "Third, the word-based models cannot capture semantic relations between symptoms.",
        "The Topic model incorporates not only the word-level information, but also more useful topic information about depressive problems, thus improving the retrieval results.",
        "DCG(5)",
        "DCG(10)",
        "DCG(20)",
        "DCG(50)",
        "DCG(100)",
        "Topic",
        "4.7516*",
        "6.929S",
        "7.6040*",
        "S.3606*",
        "9.3974*",
        "BM25",
        "4.4624",
        "6.7023",
        "7.1156",
        "7.S129",
        "S.6597",
        "BM11",
        "3.SS77",
        "4.932S",
        "5.95S9",
        "6.9703",
        "7.7057",
        "VSM",
        "2.3454",
        "3.3195",
        "4.4609",
        "5.S179",
        "6.6945",
        "BM15",
        "2.1362",
        "2.6120",
        "3.44S7",
        "4.5452",
        "5.7020",
        "The query processing time was measured using a personal computer with Windows XP operating system, a 2.4GHz Pentium IV processor and 512MB RAM.",
        "Table 4 shows the results.",
        "The topic model required more processing time than both VSM and BM25, since identification of topics involves more detailed analysis, such as semantic parsing of sentences and symptom chain construction.",
        "This finding indicates that although the topic information can improve the retrieval precision, incorporating such high-precision features reduces the retrieval efficiency."
      ]
    },
    {
      "heading": "5. Conclusion",
      "text": [
        "This work has presented the use of topic information for retrieving psychiatric consultation documents.",
        "The topic information can provide more precise information about users' depressive problems, thus improving the retrieval precision.",
        "The proposed framework can also be applied to different domains as long as the domain-specific topic information is identified.",
        "Future work will focus on more detailed experiments, including the contribution of each topic to retrieval precision, the effect of using different methods to combine topic information, and the evaluation on real users."
      ]
    }
  ]
}
