{
  "info": {
    "authors": [
      "Christof E. Müller"
    ],
    "book": "45th Annual Meeting of the Association of Computational Linguistics",
    "id": "acl-P07-1103",
    "title": "Resolving It, This, and That in Unrestricted Multi-Party Dialog",
    "url": "https://aclweb.org/anthology/P07-1103",
    "year": 2007
  },
  "references": [
    "acl-A00-2018",
    "acl-E06-1007",
    "acl-E99-1005",
    "acl-J99-4003",
    "acl-M95-1005",
    "acl-N04-1037",
    "acl-P03-1022",
    "acl-P05-1021",
    "acl-W05-0311"
  ],
  "sections": [
    {
      "text": [
        "Christoph Müller",
        "EML Research gGmbH Villa Bosch Schloß-Wolfsbrunnenweg 33 69118 Heidelberg, Germany christoph.mueller@eml-research.de",
        "We present an implemented system for the resolution of it, this, and that in transcribed multi-party dialog.",
        "The system handles NP-anaphoric as well as discourse-deictic anaphors, i.e. pronouns with VP antecedents.",
        "Selectional preferences for NP or VP antecedents are determined on the basis of corpus counts.",
        "Our results show that the system performs significantly better than a recency-based baseline."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "This paper describes a fully automatic system for resolving the pronouns it, this, and that in unrestricted multi-party dialog.",
        "The system processes manual transcriptions from the ICSI Meeting Corpus (Janin et al., 2003).",
        "The following is a short fragment from one of these transcripts.",
        "The letters FN in the speaker tag mean that the speaker is a female non-native speaker of English.",
        "The brackets and subscript numbers are not part of the original transcript.",
        "FN083: Maybe you can also read through the - all the text which is on the web pages cuz I'd like to change the text a bit cuz sometimes [it] i's too long, sometimes [it]2's too short, inbreath maybe the English is not that good, so in-breath um, but anyways - So I tried to do [this]3 today and if you could do [it]4 afterwards [it]5 would be really nice cuz I'm quite sure that I can't find every, like, orthographic mistake in [it]6 or something.",
        "(Bns003)",
        "For each of the six 3rd-person pronouns in the example, the task is to automatically identify its referent, i.e. the entity (if any) to which the speaker makes reference.",
        "Once a referent has been identified, the pronoun is resolved by linking it to one of its antecedents, i.e. one of the referent's earlier mentions.",
        "For humans, identification of a pronoun's referent is often easy: iti, it2, and it6 are probably used to refer to the text on the web pages, while it4 is probably used to refer to reading this text.",
        "Humans also have no problem determining that it5 is not a normal pronoun at all.",
        "In other cases, resolving a pronoun is difficult even for humans: thiscould be used to refer to either reading or changing the text on the web pages.",
        "The pronoun is ambiguous because evidence for more than one interpretation can be found.",
        "Ambiguous pronouns are common in spoken dialog (Poesio & Artstein, 2005), a fact that has to be taken into account when building a spoken dialog pronoun resolution system.",
        "Our system is intended as a component in an extractive dialog summarization system.",
        "There are several ways in which coreference information can be integrated into extractive summarization.",
        "Kabadjov et al.",
        "(2005) e.g. obtained their best extraction results by specifying for each sentence whether it contained a mention of a particular anaphoric chain.",
        "Apart from improving the extraction itself, coreference information can also be used to substitute anaphors with their antecedents, thus improving the readability of a summary by minimizing the number of dangling anaphors, i.e. anaphors whose antecedents occur in utterances that are not part of the summary.",
        "The paper is structured as follows: Section 2 outlines the most important challenges and the state of the art in spoken dialog pronoun resolution.",
        "Section 3 describes our annotation experiments, and Section 4 describes the automatic dialog preprocessing.",
        "Resolution experiments and results can be found in Section 5."
      ]
    },
    {
      "heading": "2. Pronoun Resolution in Spoken Dialog",
      "text": [
        "Spoken language poses some challenges for pronoun resolution.",
        "Some of these arise from nonrefer-ential resp.",
        "nonresolvable pronouns, which are important to identify because failure to do so can harm pronoun resolution precision.",
        "One common type of nonreferential pronoun is pleonastic it.",
        "Another cause of nonreferentiality that only applies to spoken language is that the pronoun is discarded, i.e. it is part of an incomplete or abandoned utterance.",
        "Discarded pronouns occur in utterances that are abandoned altogether.",
        "If the utterance contains a speech repair (Heeman & Allen, 1999), a pronoun in the reparandum part is also treated as discarded because it is not part of the inal utterance.",
        "In the corpus of task-oriented TRAINS dialogs described in Byron (2004), the rate of discarded pronouns is 7 out of 57 (12.3%) for it and 7 out of 100 (7.0%) for that.",
        "Schiffman (1985) reports that in her corpus of career-counseling interviews, 164 out of 838 (19.57%) instances of it and 80 out of 582 (13.75%) instances of that occur in abandoned utterances.",
        "There is a third class of pronouns which is referential but nonetheless unresolvable: vague pronouns (Eckert & Strube, 2000) are characterized by having no clearly deined textual antecedent.",
        "Rather, vague pronouns are often used to refer to the topic of the current (sub-)dialog as a whole.",
        "Finally, in spoken language the pronouns it, this, and that are often discourse deictic (Webber, 1991), i.e. they are used to refer to an abstract object (Asher, 1993).",
        "We treat as abstract objects all referents of VP antecedents, and do not distinguish between VP and S antecedents.",
        "ME013: Well, I mean there's this Cyber Transcriber service, right?",
        "Discourse deixis is very frequent in spoken dialog: The rate of discourse deictic expressions reported in Eckert & Strube (2000) is 11.8% for pronouns and as much as 70.9% for demonstratives.",
        "Pronoun resolution in spoken dialog has not received much attention yet, and a major limitation ofthe few implemented systems is that they are not fully automatic.",
        "Instead, they depend on manual removal of unresolvable pronouns like pleonastic it and discarded and vague pronouns, which are thus prevented from triggering a resolution attempt.",
        "This eliminates a major source of error, but it renders the systems inapplicable in a real-world setting where no such manual preprocessing is feasible.",
        "One of the earliest empirically based works adress-ing (discourse deictic) pronoun resolution in spoken dialog is Eckert & Strube (2000).",
        "The authors outline two algorithms for identifying the antecedents ofpersonal and demonstrative pronouns in two-party telephone conversations from the Switchboard corpus.",
        "The algorithms depend on two nontrivial types of information: the incompatibility of a given pronoun with either concrete or abstract antecedents, and the structure of the dialog in terms of dialog acts.",
        "The algorithms are not implemented, and Eckert & Strube (2000) report results of the manual application to a set ofthree dialogs (199 expressions, including other pronouns than it, this, and that).",
        "Precision and recall are 66.2 resp.",
        "68.2 for pronouns and 63.6 resp.",
        "70.0 for demonstratives.",
        "An implemented system for resolving personal and demonstrative pronouns in task-oriented TRAINS dialogs is described in Byron (2004).",
        "The system uses an explicit representation ofdomain-dependent semantic category restrictions for predicate argument positions, and achieves a precision of75.0 and a recall of 65.0 for it (50 instances) and a precision of 67.0 and a recall of 62.0 for that (93 instances) if all available restrictions are used.",
        "Precision drops to 52.0 for it and 43.0 for that when only domain-independent restrictions are used.",
        "To our knowledge, there is only one implemented system so far that resolves normal and discourse deictic pronouns in unrestricted spoken dialog (Strube & Muller, 2003).",
        "The system runs on dialogs from the Switchboard portion of the Penn Treebank.",
        "For it, this and that, the authors report 40.41 precision and 12.64 recall.",
        "The recall does not reflect the actual pronoun resolution performance as it is calculated against all coreferential links in the corpus, not just those with pronominal anaphors.",
        "The system draws some non-trivial information from the Penn Treebank, including correct NP chunks, grammatical function tags (subject, object, etc.)",
        "and discarded pronouns (based on the -UNF-tag).",
        "The treebank information is also used for determining the accessibility of potential candidates for discourse deictic pronouns.",
        "In contrast to these approaches, the work described in the following is fully automatic, using only information from the raw, transcribed corpus.",
        "No manual preprocessing is performed, so that during testing, the system is exposed to the full range of discarded, pleonastic, and other unresolvable pronouns."
      ]
    },
    {
      "heading": "3. Data Collection",
      "text": [
        "The ICSI Meeting Corpus (Janin et al., 2003) is a collection of 75 manually transcribed group discussions of about one hour each, involving three to ten speakers.",
        "A considerable number of participants are non-native speakers of English, whose proficiency is sometimes poor, resulting in disflu-ent or incomprehensible speech.",
        "The discussions are real, unstaged meetings on various, technical topics.",
        "Most of the discussions are regular weekly meetings of a quite informal conversational style, containing many interrupts, asides, and jokes (Janin, 2002).",
        "The corpus features a semi-automatically generated segmentation in which each segment is associated with a speaker tag and a start and end time stamp.",
        "Time stamps on the word level are not available.",
        "The transcription contains capitalization and punctuation, and it also explicitly records interruption points and word fragments (Heeman & Allen, 1999), but not the extent of the related disfluencies.",
        "The annotation was done by naive project-external annotators, two non-native and two native speakers of English, with the annotation tool MMAX2on five randomly selected dialogs.",
        "The annotation instructions were deliberately kept simple, explaining and illustrating the basic notions of anaphora and discourse deixis, and describing how markables were to be created and linked in the annotation tool.",
        "This practice of using a higher number of naive rather than fewer, highly trained - annotators was motivated by our intention to elicit as many plausible interpretations as possible in the presence of ambiguity.",
        "It was inspired by the annotation experiments of Poesio & Artstein (2005) and Artstein & Poesio (2006).",
        "Their experiments employed up to 20 annotators, and they allowed for the explicit annotation of ambiguity.",
        "In contrast, our annotators were instructed to choose the single most plausible interpretation in case of perceived ambiguity.",
        "The annotation covered the pronouns it, this, and that only.",
        "Markables for these tokens were created automatically.",
        "From among the pronominal instances, the annotators then identified normal, vague, and nonreferential pronouns.",
        "For normal pronouns, they also marked the most recent antecedent using the annotation tool's coreference annotation function.",
        "Markables for antecedents other than it, this, and that had to be created by the annotators by dragging the mouse over the respective words in the tool's GUI.",
        "Nominal antecedents could be either noun phrases (NP) or pronouns (PRO).",
        "VP antecedents (for discourse deictic pronouns) spanned only the verb phrase head, i.e. the verb, not the entire phrase.",
        "By this, we tried to reduce the number of disagreements caused by differing markable demarcations.",
        "The annotation of discourse deixis was limited to cases where the antecedent was a inite or ininite verb phrase expressing a proposition, event type, etc.",
        "Inter-annotator agreement was checked by computing the variant of Krippendorff's a described in Pas-sonneau (2004).",
        "This metric requires all annotations to contain the same set of markables, a condition that is not met in our case.",
        "Therefore, we report a values computed on the intersection of the compared annotations, i.e. on those markables that can be found in all four annotations.",
        "Only a subset of the markables in each annotation is relevant for the determination of inter-annotator agreement: all non-pronominal markables, i.e. all antecedent markables manually created by the annotators, and all referential instances of it, this, and that.",
        "The second column in Table 1 contains the cardinality of the union of all four annotators' markables, i.e. the number of all distinct relevant markables in all four annotations.",
        "The third and fourth column contain the cardinality and the relative size of the intersection of these four markable sets.",
        "The ifth column contains a calculated on the markables in the intersection only.",
        "The four annotators only agreed in the identiication of markables in approx.",
        "28% of cases.",
        "a in the ive dialogs ranges from .",
        "43 to .",
        "52.",
        "In view of the subjectivity of the annotation task, which is partly reflected in the low agreement even on markable identification, the manual creation of a consensus-based gold standard data set did not seem feasible.",
        "Instead, we created core data sets from all four annotations by means of majority decisions.",
        "The core data sets were generated by automatically collecting in each dialog those anaphor-antecedent pairs that at least three annotators identified independently of each other.",
        "The rationale for this approach was that an anaphoric link is the more plausible the more annotators identify it.",
        "Such a data set certainly contains some spurious or dubious links, while lacking some correct but more difficult ones.",
        "However, we argue that it constitutes a plausible subset of anaphoric links that are useful to resolve.",
        "Table 2 shows the number and lengths of anaphoric chains in the core data set, broken down according to the type of the chain-initial antecedent.",
        "The rare type OTHER mainly contains adjectival antecedents.",
        "More than 75% of all chains consist of two elements only.",
        "More than 33% begin with a pronoun.",
        "From the perspective of extractive summarization, the resolution of these latter chains is not helpful since there is no non-pronominal antecedent that it can be linked to or substituted with."
      ]
    },
    {
      "heading": "4. Automatic Preprocessing",
      "text": [
        "Data preprocessing was done fully automatically, using only information from the manual transcription.",
        "Punctuation signs and some heuristics were used to split each dialog into a sequence of graphemic sentences.",
        "Then, a shallow disflu-ency detection and removal method was applied, which removed direct repetitions, nonlexicalized illed pauses like uh, um, interruption points, and word fragments.",
        "Each sentence was then matched against a list of potential discourse markers (actually, like, you know, I mean, etc.)",
        "If a sentence contained one or more matches, string variants were created in which the respective words were deleted.",
        "Each of these variants was then submitted to a parser trained on written text (Charniak, 2000).",
        "The variant with the highest probability (as determined by the parser) was chosen.",
        "NP chunk markables were created for all non-recursive NP constituents identiied by the parser.",
        "Then, VP chunk markables were created.",
        "Complex verbal constructions like MD + INFINITIVE were modelled by creating markables for the individual expressions, and attaching them to each other with labelled relations like INFINI-TIVEXOMP.",
        "NP chunks were also attached, using relations like SUBJECT, OBJECT, etc.",
        "length",
        "2",
        "3",
        "4",
        "5",
        "6",
        "> 6",
        "total",
        "NP PRO VP",
        "Bed017 OTHER all",
        "17 14",
        "6",
        "3",
        "1",
        "2 2",
        "1",
        "23 16",
        "7",
        "37 80.44%",
        "4",
        "4",
        "1",
        "46",
        "NP PRO VP",
        "Bmr001 OTHER all",
        "14 19",
        "9",
        "4",
        "9 5",
        "1 2",
        "1 2",
        "1 1",
        "2 1",
        "23 34 14",
        "42 59.16%",
        "18",
        "3",
        "3",
        "2",
        "3",
        "71",
        "NP PRO",
        "Bnsfl03 oTHEr",
        "all",
        "18 18 14",
        "3",
        "1",
        "4",
        "3 1",
        "1",
        "25 20 18",
        "50 79.37%",
        "8",
        "4",
        "1",
        "63",
        "NP PRO",
        "Bro004 oTHEr",
        "all",
        "38 21 8 2",
        "5",
        "4 1 1",
        "3 1",
        "1 1",
        "47 26 10 3",
        "69",
        "80.23%",
        "11",
        "4",
        "2",
        "86",
        "NP PRO",
        "Bro005 oTHEr",
        "all",
        "37 15 8 3",
        "7",
        "3 1",
        "1 1",
        "1",
        "45 19 10 3",
        "63",
        "81.82%",
        "11",
        "2",
        "1",
        "77",
        "NP PRO",
        "£ VP £ OTHER",
        "all",
        "124 87 45 5",
        "22",
        "17 12 1",
        "10 6 1",
        "3 3 1",
        "2 1",
        "2 1",
        "163 115",
        "59 6",
        "261 76.01%",
        "52",
        "17",
        "7",
        "3",
        "3",
        "343",
        "I 1 U 2 U 3 U 4 I",
        "11 n 2 n 3 n 4 |",
        "a",
        "BedOl7",
        "397",
        "1G9 27.46 %",
        ".47",
        "BmrOOl",
        "619",
        "195 31.5G%",
        ".43",
        "BnsOO3",
        "529",
        "131 24.76%",
        ".45",
        "BroOO4",
        "7G3",
        "142 2G.2G %",
        ".45",
        "BroOO5",
        "53G",
        "132 24.91 %",
        ".52"
      ]
    },
    {
      "heading": "5. Automatic Pronoun Resolution",
      "text": [
        "We model pronoun resolution as binary classiica-tion, i.e. as the mapping of anaphoric mentions to previous mentions ofthe same referent.",
        "This method is not incremental, i.e. it cannot take into account earlier resolution decisions or any other information beyond that which is conveyed by the two mentions.",
        "Since more than 75% of the anaphoric chains in our data set would not beneit from incremental processing because they contain one anaphor only, we see this limitation as acceptable.",
        "In addition, incremental processing bears the risk of system degradation due to error propagation.",
        "In the binary classiication model, a pronoun is resolved by creating a set ofcandidate antecedents and searching this set for a matching one.",
        "This search process is mainly influenced by two factors: exclusion of candidates due to constraints, and selection ofcandidates due to preferences (Mitkov, 2002).",
        "Our features encode information relevant to these two factors, plus more generally descriptive factors like distance etc.",
        "Computation of all features was fully automatic.",
        "Shallow constraints for nominal antecedents include number, gender and person incompatibility, embedding of the anaphor into the antecedent, and coar-gumenthood (i.e. the antecedent and anaphor must not be governed by the same verb).",
        "For VP antecedents, a common shallow constraint is that the anaphor must not be governed by the VP antecedent (so-called argumenthood).",
        "Preferences, on the other hand, deine conditions under which a candidate probably is the correct antecedent for a given pronoun.",
        "A common shallow preference for nominal antecedents is the parallel function preference, which states that a pronoun with a particular grammatical function (i.e. subject or object) preferably has an antecedent with a similar function.",
        "The subject preference, in contrast, states that subject antecedents are generally preferred over those with less salient functions, independent of the grammatical function of the anaphor.",
        "Some of our features encode this functional and structural parallelism, including identity of form (for PRO antecedents) and identity of grammatical function or governing verb.",
        "A more sophisticated constraint on NP antecedents is what Eckert & Strube (2000) call I-Incompatibility, i.e. the semantic incompatibility of a pronoun with an individual (i.e. NP) antecedent.",
        "As Eckert & Strube (2000) note, subject pronouns in copula constructions with adjectives that can only modify abstract entities (like e.g. true, correct, right) are incompatible with concrete antecedents like car.",
        "We postulate that the preference of an adjective to modify an abstract entity (in the sense of Eckert & Strube (2000)) can be operationalized as the conditional probability of the adjective to appear with a to-ininitive resp.",
        "a that-sentence complement, and introduce two features which calculate the respective preference on the basis of corpus counts.",
        "For the irst feature, the following query is used:",
        "According to Eckert & Strube (2000), pronouns that are objects of verbs which mainly take sentence complements (like assume, say) exhibit a similar incompatibility with NP antecedents, and we capture this with a similar feature.",
        "Constraints for VPs include the following: VPs are inaccessible for discourse deictic reference if they fail to meet the right frontier condition (Webber, 1991).",
        "We use a feature which is similar to that used by Strube & Muller (2003) in that it approximates the right frontier on the basis of syntactic (rather than discourse structural) relations.",
        "Another constraint is A-Incompatibility, i.e. the incompatibility of a pronoun with an abstract (i.e. VP) antecedent.",
        "According to Eckert & Strube (2000), subject pronouns in copula constructions with adjectives that can only modify concrete entities (like e.g. expensive, tasty) are incompatible with abstract antecedents, i.e. they cannot be discourse deictic.",
        "The function of this constraint is already covered by the two corpus-based features described above in the context of I-Incompatibility.",
        "Another feature, based on Yang et al.",
        "(2005), encodes the semantic compatibility of anaphor and NP antecedent.",
        "We operationalize the concept of semantic compatibility by substituting the anaphor with the antecedent head and performing corpus queries.",
        "E.g., if the anaphor is object, the following query is used:",
        "If the anaphor is the subject in an adjective copula construction, we use the following corpus count to quantify the compatibility between the predicated adjective and the NP antecedent (Lapata et al.,",
        "A third class of more general properties of the potential anaphor-antecedent pair includes the type of anaphor (personal vs. demonstrative), type of antecedent (deinite vs. indeinite noun phrase, pronoun, inite vs. ininite verb phrase, etc.).",
        "Special features for the identiication of discarded expressions include the distance (in words) to the closest preceeding resp.",
        "following disfluency (indicated in the transcription as an interruption point, word fragment, or uh resp.",
        "um).",
        "The relation between potential anaphor and (any type of) antecedent is described in terms of distance in seconds and words.",
        "For VP antecedents, the distance is calculated from the last word in the entire phrase, not from the phrase head.",
        "Another feature which is relevant for dialog encodes whether both expressions are uttered by the same speaker.",
        "Machine learning data for training and testing was created by pairing each anaphor with each of its compatible potential antecedents within a certain temporal distance (9 seconds for NP and 7 seconds for VP antecedents), and labelling the resulting data instance as positive resp.",
        "negative.",
        "VP antecedent candidates were created only if the anaphor was either that or the object of a form of do.",
        "Our core data set does not contain any nonreferen-tial pronouns, though the classiier is exposed to the full range of pronouns, including discarded and otherwise nonreferential ones, during testing.",
        "We try to make the classiier robust against nonreferential pronouns in the following way: From the manual annotations, we select instances of it, this, and that that at least three annotators identiied as nonrefer-ential.",
        "For each of these, we add the full range of all-negative instances to the training data, applying the constraints mentioned above.",
        "As Bagga & Baldwin (1998) point out, in an application-oriented setting, not all anaphoric links are equally important: If a pronoun is resolved to an anaphoric chain that contains only pronouns, this resolution can be treated as neutral because it has no application-level effect.",
        "The common corefer-ence evaluation measure described in Vilain et al.",
        "(1995) is inappropriate in this setting.",
        "We calculate precision, recall and F-measure on the basis of the following deinitions: A pronoun is resolved correctly resp.",
        "incorrectly only if it is linked (directly or transitively) to the correct resp.",
        "incorrect nonpronominal antecedent.",
        "Likewise, the number of maximally resolvable pronouns in the core data set (i.e. the evaluation key) is determined by considering only pronouns in those chains that do not begin with a pronoun.",
        "Note that our deinition ofprecision is stricter (and yields lower igures) than that applied in the ACE context, as the latter ignores incorrect links between two expressions in the response if these expressions happen to be unannotated in the key, while we treat them as precision errors unless the antecedent is a pronoun.",
        "The same is true for links in the response that were identiied by less than three annotators in the key.",
        "While it is practical to treat those links as wrong, it is also simplistic because it does not do justice to ambiguous pronouns (cf.",
        "Section 6).",
        "Our best machine learning results were obtained with the Weka Logistic Regression classifier.",
        "All experiments were performed with dialog-wise cross-validation.",
        "For each run, training data was created from the manually annotated markables in four dialogs from the core data set, while testing was performed on the automatically detected chunks in the remaining ifth dialog.",
        "For training and testing, the person, number, gender, and (co-)argument constraints were used.",
        "If an anaphor gave rise to a positive instance, no negative training instances were created beyond that instance.",
        "Ifa referential anaphor did not give rise to a positive training instance (because its antecedent fell outside the search scope or because it was removed by a constraint), no instances were created for that anaphor.",
        "Instances for nonreferential pronouns were added to the training data as described in Section 5.2.",
        "During testing, we select for each potential anaphor the positive antecedent with the highest overall confidence.",
        "Testing parameters include it-filter, which switches on and off the module for the detection of nonreferential it described in Muller (2006).",
        "When evaluated alone, this module yields a precision of 80.0 and a recall of 60.9 for the detection of pleonastic and discarded it in the ive ICSI dialogs.",
        "For training, this module was always on.",
        "We also vary the parameter tipster, which controls whether or not the corpus frequency features are used.",
        "If tipster is off, we ignore the corpus frequency features both during training and testing.",
        "We irst ran a simple baseline system which resolved pronouns to their most recent compatible antecedent, applying the same settings and constraints as for testing (cf. above).",
        "The results can be found in the irst part of Table 3.",
        "Precision, recall and F-measure are provided for ALL and for NP and VP antecedents individually.",
        "The parameter tipster is not available for the baseline system.",
        "The best baseline performance is precision 4.88, recall 20.06 and F-measure 7.85 in the setting with it-filter on.",
        "As expected, this ilter yields an increase in precision and a decrease in recall.",
        "The negative effect is outweighed by the positive effect, leading to a small but insigniicant increase in F-measure for all types of antecedents.",
        "Baseline Logistic Regression",
        "The second part of Table 3 shows the results of the Logistic Regression classiier.",
        "When compared to the best baseline, the F-measures are consistently better for NP, VP, and ALL.",
        "The improvement is (sometimes highly) signiicant for NP and ALL, but never for VP.",
        "The best F-measure for ALL is 18.63, yielded by the setting with it-filter off and tipster on.",
        "This setting also yields the best F-measure for VP and the second best for NP.",
        "The contribution of the it-ilter is disappointing: In both tipster settings, the it-filter causes F-measure for ALL to go down.",
        "The contribution of the corpus features, on the other hand, is somewhat inconclusive: In both it-filter settings, they cause an increase in F-measure for ALL.",
        "In the irst setting, this increase is accompanied by an increase in F-measure for VP, while in the second setting, F-measure for VP goes down.",
        "It has to be noted, however, that none of the improvements brought about by the it-ilter or the tipster corpus features is statistically sig-niicant.",
        "This also conirms some of the indings of Kehler et al.",
        "(2004), who found features similar to our tipster corpus features not to be signiicant for NP-anaphoric pronoun resolution in written text.",
        "Setting",
        "Ante",
        "P",
        "R",
        "F",
        "P",
        "R",
        "F",
        "-it-filter",
        "-tipster",
        "NP VP ALL",
        "4.62 1.72 4.40",
        "27.12 2.63",
        "20.69",
        "7.90 2.08 7.25",
        "18.53 13.79 17.67",
        "20.34 10.53 17.56",
        "19.39*",
        "11.94",
        "17.61*",
        "+tipster",
        "NP VP ALL",
        "19.33 13.43 18.16",
        "22.03 11.84 19.12",
        "20.59***",
        "12.59 18.63**",
        "+it-fllter",
        "-tipster",
        "NP VP ALL",
        "5.18 1.77 4.88",
        "26.27",
        "2.63 20.06",
        "8.65 2.12 7.85",
        "17.87 13.12 16.89",
        "17.80 10.53 15.67",
        "17.83*",
        "11.68",
        "16.26*",
        "+tipster",
        "NP VP ALL",
        "20.82 11.27 18.67",
        "21.61 10.53 18.50",
        "21.21**",
        "10.88",
        "18.58**"
      ]
    },
    {
      "heading": "6. Conclusions and Future Work",
      "text": [
        "The system described in this paper is - to our knowledge - the irst attempt towards fully automatic resolution of NP-anaphoric and discourse deictic pronouns (it, this, and that) in multi-party dialog.",
        "Unlike other implemented systems, it is usable in a realistic setting because it does not depend on manual pronoun preselection or non-trivial discourse structure or domain knowledge.",
        "The downside is that, at least in our strict evaluation scheme, the performance is rather low, especially when compared to that of state-of-the-art systems for pronoun resolution in written text.",
        "In future work, it might be worthwhile to consider less rigorous and thus more appropriate evaluation schemes in which links are weighted according to how many annotators identi-ied them.",
        "In its current state, the system only processes manual dialog transcripts, but it also needs to be evaluated on the output of an automatic speech recognizer.",
        "While this will add more noise, it will also give access to useful prosodic features like stress.",
        "Finally, the system also needs to be evaluated extrinsically, i.e. with respect to its contribution to dialog summarization.",
        "It might turn out that our system already has a positive effect on extractive summarization, even though its performance is low in absolute terms.",
        "Acknowledgments.",
        "This work has been funded by the Deutsche Forschungsgemeinschaft as part of the DIANA-Summ project (STR-545/2-1,2) and by the Klaus Tschira Foundation.",
        "We are grateful to the anonymous ACL reviewers for helpful comments and suggestions.",
        "We also thank Ron Artstein for help with signiicance testing."
      ]
    }
  ]
}
