{
  "info": {
    "authors": [
      "Grace Y Chung",
      "Enrico Coiera"
    ],
    "book": "Biological, translational, and clinical language processing",
    "id": "acl-W07-1016",
    "title": "A Study of Structured Clinical Abstracts and the Semantic Classification of Sentences",
    "url": "https://aclweb.org/anthology/W07-1016",
    "year": 2007
  },
  "references": [
    "acl-W06-3309"
  ],
  "sections": [
    {
      "text": [
        "A Study of Structured Clinical Abstracts and the Semantic Classification of",
        "Sentences",
        "Grace Y. Chung and Enrico Coiera",
        "Centre for Health Informatics University of New South Wales Sydney NSW 2052 Australia (graceyc, e.coiera}@unsw.edu.au",
        "This paper describes experiments in classifying sentences of medical abstracts into a number of semantic classes given by section headings in structured abstracts.",
        "Using conditional random fields, we obtain F-scores ranging from 0.72 to 0.97.",
        "By using a small set of sentences that appear under the par-ticpants heading, we demonstrate that it is possible to recognize sentences that describe population characteristics of a study.",
        "We present a detailed study of the structure of abstracts of randomized clinical trials, and examine how sentences labeled under participants could be used to summarize the population group."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "Medical practitioners are increasingly applying evidence-based medicine (EBM) to support decision-making in patient treatments.",
        "The aim of EBM (Sackett, 1998) is to provide improved care leading to better outcomes through locating evidence for a clinical problem, evaluating the quality of the evidence, and then applying to a current problem at hand.",
        "However, the adoption of EBM is hampered by the overwhelming amount of information available, and insufficient time and skills on the clinician's part to locate and synthesize the best evidence in the scientific literature.",
        "medline abstracts about randomized clinical trials (RCTs) play a critical role in providing the best evidence for the latest interventions for any given",
        "conditions.",
        "The medline database now has 16 million bibliographic entries, many of them include the abstract and more than 3 million of these were published in the last 5 years (Hunter, 2006).",
        "To alleviate the information overload, some resources such as the Cochrane Collaboration (Cochrane, 2007), Evidence-Based Medicine (EBM, 2007), the ACP Journal Club (ACP, 2007) and BMJ Clinical Evidence (BMJCE, 2007), employ human experts to summarize knowledge within RCTs through extensive searches and critical assessments.",
        "in (Sim, 2000), RCT information is entered into electronic knowledge bases or \"trial banks\", easing the task for systematic reviewing and critical appraisal.",
        "This project requires manual entry of descriptions about the design and execution (subjects, recruitment, treatment assignment, follow-up), and hence, only small numbers of RCTs have been archived thus far.",
        "The goal of our research is to use natural language processing to extract the most important pieces ofin-formation from RCTs for the purpose of automatic summarization, tailored towards the medical practitioner's clinical question at hand.",
        "Ultimately, it is our vision that data mined from full text articles of RCTs not only aid clinicians' assessments but researchers who are conducting meta-analyses.",
        "in this paper, we examine the use ofsection headings that are frequently given in abstracts ofmedical journal articles.",
        "These section headings are topic-independent.",
        "Effectively they define the discourse structure for the abstract, and provide semantic labels to the sentences that fall under them.",
        "Other researchers have recognized the potential utility of these heading (McKnight, 2003; Xu, 2006; Lin, 2006).",
        "it has also been recognized that scientific abstracts with such labels could be of importance to text summarization, information retrieval and question answering (Lee, 2006; Zweigenbaum, 2003).",
        "We share similar goals to previous research; the section headings of these structured medical abstracts can be used as training data for building labelers that can tag unstructured abstracts with discourse structure.",
        "But also, there is a large number of heading names.",
        "Sentences that occur under these heading names form a labeled training set which could be used to build a classifier that recognizes similar sentences.",
        "Ultimately, we would like to build finer-grained classifiers that exploit these semantic labels.",
        "in our work, we seek to demonstrate that information about patient characteristics can now be extracted from structured and unstructured abstracts.",
        "We are motivated by the fact that patient characteristics is one of the fundamental factors most pertinent to evaluation ofrelevance to a clinical question.",
        "The total number of subjects in a trial reflects on the quality of the RCT, and additional factors such as age, gender and other coexisting conditions, will be crucial for assessing whether an RCT is relevant to the medical practitioner's immediate patient.",
        "This paper is organized as follows.",
        "In Section 1 we will describe how the RCT abstracts were obtained, and we present a study of the discourse headings that occur in our document corpus.",
        "Section 3 will detail our sentence classification experiments.",
        "We first explore classification in which the abstracts are labeled under five subheadings, one of which describes the patients or population group.",
        "We also perform classification using a combined two-stage scheme, bootstrapping from partially labeled data.",
        "Finally in Section 4, we consider how well the par-",
        "ticipants labeled sentences capture sentences containing the total number of participants in a trial.",
        "In Section 5, we will give a detailed analysis of the labeled sentences."
      ]
    },
    {
      "heading": "2. The Data",
      "text": [
        "The current corpus is obtained by a medline search for RCTs.",
        "We did not constrain publications by their date.",
        "For the purpose of constraining the size of our corpus in these preliminary experiments, it was our intention to use RCTs pertaining to a fixed set of clinical conditions.",
        "Hence, we conducted a medline search for RCTs with the following keywords: asthma, diabetes, breast cancer, prostate cancer, erectile dysfunction, heart failure, cardiovascular, angina.",
        "The resultant corpus contains 7535 abstracts of which 4268 are structured.",
        "Structured abstracts were introduced in 1987 (Ad-Hoc, 2005) to help clinical readers to quickly select appropriate articles, and allow more precise information retrieval.",
        "However, currently, the majority of medical abstracts remain unstructured.",
        "previous studies have concluded that while many scientific abstracts follow consistent patterns (e.g. Introduction, problem, Method, Evaluation, Conclusion) many still contain missing sections or have differing structures (Orasan, 2001; Swales, 1990; Meyer, 1990).",
        "Journals vary widely in their requirements for abstract structures.",
        "We have conducted a study of the structured abstracts in our corpus.",
        "Of 4268 structured abstracts, we have found a total of 238 unique section headings.",
        "The most common ones are shown in Table 1.",
        "To investigate the numbers of variations in the abstract structure, we first manually map headings that are essentially semantically equivalent to the same classes, resulting in 106 classes.",
        "Examples of these mappings are shown in Table 2.",
        "After the class mappings are applied, it turns out that there are still 400 different patterns in the combinations of section headings in these medical abstracts, with over 90% of these variations occurring less than 10 times.",
        "The most common section heading patterns are shown in Table 3.",
        "Some of the less common ones are also shown.",
        "1.",
        "RESULTS",
        "6.",
        "METHODS / RESULTS",
        "2.",
        "METHODS",
        "7.",
        "OBJECTIVE",
        "3.",
        "CONCLUSION",
        "8.",
        "PATIENTS / METHODS",
        "4.BACKGROUND",
        "9.",
        "PURPOSE",
        "5.",
        "CONCLUSION",
        "10.",
        "DESIGN",
        "Class",
        "Example Heading Names",
        "Aim",
        "AIM, AIMS, AIM OF THE STUDY..",
        "Setting",
        "SETTING, SETTINGS, STUDY SETTING..",
        "Participants",
        "PARTICIPANTS, PATIENTS, SUBJECTS..",
        "Setting/ Subjects",
        "PARTICIPANTS AND SETTINGS, SETTING/PATIENTS..",
        "In studying the structure of these medical abstracts, we find that the variation in structural ordering is large, and many of the heading names are unique, chosen at the discretion of the paper author.",
        "Some of the most frequent heading names are also compound headings such as: methods/results, results/conclusion, patients/results, subjects and settings."
      ]
    },
    {
      "heading": "3. Sentence Classification Experiments",
      "text": [
        "In this work, we seek to build a classifier using training data from the semantic labels already provided by structured abstracts.",
        "It is our intention ultimately to label both structured and unstructured abstracts with the semantic labels that are of interest for the purposes of information extraction and answering specific questions regarding the trial.",
        "In our approach, we identify in our structured abstracts the ones with section headings about patient characteristics.",
        "These are collapsed under one semantic class and used as training data for a classifier.",
        "From our 4268 structured abstracts, all the heading names are examined and are remapped by hand to one of five heading names: aim, method, participants, results, conclusion.",
        "Most heading names can be mapped to these general headings but the subset containing compound headings such as method/result are discarded.",
        "All the abstracts are segmented into sentences and tokenized via Metamap (Aronson, 2001).",
        "Some abstracts are discarded due to sentence segmentation errors.",
        "The remainder (3657 abstracts) forms the corpus that we will work with here.",
        "These abstracts are randomly divided into a training set and an initial test set, and for purposes of our experiments, they are further subdivided into abstracts with the participants label and those without.",
        "The exact size of our data sets are given in Table 4.",
        "Although abstracts in Train Set A are generally structured as (aim, method, results, conclusion), they contain sentences pertaining to patient or population group largely in the method section.",
        "In the following, we will explore three ways for labeling sentences in the abstract including labeling for sentences that describe the population group.",
        "The first employs a 5-class classifier, the second uses a two-stage approach and the third employs an approach which uses partially labeled data.",
        "Using only abstracts from Train Set B, all sentences are mapped into one of 5 classes: aim, participants, method, results, conclusion.",
        "Structure of Abstracts",
        "% of Corpus",
        "BACKGROUND, METHOD, RESULT, CONCLUSION",
        "16%",
        "AIM, METHOD, RESULT, CONCLUSION",
        "14%",
        "AIM, PATIENT AND METHOD, RESULT, CONCLUSION",
        "8.5%",
        "BACKGROUND, AIM, METHOD, RESULT, CONCLUSION",
        "7.6%",
        "BACKGROUND, METHOD AND RESULTS, CONCLUSION",
        "6.6%",
        "AIM, PARTICIPANTS, DESIGN, MEASUREMENTS, RESULT, CONCLUSION",
        "<1%",
        "CONTEXT, DESIGN, SETTING, PARTICIPANTS, OUTCOME MEASURES, RESULT, CONCLUSION",
        "<1%",
        "AIM, DESIGN AND SETTING, PARTICIPANTS, INTERVENTION MEASUREMENTS AND MAIN RESULTS, CONCLUSION",
        "<1%",
        "Data Set",
        "Number of Abstracts",
        "Number of Sentences",
        "Total in Corpus",
        "3657",
        "45k",
        "Total Train Set",
        "3439",
        "42k",
        "Train Set A (no PARTICIPANTS)",
        "2643",
        "32k",
        "Train Set B (w/ PARTICIPANTS)",
        "796",
        "10k",
        "Test Set (w/ PARTICIPANTS)",
        "62",
        "878",
        "Table 5: Classification of sentences in RCT abstracts into 5 semantic classes using CRFs and SVMs.",
        "The recall, precision and F-score are reported on our unseen test set.",
        "The participants class subsume all headings that include mention of population characteristics.",
        "These include compound headings such as: setting/population, patients/design.",
        "Sentences associated with these compound headings often include long sentences that describe the participant group as well as a second aspect of the study such as setting or design.",
        "We build a 5-class classiier using linear-chain conditional random fields (CRFs).",
        "CRFs (Sutton, 2006) are undirected graphical models that are dis-criminatively trained to maximize the conditional probability of a set of output variables given a set of input variables.",
        "We simply use bag-of-words as features because past studies (McKnight, 2003), using n-gram-based features did not improve accuracies.",
        "As a baseline comparison, we have performed classiication using a Support Vector Machine (SVM) classifier (Burges, 1998; Witten, 2005), with a radial basis functions (RBF) kernel.",
        "To help model the sequential ordering, a normalized integer for the sentence number in the abstract is included as a feature.",
        "Experimental results are shown in Table 5.",
        "CRFs clearly outperform SVMs in this classification task.",
        "This may in part be attributable to the explicit sequential modeling in the CRFs compared with",
        "SVMs.",
        "While our training set (796 abstracts in Train set B) is substantially smaller than that reported in previous studies (McKnight, 2003; Lin, 2006; Xu, 2006), the F-score for aim, results, conclusion are comparable to previous results.",
        "By far the largest sources of classiication error are the confusions between method and participants class.",
        "In training we have included into the participants class all sentences that come under compound headings, and therefore the participants section can often encompass several sentences that contain detailed information regarding the intervention, and the type of study, as exempliied below.",
        "Doppler echocardiography was performed in 21 GH deficient patients after 4 months placebo and 4 months GH therapy, in a double blind crossover study.",
        "in an open design study, 13 patients were reinvestigated following 16 months and 9 patients following 38 months of GH therapy.",
        "Twenty-one age and sex-matched normal control subjects were also investigated.",
        "Nonetheless, information about the patient population is embedded within these sentences.",
        "An alternative approach is to adopt a two-stage hierarchical strategy.",
        "First we build a classiier which performs a 4-way classiication based on the labels aim, method, results, conclusion, and a second stage binary classifier tags all the method sentences into either method or participants.",
        "There are two distinct advantages to this approach.",
        "(1) in our 5-class classifier, it is clear that method and participants are confusable and a dedicated clas-siier to perform this subtask may be more effective.",
        "(2) The corpus of abstracts with only the 4 classes labeled is much larger (3439 abstracts), and hence the resultant classiier is likely to be trained more robustly.",
        "Our first stage classifier is a CRF tagger.",
        "it is trained on the combined training sets A and B, whereby all sentences in the structured abstracts are mapped to the 4-class labels.",
        "The second stage binary classifier is an SVM classifier.",
        "The SVM clas-siier has been augmented with additional features of the semantic labels tagged via Metamap tagger.",
        "it is trained on the subset of Train Set A (3499 sentences) that is labeled as either method or participants.",
        "Classiication results for the unseen test set are reported in Table 6.",
        "The 4-class classifier yields F-scores between 0.92 and 0.96.",
        "We report results for",
        "Recall | Precision | F-score",
        "CRF",
        "Accuracy = 84.4%",
        "Aim",
        "0.98",
        "0.91",
        "0.95",
        "Method",
        "0.52",
        "0.73",
        "0.61",
        "Participants",
        "0.79",
        "0.73",
        "0.76",
        "Results",
        "0.95",
        "0.87",
        "0.91",
        "Conclusion",
        "0.91",
        "0.97",
        "0.94",
        "SVM",
        "Accuracy = 80.2%",
        "Aim",
        "0.87",
        "0.91",
        "0.90",
        "Method",
        "0.64",
        "0.68",
        "0.67",
        "Participants",
        "0.73",
        "0.70",
        "0.72",
        "Results",
        "0.89",
        "0.84",
        "0.86",
        "Conclusion",
        "0.80",
        "0.88",
        "0.83",
        "Table 6: (1) Classification using CRFs into 4 major semantic classes with combined Train Set A and B as training data.",
        "(2) Binary SVM classification of a subset of test set sentences.",
        "(3) Classification into 5 classes as described in Section 3.3.",
        "All results (recall, precision and F-score) are reported on the unseen test set.",
        "the binary SVM classifier on the subset of test set sentences (253 sentences) that are either method or participants in Table 6.",
        "The two stage method here has yielded some gains in performance for each class except for participants.",
        "The gains are likely to have been due to increased training data particularly for the classes,",
        "aim, results and conclusion.",
        "We investigate a second method for leveraging the data available in Train Set A.",
        "We hypothesize that many sentences within the method section of Train Set A do in fact describe patient information and could be used as training data.",
        "We propose a bootstrapping method whereby some of the sentences in Train Set A are tagged by a binary SVM classifier and used as training data in the 5-class CRF classifier.",
        "The following describes each step:",
        "1.",
        "A binary SVM classifier is trained on the subset of sentences in Train Set B labeled with",
        "method and participants.",
        "2.",
        "The trained SVM classifier is used to label all the sentences in Train Set A that are originally labeled with the method class.",
        "Table 7: Classification into 5 classes as described in Section 3.4.",
        "All results (recall, precision and F-score) are reported on the unseen test set.",
        "3.",
        "All the sentences in Train Set A are now labeled in terms of the 5 classes, and a score is available from the SVM output is associated with those sentences labeled as either method or participants.",
        "The abstracts that contain sentences scoring above a predetermined threshold score are then pooled with sentences in Train Set B into a single training corpus.",
        "We tuned the threshold value by testing on a development set held out from Train Set B.",
        "As a result, 1217 sentences from Train Set A is combined with Train Set B.",
        "4.",
        "The final training corpus is used to train a CRF tagger to label sentences into one of 5 classes.",
        "The results of classification on the unseen test set are reported in Table 7.",
        "Overall accuracy for classification improves to 87.6% primarily because there is a marked improvement is observed for the F-scores of the participants class.",
        "Our best results here are comparable to those previously reported on similar tasks on the class, aim, results and conclusion (Xu, 2006; Lin, 2006).",
        "The F-score for method is lower because introducing a participants label has increased confusability."
      ]
    },
    {
      "heading": "4. Extraction of Number of Patients",
      "text": [
        "We have demonstrated that for a structured abstract it is possible to predict sentences that are associated with population characteristics.",
        "However, our ultimate objective is to extract these kinds of sentences from unstructured abstracts, and even to extract more ine-grained information.",
        "in this section, we will examine whether labeling sentences into one of 5 classes can aid us in the extraction of the total number of patients from an RCT.",
        "(1) 4-class",
        "Accuracy = 92.7%",
        "Recall",
        "Precision",
        "F-score",
        "Aim",
        "0.98",
        "0.94",
        "0.96",
        "Method",
        "0.89",
        "0.95",
        "0.92",
        "Results",
        "0.95",
        "0.89",
        "0.92",
        "Conclusion",
        "0.91",
        "0.97",
        "0.94",
        "(2) 2-class",
        "Accuracy = 80.1%",
        "Method",
        "0.73",
        "0.83",
        "0.78",
        "Participants",
        "0.87",
        "0.78",
        "0.81",
        "(3) 5-class",
        "Accuracy = 86.0%",
        "Aim",
        "0.96",
        "0.92",
        "0.96",
        "Method",
        "0.66",
        "0.79",
        "0.71",
        "Participants",
        "0.77",
        "0.72",
        "0.75",
        "Results",
        "0.94",
        "0.89",
        "0.92",
        "Conclusion",
        "0.91",
        "0.97",
        "0.94",
        "Recall | Precision | F-score",
        "5-class",
        "Accuracy = 87.6%",
        "Aim",
        "0.99",
        "0.95",
        "0.97",
        "Method",
        "0.67",
        "0.77",
        "0.72",
        "Participants",
        "0.90",
        "0.77",
        "0.83",
        "Results",
        "0.91",
        "0.92",
        "0.92",
        "Conclusion",
        "0.90",
        "0.97",
        "0.93",
        "Table 8: Extraction of the total number of subjects in a trial in a human annotated test set, as described in Section 4.2",
        "In a concurrent annotation effort to label RCT abstracts, human annotators manually tagged a separate test set of 204 abstracts with the total number of participants in each study.",
        "Of the 204 abstracts, 148 are unstructured and 56 are structured.",
        "None of these 204 abstracts are part of the training set, described in this paper.",
        "The abstracts from this annotated test set are processed by the classifier described in Section 3.4.",
        "For all the abstracts which mention the total number of participants in the RCT, we compute the frequency for which this is included in the sentences labeled as participants.",
        "Results are depicted in Table 8.",
        "Upon subsequent examination of the test set, it is found that only 82% (46/56) of the structured abstracts and 70% (103/148) of unstructured abstracts contain information about total number of participants in the trial.",
        "As seen in Table 8, in 87% of the 46 structured abstracts, and in 72% of the 103 unstructured abstracts, the total number of participants are mentioned in the labeled participants sentences.",
        "The extraction of the total number of participants is significantly worse in unstructured abstracts which do not adhere to the strict discourse structures given by the headings of structured abstracts.",
        "in 13% (13/103) of the unstructured abstracts, the total number of participants appears in the first sentence, which is usually tagged as the aim.",
        "It is evident that in the absence of structure, patient information can occur in any sentence in the abstract, or for that matter, it may appear only in the body of the paper.",
        "Our method of training first on structured abstracts may be a strong limitation to extraction of information from unstructured abstracts.",
        "Even for the structured abstracts in the test set, 9% (4/46) of the set of abstracts containing population number actually mention the number in the AiM or results section, rather than the method or participants.",
        "Only 12 abstracts contain explicit headings referring to participants, where the total number of subjects in the trial is mentioned under the corresponding heading.",
        "in this task, we only consider that total number of subjects enrolled in a study, and have yet to account for additional population numbers such as the drop out rate, the follow-up rate, or the number of subjects in each arm of a study.",
        "These are often reported in an abstract without mentioning the total number of patients to begin with.",
        "The classifier will tag sentences that describe these as participant sentences nonetheless."
      ]
    },
    {
      "heading": "5. Analysis and Discussion",
      "text": [
        "We will further analyze the potential for using sentences tagged as participants as summaries of population characteristics for a trial.",
        "Table 9 gives some examples of sentences tagged by the classifier.",
        "Sentences that appear under participants in structured abstracts are often concise descriptions of the population group with details about age, gender, and conditions, as seen in Example 1.",
        "Otherwise, they can also be extensive descriptions, providing selection criteria and some detail about method, as in Example 2.",
        "Examples 3 and 4 show sentences from the test set of Section 4.",
        "Example 3 has been labeled as a participants sentence by the classifier.",
        "It describes patient characteristics, giving the population number for each arm of the trial but does not reveal the total number of subjects.",
        "Example 3 appears under the heading methods and results in the original abstract.",
        "Example 4 is from an unstructured abstract, where information about the intervention and population and study design are interleaved in the same sentences but tagged by the classifier as participants.",
        "Many sentences tagged as participants also do not give explicit information about population numbers but only provide descriptors for patient characteristics.",
        "it is also plausible that our task has been made more challenging compared with previous reported studies because our corpus has not been filtered for publication date.",
        "Hence, the numbers of publica-",
        "Abstracts w/ Total Subjects",
        "% tagged as PARTICIPANTS",
        "Structured",
        "46",
        "87%",
        "Unstructured",
        "103",
        "72%",
        "2.",
        "The study included 809 patients under 70 years of age with stable angina pectoris.",
        "The mean age of the patients was 59 +/-7 years and 31% were women.",
        "Exclusion criteria were myocardial infarction within the previous 3 years and contraindications to beta-blockers and calcium antagonists.",
        "The patients were followed between 6 and 75 months (median 3.4 years and a total of 2887 patient years).",
        "PMID: 8682134_ 3.",
        "Subjects with Canadian Cardiovascular Society (CCS) class 3/4 angina and reversible perfusion defects were randomized to SCS (34) or PMR (34).",
        "PMID: 16554313_ 4.",
        "Sixty healthy women, half of whom had been using OCs for at least the previous 6 months, participated in the study.",
        "Approximately two thirds were smokers and were randomized to be tested after either a 12 hr nicotine deprivation or administration of nicotine gum.",
        "One third were nonsmokers.",
        "PMID: 11495215",
        "Table 9: Examples of sentences labeled under participants class, forming summaries of the population characteristics of a trial.",
        "Examples 1 and 2 are typical sentences under the participants heading in the train set.",
        "Examples 3 and 4 are from the annotated test set.",
        "see section 5 for more detailed explanation.",
        "tions and structural characteristics of our abstracts may be broader than previous reports which filter for abstracts to a narrow time frame (Xu, 2006)."
      ]
    },
    {
      "heading": "6. Related Work",
      "text": [
        "in recent years, there has been a growth in research in information extraction and NLP in the medical domain particularly in the RcT literature.",
        "This is due in part to the emergence of lexical and semantic resources such as the Unified Medical Language System (UMLS) (Lindberg, 1993), and software such as MetaMap (Aronson, 2001), which transforms text into UMLs concepts, and semRep (Rind-flesch, 2003), which identifies semantic propositions.",
        "There are a number of previous attempts to perform text categorization on sentences in MEDLiNE abstracts into generic discourse level section headings.",
        "They all share the goal of assigning structure to unstructured abstracts for the purpose of summarization or question answering.",
        "All previous attempts have mapped the given headings to four or five generic classes, and performed text categorization on large sets of RcTs without any disease or condition-specific filtering.",
        "Studies have shown that results deteriorate when classifying sentences in unstructured abstracts (McKnight, 2003; Lin, 2006).",
        "in (McKnight, 2003), McKnight and srinivisan used an sVM for tagging sentences into 4 classes.",
        "Using a corpus of 7k abstracts, they obtain F-scores from 0.82 to 0.89.",
        "Later papers in (Xu, 2006; Lin, 2006) have found that Hidden Markov Models (HMMs) based approaches more effectively model the sequential ordering of sentences in abstracts.",
        "in (Xu, 2006), several machine learning methods, decision tree, maximum entropy and naive Bayes, are evaluated with an HMM-based algorithm.",
        "3.8k abstracts from 2004 and 2005 were used as training data, and experiments yielded average precision of 0.94 and recall of0.93.",
        "One driving model for information extraction in RcTs is the picO framework (Richardson, 1995).",
        "This is a task-based model for EBM formulated to assist EBM practitioners to articulate well-formed questions in order to find useful answers in clinical scenarios.",
        "picO elements are patient/population, intervention, comparison and Outcome.",
        "This model has been adopted by researchers (Demner-Fushman, 2005; Niu, 2004) as a guideline for elements that can be automatically extracted from RcTs and patient records.",
        "However, doubts have been raised about the utility of picO as a generic knowledge representation for computational approaches to answering clinical questions (Huang, 2006).",
        "in experiments reported in (Demner-Fushman, 2005), the picO framework was used as a basis for extracting population, problem, intervention and comparison for the purpose of evaluating relevance of an abstract to a particular clinical question.",
        "In this work, the population statements were located via a set of handwritten rules that were based on extracting an actual numeric value for the population."
      ]
    },
    {
      "heading": "7. Conclusions",
      "text": [
        "in this study, we investigated the use of conditional random fields for classifying sentences in medical abstracts.",
        "Our results particularly in terms of F-scores for generic section headings such as AiM, RE-",
        "sULTs and cONcLUsiON were comparable to previous studies, even with smaller training sets.",
        "We investigated the use of text classification by leveraging the subset of abstracts with explicitly labeled pARTicipANTs sentences combining the use of cRFs and SVMs, and exploiting partially labeled data.",
        "One main objective here is to label sentences that describe population characteristics in structured and unstructured abstracts.",
        "We found that unstructured abstracts differ substantially from structured ones, and alternative approaches will be necessary for extracting information from unstructured abstracts.",
        "Furthermore, critical details that are needed by a physician when evaluating a study such as exclusion criteria, drop out rate, follow up rate, etc, may only be listed in the full text of the study.",
        "Future work will address extracting information beyond the abstract."
      ]
    },
    {
      "heading": "8. Acknowledgment",
      "text": [
        "The authors would like to acknowledge the anonymous reviewers and the executive committee for their comments and suggestions, and Marianne Byrne, Brenda Anyango Omune and Wei Shin Yu for annotation of the abstracts.",
        "This project is funded by the Australian Research council, grant number Dp0666600."
      ]
    }
  ]
}
