{
  "info": {
    "authors": [
      "Yansong Feng",
      "Mirella Lapata"
    ],
    "book": "Human Language Technologies: the 2010 Annual Conference of the North American Chapter of the Association for Computational Linguistics",
    "id": "acl-N10-1011",
    "title": "Visual Information in Semantic Representation",
    "url": "https://aclweb.org/anthology/N10-1011",
    "year": 2010
  },
  "references": [
    "acl-D09-1066",
    "acl-D09-1081",
    "acl-P08-1032"
  ],
  "sections": [
    {
      "text": [
        "YansongFeng and Mirella Lapata",
        "The question of how meaning might be acquired by young children and represented by adult speakers of a language is one of the most debated topics in cognitive science.",
        "Existing semantic representation models are primarily amodal based on information provided by the linguistic input despite ample evidence indicating that the cognitive system is also sensitive to perceptual information.",
        "In this work we exploit the vast resource of images and associated documents available on the web and develop a model of multimodal meaning representation which is based on the linguistic and visual context.",
        "Experimental results show that a closer correspondence to human data can be obtained by taking the visual modality into account."
      ]
    },
    {
      "heading": "1. Introduction",
      "text": [
        "The representation and modeling of word meaning has been a central problem in cognitive science and natural language processing.",
        "Both disciplines are concerned with how semantic knowledge is acquired, organized, and ultimately used in language processing and understanding.",
        "A popular tradition of studying semantic representation has been driven by the assumption that word meaning can be learned from the linguistic environment.",
        "Words that are similar in meaning tend to behave similarly in terms of their distributions across different contexts.",
        "Semantic space models, among which Latent Semantic Analysis (LSA, Landauer and Dumais 1997) is perhaps known best, operationalize this idea by capturing word meaning quantitatively in terms of simple co-occurrence statistics.",
        "Each word w is represented by a k element vector reflecting the local distributional context of w relative to k context words.",
        "More recently, topic models have been gaining ground as a more structured representation of word meaning.",
        "In contrast to more standard semantic space models where word senses are conflated into a single representation, topic models assume that words observed in a corpus manifest some latent structure – word meaning is a probability distribution over a set of topics (corresponding to coarse-grained senses).",
        "Each topic is a probability distribution over words, and the content of the topic is reflected in the words to which it assigns high probability.",
        "Semantic space (and topic) models are extracted from real language corpora, and thus provide a direct means of investigating the influence of the statistics of language on semantic representation.",
        "They have been successful in explaining a wide range of behavioral data – examples include lexical priming, deep dyslexia, text comprehension, synonym selection, and human similarity judgments (see Landauer and Dumais 1997 and the references therein).",
        "They also underlie a large number of natural language processing (NLP) tasks including lexicon acquisition, word sense discrimination, text segmentation and notably information retrieval.",
        "Despite their popularity, these models offer a somewhat impoverished representation of word meaning based solely on information provided by the linguistic input.",
        "Many experimental studies in language acquisition suggest that word meaning arises not only from exposure to the linguistic environment but also from our interaction with the physical world.",
        "For example, infants are from an early age able to form perceptually-based category representations (Quinn et al., 1993).",
        "Perhaps unsurprisingly, words that refer to concrete entities and actions are among the first words being learned as these are directly observable in the environment (Bornstein et al., 2004).",
        "Experimental evidence also shows that children respond to categories on the basis of visual features, e.g., they generalize object names to new objects often on the basis of similarity in shape (Landau et al., 1998) and texture (Jones et al., 1991).",
        "In this paper we aim to develop a unified modeling framework of word meaning that captures the mutual dependence between the linguistic and visual context.",
        "This is a challenging task for at least two reasons.",
        "First, in order to emulate the environment within which word meanings are acquired, we must have recourse to a corpus of verbal descriptions and their associated images.",
        "Such corpora are in short supply compared to the large volumes of solely textual data.",
        "Secondly, our model should integrate linguistic and visual information in a single representation.",
        "It is unlikely that we have separate representations for different aspects of word meaning (Rogers et al., 2004).",
        "We meet the first challenge by exploiting multimodal corpora, namely collections of documents that contain pictures.",
        "Although large scale corpora with a one-to-one correspondence between words and images are difficult to come by, datasets that contain images and text are ubiquitous.",
        "For example, online news documents are often accompanied by pictures.",
        "Using this data, we develop a model that combines textual and visual information to learn semantic representations.",
        "We assume that images and their surrounding text have been generated by a shared set of latent variables or topics.",
        "Our model follows the general rationale of topic models – it is based upon the idea that documents are mixtures of topics.",
        "Importantly, our topics are inferred from the joint distribution of textual and visual words.",
        "Our experimental results show that a closer correspondence to human word similarity and association can be obtained by taking the visual modality into account."
      ]
    },
    {
      "heading": "2. Related Work",
      "text": [
        "The bulk of previous work has focused on models of semantic representation that are based solely on textual data.",
        "Many of these models represent words as vectors in a high-dimensional space (e.g., Landauer and Dumais 1997), whereas probabilistic alternatives view documents as mixtures of topics, where words are represented according to their likelihood in each topic (e.g., Steyvers and Griffiths 2007).",
        "Both approaches allow for the estimation of similarity between words.",
        "Spatial models compare words using distance metrics (e.g., cosine), while probabilistic models measure similarity between terms according to the degree to which they share the same topic distributions.",
        "Within cognitive science, the problem of how words are grounded in perceptual representations has attracted some attention.",
        "Previous modeling efforts have been relatively small-scale, using either artificial images, or data gathered from a few subjects in the lab.",
        "Furthermore, the proposed models work well for the tasks at hand (e.g., either word learning or object categorization) but are not designed as a general-purpose meaning representation.",
        "For example, Yu (2005) integrates visual information in a computational model of lexical acquisition and object categorization.",
        "The model learns a mapping between words and visual features from data provided by (four) subjects reading a children's story.",
        "In a similar vein, Roy (2002) considers the problem of learning which words or word sequences refer to objects in a synthetic image consisting often rectangles.",
        "Andrews et al.",
        "(2009) present a probabilistic model that incorporates perceptual information (indirectly) by combining distributional information gathered from corpus data with speaker generated feature norms (which are also word-based).",
        "Much work in computer vision attempts to learn the underlying connections between visual features and words from examples of images annotated with description keywords.",
        "The aim here is to enhance image-based applications (e.g., search or retrieval) by developing models that can label images with keywords automatically.",
        "Most methods discover the correlations between visual features and words by introducing latent variables.",
        "Standard latent semantic analysis (LSA) and its probabilistic variant (PLSA) have been applied to this task (Pan et al., 2004; Hofmann, 2001; Monay and Gatica-Perez, 2007).",
        "More sophisticated approaches estimate the joint distribution of words and regional image features, whilst treating annotation as a problem of statistical inference in a graphical model (Blei and Jordan, 2003; Barnard et al., 2002).",
        "Our own work aims to develop a model of semantic representation that takes visual context into account.",
        "We do not model explicitly the correspondence of words and visual features, or learn a mapping between words and visual features.",
        "Rather, we develop a multimodal representation of meaning which is based on visual information and distributional statistics.",
        "We hypothesize that visual features are crucial in acquiring and representing meaning Michelle Obama fever hits the UK",
        "In the UK on her first visit as first lady, Michelle Obama seems to be making just as big an impact.",
        "She has attracted as much interest and column inches as her husband on this London trip; creating a buzz with her dazzling outfits, her own schedule of events and her own fanbase.",
        "Outside Buckingham Palace, as crowds gathered in anticipation of the Obamas' arrival, Mrs Obama's star appeal was apparent.",
        "Table 1: Each article in the document collection contains a document (the title is shown in boldface), and image with related content.",
        "and conversely, that linguistic information can be useful in isolating salient visual features.",
        "Our model extracts a semantic representation from large document collections and their associated images without any human involvement.",
        "Contrary to Andrews et al.",
        "(2009) we use visual features directly without relying on speaker generated norms.",
        "Furthermore, unlike most work in image annotation, we do not employ any goldstandard data where images have been manually labeled with their description keywords."
      ]
    },
    {
      "heading": "3. Semantic Representation Model",
      "text": [
        "Much like LSA and the related topic models our model creates semantic representations from large document collections.",
        "Importantly, we assume that the documents are paired with images which in turn describe some of the document's content.",
        "Our experiments make use of news articles which are often accompanied with images illustrating events, objects or people mentioned in the text.",
        "Other datasets with similar properties include Wikipedia entries and their accompanying pictures, illustrated stories, and consumer photo collections.",
        "An example news article and its associated image is shown in Table 1 (we provide more detail on the database we used in our experiments in Section 4).",
        "Our model exploits the redundancy inherent in this multimodal collection.",
        "Specifically, we assume that the images and their surrounding text have been generated by a shared set of topics.",
        "A potential stumbling block here is the fact that images and documents represent distinct modalities: images are commonly described by a continuous feature space (e.g., color, shape, texture; Barnard et al.",
        "2002; Blei and Jordan 2003), whereas words are discrete.",
        "Fortunately, we can convert the visual features from a continuous onto a discrete space, thereby rendering image features more like word units.",
        "In the following we describe how we do this and then move on to present an extension of Latent Dirichlet Allocation (LDA, Blei and Jordan 2003), a topic model that can be used to represent meaning as a probability distribution over a set of multimodal topics.",
        "Finally, we discuss how word similarity can be measured under this model.",
        "A large number of image processing techniques have been developed in computer vision for extracting meaningful features which are subsequently used in a modeling task.",
        "For example, a common first step to all automatic image annotation methods is partitioning the image into regions, using either an image segmentation algorithm (such as normalized cuts; Shi and Malik 2000) or a fixed-grid layout (Feng et al., 2004).",
        "In the first case the image is represented by irregular regions (see Figure 1(a)), whereas in the second case the image is partitioned into smaller scale regions which are uniformly extracted from a fixed grid (see Figure 1(b)).",
        "The obtained regions are further represented by a standard set of features including color, shape, and texture.",
        "These can be treated as continuous vectors (Blei and Jordan, 2003) or in quantized form (Barnard et al., 2002).",
        "Despite much progress in image segmentation, there is currently no automatic algorithm that can reliably divide an image into meaningful parts.",
        "Extracting features from small local regions is thus preferable, especially for image collections that are diverse and have low resolution (this is often the case for news images).",
        "In our work we identify local regions using a difference-of-Gaussians point detector (see Figure 1(c)).",
        "This representation is based on descriptors computed over automatically detected image regions.",
        "It provides a much richer (and hopefully more informative) feature space compared to the alternative image representations discussed above.",
        "For example, an image segmentation algorithm, would extract at most 20 regions from the image in Figure 1; uniform grid segmentation yields 143",
        "Figure 1: Image partitioned into regions of varying granularity using (a) the normalized cut image segmentation algorithm, (b) uniform grid segmentation, and (c) the SIFT point detector.",
        "(11 x 13) regions, whereas an average of 240 points (depending on the image content) are detected.",
        "A non-sparse feature representation is critical in our case, since we usually do not have more than one image per document.",
        "We compute local image descriptors using the the Scale Invariant Feature Transform (SIFT) algorithm (Lowe, 1999).",
        "Importantly, SIFT descriptors are designed to be invariant to small shifts in position, changes in illumination, noise, and viewpoint and can be used to perform reliable matching between different views of an object or scene (Mikola-jczyk and Schmid, 2003; Lowe, 1999).",
        "We further quantize the SIFT descriptors using the K-means clustering algorithm to obtain a discrete set of visual terms (visiterms) which form our visual vocabulary VocV .",
        "Each entry in this vocabulary stands for a group of image regions which are similar in content or appearance and assumed to originate from similar objects.",
        "More formally, each image I is expressed in a bag-of-words format vector, [v1,v2,vL], where vi = n only if I has n regions labeled with vi.",
        "Since both images and documents in our corpus are now represented as bags-of-words, and since we assume that the visual and textual modalities express the same content, we can go a step further and represent the document and its associated image as a mixture of verbal and visual words dMix .",
        "We will then learn a topic model on this concatenated representation of visual and textual information.",
        "Latent Dirichlet Allocation (Blei et al., 2003; Griffiths et al., 2007) is a probabilistic model of text generation.",
        "LDA models each document using a mixture over K topics, which are in turn characterized as distributions over words.",
        "The words in the document are generated by repeatedly sampling a topic according to the topic distribution, and selecting a word given the chosen topic.",
        "Under this framework, the problem of meaning representation is expressed as one of statistical inference: given some data – textual and visual words – infer the latent structure from which it was generated.",
        "Word meaning is thus modeled as a probability distribution over a set of latent multimodal topics.",
        "LDA can be represented as a three level hierarchical Bayesian model.",
        "Given a corpus consisting of M documents, the generative process for a document d is as follows.",
        "We first draw the mixing proportion over topics 0d from a Dirichlet prior with parameters a.",
        "Next, for each of the Nd words wdn in document d, a topic zdn is first drawn from a multinomial distribution with parameters 0dn.",
        "The probability of a word token w taking on value i given that topic z = j is parametrized using a matrix ß with bij = p(w = i|z = j).",
        "Integrating out 6d's and zdn's, gives P(D|a, ß), the probability of a corpus (or document collection):",
        "The central computational problem in topic modeling is to compute the posterior distribution P(0, z|w, a, ß) of the hidden variables given a document w = (w1,w2,...,wN).",
        "Although this distribution is intractable in general, a variety of approximate inference algorithms have been proposed in the literature including variational inference which our model adopts.",
        "Blei et al.",
        "(2003) introduce a set of variational parameters, y and <j>, and show that a tight lower bound on the log likelihood of the probability can be found using the following optimization procedure:",
        "Here, D denotes the Kullback-Leibler (KL) divergence between the true posterior and the variational distribution q(0, z|y, <j>) defined as: q(0, z|y, <j>) = q(0|y)nN=1 q(zn|<j>n), where the Dirichlet parameter y and the multinomial parameters (<j)i,..., >N ) are the free variational parameters.",
        "Notice that the optimization of parameters (y*(w), <j>* (w)) is document-specific (whereas a is corpus specific).",
        "Previous applications of LDA (e.g., to document classification or information retrieval) typically make use of the posterior Dirichlet parameters y* ( w) associated with a given document.",
        "We are not so much interested in y as we wish to obtain a semantic representation for a given word across documents.",
        "We therefore train the LDA model sketched above on a corpus of multimodal documents {dMix} consisting of both textual and visual words.",
        "We select the number of topics, K, and apply the LDA algorithm to obtain the ß parameters, where ß represents the probability of a word wi given a topic zj, p(w^zj) = ßij.",
        "The meaning of wi is thus extracted from ß and is a K-element vector, whose components correspond to the probability of wi given each latent topic assumed to have generated the document collection.",
        "The ability to accurately measure the similarity or association between two words is often used as a diagnostic for the psychological validity of semantic representation models.",
        "In the topic model described above, the similarity between two words w1 and w2 can be intuitively measured by the extent to which they share the same topics (Griffiths et al., 2007).",
        "For example, we may use the KL divergence to measure the difference between the distributions p and q:",
        "where p and q are shorthand for P(w1| zj) and P(w2| zj), respectively.",
        "The KL divergence is asymmetric and in many applications, it is preferable to apply a symmetric measure such as the Jensen Shannon (JS) divergence.",
        "The latter measures the \"distance\" between p and q through (p+q), the average of p and q:",
        "An alternative approach to expressing the similarity between two words is proposed in Griffiths et al.",
        "(2007).",
        "The underlying idea is that word association can be expressed as a conditional distribution.",
        "If we have seen word w1, then we can determine the probability that w2 will be also generated by computing P(w2|w1).",
        "Although the LDA generative model allows documents to contain multiple topics, here it is assumed that both w1 and w2 came from a single topic:",
        "where p(z) is uniform, a single topic is sampled from the distribution P(z| w1), and an overall estimate is obtained by averaging over all topics K.",
        "Griffiths et al.",
        "(2007) report results on modeling human association norms using exclusively P(w2 |w1).",
        "We are not aware of any previous work that empirically assesses which measure is best at capturing semantic similarity.",
        "We undertake such an empirical comparison as it is not a priory obvious how similarity is best modeled under a multimodal representation."
      ]
    },
    {
      "heading": "4. Experimental Setup",
      "text": [
        "In this section we discuss our experimental design for assessing the performance of the model presented above.",
        "We give details on our training procedure and parameter estimation and present the baseline method used for comparison with our model.",
        "Data We trained the multimodal topic model on the corpus created in Feng and Lapata (2008).",
        "It contains 3,361 documents that have been downloaded from the BBC News website.",
        "Each document comes with an image that depicts some of its content.",
        "The images are usually 203 pixels wide and 152 pixels high.",
        "The average document length is 133.85 words.",
        "The corpus has 542,414 words in total.",
        "Our experiments used a vocabulary of 6,253 textual words.",
        "These were words that occurred at least five times in the whole corpus, excluding stopwords.",
        "The accompanying images were preprocessed as follows.",
        "We first extracted SIFT features from each image (150 on average) which we subsequently quantized into a discrete set of visual terms using K-means.",
        "As we explain below, we determined an optimal value for K experimentally.",
        "Evaluation Our evaluation experiments compared the multimodal topic model against a standard text-based topic model trained on the same corpus whilst ignoring the images.",
        "Both models were assessed on two related tasks, that have been previously used to evaluate semantic representation models, namely word association and word similarity.",
        "In order to simulate word association, we used the human norms collected by Nelson et al.",
        "(1999).These were established by presenting a large number of participants with a cue word (e.g., rice) and asking them to name an associate word in response (e.g., Chinese, wedding, food, white).",
        "For each word, the norms provide a set of associates and the frequencies with which they were named.",
        "We can thus compute the probability distribution over associates for each cue.",
        "Analogously, we can estimate the degree of similarity between a cue and its associates using our model (and any of the measures in Section 3.3).",
        "And consequently examine (using correlation analysis) the degree of linear relationship between the human cue-associate probabilities and the automatically derived similarity values.",
        "We also report how many times the word with the highest probability under the model was the first associate in the norms.",
        "The norms contain 10,127 unique words in total.",
        "Of these, we created semantic representations for the 3,895 words that appeared in our corpus.",
        "Our word similarity experiment used the Word-Sim353 test collection (Finkelstein et al., 2002) which consists of relatedness judgments for word pairs.",
        "For each pair, a similarity judgment (on a scale of 0 to 10) was elicited from human subjects (e.g., tiger-cat are very similar, whereas delay-racism are not).",
        "The average rating for each pair represents an estimate of the perceived similarity of the two words.",
        "The task varies slightly from word association.",
        "Here, participants are asked",
        "# – • Jensen Shannon Divergence m – H Kullback Leibler Divergence i>(w2lw,.)",
        "^•o'oooooooooöooinvi'nö",
        "vi yi p IJJ (",
        "Number of Image Regions and Topics",
        "Figure 2: Performance of multimodal topic model on predicting word association under varying topics and visual terms (development set).",
        "to rate perceived similarity rather than generate the first word that came into their head in response to a cue word.",
        "The collection contains similarity ratings for 353 word pairs.",
        "Of these, we constructed semantic representations for the 254 that appeared in our corpus.",
        "We also evaluated how well model produced similarities correlate with human ratings.",
        "Throughout this paper we report correlation coefficients using Pearson's r."
      ]
    },
    {
      "heading": "5. Experimental Results",
      "text": [
        "Model Selection The multimodal topic model has several parameters that must be instantiated.",
        "These include the quantization of the image features, the number of topics, the choice of similarity function, and the values for a and ß.",
        "We explored the parameter space on held-out data.",
        "Specifically, we fit the parameters for the word association and similarity models separately using a third of the association norms and WordSim353 similarity judgments, respectively.",
        "As mentioned in Section 3.1 we used K-means to quantize the image features into a discrete set of visual terms.",
        "We varied K from 250 to 2000.",
        "We also varied the number of topics from 25 to 750 for both the multimodal and text-based topic models.",
        "The parameter a was set to 0.1 and ß was initialized randomly.",
        "The model was trained using variational Bayes until convergence of its bound on the likelihood objective.",
        "This took 1,000 iterations.",
        "Figure 2 shows how word association performance varies on the development set with different numbers of topics (t) and visual terms (r) according",
        "Figure 3: Performance of multimodal topic model on predicting word similarity under varying topics and visual terms (development set).",
        "to three similarity measures: KL divergence, JS divergence, and P(w2|wi), the probability of word w2given w1 (see Section 3.3).",
        "Figure 3 shows results on the development set for the word similarity task.",
        "As far as word association is concerned, we obtain best results withP(w2|wi), 750 visual terms and 750 topics (r = 0.188).",
        "On word similarity, JS performs best with 500 visual terms and 25 topics (r = 0.374).",
        "It is not surprising that P(w2|wi) works best for word association.",
        "The measure expresses the associative relations between words as a conditional distribution over potential response words w2 for cue word w1.",
        "A symmetric function is more appropriate for word similarity as the task involves measuring the degree to which to words share some meaning (expressed as topics in our model) rather than whether a word is likely to be generated as a response to another word.",
        "These differences also lead to different parametrizations of the semantic space.",
        "A rich visual term vocabulary (750 terms) is needed for modeling association as broader aspects of word meaning are taken into account, whereas a sparser more focused representation (with 500 visual terms and 25 overall topics) is better at isolating the common semantic content between two words.",
        "We explored the parameter space for the text-based topic model in a similar fashion.",
        "On the word association task the best correlation coefficient was achieved with 750 topics and P(w2|w1) (r = 0.139).",
        "On word similarity, the best results were obtained with 75 topics and the JS divergence (r = 0.309).",
        "Model Comparison Table 2 summarizes our results on the test set using the optimal set of parameters as established on the development set.",
        "The first row shows how well humans agree with each other on the two tasks (UpperBnd).",
        "We estimated the intersubject correlation using leave-one-out re-sampling (Weiss and Kulikowski, 1991).",
        "As can be seen, in all cases the topic model based on textual and visual modalities (MixLDA) outperforms the model relying solely on textual information (TxtLDA).",
        "The differences in performance are statistically significant (p < 0.05) using a t-test (Cohen and Cohen, 1983).",
        "Steyvers and Griffiths (2007) also predict word association using Nelson's norms and a state-of-the-art LDA model.",
        "Although they do not report correlations, they compute how many times the word with the highest probability P(w2|w1 ) under the model was the first associate in the human norms.",
        "Using a considerably larger corpus (37,651 documents), they reach an accuracy of 16.15%.",
        "Our corpus contains 3,361 documents, the MixLDA model performs at 14.15% and the LDA model at 13.16%.",
        "Using a vector-based model trained on the BNC corpus (100M words), Washtell and Markert (2009) report a correlation of 0.167 on the same association data set, whereas our model achieves a correlation of 0.123.",
        "With respect to word similarity, Marton et al.",
        "(2009) report correlations within the range of 0.31-0.54 using different instantiations of a vector-based model trained on the BNC with a vocabulary of 33,000 words.",
        "Our MixLDA model obtains a correlation of 0.318 with a vocabulary five times smaller (6,253 words).",
        "Although these results are not strictly comparable due to the different nature and size of the training data, they give some indication of the quality of our model in the context of other approaches that exploit only the textual modality.",
        "Besides, our intent is not to report the best performance possible,",
        "GAME, CONSOLE, XBOX, SECOND, SONY, WORLD, TIME, JAPAN, JAPANESE, SCHUMACHER, LAP, MICROSOFT, ALONSO, RACE, TITLE, WIN, GAMERS,",
        "LAUNCH, RENAULT, MARKET",
        "PARTY, MINISTER, BLAIR, LABOUR, PRIME, LEADER, GOVERNMENT, TELL, BROW, MP, TONY, SIR, SECRETARY, ELECTION, CONFERENCE, POLICY, NEW, WANT,",
        "PUBLIC, SPEECH",
        "SCHOOL, CHILD, EDUCATION, STUDENT, WORK,",
        "PUPIL, PARENT, TEACHER, GOVERNMENT, YOUNG, SKILL, AGE, NEED, UNIVERS ITY, REPORT, LEVEL, GOOD, HELL, NEW, SURVEY",
        "they tend to appear in images with similar structure (e.g., on tables, in bowls, as being held or eaten by someone) and thus often share some common element of meaning."
      ]
    },
    {
      "heading": "6. Conclusion",
      "text": [
        "In this paper we developed a computational model that unifies visual and linguistic representations of word meaning.",
        "The model learns from natural language corpora paired with images under the assumption that visual terms and words are generated by mixtures of latent topics.",
        "We have shown that a closer correspondence to human data can be obtained by explicitly taking the visual modality into account in comparison to a model that estimates the topic structure solely from the textual modality.",
        "Beyond word similarity and association, the approach is promising for modeling word learning and categorization as well as a wide range of priming studies.",
        "Outwith cognitive science, we hope that some of the work described here might be of relevance to more applied tasks such as thesaurus acquisition, word sense disambiguation, multimodal search, image retrieval, and summarization.",
        "Future improvements include developing a non-parametric version that jointly learns how many visual terms and topics are optimal.",
        "Currently, the size of the visual vocabulary and the number of topics are parameters in the model, that must be tuned separately for different tasks and corpora.",
        "Another extension concerns the creation of visual terms.",
        "Our model assumes that an image is a bag of words.",
        "The assumption is convenient for modeling purposes, but clearly false in the context of visual processing.",
        "Image descriptors found closely to each other are likely to represent the same object and should form one term rather than several distinct ones (Wang and Grimson, 2007).",
        "Taking the spatial structure among visual words into account would yield better topics and overall better semantic representations.",
        "Analogously, we could represent documents by their syntactic structure (Boyd-Graber and Blei, 2009)."
      ]
    }
  ]
}
